{
    "The Saturday healthcare mega thread": {
        "title": "The Saturday healthcare mega thread",
        "score": 3,
        "url": "https://www.reddit.com/r/bjj/comments/1dlqm6d/the_saturday_healthcare_mega_thread/",
        "content": "Loads of people post medical-related questions here on r/bjj.  This is your chance to have them answered by a qualified professional! Feel free to ask about injuries, skin issues, and other medical matters related to BJJ.  \n\nIn this thread **ANYONE CAN POST A TOP-LEVEL QUESTION, BUT ONLY APPROVED PROVIDERS CAN REPLY.**  \n\n[List of Providers](https://docs.google.com/spreadsheets/d/1Fc6wwTSAqLNCjMGqINPA8_439lk74qQKqWJDJJwsFvk/edit?resourcekey#gid=672629939) |  [Become a Provider](https://docs.google.com/forms/d/e/1FAIpQLScOzVtSfZ94YH-XgtJgVeJCdDNZz_xH4xaP7zHP-q4956VIQg/viewform)\n\nRules of engagement:\n\n1. Top level comments are for questions!\n2. Only verified providers [from this list](https://docs.google.com/spreadsheets/d/1Fc6wwTSAqLNCjMGqINPA8_439lk74qQKqWJDJJwsFvk/edit?resourcekey#gid=672629939) can answer questions. All other answers will be removed. **Note that we have providers from various disciplines now!**\n3. Providers aren't required to answer fully to your satisfaction - they may just tell you to seek medical help or talk to them in a paid session. That's their right.\n4. Maybe don't post pics of body part. Or do. I don't know.\n\nGood luck to all of us!",
        "num_comments": 0,
        "comments": []
    },
    "ADCC/CJI Megathread #7: All your news are belong to us. \"New player joined\" and drama get their own threads. General news, questions, and speculation go here.": {
        "title": "ADCC/CJI Megathread #7: All your news are belong to us. \"New player joined\" and drama get their own threads. General news, questions, and speculation go here.",
        "score": 0,
        "url": "https://www.reddit.com/r/bjj/comments/1dhy4d6/adcccji_megathread_7_all_your_news_are_belong_to/",
        "content": "",
        "num_comments": 95,
        "comments": [
            "What’s the point of the megathread? Would it really be such a bad thing for the subreddit to have more threads to look at about CJI?",
            "https://preview.redd.it/47mdr6m3177d1.jpeg?width=1290&format=pjpg&auto=webp&s=6200d2f34457843aba35bab937eef4185b7adb12",
            "Mackenzie Dern vs Ffion Davies is official",
            "Still hoping to see /u/december6 commentating!",
            "Tickets to both ADCC and CJI secured. Living the American Dream.",
            "Tickets on sale guys \n\n  \n[https://www.unlvtickets.com/eventInfo/spe/860/craig-jones-invitational/](https://www.unlvtickets.com/eventInfo/spe/860/craig-jones-invitational/)",
            "\"New player joined\" and drama are like 99% of CJI/ADCC news.",
            "This is where Mica leaves his dead beat dad and defects. \n\nNicky Ryan 2.0",
            "I hate the mega threads…… literally the pinnacle of the sport over this drama and the mega threads are killing the buzz.",
            "I’m with these guys. Stop killing the threads. Let it ride. It’s good for biz.",
            "New player ge their own threads. Eight threads on the ruotolo lol",
            "-80kg the most exciting line up ever for a grappling event?",
            "all adcc needs now is for Nickys brother to have a tummy ache near event time",
            "Per Craig's story, 1 hour til another announcement (11 AM PT, 2 PM ET)",
            "Kade Ruotolo On Why He Chose Craig Jones Invitational Over ADCC, Plans For MMA Future | The MMA Hour\n\n[https://www.youtube.com/watch?v=BQyBU3nN1TE](https://www.youtube.com/watch?v=BQyBU3nN1TE)",
            "The megathreads don't even fucking make sense, you keep making a new one every 3 days and they don't even become \"mega\" even with the number of comments being left\n\nLike what the fuck is this nonsense",
            "This place has been nice to visit for the ADCC/CJI stuff over the weekend with minimal mega threads. Please stop stifling discussion when you don’t have to. We as a user base will get tired of it and move on. It’s the biggest news in BJJ in like 10 years so it is generating content and traffic to this place. Just let it be damn.\n\nNew Player Joined is a good call though :)",
            "Any rumours out there on incredible fighters to join CJI? On JRE Craig mentioned some potential old legends of the sport that was cut-off (Rogan asking \"is he still training?\").",
            "It feels like there's a weird urge to enact change or take action, even when the clear path forward is to refrain from doing so. This subreddit is the most exciting it's been in ages, and the desire to somehow hamper that excitement seems very strange and counterproductive.",
            "I dont follow bjj but enjoying the drama. Did CJI end up getting the top talent in the end or not? I have no idea what all the announcements really mean. \n\nCan some fill me in?",
            "Still hoping for the return of Palhares",
            "https://unlvtickets.evenue.net/events/CJ?RSRC=&RDAT=EVENTPAGE_2024&utm_source=UNLVTICKETS&utm_medium=WEBSITE&utm_campaign=_EVENTPAGE_2024&_gl=1*1jy1m6o*_ga*MTU0NDkwMTAzMi4xNzE4OTE5NjEx*_ga_PG27T65PJD*MTcxODkxOTYxMS4xLjAuMTcxODkxOTYxMS42MC4wLjA.\n\n\nA lot of seats. For cji",
            "Tickets supposedly going on sale in 2 hours per Craig’s IG. Anyone found details anywhere else?",
            "You have to admire a 2+ day old megathread with 51 comments about one of the greatest seismic shocks to hit the sport.\n\nI feel its some transference from BJJ matches, where they turn into watching officials bring dudes in from out of bounds hundreds of times and never issue a stalling warning: these rules and interventions are necessary or excitement might ensue.",
            "Forget mica, CJI needs Tainin. \n\nMica has more eyes on him but Tainin is vastly superior. After seeing him last night, he runs through everyone!",
            "Bo Nickel seems to be in, Craig advertises [shuffle.com](http://shuffle.com) where he is listed -80",
            "How do we feel about the announced +80kg/-80kg roster ?",
            "Tickets look to be moving kinda slow I wonder if it'll end up being sold out. i think routolo signing will change this",
            "U/johnbelushismom now that Hywell Teague has committed to announcing, can you offer him a performance bonus if he commits to releasing the damn Red Belts documentary during the CJI broadcast?",
            "[deleted]",
            "After yesterday is it possible Josh would go with CJI?",
            "Since nobody. including the entire B-team, can say CJI (Craig Jones Invitational) reliably, I'd like to recommend that there be an official secondary name of CGI (Craig's Gonzo Insurrection).",
            "Anyone know if they are offering applications for a media pass for CJI???",
            "Dang. These tix are too much for me on top of the expenditures sunk into ADCC already. Was hoping for a bargain. Guess I'll need to settle for streaming the event on youtube from T-Mobile Arena.",
            "I just saw a thread that was asking why Craig wasn't competing.... *at his own event*\n\nSo yeah, megathread is a good idea imo",
            "u/johnbelushismom you done good",
            "I assume for the +80kg as it's big?",
            "That's how you get audience for female sports, by getting two talented athletes.",
            "Yes!! Yes please!",
            "…they just announced hywell Teague and Brandon mccagrahan. Heard from a very reliable source they approached one of the ADCC announcers but got turned down.",
            "If Tainin joined CJI, mica’s presence or lack thereof would be overshadowed.",
            "Imagine not being paid to do any of this on top of that. Cringe as hell.",
            "Hey there, I understand your frustration with the mega threads taking away from the excitement of the sport. Feel free to keep engaging in discussions and sharing your thoughts in this thread outside of the drama. Your contribution is valuable to the community!",
            "Absolutely, keeping the threads focused and organized allows for better engagement and discussion within the community. Letting the conversation flow naturally is essential for a healthy and thriving community like ours. Cheers!",
            "Have you heard any rumors of big gets in either direction you feel like breaking Bmac?",
            "AND reddit didn't catch on fire. Looks like it can handle it.",
            "At the state ADCC is in, Nicky Ryan's brother will have to fight with full blown diarrhea.",
            "Bro imagine.",
            "Both Ruotolos joining -80kg!!",
            "ADCC deep state mods",
            "Moderated by people who don’t actually follow the sport unfortunately",
            "Dammit Rogan!",
            "I'd say CJI got the majority of the talent but not all of the very elite competitors. \n\nAll of the lowest weight elite guys stayed in ADCC due to the absolute nature of CJI. \n\nAlso most of the very best stayed in ADCC - Mica, Kade, Kaynan (likely), Meregali, Bodoni, and Nicky Ryan's brother. \n\nCJI also got the best current no gi lady with Ffion. \n\nThere's more cji spots left and it will be interesting to see if other ADCC favorites like JT, PJ Barch, or Kaynan make the switch.",
            "UNLV/Thomas and Mack website",
            "Idk by I’m gonna try in 16 minutes.",
            "Tainan better than Mica in no gi? I’m not so sure. Still would be sick to see him do CJI.",
            "I would love to see Tainan enter either tournament. But to be honest I was kind of shocked he took the Jay Rod fight. He’s definitely still developing as a no gi fighter and I get the sense that he and AOJ are holding back until the time is right. This ADCC/CJI split could be the impetus for him to join one of those tournaments, but I had kind of considered him to not be a real threat until 2026 ADCC.",
            "I kinda wonder about this b/c he's actively on the UFC roster. A knee injury or something would be bad.",
            "So Bo can weigh 175lbs ?",
            "+ is a little lacking but that's just most combat sports. - is absolutely stacked, might be one of the best divisions ever. if Buchecha or Roger shows up for + then i think it takes it over the top.  i don't think that's likely but $1,000,000 is a lot of zeroes even for people who live comfortably",
            "Really? The international website crashed because too many people tried to get on to the servers, so not sure where you’re getting that from",
            "I posted the Kade interview below in which he stated that their manager put a clause in their One contracte that Mikey doesn't have.",
            "too big of a GR fanboy to do that",
            "50 bucks for a 2 day event is a pretty big bargain.  Once you're inside, go watch from wherever you want.",
            "So I guess the mega thread being here didn't stop the need to moderate new threads.... So what's the point of it again?",
            "It’s probably mo behind the scenes. Wants to kill cji so confines the news to stupid bullshit megathreads. \n\nI love that they put “ADCC/CJI” as if ADCC has any news aside from the occasional death threat",
            "Man, honestly… I got nothing right now.",
            "Khabib and Mighty Mouse LFG. Wouldn't that be wild",
            "lol that is crazy, is cji more stacked than adcc now ? at least they have, in my humble white belt opinion, more marketable guys",
            "Hmm interesting... that doesn't sound like much of a win to me on CJI side?",
            "No doubt it would be a tough match, but Tainin is better",
            "What I don't get is why they're holding him back. It's not like Tainan still has perfect record at black belt anymore, he lost at Worlds this year too. Nobody really expects him to be as good as he is in the Gi. So why are they holding him back and waste a huge opportunity like ADCC and CJI?",
            "I mean even if he got injured it's hard to imagine him getting derailed by the can-adjacents they are throwing at him",
            "Wow I didn't even think of Roger showing up. That would be all time. Craig claims to have some pretty big last minute add-ons. Curious who he signed",
            "just from watching the seats left",
            "i see thanks.",
            "Seriously if you can't afford $50 you shouldn't go to vegas",
            "I mean, threads always need to be moderated regardless of there being a megathread or not. The megathread being there means posts like the one I described would just get deleted and told to post in the megathread.",
            "You underestimate the ego of a few people with low self-esteems.\n\nGive a few idiots imaginary powers to moderate forums on a website and in exchange the owners make money hand over fist off their sweaty beards. Also off of selling our data which includes them too lmao.",
            "![gif](giphy|S5n7Wkhhw5A2IrfKER|downsized)",
            "I think it is overall. -66kg is the only division that’s still intact/really interesting at ADCC right now because those guys are too small to make the jump to -80kg and win",
            "I disagree.  ADCC has already made some changes so it's hard to say it's not having an effect and that's without the brackets being settled. \n\nIt delegitimizes anyone winning a bracket that's above 77kg.\n\nAlso has exposed some preferential treatment between certain teams, ADCC, and Flo.",
            "There's definitely been an impact to the 77 and -99/+99 divisions. \n\nNickyRod and Victor Hugo are two huge favorites for +99 so that ADCC division is significantly less interesting and still isn't full.\n\n  \nFor -77, while the 2022 top 4 still remain, a lot of interesting up and comers (Jozef, Andrew Tackett) did drop out so super fights post-ADCC and CJI will be important to help legitimize who the best is.\n\n\n\nMost importantly, ADCC is paying all athletes a little bit of show money now and women are getting paid the same amount as men.",
            "Rumor I heard is that the OneFC guys appear to be unable to do CJI because One contracts allow ADCC competition, but not other tourneys.\n\nThe New Wave Bjj guys literally wouldn't do it for a million dollars.\n\nWhen you subtract those two elite groups out,  CJI participation rate is pretty impressive as far as I know (not far), and the fact its already caused changes means its already working.",
            "In no go, Tainan still has work to do. In gi, Mica is one of Tainan’s very few losses. Would love to see a rematch one day.",
            "khabib lol",
            "Khabib vs GSP superfight?\n\nSakuraba vs Marcello superfight?\n\nEither would make me cry golden tears",
            "I’m hoping Tainin joins the -80!",
            "Who would downvote this objectively correct statement?",
            "I'm not assuming it's a free for all inside there. Decent ground level tickets are $300 a piece. I paid around that for good seats at ADCC and it's just not in the budget to double down on such an amount right now. Also, would rather stick to ADCC and see grappling closer up than sit way up in nosebleeds at CJI for $50 just to say I was there.",
            "\"I mean, threads always need to be moderated regardless of there being a megathread or not.\"\n\nBOOM. You get it. Just delete the shitposts like normal.",
            "Well. Let’s follow Craig’s lead and CJI this bitch haha",
            "khabib gsp would cement CJI instantaneously as #1 promotion",
            "the upper level is actually a decent view at the mack",
            "Truth Social sub-truths that are only BJJ forums"
        ]
    },
    "Jozef Chen pass to Mount": {
        "title": "Jozef Chen pass to Mount",
        "score": 142,
        "url": "https://v.redd.it/t8cid2bmu38d1",
        "content": "",
        "num_comments": 18,
        "comments": [
            "1. Underhook\n\n2. Post head \n\n3. Magic?\n\n4. Mount",
            "A detail I noticed before he got his underhook in this sequence shown is that he actually overhooked the left arm , this kills a lot of power from the bottom player to frame away .\n\n\nWhen Dorsey then extended to get rid of the overhook , chen for the underhook that led to the tripod passing sequence ",
            "Joseph Chen should release an instructional called “f*ck yo guard: basics”. I’d buy it",
            "tripod float passing needs to be banned or nerfed in comp queuing tbh",
            "Does he go body lock to double underhook to float passing?",
            "Get to the head and worry about the legs later.",
            "For my fellow big dudes, this works extremely well against those bowling ball shaped leg lockers. \n\nAlthough against the smaller guys it’s tough to get a knee inside the hip. You gotta really smash the shit out of their head/shoulders and if they wise up to the game it just becomes a fight for the underhook forever (as usual).",
            "why is elijah's butterfly hook not effective in creating space in this case? is it bc of jozef's shoulder pressure and head post?",
            "He's so good (x4)",
            "Does this pass work for us mere mortals? From inside someone’s closed guard? Someone please teach me how to attempt.i hate standing up to open closed guard.",
            "This Instagram video explains it a bit\n\nhttps://www.instagram.com/reel/C8fM91Zp7yu/?igsh=eWVrOHZoa20xdDNy",
            "Posting head on the mat? Thats a DQ.",
            "Why? ",
            "Usually: nearside underhook> head to floor on the far side> leg pommeling until passed",
            "Yes this pass works. Even for normal people. \n\nBut it’s an open guard float pass. (Other player has a butterfly hook). So you can’t do this from inside someone’s closed guard. \n\nFrom inside closed guard, you can tripod up and maintain your balance to force the person to open their guard (pinning their upper body and then after you are up on your feet, moving your hands to pressure their hips down). But you have to be defending against various sweeps as they transition. \n\nThat’s usually done instead of more traditional closed guard passing.",
            "not homoerotic enough",
            "Because it's fking disgusting",
            "Nice makes it look easy 🥶"
        ]
    },
    "Josef Chen is the best 😂": {
        "title": "Josef Chen is the best 😂",
        "score": 1132,
        "url": "https://v.redd.it/jvy8nmkhgx7d1",
        "content": "",
        "num_comments": 120,
        "comments": [
            "Flo should write Jozef a thank you card for not putting them in blast",
            "The dude is an angel. I was lucky enough to meet and interview him at Polaris straight after a loss and he was super upbeat, animated and keen to discuss stuff even after taking a loss. Such a cool dude to have, hopefully will be in the sport for a long long time setting an awesome example.",
            "He handled that perfectly. Good job.",
            "lol super nice and polite guy",
            "The head shake 🤣",
            "CGI: Craig Gones Invitational",
            "Josef, such a professional at a young age, handled that better than some people would .",
            "A professional commentator not bothering to know which athletes have left the event affiliated with her broadcast platform during the biggest athlete movement in recent memory… is there anything more FloGrappling than that",
            "Really nice way of correcting the interviewer. Respect.",
            "For those shitting on Kendall yes it was a flub, not an uncommon thing in live television. I've always been amazed how composed she is for someone who to my awareness has no media training. Jozef is so nice he wasn't going to lie by omission or stir the pot too much. Now the ring announcer who's voice cracked multiple times and asked the crowd if we were \"ready for meat and potatoes?!?\" yeah he can definitely be canned.",
            "His faces when she was asking him about adcc are hilarious. \n\nAlso idk if I was hyper fixated on it but I thought they were really pushing and promoting adcc more than usual with no mention of cji until this interview.",
            "Flow was going hard to promote ADCC because they are going to take a major loss on it now with CJI. As well they should. But yea they were being extra heavy in promoting it but they just did it in the worst ways.\n\nBad announcing, giving Meregali a mic is a bad idea in general and they decided to do it right after dating a child fiasco lol. \n\nThe whole thing is just amazing it's like they want to give Craig unlimited ammunition.",
            "Awkward as fuck and honestly super embarrassing.  Ignoring CJI isn’t going to make it magically disappear.",
            "literally everybody in jiujitsu: *talking about CJI*\n\nflograppling: “so anyway, about ADCC”",
            "She slows down her speech a second or two after using ADCC as framing for her question, I assume it’s because she realized she slipped up as she was conducting the interview. \n\nI am certain she is aware of developments in the professional BJJ scene — she is a competitor and interviewer, not some bargain-bin outsider with a county college semester of media training. \n\nI also don’t think it was an intentional slight, but it wouldn’t surprise me if in a pre-event meeting the media team was told to characterize the WNO event as a lead-up to the ADCC, so her questions were focused on getting to that point. She knew Josef won trials and qualified and she wanted to get to hype the ADCC and forgot in that moment that Chen was competing in CJI. \n\nJosef Chen was a class act with his response. Seems like a good person in addition to a great competitor. \n\nSo yeah, she slipped up, probably nothing more nefarious than that. It happens all the time. I’ve heard some of you mongoloids speak on the mats, and a lot of you are unable to recall step 2 of a 3-part technique — we should offer her some grace.",
            "Jozef***",
            "Ah yes… yes… indubitably.",
            "CGI",
            "\"Fuck researching the athletes, let's just wing it\"\n\n*- Kendall Reusing (probably)*",
            "So I’m watching this from last night and all the commentators and interviews were such a hard push for ADCC. Flo seems desperate IMO 🤣\n\nImagine a drinking game every time they said ADCC.",
            "Out of the box question : his shirt is awesome !  \nWhat is this shirt ?",
            "He's so cute \n\nuwu",
            "Maybe the interviewer made a mistake maybe she’s been asked not to mention CJI. Either way my dude handled the question well",
            "i feel he is both my little brother and my big brother i never had.",
            "What Rashgaurd is that",
            "Jozef Chen is way nicer than he needs to be. Had the pleasure of talking with him during training at bteam multiple times. He is a fellow big public transit fan as I lived in Asia for a long time. \n\nMight be one of the few truly good people in our sport.",
            "Such awesome dude",
            "u/savevideo",
            "Jo*Z*ef",
            "Can someone give some context please",
            "A silent goat.🐐",
            "lol",
            "God I have such a crush on Jozef",
            "You can’t help but love Jozef Chen",
            "Chen vs pato is the match I want to see",
            "This dude is 19 and already more polished than most C-Suite execs.  Total package here ladies and gents!",
            "This guy's Very good",
            "He’s 100% such a nice guy. Spent a week with him in Thailand.",
            "How did she not know this?",
            "lol omg he’s so soft spoken",
            "You can see the moment she realizes. But it's too late.\n\nFucking beautiful 😆.",
            "what a dude...super nice and respectful",
            "Flo: friendship ended with Kendall.",
            "looks like the only top guy not juiced up on roids",
            "Chen behaving like a  respectable, normal person gas people going gaga over how great he is. Just shows how low the expectations are when it comes to bjj athletes.",
            "She is so fine",
            "Poor girl, does she live under a rock?",
            "JC seems like the type of guy to think of his losses as another data point to analyze to help him get better.",
            "He's probably the coolest guy in the sport. He's so smart, he has so much innovative ways to improve that you can sorta copy and he's also a super nice guy from interactions I've had with him\n\nI wish he'd make some instructionals or something I really want to see his perspective on some of his main techniques",
            "https://i.redd.it/9880ffkixy7d1.gif\n\nWhen the wrestler asks you to roll...and start standing.",
            "And the little eyebrow raise immediately after lol",
            "You can see the moment she realised.. \"oh fuck\" 😂",
            "Hilarious that pretty much nobody on the B-team can use the \"J\" reliably other than Craig, who apparently hasn't taken enough drugs yet to forget his own name.",
            "Don't you see? The whole tournament will be computer generated. It's an ad for Craig's new film company.",
            "Craig Groins Invitational\nCraig Gonads Invitational\n\nJust spitballin’ here",
            "Craig should title next year's event \"CJI 2: CGI: You Win, You Ignorant Bastards\"",
            "Oh she knew. Flo was pretty deliberate last night.",
            "She's clearly on orders to reference ADCC as much as possible, and that's all she was doing.",
            "I kept getting ads for this girl’s “mentorship” and “mindset” coaching, so I checked out her socials. She was posting from a Gracie Barra leadership inspiration summit, lol.",
            "Eh, from everything I've seen, Kendall knows her shit (and is a world class competitor in her own right).  I imagine she just made an error. Good of Jozef to give such a professional response; it was clear from the whole broadcast the commentators were avoiding CJI talk pretty aggressively.",
            "Oh she knows lol.",
            "Calling her a \"professional\" is a stretch in my opinion. She is/was an amazing athlete but her interviews are all awful. She only got the interviewer role because of her grappling background, not necessarily because she was a good interviewer.\n\n\nI'm sure she gets paid to do this, so in that sense she's a professional.",
            "It could be that she doesn't know. On the other hand I expect that flow does not want to give a nod to a competitor like that. ",
            "She should’ve just avoided the question entirely which is why I suspect her brain just blanked on the fact that JC had left ADCC. But yeah, in the scheme of live tv fluffs it’s super minor and JC dealt with it professionally.",
            "Yeah, Kendall's a great commentator and a good interviewer. It's live tv. Stuff happens.",
            "Yeah I actually think Kendall is a pretty good commentator, especially for someone who's an actual competitor and not a media person specifically trained just for commentary. She usually has some fun analysis, she's charismatic, knows when to talk and when not to... I can forgive a flub here and there ha\n\nIf you wanna watch some bad sports commentary, tune into noon college football games in mid-major conferences. Networks really bring out the JV commentary squad for the Arkansas State vs Southern Miss matchup",
            "WNO is a big stew. Gordon Ryan is like the nuts and the rest of the athletes are potatoes. Understand, B?",
            "Yeah, I think she is great. She looks great, nice voice tone, knows what she is talking about… A+",
            "I’m on the conspiracy side of things where I don’t think it was a flub and more so orders from higher up. She gives a smile of acknowledgement as soon as he starts shaking his head no like yeah it’s uncomfortable for me too. ",
            "Adcc is on flo, so they want to promote their own events. She isn’t a journalist.",
            "Wait? What?  I missed the child dating! What is this?",
            "18 is not a child",
            "Especially when it happens again next year and is even bigger!",
            "It's especially funny when you realize that Dorsey is the only one staying in ADCC and the other trial winners who beat him are in CJI",
            "Al Leone",
            "Al Leone, I believe.",
            "Well he seems like one of the few \"normal\" people in the sport so that must make him stand out a bit more",
            "No she has an employer who paid a lot of money to show ADCC on their platform lol",
            "He said to me straight after that he felt so much better now it was over, he was stressed and anxious and once it ended he felt like he could go back and analyze it and get better. Such a mature and cool way to look at it",
            "He EMBODIES \"don't get frustrated, get fascinated\".",
            "JC stands for Jeebus Christ. Coincidence? I think NOT",
            "He has a patreon, one of the better bjj ones I think. Posts all his seminars, short clips and a very interactive channel where you can ask questions",
            "I'm pretty sure he does have some, but they're on a different site (not bjj fanatics). He mentioned it in a B Team video last week about the prep for WNO. Can't remember what the site is though.",
            "He does have instructionals on bjj fanatics",
            "Craig said he called it CGI a few times too, especially in the beginning",
            "Craig said he called it CGI a few times too, especially in the beginning",
            "Craig’s Gay Invitational",
            "I laughed when they brought out the guy in the flo t-shirt. He was supposed to plug ADCC for 2 minutes, but the only thing he could get out was ADCC wow then ADCC how awesome right? Again and again about 20 times and then left the broadcast in a total of 2 minutes.",
            "Yes this was obviously part of her contract not to mention CJI. In the press conference she kept saying \"events later this summer\". This isn't ignorance, they just don't want to give free advertising to their competition.",
            "I think she just worded her question poorly as well, trying to talk about them both being ADCC trials winners.\nLet’s be fair, she ain’t the greatest of interviewers.",
            "😳",
            "She called a veteran buddy of mine “unloyal” to his face when he left for another gym.",
            "Gracie Barra might have a lot of fluff, but they also have a ton of top class athletes and instructors including Kendall.       \n\nI bet a ton of her followers/audience aren’t primarily there for BJJ.",
            "> I kept getting ads for this ~~girl’s~~ 2x IBJJF no-gi world champion's “mentorship” and “mindset” coaching …\n\nFixed it for you.",
            "Hard hard disagree with you. She is a very capable commentator and has done a solid job interviewing folks. Forgive her one gaff.",
            "I think Kendalls great... she's very clearly learning on the job but I would rather her than some faceless Megan Olivi type",
            "Flograppling thinks they have their own Doris Burke lol",
            "You don’t think she knew about CJI? Cmon lol…",
            "She knew and she realized and posted about it on instagram, embarassed, shortly after.",
            "Im putting down what your picking up bapa. All gas, no brakes B.",
            "He posted a picture with his girlfriend for her 19th birthday.  Then people saw he was like her pictures from when she was like 15 or 16 lol then he did an IG live to defend it and it just got even worse. Gordon tried to defend and it got even worse. \n\nIt was kinda just shown in the latest road to CJI video on the B-team YouTube check that out lol.\n\nIt was just a stupid move by flow. They have no self awareness of what is actually going on in the BJJ community.",
            "With the implications of him to have been talking to her since she was 15 yea that would be a child to most people. Is that true idk but the point is. It was just a bad time for flow to throw him on the Mic lol.",
            "Anyone know if they are good quality? Like some of the designs they have",
            "I've never heard that before but I like it",
            "![gif](giphy|sEms56zTGDx96)",
            "Anyone put him in a crucifix yet?",
            "She also doesn't ask open ended questions and it drives me crazy. They athletes always expand on the question but it still just seems forced on her part. \n\n\"Were you ready for this fight since you took it short notice?\"\n\nFucking terrible.\n\n\"This fight was short notice for you, tell us about your prep leading up to it\"",
            "I’m sure they have lots of talented people. But their culture is obviously looking for students to venerate the org (bowing and calling people silly titles), all while trying to milk them for absolutely as much money as possible.",
            "I think she's a great commentator and the talent pool for that role isn't particularly deep, so she's actually one of the best options out there IMO.\n\n\nShe's still learning to do the interviewer role and yes, she isn't as good as an actual presenter, but compared to most BJJ-adjacent people she's decent. \n\n\nI also would much rather see a role like this go to an actual competitor learning on the job as opposed to someone with no background in the sport or knowledge of it.\n\n\nKendall can and most likely will get better at this (she already has since her first outing IMO) but some rando presenter is never going to actual give a fuck about the sport, or do more than cursory research on it. ",
            "She speaks well and is articulate, obviously knows the sport. Needs to rephrase questions and make them more open ended. They are too leading. \n\nTell me about your prep leading up to this fight. Any challenges? \n\nVs \n\nWere you ready for this fight since it was short notice?",
            "Talm bout speed B, trugg goes fast.",
            "Wow. She looks older than 19. Ngl",
            "[https://www.youtube.com/watch?v=BiNQeGRwA\\_Q](https://www.youtube.com/watch?v=BiNQeGRwA_Q)\n\nMeregali move to Austin in 2022 do you think he was liking her pictures from Brazil?",
            "100%.  So frustrating when interviewers fail at this simple concept.  All you have to do is *not* ask a yes or no question!  \n\n>They athletes always expand on the question but it still just seems forced on her part. \n\nOne of these days, someone should call out her terrible questions by just literally answering them in the most deadpan way.  Yes.  No.  No.  Yes.  Walk off.",
            "This comment has been flagged \"dangerous\" by the Red Shield Protection Committee. A reeducation professional has been send to teach this individual \"Gracie Barra Ethics\"",
            "Gordon Ryan isn't affiliated with Gracie Barra, but [he's got something similar to sell you](https://bjjfanatics.com/collections/instructional-videos/products/the-sport-of-kings-high-performance-mindset-for-grappling-by-gordon-ryan).",
            "Alcohol and the Texas sun will age a white person fast",
            "Never let reality get in the way a good story. Especially if you’re a nobody who is trying to drag down people who are famous just because you’re jealous.",
            "I have been told white Canadians in Arizona (quite a lot of them there) tend to  stay inside for most of the day and only venture out at night  because of the intense heat and sun.\nThe legal drinking age in America is 21 though, right?",
            "Yeah its 21, but theres lots of kids who drink before then"
        ]
    },
    "Gordon Ryan x Josh Saunders Heelhook": {
        "title": "Gordon Ryan x Josh Saunders Heelhook",
        "score": 239,
        "url": "https://v.redd.it/9qsuw4lzzy7d1",
        "content": "",
        "num_comments": 90,
        "comments": [
            "I wish my training partners in the gym applied submissions as gently as Gordon does in comp.",
            "If this was that fat kid with the long hair Josh wouldn’t have had a functioning knee for a year at least",
            "Hate the man, love the man, like him or not, he is the best. His Jiu Jitsu is incredible. The skill and calmness is insane. As a competitor, he’s everything you want, unbelievably skilled and never wrenches or aims to hurt an opponent. Wish his ‘persona’ was different but guess it is what it is.",
            "Love seeing control and not ripping heel hooks. This is what bjj is about.",
            "Face I make right before I finish the food but I'm already full",
            "I would love to know what his top pressure and breaking mechanics feel like. \n\nWe’ve all seen Bernardo’s reaction at BJJ Fanatics but he does tend to over do it. But seeing how much control he had over Josh’s legs/movement given his size/strength was super impressive",
            "Gordon was looking for that outside heel hook transition from cross ashi the entire match. Has there been a widespread change in thought from “cross ashi for inside heel hooks” and “outside ashi for outside heel hooks” recently?",
            "To be fair he became a brown belt in 23 months",
            "Good win for Nicky Ryan's father's first son",
            "Heel Hooks are boring.  Clearly, Josh agrees.",
            "I really can't tell if Josh is fully understood that he's fucked from the beginning, or if he was trying to figure out where he was, or if Gordon just had full control from that point and was just looking for the final few steps.",
            "Any relation to Nicky Ryan?",
            "I mean god damn is he good.",
            "Wow, I didn't know Nicky Ryan's brother was good at jiujitsu too. ",
            "Josh's defense is incredible here",
            "Dude I can’t believe how good Nicky Ryan’s brother got",
            "Dude looks like he’s drilling. Just complete control",
            "These fuckin white belts spazzing and cranking the subs because they’re exhausted and see something. I’ve had two guys get frustrated, catch me grab an arm and crank. I sometimes don’t even get a chance to tap I gotta yell tap. \nI’ll try to say something next time, and will try to resist the crank at the same time, like a typical dumbass I relaxed and waited for a bit of tension to tap, then boom too late. ",
            "i don't even do bjj and i hate that kid",
            "But that fat kid wouldn't have beaten Josh",
            "Man screw that guy",
            "As a fat man myself, i admire that kid's ability to invert and stuff.  But I fucking hate that kid's way he compete.  What kind of parents/coach he has!",
            "Name?",
            "But Josh would murder that fat kid",
            "I agree with this take right here. on the mat, he is extremely professional.",
            "Dude is an absolutely class act WHILE doing jiujitsu but is a massive ass while NOT doing jiujitsu.",
            "Maybe they can put Nicky Ryan’s brother in cryo-stasis in between missions, like the winter soldier.\n\nThat would solve for the off the mat stuff.",
            "I do not hate his persona. He's cocky but backs it up.  He is the best in the world. That is something.",
            "But so boring to watch.",
            "Underrated",
            "I train at Renzo’s (I’ve never rolled with Gordon). One of our black belts told me when he used to train with Gordon the only thing he could move voluntarily was his eyes. He’s likened him to a mind reading boa constrictor",
            "Didn't he sub a top level guy with top pressure alone?",
            "Inside heel hooks are definitely the strongest, that's just fundamental leg structure. Maybe the switch because everyone's hyper aware of defending them?",
            "I can answer this pretty easily:\n\nCross ashi is a positional attack mostly, you use it to pin the opponent, sweep him if need and setup a pass or a back take. All of these work because the opponent NEEDS to hide his heel the best he can. Catching up the heel in cross ashi is quite hard on good guys (the very well known principle of \"hiding the heel in the same rotational direction they use to escape the entanglement).  We can use tricks to help with catching the heel (I am super partial to shoelace ashi mysef to slow down the rotational escape) but it's still hard. A good way to get the heel is to switch to 50/50 variations and another one, which has been brillantly used by Taylor Pearman at his trial (but also more or less Gordon himself against his nickrod ADCC finals) is to use the heel hiding movement from cross ashi to transfer the leg to the outside for an outside heelhook from inside ashi. From there you can break the leg but you can also, if you somehow miss, follow the rotation to land in outside ashi just like in a \"classical DDS reap exposure\". \n\nSo yeah the leglock meta is basically getting to cross ashi, transfert the leg to the outside and finish it there.",
            "And insufferable in less time",
            "he is a very mature brown belt, he has an older sister",
            "Indeed. I’m sure Nicky Ryan’s uncle’s sister is incredibly proud and should be; Nicky Ryan’s great grandpa’s grand daughter’s first born son put on an absolute clinic.",
            "Honestly, as a hobbyist, I don't mind blocking heel hooks out of my game completely, also tapping to someone applying them to me in a roll and move on to the next roll.\nTo me even though they are effective they are super boring",
            "Think it’s his cousin",
            "I believe this guy is Nicky Ryan's less cool older brother",
            "Miesha was right, he is a good up and comer",
            "I feel like a part of it is that the opponents don’t really care lol they know they are gonna lose. Saunders looked like he wasn’t even trying lol you could tell Gordon was waiting expecting him to thrash or try to free the leg because he was in a bad spot but he just chilled so Gordon was like “oh ok I guess Il end it now, I was hoping to put on a show but now a good time I guess”",
            "I know right? 😂",
            "Why are you here lol",
            "Test",
            "Pat shahgholi",
            "It’s because he respects his opponents usually. He knows he has it and so does Saunders, no point to crank it up",
            "His level of confidence and control to be so chill in those spots is impressive.",
            "Do you care about him outside of jiujitsu though? I mean unless he's legit a criminal or something lol",
            "What would his haters have to live for, then? ",
            "I really dislike his persona. Cocky is fine. The constant victim mentality and hot takes on random bs is silly. Don’t let the amazing performance paper over his shit behavior off the mat.",
            "Said nobody never",
            "😂 what a great story!",
            "Yeah Jacob couch tapped, granted he was a weight class below Gordon but still crazy",
            "I’m more so curious on why he used the cross ashI / reap to finish the outside heelhook rather than outside ashi. Historically you’d be told that this is suboptimal for finishing outside heelhooks because the reap applies pressure in the same direction that your opponent needs to turn for their escape.",
            "This was great - thanks!",
            "I think this account is a past version of me before I started into the leglock project",
            "They're really fun honestly. Besides the submission itself the threat of heel hooks can open up a whole new layer to passing and guard play. I think the only people who find them boring are those who haven't put any time into learning and understanding them. ",
            "you better change your mind about them quickly if you expect to get out of blue belt",
            "Its the older nephew of Nicky Ryans uncle",
            "Even Nicky Rod couldnt spaz out of Gordon's grip on the heel. I think his grip must feel like its pointless to thrash around",
            "Daddy chillll...",
            "someone is just going to bop this kid one day",
            "It's also more of a flex to sub a high level opponent with slow control.",
            "Noticed how I called him an ass, not a criminal or something. Do I care about him outside of BJJ? No. But I’m not aware that there’s a rule that I can’t make a passing comment on anything I don’t care about is there? It’s not like I’m going on a long tirade about him. Funny how you’re so defensive over a passing comment over the most talked about BJJ athlete in a BJJ Reddit. You must be real busy in here.",
            "Noticed how I called him an ass, not a criminal or something. Do I care about him outside of BJJ? No. But I’m not aware that there’s a rule that I can’t make a passing comment on anything I don’t care about is there? It’s not like I’m going on a long tirade about him. Funny how you’re so defensive over a passing comment over the most talked about BJJ athlete in a BJJ Reddit. You must be real busy in here.",
            "There's plenty of other people to hate in BJJ. It's a really salty puddle, jiujitsu is.",
            "Why do you care about his random bs though? Its not like he's Jon Jones from UFC who's literally nearly killing random pregnant women and running away from the crime scene LOL",
            "I stand by it :) He is not explosive or athletic. He is methodical, slow. I personally don't like to watch it.",
            "In a video with Bernardo he says the inside ashi makes it easy to get heel exposure. Bernardo also freaks from the pressure on his femur just from the inside ashi. \n\nNot an expert at legs yet but if you aren’t slipping the heel turning out isn’t going to save you. ",
            "That's not totally true.\n\nYou can put counter twist pressure with your legs from inside ashi too. It's harder and more subtle than in outside ashi but sometimes you don't need much strength to break the leg.\n\nYou should absolutely be prepared to transfert from inside ashi to outside ashi byt following the rotational escape though because sometimes you miss the break from inside ashi itself\n\nThe people who have trouble finishing inside ashi heelhooks have those because they are used to the bridge finish (which is not my favorite at all). People who are used to counter twisting mechanics pull it off well most of the time",
            "He didn't use cross ashi to finish it. By definition, there is no outside heel hook from cross ashi. He passes the leg across his body into inside ashi where the outside heel hook is available and finishes it from inside ashi position.",
            "This is very true, they’re only boring if you get stuck deep and don’t know how to escape and counter. Combining a turning escape with things like bolo or another attack on the opposite leg leads to great sequences both for spectators and for hobbyists.",
            "I'm a hobbyist, I do it for fun. I don't care about belts. I want to find what I like and get better at it.\n\nThey are just not part of the sport that I find interesting to learn. Same for wrist locks. Sure I'll defend it the best I can, but overall I prefer not to roll with someone who's using them heavily in their game and if I happen to find myself in that situation I'll tap early \n\nHonestly, I don't know why all the downvotes. Perhaps the \"boring\" part came off condescending. What I really meant was that they are not interesting for me to learn.",
            "They’re going to need to watch out for that counter right man titty. It pops chins almost as often as he pops knees.",
            "Yikes, lol",
            "Can confirm, the mats taste salty. ",
            "No argument here. For some, internet hate is it's own reward. ",
            "He admitted on JRE to spend hours every day harassing people who insulted him once years ago telling them to kill themselves and such. To be clear this is what he admitted to doing while going on the biggest podcast in the world to make himself look good. He dedicates like 8 hours a day to harassing people online by his own admission.\n\nI’m very anti censorship but you can’t possibly read this without thinking “holy shit what a fucking asshole.”\n\n**Transcript from JRE MMA show 109:**\n\nLike sure, some things that I do, I, like first of all, I only attack guys who have started shit with me or started shit with my team or inadvertently or passive-aggressively. You talk shit about our team or myself. The problem is I just go way further than is necessary. They start at level two, and I just go to level 1,000 right away, and I just don't stop. They talk shit about me like 2015 and 2021, and I'm still just berating them every day. I just go way overboard and that's what people get upset about. But I never actually attack someone who hasn't started with me first. It's just funny, the dedication to shit talking. It's a full-time job. But now I can't even do it because Instagram just erases all my posts. Really? Yeah, Instagram, I just stopped pretty much using Instagram. I just post once a day or once every other day now.\n  But Instagram deletes. If I go on and I comment something and I attack a hater who attacked me and retaliate, 60% of my posts just get erased now. So I would spend hours a day on Instagram. It's like a full-time job. But now it's not even worth my time because I know that if I go on and I write, you know, 30 comments, 20 of them are going to get erased. So it's not even worth my time dealing with it anymore. What do you think is going on? You think someone's reporting them? I think it's a combination of people reporting it.\n  And I think it's just the algorithm is like, had been like, has a hit on me. And I think that like, like, as it shows you your violations, I have, like, hundreds of violations, like, 300 violations. Like, I tell people to kill themselves and stuff. So, like, now they just started threatening to delete my account, and they delete, like, all my comments. So it's not even worth going on and attacking people. Like, because normally it's fun for me to entertain the fans by attacking the haters. Yeah. But now it's just, like, Instagram just Instagram just erased like 60% of my shit.\n So it's not even worth attacking people because you spend six hours online and four hours and we're useless because all your comments just get erased. So even if you just have a post and they leave the post up, if you have comments under the post, they'll delete your comments? They'll delete my comments. Yeah. What? Yeah.\n  I didn't even know they did that. Yeah. Yeah. They delete comments all the time. Like people attack me, I retaliate and then then they start to, uh, and then we go back and forth, and then, like, the whole comment section gets erased. So you spend, like, four hours on a comment thread, and then the original comment gets erased, and then before you know it, like, you just spent four hours on Instagram, and it was all useless. What the fuck is wrong with them? It just, it just drives me nuts. I don't understand why they do it. And it just getting worse like it's not it's not getting any better so now I just got go on like once every once every day or so once every other day I just promote like a fight coming up or an instructional that's coming out and then I just I don't even bother arguing with people what about videos can you make videos like YouTube videos or or talking shit in the Instagram video will they delete that uh depends on depend i mean if people report it they pretty much just because i have so many strikes against me they pretty much just if someone reports it they just instantly delete it and they don't even give me a chance to fight it anymore they're just like yeah fuck you you had so many violations that they uh they just erase it but um i definitely i can do some stuff uh but it's it's getting the window of what i can work with is getting smaller and smaller by the day so it's just like i it's just it is one of the weirdest problems to have to be the best in the world at something and then have someone like instagram like deleting yeah comments and posts.\n\nI'm like perma-banned on Facebook. I get like 30 banned days, I'm okay for like two days, and then they just ban me for 30 days. They'll go back and they'll find shit from like 2015, like this goes against community standards, ban for 30 days, ban for 30 days, ban. I've been like, the last year I probably had like four active days on Facebook, and then I'm just banned for the next 30 days every single time. It's just like, I can't even use it anymore. How do you have time to do that though with all the training? So that's what I do for fun. Like most people watch TV. I just go on Instagram and I attack people. Like I get home. I eat my food. I'm like eating my food and I go on and I'm typing and I'm like – I tell Nat. I'm like, man, I just crushed this guy on Instagram. I can read the thread. She's like, yeah, it's going to get deleted. And then 30 minutes later, like, oh, this goes against hate speech. So it's just like I always used to do it for fun, but now it's not even fun because I just waste my time doing it. Now, obviously, the next course of progression for a guy like you would be MMA. Yeah.",
            "Yeah people are hating him because his different political opinions. Honestly that's crazy.",
            "That’s what makes it even more impressive. His style is the very essence of bjj, that the most technically proficient person can defeat someone even stronger and more athletic. Listening to Craig Jones’ recent podcast visits backs this up, he says Gordon isn’t the most naturally gifted athlete, but he’s the most technical, and the technical proficiency wins out. \n\nHe’s not even a true heavyweight and he’s beating people that outweigh and out muscle him with absolute ease and he almost always wins via submission. And not just via submission, submission that he calls out ahead of time. Literally winning any way he wants. \n\nI’m not sure what matches you’ve been watching but Gordon’s are an absolute masterclass on positional dominance and finishing matches. I’d rather watch that than a 2-2 guard pulling stall fest won on advantages.",
            "Maybe mma, judo or wrestling is a better fit for you?",
            "Having people in 2024 still refusing to accept how knowledge heavy leg locks are is something I really do not understand.\n\nAs you said, leglocks add a super cool layer of attacks, defenses and counter attacks to nogi.\n\nPeople don't remember or never were into grappling before heelhooks became a real thing... it was awful",
            "You’re not gonna reply everyone commenting on Ryan’s brother? Weird.",
            "Like I said, clearly the guy is an asshole outside the mats. But I'm just curious why do people care? The best weapon against assholes like this is to ignore them IMO",
            "Well I have black belt in Judo. But also in BJJ, I guess I'll return mine? :D  It is true that I have background in striking as well and I do struggle sometimes with how far BJJ has moved away from fighting. I still enjoy the meta of the game when rolling, but not so much watching it.",
            "Just to make the point that disliking him is a pretty reasonable response considering how he behaves.",
            "But why would you even consider liking/disliking a stranger who has no idea about my existence? I just can't wrap my head around this",
            "The fuck? You don’t dislike Putin? Hitler? They don’t know who you are. Weird prerequisite to dislike someone."
        ]
    }
}