{
    "/r/BlackPeopleTwitter Weekly Discussion Thread": {
        "title": "/r/BlackPeopleTwitter Weekly Discussion Thread",
        "score": 26,
        "url": "https://www.reddit.com/r/BlackPeopleTwitter/comments/1dhys4v/rblackpeopletwitter_weekly_discussion_thread/",
        "content": "Hey r/BlackPeopleTwitter, welcome to our weekly discussion thread.\n\nFeel free to use this thread to discuss whatever you want. You can discuss the state of the sub/meta post, shitpost, post non-twitter memes, or discuss whats going on in your life. Just keep in mind that we ask you stay friendly, civil, and adhere to the [subreddit rules](https://www.reddit.com/r/BlackPeopleTwitter/about/rules/).",
        "num_comments": 78,
        "comments": [
            "Why are so many non-black people on this page cosplaying as black folks? You don’t gotta lie to kick it.",
            "Sometimes when random white people try to say I look like someone else, I want to get angry but then I remember these two exist.\n\nhttps://preview.redd.it/5wf9x38kh57d1.jpeg?width=1170&format=pjpg&auto=webp&s=3cc53a91e4c4adcbccb18a8100f0a65eea872ff5",
            "A [heat dome](https://www.cnn.com/2024/06/14/weather/heat-dome-summer-hurricane-climate/index.html) is forecast for later this week. Stay hydrated :)",
            "I hope a baby smiles at everyone sometime this week. \n\n\nI hope that everyone finds a twenty dollar bill, \nrandomly. \n\n\nI hope everyone creates a lifelong pleasant memory this week. \n\n\nSmall blessings on this Monday. Happy Juneteenth!",
            "So my man got gifted a puppy yesterday from his folks and he’s torn between names: Kirby(his favorite game) and Shuri(Black Panther). Any thoughts? The puppy in question is a 3 month old female black lab.\n\nETA: He’s going with Kirby and Shuri will be her middle name.",
            "Trying to find a decent job is worse than getting kicked in the nuts 😞. I swear it feels like my resume is not being looked at",
            "Any recommendations for Black subreddits? It would be cool to meet new people and have new conversations.",
            "I'm tired mate. I'm just so tired.",
            "I don’t get why black lesbians are so judge mental and down right mean bullies. This is just personal experience. Look I get it, my personality ain’t the most attractive because I’m more on the reserve side; but I wish we were more open to each other. It’s difficult trying to connect with other black queer women.",
            "I hope everyone had a great juneteenth weekend or has a great one planned for the upcoming weekend / holiday!!♥️🖤💚",
            "Hate /r/naturalhair posts where people are complaining about their hair texture and crave straight hair. \n\nWe have 4C hair too. Feels like I’m catching strays with someone indirectly calling ME ugly because they hate the look and maintenance of their own hair.",
            "Y’all ever feel like some hypo- ghetticals on here are just lose -lose? Like there is no answer that either side is going to actually listen to or understand. \n\nI’ve been seeing a lot on TikTok about parental financial resentment, and while I think it’s a great convo for those that actually lived in poverty, those that didn’t and grew up middle class are resentful about not getting extras like braces or going on vacations like their peers. \n\nIdk I just feel like I’ve seen people with parents that are CRNAs that have money, and still struggle. Folks don’t realize that medical school payments, day care, a mortgage, are about $6k a month, not including bills, groceries, and other things a family needs. They may not have a life of luxury but bare necessities are covered. \n\nSeeing even someone raised like that complain makes me feel like there is no scenario in which folks are happy.",
            "Im watching the Netflix documentary “Tell them you love me” and Im not sure how to feel.  Im torn between believing this woman took advantage of Derrick or believing she gave him a voice and he made a choice\n\n\nEdit: Nahhh she abused this man",
            "a few days ago some old hispanic man at work told me my hair looks better in braids than it does when i wear my fro. in honor of today's holiday imma be rockin the fro into july",
            "Rip Willie Mays",
            "Posted a while back about wanting to get a truck camper for touring the US. Looking to buy a Ford F-350 with 4x4, the crew cab, and DRW from a dealership. Can anyone give me the specifics on how to go about this? I’ve never bought a car from a dealership before..",
            "I’m getting ready for the Elden ring DLC and I’ve been stuck on malenia for a while\nNow. I’m wondering if anybody in here has beaten her? Out of all the bosses in the game she’s the only one that took me more than two days to beat.",
            "I f*ckin' hate Romanian deadlifts, I'm too tall. I swear they were engineered by short people as a revenge play to make me look dumb.",
            "![gif](giphy|A6VBRPzcWxqLnZaINa)",
            "Ok I feel like an old auntie but I am super judging “todays youth” for going outside in hair bonnets. My wife agrees with me. Are we just getting to that age?",
            "I recently started dating a poly guy. I went out with him and his other partner last night; it was a great time and I'm so happy, especially after I fumbled the end of when I first met partner #1. Hands down the healthiest relationship I've been in, and it's a polycule. Whodathunkit?!\n\nNow I'm trying to figure out the timeline of introducing him to my mom and explaining the poly aspect ...which do I do first?! How long do I wait to introduce him?!",
            "Morgan Freeman is once again reminding us that he's trying too hard to sound philosophical",
            "I thought it might be interesting for some here to read one translated article on the Ruud Gullit blackface fans at the Dutch-Poland EK football game. (disclosure, not black, but American in the Netherlands. Don't like blackface)\n\n[https://www.rtl.nl/nieuws/artikel/5455901/verkleed-als-ruud-gullit-en-daarom-racistisch-ik-stop-ermee](https://www.rtl.nl/nieuws/artikel/5455901/verkleed-als-ruud-gullit-en-daarom-racistisch-ik-stop-ermee)\n\nDressed as Ruud Gullit and therefore racist? I'll stop doing that then!\n\nUsually the Orange supporters abroad get the news in a positive way, but some supporters dressed as Ruud Gullit get criticism for their black-faced faces. That would be racist. For one of Gullit's doppelgangers, it is the reason to stop his imitation.\n\nThe fake Ruud Gullits were visible in many photos and images. The British newspaper Daily Mail writes that there is criticism of Dutch fans with black-strict faces. \"Netherlands fans are accused of doing 'blackface' in to dress up as legend Ruud Gullit at Euro 2024 victory over Poland,\" the newspaper headlines.\n\nOne of Gullit's doppelgangers says anonymously to RTL News that he himself gets 'only nice reactions' as a look-a-like from Gullit. Yet today he decided to stop. “That fuss made me think. Perhaps it evokes unpleasant feelings in others, even though I really adore Gullit and therefore imitating him. I will accept that sincerely.”\n\nPreviously, he was of the opinion that his black make-up, as he calls it himself, is a tribute to Gullit. The former footballer became European champion in 1988 with the Dutch. “I’m a perfectionist, which is why I’ve looked at the details. I also wear the lottery shoes that Gullit had on.”\n\nOn X are for -and opponents for the Gullit look-a-likes. Critics, especially from abroad, refer to black petioly and say: there you have those Dutch again, with their blackface tradition.\n\nOthers find this kind of response to the Gullit imitations but exaggerated. They see it as something fun and don’t understand why you shouldn’t make a look at a footballer’s attention.\n\nIf white people make themselves black to look like a black person, it’s called blackface. Several researchers showed that tradition is racist because it originated in times of colonialism and slavery.\n\nSociologist Aspha is an expert in the Dutch colonial past. Blackface was created at the time, with the goal of ridiculing black people. As a result, it is hurtful, even if it may not be intended or with the intention to imitate your football hero, Bijnaar explains. “It easily rolls out of your mouth that it wasn’t meant to be. People ignore the impact of that intent.”\n\nBee to ask if supporters also dress up as well-known white footballers of that time. \"Would there have been fuss if supporters disguised as the brothers De Boer?\"\n\nThe 'Gullit' that RTL News spoke, says that he chose Gullit, because Guus Hiddink is much more difficult, according to him. \"And maybe I would have been a good John the Wolff if he had been very big in 1988. It was Ruud.”\n\nAbroad, there is often little understanding for Dutch people who do not understand that the face of black face is racist, as is also evident from reports in the media.\n\nAccording to Bijnaar, this has to do with the Dutch self-image. “We see the Netherlands as a tolerant country, we think we can say anything. It comes from arrogance. Who are they to say that we are not allowed to carry out our traditions - by the way?\"\n\nSociologist Bijnaar thinks it helps to listen to someone’s objections. \"You can also say: I want to know what the other person thinks, what that stumbling off is in.\"\n\nShe thinks people should make more space in their heads and their hearts for those who feel hurt or racist. “It’s empathetic when you say: I didn’t realize that the effect of my actions brought you about it. My apologies, I won't do it again.\"\n\nThat is what the imitator we spoke to now does. “It turns out that I bump in people’s heads. That's the last thing I really want. So I decide to stop.”\n\nRuud Gullit himself\n\nEarlier, the man said that he is curious what the former footballer of the Orange thinks himself. “It does something to me. I try to get in touch with him myself to ask if he thinks it is racist what I did.”\n\nRTL News has tried to reach Gullit to ask what he thinks of the fuss, but did not get a hold of him.\n\n ",
            "idk if anyone else here is a witch but i cursed my final boss of evil white women (my mother) with a friend for years upon years of neglect and also being racist af and now she's alone and miserable",
            "I'll take being stuck in an elevator with three 5 foot angry studs with a Boosie cut for six hours over the crunchy trust fund hippie ones that are legion in my town.\n\n\nJust trying to chill in my local coffee shop and learn the workflow of my new sp404 mk2 , and you gotta come over just to let me know you and your friends aren't into men.",
            "[deleted]",
            "[♪](https://coolsymbol.com/copy/Eighth_Note_Symbol_%E2%99%AA)\n\nYou ain't gotta lie\n\nYou ain't gotta lie\n\n[♪](https://coolsymbol.com/copy/Eighth_Note_Symbol_%E2%99%AA)",
            "How do you know who's who?",
            "I'm a white gal and I just want to say.. thanks for letting me hang here! Keep it coming! 🩷",
            "They have different skin color but I can see it at a glance",
            "I found $2 yesterday so thanks for that! 🥹",
            "Shirby?",
            "…Kirby",
            "Kirby because one of the dudes who invented black panther is Jack Kirby.",
            "Dang it I’m late to the party and seeing as I have a female black cat by the name of shuri im clearly biased.  congratulations on the new fur baby!!!",
            "Don’t give up my dude. I know it’s really really hard out there and it seems hopeless but eventually you’ll get what you are looking for. Also I know bills don’t take breaks but take a day to yourself to recharge so you don’t burn out. Also make sure you are taking Vitamin D to keep your spirits up. If you are inside applying for jobs then you definitely aren’t outside and being deficient in D can really throw you off.",
            "What are you looking for?",
            "Canadian here. I have a pretty ethnic sounding name. I changed the name on my resume to something more...white, for lack of a better word. A variation of my actual name. I started getting a lot more responses. I'm not kidding. Maybe this doesn't apply to you but just throwing it out there for anyone else. \n\nSomething else to consider. Perhaps, your resume needs a bit of work. Maybe have someone take a look at it or hey, throw it through chatgpt. Latter requires a bit of finagling or at least some good promps. Google is your friend here. \n\nGood luck! I totally get what you're going through.",
            "Shy people included? I’m in",
            "Seconding this.",
            "That's just how black women are don't take it personally or else it will drive you up a wall.",
            "I don't understand why other black people hate on their hair ,like our shit is versatile I love it",
            "I can't stand this kind of shit too.",
            "Research before buying as far as pricing, hit up some credit unions for pre approval, always negotiate and your best move if you feel its some bs going on is to walk away.\n\nInfact negotiate over email, tell them you are emailing other dealers off top and it should be way smoother for you.",
            "The good folks over at r/Eldenring have a plethora of info and videos on how to defeat her. \n\nAlso, you do not need to beat her to access the DLC, just Radhan and Mohg. So if you haven’t yet you might wanna. Hope this helps. \n\nSee you in the land of shadows, Tarnished.\n\n*Edit: I beat her a while back, and honestly it was more dumb luck cheesing her with a cannon and bleed weapons than skill. That bitch made me HATE that game*",
            "The weapon art from the faith weapon, Blasphemous Blade, causes her to stagger and is spammable. I didn’t understand why everyone was saying she was so hard, but then I learned my weapon was OP.",
            "I mean, the floodgates were opened the moment we started not publicly shaming people for going to the store in their flipping PJs and fuzzy slippers. All bets are off now.",
            "I used to do it when I’d get massages because I didn’t want my hair to get touched. I always wore the ones with the straps you can tie a bow on. Nobody knew. It was great. I’ve only seen one other person with a bonnet on outside but it was raining and she was a door dasher. Not judging her at all.",
            "Aww, congrats. :) Let NRE *fully* settle before you start introducing him to your family, esp if you’re not yet out as polyam to them! \n\nAlso, remember that you don’t have to date or have sex with the couple unless you want to! And if dating him is contingent on dating his other partner too, or if all your dates with him include his other partner, beware..",
            "What happened?",
            "[Ruud Gullit reacts to blackface: 'I actually feel honored'](https://www.telegraaf.nl/video/716620817/ruud-gullit-reageert-op-schmink-ophef-ik-voel-me-eigenlijk-vereerd)\n\nSource is Humberto Tan with the newspaper know as Telegraaf. Pretty respected and established newspaper here, though it can get a bit tabloidy at times. Still nowhere near the Sun or stuff like that",
            "Mama says...",
            "If you read some of the comments they’ll tell on themselves.",
            "I like this one",
            "Kirby for sure.\n\nKnow who created Black Panther? Stan Lee and Jack ***Kirby***",
            "I agree — Kirby is the way to go",
            "Seconding Kirby!",
            "Honestly almost anything as long as I get paid a certain amount because I'm just waiting on an interview from a state job that I qualified for so that's going to be some time till I get that. But these bills don't stop so I can't wait that long 😭",
            "A few more people and we could make a Black introvert sub/gc lol",
            "Oh I know that I don’t have to beat her for the DLC. I just wanna whoop her ass cause she’s whooped mine so many goddamn times. My pride won’t allow me to walk away🧍🏽‍♂️I love that subreddit but I’m avoiding it rn because of the leaks😭",
            "how do i improve at this game im stuck in stormveil castle and tired of hearing get gud… (its been months)",
            "See, the kind with the bow at least looks put together. The ones I’m complaining about are just straight up sleep caps and to me it’s like going out with curlers in your hair.",
            "Thanks! It's only been two dates out of the many we've had where his other partner was there, so that's definitely a good sign. 😅 It was moreso just being able to get to know her since she's been a huge part of his life for a long time, so it was nice to put a face to a name.",
            "Still pushing his rhetoric that the best way to end racism is to stop talking about it",
            "source plz bedankt!",
            "[deleted]",
            "I know of a remote front end job but unsure if it’s California only. Want it?",
            "![gif](giphy|NDFkeDvqVQL3lnkBJT)\n\nI have arrived",
            "Lol that’ll be great 😊",
            "Please! I feel like everyone I'm meeting is an extroverted traveler lol.",
            "Please, please, please make a place like that for us",
            "Make it a discord",
            "You gotta farm, Tarnished. \n\nAt least that’s how I did it. Ran up my runes until I was like lvl 75ish then I started mashin on niggas. Walked straight through Stormveil or one of them other castles and rocked everyone’s shit. It was an awesome feeling, given how ridiculously hard the game is and how many times you get murked. \n\nNot sure if this is still a part of the game cause I haven’t played in a while, but [this is the one I used](https://youtu.be/QUmPy9CvUgg?si=oS-dsUjVRCaEOVTU) back then.\n\n*Edit: it might take you a while to even get to this place, but there’s a bunch of walkthroughs on how to do it. Once you’re there you just gotta commit to the grind and farm farm farm.*",
            "Aww, sweet. It’s nice to cultivate pleasant meta relationships and relish in the expansiveness of love. ❤️\n\nLol, sorry for going hard. I’m just vigilant to polyam newbies getting duped by secret (or not so secret) unicorn hunters or harem builders. 😳😒\n\nI’m happy you’re having a great experience and wishing you ongoing peace, patience, growth, power, and love. 💪🏿",
            "Humberto Tan via the Telegraaf",
            "It means that I am a moron.\n\njk it's just a joke flair",
            "Sure hopefully I get it even though I'm in Louisiana 😭",
            "Just sent it to you as a chat. I don’t work there, and I barley know the person that works there but I hope it helps"
        ]
    },
    "\"Help! Help! Police! Help! 🚔🚓🚓\"": {
        "title": "\"Help! Help! Police! Help! 🚔🚓🚓\"",
        "score": 4611,
        "url": "https://i.redd.it/st4irqgwc18d1.jpeg",
        "content": "",
        "num_comments": 463,
        "comments": [
            "One of my pre-k students once told me \"my mom is 25... and my dad is 50.\"\n\nOkay buddy, that's kinda weird but I don't judge.\n\nThen I remembered he has an 10 year old sister.",
            "What a terrible day to know basic arithmetic. \n\nAlso sum1 plz call the FBI. They might be interested in this",
            "Trying to strike a chord…",
            "He should be in jail.",
            "In certain states she can marry him as young as 12 and then not be legally allowed to divorce him until 18.",
            "The gap in their ages is almost as big as the gap between their eyes",
            "Hey hey hey hey, run for your life",
            "She's still too young for the club. She should be somewhere letting her brain fully develop so she'll know that someone in their 20s sniffing around a 15 year old is fucking disgusting and wrong.",
            "![gif](giphy|JaNtIG4UnKzD2|downsized)",
            "https://preview.redd.it/wfdmt55uq18d1.jpeg?width=567&format=pjpg&auto=webp&s=809db9fc5c0d2d2bf122e14311b552b3921d2acd\n\nHmmmmm……",
            "\"that's what i love about these high school girls.  i get older, they stay the same age.\"",
            "Y'all need to learn how to spot rage bait. It's just going to keep coming if you engage with it.",
            "https://preview.redd.it/24w8eoxfs18d1.jpeg?width=715&format=pjpg&auto=webp&s=2c3b9a5ad66297f859320735c1f70a6ae35e0c40",
            "She shouldn’t be “at the club”, when I was 20, I wasn’t at the club. That wasn’t my thing, still ain’t. But I wasn’t being abused by a 25 year old when I was 16. Like you’re a grown ass man with a job and you’re on someone still knee deep in High School. There’s a word for that, but I don’t like typing it out or even saying it. You’re a sick sack of shit. I don’t give a fuck.\n\nhttps://i.redd.it/8ty29t2nw18d1.gif\n\nEdit: I don’t give a fuck if it’s not her kid either. The gap is still creepy. I said what I said.",
            "It looks like an AI generated image of 3rd generation inbreeding",
            "A minorrrrrr",
            "Why do people assume the first baby is also his?",
            "There's the possibility that the 4 year old isn't hers. Quick to judge without the facts.",
            "They look related too",
            "Anything to bring attention to their social media page",
            "She was 16. He was 25. Yuk. How...",
            "Always a jumpscare for me when these types of posts show up😕\n\nhttps://preview.redd.it/foscuti8m18d1.jpeg?width=1920&format=pjpg&auto=webp&s=9d14c69c7b8981aa93d818ee18f4a1c5d6c168b0",
            "Gross",
            "If the oldest is 4, and she's 20. She had him at 16 while the father was 25. Y'all can make all the arguments you want about two adults with an almost 10 year age gap. But that goes out the window when children were produced.",
            "For those that cant math.... Sis had their FIRST child when she was 15-16 and he was 24-25... \nTHATS the real issue",
            "Man gotta weird case why is he around",
            "The 1000 yard stare and broken smile says it all.",
            "16 + 25 is fucking unacceptable.",
            "orrrrrr plot twist,  they're all the kids and mom and dad(not pictured)are in their 50's still having kids 🤷‍♀️ could be true",
            "He's a pedophile",
            "Why should she be at the club?",
            "That's his kid, not hers. She's a step mom to a 4 year old at 20.",
            "People accusing people of a very serious crime based just on some random internet picture with numbers on it... smh",
            "I tried denial arithmetic with this and it didn't work. Jail. Straight to jail with him.",
            "16 and 25 is gross for a variety of reasons. Adding childbirth into it is just extra levels of nasty.",
            "[deleted]",
            "![gif](giphy|56x5HStTr6B639mCJP|downsized)",
            "That curtain is old as hell",
            "Legal age to get married in Missouri 14! The Republicans voted against raising the age to 17 in 2024! Family Values 🤷🏾‍♂️🤷🏾‍♂️🤦🏽‍♂️🤦🏽‍♂️",
            "Wop wop wop wop wop",
            "Upvote#900 😎😎😎",
            "This fails the divide by 2 plus 7 test",
            "My youth director growing up was 17 when he met his future wife who was 14 at the time. They got married a year later, they're in there 80s now and still happily married with kids, grandchildren and great grandchildren. Normally I'd say this is questionable but I'll hold my judgment and hope that it's a good situation and not something fucked up.",
            "Uhhhhh",
            "There’s no way they posted this without knowing what people would think this is absolutely rage bait",
            "![gif](giphy|4JVTF9zR9BicshFAb7|downsized)",
            "She will, my neighbor married his baby sitter when she graduated from high school. Yes you read that right. They had two kids. When she turned 21, she divorced him and hit the bars. She left her kids with grandpa and grandma. Marrying minors will do that to you.",
            "Could be his kid from a previous relationship?",
            "If this was in Colorado, she was 16, and he was 25, it would be *not* be statutory rape. Actually, this wouldn’t be statutory rape in at least 20 states.\n\nKinda fucked up when you think about it.",
            "They look related is the biggest issue",
            "his eyes are misaligned",
            "maybe hopefully it was a typo and they meant 30 not 20…..?",
            "Not if her parents signed the papers to approve her getting married at 16. Not saying it’s good just saying it’s “legal”",
            "I understand the notion of dating a girl who’s you get than you but WTF man.",
            "What's 20 - 4 (for math geniuses 😉).",
            "[When someone on here does the math…](https://youtu.be/cOy6hqzfsAs?si=Czw1lEP_osRGCe5E)",
            "This reeks of youth pastor",
            "He a fan. He a fan. He a fan.",
            "https://preview.redd.it/m83nmd3ya28d1.jpeg?width=750&format=pjpg&auto=webp&s=656a52e0b3aab009fdc8b397aef1cb2de791ff5e",
            "Disgusting either way in my opinion but in 43/50 states the age of consent is under 18. most have some exceptions like age of perpetrator, some states have statutory laws, and other things that make it a little bit more complicated. 16 on the low end. still too young to be out here fuckin any one at all let alone someone who most voted for the previous 2 presidents before you had the chance to vote for 1. sick",
            "Having this as the first thing on my feed 😭",
            "That's 15 -24 for those keeping track of the score",
            "Ok ok, calm down. There could be an exception. Imagine that you are a sixteen year old girl and have a boyfriend. If you make a kid, the boyfriend might not want it, so you are stuck with it. You start dating again and find another guy. See? Not as bad",
            "Child bride",
            "We don’t know that he’s the dad of the 4 yr old",
            "Homie showing off. \"you can't do shit\".",
            "That’s not good",
            "25 v 16",
            "my now husband was 28 and I was 20 when we had two kids...we met at 17/18 and 26...got pregnant at 19 and he 27...but this is a little wow for me. That mean she was already sexually active before 16...😬",
            "Some ppl forget the age of consent outside of the US isn’t always 18. Austria for example has an age of consent of 14",
            "15yrs old inception 16yrs old birth",
            "I don't know what possessed them to post their ages.\n\n\nIt's a horrible thing to ask but...are the parents related?\n\nAll of them have faces that seem a little off.",
            "You guys ever been out in the real world. There's all kinds of shit out here.",
            "Hmmmm when he was 25 he was banging a 16 year old high school student……..",
            "They sure do got similar facial features/structures 👀",
            "35 year old woman lies about her age on Family Photo & family gets SWATted by FBI",
            "Ok I've seen this picture a few times mow is this someone im supposed to know? Also how do we know that is his kid? \n\nMy mom got pregnant with my brother at 16 and had him at 17 and the dad was 18. But a few years later after my brother's dad ran off, my mom (22) and my dad(28) could have taken a really similar picture.",
            "She was 16 when he was 25",
            "So we're just normalizing pedophilia the f***",
            "You can get up duff legally at 16 in lots of places",
            "So they had a baby when she was 16 and he was 25, cringe.",
            "Even worse when you realise that the first kid was concieved at minimum 4 years 9 months. He could also be at the older end of 4 and her at the younger 20.",
            "![gif](giphy|GbDy1cqtBtRNLSpaZL)",
            "![gif](giphy|BmmfETghGOPrW)",
            "He looks like a \"train em young!\" type of guy. 🤢",
            "![gif](giphy|WRQBXSCnEFJIuxktnw)",
            "![gif](giphy|fWh8aQQMJB0mL9zoIt|downsized)\n\nMaybe it’s early cuz I’m visiting out on the east coast, but the math ain’t mathing",
            "Those numbers represent their age or their IQ?",
            "If they’re In UK it’s… legal, but still weird",
            "Hear me out... The words on the photo could also be... fake and only put there to rile you all up.",
            "In 12 years the son will be old enough to fall into the dads hunting range, perhaps younger",
            "Y’all are mad, but the age of consent is 16 in Canada, and in many states.",
            "Straight up, I was the same age when my goofy ass met my ex. No adults in my life caring enough to stop me.\n\n\nI had a daughter with that predator and he's only just now trying to be in her life that she's hit puberty.",
            "16 is legal in my country.",
            "Please be fake. Please be fake!",
            "Hopefully, it's a step-mother/adoption situation\n\n*Hopefully*",
            "Maybe they are both 25 and the age numbers are fake.",
            "Can this still be reported to authorities?",
            "Hold on.........that's a sex crime",
            "\"she should be in the club\" \n\n*Not even 21*\n\nSigh....",
            "Devil's advocate: the oldest child could be adopted for all we know... Though I don't think I believe that.",
            "Isn’t this just a screenshot taken from the AI app that tries to assign an age to you based on HOW YOU LOOK in the pic you submitted?",
            "Unrelated to the people, I live for the indication that the crack in that wall has been there for all of AD. Like, since before we had the ability as humans to craft the materials to make said wall.\n\nOr perhaps any structure built there previously *also* had that same crack, inconspicuously and regardless of material",
            "Cultural",
            "I mean, the OP implies that these are both her children because that's where the karma is....\n\n...but, this could just be a divorced dad dating younger women (I.e. the kids are his, but not hers).\n\nI don't know who these people are, so maybe I'm missing the larger context.",
            "If he married her at 16 some places that’s legal consent",
            "Well, at least theyre still together ",
            "They look related",
            "Some states in the U.S. age of consent is 16.",
            "So he was 25 when he impregnated her at 16!?!",
            "My mom's aunt got married at 16 and had 4 kids at 20, 6 kids total! Of course, that's a lot of years ago and things were \"different.\" *shudder *",
            "https://preview.redd.it/g6kxrhh7648d1.jpeg?width=750&format=pjpg&auto=webp&s=8f3b680dec545c969313c536a029cde3d14c5c60",
            "Rage bait.",
            "They look related like 1st cousins",
            "The numbers ain't adding up",
            "Wait till yall find out they’re cousins",
            "What if that's not his child she's holding? Too quick to assume",
            "![gif](giphy|f8lDluiWJ7yQTtdS3L)",
            "I feel like the statute of limitations on child abuse shouldn’t exist.",
            "That name gotta be registered and placed on neighborhood watch👀",
            "I really thought we were talking about the FAS here but I guess my arithmetic ain’t so strong.",
            "BBLLLLLL DRIIIZZAAYYYY 💀",
            "Fetal alcohol syndrome?  Ah fuck, it's actually like 10 months for a pregnancy.",
            "4 year old might not be his/hers 🤷🏿‍♂️it’s jumping to the conclusion off ltd info that says more about people than them?",
            "They all have dead eyes",
            "He’s a “Pedo”!!!!",
            "Hold on a second",
            "Guy just admitted to a felony 😂",
            "How’s do they even meet!? That shit is weird af to me…what do you even talk about or have in common",
            "“Certified Lover Boy? Certified Pedophile” \n\nAssuming what’s posted is correct.",
            "Yeah, this is the Jetsons! Once you did math of George, Jane his wife…there daughter Judy….well, that show was creepy AF",
            "Same forehead and eyebrows too-yikes.",
            "Woooooow fam ..... That shouldn't have been posted at all",
            "Bunch of big-head weirdos",
            "This guy apparently likes Drake.",
            "First, they don't look American.  Sorry if that's not true, or *rude*.  Second, even if they are, the age of consent is 16 in a lot of us states.  I know some have restrictions around that.",
            "\"Oh it's ok now guys. She's over 18 now!\"",
            "Even the kid is like \"This is wrong and I don't want to be associated with it!\"",
            "To be fair, I can SEE why they locked each other up.",
            "...He could just not be the dad of the first boy? Otherwise.... uhhhh Call The Fuzz?",
            "She couldve had a teenage pregnancy in high school and then met dude. Yeah this one crazy",
            "I couldn't care less.",
            "Wow, he got a 16 yr old pregnant n married her.",
            "[deleted]",
            "Maybe she was age of consent.",
            "She’d have been 16, which is the legal age of consent in 17 US states plus 2 US territories.",
            "They are probably gypsy or Romani",
            "are you sure he was actually correct about that? pre K kids can have wild ideas about how old their parents are because they don’t really understand time yet, especially longer time like years",
            "Growing up, when I was I HS, I knew a lot of fellow classmates,  16 at the time,  dating 20+ year olds. They always said the same thing, older guys are more mature.\n\nWorse part,  teachers knew because the conversations were loud enough and their parents knew. Shit back in the day, 24 years ago, a couple of girls had told me they were caught fucking their 20+  bf in the car by cops. The story was the same, the only thing cops did, make sure she wasn't being raped then took her home to talk to the parents. I'm assuming it was to see if they parents knew the age difference which they knew and ok with.",
            "I know a couple like that irl. She's 22-23 I think, her mans 50 with a 13 year old. They're nice people but it's.. it's a little strange sometimes.",
            "O no",
            "What?!",
            "Could be different dad",
            "An teacher?!",
            "You’re a teacher who doesn’t use “an” correctly?",
            "Are we assuming they’re in the US?",
            "Assuming the numbers aren't made up lol",
            "The age of consent is 16 in 31 states. It’s possible no law was broken here. 25 with a 16 year old is wild to me but the FBI ain’t doing anything.",
            "It took me too long to get it",
            "Or maybe someone just slapped those numbers in into a random picture for internet points? \n\nWhat a terrible day to know basic internet literacy.",
            "I mean, maybe It’s his kid from someone else?",
            "The age of consent in most states is 16. Just stating a fact, not condoning what's implied here.",
            "Different countries have different laws. It can be gross and legal at the same time",
            "Unless they were banging while going across state lines or something, FBI is just gonna refer it to the local popo",
            "US defaultism much? You know other countries exist right? And the age of consent is different in each country?",
            "\"As long as you marry the child you just raped, it's not rape.\" – CA, NM, OK, MS",
            "Its probably a B sus\n\n![gif](giphy|ZGDr9hawxG9H1rH9Ut|downsized)",
            "And it's a minorrrrrr",
            "A minor?",
            "Yeah, A minor chord.",
            "He should be further away than that.",
            "No. Age of consent is only 14 in Albania...so despite getting a 15-year-old pregnant as a grown ass man, he didn't break the law. Crazy world",
            "Is it known for sure he's the father of the older kid as well?\n\nCould have been a teenage pregnancy with someone else, of a similar age to her.  Still wrong and ignorant, but not quite as bad a taste in the mouth.",
            "That's such a crazy law. Obviously working as intended but still. Everyone looked at that and keeps looking at that and goes \"yep sounds about right\"",
            "It's even worse \n\n\"According to data compiled by Anjali Tsui, Dan Nolan, and Chris Amico, who looked at almost 200,000 cases of child marriage from 2000 to 2015:\n\n* 67% of the children were aged 17.\n* 29% of the children were aged 16.\n* 4% of the children were aged 15.\n* Less than 1% of the children were aged 14 and under.\n* There were 51 cases of 13-year-olds getting married, and 6 cases of 12-year-olds getting married.[^(\\[35\\])](https://en.wikipedia.org/wiki/Child_marriage_in_the_United_States#cite_note-Frontline32-35)\"\n   * Source: [http://apps.frontline.org/child-marriage-by-the-numbers/](http://apps.frontline.org/child-marriage-by-the-numbers/)",
            "I'm sorry. What?",
            "They are from Albania",
            "What if they are related...",
            "Seriously I thought we were talking FAS here not statutory",
            "Yes. This is Fetal Alcohol Syndrome",
            "Fetal alcohol syndrome is one of the cruelest fates.",
            "> She's still too young for the club.\n\nNo she isn't. \n\nUS is the outlier with 21 being the legal age for drinking.\n\nIn a lot of places you can go clubbing legally at 18. \n\n...it's a bit early to get married and have children in my opinion, but she CAN go clubbing.",
            "The entire situation just tells you ages and what year it is, leaves out countries, and somehow we concluded she can’t go out? Almost certain numbers aren’t American only 🤷🏿‍♂️",
            "It's not. You can check their tiktok page. It's Albania so its actually perfectly legal lol",
            "rage bait?\n\nhttps://preview.redd.it/tayphd0e728d1.png?width=959&format=png&auto=webp&s=bdfae84ebb8100378b4e2dc79d202e06f9716253",
            "Reddit is so prone to rage bait and it’ll never change",
            "Shhhh dude they're not ready to hear that yet.",
            "Yup I find it strange people still defending it  even if the first kid isn’t hers he still knew and got with this girl from the time she was 15. There’s another pic and she literally looks like a child. There’s no disputing it. On the tweet I even saw people saying she could have lied about her age. Why the fuck do people jump to instantly defending this shit? This kinda dude be the type to say “well I couldn’t tell” they definitely can but don’t care. Apparently this kind of thing is common is Albania",
            "Fun fact, comrade. Single generation incest produces birth defects at a untypically high rate. MULTI generation incest actually INCREASES survivability and favorable traits as the deleterious traits that are recessive and would otherwise lie dormant are more likely to be doubly received by a inbreeding-resultant descendent, leading to expression of the disadvantageous trait, premature death, and cessation of the trait being passed to descendent lines\n\nI'm not remotely joking about this either, I was fucking amazed that it was a thing. You have to be fuckkkeedddd up to actually breed anything like this though. Basically intentionally causing birth defects to harden an organism. Sadistic shit",
            "It's his. Here's them when they met:\n\nhttps://preview.redd.it/oqmpys08728d1.png?width=959&format=png&auto=webp&s=a2e103abb701f16594f73e9209e9c1d7fae24ca3",
            "Because that’s what they’re showing? Tf?",
            "Or that any of those #s are real",
            "could be his from a previous marriage",
            "The older kid looks more like the mom.",
            "maybe i just am used to nuance in family dynamics but one of the first things i thought when i saw this was that she was a teen mom and the second child is his. not excusing the age (it's really more of a stage of life thing here) gap though",
            "https://preview.redd.it/vll8p4by728d1.png?width=959&format=png&auto=webp&s=5a4171dd47ae016f9755809ae75f77cc16b7ac83\n\nIts his, sadly",
            "There are no facts and I just realised this sub might be flooded by high schoolers and I’m going take my downvotes for the day. Hell the whole reddit, packing my bags and going to the corners they dare not visit. The news and history or something regarding higher education.",
            "Even better - she was 16 when the kid was born",
            "Check your PMs.",
            "She can't even drink yet",
            "That's her kid. Stop spreading lies. End child marriage",
            "Idk man her and the kid’s eyes have that Sid vision. But I was thinking he might be the step dad to the 4 year old",
            "Guys! guys! I found him ^^^^ the dude who brings up ages of consent!",
            "He is. Check out here tiktok: rosela.gega",
            "Or hers. Could be her stepson.",
            "Dude there’s other pictures of them when she was younger. Even if the first kid isn’t hers he still got with a 15 year old girl at 25.",
            "Idk why people are even assuming those ages are accurate!",
            "My guess? Church. That usually how it goes. Allows for regular interaction in an environment where the parents are much more forgiving.",
            "Doesn't make it better! I believe in 1/2 your age+ 7",
            "Hmm its a bit dodgy cause she'd still had to be 9 months pregnant so really they've probably been together closer to 5 years then 4.",
            "Also, the older sister could be a half sister from a previous marriage if the info is correct.",
            "Yeah I realize that but I actually met Mom and she looks to be about that age so at the very least he's half right.",
            "I said my mom was 90",
            "A majority of states have 16 as the age of consent. Cops wouldn't do anything either way.",
            "She's the STEP Mom. Right..?",
            ">They're nice people\n\nHe sure aint. Girl was 10.\n\nI dont care if you hold the door open for half the building every morning at work, it aint gonna stop you from being a pedo.",
            "Wait, he 13 year old child with the 23 year old!?",
            "My stepmom is 23.5 years younger than my dad and she’s only 7 years older than my sister and exactly 11 years older than me",
            "My Grandpa was born in 1902. His kids from his first marriage were born in 1929, 1932, and 1937. His first died in 1942 at 34. He then married my Grandma(born in 1919) in 1945. And then had 3 kids with youngest being my mom who was born in 1954. And my Mom ended up being 5 months older then her Nephew which is weird. But hey par for the course in my family as even with no illegal shenanigans, I share great-great grandparents with a lady who was born in 1916 while I was born in 1987.",
            "They aren't. They are Albanian, age of consent is 14....",
            "“Regardless of the law, you should have a moral obligation to not f**k children”… \n\nor you might be talking about how the FBI is only in America. In that case, yes, call the FBIs equivalent in their country and sorry for assuming you were saying smth else",
            "There's many states in the country that allow for minors to be married with thier parents permission. Which is sad.",
            "It doesn't matter if it was the United States. People are acting like child marriage didn't pass in several states. This is normal to alot of people.",
            "Hmmm, I don't know. They don't have wall to wall carpeting, at least we can assume they're not in the Midwest.",
            "Apparently they are from Albania.",
            "Call a Drone strike then?",
            "Eastern European or middle eastern. Maybe Turkish? I’m not gonna look up the laws.",
            "Truth, this is quite common in Central America. I’ve had several employees who had children at 15-16 and the father of the children were over 25 at the time.",
            "Does is matter, who gives a fuck about the legality from country to country, dude had two kids by getting a teenager (see kid) pregnant. \n\nThat's disgusting.",
            "Are we assuming she was the mother of the eldest? 🤷",
            "Yea it's Reddit. That's kinda how we operate. But even if they aren't, still gross.",
            "We're also assuming the numbers are correct, that those are her kids, and that those are *his* kids.",
            "Haven't you heard, m8? Age done has been nothing but a number\n\nUnless Mason is strapped to a chair in that room over there too, ain't no one gonna be able to explain them numbers either",
            "This implies the eldest was born close enough to the mother’s 16th birthday that they are still 20 in this photo and the rest of the math adds up. It’s gross.",
            "...depending on their birthdays she could've had that 4 year old at 15",
            "Age of consent for sex is 16 with an adult. If that person tried to take a 16 across state lines. They could be charged with such. But not with sleeping with them. If a 16yo wanted to marry an adult. They need their parents permission.",
            "It’s also possible that the 4 year old isn’t his child. She could have become pregnant with another 16 year old at the time who’s not pictured.",
            "In contrast, he got it wayyyyy too early",
            "Nope. All three are his kids.",
            "Hey, somebody else who knows some music theory! Cool! There must be like, at least 3 of us here!",
            "Wop wop wop wop wop!",
            "This is the third thread I’ve opened from as many subs where this comment was immediately viewable",
            "Only one cure for a pedophile and it ain't a jail cell",
            "Further? I think you meant buried deeper",
            "Further down you mean",
            "Sorry I’m not from Albania",
            "Age of consent is 14 here in Denmark too, but that doesn't mean that old people are allowed to have sex with kids, it's so that kids can legally consent to have sex with eachother \n\nIf Albania is anything like that then the guy belongs in jail",
            "Religion strikes again",
            "200,000\n\nPeople treat me like a fanatic for how hard I bash religion irl. I have no idea how shit like this doesn't even get their heart rate up, let alone inspire FUCKING RAGE at what they do to us",
            "I don’t understand why no one getting arrested for this?",
            "I don’t think incest is illegal for hammerhead sharks",
            "Lowkey when i first looked at the photo I thought these were four siblings who had massive age gaps",
            "I don’t understand how a person can be old enough to become a stripper, do porn, serve in the military, and vote but is too young to drink.",
            "> In a lot of places you can go clubbing legally at 18.\n\nAnd in India marital rape is legal. Just because some country arbitrarily says it's okay doesn't mean it's healthy or good.",
            "Pedophillia is okay because it’s not in the US? Wild take",
            "Once again the Balkans are proving themselves the shit hole of Europe.",
            "Being true doesn’t mean it can’t also be rage bait. \n\n*Why* do any of us need to know these people exist? Whose day was made better by seeing this?",
            "That's so gross",
            "The fact that 30 people upvoted that should ass question lol",
            "Found the step kid that was left out the family pictures.",
            "Turns out our better nature was wrong anf the man is indeed a creep.",
            "I think these people are just jealous and have some sort of hate fetish",
            "Even worse, they likely knew each other even before she was 15.",
            "You think Albania enforces drinking laws?",
            "That’s why you’re the left tesie not the right",
            "Or her uncle. White people are weird.",
            "It’s also posted on r/facepalm and I got more information there than here, and I trust it would explode people’s minds on here the little more I learnt. \n\nOh well, reacting off the idea of it central to ones morality/ethics is typical of people though so it’s expected.",
            "Hmmmm that is something to think about",
            "[deleted]",
            "Have you met Dad?",
            "They don't have time to search for every 15+ teen out having consentual sex. They would never do anything else.",
            "That’s what I see this here as. Dudes a creep but the law says he can fucking be one",
            "The best step-mom is the one you went to high school with.",
            "I don't think op was implying this person slept with a 10 year old and that said 10 year old gave birth to their child",
            "His kids 13, they're from an ex.",
            "Lolololol",
            "He's nice for a pedophile.",
            "Yeah, saying they are nice is lowkey supporting it.",
            "Earlier relationship",
            "My sister dated a 36 year old at 18. His son was 15.",
            "Been there. Weird feeling.",
            "My uncle's (65) 2nd wife is my age (38). He has 4 kids, but they are at least all grown by now. But when they first started dating the 2 youngest were still teenagers. Not quite as awkward, but still had to be kind of weird. \n\nShe's really nice though, and at least didn't insist on being called Mom or anything weird. But the first time I met her and someone said how old she was, I just said 'she is not! ' cause I thought they were just messing with me. That was a bit awkward lol.",
            "That's an appallingly low age of consent.",
            "Man, some things you just don't wanna let others know you know that kinda shit.",
            "Eww",
            "Yes, the second one.",
            "In the UK age of consent is 16 and I unfortunately know a lot of people who got pregnant at this age. \n\nThing is, it generally wasn’t to a 25 year old. That shit is weird.",
            "Germanys age of consent is 14.  I don’t agree with it but it is what it is.",
            "Ok but if they're in a country where the age of consent is 16 what would that country's equivalent of the FBI do? You need to call her parents",
            "Call the CIA",
            "Could be adopted",
            "Its weird to me how people believe 18 is suddenly adulthood. Legality does not mean morality. People suddenly stop being mad at 18 \"Eh, She is an adult\".",
            "This kind of age gap is common for Muslims, they even prize child brides as ‘pure’",
            "Wait, so it's cool to phone the feds 'long as it's on the peds?",
            "FBI got offices in every country they have a embassy. They called legats iirc.\n\nSo like.... FBI is in lots of countries",
            "Kentucky seems like it would be one lol",
            "Parents are dumb",
            "Thank you Republicans.",
            "The other reason this doesn't matter is no one knows if that's even his kid or not lol.",
            "![gif](giphy|3og0IN4ixNy3NrB4w8)",
            "Uhh, and?? No one is ever too young to bring the miracle of God's creation into the world!! The pain of your adolescent body being torn open just helps you feel how Jesus did on the cross and brings you so much closer to the Lord!!! Praise be!!!!\n\n--- unironically, some people in the 2024 GOP",
            "That’s is US. Are these folk in Albania?",
            "Not that I'm trynna condone pedophedidalia or ephedrinenophilia or anything, but what's illegal about crossing state lines with A Minorrrr?\n\nI guess if you're intending to sexually ensex them? But that seems hard to prove, like a mens rea type deal that seems easily \"we were just going to six flags and then I slipped and WHOOPSIE didn't mean to\" unless they're receipts or smpn\n\nDidn't Matt Gaetz do like almost this exact fucking thing and get away with it??",
            "But surely if she's 20 now and was 16 when she had the kid....carrying it to term takes 9 months so there's a good chance that dude was proper noncing her off.",
            "Yeah... Read that again \"his\" kid from someone else.",
            "Ok, yeah that’s not cool then",
            "![gif](giphy|kSlJtVrqxDYKk|downsized)",
            "Make that 4",
            "Dot, fuck em’ up!",
            "they're probably gonna do their stuff",
            "Preventative treatment so that they are better suited to acclimate to their mental disorder and reduce the risk of them perpetuating harm onto minors?",
            "Trans-orbital lead injection",
            "https://i.redd.it/pkxlh8h2n38d1.gif",
            "It’s what the jail cell is holding within",
            "Yeah u should be glad lol",
            "![gif](giphy|XzCP3hhQy9kQ|downsized)",
            "You hit the nail on the head there.",
            "Uhhh sweatie? Afghanistan doesn't just \"arbitrarily\" say that women should never go to school. GOD told us that, and we've got the MF receipts to prove it. Soooo stay slain, western ideologue /s",
            "We’re against raping children. What’s wrong with going clubbing at 18? The drinking age in my province is 18 and lots of adults from North Dakota come up here to club since they’re not legal at home until 21 for some reason.",
            "America loves mass shootings, doesnt mean its healthy or good.",
            "The reality is 18 is a completely arbitrary number. Why 18 and not 16, or 20? The human brain is fully developed at 25 so that makes the most sense to be a good age of consent, why not pick that?",
            "Even in the US. 16yo can be married with their parents permission in many states. Which is shocking. Because they can't give consent as a married minor for adult thing.",
            "So words in my mouth now? At what point did I say anything was ok, I’ve already addressed the child in other comments. \n\n18 is the drinking age in normal countries, you know the ones where association football is the biggest sport(so all of them not the US, save for a few lunatic states) so, going to a club at 20 is normal. You’re reacting to an image with ages and nothing else, how tf do I react to ages and get angry idk these people and looking at most of the comments neither do most people, the only insinuation of anything here is the Twitter Quote. \n\nLet me blow your mind again, we had day clubs growing up so at 15/16 go hit the same club the adults go to in the afternoon with nothing but soft drinks served 🤷🏿‍♂️",
            "What? You're not a fan of drug trafficking, child marriage, and endless ethnic strife?",
            "Albania is pretty middle of the road comparing to Europe.",
            "So you can see the sick realities of life? You shouldn't turn a blind eye to things just because you can't directly change them...",
            "Bro it's literally their child.\nThey are albanian Romani, child marriage is disgustingly common ",
            "You clearly haven't met Republicans",
            "THEN ITS NOT THE SAME!",
            "Please edit your original comment to mention that info.",
            "Idiot mention that in your first comment wtf",
            "And all the ladies say I'm pretty fly for a pedophile",
            "A lot fucking earlier. Jesus that’s not a relationship that’s rape.",
            "Ah, I dated a 38yr old at 24 who had a 16yr old daughter.\n\nThe daughter and I hit it off well but since he liked to hit me, I hit him with a RO.",
            "My quasi-friend was dating a 27 year old homeless meth addict at 16. They only stopped dating the next year because he went to prison. She got the fuck back together with him when he left prison 6 years later....\n\n^(He starts slinging out of an apartment and not like a week after they get together, she calls me crying because he and his mates \"accidentally\" shot an AR into the ceiling and the cops were coming and there are massive powder piles everywhere. Fucking winner, that one)\n\n^(at least no one died from negligent discharge like at my HS...)",
            "A lot of countries have super low age of consent laws, and it's usually down to individual counties/sub-states to designate higher ones.\n\nOff-hand, I believe (but could well be misremembering) Japan also has a national AoC law of 14, but each prefecture has raised it to various extents, and are all enforced extremely strictly (as with most other aspects of Japanese law, as the nation still has one of the highest conviction rates in the world).",
            "That was the age in Canada up to a few years ago ([2008](https://en.wikipedia.org/wiki/Age_of_consent_reform_in_Canada)). The rules seem a bit more reasonable now, allowing teens to sexually experiment with each other, while attempting to prevent predatory behaviour by people who are significantly older. Whether it works, I will leave as an exercise for the student.\n\nFun fact, when straight sex was legal with 14 year-olds, anal sex was only legal with those who were 18+.",
            "I remember being 14. Nobody should be fucking a 14 year old. Not even other 14 year olds.",
            "I think they've changed it now but the smallest country in the world has/had an age of consent of 10 years. If they have changed it it was very recent, like last 5-10 years.\n\nThat country is Vatican City...",
            "I mean, in the absolute sense mos def. Combined with an age range caveat-- i.e. 14yo floor combined with max 1000-day age difference unless both parties are over 18-- then I think that's pretty solid\n\nI mean I lost my shit in single digits and I turned out fine. Right? Right....",
            "Wait until you find out about American child marriage.  Especially  those without a lower age minimum  \n\n[child marriage ](https://en.m.wikipedia.org/wiki/Child_marriage_in_the_United_States)",
            "Hell it’s higher than it would be in America if the Rhode Islanders got their way.",
            "I guess we are also assuming that the guy is the father of the 4 year old. It's possible that she had a kid in high school with a boy also in high school. They broke up, and she started dating the older guy when she was 18 and they had a kid together when she was 19/20",
            "Oh ok 😮‍💨 sorry",
            "If she has a four-year-old at 20, then she likely got pregnant at 15 (assuming a nine-month pregnancy). Below the age of consent.",
            "I can't say how glad I am you added the second part. I've seen a worrying amount of people much older than 16 use the law's \"technicality\" to justify their attraction/relationships with 16-17 year olds.",
            "Damn U K over there, mateys? Cuz for US, A slattern'll get pregnant, a strumpet'll miss menstruation, enna streetwalker might forget the rubber when a John's trynna rub ha' 'fore she's finished blazing that crystal. But we got THE SELF RESPECT to be getting enbabilated at 18, yo. Grow up, Limewire enthusiasts. Y'all were dumb AF for switching off the lemons anyway, that shit had all da vitamin C and now y'all dumbahh getting that scurvy again. Yargg my yellow skinned bastards (to be clear, this is a jaundice-related scurvy insult and not racism)",
            "Only if the other is under 21. Otherwise its 16.",
            "**Age of consent should be 20 worldwide imo**. I’m 16 & I know a girl in my class who lost her v card at age 17. She’s a total douchebag and steals peoples hw to act like she’s smart. Kids get a little bit of 🐱 or 🍆 and act like they cured cancer. Nothing but entitled brats. \n\n##News flash: nobody gives a crap if you got clapped before you learned Pythagoras theorem. It’s sad, not a flex",
            "Lol I didn’t think of that. I would say call her dad to beat up the pedo, but people aren’t good at hitting themselves",
            "That's TV. The FBI's remit is only within the boundaries of the USA.\n\nYou're thinking of the CIA, but if it doesn't involve a revolution that advances American political or commercial interests they won't have anything to do with it.",
            "I only can give reference for my country. I'll let Albanians explain their marriage laws.",
            "When you cross state lines, federal laws begin to apply in addition to whatever state laws apply. Individual states have AOC as young as 16 (used to be less in some states), but the Fed govt says that it’s illegal to move anyone under 18 across state lines with the intention of having sex, regardless of state laws.\n\nSo, even if the you go from a 16 state to another 16 state, it’s a federal crime, but not a state one.\n\nFed laws do not apply without a “federalizing element,” which in most cases is the transportation (legally called trafficking) across state lines.\n\nIt’s called the Mann Act if you want to loom it up.",
            "Like many reckless people. She may have been knocked up a few months after dating.",
            "Read what I said again and you might get the joke.",
            "The 4 to a Bsus? E major?",
            "No, they're both implying that they think vigilante murder is 'the cure' but they think they can avoid the \"Don't celebrate or encourage violence\" rule by making vague statements.\n\nFortunately they're as good at sublty as they are at being moral people so it stands out and is quite obvious.",
            "So the long-term plan is for them to actively suppress their innate sexual preferences \"to reduce the risk\" of them diddling a kid? Sounds like best case they live a tortured life, worse case they slip up and destroy a kid's mental.",
            "Yeah lol let's spend the government budget on reforming pedos 😂.\n\nBullets are cheaper tho",
            "No",
            "I agree for the most part but once they actually do things with kids it's a whole other situation, and this guy did. ",
            "It’s a nice idea in theory, but how do you go about even finding people who could use this treatment before they’ve already committed a crime? It’s pretty much all or nothing with CP. Either you’ve accessed it or not.",
            "Proven and effective!",
            "FUCKING HATER PEOPLE. ALBANIAN NATION NUMBER ONE BALKAN ALBANIA BEST!!!!!! 🇦🇱🇦🇱🇦🇱\n\nSHQIPËRIA ËSHTË VENDI MË I MIRË I TË GJITHA KOHËVE TË DUA SHUMË TË GJITHË!!!!!",
            "Because they're HAMMERheads",
            "Pedantism: maximal cerebral volume is typically around 25 years of age for most, but brain volume does not determine executive, memory, emotional processing, and so on and so on\n\nIt's not a bad general guideline, but it's pop science that reddit loves. Your brain keeps \"developing\" well into maturity, just not increasing in size anymore",
            "Legality doesn’t equal morality though",
            "If you're American and saying this, fucking toptier comedy ngl",
            "People should be able to figure out he didn't impregnate a 10 year old\n\nLike it's possible but no one would just casually comment that about 'nice people'",
            "Please hop off my meat damn",
            "Drake?",
            "Dumbass he means the child was from an earlier, different partner, not the one who would have been 10",
            "No it's not one of those loophole laws. Like in Japan it was 13 (now 16) but only 13 year olds could be in relationships with 13 year olds. ",
            "Wait a second. It was a crime to have anal sex in Canada?",
            "Wow. Not even fuck the LGBT, lezzos are fine so long as they keep frontal. Just fuck the gays, I guess. Or rather, frot them? If you're not trying to go to jail\n\nIronically, jailing ho-males would probably only serve to increase the aggregate assfucking of the Canadian state",
            "Wish a responsible adult had told me that prior to having pregnancy scares at 13",
            "My sentiments exactly",
            "You cannot be fucking for real with that. That is comically fucking wrong on so many levels",
            "It was appallingly low at 12 before 2015 when they raised it (outside of marriage to 18) - within a marriage (deemed so by catholic CB church) it’s 14…. So many issues here",
            "Maybe she's not the bio mom? Or maybe she's his daughter and he got started making babies when he was 9.",
            "Were also assuming the numbers are correct and not fake, a 20 painted above her head isnt a valid form of ID",
            "Yeah,  this age gap is pretty sus on it's own, but it may not be fair to assume these are both the biological parents. \n\nI have a friend who got knocked up at 16. Her kid was that age when I met her so I don't know all the lurid details of her teen pregnancy (e.g. the age of the dude), but the sperm donor skipped right away.\n\n It's also possible the guy got an age-appropriate woman pregnant, then hooked up with a teenager and convinced her to be mommy. \n\nNot a good look for him regardless...\n\nETA: fixed confusing pronoun",
            "Imagine not even being able to legally drink and already having your pussy busted up like that",
            "Not in Germany unfortunately",
            "I'm pretty suspicious of grown ass adults who have an odd interest in the exact age of consent in various locations and/or like you said, claim it not being illegal makes it automatically ethical. \n\nThere's no magical age when someone flips from being a child to an adult, and I think anyone who has been both a child and adult can attest to that - which makes it so much grosser when you're a grown ass man acting like the day someone turns [x age] they are suddenly more able to meaningfully consent to sex than they were the day before. \n\nThe law is not, and has never been, a substitute for ethics. I do not know the exact age of consent in my state because guess what, I'm not trying to get involved with teenagers!",
            "What?",
            "Dude you're weird.",
            "That first paragraph was:\n\n![gif](giphy|2WH9DiLg2o1MYuKlEB)",
            "Are you having a stroke",
            "Things will get better kid don’t worry ❤️",
            "If you didn’t learn Pythagoras’ Theorem long before you were 17 then yes you should indeed not be having sex because your learning disability is a far more pressing issue.",
            "If you wanna go there, the human brain doesn't stop maturing until around 25. I advocate for that to be the limit",
            "We should jump him when he's out alone",
            "Nah not tv. Its fr \n\n They're legal attaches. They international offices of the fbi stationed around the globe. \n\nTheres one in my country in our Capital.\n\nThe main office is in Canberra Aus and a sub office in Sydney with the other sub office in my country. That's only for a bunch of countries in the  Asia Pacific region  tho.\n\nIts managed by the International Operations Division of the FBI in washington",
            "I only know this bc of watching two episodes of that \"The Dark Tower\" or whatever the fuck show about the CIA and FBI being little whiny toy-hoarding petulant children who let 9/11 happen because they both wanted clout from the associated collars\n\nDon't judge, watched it with my father before he left. He was gone for so long... But hey, who hasn't picked up a triple shift before?",
            "Yeah. Really confusing! Thanks.",
            "Thank you for the thorough and informative response\n\nA little searching has led me to learn that the Mann Act was originally entitled the \"White-Slave Traffic Act of 1910\". Cause when the honkies are in chains, then slavery becomes a realllll problem, amiright?/s /s /s\n\nForgive me if this is excessive to share, but two Wikipedia pages away from the Mann Act had a section on \"white slavery\" with this excerpt in reference to the influx of white Circassians into the sex slave market as a result of the Circassian genocide:\n\n> \"Turks that many who cannot afford to keep several slaves have been sending their blacks to market, in order to make room for a newly-purchased white girl\"\n\nJust what the absolute fuck. You're not only going to be a sex slave owning piece of fucking trash, YOU'RE GONNA BE A RACIST SEX SLAVE OWNER??? What the fuck Is thisssss",
            "Make that 4 music nerds, now 5 including you",
            "This is a really fucked up way of looking at mental health. We gonna start killing people that committed 0 crimes because they might commit one some day?",
            "So what, we just start shooting people with mental illnesses if it could cause them to hurt a child? \n\nit’s not ideal to wait if they molest a kid to punish them, but punishing people because they may commit a crime is so fucking stupid for reasons so obvious that they shouldn’t need to be explained. If you are American you should especially know why that shit is stupid given our history with lynchings.",
            "Shit like this is why they don't get therapy and just become offenders",
            "It’s what they prefer spending their money on anyway!",
            "So it's better that somebody gets hurt before the problem is solved?",
            "If we're not just doing \"hehe kill all da pedos chomo gen pop stabby stabby haha\"\n\nThe actual solution is that we need to give these people a clear, safe offramp to get mental counseling AS SOON AS those feelings are an issue which I imagine would probably be puberty? Every other sexual type thing kinda starts then so unless pedophilia has to like, develop? Like a fetish does, then we need to actually be talking to kids about what is and isn't acceptable and give them a path to seek help for fucked up thoughts\n\nIt shouldn't be like underground or wickedly stigmatized for someone WHO HASNT DONE DEPLORABLE SHIT to seek help TO PREVENT THAT. It needs to be known that you can and should seek help for those thoughts. At the moment, we just pretend like people with these urges don't exist and it drives child abuse ngl\n\nSoooo many people will read this and say \"nah fuck pedos\". I hate that shit too, bub. But if you don't get these people help, you're essentially letting them loose on the fucking kids yo. Do you want to risk helping a pedo-in-the-making even if you feel gross about it or do you want to risk a kid being permanently scarred? Obvious choice to me",
            "If you keep implying that they deserve death for having a mental illness there's no way for them to get help because they're afraid they'll be killed for trying to get help to not hurt a kid. \n\nAlso, insisting on capital punishment for rapists means that they're more likely to kill their victims. A dead victim can't go to the cops. \n\nWe really need to have a way for people that suffer from the mental illness that don't want to offend to get help.",
            "Least patriotic Albanian ♥️",
            "It's true, I was just using that as another example of an arbitrary number. People talk about 18 years old as if it's a magical age that turns you into an adult, but that's only true legally. You're the same person on your 18th birthday that you were the day before.",
            "In this case. NO because she can't exercise her agency to leave that adult as a minor.  If this is overseas. 16 is considered to be an adult. If she is exercising her agency and not being coerced.   We shouldn't confused morality with just not liking something between two adults.",
            "You mean to tell me Dred Scott v. Sandford DIDN'T make owning human beings \"totally chill and shit\"?? /s /s /s /s /s\n\nI'm not trynna be an asshole saying that, I just find it whack that anyone needs to say what you said on this sub of all places. Haven't black folk seen your statement in action like a thousand times in our history books?",
            "Redditors want to believe the worst and most outrageous reading of anything.  That's the nature of social media.\n\nWe don't know that this woman is the mother of either of these two children.  \n\nThis could be the uncle of the children (aged 4 to 20) that's taking a picture with his nieces or nephews.  The guy could have kids from a previous relationship and the 20 year old is his rebound.  They may be babysitting, it may be a spontaneous photo at a family event where they're all cousins to one another.\n\nBut nah, Reddit wants a pedophile thread so you will be very unpopular if you try to take that away from them",
            "It just makes it sound like your friend is a pedo when that isn’t the case.\n\nAlso 1 comment is hardly “on your meat”.",
            "Why did you delete your comments?",
            "Evil 😈 🇻🇦💒 often has a comedic twist to it.",
            "Maybe they're all brothers and sisters, somehow",
            "Those eyes say different",
            "Heyyyy. She just sucked at math. And I really, really tried to help with that but when she looked me in the eyes and told me \"gluten is the third leading cause of cancer\" one day, bright-eyed and in all sincerity, I knew I had to end it\n\nI wish I were joking",
            "Fr. She dumb asl too. Just a leech who dates guys for money and starts beef with my friends for no reason.",
            "I don't wanna be that individual but imma be that individual and state that the \"25 and ya brain done cooking\" is kinda pop science. 25 is typically the age of maximal cerebral volume but that does not directly correlate with executive function, memory, cognitive efficiency, etc.. I'm not even sure it correlates with anything tbh\n\nYour brain keeps developing well into maturity and unless y'all are trying pull a Ben Franklin and start fuckin on them grannies....",
            "A very Reddit reaction to seeing a happy family of four",
            "They do be putting in work too.\n\nI read the other weel of a huge international crime ring brought down in another country because da fbi had taken control of a messaging and secure phone supplier that a crime syndicate was selling so they had all the info on what the ppl who bought the phone was  doing, like bang bang for hire n drug trafficking type shit\n\nHad interpol and police in other countries in on it too.  It was wild",
            "I stand corrected.",
            "Sounds like they want a lynching, as long as they're the lynchers.\n\nSeems like someone hasn't learned from history...",
            "Copy and pasting:\n\nIf we're not just doing \"hehe kill all da pedos chomo gen pop stabby stabby haha\"\n\nThe actual solution is that we need to give these people a clear, safe offramp to get mental counseling AS SOON AS those feelings are an issue which I imagine would probably be puberty? Every other sexual type thing kinda starts then so unless pedophilia has to like, develop? Like a fetish does, then we need to actually be talking to kids about what is and isn't acceptable and give them a path to seek help for fucked up thoughts\n\nIt shouldn't be like underground or wickedly stigmatized for someone WHO HASNT DONE DEPLORABLE SHIT to seek help TO PREVENT THAT. It needs to be known that you can and should seek help for those thoughts. At the moment, we just pretend like people with these urges don't exist and it drives child abuse ngl\n\nSoooo many people will read this and say \"nah fuck pedos\". I hate that shit too, bub. But if you don't get these people help, you're essentially letting them loose on the fucking kids yo. Do you want to risk helping a pedo-in-the-making even if you feel gross about it or do you want to risk a kid being permanently scarred? Obvious choice to me",
            "They become offenders because they're fucking sick and if they wanted therapy they would get it either way",
            "This dude is literally crying about pedos. lol Y’all been saying this therapy shit a lot recently. Therapy has always been available. If they felt like they needed it they would get checked in. But they don’t. Instead they come online and spread and talk sick shit.  I can’t imagine being this upset over what conscious boot said.",
            "If a bullet isn’t enough to keep you from acting on pedophilic urges you deserve the bullet",
            "What percentage of pedophiles identify themselves and seek treatment before committing child sex abuse or perpetuating the Exploitation of children by consuming illegal child pornography?",
            "You can't reason someone out of a position that they didn't reason themselves into.\n\nI'd guess that most people who jump on the \"yay, kill pedophiles\" karma train simply do it because it's popular to say and let's them feel edgy and moral.\n\nIt's not a rational position arrived at by examining the situation and determining the best possible outcome.\n\nThey're not much different than members of a mob.",
            "Oh for sure, totally get you. It's a stupidly petty thing for me to even mention anyway ngl but I'm a simp for unnecessarily specific detail ig lol",
            "People seem to commonly conflate ehebaphila or just huge age gap relationships with pedos.  No one can ever explain the immorality of this either when its two consenting adults, just that they don't like it or some projection about their own selves/children at that age.  Not everyone matures the same.",
            "More probable? The numbers are all made up to stir shit.\n\nShe looks closer to 30 than 20.",
            "[deleted]",
            "🤓",
            "Did you like this girl or something cause this seems personal?",
            "Ngl oi. I thought them having offices in other countries was some tv show stuff as well.\n\nIt's pretty OP iibh",
            "Aye, gold old fashion mob law. /s",
            "you can't imply we should murder them and then say \"If they wanted therapy they would get it\"   \nIf you make the conversation sound unsafe for them, they will not have it with you. They will seek guidance from other people who are like them, many of whom are fucking crazy. Then those super crazy people will become their new normal. This is how cults work, how politics work, how literally any interaction between groups of people work.",
            "> Therapy has always been available.\n\nLie #1. \n\n>  I can’t imagine being this upset over what conscious boot said.\n\nLie #2.\n\nCan he make a hat trick?",
            "This is a pointless question when the system is not set up in a conducive manner for these people to self identify and seek psychiatric care. Many people with that affliction probably don't even know they can get mental healthcare to help stop it\n\nCopy-pasting another comment:\n\nIf we're not just doing \"hehe kill all da pedos chomo gen pop stabby stabby haha\"\n\nThe actual solution is that we need to give these people a clear, safe offramp to get mental counseling AS SOON AS those feelings are an issue which I imagine would probably be puberty? Every other sexual type thing kinda starts then so unless pedophilia has to like, develop? Like a fetish does, then we need to actually be talking to kids about what is and isn't acceptable and give them a path to seek help for fucked up thoughts\n\nIt shouldn't be like underground or wickedly stigmatized for someone WHO HASNT DONE DEPLORABLE SHIT to seek help TO PREVENT THAT. It needs to be known that you can and should seek help for those thoughts. At the moment, we just pretend like people with these urges don't exist and it drives child abuse ngl\n\nSoooo many people will read this and say \"nah fuck pedos\". I hate that shit too, bub. But if you don't get these people help, you're essentially letting them loose on the fucking kids yo. Do you want to risk helping a pedo-in-the-making even if you feel gross about it or do you want to risk a kid being permanently scarred? Obvious choice to me",
            "I asked first.",
            "With wide age gaps, the issue is with power dynamics.  Like with dating your boss.  Or Professor.  \n\nExactly how bad this is depends on what the gap is.  30 and 50?  Whatever.  20 and 40?  What the fuck.  \n\nThe idea is that the younger of the two is particularly liable to be manipulated by the elder with such gaps.  With transactional relationships (golddigging), I think some folks are less concerned.",
            "Because that’s kinda the concept of the post. Also, many other people made the same assumption in the comments.",
            "Oh your a circlejerk troll. Got it.",
            "🤷‍♂️",
            "She’s beefing w/ my bsf (who is also a girl and 17 years old but not an underage sex haver)",
            "Stop pinning the blame on others. If they felt remorseful and guilty for the way they feel they would seek out help instead of seeking out “people who are like them” (your words) that’s called doubling down. And no one is at fault for that but their own damn self for what comes after",
            "Most men like the guy in the OP are not actual pedophiles (into pre-pubescent children) despite the widespread misuse of the word. If his attraction to her was in anyway paraphilic, he wouldn’t still be with her. He would have dumped her and moved on to another girl in the same age range she was in when they got together. He’s just the type of guy who likes them young (but not *that* young) because they’re easy to manipulate and trap. He doesn’t have a sickness, he’s just a disgusting groomer who wants somebody who isn’t mentally on his level and is easy to control.",
            "I think those who self-identify should be sent to therapy, but also placed on a registry to ensure they do not have access to minors. \n\nThose convicted of committing child rape, molestation, or possession of child pornography should be punished to full extent of the law, with no chance of parole... and hopefully they will be handled more permanently once they are behind bars.\n\nI deal with this stuff in my job, so I don't have much forgiveness",
            "So the power dynamic is okay as long as she gets money out of it?  Not sure how that equalizes anything, nor how either of those things speaks to morality.  Maybe people conflate authority with moral virtuosity as well.  See it is one thing if there is something of a conflict of interest.. Like a professor and their student.\n\nYou'll also notice that in both examples you gave the age gap is exactly the same.  Now granted that could be said for a 21 and 1 yo, and that should be obvious to everyone why that is wrong.  But when it comes to mentality after a certain age and social dynamic the whole thing just feels like some weird form of sexual gatekeeping.\n\nEspecially as when I was 20, most the women I knew were dating men closer to their 30s, and that was okay.  For them.",
            "[deleted]",
            " Not even 50 years ago, homosexuals were being shocked to try and get the gay out of them. 20 years ago in my neighborhood, calling someone gay was fighting words. Even today, some groups actively target and attack people for being gay in the wrong part of town. \n\n\nA lot of them felt that it was dangerous to come out, so they sought refuge with others who they knew wouldn't treat them that way. And they still can't tell just everybody that they're gay, they usually pick and choose who knows. That isn't doubling down, it's common sense for your own safety.\n\n\nIf someone has a behavior that society classifies as \"deviant\" and then ostracized them for it with threats of violence, do you expect them to be comfortable telling that same society their problems? Can't complain deviants aren't doing the right thing when they aren't given the chance to do the right thing",
            "Dude you are fucking sick for defending this guy..have you seen the picture where she was younger? She literally looks like a child. “He likes them young” to even describe it that way when she was literally 15 when she got pregnant is sick. They likely knew each other even before then. To defend this by bringing up because he’s still with her now (if the 5 years passage of time was long) as if to say that makes it okay is fucking sick and deplorable. You do know this kind of idea could be applied elsewhere right? For example, in countries like in the east where men get their child brides even younger? 🤢  so what exactly are you trying to say? That a 25yr old man fell in love with a 15 he old girl just because he hasn’t dipped yet?",
            "Maybe you should have a different job if you think that they should\n\n>be handled more permanently once they are behind bars.\n\nExtrajudicial killing in prison is still wrong. And insistence that they should be dealt with with capital punishment is why so few that have that mental illness come forward to therapists. If the threat of trying to get help means getting threatened with death then why would anyone self identify?",
            "I still don't like wide age gaps with that stipulation (golddigger).  But as for why there's less heat about such relationships, I reckon it's because the concern of an uneven relationship is lifted.  \n\nBack on the topic of age gaps in general, I want to stress how a 20 year old and 40 year old are very likely nowhere near the same level of mental maturity.  A 30 and 50 likely have less distance in this regard.  Hence why 30-50 would be seen as less bad than a 20-40.  \nThose early 20s girls dating late 20s guys are liable to be a fair bit less mentally mature than their bf.  Exactly how much of a gap there is is pretty variable, though, so I'd have to refrain from judgement until I knew the two better."
        ]
    },
    "at least Mary was given the heads up ahead of time ": {
        "title": "at least Mary was given the heads up ahead of time ",
        "score": 5459,
        "url": "https://i.redd.it/vfl9hi8n118d1.jpeg",
        "content": "",
        "num_comments": 664,
        "comments": [
            "No, sometimes that’s completely normal for someone. My sister in law tried to get pregnant for 10 years, usually got her period every 3-6 months. When she went in for her yearly check up, found out she was 7 months pregnant.",
            "My mom said she didn’t know she was pregnant with me until she was 7 1/2 months, she wasn’t a plus sized woman and she said she got her period regularly. It was only when she went to get her tubes tied that they told her aht aht, should have been quicker than that.",
            "Many of these women often have bleeding that can be mistaken for a period or conditions that make skipping periods expected (if you want a million examples there’s a show called “I didn’t know I was pregnant”) \n\nEdit: I also know of a case with a trans man, and I think in his case he thought his periods stopped due to his hormones iirc ",
            "Actually know someone who had a cryptic pregnancy, never missed a period, didn't have noticable weight gain despite being pretty petite. \n\n\nBasically went to the hospital with abdominal pains, she and her husband had to come back home with a baby they were absolutely not expecting. Shit was WILD.",
            "Whew! We gotta do a better job as a country teaching people about the reproductive system. I have pcos and especially during periods of intense stress I can go long stretches without a period. That’s just one of many many reasons why women may not get periods, so not having them doesn’t inherently make her clueless.",
            "cryptic pregnancies has yall confused asf. Idk if I’ll be happy or not. 9 months with zero symptoms sounds amazing but being unprepared for said baby idk.",
            "One of my dearest friends went to the hospital thinking she was a month or two along (shed just started dating a new guy). Turns out she was 28 weeks. Normal-for-her periods the whole time. \n\nOur bodies are wild, man.",
            "Local man discovers not every woman has a period every month like clockwork",
            "Cryptic pregnancies often come with regular periods",
            "My mom still bled when she was pregnant with me",
            "Please go back to school. It is very possible for a woman to still have break through bleeding during a pregnancy. This woman also could have an abnormal cycle etc. there’s a lot of women who don’t know they are pregnant until giving birth or until months into the pregnancy with absolutely no symptoms.",
            "There is a pretty sizable list of stuff that can interfere with birth control, including the fact none of them claim 100%  effectiveness.",
            "Did she say she didn’t get her period for 9 months?  Or is this just another case of a man being loud and wrong when it comes to talking about the female reproductive system?",
            "All of you jokesters in here with these out of pocket comments need to be suspended from school immediately...🤣😂😅",
            "All you can birth all for around 10 bucks.",
            "I've read enough of these stories to know that a lot of women bleed during pregnancy.\n\nI didn't, and it surprised me when I realized how common it is. But I've read too many stories about this to doubt it.",
            "Normal men with no medical experience commenting on this like they sway is hilarious.",
            " [Arkansas is rated #38 in education and #47 in healthcare](https://www.usnews.com/news/best-states/arkansas) and [Completely gutted their sex education programs in school](https://ny1.com/nyc/all-boroughs/education/2023/10/06/stricter-state-laws-chipping-away-at-sex-education-in-k-12-schools).",
            "I have a friend who regularly goes months at a time without a period and she doesn't sleep with men. So yeah, missing periods aren't always an indication",
            "I was a cryptic baby, my mom found out she was pregnant after falling down bleachers at a pep rally and going to get xrays. They did a pregnancy test before the xray and she was 100% pregnant, and because of the fall, also in labor. My mom was 105lbs and very active in sports including soccer and judo. she only gained 5lbs with me during her pregnancy and had something that simulated a peruod. I was born 4lb premature baby that day. She literally went from A high school student to mom In the same day.\n\nShe was obviously in shock and when asked what she was going to name me she said starfish because of the nautical calendar in the room. Thankfully my gram was present and said hell no. That settled on my name shortly after.",
            "r/nothowgirlswork",
            "That comment shows exactly why men with no medical training should be far away from making any law that involves a woman’s body…",
            "I remember my health science teacher using that as a scare tactic so we would practice abstinence...it didn't work. But all jokes aside it happens more often than you would think.",
            "All the people here asking “sHe DiDn’T hAvE a PeRiOd FoR nInE mOnThS??”\n\nGO READ A BOOK AND EDUCATE YOURSELVES ON FEMALE ANATOMY.",
            "She’s gonna name that baby “Corral”",
            "Women's health is poorly studied.  Yes it can happen.. ",
            "Had a coworker with cryptic pregnancy. She wasn’t even aware she was pregnant. \n\nNext we know she was sent to the hospital during work. Like she had old photos and she was in the chubby side. But she really didn’t looked pregnant at all.",
            "My aunt who struggles with endometriosis and PCOS would often bleed for weeks at a time and then not at all for months. She had a couple of miscarriages unfortunately and basically stopped trying to get pregnant. She had an irregular \"period\" as normal. She didn't know she was pregnant with my cousin until she was about 7 months along. He was born prematurely but otherwise is a very healthy 14 year old now.",
            "You can bleed and still be pregnant. Also it is very common for your period to be irregular, so a woman can get a period and by like \"WHEW!\" thinking she dodged a bullet and not even know she is in fact incubating.\n\nAlso our weight fluctuates, and some women never show.",
            "New menu item just dropped on the buffet… literally",
            "Lord please don’t let her name that baby some derivative of “Corral”",
            "I gotta stop eating at the Golden Corral 6 times a week, I look like I’m preg…. 💦💦👶🏾",
            "It’s a sad reality. The youth isn’t fully educated on the human body let alone sexual reproduction, and the menstrual cycle.",
            "There's an entire show dedicated to wild pregnancies that were not discovered until late, up to when labor began.\n\nUsually the women have irregular cycles and had one or two light bleeds that they chalked up to a period\n\n[Mama Dr Jones \"Didn't Know I Was Pregnant!\" playlist](https://youtube.com/playlist?list=PLVH2Gpf8wKeTbznebDBWEQcU02kuLGCOu&si=LWlhzPGH-8Eq9SAU)",
            "oh yeah, these. it’s hard with skinny women, but apparently the baby can grow standing up or something, and the pregnant keeps bleeding, which is why she doesn’t know she’s pregnant",
            "There is no humour in these threads, just facts",
            "I haven’t gotten a period in over two years…. The body is amazing",
            "Ever heard of PCOS? 🤣",
            "Cryptic pregnancies do exist and are common enough that they dedicated a whole show to the topic. Some women still bleed monthly and associate that with being their period, some woman don’t gain weight either. In fact, there were a few cases on the show where women actually lost weight during their pregnancy. Due to where the baby is located, women with a cryptic pregnancy do not experience movement at all. People may not experience other symptoms like cravings as well. And then you also have the fact that false negatives are a lot more common than false positives which was also highlighted during the show. Women’s bodies are so freaking complex and this isn’t something where you can say that “she should have known based on her lack of period” because millions of women experience irregular periods. Then you have some women who have not experienced a period in years, if at all. Like damn, we are not a monolith and issues surrounding gynecology are so common that they have their own dedicated field in medicine.",
            "I usually have a period 3- 4 times a year, sooo me thinking oh I’m having one of those moments again… so when I got pregnant I had no idea… I found out because I went to ER because I had broken my arm from a car accident… that is when I found out  I was 29weeks pregnant, they had me to pee in a cup before they could do the xray…like ya’ll don’t understand how grateful I am to have had a healthy 9 lb baby boy, who is now 7 years old! I never felt any kicks(or least I didn’t know what to expect) no weird cravings but grapefruit juice( me thinking my body was missing a vitamin)..I noticed that I was tired more than usual but I thought it had to do with me starting to run cross country, I only noticed that I couldn’t fit a few of my jeans but that’s it nothing major, no leaking nipples, no hurting nipples, no change in blood pressure or eating habits, like it’s the weirdest shit to me til today!!! I grew up watching that show unexpected pregnancy or whatever it was called… never would I have ever thought that this would be me!!!",
            "Man a Golden Corral is a hell of a place to give birth. You think people stopped eating, or was it like dinner and a show.",
            "I was pregnant with twins and didn’t find out until I was 5 months",
            "Our school system has failed us. Some of these replies are depressingly stupid.",
            "Damn op. Can tell you have never been with a woman.",
            "Oh now this post is here. Time for more men to embarrass themselves.",
            "I thought this sort of thing was common knowledge, but I guess not.Surprised it made the news, but maybe the location is somehow interesting? Lots of ignorant people in the replies",
            "Could have an iud.",
            "Thank god she wasn’t at Cracker Barrel.",
            "Sister has a friend from high school that told her parents she was in grave pain and thought her appendix was bursting. Rushed her to the hospital at 2 am. Nope. Baby. \n\nNow…she was a bigger girl so the weight gain wasn’t noticeable. And she always wore a hoodie and baggy clothes so it was well disguised. And she said she had her period throughout…. Swore she had no idea and that’s why she drank and smoked and used drugs the whole time. \n\nBut she was also a nutcase. Like hit a car in a parking lot and drove away, while my sister was in the car with her. And told everyone someone hit HER and drove off without a note. And like then a year later asked my sister, “remember when someone hit my car in a parking lot and didn’t even leave a note?”  My sister was like “that was you!  You hit a car and didn’t leave a note. I was with you, bitch.”  \n\nSo it’s unclear which version of reality she was in with her pregnancy. There was also potentially some trauma around the conception, which might have also led to the disassociation. \n\nWhat I never got, though, is don’t you feel the baby kick??  I’ve managed to avoid pregnancy for 43 3/4 years, so I think my streak will hold - knock on wood - but I’ve heard it is a definite *sensation* like no other. And sort of constant. Granted, that baby was a little fucked up on account of the drugs and alcohol and smoking, but I assume it kicked. \n\nCan you just ignore the kicking? Legit question. Like, can you write it off as just constant tummy bummers for 4 months or whatever? (I have no idea how long babies kick for).",
            "I  had super irregular periods, literally all of my life. So, it was a complete surprise when I went to the ER for severe stomach cramps and found out ,via ultrasound, that my daughter's head was in the birth canal. I had her right in the ER on the same stretcher they rolled me in on. \nI was placed on the implant birth control a month after she was born. \nNow, my periods come every month but they last the entire month. I may get one or two days between them.",
            "r/nothowgirlswork",
            "My ex wife found out at 5 &1/2 months we were having twins. She had no symptoms and was a little bit chubby at the time, but absolutely nothing out of the ordinary or \"noticeable\".  Then 3 weeks after we found out, she became a human beach ball.",
            "Knew a girl who would have her period every 3 months and it would only last for like 4 days.",
            "I mean… if she was underweight or super stressed or just not educated about her body or a host of things, she may not have known",
            "Her expression says it all 😂",
            "Silly men. It’s always funny trying to see men be smart asses about the shit they know the least about when it comes to women. Wait til they find out that not only is it possible to still have periods while pregnant, it’s also possible to carry the baby so far back into your spine that you never show until that baby pops out the cooter.",
            "Golden Corral new slogan.",
            "[deleted]",
            "I don’t know if I could handle my origin story having anything to do with a Golden Corral. No gracias.",
            "GC seasoned up the umbilical cord and tossed with the throw away cuts on the grill…",
            "I’m in LR and haven’t heard this",
            "I have pcos and haven’t had one in over a year. It’s not normal but it does happen to alot of ladies",
            "She’s very small so not at all surprising.",
            "Some women don’t get frequent periods one of my ex’s only got like 3 a year",
            "Her face:\n\n![gif](giphy|NBPhWGmDS1Kuc)\n\nJust hoping to wake up from this fever dream any second",
            "Fucking golden corrals",
            "Cryptic pregnancy?",
            "Definitely do NOT vote for Trey P if you see his name on the ballot",
            "Youngest of 5 kids, mom didn't know she was carrying me until around the 5-6 month mark, she had her period etc. \n\nWomen's bodies are weird yo.",
            "She looks mad af",
            "not sure if 9 months is normal but we didn't know my wife was pregnant until 6 months in.",
            "tell me you've never been in a serious relationship without telling me...",
            "That’s not the shrimp she had in mind when she stepped in that day",
            "I knew I was pregnant with my child (planned/IVF/closely monitored) *but* a few things happened that made me realize it is very possible for someone not to know. They include:\n\n- She was behind placenta (my uterus was positioned behind the placenta) so I unfortunately very rarely felt her move even though I was hyper aware of it because I wanted to feel it\n\n- I had a subchorionic hemotoma which lead to heavy vaginal bleeding (I have heavy periods and it mirrored a very heavy period)\n\nNow, I threw up literally every day and became as big as a house (it looked as though I wedged an oversized beach ball under my shirt, cushioned between two pillows) but I’ve seen pregnant people who barely looked pregnant. One who comes to mind is a woman I used to work with who’d tried for a second child for years and then got pregnant but it was high risk and she didn’t want to tell her extended family about it but felt okay telling her coworkers. Anyway, she was like 6 months pregnant and coming into working complaining that more than one family member had taken her to the side to tell her they were worried about her weight! I don’t know if she’d lost a lot of weight in the past or had a history with complicated weight issues, but it was wild that her family members did that to her and that she kept a straight face and didn’t reveal her pregnancy! But, you honestly couldn’t tell she was pregnant at six months. She honestly just look like her mid section has filled out a bit in that way that happens when a person gains weight!\n\nTLDR: Sometimes, in pregnancy, you do have vaginal bleeding and don’t feel a baby move and you may not even look pregnant.",
            "My ex went 2yrs without one. No birth control just didn't have one then had one that lasted 2weeks then 7 months without one again l. Women's bodies are weird.",
            "Realistically, she probably knew deep down but didn’t wanna quit bad habits so didn’t take any tests and played it off like she didn’t know.",
            "I have a close friend from high school who had no idea she was pregnant until she went to the doctor because she was having bad cramps and found out she wasn't just pregnant but PREGNANT. She had her baby two days later. It happens way more often than people realize.\n\nShe had never had a regular cycle so not having a period for several months wasn't new to her.",
            "Name it Buffee",
            "Damn, the look of confusion still on her face is wild as fuck.",
            "She could’ve been on birth control and just became used to not having periods.",
            "Now THAT is a facial expression of a confused person.",
            "Y'all out here talking about cycles and birth control, and there i am wondering how she missed the 20+ pounds of extra weight she gained in the process and the giant stomach. I have never seen a 7-9 month pregnant woman and thought \"she looks too thin to be pregnant. Every single one if them look like they're carrying a thanksgiving turkey under their shirt, and in one case a protruding watermelon.",
            "As a man with kids and a wife. These men up in here and that post... don't fuck. Or at least don't know any women.",
            "From what I understand sometimes women can have \"normal seeming periods even while pregnant, and some women have been known to LOSE weight during pregnancy...\n\nSource: I have no fuckkng clue what I'm talking about.",
            "Could be a rape case and a social judgement on the south taking away abortion rights...",
            "My grandma gave birth to my aunt when she went to take a shit and a baby came out instead. Had no idea she was pregnant. My mum was 7 months gone when she found out she was pregnant with my sister(had periods all the way through and didn't put on weight).\n\n\nAs a child free woman, these are the things that keepe up at night. ",
            "Periods can be a funny thing sometimes. I have a hormonal disease that made me lose mine for nearly two years. I just got it back through lifestyle changes.",
            "Also, if you are over the age of 40 it's very likely that your periods have become erratic and incredibly hard to track or predict. I'm at the early stages of pre-menopause and I'll go several months without one, the have two barely there ones in a month and then go months again. \n\n\nIt's alarming how little men know about women's bodies",
            "A friend of mine didn’t have a period for years after her first cycle and was told she was infertile when she was 16.\n\nThat was the same year she got pregnant her first child.\n\nHe was the first out of three child.\n\nHer hormones are so out of wack, she shouldn’t be able to become pregnant.\n\nI think she bleeds every few months now, but her periods are still far from normal in every way. If she didn’t have three surprises already, she’d probably still be told she’s infertile.\n\nAnother friend’s now wife has the same condition and was told the same thing. She got pregnant after their first time together.\n\nThen there are women who spot during pregnancy and confuse that as a period. There are even women who know they are pregnant then bleed and freak out thinking it means she miscarried.\n\nBodies are weird.",
            "It's *really* common for women to give birth who didn't even know they are pregnant. Talk to anyone who has worked in an emergency department or labor and delivery. It happens all the time. This is only news because she gave birth in a Golden Corral.",
            "I’ve gone an entire year before without a period; not pregnant, not on birth control, just stressed. And my “normal” cycle is really weird, too; it isn’t that odd \n\nI’d be more confused about if she experienced any of the other symptoms like breast swelling/tenderness, change in appetite, more sensitive sense of smell, etc",
            "drugs, bad eating habits, BEING UNDERWEIGHT, lots of reasons girls dont have periods or extremely light ones.",
            "That is my biggest fear. I'd be at the fire station so fast. Or my bd doorstep.",
            "I’m a midwife. I cannot count the number of patients who’ve come in for an IUD with a 2 or 3 month old baby at home, and whoops, sorry, this uterus is already occupied. I’ve also had countless patients who come in for their regular wellness exam and I do their pelvic and whoops, this uterus is hella occupied, and an ultrasound dates the fetus at 6 months or more. I’ve also had about a dozen patients with fully cryptic pregnancies. Unexpected and cryptic pregnancies are more common in Black women because we have more endometriosis, fibroids, PCOS, and other disorders and no one knows exactly why.",
            "Imagine dining out and having the urge to push one out, but instead of a turd, you push out a kid.",
            "The mother of my ex thought se was pregnant, she was having her period, tests came out negative, doctors said no, this continued for 6 months till the pregnancy was noticeable and a eco confirmed it.\n\nSometimes things are just weird",
            "doh!!!!!!!!!!!",
            "When I moved out of my parents house I suffered a minor health problem that caused me to not have a period for over a year( I was a virgin at the time and couldn’t have been pregnant). I saw several doctors and they just said it was stress (after rudely saying I was probably pregnant and I don’t need to lie to them). \n\nBy the time a saw a third doctor I suddenly was having an incredibly heavy period that lasted 3 months before I went back to normal.\n\nI personally wouldn’t be concerned if my period stopped for a while.",
            "Have a neighbour who had a regular period for 9 months, collapsed in pain at work one day and delivered a healthy baby 3 hours later. She had no idea she was pregnant and was absolutely delighted when they came along. I remember reading stories like this and thinking they must all be in denial or something, but I saw my neighbour at what would have been 8.5 months and where I might have thought she put on a little weight, there was absolutely no visual indication she was pregnant, there was no major bump or anything like that. The baby was super healthy and like 8lbs too.",
            "Oh I absolutely bet this has to do with medical insurance and preexisting condition bullshit in the US.",
            "Forgive my ignorance but in the case of women whom aren’t plus-sized generally, how are they not able to identify they are pregnant after their belly starts getting pretty huge?",
            "It’s actually pretty common. Ask any ER nurse.",
            "there’s an entire show about this - some women bleed all through pregnancy and some don’t even show a baby bump at all before giving birth.. absolutely wild",
            "Women give birth all the time without knowing they’re pregnant. This is a well known phenomenon.",
            "This thread is so educational, I love it.",
            "Only in the South lol",
            "My mom didn’t know she was pregnant with me. She thought she was peri menopausal. She was 36 at the time   She calls me her change of life baby and says I saved her life. Also I’m pretty sure I have adhd because she didn’t know lmao",
            "This is literally just the best thread because it’s full of people getting educated on women’s bodies AND *surprise surprise* stories. \nA+",
            "Some women just don't have regular periods. It's not weird",
            "Either way, she may have still have had her period or wasn’t having a period at all her entire life but was still able to ovulate. The amount of men who love to have sex but know nothing about a woman is very alarming.",
            "Forget the \"missing period\" I feel like that's the least reliable of potential clues that there's a baby inside you. It blows my mind that one couldn't know.",
            "Didn't have a period for three years due to PCOS. Was told I was infertile. Was working 12 HR shifts 13 days on one day off after 9/11. Started feeling sick. Dr said she'd give me a pregnancy test \"just in case\". Was 11 weeks pregnant",
            "There was a whole series on Discovery Medical called “I didn’t know I was pregnant” and it was women from all walks of life and backgrounds. Truly an eye opening show about the female body.",
            "Just another reason to not eat there. 🤣",
            "If she was eating at Golden Corral a lot, I can see how she wouldn’t equate stomach pain with pregnancy",
            "This why I stopped going to Golden Corral.",
            "I gave birth out of my ass after the first and only time eating at Golden Corral",
            "So are people just not worried about getting pregnant after getting raw dogged? No birth control, no plan-b, just hope? Wild.",
            "I am sorry you don't notice an 8 Oz baby growing in you",
            "This was the plot of Season 1 of Mad Men",
            "Women of Reddit, I have a question and it’s not a smart question either.\n\nso I see / read these stories of “woman gave birth but didn’t know she was pregnant”. I‘m sure we have all seen those stories. How can a woman not know she’s pregnant ? Like the woman in this story for example, how can she say with a straight face I didn’t know I was pregnant",
            "RG3 wild for this one",
            "That's what ignorance does to you, when you deny proper sex ed.",
            "This feels like a lie that got overdone.",
            "I get the lack of menstruation may cause confusion but her abdomen must have been noticeably pregnant looking in her third trimester. Not even mothers if low weight newborns have a slim fit body.",
            "Pregnancy denial is a real condition, and women who suffer it have their monthly bleedings like usual.\n\nTheir belly barely grow, the brain really tricks the body into acting normal.\n\nThat's a very impressive case of \"mind controls the body\", and a very serious condition that hzs been studied worldwide.\n\nThe flat belly actually forces the foetus to grow between organs, which makes it extremely dangerous for the mother.\n\n\nSo no, she didn't get the heads up, and that would be fine for people who don't know shit to stop posting shit actually.",
            "Or also, the fact that there was an entire ass baby growing inside her wasn't an alarm?",
            "Was the baby ok?",
            "This is very possible🤔",
            "Normalcy is a majority concept\n\nThis certainly isn’t normal. It does happen more often than people believe though",
            "if I'm doing the math correctly 3-6 months isn't the same as 9 months",
            "![gif](giphy|o54Wuz7HIrjARFJWzA|downsized)",
            "I had PCOS for years. I was scheduled to get have my second laproscopy to remove the cysts because I wanted to be pregnant.\n\nI went in to do my pre-surgery paperwork and I asked them if they could do the surgery when I was on my period, because I was late.\n\nThe lady looked at me like I was stupid and said - We need to do a pregnancy test.\n\nI said - I have all these cysts. I can't be pregnant.\n\nShe said - Hmm.\n\nI was pregnant, cysts and all.\n\nPregnancy is weird and stuff happens.",
            "I worked with a woman who had almost the exact same thing happen. Found out she was pregnant with a little more than a month to go... she didn't show and claims to have had no clue.\n\nThe really interesting drama afterwards was her working out who the father was.",
            "That's how my grandma found out she was pregnant with my dad, too!  And then my cousin found out around 7 months when she started having braxton hicks contractions, since she was on birth control the whole time.",
            "My mum knew she was pregnant with my brother but her neighbour didn't because she was basically flat as for her entire pregnancy. When she was hanging out nappies her neighbour was like uhhh what!?",
            "Women are crazy. Your momma just passively grew a baby for over half a year and seemingly birthed a relatively healthy kid. I find that impressive.",
            "Lmao so she didn’t want kids and you were too late to abort, I’d have some complex about that.",
            "I’m mostly impressed she found a doctor who would do it for her.",
            "“aht aht”?",
            "\"So you're sure you never want to have any more kids? ... Not so fast!!\"",
            ">they told her aht aht, should have been quicker than that\n\ni laughed way too hard at this",
            "My mom was supposed to get a hysterectomy because of her own issues with fibroids and unending bleeding. \n\nWhen she went in to have the appointment done they finally told her that she was pregnant.\n\nI think the most aggravating part of it all for her though was that she had multiple appointments beforehand and there had been no commentary about it so she was just frustrated. \n\nBut we call my sister her miracle! Because she really wanted another, but because of her issues they pretty much told her she wouldn't be able to have any more kids and should just go ahead and get the hysterectomy.",
            "Bless your mom and you but I am CACKLING! \nAnyway, cheers to women’s bodies treating us like trash sometimes.",
            "Well, that is a scenario where this can happen. Most times when women had no idea, they tend to be plus sized. \n\nBut\n\nJudging by the picture and if it's the correct one, that woman is as skinny as a stick. And her not figuring out she was pregnant raises alot more questions.",
            "so for 7.5 months she just thought she was outrunning her period?",
            "when I started taking testosterone, my doc made it VERY clear that I could still get pregnant unless I was using some form of birth control because apparently alot of people don't take that warning seriously",
            "How is no one talking about a man having a period. That’s like a scientific anomaly\n\nEdit: I’m a fucking idiot, carry on",
            "I know a Mirena baby … your periods are supposed to stop.  Also the person in question underwent some surprise weight LOSS, which they attributed to a different, plausible life change.  I knew her throughout, and it wasn’t until about 32 weeks she found out and it was evident.\n\nI know another IUD baby as well, she found out around 28 weeks.",
            "Also, mothers who just had a baby often don’t have their period return for several months or years, especially if nursing. And since ovulation occurs ~2 weeks PRIOR to a period, you can get pregnant postpartum without ever having a period in between babies. \n\nI’ve had friends who suspected pregnancy for one reason or another who tested negative well into their 4th month of pregnancy. Other friends with extraordinarily erratic periods, as in 4x a year, so they can’t know when they are fertile and don’t always keep track of the last period. I’ve had a thin friend with a long torso who carried her baby so well tucked in she gave birth full term, healthy baby and looked like she had slight bloating at the end of her pregnancy. Add any combo of these factors and it’s easy to believe someone may truly not know!",
            "I get the bleeding part but really? There’s another human twirling and kicking right below you and you didn’t notice???",
            "I'm somewhat a little surprised that grown people don't know its possible for women to miss periods for extended periods of time for various reasons, the converse is more understandable because \\*men\\* may not learn about it until pregnant, go-go gadget shitty public education.\n\nThe lack of weight gain and \"flat\" stomach is what is bending my mind. Like, did she give birth to a chipmunk or am I just an ignorant fuck...\n\n![gif](giphy|gyltTPvict94c|downsized)",
            "Happened to a former roommate of mine while she was in highschool. She was having a fling with one of the most popular guy around. At the end of the school year she gave birth to an unwanted child to everyone's surprise, including herself. She had a flat belly the entire time and started having what she described as stomach cramps all of a sudden.\n\nThey gave the child up for adoption because they were both 17 at the time. The \"dad\" became a really close friend but we talked about it only once or twice. It messed up with the girl and she became a grifter stealing from her roommates including myself. Never talked to her ever again after that.",
            "This is definitely a dumb question but like were the baby at I thought I whole point of getting a big belly was for accommodating the baby? If you don't have that is it just like crammed in with the other organs wouldn't that like damage them?",
            "This 😭 they don’t teach this stuff in health classes. I everyone needs to know this stuff. I don’t have pcos, but my hormones are imbalanced, so my cycle is all over the place.",
            "Have you heard about the state of public education in the United States? This sort of information is considered “woke” and “indoctrination”",
            "The opposite is true, too. I had a bleeding and cramping for 6 months straight. Was miserable during my good friend's wedding and spent the majority of the reception in the bathroom in pain; bless her and her bridesmaids checking on me constantly when they should have been celebrating. My work had to send me home multiple times and gave me medical leave to figure shit out. Went to a specialty clinic for several different tests, ultrasounds, uncomfortable discovery procedures; nothing abnormal was found. Got put on a specific BC hormone regimen and it cleared it all up. That was back in 2015ish. It started happening again last year (to a lesser degree) and once again a change in the hormones fixed it. \n\nThankful for my doctors listening to me and coming up with solutions when an obvious cause hasn't been found for me. And curse my ex from the first go around who thought I was \"making it all up\" to get out of sex with him but that's a whole other trauma. I tell my current partner when things are off and he trusts and supports me and finds ways to help, bless him.",
            "I am aware of women having very irregular periods due to biological reasons. I’m also aware some women may not gain enough weight during pregnancy to know they are pregnant till very late (alongside lacking other symptoms).\n\nBut I never heard of cryptic pregnancy before, specifically going literally the WHOLE 9 months without finding out. That seems very rare from my Googling (1 in 2,500, aka 0.0004%).",
            "PCOS is brutal, I have my tubes tied and I’m still on the pill to control my cycles. Otherwise I’d be getting cysts on my ovaries instead of my period. There were times before I was on the pill that I could go up to 10 months without one. I was extremely safe in college, but out of habit would take pregnancy tests because a cryptic pregnancy was my worst fear (I have other medical issues that make pregnancy dangerous).",
            "This shit is genuinely terrifying. So I've been doing all kinds of stuff that can hurt the fetus for the last nine months, and now I have to \\*SURPRISE\\* *give birth* with zero warning. And now I have to rearrange literally everything in my life to account for the newborn that I didn't consent to having. Yes, new life and blessing and all that, but surprise birth is a form of torture.",
            "And that some women continue with that sporadic bleed cycle while pregnant.\n\n\nCryptic pregnancies are legitimately the stuff of nightmare fuel. ",
            "Hes getting cooked in the replies lol. Good",
            "They are so……… 🤦🏾‍♀️ people on nonstop hormonal birth control get pregnant often. Didn’t have a period to begin with lol",
            "Meanwhile, in groundbreaking news: not all superheroes wear capes, and not all women have monthly visitor passes.",
            "I was in my fourth month when I found out I was pregnant (!!) I had actually used pregnancy tests and everything)) long story short, my lovely daughter is 11 now 🤭",
            "this guy clearly never watched madmen smh",
            "My thought exactly. You can tell a man tweeted that. Which confirms the fact that society is doomed.",
            "One month sure but 9?? 🤣",
            "Had a co worker that this happen to. She was a big gal so she never really gained any weight. Was ask about her periods and she always had irregular periods. Boom, had a kid out of nowhere.",
            "Forget about periods, how about a massive belly and something kicking you from the inside?",
            "Yeah but how was the 3 am craving for fruity pebbles and pickles not a tip off?",
            "This ⬆️😆💀",
            "Right??? I mean I'm a special case because my body doesn't produce estrogen on its own and I have to take pills and stuff, but it's still not exactly surprising that I went multiple months in a row without getting one",
            "I understand the irregular cycle aspect, but I truly don’t understand what you could POSSIBLY think is happening when the baby is moving. Like months 5-9 were the most incredibly uncomfortable experience of my life, the kicking and elbows and insane heartburn, diminished lung capacity, all of it was just miserable and I don’t know how someone, even if pregnancy somehow didn’t come to mind, wouldn’t think there was something insanely wrong happening.  Like you can literally see the head, feet, elbow flipping around practically trying to burst out Alien-style, it was all so freaky!! I just really wonder what these women could possibly think is going on.",
            "Yes, but pregnancy comes with quite a few other changes.  You would think some combination of kicking from inside, unexplained weight gain, rapid changes in physical appearance, strange new cravings, appetite increase, peeing all the time, enlarged breasts, etc, etc. would catch the attention of the mothers to be.  Obviously this isn’t always the case but no less surprising,",
            "\nThe period is the least confusing part. What about the fact that there was an entire baby growing inside her body, licking, moving around, pushing her insides left and right, laying on her bladder, poking her ribs?! How does someone miss THAT part 😭",
            "And they often come with a woman in denial or who looks back and realizes there were definite signs of pregnancy all along lol",
            "Unfortunately, it is not required to teach this in ANY state in the US.",
            "They really don’t teach such details or information about rare occurrences in any pre uni school.",
            "> Please go back to school.\n\nThis or learn how to Google because a lot of these responses are crazy 🥴🥴🥴",
            "They don't teach this in *any* American or Canadian schools, unless it's a medical school in a GYN program. This is a fairly rare occurance for women. It can be that they bleed like a period every month, or maybe they miss periods regularly during pregnancy. It's not taught in general school (6-12).",
            "Took me almost three months to notice it",
            "This woman should have got back to school. How can someone know so little about their health",
            "Mostlikely case is the latter. As you can imagine, the replies to his tweet are likely also to be exactly what you expect. Also considering it’s a black woman, expect 10 times worse too.",
            "It’s the latter, of course.",
            "And he needs to go back to the 8th grade sex Ed class.",
            "Jokester or not...\n\nThe baby's name is Golden Corral",
            "From SWLR, can confirm. Also, ems in picture is *not* in little rock fwiw",
            "Yep yearly in Ark about 1000 women show up to the hospital to deliver a baby without ever receiving any prenatal care. There are many reasons why, lack of access to health, no reliable transportation, ignorance/no education. \nThere’s no sex education either, this girl may not even know what happens when you get pregnant  or that your period stops.",
            "Seems you don’t know how women work. Please google cryptic pregnancies.",
            "Goldie 🥰",
            "Corral is his third name. Tamaar Kylon Corral Woodfork",
            "My hungry ass:\n\nhttps://preview.redd.it/zzbobjoh618d1.png?width=640&format=png&auto=webp&s=62b96f667a5166847df70c97b4f7d7e4474a4bc1",
            "His third name is Corral. Tamaar Kylon Corral Woodfork",
            "People are not taught about biology properly (specifically every single biological model you know only works 99% of the time at best) and the natural variation of things such as periods not being clockwork and chromosomes not being 100% accurate at determining sex ",
            "The baby can grow standing up?? Never heard that one lol. Also some women have a tilted uterus, tilting back towards their spine, which is another reason why some women hardly show.",
            "I lost weight while pregnant, but was heavy to start with. I weighed 30 pounds less after I gave birth than before I got pregnant, and didn’t have to buy any maternity clothes. Wore my regular jeans into my 8th month of pregnancy 🤷‍♀️",
            "Currently 18 weeks pregnant and I can feel my baby move at times. But those little moves could easily be mistaken for cramps, aches or gas at this point. It might feel more pronounced in later weeks, but I don’t have any experience with that.  I personally imagine it would be harder to ignore during the third trim when baby gets big and your supposed to feel baby move every day",
            "Back to their table?",
            "You should try googling cryptic pregnancies. Not every woman has a visible bump. Not every woman stops seeing her period, sometimes it's just irregular. You could have no physical symptoms or symptoms that could be explained away without the context of pregnancy. My mom only realized she was having me at about seven months in when she got a fever so bad she had to be admitted. It is highly plausible to not be aware you're pregnant. Women's bodies can be very strange sometimes.",
            "Yup! She’s 5 years old now, and my sister in law is about to have a baby boy.",
            "![gif](giphy|2Xflxzn7jWsjCVlx13q|downsized)",
            "I literally sung this when she told this story to my ex lmao",
            "Wow! They had to be a huge surprise and I hope you had a smooth & healthy pregnancy. I bet they was a lot to take in",
            "I can’t imagine even just waking up one day and a doctor is like oh “you gonna be a mama in 4 weeks” , I would have been in an existential crisis the whole time.",
            "My moms neighbor didnt believe it when she came home from the hospital with me! He thought she adopted me from birth!",
            "My mom said she start seeing a little tummy after they told her she was pregnant. 😂 I never had a kid but I’m still shock a woman’s body can just sneak attack a whole baby!",
            "Yea, the first time she told me the story & my granny confirmed I looked at her like a freak of nature lol and I realize I got lucky. I never had any major illness nor broken a bone in my 36 years of life, I won National art competitions when I was 10 and through high school, was a straight A student in school and I’m still very athletic. Im aging gracefully like her and my granny too. It could have been so easy for me to have complications when she said she was dancing, staying up all night and eating junk food without feeling a single pregnancy symptom.",
            "No complex. She wasn’t planning to abort me if she didn’t know she was pregnant; that’s  kinda a leap and even if she was, I’m here regardless and that is on them to figure out. My life is my own and my worth is not tied to what she wanted nor do I owe them anything. I say this matter of factly and not with ill will.",
            "Nah, I was a surprise too in a similar fashion. I sometimes jokingly tell her she should've been quicker. She just rolls her eyes and passes over the fruit I was needling her to share.",
            "[deleted]",
            "Being a surprise doesn't mean you're unwanted. If that were the case, then IVF parents would be the best parents.",
            "That’s a wildly inappropriate thing to say to a stranger.",
            "I mean, you seen what kids are like? Little empathy devoid monsters who would telepathically turn your head inside out and make it explode if they could, just because you said no. Personally it’s harder to believe all parents don’t consider it at least once than it is no parent ever considered it for their children.",
            "This was before she could even get the procedure, she was going for a pre-check before getting scheduled. It was when they were looking over her chart that they told her she was pregnant and they had her go to maternity the same day to get her for a much overdue check up and it was there they told her she was 7 1/2. She said the nurse said “golly” before telling her how long she was  😂 so I was up there with no prenatal vitamins or junk food, getting shook up cause she out in the club with her little friends and I’m the most sane out of all my siblings 😂",
            "![gif](giphy|Qu0mh6jKBmGDbmk3hb|downsized)",
            "![gif](giphy|2Xflxzn7jWsjCVlx13q|downsized)",
            "Hit her with a “you thought”, she said I had the nerves to wake her up at 3AM, she almost had me in my dads beat up car driving her to the hospital and I was born 5:20am. She said I have been doing whatever I wanted every sense without warning which technically I do have that mentality but I thought it was because I’m the baby of the family 😅. I got recently got yelled at by my brother  for not answering my phone and he asked where I was cause he wanted to visited and im like oh, I’m in France. Then FaceTimed him yelling I’m where John Wick died. He told me I need to slow the hell down and tell somebody sometimes. I still blame it on my birth. lol",
            "My mother wasn’t plus size either,my granny confirmed the only time they saw a sign of a baby bump was after the doctor told her she was pregnant and from all of the pictures I seen of my mom, she didn’t wear baggy clothes so she was out living her regular life and not one person had a clue",
            "His partner was a trans woman so it could’ve been either one who was told they were unable to conceive due to the effects of their hormones/medications even before surgery but your point still stands ",
            "lol my doctor told me that i wouldnt be able to get pregnant on T\n\nluckily i knew better and asked another doctor at the clinic for BC as well\n\nthe state of trans healthcare is appalling",
            "I witnessed a doctor tell my trans bf you don't need birth control since he is on testosterone",
            "im really curious as to what your original thought process was lmao",
            "Happens to the best of us lol",
            "I like that the man with a period was the medical mystery, but not the pregnancy",
            "Not all babies wanna be soccer players and if this is your first pregnancy you might not understand what foetal movement is and feels like internally\n\nSome babies can be very secretive little buggers",
            "The baby can sit further back so theres  flat stomach and someone women loose weight while pregnant. The human body is crazy.",
            "Some women have a uterus that is pointed backwards. Instead of the belly growing outwards, the uterus stretches back towards the spine, hiding any outward sign of pregnancy. Combine a low weight baby, previous issues with hormones/cycles, and a lack of regular doctor visits and this is what you get. I'm sure she had some pain, bleeding, etc. that she wasn't familiar with enough to know that she needed to get a pregnancy test. She could have thought she was just bloated or she was waiting until the discomfort got worse before she went in to check for ovarian cycts or something.",
            "I was just going to ask … didn’t the PE teacher teach this ??",
            "*this sort of education",
            "And the way he's doubling down even though tons of women are literally TELLING him about irregular periods  and having periods during pregnancy is so embarrassing. Idk why some men think they know about a woman's body more than the woman herself 🤦🏿‍♀️",
            "Wait till they find out that even regular periods don’t happen on the same day at the same time either",
            "Some women still bleed during pregnancy. That’s why some never know when they do become pregnant until they give birth.",
            "My wife went 1.5 years without having a period before and wasn’t pregnant",
            "i've known friends to have bleeds for upwards of 13 weeks and then just have it vanish for months",
            "Why not? A few long term contraceptions stop your period or if you’re on the pill/patch you can skip the break and skip your periods, and contraceptions can and do fail. If they just normally have an irregular period it’s not a cause of concern. Irregular period doesn’t just mean they skip one month here and there, it can not come for months, or it can be constant bleeding for months. If they have spotting through the pregnancy that they mistake for a period; spotting can be really heavy and look like a normal flow period, or maybe they always have light periods and the spotting isn’t out of the ordinary relative to their period",
            "A good friend of mine didn't know she was pregnant until she was 7 months. She still had monthly bleeding, which she thought was her period but turned out to be spotting. She only found out she was pregnant because she started having back pain so she went to the doctor and they ran tests and found out. \n\nAnd this woman was FIT. Had visible abs the entire time. Apparently the fetus was positioned weird and was basically standing up  in there, so her stomach stayed flat, but that's what was causing the back pain.",
            "My friend had her period the whole 9 months she was pregnant - she went to the walk in clinic cause she felt super sick and thought she had the flu, 3 hours later my niece was born",
            "I invited you to google a cryptic pregnancy. It’s possible to have zero clue you are pregnant.",
            "I had a coworker that had a normal period for the first 5 months of her pregnancy.  If it weren't for her annual with her OB/GYN, she wouldn't have known she was pregnant.",
            "I have a condition that makes me miss my period for extended periods of time (months to years) without birth control. Even with that, stress, low appetite, poor diet, general life event stuff can make a woman miss her period. It's not that wild 😭\n\nThat said, even on BC, if I am at all late I take a pregnancy test ASAP",
            "Yes. Irregular periods are much more common than you think. I’ve definitely gone a year or more without periods. Other girl friends who have irregular periods also have gone several months without one. Reasons could range from stress or genetics/age to some deeper, underlying issue.",
            "Yes.",
            "Hormone imbalances and prolonged stress can mess you up and delay a cycle for months. It happens more commonly in college and stressful work environments.",
            "There's also conditions that totally screw with a women's cycle, like PCOS. It's very common to have \"irregular periods\" as they like to sugarcoat it - basically meaning that your period can be delayed for several months. (BTW: In that case, it can also lead to these women bleeding for several weeks straight afterwards)",
            "Yes. Mine are very irregular",
            "Things like PCOS and endometriosis can make periods extremely irregular. Sometimes women go months with no cycle. On the flip side, sometimes they go months with a continuous cycle",
            "I literally have gone that long before without a period. Did it last year in fact",
            "Yes, really",
            "My friend was in this situation. \n\nNever had a period, so she went on BC to regulate things. But it still was all fucked, and she'd fo several months without bleeding. Because of this, she didn't know that it was dangerous to have sex during that week when you take sugar pills. Since her period was all fucked, her ovulation must have been too. \n\nShe didn't realize she was pregnant until the quickening. Her lack of periods was the norm, and the only pregnancy symptoms she had were ones she didn't know were related to pregnancy, and ones that could be easily explained by other things.\n\nI got brunch with her the week before she realized it, and couldn't tell *at all.* And she wasn't wearing anything loose.",
            "It's going to really trip you out then when you find out that not all bleeding is related to releasing an egg. Anovulatory bleeding is a whole thing. 🤣",
            "I literally use to have one period a year it would last for 4 weeks then just go away this went on for 5 years straight until me and my doctors found the right combination of treatments for my PCOS. It happens waaay more often than you think. Also it can go the other way too women can and do sometimes have periods while they are pregnant.",
            "Yes. Also I have a birth control implant that stops my periods completely. I just don't get them anymore. The implant stops working after 3-5 years, that's a big window, 2 years, where you don't really know if it's still working, cuz you can also still get your period while you're on it as well, just depends on how your body fluctuates with it I guess. I didn't get my period for the first 3 years, then it started again and I thought the implant stopped working so I had it replaced and the doctor told me it was probably still fine but i didn't want to take any chances, plus the periods i was getting was lasting multiple weeks so i really wanted to go back to not having them at all. Now I *still* get my period but it's random and I can go many months without one. So if my birth control failed and I got pregnant, nothing would let me know unless I had other symptoms. A missing period would not tell me anything. Some women don't expand during their pregnancy and might just look a little bloated up until labor. There's literally an entire show about women not knowing they were pregnant until a baby fell out of them and into the toilet. ",
            "you can spot during pregnancy.",
            "… Second local man discovers not every woman has a period every month like clockwork.\n\n\nYes, for real.  I had a coworker who didn’t realize she was pregnant until she gave birth.",
            "Yup.",
            "Sometimes it's that irregular. I had a friend who had PCOS and she'd get like maybe one or two cycles a year",
            "Yes. There are so many factors (and all very very common) as to why women don't have menstrual cycles for long periods of time.. birth control, PCOS, excessive weight exercise, eating disorders. \n\nOur bodies literally do anything they want, biology be damned.",
            "While obviously not in this case, but being morbidly obese can entirely halt the menstrual cycle. Many of the \"i didn't know I was pregnant\" cases are due to this, not that they were too fat to notice but they had thought their menstrual cycle had halted so didn't think it was possible to get pregnant.",
            "I've known a couple women who hadn't had a period in over two years. My girlfriend once went about four months without one. ",
            "I get a period once a year, if that. However, I get fat during my pregnancies so I would obviously have know.",
            "I have pcos I’ve gone 10 months without one before",
            "I literally had an entire year without a period. It can happen. Something might be wrong with me, but it can happen 😭\n\nBut seriously, I did see a doctor for this, and they only gave me birth control to put it back on track. But I ended up stopping taking it. Now my body just decides when to have a period, and it only lasts for like a day or two. When I got my job at the hospital, I had to take a few shots and stuff. When I told the nurse that I didn't have my period in the last few months, a doctor literally took me to a seperate room and asked me if I want to take a pregnancy test bc I haven't had a period in so long. But i told them no since I'm a virgin and I've always had irregular period cycles. My mom was sort of like this, too. She didn't get her first period until she was 18.",
            "My ex wife got a period every couple of years",
            "The longest I went without one was about  20 months.  So yeah it happens.  No I wasn’t with child, my biology is just fucked up.",
            "I know many women that do have menstrual cycles but do not bleed and have not for years at a time, despite not being pregnant.",
            "I went nearly 2 years at the longest without having a period. I was not pregnant at any point of that time.",
            "I went a year with no period before.",
            "Pcos",
            "I've gone 13 months without a cycle. It happens.",
            "I have PCOS and I've had it where my period would disappear ranging from 5 months to a year and then I'd bleed for 2 weeks straight and sometimes, my uterus would force itself to shed at once and I'd get this lining. And it happened from the ages of 9 to 16 when they diagnosed me and gave me birth control. Then I lost the doctor due to insurance and it started again. Now I'm 38 and at least it'll be 5 days late vs 6 months. 🙃",
            "I have PCOS. I didn't have a period for years.",
            "It can be unpredictable and if you are young you don’t really takes notes and notice trends month to month you just deal as it comes",
            "I've gone nearly a year. Funny enough I'm currently pregnant,but a missed period was not what clued me in.",
            "If I was a woman and I missed a single month, I wouldn’t notice again for approximately 2 years",
            "I've met plenty of women that have one period a year. Usually they're either really skinny, on birth control, (the pill and the various implants affect different people), or genetic abnormalities.",
            "Some hormonal birth controls stop your period entirely, so not having one for 9 months or even years at a time can be normal.",
            "I went 10 years without a period from 17-27 years old. Medications, lifestyle, diet, all can affect your cycle in weird ways, I was lucky that what gave away my accidental pregnancy while *actively* on birth control during that time was the nausea, otherwise I might never have known.",
            "In my mid 20’s I went two years without a cycle. Stress, low weight, anemia, etc. all joined together and I simply stopped.",
            "I’m on a hormonal medication that prevents me from having periods, but I could still get pregnant. I haven’t had a period in nearly 7 years. I know situations like mine are rare, but it’s still very much a possibility.",
            "Until I got on hormones, I was getting mine every 6-12mo. I never would have known I was pregnant if I were in this situation.",
            "I didn’t have one for ten years because of hormone disfunction. (Then again I didn’t want one in the first place.) so it can happen.",
            "I skipped a period for 11 months once, but mostly if I'm not on BC I either bleed without stopping(had a period for a year straight once) or have a period every 4-6 months.",
            "I had pretty regular periods but occasionally skipped one due to stress. \n\nThen the pandemic happened and my parents got divorced and everything that was usually stable wasn’t anymore and I skipped my period for about fourteen months. \n\nI definitely was not pregnant. But stress can cause you to skip cycles. ",
            "I haven’t had one in 8 years. Some birth controls stop them. My sister didn’t find out she was pregnant until 5 months. She was on birth control throughout the entire thing up to that point. Pee tests kept coming back negative and she finally got sick of her stomach issues and demanded her doctor figure out why she couldn’t keep food down. During the blood work, she tested positive for pregnancy.",
            "I've gotten my tubes taken out, I'm a virgin, and I'm an asexual woman with little desire to fuck someone.\n\nI've also gone months without getting my period ever since I had my first at 13 (and I'm 24 now), the longest being 10 months in between periods. Yes, I've been to multiple gynos, and No, I don't have endometriosis. They literally have no explanation for why I'm so irregular other than hormones, and birth control already makes me suicidal so I just don't take it since the cons outweigh the pros.",
            "After my wife gave birth she didn’t have a period for almost 7 months and her doctor was like “eh here’s some pills to try to force it” and even now she has a super weird cycle of a random number of months between them.",
            "Mine can go upwards of ten before appearing\n\n(I have no children)",
            "I used to only have my period about once a year. I didn’t mind it but for the fact that I would then get my period for a whole month. The anemia kicked my ass.",
            "Have a friend who is less than once a year. Different bodies do different things and science straight up does not research female bodies",
            "More than that, during cryptic pregnancies, the body will do ANYTHING  to believe there is no pregnancy. The uterus will be put in a position so that there is no bump, and there could be a fake menstruation. Not even bleeding from the pregnancy, real menstruation blood, released just to hide the fact that they are pregnant. \n\nThe brain will completely hide every sign of the pregnancy. Only with willful intent, when the pregnancy is accepted, the body will return to normal. The uterus will move to its normal position, and anyother fake signs will disappear.",
            "You’d be shocked how often it happens. Periods can be incredibly irregular - they can go or stop for months at a time. Endometriosis means they’re in a lot of pain, or bloating, so they can’t tell the difference.",
            "I have pcos and didn’t have a period for 2 years (not a good thing tho)",
            "There was literally an entire show about it called “I Didn’t Know I Was Pregnant”",
            "certain birth control will just stop periods",
            "It's called hormonal birth control.",
            "Birth control can make a woman have a period only once a year or less",
            "Look up Cryptic pregnancy.",
            "Have you never met a woman in real life",
            "Yes, it happens.",
            "Happened to me, yea I got a period maybe twice a year in my teenage years atleast I got privileges in the cult I was in at the time because I was apparently the next Virgin Mary but just dark skinned.",
            "I know a girl who had a period every month as usual, completely unaware she was pregnant pretty much up until birth. She didn't have a baby bump, she was on the pill, she drank coffee and alcohol throughout because she had absolutely no idea she was pregnant... The baby was about 6-10 weeks early. She'd broken up with her boyfriend (presumably the father) about 5 months earlier, and she's only 21 years old. Just one of those 1-in-a-million things I guess.",
            "My sister got her period for 5 months into pregnancy. Didn't have many other symptoms and she was pretty curvy to begin with so she aeriously did not notice she was pregnant until 5 months in. Imagine getting half of your pregnancy baaically stolen from you, that's so much preparing left to be done. Thankfully everyone is healthy and happy but it was a real suckered punch at the time.",
            "It's *really* common for women to give birth who didn't even know they are pregnant. Talk to anyone who has worked in an emergency department or labor and delivery. It happens all the time. This is only news because she gave birth in a Golden Corral.",
            "When it’s super irregular, what exactly is the thing that would make you realize how long it has been? Unless you track your period with care—and some people do—this isn’t so unusual.",
            "There are so many reasons to have an unknown pregnancy. Either you're never bleeding in the first place (some women are like that, and contraception can do that too), or you can keep bleeding regularly while pregnant.",
            "My wife didn't have a period for 6 months straight.\n\nJust wanted to make sure you know, you sound fucking dumb.",
            "Are you a man in women's business?",
            "Say you’re ignorant without saying it lmfao",
            "My wife maybe has one or two periods a year",
            "Oh bless you",
            "I have PCOS and didn't have a period for three years. I almost never had periods. Don't make stupid assumptions. PCOS is very misunderstood and probably underiagnosed.",
            "Not really funny. Look at her arms. She's quite slim, to say the least. Very common to have your periods stop altogether when you are quite underweight.\n\nAt 17 mine stopped for 6 months, and I was given a drug to restart them.",
            "Many women dont have regular periods and many pregnant women dont have “normal” symptoms.",
            "I was on the bar and didn’t get a period for 5 years, it’s also not 100% effective so if I got pregnant I wouldn’t know. I actually have a few friends who are bar babies lol",
            "Just say you don’t know how women’s bodies work.",
            "My ex had a period maybe 5 times throughout our 2 year relationship. The doctor just put it down to stress... Point is, not every woman's body is like clockwork and it could be for a multitude of reasons",
            "Yes. This shit happens.",
            "My wife can go 6 months between periods.  When she does have one, it can last for 2-3 months.\n\nEveryone is different.",
            "Some people spot during their period. Spotting is like light bleeding.",
            "There's an obgyn on YouTube who reviews episodes of TLC's I didn't know I was pregnant. She explains their situations really well. I think required viewing for anyone who is having PIV sex",
            "I once went almost a year without a period due to stress and a hormone imbalance. It's not common, but it can happen.",
            "My wife has 2-3 periods a year, 9 months wouldn't be too strange.",
            "I can not get my period for two months at a time if I’m under enough stress",
            "My wife doesn't have them at all yet is still able to have a child",
            "Sometimes3 sometimes 5. Tell\nMe you know nothing about women without telling me",
            "Who is upvoting this ignorance!?",
            "My wife takes birth control that prevents her from having a period.",
            "I didn't have mind for like 4 years straight in my early 20s lol",
            "Oh honey.  Let’s have a learning moment where we reflect on whether we know how things work, or if we just have an idea we made up that we think makes sense to us.",
            "You need to educate yourself.",
            "I haven’t had my period in 10 and I’m not pregnant. There a lot of factors that go into it, genius: every man is suddenly an OBGYN when it comes to women’s bodies",
            "This comment needs to be downvoted to hell.",
            "Still telling on yourself ",
            "Men are clueless",
            "Not all babies move around enough to notice.",
            "You’re assuming all women get all symptoms to the same intensity and even realise those symptoms are what they are. Kicking can feel like actually being kicked in the ribs, but other women say it felt like stomach cramps or gas which doesn’t scream pregnancy\n\nObviously most women do put together they’re pregnant but if you realise how vast the experience of pregnancy is it’s easy to see how one might miss it ESPECIALLY if they don’t have regular periods. Coincidentally, women with PCOS are more likely to have cryptic pregnancies",
            "Depending on the placement of the placenta you might not be able to feel the baby move much. It’s not uncommon, just wild that it happens to someone who also is has irregular periods/never missed her period.",
            ">her body, licking, moving \n\nLicking?",
            "tbh I am a woman and I only knew about this from the show “I didn’t know I was pregnant”",
            "True and it’s so unfortunate! States lacks a lot of things that should be taught and teach a lot of stuff that doesn’t need to be!",
            "Required or not I did get taught everything brought up in this thread in school (western NY, 2011 graduation) during high school Health 1 and 2.",
            "Which is one of the reasons for both sides of the story in the op probably",
            "I mean I wish they taught in schools about pregnancy in general and also how common miscarriages are.\n\nWe were devastated in our early 30s when my wife miscarried and it took me ages to talk to people about it. I just shut off from the world.\n\nWhen I finally shared it with family and friends it was more than half of people I spoke to that had experience with it themselves.\n\nKnowing it wouldn't have made it \"easier\" to deal with when it happened, but certainly would have helped my expectations beforehand and dealing with the immediate aftermath.",
            "Recent high school grad never got taught **ANY** of this in school. I knew sometimes periods are missed ,but I didn’t know there could be a whole plethora of factors that cause cryptic pregnancies. Just learning people can go so long without knowing they’re pregnant feels like I’m being told right is left and grass is red. This stuff really needs to be taught in school.",
            "got back to school",
            "I’m pretty sure they’re referring to the subtweet…..",
            "This is one of the most foul and cultured posts I've ever seen. Well done.",
            "I had to make sure I wasn't on r/twobestfriendsplay for a second there.",
            "That's so on point",
            "Dammit.",
            "I’m legit intrigued. Every time some one pregnant tells me their baby is kicking and let’s me feel, the little fucker stops kicking. So then I’m just awkwardly touching people’s stomachs while they do things to make it move. No thanks. Let the baby be. I don’t like people clangering on my door when I’m trying to relax",
            "Woah, thanks ! Reading on it now. Crazy, I had no idea.",
            "That's wonderful!",
            "Exxxactly. 😂😂",
            "I MISSED THIS MORE THAN I EVEN KNEW",
            "It was a shit show, but we both survived and thrived - they wiped my hard drive - and now I got a grown kid who is a wonderful person.",
            "I bet that was the highlight of his week.",
            "Thank you for sharing your story. Are you and your mother close? Do you have or plan to have children? All good if you want to be private. But was curious and wanted to ask. Glad you are here with us! :)",
            "Are the youngest child, that feels like the youngest child move lol",
            "Going in to get your tubes tied does.\n\nEdit: The comment said \"unplanned doesn't mean unwanted\"",
            "Oh i missread, i thought it said she was, now i see it says the opposite. Well, i only ever saw one normal weight person not figuring it out. But her baby was in alignment with the body so she didn't really get a bump. But that was a very rare instance.",
            "![gif](giphy|Wt6kNaMjofj1jHkF7t)",
            "Heyyyy cool story. Did you know that women who have sex with other women can't get STIs? Because according to my first gynecologist 30 years ago, lesbians don't need to worry or get tested for anything! So cool! /s",
            "He either missed trans or confused trans male for MtF not FtM",
            "Us old folks need to do a little extra math to keep up.",
            "I'm guessing it was. Penises don't have periods ",
            "A man with a period is definitely a medical mystery, I just got confused is all",
            "SO crazy! This is the part i don’t understand. Like wtf where is this baby fitting? wouldn’t you feel SOMEthing in your body? now i’m over here thinking IM pregnant !",
            "Okay, thank you for clearing that up, but as u/glamazzon was saying, wouldn't you notice that little crotch demon rearranging your organs to fit in their new bedroom? Ain't no way these people just sat there thinking there were perpetually bloated for five months.\n\n![gif](giphy|UxNTT095uL0go|downsized)",
            "Oh, I was just leaving a comment on another reply asking this. Crazy scenario.",
            "PE teacher??? The gym teacher??? Oh god what is going on down there. I mean in Canada we don’t get the BEST sex ed. But damn at least ours (or at least mine) was taught by the science teacher.",
            "A lot of women have amenorrhea too, could have very easily been a one off ovulation",
            "I didn’t have one for almost 6 it’s not uncommon for imbalances in hormones",
            "I had a period 4 months with my 2nd kid. Our bodies can be weird.",
            "My sister was on birth control pills, which made her have her period every month. So the pills both failed on their job of keeping her pregnancy free while they also made her have a period. It was only when our cousin got pregnant my sister thought about getting tested since she had gained a bit of weight. She was seven months pregnant! Some women hardly even show when they're pregnant. This is one of my biggest nightmares!",
            "All genders can bleed from Golden Corral",
            "Thank you. the ignorance of it all. folks really have no idea about how women's bodies work, huh",
            "a tiny petite 22 year old found out she was pregnant 7 months. she was on birth control and bleeding regularly. turns out, her mother had same issues",
            "Yeah my sis didn’t realize she was pregnant with her first kid until she was 4 months into the pregnancy because she was bleeding and thought it was just her period. She was also on some medication that made her period irregular, also caused her birth control to be less effective but they didn’t tell her that and that’s how she got pregnant.",
            "My mom sure did. She still knew she was pregnant though. I was planned.",
            "I knew a girl who was on hormonal bc when she gave birth without knowing she was pregnant. She gave birth early, approx. 7 months (not 9) and she bled every month. apparently if you are part of the small percentage of people for whom hormonal bc fails there's about a 20% chance you keep bleeding is what she told me.",
            "Add in the absolutely atrocious, and I mean atrocious, sex education in this country and it doesn't really surprise me. Most people know very little about basic anatomy or bodily functions. They believe a lot of ridiculous myths about when you can and can't get pregnant and when you can and can't pass STIs. Most people do not comprehend exactly what happens during pregnancy. How organs are moved out of the way. How your teeth can fall out because placenta will take all the calcium that it needs whether you have enough or not. How joints will become so flexible that it is very easy to dislocate them as the body prepares the pelvis for delivery. How it can throw your hormones so far out of whack that you can be perfectly healthy before pregnancy and die before you give birth of high blood pressure from preeclampsia. Pregnancy is not seen as a major medical event when it very very much is. Also add to that how expensive it can be just to go to a doctor a lot of people just ignore problems and hope they'll go away.",
            "Yeah because it’s not like you gains bunch of weight or have a cantaloupe doing flips and karate kicks or something else real noticeable for three months.",
            "I completely understand periods can be irregular. But like, how do you not know you aren't carrying around a baby until you birth it? Even the smallest pregnancies still have a belly. No? I know human bodies can be super weird sometimes but I just can't grasp how there wouldn't be not any other sign that you are carrying a baby. Just next thing you know my water broke and a baby is in my arms, Idk where it came from. It really can't be like that, can it?",
            "Do not all women get visible pregnancy bellies? Is the extra weight not always noticed?",
            "You would think the extended and rigid baby bump would be a major clue.",
            "[deleted]",
            "I've gone two years without one. I would have panicked but I chalked it up to teenage hormones. I look back on that time fondly.",
            "i had a period for 6 months uninterrupted...it was awful but we (me+drs) never figured out what caused it. its been over a decade now and it hasnt happened again. \n\nbodies/hormones are just odd af",
            "this used to be me. i'd have heavy bleeding for 1-2 months, another 1-2 of light/spotting, and then nothing for months.",
            "That’s a terrible sign, I hope they got medical help :( womens health sucks but I can’t imagine it’s much better to live with that anxiety",
            "And surely that’s a reason for concern? Any of them get answers for why it happens?",
            "This. I take the pill and skip periods because my period exacerbates a cervical condition I have, so I never have periods. I am super paranoid about an accidental pregnancy so I take a test every month despite being vigilant with my pill because a cryptic pregnancy is my worst nightmare",
            "Happened to my SIL, she actually went to the doctor a number of times because she wasn't feeling well and they didn't clue in either.",
            "I haven't had a period in years because of Depo Provera. Man I love that stuff.",
            "I was in college with a girl that gave birth when she sat on the toilet. She didn’t have a clue. She had periods the whole time, they were a bit lighter, but nothing worrying. Like your friend she didn't really show up to the last couple of months when she put on a little weight, but really not much. \n\nShe just went to the toilet thinking she had diarrhoea, next thing she knew there was a screaming baby in the toilet bowl!",
            "That is one of my biggest fears! Every sexually active woman should take pregnancy tests every once in a while cuz you never know.",
            "Yeah I know it happens, 1/2500 women apparently never know until they give birth",
            "There was a whole show dedicated to women not knowing they were pregnant. That show terrified me. Bcuz there were a lot of them that didn’t have any change and kept getting a period.",
            "Huh, TIL",
            "I understand symptoms can be confused for another condition but would she not have felt the baby move and kick?  Or is there a condition that would explain that feeling t\noo?",
            "Is it usually like PCOS or BC or something? I know BC causing hormonal issues is pretty common too, if you want to share of course",
            "I’m not assuming anything regarding intensity or the like.  I simply pointed out that it is surprising to hear about cases of pregnancies where the mother is unaware, given all the things that normally accompany it.\n\nYou are overanalyzing what I said.",
            "I’m sure that was an auto-correct on “kicking”, but technically not wrong either way. 🤣",
            "You purposely beating down the States, a lot more than them don’t teach that and I’ve been to my fair share of countries. Maybe I move before they start on it and biology is optional 🤷🏿‍♂️",
            "Ohhh my bad",
            "I understand 😂😂. Touching someone’s belly is quite intimate, so I can imagine either one not being okay with it.\n\nBaby has 9 months to chill in mama’s belly and after they’re born, they’ll probably have a relaxed life till 18 or so. Plenty of time to relax, they should be fine hahaha",
            "Wooo, you are a strong soldier, I honestly don’t think I could handle or want to handle childbirth. Any woman who will and does, you have my greatest respect. I like kids but not enough 😂 and I’m so happy to hear you guys thrive. It can be so scary but you guys made it through ❤️",
            "We aren’t as close anymore but it had nothing to do with my birth, I just think it’s a common issue that can happen among mothers and daughters in the south. I don’t have plans to have children but also if it happens, I wouldn’t be upset. I am open to adoption in my 40s though and I come from a big family so I am very close to my nieces and nephews and thanks 😊",
            "The comment was deleted, do you remember what was written?",
            "You’re the only one who understands my mistake",
            "I didn't even know it was a thing until a couple weeks ago. I ran into a video explaining it. \n\nWomen's bodies are absolutely mind blowing. Not only that it can accommodate an entire extra human inside, but that it can be so good at doing it that she doesn't even know she's pregnant. Then you have women who get such huge bellies that you can't fathom how she hasn't exploded yet, and all she gets after giving birth are some stretch marks.\n\nMakes me glad I was born with my bits on the outside lol.",
            "Same here. Didn’t have a period for about 7 months and had to get on bc just to get it regular again. I also found out last month that I have endo sooooooooo 🙃",
            "They just went awol during quarantine, I was a bionic woman. I did feel the need to consult a dr about it though",
            "Learned this the hard way. Girl and I were each other's first in high school and it just sort of went down the first time and neither of us were prepared. Didn't really say much about it but I bought rubbers afterwards and we did the right thing. About three months later she comes up to me one day talking about how she's missed her last two periods and my gut felt like it was sinking me to the core of the earth. We got a test, she saw a doc and got sorted out and no harm, no foul but my god in heaven that scared the fuck out of me for a hot minute.",
            "I currently haven't had a period for 19 months. That has been since I started a low dose of testosterone for transitioning purposes, mind. Hormones are wild.",
            "And you did not go to a doctor during those 6 months? This just makes you sound like you don’t take your health seriously.",
            "but you went to the doctor right?",
            "[deleted]",
            "It's one of the things I lowkey love about reddit. The residual knowledge you get from doomscrolling. I can say there are a whole lot of peeps that are probably reading this stuff for the first time and are not sure if you all are being sarcastic, comedic, or just downright evil. 🤣🤣🤣🤣",
            "![gif](giphy|9rhNJScGSlneHpLtnz|downsized)\n\nI barely know how my body works tbh",
            "I don’t mean to be ignorant, but wouldn’t this lady notice a baby bump at some point?",
            "Well, to be fair, it seems like some women have no idea how their bodies work either.",
            "Not all pregnancies are the same. Not every woman will get all the symptoms. There’s possibilities of your teeth falling out during pregnancy, but not all women lose teeth.  Also, a lot of pregnancy symptoms are very similar to period symptoms. Nausea, headaches, mood swings, etc. When you’re still bleeding it’s easy to mistake pregnancy for just being on your period.",
            "I didn't get morning sickness. I threw up once - at Home Depot in the afternoon.\n\nMy main problem was being exhausted all the fucking time, but I had a pregnancy induced heart condition that wasn't noticed til it was too late (we're fine).\n\nFor most of my pregnancy, I was super swollen - heart condition, not salt like my doctor kept saying - but I didn't puke, I wasn't miserable/crazy, I didn't lose teeth or throw out my back or any of that stuff.\n\nPregnancy is more dangerous than a lot of people think, and a lot of pregnancies don't involve what people assume they do.",
            "You could spend the 20 second to Google this topic and realize a lot of the women don't experience pregnancy symptoms, and the ones who do attribute their symptoms to something else when the pregnancy test is negative.",
            "Read a book about pregnancy please",
            "I didn’t have any of the symptoms you listed. I didn’t even gain weight. My only pregnancy symptom was that I couldn’t eat spicy food. This was wild because I love spicy foods.",
            "I enjoyed that time as well",
            "Oh hey me too! I had super bad cramps with it too. Felt like I was in hell but the doctors never found anything “wrong” that could be causing it. Then suddenly one day it just stopped. I’ve had a few other instances of long periods since then (but only lasting a month/two months at a time, and again they’ve found no cause. It’s also been over a decade since the last time it happened to me and I’ve been on bc since the last time it happened and now only get a light period every three months and it’s amazing.",
            "I’m sure they did. I have a similar period. My diagnosis is literally just “irregular periods”. I was prescribed birth control. Now I just spot every single day. Doctor still considers everything normal. Not everyone has a regular 28 day cycle, just like some people have heavy periods and some have light periods.",
            "I’ve had periods for up to 3 months straight and gone without one for around 8 months (not pregnant). I’ve seen a lot of doctors that blame it on that’s just periods being quirky 🤷‍♀️ or maybe I should lose weight. It’s actually bc I have PCOS but there’s not alot you can do about that",
            "Hahahahahaha. As a woman with stupid period issues it is HARD AF to get doctors to listen to you and not just brush it off as you being dramatic. A lot of us just deal with it unfortunately, because there’s really not any other option. ",
            ">next thing she knew there was a screaming baby in the toilet bowl!\n\nOh😧",
            "That poor baby , life really is shitty !",
            "Because of new laws; every four weeks is best. ",
            "And for peace of mind - dollar store tests are just as accurate as the expensive digital ones.  Pick up a few and take one whenever you're worried.",
            "I've seen it happen in real life. One night one of the women I work with left early because she was feeling sick to her stomach. I come back to work the next day and hear she was in the hospital and gave birth that same night.",
            "My university roommate went out and bought like a case of 50 pregnancy tests after we watched a couple of episodes. I don't even know where she found a place that sold them by that quantity",
            "Bruh I remember that show on TLC \"I Didn't Know I Was Pregnant\" Such a crazy ass show.",
            "I had sex for the first time when that show was on and I was convinced it would happen to me. I was on the pill and we used condoms but still… I was petrified for a whole year. 🤣",
            "The quickening IS the baby moving around or kicking. That's when her friend realized she was pregnant. That usually happens around weeks 16-25.",
            "I don’t mind sharing because it kind of touches on the issue of women’s health not being taken seriously. \n\nIt was a combo platter of PCOS and endometriosis. My early 30’s I finally get a doctor that takes my “women’s troubles“ (aka extremely painful and heavy cycles on the rare occasions I had it, the fact I didn’t have one until I was almost 17)seriously to do a sneak and peak and finds that I am riddled with all manner of tumors and cysts.  So much so they open me up right then. At my post-op appointment my  surgeon said “ I removed enough pathology out of you for 3 people.  You had a huge tumor on your uterus that had grown so large that it had cut off blood flow and was dying, you must’ve been in excruciating pain.” Which I just shrugged and said “Yeah, but I was told it was normal or in my head and to suck it up. I would just slam 4 Tylenol and keep it moving.”  \n\nSo yeah it’s rare but it happens. And because I never had a typical cycle that occurred every month in consecutive months until I began birth control in my early 20’s , if i skipped a couple of months or even a year of my period it wouldn’t occur to me that I was pregnant and as fate would have it  I was extremely socially awkward so I really didn’t have to worry about it until then.",
            "Keep in mind this is Arkansas I can only imagine the sex education in this state is fairly … scant at best",
            "No worries!! You’re doing the lords work educating people in this comment section ❤️❤️❤️",
            "It's cool! ❤",
            "\"unplanned doesn't mean unwanted\"",
            "I found out a couple months ago that I have Endo too! I feel for you. The pain is unreal.",
            "May everything go smoothly and well 💜🙏🧿🌈🍀✨",
            "Where did you get your MD from?",
            "No there's something called pregnancy denial too, the body doesn't grow big. Stress, fear, shame etc.. \n\nBut there's also women who naturally just don't have a big stomach when pregnant while others grow way too large. \n\nSome Can really go unnoticed if you don't follow your body regularly.",
            "![gif](giphy|WfBZwNA6XSjphkYkzN)",
            "All of that I get, women aren’t all the same. That’s easy to understand. What I don’t understand is wouldn’t you feel the baby move at least once? Are some babies just chill and never move?\n\nEdit: damn, can’t even ask questions on this fucking site. No wonder we are so uninformed, you yell at us when we ask anything.",
            "Glad you’re okay!",
            "*VAGINAS",
            "Sounds like my doctors. I finally found a gynecologist do a full hormonal and metabolic work up who spotted indications of PCOS and prediabetes that my primary and previous GYNs missed or felt would be solved by throwing me typical birth control. I got a pelvic ultrasound which confirmed it. She put me on progesterone (lower dose than BC) and now I'm regular and have super light periods with almost no side effects after previously having to take 1-2 days off of work previously. For context, I broke my foot last year and had no idea because the pain was nothing compared to a typical period I had been used to.",
            "In the past, I wouldn't get mine for months at a time and sometimes I'd get it twice in one month.\n\nIt reverted to being regular for a while and now it's back to being irregular.",
            "Instead of studying and researching women’s bodies, they just consider us small men",
            "![gif](giphy|S6a29UUUYboINrGXxm)",
            "You can order packs of 100 or more online for dirt cheap.",
            "You can buy them at the dollar store",
            "Tbh the scam is pharmacies selling single tests for $10 a go. \n\nYou can bulk buy online for a fraction of the cost. Made our lives a lot simpler when trying to get pregnant and testing fairly frequently.",
            "Dollar tree will let you buy anything that they sell by the case.",
            "We used to call that show \"when babies attack\" \n\nMassive fear.",
            "Thank you 🩷 trying my best, but I think I’m done for today lol",
            "Oh. Well just because she decided she was done with having kids which happens alot by the way, doesn’t mean i was technically unwanted. It’s not black or white thing. When she learned the news she was pregnant she said she didn’t think about anything else after the initial surprise other than my health and guilt she could have possibly hurt me all that time even though she didn’t know. If she wanted an abortion, I wouldn’t have been mad or sad about it, I would have not felt anything. I would have been a clump of cells with no conscious. It was her decision in the end and I have no quarrel with what woman want to do with her body, even if it meant me not being born. 🤷🏾‍♀️",
            "I just came to say I'm so sorry about your endo diagnosis.   I was diagnosed 15 years ago, tried every thing to help with the pain, all the birth control the damn surgery to remove what they could (it would just grow back), my diet went down to nothing that had any taste, was working out 5 days a week and nothing helped.   I had a hysterectomy 3 months ago, and the only thing left is one ovary to avoid having to go on hormone medications. I'm no longer in pain every single day, I have a bad day, probably 4x  month from the pain because my endo was stage 4, so it's on my colon and such as well.  However, I'll take the being laid up 4 days a month over 20+ days a month from the pain.  My heart goes out to you and the person above you with endo.\n\nMy only advice is to find yourself a good doctor who specializes in endometriosis and will take your pain seriously. I dealt with years of doctors that didn't take me seriously, told me the pain was in my head, that I was being hysterical, that I was clearly an addict (despite my always negative drug tests), that I developed severe depression that I'm now having to battle.  Towards the end before my hysterectomy I was making trips to Colorado for the green to help with the pain but my doctor supported me and was the one who suggested it after the pharmacy refused to fill a script for 10 pain meds for me. Don't let the doctors get in your head and tell you you're wrong or don't know your own body.  \n\nAgain, I'm so sorry about your diagnosis, and all my positive thoughts are with you on this journey.  It's life-long as there is no cure, not even a hysterectomy is a cure because it can grow back even without a uterus.",
            "No shit? That’s crazy to think about considering how big babies are. Thanks for the info",
            "Can feel a lot like gas or cramps.",
            "Yep sometimes theyve got a foot in your ribcage 24/7 and sometimes theyre just chilling. Placenta placement and amniotic fluid can also play a role in reducing how much they feel.",
            "My placenta placement made it hard for me to feel kicks. My baby turned head down at 20 weeks a legit stayed in one position the entire time. Her head grew wedged into my pelvis so she was born with a Gumby head (sloped).",
            "Thank you sweetie.",
            "Or uteruses",
            "So many things medical issues can be caused by an imbalance of hormones that I find it wild that so few people get some form of HRT for it.\n\nBeing borderline suicidal because of pain isn't what's supposed to happen.\n\nI have one trans friend who got me to ask my doctor to look into hormones for some of my issues. Comes back that my body doesn't have a proper balance and now they're all basically gone.",
            "I think there are different levels of unwanted. There's \"I'm done haven't kids but I'm happy to raise another one\" kids. Like how I didn't want a cookie today but I was happy to eat the one in front of me that my husband brought home. \n\nThen there's unwanted unwanted. \n\nYou were clearly the former, not the latter.",
            "I mean the stomach doesn't stay flat, but with denial it's a bit of a shocker",
            "☝️",
            "Makes Halloween costumes easier",
            "You are right, thanks for clarifying"
        ]
    },
    "This man carried the show and the firm on his back": {
        "title": "This man carried the show and the firm on his back",
        "score": 352,
        "url": "https://i.redd.it/5vfpss5dv38d1.jpeg",
        "content": "",
        "num_comments": 34,
        "comments": [
            ">!as soon as Mike left,!<the show had a noticeable and severe decline in quality",
            "Hol'up. We're saying the show wasn't a Buddy Cop show with Lawyers?",
            "Suits is hilarious for torontonians because they make no effort to disguise that they filmed there. Like they’ll be talking about New York bagels, and then walk out of a second cup into a beck taxi with Roy Thompson hall in the background.",
            "Louis Litt has the best character development in the show and I don't care what anyone says. Shame Mike left cause he was indeed the robin to Harvey's batman.",
            "I’ve never seen the show but that’s the face I associate it with…marketing, ads, YT shorts, I would’ve assumed it was all about him",
            "Rest easy to the GOAT, his monologues were always top notch and he would give some high quality reads.\n\n![gif](giphy|erMj4wPNpuvjsAYAbt)",
            "Don’t forget Donna and Gretchen( if that’s how it’s spelled) coming through in some clutch moments. Good show, just finished the series.",
            "Barney Stinson is the best answer for this",
            "![gif](giphy|3fNmJ20ErpkjK)",
            "They abandon the whole true Mike storyline soo fast. I want to see my genius doing more genius things",
            "Fonz",
            "I will always maintain that Black Panther was more about Killmonger than T’Challa",
            "fr",
            "Todd in bojack horseman stole the show for me",
            "![gif](giphy|HRNqHqiwbfrIQ)",
            "Gabriel Macht disappeared for the past 5 years, handsome bastard.",
            "I hated how his character turned into a whiny bitch. Best closer in NYC but God forbid you say anything slightly rude and \"what did you say to me? Get the hell out of my office!\" \n\nI get they needed to make drama but really wished they got back to cool cars, fancy clothes and winning cases in a creative way, instead of Harvey crying about his mom every fucking episode.",
            "Do black people actually watch this show? I’ve never heard anyone say “Yo, did y’all catch that episode of suits last night?”",
            "Yeah because there was no true element of danger and struggle left just overblown everyday scenarios.",
            "Everyone was annoying as fuck, even Mike. Still, I finished the show but will never watch it again.",
            "It was and they’re both the main characters, there was plenty of episodes that were more about Harvey than Mike, it was just Mike’s story about being a fraud and then trying to hide it that moved the story forward.",
            "It's the visible street signs for me. Ah yes, the famous Bay Street of Manhattan, written on an iconic blue sign.",
            "Never noticed or paid attention to that. It’s amazing how many details in shows I don’t notice. I just sit and enjoy like a happy simpleton.",
            "![gif](giphy|8YTkFvr84wOS5jKM3i|downsized)",
            "Big facts, best character in the show",
            "It was generally was a popular show so it’s bound to capture black people as well, just not ones you know I guess",
            "lol🤣😂🤣… Yea some do",
            "I used to watch the show way before Meghan Markle became a duchess. I liked it and thought it was a good show in the first few seasons. I don’t choose my shows based on what my people are watching. I like to think for myself.",
            "I was going to. But it was first run on cable and I missed the first episode. Hasn't come up in my \"All right, let me binge...\" roster yet.",
            "I watched it when Meghan Markle got famous because I had never heard of her or the show. It's not terrible!",
            "Me neither.\n\nBut I think it's another case of \"the Netflix Effect\" where a show that started on basic cable TV undergoes a massive resurgence in popularity after the early seasons begin streaming on the platform.  Past example include Breaking Bad and You both of which got huge on Netflix.\n\nSuddenly, people who missed it are discovering it for the first time. That's why those T-Mobile ads with Patrick Adams and Gabriel Macht have been inescapable for months and also why a ninth season and an LA-based spinoff are incoming.",
            "Yep, watched it when it was airing years ago, mainly because Jessica Pearson’s wardrobe was EVERYTHING, even when the story was a bit ‘pony’, the fashion was glorious",
            "This was true in Mike’s final couple seasons though, after everything hit the fan and then resolved itself. They wrote off the entire premise of the show right when it was most popular. \n\nThey dragged the show out too long but it had less to do with Mike and Rachael leaving and more to do with just the writing and decision making.",
            "Didn't Mike have photographic memory to the point where its his superpower, then it was phased out and not really mentioned anymore?"
        ]
    },
    "There's nothing else to say when it's this hot": {
        "title": "There's nothing else to say when it's this hot",
        "score": 4394,
        "url": "https://i.redd.it/7zpl2h5ttz7d1.jpeg",
        "content": "",
        "num_comments": 131,
        "comments": [
            "“Did you call the Doctor’s Office back yet?”\n\n“It’s 99 degrees outside!”",
            "This is the type of weather that keeps me from going to Central California to visit family, I just looked it up and it’s going to be 107 degrees over there tomorrow, fuck that I’ll stay where I’m at with my cool 72 degrees.",
            "I was supposed to run errands today but the temperature determined it was best to stay my goofy ass inside.",
            "I tell everyone all day, “this is why shootings increase during the summer. It’s too hot to be talking loud!” It’s too damn hot! Every year around the 2-3 week of June a heatwave hit. Every damn time!",
            "Them: “........... So you-”\n\nMe: “Man, it’s 92 degrees Fahrenheit in Atlanta and it’s fucking 6 P.M.!!”\n\nThem:\n\nhttps://preview.redd.it/vsbom7ya008d1.jpeg?width=300&format=pjpg&auto=webp&s=c16bb5d0305ec1855161bb612eece464978da239",
            "90 and up. After about an hour in that shit I can't think straight anymore. My only thought becomes about how hot it is and how I can escape it. Used to be like 95 and up but my tolerance for heat is disappearing with age",
            "![gif](giphy|xT0Gqz4x4eLd5gDtaU)",
            "Heat is one thing, the humidity will melt you.",
            "\"Did you pay your taxes?\"\n\n\n\"The UV index is set at 'High'\"",
            "Don't even wave at me if it's 85 or higher",
            "It's going to be 99° tomorrow in baltimore and 101° on sunday. I don't want to hear nothing from my friends. I barely wanted to hang out today, and it was 94. I can't stand summer.",
            "![gif](giphy|nrXif9YExO9EI)",
            "I moved to Las Vegas from the Midwest and summertime here is like winter time in the Midwest. If you don't absolutely have to go outside, you won't.",
            "I turn vampiric in these types of summers.\n\n Outside of work obligations I am straight up nocturnal. My people know me enough never to shout me before sunset on any day that hits above 75 at high noon.",
            "Temperature high as giraffe pussy.",
            "Elderly republicans doing their best to hold on til November so they can vote republican again before dying from this climate change 💀",
            "As a Las Vegas native, this is the way. I'm only outside to go from a building to my car and back. And that building is either my home, my office, or somewhere I'm getting food/drinks from.",
            "i moved to new orleans last fall and i'm just learning that summer in the south is like winter up north.  this is the season when you don't do jack shit except hide.  is it more than three blocks away?  then i don't need to be there.",
            "“Hey — did you pull out?”\n\n“108 degrees bae”",
            "I think Monster King has made a better point than Felonious Munk thinks he has. King said ‘any question’, but Munk has specifically picked questions where the logical link between the question and an answer that references the temperature is really straightforward. \n\n“Who was the first Prime Minister of Canada?” “Friend, it’s 91 degrees” illustrates the point better.",
            "These 90+ days combined with that east coast humidity has been torture.",
            "lol my friends know my rule for outside activities is if it’s lower than 40° or higher than 85° it’s a no go.",
            "While here in belgium it was 60 until two days ago and raining. We have been seeing rain for two months.\n\nAnybody ready to trade a bit of rain against a bit of sun?",
            "Dude posted on another sub that it was 53^o C",
            "120 around the corner like\n\n![gif](giphy|X05U0gOPkQ4G4)",
            "*insert item you want to buy\n\nAnd your parents/grandparents- \"you got 102° weather air max money?!\"",
            "113 in Phoenix today. No body expect shit from me, I'm going nowhere, my only goal is to not evaporate. In fact don't even stand by me lol 😡",
            "This heat out here in Central GA aint bullshittin.  And you can't even just look at the temp because the humidity is even worse.",
            "Nah deadass!",
            "What kind of question is \"are you trying to come through and suck me off?\"",
            "Anything that requires you to go outside in 90⁰+ degree weather should be illegal.",
            "Whatevs....chilaxing on my patio with an artic air cooler blowing on me. Smoking a bowl and getting ready for NHL. It's Vegas and 107 rn. Just another day that ends in \"y\"",
            "I hate the heat, summer time I essentially become a vampire. If its not necessary I don't go out at all and if I do go out its after the sun goes down.",
            "https://preview.redd.it/whazgxi0g08d1.jpeg?width=2160&format=pjpg&auto=webp&s=06030801f95e8736607bb39e10c7ea8deade753f\n\nToday in Newark",
            "Its 95 degrees 🎶",
            "I love the heat",
            "It was 89° today, felt blessed.",
            "\"Hey, you remember the angle of a square's corner?\"\n\n\"It's 90°!\"",
            "Sitting over here when it’s 114 like\n\n![gif](giphy|QMHoU66sBXqqLqYvGO)",
            "\"Did you wash your ass?\"\n\n\"IT'S 115°!\"",
            "How do they even have the energy to text you?",
            "Yep. It's June alright.",
            "https://preview.redd.it/t67egdpwz08d1.jpeg?width=856&format=pjpg&auto=webp&s=14892febf8e320cb2dc0fe730fa94242ebdaf02b\n\nLemme drop this",
            "114/90 today and for the next few months. Please tell me about your little heat wave",
            "I do this to my mother on a regular basis, LOL.",
            "I’m moving tm",
            "Can anyone tell me how to make the degree symbol from an iPhone keyboard? I’ve been using asterisks and they don’t hit the same.",
            "This sounds like me when it is hot. Hot weather and I do not mix.",
            "Too hot to smoke?",
            "Damn as someone in Houston, I have said this very recently. Love it",
            "Going to be the coldest summer in our future",
            "I'm in Vegas and, as of this posting, it's 12:20 am... and 93°.",
            "Boy, it sure is a hot one today, huh?",
            "It’s 75 rn and I’m still mad lol",
            "“Did you pick up the kids?”\n\n“It’s 102!”",
            "Did you call Sears yet?",
            "Bay Area and still got the windows open this late in June. My electric bill is appreciative, but I know it’s coming for sure.",
            "Thats fucking 41° in celcius? That kind of heat would have me mean as fuck 😂💀\n\n![gif](giphy|QvMlVkJ3XSSj9cOxDM)",
            "I live here in the Central Valley and yes, it does indeed suck ass. Makes me think of the this old Def Jam cd sampler that had skits and one was a weather report and dude just says, “it’s hot and my balls are sweating, back to you.”",
            "Same. My Texas relatives know I don’t come down in the summer anymore. I can see them for thanksgiving. I would say Christmas or new years too, but their grid doesn’t hold up in those months nowadays",
            "It was 108 here by me in AZ today. And humidity is rolling in with some rain so it's not even just a dry heat anymore. Suckkkks.",
            "As someone currently living in Fresno I'm not looking forward to it",
            "i just drove back from vegas and it was 104...was so nice tho (love the heat) but that sun exposure is wicked lol",
            "I wanted to sleep in tomorrow but have decided on doing my grocery shopping early, roughly 7 am ish so I can get back home to to the A/C and sleep in on Sunday wish me luck",
            "And you’re 100% right. Homicides peak in summer and it’s suggested because more people are out and about, but also, the heat makes people more irritable. What someone might let slide one day, they will not in extreme heat.",
            "Have worked in Level I Trauma Center. Can confirm. Not called “airin out the joint” for no reason.",
            "\"In the hood, summertime is the killing season. It's hot out this bitch, that's a good enough reason\"\n\n-50 Cent",
            "Shit it’s 8 PM in Cincinnati right now and it’s still 90 fucking degrees.",
            "Savannah ONLY 75 with 98% humidity lmao. My dumb ass works outside",
            "I worked in an office building in Germany with no AC and we had a 2-3 week heatwave, was 85-90 inside everyday\n\nNot a lot of work was done lol",
            "The demoralization when my speaker says \"It's currently 99 degrees outside, current humidity makes it feel like 173\"",
            "I'll take the 100+ dry heat over 80 something and high humidity. I went to Florida once in like June...never ever again. I do NOT understand how people live in that shit.",
            "I work construction and the humidity inside the buildings is unbearable. I tough it out and paint the apartments as quick as I can but it’s like stepping into an oven and just slowly boiling like a lobster. The corridors are breezy so when I step out you can see the steam coming off me.",
            "I had a music student in North Carolina (I taught online) who called it \"Air you can wear,\" and it's such an accurate statement.",
            "I work outside in SE Georgia, it is currently ONLY 75 but 95% humidity lol",
            "Waving from Henderson",
            "As a Native Las Vegan, this is how I've lived my entire adult life. I have no fucking clue how I was running around all day in the summer as a kid. I'd be in full blown heat stroke after 30 minutes outside these days.",
            "I'm also from the Midwest, originally moved to Phoenix, then to Vegas. I much prefer Midwest winters. \n\nMy partner lived in Phoenix most of his life and has such a hatred for Midwest summers. He's fine in the Southwest, for the most part but once we go back to my hometown he can't function because of the humidity - another added horror for him are the fishflies which he continues to be marveled and disgusted by after nearly 7 years together.",
            "Not a sentence I expected to read this evening, thanks for the laugh 😂",
            "Lmao I moved from New Orleans to up north and I’m loving the heat wave winter was whooping my ass 😭",
            "“Did you take the chicken out of the fri-\n\n“It’s 108 outside!”",
            "I'm reading this in Rochelle's voice on everybody hates Chris",
            "![gif](giphy|tnYri4n2Frnig)",
            "In SF, the heat doesn’t come until Sept-Oct. Sometimes we’ll get hit with a surprise heat bubble, but we good through August. 🤷🏾‍♀️ highest we’ll reach is 68 for the next two weeks. Told my family this is a great time to visit like they said they would for the past 10 years",
            "Part of why the bay area is top 5 most expensive places to live in the US is that you almost never see that kind of weather. It'll get into the 90s occasionally in late August or September, but even then you still get the ocean breeze and it cools off pretty well at night",
            "It does the same to us, part of why Florida has so many crazy people is the shitty weather",
            "How the hell do yall live in Arizona",
            "Girl, I am with you in spirit.",
            "Older me see why, older people got up at crack of dawn. Beat the heat. Cause me, I'm up at 6 to hit the track, shower, run my errands, done by 9:30 no later than 10. Back home, another shower if I'm sweaty, sweaty.  Chill in house remainder of day. I love the heat of summer, just from inside. Lol",
            "Falling Down comes to mind",
            "I pray thee, good Mercutio, let’s retire.\n\nThe day is hot; the Capulets, abroad;\n\nAnd if we meet we shall not ’scape a brawl,\n\nFor now, these hot days, is the mad blood stirring.\n\n\\-Romeo and Juliet, Act 3",
            "7pm in Phoenix and it's still 109. I hate this place.",
            "https://preview.redd.it/ijnxjhyit38d1.jpeg?width=992&format=pjpg&auto=webp&s=09537bc4c43598187a66d1231f9e02706e649a5b\n\n??\n\nP.S. Make sure to have sun protection! SPF and UPF! And yes, black people still need to wear fucking sunscreen. This why whenever we get skin cancer the diagnosis is much later and thereby has much worse odds than anyone else.",
            "Easily take 100+ with 40% or less humidity, easy peasy.\n\nAnything over 50% humidity just saps your strength instantly. Shade doesn't help you, some places of business are struggling to keep it cool cause the cheapskates want to keep it at 74 or something dumb",
            "I went to the dry desert area of Montana once and it was 110+ degrees but it didn’t feel that bad. It felt like 80ish degrees back home.",
            "I used to demo/remodel vacant homes, most didn’t have electrical until electrical was up to code. In the dead on TX summer, that shit would kill you. Don’t even get me started with the smell of old mildew and rotting floors.",
            "Also waving from Henderson!",
            "Waving back! My office is in Henderson",
            "I live by a high school and last year I saw kids out there practicing football in August and I don't know how they didn't die.",
            "I certainly think the Vegas Summer is worse than the Midwest summer. The Midwest summer comes with thunderstorms and so you will get a break from the heat. I remember one year it rained almost everyday in June and it was one of the most mild Summers I've ever experienced. That doesn't really happen in Vegas lol.",
            "Nah there’s never an excuse for not taking the chicken out to thaw. Mom’s gonna whoop your ass when she get home.",
            "I see you like to flirt with death",
            "For me living in Orlando those temperatures are crazy. That's winter time temps here.",
            "Yep! Got the fan in the one window sucking air out and pulling that cool air in from another window. Delightful and so effective most of the year.",
            "lol. I wish. It’s been much hotter for far longer in recent years compared to when I moved here in 2011. Still nicer than a lot of places but I’ve definitely noticed changes in the weather patterns over the years.",
            "That would make sense. I lived in Jamaica for a while and deadass noticed when the heat gets real bad, it makes people start fighting and getting frustrated more easily. I was so snappy and cranky in that heat. It was not 41° tho luckily",
            "Air conditioning. Without it this place is unlivable.",
            "It's pretty much the plot to Summer of Sam. ",
            "Predator 2",
            "It's supposed to get down to 93 at 4am. I can't wait/s",
            "I’m a white dude but my wife makes me wear sunscreen and a hat. Train conductor, my company makes me take a 15 min break every two hours and pound fluids. I’m from here so it’s not that bad, it sucks ass still but my wife will be dying walking to church and I’m barely sweating, but I’ve seen many a new guy just not built to last a summer on the tracks",
            "105 with 9% humidity here in Vegas right now. Still wouldn't be outside except from like 6-8am when it's in the high 70's to mid 80's. It's beautiful during those hours.",
            "I can only imagine, back in 2020 I decided to apply to a residential HVAC company and got hired, day one I had to assist with a diagnostic of a failing unit inside the attic of a large home… the attic was 130 degrees and climbing(we just stopped taking the temp) obviously it was overheating and malfunctioning but I’ll never forget that infernal attic",
            "Hey there!",
            "Ahhh the tenacity of youth",
            "That's how I feel. And the \"hotter than hell\" weather in the Midwest was really only through July, maybe first part of August - at least where I lived and if we really needed to cool down, we'd go into town, to the river to swim. It's much more bearable than the sun beating down and cars being 10 damned degrees hotter than it is outside. \nMy main thing though,  is that I always get sick in the heat. I don't sweat enough and that causes me to become ill. I thought it was bad in the Midwest, then I moved to the southwest and it's so much worse. The fire risk, monsoon damage, haboobs, etc freaked me the hell out when i first moved. It's definitely less of a risk in Vegas than it was in Phoenix but still.",
            "yes it is because if it's 108 outside no stove/oven should be on lol that's cold sandwiches and salad temperature 😒 momma ain't boutta be sweating in no hot ass kicthen. It's 108!",
            "![gif](giphy|2wW3IqGXH3YEsRsncx|downsized)",
            "![gif](giphy|ckGndVa23sCk9pae4l)",
            "Whenever I go I am always amazed by just how miserably hot and humid it is there.",
            "Interestingly, SF’s coldest month of the year is August.",
            "Had a layover in Vegas last week. Went outside to smoke it’s 103. I turned right back inside naaaah",
            "I'm the complete opposite, I'm a sweaty ass motha fucka lmao. Which is why I hate the humidity because I will just immediately be drenched when I walk outside. The dry heat is much less sweaty",
            "If we stuck to that here in Arizona, we'd only cook from October through April.",
            "dang brought back a core memory right there 😅",
            "No… January is the coldest and September is the warmest. August is like the second warmest, not the coldest at all",
            "Haha, that's what I WISH I could have done the moment I stepped off of a plane into Florida in June many years ago. Too bad I was booked to be in that humidity for several days.",
            "idk how it's legal to live in Arizona with the heat yall have! lol i used to work for a home warranty company and customers in az would call in complaining about their a/c being broke and their furniture MELTING and falling apart because of the heat. That's the devil level of heat so yes if i lived there it would be cold sandwiches and salad May thru September 🤣🤣. but yea you couldn't pay me enough to live out there.",
            "Lol, it did for me too!! Smh 🤣 🤣"
        ]
    }
}