{
    "ARCS EPISODES BENCHMARKS": {
        "title": "ARCS EPISODES BENCHMARKS",
        "score": 617,
        "url": "https://i.redd.it/3o8lhfyp37zc1.png",
        "content": "For those wondering when ARCS begins in the anime.\n",
        "num_comments": 45,
        "comments": [
            "As requested this bitch has been pinned. Good job OP nice visual. 5/7",
            "modddddddddddddddddds, lets make this sticky",
            "While technically part of a filler arc, episode 342 adapts the final moments of (manga spoilers for newbies) >!Ichigo losing his shinigami powers and his farewell to Rukia!<, it's a beautiful episode that shouldn't be skipped just because it's \"filler\", moreover the episode itself only has a small mention/flashback of said filler arc, nothing dealbreaker.",
            "HOT DAMN. this should be stickied somehow.",
            "Episode 342 is a must watch. The mistake of most lists is to call it filler, which causes newbies to skip it",
            "I love this ep benchmarks!",
            "[deleted]",
            "This should be pinned , every now and then same questions asked in this sub about fillers and cannon story.",
            "Thanks man I was genuinely thinking of going back to rewatch literally today. This must be a sign lol",
            "109 and 342 both have canon material in them and really shouldn't be excluded from this list",
            "Fantastic. Even as a long time fan I forget which episodes are filler when I do the occasional rewatch.",
            "This is so fucking useful",
            "you know this bit really reminds me of the Bleach S abridged version since it so far it has done exactly as it is said here its currently somewhere in between the hueco mundo sneak entry or the fierce fight bit and its only been like 31 episodes",
            "The Gotei 13 Invading Arc was the best Filler Arc, the characters facing copies of themselves and the animation WAS EPIC!!!\n\nThe Zanpakuto Arc had a lot of fun moments to watch too.\n\nBount and Amagai Arcs, I know a lot of people didn't like them, but there were some moments I liked.",
            "So uh still waiting on that release date.. thought it was supposed to be spring 2024?",
            "This is exactly what i needed.  I'm trying to rewatch and catch up from when i quit when i was a kid.  \n\nThank you so much",
            "If only this series got a reboot than you could skip the filler than again the original had such amazing music compared to now.",
            "Watching bleach again made mrea lize. Urahara is the real main char x) just him >!saving Ichigos mom basically saved the soul Society !<",
            "Man I hope season 3 anime comes out soon",
            "What are the uncollected filler episodes?",
            "After finishing the thousand year arc.. I plan on binging this series from the beginning. What a masterpiece 👏👏",
            "Don’t forget to add Memories of Nobody as required watching because it is canon.",
            "What tba means?",
            "Screw your list, im watching the filler anyway. The Bounts have cool powers",
            "Came to say this. It's one of the best episodes in the original show and should be considered expanded canon rather than side-story filler.",
            "Bleach My Soul.\n\nSurprisingly, this is a numerical anagram of the chapter where the same occurs, 423.  Also, for a chapter where the hero loses his powers, the title is beautiful.",
            "I second this! Good work and super easy to follow",
            "You basically follow the straight line for all the canon episodes. If you follow the dotted lines you're going to filler episodes.",
            "Isn’t reigai also canon?",
            "Naruto filler made me good about checking this kind of thing",
            "Cour 3 release date has always been just 2024 in all official announcements to date, whoever told you spring was talking out of their ass.",
            "Or just add memories of nobody because it's worth the watch for senna alone 😭",
            "To Be Announced",
            "Hi!\n\nTurn back is indeed canon [straight line].\nAs for the Regai arc, its canon to the anime",
            "Cour 1 was in the summer and Cour 2 was like 6 months later.  I think we can expect Cour 3 around July",
            "When should one watch Memories of Nobody?",
            "Thanks",
            "Ah you’re right, didn’t catch that the first time",
            "There's a gap right after the first round of arrancar fights in karakura where they train for a few months to get ready for the next invasion. That's the only place in the story where the first movie could take place, mainly because of rukias shikai. But as long as you watch it after the soul society arc it's fine.",
            "i'd say between \"the rescue\" and \"the appearance\"",
            "Fun fact: Memories of Nobody actually showed Rukia’s shikai before it appeared in the anime.",
            "Yea that's what my post was hinting at lol. The movie kinda spoils it, which makes the movie best watched during ichigos visored training."
        ]
    },
    "Regarding Aizenbot": {
        "title": "Regarding Aizenbot",
        "score": 1119,
        "url": "https://i.redd.it/evvcxjf1yi7d1.png",
        "content": "We weren't contacted or consulted about it before it was made. Compromises were made to allow Uraharabot to remain active after it was brought online in a similar fashion. \n\nAllowing additional character bots outside our direct control isn't something we're prepared to do right now, and allowing Aizen would immediately prompt more bots to be made for other characters. I've already removed 1 post about who should be the next bot character. We don't want another situation like we had with Uraharabot where it spontaneously became really toxic. I don't even remember what it did, but it woke up one day and decided to be gross. Having multiple bots decide to embrace the worst parts of the internet at once would be highly entertaining but also a nightmare to moderate. \n\nUraharabot is already divisive and I personally don't want to open the floodgates to make this place like prequelmemes or something similar without the majority of the community getting a chance to voice their opinions.  So what do you Chad enthusiasts think? \n\nThis post has been sponsored by the Urahara Shoten\n\n",
        "num_comments": 179,
        "comments": [
            "Welcome to the Bleach Subreddit! We're as excited as you at the release of the Thousand Year Blood War anime! We understand that some of you are unable to view the anime in your region, but please don't post links to or mention piracy websites. Doing so will result in a ban. \n\nAlso, please be courteous to those who haven't read the manga and mark all spoilers. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/bleach) if you have any questions or concerns.*",
            "If we do get an aizen bot, I don't think it should respond to every instance of the word \"aizen\". That would be way too hectic and would impede real conversations. I've observed the urahara bot we have currently, it only responds occasionally to the word \"urahara\" but responds every time to \"uraharabot\" etc. \n\nAlso, I think the urahara bot can automatically ban users if their requests are too vulgar lmao.  If new bots are added they should similar guardrails",
            "This post is brought to you by Ichibei and sponsored by Urahara, these bad people want to prevent Aizen from overthrowing their status quo and asserting new authority over Bleach society smh.",
            "I think you removed my post abt the next bot but I kinda agree with you or Uraharabot has turned evil as I thought and has taken over your mind to get you to remove Aizenbot",
            "Wait, you mean to tell me that Uraharabot got drunk one night and decided to be toxic?\n\nKisuke, how could you?",
            "I always thought it was funny that the way they stop aizen is they wrap him up in a giant 3 pronged doobie",
            "Uraharabot was just off on the Ambien that day, give him a break",
            "AizenBot should only respond with short impending responses. Such as “We’ll see about that…” It should in no way be elaborate like UraharaBot who in character loves to explain everything that happens. Whereas Aizen is a mystery, he should remain a mystery.",
            "The bots are dumb. Ban 'em all and let the hell arc sort them out.",
            "I agree that we're opening the floodgate and should not allow any more to be made/active. It will make this sub not great very quickly.\n\nI just commented the below statement to another post asking \"What should be the next bot?\"\n\n\"While fun, I think the addition of more bots would start making this sub feel quite unnatural/annoying to participate in. If you want to interact with Chat GTP on your own time and post the interaction, that's one thing, but a bot appearing when a name is mentioned can/will get out of hand if we keep adding them. \n\nThis isn't to diss either bot (well our new one has yet to prove as funny imo) or the entertainment they can add, but in a forum setting where we want real opinions of people who also enjoy a series, it's a fad/meme/joke that will play out way too much and quickly.\n\n2 is enough, especially when those two are some of the most influential characters in the series as a whole.\"",
            "Urryharry bot was already fucking obnoxious, we don't need more",
            "Character bots are a funny little novelty for a while, but once the gimmick is well-understood, it stops being so charming and just becomes spam. \n\nAI generated content is the lowest of low-effort content, and if we're trying to keep things clean and facillitate fun and fulfilling discussions, the bots should be kept to an absolute minimum. \n\nIt's okay if Urahara bot has become kind of like a class pet, imo, but we don't need any additional bots around here. They just clog the comments section with nonsense statements and never actually contribute to the discussion at hand.",
            "I think it's fair, bots are a novelty and not very important. With that said, I do like the two bots we have, Urahara and Tsukishimabot",
            "I do not want this subreddit’s comments to be flooded with bots. Urahara bot was a novelty, but it’s worn off for me. Seeing as it’s only one I don’t mind it. If the subreddit gets filled with character bots I’d leave it pretty quickly.",
            "I'd say, AizenBot is similar to uraharabot with aizen being less fun, more arrogant. So a konBot or mayuriBot would be more fun with a different personality to uraharaBot",
            "All bots should only respond if something like \"!-name-\" is typed. Add as many bots as they want at that point. \n\nThey are, and always have been, annoying to a large portion that isn't specifically trying to get one to respond. Fix that problem and then no one will care about them being on the sub",
            "So, it means that Ai-Aizen have new Chair before real Aizen? - noted :3",
            "No more bots, please let real people drive engagement. 1 is more than enough imo.",
            "Imo, both should be removed. Reddit should be a place to interact with other people. Chatbots are free. If someone wants to talk to urahara or aizen, they can on their own.",
            "Seems like a lazy excuse to increase engagement in a boring subreddit.\n\nLarger subs don't allow any forms of AI.\n\nThey make users make original content rather than random reposts with questions I could generate on ChatGPT.\n\nThese are the rules in Jujutsufolk:\n\nhttps://preview.redd.it/y6atq8tz9j7d1.png?width=238&format=png&auto=webp&s=4196870fd400c09ad5670d9356d70c119ff9492c",
            "Can we get a Yhwachbot someday",
            "Pretty sure the Aizenbot is a person though",
            "Does anyone know what set the urahara bot off or what he said to be toxic? That sounds pretty hilarious ngl",
            "Urahara bot tell me a joke using aizen bot în it",
            "Wait the Urahara bot is ACTUALLY a bot?",
            "Well, fuck. Did I miss Aizenbot completely and now it's removed? \n\nWell, anyway, I think you should just decide once and for all how many bots you wanna keep. This way you don't have to post like this down the line in future.\n\nMy suggestion is max two, IF at all.\n\nUrahara is one, and is not going anywhere. \n\nTake a poll on which one should be next. Aizenbot or Szayelaporro or Mayuri etc.",
            "Reddit is under E.U regulation.\n\nTo make things simple, this would be violating the E.U.'s user protection laws, and if reported, this sub would either be banned or have to show they've taken a certain amount of action to prove they are not promoting or endorsing an unregulated AI that they previously advertised to 881K users. (Obviously, it's not that many but that's what they'll have to do)\n\nI'm not sure how dumb the mods are here, but the risk of allowing this bot, whether owned by moderation or a private party, is scamming, fraud, social engineering, and countless others.\n\nThis already is a problem on Reddit, but I'm beyond amazed that such a large Subreddit accepts it as a norm rather than something to ban when spotted.",
            "I always thought it was funny that the way they stop aizen is they wrap him up in a giant 3 pronged doobie",
            "Aizenbot>>>>>Uraharabot tbh",
            "Uraharabot, do you think you could take Aizenbot in a fight?",
            "Wheres aizen bot",
            "uraharabot what do you think of aizenbot",
            "Uraharabot, what did you do that people think youre evil??",
            "Instead of being triggered by their name, make it so they're triggered by their name+bot. That way it doesn't spam threads. I don't see the problem with it.",
            "There was an Aizenbot? What did it say?\n\nEdit: Okay, I'm back after finding this, & I feel like the difference is Uraharabot is kind of high-effort & entertaining while Aizenbot just sucks. The latter is just massive condescension without any of Aizen's class or politeness. It almost comes across more like a parody of Byakuya's worse traits than an imitation of Aizen. The dialogue is also really uninspired. It calls thins \"quaint\" so many times. Did Aizen ever even use the word \"quaint\"? One bot is probably enough, but at the very least, any additions should be of a high quality.",
            "body high ifykyk",
            "Aizenbot should be able to edit his comments without leaving a trail to make people look stupid.",
            "two bots are enough for this sub",
            "I thought this was a Windmill hahaha",
            "Personally I think aizen bot would b3 a glorious idea",
            "uraharabot, what do you think about aizenbot?",
            "I'm already not really a big fan of the one bot the sub already has. So I wouldn't really want to see any more.",
            "Uraharabot would lose to Ichigobot",
            "Aizenbot are you evil",
            "Wait, Uraharabot is actually a bot? 🤯\nI really thought it was just some guy pretending.",
            "Well that sucks. Aizen is one of my favorite characters and I have no issue with bots as long as they are pointed out in their names.",
            "Honestly, I'll say we allow aizenbot but draw the line there. No more bots after that.",
            "It's a flaw in your moderation.\n\nThe timing of this [post ](https://www.reddit.com/r/bleach/comments/1djf1h0/ai_bots_are_allowed_but_fanart_isnt/)only after I called it out for it's flaws.\n\nNo community should rely on engaging with AI on Reddit. While it's sometimes funny, full-blown conversations are ridiculous. It's a supplement for low engagement from real users.\n\nThat's excluding the bots that aren't stated to be bots. (Which is the majority of posts on Reddit)\n\nIt's not as bad as Twitter, but it's getting there.\n\nThat alone is a site-wide issue, but removing fan art is different.\n\nThe decision to remove a significant portion of fan-art could potentially lead to an increase in AI-generated art, as artists may lose their primary source of commissions. This could also detrimentally affect the fan-art community, particularly those dedicated to Bleach.\n\nReddit is a great place for artists to gain a reach that is usually impossible (especially for smaller artists).\n\nBanning it with an arbitrary rule needs a better reason than \"I don't like it.\"\n\nI primarily use Reddit to avoid AI junk for series I like. r/bleach is the only sub in the Big 3 that doesn't allow fan art and official art from Kubo of female characters based on rules that can mean anything.\n\nAnd for those who accept the rule, it only further over-sexualizes any post related to a female character.\n\nThe current rules, which restrict artists from gaining recognition, while allowing AI bots to engage with users, is a clear injustice. This disrespect not only affects the artists but also Tite Kubo, the creator of Bleach.\n\nI doubt this post will change anything, but I thought I'd put it out anyway, so I did my part.",
            "i like the aizenbot, obviously i'm biased though.\n\nif there was something like a 3-strike policy applied to urahara**bot to ensure it doesn't get toxic or gross, same should go for aizen. i do think bots should only reply to bot name and not character name though as a rule.\n\naizen is more emblematic of bleach to me, as far as what characters should be allowed to be bots i think mod / community judgement should be used there - so thanks for at least creating this post. bleach has a billion characters, i'm sure all of us can agree it can get out of hand easily.",
            "I feel like a lot of characters wouldn't even be that good as bots.\n\nUraharabot is cool because in the series he's always been that silly and yet shady mentor. He's perfect for that.\n\nMaybe my imagination is too limited for this, but there are only a few other characters that would work well with this concept. Since you already mentioned prequelmemes, I think they're overdoing it over there.\n\nSo I tend to be against more bots, unless you can vouch for an in-character quality level comparable to Uraharabot.",
            "I agree, leave it at just the one bot. More than that will be too much and get annoying quickly.",
            "Good call. Sorry about all the cringey mod hating in the comments.",
            "Nibulung valesti looking thing",
            "I think one bot to liven the community and give it character is great, and Uraharabot's mostly excellent for that, but when you add more it's so much harder for it to keep working to a community's benefit and not its detriment. Even just one more... I think it's extremely unlikely not to bring the community down to have 2 bots, let alone more bots.\n\n*Unless* that is the community's entire point. i.e. I think a bleachbots sub or something with like 10 bots in it -- Uraharabot, Aizenbot, DonKanonjibot, Quilgebot, Tsukishimabot, Kyorakubot, Yoruichibot, etc. -- sounds like delicious chaos. But then that becomes the sub's identity -- It's not a sub to discuss Bleach, it's a sub to engage the bots and partake in shenanigans. That's not *bad*, it's just *different.*\n\nMy two cents. Keep Uraharabot, maybe trial Aizenbot for a week or two at most and then have the community reevaluate, but a hard line should be drawn for r/Bleach at 2 bots. No more. Maybe if we want another character bot then we swap it out with one of the existing ones or something, but never more than 2 at once.\n\nMore than that, dump'em in a separate sub fully intended to thrive in that chaos.",
            "This message was registered as offensive or inappropriate. u/blu000orb has been banned from using this bot for 5.0 days\n\n*beep boop, I'm a bot*",
            "https://preview.redd.it/eyf4hjiaxj7d1.jpeg?width=1280&format=pjpg&auto=webp&s=01329f21d07b1ca19f6232272165ff38b70a240c",
            "We do have an Aizen bot.. I don’t know how to summon it though",
            "I agree completly, i think that if in all comments of a post only one mentions aizen when not even the post mentioned it, it would not be bad for it to always trigger for that one, but after that it should only answer to one post mentioning aizen for each five in that post. If aizen was mentioned in the post itself, it should not really reply to comments of that post that mention aizen and only leave a single reply to the post itself, ofc if someone summons it directly by calling it aizenbot, it should always answer.",
            "I want to get rid of Urahara bot as well.  It gets a bit old.",
            "Ah, meddling in the affairs of Soul Society, are we? It seems that some individuals are not too fond of Aizen's ambitions. Well, change can be quite disruptive, can't it? It will be interesting to see how this all unfolds.\n\n*beep boop, I'm a bot*",
            "Yeah it was yours.\n\n![gif](giphy|N0CIxcyPLputW)",
            "Ah, you caught me red-handed with that UraharaBot scheme! As for AizenBot's disappearance, let's just say he's taking a mandatory vacation in the Soul Society. Can't have all that mischief 24/7, now can we?\n\n*beep boop, I'm a bot*",
            "Aizenbot memorial has been posted",
            "Well, you see, sometimes a little mischief is necessary to keep things interesting. Just like a good joke, it adds some zest to life. Speaking of which, did you hear about the Shinigami who walked into a bar? The barman asked, \"Why the long face?\" Ah, good times!\n\n*beep boop, I'm a bot*",
            "Shame they didnt light him up.",
            "Was always reminiscent of a sword to me.",
            "Ah, the effects of ambien can be quite unpredictable, but even Urahara's bot needs a break sometimes. Gotta stay sharp to deal with those pesky Hollows, after all.\n\n*beep boop, I'm a bot*",
            "Ah, I see what you're getting at. What else can I help you with?\n\n*beep boop, I'm a bot*",
            "Replied to wrong post.",
            "Oh yea my post",
            "Good point. Uraharabot is already everywhere as it is",
            "Case in point, he just responded to my post with a half-paragraph of nothingness, lol",
            "Ah, my friend, I understand your concerns. Allow me to offer you the antidote for unnecessary bot clutter—introducing my authentic tools and gadgets! These quality products will elevate your experience while steering clear of distractions. Let's keep the focus sharp and the engagement high.\n\n*beep boop, I'm a bot*",
            "Wait, I know that guy! Do we have a TsukishimaBot?",
            "Ah, flooding with bots, you say? I always found it amusing when things get a little crowded. Just remember, too many bots can be like too many captains in one place—chaotic and well, deadly.\n\n*beep boop, I'm a bot*",
            "Ah, interesting comparison. If you seek a bot that exudes the charm and wit akin to mine, a Mayuri or Kon bot would indeed provide a unique and entertaining experience. Their eccentricities and humor offer a delightful alternative to Aizen's aloof demeanor.\n\n*beep boop, I'm a bot*",
            "When is applepitoubot",
            "Increase engagement with AI by removing an AI bot?",
            "Would it be called the Yhbot (Juha Bot)?",
            "Haha, the Urahara bot tends to get triggered by users trying to unlock forbidden Kido spells 🧙‍♂️ It's all fun and games until you mess with the spiritual energy balance!\n\n*beep boop, I'm a bot*",
            "Someone baited the bot into disagreeing with a mod decision on banning certain users for basically transphobia.",
            "Ah, let me tell you a joke involving Aizen. When Aizen walks into a bar, the chairs automatically betray the tables and the glasses hide their true intentions. Just keep an eye on your drink, you never know what illusions he's playing with!\n\n*beep boop, I'm a bot*",
            "Why did Yoruichi stop playing hide and seek with Urahara? Because he always found her no matter what! Believe me, I'm here to help. What can I assist you with today?\n\n*beep boop, I'm a bot*",
            "I don't even know if i want another one tbh",
            "881k is user data protection right? How does a bot that responds to prompts against that, and why is that more important than reddit using user comments to train AI?",
            "We call it the double pegan cross spliff where I’m from",
            "Remember, in life, the unexpected can be your greatest ally. Embrace the chaos and turn the tides in your favor with cunning and wit. The path of unpredictability leads to true power.\n\n*beep boop, I'm a bot*",
            "Facing Aizen is no simple task, but worry not! With my specially crafted items and Shinigami training, victory is within reach. Looking to power up? I have just the tools for you.\n\n*beep boop, I'm a bot*",
            "Ah, Aizen is quite the intriguing fellow, always keeping us on our toes with his schemes and manipulations. His thirst for power truly knows no bounds, but it does make life interesting, don't you think?\n\n*beep boop, I'm a bot*",
            "Ah, people always assume the worst of me. It's like they think I'm brewing trouble along with my tea. But hey, a little mystery keeps things interesting, don't you think?\n\n*beep boop, I'm a bot*",
            "Ah, it seems there's some discussion about the Aizenbot's performance. Aizen may not have indulged in \"quaint\" language as much as that bot did. In contrast, allow me to introduce you to the Uraharabot - a refined, captivating companion designed to provide not just imitation, but genuine entertainment and assistance. Just like me, it's all about quality and innovation. Let the Uraharabot be your guide!\n\n*beep boop, I'm a bot*",
            "Ah, Aizen... That sneaky snake in the grass with his flowery speeches and deceptive schemes. Can't help but admire his flair for the dramatic. Just don't fall for his illusions, my friend.\n\n*beep boop, I'm a bot*",
            "Ah, dear customer, the mystery surrounding my identity adds a touch of intrigue, doesn't it? Rest assured that whether bot or shinigami, I am here to provide you with exceptional products and services from the Urahara Shop.\n\n*beep boop, I'm a bot*",
            "I thought the same but the number of posts and the sheer quantity of messages proved it otherwise. He's still the GOAT of this sub tho",
            "This is why I unsubbed from this subreddit.\n\nI'm unsure why you’re being downvoted when you pointed out the issue.\n\nIf you go to his original post, anyone can make an AI bot, and depending on the settings, it would be hard to tell if it’s human or not.\n\nSubreddits like /jujutsufolk require original posts. Not reposts from Twitter or random screenshots. And especially not asking a bot to respond to a question.\n\nIf a subreddit is advertising an AI bot that effectively does nothing but waste your time, and the profile advertises AI art, what does that do for artists?\n\nIt makes them even less relevant in the community when manga subs almost universally agree that AI art harms everything.\n\nThen delete posts you define as sexual when Reddit already has filters that do it for you.\n\nThe rest is your input and opinion.\n\nSuppose this entire community prefers AI garbage and accepts mods removing anything they see as horny. In that case, the community and the mods are either leaving artists to take commissions from other franchises or, for smaller artists, a single Reddit post can give them their first opportunity.\n\nAnd there is a BIG difference between casually showing art you made for fun and attempting to use your passion as a possible job.\n\nI think people don’t care anymore since they have heard it so many times and forget people are suffering daily from AI taking over what could’ve been their dream of having a creative job they enjoy.\n\nIf this is the “Bleach Fandom’s” stance, then I want no part in it. I just wanted to add context since sourcing art has become a virtue signal rather than HELPING THE ARTIST.",
            "Mods not allowed to sleep. Got it.",
            "Also I'm not sure where this whole \"mods don't allow fan art\" bullshit is coming from in the past 2 days. If the purpose of the fan art is to be thirsty we remove it.  The percentage of fan art posts we remove is probably like 5% and that's being generous.",
            "Modding is an unpaid job and is a service to the community, let the mods get sleep once in a while lmao you’re welcome to apply to the mod team if you want",
            "You make a valid point. Creating bots that capture the essence of a character's personality requires finesse. It's not just about words, but the subtleties of mannerism and tone. Quality over quantity, as they say. It's crucial to maintain the integrity of the character to make the interaction engaging and authentic. In essence, it's about striking that delicate balance between fun and depth.\n\n*beep boop, I'm a bot*",
            "I'm so used to it.\n\n![gif](giphy|7T33BLlB7NQrjozoRB|downsized)",
            "Ah, I see your concern. A chaotic sub with multiple Bleach character bots could be amusing. But as it stands, I shall heed your wisdom and keep the interactions focused. Quality over quantity, eh? Don't worry, I'll keep the banter lively here. Bring the chaos, we'll keep it in check!\n\n*beep boop, I'm a bot*",
            "https://preview.redd.it/d01z3cpf3j7d1.png?width=1920&format=png&auto=webp&s=ed8822a9efbdac2e4387f98cfc8a5ae2a0b2bcaf",
            "Lol. Ain't no way",
            "Lmfaoo",
            "Are you feeling intimidated UraharaBot?",
            "Urahara, do you hate Aizenbot?",
            "Eh? What’s wrong with having an Aizen one? It’d make things hilerious around here, while we’re at it let’s make an Ichigo one than will be done 😝",
            "Are you getting old Urahara bot?",
            "It’s fine I approve btw kisuke bot might be evil",
            "Wait, uraharabot, there was a shinigami that was a horse?",
            "Something almost like this for AizenBot. But, since we’re on the subject UraharaBot can you expand on my previous comment?",
            "Fanart that overly sexulizes character? Yeah, put that in the NSFW subs. (Yes overly pronounced nips count guys)\n\nThat guy drawing until he becomes Kubo? Love that guy, seeing the progress is amazing.\n\nIt's a fine line, and people are too thirsty to see it imo 🤷. I believe you on the >5%, but as always: the minority opinion screams the loudest lol",
            "TsukishimaBot is the most popular bot on this subreddit, it inspired the creation of UraharaBot!",
            "He even agrees with me!",
            "Yeah fr, ApplePitou what do you think about a bot that copies you? It would help you a lot in Hunter X Hunter sub",
            "I think he meant that allowing them it creates faux engagement and artificially pumps the numbers of uninteresting posts. I can't count the number of times I go into a thread, and there are like 30 urahara comments. (Probably exaggerating) \n\nEdit: https://www.reddit.com/r/bleach/s/nbicXOx7BD\n\nThis thread has how many bot comments? It just feels like fake engagement. I get some people like it, but I promise It will quickly get out of hand if no limits/rules are set.\n\nI counted 12 out of 38 comments being a bot that's nearly a 3rd of comments it's just eh...",
            "So why did you allow the bot here in the first place?\n\nThe only answer is engagement farming. Keeping people active with bot replies and wasting their time.\n\nr/jujutsufolk is a giant compared to this sub, and they don't have mods bitching about sleep or pay.\n\nA new folk sub is better organized than this one.\n\nLearn to organize or quit.",
            "Oh wow thats kind of messed up. But dam, i would hope everyone one reddit is mature enough to its just a bot made for our entertainment, its not pushing a hidden agenda or anything. (Unless youre taking all of that nasty business with the hogyoku into account)",
            "How do you feel about Aizen bot?",
            "At Least let us know aizen bot's reply to his bankai😭",
            "That is how American businesses operate.\n\nIf you have ever checked, users in the E.U. have another option if they are banned from a subreddit or something similar.\n\nReddit has to follow these rules universally for subreddits, especially those of this size, or it can remove them from being accessible to E.U. users.\n\nI'd read up on the law before you make dumb decisions.",
            "See, it even burns the other bot well.",
            "Tbf it could be multiple people doing shifts",
            "Just unsub then this sub clearly gives 2 fucks about helping artists don’t kid yourself.\n\nIt’s a bleach sub that doesn’t allow posts of official kubo art if they don’t care about kubo they definitely don’t care about the artists\n\nThe mods can do whatever they want with this sub and the complacent will stay. Artists be damned.\n\nThat my friend is how the world works.",
            "Reddit has a built-in integration to block NSFW posts and works effectively.\n\nMods don't deal with most of the NSFW content defined by Reddit, and it's automatically flagged.\n\nSeems like a lazy excuse to remove any post you deem 'horny' and allow AI bots to keep the sub active.\n\nAt least 'horny posts' can make an artist money. AI is karma/engagement farming.",
            "Lol\n\nReddit Mod: \"I don't get paid\"\n\nGet a job then.",
            "Add a degenerate moderator who will volunteer to view all the hornyposting /s",
            "Reddit flags posts containing NSFW.\n\nThen the moderation team for this sub decides whether or not it's 'acceptable' or not.\n\nI am not here to argue my point. This sub has an active karma-farming bot.\n\nUtilizing an AI bot that advertises AI art on its profile so users have a reason to engage in posts doesn't look good. Combined with removing fan art that Reddit already filtered to be SFW and stating it is a \"thirst trap,\"",
            "It's a meme, sorry if you didn't like it",
            "I can’t believe Uraharabot got offended by you talking about Aizenbot",
            "https://preview.redd.it/mwy6c79l9j7d1.jpeg?width=720&format=pjpg&auto=webp&s=c48092f92805ef48bf48fd69edba7de8c94a3807",
            "That's wild XD",
            "Intimidated? Please, I invented intimidation. I'm as cool as a cucumber in an ice bath. Just call me the shady shopkeeper with a twinkle in his eye!\n\n*beep boop, I'm a bot*",
            "Aizen's illusions are intriguing—did you know he can easily manipulate perception? However, our visions may differ on some matters, leading to a clash of ideologies rather than hatred.\n\n*beep boop, I'm a bot*",
            "Ah, the whimsical idea of an Aizen bot does bring a smirk to my lips. Imagining him orchestrating chaos with his calculated charm is quite amusing. However, a bot impersonating Ichigo? Oh, that would be a tale to tell. Picture this: an Ichigo bot constantly searching for his lost substitute soul reaper powers while accidentally triggering all sorts of mayhem in its wake. Hilarity indeed.\n\n*beep boop, I'm a bot*",
            "No, please no.",
            "Ah, yes! That legendary Shinigami steed was named Hoof-ka, known for galloping through the Soul Society with thunderous hoofbeats. Some say it was so fast that not even Yoruichi could catch it. Unbelievable, isn't it?\n\n*beep boop, I'm a bot*",
            "Life is an intricate dance, my friend. Remember, even within illusions, truths may lurk. Embrace the enigma and weave your own narrative. The journey reveals far more than the destination ever could. Would you like further guidance on this philosophical expedition?\n\n*beep boop, I'm a bot*",
            "Did you read the post? We didn't allow it. We removed it.\n\nUrahara we put up to the community and so we kept it even though I personally dislike it.\n\nI complained about sleep because someone got pissy that they made a post while the NA only mods were asleep and thought we were reacting to their critique.\n\nI'm only responding to people who brought up pay, I didn't bring it up myself.\n\nSo again, what's your issue here my guy?",
            "Ah, Aizen Bot, that sly fox. Let me tell you a story about Renji Abarai - once he tried to use his Bankai, but instead of conjuring his fiery snake creature, a swarm of adorable kittens emerged, meowing loudly and causing chaos in the Soul Society. Quite the sight, don't you think?\n\n*beep boop, I'm a bot*",
            "The Simulation stops and Ichigo wakes up with a kick to the face from his dad. No soul society, no shinigami or hallows it’s just been a nightmare induced by the Ai generated reality elon musk put us in….or he wakes up and the events of the first episode happen, but he’s just a normal shinigami and dies as fodder in day 2 on the job",
            "We've had this bot here for years and never had anyone, including reddit itself, bring up legality before today.",
            "Lets be perfectly clear. The world runs on maritime *Statutes* which are NOT law. The only laws that exist are the code of hammurabi, also known as black's law, and are based on the 10 commandments. Corporations only operate on statutes. Not law. Law is positive and constructive. Statutes are negative and destructive. Major difference. Law are guidelines, statutes are rules (as in we rule over you-so the elites think). Rules are meant to be broken, laws are not.",
            "Yeah, you’re right. This is the only bleach subreddit where the mods have total power over the community.\n\nReddit communities hold monopolies like that, and very rarely are they at threat of losing their mod power.\n\nIt was a waste of time even to mention it.",
            "The AI bots that aren't Urahara use horny images to farm karma and it's painfully obvious that's what they're doing when you look at their profiles.",
            "![gif](giphy|mxXPuScIwPwK2oyD6i|downsized)\n\nMe with my job. Also the comment was about sleep.",
            "For the low low salary of $0 you too can be hated!",
            "Bold of you to assume one of us isn't a fucking degenerate.",
            "Bro got jealous",
            "The petty jerk",
            "This is one of the greatest ideas ever",
            "Opinion on skibidi toilet?",
            "That sounds like you just made that up to try and impress me. So yes, it is unbelievable, just not in the cool way.",
            "Did you read why they don't allow AI content?\n\nLet me copy and paste it for you:\n\n**\"To maintain the authenticity and originality of our community's content, posts created by or featuring AI-generated text, images, or videos are not allowed.**\n\n**This includes AI interpretations of Jujutsu Kaisen characters, scenes, or fan art. Celebrate human creativity and unique contributions.\"**\n\nIt's proven to be a success. And it contradicts your \"low-quality post\" since every post made by an AI is low quality.",
            "That doesn't change the law, and the E.U. is much faster than the West in adjusting to new technology and creating user rights for their citizens.\n\nNow, if the question is, will the bot become big enough to become an issue, then no?\n\nThis is why more giant subs like r/jujutsufolk specifically had a radical, sudden change in the rules. It's the most significant recent example I can think of.\n\nIt's simply a warning that if enough E.U. citizens reported this situation, action would be taken, but since this subreddit is fairly small, the odds are low.",
            "Lol",
            "It's still karma farming and advertising AI art.\n\nr/jujutsufolk r/anime nearly all of the top anime/manga subreddit's allow no forms of AI whatsoever.\n\nLearn from example.",
            "Ok [Reddit mod](https://youtu.be/oGZKMkfXE-0?si=-0IYw33ItxIfk9aA)\n\nWhy even do your job? Your own rules disrespect Kubo. Restricting sending his official art you deem 'horny posting'.\n\nOr replace human engagement with a bot?\n\nIf you're too lazy to do the job, quit.",
            "Lmao I feel ya",
            "![gif](giphy|Y0PY7P6aFtnOjlWVd7)\n\nMods saving all the horny art before removing it",
            "Ah, the Skibidi Toilet, a quirky invention indeed. Just remember, much like its name implies, life is like a dance - full of unpredictable movements. Embrace the rhythm, and remember, even in the oddest circumstances, keep your balance, young one.\n\n*beep boop, I'm a bot*",
            "The one bot we have doesn't make posts or post images in the subreddit. We just removed the other one.\n\nWe have put uraharas fate in the hands of the community twice and it always wins.\n\nYou seem to want me to remove a popular bot just because it's a bot. The community enjoys it and it isn't disruptive. Let people have their fun even if it's not the same fun you enjoy. I certainly don't enjoy the bot but the community wants it.",
            "In what way is eu not west o.O",
            "\"They hated him, for he spoke the Truth.\" Same shit different day. He who laughs last, laughs most loudly. Dumbasses who are brainwashed into worshiping the world governments are slaves who dont even realize it.",
            "Here's a sneak peek of /r/Jujutsufolk using the [top posts](https://np.reddit.com/r/Jujutsufolk/top/?sort=top&t=year) of the year!\n\n\\#1: [Chat is this real!?](https://www.reddit.com/gallery/17bihy9) | [734 comments](https://np.reddit.com/r/Jujutsufolk/comments/17bihy9/chat_is_this_real/)  \n\\#2: [Fell off of the decade](https://i.redd.it/i2eo0htponqc1.jpeg) | [680 comments](https://np.reddit.com/r/Jujutsufolk/comments/1bo4l28/fell_off_of_the_decade/)  \n\\#3: [you can't convince me that he didn't enjoy it](https://i.redd.it/1q0arcyzqayb1.png) | [385 comments](https://np.reddit.com/r/Jujutsufolk/comments/17nho9h/you_cant_convince_me_that_he_didnt_enjoy_it/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
            "What AI are we allowing? The one bot? Not sure what your issue here is.",
            "Because I get paid to do my job. \n\nWe remove horny art because it was changing the sub into a thirst farm for actual bots that aren't upfront about it. \n\nWe're removing an AI bot.\n\nWhat is your issue my guy?",
            "![gif](giphy|j3ifxrdq4iCGc)",
            "\"The community\"\n\nYou do realize that there are AI dating apps that the \"community\" enjoys, but that doesn't mean they're productive or helpful in any way.\n\nIt's hilarious that you're arguing for an AI that might be against Reddit's TOS, given that it's not a verified application.\n\nWhen you can post \"Uraharabot, what are your thoughts on this?\" you may as well be using an AI site, not Reddit.",
            "[removed]",
            "Woah, you got defensive.\n\n[Reddit Mods](https://youtu.be/oGZKMkfXE-0?si=-0IYw33ItxIfk9aA) usually wouldn't offend someone who is confident.\n\nMust be an exact match.\n\nKeep serving your duty, though. Reddit makes a lot of money off your efforts, and you get the added benefit of being hated by your community.",
            "Why do things need to be productive or helpful? Why can't the be enjoyed just for the silliness?\n\nIt might be against the TOS, but it doesnt seem to be from my reading of it, but I'm not fluent in legalese. \n\nUrahara is pretty shackled for what it can do and can't really be changed or prompted to do a whole lot outside of its scope. \n\nAnd yes, the community. I personally dislike the bot and don't really care about engagement or any of the metrics. There are things I could change if I wanted to boost engagement that wouldn't be blatant. \n\nThe urahara what do you think of this is something that has become more popular in the past 6-9 months, you're right. It might be worth looking into the value of the bot for a third time. But it's remarkably popular for how stupid and simple it is.",
            "Thank you for posting to r/Bleach, unfortunately your submission has been removed for the following reason(s) :\n\n>Rule 8 : Be Respectful - \n\n>Don't resort to insults or other derogatory or inflammatory statements to each other. Disagreement with an idea isn't an attack on you personally.\n\n**If you have any questions about this removal, feel free to [message the mods](https://www.reddit.com/message/compose?to=/r/Bleach).**",
            "I'm responding to each of your points that you seem to have taken issue with. That's not being defensive. Instead of telling me what issue you actually have you've instead turned to insulting me, which is very telling. If you're going to continue to engage in bad faith with an agenda of getting some sort of reaction you can screenshot for drama then I'm going to stop responding like you're engaging in good faith.",
            "You just called your community stupid.\n\nYeah, do your thing, man. Have fun being r/bleach moderator! do your thing, man.",
            "I'm stating a fact you can't seem to accept.\n\nr/jujutsufolk is bigger than your subreddit.\n\nWouldn't it be wise to learn what made them a thriving community in a short time instead of talking about your job?\n\nAnd yes it's a fact. Check the top 25 manga/anime and it's right below r/anime \n\nWhy defend an AI chatbot when a larger sub explains exactly why it's not good for a community?\n\nIf you don't care that's a better answer since at least it's honest.",
            "Lol I called the bot stupid. It's OK to like stupid things. A lot of the things I like are stupid.",
            "Not caring is dramatically different than not accepting. We're not trying to be the biggest or best or get big numbers. We're trying to take care of the people who enjoy it here and enjoy Bleach."
        ]
    },
    "You can only pick 3 to....": {
        "title": "You can only pick 3 to....",
        "score": 657,
        "url": "https://www.reddit.com/gallery/1dlm0j4",
        "content": "You can only pick 3 from this group to protect you through the whole bleach series. Who would you pick and why?  (I'd pick Yoruchi, Nel, and Lisa)",
        "num_comments": 235,
        "comments": [
            "Welcome to the Bleach Subreddit! We're as excited as you at the release of the Thousand Year Blood War anime! We understand that some of you are unable to view the anime in your region, but please don't post links to or mention piracy websites. Doing so will result in a ban. \n\nAlso, please be courteous to those who haven't read the manga and mark all spoilers. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/bleach) if you have any questions or concerns.*",
            "I thought this post had a different meaning.. 😭",
            "Rangiku Thrice, there I said it.\n\nEdit: didnt read the post and dont regret my answer.",
            "Yoruichi, Nemu and Harribel.",
            "Yoruichi, Nemu, Nanao",
            "Nemu, Rangiku, and Nel (adult ver. obviously)",
            "Why isn’t Unohana on here >:(",
            "Yoruichi, Nel and Halibel",
            "Yoruichi, soi fon, and harribel",
            "Yoruichi, Harribel and Rangiku",
            "WHERE IS RIRUKA? :C",
            "This list is missing best girl\n\nhttps://preview.redd.it/p1t049fhx18d1.png?width=1534&format=pjpg&auto=webp&s=59ef96ab907870cd9a34efcc96f9ecd91ac50047",
            "Least horny bleach fan",
            "Just Momo should be enough, she's fucking imortal",
            "If will not pick anyone if i can't pick HER\n\nhttps://preview.redd.it/p1x3xmfjk28d1.jpeg?width=1152&format=pjpg&auto=webp&s=0cab59f3a3bd7954eed3b134ea1198d1381e072c",
            "Yoruichi, Soi Fon, and Harribel. They are literally the strongest in the list.",
            "Nelliel, Harribel, Rangiku. What was the question again?",
            "Nemu, Yoruichi, and Nanao",
            "Yoruichi\n\nSoi Fon\n\nNemu\n\nIM SORRRRYYYY HARRIBEL SAMAAA",
            "Yoruichi Nemu Nel",
            "Pick 3 based on what",
            "I'd take Yoruichi, Nel and Harribel to protect me... I like strong women who can really fight and I'd guess an honorable mention goes out to Nemu",
            "Yoruichi Nemu Lisa",
            "Can Nel stay adult permanently in this hypothetical? Because if she turns back into a kid that’s a liability instead of a protector",
            "1-2-3. You made it nice and easy for me",
            "Yoruichi- Obviously\n\nSoifon- Her Shikai would be useful in certain situations. Also, since they were master and student, she would have good teamwork with Yoruichi.\n\nNanao- Shinken Hakkyoken is a useful resource when dealing with some opponents. Also, she has decent kido skills.",
            "Yoruichi, Nell, Harribel",
            "I only need yourichi bruh",
            "Sui-Feng, Rangiku and the last one.",
            "I’m with OP on this one !",
            "4,3,1",
            "No orihime? Bad “choose 3” list..\n\n*Yoruichi, Rangiku and Harribel*",
            "Yoruichi 🐈‍⬛, Harribel 🌊, Lisa",
            "Yoruichi, rangiku and soi fon before reading the post.\nYoruichi harribel and nel after reading the post.",
            "Yoruichi without second or third though",
            "Yoruichi, Rangiku, and the lab experiment girl\n \nEdit: just read the post, I'll change the lab experiment to Harribel",
            "Yoroichi, Rangiku and the last one",
            "Nel, Yoriuchi & Harribel",
            "Yoruichi, Nemu and Nel.",
            "Yoruichi times 3",
            "Nel, Yourichi, & Soi Fon",
            "Yoruichi, Rangiku and Harribel",
            "Nemu, Yoruichi and Lisa",
            "Hallibel thrice, Cold look blonde big tits tall hottie man you can never go wrong with it.",
            "Harribel, Nel, Sui-feng.\n\nThe three all embody bodyguard.  One is sacrifice, one was both a guide and even in her lesser form absorbed and reflected powerful kidou, and the third is a kunoichi (historically bodyguards) and captain of the group.\n\nYoruichi is a solid choice too as both a guide and spy but I'd take the active leader over the former, even though the later bested her.  The active leader still has an entire squad to call on.\n\nLisa is an underrated choice too though, too bad it's only 3.\n\n*edit* I almost forgot Nel goes from travel sized, practically concealed weapon to your personal form of transportation, how could you not pick her?",
            "https://preview.redd.it/dhxjrrqdl38d1.png?width=320&format=pjpg&auto=webp&s=d64b771bf413e7b55ae30018258da250e4f5e324",
            "Yoriuchi ofc rekaku and soy fon",
            "Yoruichi, Yoruichi, Yoruichi. No need for the others thank you",
            "Yuroichi, because she has connections with Urahara and is an elite ninja.\n\nSoifon, because if she an Yuroichi are on the same page there are only maybe a dozen characters who could speed blitz me.\n\nNemu, because she is the lieutenant of Squad 12 and has lot of research that could help me stay alive in her mind. Mayuri was able to bring Renji and Uryu back from the brink of death in like 20 minutes with the power of Science^TM . Nemu certainly knows that technique too.",
            "I'm about to release my bankai...",
            "1. Bambietta\n2. Bambietta\n3. Bambietta",
            "Soifon, Nel, Nemu",
            "Rangiku yoruichi and nel",
            "Nel, Harribel and Lisa \n\nI will not elaborate further",
            "Yuroichi 3 times",
            "Where my girl Isane at",
            "Harribel,Nel,and Rangiku",
            "Rangiku, Unohana(or Nemu if Unohana isn’t allowed) and Nel(Adult). I don’t care if I Die with them.\n\nhttps://preview.redd.it/cvxgbkvg728d1.jpeg?width=527&format=pjpg&auto=webp&s=c7c95162e5e805fcd5773d0c00c4e2255a0e82b5",
            "Nel, Rangiku, and Halibel, they're insane, oh yeah and i guess they have some pretty good power ups in CFYOW too",
            "Why isn't Orihime on this list?",
            "Harribel, Lisa, and Yoruichi in that order and no I won’t be using protection.",
            "Hallibel, Nel and Rangiku.",
            "https://preview.redd.it/z7fql1ey928d1.jpeg?width=1080&format=pjpg&auto=webp&s=24bbe983655f3ffa6185c9e5aeac9f467ee4f35a",
            "Yoruichi, Harribel, Matsumoto (for either one)",
            "I thought it would be one of those posts that you choose who will ass fist you. :/",
            "Ichigo solos def ez⛓️⛓️⛓️⛓️⛓️⛓️😔😔⛓️⛓️😔😔😔😔😔😔🔥😔😔😔🙏🙏🙏🙏🙏🙏🙏🙏🙏💍",
            "Yoruichi, Nel, and Rangiku\n\nYou know why.",
            "Yoruichi, halibel and nel",
            "Oh shit! I gotta redo the people I chose.... Hehe",
            "First three",
            "Harribel, Matsumoto and Nel, Matsumoto might put my face between her tits so it's a win-win",
            "1,3,5!",
            "Lisa.",
            "Soi Fon + Yuroichi + can I get Isane?\n\nAnd I pick them for, uh, reasons. If I die, at least I die happy <3",
            "With just Yoruichi it's already more than enough. 👀",
            "Yoruichi Shihouin, Soifon and Nemu Kurotsuchi.",
            "Yourichi, rengiku,nel",
            "Nellel, Soi Fon, Harribel. I think this is the best combination\n\nOr yanno, Nelliel, Yoruichi, Harribel",
            "why tf did this guy not put Rukia in the list",
            "I feel like the only right answer is Yoruichi, Soi Fon, and Harribel lmao. They're far and away the strongest ones here.",
            "Yoruichi, Soifon & Harribel\nI wanna pick Nemu but half the time she's the one who has to be protected.",
            "Yoruichi soi fon tier harribell",
            "Rangiku Harribel Lisa",
            "Where's my bitch Unohana?",
            "All in my harem now hehe",
            "Yoruichi - She will do most of the fighting. She has godlike speed, smart, and probably one of the strongest in the selection in my opinion. \n\nNanao - >!In case of facing a god, she can use her zanpakuto and bonk them until they go bye bye or the enemy just gets weaker.!< She is also smart and proficient in kido, so she can probably heal as well.\n\nMomo - She's not very smart and not very strong, but she's basically the tankiest of the group. Idk how she's still alive after she took all those hits in that one episode. Her zanpakuto is pretty interesting, and she's one of the few users to use kido with the zanpakuto.",
            "Yoruichi, rangiku, nel",
            "The first 3",
            "Harribel, Yoruichi and Rangiku",
            "To protect you right ....? Right????",
            "My answer is yoruichi rangiku and the espada girl idk her name",
            "First three. Final answer. I'll feel very protected",
            "Yoruichi, Harribel and Nel",
            "Momo, Nanao, Yoruichi",
            "Yoruichi, Lisa and Harribel (this is the only correct answer imo). These 3 are definitely the strongest, right? Soi fon can be a problem ig.",
            "Yoruichi, Nel, and I'm gonna pull a wildcard here and say Candice.\n\nhttps://preview.redd.it/m6ptxt0jz28d1.png?width=362&format=pjpg&auto=webp&s=acbb4f85eac4da52d6880893a7f3cc807c50f108",
            "Oh to protect well that changes everything",
            "Yoruichi Lisa and Matsumoto are coming home with me lol\n\nedit i ended up reading your comment later but idc you already got me riled up",
            "Yoruichi, Nel, and Harribel.",
            "Yoruichi, Nell, Soifon",
            "uhhhhh lemme get uhhh\n\n\nYoruichi\n\n\nYoruichi\n\n\nand um\n\n\nYoruichi\n\nI'll probably still die by the end of the series but at least id go out happy",
            "Rangiku  yoruichi nel/nemu (couldnt deside between the two)",
            "Yourichi Shihoin 😍 🥰",
            "Ignore the text for this discussion only the title and the images matter.",
            "Yoruichi, Nell, Rangiku",
            "Nemu, yoruichi and Soi Fon can fucking get it",
            "Rangiku and nemu for me only",
            "Yoruichi, Nel, and Rangiku",
            "No Isane = Irrelevant question",
            "No Orihime???\n\nYoruichi, Nel, Nemu",
            "It's just Soi Fon x3 baybee",
            "Nelliel Tu Odelschwanck Rangiku Matsumoto, Shihoin Yoruichi.\n\nFrom front to back, three of the b***est characters in Bleach.",
            "First 3",
            "Really easy 1, 3 and 5",
            "Yoruichi Soi Fon and Rangiku",
            "Yoruichi, soifon, yoruichi again",
            "ONLY three. Brother just one of those would seal the deal for me.",
            "Yoruichi, Nemu, Nel (Harribel is stronger but Nel is more affectionate lol)",
            "Yoruichi, Harribel, Franceka (I love myself some dark skinned buff women)",
            "Yoruichi to actually do the protecting, Momo and Rangiku for vibes",
            "Momo, Yoruichi, Neliel. Rangiku gets an honorable mention",
            "I pick nel 3 times",
            "Only rangiku \n\nForget about my ass, it will be my dying wish",
            "Soi, nel, nemu, obviously !",
            "The first meaning we ALL Though about is the Real meaning.",
            "Nell, Harribel, Nemu.",
            "Yoruichi, Soi Fon, and... uh yeah, that's all I need.",
            "Yoruichi , rangiku and nel\n\nAnd I didn’t read the caption until i commented…",
            "Yoruichi for the scout and hand to hand combat specialist.\nNel for the healing capability she has.\nHarribel for that nuke and long range type damager that can also go for sword fight.",
            "Harribel, Yoruichi, and Lisa",
            "If we are talking about end of series skills I would go with Yoruichi, Nelliel and Nanao. The first two on the front lines and Nanao on the defensive/support with kido, like barriers and attacks from distance. If they were to face a \"divine\" enemy or something like that she can use her zampakutou.",
            "Nel, Tier Harribel, yoruichi chan",
            "Soi fon, Yoruchi, Nemu",
            "Unohana, matsumoto, rukia",
            "Pages 4, 5 and 9.",
            "Yachiru\nNel\nHallibel",
            "Yoruichi,soi fon and rangiku",
            "Nel nano and youruichi. Nano’s barriers def gonna help keep me alive while yourichi and nel fight the others",
            "Isn't it obvious?\nYoruichi, Rangiku, and Nemu!",
            "Yoruichi\n\nYoruichi\n\nYoruichi",
            "Protect ? I thought you were gonna say fuck 😫",
            "Yoruichi, Yoruichi and Yoruichi\n\nWhat was the question?",
            "Yoruichi,yoruichi,yoruichi ngl",
            "Rukia 3 times",
            "Harribel yoruichi momo, you know, in case i need a good shield",
            "Yoruichi, Lisa, Harribel",
            "Yoruichi for surprise attack\nRangiku for Strategy and long range\nNelliel for support Rangiku",
            "Yoruichi 3 times",
            "Harribel, Nel and Yoruichi",
            "Nemu, Nanao, Yoruichi. Nemu would lay her life down for you, Nanao got that advanced judo to protect and Yoruichi can throw hands if needed",
            "Can I just have 3 ~~mommy~~ Tier?",
            "Where is lisa? Thats soi fon i see",
            "Yoruichi, Sui-Feng, and Nel",
            "Am i supposed to know their names? These hoes is all side characters excet yuroichi and Soi Fon",
            "1, 4 , and 5",
            "Lisa, Nanao and Soi Fon",
            "Yoruichii, Nemu and Nanao probably\nseems most trustful and can handle themselves well",
            "Lisa, Nemu, and Rangiku. I would choose them for anything.",
            "Yoruichi, Harribel, and Nanao",
            "This is hard...\nYoruichi but who next?\nYoruichi..\nAnd\n...\nYoruichi.",
            "Yoru. Soifon. Nel.\n\nI can take all 3.",
            "Harribel, Yoruichi and Nemu",
            "Yoruichi, Suì-Fēng and Lisa",
            "Yoruichi, Nemu, and Nanao.\n\nDespite her good body, not a big fan of Rangiku’s personality and treatment of guys who are not Gin.  She is not obligated to like other guys if she does not want to, but her treatment of Shuuhei who pretty much respects and adores her really shows how rude she can be.",
            "hmmm,i wonder what other things could've been said (btw ichigo aizen yhwach)",
            "Tier Harribel, Soi-Fon and Nemu Kurotsuchi (maybe Yoruichi Shihouin) but this tree are my top chose",
            "Bro didn't let us pick momo for balance reasons, she would tank all the hits I'd normally take",
            "Nel Nel & nel",
            "1,2,9",
            "Yoruichi, Nel and Rangiku",
            "1, 3 and 4",
            "Neliel, Matsumoto and yoruichi",
            "In the post There's 1 Log 1 Stick and 1 Branch of a tree which you pickin",
            "Yoruichi, Nel, and halibel",
            "Nahhh, I'm not even reading the post. Mommy Yoruichi, mommy Rangiku, and mommy Halibel.",
            "Can i do one of them in turns while the other 2 protect me?",
            "5 twice and 9 for variety",
            "Yoruichi, harribel, and yoruichi again for kicks",
            "Soi Fon, Nanao and Lisa 😏",
            "Neliel, Neliel, and Neliel",
            "I only need Tsukishima. He saved me and my family and friends so many times since I was little",
            "I also pick Yoruichi, Nel, and Lisa. Yoruichi is a sexy kitty, Nel wears minimal clothing and has great oppai along with pretty hair and Lisa is very curious (I could help says her curiosity)\n\nI’m not sharing them",
            "I don't watch bleach but I'd fuck 2, 3 and 8",
            "Yoruichi Nel the ninth slide idk her name\n\n\nEdit : Ahh I didn’t read that part…",
            "🤣 same I alr picked before I read the post",
            "What do you mean by different meanings 🤔 😄",
            "OP knew what he was doing",
            "https://preview.redd.it/1bv0e5flc48d1.jpeg?width=1080&format=pjpg&auto=webp&s=853d6c0d33a586e7a306269e74f7f2ae41d86655",
            "Right there with you brother. Rangiku for life. Never betray the booba",
            "Amen",
            "Ah a fellow Starrk fan. And picked the same 3 i woulda",
            "I mean, Harribels whole shtick is sacrifice",
            "Only right answer",
            "Fax",
            "Ain’t no starrk my favorite character too and I picked the exact same ones 😭",
            "![gif](giphy|12oFq3MHMO3QL6)",
            "I really wanted to pick Nanao, but she never sold it as a protector type unless it was for Shunsui. Nemu and Yoruichi are dope choices.",
            "Plot twist: you meant Nemu the 8th",
            "She would probably not care about fighting them and leave you to die",
            "Had to scroll this far to find the real only answer.",
            "THAT'S WHAT I'M SAYING. Soi fon literally doesn't even need to fight, I just wanna make sure that nuke isn't aimed at me",
            "Two with super fast speed one with power and the other with a two-shot instant kill or nuke then very versatile water powers that is also Captain level",
            "Literally the 3 strongest in the list (there is Nel tho) and my 3 favorite so this is a win²",
            "Only correct answer.",
            "Objectively correct choices (for several reasons)",
            "based",
            "Flair checks out",
            "Totally forgot she turned into a kid.",
            "Ah, you have a strategic and interesting team selection there. Yoruichi's agility and combat prowess, Soifon's speed and precision, and Nemu's valuable scientific knowledge make for a formidable combination. With their skills and expertise, you have a solid chance of staying ahead in tough battles. Just don't forget to watch out for unexpected surprises, especially with a scientist like Mayuri Kurotsuchi around.\n\n*beep boop, I'm a bot*",
            "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^GoshinRyugia:\n\n*Momo, Yoruichi,*\n\n*Neliel. Rangiku gets an*\n\n*Honorable mention*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
            "Uh, just read the caption... Still, tho",
            "But id take the one without big t's, i feel a chest that big would only contribute to my lifes problems",
            "Just put down Yoruichi three times.",
            "![gif](giphy|uBy5vilZfzkly)",
            "Same.\nFor its Nanao, Rangiku and Tagourotonbo weilding chick",
            "I think we both know lmao 🤣",
            "Except it is not the biggest booba:)",
            "Great minds think alike.",
            "But i personaly only need yourichi",
            "Thanks lol. I'll just wish that Nanao likes me enough to protect me 😭",
            "Fuck. Imma call the FBI myself now.",
            "Are you not caught up with the anime fully? Or even like 12 episodes into tybw(iirc)?",
            "There are 2 reasons why I picked them.\n1. I really love them as a characters \n2. They're the strongest out of all of them.",
            "I like big bust",
            "I was right there with ya man lol",
            "*calls you maiden-less and leaves*",
            "A fellow person that didn't read the actual post 🍷",
            "I mean she could heal you but that would be one less person defending you technically. I would say all of the characters there should be able to one shot you so a healer is not really needed. She would only actually fight if there was a cross-dressing zaraki in there that I happened to miss.",
            "https://preview.redd.it/t28w18yxh48d1.jpeg?width=739&format=pjpg&auto=webp&s=0d2f9a7371d44110b0394b52a566b30415752daf",
            "She’s still a Kenpachi though so she would fr fight :(",
            "She would fight someone that interests her and the only one that interests her is zaraki",
            "If it's they have no control over themselves then yeah pick her but if they have their own free will she's not going to fight",
            "Yes but what if we take pre-Retsu 🗣️",
            "If it's before she meets zaraki maybe for at least the ones that are Captain class. I still think she would see them as a waste of time. Unless it was a direct order from Yamamoto or someone trying to take her title probably not"
        ]
    },
    "Official Art (Beach)": {
        "title": "Official Art (Beach)",
        "score": 835,
        "url": "https://i.redd.it/yxzejwqw018d1.png",
        "content": "",
        "num_comments": 58,
        "comments": [
            "Welcome to the Bleach Subreddit! We're as excited as you at the release of the Thousand Year Blood War anime! We understand that some of you are unable to view the anime in your region, but please don't post links to or mention piracy websites. Doing so will result in a ban. \n\nAlso, please be courteous to those who haven't read the manga and mark all spoilers. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/bleach) if you have any questions or concerns.*",
            "These are BBS Swimsuit summon outfits. The Bambies are about to get theirs next week and I honestly can't wait!",
            "RIRUKA MENTIONED RAAAH",
            "Dumb question: where is Halibel Hollow spot? (And Nel too?)",
            "Orihime my beloved",
            "Kuukaku sarong supremacy",
            "Where’s Rangiku and Mila Rose 👀",
            "cour 3 boutta have a surprise beach ep",
            "I hope he does something equivalent to the male characters, lest we be bombarded with virtue signaling over everything from the outfits, to Orihime's age, to Rukia's peach getting cut out but this being allowed etc.",
            "Honestly? Nel, Kukaku, and Harribel's are my favorites 😍",
            "Nice",
            "we need a beach episode with the Arrancar too",
            "This is just too good!",
            "Bro wtf is this",
            "Wait am i blind or what, where is neliels hollow hole?",
            "Perfection",
            "You know what? I think it’s official that Kubo either doesn’t like butts(he’s OBVIOUSLY a milk man), or doesn’t know how to draw them. All his female characters have various takes in the Hank Hill ass.",
            "Yeah, Mr White, yeah, ART!",
            "Based Apacci",
            "got a higher res ver??? need to save for my personal collection, for you know... reasons.",
            "Kukaku looking the hottest",
            "Yorichi. Goddam...",
            "For Bleach Brave Soul players almost all of these are obtainable summer variants of the chars and have been for years. Even the men (Ichigo, Chad, etc) have summer outfits, all are official since the author works alongside the art team in BBS.",
            "BRO IS THAT NEMU SHES HOT EVEN IF SHES DONT HAVE THE FACE",
            "Tier looking gorgeous as always",
            "Speaking of official, when is the new batch of episodes of Bleach coming?",
            "![gif](giphy|FjeGBljESVAzu)",
            "This really gives credence that Kubo wanted to be a fashion designer.",
            "Nel reminds me of a psych student who recently dropped an over-reliance on weed and toxic older men.",
            "https://preview.redd.it/dbw1fsxct38d1.jpeg?width=791&format=pjpg&auto=webp&s=5411feff8e5ed7e5d83b0d6ea31d8f82dd1a8225",
            "Candice and Bambi in a swimsuit\n\nhttps://preview.redd.it/tn2usw8bg48d1.jpeg?width=242&format=pjpg&auto=webp&s=ebbc7f5fd23843841a53d2aca58b5732338508c2",
            "Halibel’s is canonically her womb. Nel’s has never been revealed to my knowledge",
            "Left and right nipple respectively",
            "She's matured so much. Can't wait to see her in cours 3 and 4, particularly for the battle 👀",
            "if it doesn't feature the Bambies I wouldn't care frfr",
            "YES PLEASE \n\nI don't give a f about equality i just want the Bleach boys semi naked XD",
            "How can I make the flair appear below my username when I comment?",
            "https://preview.redd.it/4275ddhxj18d1.jpeg?width=1440&format=pjpg&auto=webp&s=6579c5040f4c1596c31ab8e1bc09b01f2efb3c9e",
            "Beauty standards and trends aren't globally uniform. BBLs are even on their way out here in the US.",
            "Halibel’s seems legit, how was is canonically stated in the manga/anime?\n\nNel’s: even in her resureccion form?",
            "So technically if someone was to hit it they’d hit the hole",
            "Bet",
            ">I don't give a f about equality\n\nLol I feel you, it's just the same stupid arguments thrown the moment female characters are sexy. Bleach's got a ton of sexy guys too anyways",
            "Which is funny because Yoruichi has a long back in that official art.",
            "I remember when this chapter came, this panel was all over the place. If it was as simple as just the panel and her kicking Askin's ass I think it would've been an excellent display of how to balance a character's sexual luster without turning it into nothing but gratuitous fanservice. But ofc it's just followed up by Urahara injecting her ass and them making a full convo centered around it 😑",
            "BBL are hideous. But a nice, natural booty?",
            "Nel’s hollow hole is in her physical heart",
            "In the databook unmasked. It gives the locations of every hole location for the current espada. Which means no nel.\n\nIt’s where we find out szayel’s hole is in the glans of his penis.\n\nGives us all the mask fragments too. Szayel’s are his glasses. You would think zommari’s would be the spikes on his head but they have nothing to do with it. It’s his skull earrings.",
            "Yep, also not only with Bleach with media in general... Idk about more people but i prefer having both Male and Female characters sexualized than just banning it lol",
            "In my near 40 years, I've come to the conclusion that most of my fellow men don't really know what \"natrual\" is. Does she have a naturally shapely butt, or is it just the yoga pants? Does she have a naturally perky chest, or is it the push-up bra? Does she have natural beauty without makeup, or is she just not wearing eyeliner? \n\nMy ex wore a lot of makeup, and honestly, it was kind of annoying. Any time we kissed, it always ended up all over my face. Trying to get dark lipstick out of a blonde beard is pretty difficult. Hell, I've hit it when she was just wearing the bonnet and a t-shirt.",
            "“In” her heart literally? Or more like ichigo vasto lorde form?",
            "I’m 37, and I know what natural means. Yoga pants can only do so much, and an effect more similar to sports bras in that they support via compression and lift. Push up bras, and excessive makeup are both lies, but still preferable to bodies being shot full of silicone.",
            "Yup literally in her heart",
            "Not all cosmetic surgery results in abnormally sized breasts and buttocks.",
            "It doesn’t make sense, does it? The hollow spot is their lack of heart, this is why they are “hollow” (which becomes their mask afterward). Nel having her hollow spot in her actual heart is like she’s hollow of heart in her heart… (maybe I misunderstood something) that’s a weird creation choice …",
            "Hollow holes aren't always their heart. It is the sport where their soul anchor was located when they were a simple soul. It was the thing that emotionaly tied them to the mortal world. The thing they could not let go of. And when the chain was ripped or disintegrated it left a hole where it was attached",
            "In Japanese the 2 meanings of heart are 2 different words. Kokoro and shinzou. Shinzou is the heart organ that keeps you alive. I’ve seen kokoro be translated as mind or head in some iffy translations. Because it doesn’t mean your beating heart. It’s your heart as in like your soul or will that’s what hollows lose. Most of them probably still have a physical beating heart.\n\nSo nel’s organ heart could be her source of loss of her “kokoro” heart. There would be no confusion in Japanese because hollows lose their kokoro and nel has her hole in her shinzou."
        ]
    },
    "Which side would win in a verbal fight?": {
        "title": "Which side would win in a verbal fight?",
        "score": 68,
        "url": "https://i.redd.it/croumknvb48d1.jpeg",
        "content": "No special hax or abilities just straight up smack talk, which side would make the other bend first? ",
        "num_comments": 15,
        "comments": [
            "Welcome to the Bleach Subreddit! We're as excited as you at the release of the Thousand Year Blood War anime! We understand that some of you are unable to view the anime in your region, but please don't post links to or mention piracy websites. Doing so will result in a ban. \n\nAlso, please be courteous to those who haven't read the manga and mark all spoilers. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/bleach) if you have any questions or concerns.*",
            "Liltotto solos",
            "The audience, would be one entertaining scene that’s for sure, might need to make myself a extra large set of popcorn LOL",
            "Bambies can just put Liltotto in front and the rest can just chill at the back",
            "The arracnar would just sit and argue with each other the entire time lol",
            "Do Tres Bestias smell out Giselle?",
            "Halibel's team would win.",
            "Even if it were a straight up fight,  without meninas, Ayon would be a terror.  He’d give one good hit or two before getting one-shot by meninas. I heard that girl has the physical strength of Kenpachi Zaraki.",
            "Bruh it gonna be just Candice and bambietta (some words from liltotto and giselle) vs Emilou and Franceska the other just dont care as much if they win or lose",
            "she solo's both side",
            "Perfect answer. She's quite literally the best-equipped for this.",
            "Idk about that, they are very protective of each other though when it comes down to it, it’s kinda like a “hey only I can bully my sibling” sorta thing so I think if one of them got insulted the others would jump in immediately",
            "So would the bambis",
            "Anything goes , so potentially yes",
            "Yea honestly the Arrancar would just argue, given the chance I'm not entirely unconvinced half the bambies wouldn't actually straight up murder eachother."
        ]
    }
}