{
    "June Contest: Hands": {
        "title": "June Contest: Hands",
        "score": 29,
        "url": "https://www.reddit.com/r/blender/comments/1d6ss56/june_contest_hands/",
        "content": "Congratulations to /u/thedarkendkb for winning last month's contest. You can see its results [here](https://www.reddit.com/r/blender/comments/1ci4ngw/may_contest_flight/).\n\n## Theme\nThis month's contest will be hands. You may think about the dexterous and deft movements of an artisan, the use of sign language as an alternative means of communication, or the imprints that our ancestors left on cave walls. Think about what special meaning they may hold or what special purposes they may serve.\n\n## Making a Submission\nArtworks will be submitted as posts to the Blender subreddit that meet the following criteria:  \n\n* The post should be made before the start of June 30th UTC. \n  * [Countdown to submissions closing](https://www.timeanddate.com/countdown/generic?iso=20240630T00&p0=211&msg=Contest+Ends&font=sanserif&csz=1)  \n* The post's title should begin with `[June 2024 Contest]` to indicate participation \n* The post should be an render, animation, or other artwork which was made primarily using Blender  \n* The post should contain a top-level comment with the following content:  \n  * One of the following methods of proving that the artwork was made using Blender:  \n\t* A link to the `.blend` file for the project, ideally including external assets or links to where the external assets were sourced from.  \n\t* A screenshot of the project open within Blender and showing the scene's wireframe. Additionally, there should be two more supporting images. These can be clay renders, viewport renders, or wireframe renders. For the sake of keeping things interesting, these are encouraged to show different angles.  \n    * A screen recording of you manipulating, exploring, or otherwise interacting with the scene  \n  * An explanation of of all work that was done outside of Blender, outside the time frame of the contest, or by other artists. For example, if you used Nuke for compositing, reused an asset you've previously made, or used assets made by others, then make sure you mention these things.  \n  * (Optional) The theme you would like next month's contest to have if you win. If you do not include this, then the theme will be chosen from the runner ups.  \n* You are also encouraged to share details of your process with the community.  \n* Entries that don't meet all the requirements or that do not adhere to the theme will be excluded from consideration.\n\n## Winning\nThis month, we're going to change the winning criteria. I will be attempting to assemble a panel of ~3 judges consisting of members of this community. Judges will be instructed to consider submissions based their artistic merits, displayed technical skill, interpretation of the prompt, and other such things. The exact method by which the judging will be done is still to be decided. If you'd like to be a judge, please message with me. I'd like the judges to be people who participate in this community, who have a firm technical and artistic skill set, and who, of course, use Blender.\n\nThe winner will receive the flair `Contest Winner: June 2024` and their post will be added to the subreddit's wiki under the Contest Winners list. The winner will also be able to select the theme for the next contest should they choose to do so.\n\nWhen the contest ends, the results will be edited into this post so that people can see all entries in one place, and the 1st place winner will be congratulated in the announcement for next month's contest.\n\n**The winner will be awarded an Amazon e-gift card worth $100 USD. You will need to provide an email and the country in which you intend to redeem the card to claim the prize.**\n",
        "num_comments": 12,
        "comments": [
            "A cash prize? Now you've got my attention.",
            "you made an error ''The winner will be awarded **am** Amazon e-gift card worth $100 USD. You will need to provide an email and the country in which you intend to redeem the card to claim the prize.'' last time i checked its an not am no problemo btw",
            "So...question. How horrific can we get? Like, raw met or creepy imagery; off the table or...?",
            "Is it too early to submit it on 25th ?\n\nI have to go on a vacation on 26th in the morning... 😊",
            "And you missed 3 capitol letters and 2 punctuations.",
            "Your artwork. Your call.",
            "This time, you're free to submit throughout the month. Previously, the waiting period was an attempt to cut down on the fact that earlier submissions would have a substantially longer time to accrue upvotes, but since we won't be judging based off that this time, it's no longer relevant.",
            "are capitol letters in any way related to the US capitol building?",
            "Ah, good! Just making sure!\n\nAlso, the Pandora's box you've just opened....",
            "Awesome 😊",
            "You're more than welcome to test me.",
            "Ah, tastefully so, of course. :P"
        ]
    },
    "I made a drink in Blender": {
        "title": "I made a drink in Blender",
        "score": 4513,
        "url": "https://i.redd.it/6rzn8ajbfx7d1.jpeg",
        "content": "",
        "num_comments": 160,
        "comments": [
            "plot twist, he made a camera in blender, 3D printed it and used it to take this image (/j)",
            "For photorealistic renders, this sub requires you to have a second slide of the untextured model or viewport display.\n\nThis render is really damn good, which means you'll have to prove it's fake.",
            "\"Made a drink in Blender\"\n\nWell yeah, either that or a cocktail shaker would work.",
            "Blender artists never cease to amaze me.",
            "At first i thought the lemon on glass looks odd but after searching for reference images they look exactly like that. Amazing",
            "I thought this was real and you had used an actual blender and posted in the wrong sub\n\nAmazing job",
            "Genuinely thought this was real for a second",
            "Naahhh there is no way this is not real💀",
            "Awesome work! \nThis is nitpicking but the lime wedge on the glass is a tiny bit off. I think it’s because the fruit “fibers” extends from the center of the fruit and the glass intersect through them diagonally, like it’s too angled. \n\nAgain, I’m really nitpicking here. Looks great! 👌",
            "just wow, looks real asf",
            "The drink doesn’t look blended.",
            "these render times must be days long 😮",
            "Wow",
            "You ain't tricking me, this is a picture",
            "I thought you made a joke and posted an actual photo. Great work",
            "Wrong sub sir, this is a sub for - omg what a beautiful render.",
            "I think what OP means is he made the drinks in a blender, this is WAY too realistic! The camera focus, the worn wooden board, the faint refraction from the glasses (HOW), and the perfect amount of subserf and materials on EVERYTHING!\n\nEven the rosemary looks like it is pressed on the glass. WHAT\n\n\nI’m absolutely blown away. Amazing job OP.",
            "Bravo!",
            "I am incredibly jealous. Absolutely stunning work man! Just dropped you a follow on Instagram! \n\nI like how you edited your reel with the overlay of the nodes as you're working. How do you edit that in?",
            "This made me very confused for a moment because I follow r/mocktails. Good job!",
            "Okay this is fantastic",
            "I'm genuinely in awe. Even on close inspection, it looks authentic.\n\nAnd delicious.",
            "Amazing work, genuinely thought it was fake.\n\nWhere do you get your models from?",
            "I'm subbed to so many different cooking subs that I honestly didn't realize this was blender at first lol",
            "Just amazing. I was watching some of your WIP videos...what kind of computer do you have?? Just curious, I know the video was sped up by it still looked like you were flying.",
            "That's actually on the rocks, not blended 🙂",
            "this is gorgeous!",
            "made a drink using a blender\\*",
            "That's clearly \"on the rocks\" and not \"blended.\"",
            "Holy fuck I thought this was supposed to be a shitpost as in \"I made this drink in A blender\" but no you actually rendered that in blender 10/10",
            "Amazing it looks impossible",
            "People shouldn't be worried about AI, they should be worried about YOU!",
            "bro i was gonna scroll past this thinking it was a photo, nice work.",
            "Had to double check the sub lol",
            "now I'm thirsty",
            "i call rule 3",
            "How even\n\nI wanna drink that",
            "Uau! Your other work is excellent too💫 bravo! 🙌 p.s.: show us your donut 🍩",
            "lots of details here that most people miss. the ratty edges on the cutting board are the chef's kiss, in my opinion.",
            "That's just a photo at an expensive bar... or is it?",
            "this is the Blender",
            "THE DRINK IS ON ICE NOT BLENDED, FAIL",
            "That looks tasty. What's the ingredients",
            "That is actually incredible.",
            "This is impressive. Really. \nWhen I saw the wet patch under the lime I was sure it was a photo. Like, no one would think to model that - then I saw the timelapse…\n\nI lift my hat to you.",
            "Sometimes I wonder why God let's bad things happen to good people, then I see this and realize it's because he is posting his renders to Reddit.",
            "Isn’t this just a whole bunch of poliigon assets and some particles? Pretty sure this is promotional content for the poliigon addon that’s been around for a year or more????",
            "Bro took a high quality picture and thought we wouldn’t notice",
            "It was blended right?",
            "We call those smoothies usually",
            "I thought it would be a blender drink, like a Daiquiri.",
            "Very nice (☹️😥😢😭😭😭😭😭)",
            "Will there be a tutorial on how to do this?!",
            "I’d drink that 10/10\n\nAlso, this title would be also valid in a cooking subreddit.",
            "How did you do that wood! The rings are an awesome detail...\n\n\nEdit:\nOooo it's polygon! That explains a lot!",
            "crazy cuz i found this with reverse image search, goes back to 2023 (website i found it on: [CGI Foods and Drinks :: Behance](https://www.behance.net/gallery/187898537/CGI-Foods-and-Drinks) )\n\nhttps://preview.redd.it/uesl1k11g28d1.png?width=497&format=png&auto=webp&s=d811e9c0e38cd65d15dfa87a9bf0619fa0e4f9e2",
            "Given that you posted basically nothing related to 3D in the last 4+ years (didn't check further), only photographs of cats, plants and food: consider always posting at least a screenshot of your wireframe scene.",
            "Your top advice to make a render realistic?",
            "Yes please",
            "Hey OP, I incidentally need some cocktail glass fbx models with textures for my unreal project. Would you be up to take up a job? DM me to discuss.",
            "This is so good! Crazy you can just import models like that to create a scene! I thought you’d hand modelled it all! Lovely use of geo nodes though",
            "Good job. Is making me thirsty",
            "How....?",
            "Spoiler it's a real foto",
            "How is this not a real photo",
            "You should make a blender blending in blender.",
            "did you use this [Addon](https://www.blenderkit.com/r/fzs111) ?",
            "So is this a blended drink?",
            "So you thought you could just take a picture of a real drink and think we wouldn't notice?\n\n(Fantastic Render)",
            "dude wtf????? thats perfect",
            "Hey nice reference photo, now where's the render?",
            "Did you mean with a blender?",
            "in blender or in A blender?",
            "Constructive crit, the only thing that pulled at me as unrealistic is how flat the foreground of the wood plank seems - maybe some subtle sub surface scatter to emulate a polyurethane finish depth to better match the top surface.\n\nOtherwise mind blowing, I wonder if there's any grapefruit at the supermarket... kudos!",
            "But did you make the drink in a blender in blender?",
            "No , you cooked",
            "That’s what Blender is for 🍹😎",
            "For a second I was like… “that’s not blended” 🤣😂",
            "I could do that with Ai",
            "If I didn't notice the bokeh noise, I'd have said that it's a photograph 😂 nice job bruh",
            "Disappointing, didn't see the title or subreddit on my feed and was interested in the recipe.",
            "I'm trying to find any visual cues that would show that it's a 3d render - polygons, stretched textures, anything...... ***I can't......***",
            "Well thanks, now I want one :(\nSeriously, great art though. This looks amazing!",
            "Amazing render, I love it ! I reminds me a bit of Haruko Hayakawak's work",
            "Cant stop looking at this 👀",
            "…okayi got the fact that its real BUT HOLY SHIT. I CANT FUVKING BELIEVE THIS.",
            "Looks good enough to drink! What cocktail is that?",
            "Blender? The drinks look more shaken than stirred.",
            "Wow wow wow wow wow.... Wow",
            "Wooooooo",
            "Thats awesome how did you do it any tips or problems you ran into",
            "I thought I was in r/cocktails",
            "Looks epic!",
            "so stunning. I really love the details!",
            "Looks gorgeous, reminds me of old late 60s - early 70s, dinner party cook books.\nThe styling is great.",
            "[deleted]",
            "[deleted]",
            "Sorry Bro but im 100% Sure i saw this in Instagram months ago. Thats Not by you",
            "That's way too much effort for my lazy ass.",
            "Plot twist: he just blended some fruit in a blender",
            "Thank you! Guess I can't add it anymore but I have the link to the timelapse: [https://www.instagram.com/reel/CrdGZNLAOIu/?utm\\_source=ig\\_web\\_button\\_share\\_sheet&igsh=MzRlODBiNWFlZA==](https://www.instagram.com/reel/CrdGZNLAOIu/?utm_source=ig_web_button_share_sheet&igsh=MzRlODBiNWFlZA==)",
            "Right?!?  I came to the comments looking for the recipe not realizing the sub",
            "Prove it's not fake*.",
            "Happy to hear that!",
            "Thank you! I had to improvise a bit with the wedge on the glass. Slices aren't that realistic and there are surprisingly few good citrus models online, really glad it turned out realistic here.",
            "Thank you, I was really hoping for that!",
            "Thanks, but there is a way: [https://www.instagram.com/reel/CrdGZNLAOIu/?utm\\_source=ig\\_web\\_button\\_share\\_sheet&igsh=MzRlODBiNWFlZA==](https://www.instagram.com/reel/CrdGZNLAOIu/?utm_source=ig_web_button_share_sheet&igsh=MzRlODBiNWFlZA==)",
            "This is the only thing that tipped me off. The flesh of the lime looks unusual",
            "OP is working with almost real-time cycles in the Viewport, I doubt this took over an hour, depending on the resolution",
            "Thanks, it is a picture indeed. A CG generated one!",
            "Thank you so much! When recording I used a custom blender theme so the nodes are on a green background. Then I just use chroma keying and overlay the nodes in post.",
            "Mostly Poliigon. Rosemary is from Megascans.",
            "Thank you! I have a 4090 which helps a lot. Also, I don't need heating in my office during winter.",
            "Thank you! I never made one actually. I started out in blender before the donut series.",
            "Sometimes I feel like I'm going into details that are too small to be noticed. Thank you for reminding me who I did this for!",
            "Probably the same guy, the creator of the image in this link has the same Instagram being posted in the comment section by OP.",
            "Sure buddy: [https://www.instagram.com/reel/CrdGZNLAOIu/?utm\\_source=ig\\_web\\_button\\_share\\_sheet&igsh=MzRlODBiNWFlZA==](https://www.instagram.com/reel/CrdGZNLAOIu/?utm_source=ig_web_button_share_sheet&igsh=MzRlODBiNWFlZA==)\n\nEdit. I'm flattered though.",
            "nah, it's clearly cg, and it's clearly cycles - ice cubes underwater don't refract like that, that's a known limitation of cycles in particular. whether OP made it themselves is a different matter, but they're not charging money from me, so I don't actually care",
            "Forget you're making a render. Treat it like a photo and it will look like it. Also, reference.",
            "You can download them from polligon ig. Since OP seems to be working for them, or at least using their assets from the polligon addon for blender.",
            "I did not. Just Poliigon for Blender addon.",
            "That'd make it a smoothie.",
            "Actually found something! The droplets on the glass look a bit weird, they're too randomly shaped as opposed to how IRL droplets usually look, which is rounder. Also, some of the leaves on the branches clip a bit into the stem.",
            "Thank you!",
            "Thanks, here's the making of: [https://www.instagram.com/reel/CrdGZNLAOIu/?utm\\_source=ig\\_web\\_button\\_share\\_sheet&igsh=MzRlODBiNWFlZA==](https://www.instagram.com/reel/CrdGZNLAOIu/?utm_source=ig_web_button_share_sheet&igsh=MzRlODBiNWFlZA==)",
            "You look like the Pringles man",
            "Lazy, my ass!",
            "Which was modeled in blender",
            "i see the timelapse....i see its not real...but my brain still is telling me that somehow its still real...",
            "NASA computer that it runs viewport render realtime like that",
            "That was extremely entertaining, thank you! Great work!",
            "hats off to you. this looks so realistic i was starting to doubt you til i saw the time lapse video",
            "What can I do if Instagram has been blocked in my country? I'm too lazy to use VPN",
            "Good god... Have my upvote",
            "Get the f... out! 😲 I was like \"Yea, sure, get lost with posting real pictures as renders\", so yea, this is amazing! Great job.",
            "i think when they say prove it’s fake they mean prove its a render and not a real image",
            "I was gonna mention that I swear I’ve seen this post somewhere before made by some guy who makes A LOT of blender drinks…I thought you stole it \n\nnow I realize ur the guy who makes the blender drinks haha",
            "Don't believe you. Must have photoshopped the process.\n\n~~But for real, great job!~~",
            "was kind of the first step. Thanks for the link. Definitely impressive use of scanned assets libraries, then. This objectively beautiful image is one of, if not the most impressive \"realistic\" render I've seen since I subscribed to this subreddit.",
            "Where did you get the models from?",
            "Yeah, it's really tricky to get glass and other refractive materials look realistic in Cycles. Corona does a much better job IMO, but I hate Max so I'll just accept the limitations.",
            "Congrats on being one of the few to use “clearly” in a comments section completely full of people who think it’s amazing and hyper realistic.",
            "> and it's clearly cycles\n\nwhat does \"cycles\" mean in this case? coming from r/all",
            "Sorry, probs to you. Peace",
            "LMAOOO",
            "they are the same",
            "Same. Watching him split the glass into two glasses made my brain cry because it knows it's not real but is still receiving visual cues that it is.",
            "Just look at the water on the spoon. That might fix it.",
            "You’re not missing out on much.",
            "I understand , but it's written in a confusing way. A quick edit would make it easier to understand.",
            "They faked the faking!",
            "In this case, Poliigon.",
            "the limiation is nesting rafractive materials, specifically, like ice inside liquid inside glass. the math of refraction by itself is easy and the same everywhere..",
            "I'm not sure if this is a diss, but seeing is a skill that can be trained.",
            "'Cycles' is the name of the path-tracing renderer included with Blender.",
            "Indeed",
            "that water droplet on the spoon would quench me in the desert",
            "🤣",
            "Everyone in the comments is saying \"Wow! I thought this was real!\" not \"Wow! I thought this was fake!\". Your suggested edit would confuse me more.",
            "Yeeaaaaaahhhhhh",
            "thanks!"
        ]
    },
    "monster animation. How do you like the result?": {
        "title": "monster animation. How do you like the result?",
        "score": 151,
        "url": "https://youtu.be/CJ20NYAwwOw",
        "content": "",
        "num_comments": 3,
        "comments": [
            "lol gotta hand it to ya.",
            "That's great!\n\nOne thins I noticed - the average doorway in the US is 80 inches or six feet, eight inches tall. The dude running therefore is really tall....6 foot 6 inches?\n\nIf that's what you were going for, cool, but it just surprised me how close I was to skimming the doorway!\n\nThe animation is fantastic, and there's plenty of kreepy atmospheric lighting and the monsters are cool!\n\nI love the explorers eye view too!",
            "Oh my gosh you had me the whole way, I was wrapped up in it trying to escape myself! It was really awesome you made this! I want to be able to make something like this one day too.\nI felt the running was a lil awkward but it still sold me."
        ]
    },
    "I created some hand painted foliage! 🌿🌷": {
        "title": "I created some hand painted foliage! 🌿🌷",
        "score": 98,
        "url": "https://www.reddit.com/gallery/1dlqd8t",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Nice",
            "Bro this looks exactly like btd6 foliage!\n\nAnd that's a good thing",
            "Very pretty, I like it!",
            "Very beautiful. Looks like the nature in a painting straight out of my grandma's art gallery",
            "Very nice"
        ]
    },
    "Latest wip of my pay phone!": {
        "title": "Latest wip of my pay phone!",
        "score": 35,
        "url": "https://i.redd.it/envu26uvz38d1.jpeg",
        "content": "A few weeks ago I posted my work-in-progress pay phone, so I thought I’d share an update. Am starting to get to grips more with Substance now but still at a surface level I think. Started learning 3D from scratch last year and Substance a few months ago. The whole thing was modelled in Blender 😊",
        "num_comments": 6,
        "comments": [
            "Looks great!",
            "Really great work",
            "truly love seeing 3d works with graffiti in it",
            "nice work 🤙",
            "Thanks 😊",
            "It’s definitely one of the most fun parts! Was trying not to do overdo it and keep it in the right places which I find tricky, but think it came out ok in the end. Also fun adding masks to make it all look weathered"
        ]
    }
}