{
    "Clean up & Clarification of the Sub Rules": {
        "title": "Clean up & Clarification of the Sub Rules",
        "score": 84,
        "url": "https://www.reddit.com/r/BoomersBeingFools/comments/1d4v4ir/clean_up_clarification_of_the_sub_rules/",
        "content": "1. Memes, comics, strawmen, etc are not encouraged. That seems pretty obvious to me.\n2. Content MUST display boomers or elderly being foolish in some way. Not links to others making fun of the boomers, but the actual boomers.\n3. Boomers and elderly only.\n4. Social media posts must be about boomers, or from boomers.\n5. Direct links to content only (Ex. Imgur, Reddit, Gyfcat)\n6. BE CIVIL – This includes no telling someone to die, no calling people a bitch, cunt, etc.\n7. No homophobia, transphobia, bigotry, etc will be tolerated. Period. That will result in an automatic temp ban. Continued behavior will result in a permaban. The exception to this is if the boomer is behaving in such a way.\n8. No trolling – whether as a post or as a comment. Doing so on a regular basis will result in a permaban. No exceptions.\n9. No reposts under 3 months.\n10. No \"I'm a boomer\" posts. Likewise no \"we're not all like that!\" Posts",
        "num_comments": 64,
        "comments": [
            "Remember to report submissions that violate the rules! Harassment and encouraging violence are not allowed.\n\nEnjoying the subreddit? Consider joining our discord server: https://discord.gg/v8z8jNwJs6\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BoomersBeingFools) if you have any questions or concerns.*",
            ">No \"I'm a boomer\" posts. Likewise no \"we're not all like that!\" Posts.\n\nTHANK YOU MODS!\n\nSo tired of all those posts and the trolls pretending to be one.",
            "Any way to get rid of that guy who keeps posting off-topic, racist and homophobic word salad about social issues in Scotland?",
            "Unrelated to the rule change (thank you btw) but flair question - my absolute favorite content here i seek out is when boomers do boomer things and then get embarrassed/called out/put in their place in the story. As a former retail employee it is so rewarding to read those. \n\nAssuming I’m not the only one who enjoys specifically that content - is there possibility to add that type of story as one of the flair options?\n\nCouldnt tell where the right place would be to ask this - if this isnt it please delete and sorry in advance",
            "Is it worth clarifying what constitutes \"Boomers and elderly\"?  \n\nI've seen arguments about \"this person is too young to be a Boomer\" or \"they're Greatest Generation not a Boomer\".  The latter would seem to be covered by the \"elderly\" portion, but I've also seen a lot of comments that \"Boomer is more about attitude than actual generation\" and I'm inclined to agree, particularly when generation start/end dates are somewhat arbitrarily determined by the actual personality characteristics most commonly shared by members of the generation.\n\nSomething along the lines of \"boomers are anyone who looks like they may be in their late 50's or older\", or even just \"anyone exhibiting foolish behavior commonly associated with members of the Baby Boomer generation, regardless of their actual age\" might cut down on some of the sidebar arguments.",
            "I was under the impression for a long time now that this sub was for the \"Boomer mindset\" and quite a few posts come to mind expounding on that.  Similar to being a Karen, you don't necessarily have to literally be from the boomer generation to be a Boomer.  Attacking the mindset is funny, attacking the age group is...well... ageist.",
            "So and I mean this as purely a question \nTrolling at Some of the actions of boomers is the only possible comment. Like a normal response can come off as trolling if that makes sense. \nWhat’s the defining factor in your mind?\nJust seems like a super grey area that could be used to tear the sub apart with reporting and I’m trying to help.",
            "Really wish people read and followed rule 6 more. I just deleted my post because of the amount of people treating to kill, rape, assault, and stalk me in my DMs. Might want to watch a bit closer in the comments in the future....",
            "Thanks for number 8",
            "I feel there should be an exception for Rule 7 if the post is about a boomer being homophobic/transphobic/a bigot.",
            "such a stoopid offensive sub",
            "Hey now.  Rule #10 takes all the fun out of it!  Now get offa my lawn!  (It's fecking hell to get old... just remember that, you whippersnappers...)",
            " Bigotry - belief, opinion, or faction, in particular prejudice against a person or people on the basis of their membership of a particular group.\n\nThe rules encourage bigotry toward Boomers or old people.\n\nYou realize the whole sub is bigotry, right?  \n\nYou might as well be honest and have the rules say “nothing  negative about protected classes (except the elderly) will be tolerated.”\n\nRule 7 says “no bigotry”. ?\n\nAt least have a disclaimer saying that we realize that we are just as shallow and judgmental as racists and homophobes.",
            "Remember to report submissions that violate the rules! Harassment and encouraging violence are not allowed.\n\nEnjoying the subreddit? Consider joining our discord server: https://discord.gg/v8z8jNwJs6\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BoomersBeingFools) if you have any questions or concerns.*",
            "Hoggg",
            "Can we have an option to filter text posts? I'm inherently suspicious of them on Reddit and would rather not have to go through entire pages of them just to find the handful of videos",
            "Can we do something about the rampant insults/strawmen against them? I’m all for criticizing bad behavior, but so many people borderline dehumanize them and go too far. \n\nExample: acknowledging lead poisoning is totally fine. Calling them “lead-addled” or “lead head” is over the line imo. Especially when that’s clearly not the cause of a particular situation, it’s like some people just throw that in there to insult.",
            "So you finally decided on some actual rules. Until now your rules looked like, \"We better come up with something that looks like rules.\"",
            "The person posting all the content across every platform with a mouth like a sewer and an obvious love of male anatomy should not be the bias moderator of each individual platform, especially when hes the biggest hacker on earth operating directly thru Google and Samsung Blair r000t 🙂 ",
            "I think there’s a line here. The sub should not support ageist generalizations, and it should be allowed and encouraged to call it out when it happens.",
            "I am heading there right now. Thanks for the head's up!",
            "I like that idea. Something along the lines of \"Read The Riot Act\" \"Reprimand\"  or \"Called Out.\"\n\nu/raynedanser would you consider any additions to the available flairs for posts?",
            "It's a good idea. After work, I'll work on the wording. Thanks for the suggestion!",
            "🙄 I'm enforcing the rules that were there, clearing up some others. If we open to all ages, then it's a free for all and people here can be assholes enough already. Not enough mods in the world foolish enough to take on the hatred and abuse we get in mod mail when the rules are enforced. \n\nYou can always create your own sub, I suppose. 🤷‍♀️",
            "No worries! I mean, some are really, really obvious and there's a handful of repeat offenders where that's literally all their comments are (or the handful of unhinged word salad posts we've had recently).  As much as I hate to say it, the ones that are in the more gray area are mod discretion, but I'm going to try to give people the benefit of the doubt.",
            "We're doing our best! Report those comments, they can earn a ban! Same with if they're dm-ing you. Please! We need these things reported to do something.",
            "Totally welcome!",
            "That's valid. It's more the comments themselves or rants cannot be phobic.",
            "I'm yet to see a better explanation for their behaviour. \n\n\nFox news probably contributes, sure, but you actually do need some form of cognitive impedence to be unable to separate that trash from reality. Lead is a perfect explanation.",
            "Don't blame me. I'm just stepping into the role and trying to regain a bit of order around here. New sheriff in town!",
            "This sub exists to have bigotry against people who are older. It's kind of sad to see, as a millennial who lives in an asian country.",
            "Speaking of the sidebar, can you please add any content whatsoever to the Old Reddit sidebar? Even just a link to /about/rules?",
            "wow, really appreciate the way you accepted the concern I expressed.  So glad you're not being defensive and an ass or anything.",
            "I was under the impression that boomer is a mindset, and that mindset is much more common for older ages. If we're restricted to ONLY Baby Boomers as defined as when the generation was born, then put that in the rules, the current rules are arbitrary concerning the definition of a boomer. Targeting a negative mindset is one thing, however, targeting a generation is harrassment. It sounds to me like you're enforcing ageism, and I would like it clarified in the rules so that we can be clear this sub isn't pushing for something that goes against reddit ToS/rules.",
            "Fair enough lol, just be warned if you see my name in a report,\nI’m very sarcastic but honest in replies and it may come off as trolling when all I’m doing is rage bating the intellectually challenged and willfully ignorant and they tend to get butthurt a lot lmao. Happy hunting kind mod happy hunting 💗",
            "I reported as many as I could but when I started getting dms every 30 seconds to a minute threatening my safety I blocked and reported then to reddit. Figured it was safer to delete the post and block as much access to my profile as possible. Thank yall for being the best moderators yall can be. I can only imagine the amount of reports you get a day.",
            "You’ve missed my point entirely.",
            "This could be the most ironic and hilarious comment I have ever seen 😂😂😂😂💀",
            "or just decades of entitlement. The lead thing is an excuse. You might as well say the rise in the amount of aluminium used is also causing brain damage.",
            "Baby food and tons of other things still have lead in them today.",
            "Theoretically it exists to call out individuals acting like fools, which is not bigotry. \n\nBut then the comments are 95% bigotry, and if you call it out the bigots get feelings.\n\nMost of the bigots here don’t realize they’re as bad as any Klan member. The rest don’t care.",
            "I wish I could! I can't add anything to the new Reddit sidebar (annoying!), but will try tonight with the old one. I'm not quite awake/caffeinated enough yet this morning.",
            "Sounds like a plan.  I can be a bit like that myself so I suspect you'll be fine.",
            "Can you please send me the user names for those dming you? Not ok either.",
            "Damn I don’t think it was even possible to mis the point any harder then they did 😂",
            "I mean yeah there is a lot of entitlement involved.... but lead actually does cause significant brain damage, and was very unregulated in the 50's",
            "> as bad as any Klan member\n\nJesus. 😬",
            "No worries, take your time. If you're new to Old Reddit, try https://old.reddit.com/r/BoomersBeingFools/about/edit/",
            "Not a problem. I'm DM you the ones that Reddit themselves haven't deleted yet.",
            "So does childhood abuse of any form. It leads to underdeveloped prefrontal cortexes, which influences the reasoning process.",
            "I don’t think he was a Klan member. Or an ageist.",
            "Please do. I just saw all the reported comments and those were absolutely inexcusable and I'm sorry people were such assholes to you.",
            "Not even funny. Anyway, your claim is insane.",
            "I live in a very red section of my state and the older generations have been let to run wild. I don't even eat out in public with my MIL and FIL because of how often they make offhanded exist, racist, misogynistic comments. We had a nurse at the last hospital he was admitted into stop taking care of him because of them. Sadly I have been living in their asshole world for 5 months.",
            "Wasn’t meant to be funny. Keep protecting bigotry. Noble work",
            "Instead of being this dramatic, why don’t you just share here those comments that you swear are just as bad as the KKK and settle this? The burden of proof lies on you, especially with how eager you are to call people hyper-racist bigots.",
            "I didn’t call anyone hyper-racist. Why lie? I said they were *as bad as* Klan members. And they are. \n\nI don’t owe you any burden of proof. First, I don’t work for you. Second, bigots rarely admit that they’re bigots.\n\nBut here’s a little guide for you:\n\nWhen someone posts something about an individual doing something stupid, that’s fine. That’s not ageism. \n\nBut then… on every thread here… the conversation changes to one about how the story illustrates how Boomers in general are awful. That’s ageist, and is no different morally than generalizing about black people. \n\nAnd often, the threads go further and say that they can’t wait for Boomers to die. That’s hate speech. I’ve reported a ton of those. Most are not here anymore, but since this is a mod thread I’d invite them to tell you if I’m lying."
        ]
    },
    "Had to keep my mom throttling a boomer woman.": {
        "title": "Had to keep my mom throttling a boomer woman.",
        "score": 4347,
        "url": "https://www.reddit.com/r/BoomersBeingFools/comments/1dlhegb/had_to_keep_my_mom_throttling_a_boomer_woman/",
        "content": "This happened yesterday when I was visiting my mom. For some background I (27F) and my mom (62F), who is a Boomer herself, have a weekly visit that sometimes results in us going somewhere either to eat or just to walk around. Recently these visits usually involve grabbing something for my daughter (6 months) from one store or another since I am a stay-at-home mom. I unfortunately had a testosterone issue growing up resulting in me looking rather androgynous and very tall with a somewhat deep voice for a woman, this causes a lot of people to assume I'm a guy at first.\n\n\n\n\nWe were out grabbing nursery water and baby clothes for my daughter at a large box store when another boomer woman walked up to my mom, looked between my mom and I, looked at my daughter, and asked \"Is Daddy babysitting today?\" \n\nI normally ignore when people assume I'm a guy cause I am very used to it due to how I look, but this pissed me off. Apparently it pissed my mom off more because she handed my daughter back to me and started to take off her rings saying, \"My DAUGHTER is caring for my granddaughter, SHE does not babysit unlike your useless sack of shit husband.\"\n\nThat led to me holding my tiny mom back from kicking the shit out of another Boomer woman while trying not to laugh. Gods do I love my mom.",
        "num_comments": 221,
        "comments": [
            "Remember to report submissions that violate the rules! Harassment and encouraging violence are not allowed.\n\nEnjoying the subreddit? Consider joining our discord server: https://discord.gg/v8z8jNwJs6\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BoomersBeingFools) if you have any questions or concerns.*",
            "She started to take off her rings?? Damn, grandma was serious!",
            "And my personal \"peeve\" is saying a father is babysitting. No, a father parents too. This woman was insufferable on many levels.",
            "My mom was confused because fedex was late delivering her package. She was furious at usps and wanted to drive down there and yell at someone. I explained several times that the United States postal service has nothing to do with fedex. That it was similar to going to Burger King to complain about the food she got at McDonald’s. She just wouldn’t believe me so she decided to go to the post office to yell at them about her “lost” package. I had to beg her as she was walking out the door to please remember jesus instead of yelling at someone who has nothing to do with her problem. She drove there and then felt guilty that she was so mad, prayed, and never went inside. She was that close to yelling at a random stranger for her problem to make herself feel better.      \nWhy couldn’t their parent just teach them how to deal with their feelings instead of just launching at the first person they can find? I still have issues with this now as an adult. But I have promised myself that I will never let my child be unable to properly process her emotions.",
            "You being androgynous aside, I have always HATED it when people comment on dads with their babies and say they are \"babysitting\". It's like a pet peeve with me.\nGood for your mom!",
            "So I love your mom. What a witty response to come up with so fast.",
            "I Hate it whenever Anyone refers to any parent as *babysitting* their own child.\n\nCertainly it shows the stereotype that men don't need to Parent, they can just babysit sometimes.\n\nI would have been far more pissed off about that part of the comment.",
            "This is the best thing EVER! Get that boomer, little grandmama!",
            "Your mom is a superhero!",
            "Im a very butch female. Got a mullet and I enjoy it. \nMy spouse and I opened a pop up store in our town last weekend. The man who owns the business next door came over and looked at us both and asked \"what are you?\" To which I finally said we were married to each other. This seems to have answered his question. \n\nWe are a trans couple, but no one in this town knows that yet.",
            "Next time? Get video! Go, granny, go!",
            "Aaaand the stereotype that fathers have to babysit their own kids too.",
            "So boomer don’t even get along with each other? How have they survived this long? The silent generation must have been working overtime to pick up the slack",
            "Your mom needs some brass knuckles and a gold necklace that says 'BOSS'. Treasure her, OP. And give her a hug from this random internet stranger the next time you see her.",
            "Not trying to be rude (like that other lady) but post history suggests some bending of facts.  She still was wrong but it was more than likely out of bigotry and not solely random off the cuff assholishness.",
            "Your profile states you’re a MtF trans woman. Regardless, your mom’s response was great and that idiot woman should have minded her own business.",
            "Took the rings off? Gangsta AF 😁",
            "HOLD MY (pearl, clip-on) EARRINGS!",
            "OP-I love your mom! This is such a great story to retell forever ♥️",
            "'Bout to take my earrings off and get me some Vaseline. .  .'",
            "> Had to keep my mom throttling a boomer woman.\n\n... is she still throttling them right now? When will you let them stop?",
            "Should have let her 😂",
            "Holy crap! That’s one awesome grandma!",
            "If I was your sister, I'd join in.",
            "Mom's got your back😁",
            "Your mom is a badass and that baby is so lucky to have two badass women as role models.",
            "What is nursery water?",
            "Us mama's of grown kids who had hormone problems as kids are extra protective.",
            "Rock on to your Mom!! She may just be my hero ^_^ \n\nIt super pisses me off when people insist that it’s “babysitting” when a parent is looking after their own child. It may be meant as cutesy, but it’s toxic AF and just bloody stupid besides…",
            "So, according to this boomer, when mum looks after the children, it's her job, but when dad looks after the children, he's \"babysitting\"? Make it make sense...",
            "Gen xer grandad here, who was a SAHD for a few years with my eldest daughter. I detest it being called babysitting when I spend time with my kids or grandkids.....I'm having quality time, not babaysitting",
            "Your mother is awesome",
            "I love your mom too!",
            "you had to KEEP her throttling the boomer? nice, hold down the fort",
            "I hope you were able to share your feelings with Mom",
            "Sounds fair. I'm a later boomer and would do the same.  No one insults or messes with my kids ( all adults now). You have a great mum.",
            "You have a cool ole school mom! 😆",
            "Sounds like my mama! Good for her",
            "Would you please give your mom a high five, a fist bump, or a hug (your choice) for me because she freaking ROCKS 😂",
            "She was born after 1961 she is older Gen X. My mom born in 1961 is 63. She is the cutoff for boomer.",
            "Hugs to mom.",
            "My husband *hates* that he’s seen as the lesser parent. He doesn’t babysit the kid he made",
            "Nursery water??",
            "Christ you KNOW you've screwed up when she takes her rings off.\n\nDamn shame you didn't catch it on video your Mom sounds awesome and your kiddo is lucky to have two badasses as Mum and Grandmum.",
            "This is the type of story I hoped I’d see one day on this thread. A badass boomer. Go grandma",
            "Til nursery water is a thing. Is it just distilled water marketed to parents?",
            "Ugh the “dad” “babysitting” comments kill me. It’s nof babysitting if it’s your own damn child",
            "I can’t tell you how many times I’ve told obnoxious idiots in public to “stop talking now…” it works long enough for me to get away from them.",
            "I don’t know if you know but at 62 yo she’s a Generation Jones person. \n\nWe’re the last half of the boomer gen. \n\nWe def do not identify with most boomers. \n\nhttps://www.hellalife.com/blog/people/generation-jones-group-boomers-gen-x/\n\nLots of links for gen jonesers. \nYour mom is one of us!",
            "Meh, your mom was a total boomer in this interaction too. Who tries to fight someone over a casual misgendering? Doesn't sound like it was intentional.",
            "Your mom reacts like a middle school child",
            "Yeah beating up an old lady because they didn't know you identify as female, when you've MtF transgender and are the father of the baby makes your mother the asshole. Looking at your profile it's an easy mistake to make",
            "![gif](giphy|fGI7OX410yk0uGbZ1H|downsized)",
            "I love your mom too.",
            "your mom is awesome.",
            "OMG your mom is a true OG. You know it's going down when someone takes their rings off. 😂\n\n\nGangster Granny FTW",
            "Great mom you have. Btw, she’s not a Boomer, she’s [Generation Jones](https://en.wikipedia.org/wiki/Generation_Jones)",
            "Thug Life with Grandma Ringdrop!  ;)",
            "I owe your mom a beer. We momma bears gotta stick together.",
            "Good for ya ma. She is a solid parent. What is nursery water?",
            " Your mom is an absolute gem!",
            "She started taking off her rings 😂😂 this had me cracking up.",
            "Had me up until the handing off the baby and pulling off her rings parts . B-",
            "Title: That boomer pissed me off so much I couldn't let my mom stop throttling her. ;P",
            "Sweep the leg!!!",
            "Good momma! and good on you for “knowing yourself”. I’m short, bald, and talk *way* too much. *Recognizing* this instead of fighting against it has saved me a *lot* of stress and heartache. We are who we are. Just keep being a good momma and the kiddo I’ll be your reward. I know mine is",
            "You have a good mum!",
            "Tell momma to leave the rings on next time. 💜",
            "Your mom sounds amazing.",
            "Your mom is a treasure!",
            "How did you keep her throttling her, did you have your hands around her hands?",
            "I like how you forgot the “from” after “mom” in the title of the post, makes it sound like you had to keep making your mom throttle her",
            "Your mom is generation Jones, not a bomber at all... And typical behaviour for Gen Jones.",
            "Wow! Your mom was fixin’ to do a hoedown! 😂",
            "What's your PayPal, I'll buy your mom a beer.",
            "[removed]",
            "I’m 62 as well. Your Mom and I are NOT Boomers. Lol. We are Gen Jones.  And way to go Mom.",
            "[removed]",
            "My mom is amazingly defensive of me, especially after I had a kid",
            "Grandmama doesn't need to pack heat.  Grandmama *is* heat.",
            "Oh dang! Grandma was gonna whoop some ass!",
            "Not gonna lie, my mom would do the same. Shes a year shy of being a boomer, but she would absolutely throw down with some old bitch that said something out of pocket.",
            "Around here you know when a woman is serious about kicking some ass when she takes her earrings out and she might ask you to hold her beer. She might just chuck the beer and follow it in while laughing loudly.",
            "Everybody's gangsta until grandma takes off her rings  ☠️",
            "Grandma is about that life.",
            "TOOK OFF THE RINGS!!!! Momma is OG",
            "Nah that's 2nd tier serious.  1st tier is not caring about the rings, and 0th is putting more rings on. Or taking the earrings off.  If the earrings are coming off shit is about to go mortal combat.",
            "Yep, when you see a woman start taking off her rings - RUN!",
            "In the city where I live, this is the equivalent of a woman starting to take off her earrings. That happens, you better be ready to fight or start running!",
            "No, she was being nice that’s all. Rings just make a decorative set of brass knuckles. If she was serious, she would take out the hanging earrings. Those can get caught up or grabbed",
            "Gen X here. We wore rings on all our digits for a reason. We’d sort it out with the jewellers later.",
            "In the future, remember to keep the rings on. Make sure they fit you properly first but rings are devastating to facial flesh. Kinda like a trade mark. Then throw them away bc they are trademark. Props to your mom",
            "When she takes off her earrings it's really on!!",
            "I was just thinking that, that's the boomer equilvent of \"hold my shit\"",
            "Ready to throw those hands raw",
            "Yeah, leave em on. Take out your earrings.",
            "Yep. Dad here weighing in. When my kids’ mom and I split up, we still shared parenting fun and responsibilities. I remember people asked me frequently if “Mom is sick?” or some other offensive sexist drivel. Even my daughter’s pediatrician was obnoxious about it. I am not shy and I expressed my displeasure, as I recall….",
            "I will blow a gasket when I hear someone say that. Only reason I didn't was cause my mom beat me too it.",
            "My husband is a wonderful man. He is the better parent. His maternal (not a typo) instincts are better than mine. Only once did he joke about babysitting our son. I looked him in the eye and said, \"Well, I don't sleep with the babysitter. I sleep with my husband. So, which one are you?\" Never joked about babysitting again.",
            "I have always been annoyed at this. As a kid who grew up without a dad, due to him bailing, I take a lot of joy out of fathers who spend such quality time with their kids.\n\nIn reading your comment, something clicked that never had before. The sentiment that \"what can a father do but babysit\", is just another way to excuse men in general from putting in the hard work. I mean if everyone just sees it as a big joke, then no one will care about the emotional abandonment when a man does it. This goes so far to demonize women DOUBLY for abandoning their kids.\n\nAbsentee fathers are fine because it's not like they do much, but if a woman doesn't take care of her kids she is the fucking devil.\n\n\nGod I hate patriarchy, misogyny and the slew of hateful rhetoric that is passed around so freely. It truly is exhausting.",
            "My brother used to respond, \"Every single chance I get, because I love spending time with her. I do it almost every day,\" and people never know how to take it.",
            "Or when my wife is working a graveyard and I take my kids to dinner, and someone says \"oh it must be your weekend\".",
            "My dad had to deal with that when my sister and I were young, and he hated it so much.\nHe’d get invited for drinks after work and he’d say no, I have to get home and look after the kids while my wife works.\n\nThey’d go “oooo stuck babysitting”\n\nAnd he’d go “no. Parenting.”",
            "Because their parents came from a generation where you bottled your feelings up until they came out in a drunken rage.",
            "I'm a UPS guy. I deal with this stuff pretty frequently. I'm pretty polite about it, and once they've realized they've wasted their time, and that I'm useless for their problem, I dig in and start politely wasting more of their time... politely.",
            "The opiate of the masses finally makes itself useful.",
            "You can always tell who was berated as a child. Someone went off on them, mostly likely for only existing, and now that's how they handle things.",
            "People always assume I'm my daughter's father, so I just correct and move on. But when people say I am \"babysitting\" on top of being her father, I will shut them down and either embarrass them or horrify them.",
            "It's super annoying and it's BEEN old. The show Roseanne did a joke about it back in 1988, in the very first season. \n\n\"Where's Dan?\"\n\n\"Oh, I left him home with the kids.\"\n\n\"You mean you got him to babysit?!\"\n\n\"Babysit! Hell, they're his kids too!\"",
            "I just call it caring for their child. \n\nWomen aren’t the only caretakers and hands on parents.",
            "Worse when the dad HIMSELF says, “I babysat the kids on Saturday!” (Uncle back in the day)",
            "My reaction has always been to have a big smile and a thumbs up when I see them doing stroller duty.",
            "She has a Boomer husband, she has 30+ years of pent up aggression and witt",
            "Trust me, if my mom didn't beat me to the fury, I would have been pissed about that.",
            "It’s unfortunately a stereotype that goes through the legal system too. I’m a single dad with 50/50 custody. My kid is 12, her mom and I split when she was 3. I was in a situation where my daughter’s mom wanted to move to another state and take my daughter with. \n\nWe had to go to mediation. A mediator is supposed to be a completely neutral party. Immediately he was encouraging me to let my kid move, and referred to her moms custodial time at “parenting time” and mine, the fathers, as “quality time”\n\nThe court appointment neutral mediator decided that because I’m the dad, I’m not a parent, I’m just the fun guy. \n\nFortunately it worked out. I miraculously got a job offer in the same town they were moving to. I didn’t get to see her for a month, but then moved and have 50/50 still. We’re going backpacking this weekend for a belated Father’s Day",
            "She really is",
            "I'm MtF trans but confuse people mostly cause I'm 6'5\" with traditionally feminine features mixed with androgynous ones. People get confident when I talk or my hair is back cause they just assume I'm a feminine man. I usually don't care, but when it involves my daughter, then I care.",
            "If I said that, that's what I would mean and then replay this in my head like oh shit that sounded wrong.",
            "I'd love to, a 5'7\" rail of a woman kicking the shit out of an old bitch would be fun to show people",
            "There's baby boomer and than there's boomer. Just like every other generation trying to kill each other.",
            "I can confirm. My mom is an earlier baby boomer (1953), but she is NOT a boomer. I can confirm she routinely battles (verbally, though she probably would throw down if someone threatened me, my sister, or one of her pets, lol) people her age. She usually has friends a generation older or younger because of this.\n\nETA: My Dad (1948) is also pretty cool. When visiting my sister, she roped him into throwing beads off a Pride Parade float. He had a blast!",
            "Give her one from me too, I love this.",
            "Be careful lol you'll be downvoted into oblivion",
            "Yes, I am MtF, but I am still my daughter's mom",
            "I wish I had a sister, I just have two brothers that became jackasses after I got married",
            "She does now, when I came out she...really didn't but is trying and does now.",
            "Purified or distilled water used for formula, adding to juice, etc.",
            "What IS nursery water?!",
            "For formula",
            "Kinda, it has added in minerals that help babies grow",
            "I had no idea there was a secondary label which explains why I never fully identified with the Boomers. I was born in '58 and always felt like the Boomers were more direct post WW2 offspring than I was. Thanks",
            "I think my parents are generation Jones and I'm zillennial.",
            "*Good for ya ma. She*\n\n*Is a solid parent. What*\n\n*Is nursery water?*\n\n\\- BlakJak\\_Johnson\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
            "Distilled water with added minerals for formula feeding",
            "Stepped between them",
            "I didn't even notice.......oops",
            "You’re a douchebag though…..",
            "Mind your own parts….",
            "Your submission was removed for being uncivil.",
            "You’re mom sounds like a bad ass",
            "One of my students puts her rings ON before starting a fight!",
            "Definitely wish I had your mom as a parent.",
            "Your mother is a badass! But never take off those Rings LOL because they do way more damage.🤣",
            "GenX Grandmother here.\n\nGrandbabies hit different. I always defended my kids and their friends, they never doubted that I would kill and die for them. Then my granddaughter was born.\n\n Let someone so much as side-eye my daughter in-law, especially when my granddaughter is with her, and I will cheerfully rip their lungs out with a skip in my step and a song in my heart. Talk smack about my son, I will push you in front of a bus. And gods help you if you so much as breathe funny at my granddaughter.\n\nI've always been scrappy, but the ferocity the existence of my granddaughter has awakened in me is absolutely otherworldly. It is scary in its intensity.",
            "Tell your mom I love her and I wish I had a mother like her.",
            "You got a good one OP! Take care of each other ❤️",
            "And you call her a boomer. Tf?",
            "Might as well take that menopausal rage and direct it effectively",
            "Get grandma in the UFC!",
            "THUMBS UP MUGSHOT, BITCHES!",
            "I was once explaining to my wife that it's pretty common street knowledge that if you ever see a woman taking off her earrings, that somebody is about to get an ass-whoopin'.  \n\nThen, just to illustrate my point, a couple days later were watching some comedy show with a couple women arguing and one of them starts taking off her earrings...  \n\nThe look on my wife's face when she saw it was awesome  :)",
            "Should leave the rings on. They can cause more damage that way.  Diamonds are at the top of the hardness scale so shouldn't bother them.",
            "When the earrings come off, you already hear the \"Finish Him!\" before the fight starts",
            "Yeah, I agree with this statement as someone raised by an abusive boomer.  Not saying OPs parents or anyone else's was abusive, this is just my own experience in my own situation.  If my mom was upset, rings came off.  If she was angry, rings stayed on.  If she was pissed, she turned the gemstones of her rings so they were on the same side of her palm as she would slap me, because \"that wasn't hitting your child.\" and would use those gemstones in order to inflict more damage.",
            "Same thing here man! My daughter is 12 and I’ve had 50/50 custody since I split with her mom when she was three. Especially in those early years, both before and after I split with her mom, that shit happened so much. Especially at the playground. “Babysitting today? Where’s mom?” \n\nI’m not babysitting asshole, and you’re interrupting our game of tag. \n\nIt’s so frustrating having people come up to you in public and assume you’re in an incapable parent just because you’re a guy.",
            "I found a fun thing to do is to shame them for asking if you're \"babysitting\"...\n\n\"Do you ask the same when a woman is parenting? Or do you only ask men?\" \n\nOr shut them down without having to bollock them with a simple:\n\n\"I'm a parent, not a babysitter\"",
            "Dad here as well. While me and my wife are still together, I work weekends and am with the kids all week. I do most of the doctor visits and other fun stuff. It’s not super often but every now and then I’ll get some babysitting remark. \n\nI don’t babysit. I’ve never been paid to do it and don’t want to. I will however raise and look after my kids.",
            "\"Only once did he joke about babysitting our son. I looked him in the eye and said, \"Well, I don't sleep with the babysitter. I sleep with my husband. So, which one are you?\" Never joked about babysitting again.\"\n\nThis this the perfect response for that weaponized incompetence.",
            "I only ever used “babysitting” to mean I was sitting downstairs watching the box while the kids were asleep upstairs. We shared parenting duties when I was at home. I’d always be the one doing the nighttime feeds to ensure my wife got a full night’s sleep. She looked after the kids while I was at work, we both did nappy changes. (They’re now 18/15).",
            "It breaks their brains that a man can be a compassionate human being that cares about their children.",
            "I had similar from a woman when I took my kids to a soft play venue. There were a lot of families in the place and only a few men parenting without a partner.\n\nMy kids were in the play part at that point, as were this woman's offspring. I told her that every day was my day because I'm as much their parent as their Mum.\n\nSometimes it's frustrating to constantly deal with small kids, but the joy of guiding them and seeing them learn always make up for those little things. Now that they're much older, the lessons have borne fruit and I know the effort was worth every moment.",
            "True. Lots of this rage then transferred to their children.",
            "Bless their heart….",
            "I would love to see this recorded with the father saying something like,\" No, parenting because my wife of 15 years passed away shortly after birth. We tried for 10 years to get pregnant and on the last round of IVF it took. That last round of IVF was not worth it.\"",
            "phrasing being trans as \"a testosterone issue\" is honestly iconic",
            "Sweet Jeebus! \n\nYou do realize this information might make people like your mother even more, right? \n\nI realize it is not actually pertinent info, but it does add a layer of ‘how cool is my mom,’ to the situation.",
            "I was about to say, as a trans woman, this felt like some snide transphobia, and it makes your mother even more bad-ass that she was ready to throw down for it tbh.\n\nI normally have to rely on my spouse for that sort of thing 😅",
            "Omg I thought it meant cis woman with a hormone condition 😂\n\nThat's a brilliant way to phrase it, absolutely fantastic",
            "It would be fun to see!",
            "Is that the testosterone issue? I like that phrasing.",
            "Oh, that's the testosterone issue.",
            "I...\n\n\nI mean yeah that is *definitely* a testosterone issue XD\n\n\nglad you're lucky enough to have a boomer mom who accepts you",
            "My brothers were always jackasses, but good ones.",
            "Or like a vaporizer if they are sick",
            "What's different about it? Why can't you use regular water?",
            "I had a bad ass Mom she could make a fork stick in the Wall after throwing it at me",
            "It's probably autocorrect, but...\n\nYou're = you are (you're wonderful, you're awesome,  etc.\n\nYour =possessive (your car, your shoes, etc.)",
            "This is the way",
            "Pseudo brass knucklez",
            "that’s how you know who grew up in the hood!",
            "Yup! Keep the rings on but take the earrings out!!",
            "Stones out!",
            "Hell yeah! I had friends in high school who'd go to the flea market for the biggest, heaviest, most dangerous rings they could buy.",
            "But with blunt force trauma is easier to sell \"I don't know, she just fell down\" :P",
            "Im a gen x papa and I think theres a couple reasons for that. One is gen x, we tend to not GAF. Another is our children are grown and we have lived life. Not that we have nothing to lose, but if we do lose it our loved ones arent left struggling as they have independent lives.",
            "This is the way.",
            "Well, she is. A boomer (lowercase) is a person born during the post world war two baby boom. A Boomer (proper noun) is a person in that age range that thinks their shit don't smell and the whole world revolves around them.\n\n*Edit for those that don't know the \"baby boom\" was from 1946-1964. I wasn't referring to every being that was born after WWII, but to the Americans born between those years. That's where the term \"boomer\" comes from and the entire reason \"ok Boomer\" became a saying in the first place. I'm more than a little surprised Boomer has become a term of such notoriety that people don't know the origins.",
            "**\"MEEMAW, SMASH!!\"**",
            "You take them off because you don’t wanna fuck up your rings on some basic bitches skull",
            "Agree. I had occasion to defend myself and my rings did a lot of damage to him. Lmao.. he complained to the cops. Pieces of shits. Cops were his buddies but couldn't do much as it's normal to wear rings. It's not normal to jump a fence and attack your neighbour. It was hard to get it to court, but eventually I got a restraining order against him.",
            "Earrings come off and shits done.",
            "I realise that you meant for those who are deliberately incompetent, but u/ronakino  said their husband is the better parent. \n\nUnfortunately, the way you wrote that gave me an initial impression that you aimed at their husband.",
            "There is a dude on TikTok that said his go-to when people do that to him is, \"My wife passed during childbirth. All I have left of her is my girls. Go to hell.\"",
            "Right?! I'm glad someone said this! Totally gonna save it for later lol",
            "Was searching for a comment chain bc I didn't wanna point it out if OP wasnt cool with it, im in love. To be fair, my doctor has it marked as \"testosterone deficiency\" on my chart lol",
            "Yes, I don't like advertising that I'm trans, but I don't go out of my way to hide it",
            "Lol, yeah....I just don't really advertise it and just call myself a woman (I am a woman so it is a moot point)",
            "My mom once stuck a spoon into a plaster wall when one of my brothers lipped off about the dinner she served us.  She had the power, but her accuracy saved my brother from a serious spooning.  That wall got painted several times in the ensuing years and Mom would not let us fix that divet from the spoon.",
            "Because the rings aren’t worth anything? So people don’t mind breaking or losing them?",
            "If I'm willing to put my hands on someone, imma make sure I cause permanent injuries. I have severe early developmental trauma, which leads to blackouts where I go too far when I'm pissed. Haven't blacked out in nearly 15 years, tho, yay!",
            "gen x granddad also.\n\ni think part is our feral upbringing.\n\ni absolutely will not be the parent my mother was.  i will also be the grandparent I always wanted.\n\nthat protectiveness, I think, comes from our own treatment as children.\n\nand yes, we don't give a shit about rules if you threaten our family.\n\nwe're feral, and we'll fucking show it if you bring it out.\n\nleave us be, let us do our own shit, and we're chill.",
            "Plenty of baby boomers in other countries, both the lower and upper case types.",
            "😂",
            "That and who needs to worry about dna evidence in your pretty ring.",
            "Love the user name.",
            "Yall got some weak fucking rings.",
            "I’m glad you were wearing your rings",
            "Oh no, I fully appreciate any man who actually parents.",
            "Omg I'm gonna have to find it! Thank you!",
            "I’ll need to start using that phrase. Testosterone issue. I like that.",
            "Good point",
            "I love you, your responses, and your mother. You all are a gem.",
            "Oh Wow , my Mom from Bronx , became PHD , I think our family has great reflexes we ve been told",
            "Wow",
            "More damage to the person being punched I imagine",
            "If your rings are harder than 24carat gold, they're some cheap rings...",
            "Me 2. I had no idea that they could do damage before that.",
            "Thank you ![gif](emote|free_emotes_pack|grin)",
            "Way more damage…..  you punch somebody in the face wearing rings or brass knuckles it is a Completely different situation.\n\nBadly cut/split open skin that will leave scars\n\nWay more likely to break a nose or jaw or cheek bone \n\nIt is a weapon….. and if you get charges, they will reflect this",
            "Same principle as knuckledusters. Concentrates the force on a smaller surface area.",
            "Ehhh, a rings force concentration effect is negligible,  it's more to do with cutting and ripping from any stones/uneven edges."
        ]
    },
    "They're so casual about child abuse": {
        "title": "They're so casual about child abuse",
        "score": 5607,
        "url": "https://www.reddit.com/r/BoomersBeingFools/comments/1dlaq7r/theyre_so_casual_about_child_abuse/",
        "content": "Yesterday my husband and I went to get ice cream in a nice area downtown by the river. Lots of tourists out and about, but thankfully the shop was relatively empty. We are the only ones in line while we were choosing our flavors when a Boomer couple walked in. The husband goes straight to the bathroom (it's for paying customers only) and the wife goes in line the wrong way to stand over my shoulder to see the flavors. Whatever. We are picking our flavors when she walks around us and does the same thing, leaning basically in front of my husband to look. They didn't get anything, but instead head back outside and sit in the shop's tables out front. It's a nice spot, but still, rude to not get anything.\n\nWe take up seats in a corner and are eating when I notice a large family is headed in. They're all ordering while the mom is trying to wrangle her youngest into a high chair. He is fussing and begins crying. I am fine with kids, but the shop is small, so we decided to head out. Kid is still crying as we are passing the Boomer couple (now chatting with other Boomers) and we overhear their conversation:\n\n\"Oh sounds like someone didn't get the flavor they wanted!\"\n\n\"That would never be me, if my kids had acted like that I would have beat their ass!\"\n\nMy husband loudly mocks them by parroting what they said back to them with a \"ha-ha-ha isn't child abuse FUNNY?\"\n\nEdit: reading through comments and I'm so sorry to all of you who have experienced abuse as children under the guise of \"discipline.\" My older gen x mother also hit me with a flyswatter, but my friend was hit repeatedly with a belt then forced to do push ups. I am so grateful to see we are changing and breaking the generational trauma. ",
        "num_comments": 701,
        "comments": [
            "Remember to report submissions that violate the rules! Harassment and encouraging violence are not allowed.\n\nEnjoying the subreddit? Consider joining our discord server: https://discord.gg/v8z8jNwJs6\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BoomersBeingFools) if you have any questions or concerns.*",
            "As a GenX who got spanked as a child, I used to believe for a very long time that physical punishment was absolutely necessary in order to teach a child the consequences for bad behavior.\n\nThen my niece was born.  She is in her 20s now and is an extremely polite and sweet young lady who works full-time and has never gotten into trouble with the law or anything like that.  She also never got spanked a day in her life.\n\nWhat her parents did was to teach her to have respect.  Respect for the feelings of others, respect for the property of others, respect for authority, respect for the beliefs and needs of others, and respect for herself.  \n\nThat's when I changed my tune and now it grinds my gears to hear people say, \"These kids nowadays are out of control because they never get their a$$es beat like I did when I was a kid!\"  Guess what, prisons are full of people who definitely got their a$$es beat, how exactly did it help them??  Maybe it would have been better to simply teach them the importance of respect.",
            "I was telling my boomer mother that my 5 month old is teething and has started to bite me while she feeds. My mother tells me that \"back in my day, the advice would be to give her a little smack\".\nSmack a baby that doesn't understand what she's doing? Absolutely not, mum. I've told my parents (who used to hit us all the time and threaten the belt) that no one is to smack our child if they are left to supervise her. They acted like such victims, as if they didn't choose to hit us when we were kids. My dad pouted and sulked after I said this and stated that he would never hit his granddaughter. A month later and my mum advises that I smack her. Just. What the fuck.",
            "OMG I ❤️ your husband!!!",
            "My boomer dad would \"joke\" like that and I'm sure still does. Except he wasn't joking. One time when I was a kid, he beat me with a wooden yardstick until it broke. It's one of many reasons we're no contact.",
            "When I was very young, my mother would always tell me to go play in the traffic Apparently she was shocked when one day I replied \"you don't really want me to play in the traffic because I'd hurt myself\".\n\nShe never said it again. I'm just glad my younger self knew enough not to play in traffic. I don't get why anyone would say that to a young, impressionable child.",
            "\"And that's why you probably don't see your grandkids more than  once a year.\"",
            "They really ran with and misinterpreted “spare the rod, spoil the child”.",
            "My mom thinks it's super cute and quirky that she wanted to hit me, essentially for being autistic, when I was 13.",
            "I know elder abuse is horrible, but some of these child abuse fanatics should spend a week in a 1-star nursing home.",
            "Sadly lots of boomers grew up in households that still viewed avuse as a failing of the victim so they still seem to internalize that as “well I dealt with it why can’t you!” Its worse when it’s SA cause many really blame the victim in that case as well it seems",
            "They're so casual about it because they don't see it as child abuse. Because if they did, many would have to admit and face the fact that they've abused their own kids and were themselves abused. Then they'd have to face the trauma, guilt, etc that comes along with that realization. \n\nDenial and willful ignorance are much, much easier to bear.",
            "My Mother in law used to have the kids clean and do chores the whole time she watched the kids when they were little.  Then when we got back she'd say 'It better still be spotless the next time I visit'. Our house was cluttered, but never dirty beyond looking like a 4 and 6 year old lived there. I never understood that. The kids didn't want her to babysit anymore after a few visits and her house was always messy on top of it and my wife was the oldest and said she did most of the housework as a teenager. You should spoil your Grandkids, but instead it was this bravado of 'this doesn't fly when Grandma's around' attitude.",
            "Whenever people say “we didn’t have X back in my day” I always respond “Yeah, you just can’t beat it out of them like you used to huh?”.",
            "Good on your husband! Seriously, it's like boomers see cruelty and abuse as good things and I don't understand it",
            "A few years ago, my asshole idiot Boomer father once \"joked\" to my GF that he \"should have beat me more as a child\". \n\n... I'm not sure why he thought that would endear himself to her, but it had the exact opposite effect. Before you say \"oh, he said this to put her off\", I'll dispel that and say no no, knowing him, he genuinely thought that this \"beat my kid haha funny\" \"joke\" would be a *positive*. I'm not sure where they learned their fucking comedy, but that ain't it.",
            "I was on a walk with my 16 month old the other day, he always brings a utensil of some sort, loves our spatulas and spoons (idk why we even buy toys). Anyway we walk past a boomer and my son has a wooden spoon, boomer goes “that’s funny, my kids hated the spoon” \n\nHAW HAW HAW SO FUNNY",
            "My mother has entered the chat.\n\nShe loves to talk about how I was hit as a child and I \"turned out fine.\" No, I turned out afraid to ever make space for myself or even be noticed in any way. I have almost no ability to ask for what I need or want. I'm terrified of making mistakes.\n\nBeing hit as a child didn't teach me manners or discipline. It taught me to hide when I fuck up. That got me into some *huge* messes as a young adult.\n\nThe last few years of low contact opened my eyes to a lot of this. As a result, I only visit her as often as absolutely necessary. Once or twice a year.\n\nIf that's your definition of fine ... okay.",
            "I went to a funeral recently for the grandmother of my older Gen X neighbor. My neighbor is a strict southern Baptist and basically acts like he is a boomer himself. Anyway, when he was giving the eulogy, the only story he told about his grandmother is a time she spanked him so hard he couldn’t sit down. He was smiling and laughing and so were most of the other people there. Me and my wife were disturbed as hell.",
            "My mother-in-law still brags about beating and breaking my wife’s spirit when she was a child. If she goes out to eat with someone she doesn’t know very well, she’s gonna brag about it.",
            "Makes me think of my Boomer Dad the other day saying in response to my niece/his granddaughter putting a fence around her yard to stop the kid running in the road, should forget the fence and just beat her kid so hard the kid never tries to go in the street. like wtf??? the kid is 2! she wouldn’t understand why she was getting hit in the first place!",
            "They love to beat their kids. Its an outlet for that anger they don't know how to manage. Mine bragged about hitting me in the head so hard that she broke her pinky when I was 15. Then it was \"har har har, hyuck hyuck hyuck - my kid has such a hard head that they broke my finger! Hyuck hyuck hyuck.\" \n\nYup, her broken finger is alllllll my fault. Not hers, for her lack of self control.",
            "Hitting your kid is more about regulating your emotions than your kids. It’s not really affective because half the time the kid doesn’t correlate the punishment until they’re much much older, so hitting some 5yr old isn’t going to do anything but show them that their parent likes to hit them when they’re mad.",
            "This is just it, isn't it? When I confronted my parents about the *years* of wooden spoons and smacks and slaps across the face .. well first they denied it, and when I refused to let up.. \"well what were we supposed to do with you? You were just awful, and that's how everyone dealt with badly behaved children!\" ... it started when I was 3 or 4. So I guess, sorry for being a toddler? It only calmed down when I was 16 and about their height, then turned to verbal abuse and manipulation. Now, 45F, I cannot bring myself to punish my kids in *any* way. Try explaining that to a high school teachers expecting my son to have serious consequences for not turning homework LOL",
            "The saddest part is that some Millennials still seem to believe that child abuse is \"all love\". I used to be in a group on social media where people around my age discussed marriage and parenting  \n\nOne of the questions was:\"How long after remarrying do you let your new partner beat your children?\" The first answer was:\"Immediately. Once they first meet. This is the only way for my kids to realize my new partner loves them.\"\n\nAnother sentence I read in there was:\"My parents beat me until I bled and I turned out fine.\" (Spoiler alert: you didn't) or \"If the beating happens in the name of discipline, it is not child abuse or domestic violence.\" (Spoiler alert: It is) \n\n\nI just couldn't stand it. Having lived with boomers thinking this way, I can't imagine having this mindset. I can't stand the fact their kids keep carrying on with this mindset. I just don't get it.",
            "My dad's father passed when he was in college. I've heard many stories about him all my life since I never got to meet him. I'll never forget my dad telling me, as if it was a funny story, one time his father had gotten so mad at him for mouthing off about something when he was a kid, that his father punched a hole into the wall right next to his head.\n\nThat story has horrified me since I was told about it. I love my dad and I know he loves his father, but I'm not sure I would've liked that man if I ever met him.",
            "Corporal punishment is still legal and used frequently in some public schools. Looking at you Texas.",
            "Conversation i had with my boomer parent recently:\n\nBP: (talking about dumb thing my 5 year old did) “we would never have let kids act like that! You really need to nip that in the bud!”\n\nMe: umm yeah definitely not taking boundary advice from the generation that thought hitting kids was the way to go! \n\nBP : we didn’t beat you! Omg so dramatic \n\nMe: we definitely got spanked over dumb shit. Did it work? Nope, look at brother, he was a terrible teenager. \n\nBP: well, well (open fish face)",
            "My mom used to let her boyfriend beat me with a vacume cord",
            "It is INSANE the amount of times a boomer tells me they beat their child, unprompted. Usually unrelated to anything at the moment. They just HAVE to tell you about how they were beat, or how they did the beatings. \nIt's unsettling and bizarre to everyone else.",
            "\"My parents beat the shit out of me, and I turned out just fine!\"\n\nDid you? Did you *really*?",
            "He should have followed up with \"what do you guys think about elderly abuse?\" And cracked his knuckles.",
            "Left coast boomer here. Was abused as a child. I NEVER hit my boys.",
            "My Dad spanked my sister right on the front porch steps when she was 4 years old for literally raking my 2 year old brothers face with her fingernails that he bled from it.  This was in 1968 (my Dad was 36 yrs old my Mom was 34).  Too old to be Boomers.   This was just before I was born (January 1970)-I’ve heard this story 100s of times.  Silent Generation believed in physical punishment for wrongdoing probably more than Boomers.",
            "Same people love to say - “I got my ass beat as a kid and I turned out just fine” \n\n\nDid you tho…?! 🤔",
            "It's so infuriating to me that boomers act like children's developmentally normal expressions of emotions is a moral issue. The child is \"disobeying\", \"acting out\", \"being a brat\", not that they are tired or hungry or frustrated and not sure how to communicate what they need.",
            "My parents spanked me with a wood spoon when I was little, and apparently when they threatened to spank me as a 5 year old, i would ask “is it a spoonspank?”\n\nA few weeks ago I was at their house with my kids, and my mom brought it up and apologized to me. She had done some reading and discovered how attitudes towards physical punishment have changed, and how she regrets doing that to me.\n\nI love my parents. Good people make mistakes, but then are able to grow and recognize what they did wrong, and do better.",
            "Mine used hot wheel tracks and wooden spoons.",
            "Most boomers got hit and hit pretty badly and often.  So, a lot of us thought and still think it's the way it's done.  However, there are a few of us (like my husband and I )  who decided to break that belief.  I have a GenX and a millennial.  Neither were hit, and neither hit their kids. It was definitely the way to go with no trauma.",
            "My kids used to love to play with wooden spoons like drumsticks on Tupperware. I never told them that my mom used to hit us with those regularly, breaking several on us. I hope this generation Never knows that wooden spoons were a parent's weapon of choice in the 70's.",
            "Your husband is awesome,  support him and laugh back because I absolutely would have done and encouraged the same thing. People who decide to make their gross thoughts like that public should be mocked and shamed. Screw them.",
            "Hitting children is just legalized violence against children.  It says more about someone who feels better when hitting a child that legit does not understand.  Hitting your child correlates that pain will go hand in hand, no pun intended, with emotions.\n\nAs a Millennial, I was physically abused by my father and as we got older, he chose to whip our feet as to not leave visible bruises for school.\n\nMy spouse and I made an agreement never to spank our children, let alone hit them.  Routinely we are complimented about our five year and two year old daughter’s behavior whenever we are out.  \n\nThere are plenty of studies out there that show corporal punishment can leave lasting emotional scarring through adulthood.  What really gets me is evangelicals who justify hitting their kids based on a scripture verse here and there.  The “rod” the Good Book references is a Shepard’s staff used for guiding their flock.",
            "I’m 53. We were at a picnic June 1 and my mom was telling someone about when I used to show horses.\n\n“She never wanted her aunt to brush her hair because my sister didn’t stop for knots,” she laughed.\n\nYeah, laugh at your sister abusing me and her own daughter. Yanking a brush or comb through knots instead of taking a moment to tease them out is also child abuse. It’s a literal choice an adult makes to make a child cry.\n\nMy aunt was great in a million ways but it definitely felt like she was getting some sort of revenge brushing our hair.\n\nI didn’t even associate it with abuse until I was in my early 30s and I mentioned it to a friend, I laughed when I told the story too.\n\nThey quietly said, “I’m so sorry your aunt abused you like that.” 💡moment. 🤯",
            "They have to normalize it, or else they have to reconcile the fact that they did something wrong to their children and even more so that something wrong was done to them. Introspection is simple unacceptable.",
            "\"I would never hit my kids, but I might hit you if you don't fuck off.\"",
            "I've got a Boomer coworker who loves to talk about how they didn't have \"made-up diseases\" like ADHD or autism when she was a kid. If you acted out or misbehaved in any way, the teachers smacked you, and then your father \"beat it out of you\" when you got home. She's very nostalgic for the days of teachers tying kid's left hands to their chair so they couldn't use it, or teachers standing on kid's feet if they fidgeted. \n\nShe's absolutely convinced kids just need to get their butts whooped and they'll be fine.",
            "My dad would yell in my face, push me down, pull my hair and spit on me. And yet he can't figure out why he and my mom aren't allowed near my kids. Was ina very well behaved kid? Yup. Because I was always afraid if I wasn't perfect I would be physically attacked. And by perfect, I mean just dropping something or spilling something would cause a fury of screaming and name calling. For so long, I said the abuse wasn't physical because he wasn't hitting me. But he was clear by pushing me, getting up in my face and putting holes in walls, I realize it was very physical. I don't tolerate that behavior around my kids. No one is going to treat them like that. They would have to get through me and I am a solid person, so good luck with that!",
            "Gen Xer with a millennial kid. I used natural and logical consequences with my kid. I will tell you this, it keeps you from over reacting and actually makes you think about the behavior displayed and ways to help your child change it. I never even grounded my son or took away devices because that was NEVER a logical consequence for any stupid thing he did!",
            "“Use your head, not your hand” has to be the best piece of parenting advice I’ve ever been given.",
            "Or maybe someone needed a nap?",
            "Ewwww .Thank god my business is online so I wouldn’t have to deal with their pink sunburnt spotted ahhh ya’ll quaeda ahhh stupid faces.",
            "ICON",
            "A lot of gen x parents didn’t spank their children. Reason: they know how traumatizing it is",
            "You have chosen well OP.",
            "My toddler and I visit a popular children’s museum pretty often during daytime hours when parents are at work and boomer grandparents are supervising their grandkids. The amount of spanks and slaps and physical “discipline” doled out to kids by these boomer grandparents is astonishing. And I always wonder if the parents of these kids KNOW about the hitting and/or have asked these grandparents not to hit their kids. \n\nIf someone I know is with us, I’ll also loudly and sarcastically say to them “oh that should really help them calm down”. But if I’m alone with my toddler, I try to redirect her attention to something less upsetting.",
            "My father used to spank my brother and I with a belt. He never explained why we were in trouble. He was too tired from work to deal with parenting and stuck in an unhappy marriage and took it out on us. For years as a teenager and young adult I would unconsciously shield my butt with my hands while talking to him. I even flinched when he came close. He’s reflected on this and admitted he often went too far with my brother and I.",
            "“How would you like it if someone beat YOUR ass every time you fussed about something??”\n\nKids cry. Hitting them doesn’t help short or long term. Give this mother a break, Janet…",
            "My mom used to smack the crap out of us and has never acknowledged it was wrong. She also likes to say how bad we all were as kids as if it’s our faults. I have never hit my kids and they’re wonderful children. My mother was and is just selfish and lazy and abusive.",
            "I was never spanked as a child but as an adult now I quite enjoy it.",
            "My father was physically and emotionally abusive growing up. He passed away a few years back and honestly I find it hard to miss him. It's made interacting with his side of the family difficult because they have all this love for him and miss him, whereas I struggle to think of one happy memory from my time living with him.",
            "I think I was spanked a grand total of *once* in my whole life, and it was 100% deserved. It involved two knives, my brother, an electrical outlet, and a wall",
            "Boomers love the idea of child abuse. Listen to them complain about the woes of the world and their solution is always to beat children early and often and sometimes without cause.",
            "I'm in a wheelchair I have cerebral palsy. My mom would yell at me and let my stepdad smack me around\n\nI was 17 and I had a very important surgery and my stepdad was doing his usual yell at the kid and he started hitting me over the back of my head my mom said \"stop you'll give her brain damage\" and he stopped and like screamed in my ear.\n\n22 I started having seizures.\n\n35 I have a hole in my ear drum\n\nI calmly tell my mom about both of these events and her response is \"i'm sorry i was such a bad mom\" like I never said she was bad...\n\nand I realized I didn't need too",
            "My girlfriend and I rode in an Uber with a boomer driver the other day. My GF recently got surgery, so she had a cast on. The first thing the driver says to me is, \"How'd she get that? Did you mouth off to her, and she hit ya?\" I said, 'No, she doesn't hit me, and it's pretty weird to joke about domestic violence to people you don't even know.\" It's crazy how they are so non chalant about it.",
            "My Boomer parents were hippies and never laid a hand on me. There were other effective ways of punishment, all they had to do was say “keep this up and no more Simpsons” and I straightened up. My wife was raised by Southern Baptist parents, her dad got the shit beat out of him by his parents and beat her and her siblings. Her mom was incredibly emotionally abusive, my wife’s older sister cut off all contact about 15 years ago. I’m sure they both think they’re morally superior to us, since we’re atheists, but we’ve never laid a hand on anybody or abused anyone.",
            "I love your husband",
            "They think because they were abused that everyone else should suffer the same. It baffles me that after growing up in abuse that they wouldn’t want anything but to avoid making any child feel the same as they had once felt.",
            "The other day at my work (supermarket)\n\n\\*a child is having a tantrum at the self checkout\\*\n\nBoomer: \"Kids these days are so out of control, I never acted that way when I was his age.\"\n\nMe: \"I'm very certain that if your parents were alive they'd laugh and talk about what a little shit you were at that age too.\"",
            "That's how life was when they had kids that age.  Hell, that's how life was when I was a kid, though mom wouldn't usually beat my ass in public, she'd wait until we got home and make me pick a switch.  Society progresses, but generally most people are stuck in the ways they learned when they were younger, despite that progression.  That's why they can be so casual about what people now view as child abuse.  The hope is, each generation progresses a little more than those that came before, which seems to be (mostly) working.  Personally, I try not to judge too harshly, unless they want to get up in my business with it, but generally speaking, the things boomers say about life back in the day don't surprise me in the least.  Life was very different, and it's passed them by quite rapidly.  I feel a little sorry for them in a way.",
            "I was hit as a child, which made me understand very quickly that hitting children is not only wrong, it is pointless.\n\nIf your child can be reasoned with, reason with them.\n\nIf your child is too young to be reasoned with, they will never understand why you hit them.\n\nThis isn't difficult.",
            "My husband's mother once hit him in the FACE with a bat when he was a teenager because she believed his cousin who had pointed the finger at him for\nstealing quarters that his stepfather had hidden to cover up for his own theft. I don't know why she didn't get a ride in the squad car for that one.\nEven if he had been guilty, it would have still been wrong.",
            "My parents spanked me, my dad slapped me, and it made me who I am today- a preacher of anger, hatred, and unforgiveness, fearful of having children because I don't want to hurt them.",
            "The setup for this story is chef’s kiss perfect \n\nAlso if that obnoxious boomer couple laughs out loud at child abuse \n\nThey’re gonna have a laugh riot when they move into their retirement home. ",
            "My Boomer mother (who is no longer alive), stayed home for two weeks when I was around two years old to, in her words, “straighten me out”.  When K got upset I would throw myself onto the floor and start screaming and kicking.  She picked me up and smacked me hard on the bum and would yell, “There!  NOW you have something to cry about!”   She claims those two weeks were necessary to straighten me out.  After that I was a docile, emotionally stunted and shy child who was apprehensive about everything and was  afraid to do anything wrong.  I don’t remember those beatings, but I understand now how that affected my emotional development.",
            "My dad and grandpa have straight up said that the liberals are ruining America by making it illegal to beat children. It’s so insane.",
            "Hahahaha lol",
            "Well they all pretty much got the shit kicked out of them by their parents so...",
            "Victims become perpetrators",
            "I would’ve said something about how the restrooms are for customers only and they didn’t buy anything, so apparently their parents didn’t beat them enough.",
            "Yikes! Props to your husband!\n\nReminds me of my own story from way back when I was cashiering. Had a woman with a child who would not stop trying to grab things and was crying the entire time. She got through, and the boomer lady behind her said, 'It isn't abuse if you don't bruise them!' Thank goodness she only had a couple of items and was quickly on her way, but myself and the customer behind her immediately gave each other the 'wtf did she really just say that?' look. It was sooooo uncomfortable.",
            "My boomer brother and his wife raised two fantastic kids. They never put the kids in a situation that was overwhelming. That included not taking them to crowded restaurants or places where they get bored and over stimulated. When they got past the toddler stage they were fun to take places and never had emotional meltdowns. \nUs boomers had parents that were WWII vets. They remembered the depression and many suffered real hardship. They weren’t sympathetic to us as kids. Many are casual about child abuse because that was their experience.",
            "As someone who was regularly beat with a police duty belt for almost a year (family rescued me) for the simplest of \"infractions\" (I got beat from my neck to my ankles with it because I changed out of my school uniform into regular \"nicer\" clothing for church on a Wednesday one time for example) I will absolutely say two things: 1- what most consider a spanking is absolutely abuse and doesn't teach the child anything other than fear, and 2- there is a VERY easy line to cross between punishment and abuse. And certain people will do and say anything to \"justify\" it. Abuse cannot be justified. \n\nI will also say that, since I was beaten regularly at the care givers place and my family rescued me, taking things away from me as punishment (because they refused to put hands on me due to abuse, not because they didn't believe in it) taught me ABSOLUTELY NOTHING other than patience and how to sneak or find ways around having things taken from me. \n\nCar keys taken from me? That's fine, I have friends who don't mind picking me up to hang out. Game system taken from me? That's fine, I have books to read and a tv to watch. Grounded to my room and only allowed out for school/food/bathroom? Okay, I go to bed far later than you do and as long as you don't wake up earlier than your routine bathroom trips, I'm fine. I'll go sit on the porch or something. Once I had everything (tv, phone, computer, car, grounded to my room) taken from me for two weeks and I said \"okay, just means you'll have to wake me up for school and take me there. Also means you'll have to remember my bed time. I've got books, I'll be okay.\"\n\nMaybe I was just a fluke? After having lived like I did with the caregiver, I was happy to be able to eat and drink what I want when I wanted within reason and to be able to dress how I wanted for school or home appropriately.",
            "My mother refuses to acknowledge the fact that she beat me as a child. When I have brought this up as adult, she gets pissy and says I am mking it up. Because she wasn't a fucking monster. Fucking Cunt.",
            "I was raised with 5 siblings not one of us were spanked. I have raised 4 children and not one of them were spanked.",
            "Most people that make comments like that aren’t laughing either. They’re dead serious. So sad thing is no he didn’t care if it was funny or not. The kid would’ve gotten a pow pow.",
            "As a victim of Boomer child abuse, I can tell you that my mother still wonders why I don’t call or visit anymore.",
            "\"They should just beat the autism out of him.\" - My mother-in-law about her nephew's autistic son.",
            "“If we aren’t abusing children they way we were hurt then are we even parenting?”\n\nGod, boomers are so weird",
            "My god why are the like this??? I have only ever been \"violent\" to a child once in my life and that was shoving him hard as I could out of the way of a cyclist who didn't see him and was going to hit him at serious speed (if I'd pulled him we'd both have ended up falling into a shallow river with large rocks in it). Jesus Christ I still get the shakes remembering how it felt, how small he was and how my strength effected his little harmless, light, self. Literally shaking now at the memory. And that was to save him getting hurt, and he wasn't hurt past being winded and was absolutely fine and hugged me, but god damn....To imagine actually using your superior strength on a child in anger...makes me feel queasy AF. ",
            "I was raised spare the rod spoil the child. But I definitely agree that teaching young ones respect and encouraging them to make good choices and helping them in life and guiding them will help them more in the long run. It just makes them scared to come to you if they fudge up and that’s not how they learn. You don’t grow with getting beatings, you become afraid of messing up or become the bully.",
            "Jfc. Kids who are young enough to still be in high chairs are clearly not old enough to understand corporal punishment. I grew up around a lot of old school boomers and my dustbowl age grandparents who definitely believed, \"spare the rod and spoil the child.\" \n\nEven *they* knew you don't hit high chair aged children. (FYI I'm fully against using corporal punishment on kids. Studies have shown it does much more harm than good. Just saying even the \"old school\" dummies I grew up around knew better than to discipline babies for crying.)",
            "My boomer parents believe that children having respect means they’re controlled and over powered. It makes me sad because it doesn’t have to be that way, but it seems like a generational thing heavily with boomers.",
            "Did the boomer respond at all or was the coward too scared to try and beat somebody who wasn't a child?",
            "Child of the 80’s here. I didn’t get “go pick you’re own switch” level of beatings, but a spank on the back of my calves if I properly stepped out of line (Me mam swears up and down it didn’t happen, not never once! “Ok Mum, I believe you…😉  🤥…”) was definitely a core memory. However times move on and my mum would rather stick her head in a pot of boiling water rather than physically discipline any of her five grandchildren. Kids shouldn’t be getting beaten… But it was the 80’s and shit was fucked ip then lol.",
            "There's merit to clear, felt consequences for deliberate behaviors, but I'm talking teens, not toddlers. There were only a couple of hills my wife and I would die on in terms of behavior and they were clearly communicated to our kids. \n\nDisrespect= Loss of privileges such as free time, cell phones, and things like that.  Did this a few times. \n\nDrinking and driving= Immediate loss of all driving privileges at a minimum.  Calling me drunk from a party?  Not a problem.  Maybe a weekend of chores.  Had to retrieve a kid. Once. (Actually, we found put through social media, retrieved the car and went to bed. The phone call the next morning was priceless: \"Um, do you have my car?\"  \"Yep. Call me when you're ready for a ride.\")\n\nSuspended from school= I'm taking the day off so we can work together from sunup to sun down. Then you owe me the cash value of my lost day. Never got my day of chores from either kid.\n\nUnfortunately, we did have give couple of swats early on but quickly abandoned that practice as cruel and ineffective. My wife and I were both raised in a spanking house and both resent it.",
            "Boomer here. Wasn't spanked. Didn't spank, except once (made my very headstrong son, aged 8 or 9, lie on the bed, while I smacked his little butt maybe once or twice), immediately called my mom and told my mom I could never smack that tiny little butt ever again and I felt awful. \n\nI swear, I think we could have been committing murder in the middle of the living room and neither of our parents would have ever hit us. \n\nMy dad once made my brother kneel on some rice and beans, though, for which I took complete advantage and teased him mercilessly about it. My brother was all boy,  so I'm sure whatever actually made my dad issue punishment must have been kind of egregious. \n\nThere was a big leather belt that hung on a nail and we were threatened with it often but it was never used. Didn't matter, the threat was often enough. You are actually very well behaved kids, according to our mom who was extremely lenient. I would never say any child should be hit!\n\nI read these stories and I'm always thinking, who the f* are these rude, crazy boomers?!",
            "If I had been there I wish I had had the presence of mind to think of something like \"My parent used to do that, untill I punched them in the face and broke their nose.\"",
            "Adult with my own child. I dont hit my kid like my parents hit me. People have commented on “parenting right” but the way they suggest, the way my parents did it, its the reason why I left the weekend after my 18th birthday and went no contact.",
            "A+ husbando.",
            "I have a 2.5 year old and after he had a particularly rough day (he's also my 2nd born and they tend to be extra stubborn or hard headed in general) my boomer uncle thought it would be a great time to tell me about the whooping he would've gotten from his parents if he had acted like my child when he was my sons age....the look on his face when I told him, \"I'm sorry but we aren't allowed to BEAT our children into acting right anymore, it's frowned upon.\"\n\nIDGAF if I offended his deceased parents or his upbringing. Child abuse is child abuse no matter what generation it happened in. Maybe we wouldn't have so many angry boomers walking around if they'd had better parents with a little more patience.",
            "As an adult just coming to terms with the reality that being hit as a child is abuse, I'm devastated and raging for that small version of me. What's just as bad is seeing verbal abuse of children, being yelled at, told they're stupid or ridiculous for what they're expressing, being told they're a waste of space or tjat thyrw too kuch trouble. I work in a school. It's hard to see. I'm now looking for a job literally anywhere else. I can't stand it. Emotional abuse of children is so normalised too. I look at the adults doing this and I wonder what happened to them as children to make this all seem like it's okay.",
            "My dad used to beat me with what he jokingly called \" the tickling stick\" which was essentially a rod of wood. That thing *hurt* and was used for every misbehaviour, even accidents.\n\nI moved out as soon as I could and as an adult went NC.",
            "I've seen autistic men become quite vocal about child abuse at varying ages. \n\n\nAn observation more than anything. \n\n\nYou dont know what goes on behind close doors.",
            "Being spanked is not abuse. Negative reinforcement sure, but not abuse.",
            "Go onto any parenting page, *especially* one promoting an anti-spanking view, and you'll find legions of boomers reminiscing about spanking their kids, and their own childhood spankings, with an almost sexual undertone to it. Like, they delighted in \"popping that little ass\" and how great it feels to beat a child into submission. I can picture a dirty old man typing these precious memories with one hand.",
            "Boomers couldn’t be bothered to actually teach children anything, so they used fear of physical violence to get their children to do as they wished.",
            "Business can't refuse letting someone use the bathroom. If it's pay only or employee it's against US law.",
            "I am more of an alternative disciplinary. At one point, I used to spank with the belt. I had a sit down with myself and then with my kids. We decidedly that exercise was better. It push up planks wall squats and situps.It was easier on their bodies, and it didn't involve yelling or physical discipline. \n\nFuck child abuse",
            "And they raised a bunch of crap people.",
            "Id say it was mostly boomers who abused kids",
            "And I would have followed up with \"People these days don't want to pay for the space they take up.\" load enough for the boomers to hear.",
            "I got spanked HARD, mouth washed out with soap, and once made to taste my own shit when I pooped my pants.\n\nMom claimed she was on some medication that made her crazy during that last incident, and at least she apologized for it many times, until the day she died.\n\nI don't wish any corporal punishment on ANY child, ever. That stuff was trauma-inducing.",
            "I was hit with a belt until I stopped crying. I feel emotionally stunted now (40m) and sometimes my relationships suffer for my lack of sensitivity but ask me to raise a hand to my children if I don't have to.",
            "Your husband is a legend!! What did they say/how did they react when he said that?",
            "If you get to hit a kid when they misbehave then the kid gets to hit you when you do the same! No child should ever be hit! That is someone’s inability to control their actions and emotions. BTW when kids get hit it is usually when there is a pissed off adult. Grew up in that world.",
            "We had a spot in the kitchen we had to go stand after we picked our own switch. Unless we did something in public. Our dad would be dragging us by the arm with one hand while jerking his belt off with the other. \n\nI fucking hate him still. I have never once struck my kids with anything and they were waaaay meaner than I was bc they weren’t terrorized.",
            "A bit of a smack on the ass never hurt anyone, show them whose boss early so they know what to do when they're running the country. That's what's wrong with lots of today's leaders, never got their asses kicked when they were kids. Trump never got his ass kicked,  Putin provably didn't either, Biden got his head kicked probably.\n...",
            "My dad had always been very clear with what sorts of straps he'd beat us with if we were gay.  Fun fact :  It was the same strap he used to beat us with \"weekly\" to \"whip the f\\*g out\".\n\nI hope you dearly enjoy your monthly bath in the cheapest gov funded home we could find \"dad\"",
            "Haha great memories of the bruise shaped like a Levi belt buckle and the diamond pattern of the braided electrical cord  being easy to make out on my leg just flooded back.",
            "I did a voluntary social year in which we had workshops once per month. One of these workshops was on child development, since a lot of us did something in education.\n\nMany of us were shocked when the lecturer elaborated that any form of physical punishment is child abuse and there have been numerous studies that concluded that \"even just\" spanking can often lead to lasting trauma.",
            "Omg!!! Spanking a child is not Child abuse at all and I’m not even a damn boomer. Y’all stop. My parents spanked me and I thank them everyday for it. It taught me respect, discipline and that when someone says don’t do it you listen. My daughter was spanked. Don’t say it is child abuse. Spare the Rod Spoil the child.  Kids not getting spankings and just doing that time out bs or gentle parenting is ridiculous. We will never change the way kids are disciplined in my family.   That’s what’s wrong with the newer generation kids didn’t get their butts beat as a child",
            "I explained to my father, as an adult, how terrified he made me when I was a child. He was confused and asked why, claiming, \"it's not like I hit you or anything.\"\n\nI reminded him of the belt he used on us almost daily, and how he left it in a common area where we would see the threat of it constantly. His response shocked me..... He said, \"well, I never used my HAND.\" THIS AH HAS CONVINCED HIMSELF THAT USING A WEAPON INSTEAD OF HIS BARE HAND MADE IT BETTER!\"\n\nWe haven't spoken since.",
            "My dad was like that - he’d get face to face with me (being like fucking 8-10) and scream in my face and drag me around by the arm or neck and hit me a few times, or threaten me with violence, all because I’d fuck up and spill something or make too much noise or just be in the wrong spot at the wrong time.\n\nI’ve made strides to move past it now I’m in my 20’s and living my own life, and I’m on good terms with my dad, but the recurring anxiety and fear and flashbacks it creates just can’t be worth it if the end goal was just making me be a more well behaved kid. It’s the most brainless, pigheaded, cruel fucking thing you can do to a child all for an outcome you can achieve just by teaching them to be respectful and talking to them. \n\nAll due credit to my dad, he’d never be so fucking brainless and callous to actually joke about it.",
            "As a millennial who was always smacked by her mother for just existing some days, I’m so glad your husband took the decision to stand up to the boomers ridiculous comment. \n\nI have a 2 year old and whilst he can be testing at times (as small children can be!) I’ve made it my absolute mission to not hit him. I remember how terrible being hit always made me feel. Until I was around 11 where a switch flicked and it didn’t bother me anymore, because I became apathetic, expecting of it. \n\nHow awful is that? So why would I want to do that to him? It’s a chain I’m really motivated to break. \n\nHopefully if he becomes a parent one day, he won’t feel the need to smack, because he never was. This is how my husband’s upbringing was and he’s never felt inclined to hit our son. \n\nHow I see it is, our son is upset or throwing a tantrum for a reason. Something is bothering HIM, so why would hitting him make the situation any better? And why should he learn that when something is upsetting him, he should expect a smack? Why would he trust me as his mother to help him with anything, if I smacked him? \n\nAwful comment from that man.",
            "I know it's not the point of the story, but ice cream shops are badly designed. Either I walk in front of other people to see what my options are or I wait until I'm at the front of the queue and then I'm wasting everyone's time because I need a few minutes to decide.",
            "When you reach Boomer age and your a male you will routinely seek some place to pee. Get ready, Secondly you absolutely overreacted to a basic off hand comment that shows your immaturity not theres. Additionally when you get older you will understand that seeing signs from a distance can be very hard. Especially in certain lighting or sunlit situations. Perhaps this isn’t a “ Boomer thing” its your inability to understand the aging process. Perhaps it’s time for you to grow up!",
            "Y'all sound very disrespectful as well.\nAssholes all around.",
            "As someone who works in a school, several children who have behavioral problems are also children who receive corporal punishment at home. 🤷",
            "My biggest regret as a parent is that I spanked my kids. I did only do one swat, but I believe it was still harmful.",
            "My mom (a very young Boomer who sometimes acts more like Gen X) told me she stopped spanking us when she realized she was more likely to do it based on her own bad day rather than our actions. I was the \"problem child\" (undiagnosed AuDHD) and she realized she was more likely to spank me because her tolerance was low than because I had actually done something to deserve it. She didn't let other adults spank us after that either. Ever since she shared that with me, I've paid more attention and realized how prevalent it really is. I've seen so many adults wig out and punish children who didn't seem to actually deserve it. The adults may feel like the kids deserve it in the moment, but usually the adults just wanted something done and were pissed it wasn't happening the way they wanted it.",
            "I'm someone who actually works in the prison system and your analysis at the end there is actually pretty accurate. A lot of victims unfortunately become perpetrators if they don't get the right intervention early or are surrounded by continual negative influences. That's not to say anyone can't commit a crime, or that EVERYONE who is a victim of abuse will continue the abuse, but it's an incredibly sad and common cycle.",
            "My dad is a therapist and has told me some stories of group sessions with former criminals and such, nothing with names or specifics because confidentiality, but his favourite story went like this.\n\nGreg: well I was beat as a kid and I turned out fine!\n\nTherapist: no Greg, you're an alcoholic with three felonies currently in court mandated therapy and rehabilitation. You didn't turn out fine",
            "I grew up with my dad beating the shit out of me because of stupid shit his tiny mind didn't agree with or couldn't comprehend.  My mom never felt the need to even yell at me because I just didn't argue or act out.  \n\nI have major anger problems but I told myself I would never be like him. So I do my absolute best to not give into the intrusive thoughts.   \n\nWhen my daughter was born in 2011 I was worried that I might have a moment where I just could not handle the situation.   3 years later and I've never spanked her or had to yell or discipline her once.  Well, she learned that I wouldn't give into my own rules like her mom does.  So she fucks with her mom because she can.   \n\nBut she is the nicest, sweetest, most empathetic girl I've ever seen. Blows my mind too because it all just came naturally to her, we never really had to teach her any of that.  \n\nTurns out I only ever want to smack other people's kids and not my own.  But that's mostly due to their shitty parents.\n\nedit: I don't know if it's relevant but my parents divorced when I was 2 and right after my little brother was born.  So my dad's side was abusive with his new wife and my moms side was for the most part nice and quiet with her new husband.  He was a good dude.",
            "It’s literally something judges will consider in sentencing as part of the explanation of the offender’s background. At least in Canada, if you were hit by your parents as a child it’s seen as a contributing factor to criminal offences as an adult and can be seen as a mitigating factor in sentencing.",
            "What floors me is, it took me spanking my son all of *once* to realize I felt absolutely horrible doing it, and never have since. They on the other hand, are obviously sociopaths, since they continued to spank me, and later fight me, without a shred of remorse",
            "If I slap my daughter all I’ll have ever taught her is that it’s okay for a man to hit her if she has done something he thinks is bad.",
            "As a Gen X, I got spanked and had my mouth washed out with soap. I always felt it was wrong and vowed never to do violence to my kids. My boomer dad said ‘just you wait—you’ll change your tune. \n\nI never did. My kids are awesome and well adjusted",
            "Thank you. It's incredibly disheartening when people say you *have* to get spanked in order to become a respectful person. I know I'm not perfect, no one is, but I try my best to be polite, respectful, considering, and I believe in working hard, and my parents didn't spank me. When people say I can't possibly be good if I wasn't spanked, I have to ask, what do they want me to do? I smack myself any time I think I did something wrong, but that doesn't seem to go over well, so I don't know what I *can* do to please them.",
            "My ex used to say how he was a kid that got his @ss beat and he was better for it. I was too soft on my son. Blah blah. I was like dude, you were selling weed in middle school. I don’t think you are an example that corporal punishment works.",
            "They equate fear with respect when they are not the same.\n\nGen X here, too.  I knew that I never wanted to be beat the way I was, heavy leather belts, orange hot wheels tracks, whatever inflicted the most pain, bruising, and sometimes the belt buckle would tear my skin.\n\nI read a lot on the subject before my son was born (1990). He was 4 months old when I realized he had my stubborn defiant nature. I kept researching. We used time outs, him or sometimes his toys would get put in time out. \n\nI know my cousins thought, \"Why doesn't she spank him?\"  Because respect is a 2 way street. I knew when I was a kid, nothing pissed off my mother more when she was beating me than for me to just smile at her while she did it.  I'd just Cheshire grin that shit knowing she'd beat me more just to piss her off.",
            "Yeah when this topic comes up, the pro-child-beating people always say, \"My parents hit me when I was a kid, and I turned out fine!\" and I always say \"Did you?  Or did you turn out to be a person who passionately advocates the beating of children?\"",
            "You have to teach it with modeling behavior, by doing it in front of them from an early age.  I did this with my son, never laid a hand on him.  Unfortunately, if the parents never learned it, they won't be able to do that unless they become self-aware, which is basically the antithesis of being a boomer.",
            "It's widely available information that people who are spanked as kids are more likely to go to jail, commit violent crimes, and end up in a physically abusive relationship (as the abuser or abused). Like been studied for decades, well proven, not something any professionals in the childhood development field try to refute. So the irony of them saying \"if you don't hit your kids they'll end up criminals in jail!\" is astounding.",
            "Apparently, spanking can have a similar effect to child's brain to being *sexually assaulted*. Turns out hitting your child as a punishment makes them more paranoid and prone to depression and anxiety later in life.\n\nhttps://www.gse.harvard.edu/ideas/usable-knowledge/21/04/effect-spanking-brain#:~:text=Perhaps%20surprisingly%2C%20says%20Cuartas%2C%20spanking,threatening%20experiences%20like%20sexual%20abuse.",
            "I'm Gen X and I was spanked as a child. And I have to say... I really like it now. I usually have to pay extra for it, though. Thanks, mom and dad.",
            "Spanking, slapping, tickling, pushing, shoving, constraining, etc etc, are all acts of physical violence.  Yelling and screaming at a child is a form of violence as well.  All that this teaches a child is that violence is an acceptable form to solving minor problems.  It's not.  However, it is utilized in certain sectors of society.  The police use violence.  The military uses violence.  Other parts of authority use accepted forms of violence.  These are all entities that boomers were taught to \"respect.\"\n\nThe most important thing to teach a child is critical thinking.  How to obtain information and use that information to make decisions.  While respect is important to understand, developing critical thinking is far more important.  There are many times when a person or entity is not deserving of respect.  Not everyone's feelings, property, beliefs, needs, or authority are deserving of respect, and there are many times when respecting these things is dangerous and harmful.",
            "Exactly this. Respect and empathy. But that requires teaching kids to understand their own feelings so that they can relate to the feelings of others. And boomers have zero emotional intelligence so our asses got beat instead.",
            "My favorite is \"Well I got hit as a child, and I turned out just fine!\"\n\nIf you're advocating for percussive maintenance on children, no, you in fact did turn out just fine.",
            "My brother told on me for something I didn't actually do. I was only 5 or 6 years old. He was 6 years older than me and was supposed to be babysitting so rather than ask me whether it happened they just believed him. \n\nMy dad told me that he was going to spank me the coming Saturday, So I had several days to think about it before the event. I remember when he spanked me it didn't even hurt but I started to cry anyway. \n\nMy sadistic fork of a dad apparently thought it was okay to play with a 6-year-old 's mind and let them stew about getting spanked days and days in advance.\n\nIt wasn't until I was over 50 that I realized just how screwed up that is. Thanks, Dad.",
            "Truth bomb. Thank you.",
            "Yeah, I got spanked.  It didn't rectify my behavior I just stopped talking to my dad when I left the house.",
            "same here, got my ass whooped all the time. thankfully my wife wasn't raised that way and helped me break the cycle with my kids. wasnt easy because it was all I knew but she stood firm and showed me a better way.",
            "same here, got my ass whooped all the time. thankfully my wife wasn't raised that way and helped me break the cycle with my kids. wasnt easy because it was all I knew but she stood firm and showed me a better way.",
            "My mom has never raised her hand to me, she's elder Gen x and I'm elder millennial; but she sure as hell taught me about respect, responsibility, and that no means no.  If no doesn't mean no when a kid is 2 or 3; then are you really surprised when they act out when no suddenly does mean no when they're older?   I was raised with expectations for behavior and if I did something I was supposed to do I was punished; just without violence.",
            "Yeah for my nephew all it really taught him was you hit people when they don't do what you want. He ended up punching a 3 year old in the stomach full force when he was 7.",
            "My wife and I adopted our son through a county entity, and as such had to go through a battery of parenting classes (something I'm convinced EVERYONE should have to do to become a parent now). They teach you how to parent without corporal punishment and it's damn effective (which is supported by data going back decades anyway). The hitting was never necessary. I don't fully blame the older generation as they didn't know what they didn't know. No one had taught them another way. But in 2024 if you are still hitting or threatening to hit your child you have no excuse. You are a selfish lazy monster. The boomers who wax nostalgic about corporal punishment don't want to admit what they did was wrong (even if they didn't know better at the time), so they keep trying to create an unsupported reality where their methods were better. It wasn't. It was just easier.",
            "Parenting well is really hard, every day. You know what isn’t hard? Hitting a child. If the world was more fair, a lot of people wouldn’t be allowed to be parents. It is an elite skill, and most people just aren’t cut out for it because they are still working their own shit out.",
            "As a Millenial who got my a$$ beat. I don't remember any of the reasons why, but I do remember gradually becoming more numb and defiant to authority figures.",
            "My grandma says this and it takes a lot for me to not point out she’s one son in prison for life, another son who doesn’t talk to her, a daughter who is addicted to pills, and the only daughter willing to care for her is distraught and only does it out of guilt but truly can’t stand her own mother. But, yeah, best your kids. Makes ‘em real nice.",
            "I think the difference is that the younger generations want “respect” as in courtesy, and Boomers want “respect” as in deference. \n\nSo they didn’t really care if someone could be polite and respectful, they wanted deferential and afraid.",
            "All academic research points to any form of physical punishment, including spanking, leading to worse outcomes for kids. There’s just no good reason to do it, but people perpetuate the abuse done to them.",
            "“You guys got smacked around and you’re total dickholes to everyone you deal with. I don’t want my kids turning out like you.”",
            "Exactly\n\nI spanked my child ONCE.  When she refused to leave the park and her baby sister was hurt; we needed to leave right then, and she was being stubborn",
            "Abuse (or punishment generally) isn’t “consequences,” it’s a power trip. Consequences are natural results of an action; other actions taken in response and labeled “consequences” don’t teach awareness of the harmful effects of actions, they teach that power hierarchies have the ability to hurt people as a perk of being on top.",
            "I was spanked as a child. It taught me not to get caught, not to behave.",
            "I never had that belief personally as I knew spanking never helped me in any way except teach me not to trust my parents/ be scared of them. I have very polite children who’ve been raised just like your niece. Teach respect by demonstrating it to children and treating them like actual people - what a novel concept to boomers.",
            "I have zero proof to offer but I’d be interested to know if the decades long decline in violent crime in the US that started in the 70’s/80’s can be in part, attributed to a decline in physical punishment/abuse in homes.",
            "Study after study has proven that spanking doesn’t work and long term makes the child’s misbehavior worse. Study after study has also proven that spanking hurts a child’s mental & emotional well being ….  well into adulthood. Yet parents keep saying spanking is necessary to raise children (& lots of churches support/advocate spanking.)",
            "I grew up similarly. I always made jokes about it because I didn’t think very many people even spanked their kids anymore. Yeah, I was 1000% wrong.",
            "“this hurts me more then it does you!”\n\nright.",
            "Most prisoners who committed violent crimes were spanked, the studies started in the 80s.  Spanking just teaches that violence solves problems, they learn violence instead of emotional regulation.",
            "Boomers tend to mistake fear for respect ",
            "My mum only ever hit me once (light smack on my bottom). That was after I ran out into the road as a car was coming. I'll be honest, I'd do the same thing and I see why she did what she did.",
            "Spanking is the lazy alternative to actual parenting. Why parent your kid when you can just teach them it’s ok to hit people when they’re angry?",
            "We knew before we had a kid that we’d never spank, but I love Dr. Becky’s reframing: if you messed up at work and your boss hit you, would you have more respect for them and want to work harder for them? Of *course* not.  \n\nBut people love to forget that kids are little humans and also deserve to be treated with respect and kindness.",
            "While I don’t believe spanking or the sort is the answer, just teaching them respect really doesn’t work.",
            "I didn’t smack my daughter for biting my breast, but I let out a high-pitched yelp (out of surprise, not to punish). She never bit me again.",
            "I wouldn’t leave them alone with her for a moment, honestly.",
            "Obviously they have forgotten their training. So, if they discipline your child then you simply need to * checks notes * beat their asses.\n\n\nEdit: typo",
            "My FIL's answer to our 2 year old biting once was to tell us bite her back . So you want us to teach her not to bite...by biting her ? Very logical.",
            "Smack an infant???? I can not with this generation",
            "Do not leave your child with them. Speaking from personal experince, I grew up in a country where children get corporal punishment both from parents and teachers. Even now as an adult I often ask my parents why they allowed random strangers to hit me. They didnt evene have an excuse and this has made me reconsider corporal punishment. Now maybe a parent can hit their child but not a random stranger and even other family members.",
            "Ugh, biting sucks! My kid is nearly 6 and I still remember how it felt lol.\n\nEasy tried and tested method to prevent biting: if your child bites you during the feed, put your little finger in the corner of their mouth and gently tug it. It will make your kid release the nip immediately and pull away slightly.\n\nDo it few times and they will quickly learn that biting is no good.",
            "Hmmm… maybe have a spray bottle handy to squirt her when she says silly stuff :)",
            "I too choose her husband.",
            "You can't, he's married.",
            "I want to adopt her husband. Every family needs someone like that, and while you might only be issued two parents, you can never have too many brothers!",
            "Hard plastic Goody hair brushes that were only like 6 inches long. She snapped the handles off smacking us with them.",
            "My parents too. They'd randomly bring up an incident at family lunch from mine (and my siblings') childhood where they dragged us out of bed during the night to line us up and scream in our faces, or they beat one of us with plastic piping because they'd had a bad day. And they'd laugh about it like \"hehehe wasn't that terrible! How funny was it when one of the kids was genuinely scared of being locked in the garden shed at night? Hehehe\"\n\nI was by far the child who received the most abuse from them and as an adult I'd ALWAYS politely point out how their behaviour met and surpassed the criteria for significant child abuse. And every damn time the reaction was the same shocked pikachu and \"well we tried our best!!1\". Even a couple of crocodile tears from my mother if I pushed the point. \n\nThe last time they repeated this little pattern was talking about an incident where she threw a knife at pre-teen me and i was only unhurt because I saw her reaching for it and bolted out of the house. That was the last time I saw them. My final words to them were \"ill probably never see you again\" \n\nIt's been at least 3 years, no contact. The instant i blocked their numbers i felt such a relief, like the little-girl-me who used to hide in the garden and wish she could run away, was saying **\"Finally I'm safe from those people\"**\n\nI don't know why it took me so long to end contact. I think it was a habit more than anything - that abusive cycle where somebody treats you like shit, apologises, love-bombs and you go back to being friends, and the cycle repeats again. But it's finished now and I am a way, way happier mother to my own kids now that I've drawn a line under their abuse and am healing, rather than being still stuck in the cycle \n\n[I'm so sorry this became a novel lmao]",
            "Our wooden spoon broke when dad hit it on the kitchen table because by that point we were old enough to figure out we could call CPS and they had already visited us before. \n\nThe spoon had my brother’s name written on it.",
            "Hey I had the same beating with a wooden yard stick till it broke when I was a kid from my dad, are we brother's?   /s\n\n Hopefully when those boomers end up alone in a nursing home they get a taste of there own medicine someday before they die.",
            "I still flinch whenever someone raises their hand a certain way (anyone, my partner, a stranger, coworker). My dad used to backhand me out of nowhere, in response to me doing or saying something he didn't like, even if it was something that was no big deal in the past. Today, I guess that joke isn't funny, it's offensive. Oh, today he doesn't approve of how I place things in the garbage can.",
            "I am so confused by what she could've meant by that, to me it sounds like she was telling you to get run over",
            "My mom always said that too.",
            "My mom's favorite sentence was, \"drop dead\"......\n\n\nI'm only just now understanding how messed up & hateful that was.",
            "Good on you for that reply! I'll certainly never forget the couple timed my mom said that to me. I desperately avoided confrontations so I always kept my mouth shut.\nThe things older generations will say to children are fuckin' wild.",
            "Ooof. My mom told me to “go play in the freeway” frequently and then would lock me out. I didn’t realize how messed up it was until my 30s. Where did these sayings come from?",
            "This or “that’s why your adult children never call”",
            "Or never…",
            "Here's the thing. The rod was meant to be used to gently nudge the sheep. Not hit them. They've completely misunderstood the entire purpose of the verse.",
            "many such cases",
            "Work in healthcare and I can confirm that many of them do and nobody visits.",
            "Yes, they really need therapy. Because that’s not how it works, if a boomer has experienced something traumatic (that obviously made them feel bad) they should try to avoid/ work against that for their kids etc. why do they want their kids to be just as traumatized as them?",
            "I'm 37. My dad spanked me precisely once when I was maybe 9.  He never did again cos he immediately realized how fucked it was.  Honestly the only reason I remember is because he carried that guilt.",
            "Children are not here to work for you. If you decide to have children it is your job to take care of them. Of course some chores are fine, but they’re no maids/cleaners. (With you I mean people like your mom)",
            "My parents are like your mom. It's so fucking weird to me. I always took it as \"they can't get out of parent mode\" and just be a grandma/pa. Everyone else I know spoils their grandkids, tries to sprinkle magic fairy dust over everything by making it easier/prettier/yummier etc.\n\nNot my parents. \n\nWhen my kids would go over to their house they were given chores to do. Like....do you really think your grandkids are gonna be fighting to come over when they remember they do chores and shit, at your house. My parents also wouldn't splurge, spend, decorate,  do anything different/special, say yes to anything, when my kids would come over. They thought it was time to parent/teach the children because they think my kids are getting spoiled and slack at my house (they're not). So my parents thought they would have to right the ship by trying to bring all the discipline, religion, responsibility, etc., they could, inside of a week visit.",
            "Lol. I particularly love how it was always our fault that my mom's house was dirty, but we've all been out for 12+ years and her house is filthier than mine, any day of the week and I have 2-7 young kids running around at any given time.",
            "Change it to \"abuse it out of them\" so they can't pretend they misunderstood you as agreeing with them. But absolutely call them out! ",
            "If they think you’re agreeing with them and say yes exactly. I would at: yeah that’s abuse not parenting",
            "There's this \"I suffered so you have to suffer too\" mentality with a lot of them. There's a lot of generational trauma worked into that and I think that we've decided to be the ones to break the cycle.",
            "They were raised that way. I was spanked by my teacher in 8th grade with a drilled wooden board.",
            "'No, asshole, they didn't hate the spoon. They hated you abusing them.'\n\nI'm glad your kiddo loves the kitchen cupboard without fear :)",
            "Not only is it abusive, but it’s actually a really stupid way of “disciplining” kids because it in no way resembles real-world consequences. If you mouth off to your boss in the office, for example, he’s not gonna hit you. The more likely consequence is that you’d be passed over for promotions. So how exactly is it preparing a kid for life when you teach them “if you misbehave, you get hit” instead of the more likely reality, which is “if you misbehave, you lose privileges”",
            "I kinda chuckle while telling other people things like this, but not bc I think it’s funny. I just feel like I’m gunna cry but laughing feels better.  Still fucked up tho",
            "What. In the actual. Fuckity. Fuck.",
            "A fenced in yard, or child abuse.  Choices...\n\n(/s, if not readily apparent.)",
            "And then when they’re 15 and it would be affective you’re smacking some teenager instead of talking about why? Which doesn’t make sense to me either.",
            "My mum has done the denying and ridiculous justifying too. Like you I was very small when it first began. It was physical violence and hitting by my Dad. At a different time, I asked my Mum why they never praised me. For anything. Her reply was that they didn’t want me to turn into a spoiled brat.",
            "Fuck corporal punishment, but you're overcorrecting if you can't give your kids any consequences",
            "Yeah sure,  blame the toddler. \n\nYou're 35 and a 4 year old is mouthy,  pushing a boundary,  or doing something they don't know is wrong.  You'r response is to beat them?  Who is the adult here?",
            "Holy shit. My eyes bugged out of my head reading this!!",
            "Alabama, too.  Basically, the shithole states",
            "Horrifying - so sorry this happened to you.",
            "I had a gf’s aunt (as a young boomer) telling both of us about how she tortured her THREE year old. I won’t give the full horrific details here. I later said to my gf “She should be in jail and you and the family need to intervene because that shit can’t even happen to a toddler again.” Standards were different in those days but you couldn’t just do stuff like that even then. And she happily said it out loud.",
            "My mom (cusp of Boomer/Gen X) was beat regularly by my grandpa as a child, his weapon of choice was the belt with his big old bronco belt buckle. She never ever hit us once, she is the unicorn that worked through her trauma and didn’t pass it on to us. I have a deep memory of one summer, my sibling and I were about 5 and 6ish, and pissed my grandpa off enough that he came after us with the belt. I will never forget my tiny 5 foot tall mother leaping onto his back and putting him in a chokehold. She took him all the way down to the floor. It was absolutely feral. She packed us into the car and took off in the next breath. \n\nWe didn’t see him for a while, and he never ever lifted a hand to us ever again. Totally cowed by his daughter. He was Santa Claus for the rest of his life.",
            "Yes they absolutely did, that's where the Boomers got it from. I know because I was raised by a Silent, my Oma. I have no resentment towards her but I certainly did get the wooden spoon!",
            "And that’s because they were even more abused by the generation before them. My uncle, of the silent generation, never recovered from the abuse he received. And yes, he said “he turned out fine.” An alcoholic, with a son who died prematurely after long term drug abuse. Yep, 10 out of 10 Uncle.",
            "My daughter is pretty good but the other night she was screaming and acting out. In past generations this would have seen as the perfect opportunity for her first spanking. I counter intuitively slipped her a small piece of chocolate as a reward for her “bad behaviour.” With the hunger and low blood sugar addressed, she calmed and sat quietly for a couple of minutes while her dinner was heated. Didn’t give us any trouble. If she’s crying I often encourage her to. When I tell her she has permission to cry she does it until bored with crying. That’s usually only 30-60 seconds.",
            "Wow! Your mom is proof that not all people of that generation are boomers. Please give her a hug from me and let her know that a growth mindset keeps us young. 💙",
            "I have a Boomer friend who is open about abusing her kids with the wooden spoon. Did it this century too. Coincidentally 40% of her kids are NC.",
            "This is what my mum does. I made her uncomfortable when I asked many years ago, why my Dad hit me so hard in a frenzy as a small child, and beyond. Her answer - “oh, Dazzle, you used to make your Dad *sooo* angry!” Oh, so my fault after all! \n\nHis last attempt was when I was 21, then I moved out, but I recently had a conversation with my younger brother, who’s 55. He told me he cried “no more, no more!” - then began to snarl it while he was being belted manically by my Dad when he was 14. And that was the last time my Dad hit him. He moved out at 19. I had no idea he was being punished like me too, as he was always the cute funny one. You bet that made this old bird cry. We’re both still traumatised by our upbringing.",
            ">I've got a Boomer coworker who loves to talk about how they didn't have \"made-up diseases\" like ADHD or autism when she was a kid\n\nSurvivorship bias. Is it too complicate concept for shitbag parents?",
            "Boomer definitely did. ",
            "“You get your liver spotted hands off my beautiful mother!”",
            "Mine (31), predominantly my mother(59) must be the exception. She struck me in the face when I was little, not a slap across the cheek. A full hand flat to the entire front of my face so hard my nose bled. She suddenly started bawling, hugging and “apologizing” to me, and I was crying because “why did I get hit?”, “what did I do?” She told me way later in life I said something she didn’t like, but that didn’t warrant striking a young child in the fucking face. \n\nMy step-father(58) was even used as a threat and spanked me too, he and her would scream/yell/bellow at me. My grandparents on both sides, save for the ones from my biological father also spanked me and caused me to be afraid of them (I hardly got to meet my bio-father’s parents until later in life, toxic mother was reason why). Hiding under tables to get away and trying to keep to myself in other rooms if possible.\n\nThis is only part of the reason I’m going no contact with my folks. My step-dad is an enabler and my mom is the narcissist. My poor sister(43), which our mom had her at 16, was treated way worse than I was by our mom and other family members. She suffered beatings I would never learn about till this year, she was treated like absolute shit by our mom, and when my sister went to live with her own biological dad. Our mom got royally pissed. The story is too long, TLDR: Narcissistic mother is causing herself to be completely isolated from her own children via her own toxic behaviors.\n\nNot all Gen-X are bad, but there are still plenty of toxic ones. Just like any group/collective, there will always be a bad apple somewhere. (Personal opinion).",
            "This might depend on local laws (e.g. Texas, Alabama). \n\nMaybe ask the museum if they have a policy/procedures on how they deal with violence on the premises and if that includes a section on how small children are treated by carers. Because it's distressing to others to see children being hit by adults while at the museum. \n\nYou might be able to make a change. Or start a movement of public institutions making public choices about 'acceptable behaviour on our premises'.",
            "listen, I would've done the same thing because how dare you try to take yourself out of this world when I went thru 9 months of hell to make you and however many hours of labor to birth you AND I'm trying to raise you into a decent human.. plus I LOVE YOU SO WTF!! I would lose my damn mind, my biggest fear IN THIS WORLD is losing one of my children. I would lose myself. flat out.",
            "You can go through hard shit and not think it's normal. In fact, good people stop bad cycles. Stop excusing abuse. What's next, you're going to say that we shouldn't be mad at pedophiles because they were abused as kids?",
            "Actually even the broken nose didn’t stop my dad. But it did make him take precautions, like removing his glasses and fetching the dog for a 2 on 1 before shit got violent again.",
            "I guess some went on to copy their parenting, and somehow justify it, the rest of us are just left with the trauma that therapy can kinda help with.",
            "I have a vague memory of my mother rubbing it in my face when I pooped myself at a young age. She of course denied it when I mentioned as a young adult, but if that's true why does it still haunt me now that I'm nearing 50.",
            "I've always believed that spanking was more of a coping mechanism for the parent rather than a tool for \"disciplining\" the child.",
            "Yup! My mom was 110% more likely to hit us if she was already having a bad day or in a mood. She actually just told my sister who’s expecting that she better smack her child too because she wasn’t going to have a spoiled grandchild. \n\nThere are so many cultures where hitting isn’t acceptable and their kids turned out fine. On top of which, we never learned a thing from being hit except to be scared/sneakier if we were going to do something to get in trouble.",
            "This is one reason why corporal punishment can easily become fatal. Parents beat their children based primarily on their own feelings, not because the child did anything wrong. The parent is so angry/agitated that they finally shake the baby, or punch the toddler in the face, and end up causing severe disability or death. I will never understand why parents are permitted to physically assault their children regularly, free of consequences.",
            "Spanking is an adult temper tantrum",
            "My mom didn't spank me much as she considered it a punishment for more extreme circumstances but definitely did punish me other ways and a lot of the times based more on her day than how I was actually acting. There were times I did something that wasn't  even bad and was usually considered normal in the household and somehow ended up getting yelled at and grounded for it",
            "I was the scapegoat as a kid and my parents believed in corporal punishment. When getting spanked one time at around age 8, I asked my mom how many swats I was going to get and she said she didn’t know but she was going to hit me until she felt better. Needless to say, I’ve never forgotten that and fully agree with you, it’s about the parent and not actually discipline the child or teaching them lifelong lessons.",
            ">  I was the \"problem child\" (undiagnosed AuDHD)\n\nMy parents branded me a \"liar\" when I was very small, because I would do chores, say I did the chore, but forget minor details also because of undiagnosed ADHD and being a little kid. \n\nAnd once I was a \"liar\" they felt they had free reign to crack down even more. My sister even got in on it, because she would throw me under the bus, and who would my parents believe, the liar or her?\n\nMaybe boomers aren't the generation of the worst parents in america but they're definitely the one that is most visible as the worst.\n\nFor bonus fun, I was homeschooled, which means every day my mom had was a bad day. And she would make my dad know about it when he got home, so he would also immediately have a bad day.\n\nI'm really not sure how bad I was as a kid because all I remember is being punished a lot and feeling strong sense of injustice and betrayal.",
            "Ugh, this. I was diagnosed with ADHD in college, and I strongly suspect that I have autism as well and so, so, SO many of the spankings I got as a kid were a result of me just forgetting to do things and then thinking I had. I would be so sure I had done something like feed the dog, and when my parents would prove that I hadn't I would get a spanking for lying. I wasn't deliberately lying, I was just remembering having fed the dog the day before and got confused, or thought I had brought something home from school when I hadn't, or accidently lost something, or refused to apologize because I didn't think I had done anything wrong.\n\nMy parents swore that I was a problem child too, when I was just scatterbrained and struggling to make my brain work in the way they wanted. It was a terrible way to grow up and really played a part in destroying my relationship with them.",
            "My mom has told me I missed a few spankings. I was the youngest so I didn’t get as many as my older siblings. I’m 30 now and she’s said that within the last year. She says that rather than admitting or acknowledging that she messed up or hear what I have to say.",
            "I realised this is why my mother spanked us or threatened us by getting The Spoon out of the drawer. It was her lack of control, not our bad behaviour. I was about 10, I think.",
            "My mom, also a boomer, shared similar sentiment. I got spanked when I was younger but there was definitely a point where it stopped happening. As an adult somehow the topic came up and my mom was like \"I stopped spanking you the day I realized I was doing it out of anger\"and expressed the sentiment of how was something done out of an inability to control her own emotions and feelings going to help teach me better control of my own?",
            "I love my mom dearly, but that sounds a lot like her. She's definitely one of the low-tolerance types. I've always said she should have never had kids because she didn't have the patience for it. She was worse with my sister since my sister had a behavioral disorder. Now though? \n\nMy sister will absolutely throw hands with anybody that pisses her off, but she won't even so much as raise her voice to her kids. Even our mom says Sis is a better mother than she ever was. Sis told me it's because she thought of the way we were raised and decided to do the opposite... Other than my niece having the same attitude as her mother, those are the two sweetest, and most well behaved kids I've ever seen.",
            "My mom once beat the sh1t out of me for the crime of wearing socks in the kitchen. She had been home from work a maximum of 4 minutes. Ain’t no way she wasn’t taking her bad day out on me.",
            "your mom sounds awesome!",
            "Very few things brings joy into a boomers life than beatin' their kids.",
            "My mom and I have talked about this a lot and it still aggravates the shit out of me, because she says it didn't work on me, but it worked on my brothers. \n\n\nShe apparently quit whooping me because 1: It flat didn't work, no behavior change at all 2: I told her that whoever was stronger and hit harder got to make the rules, and every day I grew taller and stronger while she grew older and weaker and the day was going to come that I got stronger than her and then I'd make the rules \n\n\nShe realized that because I was like, 4 or whatever, that's what I actually thought. I wasn't connecting it at all with my behavior being bad, which is why I didn't change my behavior. I had no idea how to avoid getting hit, or that it was even an option. I just thought whoever was bigger got to hit people and right now that was her. \n\n\nSo she apparently cried and quit with me.",
            "Amen!!",
            "Growing up I had a friend who's mom would spank them BEFORE they went out as a deterrent to acting up. She was total trash in many ways though.",
            "And we also learned that spanking does not always solve the problem of bad behavior.",
            "Your mom having that level of self-awareness and changing her behavior is miraculous to me. Glad she stopped",
            "1000% Kind of mind boggling that it takes people so long to realize this tbh. I realized it as a child when I was being spanked.",
            "I read a developmental psychology book for a class and it said there was a study done that determined that unemotional physical punishment for kids didn’t really harm them but emotionally-motivated physical punishment did harm children psychologically. No source sadly bc I don’t remember which book I read. Now, I still don’t believe in physical punishment for children, emotional or not but it was interesting. Every adult physically punishing a child I have seen/heard about though has always been an emotional reaction and definitely damaged the child, including a concerningly large percentage of my friends (they were on the receiving end and I can tell it didn’t do good things to their mental health)",
            "Didn’t get other adults after that?? WTF was happening before this revelation??",
            "Woah.\n\nYour mom is a good person.",
            "I was raised by silent gen grandmother, technically silent gen but more boomer mom, and boomer sister (she's 25 years older than me). \n\nWe got spanked. Granny used to use a wooden spatula. Mom used a chancla/flip flop. My sister just spanked.\n\nI was the fuck up, difficult, bad attitude kid of the seven of us. I remember one time I got in trouble for talking back to a teacher in 9th grade, so my mom decided to spank me, as a 14 year old. All it did was piss me off, made me hate her guts, sleep in class, and avoid coming home or being there when she was there. \n\nAfter that point, I started getting into much worse shit, but it wisened me to hide it and not go home when I got caught.\n\nA few years ago my psychiatrist finally convinced me to go to a trauma therapist where I was diagnosed with CPTSD. The big thing I realized is that my mom's emotional volatility alienated me from her and created a childhood of anxiety. Her attempt to discipline me by spanking me at 14 ensured an unhealthy and unhealable relationship. The CPTSD started well before that but is an iconic example of how boomers sucked at raising kids with mental and emotional problems. Often making those problems worse, if they weren't the cause of them.",
            "My in laws suffered like this. My husband’s grandparents used physical punishment on all the kids, especially the youngest two who we suspect have adhd. The reasoning “back then” was that you could beat it out of your kids (by back then, I mean the late 80s). All the aunts and uncles are traumatized to hell, even to this day, and the youngest two have had the most issues. They’ve both been to prison and can’t hold down normal jobs. Drug and alcohol use is rampant. So I would say that they didn’t successfully beat it out of them, they just added to the problems the kids were already dealing with. \n\nUnfortunately the aunts and uncles don’t think the physical abuse negatively impacted them, so they still use it on their kids from time to time, with the excuse of “I turned out fine.”  No, no you didn’t turn out fine. \n\nThe fact that people still justify hitting their kids is beyond me.",
            "My boomer dad stopped hitting me when I finally hit him back",
            "Incredible",
            "Honestly, as much as we joke about kids being absolutely unempathetic psychopaths, they really just don’t know social norms. Parenting is like 95% teaching them to be people in a society, and you absolutely can’t do that with fear and aggression. Or, more accurately, you CAN, but it’s going to screw them up along the way. \n\nForestalling the inevitable Boomer or bad parent meltdown about “I got spanked and I was fine,” or “I spanked my kids and they’re fine,” it’s not true. If you’re a parent that spanks because you got spanked, you turned into an abuser like your parents, you’re not fine. If you spanked your kids and they’re “fine”, they’re not. They just don’t tell you about all the ways they’re not fine because of your parenting because it’s exhausting to be gaslit about your own childhood. My parents think we have a warm, close relationship, when in reality I keep things superficial with them and have extremely strong boundaries.",
            "That sounds very progressive of Canada. Here in the States, “the why” isn’t really important… at all.",
            "This is fascinating. Do you have a source for this? I'm trying to find more information but all Google wants to give me is information on Canada's laws on corporal punishment of children and what types of punishment are illegal for courts to impose. I promise I'm not trying to pull a gotcha, I genuinely want to know more.",
            "Are you talking about the Gladue factors, specifically for indigenous folks? Otherwise, judges do already factor in the Accused's circumstances.",
            "This was me. My son also helped me by throwing gasoline on the guilt fire. I whacked him on his butt once when he was about 5. He turned around and asked me, with tears in his eyes, “do you feel better now mom?” He was completely serious—I’ve never seen a more empathetic kid. I wanted to crawl into a hole and die. \n\nHe was completely right—I was angry and took it out on him.",
            "this is how my dad felt about it, he swatted my ass once when i was too young to really remember it apparently, for trying to run out into the street. he didn’t lay hands on me again until I was 18 and we were both drunk. which, to be honest was about 50% my fault. I got a good one on him and he pushed my entire upper body through the drywall in our old house. we laugh about it 12 years on.",
            "THEY'RE SO FRAGILE! \n\nI'm a childfree pharmacist so I've never had a kid of my own, but treating other people's kids and just... fucking treating them make me realise how fragile they are.\n\nThey're not even mine.",
            "My dad didn't hit me for this reason, but that obviously didn't come to play for my brother. I honestly think that fucked me up more than if he had hit me because I adored my older brother and couldn't handle the guilt that he was hit all the time and I never was. And it affected our sibling relationship too. It's just sad that it all happened.",
            "I see our parents  had the same ideas about spanking.  Get the things that causes the most pain and injuries and beat until they couldn't swing anymore. I've experienced the hot wheel tracks they was #1 on that scale #2 was fishing rods but those led to longer or a second round because they would break and that was somehow my fault.",
            "I learned it by watching you!",
            "I've wondered if this would work on small children... I've done the same thing with my pets and it worked well lol",
            "That is how you teach puppies “bite inhibition”!",
            "Mine never bit my breast (me being a dad and all) but she did dig her nails into it. Accidentally at first, and then harder from fright when I yelled in pain. It’s unbelievable how much that shit hurts.",
            "I don't plan to. They say one thing and do another. It's always been the way.",
            "It's supposed to teach them that it hurts when they do that. Though if they're two years old, you should be able to explain that with words",
            "Not if they bite once. But I was a problem biter as a child. The ONLY way I stopped was when I tried to bite my sister, she put my own hand in my mouth, I didn’t know and proceeded to bite down hard. It hurt like hell. Never bit anyone again. My pediatrician had told my mom to bite me back. She couldn’t. I don’t think I would’ve learned any other way tho. Getting me to bite myself was brilliant on my sister’s part. She was probably real sick of getting bitten all the time!",
            "As much as I hate to agree with him, it can be an effective way to teach a toddler who really doesn't understand anything about the world that biting HURTS and that biting people has consequences. I would never go to it as a first response to a child biting one time, but for a child who just keeps biting, I might. It usually works.",
            "My mother had 3 kids. A girl, then a boy, then another girl. At one point, the boy (~3-4yo) went through a phase of thinking it was funny to bite his baby sister. And he would bite hard, leaving marks on the poor baby. The baby's cries didn't dissuade him, nor any tellings-off from his parents, and *eventually* my mother resorted to biting him back. \n\nHe cried a lot when she did, but he never bit his little sister again!",
            "I may have finally found some competition for the bear.",
            "It's a platonic love.",
            "[Woooosh](https://www.reddit.com/r/MuseumOfReddit/s/BtqgRxLU5T)",
            "My mom used to BRAG about all the wooden spoons and Avon hairbrushes she broke on my little sister's body.",
            "My Dad had a ping pong racquet. That never broke. He also would leave lumps on your head with his college ring.",
            "This! That f*ckin pink plastic handled goody hairbrush. I’m sure I’ve got scars on my legs and ass from that thing!",
            "I got the hair brushes too.",
            "For what it's worth, I'm proud of you for getting out and breaking the cycle. It's not easy!",
            ">an incident where she threw a knife at pre-teen me and i was only unhurt because I saw her reaching for it and bolted out of the house\n\n  \nHolly fuck. What would be her reply to cops had she slit open your neck arteries with that thing? \"well we tried our best!!1\"? It was definitely an anger-control problem, not the mean to discipline you.",
            "I’m glad you got away. Never go back. Not even if they pull Christmas cancer or dying. Laughing at throwing a knife at your child and beating a little girl with pvc pipe because you had a bad day. They’re monsters. \n\nChristmas cancer is when a narcissist tries to manipulate everyone by exaggerating or making up a possibility life threatening illness to get the focus back on them when their grown kids aren’t spending all of Christmas with them. Usually because the kids are visiting their partner's family or decided to have Christmas at home instead of traveling with small children. It became a short hand for all the manipulations abusers will try during their extinction burst (they realize you might never come back so they throw everything at you).",
            "OMG. I'm so sorry you went through that and so glad you're out. \n\nI swear they repeat those memories intentionally to cause more trauma. They know what they're doing. \n\nAnd you're right. It just becomes your normal and so you stay. I know I did for too long.",
            "Funny you should mention karma before they die. I watched my dad dying in hospital. Multiple organ failure ended in gangrene. Terribly painful, he had as much morphine as a human can receive and was still gasping in pain. \n\nI wasn’t thinking about our good times. I was thinking about my opportunity for revenge. Mentally listing all the whipping, choke-lifts, punches in the guts, setting the dog on me to rip up my legs, and other instances of abuse. “I just need to grab a toe to cause unbearable pain.”\n\nI didn’t. But if you’re dying and your 17yo son is thinking about how to slip in some torture before you die, you have probably made mistakes in life.",
            "It's a phrase people used to say more often to essentially mean, go eff off. But it's wild to say that to a child.",
            "I have no idea. She had major issues, though.",
            "Where did they even get the idea? I'm glad we both survived lol.",
            "Damn, that's harsh. I'm sorry she said that.",
            "My mom too. She's been gone 10 years. My kids are 26 and 22 and while I haven't always been the best mom, I was NEVER as emotionally abusive as my own mother was.",
            "I wish I knew where and when it started.",
            "TIL",
            "What you said about being therapy is true. \n\nFor some it's a coping mechanism.\n- my parents beat me\n- I need to believe my parents love me (kid survival need)\n- In self-defence I'll convince myself they're doing it because they love me and want the best for me, and this is part of showing care\n- I'm now an angry adult who is convinced beating a child is appropriate and doesn't know how to regulate my emotions\n- I beat my kids\n- my kids NOT beating my grandchildren challenges all of that and means - I harmed my children - my parents harmed me - if beating wasn't my parents showing they care, what was it? Did my parents love me? DOES NOT COMPUTE! REJECT IDEA!\n\nOthers just really don't like to be wrong and aren't able to self-reflect.",
            "My mum, despite all she went through, would never in her wildest dreams admit that she has trauma. Her behaviour, of course, belies that assumption, as she can be really horrible at times. Best I can get is now, in her 80s, that she is “triggered” by some things. Because she is so “strong” she figures her, and my father’s discipline, manipulation, cruelty, physical punishment and over reactions was just good parenting, as she simply “fights off” any bad memories of her own. \n\n*she did always admit that she hated hearing air-raid sirens, because of the war. Totally understandable, but then, so were plenty of other things she had to bear as a child. Talk about needing therapy.",
            "I was raised in a racist family and am the furthest thing from racist. How you were raised doesn't protect you from judgement and consequences. There is zero reason to strike a child, period.",
            "My teacher used a wooden ruler.",
            "My mother, late Silent Generation and oldest of 6, once told me of a conversation between her parents where my grandmother complained that her hand hurt from hitting the kids, so my grandfather suggested she go get a wooden board.\n\nSo, yes.",
            "I was raised in a family that spanked, drank, lashed out and called names, punched doors, abused each other. You know what I do? Smoke a little weed. How someone is raised has nothing to do with what they CHOOSE to do when they are an adult. Lots of adults grew up in violent homes and don't harm their children. It's not an excuse, because there is no excuse. At all. Adults can learn",
            "If you can reason with them, why would you hit them?\n\nIf they’re too young to understand reason, *why would you hit them?*",
            "At 15 it's also not effective - because that teenager will NOT agree that them being hit was appropriate. All it will do is make them hate you.",
            "Right?? I didn't even think my dad LIKED me until he passed away and I found some correspondences of how proud he was of me. WHAT IS WRONG WITH BOOMERS LOL",
            "Also why do these people think it’s OK to describe a CHILD as “spoiled”? It’s such a vile word and I won’t allow it in my house.",
            "i live in texas and i completely agree that it’s a shit hole. i absolutely hate it here and if i had the money to move, i absolutely would. it’s terrifying here and i’m not exaggerating😕",
            "Mississippi too! my childhood was filled with fear of teachers lol.",
            "Or, as my Baka called it - Vood-spoon\n\n“Don’t do dat or you vill get vood-spoon”",
            "My mom had a paddle in the wall with a bear on it with a rhyme / pun about how it's used on a bare bum with a little red toosh. It was like it was prideful. So weird.",
            "lol says Reddit , apparently",
            "Oh no, I’m so sorry you had to grow up like that. Yes there are still a lot of gen xers that continued on the abusive parenting. What I meant is that it’s not the majority of parents anymore as it was with the boomers. It has definitely gone down a lot. But there are always going to be terrible parents. Sadly.",
            "I love this idea. And I think the museum would be receptive to at least considering a behavior policy! Thank you for the inspiration!",
            "Oh no, that's pretty much what my dad said lol",
            "Understanding how something came about is not excusing it. I never said you should be fine with physical abuse. I didn’t excuse it.",
            "That they deny it makes it just that much worse.",
            "then you’ll be pleased, we’ll probably not pleased, to know that the science backs you up. smacking your kids is basically proven to be about control and getting out frustration as an adult and not about discipline.",
            "I'm a parenting coach (and a mom and grandma). You're absolutely right. And that's usually how I explain it to parents. It's basically because there are no adequate tools in their parenting toolbox so they do either what was done to them (programmed basically) or what's the easiest in the heat of the moment. So I work with them to help \"restock\" their toolbox with more respectful and loving discipline.",
            "It’s lazy parenting IMO",
            "Oh but “this hurts me more than it hurts you!”🙄",
            "My gf is a mother to a 6 year old. She doesn't believe in spanking. But she doesn't spank when her kid tries to hurt her. She just gives her kid a quick tap on the ass. Her reasoning for it is teaching the lesson of \"if you intentionally hurt someone, they'll likely hurt you back.\" A lesson she'd rather teach herself where she knows she isn't going to hurt the kid (she also gives the kid like 5 warnings that if they hurt her, they'll get a spank) rather than her kid learn that from another kid on the playground. To me, that all sounds reasonable. What doesn't sound reasonable to me is when the kid comes back from their father's and tells us he or his gf spanked them on their bare ass.",
            "When I was a young adult, around 20-22, I started doing some martial arts and got hurt. The sensei had a contact he recommended. I told my parents, whose insurance I was on, and checked with the office that the physical therapist took their insurance. I went about 7 times and was pretty much better over a couple months. Paid the copays, and thought I did a new adulting thing. My dad got a bill for $1,000 in the mail because it apparently was out of network. I was a very smart kid, literally top of every class because my mother would destroy me by saying stuff like \"it's great you got a 98, but what happened to those two points?\", so I was smart but I had NO idea about HMOs and stuff. It was never taught to me. I had no clue about it. My mom was just tearing into me as if I had purposely tried to burn the house down or something actually heinous even after I explained I had no idea, I would pay for it, etc. Like, I could under the anger and frustration if i was dismissive or downplayed that its only $1000 or something. I immediately said \"I don't get it. They told me they take it. Whats thw point of insurance? You mean i have to go to a doctor to tell me to go to a physical therapist when I know my shoulder is hurt? I'm sorry. I'll pay the $1,000\". but she just kept going on and on. Maybe I made her feel stupid for thinking my high school or college would teach me about insurance or something? Or all the times they never bothered telling me anything about how health insurance works they just took me to doctors and dentists without explanation. I straight up said how was I supposed to know anything? All I ever saw was them giving a card, paying $25-$50 and that was that. I was also spanked growing up as a kid, but feel that 95% of the time I'd say it was valid because we literally weren't listening, calming down and behaving (not as in being fussy, but just being for lack of a better word a little shit). But it may have been my mom was a shit person.\n\n\nAs an older adult, I'm now never shocked when stories come out about someone murdering their parents, spouses, etc. I sort of get it and wouldnt have blamed anyone.",
            "It definitely is.",
            "My GMIL (God sort of rest her soul) would nag me for not hitting my son and I explained that some people possibly use it as discipline, but most people - myself included - would only be doing it out of anger. She never laid off it through the end.",
            "It really is. Growing up, my mother and her family were fond of “I only hit you because I love you.” Talk about setting up a generation to accept abuse as love 🙄 the older I got, the more I thought about how none of the adults in my life would hit someone their own age and size for doing something they don’t like. Why do that to someone so much smaller and with likely less understanding of the world than you? Why is it ok to do that to a child, when it’s considered assault against another adult? They never have a good answer for that.",
            "My dad got slapped and spanked as a kid for discipline. My parents (according to my dad) made an oath to never lay a hand on me. \n\nWelp. Dad traveled for work. Mom slapped me across the face two times that I can remember as a very small child. I just remember crying for my dad and her getting even more upset, which I understand to an extent. \n\nI will always remember my mom smacking me across the face but I’ve never been able to recall *why* I was smacked. I think a lot of parents need to think about that.",
            "I hope your sister told her to fuck right off and that if she ever even attempts to hit her child that she will never see her or her grandchild again.",
            ">She actually just told my sister who’s expecting that she better smack her child too because she wasn’t going to have a spoiled grandchild. \n\nThat makes me so sad. I can't imagine my own grandmother wanting my parents to hit me.",
            "You’re right. It’s a proven fact that negative reinforcement doesn’t work.",
            "We used to get hit with hairbrushes and spatulas and whatever she could grab. Has never once admitted what she did was wrong.",
            "What are these cultures where spanking isn't acceptable?",
            "Well said, for those who don't know shaken baby syndrome is serious brain injury and can be fatal.",
            "Yep, and my old man is still throwing them at 60+",
            "My Boomer mom never spanked me, but if I got in trouble, she would give me 100% silent treatment for DAYS. I wasn't allowed to say anything to her. If I did, she either wouldn't respond at all and not make any eye contact, like I didn't exist, or if she did acknowledge my existence, she would just stare daggers at me. I wasn't allowed to leave my room except to go to school or the bathroom. When I needed to eat, I was allowed to make myself a bologna sandwich or PB&J, but I had to take it right back to my room. I wasn't allowed to be in the living room.  This would go on for days until she decided I was punished enough.   And any minor infraction could set her off. It was like she was looking for a reason to punish me to make herself feel better, which is what spanking does for these assholes too. I didn't see it as a form of abuse until I was fully grown with kids of my own and was finally seeing a therapist to work all this shit out with.",
            "Out of both parents and two kids, the only physical punishment was from my mom to me both times (I don't remember either time, I was a toddler for both). The first, she took her eyes off me for a second, and I ran straight into the road. She said I came about 12 inches from being splattered, and she just freaked and hit me while screaming at me to never ever go in the road. I didn't cross the street without holding an adult's hand until I was 6 or so. The second, I bit her nose and absolutely refused to let go, so after multiple attempts at begging, she popped me enough to startle me into letting go. Apparently I bit her hard enough to give her two black eyes from all the swelling. \n\nI feel like both of those situations were pretty forgivable. But both my parents were beat to hell for the most minor infractions, and they were dead set against repeating that with their own kids. Good thing, too, because my little brother was the BEST at pushing both their buttons.",
            "I'm sorry you went through that.",
            "Wow. That’s such a bizarre way of thinking. How could hitting your own child, repeatedly, make someone feel “better”? If I ever hit my kid, which I won’t ever do, but even if I believed spanking was the right way to punish a child, I would feel terrible no matter what. In fact, it’s one of the reasons I waited until my late 30s to have a kid. In my 20s, I thought spanking was necessary (because my parents said so) so I figured it would be better to have no children.",
            "Wow, that's absolutely heart-wrenching.",
            "YES exactly that!",
            "What a monster",
            "That happened to me when I was about 35. My mom went to swing on me and I hit her. I told her, I'm not going to put up with you doing this anymore. You want to hit me, I'm old enough to hit you back now.",
            "I was 14, a martial artist, and as gently as possible pinned my mother to the floor and told her I was not here to have done whatever it was she was attempting to punish me for, and I would let her back up the MOMENT she was ready to discuss why she was having such a bad day that she felt the need to beat me.  Never happened again.  Also Gen X.",
            "Ditto. I was 6 when I stabbed him with a fork. It was at that moment he realized that spanking me was *gasp* teaching me to be violent! Wow! Who could have ever predicted that?",
            "Same. Except we brawled. I had fingerprint bruises around my neck. But he never touched me again. \n\nAnd then I had kids and realized I’d fucking kill him if he ever touched them or looked at them wrong. So we don’t speak.",
            "Same with my mom (I’m a woman)",
            "Me too man, I was 14. He had been kicking my ass since I could remember.",
            "My boomer mom tried to strangle me because she caught me smoking.  I was 17 and I laughed in her face.  She never tried it again.  Fuck that shit.  I've never EVER even had the urge to raise my hand at my boys.  they're the most respectful, well behaved kids you could ever imagine.  Fuck Boomers and their constant abuse.",
            "I wish that worked for me. Instead my dad would call the cops talking about how I should respect my father like he respected his father. Because you’re just supposed to give all the due respect to someone who is literally telling you to kill yourself and how his life would be better without you. Like yes dad thanks for the depression I appreciate being treated like shit.",
            "It wasn’t so much hitting my mum back that stopped her (although people a block away would have heard the crack of the whip and her agonised screaming). It was the warning that this WAS a warning - next time the beating wouldn’t stop until she was dead. My dad learned much easier - just seeing the baseball bat cocked and ready to remove his head, ribcage, kidney or knee (he wouldn’t know in advance which body part he would have to live without) was enough. He didn’t need to be hit.",
            "Mine was a silent but the same. I told him if he ever put his hands on me again, I would end his life.",
            "1000%",
            "When my mom wonders why we’re not close “anymore “ - beetch we were never once in my life close…I was keeping things superficial or keeping quiet. We’ve never had a real relationship",
            "or even if they committed the crime.  More important that they are POC, immigrant, poor, and easily blamed for whatever crime.",
            "US courts do the same thing as Canada.  People who have been sentenced are interviewed by the judge concerning their background, and that is taken into consideration prior to sentencing.  This is part of the reason why sentencing for more serious crimes often occurs some time after conviction.\n\nThat being said, it's still the judge's decision whether to consider anything said in the interview, and as it's become more and more apparent, many judges are politically motivated, which hinders their ability to appropriately sentence convicts based on what they've learned.",
            "The sentencing provisions in the Criminal Code and case law. Each offender’s circumstances must be considered in sentencing. I’m on mat leave and don’t have any of that handy to cite at the moment. And none of this is legal advice lol.",
            "https://aboriginal.legalaid.bc.ca/courts-criminal-cases/gladue-rights",
            "People don't seem to know this, but as I said in another response, a person's background is considered in sentencing in the US as well.  Convicts often go through an interview with the judge prior to sentencing.  At least, that's part of the system.  Certain judges, I'm sure, don't adhere, but the practice is established.",
            "Not only for Indigenous people. Gladue factors include a lot more than whether you experienced violence as a child. But personal background and circumstances are relevant to sentencing for all offenders. How relevant depends on the case.",
            "OMG ![gif](emote|free_emotes_pack|scream)Well, did you, Mom!?? Did you feel better!??? I'm teasing you, but what a comeback. Poor baby heart. This actually made me tear up a little, because I was this kid, only it never stopped anyone.",
            "For sure, don’t hit boys either. I just say that because I only have a girl. I got hit as a kid and I don’t think it helped much.\n\nAlso don’t put soap in your kids mouth for swearing because that REALLY didn’t work for me. I swear a lot",
            "I'm sorry. My mom also had a rule that when my brother got into trouble, I was spanked because I was older. My brother was the softer, kinder, smell the roses person of us, I wonder why.",
            "Was just thinking the same thing...I foster and use the high pitch \"Yelp!\" to train them not to nip or bite. Works every time. \n\nBet it would work on babies.",
            "I found a loud “ouch!” and then pretending to cry made my kids react if they bit me during breastfeeding. Babies and toddlers understand a lot of facial and verbal cues very very early.",
            "I did something like this with my nephew. We were playing wrestling and he bit me. I yelped sat up and told him firmly I don’t like that don’t do that. He was about 2 at the time. My SIL texted after the fact to never speak to her son like that again. He never bit again though so I guess it worked.\n\n![gif](giphy|Nw8z2olm0nGHC)",
            "Kittens, too, though I learned that by accident.  Babies of any species just do not understand that sharp teeth cause pain.  They are not trying to hurt anyone.  My kitten was actually trying to give snuggle kisses.",
            "You can explain it with words, but if a 2yo thinks it's funny to bite, words are unlikely to stop them.",
            "I ❤️ (platonic) OP’s husband",
            "It's guy love between two guys.",
            "Efff those wooden spoons! I was smacked relentlessly as a kid with those. And a razor strap\nWent NC as an adult with No regret",
            "This would make me so heartbroken if my kids were afraid of utensils, they absolutely have the time of their lives digging through all the utensils in the utensil drawer, and pulling them out to play with. I find them everywhere and it makes me smile when I'm picking up the billion toys during the day.\nI don't remember a lot of my younger childhood because of abuse, but my sister says it was really bad and she always did her best to shield me from it. I feel guilty that at such a young age she was basically forced into being a parent because ours were too busy beating each other and having the cops called monthly.",
            "Cradling my tiny newborn daughter as I read this. Omg. I literally cannot imagine being that cruel to her",
            "ugh. so sorry y’all went through that!\n\nmy mom had a wooden spoon on which she drew a happy face on one side and a sad face on the other… you’ll easily guess which side she used to smack me. her mom used to beat her with whatever was closest - pans, lamps, utensils, you name it. my mom wasn’t as bad as her mom, and i don’t have kids, so the cycle’s fully broken now.",
            "The wooden spoon. Ugh. My mother used to say I should be grateful because she used to have to go out and pick her own switch off the tree. Ummm...okay? So because I didn't pick the weapon, the beating was somehow better??",
            "Sorry but your dad was a total bully AH.",
            "my dad used to use a ping pong racquet as well. he calls it the \"paddle of justice\"",
            "Pretty sure my left ass cheek still has a logo.",
            "Truth statement I'm here to believe it's real when most never could dream the truth",
            "Very well described!!",
            "I agree. I was giving the context for that time when spankings were endorsed even by the public school system.",
            "Exactly what I thought too! It doesn’t make any sense!",
            "I didn’t mean it’s effective as in it works, more of they can recognize the connection to the punishment",
            "You're most welcome! I'm now considering what I can do in my area with our institutions.\n\nLet's have at them! :)",
            "I once told my boomer mother that using a wooden spoon on my nephews who she was babysitting did no good. \"Well it makes ME feel better.\" OK, hurting someone to make yourself feel better is abuse.",
            "It's also proven that it creates violent criminals.  Teaching a kid that violence solves problems is not a great way to raise kids.",
            "I’ve never thought of it like that but it makes perfect sense. If they were REALLY concerned about effective discipline, why do they get so defensive about spanking etc instead of just accepting there’s a better way and we know that now?",
            "Thank you for your work! I can't imagine it's easy, but people like you are leading the way to the future.",
            "youre doing a wonderful service 🫶🏼 thank you",
            "“Children’s behavior is their best attempt to have their needs met” was a really profound message that I read after my kids were grown. I now apply it to all people regardless of age. I grew up in an abusive house but I can see how it was my parents best attempt at meeting their regulation needs. (Poorly and unsuccessfully) I am not making excuses for any sort of abuse but understanding why something happens really helps me move forward.",
            "That’s fascinating, I didn’t know this was a thing. Are parenting coaches widespread?\n\nI ask because I raise my voice to my 3 year old *way* more than I want to and I know it’s definitely because I’m tired and stressed. I hate it. She’s a great kid, she’s just 3.",
            "It's been so difficult to learn a different way of parenting than my parents used.  They did the best they could, but spanking was prevalent and, looking back, it happened when my mom was stressed & at her limit.",
            "I agree. Additionally, I believe that violence has no place in a loving relationship.\n\nYou don't teach a child that it's okay to hit someone you love, or for someone they love to hit them.",
            "Lazy caveman parenting\n\noops fixed it",
            "It's bad parenting.  It is not effective and is much more then not (like 95% more) just abusive.",
            "It really is.  Good parenting isn't a lot of work but it requires a constant consistent effort.  I haven't spanked my kid and the only time I yelled at her was to get her attention that there was a car coming on a street.  My kid has spent time writing stories related to topics she needs to understand better for better behavior.   She sometimes gets fussy but usually it is that she is hungry or tired and coupled with being a teenager.  My wife is different but a lot of times when she is fussy and acts out,  it isn't personal.   There is just a lot of emotions going on at that age and I just have to wait it out until she settles down.   I don't really understand why so many parents take what a teenager says personally when they are not even a fully formed adult.",
            "It is 100% laziness. What does it teach a child except violence belongs in a \"loving\" relationship. If people can't parent without violence they shouldn't have kids.",
            "🎯🎯🎯🎯🎯🎯🎯",
            "Uninformed in case you haven’t read the other comments. Before the internet we only had family to help navigate at least that is how it was for me. When my daughter was 4 I realized spanking only made it worse. I didn’t spank my son. My daughter is mad I didn’t spank him instead of being mad I didn’t know sooner. I was also a child bride and 15 when I was pregnant. I also had cancer. Life isn’t always black and white.",
            "Can't wait to say that back to my mom after whoring her out to abusive clients.  I'll force her to marry the one she hates most and I'll hire escorts for her husband to use at the reception.",
            "Well she has to live with mom for a bit, so she was more diplomatic but still firm",
            "My grandmother (mom’s mom) did occasionally cuff her kids upside the head, but didn’t like beat them or anything. Mom’s dad used a belt though. But he was dead before she was done highschool. Her logic is “I don’t use a belt so it’s fine/necessary to use corporal punishment”.",
            "https://images.app.goo.gl/QsmhdtnHo6CQkVq59\n\n\nNegative reinforcement and punishment are not the same thing. This may help if anyone is wondering.",
            "Negative reinforcement (taking something away) works just fine. \n\nHitting is not negative reinforcement. It's just violence.",
            "Shoes and hangers for me. She believed she should never use her hand because a mother’s hands should be used for nurturing, not pain. The irony of using her hand to wield a much more painful instrument was totally lost on her. \n\nI don’t *entirely* fault my mother, because she was in a cult and was absolutely a victim of the conditioning. But becoming a parent made it way, way harder for me to understand some of the choices she made raising my siblings and me. \n\nBecoming a parent made it basically impossible for me to accept the Boomer “that child needs to go cut a switch” approach to children’s behavior, too.",
            "[link one:](https://en.m.wikipedia.org/wiki/Corporal_punishment#:~:text=Researchers%20who%20have%20lived%20among,of%20children%20in%20those%20cultures)\n\n[link two](https://www.reddit.com/r/AskAnthropology/comments/15kmv7p/what_are_the_nationscommunities_where_physical/)\n\nhttps://preview.redd.it/i8ojy6lf938d1.jpeg?width=750&format=pjpg&auto=webp&s=5c15c4065bbd8b085a202e8b75e5fdc91dc7995f",
            "My dad ignored me for an entire month when I got into a car accident when I was 17. All it did was give me anxiety. It actually made me so miserable that I ended up having a panic attack when I got into a car accident years later so my mum and I agreed to keep it a secret.",
            "That's horrible.",
            "Thanks, friend. It gave me a good idea of the kind of values I wouldn’t have as an adult.",
            "You sound like a great person. Your child is lucky to have you!",
            "My MiL told me my parents weren’t abusive, I just didn’t behave well and I don’t appreciate what they did for me.\n\nI asked her if that meant it was acceptable for me to call her a poisonous little b!tch and a f&cking c&nt before backhanding her across the face the next time she forgot to scoop her cat box. \n\nAfter all. If that’s an appropriate reaction from an adult to a child, obviously it’s also acceptable between adults.\n\nShe sputtered a few moments, then said she wasn’t comfortable discussing it anymore\n\n🤔",
            "When I was in college I caught my mom's hand when she was about to slap me in the face, she never tried it again, that moment is now a core memory in my head.",
            "I was 19. My mother raised her hand to slap me & I said \"Go ahead & see what happens. I'm bigger than you now.\" & she immediately burst into tears & put on her patented \"Woe is me! I'm the worst mother in the world!\" routine.\n\nI fell for it then but eventually smartened up. NC for going on 6yrs & it's been awesome. 👍",
            "This should've ended long before  you were 35. Something is not right here.",
            "Also a martial artist, and unfortunately my dad had a mean streak when he drank. As a child I had stuff thrown at me, my toys smashed in front of me and a host of other shit that isn’t necessarily to rehash. He went on a bender and I was 14. He pulled the throw shit trick, I ducked and lunged at him. Took him down as gently as I could and we had a heart to heart chat, that was one sided. That one side being mine.",
            "Me too",
            "Did you ever quit smoking ?",
            "Oof. I grew up with my dad telling me that I'm a fucking little bitch every day. Now they wonder why I don't want to hang out with them, lol.",
            "That helps, thanks! And I'm way down in the middle of the US, so if I ever need actual legal advice on the Canadian criminal justice system I have really messed up 😂",
            "Interesting, thank you!",
            "Yes, Gladue is a lot more than child abuse. I guess I was confused because I can't imagine a judge NOT taking someone's circumstances into consideration, like a commenter from the US stated (I'm Canadian). I figured that was the standard",
            "I’m just glad I was self-aware enough at that point to realize he was right. A 5-year-old baby was wise enough to knock some sense into his mom. I’m grateful for that. \n\nIf I had said that to my dad,  I’d have just gotten another lick with the belt.",
            "It only works if they don't find the noise funny and try to get you to repeat it...\n\nAlso, babies and tods apparently don't have the ability to truly be remorseful or guilty yet. You can give rules to be followed, lead by example, and guide them on what to do, if course. However, asking them to be sorry or modify their behaviour based on empathy rarely works well that young.\n\nApparently 3-7 is when they develop guilt and 4-7 for remorse. So teaching them to say sorry apparently gets misinterpreted in their minds as a thing you do to make it OK to ______ (hit, bite, whatever). \n\nWe are working on stopping my toddler hitting... she thinks it's OK if she apologizes, so we did a bit of research on it. It's not easy!",
            "Same!! It worked amazingly on both my cats and dog. I was really surprised by how inhibited my cats are when they know it's my bare hand. When my hand is under the bedsheets, however, it becomes prey again lol",
            "Tbh, babies’ brains are not as developed as puppies at that point in development. They’re JUST starting to understand cause and effect, like throwing a toy and you pick it up and they throw it again, but mouth movements are less conscious because they can’t see it. \n\nAdd in the biting is a movement done *inside* another, more instinctual (ish) activity that they been doing for months. I just don’t think they associate the adults sounds with biting at that age well enough to modify a habit.",
            "I 🫀OP’s husband",
            "As a gay woman, I too platonically love OP’s husband",
            "![gif](giphy|XgMglYOjBQYCc)",
            "Good for you, I'm NC as well.  For the LONGEST time as an adult, I would subconsciously tense up and get nervous if a kitchen drawer of utensils was opened too fast because my mom used to jerk it open as forcefully as she could to make it more scary before hitting me over and over on my bare skin.  That, and the sound of someone stomping, she'd also walk as hard as she could coming after me because that also made it scarier.  \n\nI'm in my 30s and only recently stopped having that reaction to those sounds.",
            "Yep. I'm nearly 50 and to this day I refuse to have wooden spoons in my kitchen, because I can't look at one without remembering.",
            "I wonder if the strop is as bad as the mini blind rod?",
            "Same. I have a two year old boy who loves anything stick-like. Utensils, paint brushes, toothbrushes, etc. He has high sensory needs and it gets tough sometimes. But never so tough that I would hit him",
            "Congratulations! ✨️🫶✨️💐\n\nAnd you never will, because you'll make loving and thoughtful decisions and find better ways.",
            "Straight up admitted it, bold.",
            "You already know it’s abuse because if you do that to someone else’s kid or to another adult they’re calling the police.  But because it’s a child related to them, they feel entitled to hit them with a wooden spoon. I would legit be like “so if I’m having a bad day I can beat you with a spoon?”",
            "It's definitely challenging trying to help people relearn generations of deep seated toxic parenting, not gonna lie lol",
            "Thanks 😊",
            "This is so true. Another phrase I like is \"All behavior is communication.\"",
            "I honestly don't know. I became one because I was forced to confront my parenting (I was a yeller and angry a lot) and eventually realized it was because I was exhausted, emotionally dysregulated and at the time, undiagnosed with ADHD-combined, complex PTSD with dissociation and autism. \n\nOnce I started antidepressants, therapy, mindfulness practices and researching better parenting strategies, I realized I was the only person I can control and change before helping anyone else. \n\nEdited to add: I saw that many other parents could benefit from my experience and knowledge so I help other parents and caregivers.\n\nI highly recommend working on deep breathing exercises, and learning to stop, breathe and think before you react to your child.\n\nA book called \"How to Talk so Little Kids Will Listen and Listen so Little Kids Will Talk\" is a great resource. So is \"No Drama Discipline.\"",
            "Yes, it's extremely difficult. I had to relearn too and that's what led me to want to help others.",
            "My mom forced me to tell her I knew she loved me every time she spanked me, and I think that’s partially the reason i stayed with my ex girlfriend for a long time after she slapped me. Spanking only teaches children that abuse is normal and gives them distorted ideas of a healthy relationship",
            "You hurt the ones you love. Wrong!!",
            "Cavemab sounds like a new chemo drug",
            "I don’t know why so many parents take what children say so personally - like M’am if you’re flying into a rage over a 6 year old “disrespecting” you, you have some serious issues to resolve & probably never should’ve had a child.",
            "My mom and dad were the same way.\n\nI'm settling in with the idea of never having kids, so unless something drastic changes, they can find their own grandkids elsewhere.",
            "Saving this.",
            "Hitting is actually POSITIVE (adding something) PUNISHMENT (reduction in behavior). If we want to get precise. It is the LEAST effective type of \"reinforcement\" in both classic and operative conditioning, and the behavior change that does occur is very easy to extinguish.  I.e. if you spank a child for doing something they will stop...when you are around.  But the minute they can get away with it, they will do it. \n\nIt also \"teaches\" the things you do not want to- like that violence is appropriate way to manage emotions, that being hypervigilent and managing adult feeling is an essential survival skill, etc.",
            "Oh I forgot about hangers. Those hurt. I don’t entirely blame mine either. She grew up in a very abusive home. And I agree, having kids made it that much more obvious how poorly I was parented. Very neglectful. My husband and I do not raise our kids like we were raised. Not even close.",
            "But she sure was comfortable telling you how to feel about your own trauma. She only stopped being comfortable discussing it when she got pushback for her victim blaming.\n\nYou're uncomfortable because you know hitting kids is not right and still refuse to act in accordance with that reality. Call them on it. They DO know better but want the simplistic answer of hitting kids to be true anyway because it doesn't require engaging with them on an emotional level.",
            "r/traumatizethemback",
            "Wow I'm sorry",
            "Same. I'm no contact. I don't even plan on going to her funeral.",
            "Oh I know, I'm no contact with her now.",
            "Well funny enough that wasn't my primary form of nicotine anyway.  I still stopped smoking recreationally back in my 20s, but I chewed snuff from the age of 15 all the way until 4 years ago, when I was 43.",
            "Why is that a relevant reply to an anecdote about child abuse?",
            "I absolutely understand, and I am beyond words proud of you.",
            "I was moreso thinking it was an \"action-reaction\" effect.... sort of like negative reinforcement, without having to hurt anyone.\n\nWith training dogs, I yelp and the game stops, so doggy learns that I have been impacted by something and it's not funny cuz now we're not playing (I'm not giving them positive or negative attention, I'm just moving away).\n\nSo maybe with very young children, it could indirectly show that their actions have consequences. More age appropriate than trying to teach them why hitting is wrong when they are only just learning how to control their own limbs lol. \n\nI agree that it's too much to expect toddlers to express remorse or guilt. Hitting, kicking, biting; all those are totally age appropriate reactions for toddlers. Easier to teach a toddler to have gentle hands and redirect those physical urges towards something more appropriate (maybe throw a ball outside or push toy cars into building blocks) than it is to teach then a lesson by punishing them for biting or hitting and then expecting them to feel remorse and reflect on it.\n\nThey are babies, so we take baby steps with them^^ I think as adults we gotta re-learn how to do that sometimes lol.",
            "If initial yelp doesn't work, a moment of separation will.  If you constantly love on your kid, a moment of withdrawal is more powerful than a thousand swats.",
            "My baby was 11mon when she clicked understood that others feel pain and that it’s wrong. Completely changed her life. I used to be terrified of her being near pets or younger babies. Now at 21m she’s effectively an assistant carer for the baby in her daycare.",
            "My previous partner couldn't deal with the sound of digging through a drawer like that because his (adopted within the family) mom would use a wooden spoon him, among other things, and he still refused to believe until the day he died that they were abusive and that it got worse when they had a daughter when he was in 2nd grade. He could barely remember 2nd grade, just that that's when he found out he was adopted, but sure, they treated him great, he was the problem child 🙄 \n\nHe was a proponent for corporal punishment because he got it and turned it fine (read-- overly anxious with major abandonment issues and an inability to have serious disagreements with someone, major temper control issues, and avoidance of conflict until he exploded) and learned. When I asked if he learned not to do the thing or just to be sneakier about not getting caught, he usually changed the subject.",
            "I have the same reaction from jerking a belt through the belt loops on a pair of pants. That’s what my father would do before beating me with his belt.\n\nAs a newlywed, my husband made the same sound before pitching his pants into the laundry hamper. He nearly had to peel me off the bedroom ceiling. He still knew very little about my dark history, and looked so sad when I explained.\n\nBig hugs 🥰 to both of us.",
            "Omg the stomping. Joining in the ptsd stream, I freak out whenever my partner SIGHS. Poor them, it’s been 20 years, including trauma therapy. Sighing must have meant we were in for it.",
            "I had to ask my husband to stop pulling his belt out of the straps around me because I instantly feel sick & freeze up because it brings me back to the sound of my dad pulling his belt off to beat me with it. Almost 50 & it still triggers me.",
            "Fuck those things. That was my dad's implement of choice along with a long azalea branch.",
            "I had forgotten those cheap ass mini blinds with that thin, whippy, twisting handle to adjust the slats open or closed. Yeah, that thing -hurt-. I don't know about a razor strop (we didn't have one of those) but the plastic mini blind stick thing hurt -at least- as bad as the belt except the belt meant I was going to have to count them out and we started over if I crying too hard to count or if I struggled \"too much\". So the belt tended to last longer. \n\n The plastic rod was usually sort of the result of immediate explosive improvisational abuse. Sudden, fast, overwhelming and stunning but over quicker at least with my abuser.",
            "My parents would say, \"this hurts me more than it hurts you\" \"you left me no choice\" and then make us hug them afterwards 🙄\nIt definitely makes it hard to separate love from abuse and I'm sorry that it caused you to tolerate an abusive relationship",
            "Wow that is fucked up.",
            "Damn, I’m sorry that happened, that’s so unhinged. I hope you’re free from creeps and jerks",
            "Do we have the same egg donor?!",
            "Now that was abuse, plain and simple.",
            "Oof.  Yep that’s what I learned. Still can’t stop being hypervigilant & feeling responsible for everyone’s emotional state",
            "Funny thing?\n\nShe and her husband never laid a hand on their own children. “It was never necessary! They were good kids!”\n\nF&ck off Arlene 🙄",
            "I can tell her that I support her comment but was still curious if she had quit smoking",
            "I was looking for this, I'm pregnant with my first.\nI've had plenty of dogs and cats and the yelp always works, but I knew it wouldn't always work with a baby/toddler, but I always feel bad at the idea of getting her unlatched after a nip and giving her a bottle instead. But it seems like the most reasonable bit if I want to keep being able to breastfeed.\n\nI had friends just switch to using nipple shields, and it never seemed to stop their babies from nipping/biting.",
            "My husband changes in our closet because I would wince at the sound. I wasn’t even the one getting beat.",
            "I’ve never been welted, blistered, and bruised like the curtain rod",
            "Ugh my parents said the same thing. And thanks for the kind words. Spankings weren’t the worst thing they did so it’s alright ig?",
            "Ugh. Thanks for the core memories flash back. So gross. And now they continue to expect/ demand a “good” relationship with their grown children",
            "It did hurt my custodial mother, for she was handicapped from RA and it did hurt her more. So when my brother and I were 9 and 8, we got no more spankings, we got the lectures and the look from the mother eye.",
            "Arlene sounds like every suburban mom who's nice to your face but a raging gossipy cunt in reality.",
            "Arlene probably smoked in the house",
            "As the non breast feeding partner, I can only comment on the post-infancy interventions. My wife did let out a few loud yelps during that time.",
            "Pretty close 🤣 Just swap the suburb for a tiny town where everyone is all up in everyone else’s business",
            "Nonsmoker actually. She is, however, a very opinionated and nosy PITA who insists millenials and younger are just lazy and complaining and things aren’t as bad and yada yada",
            "Had to be one of the two!!!",
            "Has she ever worked 12 hour shifts"
        ]
    },
    "How’s that going? ": {
        "title": "How’s that going? ",
        "score": 4417,
        "url": "https://i.redd.it/g6jynb0srx7d1.jpeg",
        "content": "",
        "num_comments": 272,
        "comments": [
            "Remember to report submissions that violate the rules! Harassment and encouraging violence are not allowed.\n\nEnjoying the subreddit? Consider joining our discord server: https://discord.gg/v8z8jNwJs6\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BoomersBeingFools) if you have any questions or concerns.*",
            "I called my boomer mother late one night bc I was having problems with my partner & didn’t want to go home. Asked to stay the night. One night. Flat out refused. Told me the bed in the spare room was brand new, the couch wasn’t for sleeping & the floor was a no go. “Call your father.” One day I’m going to say “call my father” & hang up. She can rot",
            "The mother probably doesn't remember telling her daughter that. If she did, she'd still deny it.",
            "I work for a homeless hotline.  Get a lot of calls from kids who have just turned 18 and their parents tell them to leave the day after their birthday.  They have no place to go (because they're 18 and usually still in high school), and are looking for a shelter to stay at.",
            "I love it when Boomers realize they no longer have any power over someone, they lose their absolute minds",
            "My mother did that when I would NOT give her some of my college grant money! \n\nShe then tried to move in with me and my roommates once her boyfriend kicked her out of his apartment when she wouldn't give him ALL of her paychecks.",
            "These type of people have been an issue to our country as a whole for their whole life. Just die already.",
            "\"We need to combine our resources to survive!\"\n\n-my dad, soon as I got a salary job with a degree he told me not to waste time getting.",
            "Has she tried pulling up her bootstraps?\n\n![gif](giphy|dC9DTdqPmRnlS|downsized)",
            "As long as I have a house , my children have a safe place to go to . No matter their age .  I’m not going to condone them being just lazy and refusing to grow up . But life is rough and circumstances happen to everyone and if I can provide a safe place for my children , I’m doing what I’m supposed to .",
            "This happened to me. Wouldn’t even let boomer mother come by my house to visit. Showed her!",
            "Yep karma's a bitch 😁",
            "This is full on Reddit Recurssion.\n\nThis was a reddit [AITA post](https://www.reddit.com/r/AmItheAsshole/s/BQt9wu8EEi), then it got picked up by media that trawls reddit, then it got picked up by someone who reads headlines, but doesn't find the original sources.  Then it got crossposted.\n\nDo we need to get someone to post an article about how much of the internet is stealing from other content platforms, which then gets posted to Reddit, which.....",
            "I got to stay as long as I needed. I just had to pay half the mortgage, have my mail ran through, couldn't stay out/work too late, be the errand boy, and hear about it every chance that came up.",
            "It makes me glad I like my dad. He'd let me stay with him even if I was 50.",
            "My brother had his fifteen minutes of game several years ago on something similar but much worse. He's a lawyer whose job at that time was to research old laws on the book and recommend wether to remove it, modify it or keep it as is. So basically there was a destitute mother who abandoned her son 40ish years earlier when he was 12 that hired a lawyer to force him to care for her in her old age. The lawyer was citing a law on the books from the 1930s that was intended to prevent people from abandoning their elderly parents. As I recall it the judge threw it the case",
            "I am consistently blown away by parents who treat their kids like unwanted roommates who showed up of their own accord (and expect to be worshiped in return!)!",
            "Bootstraps, you old Bitch.",
            "Had friends in high school whose parents did this, they were twins and I always got the vibe that their parents never really wanted children. Turned 18 at the end of their junior year and had to move in with friends for senior year, talk about a shitload of unwarranted extra stress.",
            "I knew a few mates who told me that they were forced out of their homes by their Boomer parents with little to no assistance or warning.\n\nMost eventually stayed with others they knew and even some ended up at shelters. It's never discussed in the news so much because it would make the generation look bad for doing that to children.\n\nI remember once my mother hinted at forcing me from the apartment we lived in at the time. I bluntly said that if she ever tried to do that I'd dump her in the worst nursing home I could find.\n\nNeedless to say she never mentioned the topic ever again. If they do it to you, then do it right back to them.",
            "When I was a kid, my siblings and I were told we were to all move out when we turned 18. I graduated from high school, joined the military and never looked back. My parents wondered why I hardly called or came to visit. One sister went to college, lived at the dorm, the other three also joined the military to leave and be on their own. My grown children are welcome to come and go, one adult child lives with us due to health issues and we are all very close. But no one is close to my parents, including my children.",
            "Well well well, if it isn’t the consequences of her actions.",
            "Did boomers eat a shit load of lead paint back in the day or something god damn.",
            "Most of my cousins still have their childhood bedrooms, and now that they’re married their parents added cribs and they constantly nag them to come and stay for a few days. \n\nThe cousins who got kicked out at 18 and are now married with kids, well their parents are miserable and selfish and did all kinds of stupid stuff that’s only harmed their kids/spouses, literal medical emergencies they were too stupid and selfish to notice, well they’re selfish so idk what I was expecting.",
            "My mom found out my step dad has been seeing another lady for several months. BUT for years they have both come to me and tell me how much they hate the other person. Not to mention”we are roommates at this point”. Now my mom is dumbafounded he stepped out. Not saying it’s ok. But they hate each other. Financially need each other . So I of course, said you are welcome to stay here in my spare . She immediately went postal on me. Telling me I would need to change my daily habits if she would consider moving in. 🙈 I would have to change !! Me!! I didn’t respond. Because no matter what I say I’m on the wrong and most likely responsible for everything. Idk what to even do",
            "![gif](giphy|nbvFVPiEiJH6JOGIok)",
            "I don't care what she does, my daughter will always have a place under my roof",
            "Fucked around and found out.",
            "Don’t even get me started with this. We have friends (boomers, shocking I know) who proudly told us about their family policy of kicking out the kids when they reached 18. I lost a lot of respect for them, and it was hard to be friends anymore. Such an arbitrary thing to do, and hints at a cruelty and contempt they had under the surface.",
            "![gif](giphy|67q2vqkgMf5ACkesMw|downsized)",
            "My parents didn’t throw me out, thankfully, but they always seemed to remind me that it was THEIR HOUSE, even though I helped significantly to keep things afloat and ensure everyone got to eat. Nowadays, I’d just tell them to skip a few payments on either mortgage and you’d see who really owns the place.",
            "\"Oh no! The consequences of my actions!\"",
            "I bet she sees herself as a victim as well. I mean, it sucks for her but that karma is coming with a side of I told you so.",
            "My step dad told me from the time I was 10 that I had to move out the day I turned 18. My mom never corrected him except would casually say “it’s just a joke”. I had such anxiety about house security even though I was still in high school when I turned 18 (Ontario had grade 13 at the time) \n\nThey didn’t end up kicking me out but it was always looming. I moved out at 19 and never lived there again aside from visits.",
            "r/leopardsatemyface",
            "I don’t get this 18 year old mentality. My dad was a hard ass and to get out of the house I joined the army at 18. But it was because I wanted out of the house. No matter how tough he was on me and my brother, he always said we could come back home whenever we needed, and my brother did for a few months after he lost his job.\n\nI just don’t get the 18 years old time to leave or your freeloading. My kids will always have a place to come home to. That’s my job as a dad",
            "Update that resume! Pound pavement. Walk in and give the manager a firm handshake. I mean nobody wants to work anymore. Too entitled to work a fast food kitchen for $7.25/hour, young people these days. Bootstraps. Handouts. Pronouns.",
            "Is it an article or a tweet? What in the fuck",
            "What goes around comes around.",
            "I had to leave reddit to find this article which turned out to be taken from a Reddit post.",
            " This is a Reddit post about an Internet article based on a Reddit post.\n\nScientists believe that if someone were to make an Internet article on this post, the results might be so masturbatory as to make interstellar travel possible. 👀",
            "Her kids and Karma vibe like that",
            "The mom in the picture low-key looks like Hitler with a blonde wig.",
            "This is too true",
            "My children are always welcome at my house.",
            "Just put them in a home and forget about em",
            "I’m so grateful my parents aren’t reactionary boomers. They always supported me, even when I was an aimless dumbfuck of a young person. They supported me when I got sick and lost my job. That’s how family should be.\n\nThere’s something to be said for letting people make their own way in life, but we aren’t part of the natural world. Kicking your kids out isn’t the same as letting baby turtles find their way to the water.",
            "Seems to come from this: [https://www.reddit.com/r/AmItheAsshole/comments/1cypuhb/aita\\_for\\_telling\\_my\\_mom\\_to\\_get\\_a\\_job\\_just\\_like/](https://www.reddit.com/r/AmItheAsshole/comments/1cypuhb/aita_for_telling_my_mom_to_get_a_job_just_like/)",
            "My dad was a crack head and we lived in motels on welfare vouchers. I moved out when I was 17",
            "Rather than referencing this article, why not link to the [Reddit post](https://www.reddit.com/r/AmItheAsshole/comments/1cypuhb/aita_for_telling_my_mom_to_get_a_job_just_like/) directly?",
            "I got kicked out when I was 18 & it sucked.. Ended up sleeping in the shed for about a week until I managed to get hold of a tent. What made it even worse was I went back to get some clothes as I literally had nothing and was stinking.. Decided to get a quick shower as I was crawling in my skin, next thing I know I'm being dragged out the shower by two police officers. Good times /s",
            "It's just an article about a post someone made here that's 50/50 just made up.",
            "How very enjoyable!",
            "I'm sure the Gen X'er in the family will take her in.",
            "I wish my mother kicked me out when i finished high school.",
            "So the moral of the story is you're just as bad as them.. that's kind of trashy",
            "They granted me the one night and in the next sentence, told me that if I needed to stay longer, I would be attending church and living a very strict existence while under their roof  (their phrasing). \n\nI was 22 years old, had lived on my own since 17 (also due to our issues),  finally had the strength to ask for help to leave my abuser and the that was their response. I stayed with him for almost another year after that one night.",
            "That’s awful. I’m sorry that happened to you.",
            "... What the hell is the purpose of the bed in the spare room, then?",
            "My mom told me to go back to the man who threw a stool at me and fractured my cheekbone while I was PREGNANT (still have a scar from the stitches).",
            "I was 19 years old and knocked on my (edit: boomer) mother's door at 630a. I had been in a car with a schizophrenic acquaintance who I wasn't aware was off their meds until it got weird, and was just driving around for hours not letting me out or go home.\n\nI managed somehow to get him to stop at my mother's apartment. I knocked and told her a bit about what was going on and if I could stay until the first bus ran in a few hours.\n\nShe yelled at me, complained I needed to deal with my own consequences and turned me away. I never forgot.\n\nI didn't know what to do but got back in the car. It wasn't for a few more hours I managed to escape from a car that wasn't stopping for stop signs. someone saw me fleeing the car and the police were called. I'm greatful, I didn't even know where we were he drove me so far. fucking nuts. 19- ugh.",
            "Wow that's like level 11 boomerism",
            "Ouch.  Hope you’re doing awesome now.",
            "I’m sorry",
            "What does  and amp mean?",
            "And they wonder why we don't call or visit.",
            "Did you call you dad?",
            "Damn, is Dad out here catching strays or is the potential headache well deserved?",
            "The missing missing reasons",
            "My mother does that shit all the time. Every time I mention something she did, she just goes \" I don't remember that\"",
            "I remember looking up what “gas lighting” was after listening to self help books. . It blew my mind.",
            "The axe forgets, the tree remembers",
            "And if she does remember it, she’ll blame her kid and say they deserved it. Lmao 🤣",
            "r/raisedbynarcissists",
            "\"Why do you always focus on bad memories you have of me? You're so negative, all I did was love you\"",
            "Because to daughter it was a traumatic life event and to mom it was a Tuesday.",
            "Was just about to say this.  \n\n\"What do you mean you won't help?  I was such a good mother to you and always let you stay over whenever you wanted but you are so ungrateful in the end!\"",
            "[The Narcissist's Prayer](https://www.thelifedoctor.org/the-narcissist-s-prayer)",
            "Or frame it as great parenting to teach her \"responsibility.\"",
            "As my shitty boomer parents say, \"you're remembering that wrong.\"",
            "That’s sad af",
            "Why have kids then?",
            "Kids turning 18 now would have Gen X/Y parents, which is even sadder. Some of us can be just as crappy as boomers.",
            "My mom threw me out at 17. I couch surfed until 30... I'm only 32 now but it's the first time I've had my shot together (car, decent job, and my own bed). It feels good even if it's a bit too late..",
            "I’d never do that to my kids.",
            "It's a very mild form of it, but my mum always used to say \"it's up to you\" when I asked permission to spend *my* money on something. I knew what she was really saying was \"don't you dare waste your money on things I think are stupid\". \n\nOne day, after I started going to university, I was out with her and asked if I could buy an Xbox360. She gave the classic, \"it's up to you\", so I did, I bought one. The look on her face when I came back with one and the realisation that she didn't have that passive aggressive, gulit tripping power over me anymore was a thing of beauty",
            "I had to break up with a guy because he wouldn't cut off his moocher parents that were draining his savings, to the point we'd never be able to put a down payment on a house.\n\nWe had to cancel multiple vacations because as soon as he mentioned we were planning to go somewhere nice on social media, they immediately had some vague \"emergency\" and would guilt-trip him into letting them stick their grubby paws into his vacation fund, and I couldn't afford to cover 100% of it.\n\nHe never got an explanation of what the \"emergency\" was, but they'd post on Facebook a week later about their new golf clubs or fantastic weekend at the casino.",
            "Mine asked me for money once and I said no. Then she fucking went around telling people I wouldn’t pay for the horse I kept at her place. (Worst decision ever). The truth was I had paid so far ahead I was 1200 in the black. She spent that money on fucking doll house furniture and doordash. So instead of having extra money in the horse account when she needed to see the farrier or vet, I always had to pay. Sounds awful but I was relieved when the poor thing died. I’ll never make that mistake ever again. She made the whole experience terrible.",
            "My dad would probably say the same thing, while reminding me that this his house, IS HIS HOUSE.",
            "Exactly! My kids can live here, come back here, crash here whenever! As long as they need to! Maybe keep it down after we go to bed, but c’mon! Why would I ever begrudge them anything I could do to keep them safe and near? Even if they’re old, idc.",
            "My kids are 17 and almost 21.  Oldest just graduated community college and is enrolled on the local university for her bachelors.  She works a part time job managing a drink joint.  Not only is it encouraged by my husband and I for them to live with us as long as they need to, but the oldest’s best friend lives with us too because her parents are shitty humans.  My hope is they can all get through school with minimal debt, and have a nice nest egg in savings when they want to venture out on their own.",
            "That’s why I think my mom doesn’t want to do the whole “multigenerational house” thing, I want her to have at least a basement apartment so she’s there to be with her grandchildren, but I think she’s worried if financially things get difficult or if I need to leave a bad husband I’ll have a place to live.",
            "Then you're a good parent and we need more people like you",
            "My parents were the same way with me. I always had a safe place to land. Now my mom lives in my basement.",
            "My parents have several kids ages 24-33. We’ve all left home at this point but I’m certain their home would be open to any of us if things went bad. That’s just good parenting, IMO.",
            "Welcome to the dead internet",
            "Open source information, don’t see the problem",
            "Omg, the original post you linked is only from a month ago. This is crazy, lol.",
            "Right. The ones who jump up and down with joy over their kids turning 18 and moving out. I will cry my eyes out when my kid moves out one day but I will wish her the best and tell her this will always be her home.",
            "Worse are the ones who think that their children somehow owe them something for all the money spent raising them. My children didn't ask to be born, my wife and I decided to have children. It was our choice. They owe us nothing.",
            "it's so funny they always say they wanna be alone til they're actually alone",
            "They got layer after later of that shit on their 45 dollar houses.",
            "There used to be lead in gasoline for decades. Lead poisoning is everywhere. The number of things lead is used in, and the contamination of it around the world is disturbing. Just google 'world wide lead poisoning' and take a trip down that rabbit hole.",
            "Okay Jojo Siwa",
            "Woah, even the H man doesn't deserve to be compared to boomers ",
            "Sure, Jan.",
            "People down voting, missed the fking point. THINK about it. Duh.",
            "I think the moral of the story is don't be a dick to your kids🤷‍♂️",
            "That's horrid. I'm glad you were able to leave your abuser eventually, though",
            "Damn. Not trying to toot my horn but I was aware that a couple of my children's friends had conservative parents in high school and were at risk of being outed and then kicked out. I told my kids our house was open,  we'd find bunk beds, make room and make it work. No body was being left homeless. \n\nIf you are leaving an abusive situation, come on in. Be respectful and a good roommate. We're good.",
            "So, they wanted you to choose your abuser, them or him.",
            "Probably just to look at. They love having shit they don't use.",
            "For if someone she actually *likes*, whom she can hold the favor over, needs a place to crash.",
            "They gotta have room for their retired boomer friends who come to visit bc none of their kids talk to them lol",
            "It's all performative. Any non-selfless act has to be done for a selfish reason. Housing their child for one night would not make a great story of how the mother is a saviour, so it's not allowed",
            "To maintain their property value",
            "So when she complains about the conditions in the nursing home....",
            "I’m so sorry, that’s awful on both counts. Hope you are doing better now.",
            "I love that essay/article. Really sums up the situation.",
            "Wow, I had never seen this essay before. Thanks for sharing it! I've just read a couple of things on that  blog, and it's a really insightful resource. Even after years of therapy, the material in that is fantastic. Just came back to thank you, u/Cultural_Pack3618 for the reference.",
            "That was a fantastic read, thank you",
            "Thank you. This was helpful, and I didn’t even know I needed it until I read it. Have been trying to understand why my parents ( elderly boomers ) continue to act the way they do, and the last part of that essay nailed it.",
            "Mine likes to tell me that memories aren’t always accurate.",
            "The last time I spoke to my mother was trying to have a discussion over things she said and did. Of course she doesn't remember and therefore it didn't happen. Shes am alcoholic so I just told her that she doesn't have a right to claim something didn't happen because she doesn't remember cause she was probably drunk at the time. She called me a piece of shit for saying that. I haven't spoke to her in a year.",
            "\"The ax always forgets what the tree remembers.\"",
            "I actually give my abusive stepfather points for not denying the shit he did. \n\nI was 20 and living at home while I was in school and he threw me up against a door and choked me. My mom didn't believe me then and went to ask him. He must have admitted it, and she told me I was over 18 and could move out if I didn't like it. \n\n15 years later, I brought this up to her, and she at first denied it, but then asked him, and he remembered. I told her what she said and she's like well I was right, you could have moved out. \n\nThe denying anything happened just makes me think I am crazier than I already did, so I'm not being a smart ass when I say my stepdad being honest actually makes me feel better.",
            "Hahaha. YUP. It’s amazing what she doesn’t remember and how nothing is her fault.",
            "well, you do, and you are the judge.",
            "\"Too drunk again, eh?\" is my stock response to that bs.",
            "Haunting",
            "I like that one",
            "![gif](giphy|fxnF2NswlLlxvwGYEn)",
            "There's some nice government checks and benefits that show up at the door. At 18 those checks stop, you've outlived your utility and are just a liability",
            "Once you abandon any pretense of being a responsible adult, it's actually really easy to understand.\n\n1. Condoms don't feel as good as going raw.\n2. Birth control can be fairly expensive.\n3. Abortion is illegal, restricted, and/or expensive.\n\nThe bigger question is what you think the state should do about people like that - give them free birth control so at least they aren't creating more tragedies, or cut off welfare benefits to punish them for being irresponsible, so they start to hate their kid for being a financial expense they never wanted?\n\nPersonally, I prefer the harm-reduction approach.",
            "A big part of it is because they have no concept of reality. There was certainly a time in the US when you could survive on your own out of high school. You could get a shitty apartment for like $150 or maybe rent a room for $50-$75 in LA in the early 70s. The reactionary boomers think we are animals in the jungle that just need to be pushed out of the nest and learn to fly.",
            "It’s probably the easiest “life milestone” to attain.",
            "Not all kids are on purpose",
            "I'm incredibly dissappointed in many of my fellow millenials. I went to a southern school and got to see many grow up on facebook. Some straight up share fake articles about giants existing, one even said Bezos deserves all his money and another liked it. One's in prison after a hard drive check. Plenty still spank, and it's crazy because I remember these same people as teens questioning religion and constantly saying they didn't want to be their parents, telling stories of abuse and injustice. Now they are all bum fuck stupid, disney/harry potter adults, or so apathetic they've given up.",
            "Millennial are as old as 43 now, some of their kids could be aged appropriately to be finishing medical school this summer.",
            " i‘m early gen x, though actually late boomer, as the baby boom started and stopped later here in germany.  kid is 12 years now.  \n\nhuman reproduction isn’t limited to 16 to 35 anymore.   ",
            "It's not too late! Life isn't a race run against other people. If you need some stand-in internet moms, come visit us at r/momforaminute and we'll gush over how proud we are of you. That's a tough start to adulthood, so it's no wonder it took a while to get on your feet. But you've done it, in spite of all that!",
            "I'd be inclined to go with\n\n1. \"Can you afford it without being in financial trouble?\"\n2. \"Is it going to get enough use to justify the expense?\"\n\nTwo yes's means you should go ahead and buy it.",
            "It's up to you.",
            "I love just sitting in my own apartment knowing that it's my domain and I can do whatever I want in it without telling my parents and without needing permission from them or from anyone else",
            "I still say that to my kids - not that I really care too awful much about them spending money on stupid stuff (that’s part of being a kid) but so they can evaluate future wants against the immediate ones. Got two kids we’re about to go on vacation. One has about $100 saved from allowance and the other has about $15. Guess who will have more fun shopping at the beach? We tried to tell them using pretty much the same language as above but it literally is their choice and I just hope they’re either happy or learn about saving through their disappointment.",
            "Umm, that doesn't sound unreasonable. She left the decision up to you. Yes she may not have wanted you to buy the Xbox but you made the decision and your guys moved on. I would caution my kids buying stuff too. It's a parents job to teach and train their kids on good spending habits.",
            "Some people simply want kids for the title . Without the responsibility of being a actual parent .",
            "Amen",
            "Honestly, that's a very respectable reason...",
            "Like a concrete planter in front of a failing strip mall.",
            "It's a problem because a lot of stories on Reddit are completely made up, but being reported on by media outlets appears to legitimize them in many people's eyes. Often this cycle reinforces false narratives, making it seem as if certain rage-inducing scenarios are much more common than they really are.",
            "You disagree?",
            "Justin Timberlake too. You might be too young to remember.",
            "Yes that's the trash world we live in now. It's easier to inherit negative behaviour. It's hard to remain a good person in spite of negativity... Bad behaviour is still bad behaviour even if it is justified.",
            "Thank you. In a surprise to absolutely no one, he’s been in and out of jail for domestic violence since then. I’m glad I found the strength to get myself out 20 years ago.",
            "Out of the frying pan...",
            "Aw. You’re sweet!\n\nI’m so glad there are people like you. My friends family took me in for my senior year of HS and they were kind people like you. \n\nIt was 20 years ago but thank you for showing empathy. Hoping to continue to foster an environment of love, acceptance, education and growth for my children and those around me. 🤍",
            "Them + religion. That was heavily emphasized. They took a hard turn into evangelicalism and right wing conservatism when I was 10 and it caused a lot of issues in our nuclear and extended families. \n\nI was the wayward child who to this day was never supposed to make anything of myself because I left the church. They’re very salty that I did make it and now think I’m their retirement plan because “you can afford it”. Hahaha nope. \n\nThe entitlement and rewriting of history is astounding.",
            "My maternal grandmother had an entire living room like this. All 'nice' furniture but from the 70s and 80s that no one was allowed to sit on because it was the 'good' furniture. When we were kids we weren't allowed to set one foot in that room. When she died (broke) we threw it all out, because it was tacky and dated and the springs were worn from age even though they weren't used.\n\nWhat a waste of money and attention.",
            "That's a wild mindset. Like... I've bought a bunch of shit I don't use. \n\nBut I meant to. Perhaps even did for a bit, maybe I didn't get around to it. But I bought it with a purpose in mind, not just to have. \n\nBut what really gets me is that all those things occypy space in my mind. I've got to keep a mental catalog of all of this shit so I don't end up with two of them, y'know?",
            "https://preview.redd.it/p065dez4238d1.jpeg?width=750&format=pjpg&auto=webp&s=432ec407c09d7690d06b62dc043bbdbc7ae74eae",
            "\"Martha, guess who had to use my guestroom last night?\"",
            "Man, every time I hear about a nursing home that just failed all of its inspections I take notes.",
            "Like, why even talk to people like that? Let them complain about the conditions in the nursing home to the nurse who will retaliate by stealing their meds later.",
            "Really is the Rosetta Stone for estrangement",
            "That's when you go, \"And you're decades older, so you tell me who's is more reliable.\"",
            "Omg this is normal? Makes me feel better that I'm not the only one. My dad not only \"doesn't remember\", he'll emphatically state \"I NEVER would have said/did that.\" The denial is strong with boomers, apparently.",
            "The axe forgets the tree remembers",
            "Mine says my memories are corrupt because I smoked drugs. \n\nMy sister also did drugs. We chose wildly different drugs. \n\nYet she remembers the same things that I do and my mom is the one who insists that we're wrong. \n\nSuch a mystery.",
            "The truth hurts.",
            "I'm sorry that happened and hope you're doing better.\n\n\nThat being said, your username hit me with a wave of nostalgia of Potter Puppet Pals😁",
            "Yup, my mom got massive tax breaks because of me and my siblings.",
            "Just throwing out there for anyone who sees this, if you have health insurance your insurer is required to cover at least 1 form of contraception. If you don’t have insurance there are mail order birth control companies that will mail you pills for $15 or so a month.",
            "\"or so apathetic they've given up.\" Describes a large part of what happens to every generation as they age. \n\nOne fights the system, keeps fighting, but the fight does wear on a person, The system is still there. A person will wear down, they will have to rest, hopefully they pass enough of the fight on to the next generation. \n\nPeople still fight the system where they can, but sometimes all they can do is show up to vote. At 40 there is alot more life than just the system fighting against a person. Not excusing the apathy, but more explaining why the next generation has to take over the fight, and the hope is there are enough of the \"Old Guard\" that don't give up or get worn down, that can help mentor the next generation.",
            "I really appreciate that thank you. It seems like it's taken forever. I still visit my mom. We don't have the greatest relationship but I have forgiven her as much as I can and feel like I need to be a better person. She may have not been here for me but she will be grateful when she gets old and I didn't completely vanish. It's very difficult but I know it's the right thing to do.",
            "![gif](giphy|26FmQ6EOvLxp6cWyY)",
            "I think you missed the part where they were saying the mom meant something else: don’t spend money on something *I* don’t want you to buy. It wasn’t like you’re saying, which is absolutely reasonable.",
            "The phrase I like is \"fuck trophy\"",
            "If you felt it was your obligation to get married and have kids and not your pleasure, well, there’s a reason there are a ton of people who don’t want women to be able to use birth control and get abortions— they think everyone should live as miserable a life as they had to.",
            "You basically just described all of the AITA subs.",
            "Its not that but just it is a lyric to her song (beyond the obvious saying)",
            "Basically.",
            "Don't give in, they're bad people who hurt you because of their pathological selfish need for assurance that death isn't the finality it is. Stay strong, we have 1 life to live and we shouldn't waste time helping those who hurt us deeply.",
            "They probably genuinely believe that what they did to you was \"tough love\" and now claim all the credit for how well you turned out. That's usually how this kind of people justify themselves in their heads. Delusion is a lot more comfortable than reality. Sad, really.",
            "You don't know me and don't owe me a goddamn fucking thing, but please please please tell me that you have not completely made it apparent you wouldn't be taking care of them, so they can be shit with their finances and when they actually come to you for help you tell them to fuck off and they basically rot in some shit box.",
            "I knew a few families growing up that had those pristine rooms that no one was allowed to touch. We always used to joke that those rooms were for when the Pope came to visit.",
            "It's almost like they are trying to show off their wealth and sophistication so they can pretend to be well-to-do aristocrats.  Except nobody cares or respects them for it and it is all a fantasy in their minds.  Maybe other boomers who visit their house will care, but it's not like those visitors will ever help them in any way so why bother trying to impress them except for sheer ego.  Actual aristocrats don't bogart their furniture because people with real money don't care if a chair gets stretch marks, they will just toss it and buy a new one.  Only a poor person desperate to appear rich for their own ego will buy expensive stuff they never use.",
            "I thought I was the only one who despised my mother’s couch. It was for looks and not to be sat on. and I once got cussed out for sleeping on it when I let a friend sleep in my bed. So glad to call for curbside large -item trash pickup when she was forced to move in with my sister.",
            "And here I thought the lookie-lookie towels was a bit much. (I had a friend from NC who came up to my place in MN and saw some ‘nice’ hand towels in the bathroom. They said their mom called them that because they were to look at and not be used). Sheesh, you had a whole lookie-lookie room.",
            "Yeah we had a \"parlor\" like that because it was an old Victorian house. Kind of like a formal living room. I don't know who boomers thought was going to drop by one day the fucking president or the Pope but it never got used and was just a waste of space. But God forbid an 8 year old wants to play with his toys on the floor in there. Anyway, I gave all of it away when my parents downsized.",
            "We had a room like that - likely carried over from my parents parents, as my parents are both boomer/genX cusp\n\nWhen my parents decided to move down south, they had me try to sell a ton of different things they didn’t want to take with them, including their untouched furniture from said room - I couldn’t give it away for free. A couple people asked about the coffee table, but the sofas had 0 people after them at all. It was from a very expensive furniture company from the 90s, but it was just so traditional and dated looking. Such a waste\n\nMy wife and I are looking for houses now - any time we see a formal living room, we always have some other idea for how it’s going to be used; kids play room, art studio, sitting/reading room \n\nIt’s so dumb to have a completely wasted room in your house\n\n(We actually had 2 growing up - we never used the formal dining room either)",
            "Totemic idols of success.",
            "My dad has a bunch of heavy oak antique furniture.  You can sit on it, but it's all uncomfortable as hell.  Like one couch could have been used as a medieval torture device.  I'm the only child and he keeps asking me which pieces I want. \n\n I've told him repeatedly that I don't want any of it, already have a house full of my own furniture, don't have space for more, and am surely not going to haul it up here, 1500 miles away.  He never stops talking about it.  I'll have to hold an estate sale for all of it and he lives in the middle of goddamn nowhere.",
            "I don't know what you believe. Hell, I don't know what I believe. But ive lived moments like this and just for that moment, I like to believe they're watching over me, absolutely FUCKING FUMING.",
            "We inherited my MIL and GMILs formal dining room furniture - ya know, from the rooms none of us were allowed to enter unless it was a holiday. We couldn’t give it away. It was going to cost us hundreds of dollars to have it hauled off but a newlywed couple asked for it at the last moment.",
            "Well, there are a lot of things that you SHOULD buy with no intention of ever using... And those are also the things I always see boomers skimping on (insurance, fire extinguishers, smoke detectors, first aid kits, etc). I can still remember how shocked I was when carpooling with a boomer coworker to discover that she had no fire extinguisher or first aid kit in her car. And yet I know she collected fine China that was never to be used.",
            ">But what really gets me is that all those things occypy space in my mind. I've got to keep a mental catalog of all of this shit so I don't end up with two of them, y'know?\n\nThis is what's currently happening to me. I have to stop myself from buying random shit that I don't need anymore or won't need for some time. Just because its on sale or I found a used one at a good price.\n\nI'm going to spend part of this weekend re-organizing my media collection. So I can start listing stuff to sell on ebay/etsy.",
            "Can I please get to link to that article? Sounds awesome",
            "And did not sit on that bus for gays to be asking for equal rights. \n\n(It's an old meme)",
            "Yep my mother will do this. If i don't let her off the hook she'll resort to the old \"well i guess i was a terrible mother\"",
            "That's gaslighting, not denial, and yes it's normal for this generation.",
            "That's why this sub exists ",
            "I love mutual hallucinations. Makes me feel less crazy 😂 \n\nHappy cake day!",
            "I'm doing great, thanks!\n\nAnd hellllll yeah. \n\nVoldemort's Nipple!",
            "I believe Planned Parenthood offers free or low cost birth control as well.",
            "You can also buy the opill OTC, at costco for example.",
            "I hope she is grateful for you, because you sound like a generous and kind person. Remember that you matter, and you deserve to be safe and loved.",
            "![gif](giphy|3o84sw9CmwYpAnRRni)",
            "My friends like to use the term “cream pie fruit “ “pet cum” 💀",
            "Oh",
            "Never, ever will they live with me. I made a lengthy comment about a month ago on their recent needling me to agree to it.  You’ll also see comments how my daughter now has a goddamn horse (it’s leased!!!) and how my mom tried using that as how we can afford to house them, in addition to how we built this house exactly as we wanted and with multigenerational living options - *for our children if they need/want it*.  And there are also some comments how my siblings have all tried to talk retirement plans and they refuse. It’s definitely not going to be me and I’ve made that abundantly clear. \n\nAgain, maximum entitlement and false expectations from my parents.",
            "I think you’re correct. And yet somehow can’t understand how their children are all low contact and none are religious at ALL (save one sibling who married into a very Italian, culturally catholic extended family). \n\nDelusion is indeed more comfortable to self awareness and facing your mistakes.\n\nThey unironically love Jesus and money. Yet seem to have no retirement funding after tithing almost $1000 a week to various religious and religious hate funding organizations for decades.",
            "Another name for \"tough love\" is \"cruelty\".",
            "100%. Although it was kinder, but firm. 🙂",
            "I've read stories where Mark Zuckerberg visited \"ordinary people,\" and they didn't bring out the nice stuff even for that. It's just for display. Not to use. IE, a gigantic waste of money.",
            "The rooms my siblings and I had to clean every Saturday morning but were only used on high holidays or when “company is coming over”. \n\nI’m so glad that we have moved past staged, performative spaces in our homes. It’s so wasteful.",
            "hence ”exclusive“  chocolate packaging. the rich buyers don‘t care - their servants/assistants will buy them in bulk or at least without giving it any thought and   arrange them. \n\nit‘s the buyer for whom it is an occasional luxury, who wants/is impressed with the packaging.  ",
            "I’m a middle aged millennial and I have a hard time using the ‘fancy’ towels that I buy with my money. I don’t care who uses them. . . That said, I still wipe my freshly washed hands on my pants. It’s a vicious cycle. That’s some grade A programming right there.",
            "This just unlocked a memory of seashell-shaped hand soaps that I was never allowed to use.",
            "I have an Aunt that pulled that shit with the *decorative hand towels*. She finally stopped doing it after half the family used them multiple parties in a row.  She even made it a point to tell all of us, including her own brother, not to use them during Thanksgiving.\n\nEventually she realized none of us gave a shit, including her own brother.",
            "Don't use the 'good china', use the shitty plates unless there's company. Let's get a big wooden fancy looking china cabinet and fill it with fancy looking dishes we never use, because we should waste as much money on decorations as we can.\n\nNever in my life have I been at a meal and looked hard at the fork and felt flattered and impressed that someone is letting me shovel food into my mouth with such a beautiful... fucking fork.",
            "As her own daughter was laying dying she stood outside the door to the room she was in and made it all about her making a scene and saying \"it wouldn't be so bad if I didn't know she was going straight to hell\" to try to get sympathy for herself. Her dying daughter was in earshot and had to hear her mom say that. While she was dying.\n\nIf you're watching over me, grandma, eat a bag of dicks. :/",
            "I saw some great advice for limiting purchases- always ask first \"How am I going to clean this?\" and \"Where am I going to keep this?\"",
            "https://www.issendai.com/psychology/estrangement/missing-missing-reasons.html",
            "https://www.issendai.com/psychology/estrangement/missing-missing-reasons.html",
            "Mine used to say that until the one time I responded with, “yes, you were.”",
            "Oh jeez yes I hate this one. They just try to gaslight you. Or when they tell you it didn't happen like that and you should stop gaslighting them. My God. A simple attempt at conversation always go awry. Orr I just remembered this. When you are finished the convo but they insist on continuing it even if it's an argument and you just want o leave the situation. Then it turns into why are you raising your voice....because you don't understand no, I don't want to talk and you refused to listen when I asked politely for the past 5min. Jeez.",
            "I just agree with her when she says that and if she tries to make things worse or start crying, I just walk away or hang up.",
            "Leprechaun taint!",
            "My favorite is \"crotch spawn\"",
            "\"Alright mom and dad if you are going to be here more than a day then there's going to be a lot more Satan in your lives\"",
            "I used to get pissed off because my mother's friends would \"joke\" about moving in together, with me, when they were all older.\n\nI shut that crap down real quick.\n\nEventually I'm going to build a house in a very rural small town area. I'll put in a few smaller guest houses for family to stay in to visit or during hard times. After some family drama and Covid shit I will not be living with extended family again.",
            "Hello fellow black sheep that was supposed to fail and made it. Fuck them, never give them a dime. I wouldn’t piss on mine if they were in fire. Let their religious extremism keep their ass warm at night.\n\nThis is me while their god lets them be homeless and freeze to death.\n\n![gif](giphy|Xzmr06eX5nGUg)",
            "Pet the horse for me please",
            "If they bring it up, remind them that under your roof, you worship Satan, and they'll need to attend satanic temple.\n\nEnjoy never being asked about it again.",
            "I cannot imagine having that much disposable income. WTF.",
            "Tithing $1000/week!!!!! So your parents made $40k (that's $40,000 a month)!!!!! Wow",
            "They can kick rocks sister!!!",
            "I would only get out paper plates for Zuckerberg",
            "And those plates probably have lead in them",
            "I....just...wow.\n\nNo words. I'm so sorry.",
            "I had never heard of this. It’s such a perfect encapsulation of things I thought less eloquently. \n\nThank you, internet traveler",
            "> Compare this with the forums for adult children of abusers, where the members not only cut-and-paste email exchanges into their posts, they take photos of handwritten letters and screenshot text conversations. They recreate scenes in detail, and if the details don't add up, the other members question them about it. They get annoyed when a member's paraphrase changes the meaning of a sentence, or when omitted details change the meaning of a meeting. They care about precision, context, and history.\n\nI grew up in an abusive home. There was a lot of violence, verbal abuse and starvation was used as a means of punishment or control. There was also sexual abuse, but to this day I don’t know the extent of. Maybe it was brief. Maybe it spanned a long period of time. \n\nI’m in my late 40’s and have been in and out of therapy since I was around 22 or 23 when I could first afford the copays to see a therapist. I had very few and fragmented memories. Things were so consistently bad that it was hard to remember any specific moments in detail. It was just life for 17 years. Even some of the most traumatic events were missing from memory. I’ve learned some things from others recounting what they had witnessed. \n\nI have spoken with many people who grew up in similar circumstances. One thing many of us have are years of missing memory from growing up. It’s just blank. I couldn’t tell you details about what is missing from memory. I’ve pieced enough together from things my significantly older brothers have told me. Some others that witnessed things have asked me about what the circumstances were when they witnessed something. Once in a while I’ll get a flashback when someone starts to talk about something specific, but generally I don’t. I could fit in a couple of paragraphs what I remember about the first 17 years of my life. \n\nThe problem with having years of memories missing (suppressed or whatever mechanism is keeping them from me within my own mind), is that it can make a survivor of abuse question themselves. It can make you wonder if things were all that bad. Or maybe you are embellishing or making up how bad things were. Maybe I *was* the problem. They told me constantly that I was, and since I don’t remember so much, or lack such detail, maybe the things they would say to me were true. That’s how I felt for many years. \n\nI don’t envy the people who remember things in detail. My mind for whatever reason is remaining mostly blank or incredibly vague to the point that it’s hard to determine what’s real and what’s not. I’ve come to accept that the bulk of the first couple of decades are lost to time. There’s also the unreliability of memory. Key points may be able to be recalled, but details are fuzzy at best. \n\nForums can be incredibly helpful in getting support from others who grew up in similar circumstances. Sometimes someone will talk about an epiphany they had in therapy about how past events and experiences are the root cause of some struggles they are having in their life now. Maybe it’s a repeating pattern of behavior or emotions that don’t make sense. Maybe it’s just a perspective change or something that has empowered the survivor. Picking apart details can be incredibly isolating for some people. It can cause them to shut down. It can cause them to go back to being silent. \n\nI just wanted to point out that for some of us, we’re caught in limbo in trying to move on with our lives. Parents sometimes outright deny that there were any larger issues, but like one of my parents will follow that with how hurt they are that they only hear from their 4 children once or twice a year. The level of denial or making themselves out to be the victim is astounding. Said parent is in their late 70’s. Has no retirement. Gets a pittance of Social Security and lives in a subsidized retirement home. I’m dreading the day that they require round the clock care. My brothers and I all share one thing in common: they won’t be staying with any of us.",
            "My nieces and nephews are referred to as Spawn and Crotch Goblins",
            "I’m chuckling at this comment because I am a card carrying TST member in support of their work to combat religious infiltration into public schools, reproductive rights and fighting the overall desecration of separation of church and state.",
            "Dammit, beat me to it.",
            "Good for you! The entitled expectations-  presented as fact is just mind boggling to me!",
            "Yaaas! Congrats to you for being awesome and owning it all. I’m proud of you. 🤗",
            "Same!! Like wow you'd think you'd be able to pray your children back into your lives but I guess their faith isn't strong enough  lol",
            "https://preview.redd.it/4snqhakra18d1.jpeg?width=4032&format=pjpg&auto=webp&s=defd9fb52e58bf47eaca9ec472368e35349d1225\n\nShe wouldn’t come to me but here she is. She is my daughter’s greatest joy in life right now.",
            "And her on the one she’s riding at sleepaway camp for the month. A 17h, recently retired collegiate jumper. 😳\n\nhttps://preview.redd.it/7qdlbln1b18d1.jpeg?width=1155&format=pjpg&auto=webp&s=d813fd4bab61499d08522993826f1fefb2437f5d",
            "I’ve lost friends over my totally atheist, wholly humanistic, legalistic and philanthropic support of TST. I just keep it to myself - and Reddit. \n\nThere’s no reasoning with religious people.",
            "But wouldn’t help with college simply because I “turned away from god”. They had been born again, E-Free for about 15 minutes in Jesus years. \n\nI lived in my car, eating clearance pastries to save enough to pay for my education before scraping enough money together for my roach infested, prewar apartment that my aforementioned abusive boyfriend moved into with me. And now they think they’re the ones who made me successful. Once again, entitlement and greed of the whole generation manifesting. \n\nI know this isn’t what the thread is about but religion is a cancer.\n\nMy dad would tape a piece of paper to a kitchen cabinet every Wednesday with the tithe amounts - 700 club, focus on the family, their church, other religious “foundations” but tell us kids they couldn’t afford extracurriculars.",
            "Honestly, them showing their ass and using my daughter’s horse (again, not ours! It’s a lease!) and us building a home that can support multigenerational living as reason for why we SHOULD support them burned me to the core - especially when it was used in the same conversation. It felt like they were saying fuck your family, we come first but… I WAS your child and I never came first. Cliche but true. \n\nAnd now that you, adult child can give me what I think I deserve, so it’s terrible not to. Big fucking yikes. \n\nSuch disgusting selfishness. The whole lot of that generation. I know that there are exceptions but we wouldn’t be on this sub if it was the norm, right? 😄",
            "Thank you! 💪🏼💪🏼💕",
            "Wait, you guys would open the door?",
            "No need, androids don’t eat.",
            "The only robot allowed in my home is the Roomba",
            "It happens. I agree that I hope she's fuming. :)",
            "I’m proud of you too!",
            "That is a beautiful horse. Looks like gold come alive",
            "That's a big horse.",
            "I feel ya, \n\nSorry you have to go through this, I have some similar stuff I'm going through at the moment..",
            "I'm so glad you made it out. Leave them in the rearview mirror and let their god take care of them.",
            "Aww, thank you for the award!",
            "Focus on the family? Pardon me while I puke...\n\nIdiotic that, that money was put towards not focusing on their family.",
            ">Thank you! 💪🏼💪🏼💕\n\nYou're welcome!",
            "Thank you! She is very well cared for and came to us last month. We look forward to the next year with her. \nIf my child was allowed to live at the barn (without additional board fees), she would.",
            "I’m so sorry. I understand and am Hoping that your realism and facts, science and proven truths help reinforce. You will get through this but I understand how it really sucks to have to defend against unfounded beliefs."
        ]
    },
    "\"Childhood Trauma is Make Believe\"": {
        "title": "\"Childhood Trauma is Make Believe\"",
        "score": 206,
        "url": "https://www.reddit.com/r/BoomersBeingFools/comments/1dlsn6u/childhood_trauma_is_make_believe/",
        "content": "I'm a really easygoing guy who, for the most part, rolls with the punches, but this absolutely pissed me off.\n\nI recently moved to a much larger city and have been researching new dentists, specifically those who understand \"trauma-informed care.\" I have extreme anxiety about visiting the dentist due to a traumatic experience from my childhood. When I was 11 years old (now 37), I went to a dental appointment with my grandmother. While waiting for her in the waiting room, I suddenly heard her scream from another room. When I went to check, I saw blood everywhere—on her face and clothes, on the floor, and on the dentist. The dentist had accidentally cut her tongue so badly that she eventually won a lawsuit for damages. This incident left me with a lasting fear of dentists.\n\nAfter some research, I found a dental office with a knowledgeable and caring approach to trauma. I emailed back and forth with the doctor and staff, shared my concerns, and booked an appointment. On the day of the appointment, I was treated very well when I walked in. The staff made a conscious effort to make me comfortable without being patronizing. After chitchatting with the front desk ladies, I sat next to an older woman in the waiting area.\n\nAs soon as I sat down, she turned to me and asked, \"Why are you getting the VIP treatment?\" I shrugged and said it was my first time there, and they were just being welcoming. She then complained that the place was never friendly to her despite her spending \"hundreds of thousands of dollars\" there, which seemed unlikely given the office had only been open for about eight months. Noticing my nervousness, she asked why I was anxious. I briefly explained my grandma's incident, and she lost it.\n\nShe accused me of exaggerating the event, claiming kids are not good at perception, and suggested I was using this fear to justify being lazy about my oral care. She said, \"Kids these days are always looking to blame their past and not take accountability,\" and mentioned her own kids barely speak to her anymore. The final straw was when she told me that \"my generation\" needs to toughen up and understand that such events shape our character.\n\nI finally interrupted her, saying, \"I have a PhD in Psychology, and the trauma from that incident actually made me interested in studying trauma and its impact on youth as they grow up. So yes, it did shape me.\" She retorted that I should have learned how to get over it if I had so much education in the field. I responded, \"Maybe you should get educated before you speak about something you know nothing about and keep your nose out of people's business.\"\n\nShe then got up and complained about me to the front desk, but the staff defended me, saying, \"We saw you instigating the poor boy. Take a seat and stay quiet.\"\n\nI appreciated the support from the front desk ladies. It's unfortunate that this woman felt the need to invalidate my fears and continue the conversation, but it was reassuring to feel supported by the staff.\n\nEdit: spelling.",
        "num_comments": 23,
        "comments": [
            "Remember to report submissions that violate the rules! Harassment and encouraging violence are not allowed.\n\nEnjoying the subreddit? Consider joining our discord server: https://discord.gg/v8z8jNwJs6\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BoomersBeingFools) if you have any questions or concerns.*",
            "\"and mentioned her own kids barely speak to her anymore\"\n\nThis explains it. Another cross-post for r/raisedbynarcissists",
            "My late wife was a psychotherapist. Boomers created a lot of customers for her.",
            "Saying you should just get over it while you're at the dentist is wild. You're literally doing just that, facing your fears to get over them. What an ignorant, sad old woman.",
            "\"Theyre never this nice to ME\"\n\"MY kids don't talk to me\"\n\nSounds like NOBODY likes her, not even family. You did the right thing telling off the old bag. I bet she's got LOADS of trauma she has tucked away from growing up with the mentality of 'just get over it' and having to quash down decades of unresolved mental trauma. She's simply jealous that no one ever made her feel important or special. They all leave her in some form or other because she has no concept of empathy.",
            "My parents, especially my mother, have a hard time admitting anything they did was ever wrong or even was a mistake.",
            "Bitch, why do you think I am here if not to help me get over it? Wow. I see my family on here all the time....",
            "I think when someone like this hears something that scares them, they need to convince themselves that it couldn’t happen to them.  The easiest way to do this is to either believe that it didn’t actually happen or to blame the victim.",
            "The person in my acquaintance with the worse dental trauma anxiety grew up in the Soviet Union, where they filled several cavities, when he was about 10 years old, with no anesthetic, with a couple of guys holding him down.",
            "“Why are you getting VIP treatment”\n\nAppropriate communication . That’s why. I swear boomers are the worst at communication. They think you should be able to read their minds. When people obviously can’t read their mind, they think you’re the idiot. \nYou communicated your needs, explained your situation and are being treated accordingly out of a mutual respect by the dental office. Its really not difficult being a kind human, and it’s not difficult to communicate your needs in order to have a positive experience.",
            "Question to the boomers. Someone insults you at whatever business you and them are patrons to. You go to complain to staff... Why? If I decide to call you a fucking idiot, what do you think the staff will do to me?",
            "Man everybody’s nervous about the fucking dentist the old lady was just jealous because you whined around about it and they laid down the red carpet for you.",
            "Funny enough - I haven't spoken to my parents since I was 16, so about 21 years because they found out I was gay. Boomers that treat me like my shitty parents did really hit a nerve that I often find myself having to hold back rage.",
            "I WONDER WHY",
            "But it’s the kids that are failing to be accountable for their actions.. someone get her a mirror haha",
            "I know it’s relevant, but I am sorry for your loss",
            "My psychotherapist really helped save my life. My dad is a Boomer - checks out lol.\n\n Condolences 💐",
            "My mom will never admit she did anything wrong",
            "This is why I think I have good boomer parents - they admit mistakes ",
            "There’s a big fucking difference between explaining that you have an actual trauma and whining.",
            "Why hold it back? Just don't do anything that can get you into legal trouble.",
            "I can’t imagine, she seems so lovely and is obviously a caring and sweet individual \n\n/s",
            "Same results though"
        ]
    }
}