{
    "Oilers erase 3-0 series deficit, beat Panthers to force Game 7 in Stanley Cup final": {
        "title": "Oilers erase 3-0 series deficit, beat Panthers to force Game 7 in Stanley Cup final",
        "score": 978,
        "url": "https://www.cbc.ca/sports/hockey/nhl/stanley-cup-final-game-6-oilers-panthers-june-21-1.7243219",
        "content": "",
        "num_comments": 193,
        "comments": [
            "Am I a diehard oilers fan? No.\n\nAm I getting much enjoyment out of Florida pissing away a 3 game lead? *You bet your ass I am.*",
            "Oilers team has 23 Canadian players. \n\nPanthers team has 13 Canadian players.",
            "Back to back empty netters... The assist from Skinner.. what a game",
            "Wild fan fully on board. Let's fucking go Edmonton bring it home.",
            "Jets fan signing in. BRING IT HOME. MCDADDY CANNOT BE STOPPED WHEWWWWW!!!",
            "IM ONE OF 5 SENS FANS IN THE WORLD, BRING THE CUP HOME OILERS 🗣️🗣️🗣️🔥🔥🔥",
            "I hate to say it, as a canucks fan, go oilers!",
            "The last team to do this in a major sports final were the Knicks in the 1951 NBA Final. To put into perspective how rare this is (they proceeded to lose game 7 however)",
            "As a Flames fan, I hate to say it but I'm cheering for the oilers now! \n\nLet's go!!!!!",
            "Monday Oilers will get the cup and McDavid will get the Conn Smythe trophy!",
            "Fun game to watch, the atmosphere looked electric through the screen",
            "This is why I only watch hockey during the playoffs hahaha fucking amazing",
            "Fuck this would almost be worth the plane ticket to edmonton just for the parade, been awhile since canadas brought it home\n\nlets fuckin goooo",
            "Leafs fan checking in,  Go Oilers Go!",
            "Fucken eh.....",
            "It’d like to see what kind of return someone would be getting if they bet on Edmonton coming and reverse sweeping the Panthers.",
            "I have a coworker who thinks it’s a conspiracy to drag out the cup because each game nets so much economic activity. He’s been hung over after each watch party…",
            "I have such conflicting emotions as a Flames fan. Why the fuck does this have to be Edmonton? Fuck...",
            "Bring it home",
            "Canadien fan here, go oilers, bring it back home!",
            "I hope Luongo gets his cup.",
            "https://youtu.be/vimZj8HW0Kg?si=LSkwLQuSPfOZNDAn",
            "Oilers fan living in Calgary. Let's fucking  GO OIL!",
            "PP - Bring it home. \n\nNDP - Make the name \"Oilers\" illegal.",
            "Win it for Joey, boys.  Wherever he is, he's having one hell of a party.",
            "The fix is in.  Bettman's little boytoy gets his cup.",
            "GO CANADA SPORTS",
            "I'm a Florida fan but I'm Canadian first, I wanna have the cup come to Canada!",
            "I'm just so happy it's not Toronto I have to cheer for as a Canadian. I mean, I'd do it, as a Canadian, but my heart wouldn't be in it. \n\n^^^Plus ^^^their ^^^fans ^^^would ^^^never ^^^let ^^^us ^^^hear ^^^the ^^^end ^^^of ^^^it ^^^lol",
            "LFG🛢🔥",
            "They were always going to draw out the series like this. If the panthers had swept, the NHL and both franchises would have missed out on tens of millions. Not to mention the sports books who make obscene numbers on these games.\n\n\nIt’s a tableau.",
            "Canada needs this, our government is a fucking joke and the entire world sees it, actually pathetic. So it's exciting having something else to focus on!",
            "Maaaaaaan, **FUCK** the Oilers!\n\nStop trying to get in on their potential win.",
            "One more game and we have the ultimate choke.",
            "Holy shit some good news for once! Oilers win or we riot!",
            "Fukin Eh!!!",
            "As a Habs fan, I am cheering for the oilers. Mostly because I’m working about an hour and a half away from Edmonton at the moment\n\nA lot of real diehard fans out here even in the small towns it’s wild",
            "Ugh",
            "Rogers thanks you all in advance for watching them lose game 7",
            "Go Panthers",
            "This happens a lot in hockey",
            "[deleted]",
            "Who cares if it's the Oilers? This thing needs to come home.",
            "I have been a die hard oilers fan since the 80’s. I lived in Dawson creek and the tv we got was CBC Edmonton so the Gretzky years made a big impact on my life. \n\nI’m not a huge hockey follower but if Oilers win, I’ll be ecstatic!",
            "It's a win-win.  If Edmonton wins, we laugh at them for blowing the lead.  If Florida wins, we laugh at Edmonton for getting their hopes up.  It couldn't have worked out better for this Leafs fan.",
            "I just like the mathematician",
            "yeah pretty much lmao",
            "I'd root for any come back team right now (except the Leafs)",
            "Why people no like Florida?",
            " The stats have spoken.",
            "could be the best thing to happen to Edmonton this millennium",
            "Leafs fan right there with you, excited for a Canadian team, to end the embarrassingly long losing streak for Canadian teams, which I can clearly relate to in other ways.   But more importantly, for McDavid and his legacy, man is a legend. It would be incredible if this was apart of the trivia that his legacy will include. The time he led the charge in erasing a 3 to 0 deficit in the Stanley Cup finals, for the first time since, ironically, the Leafs did it in 1942. \n\n\n\n\nI never go to the bar, but I will definitely be at one Monday. Hoping to witness history with some other hockey fans.",
            "Yay!!!!",
            "'Nucks fan. I feel so conflicted. I was rooting for the cats, but after these last 3 games EDM has won me over. I am fully on board the Canadian hype train.",
            "He didn't get a point this last game.",
            "I'M ONE OF THE OTHER FOUR SENS FANS THAT AREN'T YOU, AND I WOULD ALSO LOVE TO SEE A CANADIAN CUP",
            "Yes!!!\n\nI wish Ottawa would change the name. It evokes the image of a bunch of old men.",
            "Yo, number 2 here. Let's go Oilers",
            "This is more about the Stanley Cup coming back to Canada but I’m glad you’re supporting the Oilers!! \n\nGo Oilers Go!!!",
            "As a canucks fan its more like go.. (clears throat).. oilers.",
            "As a Canucks fan, c'mon man. Don't be like that.",
            "Canucks fan here. If oilers win we can cope and say \"yeah our star player and goalie (Silov was fucking nuts though) were injured and we only lost to the champions 😎😎😎\"",
            "[deleted]",
            "The Maple Leafs did it successfully in 1942 against the Red Wings. All other 0-3 comebacks have either been in getting to the finals, or they've lost game 7. Only 4 teams in NHL history have successfully come back from it.",
            "Even rarer for hockey!",
            "I don't really follow hockey, but no NBa teams have ever come back from down 3-0. I know that as a fact.\n\nAnd McJesus is lord",
            "No NBA team has ever won from a 0-3 deficit",
            "Good on ya! I’d cheer on the Flames if they were in the finals because the Stanley Cup belongs in Canada!!!!! \n\nGo Oilers Go!!!\n\n(Note: I spent a good chunk of my life in Edmonton.  😁)",
            "Even if Florida wins McDavid deserves the Smythe trophy.",
            "The crowd sounded LOUD.",
            "Regular season is like watching it all cook. Playoffs is that juicy, juicy food at the end of the road.",
            "After 78 years, it's finally paid off for you.",
            "> parade\n\n/riot",
            "Bah we all know it'll just be a repeat of Leafs game seven. I've been hurt too many times to get excited.",
            "Before game 4, [the odds](https://www.nytimes.com/athletic/5564837/2024/06/15/panthers-oilers-stanley-cup-final-game-4-odds-picks/) were Florida -3000, Edmonton +1300. So a $100 bet wins $1300.\n\nBefore game 6 last night, it was Florida -300, Edmonton +240.",
            "It’s a CANADIAN team!!! The Stanley Cup belongs in Canada! \n\nGo Oilers Go!",
            "The funniest part of the situation for Flames fans, is it's either the team you hate the most that wins, or the team with the guy that said \"Fuck your shitty fan base, I'm moving to Florida.\" lmao",
            "How do you drag something negative into something so positive....what does this have to do with politics.",
            "wut?",
            "I hear the riot is worse when the team wins.",
            "You're drinking the media koolaide bro. Don't be so gullible.",
            " It's a fucking hockey game man, let us have this without bringing all your bullshit into this. Sheesh!",
            "Edmonton is the least Wexit place in all of Alberta.",
            "Huh?",
            "Justin Trudeau is that you?",
            " Bring it home to Canada boys!",
            "EXACTLY!!!!!!!",
            "Bruins fan here but cheering hard for Edmonton. The Cup has been living abroad for way too long. Plus I hate the Panthers.",
            "Nah, Boston Pizza, this is where you're wrong",
            "Spoken like a true casual NHL fan",
            "lol I cheer for Canada in the olympics when they wear red and white, not orange and blue.",
            "It comes home every year when like half the winning team is Canadian.\n\nI'm more happy this is a 7 game series than the Oilers having a shot at the cup. \n\nDon't agree with this Boston Pizza ideal of all of Canada pulling for Edmonton just because they're Canadian.",
            "Everyone west of Ontario cares",
            "I care a lot. You can really tell the difference between big hockey fans and those who don't follow as closely. My whole life I've cheered against the Oilers, why would I all of a sudden want the biggest rival of my favourite team to win? Go Cats.",
            "it comes home every year - just the Canadians play for american teams",
            "Ahhh the golden era of hockey, nice! ",
            "Yes it could have. Your team could not be absolute donkey ass since like 1969.",
            "At least Oilers made it to the SCF",
            "It's the kind of people who go en masse to watch the Friday night high school football game.",
            "Love Florida just NOT their hockey teams!",
            "THE NUMBERS DON'T LIE, AND THEY SPELL DISASTER FOR YOU, FLORIDA AT GAME SEVEN!",
            " For sure!",
            " Have to support the home (Canadian) team!",
            "Yes it's a reluctant and restrained enthusiasm",
            " Like what? I'm supporting the  remaining Canadian team man.",
            "You don't want a future series with Edmonton to be a bunch a people cheering for them because McDavid deserves a cup - let him get it now.",
            " They haven't won yet.",
            "1993 Montreal Canadiens would like a word.",
            "The Knicks tied it up 3-3 and proceeded to lose game 7. Semantics whether you consider that successfully erasing a 0-3 deficit or not. The only team that came back and won it all were the '42 Leafs",
            "> NBa teams have ever come back from down 3-0\n\n157 3-0 series, all won by the team up 3-0.",
            "100% \n\nthe odds right now on bet365 have Mcdavid at 1.15 and the next closest player is barkov at 6.50",
            "You don’t watch hockey, do you.",
            " No, that's Vancouver and Montreal lol.",
            "I hope not. They can go crazy with yelling and so forth but NO RIOTS! That’s the actions of imbeciles.",
            "That was a pretty awesome game to watch though, regardless of outcome.",
            "The Leafs leafing it up is tradition.  This is the Oil.  Have some faith broher!",
            "They ain't the Leafs pal.",
            "I'm not a nationalist and it's Edmonton... That provincial rivalry is strong.",
            "Edmonton has happy riots",
            "[deleted]",
            "Bread. Games. And sports betting.",
            "Edmonton is more progressive that *a ton* of places in BC I know.",
            "Keep the cup out of Tkachuk's greasy little rat claws",
            "nah they’re right, you can be a hardcore fan of your team and not be a pissbaby about another team winning.",
            "Bread and Games, a distraction from the real world.\n\nand with the NHL, It's Bread, Games, and lots and lots of sports betting.",
            "22 of the oilers players are Canadian though too",
            "What kind of gate keeping is this? You can only cheer for your own team. You can’t support another team from your own country because you’re only allowed to support one team.",
            "Correct. This is the way for hockey fans. Tottenham fans don't suddenly become Arsenal fans because they're in the Champions League finals. This is no different.",
            "It's 1967, but your point stands.  I'll enjoy the hate-side of hockey as much as you would if the Leafs were in the final.",
            "Or past the first round",
            "What is that worth though?  Fans seem to think playoff round wins are valuable.  Maybe that's true for the viewer, but it means nothing for the team or Stanley Cup history.  Nobody remembers who lost the cup final.",
            "Rowdy?",
            "Why?",
            "Honestly took me until game 5 to get on board. I want to believe!",
            "There's probably some parallel universe where the fuckin' Leafs play professional hockey in June, and make a Cup run there. Infinite worlds and all that.\n\nIn that universe, I'm saying fuck the Leafs. \n\nJust because the franchise is Canadian doesn't mean they're my team.",
            "The Boston Celtics lost in Game 7 of the East Conference finals last year after being down 3-0 to the Heat",
            "Well, we definitely don't want to repeat that scenario.",
            "Yeah, that LeBron hard carry back from down 3-1 in 2016 was probably the closest thing in recent memory.\n\nThat finals was the shit.",
            "Both forcing a game seven, and winning one, seems to be less common in the NBA and MLB than the NHL (obviously its happened fewer times, but I mean I think that’s probably an accurate sample of the underlying probability). I think the high scoring nature of basketball makes each game a little bit better of a statistical indicator of true relative strength of the teams, rather than luck (not to say that luck isn’t important, but just as a relative influence). Likewise, the turn-based nature of baseball (and the lack of a strict clock) I suspect has a similar effect. \n\nI don’t think it’s all that surprising that the NHL is the outlier.",
            "Game 7 will colour a lot of opinions if Barkov just rocks it though.",
            "You'd have to go back to 1993 for that statement to be true.",
            "There will for sure be riots in EDM if they lose. 1000%\n\nThere will be way too many drunken idiots all gathered around, someone will throw something, & then another. Not just near the arena but everywhere in the city. Especially if the game goes into OT or something absolutely crazy happens.",
            "Nah y'all got a reason to not root. I get that. Vancouver fans too sorta.",
            "I know about the rivalry but come on. You’re saying you’d rather have a fucking American team take the cup?",
            "As a Calgarian, I also like Edmonton lol. I just really don't understand it and think it's fucking stupid. Like does some bullshit from before Canada was even a country even matter? Just seems artificial, like the teams and media and useful idiots keep perpetuating it generation after generation, and for what",
            "Calgary smells like fart.",
            " Dye your hair oilers blue!",
            "Did you see the meme of him in the net after that diving empty net save and it's captioned \n\n\"Despite all my rage, I'm still just a rat in a cage\" \n\nSo good.",
            "There's only one rat that can skate and he's the captain of the Bruins.",
            "I haven't hated a guy like him for a long time. Either wear your mouthguard properly or don't bother wearing it. Hated his dad too. American wanna be tough guy.",
            "😂😂😂",
            "Can the camera cut away when they hand it to Evander Kane?",
            "Someone needs to make a meme of him from the last game reaching for the empty net goal, but with the cup instead 😅",
            "Especially after he called game 5",
            "It’s called a rivalry bud, look it up. Sports fans these days are so soft, like yall want everyone to be one big happy family.",
            "Meanwhile the Canucks have maybe 1 Canadian player in their starting lineup.",
            "“Enjoy the hate side of hockey”. That’s a pretty sad sentiment.",
            "Maybe not. But nothing is funnier than ripping into a leafs fan whose team talks big all season and under delivers savagely in the first round.",
            "Tell that to the owners making millions right now",
            "Maybe.  I've had a few.  My comment isn't wrong though is it?  Even if you take out the rowdiness?",
            "Took me until this one to root for EDM. I couldn't feel my Canadian pride until now - the wound is still too fresh to really be happy.",
            "same, same.\n\nGutted we lost to the Oilers, but still happy they reversed a 3-0 and really hoping they pull it off gm 7\n\nIf it was the Leafs I wouldn't even check the score.",
            "The leafs are a golf team.",
            " The difference is that even if cities like Vancouver and Edmonton dislike each other everybody hates Toronto.\n\nEdit: somebody's feelings are hurt haha!",
            "It was especially fun for those of us cheering for the Warriors",
            "It's not artificial I was alive in the 80s. It's a very real rivalry.",
            "Hahaha",
            "That's hilarious, I need to see this lol",
            "Ken Linseman was never the captain.",
            "Does this atleast make do?\n\nhttps://www.instagram.com/reel/C8c1ykHSTEG/",
            "yeah i know what a rivalry is genius. i was fuck edmonton in round 2, by round 3 i’m happy to see my countrymen celebrating going to the cup finals because i’m not a bitter person that needs to see my rivals suffer.\n\npeople that claim “real fans hate their rivals” would probably be the same type to tell that ben stelter kid sorry but i hope your team gets shit kicked in the finals, because they have no joy in their lives. It’s just a game, don’t have to be mad.",
            ">  Sports fans these days are so soft,\n\nGatekeeping sport fans now are we.  You make it sound like a Hatfield–McCoy feud.  I could not care less about the Oilers, I am happy fellow Canadians are happy.",
            "And when ads are flashing on the boards and ice, and printed on every jersey, it's getting harder and harder to not see these teams as nothing else than money-making-off-your-back corporations.\n\nAnd we're suppose to fervently support them like it was the 1950s?",
            "/r/Canada try not to hate everything challenge: Impossible",
            "It's that kind of comment that has made me enjoy the hate-cheering side of hockey.  You guys would be way worse if the Leafs were playing right now.",
            "The owners are definitely happy.",
            "I know Florida people be doing weird shit",
            "Can't imagine what that feels like?\n\nMaybe one of the engineers working on the Death Star?",
            "“Only bitter angry people cheer against their rivals, especially if the team is from the same country” what a ridiculous hill to die on lol.",
            "Hockey is a business first and foremost. A fact that gets mentioned constantly. Yet people don’t believe it?",
            "Only about half the teams in the NHL have jersey sponsors.  So no, it's not printed \"on every jersey\".  And to be honest, have never even seen them until I just looked them up.",
            "But they aren’t are they? Honestly I could care less, I’m just glad they made it this far.",
            "“that’s not how quotes work”",
            "I'm happy for you guys to have your team performing this well.  I'd prefer if you lost on Monday, but I'll be happy for the diehards if they win.",
            "For sure. Like I said no matter what happens. They got as far as they did."
        ]
    },
    "Second Canadian scientist alleges brain illness investigation was shut down": {
        "title": "Second Canadian scientist alleges brain illness investigation was shut down",
        "score": 1260,
        "url": "https://www.theguardian.com/world/article/2024/jun/21/second-canadian-scientist-alleges-brain-illness-investigation-was-shut-down",
        "content": "",
        "num_comments": 183,
        "comments": [
            "This post appears to relate to a province/territory of Canada. As a reminder of the rules of this subreddit, we do not permit negative commentary about all residents of any province, city, or other geography - this is an example of prejudice, and prejudice is not permitted here. https://www.reddit.com/r/canada/wiki/rules \n\nCette soumission semble concerner une province ou un territoire du Canada. Selon les règles de ce sous-répertoire, nous n'autorisons pas les commentaires négatifs sur tous les résidents d'une province, d'une ville ou d'une autre région géographique; il s'agit d'un exemple de intolérance qui n'est pas autorisé ici. https://www.reddit.com/r/canada/wiki/regles\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/canada) if you have any questions or concerns.*",
            "Hope it gets called \"Irving Syndrome\" in the end.",
            "This should honestly be a way bigger deal than it is. People should be furious about this",
            "HIggs is so far up Irvings ass he's brain damaged from lack of oxygen. You can be assured he's 100% getting kickbacks from his buddies at Irving.",
            "Has anyone checked for methylmercury poisoning as was seen in Minimata?",
            "No shit. The Irvings run NB as their private fiefdom and don't want any questions.",
            "Suspicious...",
            "“In the spring of 2021, I felt incredibly optimistic that an all of government effort to unravel the mystery was in the cards. However, in short order, the scientific effort was shut down at the request of the [federal and provincial] Governments,” Weiss wrote in the email sent in May.”\n\nProvincial and Federal",
            "anyone willing to post a TLDR?",
            "Data my ass!",
            "Does anyone have more information regarding this? Like where at exactly in NB and the earliest known cases? My father grew up in Sackville, NB and had severe restless leg syndrome where he would shake in his sleep and eventually developed tremors before he passed in 2018. He had lived there till his late teens back in the 80’s but frequently visited until his death. It’s scary to think these problems he had (they aren’t hereditary in our family) could have been linked to so many more.",
            "Of course scientists are being muzzled on this.. Were talking about a situation that makes the Walkerton situation look like nothing..",
            "Sounds like lead poisoning",
            "our MPs are corrupted traitors... investigations are shut down... lol i hate this country.",
            "Something new every fucking day.",
            "It's clear the only logical explanation for this is some sort of zombie outbreak, and the government is trying to keep it quiet to avert panic.",
            "So long as we refuse to vote for anything other than Red Capitalism or Blue Capitalism the Irvings and the rest of Canada's oligarchs are going to keep doing this shit with impunity.",
            "[removed]",
            "Considering the federal government literally has a reputation for conducting medical experiments on unsuspecting Canadian populations [[1](https://en.wikipedia.org/wiki/Unethical_human_experimentation#Indigenous_populations_in_Canada)] you'd think they'd be especially eager to get out in front of this and prove it wasn't that.\n\nUnless, of course, it *was* that.",
            "858",
            "Any similarity to the Havana syndrome, or not?",
            "[deleted]",
            "[removed]",
            "ha thought the same thing about it's likely culprit and cover-uppers. that's a punchy name, love it. Irving Syndrome",
            "Why Irving?",
            "I never want to hear a Liberal supporter bitching about Harper muzzling scientists ever again. First, under Trudeau many scientists say they are just as muzzled, and second, *shutting down research into a mysterious neurodegenerative disease affecting hundreds of people is a thousand times worse.*",
            "This is an outrage",
            "Unless the reason is that they discovered it's genetic and the result of a constrained gene pool. That would justify not treating it like a contagious or environmental concern... but there's no way to share that information successfully and without causing upset. (Hold my beer.)",
            "Higgs got into politics after 33 years of working for Irving.",
            "New Brunswick is the Irving fiefdom, it’s laughable if anyone thinks the provincial government has the final say in important matters in the province.",
            "...but oil companies are import for Canada's economy!",
            "If there isn't already one, someone involved with the issue might benefit from starting a GoFundMe specifically to raise funds for soil tests, water tests, etc etc. \n\nLike, the federal scientists aren't allowed to investigate it as part of their jobs, but that doesn't stop the general public from gathering samples and sending them to labs etc.\n\nIf nothing else a GoFundMe might help spread awareness, since news articles can't be shared on certain social media sites.",
            "Obviously, no evidence had been seen since it's never been examined.",
            "That's the opinion of the journalist.",
            "Canadaland (fuck Jesse Brown) did a couple podcasts in 2022 on it. It’s been a while since I listened but I recall them being pretty informative as far as dates. Some people thought it was the lobster 🦞",
            "Basically, bro look up prion diseases in deer, it basically turns them into zombies. Albeit that's not what is happening with the humans in New Brunswick, exactly.",
            "I live there and i can PROMISE you that its the Higgs gov they even smeared some Doctors.\n\nWe got one post blaming vaccines and this one bending over backwards to pin in on Trudeau.",
            "Nb has a conservative government",
            "Harper blocked publications regarding Agent Orange in our snow samples…give me a fucking break lol",
            "Why are you calling out Liberal supporters when the article also specifically mentions the Conservative provincial government? “My party really knows how to muzzle scientists!”",
            "The N.B. gov't is PC, not Liberal.",
            "Yeah turns out Liberals and Conservatives both blow donkey balls because they're both actually neoliberal and neoliberalism is the worst economic policy for anyone who isn't the elite.\n\nImagine carrying water for any of these people.",
            "Oh look conservatives believe in science now!",
            "> Hey Liberal supporters \n\n\nHey yourselves. Higgs government is conservative.",
            "Different. I think they originally suspected mad cow.",
            "Keep writing comments like this until one day you mysteriously can't anymore because your pathological apathy for human suffering has allowed a mega corporation that cares only about its bottom line to poison your mind (literally) with a slurry of toxic chemicals through your water, air, and food. Actually, you sure you aren't affected by this condition yourself?",
            "This has nothing to do with Covid vaccines lol, read the article next time",
            "Why would a worldwide vaccine have a side effect only in New Brunswick",
            "This has nothing to do with vaccination?",
            "God, why are there so many morons in Canada? Room temp IQs spreading misinformation to other room temp IQs and causing harm to innocent people.",
            "The Irving family own Irving oil and all the New Brunswick media",
            "The two running theories on where the brain thing came from is either tainted shellfish, or the massive amounts of pesticides that Irving sprays every year",
            "Irving is the one spraying glyphosate all over the province",
            "This 2022 [article that goes into detail about what happened to the investigation](https://www.cbc.ca/news/canada/new-brunswick/nb-mystery-illness-timeline-1.6311269) makes it clear that it was a provincial matter; NB brought the federal government's Public Health Agency of Canada in briefly and then later told them they were no longer needed.",
            "Seemed to me that the article was talking about the provincial government",
            "to be fair its the provincial higgs government mostly responsible for this. and higgs is basically just the irvings puppet he will do what they say\n\ni look forward to the documentary and class action lawsuits coming out of this once it is found that some disgusting irving industries shit was poisoning people in the area",
            "why can't you complain about both?",
            "It appears to be the provincial government, not the Trudeau Liberals, doing this. Health is, ultimately, a matter of provincial jurisdiction.  And while this scientist is unwilling to point the finger at one level of government or the other, previous whistleblowers have all blamed the province of New Brunswick.  As much as I hate to admit it, I don't think Trudeau or his government are at fault here.  Maybe they should be doing more force the province's hand here, but I don't think they are muzzling scientists.",
            "People can still bitch about Harper. I can hate more than one leader from these 2 corrupt as shit parties. Fuck them both.",
            "Fuck that, I'm going to complain about Haper *and* Trudeau muzzling scientists, and you should to.  \nVote some other party, so both LPC and CPC can finally collapse and new parties can replace them.",
            "You know, I really hate when people act like this.\n\nYou act like just because someone else did it means its ok your party did it.\n\nGrow up, this bullshit, both your behaviour and shutting down research like this, needs to end.",
            "We could have had Mulcair's NDP back in 2015. Can you imagine?",
            "Can't we bitch about both? Though to be fair, I hate the big two equally.",
            "I'm gonna complain about that still. Fuck Harper. Did generational damage.",
            "I will complain about it whenever i want. Two wrongs don't make a right. Both of those things can be equally wrong and both bad for Canada, the only team i care about.",
            "Nah fuck any government that muzzles their scientist",
            "It’s the Premier in NB who used to be an Irving executive…..\n\nHe is a far right conservative",
            "Wasn’t Trudeau. But yet again, people in this country treat him like he’s this grand puppet master pulling every string.  Meanwhile, most people in this country could not tell you the responsibilities of the federal and provincial government",
            "Liberals. Conservatives. Same same…. But different!",
            "All parties are useless and corruption to some extent. All political positions should be filled without any party affiliation and solely on what that person stands for. With the requirement that if they fail to uphold their platform they can be recalled. \n\nAlso, pensions can only be granted to someone who holds their elected position for at least two full election cycles. Pay will also be reduced in accordance with poverty levels and median Canadian income.",
            "Yah but the investigation was stopped before they could determine that. The people who wrote the emails complaining were the ones who would be qualified to say it’s genetic but they were prevented from looking into that as well",
            "The call is coming from inside the ass!",
            "It’s actually two separate companies, Irving Oil likely has nothing to do with this. J.D. Irving is like the likely culprit here, I don’t like either of them.",
            "Thanks to Trudeau",
            "What? Those parentheses don’t mean “this is my opinion”, they mean “this is a shorter way of saying what was said in the original text”.",
            "What are you talking about? It was a direct quote from Dr. Weiss, who is the scientific director of the Institute of Neuroscience, Mental Health and Addiction at the Canadian Institutes of Health Research (this is a federal agency) and a member of the Canadian Medical Hall of Fame for his research in neurogenesis. He won a Gairdner Award — one rung down from a Nobel prize — for discovering neural stem cells, upon which basically all the non-embryonic stem cell research in the world is built on. He may well win a Nobel prize for it.\n\nSo if that guy says the federal government squashed the investigation, he *knows* they did.",
            "This sub is exhausting. \n\nHow has the coverage of this been in NB, if any? I'm pretty sure we lost a family member in the Acadian peninsula to this prior to COVID and before this was even reported on nationally. She was fine, then degenerated neurologically over the course of like 6 months, then was gone. Her doctors were so baffled and couldn't find any cause. When this started to be discussed within the year following I became convinced she'd been an early case.",
            "I don’t doubt it but this is both levels of government working together to squash this.",
            "“In the spring of 2021, I felt incredibly optimistic that an all of government effort to unravel the mystery was in the cards. However, in short order, the scientific effort was shut down at the request of the [federal and provincial] Governments,” Weiss wrote in the email sent in May.",
            "Read the article.",
            "100%. Until people recognize the obvious reality that all the parties are compromised and willing to screw us (even the NDP, which backs mass migration) we will continue to be sitting ducks in this supposedly progressive country which tolerates money laundering via residential real estate and food price fixing.",
            "Because this isn’t just government workers upset that they have to follow a standard communications policy.",
            "Read the article. \n“In the spring of 2021, I felt incredibly optimistic that an all of government effort to unravel the mystery was in the cards. However, in short order, the scientific effort was shut down at the request of the [federal and provincial] Governments,”",
            "Pretty much all university research grants to study stuff like this comes from federal money, not provincial.\n\nThe Liberal government also shut down research into the Arctic ecosystem, forced retirement of a whole bunch of climate scientists at Environment Canada that were doing extreme weather research and prediction, etc.\n\nOnly somebody who's never been in a STEM department at a university campus would call this Liberal government pro-science. Granted that's a lot of people, especially journalists.\n\nThe only pro-science thing they've actually done is the recent budget that raised post-doc salaries after they had been frozen for over a decade.",
            "Wild to find someone else with a basic level of competency on this sub. I hope for both our sakes we find our way as a country before its too late. I hope you have an incredible rest of your day.",
            "[removed]",
            "[removed]",
            "Finger pointing and name calling instead of critical thinking … it is half the joy of this subreddit ",
            "Because this has become a team sport.",
            "Because they're not equivalent. \n\n\nHarper required government scientists to communicate with media through their department comms, which they are still required to do under Trudeau.\n\n\nThis is shutting down research into a neurodegenerarive disease without explanation for the sudden change of heart.",
            ">why can't you complain about both?\n\nYou can. The point they're making is the absolute abject hypocrisy of Team Red and the media.  They were screeching from the rafters over Harper. And are dead silent on this, or when Trudeau muzzled and cut funding from researchers that showed information contrary to public views on climate change and polar bear population levels.",
            "Because that was over 10 years ago at this point.",
            "Harper wasn't muzzling scientist. That was a made up conspiracy theory that CBC jumped on to scare people out of voting for him in favor of the Liberals. \n\nWhat actually happened was that some scientists got fired for speaking on behalf of the government without going through the proper channels. That's it. \n\nIf I started speaking on behalf of my company without going through the proper channels, I would also be fired. Nothing about the process has changed since Trudeau got elected and if anything he is legitimately censoring scientists.",
            "Fuck em both is also my motto. Which extends into fuck em all.",
            "I want to know where you get your news",
            "The other options are exponentially worse",
            "Tbh, I regret voting for him after I saw the way he behaved in parliament. I'm glad he didn't get elected as PM, or even opposition leader",
            "No, square brackets generally denote information that has been added to the quote in order to clarify it or make it grammatically correct.  If text is redacted for brevity, that is denoted with an ellipse.",
            "Those are \\[square\\] brackets, not parentheses, and I'm not talking about the bracketed section.",
            "There was an earlier article (notice this is the second scientist, there was a first) where it was clear the NB government ordered the investigation to be shut down.",
            "He just said govt, the author added [federal and provincial]",
            "Is there a source with him saying that? The email bracket part was inserted by the author. Presumably it just said \"by the governments\". Don't doubt it, this just isn't clear on it",
            "The local gov has really been trying to quash it - thankfully national news outlets kept it alive long enough for there to be a more public conscience about it.\n\nWhat gets me is no one is doubting that there is a cluster of brain diseases even happening to young people in a specific geographical area.\n\nDetractors seem fine to say \"Its not novel, case closed\" and its really sad as there are a large group in cluster with these unexplained symptoms.\n\nNovel or not there should be more local alarm into the cause.",
            "> This sub is exhausting. \n\n\nThat's by design. It's a tactic called civil POV pushing. The point is to make it exhausting to the point that dissenting users just give up or lose their cool and get banned, leaving behind a well cultivated right wing user base that can push their agenda without opposition.",
            "K. C. Irving once said he's never lost an election, meaning he controlled both political parties in NB and Canada.",
            "First it's an unproductive comment stating \"this is 10000% the fault of Liberals and Liberal voters\"... and now it's a \"both level of government, including conservatives\"\n\nMake up your mind lmao",
            "The whole article is pretty vague about which govt. [federal and provincial] is not part of the quote, it's added later",
            "Did you?\n\n\"A year later, a committee assembled by the province determined that the patients probably had been misdiagnosed and were suffering from other diseases.\"\n\nIt was a provincial committee that determined this. At worst it might be both governments to blame to some degree perhaps, but the Feds really just provide funding, it's up to the provinces to actually deal with these things.",
            "I think ppl are responding to you like this bc it's dumb that you've zeroed in on this specific detail and are trying to frame it as just the Liberals are at fault here. This is just disingenuous and a sad attempt at point scoring. If you wanna act like that's not what you were doing, feel free to edit your comment to reflect that it's both levels of govt at fault so it looks less like whining and team worship.",
            "I'm super concerned that you claim to have read the article and this is your conclusion. It's possible you're suffering from the brain illness, get checked.",
            "Apparently logical thought isn't your buddy.\n\n\n\n\nWeird to see people so afraid of any criticism towards Conservatives...",
            "\"But by mid-2021, New Brunswick appeared to have halted the probe with little explanation.\"\n\nIt seems the author of the article is doing some heavy lifting with \"[federal and provincial]\" but isn't supported with the FOIP evidence that is brought up later in the article.\n\nThe definitive thing is the provincial government squashed the investigation. We would need to FOIP the federal government to know if they also squashed it on their own accord and not at the behest of the provincial government.",
            "As a couple other NBers have already said... It was the provincial government that shut it down and tried to bury it, not federal. Federal backed off after the provincial government started a bullshit committee that spent a few months 'investigating' and concluded that 'people are probably just misdiagnosed lol'. Provincial government then proceeded to try and make the whistle blower doctor look like a quack.\n\nA lot of people assume it has to do with the Irvings and their use of glyphosate. My assumption has been that it has to do with the algae.\n\nBlaine Higgs, the current incompetent sexually-repressed premier of NB who has been internally destroying the NB PC party due to bad leadership, has ties with the Irvings. So, a lot of people think that he's covering this up to protect Irving. Some speculate it's in the water and the government wanted to hush this to protect our fishing industries.\n\nI am from NB, and my family suspects a relative may have had this after dying of what was then assumed to probably be CJD like a year before this blew up in the media.\n\nMaking an unproductive comment blaming the Liberals... and then trying to backtrack and say it is \"both Federal and provincial\" while the NB government is conservative... is just... lol.",
            "It was the provincial government that shut the investigation down in this case though.",
            "You're using magical reasoning.",
            "Ok whatever lol.  The people were affected and the research shut down before the vaccines were available. \n\nThey identified and started tracking the disease before Covid even made its way to North America and WELL before the very first vaccines were available.",
            "Wtf are you talking about?",
            "Using your dumb logic why is this only confined to NB?  Where’s the billions of brain eaten bacteria all over the world. \n\nIt’s 2024. An Anti vaccine stance is just comical at this point.",
            "Yes as opposed to the leading theory of pollution of glyphosate by Irving…. You’re an idiot",
            "I knew it! How deep does this go?",
            "become? always has.  Now we just have the internet to spread our bais",
            "What colour are you?",
            "Harper wasn't muzzling scientist. That was a made up conspiracy theory that CBC jumped on to scare people out of voting for him in favor of the Liberals.\n\nWhat actually happened was that some scientists got fired for speaking on behalf of the government without going through the proper channels. That's it.\n\nIf I started speaking on behalf of my company without going through the proper channels, I would also be fired. Nothing about the process has changed since Trudeau got elected and if anything he is legitimately censoring scientists.",
            "Trudeau made that policy so much worse and it absolutely affected the healthcare system in a big way. \n\nCanada used to generate 20-60 alerts a year for global disease outbreaks, to try to catch the next covid before, it got as big as covid. Under Trudeau (2018 specifically) this dropped to 1 a year, because scientists had to run their stuff by administration instead. So all of the sudden you go from 20-60 annually to 1 because scientists are no longer allowed to speak and share their data. \n\nGPHIN was the lab, and the source for this anecdote is the AG of Canada.",
            "Didn’t know Higgs was a liberal",
            "that makes as much sense as tits on a duck",
            "Why?",
            "That's some hot bullshit. Sure the major parties are all bad, so just vote a party that you agree with even if they've no hope of winning.  \nIt's not like if you vote for any of the big three it will change things anyway, so just vote on your ideals.\n\nDon't got an option that's better? Run yourself.",
            "I have no idea what you're referring to.",
            "Clarity and brevity, I would say but sure",
            "You still haven’t explained how what I quoted is the opinion of the journalist.",
            "You're right. Even if it's not novel that's a really scary thing to have occur \"randomly\" and it needs to be addressed. Novel or not, it's still happening. Dang.\n\nI didn't live in NB for long myself (less than 3 years) but I remember being so frustrated at the weird amount of complacency towards, like, everything. And the intense amount of influence the Irvings have over the province. Even when I ask my in-laws now about it they just don't seem to know what's up either. NB is a wild place. \n\nI sincerely hope something is eventually figured out. It was a terrifying thing to witness happen so rapidly to someone so vibrant and loving. I hope you and yours are and forever remain untouched by it.",
            "all it takes is someone with the right skill set to scrape all the news data and find correlation points. a neural network ai you've trained yourself on a purpose built dataset may be perfect for doing something like this. doesn't even need to be a language model, it could just look for straight word correlations... have at it smart reddit developers/detectives...the data doesn't lie",
            "> In the spring of 2021, I felt incredibly optimistic that an all of government effort to unravel the mystery was in the cards. However, in short order, *the scientific effort was shut down at the request of the [federal and provincial] Governments*,” Weiss wrote in the email sent in May.\n\nReading the article helps. \n\nAs does actually bothering to look at science funding under this Liberal government, not the rhetoric in the media bout how pro-science they are.",
            "Some people were never taught how to think when growing up... like logic and reasoning skills",
            "How deep is their ass?",
            "All the way to 1985",
            "okay, but why not complain about both?",
            "It has not always been a team sport. Don’t forget that we used to have intelligent civil political discourse. We will get through these dark times and back to that.",
            "Harper definitely did change communication protocols for scientists. Eg https://www.macleans.ca/society/unmuzzled-government-scientists-ready-to-discuss-a-decade-of-work/",
            "So I can judge the source of your opinions instead of you",
            "You called out the LPC and CPC, I'm saying the other options are worse\n\nNDP- used to be a valid option, now they are garbage\n\nBloc- if you don't live in Quebec they are irrelevant \n\nGreen party- bunch of radical wackos\n\nPPC- for the small segment of society that thinks it's cool to have a 8 by 16 foot fuck Trudeau flag flying on their front lawn\n\nWhat else is there? Christian heritage party if you want to ban abortions and teach creationism in school",
            "No, square brackets should never be used for brevity.  That contravenes most style guides.  As I mentioned, an ellipse denotes a redaction for brevity.",
            "The square bracketed content was added by the journalist to try to explain the word 'governments' in the quote. It's probably accurate, but take it with a grain of salt.",
            ">dataset\n\nThe problem is that Higgs gets all his data from his ass.",
            "How many people have pointed out to you that that quote is essentially meaningless in respect to what actually went down. But you are ignoring everyone and everything and clinging to a vague reference in an email.",
            "But that \"federal and provincial\" is disingenuous: the provincial government shut it down, the feds then were left in a position of being told BY THE PCs to shut it down. So explain exactly how it's not the PC's fault again? They asked for it all to go away. The feds were relying on the province's call on this.",
            "It's more insidious than that. These people were taught how to think, just by right-wing nut jobs who don't care about anyone but themselves.",
            "Cavernous",
            "Because when it comes to politics many treat it like a Leafs VS Canadiens  game. \n\nYou must pick a side and die for it.",
            "because it diminishes the importance of trying to fix the current problem, which is inarguably worse than previous one people want to bring up because they hate the party name.",
            "Yes, he wanted them to speak on official channels. Trudeau is actually muzzling scientists by suppressing research into a strange brain illness.",
            "I'll leave it to your imagination.",
            "> Don't got an option that's better? Run yourself.",
            "Spoiling your ballot in protest is a legitimate democratic expression of your frustration.",
            "> PPC- for the small segment of society that thinks it's cool to have a 8 by 16 foot fuck Trudeau flag flying on their front lawn\n\nYou've never even looked at their platform. [Why don't you try that instead?](https://www.peoplespartyofcanada.ca/platform)",
            "That’s not true, they are used to alter an original text or source in any way, including for brevity, which sometimes but not always falls under the consideration for clarity.",
            "For context for others who may read the above comment Premier Higgs is quoted as saying:\n\n\"Data my ass!!\"",
            "It's not a vague reference; it's literally what the entire article is based on.\n\nBut hey, keep denying facts while you trumpet how pro-science you are.",
            "Sure buddy. The very scientist that the article is about and wrote the email is disingenuous. Really. \n\n> The feds were relying on the province's call on this.\n\nTell me you don't know WTF you're talking about without telling me you don't know WTF you're talking about.",
            ">Because when it comes to politics many treat it like a Leafs VS Canadiens game.\n\nJust like the Leafs and Canadiend, I think that both the Liberals and Conservatives suck.",
            "Did you read the article? Can you tell me the difference between a federal and provincial government?",
            "Of course I have looked at their platform.",
            "A quote should never be altered in that way for brevity as it fundamentally alters the quote.  In this case, The Guardian uses square brackets exclusively to interpolate words for clarity, and even then they are to be used sparingly.  They would not use them for brevity sake.",
            "The [ ] is the authors inserted poin that's not backed up elsewhere. That's the point they're making ",
            "The provincial PCs shut it all down. Sure, the feds didn't force the issue, but you can't seriously be trying to put the blame mostly on the Libs for this. If the provincial gov't backed the investigation it would have gone forward, and everyone in N.B. knows that.",
            "They get used to replace words for clarity too, if the quote was using pronouns or ambiguous noun phrases that have clear meaning in context but not in an isolated quote.",
            "Would you not agree that sometimes in these cases clarity and brevity are the same thing? That clarity is accomplished by brevity, made possible by the use of square brackets?",
            "Yes, I would consider that another example of adding words to an isolated excerpt using square brackets for clarity.  This follows my argument as they are used in an additive way, not a subtractive one.  The word being used to replace the pronoun is generally longer, so it can't be said to be there for brevity's sake.",
            "In the broader sense, I don't disagree that they can be similar things at all.  In terms of editing for a newspaper, however, if you require brevity from a quote, the way to accomplish that is either to excerpt only a small portion of the quote, or to use an ellipse to skip an inessential portion of the quote.  When you opt to excerpt a small portion of the quote for brevity, you may need to use square brackets to insert some terms from the full quote for clarity."
        ]
    },
    "Ontario Science Centre closes after roof in danger of collapsing under weight of Doug Ford’s bullshit": {
        "title": "Ontario Science Centre closes after roof in danger of collapsing under weight of Doug Ford’s bullshit",
        "score": 581,
        "url": "https://thebeaverton.com/2024/06/ontario-science-centre-closes-after-roof-in-danger-of-collapsing-under-weight-of-doug-fords-bullshit/",
        "content": "",
        "num_comments": 41,
        "comments": [
            "While satire posts are popular we understand that not everyone enjoys them. If you wish not to see them please use the filter on the sidebar or set your own filters to block satire content or websites.\n\nLa satire est populaire ici, mais nous comprenons que tout le monde ne l'apprécie pas. Si vous ne souhaitez pas les voir, veuillez utiliser le filtre sur la barre latérale ou définir vos propres filtres pour bloquer le contenu satirique ou les sites Web.\n\nFilter out Satire - Filtrer Satire: https://st.reddit.com/r/canada\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/canada) if you have any questions or concerns.*",
            "I keep hearing about his developer buddies. Who are they? Maybe everybody should know who are pulling the threads on him.",
            "Alright that’s a great title.",
            "Make no mistake. There was only $13 million of repairs that were needed to fix the roof. Ford spent $45 million on propaganda ads alone. The money was there to fix it. He's moving the science centre only because his donors paid him to do it. It's pure corruption with this fucker, every single time.",
            "Once again, the Beaverton proves truer than any other news source. The government has been refusing all urgent repair requests from the OSC for over five years now. They deliberately let it become unsafe so they could say they *had* to close it and move it to Ontario Place where his cronies will profit from building the new one and profit more from developing the land the current one occupies. This is so transparent it’s disgusting. At any time they could have repaired it in the current location for a fraction of the cost, they still could, but then he and his developer buddies aren’t making any money. Ford seems to have hundreds of millions to waste on very slightly accelerating our ability to buy beer in corner stores, but none for maintaining an Ontario institution that has educated and entertained kids for decades. Typical Doug Ford government.",
            ">TORONTO – After standing for 54 years as a testament to midcentury architecture and a source of memories for generations of young people, the Ontario Science Centre was announced to be closing today, the result of strain on its roof as it struggled to support the added tonnage of Premier Doug Ford’s bullshit.\n\n>“The bullshit began to gather on the northern side of Raymond Moriyma’s famous building just after Ford’s reelection, when he suggested that the facility was in need of modernization while simultaneously refusing to fund those efforts,” said structural engineer Dr. Samuel Konstanz. “By the time he announced a plan to move the whole thing to Ontario Place in order to benefit his real estate donors, the support beams were completely unstable.”",
            ">Ms. Surma did her very best to pretend that the roof was an immediate concern that warranted the facility closing, going so far as to claim in a press release that it could collapse if these upcoming summer months resulted in enough “snow accumulation.”\n\nThe best part right there!",
            "Dougie has an endless supply of bullshit unfortunately.",
            "Classic Conservative tactics: \"create a crisis and then do what you've been planning\". They've been working on that roof since last summer, how could they not know the roof was going to fall down? Sketchy Ford family; check out the 2013 Globe and Mail article: Rob Ford's crack video, the sister Kathy shot in the face by her ex and the other ex in jail for murder, Randy Ford charged with kidnapping and Doug, the high-school drug dealer who wasn't just selling pot.",
            "> Ms. Surma did her very best to pretend that the roof was an immediate concern that warranted the facility closing, going so far as to claim in a press release that it could collapse if these upcoming summer months resulted in enough “snow accumulation.”",
            "Doug does have a huge porch.",
            "Perfect title doesn't exis......",
            "First one I actually lol at in a while haha",
            "As some one from Sudbury I can now say suck it Toronto we have a science center and you don't ",
            "All joking aside, the fact that the science centre roof is at this level of disrepair shows that Canada’s infrastructure is crumbling. We see it with roads in Quebec as well as other buildings in that same province too. I get this is a provincial matter but it reflects poorly on the country.",
            "Im not thrilled about this. However, for some\nPerspective, sometimes the person who ends up with the hot potato was not the person who cooked it.",
            "Remember when Doug allegedly had an affair on his wife with MPP Kinga Surma? Such good memories.",
            "This fucking topic.  People complain that we don’t do anything to advance what Canada has to offer and Ontario.  \n\nFord is planning on building a new science center that is more accessible for people to get to, and more advanced facility, but of course, because ford is doing it, every hater comes out of the wood work to hate it.\n\nLike holy shit.  There are more valid things to hate Ford on.  The science center is old.  And it’s not easy to access via public transit for those outside the city.\n\nThe hate for Ford making a new one is partisan bs.",
            "Describes every politician in Canada right now.  The talking Rolex says there is unspeakable foreign interference, which he cant possibly force an end to by dissolving government, maybe that's it?",
            "two of the famous ones are Silvio De Gasperis and Michael Rice, because they were named and interviewed as examples in the greenbelt development scandal ethics commissioner report",
            "Check who shows up to his daughter’s stag parties for a hint",
            "Because these people are talking out of their ass because they're butthurt about the fact that the vast majority of the country has learned that \"progressive\" policies as defined by the liberals and NDP have actually resulted in a regression in our society and quality of life.\n\n\"Safe supply\", soft on crime policies, racist Gladue sentencing, mass unchecked immigration, etc etc.\n\nAll the left can do now is import Trump fear despite the fact that Canadian conservative parties are further left than even the US Democrats are.",
            "It’s essentially a renoviction lol",
            "its \"moving\" lol they will just never build a new one.",
            "They need the $13 million to paint the lines on the new parking lot at the spa.",
            "source on the 45 mil ads for moving the science center, not the therme spa ones. that doesnt count",
            "And the engineer's report never said that the place should be closed down. They said those were minor repairs that needed to be fixed.",
            "Over five years? My wife worked there when she was a teenager in the 90s and parts of it were falling apart then.",
            "They haven’t provided the funding or approvals for repairs/renovations for years now. “Suddenly out of nowhere” the roof is unsafe. Now Ford and his government, who have wanted to see the science centre moved and the site sold to developers who attend his family functions, get to immediately and indefinitely close the site. \n\nThe government will now say “we’re not spending on an old building, we’d rather just move it to Ontario Place - where our friends at therme and whoever gets the contract for the parking arcade we were ‘forced’ to build will profit endlessly from schools and private citizens!” \n\nDon’t forget the one extra slice of “fuck you” though! The move makes the science centre less accessible to children in uptown, Scarborough and York region. But placing it at Ontario Place just so happens to also make it more accessible for ford nation and conservative strongholds points west.\n\nIf they’d spent the money to upkeep the building they wouldn’t have to spend the hundreds of millions to build a new one at all. So clearly the party of fiscal responsibility must have other motives. Since Ford’s government has already been caught working sweetheart deals, Occam’s razor says it’s more grift off our backs.",
            "I think naming and shaming these folks would be the best way to go along with going after the puppet. The puppet has no shame.",
            "So how do you feel about ford breaking the beer store pack of beer contract one year before expiry and paying 225 million dollars of taxpayer money to the ownership group to do it?",
            "A fine example of Taenia Solium brain.",
            "Now that’s some fine propaganda.",
            "on a more rational response.\n\nI understand that sometimes especially with the heavier topics like immigration, crime and drug use, it can feel like regression, but theese arent really unique to liberals and the left. They become a problem due to factors outside of our control\n\nImmigration is sky-high because capitalist industries love cheap labour, Liberals had to step in because of relaxed regulations encouraged by capitalists\n\nCrime feels high because it sells clicks. It really isnt. Like the subway ttc attacks. Canada is a very safe country. The idea that reduced sentencing increases crime is just not statistically true. Rehabilitation does work, we just wont spend the money to make it so.\n\nSafe supply doesnt work because we wont spend the money to help them get to step 2. They stay homeless because they dont have permanent secure housing, secure jobs or income.\n\nWhile yes Canadian conservatives are quite centrist, alot of the problems Canada currently faces are not unique to the liberals",
            "a small technicality, they had to have the repairs done by end of October.\n\nHow long would the repairs take? Remember liability is big here, if even 1 day of delay and the roof isnt fully repaired in November whose fault is it that the roof collapses and kills someone?",
            "That’s not just on ford.  The last government didn’t either, and the one before that.  Guess what, shits fucked now.\n\nEven if it wasn’t in a state of disrepair, it’s an old building.  Not easy to get to.\n\nWhy are people fighting a new building, which allows the science center to get new equipment, and an opportunity to allow it to be accessed easier by the general public.\n\nThe arguments to keep it open don’t hold up to any type of critical thought.",
            "First of all, it's a smaller venue. Also I don't know where you get the idea that it's easier accessible. The new location is butt fuck down in the middle of one of the most congested area of the city. I'll bet you to start at any equal distant points between both locations and it'll take you almost twice as long to get down there than it is to Eglinton. And then there was an Eglington LRT station right at it doors at the current location, it would've made it even more easily accessible at Eglinton with the LRT. And it also wasn't fucked. The engineer's report stated that they just needed $13 million to fix the roof. The same roof that Ford is saying is crumbling. And the same report that he used as justification said that it doesn't need to be closed down.",
            "It’s being moved to ontario space.  That is infinitely easier to access than its current location.\n\nAnd they’ll have more space to work with in that location.\n\nIt’s an upgrade.  The old building is that, old.  Hard to access, and not getting as much traffic as it could.\n\nThe move is an overall better location.\n\nYou’re just pissed cause ford made the decision.  Get over yourself and your tribal politics."
        ]
    },
    "Canada reportedly preparing to evacuate 45,000 citizens from Lebanon amid war fears": {
        "title": "Canada reportedly preparing to evacuate 45,000 citizens from Lebanon amid war fears",
        "score": 447,
        "url": "https://nationalpost.com/news/world/israel-middle-east/canada-reportedly-preparing-to-evacuate-citizens-from-lebanon",
        "content": "",
        "num_comments": 503,
        "comments": [
            "Why are 45,000 Canadians living in a foreign country in need of evacuation",
            "Again? Like we did in the early 2010s or late 2000s in Lebanon or Syria? When the government shelled out $500 million and all they did was whine at the government for not rescuing all 60,000 of them fast enough...? The same ones who within 6 months, 80% had returned back to the country?\n\nNo. Just fucking no.",
            "Why? The courts have already decided that there is no right to be brought back to Canada. They can buy their own flight tickets.\n\n>In its analysis of past legal decisions, the appeal court wrote that the Charter protects against exile and banishment but \"offers no encouragement for the idea that Subsection 6(1) includes a right to be returned to Canada.\"\n\n[https://www.ctvnews.ca/politics/federal-court-of-appeal-canada-not-constitutionally-obligated-to-bring-home-suspected-isis-fighters-1.6421360](https://www.ctvnews.ca/politics/federal-court-of-appeal-canada-not-constitutionally-obligated-to-bring-home-suspected-isis-fighters-1.6421360)",
            "Are you nuts?  Tell them to book a flight.  They just have a Canadian passport for convenience, don’t pay taxes …",
            "Why don't they go to the nearest safe country?",
            "How many times are we going to do something similar?   I’d say if they’ve not lived in Canada and paid taxes in Canada for 6 months in the past 2 years they can sort themselves out.",
            "They should be taking care of that themselves. They knew the situation when they went back there. It's not like Lebanon has been a beacon of stability in the last 40 years.",
            "What a fantastic example of why birthright citizenship needs to end.",
            "Not again.",
            "It cost 95 million to bring 15 000 of them in 2006. Most returned within a month.\n\nFunny that Lebanon is better place to live until you need Canadians to buy you a plan ticket.",
            "Lebanon isn't at war. The airports are open and airlines are functioning. If people want to leave, they are capable of booking flights just like everybody else.",
            "45,000 Canadians live in Lebanon?\n\nBro, what the f*ck is wrong with our citizenship process?  We need to cut this bullshit out.",
            "Fuck that. They chose to live over there. Let em book their own way home",
            "45,000 more people for our social assistance, health care and subsidized housing.. most of whom likely haven’t ever paid taxes.. perfect",
            "This is not our problem.",
            "Canada: doormat of the world",
            "45k more people to throw into hotels on our dime. Sweet",
            "There is a simple solution here.\n\nLike the U.S. we should have it that anybody with a Canadian passport pays Canadian taxes.",
            "\"Citizens\"...",
            "More Canadians of convenience",
            "Disgusting waste of tax dollars while our country crumbles into a 3rd world sh1t hole. Anyone intentionally putting themselves in dangerous situations, then ESPECIALLY intentionally staying there knowing its a dangerous place can perhaps even revoke their citizenship. How absolutely pathetic Canada has become",
            "Google flights shows daily flights continue out of Beirut.  They could leave now if they want, rather than wait for a big rescue mission.",
            "Guys they’re not flying everyone to Canada, they’re flying them to the nearest safe country which is most likely Greece. From there, they would have to book a flight with air Canada for 1300$ one way. This is what I had to do when they evacuated Israel in October",
            "I've seen this movie vie before.  \" Canadians tax payers pay out millions and then they return a month later\".",
            "This isn't like the Gaza strip where it came out of nowhere and a bunch of people just happened to be there. We KNOW Israel is going to go after Hezbollah and that Lebanon is a bad place to be. \n\nThese people can start getting their own flights to Canada, or anywhere else. If they stay they are WILLINGLY placing themselves in danger. If someone decides to go boating in the middle of a hurricane I don't give a damn if they drown.",
            "Remember when we did this in 2006?",
            "Let us all wish a swift death to Hezbollah and for the safety of Canadians.",
            "Great….",
            "There are 45,000 of us in Lebanon???",
            "Or, you know, Lebanon could force a rogue militia operating in the country to stop launching rockets and mortars at a neighboring state for the past 9 months. Just spit balling here.",
            "The receivers of stolen cars from Canada.  Now they want to evacuate.  ",
            "Here we go again......",
            "The real question is why do they need evacuation? We should be concerned why is israel killing everyone around them. israel stops murdering people, no need for evacuations",
            "Yay…45k more here. 🤦‍♀️",
            "Yall remember when this country was great and we were proud to be part of? Not so much as now",
            "Bring back the actual people that live here, the ones that are only Canadian for the passport can fuck off.",
            "End jus solis!!!!",
            "Why is the Times of Israel writing reports for the National Post? Should they do RT and Xinhua next?",
            "I never really understood Lebanese people.\nThey spend their life crying and nagging about the situation and how they can't wait to leave, and as soon as they are here, they want to go back for a summer vacation.\nCanada and other countries have been issuing advisories since October, and Lebanese just kept booking their summer vacation, because why spend summer peacefully in Canada when you can throw a few thousands of dollars and put your life at risk?\nOn the other hand people like us were counting the days to get their PR Visa to hop on the next flight and get the fuck out without looking back.",
            "Imagine Canada put the effort into pressuring Iran to stop funding the terrorists in Jordan and then 45,000 people would not need to be evacuated and there could be peace…\n\nToo much to ask?",
            "That's equivalent to the entire population of the Yukon. It exceeds the population of both NWT and Nunavut.",
            "Leave’em there please. \n\nThey’re grown up enough to make their own decisions on where they live, lol.",
            "I always wonder if these Canadians actually live in Canada or where they are needing to be evacuated from. I mean if you are a Canadian citizen and are  just using the country for your convenience at the tax payers expense then that ought to stop.",
            "I think we’re a backup passport at this point, nothing more.",
            "All you fuckers saying we should give up on our citizens haven’t read the fucking article lol. They are drawing plans to evacuate in case of war. Aren’t evacuating people yet. \n\nCanada has a large historical Lebanese population, and people usually leave to visit their family for a variety of reasons, be it sickness or else. \n\nWhy would anyone willingly leave Canada to go live in Lebanon if they didn’t have to. Jfc why so many people here are talking about everyone as if there’s a massively good reason to bail on Canadian taxes by living in Lebanon.",
            "Canadian citizenship is a free insurance policy for some people.",
            "FFS  Not Again. This is why Canada has to stop giving away **citizenships of convenience** like candy. How the hell can we get Trudeau the fuck out of office ASAP. This is why the Conservatives changed the laws after the last time this happened.",
            "There was an investigation on CBC I think a few years ago where they showed it was a whole organized business where Lebanese people would get help from immigration consultants into frauding the immigration system.  For example the consultants would pick up their mail at their \"Canadian address\" and do everything needed for their clients to obtain citizenship while never having lived here.\n\nMost of them never had the intention of living in Canada or contributing anything to Canada.",
            "Vote PPC.",
            "They have already had their free one.",
            "Fuck. That.",
            "Ah no. Nothing but additional problems come with this and none good. We can’t save the world and people need to accept this.",
            "Why are there 45000 \"canadians\" in lebanon? It is past time to tighten up citizenship rules and get rid of all these \"canadians\" of convenience.",
            "They are Canadians. Bring all of them back home. These comments are weird.",
            "Citizens of convenience",
            "Maybe they could just buy a ticket and fly home at their own expense?",
            "New wave of (Canadian) immigrants.",
            "More at the expense of Cdn tax payers need to pay up for people who by choice and more than willingly wanted to live in danger zones and now expect to be rescued.",
            "They pay no taxes to Canada and will be back in Lebanon in 3 weeks.",
            " Only Canadian tax payers should be evacuated.",
            "Health passport.",
            "Oh good. Another mass evacuation from a hostile area on taxpayer dollars for people who have contributed nothing to Canada ever and like the last evacuation of the area, will chill in government paid for hotels until it’s safe to go back to the region.\n\nFUCK OFF TRUDEAU AND START PRIORITIZING THE CANADIANS AND PR CITIZENS ACTUALLY HERE ON CANADIAN SOIL AND WANTING TO SUPPORT AND GROW WITH CANADA \n\nNope. All of his spineless ministers and those on the opposition are getting massive kick backs four housing a countries problematic people who will drain Canadian resources just to return home. \n\nEvery single person holding a grandfathered citizenship in south Lebanon and north Israel have no loyalty to Canada but know the benefits of keeping their dual citizenship and passports up to date so the Canadians will bring them to Canada and they can access all sorts of universal health care and income and food assistance programs just to fuck right off back to their home they are loyal to and raise their kids to know how to exploit these idiot Canadian law makers",
            "Fuck that dude. Fuck this shit. Write your MPs, make content, do whatever. When is it going to be enough?",
            "Why? Leave them there. They chose to live in Lebanon (again). We’re not a hotel.",
            "The government is so irresponsible with our tax money",
            "Canadians of convenience; whenever someone asks where they're from, they say Lebanon, but for now, they're Canadian.",
            "Remove dual citizenship.",
            "More PR stunt bullshit that Trudeau thinks will burnish his reputation. What he doesn't seem to realize is that he will only be remembered by Canadians as the PM who destroyed the country and by Liberal leaders as the man who made the LPC lose party status because they're gonna lose the election that badly.",
            "This Country is done! Trudeau wins! \nIt's a post nation state now. \nRuled by all mighty Trudeau/Liberals/NDP.....",
            "Where they gonna live?",
            "45000 will quickly turn into 5 million - distant relatives etc.",
            "No thank you",
            "Alright Feds. You better up your game this time. Be sure to bring lots of fluffy pillows  and make the cabins more comfortable. That  was one of the worst complains of our fellow \"canadians\" last time when you attempted to extricate them out from the conflict area. \n\n/s",
            "So the whole world has to help and pay for Palestinian, Lebanese, etc except Muslims countries... Ok...",
            "Disturbing the amount of people here have double standards on what they consider valid Canadian citizens when it comes to Canadians who live abroad in western countries and Canadians who live abroad in non Western countries.\n\nThe insanely regressive solutions most people are coming up with, sets the country so far back that it in fact closes opportunities for the average Canadian to the global market. \n\nYou might not like money being used for this, that's fine, but how about we don't start being racist in our criticism.",
            "R/Canada racists really showing their true colours with this one. Yikes",
            "Y’all acting like people don’t go on vacation. Article didn’t say they are living there.",
            "A Canadian passport isn’t worth the paper it’s printed on",
            "What are 45,000 Canadians doing in Lebanon?",
            "Why are there 45000 Canadian in Lebanon ? Last time it was good place to be was the 1960ies.",
            "When was the last time any of these 45000 Canadians lived for 6 months in Canada",
            "Canada is a lifeboat pretending to be a country",
            "You’re all going home if this county is lucky.  We want ppl with needed skills.  We don’t want India here.  Y’all suck.  We don’t want that brought into our country.",
            "I had dinner with the Executive Director (Ambassador) of the Canadian Trade Office in Taipei about ten years ago. When asked if the Canadian government would come get us if China invaded, he told me directly... \"You guys will be on your own\". I was cool with it.",
            "Nah fuck em at this point their QOL over there is better then what they can afford if tax payers (which I doubt they are) have to bail them out to get their asses out of a country",
            "Please no. Keep them. If you wanted to stay there. Die there.and plus. We can't fucking take anyone else. We need to start shipping everyone back",
            "Jesus christ, we might as well fly all the civilians from Palestine and Israel while we're at it and give them some land so we can end the dispute.",
            "Anti-Semitic \"Canadians\"",
            "Where will they live in Canada? There are no homes and the cost if living is astronomical. Who is paying for everything? Canada is being taken advantage of and we have no money left.\n\nTime to rethink our passport system.",
            "How bout no.",
            "Reading the disgusting comments here, it's really sad that so called \"Canadian\" here are opposed to helping one another. But it's reddit..bitch and whine about every fucking thing",
            "‘We neeed votes because the locals figured it out’",
            "again",
            "As if we aren’t already swamped with people. Send them to Manitoba or Saskatchewan or something",
            "Woohoo immigration galore",
            "Canada: The world’s lifeboat",
            "These aren’t Canadians. If your out of the country more than you live in Canada fuck outta here.",
            "https://y.yarn.co/61ca9b14-3639-4957-9c4a-643be1c253b7_text.gif",
            "We are full",
            "Hey Pierre can you end this farce of dual citizenship when you take power?  We have enough problems here at home.  Thanks.",
            "Again?",
            "Again 😑",
            "Not again…",
            "Wait till you find out Hong Kong has 300,000 Canadian citizens living in it.\n\nWe are a convenience passport because unlike the Americans we don’t tax passport holders who don’t live in Canada.",
            "Citizenship of convenience. \n\nThey show up, pop out some kids, then head back to their home country to live in their traditional culture. \n\nObviously, if they ever need healthcare they’ll come on back.",
            "Any number of reasons, including working for the Canadian government. There are thousands of Canadians living in nearly every country on earth.",
            "Because it basically means nothing to be Canadian anymore. \n\nOur government is handing citizenship out like it’s candy and people from all these countries are taking it for these very reasons.",
            "Dual citizenship",
            "Because National Post wants you to think that",
            "Canadians live all over the world bro. Almost 3 million Canadians live in other countries.",
            "They should have to pay the government for the evacuation cost.",
            "Snow birds\n\n\nI know many that stay there during winters and come for summer, how's that so shocking?",
            "> Why are 45,000 Canadians living in a foreign country in need of evacuation\n\nWhat are you accusing these Canadians of doing wrong?\n\nThese are Canadian citizens. What do you believe our citizens did incorrectly here? What am I missing? Are they not \"real\" Canadians or something?",
            "Persons authorized as Canadians...\n\nMost are not really  Canadians. They possess a dual citizenship, and old Canadian passport, or have a parent who was born in Canada a long long time ago.\n\nIt's the same issue with refugees from Palestine a few months ago.\n\nThey have no actial ties to Canada and likely no one in Canada to support them if they were evacuated here.",
            "Canada should definetly adopt citizen based taxation like the US. Not this live in a foreign country for 30 year, pay zero in tax, make zero contributions.  They wave your Cndn passport in the air when there a problem and say “save me”. Or worse… come back to Canada for the last 20 Years and use up the resources from the healthcare system.",
            "People can live outside Canada as Canadian citizens. People have jobs that make them do that, they have cultural ties, they might be there for business\n\nWe have so many snow birds going to Florida every year. If there was a major incident there we'd have done the same.\n\nThis is concern trolling.",
            "My employer sent me here. Guess I should die?",
            "Health care. Jump in a plane when you are sick.",
            "Yup.  My friends husband went to Lebanon last week, I fucking told him that there is a ! Travel advisory, he said \" what do you want me to do?\" .... so, yeah,  he just didn't give a shit. \nStay there then, jfc.\n\nEdit: a word",
            "I don’t understand why, if they could buy a plane ticket there, they can’t afford to figure out travel back?",
            "And with the recent change to citizenship laws we'll have even more of these citizens of convenience around he world.",
            "Yes, and the Liberal government did all they could to ensure that Canadians of convenience are able to vote in our elections from their actual countries, and recently gave them the ability to pass on their \"citizenships\" to their grandchildren.",
            "They’ll be asked to pay, and they’ll only be flown out to Malta or some other nearby country. \n\nAt least that’s what Canada did during the Arab spring.",
            "Citizens are allowed to vote. Free flights buys some goodwill",
            "Subsidize Canadian air travel? I'm not entirely sure if I'm being sarcastic though, so there you go.",
            ">Why?\n\nIs it really that perplexing of a question? Can you really not understand why Canada would try to protect and help it's own citizens?",
            "Lebanese fleeing violence =/= ISIS supporters.  In fact, the fact that they're leaving suggests that they have no interest in defending Islamic extremism.",
            "Aboslutely, they dont care about the country. Use it for free pass thats it",
            "The sad thing is, there are almost certainly people there saying “if I wait on booking my flight I’ll probably get it for free” knowing Canada will do this.",
            "You are correct most of the idiots here don’t realize they don’t pay taxes unless they live in. Canada !!",
            "Do Canadians living in the USA or Europe ALSO have a passport of convenience?",
            "They are /s \n\nThey likely can’t go anywhere else unless as tourists, and that’s temporary. If at all, they would be high risk of overstaying any visa if not accepted as refugees, which Europe and the middle east are about done with.",
            "Well that would have been Cyprus, but the leader of Hezbollahs threatened to start bombing Cyprus, if they help Israel. So I doubt Cyprus will allow Lebanese in.",
            "They are bombing this very nearest safe county right now. Not sure they will be welcomed there",
            "Why can't they come back home?",
            "As citizens they're entitled to come here. ",
            " Harper got tired of 'Canadians of convenience' and instead of flying them here every time the country they choose to live in goes to shit, instead he flew them to the nearest safe country. \n \nPeople bitched and moaned but it put a stop to this bullshit practice of an all expense paid vacation to Canada anytime your chosen homeland heats up. \n \nEither live here or don't, why should Canadian tax payers have to bail you out all the time?\n\nEdited for spelling.",
            "What are 45,000 Canadians doing in Lebanon?",
            "50. The Lebanese civil war started in 1975, largely fueled by - you guessed it - Palestinian militants led by Arafat and the PLO.",
            "Trudeau wants to flood Canada with people from everywhere and claim he is some sort of savior! \nWe might just be witnessing the anti-christ",
            "It is unsafe lately but there is a world of difference between 2024 Lebanon and 2014. Tend to happen when your currency become worth nothing overnight.",
            "It has to an extent. Only one generation can be born abroad to Canadian parents and keep their citizenship.",
            "Ok, anyone born in Canada should them prove themselves to be Canadian at birth.\n\nThis is a dumb take",
            "So no right of return?",
            "Stupid comment. Ukraine wasn't at war on February 23rd, 2022. Why didn't all those people decide to leave then? The airports were open, they could book flights just like everyone else.  \n\nYou aren't in a war... until you are. This shit can pop off MUCH faster than people realize.",
            ">Lebanon isn't at war. \n\nYet. Israel is doing things in southern Lebanon.  Whether that triggers an official response from Lebanon is a different question. \n\nLebanon would probably try harder if it didn't have to contend with NATO forces protecting Israel's criminality.",
            "I didn't agree with Harper on much but putting up barriers to citizenship was something I agreed with.  To become Canadian you have to pass a language test and live in Canada for 1095 days (3 years).  Harper changed it to 5 years.  Under most liberal governments the language requirement was waved for anyone over 55 years old or under 18 on the idea that old people have a harder time learning the language.  Harper changed it to under 14 and over 75.",
            "If it’s anything like the last Lebanon evacuation, most of these “Canadians” have never set foot on Canadian soil.",
            "It'd be easier to list the things that aren't wrong with it:\n\nAnd that's all.",
            "The article is like 3 paragraphs, and nowhere does it state these people are all living there. I don't know why everyone is assuming they live there. I have a Lebanese friend that goes for a month or so every year to visit family. Not everyone is abusing the system as you seem to think.",
            "You understand there are Canadians, born in Canada, integrated in Canada, that can choose to live outside Canada for multiple reasons. \n\nLet it be Canadian by birth or Canadian by naturalization, you can't have two different laws for Canadians.\n\nIf you, choose to go to USA for cheaper  housing and better pay, no one should question you on \"why are there 25000 Canadians in USA wtf\"",
            "No government funded hotels or healthcare priority either",
            "It's crazy how many people I know that have either us or Canadian citizenship because they were born there. They have never lived anywhere in us and Canada since birth and have mostly only vacationed there. The US ones usually have a state and pay taxes, the Canadians have literally no obligation. Plus Canadian passport also makes it easier to get other passports. \n\nIf Canada starts taxing them, most of these guys will change to us or European passports. Also the reason most of these guys live in middle east is because if you are American or Canadian, you get paid upto 10-20 times more pay than the regular people.",
            "Most of them won't stay here. They use it as a free vacation and return home when it stabilizes again - Canadians of convenience.",
            "No other developed country in the world does that. No, thanks. Just tell them to make their own travel arrangements and be done with it.",
            "Canada does ...",
            "Pepperidge Farms remembers.",
            "Pseudo Canadians taking out citizenship but living in Lebanon.  Canada is nothing but an insurance policy for these folks.",
            "Where will these people stay?\n\nI beleive it's very important for us to assist people in danger of getting stuck in the middle of a meaningless holy war, but where do these people stay.\n\n\nI remeber reports of Ukrainian refugees finding our lack of accommodations to be unbearable.I fail to comprehend how the situation could have improved since then.",
            "Why should I be concerned with their safety? They obviously aren't...",
            "And israel who is committing genocide right ?",
            "The rogue militia is essentially a state within a state and exists to serve Iran (they only take orders from Iran anyway). Hezbollah is better trained, armed and funded than the Lebanese army, Lebanon can’t force Hezbollah to do anything, just like we can’t force America to do anything militarily.",
            "If the theocratic ethno-state to Lebanon’s south needs to do is to stop committing war crimes and end its illegal occupations, I’m sure the rockets will stop.",
            "Judging by your posts, you need be locked up.",
            "Uhhh no",
            "These people are only \"Canadian\" for the passport. Many of these people came to Canada, got PR and promptly returned to their \"war-torn\" country. I have no doubt that MANY of these \"Canadians\" were also repatriated, the last time Lebanon decided to have a war. If you get citizenship in Canada, especially after claiming asylum, you should never be allowed to return to that country...you know...where you were persecuted???",
            "You can’t believe that.",
            "You are missing the unelected, but powerful First Nations rulers who have veto on all matters for development of the country.",
            "[deleted]",
            "45000 vacationers? You really think there's 45000 people on vacation in a war torn country¿. There's not.",
            "These folks haven't left their basements let alone the country. \n\nPeople go to another country to billion reasons, they can't comprehend that, yet half of them would move to South East Asia in a heart beat for a cheap lifestyle, or USA for a better paying job.",
            "Literally the most racist sub on reddit, I'm surprised. Disgusted by these racists.",
            "Maybe we should start.",
            "I can’t think of a country aside from America who does that. I think it’s bloody ridiculous that they do. You’re also automatically an American citizen if you’re born to one, no matter where you were born. And need to pay taxes because of it. The US literally taxes people for existing even if they’ve never set foot in the US. It’s insanity.",
            "Yes we do, that’s bullshit. \n\nCanadians overseas absolutely can be taxed. The difference is that Americans make you file a tax return regardless of where you live and credits you for taxes paid elsewhere if there’s a tax treaty, and Canada allows you to apply to be assessed as a non-resident for tax purposes (which basically means you have no ties to Canada anymore). If not, a Canadian overseas can similarly get credit for taxes paid in other countries under a tax treaty. \n\nThe American system is the one that’s straight fucked. People have to file complicated returns regardless of where they live, then often have $0 to pay because tax in the US is less than almost all other western countries.",
            "literally nobody but the americans do that. and its batshit that they do.",
            "Unless you’re making over 90k a year US citizens abroad do not pay anything, they just have to file their taxes every year.",
            "Makes me think all our refugee, immigration, student and temporary worker numbers should account for citizens abroad in the event of war, natural disaster or any ither event that could see a massive exodus of citizens abroad seeking to return to Canada.",
            "You can't say that and then have so many people saying \"oh I wish I can move to a country with a cheaper cost of living\"\n\nThis is a weird dog whistle honestly.",
            "It’s literally only the US and Eritrea that have their citizens pay for taxes outside their nation. And from what I know from talking with Americans, they aren’t exactly thrilled with that stipulation.",
            "I'm not so sure this is true.\n\n Someone correct me if I'm wrong, but a resident of Canada is still expected to pay the difference between the foreign country's tax and the canadian tax if there is a tax treaty. If there is no treaty, you're expected to pay both countries full amount of income tax.\n\nhttps://taxsummaries.pwc.com/canada/individual/taxes-on-personal-income\n\nAnd to hold a Canadian passport, you must be a citizen of Canada.\n\nhttps://laws.justice.gc.ca/eng/regulations/si-81-86/FullText.html",
            "Oh no.  How angry does that make you?",
            "Did we evacuate any hong kongers?",
            "It's like we're being scammed?",
            "Doesn't healthcare coverage stop after being outside Canada for a specific time?",
            "While likely still collecting child care and GST benefits, which are direct deposited to their bank accounts each month.",
            "You can't just get healthcare if you've been out of the country for years. I swear this sub Reddit upvoted the dumbest bullshit.",
            "Source? My father flew to India to get speedy and effective care instead of waiting here on a wait list and risk going blind in that time. I can’t see anyone using us for our awful healthcare",
            "You do know that you need to live 183/365 to get health care right? They moved back live half a month is enough for compensating the fre of health care",
            "What healthcare?  People are leaving Canada to get medical care. Are you living under a rock?\n\nAs a Lebanese I can assure you 99% of us go to Lebanon every time we need to have surgery or see a doctor since it's quicker than waiting a year to get looked at here. I'm pretty sure a LOT of people are doing the same. Reddit is filled with news articles of people booking surgeries in Europe and the US since they'll be dead by the time they get an appointment here.\n\nEveryone is leaving Canada since it's becoming unlivable here. You guys get bothered if people come and you get bothered if people leave. Make up your mind.",
            "Are you kidding? People return to their home countries for health care because it’s so damn slow and inaccessible here",
            "Also Trudeau needs all the votes he can get.",
            "One of the reasons the Roman Empire fell was the fact they began giving out citizenship way too easily. It slowly broke social cohesiveness.",
            "Odd how they don't mention that we are doing this for Canadian citizens in Israel too.",
            "Great, and 45,000 of them don’t need to be evacuated from Lebanon if they’ve chosen to live there as citizens of Lebanon.",
            "lol yeah, since if they live in Lebbanon they almost certainly immigrated here, got citizenship, then moved back.",
            "[Book a flight](https://www.google.com/travel/flights?client=ms-android-telus-ca-revc&sca_esv=689b2325b95f8dd1&sca_upv=1&prmd=tmivn&sxsrf=ADLYWILQ0b_MkPELnRFXmBwv4I8QQohN6w%3A1719058558435&source=flun&uitype=cuAA&hl=en&gl=ca&curr=CAD&tfs=CAEQAhojEgoyMDI0LTA3LTA0agcIARIDQkVZcgwIAhIIL20vMGg3aDYaIxIKMjAyNC0wNy0xOGoMCAISCC9tLzBoN2g2cgcIARIDQkVZemhDalJJUlRkV01XdHZNMVpFUkRoQlExSnphVUZDUnkwdExTMHRMUzB0TFMxd2FuRnZNMEZCUVVGQlIxb3lkMGcwU1U5bk5XdEJFZ05qVEU4YUN3aVlrZ2dRQWhvRFEwRkVPREJ3NS9nRg%3D%3D)",
            "Which is not in practice practical as most provinces require several months of residency kn order to get and maintain a Medicare card. \n\nI’m Canadian, but live in Australia. If I want Canadian healthcare I’d have to move back to BC and apply for a Medicare card only after 3 months of evidence of residence.",
            "At least there should be a \"8-12mo after entry into any country which has a significant travel advisory\" clause for this kinda crap",
            "My wife's side of the family is Lebanese. Her cousin who's super active in that side of the family is in Lebanon right now, I just fucking shake my head.\n\nNo matter the country, we all have a romanticized view of our home through Rose tinted glasses, even if it's very fucking obvious shits fucked",
            "If there’s a war, airspace is often closed, as are borders. That’s why you need to evacuate your citizens because otherwise there’s no way out. Every country does that and they often group together to share the burden (e.g Americans hitching a boat ride with Canadians and Japanese to the nearest peaceful country’s port)",
            "But talk to loud about this in real life and you're a racist.",
            "But none of us will be able to free flights. We need our gov to buy our votes instead",
            "The flights aren’t free. You’re expected to pay them back. And the government will find ways to recoup their losses (refer to the cra hunting people down over pennies)",
            "This is the question that gets brought up. What is a Candian citizen? As a second / fourth gen Canadian I consider myself a Canadian. I grew up with the rhetoric that you must be a Canadian to be a citizen. I do not carry over any more culture than my Dutch / German blood did. I am a Candian.",
            "The only help they need to offer is telling people not to go to Lebanon because it's extremely dangerous. What we don't need is to waste 10s of millions of dollars to rescue these morons from their bad decisions",
            "Citizens in paper only.  They don't live here and do not share our values.\n\n\nHow do I know that?   THEY DO NOT LIVE HERE.  We are nothing but a service to be used when convenient.",
            "I do not feel any sense of kinship for these people.",
            "They have no issue living amongst Hezbollah though, curious.",
            "There are plenty of Hezbollah supporters in Dearborn Michigan for example and in the west in general, they will gladly live in the west while supporting terrorists.",
            "Prove it. Back up what you're saying.",
            "I think they pay for the flight..",
            "So right. If the government had any brains they would issue warnings to them to get out now and if they remain they are on their own.\n\nNot exactly the same, but I have heard of some ‘jurisdictions’ charging rescue expenses to people who were on some extreme ‘adventure’ while hiking or climbing, etc.",
            "Sucks. People die in war",
            "Not if they have Canadian passports.",
            "Let em fight it out. We ain't bombin shit.",
            "There is no right to be brought back here by the government.",
            "Don’t forget that some of these “\nCitizens “ have never set foot in this country ",
            "They are entitled to enter here, they are not entitled to come here. \n\nThey need to buy their own plane ticket.",
            "Of convenience",
            "I was on that flight in 2006. Boat took us from Beirut to Cyprus and then they flew us from Cyprus to Montreal. Been here since, serving in the CAF and doing my part.\n\nWhile a lot of lebanese people went home a few weeks after their rescue, a number stayed. Just like me.",
            "Those laws have yet to change which means they are irrelevant to these people",
            "They are Lebanese who came to Canada to get citizenship, and possibly worked here for a while, then returned 'home'. Unless it's changed in the last few years the government doesn't even know when someone is or isn't here so they can still collect benefits over there, where they go a lot further than here.",
            " Exactly. It's not really the bastion of commerce or scholarship.",
            "There was a significant amount of immigration and refugees in the late 1980s.  Many of them became citizens and had children.   Over time Lebanon became stable and safe and many of them returned home to live in their native language, environment and climate.",
            "True that",
            "10 years of stability is barely a sneeze in a country's lifetime. And dude, Wikipedia page for \"wars involving Lebanon\", there's barely any gaps in that resume.",
            "You know birthright citizenship doesn’t exist in other countries right?",
            "If we can change the law to abolish birthright citizenship it wouldn’t be a question.  Non citizens obviously wouldn’t have the right to return.",
            "More like Hezbollah is doing things in northern israel…. Israel had to evacuate the entire north for months because of rockets. \n\nIn what possible way is Israel acting criminally?",
            "Lebanon could get Hezbollah to stop shooting rockets at Israeli civilians if they didn't want Israel to respond. \n\nBut I'm just spitballing here.",
            "Entirely hezbollahs fault. When people tell you they’re terrorists bent on Israel’s destruction, you should believe them.",
            "> Israel is doing things in southern Lebanon. Whether that triggers an official response from Lebanon is a different question.\n\nLebanese army is cooperating with IDF ..\nLebanon doesn’t want hezbollah there either, but they are kind of a failing state who can’t handle these things on their own.\n\nYou have no clue what you’re talking about ",
            "Prove it. Prove most of these Canadians haven't set soil.",
            "Google \"Canadians of convenience\", you'll find lots of news articles that will help to understand why people are upset over this.",
            "We don’t.  Virtually none of those 45,000 Canadians in Lebanon would be paying Canadian tax.",
            "If they're citizens they can arrange it themselves. They should have ties here of some sort. ",
            "Lebanese-Canadians usually aren't poor like Ukrainians who never left Ukraine. Most of them probably have family here or own something already.",
            "Are you okay? Do you know lebanon was a christian majority but is now basically destroyed due to palestinians starting a civil war and an iranian proxy terror organization taking over the south? \n\nHow exactly is israel the problem here?",
            "I always love when people call Israel an ethnostate. You know, the place where 20% of its citizens are Arabs. Do you know how many Jews are in Lebanon? A quick wiki search said 27. Not 27 hundred, or thousand, 27.\n\nSo you're going to sit there, unironically calling Israel the ethnostate, when it's Lebanon who pushed and forced Jews out, because they're so \"tolerant\"? Thanks for the laughs, but it's quite clear of the two countries, it's Lebanon that has issues with people of different backgrounds.\n\nYou spend enough time listening to these pathetic criticisms of Israel and you learn the majority of them are just projections. Israel is the ethnostate? Ha. There's 27 Jews in Lebanon, maybe you should realize that accusation much better fits Lebanon than it does Israel.\n\nAlso, while you're blatantly engaging in whataboutism with Israel, and blaming Israel for Hezbollah attacking them (peak victim blaming), you're ignoring, or better yet defending the war crimes Hezbollah is committing by firing rockets at civilians. And not unintentionally, because they're very well armed. They've displaced nearly 100K Israelis for 8 or so months now with these attacks. So if we're going to talk about war crimes, it starts and ends with Hezbollah targeting civilians and displacing them.\n\nThis conflict ends when Hezbollah follows the rules of engagement that they and Israel agreed to, which is that Hezbollah gets back up north and stops firing their rockets at Israel.\n\nSo please, educate yourself before you use buzzwords you've heard before but clearly don't understand.",
            "Lebanon broke the treaty\n\nhttps://en.m.wikipedia.org/wiki/United_Nations_Security_Council_Resolution_1701#:~:text=UN%20Resolution%201701%20prohibits%20all,the%20disarmament%20of%20all%20armed\n\nScroll down to see how many rockets Lebanon has fired at Israel recently\n\nhttps://rocketalert.live/\n\n~120,000 Israelis have been evacuated because of rockets/ threats, etc.\n\nhttps://www.newarab.com/news/new-israeli-border-town-evacuated-hezbollah-clashes-escalate\n\nNasrallah,  whose net worth is ~ 250 million, has threatened war with Israel and Cyprus.\n\nhttps://www.cbc.ca/news/world/israel-hezbollah-lebanon-1.7240784",
            "Okay. Bombs for Lebanon it is!",
            "Gooood logic 🤤 🤡",
            "Yes",
            "These are Cdn citizens, just not \"real\" ones according to some questionable users here.",
            "Exactly! There are travel advisories with regards to travel to Lebanon. If you’re dumb enough to travel there for vacation it’s your own fault and you should pay for you own flight home. The government should not have to bail you out.",
            "The parent was wrong. \nThose who maintain a footprint in  Canada are supposed to be taxed on your global income, but the Canadian part would be based on a formula that takes into account taxes paid in the country of employment/residence first.\n\n\nNot all governments have reciprocal reporting arrangements though, and there's likely plenty of \"underground\" unemployment as well. Workers are also still eligible for deductions etc\n\n\nhttps://turbotax.intuit.ca/tips/what-canadians-abroad-need-to-know-about-filing-taxes-14860",
            "If the jobs in Canada paid enough to allow workers to earn enough to buy a house and get by we wouldn't have so many citizens traveling abroad to work?",
            "I wouldn't want my money going to the Canadian government if I am working and earning overseas. Especially trudeaus government.",
            "We absolutely should ..",
            "I would not be against the USA considering a tax against goods that flow to and from Canada from either the US-Canada border, or US waters extending through the entire Atlantic and Pacific off the border of North America. Obviously Canadian land is sovereign, but for national security reasons, Canada is not entitled to any waters as it is part of the US, a tax must be charged for using our waters, which we protect.",
            "If you don't live in Canada you still have to pay taxes unless you change your tax residency. To change tax residency does require cancelling your passport (and possibly cutting pretty much all other possible economic ties).",
            ">I can’t think of a country aside from America who does that\n\n\nThere is only one: Eritrea.",
            "This is fact I shine. Long time ago I read that only Eriteria is the second country who taxes their citizen's world wide income whereever they live.",
            "I mean you can just renounce US citizenship and not pay the taxes",
            "My dad is an an American citizen and I am not. It's not so simple. ",
            "There's a foreign exclusion on taxes for the first $105k USD in income also. The government likely makes more money off of the fines off of not declaring foreign bank accounts. Because the fine still applies if it was accidental.",
            "You say it’s bullshit and then spend 300 words with the conclusion Canadians living abroad can be assessed as non-residents for tax purposes.\n\nSo I’m actually correct.  :)",
            "Why?\n\nCanada has an obligation to provide consular services, to rescue them and advocate for them.  \n\nWhy shouldn’t we tax them for those services?",
            "Yet they get excellent consular services and a government that will use significant resources if they need rescuing.  Plus if they don’t like it they can always surrender their citizenship.",
            "No.\n\nA Canadian citizen (passport holder) can break ties with Canada and not have to pay any Canadian tax while still holding the passport.  There are several tests but many people manage it.",
            "Yes this is true and the person making the comment is full of shit. I live overseas and had to be deemed a non-resident for tax purposes before I could stop filing a return.",
            "You’re correct. They also applied it retroactively",
            "Maybe they are smart enough to evacuate themselves.",
            "\"like\"",
            "Not sure if it varies province to province, but in Ontario you must have spent at least 6 months per year in Canada to qualify for OHIP\n\nNot sure how they police or enforce that though",
            "They can just return. EG: There is no waiting period for healthcare in Ontario and citizens are covered from day 1.",
            "You have to file taxes to collect those so I doubt it.",
            "No, that’s not how it works. You can’t claim Canadian benefits if you don’t have a genuine Canadian address. Yeah, people can commit tax fraud but the situation you’re setting up is very illegal.",
            "Don't forget Child Tax Benefits which go higher the lower the family income. \n\nIf Dad divorces mom (On paper) he can take on another wife and start over. Canada is supporting polygamous family structures this way. The old wives go back to Lebanon courtesy of the Canadian taxpayer and takes advantage of the lower cost of living.",
            "lol, I know of many people who do. Maintaining OHIP is trivial while living and working outside of Canada. You just don't let it expire and constantly renew. Have 1 cheap $20 cellphone bill monthly go to a friends house if you really want to go the extra mile.",
            "In Manitoba, there is no waiting period.",
            "lol yeah you can. You think they check your travel itenerary at the hospital?",
            ">Everyone is leaving Canada since it's becoming unlivable here. You guys get bothered if people come and you get bothered if people leave. Make up your mind. \n\nThe irony of this part being written under an article which details how 45,000 people need to be evacuated from your war torn country.... AGAIN. \n\nAlso, nobody is bothered if people leave, but don't come back if you don't contribute anything and only drain resources.",
            "I assure you that we don’t get bothered when they leave.",
            ">Everyone is leaving Canada since it's becoming unlivable here. \n\nThen why are we reportedly preparing to evacuate Canadian \"citizens\" from Lebanon? \n\n>You guys get bothered if people come and you get bothered if people leave. Make up your mind.\n\nMaybe you forgot what happened in 2006? When we paid over $85 million to evacuate 15,000 \"Canadians\" out of Lebanon...only for half of them to return within a month (because they were in fact only Canadian on paper, and were actually Lebanese and lived in Lebanon).\n\nNot sure why you're playing dumb when you know full well what people are against, and why.",
            "Found the type of immigrant everyone hates. So glad you were able to take advantage of the goodwill of our people and the safety and resources we had to offer. I can see it really inspired love and a sense of loyalty to our country. \n\nI can feel the value being added to our society through this Reddit comment 🤣",
            "The article is literally about 45k people wanting to leave your shit hole country to come to Canada so I don’t get what you’re talking about",
            "Facts",
            "Do you have a source? Nothing seems to be popping up on Google but maybe I'm searching poorly.",
            "They’re citizens of Canada…",
            "Is it illegal ? Or are you just racist ? Did you complain when Canada opened its doors to the white foreigners from Ukraine or only Canadians which you have assumptions towards ?",
            "Sweet, I’ll just go AWOL and be unemployed and go on the dole",
            "I agree, but they would just find a loophole, somehow. \n\nAs an aside,it would be interesting to know how much money is taken out of our economy and sent ' back home'.",
            "I  wonder if people think that nothing bad will ever happen to 'them' when they go to Lebanon? It boggles my mind. \n\nYou're right. It does not matter what country we are talking about, but... there comes a time when people should be responsible for their actions. \n\nI hope things calm down, I hope your wife's cousin and my friends husband stay safe. Le sigh.",
            "You're using logic to combat racism, Good luck.",
            "Because it is racist",
            "I vote in a place where a donkey wearing a certain political flag will be voted into federal office, my vote doesn't matter.\n\nI used to live in a place where the same thing would happen with the other flag.",
            "Just what Canada needs.. 1000’s of incompetent bueraucrats spending 10’s of thousands to recoup thousands from people who will never pay.",
            "This is pretty standard for most developed countries. They will try to get their citizens out of dangerous parts of the world. You may not like it but it's not going anywhere even if Trudeau does. So get used to it.",
            "First of all not all of them live in Lebanon. There's this thing called traveling. Basically someone can live in one country but then visit another country temporarily for various reasons. Sometimes people even will work abroad for a while maybe there's a specific assignment that can only be done in another country. I know crazy right. Also very presumptuous of you to psychoanalyze them and decide what they believe and create an imaginary authority to revoke the spirit of their citizenship. Good job. \n\n>How do I know that?   THEY DO NOT LIVE HERE\n\nYou're a total Sherlock Holmes. To stay vigilant on this standard maybe you should stop leaving your house. After all leaving the house you'll see people who don't live in your neighbourhood or god forbid someone from another country. What a scary possibility. Be careful. Following your lead I will cut off all my friends and family who have studied abroad. Can't trust them because they don't live here.",
            "Good for you. Do you want a Nanaimo bar?",
            "[removed]",
            "There are numerous articles from reputable sources that back this claim. Do some of your own research,  I'll get you started, here: https://nationalpost.com/news/politics/sudan-rescue-canadians-of-convenience",
            "Can't back racism.",
            "“Since October 2023, the Government of Canada has advised Canadians to leave Lebanon while commercial options remain available.”",
            "People with Canadian passports cannot apply for refugee status anywhere",
            "Courts have forced them before. ",
            "That's fucked. Give em labourer jobs building houses",
            "Doesn't matter legally. ",
            "Exactly! I dont understand why we as a country insist on virtue Signaling",
            "Legally that doesn't matter. ",
            " Good on ya, thanks for your service.",
            "if youre not filing taxes in canada you arent collecting benefits. stop spreading non-sense. you have have clearly not interacted with canadian government institutions as an immigrant.",
            "Can you back that up that 45000 Lebanese are not \"real\" Canadians? Can you prove they are collecting benefits while living in Lebanon, or are you letting your feelings run wild and not looking at the facts?",
            ">Over time Lebanon became stable and safe\n\nDefine stable and safe?",
            "The same is true about Israel and it is still usually a place you can relatively safely visit. I've been to Lebanon for a marriage and went again a few years later in the early 2010s and this was much safer than others countries I visited like Brazil or Mexico. Beirut was basically like what if Eastern Europe had better food and better bars. \n\nTheir currency fell by 94% since I visited (and 75% since 2022) which is why the situation right now is completely different.",
            "I wonder if you see the irony.",
            "And when the Lebanese arrive here, do you think they will stay neutral or support Canadians or Christians? No, they are loyal to their faith first, which means more Palestinian supporters demonstrating.\nIt concerns me that under the guise of refugee, no background checks are done which means we could be taking in militants and territorists.\nThose that are genuine refugees, where do they rank amongst our existing Canadian homeless? And we are still giving billions to the UN for what?",
            "Poor israel committing genocide against civilians.",
            "That's on them, but the law is there, and it's up to the government to check and enforce.",
            "Hahahahahaha",
            "The country was founded by white European Jews and their anti-Semitic backers, for white European Jews.\n- That 2nd one might seem ridiculously ironic, but there were European anti semites that actually sported Zionism because it got Jews out of Europe, with the added side effect of having a mostly white allied country in the Middle East (classic 20th century racism). \n\nAlso, I said Theocratic Ethnostate, not just Ethnostate. Judaism is the state religion, Israel is a theocracy. \n\nAlso, when did Lebanon force their Jews out? There seemed to be a much wider spread of Jewish people in the Middle East while it was under Ottoman (Muslim) rule. Seems like there is some history missing between Ottoman-Muslim rule and Lebanese-Muslim rule that might explain the number of Jews in Lebanon.",
            "Hezbollah has stated that hostility’s will end once an agreement is reached on Gaza: \n\nhttps://www.politico.eu/article/hezbollah-lebanon-iran-israel-idf-war-in-gaza-conflict-escalation/#:~:text=In%20all%2C%20Hezbollah%20says%20it,further%20away%20each%20passing%20day.\n\nLebanons response has been in retaliation to Israel’s actions in the Gaza Strip which has killed thousands of civilians. \n\nhttps://www.washingtonpost.com/world/2024/06/12/hamas-death-toll-gaza-sinwar-messages/\n\nExcuse me for not caring about a broken treaty when people are coming to the defence of a country (Israel) who’s military who’s actively committing war crimes, killing and starving civilians, and levelling homes with full government support. \n\nThe “most moral army” didn’t have to kill 274 Palestinians (mostly civilians) to save all of 4 hostages, all while dressing up as aid workers.",
            "Lol, nope.",
            "Would r/canada users say the same about white Canadians that go to Asia to teach ?\n\nOr to Canadians that go to the USA to work & live as doctors and Software Engineers.\n\nOr is the term only reserved for POC Canadians ??",
            "Yea idk why my post got deleted LOL like what? \nBut yeah, i mean with ukraine they werent even canadian citizens, but with lebanese canadian citizens? We react like this?\n\nJesus christ racism is alive and well. Its the family guy patrol meme LMAO",
            "As long as they’re Christian :)",
            "Bail you out AGAIN.  We went through this in 2006",
            "My understanding is that managing tax resident status in Canada is fairly easy. At a high level the CRA has Significant residential ties where by having House, Spouse and Kids in Canada will mean you are a tax resident. Secondary ties exist and is a longer list but major one is holding a health card. [Source](https://www.canada.ca/en/revenue-agency/services/tax/international-non-residents/information-been-moved/determining-your-residency-status.html)\n\nUSA has a different requirement for tax residency. If you citizen, permanent resident or pass substantial presence test then taxes owed on international income.",
            "Is the CRA able to pursue judgements against Canadians living overseas.?",
            "Maintaining a 'foot print' is different to dual citizenship.",
            "[https://vancouversun.com/life/richmond-3-why-does-upscale-neighbourhood-appear-poor-to-tax-officials](https://vancouversun.com/life/richmond-3-why-does-upscale-neighbourhood-appear-poor-to-tax-officials)",
            "If we didn't have so many immigrants, jobs in Canada would pay more and houses would cost less.",
            "I’m going to go out on a limb and say that’s probably not what’s going on with these particular folks. Lebanon isn’t exactly a beacon of economic prosperity these days.",
            "Traveling abroad to work eh",
            "Many of these claim asylum in canada and once they have their citizenship return back to their country of origin.",
            "You can always renounce your citizenship",
            "Well that says it all",
            "But it's basically voluntary as the Eritrean dictator cannot enforce it.",
            "You have to pay a fee of $2,350 to renounce your US citizenship",
            "No, you’re not. You’ve stated Canada doesn’t tax “passport holders” in absolute terms, when we do by default unless the person files a return with enough foreign tax credits or applies and can demonstrate that they’ve severed ties to Canada financially. Not everyone overseas applies, and not everyone who applies is deemed a non resident.\n\nIt takes 300 words because tax law around residency is a lot more complex than some rando on reddit making some off-the-cuff uneducated comment.",
            "Every country has that responsibility. Having dealt with the Canadian embassy multiple times, they sure as hell are bad at their jobs.",
            "Surrender citizenship costs over 2000 US dollars. And in regards to consular services/reacuing, based off the title of this thread, the Canadian government doesn’t seem to be doing terribly in that department either. There’s lots of things to fault Canada on, but saying Canada needs the forced tax system only followed by one strong nation and arguably one of the weakest nations in the world is not it.",
            "Maybe its because they don't need any evacuation..... there's no threat of invasion or cruise missles slamming into their homes. Just don't break the laws or protest and you are good.",
            "Poorly to not at all is how",
            "So you could potentially qualify in two provinces?",
            "False. That was true only during the pandemic.\n\nThat said, unless you're a Canadian journalist, work for an international aid agency or are part of the diplomatic corps, I don't see why the Canadian government should bail you out. \n\nYou chose to be an expat, so you have to live with the consequences of that action. \n\nYes, there's a war in the region and it's dangerous. It's your responsibility to protect yourself because none of this was a surprise. Israel bombed Lebanon before, and they'll probably do it again in the future.",
            "They can file their taxes as unemployed, no?",
            "No, the kids are associated with the lower income spouse and they receive the payment. My wife is a stay-at-home and has never earned income. The children are associated with her SIN and the money is directly deposited without filing taxes.\n\n  \nWe get $2K/month. I hope you're right, but I doubt it.",
            "And if they are filing taxes, they’re likely paying taxes to Canada or paying more elsewhere so there’s no point.",
            "They don't check your health card? Must be a great place to be an illegal immigrant.",
            "They do check whether you have a provincial health care card and if you don’t and aren’t eligible for one you can expect a bill. ",
            "They check your provincial health card and if you've been paying taxes. You obviously have never been out of the country for long periods of time.",
            "Canada is doing the same for Canadian citizens in Israel. Odd how people don't get worked up over that.",
            "Yet you felt the need to cry about citizens of convenience who come and then leave. Take a xanax you'll feel much better.",
            "So? Pay for tickets home. They had the money to get there in the first place.",
            "To be extra clear, I’m not actually worried about dying. Travel advisories from different countries have varying levels of warning, and in the end it’s weighing probabilities of specific things going wrong against the certain costs of leaving (in my case, 100% chance of leaving employment with no home or work lined up in Canada, v. whatever probability of something catastrophic happening in my specific place of work, which I do not judge to be all that high).  \n\nThere are a huge range of circumstances people end up in various places, and frankly a lot of the comments in this thread betray a lot of ignorance about the situation on the ground and Lebanese migration patterns to Canada. Most countries do not leave tens of thousands of citizens stranded in the event of shit hitting the fan, and it should not be particularly controversial for an evacuation op to be planned, unless you want to turn it into a chance to soapbox against migrants.",
            "Probably plenty, but I'd say there's also plenty earned in Canada underground untaxed as well (or loopholed to avoid taxes)",
            "There’s plenty that comes in too. My father is well off and he hasn’t worked a day in Canada, and he brought close to 3 million dollars with him. You can’t just look at the negatives of immigration, there’s positives. We’ve paid hundreds of thousands in taxes as a family and have used virtually no resources outside of the minimum such as roads.",
            "It’s not.",
            "Stay put.",
            "45,000 decided to vacation in a country on the brink of potential war?",
            "Those people traveling know the dangers and negligently went there anyway.  \n\n\nOn top of that 45k.  45 thousand people just visiting for years or decades at a time.  \n\n\nYou are that gullible as to believe this is anything other than outright fraud.    ",
            "Lol you really believe most of the 45,000 Canadians in Lebanon are just visiting?",
            "The courts have said there is no right \n\n\n>In its analysis of past legal decisions, the appeal court wrote that the Charter protects against exile and banishment but \"offers no encouragement for the idea that Subsection 6(1) includes a right to be returned to Canada.\"\n\n\nhttps://www.ctvnews.ca/politics/federal-court-of-appeal-canada-not-constitutionally-obligated-to-bring-home-suspected-isis-fighters-1.6421360",
            "Those who have never lived here are wealthy, if they need a job to live they would not currently be living in Lebanon.",
            "> virtue signaling\n\nRemoving Canadian citizens from a war zone is virtue signaling? Can we trade some of you lot for them? Jfc you people have really lost the plot in your media fueled immigrant rage. Theyre fucking citizens.",
            "Pretty easy to efile a nil return.",
            "A functioning society that doesn't have explosions happening around you.",
            "Are you seriously comparing petty crime to war? I mean could argue Ukraine is relatively safe, there's plenty of TikTok videos of people living their normal lives. And the bars and the food is irrelevant to this discussion. Are there really 45,000 tourists visiting Lebanon since the regional conflict started in October 2023?",
            "Explain it",
            "Well many lebanese are christians. It used to be a majority christian country. Many are also middle class. Lebanon used to be advanced and developed before it got overrun and destroyed. \n\nBut yeah in general it is such a joke. They are not refugees at all if they are citizens….we will definitely be taking in some terrorists or definitely terrorirst supporters top of the 5000 gazan families we are talking. ",
            "It's not a genocide. It's a war. \n\nI think it's really rich for Canadians to be so cavalier about the meaning of that word when attacking Israel when we actually have genocide in our history.\n\nIsrael expressly did not commit genocide when it won the 1948 Arab-Israeli war. We and our neighbours in the US can not say the same about our treatment of indigenous Canadians.",
            "If they live in Lebanon they very likely have no primary ties.  Thus with a little bit of planning to limit secondary ties none of those Canadian citizens would be required to pay Canadian tax.\n\nSo it’s not an enforcement issue.",
            "No, it was not founded by white Europeans, That's racist and discriminatory. It was founded by Indigenous Jews as well as immigrants from not just Europe, but the middle East and other countries. And many Jews/Israelis aren't white, so I'd appreciate if you'd stop spreading misinformation and propaganda.\n\nPalestinians weren't all Indigenous either, many immigrated from other parts of the Middle East as well. \n\n[https://www.nli.org.il/en/newspapers/pls/1933/11/22/01/article/33/?e=-------en-20--1--img-txIN%7ctxTI--------------1](https://www.nli.org.il/en/newspapers/pls/1933/11/22/01/article/33/?e=-------en-20--1--img-txIN%7ctxTI--------------1)\n\nHere's an example of a paper from 1933 - where 100,000 illegal Arabs immigrated. So please, spare me this nonsense narrative about how Jews immigrated but all the Palestinians were Indigenous. Both groups immigrated.\n\nCalling it a theocratic ethnostate doesn't help your case either because Israel is a democracy. Again, quit using buzzwords you don't understand. \n\nWhen did Lebanon force their Jews out? Great question. In the 60s, closer to 1967 when Arabs gained more strength than the Christians in Lebanon, they forced the Jews out. It simply stopped being safe for them. In the 70s when the Christian/Arab civil war was happening the Jewish quarter got damaged, and many feared their rights would be restricted so they left.\n\nIn the 1980s Hezbollah kidnapped some important Jews in Lebanon and murdered them, which scared the remaining Jews out.\n\nPlease don't try to imply the Muslim rule was kind to Jews, because they treated them like Dhimmis. Second class citizens. \n\nAgain, just to be clear, you still aren't calling out Hezbollah for starting this conflict, or recognizing they have the power to stop any future conflict with Israel by simply not firing rockets and displacing 100K civilians. You seem quite unconcerned by Hezbollah war crimes, or that they're not following UN resolution 1701.",
            "In response.... What does lebanon have to do with Gaza ? Oh, right, Iran fills their pockets while lebanon is a failed state. I've been there, I have friends there. \n\nHamas broke a peace agreement with Israel and slaughtered  and kidnapped their citizens as you are well aware, some of which they still held as hostages, maybe, maybe not, hamas wont say for sure,mor doesnt know, or whatever.\n\n How Israel rescues their hostages is the same as many countries would do. It's unfortunate that hamas inbeds itself with so-called civilians,  this is on hamas. \n\nFuck hamas and fuck hezbollah.",
            "Maybe?",
            ">Or is the term only reserved for POC Canadians ??\n\nPretty much.",
            ">racism is alive and well.\n\nThe users you see here with the extreme views know their views aren't popular. But they're terminally online and trying to astroturf it.",
            "Tbf most of them probably are.",
            "The US can also enforce its laws beyond its borders\n\nJust ask the Swiss Banks",
            "Are there benefits to being Canadian if you can't come back without going to jail?",
            "You’re aware there’s tons of corruption and bs in CRA correct? I personally know of a high level director at CRA who smokes “indigenous” tax free cigarettes and works a $7000/month cash paid job while working “remotely” for CRA",
            "Likely depends on the agreement with the other country, similar to extradition?",
            "Yes, and?",
            "Is it like declaring bankruptcy?\n\n\"I renounce my citizenship!\"",
            "Not if you don’t have another citizenship.",
            "Or vote out the Government. Likely mail in ballot if you are overseas.",
            "Would love to if I can acquire citizenship in a different country.  The Canadian government is shitting on us every day and clearly doesn't care about making our lives better. First chance of getting citizenship in a better country , I'm taking it. I'm done being loyal to a country that puts foreigners before citizens.",
            "Well care to guess how many of the 45,000 people living in Lebanon pay Canadian taxes?  We both know it would be almost 0.  Same as the 300,000 living in Hong Kong and the rest of the Canadians spread around the globe.\n\nWhen most aren’t taxpayers it’s safe to generalize.",
            "Free things usually aren’t too good.  If we charged for them we could better provide services.",
            "Forced tax system?\n\nShould not the citizens of a country pay for the upkeep of the country?",
            "No. You can’t be a resident of more than one province at a time",
            ">False. That was true only during the pandemic.\n\nSays you\n\n>**There is no waiting period for OHIP.**\n\n>**You do not need to wait to be physically present for 153 days before applying.**\n\n>**You can apply for coverage as soon as you arrive in Ontario.**\n\n[https://www.ontario.ca/page/apply-ohip-and-get-health-card](https://www.ontario.ca/page/apply-ohip-and-get-health-card)",
            "You still need a health card, but you once you re-establish provincial residency, you can get free health care the next day. You don’t need temporary healthcare coverage to cover a three to six month gap in coverage like you do in other provinces.",
            "No they aren't.\n\nCanada isn't evacuating \"Canadians\" who actually live in Israel, and are just Canadians on paper, and intend to return to Israel as soon as they can.",
            "Bro, you’re so confused it’s hilarious.\n\nNo one cares if they leave.\n\nEveryone cares if they scream “I’m actually Canadian!” when their country invariably falls back into war and they need to get bailed out on the Canadian tax payer’s dime.\n\nIt’s really not complex stuff.",
            "It’s the coming part that we have an issue with.  Birthright citizenship needs to go.",
            "Realistically it was complaining about people who leave and then continue to utilize publicly funded social benefits, or leave and don't contribute to benefits and then come back to use them as needed. Not quite the same thing as complaining about someone just leaving and cutting ties.",
            "If there is a war then commercial flights will stop.",
            "[https://vancouversun.com/life/richmond-3-why-does-upscale-neighbourhood-appear-poor-to-tax-officials](https://vancouversun.com/life/richmond-3-why-does-upscale-neighbourhood-appear-poor-to-tax-officials)",
            "There is that, too. Canada needs 5o get our shit together.",
            "Lots of hard-working immigrants, people know and realize this, people are upset about people take advantage of 'the system'. It is frustrating for those who don't take advantage.",
            "45000 are in Lebanon for various reasons.",
            "Canadas population is 41 million.\n\n>Those people traveling know the dangers and negligently went there anyway.  \n\nSo did many others is different situations. Even the freaking US will do what it can to extract it's citizens from places as fucked as North Korea and Russia. Recently Canada spent a lot of energy over the two Michaels in China. That's just part of a country trying to help it's citizens. But of course you are hysterical about it and pretending trying to protect your own citizens is a personal affront to you. It's pretty sad  that this is your mentality. Though not as sad as you still not grasping that even among the 45K that you loathe so much that not all of them are \"visiting for decades at a time\" or that being in a foreign country is a form of fraud. You have the same kind of mentality as some cold war dictator who builds walls to keep people in and declares anyone who does leave or even just disagrees with you as an enemy of the party. It's utterly baffling to see. Though something tells me you wouldn't apply this standard if they were in Moldova and Russia started to ramp up there...",
            "How?",
            "No, they are frauds.",
            "Nah I just want our government to fucking give a shit about the citizens here first. Cry about it ig.",
            "try it next time and see what you get back",
            "So not Lebanon",
            "You mean overal or from Canada? There is a lot more than 45k tourists who visited since october 2023. It is a popular touristic destination and the regional conflict doesn't affect the security of tourists or at least not as much as the economic crisis and pety crimes. Its not like tourists go chill by the Israel border or with Hezbollah.\n\nIt isn't comparable to Ukraine at all which have been invaded by Russia.\n\nThey still had nearly 300k visitors in december which represent more than 5% of the population and make it a more popular destination for tourism than Canada per capita.\n\nhttps://tradingeconomics.com/lebanon/tourist-arrivals",
            "Before I do that, I have some questions:\n\nI have to assume you're just instantly downvoting me. Is there a reason for that?\n\nYour account is approximately 1.5 months old. Near as I can tell, you've been posting all day long, every day of the week.\n\nI don't work full time, but between hobbies, friends, commuting, and work, I just don't find myself nearly that occupied with Reddit. How do you manage to have that kind of free time?",
            "It used to be… 50 years ago",
            "Not to mention that Arab neighbours will not take in Palestinians, at least partially because of the mess of Lebanon. No one wants to import a constantly fighting population. influenced by a whole bunch of people you have to keep an eye on in your own country ...or so it was explained to me by a Libyan friend.",
            "What does Lebanon have to do with Gaza? Someone had to put pressure on Israel to stop slaughtering civilians, no one else seems to be. \n\nThe actions of Hamas in no way justify Israel’s retaliation against Palestinian civilians. \n\nI’m sick of seeing and hearing dumbass knuckle-draggers come to Israel’s defence:\n- “BuT h@mAs KidNaPped and kIllEd IsRaEliez” .. yea that was wrong too, and those responsible (and only those responsible) need to be brought to justice. \n- “bUt HamAsS ArE tHe OneS uZInG Civilians as human shields, it’s their fault for Israel killing those innocent civilians” … Hamas using human shields does not give Israel any right to kill innocents because they are being held in the way. \n\nAnyhow. Fuck Hamas, Fuck Israeli IDF Terrorists; Fuck Netanyahu, Likud and all the IDU fascists.",
            "American social media algorithms perpetuate the problem as well. The anti immigrant rage is just a weapon of the political/media class used to keep the stupid people's heads down and focused on hating the other with little examination of why things are going wrong. Hint, it has a lot less to do with immigration than /r/canada believes.",
            "probably the article in question. if my options were potentially getting killed in overseas fallout, or being in a canadian jail…",
            "We don't send people to jail for unpaid taxes. If you have nothing for the CRA to take then there's nothing they can do.",
            "\"Just vote bro\"",
            "They're putting profits/money before citizens. \nMore immigration is partly an attempt to drum up more tax revenue and a feeble attempt to increase productivity.\nThey don't put foreigners before citizens, they put them on the same ladder rung... the bottom.\n\nIf you're on Reddit and reading this, you're on the same rung as everybody else.",
            "Just get an line job and move out. That's how I got out. I love my life now.",
            "Send an FOI request to the CRA. You don’t have any information either way. “We both know” isn’t a fact, it’s a very broad assumption with no factual basis aside from your personal bias. \n\nYou don’t have any actual knowledge on the topic - you’re a conclusion in search of reasoning.",
            "We are talking about the Canadian government. A bloated lazy bureaucracy. I sincerely doubt paying them to get their fat ass off the chair will work",
            "Yes they should; but i believe (as well as almost the whole world), it should also be dependent on their residency status.",
            "That’s exclusively an exemption for people who’ve arrived for humanitarian reasons. For everyone else:\n\n> To meet the minimum qualifications you must:\n\n> be physically in Ontario for 153 days in any 12‑month period\n\n> be physically in Ontario for at least 153 days of the first 183 days immediately after you began living in the province\n\n> make Ontario your primary residence",
            "Lol 😆 literally feel the racism haha",
            "Well that's something you'll need to take up with your government. Good luck with that.",
            "You're arguing with people who's base is racism, not logic.",
            "If you invite a lot of corrupt people to your country, your country becomes corrupt.  And corruption does bad things to a country. \n\n  \nBefore we began to invite the world in the 1970's, Canada was a high trust/low corruption country.",
            "Right. The far majority of which are in Lebanon cause they choose to live there…..",
            "Plenty of ways, but poor Lebanese don't get to buy a Canadian citizenship. The christian Lebanese diaspora speak French and often study, work, invest abroad in either Switzerland, France, Quebec or Belgium, this isn't something that is affordable for the average Lebanese considering their currency went to shit in 2022 so they need to have some assets in another currency.",
            "Theyre citizens. Cry about Canada helping Canadians I guess? What do you want, a single plane ticket from the Feds? That's what you think government giving a shit is?",
            "Sounds like you have experience in the matter",
            "The Lebanon of the mid 90s was worlds away from the Lebanon of the late 1980s when Beirut was in ruins.",
            "Remind me why Israel was created in the first place. Oh, that's right. It was because no one wanted Jews in their country after the war. \n\nMaybe, just maybe, the \"no one wants them in their country\" excuse is bullshit propaganda to justify committing atrocities against the people \"no one wants\".",
            "Or simply pay your taxes.",
            "No, it’s up to 14 years in prison for tax misrepresentation—and that includes not filing a return (when you owe money) or underreporting.",
            "People go to jail for tax fraud.",
            "Where are you living now?",
            "Actually I worked for several years in tax so yes I actually know all about the primary and secondary tests.\n\nSo no, virtually none of them would be residents for tax purposes.  Especially from Lebanon.",
            "Ummm, I concede an extremely valid point.  You win.  :)",
            ">That’s exclusively an exemption for people who’ve arrived for humanitarian reasons \n\n\nYou are exclusively wrong\n\n\nThe 3 month waiting period used to be in Section 5 of Regulation 552\n\n\nhttps://www.ontario.ca/laws/regulation/900552/v157\n\n\nBut it's not anymore \n\n\n>5.-6.3 Revoked: O. Reg. 67/20, s. 3.\n\n\nhttps://www.ontario.ca/laws/regulation/900552#BK4",
            " Immigrant isn’t a race",
            "If I have the same issue with a white guy from Scotland doing it as a brown person from Lebanon, is it still racist? Or are you trying to win an argument the laziest way possible? \n\nCanada has way too many loopholes for foreigners of all races to take advantage of the country, and the cost of these loopholes hurt all Canadians living here.",
            "I’m waiting on the election for that.  \n\nThe polls are clear though, we are getting a new government that will hopefully slam the door shut. \n\nWe need a five year halt on all immigrant streams, and strict tourist visa requirements on all non first world countries.",
            "Before technology this is how country's got taken over. This is warfare. Wait til it comes to us. We are heavily disarmed. Will we fleed or fight? And if we fight, then with what? Many of us will die if war comes here.",
            "No I think thats virtue signaling, I think they give a shit about virtue signaling and looking good rather than actually doing good. Is that so hard to understand?",
            "The box you quoted is quite literally in the section with the heading\n\n> Emergency authorizations granted for humanitarian reasons",
            "I agree with you but that guy was dogwhistling",
            "I agree with you on that one but people shouldn't be blamed for merely doing what's best for them.",
            "By investing in real estate in another country? They don't want war, they come here to make money and then go back home to hang with their family. It isn't much different than rural Canadian going to live in Montreal or Toronto until they are successful enough financially to go back home and live a nice life or retirement.",
            "And I think being a Canadian in a war zone is worse than being a Canadian who spends all day bitching online while he reaps the benefits of his nation's security and stability. \"Never enough\" is your mentality and that's why you have no sympathy for your fellow Canadian.",
            "I don’t blame them, I blame our government.",
            "Wouldn’t what’s best for you to be instead of coming to a new region to pillage their resources… to have taken up the offer to be a part of our communities and actually be loyal to our country as many immigrants have?\n\nSeems pretty short sighted to me, as the good will of Canadians isn’t infinite.",
            "Yes, it is VERY different.  They are living in a foreign country.",
            "Ok, bring em in. Screen them. Let them work. We have license to work over here. So let them labour and earn license here. We clearly have a problem. Start from the bottom and earn. If you need debt? Take it. We shouldn't pay for it. Let them struggle and thrive. Earn their license (trades) if they're more than qualified then we'll pay them less (for 4 yrs) til their comparable and we'll build the houses for them. Maybe some will build for themselves.",
            "I'm 19 boutta go homeless because I can't find work. Wild that I might think people that live here should be a priority and fixing the existing issues here. Over those living in another country. Is stability a joke? Inflation is fucking astonishing and we literally have the most expensive housing in all the G7 nations. All while we continue to flood more people in due to shitty immigration policy. Idk maybe I have no sympathy because the government has zero sympathy for the people here? Maybe when they give a shit about their citizens and not votes I'll care. Like are you under the impression the government cares about those people? Its all virtue signalling for people like you to praise"
        ]
    },
    "After weeks without water, Calgarians now smell like Edmontonians": {
        "title": "After weeks without water, Calgarians now smell like Edmontonians",
        "score": 555,
        "url": "https://www.thebeaverton.com/2024/06/after-weeks-without-water-calgarians-now-smell-like-edmontonians/",
        "content": "",
        "num_comments": 28,
        "comments": [
            "While satire posts are popular we understand that not everyone enjoys them. If you wish not to see them please use the filter on the sidebar or set your own filters to block satire content or websites.\n\nLa satire est populaire ici, mais nous comprenons que tout le monde ne l'apprécie pas. Si vous ne souhaitez pas les voir, veuillez utiliser le filtre sur la barre latérale ou définir vos propres filtres pour bloquer le contenu satirique ou les sites Web.\n\nFilter out Satire - Filtrer Satire: https://st.reddit.com/r/canada\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/canada) if you have any questions or concerns.*",
            "Oh man that made me laugh… in my long hot shower… after watering my garden…",
            ">CALGARY – After two weeks of restricted access to water for showers, laundry, and other acts of hygiene, sources have reported that Calgarians now smell like Edmontonians do all year long.\n\n>“Jesus, it reeks like Whyte Avenue in here,” said a Calgarian eating in a crowded restaurant. “If I wanted to smell filthy, sweat-drenched people abandoned by God himself I’d go to an Oilers game.”\n\n>One of Calgary’s water mains broke on June 5, forcing Calgarians to ration water and plunging the city into a scenario locals have described as “frustrating,” “alarming,” and “Edmonton-esque.”\n\n>“It’s been tough on my friends and family, but I lived in Edmonton during a low point in my life, so I’m used to being among the unwashed masses,” said one Calgarian. “I keep telling everyone that yes, the whole city really does just share a single bathtub that’s kept in the City Hall foyer and filled with used pasta water.”",
            "That is hilarious.",
            "Nah…That smell is playoff hockey.  \nMost Calgarians don’t recognize the odour.  \nOr Torontonians.",
            "At least Calgarians now know what hard work smells like",
            "Lol",
            "🤣🤣🤣🤣🤣",
            "I’d be outraged but yeah, I mean we probably smell like Edmontonians now",
            "Lol they should adopt a stinky name to celebrate this history of stank, like 'cabbagetown' or 'hogtown' or something like that.",
            "It's Canada, we have the most fresh water in the world. Somebody fucked up. Haha",
            "...bathed in Axe deodorant spray or Old Spice? Cause it's usually one or the other.",
            "Chocolate chip coookies, whiskey, and freedom.",
            "Ahhhh you smell like you drive….shity",
            "Bbbbbbbbbbuuuuuuuurrrrrrrrrrnnnnnnnn",
            "Edmonton smells like either oil, cow shit, or both depending on the day.\n\nI'm not joking or exaggerating. If you live there you probably don't even notice it anymore.",
            "Hey man, I do the same.  \n\nJust after dark with a balaclava on",
            "Shower in the rain... If it rains?",
            "White collar Calgary knows hard work but blue collar Edmonton doesn’t? That’s certainly a take…",
            "For once I actually laughed out loud at something.",
            "We aren't that dirty ever",
            "Pretty obvious you’ve never been to Edmonton",
            "🤣",
            "That's the opposite of what they were saying. It was a joke",
            "Jokes are funny and well written. that was neither.",
            "Calgarian who works in tech.  \n\nIt was allright"
        ]
    }
}