{
    "What Car Should I Buy? - A Weekly Megathread": {
        "title": "What Car Should I Buy? - A Weekly Megathread",
        "score": 8,
        "url": "https://www.reddit.com/r/cars/comments/1dhxirr/what_car_should_i_buy_a_weekly_megathread/",
        "content": "Any posts pertaining to car buying suggestions or advice belong in this weekly megathread; **do not post car-choosing questions in the main queue**. A fresh thread will be posted every Monday and posts auto sorted by new. A few other subreddits worth checking out that will help your car buying experience are [/r/WhatCarShouldIBuy](https://www.reddit.com/r/WhatCarShouldIBuy), [/r/UsedCars](https://www.reddit.com/r/UsedCars) and [/r/AskCarSales](https://www.reddit.com/r/AskCarSales). [www.everydaydriver.com](http://www.everydaydriver.com/) may also be helpful.\n\nMake/Model-specific questions should be asked on Make/Model-specific subreddits. Check the [AutosNetwork](https://www.reddit.com/r/AutosNetwork/wiki/main) for a complete list of those subreddits. Also check out our [community-sourced Ultimate car buying wiki.](https://www.reddit.com/r/cars/wiki/whatcarshouldibuy)  \n\n\nFor those posting:  \n\n\nPlease use the following template in your post.\n\n**Location:** (Specify your country or region)\n\n**Price range:** (Minimum-Maximum in your local currency)\n\n**Lease or Buy:**\n\n**New or used:**\n\n**Type of vehicle:** (Truck, Car, Sports Car, Sedan, Crossover, SUV, Racecar, Luxury etc.)\n\n**Must haves:** (4x4, AWD, Fuel efficient, Navigation, Turbo, V8, V6, Trunk space, Smooth ride, Leather etc.)\n\n**Desired transmission** (auto/manual, etc):\n\n**Intended use:** (Daily Driver, Family Car, Weekend Car, Track Toy, Project Car, Work Truck, Off-roading etc.)\n\n**Vehicles you've already considered:**\n\n**Is this your 1st vehicle:**\n\n**Do you need a Warranty:**\n\n**Can you do Minor work on your own vehicle:** (fluids, alternator, battery, brake pads etc)\n\n**Can you do Major work on your own vehicle:** (engine and transmission, timing belt/chains, body work, suspension etc )\n\n**Additional Notes:**\n\n​\n\nFor those providing suggestions: Facts are ideal in this thread, especially when trying to help out a new car buyer. Please help out buyers with sources and reasoning for your suggestions.  \n\n\nFor those asking for help, be sure to thank those who take the time to offer you advice (especially those who lead you to a purchase.) A follow up thank you and the knowledge that their advice led to a purchase is a very warm fuzzy feeling.",
        "num_comments": 50,
        "comments": [
            "\n**Location:** Michigan\n\n**Price range:** $30-50K\n\n**Lease or Buy:** Either\n\n**New or used:** Either\n\n**Type of vehicle:** Sedan\n\n**Must haves:** Top safety features, reliability, luxury feel\n\n**Desired transmission** Automatic\n\n**Intended use:** Daily Driver\n\n**Vehicles you've already considered: Camry Hybrid, Lexus ES300H\n\n**Is this your 1st vehicle:** No\n\n**Do you need a Warranty:** No\n\n**Can you do Minor work on your own vehicle:** Yes\n\n**Can you do Major work on your own vehicle:** No\n\n**Additional Notes:**\n\nLooking for a good daily driver",
            "I’m in North Texas, doing a lot of driving. \n\nI don’t haul stuff but it would be my daily driver. I’d prefer automatic. I’m looking at used mustangs but really am pretty I knowledgeable when it comes to years and stuff. I want a V8 before they go the way of the dodo. \n\nUltimately what I want in a car is something enjoyable to drive on American highways, not too big for city driving, and is something that won’t be in the shop all the time due to issues. The mustang is interesting to me due to being able to get some higher trims used with under 30k miles for around 30k. Im just wondering what my options are if I want to stay under 35k but have a car that will be fun and last me 7 years or so.",
            "M240i G42 vs 6th gen Camaro SS\n\nLocation: USA\n\nPrice range: $50K\n\nLease or Buy: Buy\n\nNew or used: either\n\nMust haves: A lot of legroom (36\" inseam), good power and handling.\n\nDesired transmission (auto/manual, etc): probably auto\n\nIntended use: weekend car\n\nIs this your 1st vehicle: nay\n\nDo you need a Warranty: It would be nice \n\nCan you do Minor work on your own vehicle: yes\n\nCan you do Major work on your own vehicle: I've done some major work but would rather not\n\nAdditional Notes: Used pricing on both of these vehicles is high (close to MSRP). My guess is the V8 Camaro will hold it's value better long term. The M240i might make more sense to buy new, especially since used G42's are scarce. I've tested the Camaro. Haven't tested a 2 series.",
            "Location: Pennsylvania, greater Philly area\n\nPrice range: $25K max\n\nLease or buy: Buy, paying cash\n\nNew or used: Used\n\nType of vehicle: SUV, wagon, hatchback, sedan (in order of preference)\n\nMust haves: Safety and reliability\n\nIntended use(s): Daily driver\n\nIs this your first vehicle: No\n\nDo you need a warranty: No, but wouldn't turn down a CPO warranty\n\nCan you do Minor work on your own vehicle: Yes\n\nCan you do Major work on your own vehicle: No\n\nAdditional Notes: I'm looking to replace an aging vehicle that's racking up repair costs with something a little more safe and reliable. It'll be just me most of the time, but I'll occasionally be taking my daughter, hence the safe requirement. $25K is my absolute maximum; I would love to come in under that if possible.",
            "Location: SoCal, CA, USA.  \nPrice range: $20,000 - $35,000.  \nLease or Buy: Buy.   \nNew or used: Used.  \nType of vehicle: Car, Crossover, SUV.  \nMust haves: Spacious, Sporty, Apple Carplay (factory or retrofit), 4 doors.  \nDesired transmission: Open for auto or manual.  \nIntended use: Daily Driver, Family Car.  \nVehicles you've already considered: BMW 640i GT, 440i GC, X3, Golf R, Kia Stinger  \nIs this your 1st vehicle: No.   \nDo you need a Warranty: No.  \nCan you do Minor work on your own vehicle: Yes.  \nCan you do Major work on your own vehicle: No.  \nAdditional Notes: Looking for a car that has two personalities. One as a comfortable DD, family capable, spacious, but still has a spirited, enthusiast side. I test drove a 640i gran turismo with the famous B58 engine, thinking it was a good compromise, but it was almost TOO refined. It hauls ass and had no issue doing so, but its very floaty and luxurious and I would want something with a little more edge or rawness.",
            "**Location:** Southern Wisconsin, USA\n\n**Price range:** 20k - 35k\n\n**Lease or Buy:** Buy\n\n**New or used:** Either\n\n**Type of vehicle:** Sedan\n\n**Must haves:** Hybrid, good tech, good safety features (LKA, BSM, PCAS)\n\n**Desired transmission** (auto/manual, etc): Either (with hybrid probably auto though obviously)\n\n**Intended use:** Commute twice a week 25 mins mostly on highway, some city driving\n\n**Vehicles you've already considered:** Prius, Accord, Camry, Hyundai Elantra Hybrid (limited trim)\n\n**Is this your 1st vehicle:** no\n\n**Do you need a Warranty:** no\n\n**Can you do Minor work on your own vehicle:** no\n\n**Can you do Major work on your own vehicle:** no\n\n**Additional Notes:** I don't like driving and I get anxious about accidents so having a car that can \"assist\" is a big win for me. I am a software dev and love technology/a futuristic look, but I know next to nothing about cars and don't need car person features like good acceleration, handling (beyond what a layperson could tell), etc.",
            "\n**Location:** Massachusetts\n\n**Price range:** 20-35K\n\n**Lease or Buy:** Either\n\n**New or used:** Used\n\n**Type of vehicle:** Sports or Sedan\n\n**Must haves:** AWD, Fuel efficient \n\n**Desired transmission** Automatic\n\n**Intended use:** Daily Driver,\n\n**Vehicles you've already considered: Hyundai N, Alfa Romeo Giulia, Volvo S60\n\n**Is this your 1st vehicle:** No\n\n**Do you need a Warranty:** Yes\n\n**Can you do Minor work on your own vehicle:** Yes\n\n**Can you do Major work on your own vehicle:** No\n\n**Additional Notes:**\n\n​Looking for a good daily driver and one that looks nice would be ideal. I work in a business that deals with client meetings and I would like a car with a nice aesthetic when coming to the meetings. Also one that wont be insanely expensive to fix.\n\nFor those providing suggestions: Facts are ideal in",
            "Location: Nevada, USA\n\nPrice Range: 10-15k max\n\nBuy: Used due to budget\n\nVehicle Type: small sedan, sports car, compact crossover\n\nMust Haves: Good on gas, inline 4 (or V6), good amount of space in the trunk & easy to repair (I don't need another project right now haha)\n\nWants: Preferably RWD, Toyota/Lexus (Vehicles have been reliable enough for my parents), not too old (Before 2007) but not too new (2020 & above unless a car can be obtained within my budget)\n\n Gearbox: Auto but am willing to learn manual\n\nIntended use: Daily, family. I plan on hitting the track with it as a treat every 2-3 months or so.\n\nVehicles I've considered: Toyota RAV4 (Will update when I've done more research)\n\nFirst vehicle?: No\n\nWarranty: No\n\nAble to perform minor work?: Yes\n\nAble to perform major work?: No\n\nNotes: I drive a 91 Civic however it is in need of some repairs. Due to these reasons, it would be convenient for me to use a different vehicle while getting these repairs done. \n\nI plan on using this \"new\" vehicle until my Civic is road worthy again.",
            "**Location:** Amman , Jordan \n\n**Price range:** 21k USD / 15000 Jods\n\n**Lease or Buy:** Buy\n\n**New or used:** Used\n\n**Type of vehicle:** Sedan\n\n**Must haves:** Hybrid/EV , it has to be a cheaper option for maintenance/gas in hybrid case\n\n**Desired transmission** auto\n\n**Intended use:** I'm working as a civil engineer I need a car that can drive me around the sites inside the city with range of 100km-120km per day\n\n**Vehicles you've already considered:** Tesla model 3 2018 long range,  Tesla model 3 standard plus 2019 , hyundai ioniq 2019 \n\n**Is this your 1st vehicle:** yes\n\n**Do you need a Warranty:** no\n\n**Can you do Minor work on your own vehicle:** yes\n\n**Can you do Major work on your own vehicle:** no\n\n**Additional Notes:** So I'm a civil engineer planning to get my first ever car that I saved so much for . My range would be 21k USD I can't charge at my current apartment building and most chargers near me are 22kw with one 120kw but it's a bit far away so my options are 2018 tesla model 3 long range or 2019 Standard plus model 3 or hyundai ioniq 2020\n\nBoth tesla's are used with +100000 miles on it and ioniq 25000 miles",
            "Halp! Trying to decide between a 2015 Nissan versa note s+, 2015 Nissan versa note sv, or a 2014 Kia soul.  \n\nI don't know much about cars just how to fix them. Opinions please!\n\nAlso I'm trading in my 2003 Saturn ion for a down payment and these are the only vehicles in the tri-city area that have the features I want that are in my price range so please don't tell me so find something else. Unless you know of something mechanically inherently bad about these",
            "Looking at suggestions for an upgrade for my 2008 GTI. I'm primarily looking for something $20k or below with an emphasis on sporty-ness and slight luxury. I know a thing or two about fixing cars on my GTI (oil, air filter, tires) but anything that's generally more an 2 hour job (something that isnt brakes or an alternator) I usually don't want to touch.",
            "I’m between the 2024 Sonata Hybrid SEL and the 2024 Elantra Hybrid Limited\n\nI'm looking for a car and I came across these 2 similar options (prices r the same i think) and honestly can't tell which is better. I heard the elantra is more efficient (and a little cheaper?) however the sonata is more roomier and comfortable with more features. May someone please help with the difference?\n\nI'm more into features than looks however I did see that weird handle in the center console in the elantra which might be annoying...\n\nalso the sonata blind spot camera feature is shouting to me it's cool...\n\nIf anyone has other hybrid sedan recs please let me know!!",
            "Hello everyone! I am finally in the market for my first car, and I'd love some advice from more experienced drivers. \n\nSo, it will be my first ride, and my budget is pretty low. However, I'd really love some fun quirky car with a character, you know. I really love the looks of Corvettes C3 & C4, and just classic 70s or 80s convertibles like MGM or Midget**,** Alfa Romeo Spider, or something cool with pop-up headlights. \n\nSince the budget is so low, I see two options. Either purchase a more modern and relatively reliable car and pray to god it won't break because I won't be able to fix it. Or maybe find an older car (even if it's slightly pricier) in hopes that fixing it will be easier since there are fewer electronics and complicated stuff.    \n  \nHowever, I've never dealt with fixing and assembling cars. I am willing to do the repairs, which can be done with YouTube, but smth like disassembling the engine would be way out of my skill set.   \n  \nLast but not least, since the initial budget is low, the insurance, gas, and future repairs are also something I'm trying to be mindful of.  \n  \n**Location:** Los Angeles, California  \n**Price range:** $3500, ideally around $2500-3000  \n**Lease or Buy:** Buy  \n**New or used:** Used  \n**Type:** Convertable or Coupe   \n**Must haves:** Being able to be a daily driver, would love airbags too  \n**Desired transmission:** Prefer auto, but can go manual  \n**Intended use:** Daily Driver  \n**Vehicles I've already considered:** Corvettes, Mustang, MG Midget, Miata  \n**Is this your 1st vehicle:** Yes  \n**Minor vehicle work:** Probably  \n**Major vehicle work:** Doubt it",
            "Hey all, need some opinions on my next car purchase, in the US, NC, need something reliable for commuting to work,  decent gas mileage as I drive about 40 miles to work and back daily. I’m looking to spend $10-12k. Currently driving a 2012 Hyundai sonata hybrid and it’s been ok but has annoying quirks.",
            "**Location:** SEA (Indonesia)\n\n**Price range:** max Rp. 200.000.000,- (12k in USD)\n\n**Lease or Buy: both**\n\n**New or used: used but i prefer new if my criteria met**\n\n**Type of vehicle:** Sedan \n\n**Must haves:** Fuel Efficient, tether for car seat, fun to drive, good suspension and RWD\n\n**Desired transmission** (auto/manual, etc): i prefer it AT since my wife want to learn to drive \n\n**Intended use:** Family Car and Daily car\n\n**Vehicles you've already considered: Brio from Honda**\n\n**Is this your 1st vehicle: Nope**\n\n**Do you need a Warranty: Yes**\n\n**Can you do Minor work on your own vehicle:** Yep all basic work\n\n**Can you do Major work on your own vehicle:** Nope\n\n**Additional Notes:**\n\nHey, everyone currently looking for a car that fun to drive and easy to drive for a beginner driver (my wife), currently i  drive a MPV some kind of wagon type car from Daihatsu my problem is that car sometimes have really tricky handling if you about reach  60mph since it was fwd and i used to drive a RWD car maybe that one of the source for my handling problem but i just recently learnt that my car doesn't have a tether for car seat for my boy, thats why i asked for all redditors is there a car that you guys can recommend?",
            "**Location:** Southern Wisconsin\n\n**Price range:** <$6000\n\n**Lease or Buy:** buy\n\n**New or used:** used\n\n**Type of vehicle:** sedan, coupe, hatchback\n\n**Must haves:** decent reliability\n\n**Desired transmission**: manual if possible\n\n**Intended use:** daily driver\n\n**Vehicles you've already considered:** subaru wrx/impreza, mitsubishi lancer, toyota camry, vw gti/golf/rabbit/jetta, honda civic/accord\n\n**Is this your 1st vehicle:** no\n\n**Do you need a Warranty:** no\n\n**Can you do Minor work on your own vehicle:** yes\n\n**Can you do Major work on your own vehicle:** anything that doesn't need a lift\n\n**Additional Notes:**\n\nReally just want something that won't die on me. I'm proficient with preventative maintenance and could do some of the more intermediate repairs if it doesn't need a lift. Moving on from my automatic '12 Ford Focus. Fun little car, but some of it's issues are starting to show. Would love a manual. Budget is low but excludes post-purchase repairs, insurance, and snow tires.",
            "Help! Im in Italy, i have to decide between OPEL CORSA OPC (year 2014+) and FORD FIEST ST180 (year 2008+ ), i would like to find anything below €10k and 120k km, pls help me, describe me problems, cons and pros, anything.",
            "New parents need new car to replace one that was rear-ended and totaled last week. \n\n**Location:** Maine, USA\n\n**Price range:** $30K max (looking for something between $23-28K)\n\n**Lease or Buy:** Buy\n\n**New or used:** used\n\n**Type of vehicle:** (Truck, Car, Sports Car, Sedan, Crossover, SUV, Racecar, Luxury etc.): SUV, Crossover\n\n**Must haves:** Ability to hitch a bike trailer to the back. Less than 60K miles. Good in snow.\n\n**Desired transmission**: N/A\n\n**Intended use:** (Daily Driver, Family Car, Weekend Car, Track Toy, Project Car, Work Truck, Off-roading etc.): Family car for dad's daily use (which is very minimal due to bike commuting). Need room for large dog and car seat, ski equipment.\n\n**Vehicles you've already considered:**Prior vehicle was Rav-4, and we own a Subaru Crosstrek. We've looked at Subarus, Volvos, Hondas, and Toyotas. Favor Volvo, but know our price range may be low for that.\n\n**Is this your 1st vehicle:** No\n\n**Do you need a Warranty:** No\n\n**Can you do Minor work on your own vehicle:** (fluids, alternator, battery, brake pads etc): Yes, but would prefer to leave it professionals these days.\n\n**Can you do Major work on your own vehicle:** (engine and transmission, timing belt/chains, body work, suspension etc ): No\n\n**Additional Notes:** We want a safe car that will last. We won't put a lot of miles on it, but it will be our primary vehicle when we do travel. Just a safe, reliable car without a lot of bells and whistles (e.g., Bluetooth is the only modern tech advance we would want, and we could even live without that). Thank you to anyone and everyone for their help and advice.",
            "Phoenix, AZ. Less than $20,000, looking to buy used, car or sedan. Reliability, fuel efficiency, and longevity are priority. \nI’m a delivery driver. I drove my 2011 Elantra sine 2019 and I love it. Small, good handling, but lots of manufacturers recalls and a couple accidents. Tranny finally went out. \nI’m looking for a car that is gonna last me more than five years. I want something that has not been in an accident or had too many previous owners. I am able to handle basic repairs. Ideally, looking for something with very few issues that I will need to deal with after dealing with my car for a couple of years having a lot of issues. \nAny help is truly appreciated, I genuinely don’t know where to start. I have been fortunate enough that my parents helped me get my previous two cars. I don’t know if I should go through a dealership, a private seller, Carvana? I have one mechanic telling me to buy American made cars, and the other one telling me that I should go with Toyota, Honda, Hyundai, etc..",
            "Location: British Columbia, Canada\n\nPrice range: 30k CAD max, preferably 26k and below.\n\nLeese or Buy: Buy\n\nNew or Used: Used\n\nType of Car: SUV, (Mid sized SUV?), Crossover\n\nMust Have: Good Trunk Space, Back-Up Camera, Automatic Transmission\n\nPreferably have: Smooth Transmission, 3rd row of collapsable seats, good fuel economy\n\nPreferred transmission: Automatic\n\nIntended use: Daily driver, family car for 4. Need good trunk space for hockey equipment.\n\nVehicle I have considered: going to used dealer tomorrow, will update \n\nIs this my first vehicle: Yes\n\nDo I need a Warranty: Insurance, Yes, warranty, maybe\n\nCan I work on my vehicles: never done any vehicle maintenances even the most basic refills, but I will learn.\n\nAdditional notes:\n\nThe car is mainly for my mom, as I rarely drive. We currently drive a beaten down used 2007 Acura MDX. We like the car, but its definitely showing its age. We would like to get out of this box of trouble in the near future, any advice is welcomed.",
            "Looking to choose between the following two vehicles, 2024 Chevy Traverse LT AWD or 2024 Toyota Grand Highlander Limited AWD and can’t make up my mind. \n\nLeaning towards to Chevy for certain tech and cargo features but hard to ignore Toyota’s perceived reliability.\n\nAny suggestions on which I should go with?",
            "Location: Romania \n\nPrice range:€18-23k\n\nLease or buy:buy\n\nNew or used:new \n\nType of vehicle:SUV\n\nMust have:reliable, fuel efficient, and have an ICE engine\n\nPrefered transmition: manual (but Auto is ok)\n\nIntended use:daily driver\n\nVehicles considered:MG ZS, Suzuki Vitara and Dacia \nDuster \n\nIs this my first vehicle:no\n\nAditional notes:\n\nSo I'm looking at buying a new, small SUV between €18-23k. I don't have kids and don't plan to, so backseat room isn't important, but I am a tall man (185 cm or 6'1) so head room is important. In terms of trunk space it needs to fit at least one suitcase. Finaly it must have an ICE engine since I live in an apartament block with no EV charging points and im not about to draw an extention cord out my window.",
            "Middletown, DE, around 3k or less, for sure wanna buy a used manual sedan to use as a daily driver/project car, never been into cars crazy but recently have, wanna get a nice beater/car to work on and learn to work on and just to have fun with",
            "**Location:** Phoenix, AZ\n\n**Price range:** 5k-15k\n\n**Lease or Buy:** Buy\n\n**New or used:** Used\n\n**Type of vehicle:** Crossover, SUV\n\n**Must haves:** AWD, at least 7in clearance\n\n**Desired transmission** (auto/manual, etc): auto\n\n**Intended use:** Daily driver, occaisional dirt/gravel road\n\n**Vehicles you've already considered:** Subaru outback/forester, Toyota Rav4, Honda CRV\n\n**Is this your 1st vehicle:** no\n\n**Do you need a Warranty:** no\n\n**Can you do Minor work on your own vehicle:** (fluids, alternator, battery, brake pads etc): yes\n\n**Can you do Major work on your own vehicle:** (engine and transmission, timing belt/chains, body work, suspension etc ): maybe some but not much\n\n**Additional Notes:**\n\nBuying a car in Phoenix, will be relocating to the northeast in a few weeks.  Will be used for commuting and some longer trips on weekends, might be used for occasional lightweight towing.  Was looking at a lot of subarus, a bit worried about the 2.5L engine issues, but have heard that the head gasket issues have been improved in recent models.",
            "Location: Denver, Colorado  \n\nPrice range: 60,000 \n\nLease or Buy: Buy \n\nNew or used: New or used, new preferably  \n\nType of vehicle: Truck, SUV \n\nMust haves: 4WD, Ok gas mileage, enough interior space for comfortable road trips for 2+ people and small dogs, comfortable ride, must be able to safely transport me through snowy mountains. Nicer luxury features are a plus.  \n\nDesired transmission (auto/manual, etc): Auto \n\nIntended use: Daily driver, camping, outdoor activities like snowboarding, kayaking, road trips  \n\nVehicles you've already considered: Toyota Tundra, Toyota 4Runner \n\nIs this your 1st vehicle: No \n\nDo you need a Warranty: Yes \n\nCan you do Minor work on your own vehicle: No \n\nCan you do Major work on your own vehicle: No",
            "Accord hybrid",
            "I would consider a Mazda such as a 2021 (or newer) CX-5 for a great daily driver and if you are maxing at one child seat. Safe, reliable, and the infotainment system was updated in 2021.  You might be able to find CPO with that budget.",
            "Camry or accord for sure. Tech in the Camrys is great.",
            "I think you're on track with an S60.  Volvos are very underrated.  Newer ones are generally reliable, I think they beat everything for looks, and are very comfortable.",
            "I'd seriously look at Mazda.  They will be more fun and sporty to drive than a Rav4 or equivalent Lexus and they're very reliable.  It won't be RWD, but can be AWD.  Something like a CX-5 or CX-3.  If CX-5, go 2017 or later.  They refined them quite a bit so they feel more upscale inside, and road noise was reduced a lot over the earlier ones.",
            "IS350 or whatever the newest Lexus IS you can afford is.",
            "Look at 15ish VW GTI. They're the best daily and it isn't even close. Plus it'll be great on the track.",
            "What's your budget? What mileage are these?\n\nI would avoid the Kia due to the ignition issue. Even if the issue is fixed, some idiot might break in\n\nOlder Nissan CVTs fail around 100k miles.",
            "I drive a 2016 Subaru Impreza sedan (base trim) and it’s been great for me. For $12k you could probably get premium or limited trim for improved sound system and other features. My only complaint is relatively weak acceleration, but it’s been very dependable and gets solid gas mileage.",
            "Have you looked at the Hyundai Sante Fes? Nissan Rogue or Pathfinder, look for the AWD models for all these",
            "You can get a 2021 or newer Corolla hybrid. 70k miles or lower. Small, efficient and reliable.\nTry carvana and CarMax.",
            "Seconded.  My wife's on her second CX-5.  Very good vehicles.  Super reliable, fun to drive, every person that's taken us up on that recommendation has been very happy.",
            "Thank you!",
            "Just move fast 'cause S60 production ends this month.",
            "What do you think about a Genesis G70?",
            "My budget is not good lol. Probably financing for 5k tops. \n\nYeah I read about the cvt issue and the car is about 132k miles so I'm thinking the car was initially traded because of the cvt and the dealership hopefully replaced it which is the first thing I'd check on Thursday when I go to check out the lot.\n\nHad no idea about the Kia ignition? What's that all about? It's probably similar to the one I had in my Saturn which was a recall and I'm more than comfortable fixing that myself. \n\nThanks for helping.\n\nEdit: I'm in Phoenix btw",
            "I was considering a 2013 Impreza sport that I found, around 60,000 miles on it for $12k",
            "I had not. Thank you for the recommendation!",
            "Yup, I saw that.  Hopefully the V60 doesn't follow.  I had an XC70 for a short period of time and was disappointed they dropped those in favor of crossovers.  Always preferred the lifted wagon look.",
            "Do you think that will make repairs more expensive in the future?",
            "I have no experience with them.  It's petty, but I feel like in many ways they're just copying the \"luxury car formula\" and don't have much of an identity of their own - look at the logo, for example.  On the flip side, that translates to a lower cost.",
            ">  Had no idea about the Kia ignition? What's that all about? It's probably similar to the one I had in my Saturn which was a recall and I'm more than comfortable fixing that myself.   \n\n\n\n\nKia decided to save like  $1.05 per car by not using an immobilizer on cars between 2010-2022 with keyed (I.e. not keyless) entry, which resulted in them being ridiculously easy to steal. This caught on as a tiktok trend (lmao no, seriously) resulting in a shitton of Kias being stolen, and even unaffected cars are often targeted by would-be thieves. In many urban areas this has resulted in affected Kia models having brutal insurance costs or being refused insurance entirely. If you want to buy it get some insurance quotes first to see if you would be hit by that.   \n\n\n\n\nThe Soul is one of the immobilizer-less cars and is affected.",
            "I don't think it'll be a significant issue.  It's going to share a lot of parts with other vehicles in Volvo's lineup.",
            "Ah I see what your mean for sure. I will not get the Kia because I already get my car broken into semi regularly 🤦 funny thing is I'm order to steal it it works have to hotwired. I've yet to meet anyone who can start it with the key besides myself 😂 I have to start it for the mechanics to drive it into the garage 😂\n\nAs for the Nissan, I've been doing some research and it turns out MOST of the transmission issues are due to poor driving skills and not following maintenance guidelines. So again I'll see if there's a history of maintenance on it and crank the hell out of the cvt during the test drive just to be sure, as well as check the level and quality of fluids"
        ]
    },
    "General question Wednesday: Ask your general car-related question and maybe someone will have an answer.": {
        "title": "General question Wednesday: Ask your general car-related question and maybe someone will have an answer.",
        "score": 5,
        "url": "https://www.reddit.com/r/cars/comments/1djil5v/general_question_wednesday_ask_your_general/",
        "content": "**Please direct all choosing/purchase questions to the weekly car-buying sticky. All rules of** r/cars **apply here.**",
        "num_comments": 29,
        "comments": [
            "Do light bulbs from signal lamps and HID headlights go in the trash or are they recyclable?",
            "What is the cross-reference part number on NGK for the O2 sensors (both before and after cats) for the 2004 Lamborghini Gallardo?",
            "Was there ever any “active seat” feature commercially sold? \n\nI don’t really know how to name such a feature and was wondering why/why not it was never done. Basically I’m imagining the front seats having their own “suspension” so you would feel even less what was transmitted from the road. Road feel would obviously be 0 but for a high end luxury car it doesn’t really matter. \n\nI think there’s a similar system in trucks? Is it just a shitty idea? Not enough space to implement? Would make people car sick?",
            "[Car Accessories](https://u.pcloud.link/publink/show?code=VZbyQR0Z8WzwCCicyppyW45ejkzbx7HBq1qV)\n\nI have a Nissan Versa Sedan SV Special Edtion\n\nI want the car accessories in the images but they won't exactly enough fit my car. \n\nIs there something I can buy to make them fit or is there something alike I can buy?",
            "Long Term Idling Bad for Car?\n\nI have a 2013 Audi A5 with 50,000 miles on it. Sometimes, I like to work in my car with a nice view, essentially using it as a mobile office.\n\nWould it be especially bad for the car if I continued to do this frequently, for 1-2 hours a day with the AC on lightly?\n\nI'm uncertain if idling in particular causes wear or damage to parts, or if it's problematic compared to normal driving.\n\nReally appreciate any advice or input. Thanks in advance for any help.",
            "[removed]",
            "need some tire insight (maybe i'll ask again next Tuesday).\n\nI just bought a '07 GX470.  1 of the tire is older and more worn than the other 3 (2018 vs 2022).\n\nDo i just replace the 1 or should I opt to replace a pair?  The 1 old tire is getting close to aging out and it's showing signs of ozone/UV checking too.  Also, my spare is the original that came with the truck back in 2007 lol.",
            "All I hear about luxury cars is that they're a pain to maintain and are always breaking down. Do BMWs, Audis, and Mercedes really break down every year or so?",
            "what is the best body kit for my supra mk3 ?",
            "Need some advice on how to buy a car. Never done it before. I've owned 3 cars since I've been driving. One my dad gave me. One I bought for a grand from a co-worker. One I bought for a grand from some dude on Craigslist.\n\nLooking to actually get a new car now. I want to get either a 2025 Toyota camry or corolla. Depending on if I want to risk getting a hybrid or just get a gas engine. Anyways that's a different discussion.\n\nI want to know what I do to get a new car and not get taken advantage of or get ripped off.\n\nI have enough money to completely buy the car if that's the best way. Or I can put any amount of money down on it. I just want to know what I should do to not get ripped off or completely had by the dealer",
            "For a 2020 convertible would you go for a Camaro or Mustang?",
            "Which Grand Tourer would you have?\n\nBritish: Aston Martin DB12 | 4.0L Twin-Turbo V8 | 680 HP\n\nItalian: Ferrari Roma | 3.9L Twin-Turbo V8 | 620 HP\n\nGerman: BMW M8 Competition | 4.4L Twin-Turbo V8 | 625 HP\n\nJapanese: Lexus LC 500 | 5.0 Naturally Aspirated V8 | 477 HP",
            "I drove an W221 S-class with it\n\n\nNeat, but took too long for the seat to respond by the time I entered a curve",
            "I recall BMW had seats with active bolsters that counteracted the forces in corners (a bit different from your definition).  Ex. taking a left hand corner, the bolsters on the right side of the seat would inflate to keep your body from sliding to the right.\n\nAs for seat suspension, I don't recall.  I do know Mercedes-Benz had some very springy seats for awhile.  I think they felt great and seemed to soak up a lot of bumps.",
            "long periods of idling can cause fuel dilution of the engine oil, but mixed in with normal driving and getting the engine to proper operating temperature for like 10-15 minutes should evaporate the fuel out of the oil.",
            "Not really but I'd shorten the oil change intervals to a pretty conservative number of miles.",
            "Depends on the tread depth.  Ideally, this shouldn't have happened in the first place, but if the 2023 still have most of their tread depth left, you can replace the one.  I had to do this years ago, but I don't recall what I was was a safe difference.  And make sure you get a matching tire to what the other tires are.",
            "they dont just die on the side of the road, however cars with more bells and whistles have more opportunity for problems. They do not handle neglect well, at all.",
            "dunno, it's been a while since my 288k miles BMW M3 has let me down.\n\nbeing honest, a lot of luxury car owners don't maintain their cars as they should and defer the maintenance to another time.  The more they defer these maintenance items, the more likely it'll become an actual issue down the road.  Sadly these issues usually pop up after the first owners trade them in for the newer thing and the 2nd owner has to eat the cost of the neglect.",
            "Interesting! Makes me wonder if we’ll see that again at some point considering how far tech has come since then",
            "Still interesting thank you for your input!",
            "Is that from idling for a long time or from letting a car idle to warm up all the time?",
            "That and repair costs/parts pricing can bit higher than normal cars.",
            "Either can cause it.  Cold start idling where the piston and rings might not have a good seal and idling for long periods especially if injectors aren't quite healthy and not atomizing the fuel."
        ]
    },
    "Did you know a C5 Z06 is almost 100 lbs lighter than an FL5 Type R?": {
        "title": "Did you know a C5 Z06 is almost 100 lbs lighter than an FL5 Type R?",
        "score": 203,
        "url": "https://www.reddit.com/r/cars/comments/1dlj6x0/did_you_know_a_c5_z06_is_almost_100_lbs_lighter/",
        "content": "Kinda wild to think about a rear drive v8 weighing less than a front drive 4 cyl. Granted the new Civics are quite large and a C5Z is a 2 seater. Still it's impressive. ",
        "num_comments": 213,
        "comments": [
            "The FL5 Type R is also lighter than the 2024 Supra 3.0 (manual) by roughly 200 pounds. The MK5 is a dense car \n\n[https://www.caranddriver.com/honda/civic-type-r](https://www.caranddriver.com/honda/civic-type-r)\n\n[https://www.caranddriver.com/toyota/supra](https://www.caranddriver.com/toyota/supra)",
            "Since we're posting useless things:\n\nThe Evo is one of a very few USDM sedans that have a rear wiper. \n\n\nThe 2010 Lexus SC430 was the last car to offer a cassette deck.",
            "It's not even slightly wild, the cars are 20 years apart. The improvement in safety since then is what's wild",
            "The C5 Z06 is one of the greatest value drivers cars in the world.",
            "It's tiny, made of fiberglass, has an engine that is famous for its light weight, and was designed at a time when sports cars could basically be a tin can and still be street legal.  It would be weirder if it *wasn't* lighter than a modern tech-laden sedan.",
            "Not sure how a 20 year old Corvette weighing less than a new Type R is wild or surprising.",
            "The Tesla Model 3 and BMW M3 weigh about the same. Also the Hummer/Silverado battery weighs more than a whole Miata.\n\nThough, at this point in my life, I've driven lots of different cars and have stopped caring about weight numbers as much. I bet the FL5 Type R is pretty fun, and I know C5-7 Corvettes are all great too.",
            "I remember the first time googled car weights too.",
            "Now compare the C8 Z06 against the FL5 Type R lol. Cars are collectively getting heavier regardless of what it is. To really put things into perspective a C8Z weights roughly the same as an E90 M3.",
            "LS’s aren’t even that heavy…",
            "Did you know that most cars can be made almost 100lb lighter by diet and exercise?",
            "i hardly think this is impressive. the CTR (ek9) from the c5 z06 generation weighed 2300 pounds. the weight difference between the ek9 and c5 is right around the same weight difference as an fl5 and c8\n\nmore safety/technology standards means more weight.",
            "Lamborghini weigh about the same too. It's a part of why they're so expensive.",
            "When I was a kid, like 15 or 16, I always thought that a heavier car was better because it would be more stable, and safer.  I guess to *some* extent I was right, but I thought why would anybody want a light little Civic or Integra when they could have a sturdy big V8 car? \n\nWhen cars boasted lightweight features, it turned me off, lol",
            "well yeah, the interior is made of junk lol",
            "C5 😂",
            "C5 owner and driver with a bf that drives an fl type r here\n\n\nWe both feel the difference in both either in drifting or street racing my c5 is better for drifts and his is better for street",
            "I wonder if an average Civic owner is 100 lbs lighter than the average 'Vette owner though?🤔",
            "C5 interior is dogshit and chassis rigidity will never come close to matching the Type R\n\n\nIt would be interesting to compare comparable model year cars:\n\n\nEP3 Type R: 2654 lbs\nC5 Z06: 3118 lbs\n\n\nDifference: 464 lbs\n\n\nFL5 Type R: 3183 lbs\nC8 Z06: 3666 lbs\n\n\nDifference: 483 lbs",
            "The C6 Z is about 60lbs lighter than the FL5 as well.",
            "I've had a couple C5Zs, just amazing cars in every way. I see weights quoted now and then talking about how light they are I always think about the weight and power of a C5Z.\n\nIt's not that hard to get them to 29xx lbs. I think LTs and fixed projectors will basically do it iirc. LTs, intake and a tune get them to about 390rwhp with tranny gearing that makes it similar to having 3:90 gears. Pretty great combination in a great looking car thats as close to a go kart experience that you can get from a Corvette. C5Z is way better/different than a C5 coupe. Even driving around going 10mph I could tell a difference. My bone stock C5Z outran a full bolton coupe that got the bump on me.\n\nJust don't care for the C7Z. Lost it's way. It was just too fast and squirrelly and I didn't feel like I had control of the car. Especially because it was an autotragic.",
            "The Autozam Clef is the face the Precidia needed for me. I wish I had owned either.\n\nAlso: a stripped-out 94 Mazda 626 weighs the same as an FD",
            "It is shows how different design priorities can affect weight.",
            "I guess... it also have less safety tech too tbh.\n\n2014 mandate rear camera.\n\nI'm sure there are other safety stuff in the civic too.\n\nC5 is nice for the pop up headlight but it's like noticeably longer than c6 and they're on the same platform.",
            "It's really not surprising. That Corvette had so much plastic and very few features. Only one airbag iirc. The new Civic has so much tech. If they made an actual Type R with none of the gimmicky tech and minimal equipment, it'd probably be 700lbs lighter.",
            "Late breaking news…a plastic car weighs less than a metal one?",
            "It's actually all in the interior plastics and window switches ",
            "Fun facts\n\nA modern litrebike you can buy for well under 10k off craigslist has the same power-to-weight ratio of a Mustang GT\n\nIf the Mustang GT had 7 engines linked together.\n\nAdding a rider brings that down to a measely 5 engines.",
            "A few related fun facts:\n\nTo lose additional weight from the base model, the C5z actually used thinner glass, less sound deadening, and an oem titanium exhaust! Very very cool cars!",
            "The c5 is also lighter than my ram truck. Impressive.",
            "There’s a reason why there are classes…these aren’t in the same class regardless of decade.",
            "The truth r/cars needs to see, but doesnt want to admit. Alot of these \"enthusiast\" 4 cylinder cars are now so heavy and so turbo biased, they pretty much are almost as much of pigs as muscle cars and the whole \"but its fast in the twisties\" has become cope fuel.",
            "Did you know the BMW M240 is like 4000 pounds?",
            "Thats pretty light for the supra. its probably hundreds of pounds lighter than the equivalent M car.",
            "BMWs are just dense as fuck for some reason.",
            "Now I’m wondering what the densest car is. Probably an EV of some sort.",
            "Which is insane if you’ve sat in both of them. The Supra feels like it was made for a high schooler. At 6’3” I’m cramped in that thing.",
            "I believe the prior 3 generations were heavyweights in their class, too.",
            "\n> The Evo is one of a very few USDM sedans that have a rear wiper.\n\nName another",
            ">The Evo is one of a very few USDM sedans that have a rear wiper.\n\n3rd gen Camrys are also the only USDM wagons that had [two wipers for the rear windshield](https://i.imgur.com/cpK8bU3.jpeg). That's not even the most useless titbit about the rear wiper situation, that would be the fact that despite the fact it clears more of the rear glass than any other wagon Toyota still went to the effort to [flip the swipe direction for RHD cars.](https://i.imgur.com/S0fl4yL.png)\n\nAs far as I can tell the only other cars like this are 6/7/8th gen Toyota Crown wagons. The Mini Clubman also gets an honorary mention as it does have two rear wipers, but they're on separate windows as it has barn doors.",
            "I’d argue those two factoids are actually interesting.",
            "The first gen CRV came with a picnic table in the trunk.",
            ">The 2010 Lexus SC430 was the last car to offer a cassette deck.\n\nI too watched that episode of Top Gear special!\n\nThe 2010 Lexus SC430 was also, coincidentally, the worst car... in the world.",
            "Fun fact: the reason most sedans don't have a rear wiper is because the shape of the car allows air flowing over it while driving to clear the glass. It wasn't useful on the Evo, just cute.",
            "You know, I never understood why SUV’s get rear wipers, but sedans usually don’t.",
            "please sir, i want to know more useless things!",
            "Mazda made 3 versions of the same  car for the US market. The first Gen Mazda6 came in sedan, wagon, and hatch variants. Two of the three had rear wipers. Why they didn't add it to the sedan baffles my mind. It was the same rear window as the hatch and wagon. The just changed the frame to fit the style but used the same window, so you'd think they would have kept the wipers on the sedan, but nope.",
            "The Toyota Cruiser (the 80s generation one) was the last car to use a carburetor)",
            "C6 Z06 is only 35-100 lb heavier than the C5 Z06.\n\nThou the C7 Z06 truly let itself by a margin of 300-400 lbs.",
            "And what’s even more wild is despite all the safety improvement the fatality rate per mile travelled is about the same now as 20 years ago thanks to morons in oversized vehicles on cell phones",
            "I didn’t realize how incredibly safer newer cars are until I got hit on the highway going 70+ mph and ran into the concrete wall in my 2021 Type R and walked away with only a seatbelt burn. Definitely wouldn’t have been the same story in a 90’s car.",
            "Such a dumb post",
            "Stop telling everyone our secret!  I want to be able to afford one when the time is right.",
            "It's only 270lbs heavier than the GR86. Also crazy.",
            "A 20 year old purpose built 2 seater sports car heavier than modern fwd hot hatch based on an economy sedan...no way!",
            "The fact that it is a V8 and rwd doesn't even make it more remarkable in any way. It's ohv V8 has half the cams and the same amount of valves plus none of the turbo and associated bits. ",
            "Kind of makes you wonder why all these newer cars are such piggies",
            "Whoa, whoa. This is not allowed. Your post has been hidden since it does not have the mandatory amount of controversy.\n\nHa ha ha, imagine liking more than one car at a time. Absurd.\n\n/s",
            "The hammer EV should be outlawed just for weight alone . \n\nImaging a drunk driver driving and hitting you head on 70 mph \n\nYou will be dead",
            "I feel like you should be the type of guy to obsess over weight with a brz",
            "Holy crap your flair reminded me those have been out for a lot longer than I thought, I can't believe the BRZ has existed for over a decade now.",
            "It's like 350 with none of the accessories kinda funny",
            "EK9 was a total trash bin on wheels tho",
            "It's only 250lbs heavier than an ap1 s2000.",
            "I still think that when I'm in my Miata and there's a semi truck driving next to me on the highway",
            "Will never match?\n\nCome on, that frame is super easy to work on.",
            "Insert meme of sitting in the corner of a dance party with \"they don't even know how stiff my Type R chassis is\".",
            "How much does a Mustang GT weigh again?",
            "Thats insane. That's as much as the GT500 and the Hellcats and the BMW is tiny complex to them",
            "About 300 lbs more comparing Supra 3.0 to Z4 M40i",
            "The 2023 Toyota GR Supra 3.0 Premium 3dr Coupe weighs 3,411 lbs, while the 2023 BMW Z4 M40i 2dr Rear-Wheel Drive Roadster weighs 3,543 lbs",
            "Considering how tiny and slender the Supra looks with its 97\" wheelbase, the fact the 2-door coupe with no backseat weights more than a 4-door sedan was unexpected.",
            "Right? My Z4 with all its options added weighs in at 1600kg. I mean it hides its weight well but wtf? The entire G generation from BMW is porky for some reason.",
            "Whatever car your mom sits in\n\nOHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH\n\n(just kidding) \n\nMost likely an EV",
            " Currently, it's the '17 Maybach S600 Pullman. 11,244 lbs (5100 kg).\n\nYes, I looked it up. I ain't got time for all that other mess.",
            "The Bugatti Veyron is the same length as the current Corolla (though much lower and wider) and weighs over 4000 lbs.",
            "Yeah its a total deal breaker for me. Sucks they made it that way",
            "It also feels more solid though. The CTR feels hollow in comparison.",
            "I there was a Mazda 6 sedan with a rear wiper.",
            "I've seen older altimas. But with Altima, you never know what's OEM or not",
            "The Panamera used to be available with a rear wiper.",
            "I just worked on some old ass Kia or Hyundai that also had a rear blade\n\nEdit: Kia sephia",
            "Subaru SVX",
            "Galant VR-4.",
            "My 2007 mazda 6 does as well.",
            "~~Mini Clubman has 2 wipers~~",
            "> flip the swipe direction for RHD cars\n\nCould it be because of part sharing? Maybe they used the same mechanism as in the front.",
            "That is peak 90s Toyota!",
            "Yeah this is certainly something I’ll remember so I can tell someone that doesn’t care.",
            "And the 2nd gen.",
            "The rear seats also fold down into a bed. I used that on a couple camping trips",
            "Related, it seems to only affect USDM cars. I've seen other markets where sedans had rear wipers, but still.. quite rare.",
            "Because a vertical rear creates a low air pressure zone which flings water/filth on the back of the vehicle. It's not an issue with a sedan. \n\nSUVs and hatchbacks absolutely need the wiper.",
            "Aerodynamic differences. The basic gist is there are two things at play, water/dirt/dust gets kicked up by the car, and clean air flows over the top of the car until it seperates from the body at the rear. Everything that gets kicked up doesn’t go any higher than this separation point as then it just gets blown backwards. \n\nThis creates a ‘pocket’ of air behind the car where everything that gets kicked up sits and dirties the rear of the car. On sedans/coupes/trucks this seperation point is the top of the trunk lid (or tailgate), while on hatches/wagons/SUVs/vans this is the top of the roof, which means the rear window gets caked in whatever gets kicked up. \n\nNot really an issue in dry weather but in the rain or on unsealed roads the back window will get covered just with the car moving, which isn’t an issue on sedans or the like as the back window only really gets wet if the car is stationary or moving slowly.\n\nI’ve been in several situations with my wagons where it’s not actively raining and I’m not running the front wipers but there’s enough water on the road that I’ve got the rear wipers going full tilt to clear the spray.\n\nOlder wagons and SUVs used to occasionally feature scoops [on the top](https://i.imgur.com/Ui51h8K.jpeg) or [sides](https://i.imgur.com/GkwjpOb.jpeg) of the rear window to capture clean air going past the car and dump it across the window to keep it clean, but this isn’t done anymore because of the aerodynamic penalties.",
            "GM learned customers wanted performance and comfort so they bailed on lightening the car through reductions in insulation and made the frame aluminum.",
            "The C6 ZR1 was already around 240 pounds heavier than a C6 Z06. The C7 Z is more similar to the ZR1 than Z06. \n\nMeanwhile a C6 Z51 is about 225 pounds less than a C7 Z51. \n\nPretty impressive the C7 Z doesn’t weigh more honestly.",
            "C6 Z06 is fastback, but C5 Z06 is hardtop. For that number, you can realize how Gm done so hard in Corvette aluminum body.",
            "My Golf R was absolutely demolished by a 6000 lb truck doing at least 70 while I was stopped at a red light and, while the hatch area was completely crushed, the rear seating area remained intact. In the driver’s seat I felt like I was being tossed around in pillows as my car was pushed through the intersection and smashed against parked cars. I walked away without a scratch.",
            "I can imagine. I keep my Taurus for sentimental reasons but I really hope I don't crash with it lol",
            "It’s a 20+ year old car bro. Also the C5 generation was already very light for what it was.",
            "It’s also not that much bigger than the GR86.  It’s longer by about a foot, and a bit lower and wider.",
            "It's also slower around the 'ring than the Type R by a whole 10 seconds.\n\nWeight and power isn't everything.\n\nIt also only made 70 hp/liter.\n\nIt is kind of a shit car by modern standards.",
            "It doesn't.\n\nThe answer is mostly technology and creature comforts with a little crash safety mixed in.",
            "Get in a wreck in one and you’ll find out. I had a car pull in front of me when I was going 65 mph in a newer Sonata and I clipped it, spun out multiple times. The car was beyond destroyed. The passenger headlight was pushed halfway into the engine block. All I had was a bloody knuckle.",
            "A major component is safety. Watch any crash tests that compare 20+ year old cars to modern ones and you’ll understand.",
            "Look at the C5s interior and you'll understand why",
            "Size, Safety Equipment, and emissions tech.",
            "I am but I bought a Miata. I specifically bought a soft top to save weight. 120pbs is a lot in a 2300lbs vehicle. \n\nThat said I still installed 20lbs of sound deadening lol",
            "It's a sad road to go down. For instance, do not look up the weight of the new AMG GT. You will get sad!",
            "what are your sources on the ek9? and it’s almost as if this post is focused on weight",
            "the s2000 is definitely an unusually heavy car. it’s a convertible with an motorized soft top and double wishbone suspension. a lot of engineering was done to ensure stiffness even with as convertible which is tough to do. personally i think this is what stands out about the ND miata at its weight but you definitely notice less stiffness in the ND with its body roll. you give and you take. weight comparisons between different classes of car is pretty pointless. s2000 and the c5 is definitely a closer comparison point than the ctr though",
            "how are you evaluating weight? it sounds like you just arbitrarily throw out \"only X lbs heavier than Y\"",
            "I kinda like it honestly, it's always fun comparing the size differences. Craziest I've seen was a first gen NSX that car is small, and incredibly low. The evo it was sitting next to looked like a monster truck damn near",
            "We're talking about a GM car designed in the early 90s to a Honda engineered in the early 2010s\n\n\n20 years of frame advancement is big",
            "So the difference between a fixed roof and convertible",
            "Ok that seems a bit more reasonable, though I saw that supposedly the 2 series convertible was as much as 400lb heavier than the coupe?? I wonder if that’s due to back seats and needing more protection in case of rollover",
            "Not heaviest, densest.",
            "The Paramount Marauder has a curb weight of 55000kg.\n\nJust kidding it's actually 9900kgs. Not as impressive now is it?\n\nStill heavier than the Maybach though.",
            "I thought I was taking crazy pills because I always described lighter Japanese sports cars like BRZ as feeling hollow. While heavier sports cars like BMW as feeling dense, solid and hunkered down. Probably has a lot to do with weight and damping.",
            "It was the limited liftback version I think?",
            "This isn’t related but I saw a Mazda 6 wagon on the road today and I thought that was pretty cool.\n\nI also saw an Acura RSX in beater shape. A mint Matrix XRS. An Aventador, and a pile of Porsches.",
            "The 6 sedans never had a rear wiper. They had one if they were specced as a 5 door liftback (or the wagon).",
            "Altimas never had rear wipers in the US. I do know that rear wipers were available on some Nissan Bluebirds that were sold in Asian markets. Those ones look like first gen Altimas.",
            "I don't think it's ever been a sedan though right? Hatch or wagon only?",
            "Spectra hatchback?",
            "Ah yes, the elusive Subaru SVX sedan. :P",
            "Try reading the full comment.",
            "You're welcome, fellow car nerd trivia enthusiast",
            "This is also why it was somewhat common on SUVs in the 80's to have a spoiler. It directed the air down across the back hatch.",
            "Ehh, I wouldn't mind having a rear wiper on my sedan. The water doesn't just run off the back glass like you would think.",
            "> GM learned customers wanted performance and comfort so they bailed on lightening the car through reductions in insulation and made the frame aluminum.\n\nIt has more to do with manufacturing technology progressing over anything else. Does anyone else remember when the F-150 switched to an aluminum body and [Chevy mocked them for being \"weak\"](https://www.youtube.com/watch?v=ox71UKDeazU), only for GM to do [the same thing](https://www.greencarreports.com/news/1090432_gm-pickups-to-have-aluminum-bodies-too-but-four-years-behind-ford) four years later in the Silverado?",
            "All vettes are designed to be open roofs. The hardtop c5 is simply glued onto the body. It's not structual",
            "Crash structures and rigidity are a hell of a weight adder in modern vehicles",
            "im fairly convinced OP just loves circle jerking about the c5 specifically",
            "I fucking love low wide cars",
            "Ring times don’t mean much when they’re 20 years apart. Mainly considering tire technology.",
            "Tires alone have come along way in 20 years. Run some Cup 2Rs on a prime C5 Z06 and see if it doesn't drop enough time to keep up with that ringer FL Type R Honda ran that 7.44 with. \n\n[Suspect Nurb Run by FL Type R ](https://www.drive.com.au/news/honda-civic-type-r-nurburgring-lap-under-a-cloud/)",
            "1991 Miata is 2200lbs. \n2016 Miata is 2300lbs. \n\nWhat happened with the others?",
            "Obviously more weight = better crash protection. Thats always been the case. Its probably one of the only sensible reasons to own a Cybertruck.",
            "A 1998 911 Turbo S weighs 3300lbs. A 2023 911 T is 3280lbs. Is the older 911 safer?",
            "sound deadening sounds useless in a ragtop.",
            "My 1998 Corolla only weighs 2226kg, kinda surprises me how light it is. Although it doesn’t have any safety features, no airbags, trac control, abs etc. and has manual windows and mirrors.",
            "No diss to the car im saying it's a wheel barrell so makes sense it's so light. It's like me lauding my BRZs weight but it's bare bones as hell stock and built like a thumb so kinda expected lol",
            "Were also talking about a performance car to a basic sedan",
            " Considering one of the fastest cars consistently breaking track records is an old ass c6 I'd say otherwise",
            "Less than I thought tbh",
            "I think BMW must use some nice thick tops or something because for the Mustang difference is less than 200lb and same for Corvettes, even the hard top convertible.",
            "Off the top, I'm assuming something armored. Armored Maybach?",
            "True. Mfer is *rotund*.",
            "I always notice RSXs and they're almost always beat to shit, and usually with rear arch rust. I saw a mid-40s guy in a suit in an extremely clean, very mildly modified blue one a week or two ago. Must have been the original owner, lol.",
            "I saw an IS 300 sportcross about 15 years ago. I almost shit myself.",
            "Went to a boomer car show (aka, all classic American cars) and the car that stood out the most for me was a red TSX wagon in the parking lot. It was one of the rarest cars there, despite the show having a dozen gt350s and replica Shelby cobras.",
            "The Japanese version did. \n\nI have no idea why wipers were uncommon on sedans outside of the Japanese market, I've had several Japanese sedans with rear wipers and found them just as useful as they would have been on a hatchback or wagons.",
            "Kia sephia",
            "Well, the two door Ford Model As were called “sedans” so it kinda works out 🤷‍♂️",
            "I'm just glad when people remember they exist",
            "Well shit. Lol",
            "I could see the confusion because people don't usually call the rear window a windshield. ",
            "Well I'll be damned. I always wondered what those were for as a kid because they didn't make sense as a traditional spoiler. Appreciate you sharing that tidbit. \n\n[These](https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2Fbj6kmu5x5hx81.jpg) in case anyone is curious.",
            "You don’t have to look back 44 years. Every modern SUV has a spoiler too. [Example](https://www.cnet.com/a/img/resize/75bf09a33311a5912c2bddee9cd4dda347304f0c/hub/2022/09/16/52949c35-d402-439d-ba59-30a7776efad5/2023-honda-cr-v-113.jpg?auto=webp&width=768).",
            "Same for my Jetta. I wouldn't mind one, but I don't need it the way my GTI needs it.",
            "I’d like my GR86 to have been made a liftback with a rear wiper",
            "Except the C6Z and ZR are designed to be structural roof because the bare aluminum frame wasnt as rigid as the base steel one. But the added top increased the stiffness back above it.",
            "My 1998 corolla is only 2230lbs",
            "An ND has almost the same size interior as an NA. It’s over an inch shorter. The NC is larger and weighs more. A ‘91 Civic is tiny compared to a ‘24. Most cars are much larger than their past generations.",
            "You conveniently [left out](https://www.reddit.com/r/Miata/s/JNQAuuspFs) the NB being heavier than the NA and the NC being heavier still. \n\n> What happened to the others? \n\nYou mean every other car that exists? I already told you what happened to them. You being able to pick out the 1 model that, through a concentrated engineering effort in order to align the newest generation with the historically core values of the model, was able to be lighter than the previous generation and only slightly heavier than the generation from 30 years prior, has no bearing on the reason why every other car has gained weight with time.",
            "The A80 Supra weighs around the same as the A90. ",
            "should compare the same models. 2023 911 T is only rwd, a 2023 turbo weights 3550lbs so like 250 lbs more. But no, the old 911 is not safer",
            "Not the same comparison. More weight does not automatically mean that it’s due to safety, **however**, the **main** reason that new cars are heavy is because of safety standards.",
            "I've known a few people who lightly sound deadened their Miatas, and it typically helps reduce the volume of random rattles and clicks, especially at lower speeds. \n\nI also knew one person who did it to make their door closing sound better, which is cool, I guess.",
            "There’s definitely merit to your point. It slightly reduced road noise, and more specifically did a fine job at reducing door rattles, and exhaust drone. \n\nI need to replace my top so I’ll replace it with a top with an extra cloth liner. It’s definitely still loud but it’s definitely improved.",
            "I installed quite a bit in my MR2, but it was mainly to stop shit from rattling with upgraded speakers and a subwoofer. Once you upgrade the shifty 5w OEM speakers, everything in the tin can doors start shaking apart.",
            "have you seen a c5 interior? it was purposely made cheap in many areas so they could maximize engine and driving performance. same with the viper interior. total parts bin special",
            "i think the point of my comment is show the typical weights of car given the era. the ek9 weight is also lighter because it was a jdm car which has less strict safety requirements (udsm dc2 vs jdm dc2). all of this to say this comparison is stupid given the gap of technology between the c5 and fl5 and given the gap of performance between the ek9 and the c5",
            "Why? Its not like the CTR makes as much power as the C6 lol",
            "Can you read? He said C5, not C6.",
            "Just a guess, but convertibles typically have a bit more body roll than their hardtop equivalents, so the extra weight could be from BMW adding some additional chassis braces to keep the convertible and coupe equally stiff, while Mustang probably doesn't worry as much about body roll on their convertible models, since they focus all their performance packages on the coupe. \n\nAnd the Corvette was probably designed with the roof not being structural at all, so they can swap between each roof style without any changes to stiffness (similar to how the Lotus Elise's chassis).",
            "That would make sense.",
            "Man, I had a 2006 Type-S in Magnesium Metallic that was in amazing condition when I sold it in 2015. I loved that car, kept meticulous care of it, and the kid that bought it totaled it a few months later. Like you said, all the RSXs I see now are beat and it makes me sad.",
            "Ugh, I wish my Volvo S60R had a rear wiper. You'd spend 20 minutes carefully brushing the snow off it then the second you drove a bit the tiny tiny bit you missed would get sucked up and land on the rear window.",
            "They do but I believe it's more for looks/aerodynamics and not for cleaning the rear window. On older SUV's without the rear wiper you can see the spoiler actually curves downwards to deflect air towards the hatch. I can't find an example pic unfortunately though",
            "That's to create a clean break for flow separation. Otherwise you get the Audi TT effect.",
            "Exactly so why aren’t other sports car manufacturers following this formula?",
            "There are more examples than the Miata. That was just the most obvious one.",
            "But Porsche shows that its possible so why aren’t others doing it?",
            "Pretty much why I did it.",
            "That’s basically what car companies do.  Since people are dumb and assume a solid door closing sound is a sign of quality, car companies started adding literal dead weight to car doors so they would make a more satisfying sound",
            "Oh yea I feel that 100%, cars in general aren't really light anymore because of the excess of creature comforts. My Supra stock weighs about the same as my old E92.",
            "Even that was an absolute monster of a car, can't name me a single time honda has dominated the field like the C5, killed the GT2 class because of it's success.Excellent chassis regardless of time",
            "I can see that being the case, though another commenter cited some stats suggesting the Supra 3.0T is only 150lb lighter than Z4 M40i which seems low, unless Supra is also not reliant on roof for rigidity very much?\n\nIn any case I think the Z4 handles wonderfully, I might even prefer it over the Supra. I just wish the manual came from the start on both..",
            "Probably something world leaders would roll in. APCs dressed like limos.",
            "I had a 2005 Magnesium. The 2005 had the peanut butter interior and yours had the far better looking black 😔",
            "I wish rear wipers were standard in the US after a certain window size or tilt angle. Ive driven some vehicles where it was a goddamn hazard not having one. Get in, turn on, drive 100 feet, stop, get out, grab the handheld wiper from the backseat, wipe the back window, okay now youre ready. Especially in the foggy parts of the country",
            "Sells less than 500hp bloatmobiles with the same power to weight as a k24 crx",
            "I'd love to hear about those others. \n\nBut, again, the mere existence of vehicles not getting significantly heavier by adding more tech and safety does not change the fact that the average car is heavier than it used to be because of more tech and safety.",
            "The reason is price. The 911 is an expensive enthusiast car, Porsche can spend however much they want on it because enthusiasts will pay it.\n\nThat’s pretty much not the case with any other car. Chevy can’t just do the same thing for a CUV that needs to be sold at an MSRP of 30k.",
            "Wouldn't surprise me if the Supra isn't dependent on the roof for structure, since it's built from a platform that was originally designed for a convertible.",
            "How much driver’s seat time you’ve had in the 3.0 Supra and Z4?",
            "It's indeed about a 150lb difference, and the person above you is also right. They reinforced the portion under the center console and the side thingies under the doors, I can't find the word for them right now. I own the car and it does feel very stiff unlike other convertibles (notably compared to 4-seaters-turned-convertible, such as the C-class convertible).",
            "Oh that's right. I always thought the Jade Green was a dope color, but I think that only had the light interior as well and wasn't as cool/sporty to younger me. I actually just found the original RSX brochure in my stack of car documents.",
            "Without looking up weights im going to throw out Lotus, Mini and Porsche to start",
            "I thought we were comparing the Corvette, which is slated to MSRP at around $150k for the newest “enthusiast” ZR1 model",
            "Seeing those PWP guys go through the trouble to swap the black interior on CRSX back in the day was cool",
            "I'd respond by saying you need to look up the weights.",
            "C5 Corvettes had a base price in the low $40k range when they came out. Corvettes didn't have super car prices until the C8",
            "(In lbs)\n\nMini gp:\n\n2006 - 2469\n2013 - 2557\n2020- 2625 \n\nElise: \n\n1996 - 1600\n2001- 1900 \n2022- 2000\n\n911T S: \n\n1998 - 3300\n2008- 3500\n2023- 3550\n\nSure they are heavier but the not by a significant margin compared to others.",
            "Also when the C5 was made it was known that GM cost cut it to hell."
        ]
    },
    "‘They’re on track to having the worst quarter’: Expert says Honda’s new Accord is struggling. Here’s why it’s such a ‘flop’": {
        "title": "‘They’re on track to having the worst quarter’: Expert says Honda’s new Accord is struggling. Here’s why it’s such a ‘flop’",
        "score": 506,
        "url": "https://www.dailydot.com/news/honda-accord-sales-struggling/",
        "content": "It's almost like the only thing keeping the accord interesting were the fun engine options...",
        "num_comments": 430,
        "comments": [
            ">“New accord looks like a boring 9-5 office worker.”\n\nIt's designed like a modern Taurus.  More modern, just as infinitely boring.  Plus high interest rates, lack of engine options, and equally priced competitors.  As the article states the Civic isn't far off in size/features and looks way better.",
            "They gave it the USDM Passat treatment. Ugly, boring exterior, gutless 1.5T (outgoing 2.0T had 81 lb-ft more), Camry has a better Hybrid system and costs about the same, and the Civic looks better and is close in interior space",
            ">It's almost like the only thing keeping the accord interesting were the fun engine options...\n\nEhh, the 1.5T far outsold the 2.0T with the previous gen. Same story with the I4 vs. the V6 in the older generations. I think it's more to do with a few factors...\n\n1. The current Civic is finally big enough, and is a very good overall package for less money.\n\n2. The Civic looks much better than the new Accord.\n\n3. The new CR-V seems to be selling very well and is probably attracting potential Accord customers. Also has AWD. Not to mention, it also looks quite good.\n\n4. With the new Camry finally out, it has even stiffer competition.",
            "Of the modern accords the 9th generation was my favorite.   The 10th was awkward to me with what looked like a unibrow in the front and the lobster lights in the back.  This generation is just boring",
            "The current Accord is slower, uglier, and more expensive than the current Camry. It’s almost impressive how much Honda fucked up with it.",
            "I hate the new design, looks like crap compared to the previous model.  \n\nI’m starting to hunt for a 10th gen manual, over the last few years 9th and 10th gen manuals have become hard to find.",
            "1. Bland, boring, ugly design\n2. Boring, dark interior\n3. Road noise\n4. They're freaking HUGE now\n5. Lame 1.5 engine option\n6. Not the best hybrid system\n7. The new Civics are too good\n8. Interest rates are offensive",
            "I really don't like how they took a ruler to the interesting bits and made it look like a generic Unreal Engine 5 default asset.",
            "Had one for a few months. It’s alright at best. Pretty noisy on the road though.",
            "I love it, and was looking at picking one up.  Am I gonna end up with a depreciated loser down the line?",
            "Man this sub is incredibly naive sometimes. I love the manual v6 accords but they didn't sell at all compare to the regular accord. Design also isnt that aggrevious when most of the industry is looking more and more like the AI shape cars the accord is. The new camry is out, interest rates are sky high, and the new civic is just as much of a boat but significantly cheaper. People aren't buying sedans as much but if they do the take the cheaper but almost equally huge civic.",
            ">>Heres why it’s such a flop \n\n$$\n\n/article. At modern interest rates, the Civic is a better deal and nearly as big.",
            "I’d say “emergency facelift incoming” except that I’ve read rumors that Honda already has plans to turn the Accord into something crossover-ish, so they may not care enough to resolve this.",
            "That’s a shame because they really hit the mark with the 9th gen and should have continued with what made that succeed. I love my 2013 6-6 coupe.",
            "I unironically think it looks cool",
            "I had a ‘24 Sport Hybrid as a rental a few weeks ago and thought it was a great car. 🤷‍♂️",
            "Lmao, remember how often this sub circle jerked how good honda sedans were doing like what, 2 weeks ago?\n\nPeople don’t want sedans, blame Honda all you want.\n\nThis is the last generation for the accord in the US, so enjoy it while you can",
            "I must be out of touch. The new accord hybrid looks awesome. \n\nI love the drive train, design looks good.",
            "I genuinely don't think most people care about the styling or loss of 2.0t as everyone seems to care about here.\n\n Sedans just don't sell. Honda also has no financial incentives going on for the Accord too. It's a perfectly fine car that does what it needs to \n\nPersonally the styling has grown on me quite a bit too, looks baby A7 esque",
            "These companies are purposely half assing on their sedans just so people won't buy them and then when sales slow they can say \"See! No one wants sedans anymore!\" Sedans don't have as big profit margins as cuvs, SUVs, and trucks.",
            "I was in the market for a fully equipped hybrid Accord last year. The dealer quoted me $42k. GFY Honda.",
            "Articles about TikToks are so strange to me.",
            "The new civic looks twice as good as accord , costs few thousand less and is not too much smaller. Civic is a no brainer. The fugly rear of accord Needs fix asap.",
            "The current Accord is probably the most boring looking modern car one could buy today.\n\nIf it were a person, it'd be some sort of introvert with absolutely no character, interests or hobbies to speak of other than maybe hoarding cats.",
            "Former 2002 Accord owner. Loved it. Minus the auto transmissions, they're indestructible. You can run them off eBay parts, if something breaks. But it won't.\n\nThis new gen is the ugliest, most generic, most half-assed Accord I have ever seen. I don't care that it gets 50 mpg.\n\nHonda, wake the fuck up.",
            "I really like the styling of the new Accord and think it'll age well unlike some of the competition. (Ahem, Camry)\n\nWhat scares me off is the 1.5 Turbo mated to a CVT, no thanks on that.",
            "Looks like garbage in comparison to the Civic and the competition.",
            "Goofy ah Ai designed car",
            "Is ugly boring ass car one of the reasons?",
            "Dealers still have the gall to charge above msrp and add ons for this car. That’s why. Insane how for a few thousand more more u can get a Tesla model y",
            "Maybe because it looks about as exciting as my Frigidaire. \n\nNo, but seriously that front is horrendous. The rear is salvageable but that front. It needs a refresh immediately.",
            "It’s an incredibly boring design and a regression",
            "Would it kill Honda to make a not aggressive, nice looking sedan? That thing is hideous",
            "Because its fugly and they dropped the 2.0t lol. Jokes people calm yourself. I do think its ugly AF though",
            "Bring back the V6 Coupe!",
            "The last time the accord looked good was 2017. Everything after that has been wtf and more wtf.",
            "Looks like shit and they got rid of the engine everyone loved…",
            "I know why the new accord is out of the running for me.  Killing off the 2.0T with the 10 speed auto.  It would have been on my list otherwise.",
            "The last generation Accord was an actual beautiful car, I can’t believe how they massacred my boy.",
            "I bought a grey Honda hatchback back in 1985. Beautiful car. Back then it seemed like everyone drove an Accord.",
            "To me the car doesn't even exist because I know there isn't any trim that would be remotely exciting at WOT.  If they had a 2.0T trim then maybe I'd go and look at it?",
            "I'm sure people just go buy a CRV anyways. They really missed on the current Accord. Camry is superior",
            "All they have to do is bring over the Honda Inspire design and make a couple of tweaks to the grill.",
            "Hondas pricing esp in Canada is horrific\n\nNo cars were available last year new so we bought a new CRV sport for 44k no hybrid \n\nOver at Toyota you can get a higher trim + hybrid rav4 for the same money.\n\nThey’ve been locking away hybrid for CRV in touring trims at 50k + \n\nWhen realistically hybrid shud be their only engine option bar the basic LX FWD trims.\n\nFrom the article :\n\nChandler says that the main reason the Accord is falling behind the competition is because it just can’t compete in terms of value with other auto manufacturers. The manufacturer’s suggested retail price (MSRP), for instance, of a Hybrid Toyota Camry, which is in the same class as the Accord, only costs $500 more—which is money you’ll get back in gas savings almost immediately.",
            "\"bang for your buck\"",
            "Because Honda needs to bring back the 90s Accord Wagon.",
            "Ditch the manual and k20 and you’re left with disappointment",
            "Forgot Honda still exist in consumer market, since I’m from EU. Just looked at their site, prices here are atrocious. Civic costs more than Camry, like 20% more.",
            "I was surprisingly underwhelmed with an EX I drove, a loaner car for a relative. Styling is perhaps too smooth, solid but boring. Same with the plain interior, which I actually thought was an LX until I looked up the feature sets (and even double-checked lol). The base turbo was adequate on the move and even surprisingly rorty sounding...but I might favor the good ol' na 2.4 of the 9th gen that the loaner was for, for being able to more quietly cruise along at light throttle.\n\nEnded up with greater appreciation for the older car's styling, tan/brown interior, engine, etc. Even in LX form.",
            "I guess I’m out of it. They’re all boring soulless blobs to me made to suit the most minor of deviation in preferences to a cost. \n\nI wouldn’t be able to tell the difference if it weren’t for the badges. \n\nWhat a finicky nightmare of a market to compete in.",
            "Cause it looks like a sterile VW Passat from yesteryear.",
            "Obvious answer: the civic is as big as all accords up until 2015 or so.",
            "It looks like a Ford Taurus if it were designed by VW.",
            "Because it’s ugly.  Done",
            "I would buy a V6 version in a heartbeat. I guess I'm in the minority in liking how it looks.\n\nI want a sedan that's reliable and quick. They decided not to make a quick version, so I'm looking at other sedans.",
            "Well. I wanted one, but the three dealers near me acted like a-holes, so I passed.",
            "1.5T blown head gaskets, oil dilution and an ugly body.",
            "That’s insane to me. I clearly have no idea what regular-ass Dave mother fuckers want because I think it looks amazing.",
            "Accord: We took away the V6... \n\nEverybody: boooo...\n\nAccord: But we got this juicy 2.0T to a 6spd\n\nEverybody: YAYYY!!\n\nDealerships: YAYAYAYAY MARK UP MARK UP MARK UP\n\nAccord: Nobody buy my cars, you guys all suck, no more 2.0T for you.\n\nEverybody: Camry looking real nice for the package with hybrid and AWD options\n\nAccord: surprised face.",
            "I don’t know if this is a great talking point, but honestly, it is so ugly and simultaneously boring that I can understand it being hard to sell. There’s nothing wrong with it. I’ve heard from reviews that it’s a good car. It’s just not good looking.",
            "It wasn't an issue when we had a diverse sedan line up that we could choose from, but those days seem to be numbered.  People are realizing a car like the Accord is practical (boring).  better than another stupid SUV though.",
            "The accord is just straight worse than the civic.\n\nI actually had the full intention of buying an accord last year and ended up in a civic. \n\nWhy the accord just a long boat? Why is the material design identical to the civic? Why is it so slow to drive?",
            "It's crazy how much this car is hated on in this sub for being an honest, spacious, efficient sedan. I remember how much this sub used to hate on overstyling though I suppose those people have left the sub.",
            "And Honda can’t blame low sedan sales because the civic flies off the showroom floor\n\nI see like 2 dozen on my way home from work everyday. My spouse bought one, great car, great MPG’s, nicely done interior, and good looking.",
            "Seems like every second gen Honda has to do an emergency refresh on something",
            "I have been a long time Accord owner going from a 2019 2.0 touring I wasn’t willing to take such a huge step back in power and spend more money on the top tier 2024.",
            "It looks like they asked AI to design a 4 door sedan.",
            "It looks absolutely boring and bland. The only saving grace is that the new Camry has an awful front end (imo)",
            "Honda makes its own boring Buick and asks itself, “what went wrong?”",
            "They made the Accord a really boring vehicle lol",
            "The 3rd gen Accord was as far as possible from the current 11th gen model in terms of styling - while the Mk3 was probably the most striking design of its class, with features like pop-up headlamps, the Mk11 has the most generic vibe of the whole midsize segment.\n\nThat leaves me with an idea - how about Honda taking the 12th Accord back to the wild life? Benchmark all the wildest designs on the road today, from the Cybertruck to the Staria to the new Santa Fe, and apply the ideas to a midsize sedan.",
            "I dig the new Accord styling, sue me.\n\n\nReminds me of the '94-'96 Impala SS.\n\n\nBut at the same time, I really did like the previous Accord generation as well. The 2.0 Accord Sport is a great car and comes with some of the best looking wheels from the factory.",
            "Doug demuro did a review on it. He said it’s a great car. But it boring and no one buy sedans anymore. It’s not just Honda. All sales across the board for sedans have gone down. Few companies just got rid of the sedans all together",
            "Like others have said, it is poorly priced compared to better competitors. Also, it's not stylistically much better than the Civic but much more expensive.",
            "My 14 Fusion is better looking than this.  Two styles of Accord back is better looking.  No stick. Does it even have an auto or is it all CVT?",
            "I would take a hybrid civic hatch over an Accord in a heartbeat. It's almost as big inside, its a hatch, and its easier to park in the tiny spaces in the Bay Area.",
            "The new Accord looks like it came from the late 90s/early 2000's.. The Civic on the other hand looks fantastic.",
            "It wouldn't be much, but if you give it a liftback, kammback design, I am sure it would sell better.",
            "Even the most boring people in the world don't want their car to be feel boring.\n\nIt can be fake excitement, just some vents or whatever, but strong design moves cars, period.",
            "I understand the stlying issue, but the interior is fantastic. \n\nCompared to the new camry and sonata the accord is the best to live in and really is everything most people want in a car. \n\nI'm seriously considering a 2025 hybrid accord.",
            "I love the look of the new accord and there are tons of them around Los Angeles. It’s a clean style compared to the overdone Camry with all its ugly plastic shit everywhere.",
            "It looks like a 2011 Ford Taurus in all the bad ways!  And on top of that, we didn't get a twin turbo 3.5L SHO option!!!\n\nTechnologically, Honda is doing some really cool things like using ABS wheel rotation speed sensors to monitor tire pressures, but not having the 2.0T with the 10 speed, and the lame-ass design were steps backwards, like when the 2013 civic came out.  I'm sure they will rush an emergency refresh.",
            "I own a 21 2.0 touring but, every time I see 11th gen on the road I go “that looks pretty nice” idk maybe I’m crazy",
            "honda biggest problem is the tlx is smaller than the civic bigger than the accord, all they had to do was make the accord 2.0 awd 10 speed  leave it till it was an ev only car",
            "…I mean look at it, without badges you can’t tell it’s a Honda. Compare that car to the Camry and it’s no brainer. It seems as if Honda hired the designer that was in charge of designing Toyotas in the early mid 2000s, great cars, but boring",
            "It’s beyond boring. A throw away design. Looks like Walmart designed it",
            "It’s a good car though it’s kind of boring, I looked at one earlier this year. Ultimately I bought something more fun though if I would have just wanted a car, it’s pretty much the best one out there.",
            "Just chiming in...yeah current Accord style/design looks like ass. That front end...Wth was that dude thinking? Rear is a wanna be Audi S7'ish..and honestly it's just overgrown.\n\nCurrent Civic is pretty, with hybrid coming out, might be my next daily beater.",
            "Seems like a commonly held belief but i think the thing that hurts the accord is the civic now is essentially as good for less money. \n\nIn the past there was a real perceived quality difference between the two cars. Now i feel that isnt necessarily true. Particularly in the lower trims(which are the prime sellers for both). Also now more so than ever according to the oems people who want bigger cars just get suvs. So the crv and pilots take those buyers.",
            "The last gen, post-refresh is one of the truly most beautiful automotive designs ever, and it could fit a whole family!\n\nWhy they gave up the smooth, friendly design language for that new giant ass grill will never make sense to me, it's ugly now!",
            "Feels amazing. Much slower than before. GP2 engine. That and 55k for a 4 banger and shit customer service at acura of Troy in Michigan.",
            "It's not just the fact that it's ugly, no longer manual and doesn't have a cool engine....it's the fact that the 10th Gen knocked it out of the park looks wise. \n\nIt went from looking like an Audi rs7 to a Ford Taurus. Wtf did they expect",
            "All I wanted as a 6cyl Accord Coupe...",
            "I do like the Accord, and I think this generation is pretty, but I really don't see a reason to buy it over the Camry.",
            "The civic got so good theres no reason to “upgrade” to the accord u less you really want to.  The civic is no longer the penalty box it was and the “base” accord is very stripped down compared to the loaded civic sport touring for the same money.",
            "Boring design. Easy.",
            "I am driving one as a loaner right now. It is an absolute dog. Slow as Christmas off the line, it’s worse than the Altima loaner I just gave back. That’s not a good sign.",
            "Whoever greenlighted Honda’s current accord design deserves the lack of success they received. To think being “radical” by reverting to boring, minimal design language in the way they drastically moved was the biggest shot in the foot. Like the new Camry, the previous generation is the one to buy and talk about.",
            "Doesn't surprise me at all. It's just a major step backwards from the previous generation.",
            "I had a 2016 which I loved. The most recent design before this didn’t look to bad. This new one is ugly, and I’ve heard it has noticeably less headroom too. Which is to bad as that’s one of the things I liked about my Accord compared to many other things I sat in.\n\nSounds like the price isn’t great relative to other options. \n\nToo bad. It’s one of the last sedans and was a very good one. All the general issues about sedans in a world where everything is an SUV or 10 foot tall truck are already stacked against it and make things hard.\n\nI hope they can turn it around in the next gen.",
            "This sub cracks me up. I'm just as much sad that they don't make a coupe or a powerful engine option anymore, but the reality is no one bought them anyway. They're not selling as well because people can't afford new cars, and the ones that can buy SUVs and trucks these days. Simple as that.",
            "For much as they screwed up this generation of accord, they absolutely knocked the new Pilot out of the park. I feel like I can’t drive around the block without seeing one. They’re selling like hot cakes.",
            "Honda put all the good stuff behind the Acura paywall. \n\nAll the stuff that made the 10th Civic Si good value? Stuck behind the Acura paywall now. Manual Civic Sport Touring Hatchback? Stuck behind all the top trims then its a 1,000$ option. Si hatch we shouldve got? Acura. \n\n6cyl big car? You guessed it, Acura. Acura has been finally coming around by shooting Honda in the foot. \n\nI actually like the look of the new Accord, looks like nothing else on the road and you know exactly what it is when you see it. People were pissy about the 7th gen accord too, too blobby and bland. They need a big engine option for that high price tag, and I would hope theu use they have the brains to put the 2.0t back in it or the turbo motor from the TLX into it, because otherwise its done. \n\nA civic Si is almost as big, faster, lighter, almost as much tech. Or you get an Integra for the same money as the accord and get all the Si stuff, plus computer suspension, plus a hatch. \n\nI don't know where the Accord slots in anymore",
            "I have a 92 Cb7 Accord coupe with a 5 speed manual and a 2012 Accord coupe  V6 and the 6 speed manual. The formula for a good car is not that hard.  Seeing this Gen Accord just makes me sad.",
            "It's easy to explain. The previous Accord had style, flair, panache even. It was practical, reliable AND desirable. The current one seems to be the winner of the \"Let's design the most boring, generic car possible\" contest.",
            "Honda has pulled back on a lot of markets they usually sell to also",
            "Well yeah, it's boring as shit",
            "Honda is about to be forced to make interesting cars again.",
            "I don’t buy the argument that the Accord is t selling because a hybrid Camry is $500 more.\n\nMost people purchase SUVs due to the perceived benefits of visibility and additional space.  Generally, one would choose a sedan because of lower cost or better driving dynamics. The Accord offers neither of these.  Why choose the Accord over the CRV?  The previous accord offered a 2.0T along with several sporty options.  This is also why the Civic sells well … it’s fun to drive!\n\nThe current Accord is one of the most mundane and boring.",
            "The new accord design is fantastic, especially for m the front",
            "I like how the accord looks and I think looks is not what keeping buyers from getting the car at least in my region. The dealers here are asking around 5k-10k above the competition (Camry, Sonata, Altima etc…). Most buyers at this category are looking to save money and usually choose the lowest trims and others who don’t mind paying more they are going for the new Toyota Crown or the new Hyundai Azera (Grandour) .",
            "Should have called it Honda Car",
            "The previous generation Accord was more interesting to look at and the only model I was interested in the slightest in looking at was the 2.0 Sport. The new model is sort of ugly and the powertrain options have gone from slightly interesting to pure snooze fest. I hope this doesn't put another storied sedan nameplate in the dirt because another company made a boring generation of it.",
            "Didn’t even have to open the article and I know the problem. Boring, new Camry and Civic are better.",
            "Civic is just more worth it too. Plus their financing deals kind of stink, making it not very competitive.",
            "i’m actually shocked the consensus is this car is ugly lol. i think all black it looks great",
            "either you get a civic because it looks nicer and is slightly cheaper\nor you get a CRV because it still looks nicer but has more space\n\nthere is no reason to get an ugly honda accord",
            "They took the 6 speed 2.0 away since people were buying that and not the Type R. Then gave the TLX an updated 2.0T while giving the accord a 1.5T hybrid.. Nobody wants that.",
            "It's selling poorly because anyone who wants a car that size is shopping for crossovers.",
            "Could’ve asked me; I’d have told them.",
            "The headlights on the Accord give me Marvin from Hitchhikers guide to the Galaxy vibes. VW did the same to the GTI.",
            "It looks like a wish.com Mustang GT..",
            "I loved the last gen Accord, but my god I really love the look of the new one. I’m seeing it a lot more often so idk what these peeps are talking about.",
            "...oh, and it's ugly.  There's that.",
            "The infotainment screen is too small.\n\nYou STILL can't get a heated steering wheel. \n\nThe seating position is low (although I like this), way too low for American buyers. \n\nHonda continues to skimp on the content that people want in 2024. They want big, shiny glass cockpits and visually luxurious **light colored interiors** in creams or white. \n\nThey no longer want the black, hard, spare interiors in a stiff, loud Honda. They want to be comfortable, Honda, can't you fucking get that?",
            "Honda needs more time to combine the civic and the accord together into one sedan.",
            "It’s styled like an appliance",
            "Maybe if they didn't make the design so ugly, and depressed looking. \n\nMy coworker bought one in dull grey, and it makes my day a little worse everyday when I see it in the lot. \n\nIt also seems as if they designed it to highlight just how huge, and ungainly the proportions are.",
            "What the fuck did the expect? I don't know what's happening with these absolute duds in seemingly every manufacturers design department but it seems like good design is something that only existed in yesteryear.\n\nEither these dolts are designing something a 12 year old would find cool or your grandpa would find \"dignified\" there is nothing in the middle.\n\nAside from that, there's next to ZERO exciting in terms of drive dynamics because everything is softened up and the interiors are more drab than an Apple store. What the fuck do they think? I'm sick and tired of nobodies running shit and then scratching their heads when sales are low.\n\nYou seriously thought going from the previous gen Accord to whatever the fuck this is was a good idea? Replace Honda with almost every manufacturer and you'll find the same shit. Doesn't help that only someone making 6 figures could afford without going underwater.\n\nGet your head out of your assess.",
            "Gee making a huge car a hybrid with only a small little 1.5L engine and no awd options would not sell well, who would have thought? \n\nI'm tired of this bullshit about cramming a tiny little engine into everything. How about we make big engines more efficient instead of turning up the air in little engines to squeeze power out of them? We don't pay for engineslike Europe does. \n\nSuch bullshit.",
            "Its objectively a very ugly car. They took a great design and destroyed it",
            "I really like the design of the new accord. I was never a fan of the fighter jet angularity of the front end.   The simple lines really appeal to me.",
            "I know you really have to be an old guy for this reference to work, but the Accord was always the poor man's 3 series.   \nI know not a lot of them were sold with the performance options, but they still had the aura about them.  This generation just threw all of that out the window.  Plus the Civic stole any kind of reasonably sized performance thunder the Accord might have had.  It left the Accord without and identity.",
            "new honda accord exterior styling is  controversial. Their hybrid is nice, but toyota's latest camry hybrid blew it out of water. Camry hybrid is cheaper, more fuel efficient, has more horsepower and performance, and have awd option. It is no brainer",
            "Why buy this over a CRV if it’s equal or even less engaging to drive?",
            "I personally like it. In the right color that is",
            ">New accord looks like a boring 9-5 office worker.\n\nAs much as I dislike tiktok content, this is very true. It always has been one too no matter the generation. Honda has some really frumpy looks to their economy cars and people expect more now. Alot of enthusiasts complain about sedans dying, but if they stayed. literally ALL the economy brands would be churning out boring looking soapboxes like these. Be careful for what you wish for people.",
            "Cvt is a big reason people who drive sedan don't like cvt , those who do they will prefer Subaru awd",
            "I actually kind of like the new Accord. But I just can’t get over the comically tiny Honda badge in the back. That thing is absolute ridiculous and is the main reason I won’t get one.",
            "I guess I'm crazy because I think it's the best looking Accord they've ever made. It's probably flopping more because the sedan market continues to shrink. Honda was up 17% in Q1 so it's not like people are avoiding Honda.",
            "1. It's a sedan. \n2. No AWD option\n3. Hybrid only available on high trim levels.\n4. Decontented as compared to the Camry. \n5. Cheaper interior and the dreaded \"hard plastics\"\n6. No manual transmission \n7. It's a sedan\n\nI like the new Accord but like all Hondas it's just living on its reputation.",
            "This generation of the Accord with the fastback design has never looked right, even prior to the recent updates.\n\nIt almost looks ok from certain angles, but it’s just awkward looking.\n\nThe previous generation had it really going on in an understated BMW sort of way.\n\nI’m amazed at how bad some of the recent Honda styling has been.  The latest Odyssey is hideous.",
            "I hate to say it but you can get a Tesla Model 3 for around the same price that is pennies on the dollar cheaper to operate as a commuter and way more enjoyable to drive. I am not saying Tesla would be my first choice but, combined with how dealerships operate in this country versus the buying experience at Tesla, I don't see much reason to buy an Accord at this point.",
            "I’m 100% certain I have bad tastes. I like the 10 gen civic and consider a good looking vehicle, I love the new Accord and thinks it look its best now than it has since they got rid of the coupe. I love the new BMWs and their design and front end. I am absolutely in love with the TLX Type S and if I didn’t just buy a Trueno 86 for my daughter I would have bought the TLX to add to my fleet. I also think the Escalade is the best SUV in its class, looks and function wise. \n\nI absolutely hate the way every Audi looks (Except for the RS6), i definitely don’t like the new Honda Jettas, I also think every Kia/Hyun car is but fucking ugly. A girl at work just bought a new Santa Fe, it looks like it runs the backlot of a Bollywood production studio. \n\nI know I’m the wrong one here. But just wanted to share, to give you all some hope that some one likes what you all don’t haha.",
            "It’s always been a commuter appliance, but now being hybrid only with zero other engine options or choices for enthusiasts really took the model a step backwards in terms of driving experience. The new Camry is going to end up the same way too. The Accord really had a good thing going and then the company decided they wanted to cater to a narrower market.",
            "The hybrid and EV comparison with an ICE always make me chuckle. Annual savings on fuel is not linear as gas mileage goes up. Sure, a 41mpg hybrid will save money at the gas pump compared to a non-hybrid but its like 7 years to save $1,500 compared to 30mpg. So if you do not keep a car long enough to meet that break even point then you actually lost money. EV's are a whole different story due to how the government misrepresents MPGe. EVs get a 6.67 correction factor for the amount of energy in a gallon of gasoline when converting to equivalent fuel economy. Just doing some basic math, removing the correction factor and the Tesla Y is at 44mpg ([You can check for yourself from the calculation here](https://casetext.com/federal-register/electric-and-hybrid-vehicle-research-development-and-demonstration-program-petroleum-equivalent-fuel-economy-calculation))... which is still impressive for such a heavy car. Your pocket book wont see that though due to a lack of road taxes and the cheaper cost of electricity (Thanks to heavy regulation in price fluctuations). If your state imposes a road tax for owning a EV (they all will eventually) then the savings will be effected. Add in the higher cost for insurance and higher vehicle license tax due to the higher initial vehicle value (The $7k rebate doesn't reduce this) and it might actually cost more to own an EV. Anyway, 30-35mpg is the sweet spot for cost of ownership on a vehicle.",
            "Civic >",
            "Because no one wants a CVT",
            "I’d say there’s a little Ford Fusion in there too.",
            "Agreed.  I just looked at the Accord and Civic online thinking the Accord can't be that much worse.\n\nIt's bland AF.  And as you said the Civic is pretty sharp, and is cheaper, and nearly as featured, and now nearly as large.  I'm not sure why someone would get the Accord... other than they didn't look at the Civic.",
            "I get Taurus but I’ve thought more 90’s-2000 Buick.    But everywhere you look on the accord it looks like cost cutting.    Where have I seen that before",
            "If it wasn't for the near complete lack of sex appeal, I'd probably take the old Taurus over a new Accord. I had a pristine ~93 wagon a few years back and that thing was amazing... way more cargo area than any new midsize SUV, could fit 8 people comfortably with the front bench and rear-facing 3rd row, and, with only 4 people in the car, everyone basically had the comfort of a La-Z-Boy sofa. It was a shining example of \"they don't make 'em like they used to.\"",
            "The Civic/Corolla have gotten so big that the Accord/Camry are full sized, and there is no market for entry level full sized sedans.",
            "The new design is due to Takuya Miyazawa, he screwed up in the design area. ",
            "Vs the Honda pilot which is a track weapon.  Lol",
            "I mean, the accord has always been a boring looking sedan, even if it was good to drive.",
            "The civic is larger than almost every generation of accord ever made.\n\nIt’s stupid.  \n\nKill the accord.  \n\nRename the civic the accord.  \n\nRename the fit the civic.  \n\nProblem solved.",
            "The Civic is a good size, very roomy even for tall people, but the new Accord is just too big, and doesn’t have exciting engine options or the refinement of Toyota. It’s the 9th Gen Civic all over again - a colossal flop that will be remembered for how mediocre it was.",
            "Don’t forget CVT my wife knows nothing about cars but has hated every CVT she has ever driven.  So she knows she hates CVTs.",
            "I had the previous Touring generation with the 2.0t and the 10 speed.  It was way too boring to get poor gas mileage, but just test driving the hybrid made me want to shoot myself.  I think it was the shortest time I’ve ever owned a car.  People would tell me it just didn’t make sense that I owned it.  I will never own a boring car again.",
            "...and still potentially manual",
            "This is the reason. Looks like a duck's bill. Boring featureless design",
            "Impossible! It’s one of C&D’s 10 Best Cars! /s",
            ">and equally priced competitors\n\nIt's wild to me that the Accord is priced below the Camry in the US. \n\nHere in Australia there's only one trim option for the Accord, with the (admittedly very good) hybrid option, and it's something like a 10k premium over the top spec camry. Shit is nuts.",
            "Terrible reliability as well, first year in 34 it hasn’t made Consumer Reports recommendation list.",
            "“Why is this ugly ass version of our car we made not selling?? Welp guess we have to stop making sedans now”\n\nI hate corporations.",
            "Man I cannot understand why people don't like how the new Accord looks.  It is absolutely beautiful IMO",
            "The rear end reminds me of a VW. I cannot get over that. It doesn't look like a Honda at all.",
            "Where's my fully BEV Accord option? Nowhere. That's why I haven't bought one.",
            "Why won’t you get the hybrid CRV over the accord these days ? It’s way more practical",
            "Yeah, and the Passat has never done amazingly here.\n\nFor midsize sedans to sell, they basically need to stay the course with their current buyers (like the Camry), or be pretty competent but also quite cheap or discounted (like the Malibu and Altima. Neither sell like gangbusters, but they sell well enough).\n\nThe accord didn’t stay fun or stylish like its buyers tend to like",
            "Kinda interesting how Toyota’s got interesting and fun while Honda’s got boring.  Was always the other way around.  \n\nWe’re in the market for a compact SUV for the wife, and I hope she picks the RAV 4Prime over the CRV Hybrid.",
            "And the Civic has the same hybrid now. \n\nUnfortunately, the Accord's got a Civic problem. Unless you care about nothing more than sheer interior volume, the Civic is a better car in every way. The Civic stepped up quality in a big way while the Accord has basically lost every reason to pick it over the Civic or CRV",
            "Plus it's moved up a slot in the last few years without offering anything extra. Th Civic now is what the Accord used to be, and the Accord now a very cheap, very full sized sedan with minimal luxury features and performance. The number of people looking for a huge vehicle and also wanting a car, and who simultaneously prioritize fuel economy and reliability over all else has got to be tiny at this point.\n\nAnd meanwhile, Honda has no offering in the compact/subcompact category.",
            "They somehow managed to make the 1.5T half a second slower in the 0-60 for the 11th gen, the 10th gen 1.5T at least didn’t feel under powered.",
            "> Camry has a better Hybrid system \n\nI would disagree - Hondas 'eCVT' hybrid system is MUCH simpler and drivers better than Toyota. Plus the maintenance on it is almost nonexistent because there's almost nothing to break",
            "3.2 Sedans aren't selling well already and the civic is just as good as the accord. Might as well get a CTR instead.",
            "I suspect that the next Civic will be a bit smaller to give it some more separation from the Accord.",
            "5. The V6 and 2.0T were locked behind higher trims that cost >$30k.\n\nI'd wager that there would've been more takers if those engines were optional on lower trims (e.g., LX/EX V6/2.0T).\n\nOn that note, I'll be keeping my 9th Gen V6 sedan until it dies.",
            "Every time I see an Accord I get it confused with the new Civic, and I have a new Civic…",
            "The 9th gen definitely nailed the design. The 10th gen started to grow on me as soon as I saw them being driven around in non-stock form. Current gen is surely boring.",
            "The 9th Gen 2016-17 Touring models with a V6 always make me give them a second look especially with how well the taillights look",
            "Yeah the \"unibrow\" design on the 10th gen threw me off and once I saw it I couldn't unsee it. Just doesn't work for me",
            "My mum owned a first generation Accord. It was a beautiful small car perfect for its time.",
            "Honestly this is peak Honda, good design and horrible aesthetics, they have always been like this but people dont want to admit it because its a cherished brand.",
            "It’s like they thought now that GM and Ford were out of the game, they didn’t have to try. Guess they weren’t keeping enough of an eye on Toyota.",
            "> uglier\n\nOn what planet is the new design uglier than the last gen?  The sleekness of the new one makes the last gen look so over-designed and dated",
            "It’s odd because I like the 11th gen civics, but preferred the previous gen accords. Civic gets a bit more grown up, but the accord was good as-is and imo didn’t need such a redesign",
            "Loved the design last gen, absolutely hate this one.",
            "> looks like crap\n\nI mean it looks kinda generic but hasn’t that been true for the Accord for as long as that brand has been alive?\n\nThe previous gen was also quite generic imo.\n\n**Edit:** By generic I don't mean bad looking. In fact I've always preferred them over Camrys of the same generation. My parents' first new car after immigrating to the U.S. was a green 1996 Accord EX Coupe. I thought that car was the coolest shit ever as a little kid.\n\nBut let's be honest, not a single generation of Accord would be nominated to automotive design hall of fame. They've always been designed to be inoffensive, practical, and easy to manufacture reliably and economically. \n\nI do not think the newest gen design deviated from that at all, and I do not think the previous gen went beyond that either.",
            "I have a 2.0t manual 10th gen. Took me 3 months to find one. They're out there but like you said hard to find.",
            "10th Gen Manual with a 2.0L Turbo.",
            "Out of curiosity, have you ever driven one? The manual in the 10th gen was mid; my ex had one so I drive it around a lot and it was not on par with the Si/Integra (which has a great shifter), or even my Mazda3. The 2.0T was a good engine though",
            "I’m holding on to my 9th gen 6-6 coupe with 290k miles and will probably swap the engine like for like once it goes. Such an amazing car",
            "Love my tenth Gen. The auto is a really great trans too",
            "My dad has a really good condition 9th gen manual accord, 2013 I believe that he’s finally thinking about selling. One owner car and the man has always taken great care of his vehicles. He still loves driving his accord compared to his vette sometimes since the vette is an automatic, but he’s looking to sell it. \n\nNot sure what area you’re in but DM me if you’re interested in details.",
            "I guess I'm in the minority here because I dug the 9th Gen Accord, thought the 10th gen was a step backwards in design and think the current 11th gen was a big step back in the right direction. My only grip is power train options leave a lot to be desired",
            "I'm with you on a lot of these and I would also add one more: \n\n9. Poor trim/features mix. For example, on the EX-L Hybrid, you get the same lame-ass wheels as the LX, just painted dark grey.\n\nAlso, you only get one interior color - black. They added three more inches to its length but it's on the same wheelbase as the 10th gen, so now it has this goofy ass front overhang and it's less maneuverable. I have a 2018 and the turning circle is one of the few negatives and now they've gone and made it worse.",
            "Holy cow you described it perfectly lol. It's like Rockstar wanted to do a fake Accord and this is what they came up with. ",
            "I see an Unreal post, I upvote.",
            "So it’s a Honda.",
            "Doubt it.  Even with a controversial styling, the Accord is known as a good car.  There’s a minimum price that they drop to, even if clapped out.  Kinda like Camry and Corolla.",
            "lol ya I think they look really sharp",
            "Any passenger sedan vs crossover will be depreciated. The secondary market might pick up on these because there are some people that will just buy a used Civic or Accord no matter what, so you will always have a buyer. Find a CRV or RAV4 is safer if you’re considering depreciation.",
            ">Am I gonna end up with a depreciated loser down the line?\n  \nIf there's one thing you can bet on with buying a Honda, it's that it's going to have stupidly high resale value",
            "Yeah, the amount of people blaming this on the lack of 2.0T is wild to me.    That wasn’t the bulk of sales",
            "Imo the manual V6 accords were a chicken or egg problem. They sold like shit because it was almost impossible to find one.",
            "Honda does allocations. They didn’t sell because Honda decided they wouldn’t sell so they didn’t make any to sell. I didn’t fully understand allocations and used to think like you. Look at Subaru BRZ vs Toyota GR86 as an example. Toyota also does allocations while Subaru allows customers to spec and order a car.\n\nOriginally it was Subaru BRZ 80% sold were manual vs Toyota only 33%. The customer base is not that different, it’s just that Toyota decided what customers wanted instead of asking them.\n\nhttps://www.autoblog.com/2019/05/21/subaru-brz-manual-transmission-take/",
            "So bringing back the crosstour?",
            "The day that happens is the day I decide to never sell my V6 coupe.",
            "So bringing back the crosstour?",
            "Apes together strong",
            "I'm surprised to see everyone hating it's looks. I love the way it looks. Way better than the chaotic crazy shaped styling a lot of cars are doing nowadays. For example, the tail lights, very clean and normal, unlike the typical styling of typical tail lights these days.",
            "Looks like a Passat to me. It's not a compliment.",
            "No no they just don’t want American sedans! Pay no attention to the fact that the segment has been hemorrhaging sales for a decade. Japanese car good, American car bad.",
            "Looks have grown on me tbh. Sure it's not the best looking but I wouldn't call it hideous like some do. I agree it's a bit boring but it's not so bad.\n\nAs for the drive train, check my flair lol",
            "Margins are not handed down from god on stone tablets; consumers are willing to pay so much for a car,  and a car cost so much to make. The difference is the margins.\n\nYour basic problem is that a CUV barely cost more than a sedan to make, but consumers are willing to pay a large premium for them.",
            "Make sure to not fall out of any windows from here on out lol",
            "I think Throttle House described it best. If the 11th gen Accord were a person, it would be the kind that listens to NPR daily.",
            "that was a whole lot of aggression just to call it ugly 😭😭",
            "Sedan building and selling by anyone other than Germans is just checking out in the American market.  It’s *assumed* no one here wants anything other than SUV or pickup.  \n\nCrude to $100/barrel would solve a little of that.",
            "How much did you pay for your 2002 new?",
            "Tbh the looks have grown on me. It's not the prettiest and definitely a bit boring, but I wouldn't call it hideous.\n\nAs for the drive train, yeah check the flair lol",
            "Funny i think the opposite…its a better looking car in person i think too which in an accords case, prolly isnt a good thing.",
            "We can dream...\n\nGet one used while you can. I guarantee in 6 years they'll all be clapped out",
            "247 lb-ft at 0 isn't slow.",
            "50k for a crv makes me want to burn down that dealership jesus",
            "The looks are very divisive. Personally it's grown on me. I wouldn't call it hideous but it's definitely not a looker",
            "Agreed about the camry. That front end is so fucking hideous I can't stand it",
            "Or just make a bigger Civic if anything. Seriously the accords feel like their as big as a BMW 5 Series now",
            "Boring is exactly the problem.\n\nThe accord was never boring before. Even the base models with the 4cyl were kinda peppy and fun, or alternatively had little to no failure points because they were so barebones and nothing broke.\n\nThe higher trim models punched well above their weight in premium feel and power. That J-series V6 makes the accord fucking MOVE for what it is.\n\nI sat in an escalade for an uber once. I honestly prefer my accord over the escalade. (yes it was pretty specced out) SUVs have a ton of body roll and ride like shit. Sedans and coupes are more planted. I'd rather feel a bump then body roll in a corner at fucking 10mph.\n\nThey massacred my poor accord. It never deserved this.",
            "CVT\n\nCrappy\n\nVersion\n\nTransmission",
            "The refresh on the last gen was *extremely* minimal, I have a hard time seeing any differences on the road. And I really do pay attention to details.\n\n[2020 Accord](https://hips.hearstapps.com/hmg-prod/images/2020-honda-accord-mmp-1-1568824260.jpg?crop=0.866xw:0.731xh;0.103xw,0.222xh&resize=1200:*)\n\n[2021 Accord](https://www.cnet.com/a/img/resize/e0b9831424d180fcac75abbb4d0b6ef817e31d79/hub/2021/01/07/a9cb3648-5bc3-49ed-8bad-4c88b231a4ec/2021-honda-accord-008.jpg?auto=webp&fit=crop&height=675&width=1200)\n\nThe only noticeable difference is the foglight area and that extra black plastic \"swoosh\" downward.\n\nAgain, one of the most minimal refreshes I've ever seen.",
            "All their suvs are selling great, and they actually look amazing. Sad really, I much prefer sedans",
            "Replace the Honda badge with a Maytag badge",
            "b... bu.... but- but dIsPlAcEmEnT bAd! bIg NuMbEr ScArY!!!1!1",
            "The looks are divisive. Personally it's grown on me a bit, I just think it looks a little too boring, and it's waaay too long.",
            "We can all like what we want and I don't mind. Personally if you like it that's great, I will stick with my v6 coupe personally though",
            ">EV's are a whole different story due to how the government misrepresents MPGe. EVs get a 6.67 correction factor for the amount of energy in a gallon of gasoline when converting to equivalent fuel economy. Just doing some basic math, removing the correction factor and the Tesla Y is at 44mpg ([You can check for yourself from the calculation here](https://casetext.com/federal-register/electric-and-hybrid-vehicle-research-development-and-demonstration-program-petroleum-equivalent-fuel-economy-calculation))...\n\n??? The MPGe ratings for BEVs and PHEVs is a conversion that uses 33.7kWh = 1 gallon, which is the amount of energy stored in a gallon of gas. Thus a vehicle that goes 3.0mi/kWh is using the same amount of energy as a combustion car getting 101.1mpg, which is why it's \"MPGe\" (MPG equivalent). \n\nWhether the Model Y actually meets it's EPA ratings or not (particularly in the highway) is one thing, but it'll only use the equivalent amount of energy as a combustion car getting well over 100MPGe below high highway speeds. Same thing with my IONIQ 5, it's rated for around 100MPGe because it uses the equivalent energy as a combustion car getting ~100MPG.",
            "Using MPGe or MPG doesn’t work for an EV. It really depends where you live and what prices are for gas and electricity. \n\nI used to have an M440i xDrive. Now I have an i4 M50. The EV was $3,700 CAD more. I live in BC. Premium fuel is $1.97/L here and I was averaging about 9.2L/100km in mixed driving. In the i4 I’m averaging 18.6kWh/100km over the life of the car. Same driving styles and routes approximately. Electricity costs me  about $0.12/kWh all-in. I drive about 36,000 km per year. That’s 360x9.2=3,312L for gas and 360x18.6=6,138kWh for electricity to go the same distance. \n\nTherefore, in my gas car, I was spending 3312Lx$1.97=$6,525 per year. And for the EV it’s 6138kWh x $0.12=$737 per year. I do use some public charging on occasional longer highway trips so we can increase my electricity cost to $1000 let’s say. Depreciation is a lot higher on the EV but I am keeping the car 10 years so that’s not very relevant for me. I’m saving at least $5,000 per year in fuel costs. \n\nI’ve already more than paid off the purchase price difference. Plus I don’t need emission inspections and I got a rebate which covered a lot of the provincial tax (saving me about $5k more than ICE). \n\nInsurance is nearly the same cost between the M440i and the i4 M50.\n\nIn the Hybrid Camry case, that’s a way better value than the Accord since it’s only $500 more.",
            "Fusion looks way more sporty which is a statement I never thought I'd make.",
            "The last gen fusion looked pretty slick for a family sedan when it came out. Much more exciting than the new accord anyway",
            "Thank you! I’ve always said it looks like a fusion and a Jetta had a baby",
            "Maybe the Accord is the more \"grown-up\" or \"professional\" choice.\n\nI don't mind the Accord styling, but the Civic does like nicer to me.  And it seems plenty big.  And cheaper.",
            "Until a month ago you could make an argument for the Accord coming in a hybrid version, but now they announced a Civic Hybrid which looks great and means there's even less reason to get an Accord",
            "I could see that.  I went with Taurus because it was a little newer and the same class.",
            "While the Civic sedan and Accord are midsize and fullsize, respectively, the Corolla and Camry are indeed compact and midsize, respectively. This is all according to the EPA.",
            "Just wait until the Pilot Type R comes out!",
            "I would not be excited to pay for all the brake pads I would need in order to track an SUV, no matter how good it managed to corner.",
            "the last gen coupes and the 2.0T sedans looked awesome. The coupes are hard to find now, people are holding on.",
            "Maybe I'm weird, but (limiting myself to modern-ish ones) I really liked the 08-12s (US) and the 13-17s",
            "I just went back 3 generations and the Civic is not even close to being larger than any of them.. Not sure what you're talking about. I didn't bother to go much further back but maybe 20 years ago, sure.. That's just what happens with time though. The Ford Ranger was the same size 20 years ago as the current gen Maverick.",
            "oh man a Fit Type R would be incredible",
            "The fit they no longer sell in the states because they made the assembly plant in mexico make only hrvs?",
            "The fit? The Honda city/Grace would be the civic",
            "Have you sat in an accord before? lol",
            "The 9th gen Civic's interior was awful though. The new Accord's interior is very nice. It's the *exterior* that's a letdown.",
            "The 2.0 turbo was boring? I thought they were low key hotrods with a lot of power... Relatively speaking of course.",
            "Why did you buy it in the first place? My last Honda was in 2016 and I’ll never buy another. Outside the Civic Type-R, every Honda and Acura is super boring. If they’re going to be boring then I’d rather just have a boring Camry hybrid for nearly the same price. Even my electric Ultimate Commuter Machine is a lot more exciting than anything Honda has put out (except the Civic Type-R.",
            "Only in the Si and Type-R trims for MY2025.",
            "Well you have an Ioniq 6 so your taste is as questionable as my driving a bright green dodge. /s",
            "I feel like the general shape isn't bad at all, but it's like it's missing something.  It just doesn't look finished.",
            "Cabin size feels far larger in the accord. I'm too lazy to look up actual numbers but knee and leg room felt far more spacious as both a front and rear passenger.",
            "Couldn't have said it better myself. The reason the accord stands (or stood) out is (was) because of the fun you could have. Strip that away and you might as well buy a camry",
            "The last time I remember noticing that a car was a Passat was about a week ago when I saw one on fire on the side of the road on my way home from work.",
            "> and I hope she picks the RAV 4Prime over the CRV Hybrid.\n\nTell her to really give it an extended test drive. The real world MPG is bollocks on the freeway and you struggle to get 32mpg at 70mph. Considering it's priced within spitting distance of the Accord touring, but it doesn't even have ventilated seats, a HUD or a full digital display is a bit of a ripoff. \n\nWish Honda brought the plug-in CRV to the USA.",
            ">Kinda interesting how Toyota’s got interesting and fun while Honda’s got boring.  Was always the other way around.\n\nHonestly man, it was never the other way around. Honda people always try to sell me on “THE CARS ARE SO FUN TO DRIVE!” but the Accord always felt very similar to the Camry SE, and the Fit felt like a Yaris that did crunches. One of my friends has a Fit and always hyped up the “great handling”, and when I finally drove it all I could think was “man this thing handles like ass compared to my wife’s Mini”. I would say my wife’s current car (Kia Soul) is about the same as a Fit in terms of handling.\n\nThey’re economy cars. Maybe the EG6 handled really well for what it was, but they’re honestly all nothing special. Apologies to your Accord.",
            "Toyota has always been pretty interesting, though. Various Supras, some cool wagons, some cool off road stuff like the Landcruiser and FJ40. People just forget about a lot of it.",
            "Get a used Acura. They are super fun!",
            "The people buying the current accord aren't cross shopping with CTRs lol",
            "Why did you skip 3.1?",
            "That would be odd, as the Civic has grown in size with each successive generation.",
            "Or make the next gen Accord electric only. Let the Civic cater to the enthusiast fans (Si, Type R) and the poors (hybrid).",
            "I'm aware it was a more costly option behind higher trim levels. But in the big scheme of things, they weren't super expensive cars.",
            "How? They really don't look anything alike...at all.",
            "Agreed. I have a 2017 V6 Coupe and that mf looks heavenly",
            "This. I'm a Toyota guy but those Accords in specific were amazing.",
            "people have hated the looks of every single accord generation on launch, then when the new gen launches people get fond of the previous gen",
            "I think he was comparing it to the Camry",
            "On this planet. The newest gen Accord is one of the ugliest cars on the road right now IMHO. That front end is almost as hideous as a modern BMW.",
            "If they just fixed the stapler taillights from the last gen and not messed with anything else it would be perfect",
            "I agree, I’m a fan of the 11th gen civic. For the accord the 9th gen refresh and 10th gen have been my favorites.",
            "There have been quite a few really good looking generations of accord. \n\nThe early ones are iconic, and the past 2 generations were very attractive. This gen is definitely a turn for the worse.",
            "Generic yes, but this newest design just doesn’t work.",
            "9th gen (especially the coupe) looked pretty decent",
            "Yeah, but this is way, way worse.",
            "Exactly. When did the Accord ever not look like a generic sedan? 90s and 00s Accords were basically just an *idea* of a car.",
            "“…designed to be inoffensive…”, true, but there has always been at least a hint of aspiration—like you could see a little inspiration drawn from some of the best sedans out there, which resulted in something generic but nice. But now it’s like they’ve drawn inspiration from some of the most embarrassing moments in 90s American car history + KIA’s awkward puberty to cross over from inoffensive to straight up depressing. Nobody expected an Alfa Romeo, but sure didn’t expect a 95 Buick LeSabre either.",
            "I thought the seventh gen was dope.",
            "The precious gen with the sport wheels was pretty far from generic. It actually stood out from the sedan crowd and was genuinely handsome.",
            "I test drove one new back in 2019 when I was last shopping, good car and good drivetrain, didn’t like that I couldn’t get all the options with the stick and ultimately when with something else.\n\nGreat all around car.",
            "I’ve owned a 9th gen manual. I also am not buying a manual accord for performance, I’d expect a civic si to perform better.",
            "I sold my 9th gen sedan manual last summer and have regretted it. It only had 140k on it.",
            "The 2.0t is Insanely quick & fun to drive for a midsize family car",
            "Or a Toyota.  As I get older, hearing slipping by me, the road noise in Honda and Toyota becoming more and more of a deterrent for me.  And that’s why God gave us Lexus and Acura.  God just forgot to give me the *means* with which to afford😂",
            "Honda does allocations, not orders. Honda decided what customers will buy instead of allowing customers to choose what they will buy. ",
            "Yeah I hate this logic. Technically, \"no one wants\" the GR Corolla because Toyota \"only\" sold 6,000 of them. Sure, they only *made* 6,000 of them, but that's inconvenient to the narrative.",
            "Sounds like maybe. I’m not sure if they’re going the direction of Crown or Crown Signia.",
            "Yeah people complain about bmw and Lexus going crazy over the top and then Honda comes out with this that looks refined and minimal and everyone complains that it’s boring. I think the new accord is the best looking “normal car that you see a million of”",
            "I think the biggest problem for me is the grille.  The side and rear view of the car look fine.",
            "Oh I'm definitely aware and I agree but I'm just saying that it's obvious that some of these companies purposely half-ass their sedans in an effort to have an excuse to chase them out when the sales continue to disappoint in that segment.",
            "I think the 11th gen Accord is the best-looking non-luxury modern sedan, and I listen to NPR podcasts most days, so that tracks I guess.  I will never, ever understand the reception to this thing's design.",
            "The only people I see driving the 11th gen Accord are balding old frumpy people who still work at a job with a dress code but do the bare minimum to meet it.",
            "I bought it used and no longer have it, but still have the window sticker. \n\nIt was an LX for $19,940 plus $440 for destination for a total of $20,380.\n\n70% domestic parts with 20% Japanese. \n\nMy Maverick? Made in Mexico and has maybe 20% US components.",
            "15.2 second 1/4 mile @ 91 mph is slow.",
            "But remember, that's 50,000 CAD. In non-Monopoly currency, that's probably like $100 USD. \n\nSo cars are actually cheaper in Canada. \n\n>!Canadians, please don't cut off my supply of your maple syrup. Just a joke.!<",
            "I'm not sure if you've seen it in person but I think it looks perfectly fine for an Accord. I do like minimalist styling though.",
            "I guess its Camry then.  Hang on, what did they do to the Camry?",
            "NO REPLACEMENT",
            "Like I said your accord is my favorite and why they decided to nix both the civic and accord coupes for the coming “prelude” is stupid when the 86 is selling just fine with 2 doors for its price tag.",
            "Obviously biased, but higher trim Fusions were some of the best looking regular sedans in the teens. Wish.com Rapide isn’t as big a diss as some people think it is.",
            "The last Fusion model was designed by the same guy who did Aston Martins. They looked great.",
            "Why? It's literally an Aston Martin! Just like that Rolls Chrysler made.",
            "My buddy occassionally tracks his fusion. Its pretty good considering its a stock street car.",
            "Well it did have a twin turbo v6 option. /s",
            "Isn't the Integra the more \"grown-up\" or \"professional\" choice?",
            "The last coupes that came with the V6 were perfect.",
            "The early 90s Accords were small as fuck, like a family go-kart. Some of those era Civics were like 2000lbs, and the original CRX was under 1800. \n\nAccords been pretty big since the late 90s, though, and Civics are still pretty much modern sports car light. Fits weigh less than most sports cars.",
            "Wheelbase doesn’t tell the whole story.  Go sit in them.",
            "Sporty econohatch with magic seats? Yes please ",
            "\"poor sales\" but many would argue it was axed to sell more HR-V's",
            "They were… but that’s all they were. You also had no LSD to help put it all down, in a BIG sedan that handled like a boat and was harder to park than a Tahoe.",
            "I test drove a 6mt 2.0t accord thinking it would be my \"lowkey family racecar\" and was amazed at how boring it was. It felt slower significantly slower and just less fun to drive even compared to my 2.0t awd maverick.",
            "The whole car was.  The tires just spun if you ever did give it much.  The auto 10 speed only wanted to be efficient.  It didn’t really sound like anything.  I think it had 258 hp.  It looked boring.  It made me feel like I’d just given up and got something sensible.  \n\nI got a 2024 Audi RS etron GT to replace it.  Looks mean as hell, people that don’t even know cars take a second look.  It accelerates supercar and is as comfortable as a big German sedan should be.  And it sounds cool too.",
            "I thought I wanted a sensible commuting car.  I tried to be okay with it, everything about it is fine.  Just fine.  Just fine….",
            "BOOOOO well fork'em then",
            "If you think the RAV4 hybrid gets bad MPG on the highway just look at the EPA estimates for the CR-V hybrid and compare it to the ICE version.\n\n[It's just 2-4 MPG better, depending on trim](https://www.fueleconomy.gov/feg/PowerSearch.do?action=noform&path=1&year1=2023&year2=2023&make=Honda&baseModel=CR-V&srchtyp=ymm&pageno=1&rowLimit=50)",
            ">The real world MPG is bollocks on the freeway and you struggle to get 32mpg at 70mph.\n\nOof. Mild hybrid RAV4 stuffed to the gills averaged 39-40mpg going 80mph on a trip from WI to So Cal.\n\n38mpg  in town.\n\nOn the other hand I've started describing the RAV4 LE I inherited as \"agressively adequate\". Boring, but too practical to get rid of.",
            "Let her choose whatever she wants. *It isn't up to him.*\n\nThere's no need to \"tell her\" what to do, I'm sure she more than capable of researching both cars without a man explaining things to her. Women *do* use the internet.",
            "Wife’s Accord. So no offense taken. My daily is a Miata.",
            "The early 2000s MR2 was pretty cool in my opinion.",
            "They might be looking, but there’s a 5-10k price difference between sticker CTR and a higher trim Accord. I wanted a CTR, but when I got my Accord I couldn’t find a CTR under 46k (before markups) and got my Touring Accord OTD for 39k.",
            "See you are forcing me to explain this to you when you could have understood it without making a fool of yourself\n\nAccord is a D segment sedan. The target audience of D segment sedans are buying C or D segment SUVs. One below accord is civic which has everything that the D segment has minus the length and price. Accord has no selling point between these two choices. If you still want to buy an Accord, the CTR is similar price, similar luxury and has a better engine....\n\nsee engine because the comment chain is about how accord only had the engine advantage.\n\nOff you go back to your hiding under the rock",
            "3.1 is the CR-V comment",
            "Honda has done this before, the 9th gen Accord was slightly smaller than the 8th gen.",
            "No they didn't.",
            "You are right, I misread",
            "Particularly ugly when looking at it in your rear view mirror ",
            "Yes! If I could slap the new taillights on my 19 I would be so happy",
            "> The early ones are iconic\n\nI would argue they were iconic because of how popular the car was, just like how the early Priuses were also iconic.\n\nBut I don't think anyone would nominate [this](https://bringatrailer.com/wp-content/uploads/2023/03/1990_honda_accord_mg_3850-27634.jpg?fit=940%2C627) to the automotive design hall of fame anytime soon.",
            "In white it looks like something from a sci-fi film about a future where everyone lives in little standard issue housing units and nobody is allowed to have anything unique or inspired. \n\nI know there are plenty of boring cars but this one just has that vibe to it.",
            "I'm usually a hater on these issues but I don't see it.",
            "9th sedan post facelift was probably their best looking Accord",
            "I would argue they've always been very decent, handsome for family sedans even. Personally I've almost always preferred them over Camry designs.\n\nBut that doesn't mean they were anything more than family sedans designed to be inoffensive and economically and reliably to mass manufacturer.\n\nAnd I think the new-gen is just the same. Yes the design language changed a bit but I still wouldn't look at it twice on the road, for good or bad.",
            "9th gen face-lift sedans can even look executive I'd say. 9th gen coupes are outright gorgeous to look at, especially with black on black leather.\n\n(I may be ever so slightly biased)",
            "The late '80s coupes with popup headlights [looked very cool](https://en.wikipedia.org/wiki/Honda_Accord#/media/File:'89_Honda_Accord_Coupe.jpg).",
            "It is. I came from a modded Focus ST and the stock accord feels similarly quick. Looking forward to modding the accord. It's also fairly lightweight for its size.",
            "I had a corolla as a rental for a drive from seattle to LA. I had tinnitus by the end of the trip like I get after concerts. Do people really put up with this? My entry level Fords, chevys, and VWs have never been that loud. That car made me roll my eyes every time I see a toyota circlejerc on this sub.",
            "It's almost absurd just how bad the NVH is in new Toyota's.  The rav4 makes a new Chevy Equinox feel like a Rolls Royce by comparison.",
            "Oh, your problems are worse than that. Every car ever made will be sold, even if they have to aggressively discount. If sales numbers are weak for years on end in terms of numbers of cars sold, that means some planner cut production years in advance.",
            "I’ve got one and I like it enough. I do listen to NPR fairly regularly tho.",
            "Nah we get reamed, everyone is always like cheap and fun? Miata!\n\nAnd it's at like $40k here and you can use it for 2 months",
            "I have seen it and I definitely think it looms better in person. Still eh though. I like the newer Civic's proportions a lot better. The new accord is way too long",
            "Make it also ugly as fuck",
            "🦅",
            "Well the 86 is also cheap and rwd. Two things ppl LOVE",
            "Man, none of my friends agreed but I thought the the 2nd generation Fusions looked vaguely like Aston Martins in a good way.\n\nI feel vindicated if that's a common opinion on here. I always thought they were very nice looking cars, especially for the price.",
            "I would still say that they're one of the better looking family sedans. And I find they don't look like their design is over a decade old, at least from the outside. Whenever I see an older one, the only thing that really tells me it is from the 10's and teens is the headlights.",
            "The later models could be had with a Twin Turbo V6 and AWD - true sleepers.",
            "They definitely didn't look bad.  Not necessarily sporty looking but less boring than a Camry.  I saw very few of the top trim ones though.",
            "I think the Chrysler is closer to a Bentley personally.  Probably have the same reliability.",
            "I mean that thing was actually proper quick, 0-60 5.3sec and a 13.9 quarter mile in 2017 per Motortrend.",
            "At the Honda dealer.  No Acura dealer around here, so that's the logical progression when staying within the family.",
            "> I got a 2024 Audi RS etron GT to replace it.\n\nLot of people cross shopping accords with $150k cars...",
            "> I got a 2024 Audi RS etron GT to replace it.\n\nBread is pretty boring, so let them eat cake!",
            "If you want a manual civic just get the Si.  I don't know anyone who specifically appreciates a manual who would prefer the base civic, except maybe people who want to tow it behind an RV.",
            "I *think* OP was saying the CRV gets bad MPG, not the Rav4 Prime. Prime by the way is another league of MPG compared to almost anything else.",
            "It's true of a lot of hybrids, I believe. I think the Escalade hybrid had about 1 MPG on the conventional version at highway speed, though the city fuel economy was much better",
            "Family 2024 CRV has 44k miles on it, and it gets around 36-40mpg on city or stop and go traffic. Struggles to maintain 32mpg on freeway cruising. The older 10th Gen Accord would do 42~ city and 36-40mpg freeway.",
            "all the mr2s were cool. it's not every day you have an everyman's mid engine car, and Toyota did that 3 times over 2 decades.",
            "It was a step backwards from its predecessor. The SW20 had a turbo option and looked like an exotic. So when a 1990 MR2 looks amazing and can have 200 hp, you can’t make your 2000 MR2 have only the 130hp base Corolla engine and look cutesy. Like, how did they not at least offer that as a base model and then give the option of the Celica GT-S Yamaha engine, the 2ZZ with the 6 speed and limited slip differential?",
            "Kinda wild to me that anyone looking for a ctr settles on an accord. They’re completely different experiences",
            "> I couldn’t find a CTR under 46k\n\n46k is MSRP",
            "To most people, that would be 3.0",
            "That's true. But they've yet to do it with the Civic.",
            "I actually like the tail light bar that the aftermarket companies came up with for the 10th gen\n\nhttps://www.amazon.com/ENSVEI-2018-2020-Dynamic-Animation-Breathing/dp/B09PQQGYD8?th=1",
            "> But I don't think anyone would nominate this to the automotive design hall of fame anytime soon.\n\nMaybe I'm biased, but I would - I always thought that gen of Accord was one of the most handsome designs of its time in a segment that couldn't be more emblematic of its era if it tried.",
            "I had that exact car (4th gen) in brown with a burgundy interior. Great car to drive but very average for the time (also unusual was that all Accords back then came with black steering wheels). The 3rd gen with pop-up headlights was awesome though.",
            "> But I don’t think anyone would nominate this to the automotive design hall of fame anytime soon.\n\nThis is my favorite Accord generation by far.  I’d absolutely daily one of these in good condition still today.  The styling isn’t overwrought and the interior is next level for the price—some of the best of the time.",
            "[You're not wrong.. This is the most boring, mundane looking white car I've ever seen](https://mystrongad.com/EGH_ElkGroveHonda/Digital/Accord/2024/24-Honda-Accord-White.webp)",
            "2024 Soviet Union.",
            "They peaked with the 9th gen face-lift",
            "As a biased 9th gen facelift owner I have to agree, it does not look/feel 8 years old to me lol",
            "To be fair, that is kind of an outlier.",
            "The generation after with the clear headlights actually looked much more modern at the time. \n\nBasically nothing else had them and pop ups were basic and played out. Ford Probes had pop ups. No one cared.\n\ne:s/has/had",
            "Was in a new Sienna recently, and holy shit it’s like taking a cheese grater to my ears. The engine is so ducking loud on the inside, and sounds horribly drone-y",
            "I reckon it depends on how much you drive and where you drive also. Where I usually drive in Vancouver, our roads are smoother than the I5 and the average Seattle street. I almost never drive more than 35-40 minutes at a time, so my hybrid Toyota's drony noise doesn't get on my nerves. Though when I go down to Seattle, the NVH gets to me after the 3h drive. And almost all of my driving experience has been in compact/subcompact Toyotas and Hondas with poor NVH, so my standards are different from someone who is used to premium vehicles. Agree that the Toyota circlejerk on Reddit is a bit cult-like though.",
            "Tinnitus? \n\nMy 2002 Corolla does nearly 4000 rpm at 120 kph (75 mph) and it's annoying for sure because that's the part of the rev range where the engine likes to shout and drone, but it's nothing worse than a nuisance. Surely your rental can't have been *that* loud?",
            "Our two cars in the house are a 17 4Runner and an 11 BMW 3 Series.  First name which one I’d rather take on long highway trips, then name which one I trust more past 100k miles😂\n\nBonus, name which one absolutely kills off-road trails.  😂😂",
            "Yeah, I know. Pricing up there is rough. It's not just the conversion rate, unfortunately.",
            "I can get a base accord cheaper than I can a MT 86. Source: Just bought a Trueno Edition. Most MT 86s have such a high mark up that you have to account for it imo. \n\nW/e though. I know I have bad tastes.  It at least I’m having bad tastes while having a ton of fun.",
            "The 2nd gen Fusion would've been designed while Ford still owned Aston Martin. I'm sure the resemblance is intentional.",
            "There was so much hype around the 2nd gen fusion when it was first unveiled. It looked so damn good for the time. It's still a nice looking car now considering the design has been around for as long as it has",
            "I also think they are nice looking cars, but I might be a bit biased.",
            "I called it the Aston Fusion when I first saw it.",
            "People put replica grills for both on their 300s\n\nThe body is more Rolls to me though.",
            "I believe it had one of the highest horsepower to dollar ratio of any new car at the time.",
            "I feel like almost anything for the last couple of decades is proper quick, barring of course economy / super fuel efficient stuff. My 2012 F150 supposedly does 0-60 in 6.4 seconds, which for a vehicle shaped like a brick that weighs 5600+ lbs is just nutty.",
            "True true",
            "It was a special deal and a lease.",
            "It was so damn boring I had to do something drastic and the deal came around that let me do it.",
            "Broke people who don't want a soulless and fragile cvt",
            "I understand what you mean, but Toyota's bean counters probably couldn't justify offering another variant for a low volume production vehicle. Tiff Needell   of Top Gear was a fan of this car.",
            "I needed a 4 door commuter that could handle a family. A CTR could fill this role at the right price and be loads of fun, but there’s a limit. At MSRP I could have made it work, but what the CTR was actually going for made it too irresponsible.\n\nI ended up going responsible and I’ll save for a proper fun car that I won’t rack up the miles on.",
            "Could have sworn the sticker was around 42k. Bad memory strikes again.",
            "4th generation Accords have aged like fine wine compared to any domestic car from the era. They are still extremely cool with a light drop, and wheels.  Whenever I see a clean one at a car show I usually walk past many more expensive cars to go check it out. \n\n\n\nI had a 5th gen stick shift Accord EX when it was relatively new, and people thought it looked like a luxury car back then. \n\n  \nThe next few generations after that got much more frumpy in their design, but I feel like they returned to form recently.\n\n  \nIt was disappointing to see the new generation go off course again.",
            "Why I bought a Pacifica in 2020. Quietest minivan.",
            "I agree some has to do with the road, but it’s also the speed and how poorly it’s insulated. I think BC speed limits and all the unmarked vancouver and west van squad cars setting traps keeps the noise down more than the road quality.",
            "This was a 2023. Maybe yours is better. It was a combination of the drone from the engine and the road noise. There was zero dampening between me and the concrete.",
            "I mean, it's logical than a premium sedan would have better NVH than an economy brand's body on frame SUV.",
            "It was designed by one of AM's chief designers when ford owned AM, it was 100% intentional and fusions still look better than the 300's or w/e that came after",
            "It's the only reason Ford bought Aston.",
            "IIRC Ford actually owns the Aston Martin grill outright. Before they got rid of AM they made them sign over the rights to the grill design to Ford and now Ford \"licenses\" it to Aston at no cost. They did this so they could use the grill but not get sued.",
            "Even though Ford hasn't made them for a few years you still see them on the road everywhere.\n\nI still kinda wish I'd picked up a Fusion Sport for a bit before I got my Bronco. I heard they were awesome sleepers.",
            "I bought mine in 2020 with 36k miles on it for $18k.  Hard to find anything in that price range that is that quick without going back a few decades, and it's AWD and pretty comfortable to drive year round.",
            "Fair enough. Our speed limits in the lower mainland are indeed lower than the 75 mph limit on the I5.",
            "I've not driven a 2023 so I don't know really. Crazy that a much older 'Rolla is so much better then, there's 21 years between them. Mine is built in England too, if that matters at all.",
            "As much as I love my mk8 GTI, my 17 fusion sport was phenomenal. It was super comfy and snow covered roads were no biggie. Had it pretty modded out, that 2.7 can move. Unfortunately someone failed to yield and totaled it.",
            "And now its also hard to find those, in general",
            "is yours still AWD? transfer case hasn't leaked its contents and seized yet?",
            "I lived in west van for a few months during this past ski season (or lack of it) and would have to drive to Blaine a lot to pick up my mail. Would love once I crossed the second narrows because of the reasonable speed limits. The north shore had the weirdest unmarked and undercover cars. I even saw a tacoma with a ski rack and skis pull over cars.",
            "The current gen Corolla rides lower to the ground and wears bigger tires and has less tire sidewall to dampen the vibrations, unlike older generations. The 2.0l 169 hp makes it way quicker than any older Corolla I've ever driven. The 1.8l hybrid ones are more fuel efficient than older gas ones.",
            "Do you have the MT? I heard the shifting feel isn't great, but the GTI or R would be a great car for me if the transmission is nice",
            "My folks had a final-gen taurus SHO which should be the same case, and it was rock solid for 9 salty winters and 140,000 miles",
            "That's way more interesting than other undercover police vehicles I've seen, an older model Toyota Sienna, and an old Subaru Legacy in Surrey.",
            "nice. if you look around you'll see Ford techs bashing those transfer cases. they have quite a rep. i always liked the cars though!"
        ]
    },
    "China has spent at least $230 billion to build its EV industry, new study finds\n": {
        "title": "China has spent at least $230 billion to build its EV industry, new study finds\n",
        "score": 140,
        "url": "https://www.cnbc.com/2024/06/21/china-spent-230-billion-to-build-its-electric-car-industry-csis-says.html",
        "content": "",
        "num_comments": 48,
        "comments": [
            "$230B over **14 years** according to the article, that's $16B/year to build a significant lead in a major high tech industry.\n\nThat's literally less than what the U.S. military spent on [keeping the AC running](https://www.theatlantic.com/international/archive/2011/06/us-military-spends-20-billion-air-conditioning-troops/352200/) in Iraq and Afghanistan each year.\n\nSounds like pretty good investment if you ask me.",
            ">The competition is so fierce that Bank of America analysts said this week that major [U.S. automakers should leave China](https://www.cnbc.com/2024/06/18/detroit-automakers-need-to-exit-china-bofa-analyst-says-.html) and focus their resources elsewhere.\n\nWhere can D3 go ? Only focus in Latin America ? Should they return India ? I don't think Detroit would easily give up China market because China is biggest car market, China market gives them much profit. It would be difficult if they only care Latin America and return India. \n\nBeside, if you want to talk sales would go more slump for Western automakers, Japanese automakers are really in trouble. Except Toyota and Nissan seem still able to stay, most of them could leave China soon. Like Mitsubishi Motor, they already lefts China.",
            "Sounds smart to invest in the future, no?",
            "GM saw China as it's giant cash cow before. But now, it's making millions of losses every year. The prediction is that it will only get even worse over time.\n\nI predict in 3 years GM will just outright pull out of China.",
            "TBF I’m curious how much Tesla was subsidized",
            "China heavily state subsidize.\n\nChina spends as much as 5% of its GDP on subsidies in 2022, more than any other countries.\n\n[Government subsidies don’t boost Chinese firms’ productivity | East Asia Forum](https://eastasiaforum.org/2023/09/14/government-subsidies-dont-boost-chinese-firms-productivity/#:~:text=A%202022%20report%20suggests%20that,policies%2C%20more%20than%20most%20countries.)",
            "Directed capitalism is the way.",
            "Number gonna be much much bigger than 230B.",
            "Good thing EVs aren't the future.",
            "This is why the US is now going against electric cars. The industry realized that China was years ahead of the US so now they are reverting back to ICE",
            "Chinese EVs will be in North America within the decade",
            "I am pretty sure nobody disagrees with you. The point is that the US should make similar investments into our future.",
            "i would think the american should go fight head on with toyota in the middle east market with their body on frame truck and off-road offering. They can probably eat nissan and hyundai/kia's lunch there\n\naccording to suzuki, they left china because chinese consumer liked larger cars and they sell smaller cars.",
            "Japanese automaker's biggest market has been, and will be the U.S. and domestic Japanese market. It won't have too much of a future in EU, China, and the rest of the world. SEA is already being taken over by the Chinese OEMs.\n\nAmerican automakers will be successful in the U.S. market only in 10 years. Currently they are *only* successful in the U.S. and China, and if we lose the Chinese market because of uncompetitive products then the only market we can keep is our domestic market since we have tariff protection.",
            "They will lose out in China soon.  China demands they partner with a Chinese firm.  They then steal the technology and kick out the foreign company.  It is good short term profit but not sustainable.",
            "China has been setting up shop in South America and India is moving towards electrification as well. The American companies has been on a rapid decline for the past decade in Asia and Australia, their only profitable market is their home and maybe Europe. \n\nToyota and Nissan in China? LoL!  These two are operating at a huge loss in 2024, Nissan just shut down a factory in Changzhou yesterday.",
            "Buick will probably die in China. I can't believe they fucked it up *again* by letting the brand becoming stale and now Chinese consumers also equate it with \"boring cars for old people\".\n\nCadillac still has a lot of brand value in China, their high-end EVs (yes the ones with funny names) can still do well in China.",
            "I've pointed out the misleading wording in your comment before, it's a little disappointing that you are still repeating it.\n\nPer the source you linked: \n\n>A 2022 report suggests that China spends 1.7–5 per cent of its GDP on **industrial policies**, more than most countries.\n\nSo let's dive into that report here: https://asiasociety.org/sites/default/files/2023-01/ASPI_SCCEI_China%20Industrial%20Policy_%20Roundtable%20%20Summary%20Report_Final.pdf\n\nThe number is about overall spending on *industrial policy*, which includes direct subsidies but also many other factors. The number used in that report includes everything from tax benefits to government funded academic R&D to even government buying products from the companies directly.\n\nAccording to your definition, the U.S. government spending $100M buying a F-35 from Lockheed Martin equates to the U.S. government *subsidizing* Lockheed Martin for $100M. I don't think many economists or trade experts would agree with that definition.\n\nAccording to your definition, most of the $780 billion Inflation Reduction Act would count as subsidy as well. I also do not agree with that.\n\nBut if you do want to stick with your definition, then you can see our numbers far dwarf's China's numbers, which isn't surprising since our government is richer.",
            "DAMN RIGHT BROTHER\n\nWHEN WE’RE DRIVIN FLYIN CARS ON MARS WE’RE GONNA BE POWERING THEM WITH CLEAN AMERICAN DIESEL 🇺🇸🇺🇸🇺🇸🦅🦅🦅\n\nELECTRICITY IS JUST A FAD AND FOR WIMPS BROTHER",
            "What is the future?",
            "Our politicians would probably prevent that. Gotta protect us from \"security issues.\"",
            "The frustrating thing is that the Big Three has definitely gotten its share of government money too.\n\nBut then they spend billions on share buybacks and executive bonuses.",
            "Part of the problem is that everyone wants a handout from the  big 2 US car companies and they want the shareholders to carry on all the cost and risk and zero of the benefits. Tesla, inversely, pays a median of 50% more to its employees than Ford, for example. It also has a history of giving its employees share in Tesla, which has resulted in them being beautifully rewarded. In other words, Tesla employees get paid more AND they benefit from owning stock in Tesla.",
            "> toyota in the middle east market with their body on frame truck and off-road offering\n\nThat's actually not that big of a segment, in a market that's not that big to begin with.\n\n>according to suzuki, they left china because chinese consumer liked larger cars and they sell smaller cars.\n\nThere are plenty of small cars being sold in China (especially in the NEV segment), Suzuki just doesn't offer anything competitive there.",
            "Ford is very successful in Europe.",
            "I saw on a video (by CNBC I think) that such regulations have since been lifted for cars.",
            "I mean, the Chinese started serious investments and work on battery tech in the early 2010s, when only Tesla was doing the same in the US. EVs are not some steal/copy everyone else game for them.\n\nChina is no longer the backward place that many people think. They’re leaders in quite a few industries. I work in an industry where this is the case - the best suppliers are in China, and they know it and they charge more.\n\nWhere I am, lots of people can comfortably afford Teslas and German EVs (and Model 3s cost $140k USD because of tax here) but most electric cars are Chinese - they’re just a much better value proposition in a market that is neutral.",
            "The Lyriq and what else? I don't think Cadillac has the cachet to compete with the Germans/Brits in the ultra luxury space with the Celeste.",
            "i still standby my comment because china does shit differently. For example in the US the $7500 of the inflation reduction is given to the consumer, in China the equivalent is given to the manufacturer",
            "I think a combination of technologies will move us. I knew from the start that the EV deadline was a hoax. If I know the technology wasn't viable for the timeline then all the people smarter than me and that have all the information have to know as well.\n\nThe cynic in me says they want to mandate this and brainwash everyone into believing it. Then when the deadline comes and we don't have the supply chain, resources or infrastructure to build or (green) charge them the authorities can say \"well we don't have enough cars to go around and couldn't support the required number anyways; I guess less people will be driving cars in the future.\"\n\nThe optimist in me says that the hysteria will end and eventually people will come to their senses. Hybrid platforms of diesel over electric to start, and eventually something greener like H-fuel cell or E-fuel hybrids will become the long range options. I am a heavy duty mechanic and I KNOW the heavy haul industry cannot function via EVs.\n\nFord announced the Lightning and said the extended range version would have 300mi range, but touted the number as low because the EPA said they had to test with 1000lbs payload as it is considered a work truck, so the range is more like 350 miles.\n\nThe VERY first thing I said was hang on... if it GAINS 50 miles from dropping 1000lbs, how much does it lose towing anything it is rated for? Say 6000 lbs? Wind resistance from the trailer or boat?\n\nYeah so anyway here we are last weekend and I fuelled up my truck at a relatively remote fuel station. Here is a family in a lightning towing a travel trailer smaller than mine parked blocking a bunch of charging stations.\n\nI politely ask \"I've never spoken to anyone who has actually towed with one of these.. how is it?\" The response was \"when towing our trailer the range drops to between 200 and 250km.\" I asked how long it takes to charge from, say 15%. They said \"we are at 12% now and it should take around an hour to get back to 80% - not that bad really. However we don't have service and can't get the charging station to work.\"\n\nSo BEST CASE SCENARIO they can go a less than a third the distance my diesel truck will go towing a smaller trailer to then wait AN HOUR with the family blocking a bunch of charging stations in a sweltering parking lot in the middle of nowhere to NOT CHARGE IT FULLY. I can refill my truck in 10 minutes and drive another 600km plus I can pack extra fuel if need be.\n\nHOWEVER their situation was not best case scenario. They couldn't even charge at all because of electronic complications and didn't have the range to leave and find service elsewhere.\n\nYeah. EVs are not the future. Maybe in city centers for commuters but in countries with land and highways and long distances. No.",
            "Hot take: \n\nWe’re throwing good money after bad here.  We should have let Chrysler and GM fail rather than give these companies another decade and a half to get totally smoked by China.  This is already happening in North America in Mexico as well as in Latin America.\n\nUS automobile manufacturing has been on a slow death for the last half century or so with the exception of large trucks.  At this point I think we’ve just postponed the inevitable.\n\nThe current administration seems to believe if we deny the latest CATL derived EVs from hitting our shores we’ll all rush to buy EV Blazers and Equinoxes or something while paying lip service to climate change and emissions reductions.",
            "middle east market may not be big but they pay a lot of premium and big bucks for a car",
            "Also Ford in Europe is quite different from Ford North America",
            "Ford Sales in Europe:\n\n| 2016 | 1,109,015 |\n|------|-----------|\n| 2017 | 1,075,840 |\n| 2018 | 947,674   |\n| 2019 | 903,229   |\n| 2020 | 578,336   |\n| 2021 | 584,614   |\n| 2022 | 544,497   |\n| 2023 | 518,371   |\n\nSee the problem?",
            ">CNBC\n\nLMFAO",
            "Wait how is it different?\n\nHere in the U.S consumer pays manufacture, and government pays consumer as a rebate. The end result is the manufacture can set the price $7500 higher, netting profit equal to the amount of tax rebate. \n\nIn fact in China much of the tax benefits are things like low sales tax or free registration for EVs, which directly benefits consumers.",
            ">For example in the US the $7500 of the inflation reduction is given to the consumer, in China the equivalent is given to the manufacturer\n\nThere is no difference. Money injected into a system is money injected into a system, it doesn't actually get 'handed' to one person or another. When you get that $7500 you're giving it right to the company. We've already seen that OEMs adjust for this — often when their models become eligible for the incentives, their MSRPs / ASPs will magically go up by $7000 or so. \n\nI'll add: Manufacturers in the US get direct supply-side subsidies as well. Labour, cell production, land, and much more are subsidized. Volkswagen's new Scout factory in South Carolina [is getting $1.3B in incentives](https://www.reuters.com/business/autos-transportation/volkswagens-scout-unit-wins-13-bln-incentives-south-carolina-factory-2023-03-20/). Another $13B CAD for Volkswagen [was earmarked by the Canadian government](https://www.cbc.ca/news/politics/volkswagen-subsidies-stthomas-1.6816824) for the new St. Thomas plant. Rivian [just got $827M in subsidies](https://www.businesswire.com/news/home/20240502410154/en/Rivian-to-Receive-827M-in-Illinois-State-Funding-to-Expand-Normal-IL-Facility/) from the state of Illinois. \n\nSo it is absolutely not true that China and the US are different here.",
            "Ironic how a state pumping money into failing industry in the name of economy is exactly what a communist would do\n\nAnd we all know the money will be used to line the pockets of the oligarch because now the gov have incentivized them to fail again",
            "Lmao no\n\nhttps://pressroom.toyota.com/tmc-announces-april-through-march-2024-financial-results/\n\nToyota 2024 income worldwide is $36.9billion.\n\nThe “other” region includes the Middle East (and Africa, Australia, Central and South America)… is $1.3billion.\n\nEven if you give that full $1.3 billion to the Middle East (and say that Toyota earned $0 in all of Africa, Central and South America, Oceania…) that’s still basically a rounding error. That’s 3.5% of income. \n\nIf Toyota’s market cap dropped 3.5%, that’s just a typical “bad day” on the stock market. Nobody would even notice. \n\nAnd more likely (considering the number of Toyotas in Africa/Australia/Central/South America) the Middle East is less than 1% of Toyota income.\n\nThe Middle East can never pay big enough bucks for Toyota. Even if the pay doubles the price for a car, they’d go to… about a 2% share.",
            "Yeah but probably not gonna be enough to move the needle for a company like Toyota.",
            "Ford sells normal cars in Europe",
            "Their sales dropped off during the pandemic and haven't recovered? Isn't that kinda universal for everyone.",
            "This is made VERY obvious by the fact that Tesla, by far the biggest electric car seller in the US, had those tax rabates subtracted from the prices shown on their website.",
            "Giving the money directly to the manufacturer like china means you are implicitly compelling or forcing an automaker to build certain models, evs in this case to \"keep them in line\". If you don't build ev you are at an disadvantage.\n\nGiving the money to the consumer, a \"middle men\", if you will, means that responsibility has been transferred from the government to the people. They get a say, so some might purchase ev but some certainly not. This is not a hard \"you must and you will build ev\" type \"mandate\" like before.\n\nAlso your last point is completely missing a key piece of information which was also highlighted in the article; that china used to hand out subsidies of $13,000+ back in the day. They still hand out close to $5000\n\n\"Kennedy pointed out the (American) legislation provides a $7,500 credit for qualifying electric car purchases. That’s in contrast to the average Chinese support per electric car purchase of $4,600 in 2023 — which is down from $13,860 in 2018.\"",
            "I doubt that sales dropping by >50% is universal",
            ">Giving the money directly to the manufacturer like china means you are implicitly compelling or forcing an automaker to build certain models, evs in this case to \"keep them in line\". If you don't build ev you are at an disadvantage.\n\n[Ford, Hyundai, GM Get Billions in State Subsidies for Electric Car Plants](https://www.bloomberg.com/news/articles/2022-10-13/ford-jobs-cost-414-000-apiece-as-fight-for-factories-takes-off) — Bloomberg, October 13, 2022",
            "It's worth noting this is also when they stopped pushing cheap fiestas and pivoted to SUVs and Crossovers super hard. So they might be making 80-100% revenue with half the sales."
        ]
    }
}