{
    "Rule overhaul": {
        "title": "Rule overhaul",
        "score": 222,
        "url": "https://www.reddit.com/r/cats/comments/1c694b0/rule_overhaul/",
        "content": "[https://www.reddit.com/r/cats/about/rules](https://www.reddit.com/r/cats/about/rules)\n\n&#x200B;\n\nHello everyone,\n\n&#x200B;\n\nToday we are going live with our primary rule overhaul in order to keep the subreddit rules in tune with the modern needs of the community. \n\n&#x200B;\n\nOur rules were old and sometimes edited and added to, but over the years reddit has changed and our community has changed to the extent that it made sense to completely start from scratch. \n\n&#x200B;\n\nWe have kept a lot of the rules that we were actively moderating for, but have removed some rules that are no longer relevant. When the subreddit started the rule \"Content must be about cats\" made sense, but we do not need to expressly codify this anymore. We're not a small community these days and it has not happened in years that someone posted a bunny rabbit instead of a cat. We will of course still remove off-topic content but do not see the need to clutter up the rules page with something that our community understands to be self-evident. \n\n&#x200B;\n\nWe will likely make minor edits and additions to this new rule-set in the coming weeks until everything is just the way we like it, but the rules as posted now are the general framework from which we will do so.\n\n&#x200B;\n\nWe have kept our rules broadly worded so they can encompass many topics and so we do not need to codify for every single possibility. \n\n&#x200B;\n\nThe most important rules are at the top. Our number one rule is to respect each other. This for example includes following rediquette and sitewide rules, but also our subreddit-specific rule of not attacking other posters for not raising their pets to your satisfaction. \n\n&#x200B;\n\nOur rule about spam, memes and self-promotion includes  accounts that do not directly promote their content, but which nevertheless primarily exist to drive content to their NSFW stores like Onlyfans. Everyone is welcome to post here, but NSFW sellers can do so on a seperate, SFW account. We do not allow memes as they are most often posted as easy karma-grabs instead of genuine engagement. \n\n&#x200B;\n\nAnd so on. \n\n&#x200B;\n\nPlease read our new ruleset via the link at the top of this thread and give your feedback in a comment below. \n\n&#x200B;\n\nThank you all for helping us make this space the wonderful community that it is and we hope you enjoy your time here. \n\n&#x200B;\n\nThe r/cats mod team",
        "num_comments": 109,
        "comments": [
            "https://preview.redd.it/x0uv8yozdfvc1.jpeg?width=3024&format=pjpg&auto=webp&s=daf89954f1b3d883bdc11fac41d1ba9b914f6ae3",
            "Okay, I don't know how to put this into words, but I'll try. Every post I've seen recently from this sub is a sad story about the death of a beloved cat. Perhaps this is a me problem, and I really don't want to say that people shouldn't mourn, but it's always extreme for me to see this kind of post. Especially if it's the only type of content that is making it to the front page.",
            "https://preview.redd.it/0b1bmlg7xivc1.jpeg?width=366&format=pjpg&auto=webp&s=de6502c39bcb4b88717dbe17e77e16dee509a04e\n\nMrs. Whiskers approves and appreciates your work on the rules.",
            "https://preview.redd.it/cwx0m46hsfvc1.jpeg?width=3024&format=pjpg&auto=webp&s=b251c432cdf6e0e360aee72ea191d864e36c741f\n\nMy little boy Chibi",
            "https://preview.redd.it/wi5up311x5wc1.jpeg?width=864&format=pjpg&auto=webp&s=bccc16821899a4382065649c8b91513e2363a19a",
            "https://preview.redd.it/ot7tcna8kiwc1.jpeg?width=3000&format=pjpg&auto=webp&s=479aae55808f8baa5e149ee2a36426b264b6c437",
            "Can we add breed questions to the disallowed topics?",
            "https://preview.redd.it/9j7qdqsd45xc1.png?width=523&format=png&auto=webp&s=3026d8012f7f099f17b103a338fa8bc54213d7f2",
            "https://preview.redd.it/wfig3sc8dgxc1.jpeg?width=2234&format=pjpg&auto=webp&s=95ba04f011288dde08c7174fea0709f63b457078\n\nCats have such natural grace and elegance, they are like living works of art, does anyone agree?",
            "[removed]",
            "https://preview.redd.it/u4cu93skoovc1.jpeg?width=4032&format=pjpg&auto=webp&s=7a3297d07d0fd83d4eedcf81c3902a0605bfb8ab\n\nErrol concurs",
            "Are you still going to be deleting political posts?  I find politics to be extremely divisive and actually filled with hate these days with everything that's been going on in the middle east, etc.",
            "https://preview.redd.it/e3jm03i39gyc1.jpeg?width=5712&format=pjpg&auto=webp&s=0e76ea7b5f95939ccf7c37e763617b2c24a401c6\n\nMy gorgeous girl enjoying spring 🐈‍⬛🥰",
            "https://preview.redd.it/wsjgseod553d1.jpeg?width=923&format=pjpg&auto=webp&s=8174f4e9aba1f2dcdae2b76d8fb58441342fc6ef\n\nstill sleeping (:",
            "Lo\n\nhttps://preview.redd.it/7i0khji9fnvc1.png?width=720&format=pjpg&auto=webp&s=17d3f0024b2d67a5e93e3d50c0bd980df3fe9559\n\nCute",
            "Hi! Sorry to post this here. New member, I was going to create a new post asking for advice on transdermal ear meds, but for some reason the submit button is not available on my post. I've selected flair and looked through the rules, but not seeing anything that would prevent me from posting for the first time.",
            "https://preview.redd.it/fj0yv36ty90d1.jpeg?width=716&format=pjpg&auto=webp&s=ed9573c928293a3b96471bfd88552d4f397681be\n\n*Not my photo*",
            "I rescued a hurt kitty and I’ve named her Chanel. She’s adapting pretty well. She’s about 10 months  old. She’s always been on her own but a little socialized. I think someone was feeding her. She had a really bad abscess. Doing great now. I’ve spent over $600 at the vet but don’t let my boyfriend know. Shhhhhh.\n\nhttps://preview.redd.it/6zhc2g87w13d1.jpeg?width=1242&format=pjpg&auto=webp&s=a95b7cfa0ea17a419bc94f4a5d5ca5c6be44d474",
            "Lucious: Me and dad approved the rules, thanks for sharing\n\nhttps://preview.redd.it/62s1qhmle53d1.png?width=3456&format=png&auto=webp&s=7591de9cb12fbeb13d34519ccf28041edef8e147",
            "This thread has soooo many memorial posts- it’s soo sad.",
            "https://preview.redd.it/wlguvpfaj7wc1.jpeg?width=158&format=pjpg&auto=webp&s=e995de4079f3bc08ebfaca01b46c20bc6e72e7b0",
            "https://preview.redd.it/hqco0ch1o5xc1.jpeg?width=3024&format=pjpg&auto=webp&s=e6d998b60488c88543025c1c416e07fa811a0210\n\nSmall mouth",
            "https://preview.redd.it/7nllmufnrbxc1.jpeg?width=4032&format=pjpg&auto=webp&s=8192f332363bf32e8cdbaa844ec4807f3d4570fe",
            "https://preview.redd.it/wazoti64obzc1.jpeg?width=3024&format=pjpg&auto=webp&s=88ec47dd4d914393ac9143975a6ac693cb87a27e\n\nWe read the rules and fell asleep, but we promise to follow them",
            "What is with all the sad stuff? Life hurts enough.",
            "https://preview.redd.it/7irced1w691d1.jpeg?width=1817&format=pjpg&auto=webp&s=0435450345875a97ccf8c4d3fee178e6f55a8bd5\n\nmy little boy",
            "How do I delete my post from a few days ago if it ever got posted?",
            "I love cats\n\n![gif](giphy|2x0VePimPaFJDpGZ7H|downsized)",
            "https://preview.redd.it/cs5bnjy6ewzc1.jpeg?width=2252&format=pjpg&auto=webp&s=6870fd685366a4f85659f1d61c771f7655dbc8c1\n\nTucker",
            "I have an idea for a rule. I don’t know if this is the best place to post it.\n\nIf your post title includes the word “car,” there should be a bot that asks you if you’re sure that’s the word you wanted to use. \n\nI see the same typo every day on this subreddit. I don’t know anything about programming bots, but I think this would be possible as I’ve seen similar mechanisms on other subreddits. Ideally, when you post anything with the word “car,” your post will start out as invisible, and a bot will immediately comment “It looks like you have a typo. If you are intentionally referring to an automobile, then please reply “YES” to this comment.”",
            "yes ma'am",
            "***I am leaving the*** r/cats ***subreddit,and I am NEVER,EVER coming back. Goodbye!,...Forever.***",
            "https://preview.redd.it/v06mmvsjzu2d1.jpeg?width=2252&format=pjpg&auto=webp&s=b60b9cf9a15c711aa1a3623602c15fd18bd8be12\n\nHarley says hello",
            "Hi,  \nI just made a post looking for advice, and within a minute of posting it, it has been removed.  \nWhat happened?",
            "https://preview.redd.it/mv2hcedpk93d1.jpeg?width=3024&format=pjpg&auto=webp&s=cd5a670cef0bf3a811f70d32a64dd76ceada9a01\n\nWhat is wrong with this cats ears??",
            "sounds good with me",
            "https://preview.redd.it/p19a1li9to3d1.jpeg?width=1080&format=pjpg&auto=webp&s=0dd86e647d42ce85815048d9af7a0aa2c1504fc9",
            "https://preview.redd.it/dx9pw38j2p3d1.jpeg?width=1080&format=pjpg&auto=webp&s=eeb96dd43e96ae1f4f4b1197157dc01e04619055",
            "Tried to add a video of my cat and instantly removed by mods zzzzz",
            "Hello everyone I have a 7-year-old indoor outdoor Russian gray that is having some issues with her nose and ears it happens every summer but never this bad if anyone can help it would be greatly appreciated. By the way we are in the south of USA,\n\nhttps://preview.redd.it/38dtkyyd2v4d1.jpeg?width=2252&format=pjpg&auto=webp&s=a30834d4ba6d441e87e5f814c267361ba9b65dc0\n\nthank you all",
            "[removed]",
            "https://preview.redd.it/v8xloelulk5d1.jpeg?width=2378&format=pjpg&auto=webp&s=60bfb486d54b77e4e29d5317b1cd5d9ecd2cdbf4",
            "  Hbv",
            "Sorry but I just have a question of the rules!!!   The abbreviations NSFW and SFW were used and I simply have no idea what they stand for.  Would someone please enlighten me? ",
            "Is it self promotion if I REALLY  need karma and add cat pictures for it?",
            "Sleeping\n\nhttps://preview.redd.it/j5lqijihm38d1.png?width=720&format=pjpg&auto=webp&s=8eb9ba7d7bf4f3ce10f6b6f1c31c4a63a868957e",
            "\nmy little boy",
            "Can we remove cat+dogs posts ? This r/cats , not r/Pets.\n\nI'm here only for your cat pictures.",
            "![img](emote|t5_2qhta|7949)",
            "Hahaha, this is too funny 😂",
            "![img](emote|t5_2qhta|7943)",
            "haha",
            "It's me",
            "Thank you for mentioning. I have a hard time with these death posts too. I previously left the subreddit because of it.",
            "This sub has long had a filter for loss posts.",
            "Yeah could we keep mourning/loss posts to a certain day of the week? Like Sundays or something? I don't need to be sad :(",
            "So cute!! ☺️",
            "![gif](emote|free_emotes_pack|table)\n\nhttps://preview.redd.it/sgbi9wv8m83d1.jpeg?width=351&format=pjpg&auto=webp&s=2d6b0054041118837ed92f65fa328b078aadad7d",
            "nice",
            "Chibi -kun is absolutely kawaii!! 🫶🫰",
            "LOL,![img](emote|t5_2qhta|7946)",
            "Twinsies!❤️",
            "![img](emote|t5_2qhta|7968)",
            "![img](emote|t5_2qhta|7965)",
            "mailbox",
            "For all you PBS watchers, he's going to see his abula in Mexico!",
            "Why is gender a disallowed topic",
            "i think as long as its a cat picture it should be fine 😆",
            "aww",
            "Absolutely! Well composed.",
            "She is precious!",
            "Your secret is safe and thanks for being a caring person.",
            "😂 Took me a few seconds. Almost thought no cat in there.",
            "big dog",
            "Leaving r/cats, why, specifically?  Like most cats, I'm just curious. Thanks\n\nA greatly admired person once said eloquently, \n\n**\"*****Quitters never win,and winners never quit!***  ***For FRICK sake!,...Only,...LOSERS!,...Quit.***\"\n\nAre we not to believe that now?",
            "Most likely a congenital trait, but still a sweet, beautiful cat who just wants to be loved.",
            "Has he been to the vet? Cant see anythi g in the pic. An allergy?",
            "[removed]",
            "Not safe for wors NSFW (18+ or adult content)\n\n\nSafe for work SFW (safe for kids to see)",
            "What if it's a male dog who thinks it's a girl cat?  Should people have to provide DNA evidence when posting.   Maybe we should just allow them to be happy.  Life is too short not to.  Meow",
            "I belong to the sub and loss posts are the only ones that ever pop into my feed. I downvote each on thinking Reddits algorithm will finally get that I don’t want to see them. I came to see if there was some kind of filter when I saw this post about the new rules.",
            "You can’t use the filters when browsing hot/popular/whatever front page feed of your choice. They only work within the subreddit",
            "cool",
            "He is, thank you very much ✨",
            "***Rack off,fool.***",
            "And? Every sub will have posts you're not interested in.",
            "I had a \"Chibi-chan\" when I was a child although she was a shiba-inu, Akita, Pomeranian Heinz 57. She had more colors and textural variations in her coat than should ever be allowed on one dog. 🤣 But it worked for her. 🤷🏼‍♀️ My best friend from 6yrs old until I lost her when I was almost 21.  Still miss my bestest girl. 😓 ❤️ She will be at that 🌈 bridge when I get there. ❤️❤️☺️",
            "*I thought you were* ***NEVER,EVER coming back.***   *You obviously have a lying issue.*",
            "And I don’t want to see them, is that so hard for you to understand?",
            "That's why heaven exists. So we can be reunited with our dear friends and companions that have a shorter lifespan than hoomans.",
            "He leaves communities like this 3 times every day and gets strangely creative at times. I want behavioral scientists (if that's a thing) to see this.\n\nBut really.. why leave a subreddit as wholesome as this?"
        ]
    },
    "Came outside and found this guy. Skin and bones, but has a collar on. Gave him some tuna fish and some water": {
        "title": "Came outside and found this guy. Skin and bones, but has a collar on. Gave him some tuna fish and some water",
        "score": 5944,
        "url": "https://www.reddit.com/gallery/1dlk9uz",
        "content": "Very friendly but I hate to take a cat that has a collar. Would hate to steal someone else’s cat. Going to try to make him a bed on the porch and if he comes back again well he’s coming inside and that’s that. He’s just too skinny, if somebody owns him they must not care much about him. ",
        "num_comments": 254,
        "comments": [
            "https://preview.redd.it/gqttouxv318d1.jpeg?width=3024&format=pjpg&auto=webp&s=da36c54f1a58a51354ba8133db728e62dfc62e89",
            "Can feed him un seasoned scrambled eggs as well. Thanks for looking out for the starving dude.",
            "Someone threw him out or he’s lost. If you can keep him in a bathroom or somewhere please do and take him to the vet to scan for a microchip. If he’s super skinny don’t feed too much at once cuz it can kill them. Please help him.\nETA:google refeeding syndrome for information. He might not be that bad but best to be careful.",
            "He might be old, have health problems or be at his end of life. I say this because that’s what my poor girl looked like at the end, complete with fur that always looked messy and being skin and bones. It doesn’t excuse him being outside where anything could happen to him, but just wanted to reassure you that him being thin doesn’t necessarily mean anyone has been starving him.\n\nIf you’re really concerned, and if his collar doesn’t have his owners info on it, I’d recommend getting him into a carrier and taking him to a vet. If he has a microchip they can contact the owners, and they should also be able to tell you if he’s being neglected or if he’s just old.",
            "Welp he’s laid down on my porch and I’m sitting with him a while. He wants in but I’m afraid he might have fleas and ticks and stuff as like I said he’s got a collar on so not sure what the move here is\n\nhttps://preview.redd.it/95lff7ck318d1.jpeg?width=3024&format=pjpg&auto=webp&s=44244659e8d2daa6f933d2a6d49ac2bf204b8fb8",
            "You can also RINSE the tuna if tuna is the only option\nAlso you can add rice to the rinsed tuna as a filler, even instant rice is fine.",
            "A neighbor a block over adopted a second cat. The cats didn't get along so they put the newly adopted cat outside a lot to elevate the fighting. This poor little guy started wandering around the neighborhood looking for friendly people. It started hanging out at our house. I called the phone number on the collar and the people said, yeah that's our cat, but didn't seem to care where it was or how it was doing. \n\nIf I wasn't careful about how I opened an external door this little guy would find his way in. We'd wake up in the in the middle of the night to find this little guy sleeping at the end of our bed. I kept asking the owners to do the right thing and take the cat to the humane society to be re-homed, or try to find a new home themselves. They really didn't care. \n\nI just couldn't see this fellow living like this. We took him in. A few months passed and the people that adopted him first called to see if we'd seen their cat. And if we had could they come and get it. I said, no, I haven't see your cat, but I definitely have seen mine and he's happy here. Please don't call back. \n\nChances are this little cat is being neglected. The people don't care. If they did, it probably wouldn't be so skinny. Have your vet or local shelter scan it for a chip. If they can't id an owner put some fliers up. If nobody claims them, you have a wonderful new addition to your family.",
            "Chances are, that skinny, he got lost and can't find his way home.\n\nTake him in, have him scanned at the vet, and post to the local humane society/vet pages that you've got a found cat.\n\nHe may be abandoned, he may be lost and missed, and he may be so far or have been gone for so long that no one thinks he's still out there.\nBut he's definitely starving and in need, so I would take him in.",
            "That poor baby.  Thank you for taking care of him.  😢 That's really kind to take the time for him.",
            "You’re great for feeding and  making the bed for him. Maybe has a chip \nThere are places to post and maybe his owner is looking",
            "Older cats are often very skinny, even if they are well taken care of. It's just part of aging. It's difficult to tell the age of adult cats, as they don't go grey like dogs and horses, but if you are worried the best bet would be to take it to the vet to get assessed and check for a chip.",
            "Poor kitty. He/she is very undernourished. You're a good person for offering food, water and vet care.",
            "That’s how I found my tortie girl. I found her begging for love. And we live in a busy street. So I took her in. Took her to a vet because she had tape worms coming out her butt. Find out she had a chip. Contacted the owner and he said he had to give her to a friend she said she had to give her to her mom. Mom said she kept fighting her dogs so she threw her out. So sadly we are her 4th home. But we made sure she would never have to worry about going to another. She’s the sweetest girl ever. And to see her go from eating g food so fast and eating what ever to her knowing I found a home and I don’t have to do that anymore was the greatest feeling.",
            "He might be someone’s lost pet. Idk what kind of place you live in so no clue how likely that is 🤷‍♀️ but it’s my nightmare. My roommate got a cat which I’ve fallen in love with. But it’s not my cat so not up to me whether to let him go outside or not. I do try to keep him in collars and tags but he escapes from them on the regular. \n\nAnyway you are such a good person for taking in this poor kitty. Keep us posted on how he does! Such a cutie!",
            "He definitely seems like either a lost or abandoned cat, based how friendly he seems to be. If youve got some plain unseasoned chicken, you could boil some and give that to him. Chop it into tiny pieces and add some of the chicken broth to get extra liquids into him",
            "I have a cat just like that one. Very old and frail. Super skinny. Has a collar. Might be skinny cause he is old. Try to find the owners, the cat might be lost.",
            "I would take him in now, call the number on his collar. Then go from there. the kitty is obviously starving and its dangerous outside. \\*\n\nedit: my kitty Shrimpy just laid on my keyboard and added the \\* I think she wanted a footnote that she agrees to take in the kitty",
            "My cat is skin and bones but is fed well, doesn't eat well. He's 16 now. Every summer he drops weight like crazy, but he's always been thin. He's seen a vet about it a couple times, nothings wrong!?! And he probably eat the shit outta some tuna!!",
            "He’s lost. I recently found a kitty that skinny. He was such a darling and I took him in. No collar but just how sweet he was there was no way he was a straight up stray. He was crazy skinny- skinny like this. I fed him a bit (of course) and he didn’t feel well. Took him to the vet and he was chipped. He went home to his family\n\nVet told me he had probably been outside for a week and can’t figure out how to hunt so he starved. I bet that’s what happened to this baby. Get his chip checked (not all vets have universal chip readers btw) he is not necessarily neglected, he could’ve gotten out and can’t hunt for himself.",
            "Tuna might not be ideal, but it’s something for a hungry belly. You are a good person for looking after this little lost soul.",
            "Poor baby, thank you for looking out for kitty",
            "Consider giving this little one a safe place to stay tonight, instead.",
            "Bless you for looking after him. I bet he was dumped. Get him a flea treatment at the vet. He might have worms too. But very easy to treat, simple tablet.",
            "Having him checked for a microchip is great and a vet check. If he's ok and no one claims him, perhaps Sir Francis Bacon in his tux is your dude now?",
            "He might be missing",
            "No more tuna please. It's only good as a treat once in a great while. 💗",
            "If you are scared to \"steal\" him, tape a note with your phone number on his collar. My sister did this and realised the cat was actually her neighbor's 😂 if in a couple of days he returns to you without you getting a call, then he is most likely without an owner. Thanks for caring for him ❤️",
            "He might be sick, not necessarily abandoned so please do check around before you take him in. One of my cats died of cancer and he looked like this for his last 3 - 4 months when he was on palliative care. He was still eating and enjoying visiting our neighbours/ hanging out in the front yard, he just couldn’t keep on weight. This chap might also have hyperthyroidism - that can cause rapid weight loss and a poor coat/hair loss, even if they’re well cared for (the meds can be hard to get right).",
            "If he has worms of any kind, those will cause weight loss. If he has fleas, he might have tape worms specifically.",
            ">He’s just too skinny\n\nMy old cat has hyperthyroidism and looks skin and bones despite getting fed six times a day and has thousands in vet bills treating him.\n\nYou are assuming a great deal.",
            "Hes so skinny 🥺 thank you for looking out for him. He seems really sweet as you mentioned he wants in already. It sounds like its been awhile since hes had any sugar and could use some love. Please update us on him!",
            "If he’s old, he could have kidney issues.  It causes rapid weight loss.",
            "Definitely check online or with surrounding neighbors! Poor guy definitely seems lost, if they're that young and are very trusting and loving, they've usually wandered off from home and got a little turned around.\n\nI'd post online neighborhood groups about finding him! If somebody's cat is lost, people are usually there looking for them or posting about them.",
            "This has me heartbroken!! I’m so worried about my cat getting lost and turning out like this!!",
            "Oh, poor boy. Thank you so much for helping him. I know he was so happy to have food and water. hope you can find his owner and/or get him off the street. Can you give him shelter while you look for his owner. Thank you, again.",
            "Hi OP, you are a good soul to be caring for this little one. Along with the great advice already posted here, there is also a chance that this is someone's pet and has a home but is suffering from hyperthyroidism, and therefore looks malnourished. My cat was just as skinny when diagnosed before we got her on the right treatments. \n\n\nIt's likely that this probably isnt the case here, but just another possibility to consider. I hope everything works out well for the kitty",
            "All cats are wonderful, loving creatures,  but Tuxies are extra wonderful and loving. Many feral cats become wonderful little lovers, too. They need love and patience.. But, this sweetheart acts like he's had a loving home. Thanks again so very much.",
            "Something similar happened to me two years ago, I had the cat for a day than gave it to the shelter where they where looking for the owner. It does not necessarily mean the owner don’t care about the cat.\n\nThey said something like this happens sometimes, this could mean the cat either lost his way home due to illness, they traveled involuntarily in a truck or car long distances or the owner died and the cat was either outside or escaped (in case of a house cat)",
            "please please please provide a safe home for them if you can't find their home. Please. Help this one in a million that need help. ❤️",
            "Please keep him inside?  Its just not a safe world out there for cats... mostly because of cruel, ugly-spirited people.  \n\nOffer him some better nutrition if you can?  Tuna is yummy... just doesn't have what cats need.  And this little guy needs some nutritional help, safety, comfort, and love.  \n\nMind you, his digestive system might get a bit upset ( painful gas, loose stools, maybe even constpation ) with sudden food changes.  Ease him gently through his transition from emaciation... poor little soul.\n\nThank you for giving him respite from what must've been a very unpleasant past few days or even weeks ❤️",
            "Very cute",
            "He looks like he had vet treatment (maybe neutered) a couple of weeks back, going by the patch of shorter fur on his leg. He might be microchipped so see if you can get a vet to check that for you. If he is, well, he's clearly either got lost or the family weren't looking after him. If he isn't chipped, I'd say keep him - and get him chipped, registered to you. You're obviously trying to do your best by this kitten, thank you.",
            "Id recommend taking kitty inside and putting up flyers/posting on social media about a found cat.\n\nAlso have the vet check for a microchip.",
            "My guess is that he's a lost house cat.",
            "Just because the cat is skinny doesn’t mean they aren’t fed and cared for. I am saying this because my cat has thyroid problems. Her weight, dosage and appetite fluctuates like crazy. She is on an unlimited food diet. I take her to the vet monthly to get her bloodwork checked and her prescription adjusted. She once was 11 pounds and now hovers around 7 and looks as skinny as this cat. I get that it looks concerning but maybe try to track down the owner and have a conversation.",
            "His 'owners' are irresponsible AF.  Take the collar off and bring him in where he's safe inside, poor thing.  No cat should have to endure fleas and other parasites, dogs and other animals, dirty water, bad weather, traffic and mean people.  \n\nI recently saw a cat lying dead on the side of the road. Beautiful cat except of course for all the blood. I'm beyond fed up with imbeciles who allow their cats to roam all over creation with perils around every corner, placing their lives in danger. \n\nThis sweet tuxedo deserves better.",
            "He may have a thyroid condition. My old elderly cat had that and was outside all the time. Many a Karen would call me from the number in his collar tag calling me a bad cat dad for letting him outside and not feeding him then threatening to take him. He was the one of the best cats ever and prefers to be outside all of his 17 years",
            "Another possibility: he’s escaped from an owner starving him. Have encountered this with a few pets (mostly dogs, but a cat also). \n\nHad a cat move in with me who was too weak to jump on the couch. When the owner showed up he hid. The owner seemed anorexic and her kids had zero extra fat on them too. I kept the cat.",
            "What the fuck is with everyone encouraging you to keep the cat? People don't leave a collar on when they abandon a pet. Please look for the owners. It could be unwell or just lost.",
            "He could also be an outdoor cat just visiting from nearby. one of my neighbor's farm cat drops by often and my farm cats have their own route to visit places. \n\nTBH i'm not too worried about the weight unless they act starved. our farm cats are skinny like this, but they have an entire bowl of cat food left out 24/7 for them that gets refilled every morning and get actual meals in the evening. . They eat both sets of food.",
            "Tuna isn't great for cats.",
            ">  Gave him some tuna fish \n\nMaybe next you can give him some chicken bird",
            "Not all cats can eat fish. Just a heads up.",
            "r/notmycat",
            "❤️❤️❤️❤️🙏🙏🙏🙏",
            "Aww, poor fella. Thanks a lot OP. ❤️ \n\nCommenting so I can get an update on this.",
            "Thank you for helping him!!! God bless you",
            "Please take to the shelter if needed       or the vet for a check up",
            "You’ve fed him…. He’ll come back now ☺️",
            "Please take care of that innocent baby, OP! Much love!",
            "Call a vets and ask for advice on how to feed him, he may not be able to cope immediately with regular meals.",
            "I took in a feral Tuxedo cat a few years ago. She turned out to be the sweetest cat I've ever had. \nMind you she wasn't in this condition, but maybe this one will love even more for all you've done for them. \n\nWas the tuna canned, for humans? That's what I fed mine trying to get her to eat. Turns out that's not a great idea. I never knew Canned fish were so high in sodium. Reddit taught me that, so full circle!  Get some wet food for it. Doesn't have to be the good stuff at this point.",
            "Shes a girl",
            "Commenting for the update :)",
            "You’re a good person. ⭐️",
            "Put his pic up on your local town social media page. Someone may know him.",
            "aw bless him, thank goodness the are people like you about",
            "Don't feed anything salty.\nHave u had cats? Read up a little bit on the basics.\nGood luck with the baby, help it get healthy 🤗😻",
            "IT LOOKS CUTE",
            "If possible, give him multiple smaller meals a day. He might end up puking it back up if he gut loads. It takes a while for a starving animal to be able to eat normally without getting sick.",
            "Thank you for caring! He looks rough. Please keep feeding him. You could take him to scanned.",
            "You did a good thing but if you see a cat that is that malnourished you should totally stay away from feeding them canned tuna there are so many preservatives in canned tuna that it will destroy your cats liver or kidneys and there's many better things for them to eat anyways.",
            "Thank you❤️",
            "If he has an owner, its a shitty owner. They arent taking good enough care of him and even let him out in this condition. I wouldn’t feel bad at all taking him in. He deserves better",
            "He may be sick. I lost two of the most wonderful cats to feline AIDS. A trip to the vet will paint a clearer picture on your next steps. Good luck 👍🤞",
            "I found my black cat outside. She had a collar and was friendly. I had her scanned. No microchip. Posted online and posted flyers. No one ever claimed her. I've had her for years now and I don't regret it because I know I tried to find an owner for her",
            "Nice now some kid has lost his cat. Just feed him biscuits or take him to the vet to check for if chip.",
            "I wouldn’t feel bad about taking this cat -it is not being properly cared for.",
            "Thank you for rescuing this baby ❤️",
            "He could be abandoned if he's skin and bones, maybe because the vet discovered something that the Owner could not handle. But like the others suggested, we should bring him to a vet so they can check if he's microchipped and maybe find out why he's skin and bones because just the fact they are that skinny is not a good sign.",
            "I found a cat in this condition on my mail route. The previous tenants on the property abandoned her when they moved. Makes me so mad. Kitty still had her collars on so it appeared she belonged somewhere but she was just dumped. The new tenants were very very cool people and they adopted her and she’s looking so good now. OP, you should at least see if you can take Kitty into a shelter cuz if he wasn’t abandoned then he’s 100% neglected and they don’t deserve him.",
            "Put up some found signs or social media something. The owners are probably up all night worrying about their kitty not making it home. Older cats can be skinny like that even if they are properly cared for. It is very unlikely that a stray would have a collars and signs of a recent vet visit.",
            "Take the cat to a vet office to be scanned for a microchip.",
            "Yes. He’s yours now. If you really want to be absolutely sure, take him somewhere for a free scan for a pet chip. It’s super easy. There are so many cat-ownership stories that don’t involve evil people that DO end with the cat finding a needed new home. Take care of animals that show up on your doorstep. There’s no extra cost to forgiving anyone in their past who wasn’t able to give them a safe, secure life. Bonus points for building a cool back story for the kitty with a collar.",
            "2 things....the cat has a collar but was abandoned or has some shitty owners.  Eitherway, keep the kitty.",
            "all of the advice here is great! but i just want to add, if he is microchipped and the vets are able to get in contact with his owner, make sure that this little guy is actually going back to a family that wont neglect him because he definitely seems neglected if this is not a case of him having run away",
            "Check its collar and see if it's tuo tight",
            "you shouldnt feed him. he is likely con artist using clever tricks to get snacks and snuggles.",
            "That cat is yours now . Get friendly with them, take them to the vet, and let them live in your home.",
            "Congrats on your new cat!",
            "Unneutered males often run away for a month or so, and come back home skin and bones. If this is the case here, should one just feed him, in which case he may never go back home, or what? How far do these dudes roam?",
            "Keep him in until you know more he’s better off with you rather than outside",
            "you've been chosen",
            "As other people have said, please bring the cat inside.\n\nA luke warm bath with regular dawn dish soap will take care of the fleas, don't get it on the cat's face.\n\nThe cat might wander off, or become prey.\n\nBeing the cat inside!!! PLEASE!\n\nIt's so you shouldn't wait on because it might not be there when you go looking for it.",
            "If he’s an old kitty there are foods more appropriate for his age.  Purina makes some and if you can afford it, Royal Canin makes a food for cats 12 and up.  If he can chew kibble some of that will help keep his teeth clean.  You are a hero to that sweet tux.  I hope he is yours now.   I’ve been rescuing cats for years.   I once found the previous owners who told me they no longer wanted the cat, so they dumped it.  Most Redditors think a lost animal is from a loving home when many times it is not.",
            "This cat has been starving, and was most likely dumped by his owner. I hope he comes back to you. \n\nPlease be careful with feeding him.   There is a condition called refeeding syndrome that occurs when people or animals have been starving and then are suddenly returned to a normal amount of food. You have to start slowly with very small, very frequent meals that are actually a lot less than the daily requirement for a healthy diet, and then work your way up over the course of a few days  to a normal amount of food.",
            "Fuck that collar. Do right by that poor kitty. You are right. He’s far too skinny.",
            "Check its collar and see if it's tuo tight",
            "Oh man maybe escaped or abandoned but definitely was somebody’s cat.  Good for you for providing some relief.  Maybe the CDS has blessed with a nice tuxedo cat.",
            "Thank you for looking out for this cute lil guy! I’m so glad the cat distribution system chose you. I hope you decide to keep him and give him the life he deserves! :)",
            "Take him in. He could be lost. If not, then he's obviously not being taken care of.",
            "No tuna. Just cat food",
            "a collar means nothing these days dude. he has 100% no home and got dumped. he is so skinny and looks tired 😭 \ngive him some love and throw that shitty collar away. ❤️",
            "Matthew 6\nKing James Version\n6 Take heed that ye do not your alms before men, to be seen of them: otherwise ye have no reward of your Father which is in heaven.\n\n2 Therefore when thou doest thine alms, do not sound a trumpet before thee, as the hypocrites do in the synagogues and in the streets, that they may have glory of men. Verily I say unto you, They have their reward.",
            "Does the hair on one of his legs look shorter like it was shaved not long ago? If so then he was likely at a vet recently and has an owner somewhere. He really shouldn’t be outside in this condition though, he’s likely to get hurt. But maybe he’s an old cat set in his ways and his owners are just letting him do what he likes. Worth grabbing him and having him scanned for a chip. Maybe he was supposed to be inside but escaped.",
            "Poor skinny baby 😭 he looks like he’s enjoying his little box though!",
            "He looks like he was recently seen by a vet. I bet he’s microchipped. You can take him to any vet and they’ll check for you :)",
            "Aww he definitely was somebody’s cat at some point.  I’ve fed and rescued hundreds of ferals and they don’t instantly curl up like that",
            "he really likes his box. he fits into it like it was meant op for you to see each other. i hope he can be yours because he trusted you enough to ask for help. otherwise he would have gone to the other houses in your area and not yours. thank you though for helping him and please do bring him to the vet so he can be checked by the vet. may you have an enjoyable moment with the cat. :)",
            "haha",
            "❤️🐾❤️🐾",
            "I’m a single dude, don’t have any eggs either lol. Didn’t know that though, thanks for the tip",
            "Bruh why would anyone season an egg for a cat lol",
            "I assume this only applies if you don't use milk in the scrambled eggs?",
            "U suggest egg instead of canned wet food for a starving cat? 😂 okay.",
            "Going to wait a day and see if my neighbor knows something. He once told me years ago when the previous tenants moved out they dumped a bunch of cats there and I vaguely remember him mentioning a black and white one. But if that’s true the poor guys been outside for years. If he has nothing to tell me I’ll bring him in to my guest bathroom and then take him to the vet to check for a chip and get him fixed up. At the very least I’ll make sure he’s got food and water if he wants it. Nothing ticks me off more than people who treat animals like this. He’ll be taken care of one way or another. And I’ll be googling that, but I don’t think he’s deathly skinny just quite a bit underweight. He took breaks from eating too and he hasn’t ate all of his tuna yet so hoping he’s alright. Thanks for the advice and information!",
            "Seconding this, he is or was definitely someone's pet",
            "Second this, if you can somehow keep him safe for the night while you put out feelers online/tomorrow, it would be best for the kitty. But I totally understand your concern for fleas/ticks on him and bringing that inside :/",
            "And needless to say, tuna should be a rare treat. It’s not really that good for kitties.",
            "Replying to my own comment to say that cats with kidney failure (like my cat, Baby, had) often look like this at their end of life. They just end up unable to keep weight on, despite eating normally. So please take this poor cat to a vet, as the vet can figure out if he’s suffering or not.",
            "So very true. My (by all labs healthy, plz) 17 yo diabetic cat looks and acts like an ambulatory furry-adjacent gargoyle. I’ve lived with cats that look just like him that have many years left hidden away in their back pockets. No matter what- the universal rules are: if a living being lands in your porch, give them food. Listen to their story. Ask how you can assist, if help is wanted.",
            "I can’t believe I had to scroll this far down for this comment. All of these replies encourage OP to take the cat as their own, when it could very likely be a beloved pet at end of life. Imagine the pain of the owner who just spent money on bloodwork to check their cat’s health, potentially received bad news, and then their cat got loose. I’d be distraught if my senior kitties escaped.",
            "Seconding this, one of my babies lost a lot of weight near the end too even though she always had food. I'm hoping he just got out and can be reunited with a responsible family.",
            "This this this! My baby girl looked so scrawny in her last year and that was before she got the cancer that took her. She was happy and well at that time.",
            "Can you keep him in the bathroom? He might be lost or abandoned.",
            "He is a beautiful tuxedo!! Hope you can find the owner or a home for him!!",
            "Dude. Take him in. Give him a bath if he'll let you. Mild shampoo will kill the fleas. Get him checked for a microchip. You may have a new buddy if you can't locate the owners. He looks like a keeper!",
            "Totally understand the parasite fear! Do you have a plastic carrier, or another hard container like a plastic bin or cardboard box you could entice him into with food? You could quickly transport him to a spare bathroom if so; fleas and ticks (to my knowledge, though google or someone could correct) need soft or living surfaces to thrive, so you’d be very much minimizing the risk there. \n\nAnd if the above isn’t possible, you’ve still done a great thing by feeding and paying attention to him! Contacting a rescue during daytime hours (also consider private rescues if they’re in your area, since government funded ones probably aren’t open on the weekend) could give you a good lead towards solutions or resources. \n\nGood luck, and thank you for loving on this guy! Ignore any hateful comments you may get (or try your best to), you’re doing what you can and clearly have a kind heart ❤️",
            "Oh yeah… this little guy just found his new home 🥺 cat distribution system at your service",
            "His ears are intact so he hasn't been brought to any vet by another person and listed as a stray.  We had a stray cat come by over a month and we fed it.  Decided to finally take it into the vet and they fixed him, gave him flea and tick treatment and then they clipped the top of one of his ears so that if anyone else found him outside that would let them know he's a known stray and been treated and fixed at the vet.",
            "He’s adorable",
            "Take him in an train the little dude. I once trained my cat to bring me money instead of the mice she use to leave at my doorstep. I received plenty of payments from the cat after that but it was stealing it from other people. Not good. I guess you could say it was an operation but I just trained her. I didn’t know the consequences it would have. People started missing their money and then I would hear about it later on.",
            "If he trusts you enough, maybe you could tape a note to his collar? If no response, have him scanned at a vet.",
            "Cat fleas can't attach to humans. Sure they could infest the house and reattach to the cat, but it never happened to me. \n\n\nTicks on the other hand are quite easy to find and kill.",
            "As someone pointed out, the shaved leg means that likely he has been to the vet quite recently. Of course he has thereafter been outdoors for long enough to catch ticks, but ... less chances of being a wandering bioweapons lab. \n\nSomeone is missing their tuxie.",
            "this is a really good tip. as someone else said in another comment, you have to be careful not to feed them too much at once or it will really hurt the cat. there's articles about what can happen if you search \"refeeding syndrome\". I had to be careful about it when we got my lost cat back inside after 2 weeks of being lost",
            "I love the response to those former pet parents…",
            "One of my cats came from a family that loved kittens, but not cats, and def not spay / neuter vet bills. So they’d collect a handful of cute babies and then set them outside when they got to the age where they needed vet care. The thing is, in many cities, if you report a cat as found homeless but say you’ll adopt it if it’s unclaimed after the 3 (ish) day waiting period, you’ll get to adopt the cat for a fee massively lower than the veterinary cost of vaccinations and sterilization. And the people involved in providing the free vax + spay / neuter service absolutely understand exactly what’s happening. Animal lovers look out for each other.",
            "This was how we got my first ever cat before i was born! My dad loved to tell the story.\n\nThere was a real cat hoarder lady that lived next door, had the cats outside all the time (way more common in the uk where we are but still), never properly looked after them because she had so many. My parents used to put food out for the birds and the cats would come to try to eat the food, so my dad would run out and scare them off. They would all run apart from one, this little tabby girl. My dad couldn't go anywhere in the garden without her trailing around him. She would sneak into the house umtil they heard happy purring and clock that she was there. If you so much as gestured near your lap while sitting she would hop up for cuddles. They had told the lady before that the cat would try and enter the house sometimes, but she never asked after her or check in even when the cat wouldn't show for feeding times.\nSo the lady next door was moving house and came by saying 'oh i think I'm missing one of the cats, have you seen her?', to which my father just replied no.\nShe was happily asleep in the house in her favourite spot again. The lady didnt even leave a contact number for if they did see her and left so you know.",
            "Yes, please make a good faith effort to find out if he has owners. People who put collars on their cats usually care about them so he could be sick or lost.",
            "Yep, this. My 14 year old boy has hyperthyroidism, is medicated, eats like a horse and has regular check ups but is as skinny as a rake!",
            "Maybe blood tests were done. My kitty is on thyroid treatment and gets shaved on his neck or leg for his blood draws and loooks skinny like this despite meds and food to his hearts content.",
            "Well said!👏",
            "These people are profoundly stupid to just tell OP to keep the cat. My cat was dying of kidney disease but lost a lot of weight. I would have been devastated if someone took away my cat that I needed to get put to sleep soon. Took away those last moments with my little guy I helped be born. \n\nPlease people, encourage OP to take it to see if it has a chip or is known at the vet. This could be a dumped cat but doesn’t HAVE to be. And the cat also isn’t necessarily abused. Please do the right thing",
            "we had many outdoor cats too but they always ate enough and never looked like this little guy.\nif all your farm cats look like this, you might consider buying a different brand of cat food cause there might be something off with your current one.",
            "They might have worms or another parasite that is absorbing their nutrients.",
            "But still some of the best things one typically has at home I think if you don't have any cat food at hand.",
            "Canned tuna in brine is a problem, but if it’s in water then it doesn’t have extra sodium.",
            "Also. Cat tax.\n\nhttps://preview.redd.it/0e22waflc48d1.jpeg?width=3472&format=pjpg&auto=webp&s=80a6c7b3080c4773416cac5778a46e9d6001e57e",
            "People dump their pets with a collar all the time. \n\nWhat was the sign of a recent vet visit? I don’t see that mentioned in the OP.",
            "Or, yknow, ran out the door while the owner wasn't looking, got lost.",
            "Didn’t have any. Know it’s not great for cats to eat regularly but figured at least he’d have something in his belly. Going to maybe get some cat food tomorrow",
            "There can be so many things happening to them to get lost. When I was a child mine got lost twice after we moved when I found her she was sitting screaming in some corner, but I was able to carry her back home. Just taking someone's cat is awful, at least try to find the owner.\n\nHaving the option of either locking them in or people stealing them is a really shitty choice.",
            "1. King james version is the most edited filtered version of the bible tainted by the selfish desires of people that exists. \n\n\n2. This guy is posting the cat and it looks like mostly taking advice on the best way to handle the situation. Read the room.",
            "I'm both too high and not high enough for what I found in your profile. Lots of cat content, and random religious content. But also a post in the psychosis subreddit.\n\nYou OK?",
            "Here a man is actually doing good in this world, and then you come along, speaking brainwashed without any substance in your message.\n\n\nIronic, and sad ",
            "I saw the same - he definitely looks like he had his leg hair shaved at the vets.",
            "Great observation.  I agree. It's grown out a bit, too.\n\nCrazy guess:  this is a loved pet.  Back from the vet and they were on some strong medicine and got confused AF and got lost and ended up far enough from home that they couldn't find their way back.  Cross fingers for a microchip.",
            "He could be lost! Def worth seeing if he’s owned or if his owner is looking for him.",
            "We had a cat show up to our porch with absolutely no hair on his stomach and declawed. I thought it was a female who had her belly shaved for a spay or some other surgery and escaped the vet. Took it to our vet and they scanned a chip. Turns out the poor (boy) cat was dumped by his creep owners, and so stressed out he had licked all his belly hair off. Please don’t assume the hair loss is a good sign (I hope it is in your case though). Also we kept the cat and he was the most loving, affectionate cat we’ve ever had.",
            "Owner release him because he can’t take care of it anymore. Happens a lot more than you think. The word isn’t butterflies and rainbows.",
            "senior cats can look like this and still be well-fed. As cats reach 20+, kidney or thyroid diseases are extremely typical, causing a lack of retention of fatty tissues (extreme oversimplification).\n\nThis cat is probably quite old, and definitely a lost, loved family pet.",
            "He looks so cosy now 😮‍💨 and hopefully finds a loving home 🤞",
            "You know what, I have an idea, my library lends out tech thingies like fitness trackers and stuff, why not have RFID scanners at the library?",
            "Is there a 7-11 or gas station nearby where you could get a couple cans of wet food?",
            "You don’t have eggs? What do you eat? Single men, for real, lol. How do you guys get along in life?",
            "Thank you so much for taking care of him!",
            "He's probably a 2-3/9, as a body condition score (5/9 is an ideal weight, 1/9 is extremely underweight/emaciated). I'm not a vet professional but work with animals, you can look up a chart to compare yourself. I typically reference against WSAVA standards.\n\nThank you for taking care of this sweet boy and doing what you can for him. It's not easy but his little life will be much improved by your kindness.",
            "Aw dude thank you. You have a big heart, which is rare outside of this sub.",
            "You're such a decent person. He's pretty skinny and probably malnourished. A bit of tuna, water and some cibbles will do him good ❤️",
            "Thank you for being a good human. ❤️",
            "Appreciate it you taking care of him! Looks like the cat desperately needed some help!",
            "You are a true hero!",
            "get him some proper cat food instead of tuna. it's great to give him something to eat, but too much people food will make him sick.",
            "Some cats just don't keep weight as well. My kitty was 24 at the end and was so much skinnier than this. I always had food out for her, and she got her food changed out every 2 hours because she didn't like old food lol. But at some point it just didn't matter. All I'm saying here though, is if that's someone's indoor/outdoor cat, could still be loved and cared for and still look like that. Please at least attempt to find the owner before you take them. I'm not a fan of indoor/outdoor but if my cat has just disappeared I would have been heart broken.",
            "Please update us on this little guy! You're awesome!",
            "Whilst you're waiting to get to the vet to see who his owner is (A - assuming he's been microchipped +B -Owner info is up to date) please try to feed him proper cat food as hunan tinned tuna fish won't have all the nutrients a cat requires & I think I've read somewhere that tinned tuna isn't good for Kitties for a few reasons...apart from the lack of required nutrients. Short term it won't harm a cat, but cats must have taurine in their diet or it can cause life-changing & potentially life ending complications (we're talking longer term feeding, not for a week or so!)\n\nIt's wonderful you're looking after this sweet baby and are being responsible by checking your local area & socials for a missing tuxedo cat and taking him to vet, etc. Just a thought-if he does have a family Who've been missing him and are greatful to be reunited, why don't you consider rescuing a.cat from your local catchanty/shelter",
            "Keep that boy the owners aren’t looking after him very well.",
            "Or he was at one time. Maybe he’s now in need of a home. Please continue to be his saving grace.",
            "This cat looks super similar to my senior boy who passed away from kidney failure. He was super skinny when I adopted him (he was 10) and the vet said he looked like he had been big in the past but now was skinny. Also his coat got a lot shinier and healthier once I got him on medicine for his thyroid. All old cat problems but the vet should be able to help some! Hes precious!",
            "when i first saw the post as i was scrolling i genuinely thought for a second that it was my cat who died of kidney failure, he was also a black and white boy who was skin and bones at the end! but he had a last few weeks with us, and the thought of that being taken from someone who loves him is devastating",
            "Dawn soap.  Unless you have a proper pet shampoo, it’s better to wash cats with Dawn dish soap as there’s nothing toxic in it for them to lick off their fur.  Put a ring around the neck to keep any fleas from crawling up towards the face when it’s being bathed.",
            "Also, canned tuna for humans has way too much sodium for cats to eat regularly",
            "I wasn't attempting to specify what treatment he had, just pointing out that a vet visit might have included microchipping and that's the first thing to check.",
            "Exactly! Somebody will be at home worried their cat is dead. Also who knows if it should be medicated",
            "Damn, not where I live. \n\nCheck out the other comments for reference on the vet visit.",
            "Make sure he has extra water as canned tuna can have high sodium levels",
            "> Know it’s not great for cats to eat regularly but figured at least he’d have something in his belly\n\nAnd you would be correct. For a starving cat tuna is way way better than nothing. Too many judging cat people here who nitpick people who are just trying to help. Long term he needs commercial cat food as pure muscle meat doesn't contain lots of important elements that a cat needs. Short term, canned tuna in water is fine.",
            "Jesus is still Jesus is he not? Yes. He is.",
            "Say that to Jesus. Nope didn't think so",
            "Could alternatively be from previous over grooming that spot?",
            "Could be chewed off from stress. Stress from being abandoned or getting lost maybe?\n\n\nI had a cat that was really nervous and started doing that. She was lick at one spot until all the fur was gone. Thankfully she got over it, but for a few weeks she looked terrible.",
            "Not at all crazy, that guess. Cat has a collar and someone has recently paid a vet bill for him.\n\nCat has wandered off. Maybe dizzy, maybe pissed off over being taken to the vet - or maybe just doing his usual routine and being too tired to get himself back home. \n\nSomeone is missing their little tux.",
            "[deleted]",
            "Definitely a Great observation. I agree as well",
            "Absolutely He could be lost! Think exactly the same",
            "Ty we have an elderly cat and she is fed anything she wants whenever she desires but she is skin and bone.",
            "Yes my in-laws' family cat looked like this at the end. Even on thyroid meds, he was so boney. This could be a beloved senior cat.",
            "My first thought as well. Once some cats hit a certain age they lose a ton of muscle and fat no matter what they eat. This could very easily just be an old gal/guy who got a little too far from home and got confused and lost",
            "Vets in my area are happy to scan missing animals and make contact with the owner. Hopefully the same applies here.\n\nAnd given that library items are also tagged with RFID, the thought of passing a cat over the self-checkout machine did make me chuckle! If only it were that easy.\n\n[Edit to remove superfluous detail]",
            "Unfortunately most pet chips are proprietary. No pet scanner will even read all chips, sadly. I was told that my chip isn't very common out of like a three hour radius of me - 500 ish miles? - as it's a local company, but in that three hour radius it's the most common chip. Weird.",
            "At least in my area, the vets will typically check one for free.",
            "I'm a woman living alone, and I generally only have eggs at home if I plan on baking something or on the off chance I need them for cooking (which is rare). And I cook quite a lot for myself.",
            "Judging by his username, he just eats bacon and weed all year long.",
            "When I was single I grilled a steak almost every night.  Never had eggs in the fridge though.  Or leftover steak for that matter.  Maybe some squash or broccoli.  Lots of different hot sauces and beers too.  Eggs were best left to Denny’s.  A homeless cat would have necessitated a shopping trip, but I did okay!",
            "Mickey D. Bags thrown out windows. :D",
            "Gas station egg salad sandwiches and Bachelor Chow. But it says on the bag it's not rated for animal consumption.",
            "Im single and dont eat eggs either but I have an allergy to them haha. Basically just stick to eating cereal and oatmeal for breakfast.",
            "I don't love eggs and I don't use them to cook anything. Why would I have eggs?",
            "I never had eggs when I was single. In general they're ok, but I could never get through a dozen before they went bad and the half dozen was overpriced. ",
            "I don't get why you were downvoted lol. Respect to this guy admiring he doesn't have any but I can't imagine not having any food to cook with, especially eggs.",
            "Yeah, I can't imagine not having eggs on hand. I even have powdered eggs as backup.",
            "Can you link a chart please? Or explain to me what it means. I don’t understand well. My kitten is very skinny but eats a lot more than suggested.",
            "This cat looks like it might have urinary issues to me",
            "wonderful human",
            "There are 236 comments. How about you just tell me what the evidence is of a recent vet visit. \n\nPeople often don’t bother taking off a cat’s collar before dumping them, unless the collar has identifying information that leads back to the owner. People dumping or abandoning cats aren’t usually thinking about anything other than not wanting the cat anymore. I don’t see why this would be a regional thing.",
            "Got it. Put out a bowl of water and I’ll check it in the morning to make sure he still has plenty of water",
            "And maybe you should take his advice about he who is without sin shall cast the first stone.",
            "I sure can. Be well and don't lose yourself even more!",
            "*Shouting* “Hey Jesus, this guy’s message was ironic and sad!”",
            "Maybe but it goes all the way around evenly, and looks very straight edged",
            "CDS comes after checking with your local community, local facebook groups, and a vet visit.\n\nDon't take someone's cat without checking those three exhaustively.",
            "Why do people here encourage stealing of other peoples pets so often? \n\nDude has a collar, is showing body language of a well-socialized cat and noticeably has seen a vet a while ago. That cat is quite likely loved. You can put up flyers, make a facebook account and post, at least try.",
            "Its got a collar? It shouldn't be outside but stop encouraging people to steal pets",
            "This is stupid, why not put the NFC instead, so anyone with a more or less modern phone can just put the phone next to the cat and have a link with the owner info pop up?",
            "this is wholly wrong you can read them, the registration info is just in there database.",
            "[removed]",
            "I see nothing wrong here.",
            "I've had air fried steak sandwiches every day for lunch for a month now. They have $3 half pound sirloin steaks at the local grocery store. I also have them for dinner sometimes.\n\nI also lost 20 pounds in the past two months",
            "At least they’re getting meat! And some veggies? It counts! It counts?",
            "Yeah, I don't understand the fuss either. I eat eggs and I use them for cooking, but sometimes I don't and it's very easy to go without them. It's not like there's no alternatives. \n\nThe only thing you cannot go without in the kitchen is water, everything else has an alternative.",
            "Reddit being Reddit! I didn’t mean it in a bad way. Just truly perplexed when I hear stories of single men and how *some* of them live. I said *some*, Reddit, relax!",
            "Has it been dewormed? A kitten having worms is *very* common (they can get them from their mother), and that would cause them to be skinny despite eating regularly.",
            "How old is your kitten and how long have you had him? It might be normal good appetite for a growing kitten. Has he been checked for worms?",
            "There are 236 comments. Why are you responding on mine with 0 upvotes?  My comment was for OP. \n\nIf you found a friendly stray animal, you would not put up signs looking for the owner before keeping the animal? If that's your thought, then definitely a regional thing",
            "You saying I'm Jesus? Lol. Nope. I'm not the Antichrist either. Nice try \n\nMatthew 24:23-25\nKing James Version\n23 Then if any man shall say unto you, Lo, here is Christ, or there; believe it not.\n\n24 For there shall arise false Christs, and false prophets, and shall shew great signs and wonders; insomuch that, if it were possible, they shall deceive the very elect.\n\n25 Behold, I have told you before.",
            "This cat is absolutely malnourished and definitely needs help. And should under no circumstances be left on her own, ffs. \n\nOf course op should try to look for an owner. \n\nWhat makes you think he/she won't ?",
            "the goal isn't to make a product that's as good and useful as they can make it, it's to get **p a i d**, if they can make more money by making the thing they sell shittier they will do that about 99% of the time",
            "Because then they wouldn't make any money off their proprietary readers, or the licensing for their proprietary reading software for pet chip readers, duh. ![img](emote|t5_2qhta|7958) Want to do stabbits.",
            "And then you can use cats to unlock fighters in Smash Bros!",
            "yep you need a reader but you can get the chip ID readily. not sure what the conspiracy is here. \n\nbut if you get the ID, you still wont be able to find the owner because (at least in europe), we have data protection laws",
            "Home Again is not compatible with many of those. Home Again has its own database. Home Again is *not* the only company that does this.\n\nThere are currently 22 separate pet microchip databases in the United States, and over half of them are completely isolated from any other.",
            "If you’re trying to lose weight, that’s great!  If not, those steaks have little fat.  Add a baked potato with butter and a vegetable of some sort for fiber.  You can do both in the microwave.  I’m not sure if you’re a starving single guy, just looking out.",
            "I am a man, and even I am perplexed by other men at times... so don't sweat it. (Maybe I just enjoy cooking?)",
            "Yes. We, as a society, need a better understanding of the difference between industry and business. They are two different things that capitalists want people to conflate as two necessary parts of a whole, but are actually frequently in conflict.\n\nIndustry is the process by which we make stuff to satisfy needs. It is a cooperative social process, an effort to satisfy needs as efficiently as possible. Its goal is collective well-being.\n\nBusiness, on the other hand, is about extracting profits regardless of whether needs are satisfied or not. This goal often requires sabotaging industry. For example, paying unlivable wages to actors and writers. The money that would have gone to the industry to produce more, and better, movies instead goes into the pockets of capitalists. Business makes the product worse and the workers worse off just to give more to the people who already have the most.",
            "readers are readily available. they contain an ID and that's it. they dont report the owners' details (thankfully!)",
            "Home Again subdermal RFID tags are readable by any low frequency RFID reader, they do not have any security.  \n\nLF RFID does not and cannot have any proprietary reading protocol. That would violates FCC protocol and would be a felony.\n\nIdk where you got your information, buts it’s wrong.\n\nSource: I’m also a ham.",
            "Thank you for the info, but I'm fat. I lost weight by limiting myself to 3000 calories per day",
            "Thank you for the info",
            "I think we make for a better society when we make an effort for those two things to converge. It’s okay to want to make money, but it shouldn’t be at the expense of the overall wellbeing of others. You’re not obligated to make a product that’s compatible with other products, but when it’s an important item like a microchip, you should feel the duty to make it easier for people to find their pets.",
            "This is what my vet said too. Also while you can continue to pay the subscription, they never erase the information. \n\nOur local PD has a pet rfid scanner that’s pretty generic. Seems to work fine 🤷🏻‍♀️",
            "the problem is that the whole thing is set up to make the maximum possible amount of profit right now, all other priorities are secondary. any company that isn't doing that to the best of their ability is basically showing their belly to their competitors, who probably don't have the same scruples"
        ]
    },
    "Anyone know why my cat sits like this?": {
        "title": "Anyone know why my cat sits like this?",
        "score": 2402,
        "url": "https://i.redd.it/b9xsdny6128d1.jpeg",
        "content": "He’s not the fanciest of cats posted here but he consistently tries. ",
        "num_comments": 293,
        "comments": [
            "He is a distinguished gentleman",
            "He is fancy boy who sits with elegance and grace",
            "https://preview.redd.it/mmbka67x428d1.jpeg?width=3024&format=pjpg&auto=webp&s=470a3f06093a0ef4a34a9f7e7e3d33945f558b48\n\nPennys not allowed on the table so…. Ya…",
            "https://preview.redd.it/qxhdipbtq28d1.jpeg?width=1284&format=pjpg&auto=webp&s=45b54098a91827c60001b2a2eabd2e6a5783b059\n\nThis is how they show they think they are on the top of the food chain in the house.",
            "Because he is from the high society",
            "https://preview.redd.it/e4q3teany28d1.jpeg?width=3024&format=pjpg&auto=webp&s=00c235b302a24e3ce9b1939636c0cd9feb32dbbb\n\nI also have a fancy cat 😌",
            "He’s showing he’s a king and that you’re his subject",
            "Mine loves to sit cross-pawed.  Especially when I hold him, he'll lay across my arms and cross his paws.  It is adorable.  Glad to see other kitties do the same! \n\nhttps://preview.redd.it/mvno1mikt28d1.jpeg?width=3024&format=pjpg&auto=webp&s=d192649ff70252ebf074a7f02809c09b798adb97",
            "Because he's fancy.\n\nHere's Prince Appa with the side eye.\n\nhttps://preview.redd.it/wpx4hk2yx28d1.png?width=1080&format=pjpg&auto=webp&s=f751a2750a373800efa68d29684c0eed11eecce0",
            "https://preview.redd.it/64h6n9zu438d1.png?width=733&format=png&auto=webp&s=16000e2eada4cd159c0be8f3a2e4dd1163fb9d7f",
            "Your cat is just practicing for their catwalk debut.",
            "For our female kitty we call it Princess Paws.  She just likes showing off how perfectly regal she is.  And we are her devoted subjects.\n\nYours is a true prince, so it's Princely Paws.  Bow to his highness and enjoy bathing in his regal light.",
            "https://preview.redd.it/sc4bykv0a38d1.jpeg?width=3024&format=pjpg&auto=webp&s=ef9e5a69162e404046ca93966d126183b42e5f5b\n\nSteve does this too. I call it her interview pose",
            "Yes! It’s because he wants to be taken seriously",
            "They sit like that when they contemplate how they’re going to eat you.",
            "https://preview.redd.it/8tk5wdnhz28d1.jpeg?width=3024&format=pjpg&auto=webp&s=e2b43e8c2083898270827eeb3398c9cc3816ad2c\n\nBecause they’re an impeccable gentlecat.",
            "https://preview.redd.it/y7l02nko838d1.jpeg?width=1200&format=pjpg&auto=webp&s=cc96ee3ea18d57184c5493dca2fc675d9e9066f6",
            "While the gentlemanly demeanor of cats might seem purely anecdotal, there is some scientific reasoning behind this behavior. Crossing their paws can be a comfortable resting position for cats, allowing them to evenly distribute their weight and remain poised for action. It also showcases their relaxed state, indicating that they feel safe and secure in their environment.\n\nFrom ancient Egypt to the modern living room, the tradition of the gentlemanly cat has been a fascinating and enduring part of feline history. The simple act of crossing their paws is more than just a cute quirk; it is a testament to the elegance, grace, and timeless charm that cats have embodied for millennia. So, the next time you see a cat sitting with its paws crossed, remember that you are witnessing a small but significant piece of a grand and genteel tradition.",
            "Bossy pose. 😻",
            "He thinks you're of age to get the talk about the birds and the bees.",
            "https://preview.redd.it/76hku1y7r38d1.jpeg?width=2035&format=pjpg&auto=webp&s=ef2205b73fef387c8e8d0c1ed915c7678581c324\n\ni don’t have any answers for you but my cat does it too. i refer to it as him posing for his linkedin profile pic.",
            "He is thinking about his newest paper for this year's academic conference. If you still have a sense of responsibility for human progress, stop disturbing him anymore",
            "https://preview.redd.it/wjat2iquf38d1.jpeg?width=2405&format=pjpg&auto=webp&s=3595b428699fb0562c13eaa2d2417c8ae916ce12\n\nMine did too.",
            "https://preview.redd.it/cjmcu7bmz28d1.png?width=1080&format=pjpg&auto=webp&s=2d9d60c7fe4298833511b27d6c5ba1eb533b2f5c\n\nMine too 😂",
            "https://preview.redd.it/tf7hlm2rq38d1.jpeg?width=960&format=pjpg&auto=webp&s=ee2fe37db7abd8275cbaae64e7b607caa7d779bb\n\nI call it her \"pretty girl pose\"",
            "Now see him faboulous.",
            "Because he has proper manners and was raised well.",
            "r/politecats",
            "That is the observing and judging pose.",
            "Yours must be an interesting cat.",
            "He’s disappointed in you.",
            "They're judging you. Lol",
            "He sits like that because he's cool and he's a gentleman",
            "Comfort and Style.",
            "It's a.. Sophisticat!",
            "he fed up with your shit",
            "He needs to talk. Have a seat.",
            "Because you’re about to be lectured.",
            "Dapper dude\nPrissy paws\n\"We need to talk\"",
            "He is about to make you an offer you can’t refuse",
            "He’s a material boy. Or he has to pee all the time.",
            "He’s a professional little guy",
            "Maybe he's just tired of your shit, Bob.",
            "They are sophisticated, duh",
            "my cat sits upright a lot",
            "He does the same thing as my deaf chihuahua",
            "Why are all the cats so freakin cute",
            "His wry smile 🥲",
            "Just fancy!",
            "Gentlemen! Gentlemen!",
            "He means business",
            "He looks a bit like this Austrian painter",
            "Why? Because we fucking can! Because we fucking can, and if we can, we do.",
            "He wants to have a serious conversation with you.",
            "A Good Sir 😌",
            "😍😍😍😍 i LOVE IT",
            "Because your cat is the judge",
            "Hahah",
            "he is pondering",
            "They're just judging you.",
            "Because he wanted a Reddit post 😁",
            "Cuz they are classy AF",
            "Judging you  ;)",
            "He has a riddle for you",
            "He’s waitng for your explantion on why food was two minutes late.",
            "The most interesting cat in the world",
            "Haha one of my dogs always sits like this💖😂",
            "He's Aristrocat",
            "He's mirroring",
            "he awaits the manager",
            "He's a very distinguished gentleman",
            "Comfy",
            "You are being judged!",
            "Cause he's cool mfer.",
            "He’s some confuse 😁",
            "My cat recently started doing this. He also looks very much like yours!\n\nhttps://preview.redd.it/7ahvqh2xd38d1.jpeg?width=1707&format=pjpg&auto=webp&s=987aad913b818bea7a55a6d4bbe8c15243d00611",
            "It’s comfortable",
            "Because it can?",
            "He’s wearing a tuxedo, what did you expect?",
            "Oh honey, he’s silently judging you and plotting your punishment",
            "The easier to judge you with.",
            "It's called proper etiquette. He's holding himself like a proper high class member of society.",
            "Because cute :)",
            "https://preview.redd.it/kivhub6gk38d1.jpeg?width=3024&format=pjpg&auto=webp&s=b2217c38ab313a20b5e418b4996afe01dd0ad79b\n\nBite loves to sit on my shoulder",
            "What a handsome gentleman! Came out of the womb with a tuxedo on!!",
            "Distinguished gentlemen right there",
            "Because he's been expecting you for some time.",
            "He gave hints. Personel has to feed and cuddle and now he patiently waits. Kind like that man on Caddyshack.\n\n![gif](giphy|HQRgg6ks7nkyY|downsized)",
            "Wow finally. Non voids sitting sophisticated. I’ve never seen a non void sit so politely.  They are just waiting for you to have a nice conversation with them.\n\nhttps://preview.redd.it/ijyptih3r38d1.jpeg?width=3024&format=pjpg&auto=webp&s=410d9ab8ddfba741a9cced6eb7d1d0d6fa42d402",
            "https://preview.redd.it/4bucor6jt38d1.jpeg?width=3024&format=pjpg&auto=webp&s=5fef0d12ace9b37a9a58cd81792270890fb7f543\n\nSame tbh",
            "He wants to have a casual conversation with you",
            "https://preview.redd.it/idayhe71448d1.jpeg?width=3024&format=pjpg&auto=webp&s=0ccc1f771209debe916536db139f661a25a2b0a8\n\nMy cat sits like this 🤷",
            "Looks like it’s time for your performance evaluation!",
            "Aristocat",
            "He seems fancy to me… he’s wearing a tuxedo!",
            "He’s thinking of an offer that you can’t refuse.",
            "Gangnam Style",
            "Its either out of love for you, or he has some form of neurological issues",
            "He is comfortable.",
            "hes a bond villain",
            "It’s comfy.",
            "Killer chillin",
            "Most polite boi",
            "He needs you to sit down for a serious discussion…probably about feeding time, treats, playtime, or pets.",
            "KITLER! Damn autocorrect",
            "He is a fine gentleman.",
            "cos that cat is badass duhh",
            "sas, elegance and pazzaz",
            "Your kitty is very Regal",
            "Your cat is expressing his dominance on your house in a sophisticated way. He is now the big boss of your house. He’s the top cat. He is now a distinguished gentleman who sits in a formal position.",
            "I like those folded arms, it gives the cat a look of authorit.",
            "Because he's a gentleman",
            "It’s time for a meeting obviously !",
            "It's a posture of class",
            "He’s judging you",
            "Its a cat thang. Lions do it alot",
            "My dog sits the same way lol",
            "He’s dapper",
            "He has something to tell you, about his new business idea 💡",
            "Your cat is a business man",
            "\"we need to talk about your grades.\"",
            "Such a polite and considerate young man!",
            "like a gentleman?",
            "Why do you sit with your legs crossed?",
            "Well, well, well, Mr. Powers",
            "He’s a little fancy!",
            "Etiquette obviously!",
            "He is onvs sitting in judgement of you",
            "because he's a fancy boy",
            "Judging you",
            "he means business",
            "Judging you",
            "Because he can!!",
            "A lion 🦁",
            "Because you have a fancy cat in business attire",
            "Because he’s fancy af!",
            "Hes trying to do business",
            "\"I've been waiting for you\" ahh pose",
            "Because he is a distinguished gentleman",
            "Your cat is judging you heh",
            "He wants to do business with you",
            "Because they know they look cool AF 😎",
            "hish  shtyle🥰",
            "ennui",
            "bad news: because of the current economic outlook he unfortunatly needs to let you go.",
            "To judge you, duh!",
            "Sophistication",
            "Because He/she feels Bonita✨",
            "Cause he’s a fancy lad.\n\n![gif](giphy|134iGJcqa8A9lC)",
            "Maybe he thinks he's your therapist ?",
            "Because she's a sassy queen!",
            "Well he’s in his tux, he has to act like a gentleman.",
            "A gentleman a scholar and a legend untold",
            "![gif](giphy|1ym5LJ17vp77BL8X5O)",
            "That’s a classy pose",
            "he is chill asf",
            "He has his tuxedo on who else would he sit?\n\nMolly is also a fan on the leg cross\n\nhttps://preview.redd.it/3akwmyiws38d1.jpeg?width=3000&format=pjpg&auto=webp&s=13c51256273e784dcf5fcef6f9e8c769ac1f906c",
            "\"Have a sit, we need to talk...\"",
            "Someone is going to do so well on portrait day at school!",
            "He's a magician performing the classic \"Paws and balls\" trick.",
            "https://preview.redd.it/mc6wc1fit38d1.jpeg?width=1339&format=pjpg&auto=webp&s=2728e3806e47dc251749734d9e493d72ad714774\n\nMy girl would like to converse with your gentleman.",
            "https://preview.redd.it/y3ej9b9jt38d1.jpeg?width=800&format=pjpg&auto=webp&s=1550284fbca1fbff633175fc26ae623829db739a",
            "Many cats do that. It's likely comfortable for them. Humans often cross their legs too.",
            "This is a fed up father, he’s not mad, he’s disappointed.",
            "Bc he’s ready to see you in his office",
            "Because cat.",
            "There from HR they need to speak to you about your lack of tasty treats",
            "He was royalty in a past life.",
            "https://preview.redd.it/10m3q6p5v38d1.jpeg?width=3024&format=pjpg&auto=webp&s=ba1eb57ba357b76df0b52afab5d13b25895b10ce\n\nReady to give instructions to the human servant. 😂",
            "Lions sit like that too",
            "It needs to have a serious talk with you.",
            "bc he is comfy that way.  why do you sit the way that you sit?",
            "You are being judged.",
            "Wants to relax, bruh.",
            "Distinguished. A cat of class.",
            "In judgment.",
            "My Seven sits like that too, cross paw 💕",
            "He was Alfred's Dad in his past life",
            "It’s cos he has a business proposition for you, should you choose to accept it.",
            "My cat loves to sit like this ☺️\n\nhttps://preview.redd.it/pqvyws8ux38d1.jpeg?width=3024&format=pjpg&auto=webp&s=d4e29afd8b6c5c876b7170c217cc15b8eea11df6",
            "He is judging you",
            "Meowna Lisa",
            "I'm gonna go with because he's a cat.",
            "Applesauce",
            "She used to be a human in a past life and enjoyed sitting with her legs crossed. She’s of high calibre. A beauty.",
            "You need to talk…",
            "SophistiCATed",
            "Looks like he's judging you",
            "https://preview.redd.it/o3kvv3na148d1.jpeg?width=3072&format=pjpg&auto=webp&s=75f7561e1b85d6ae7ff30559fdebe9fa0f0b3efa\n\nMy boy does it too",
            "He's doing tidy paws because he's a respectful house guest obviously.",
            "To fill you in about life, offer free counseling, and also look down on you and be condescending.  🤣🤣",
            "Because he’s the man.",
            "Optimal judging position",
            "To showcase his charisma.",
            "\"so, tell me what you are going to do today to best serve me...\" That's one cocky cutie, lol",
            "Gentleman",
            "He is just a distinguished gentleman 🥰",
            "your cat may be a GP",
            "One of our cats, Calliope, likes to sit that way too.\n\nhttps://preview.redd.it/c8imga5w248d1.jpeg?width=928&format=pjpg&auto=webp&s=4669261efdde48645b2b1dc98eda314c0e471e98",
            "Because he's fancy",
            "https://preview.redd.it/1bv8k3ev248d1.jpeg?width=2048&format=pjpg&auto=webp&s=e043339552601702737bb88a1e2407d3a47c5a6f\n\nIt’s because they all have the “X factor”",
            "Maybe bcz he is the leader who controls others cat in their society.",
            "Because he is a Sir.",
            "In a past life, he was a director.",
            "Why question perfection?",
            "They fancy\n\nhttps://preview.redd.it/atum43f9448d1.jpeg?width=1080&format=pjpg&auto=webp&s=28a57c6f448993b0ec08ec7977012a9e9956d9f8",
            "Because he’s showing his judgement and disdain for you at the same time   \nHe’s beautiful",
            "Because it likes it.",
            "It's comfortable",
            "https://preview.redd.it/63bha0i2648d1.jpeg?width=828&format=pjpg&auto=webp&s=e722ea9d51f341e75a00a2f62c4e5edd224f50e0\n\nChino does this too, but usually it’s just his left arm stretched out",
            "Because he is planning to take over the world but first he may want to talk about either your cars extended warranty or how much money you owe him for his service lol",
            "That’s the paw cross of judgement. “Hooman we need to talk… “",
            "I personally think he's planning some kind of intervention with you lol",
            "https://preview.redd.it/511meamn648d1.jpeg?width=3072&format=pjpg&auto=webp&s=4d3fcf3417850860b744b310d67e3d62b473d9a4\n\nThis is Roo, he also loves to cross his paws.",
            "Has he started asking you if you have been to the cloud district very often?",
            "Because he is a fucking legend",
            "Probably because he’s regal as fuck.",
            "He's the most famous cat in the world. . .",
            "We call that crossy paws 🥰",
            "Because it’s comfy? Move does it occasionally, I think it’s mad cute!",
            "They are a refined gentleman or gentlelady",
            "It’s a cat… and you’re asking for reasons???",
            "Nonchalance",
            "Cos he’s adorable ",
            "https://preview.redd.it/tq1opocs848d1.jpeg?width=4000&format=pjpg&auto=webp&s=94a20be048487674c82d89e7c677310e7dbd866a\n\nyeah mines fuckin weird too, wouldn't worry about to much haha",
            "Tell your cat why you have feed it at 6:59 am instead of 7:05 am sharp.",
            "Because he is a BOSS. A Baddie. And a straight up gangsta.",
            "Because it's a cat?",
            "It’s contemplating",
            "https://preview.redd.it/o204kekq948d1.jpeg?width=3024&format=pjpg&auto=webp&s=488265649f400ab04253d14f9b3a8a8e3309c3a6\n\nTo designate royalty",
            "What did you do?",
            "He’s holding his swatting paw in check.",
            "Because he’s suave….and how often do you get to bring that word out?",
            "Yes\n\nhttps://preview.redd.it/9sd94fvba48d1.jpeg?width=3024&format=pjpg&auto=webp&s=95adf9dc53228fe9e5ba44ef0a8c93599be5e590\n\nThis is Gary",
            "She is assessing you & has found you lacking",
            "Why do you cross your arms and legs?",
            "Paw placement is a high priority ♥️♥️",
            "Etti-Cat :)",
            "He’s judging you and everything around him…",
            "https://preview.redd.it/tb4d3ozkb48d1.jpeg?width=4284&format=pjpg&auto=webp&s=113d242973723a458c25d78791cd10a4665edd34",
            "aww your kitty so cute :)\n\n![gif](giphy|yFQ0ywscgobJK|downsized)",
            "he deff have an offer to make",
            "He is a scholar and a gentleman.",
            "He's a gentleman!",
            "He fancy!",
            "He has something that isn’t east for him to tell you",
            "Not a one mentioned r/fancyfeet",
            "Because he can. Are you jealous?",
            "he is so fancy",
            "He’s really disappointed in you and needs to have a very serious conversation.",
            "Because he can",
            "And a scholar. Scored 528 on the MCAT. That’s short for Me… cat.",
            "Yes....yes, I see.",
            "r/fancyfeet",
            "Just wait until he brings out the glasses ![img](emote|t5_2qhta|7946)",
            "Yup.\n\nLook at how he is sitting.... So distinguished!",
            "I was gonna say that >:(",
            "The way I ran to the comments because I knew this was going to be the top one.",
            "Came here to say exactly this.",
            "Mmmm yes. 🎩",
            "Exactly what I was going to say",
            "Ah, yes, very distinguished",
            "Mmm. Very distinguished",
            "I was going to use the word “dapper” but the same point stands",
            "The only answer.",
            "BRO AIN'T NO WAY, that is literally what i said in my head before entering the comment section",
            "Lol. Came to say this.",
            "Scored even better on the CAT (Cat Assessment Test) 1500 points lol",
            "Used the brain cell to it's full potential to figure out how to get around that rule",
            "Apparently she’s found a loophole.",
            "I hope you were prepared for that job interview, the interviewer looks very strict",
            "Everyone has a fancy cat",
            "🥹",
            "What a beautiful kitty",
            "Like the ancient Egyptians?",
            "Judging you",
            "You win. I had to enlarge the pic to be sure I saw what I saw.",
            "Interview-er pose.",
            "https://preview.redd.it/nfw0d2rns38d1.jpeg?width=803&format=pjpg&auto=webp&s=b6565693f5c6fb67a1d8ab72f64253043f0ceca2",
            "Hello",
            "-tips hat-\nM’cat",
            "Mcas!?",
            "Yes....very distiguished",
            "Indubitably",
            "Another day another cat/pet subreddit to follow.",
            "One of my cats is an absolute ruffian and she’s still fancier than me",
            "😂",
            "This is Reddit. You shouldn't dox.",
            "-*tips hat*- M'kitty.",
            "![gif](giphy|uR6JMOFCtLmXkcKOkG)",
            "Who doxed? What am I missing?"
        ]
    },
    "Someone left this poor baby at my dad's doorstep. He's very scared, stressed and hungry. Always searching for his mother.": {
        "title": "Someone left this poor baby at my dad's doorstep. He's very scared, stressed and hungry. Always searching for his mother.",
        "score": 1249,
        "url": "https://v.redd.it/je955ll5w28d1",
        "content": "",
        "num_comments": 33,
        "comments": [
            "We're feeding him and taking care of him now. Love this little fella!",
            "Congratulations on your adoption",
            "The Cat Distribution Center has chosen you as his new owner 👌\n\n![gif](giphy|Ma1JY200ohFn9ed4qr|downsized)",
            "He will guard you from evil spirits forever. 🙏 ",
            "✨✨✨Good Human✨✨✨",
            "How do you know/what are the signs he’s looking for his mom?",
            "He’s old enough now that he was weaned off his mom’s milk. Cats become independent very quickly. We like to anthropomorphize them and think that he’s looking for his mom when in reality he’s just looking for food.",
            "Your dad’s kitten distribution system ticket has been punched, please abide",
            "I am taam OP and OP's dad! Thank you for caring!!!",
            "you are de captain now",
            "So cute he so scared! Thanks OP for taking care of him!",
            "Thank you for taking her! It’s not easy to be little and alone.❤️",
            "Ohh poor baby, thank you for paying some kindness forward OP. You’ll get that back in spades, claws and purrs over time",
            "You are his mother now! Protect this wee lad and love him like your own.",
            "I really hate people who abandon helpless animals. One really wonders what else they are capable of. Thank you for caring for him.",
            "That's how we had our first cat.",
            "If kitty had a playmate life would be perfect.",
            "My downstairs neighbor put their indoor cat outside & left them when they moved. The poor baby was soooo scared. Me & my husband would feed him & give him water along with pets. We couldn't take him in but we were able to find him a home right before a cold front came through.",
            "oh thank goodness for people like you",
            "Did you bring him inside or caring for him while outside?",
            "Another success story from the cat distribution system!",
            "Thank you for being a wonderful person and taking care of this poor kitten🩷You and your father are angels.",
            "r/catdistributionsystem",
            "omg please 🙏😍",
            "That’s really cool✨",
            "Ya I wanna know too.. poor baby",
            "My kitty was similar, even in age/size and she was crying for her mama. She had food and everything provided. I think it depends on how long they were with the mother.",
            "Street cats also wean their kittens very young sometimes - even at 8 weeks. Because they are fighting for survival too and the longer they feed them the more difficult it becomes for them. Spay and neuter your kitties!",
            "Ticket approved",
            "He has. Sort of. The leader of the local cat gang who was similarly pickup off the streets. A mentor to the kittens and sworn enemy to the invaders.\n\nhttps://preview.redd.it/m2jibw0hc48d1.jpeg?width=1500&format=pjpg&auto=webp&s=52e18222d2e81431bfd6979156ca0fbe8af8dae3",
            "I had some kittens that never wanted to wean or leave their mom. Mommy had to get mean... Pretty sure they will drink the milk as long as they are allowed to."
        ]
    },
    "I work in the ER and a patient said they heard a cat meowing in the parking lot. Found him up in the engine of a car. I was supposed to adopt him out. It's been almost year. I failed 🤣": {
        "title": "I work in the ER and a patient said they heard a cat meowing in the parking lot. Found him up in the engine of a car. I was supposed to adopt him out. It's been almost year. I failed 🤣",
        "score": 4549,
        "url": "https://www.reddit.com/gallery/1dlgo8u",
        "content": "",
        "num_comments": 124,
        "comments": [
            "you didn’t stand a chance, I wouldn’t have either! just look at that face",
            "Cat Distribution System wins again!",
            "Failed my ass!! He’s way cute too.\n\nThank you for rescuing him more than you thought you would!",
            "\"I'm just going to take care of him until I can find a good home.\" I tell myself every time.",
            "In your defense, he is the babiest baby I’ve ever seen 😍",
            "https://preview.redd.it/yac328w6218d1.jpeg?width=1920&format=pjpg&auto=webp&s=007944a85f160195f42b60342255ca49bf2c320b\n\nLooks like my Mooncake",
            "You didn't fail, the CDS won.",
            "Oh my word…I’d have kept him too.  He is beautiful.",
            "A young cat and her kitten showed up at my window at 4 am last fall (my cat was growling and woke me up) I went out to check on them and gave them food and water and we hung out til dawn when they vanished. I put more out that evening,but they didn’t touch it until it was dark. At 1 am it started raining so I went out and they came running.I put them in the laundry room with plans to take them to a shelter. They’ve lived here since then and after numerous trips to the vet and $$$, they are healthy,immunized and sterilized lol Worth every penny 😊",
            "I wish all my life's failures ended up that well. Nicely done",
            "So what did you name him",
            "That first picture says “I know what I did.”",
            "His face says “you are lucky to have me”",
            "Good Lookin Kitty!",
            "A hot rod!",
            "Your pack of cats are adorable! Thank you for saving him.❤️",
            "Adorable",
            "Wow, he can bring the Face of Judgment! Adorable!",
            "And he knows you failed. And he’s judging you, but not enough to leave! \n\nHe’s adorable.",
            "\nA sweetie!!! \n\nI think we need a sub called r/parkinglotcats",
            "That face ❤️❤️",
            "The best kind of fail. The paw cross in the third photo, such a distinguished gentleman!!!",
            "That face! Gaaaaaahhhh! How could you not?",
            "What hideous being put him in a car engine?\n\nWhoever it was I'm going to do to them what they did to that poor cat.",
            "You did NOT fail!-you won the prize of unconditional love",
            "He is SO CUTE",
            "He appreciates that you are a failure…at adopting him out 🥰",
            "I love foster fails!",
            "Looks at you with such love in his eyes",
            "Look at that little face 🤩",
            "I love him and love you for giving him a loving home",
            "Now you can call in S.I.C.K. all the time. Staying in, cuddling kitty….",
            "You spelled win wrong",
            "You succeeded in falling for the cat distribution system. Oldest trick in the book. Congratulations on the new addition",
            "You save lives and cats!! 🥹🥹🥹",
            "Stray cat softly purrs,\nHospital lot, moonlit night—\nHope in silent paws.",
            "Such a handsome boy!\n\nI had one of those happen to me 29 years ago.  I opened my front door to let in one of my daycare parents and their child, and they said \"So is this a new cat of yours?  You don't have enough of them???\"  And she laughed.  Because I already owned 3 cats, one for each of my sons.\n\nWell this new cat, who boldly walked right into my house was NOT my cat!  He hopped on my sofa and immediately fell asleep.  When he woke up, I shooed him back out the front door, because he was a GORGEOUS cat and I was sure he was someone's beloved pet.\n\nWent to get the mail at 1pm when the kids were napping and he literally fell into the house!  He was sleeping against the door.\n\nClearly, he was not leaving.  We were his new people. He lived with me to the ripe old age of 18.  I loved him like no other and he loved me right back.. best kitty distibution to my house ever.\n\nhttps://preview.redd.it/nlqwl9g4i28d1.jpeg?width=350&format=pjpg&auto=webp&s=5f8609c1e1eddbd9314d50630e1ba008d00fc318",
            "You call it a fail, but it looks like a win to me.",
            "Congratulations to you both! ❤️",
            "Sweet boy! He loves you.",
            "You failed successfully.",
            "wow! what a handsome face! it catch my heart a lot!",
            "Quite the successful failure",
            "He's beautiful",
            "His little smile! Of course you had to keep him!",
            "🫡 He completed his mission! 🥹",
            "And he’s a silver tabby! My favourite! \n\nWhat a beautiful baby",
            "I would have failed, too. I try to avoid the cute kittens as much as possible... lol",
            "In the first picture you can clearly see him judging you for failing at adopting him out.",
            "Stupid cats and them heart claws",
            "You didn’t fail, you won!!!!",
            "You’re good people 😻😇❤️",
            "Seems like a win/win.",
            "He looks like a sweetheart. Glad he found you",
            "No, he succeeded! What a happy boy!",
            "This is not a failure...the cat won!",
            "I would have failed instantly.",
            "What a cutie!",
            "Him sleeping on the floor is adorable",
            "He looks disappointed in the first picture. ![img](emote|t5_2qhta|7973)",
            "Well then he adopted you !!",
            "Failed has such negative connotations./s",
            "You got a good one!",
            "Omg the poses and facial expressions are hilarious 😂.  ",
            "Foster fail!! So wholesome",
            "It’s okay! Your secret’s safe with me!",
            "😁",
            "Tsk, tsk. I think you should go pet your kitties and think about what you’ve done!",
            "https://preview.redd.it/nwtmarxet18d1.jpeg?width=510&format=pjpg&auto=webp&s=a695f5b6ceaa9f3272aaba9df7f24adf47705458\n\nThis is the only picture I have of my cat on my PC lmao. But our kitties are identical!!! :)",
            "Seems successful to me.",
            "He looks so content",
            "plssss the photo of all 3 kitties 🥹 you have a gorgeous bunch and they all have beautiful markings! gotta love a good foster fail story ❤️",
            "CDS commends you.",
            "SUCKER!  Them damn cats do that on purpose.  They know that if they can just get us humans to take notice while they rub our ankles, climb into our laps, look into our eyes then we MUST take them in and allow the love to come pouring both ways.  Sucker.  Oh yes, we have a cat door and now have 5 cats, none of which we actually bought or officially adopted, they just wander in from space like Popies cat. Congratulations on your new family member.  He is beautiful.",
            "Oh his little face tho",
            "Maybe a fail for the human, but not for the cat.  Not only did the cat get a home & safely get off of the streets, the cat now has two feline buddies to play with.",
            "I love this cat!",
            "With those awesome airplane ears?? I'd call him Vroom! and fully accept he ain't goin' nowhere but here! Like the old saying (sorta) goes, \"Home is where the cat is\"😂🤣😂🤣",
            "Ohhh, congratulations!!!",
            "https://preview.redd.it/3t2mieimb28d1.jpeg?width=720&format=pjpg&auto=webp&s=f3f041f84c582c24c153ee21c312b3f566fd51dc",
            "That adorable mf looks so smug, he knew he wasn't leaving from the first night.",
            "Aww I’ve definitely got a soft spot for gray tabbies - yours looks a lot like mine too!\n\nhttps://preview.redd.it/ecvgs7jze28d1.jpeg?width=3024&format=pjpg&auto=webp&s=5c7fa2ed73e86bd25f86fda52bb09ab641219cbb",
            "Good",
            "https://preview.redd.it/8cfnb0aak28d1.jpeg?width=3024&format=pjpg&auto=webp&s=8b0951e9f0ab4b35f92ad76d94cf6b15cadba3e2\n\nwelcome to the grey tabby club!! he looks a bit like my handsome boy",
            "You might have failed, but the cat's plan worked purrfectly.",
            "now he is head surgeon...",
            "Did you steal my cat wth?\n\nhttps://preview.redd.it/ga1lrk9ky28d1.jpeg?width=1080&format=pjpg&auto=webp&s=99e10433cdb2e90ff3adfdb41e079b4c70f0398e\n\nOr are they long lost brothers?",
            "You’re the best kind of failure!\nConsider it failing upwards.",
            "Does he work in the ER as well? Looks like he does judging by his sleeping position.",
            "Looks so innocent and dangerous at the same time",
            "Nope you didn’t fail. You won.",
            "My Wife rescued one of our Ragdolls, that passed away a few years ago, inside the engine block. Poor little oil soaked thing was meowing it's head off. She was really quiet for most of her life after that, we think she used it all up to get saved. \n\nSo we named her Pennzoil. Or Penny, for short.",
            "Clearly it was meant to be. 🥰",
            "Yep. Best fail I’ve ever had lol",
            "yeah, that first photo is a smug little gremlin who knew exactly what he was doing!! he’s such a cutie!",
            "you dont choose a cat, the cat chooses you",
            "I never thought I’d be picked. But now I tell people you just have to trust the system.",
            "It was over on day 2 when he was looking at me like this\n\nhttps://preview.redd.it/4622hcffd08d1.jpeg?width=3024&format=pjpg&auto=webp&s=baa3f7646c070f9a1d0022d62a02612984fb3e93",
            "Same. My wife was telling me no more animals when I called her to come get him. This is exactly what I told her. A week later she’s telling me that we dont HAVE to adopt him out lol",
            "I wish there were more people like you!",
            "Lol so I started calling him Doug when I was planning on adopting him out and then we kept him.\n\nSo his name is Douglas, it was too late to change it 😂",
            "Haha totally does! He got me good",
            "To me that first picture says he is skeptical of my rental application and that I might not be the caliber of resident they’re looking for at Wyndham Oaks.",
            "That I am! ![img](emote|t5_2qhta|7984)",
            "Thank you!! Lucy is the white tabby. She was found under a trailer nearby and we snagged her up and Bean is the gray and white cat we were able to adopt him from a shelter that pulls cats from kill shelters. Couldn’t imagine life without all of them.\n\nhttps://preview.redd.it/ndtcsp99e18d1.jpeg?width=3024&format=pjpg&auto=webp&s=27bf4ea5a38b063c4e9da622e764c894ae97bc1f",
            "If that were the case I’d help. \n\nBut there are a fair amount of feral cats around my hospital. I think he climbed up in it himself and got stuck.\n\nI started feeding/trapping the ferals and getting them fixed to help slow the population. Hopefully it’ll make a difference",
            "I'm stealing this. Also, 100% right.",
            "Such a cool story! From the back your cat looks like our cat Bean!",
            "Awh, Doug is the same way he very rarely meows. \n\nGuess he used them all up to get saved too.",
            "Yeah, total fail...he looks so bored & uncomfortable forced to sleep on his back exposing his vulnerable tender underbelly...probably sleeps like that from being coddled & regular feeding, what's wrong with you? You take a perfectly independent cat out of a car engine and give him what in return? A home, a bed, too much love, and, worse, make him adopt an adult human.  \nJust kidding, of course, he hit the human & household lottery! So happy looking cat!",
            "he's so handsome",
            "when will it be my turn 😭😭😭",
            "My cat got dropped on me out of nowhere at my JOB, I wanted nothing to do with him he wasn’t my responsibility and I was really upset I somehow ended up with an animal when my boss was the one who adopted him.\n\nYeah that didn’t last lol it’s been a year and a half, I can’t imagine life without my little grey goblin anymore 😂\n\nhttps://preview.redd.it/ol1ky7cpk18d1.jpeg?width=4032&format=pjpg&auto=webp&s=210798e8a290d5702e8bf4543f85d5d32de4dc82",
            "Oh my gosh! I can see why.\n\nALSO your username is amazing. I was JUST listening to him today.\n\nhttps://preview.redd.it/pcu9b8rrf08d1.jpeg?width=4032&format=pjpg&auto=webp&s=104e1e26a150c6e4b9770a42c7ef187d11257822\n\nAnd this Joey will see you in Catsachusetts!",
            "Oh my gosh! Too cute!!!",
            "Thanks,kittens  are hard to  resist 😆",
            "Doug is your boy",
            "BTW—user name is hilarious.",
            "Oh, nice. Keep up the good work then.",
            "It’ll find you when you least expect it!",
            "We will get adopted by cats soon … don’t wish too hard—- we don’t want to get an endless truckload— lol 💩💕",
            "🤣🤣 thank you!! I see your cat has also mastered the judgmental stare",
            "You’re welcome! Haha, he has"
        ]
    }
}