{
    "In response to BYU declaring themselves as having the coldest chocolate milk in the country, Mississippi State declares it has the best cheese in college football": {
        "title": "In response to BYU declaring themselves as having the coldest chocolate milk in the country, Mississippi State declares it has the best cheese in college football",
        "score": 2012,
        "url": "https://x.com/hailstate/status/1804243829371080951?s=46&t=6Y38qwObrgLGB3ty47e55Q",
        "content": "FYI, you haven’t discovered Edam cheese, I’d try to order some. It’s unreal. ",
        "num_comments": 836,
        "comments": [
            "Oh you're fuckin dead Mississippi State",
            "God damnit, I'm certain BYU alum Coach Mike Leach would have been the perfect person to weigh in on this.\n\nRIP CML",
            "Look y'all all Ole Miss people will vouch for Edam cheese. There's a waitlist to buy it for a reason. Having some at your tailgate is a flex.\n\nThat said I would love to try WSUs and Wisconsins offerings some day!",
            "Wisconsin, Mississippi State and WSU flairs all in on this\n\nBegun, the Cheese Wars have.",
            "I feel like a fight between Wisconsin and Mississippi state is gonna break out with a bunch of cheez it’s gathered around them yelling, “cheese, cheese, cheese”",
            "hol up",
            "(Spits out my cougar gold) …excuse me?",
            "This is Cougar Gold erasure and I will not stand for it. I will fight for WSU and their cheese.",
            "HAHAHHAHAHAHAHA…\n\nPause, breath.\n\nHAHAHAHAHAHAHAHAHAHAHAHA.",
            "Wisconsin slander!",
            "Listen. The cheese is all that we have left. \n\nYou'll have to pry that title out of our cold dead hands, Bulldogs.",
            "Seems like a Wisconsin / WSU matchup is appropriate here",
            "Cougar Gold definitely has something to say about this and I’m saying that as a Husky.",
            "Damn I’ve been o Starkville and didn’t try the cheese.\n\nFUCK",
            "The off-season shit posts this sub deserves",
            "Everything in the MAFES store at State is top shelf.",
            "Excuse me.",
            "That doesn't look like Cougar Gold to me....",
            "\\*laughs in Cougar Gold\\*",
            "Wait no go back to flexing lower prices damn you BYU social media team for pushing this in the wrong direction",
            "Cougar Gold would like a word, my dude",
            "Why is Mississippi State rage bating Wisconsin?",
            "[Cougars have entered the chat](https://creamery.wsu.edu/cougar-cheese/)",
            "\"Coldest chocolate milk\", so the coldest refrigerators? Not fully sure what the flex is there.",
            "i must say i’ve never been to wisconsin, but edam cheese is probably the best cheese i’ve ever had in my life",
            "ITT: people who have never tried this cheese say it can’t be the best",
            "ND has the best Touchdown Jesus in college football.",
            "Edam cheese is amazing.",
            "If you’ve never had MSU’s Edam cheese or \n muscadine ripple ice cream, you’re really missing out",
            "Can confirm it’s fire. I have a friend who gets us this every year for Christmas.",
            "Hasn’t enough shit happened to Washington State this year?  Now someone is going after their cheese crown?  I mean when is enough, enough?",
            "MSU is more Wisconsin than Wisconsin. They literally use cowbells in the stadium.",
            "Cougar Gold exists...",
            "Too fuckin far",
            "Cougar Gold clears",
            "hahaha. Cougar Gold trumps all",
            "A ball of MSU Edam will literally change your life. My company orders about 100 a year to give out to our “best” customers at Christmas (to rave reviews). Let’s just say it pays to be the boss…..",
            "HEY! I HEAR YOU, YOU DIRTY CHEESEHEADS! NO ONE SLANDERS THE MAFES CHEESE STORE ON MY WATCH!",
            "Seriously, this is way better content than whatever the latest news on the death of CFB is.",
            "Edam cheese is the shit, if yall have had a baby bell, you’ve had Edam",
            "Maybe they're talking about fumunda...",
            "The cheese is great, but don’t miss the chocolate ice cream. I always got some when my grandmother took me the State basketball games",
            "That’s the most BYU declaration possible",
            "Cougar Gold would like a word.",
            "As a Husky fan I have to say it’s Cougar Gold and then everyone else",
            "I’m no cheese expert, but I’m pretty certain Mississippi isn’t really known to be either.  Feel like that’s best left to the guys up north, specifically Wisconsin",
            "Are they forgetting WSU still exists?",
            "Wrong",
            "The fuck you do, Mississippi State.",
            "You know BYU, if you put some alcohol in that milk you can chill it further.",
            "I hope this becomes a thing and every team declares they have the best version of a very common item of food.",
            "Wisconsin v Mississippi State in the Cheez-It Bowl PLEASE 🙏",
            "“I’m feeling the cheeziest coach”",
            "*The State of Wisconsin has entered the chat*",
            "https://youtu.be/SsX9K3z_m70?si=l5_2dK-8NcWTB-9s\n\nA story I did for context, if anyone wants to know the cheese history at Mississippi State.",
            "This is how you start a fight with Wisconsin.\n\n\nI can't imagine the state of Mississippi would be good at anything",
            "As an Auburn guy, I have family that live in Mississippi and are State grads. I can confirm, the cheese slaps.",
            "BYU:  We have the coldest chocolate milk!\n\nMississippi St: We have the best cheese!\n\nMichigan St:  Hold my ice cream… https://msudairystore.com/products/chocolate-confection-cheese",
            "Mississippi State is about to get wrecked. Cougar Gold.\n\nAlso, Rogue Creamery in Oregon literally won World's Best in 2019. Sorry that you southerners won't eat fancy blue cheese, but GTFO with that \"best\" shit.\n\nAlso, Wisconsin probably wants a word.",
            "That’s fighting words. Cougar Gold > whatever they call cheese in Mississippi",
            "Wazzu is the only school that can claim this one wiscy bros. The university holds a patent on a type of cheddar cheese that never goes bad",
            "I love cheese - I am not going to disparage anyone for their cheese enthusiasm... but I am gonna press the doubt button on Mississippi State having the best university-produced cheese.\n\nIf it's the best, good on them.",
            "As a State alum living in Madison... Wisconsin. This is starting some arguments in my friend circles.",
            "Tbh the muscadine ripple ice cream is way better.",
            "MSU and Penn State for best ice cream?",
            "There’s only one way to settle this obliviously…\n\nRevive the Cheez-It Bowl",
            "Only one school has a Master Cheesemaker Program, how is this even a discussion.",
            "Our teams may be inconsistent, but some State Edam Cheese is always a winner.",
            "In all seriousness Mississippi State cheese is excellent—and this from an Ole Miss fan.",
            "Used to work on campus. Half my interactions with people were asking where to get the famous cheese",
            "That cheese is fire tho.",
            "byu, wisconsin, mississippi st and penn st should make their own cfp called the dairy bowl",
            "I have no love for State but they make damn fine cheese",
            "https://www.youtube.com/watch?v=ROcHUIrzCN4\n\nHere is the story of MSU cheese.",
            "The violence towards Wazzu never stops.",
            "Cougar Gold from Washington State University.  Check it out",
            "I’m going to have to support my school on this. That was some of the best cheese and ice cream of my life!!",
            "ahhhh NO you don't.",
            "Whipping in here for both my alma maters. \n\nSD State claims the best ice cream (specifically Cookies ‘n Cream)\n\nMississippi State cheese is delicious and can vogue. Suck it, Wisconsin.",
            "Of all of the things that could have been said this is certainly one of them",
            "I hope no one is going to dispute who has the biggest nuts.",
            "I actually stand by the statement. That cheese is amazing.",
            "what kind of crazy people deliberately upset badgers?",
            "Cheez-It bowl matchup",
            "oh God what did our marketing team do this time",
            "MSST woke up feeling the cheesiest",
            "Where would one get this Edam cheese?",
            "Tennessee has the best mustard.",
            "The goddamned audacity",
            "A Wisconsin fan just spit chocolate milk out his nose.",
            "Madison is in shambles and a new rivalry is born. These two need a home and home ASAP.",
            "https://www.mafes.msstate.edu/branches/mainstation.php?location=store",
            "USF: we have the best strippers in college football",
            "I didn't realize that Mississippi State wanted to die by the hands of Wazzu and Wisconsin.",
            "They’ve awaken the Cougar Gold community!!!",
            "It’s Edamn good",
            "I'll say it... Wazzu has the best cheese.",
            "When I was a kid, one of my parent's friends would always give us this cheese at Christmas and it is actually awesome cheese. I would usually end up eating most of it.",
            "Their cheese is very good.",
            "UCF over here like, shit they’re onto our tricks. Just declare yourself the champion of something boys it works",
            "I can't wait to see Pitt's post about their favorite delicacy. ",
            "Real talk don’t sleep on Mississippi state cheese. It’s no joke.",
            "Guys imma need names and links if you’re throwing out states w great cheese.",
            "I have not had Edam cheese, but will definitely order. I have tried Cougar Gold, which is amazing! Thanks for the cheese recommendation!",
            "Everybody knows Cougar Gold is the best cheese.",
            "I’d be interested in trying some Badger cheese. They’re known for milk and dairy up there so it tracks. It won’t be Miss State Edam cheese but it’s probably pretty good.\n\nTIL WSU makes cheese. And indignant about it.\n\nPlease send me some cheese CFB brethren soon can judge the inferior cheeses of the FBS",
            "*laughs in Iowan tax free groceries while having best dairy, beef, and cheese* - damn I miss Iowa University",
            "That edam is fire. Mississippi cheese is far superior to Wisconsin cheese because their cows spend all winter in barns eating hay while ours feed on sweet grass year round.",
            "Bro cougar gold is fucking fantastic their high",
            "WSU makes truly kick ass cheese. Best apples too. If ya haven’t had a can (ya, can) of cougar gold cheese and a Cosmic Crisp apple I can’t stress to you enough how rad they both are.",
            "Looks like it’s time for the North to remind the south of its place \n\nHeathens",
            "Clemson blue cheese is the real best cheese in college football",
            "Not even the MSU with better cheese",
            "Guess it's \"Dunk on Wisconsin\" day",
            "Fyi, most people have probably tried Edam cheese, albeit a lower quality version. Babybel is essentially Edam cheese",
            "Hey Wisconsin fans would it help if we said SEC cheese? So you guys don’t get sad? (Even though we do have the best cheese) \n\nHaha",
            "The coldest chocolate milk? That's the best they could come up with? That's like Coors advertising the coldest beer......it's like bro, it's as cold as your fridge allows it to be",
            "I’ve never tried msu or wiscy cheese but they aren’t better than cougar gold. As a man of culture I’ll make an effort to acquire them though",
            "WTF is coldest chocolate milk? Is that like chocolate ice cream?",
            "I am amazed at all the rivals coming to WSU's cheesey defense.  If Auburn had cheese, it would never cross my lips on principle alone.  Y'all need to learn how to rival better",
            "Cougar Gold would blow this shit out of the water. I have two cans from 2004 that I plan on using this upcoming football season.",
            "Okay Mississippi State I don’t see anyone chasing after your cheese on a bumpy hill and probably getting a major concussion",
            "I would really like to raise our pretzel stand to the pretzel throne. I will genuinely miss half a quarter to get one every single week",
            "They’ve obviously never been to Grandpa’s Cheese Barn.",
            "Could they not have picked anything else? Like outside maybe Corn I can’t think of an item that’s more synonymous with a state and it’s universities.",
            "Is Mississippi known for cheese or dairy products?",
            "That’s a bold statement.",
            "I have it on good authority that WVU has the best pepperoni rolls in the business.",
            "But who has the merriest men in all the land?",
            "What the fuck",
            "Penn State declare they have the best ice cream in football when",
            "Who’s gonna be the first to claim BBQ and start a second civil war ?",
            "Guffaw",
            "This might be the push Wisconsin needed to get to that next level",
            "My brother in Christ, do not anger the Badgers.",
            "Clearly never had Cougar Gold. That shit is delicious.",
            "Michigan State would like a word.",
            "Wisconsin in shambles.  Bucky is ready for war.",
            "Doesn’t chocolate have caffeine? 😂",
            "I know we don't know their records yet, but can we rig it so that they play in the Cheez-it Bowl, please?",
            "Nebraska declares we are the only ones with Runzas.   Checkmate, you all lose",
            "You gonna stand for that Badger fans?",
            "We are one South Carolina declaring they have the best corn away from the next Civil War.",
            "Sure, and USC has the most moist brisket.",
            "Best wine (rip Zima)",
            "That's great, but I don't go to college football for cheese.",
            "I didn't even know Mississippi had cheese. Wisconsin and the Midwest is the cheese and brewery capitol of the U.S. Change my mind.",
            "WSU in shambles",
            "Well shit, apparently I need to go to a game in Provo.",
            "You two should fight, i mean play.",
            "Kill them Wisconsin KILL THEMMMMMMM!!!!!",
            "BYU: \"We're sober.\"  \nMSU: \"We obviously are not.\"",
            "First we had Kendrick v Drake, now we get MSU v UW. Fuck yeah",
            "I legitimately laughed out loud at this \n\n\nShow 'em who's boss Bucky",
            "Drop the muenster, take the cannoli Wisconsin",
            "Get em, Badger!",
            "This is one fight that I’ll March under enemy banners. Hail ~~state~~ Wisconsin",
            "Sic [Wisconsin Julia](https://www.instagram.com/reel/CzeErkAsrHX/) on those posers. “Oh my gosh I love cheese! … and, uh, Münster? Münster’s gooood.”",
            "I'll fucking back you on this one.",
            "2025 BATTLE OF THE GOLDEN CHEESE WHEEL RIVALRY BEGINS",
            "I got garlic dill cheese curds in the store in the Madison Airport that changed my life last summer",
            "Lmao, I knew this would get y’all going. \n\nBut seriously if you are every around the area, go check out the MAFES store on State’s campus. Check it out, everything in the store is made by the school on campus as part of teach and research. I actually think the ice cream is the best product, but they have a lot of stuff and the ball of Edam is by far the most popular product. \n\nhttps://www.msucheese.com\n\nThere’s a link to their site, they only ship in the fall for Christmas but it all sells out instantly. \n\nHere’s some info about how it’s made: https://www.msucheese.com/about-msu/",
            "Miss st claiming best cheese would be like iowa claiming best mountains",
            "Beer drinking and best cheese.  Two titles you won't be able to pry from our hands.  Even when they are cold and dead.... or just passed out.",
            "Sorry but y’all gotta get in line behind WSU",
            "Since BYU helped start this, perhaps it would be fitting to offer one of our alums to help settle it: noted cheese afficianado and general food expert Andy Reid:\n\nhttps://www.arrowheadpride.com/2018/3/8/17096680/how-to-cook-andy-reids-famous-mac-n-cheese-recipe",
            "I side Wisconsin. No way Mississippi State has you beat.",
            "I gotta say, man. I think it’s incredibly fucking noble how Wisconsin is stepping up to defend Vermont’s title of best cheese in the US, since they’re unfortunately not able to do so right now. You’re a real G.",
            "I don’t like Wisconsin in anyway but they don’t fuck around when it comes to cheese and beer.\n\nMississippi done fucked around and they are about to find out",
            "*Hehe, I’m in danger*",
            "I knew what the top comment would be lol",
            "UConn's Dairy Bar is the best ice cream in DI",
            "Fuck yeah they are.",
            "Bring it!",
            "This is exactly what I wanted to see when I opened this thread",
            "Ugh, Leach was such a treasure",
            "TIL leach went to BYU",
            "“Wisconsin Cheese is just like Candy Corn. You open the bag and dump it in the trash. Then you go get some Mississippi State Cheese.”",
            "BYU has Dad's ordering chocolate milk in July. It's wild.",
            "RIP Coach Leach, but we can offer another noted cheese afficianado alum:\n\nhttps://www.arrowheadpride.com/2018/3/8/17096680/how-to-cook-andy-reids-famous-mac-n-cheese-recipe",
            "As if he didn’t manifest this from the great beyond",
            "Mike Leach pregames with a bag of Edam from MSU and the big bag of spree like you get at the dollar store. \n\nMy third favorite team was always whoever he was coaching. And the SEC shorts kindergarten teacher hug absolutely nailed it.",
            "RIP and CJK5H",
            "Can report, Cougar Gold is delicious.",
            "Wazzu has a real contender for best cheese. Cougar Gold is a treasure.",
            "You can order it right now! https://cougarcheese.wsu.edu/",
            "> Look y'all all Ole Miss people will vouch for Edam cheese.\n\nI think this the first time in history that people from Mississippi are willing to go to the mattresses for the Dutch.",
            "[here's the link to Wisconsins store](https://babcockdairystore.wisc.edu/product-category/cheese/)",
            "Finally, peak college drama.",
            "All I know is that I can buy Wisconsin and WSU cheese online, but Mississippi State’s is sold out and wait-listed.\n\nFrom their websites, it looks like WSU makes around 175,000 30oz cans of cougar gold (328k lbs) per year. State makes “over 300k lbs” of cheese a year.",
            "Then Wazzu comes in with a chair",
            "We know what we have in Wisconsin. We don't need to slum in the minor leagues.",
            "the winner is who woke up feeling the cheesiest",
            "Washington State has AMAZING cheese",
            "I woke up feeling the cheeziest coach!",
            "This year's Cheez-It commercials are about to be wild.",
            "This comment needs more upvotes",
            "Just like in the Cheez It commercial",
            "TWO CHEESE ENTER. ONE CHEESE LEAVES.",
            "I woke up feeling the cheesiest coach!",
            "If the Badgers win, they get rid of the cowbells.",
            "Huskies support Cougar Gold",
            "I’m with the Cougs on this one. Cougar Gold is amazing",
            "Bro someone gave me some cheddar from WSU and it was in a can. After a few weeks of it sitting in my fridge, I cracked the can open.... and it changed my life.",
            "Y’all would be in shambles if this was true, but it’s not. Cougar Gold is it",
            "Get em",
            "#CougarGold for life, eff Wisconsin.",
            "That’s just a waste of perfectly good Cougar Gold.",
            "That’s like spilling alcohol man",
            "(Picks up your bite off the ground and eats it when nobodys looking... shits expensive yo).",
            "I'm upvoting a--checks notes--Duck flair?  To support a--checks notes--point of Cougar pride?  I literally can think of nothing else I would do that for.  Cougar Gold is that good.",
            "Yeah, I understand Wisconsin sourcing most of the outrage, but Wazzu absolutely deserves a seat at this table.",
            "OK, just wanted to check and make sure that somebody chimed in with Cougar Gold. Phew.",
            "As a Longhorn I agree, that Cougar Gold is really fucking good.",
            "thank you for posting this. cougar gold is a treasure",
            "Holy fuck. I had no idea there was a Linfield flair. Did you go there?",
            "There's not even a close second",
            "It's like if the CFL champion challenged the NFL champion.",
            "Oh SHIT yall done fucked around and summoned Wisconsin.\n\n*[pouring precautionary beer mimosas]*\n\nIt’s all fun and games until you awaken the dairy supremacists.",
            "Cougar Gold clears both of you",
            "Right? Doesn't even hold a candle to clemson blue cheese",
            "Seriously, this is objectively wrong",
            "Wisconsin has the most cheese. \n\nNot sure who has the best cheese. \n\nI think I’m gonna need both UW and Miss St to send me some samples of their best cheeses so we can get to the bottom of this.",
            "We’ve won the last two, might as well make it 3-0.",
            "At the WSU @ Wisconsin game the WSU alumni association had a pregame event and had a cheese off. Twas good.",
            "I second this sentiment, Cougar Gold is fantastic.",
            "Pro tip. If you go to a land grant agricultural school, try the cheese and/or the ice cream",
            "Why not?",
            "Their Edam cheese slaps anything Wisconsin offers down about 7 pegs",
            "I had the coldest chocolate milk of my life the other day. It’s called ice cream",
            "It flows directly from the udders of the reclusive Wasatch Chocolate Ice Cows into those bottles.",
            "It's just a silly joke you joyless nerd",
            "Fucking thank you.",
            "I've had it, and I also live in Wisconsin. It's Wisconsin and it's not even close.",
            "Cougar Gold reigns supreme.",
            "ND also has the worst Touchdown Jesus in college football",
            "Absolutely, and precisely because this is the stuff that makes CFB great.",
            "It’s okay. Wisconsin still takes the cheese…cake",
            "I hate State as much as every other Rebel fan but they make some damn good cheese down there in Starkghanistan\n\nTheir Edam cheese is fucking delicious",
            "[That’s a swing and a miss.](https://www.msucheese.com/product/edam/)",
            "Creamery Irish cream would probably be absolutely amazeballs...",
            "Tempt us not thou heathen!",
            "I agree, WVU has the best RU Hungry!",
            "Hey! We’re number one in some things, too! Charitable giving per capita, vaccination rates (prior to covid), and usually ranked the most hospitable. \n\nWe’ve also moved off the bottom of the barrel in education and health recently. Now we’re like 44th in the country",
            "I suppose. My Wisconsin friends would just kinda chuckle, then sit back down to their dinner of brats, cheese curds, and beer. \n\nI mean it’s like me threatening to kick some boxer’s ass. They wouldn’t be insulted or annoyed…. Just confused.",
            "If there is one thing that Starkville is intimately familiar with inside and out, it’s cows.",
            "Gonna get on my high horse here and say that this comment really irks me, and I would really urge you to sit and think about what you’re saying when you say this. I’m from Mississippi, and I can fully recognize and acknowledge the general cesspool of shit that has plagued the state. I get that “thank god for Mississippi” exists for a reason. \n\nBut when you say “I can’t imagine the state of Mississippi would be good at anything”, you are also saying “I can’t imagine the state with the highest relative population of black people in the country would be good at anything.” Can you see how that can come across as shitty? When people, primarily people who have never lived in the south, write off southern states as lost causes that are destined to be perpetually awful, you are writing off such a large population of underserved people. \n\nAnd to respond to your remark, Mississippi is good at a lot of things. One of the highest rates of charitable giving from one of the poorest states in the country. That’s pretty incredible. The birthplace of the blues, a true American export. Some of the nicest strangers you can meet, I promise you will find in Mississippi. Also, home to the largest rocket testing facility in the world, which companies are flocking to in this New Space era. \n\nI get that it’s easy to dunk on the state, and a lot of it is deserved. And I get that I’m going a little too deep on this and being defensive, but someone has to stand up for the people here. Your sentiment is sadly a common one, and one that should be actively fought. I don’t think it’s your intent, but that line of thinking is dubious at best, and could be argued that it’s unintentionally racist at its worst.\n\nGetting off my soap box now",
            "They have the best State song, [no fucking contest](https://www.youtube.com/watch?v=RzCi5LYRVfk). Show me any other state that has goddamn slide whistles, banjos, polka, jaw harps, and kazoo solos in their state song. I'll wait, you won't find anything better.",
            "Mississippi State has 2 of the best academic supercomputing clusters in the country. They’ve been top tier HPC for decades.",
            "They know how to ring a cowbell",
            "I can think of one thing but it's probably against the sub's rules to talk about it.",
            "What an ignorant comment.  \n\n- some of the best super computers in the country\n\n- first heart transplant\n\n- some of the best food in the country\n\n- NASA’s Stennis Space Center, where literal rocket scientists work.  \n\n- one of the best polymer engineering programs in the country at Southern Miss\n\n- dozens of nationally-ranked academic programs (with some in the top 5) between Ole Miss and Miss St.  \n\n- about 1/3 of all US Air Force pilots are trained in MS\n\nAnd that’s off the top of my head.  There’s more, but you get the point.",
            "Racism. They give Alabama one hell of a fight for it",
            "Cougar gold is the name I think",
            "State has the oldest continuous university bred Jersey herd.",
            "Honestly, the ice cream and cheese at every land grant school should be very good.",
            "This dude dairies",
            "https://www.mafes.msstate.edu/branches/mainstation.php?location=store",
            "And we aren’t afraid to use it",
            "This is actually surprisingly plausible",
            "For SCIENCE!",
            "I respect the fact that you looked upon the threeway tango of cheese-supremacy and said \"You know what, I want in on this.\"",
            "Por que no los dos",
            "Ya I was speaking specifically that made on our campus and sold at the on campus MAFES store.\n\nhttps://www.msucheese.com\n\nGoes on sale online in the fall and usually sells out instantly. Can always get some in store.",
            "It's what happens when you soak the milk while camping in the mountains and your friend shakes it for you by jumping up and down on the air mattress",
            "Yeah cause we sell out, don't use it as a gimmick",
            "Because the one hill on our campus would kill people trying to run down it.",
            "No, but Mississippi State is. They have a thing about cows. They even ring cowbells at their ball games.",
            "Do it naked. I mean….naked.",
            "And by play, I mean fight.",
            "Oooh! How dare you break rule number 1 or 2 or 69!",
            "Wisconsin: \"How bout I kick your ass?\"\n\nMississippi State: \"How bout I jerk you off?\"",
            "***JUMP AROUND ON THEIR BROKEN BODIES … AND CHEESE WHEELS!!!***",
            "Aye Aye",
            "https://www.youtube.com/watch?v=AYzADjsw0gg",
            "And not just the men. But the women, and children too",
            "Wisconsin: “I’m not even getting started”",
            "You'll need to be specific, I don't want my MSU being drawn into the Dairy Rage (TM)",
            "MSU is Michigan State, fam",
            "The crown is heavy",
            "Wisconsin is the Kendrick Lamar of Cheese",
            "*Psst, I see cheese people*\n\n(Custard on the beat, ho)",
            "ooh. and i’m here for it!!",
            "Both EXTREMELY one sided.",
            "There's two things you don't do when it comes to the Midwest. \n\n1. Interact in any capacity with the Ohio-Michigan rivalry.\n\nAnd \n\n2. Insult the cheese heads one thing.",
            "Did someone say cannoli?",
            "There is only one B1G team I won't root for against the SEC, and it's not Wisconsin",
            "Yeah this isn’t even a fair fight. Let me know when Culver’s starts using cheese from… Mississippi?",
            "Lol, I love that. \"OOOH MY GOSH I LOVE CHEESE\"",
            "The fact that you went to your new friends in the Big 10 instead of referring to Cougar Gold is reason #1,287,414 why we don't like you.",
            "Thanks boo. And fuck the Gophers",
            "I just ate and I'm hungry again, those sound so good ",
            "Oh yeah, it's all in good fun, good cheese is good cheese. I'll return the favor with Wisconsin's campus dairy producer! Essentially the same function as what's on your campus, it's a part of the Dairy Sciences program. https://babcockdairystore.wisc.edu/ If you get the chance to have Babcock ice cream, it's unreal",
            "Not gonna lie--never knew this. I road trip a lot, so this is absolutely going on my to-do list :)\n\nAlso, my neighbor up here in Cheese Land is from Mississippi and went to MSU, so I kinda like you guys now.",
            "You have no idea. Their cheese really is that good.",
            "As someone who doesn’t like State, their cheese is unbelievably good. My dad, who’s a bigger Ole Miss than I am, only asks for Edam cheese for Christmas",
            "You’ll think twice when I roll these balls of cheese on you",
            "Holy hell this made me spit my drink up.\n\nWhat’s next? Nebraska has the best tourist commercial?",
            "I respect Cougar Gold as much as the next guy. It's great cheese. But there's only one Dairy State",
            "Three way! Three way!",
            "I think my favorite part of Mississippi State saying they have the best cheese is that it sparked a running battle between Wisconsin and Washington State. There’s something I’m sure we all saw coming for the off-season…",
            "https://www.dairyfoods.com/articles/97146-wisconsin-wins-most-awards-at-the-2024-world-championship-cheese-contest\n\nLol",
            "I trust that man when it comes to food. ",
            "We have no beef with you, Vermont. You gave us the best domestic syrups and Ben and Jerry's. As enjoyers of cheese, Vermont White Cheddar is sublime. But you know that we will not let your challenge go unanswered ",
            "*Is\n\nNo one will ever replace or come close to how absurdly entertaining and genuine he was.\n\nFuck I miss him.",
            "Of course he is...because he is a pirate.",
            "You know what pirates did with treasure.",
            "he graduated from BYU with his bachelors degree but didn’t play football cause of an ankle injury and  played Rugby instead.",
            "It’s so good. I order them around the holidays in a few varieties, cut it, vacuum seal and give them out to friends and family.",
            "I got to checkout and was so excited for some Cougar Gold... Only to find my 2 lb, $33 order required $60 of shipping 😭\n\nI can't justify it cougar bro I'm so sorry",
            "Cougar Gold, from the finest milking cougars around.",
            "My Gawd! That’s the cougars music!!",
            "Now a matchup with WSU.  That’s appropriate here",
            "Hold your head high, cheese king",
            "It's called cougar gold for a reason",
            "CHEESE CHEESE CHEESE",
            "It's just gonna be a 30s fight between a badger and a bulldog with the commercial ending zoomed in on the face of one of them, bloodied, as the lights of life just fade from its eyes. Then 2-3 seconds of silence with the words \"Cheez-Its\" on screen.",
            "Someday I will be in a hospital ward or old folks home and in a moment of lucidity I will crack a smile, bolt upright at a flash of memory and say “I woke up feeling the cheesiest, coach!” and only you true CFB degenerate fans will get what’s going through my mind.",
            "Much appreciated!!!!",
            "Nice but if Wazzu wins, they keep Bucky as the trophy!!!!",
            "Viking even better",
            "This should be evidence enough",
            "Gonna have to agree with you on this one.  Cougar Gold is incredible",
            "Well the statement was so shocking!",
            "That’s like spilling Busch Light!",
            "I will give Wazzu their due credit for Cougar Gold Cheese, Rainier Cherries, Cosmic Crisp Apples and Edward R. Murrow.",
            "Yeah, I'll Stan for Cougar Gold before I'll Stan for Tillamook cheese made at the creamery. And that's not meant to be a knock on Tillamook cheese so much as a testament to how great Cougar Gold is. My dad has been getting Cougar Gold for longer than I've been alive (over 3 decades) and it's still the best cheese I've ever had.",
            "I really want this cheese now",
            "Negative. Was just a fan of them growing up. I went to my primary flair though. There's an obscene amount of flairs on r/CFB.",
            "Let them have this it’s literally all they have going for them ",
            "And...  I think they might be sober...\n\nSource: I just saw them down 5 beers in order to kill their hangover.",
            "The Badger stares into your eyes. Holds aloft a shot glass and offers you one. \n\nYou each do a shot. Another immediately appears. \n\nThe Badger again offers. Unsmiling. Unblinking. Unflinching,  the next shot goes down. \n\nEues locked, the ritual continues.  You feel woozy and unsteady. The Badger appears unaffected.  \n\nOn it goes. You begin seeing double.  The Badger seems to have grown larger\n\nYou know that if you pass out that this is your end.\n\nYou  know fear.\n\nThen darkness",
            "Sorry, we don’t play with amateurs.\n\nhttps://www.prnewswire.com/news-releases/wisconsin-wins-most-awards-at-the-2024-world-championship-cheese-contest-302084762.html",
            "Clemson's cheese is ass lmao",
            "Only fair way to do it. I'll join you for a second opinion.",
            "You need to go to Wisconsin to get their best cheese, it comes out of a fryer and it’s best eaten within 5 minutes of that happening. \n\nThen you eat whatever “cheese” Mississippi State offers you, and you’ll find yourself moving to Appleton a few weeks later.",
            "Winn Dixie here used to sell Wilmont or Wilmot white cheddar cubes, so salty it was like crack.  They stopped carrying it.",
            "https://www.dairyfoods.com/articles/97146-wisconsin-wins-most-awards-at-the-2024-world-championship-cheese-contest",
            "Wisconsin still has the best cheese. We routinely win competitions.",
            "[deleted]",
            "Vermont rules the top spot",
            "Cougar gold slaps",
            "Clemson blue cheese hnnnggh",
            "This is the first I’m hearing about Mississippi and cheese. I’ll have to give it a try sometime",
            "Preach",
            "That sounds nice... You think they have other flavors? Maybe some cheese based flavors?",
            "Yo fuck you too but thank you for the cheese compliment",
            "I’ll take your word for it.  Either way I respect the confidence of them lol",
            "Up to 30th in education this year! Which is super embarrassing for those of y’all we jumped",
            "> We’ve also moved off the bottom of the barrel in education\n\nyou're welcome",
            "Yeah, we don't play down a league.",
            "Low blow, talking about their women like that",
            "Don’t waste your breath on them.  Most people on here trying to dunk on the state know little more than what they read on reddit.  \n\nHonestly, I can’t say I’d ever move back to MS, but it’s as good a place as any and plenty of people love it there.  \n\nAnd Miss St cheese is among the best you’ll find.",
            "I’ve been to the creameries at Miss. State, Tennessee, and Penn State. It’s all delicious.",
            "Really wish I didn’t know enough to be disgusted by this comment. Jesus dude 😂",
            "sounds like a good reason for us to set up a home and home with them!  \n\n(The stadium in Davis is across the street from the dairy barns.)",
            "🗣️GRAB HIS DICK AND TWIST IT",
            "Wearing nothing but a cowbell",
            "JUMP JUMP",
            "“because that would imply I ever stopped.”",
            "Don’t sleep on the msu dairy store ice cream",
            "Hmm, come to think of it, I may start insisting to my Spartan friends that Mississippi State is the real MSU...",
            "Who is really cheesin fam ?",
            "I pray they my real friends\n\n\nIf not I'm YNW Melty",
            "I'm fine with this comparison. Bad news MSU, we're about to drop a 15 minute live cheese show on national cheese day(apparently over 2 weeks ago on June 4th) that you'll never be able to recover from.",
            "You **CHEESY** ***S.O.B.!***",
            "First, I'd go one word on \"cheesehead.\" (Also, to be a complete pedant--I'm an English teacher--it would be \"cheeseheads' one thing.\")\n\nBut that's not why I'm here.  \n\n We're also known for absolute, professional drunkenness.  Please don't sell our talents short, Farm. :)",
            "DO NOT sneak by us to grab the ranch without saying ope. WE WILL kill you.",
            "You forgot shit talking the corn.",
            "Hey Wisconsin has Spotted Cow, leinenkugels, the Hodag, and the Beast of Bray Road…\n\nWisconsin has ~~2~~ 5 things!",
            "Hey now, even we would quietly agree that Mississippi State's claim is flimsy.\n\nWe'd never *openly* admit you probably have the best claim among universities, though. We'd tout our own schools or rank the Dakota States ahead of you instead out of spite. SDSU does have a pretty good one, after all. And there is a Dairy Research Institute in the ag building of the Saint Paul campus.",
            "Yeah anything that isn’t mass produced cheese is going to be some great stuff in my opinion; yall fight about top rank and im just here for quality cheese as a cheese snob",
            "These days going there is about the only way to get it because it sells out so fast when they open the orders. Some friends of mine work in the IT dept at the university and they know the site will crash every year because of the amount of orders that comes in but there isnt much they can do. Also everyone talks about the edam but the jalapeno pepper cheese and muscadine jelly is amazing too.",
            "Yeah, but Wisconsin alone does better than most countries at the international cheese competition.",
            "Yeah this is a big IYKYK situation\n\nEdit: GET THE MUSCADINE ICE CREAM",
            "Let em keep sleeping",
            "I have had edam cheese. It is decent. It is not cheese curds and a Spotted Cow.",
            "Nebraska claiming best corn",
            "\"America's Dairyland\"",
            "There was a contest to name the next apple variety and the only prize was cougar gold cheese. It had 15k entries.",
            "As far as I’m concerned this cheese argument was settled last year in September.",
            "Fuck WSU but honestly Cougar Gold takes it imo",
            "While we are of course grate-ful to our good friends in the Badger state for Brie-nging us the gouda fun that is *That 70s Show,* Reince Priebus, Liberace, and the Milwaukee Brewers, this is nacho fight. Sure, your curds are yummy on ballpark poutine, but you only make this super authoritative last-word list by big cheddar magazine *Food and Wine* 3 times, to Vermont’s 7. We are *easily* the per capita leader. \n\nhttps://www.foodandwine.com/lifestyle/best-cheese-america",
            "Ah yes, rugby, the much less intense and safer option",
            "Mf are you slinging cougar gold?",
            "I think in the summer it requires faster shipping depending on where you live since it’s hot. But winter I think shipping costs are much lower.",
            "Cougar Gold!!!",
            "Just put it in the Cheez-It Bowl!!!",
            "Can't beat us on the field. \n\nCan't cut it against it Cougar Gold Cheese.",
            "Yeah when I ordered their cheese I didn’t pay close attention to weights. \n4 different varieties almost 10 pounds of cheese. \n10/10 would order this again.",
            "That dill garlic or the hot pepper sound great.",
            "Add me to the stack. Cougar Gold clears",
            "It's threads like this that reminds us that football rivalries aren't important.\n\n\nWhat's important is defending our food as better than your's.",
            "Leave Wichita State out of this!",
            "And Keith Jackson?",
            "Well considering almost none of the Tilamook cheese cows are actually in Tilamook County….thats a wise choice.\n\nPlus Cougar Gold is fucking awesome",
            "I respect Tilamook, but Cougar Gold is goated",
            "[Here's a link to make that dream a reality if you so desire.](https://creamery.wsu.edu/cougar-cheese/)",
            "They ship domestically! Here’s the [link](http://cougarcheese.wsu.edu) to buy it.",
            "But cheese is Wisconsin's mascot!",
            "So...ber? WTF does that mean?",
            "Shit, if they ever stopped drinking the cumulative hangover would kill them.",
            "Bruh. You are taking credit for the whole state. Cougar Gold is made by the school and is superior to any other school's cheese. Oh and Cougar Gold has won gold at that event before",
            "I never thought I'd eat cheese side by side with a wolverine.",
            "You boys need a 3rd to break a tie. Yall mind bringing that cheese here to Hawaii?",
            "Cheese curds are absolutely not our best cheese. They are great though.",
            "You tried the curds at Stone Celler Brewery didn't you?  White cheddar flavor with a creamy texture, best in the state.",
            "I’m not knocking Wisconsin’s fine cheese, but this event is hosted by the Wisconsin Cheese Makers Association in Wisconsin so I’m not completely sold.",
            "Competition hosted by the Wisconsin Cheese Makers association places 7 Wisconsin cheeses in top 20? Fucking shocked. I’ll take French, Italian and Swiss cheeses over Wisconsin and I like Wisconsin cheese. It’s good, a few great. But not 35% of the world’s best.",
            "They can send me some cheese too",
            "If you ever had babybel it is a much higher quality version of that.",
            "Y'all are pulling a reverse Uno on the \"Thank God for Mississippi\" crowd, and I don't think I'm ready for that kinda world just yet.",
            "Michigan State, Davis, Mizzou, Wazzu. They’re all good.",
            "The old dick twist!",
            "so thats how they get the milk for wisconsin cheese",
            "Pack it up, pack it in, let me begin",
            "MORE COW BELL",
            "Non sequitur question for you fellow Vol: Do you root for SEC teams playing out of conference?\n\nMore specifically do you root for Bama in a game like last year's against Texas? \n\nGenuinely curious and asking based on your flair",
            "If you could produce a bed sized pile of it, I absolutely would.",
            "A Michigan fan being annoying just for the sake of it? Yeah, that sounds correct",
            "Tried to strike a Curd, but it's probably American",
            "Michigan has great beer, and since Wisconsin is shaped like a squidbilly cosplaying as Michigan I’m inclined to believe you.",
            "New Orleans: pff drinking is our religion it's not just a job",
            "In that case, might I recommend [Ellsworth](https://www.ellsworthcheese.com/) cheese my good dude",
            "I cannot comment until I try your spotted cow, but since you hold the Heartland I’ll take your word for it.",
            "Damn right ",
            "In fairness, a can of CG is like 40 bucks now even at the groceries in Pullman ",
            "The quality of cheese cannot be settled over a mere game, be serious. Do you and BYU fight to see who has the best 7-Up?",
            "Two Septembers in a row, actually.",
            "https://www.dairyfoods.com/articles/97146-wisconsin-wins-most-awards-at-the-2024-world-championship-cheese-contest\n\nLol",
            "This woulda been a great post if you didn't try so hard to make puns. Because of that it's just a good post",
            "Rugby is spring sport. So probably injury in fall then played rugby in the spring",
            "I have been known to, yep. I like a variety but can’t eat it all myself.",
            "They definitely are. Sometimes they sell a hotter flavor, but Hot Pepper really spices up with years in the fridge. So make sure you buy two cans.",
            "The dill is fantastic on a nice cracker",
            "Continuing the chain of fandoms that shouldn’t be agreeing yet set differences aside because this is cheese, god damnit. Cougar Gold goes haaaard.",
            "Especially Keith Jackson",
            "Indeed, though you can still smell the cow manure driving in to Tillamook. Their national production has exceeded what Tillamook as a city can handle so I get it. It's been too long since I've been, that creamery is way too busy most of the time. \n\nBut yes Cougar Gold is and always has been way better.",
            "I was all in until I hit the $60 shipping 🤣",
            "Not sure I can justify $72 in shipping costs for 6# of cheese. Maybe in the winter when temps drop. \n\nTwo cans of Cougar Gold and a can of Viking coming this fall to a fridge near me. ",
            "It's what happens between when you wake up after not drinking enough last night, and when you start drinking today.",
            "Our cheese is made entirely on campus by the school and sold on campus as well. FWIW. \n\nhttps://www.msucheese.com/about-msu/",
            "Technically Mississippi STATE is doing the same thing with their name. I rest my case(I don't have any other evidence or any witnesses)\n\n*Also Washington State smh...the audacity to think they're the entire state too",
            "Cougar Gold is sold in cans. That’s just wrong",
            "How about with a friend?",
            "Isn't a better place to enjoy it",
            "Oh my god dude this is an MMA fight",
            "Diss my Brick, that’s a sin.",
            "Fuck. Bama",
            ">Tried to strike a Curd, but it's probably American\n\n\n\nCrowd: CLANGA CLANGA CLANGA CLANGA\n\nWisconsin: You probably still don't even allow Afri-cans",
            "Wisconsin has a good beer making game and all, but they are better than anyone else at drinking it",
            "I live very close to Ellsworth and they are even better fresh. The best squeak of any cheese curd I've tried.",
            "> a can of CG\n\ndid you say *CAN*?\n\nI've heard lots of good things about Cougar Gold, but I've never heard of actual, real cheese (as opposed to \"cheez\") in a can.",
            "damn right",
            "So…you’re saying it’s…cheesy?\n\nThat’s exactly the sort of failure to appreciate the eternal love of cheese that I would expect of a deluded adherent of that sad realm of second-rate fromagerie.",
            "his wiki says he was injured in high school and was ruled out from playing football",
            "I agree with the Griz flair, Cougar Gold is amazing.",
            "I will say, Oregon (among other things) can claim Animal House which is my all time favorite movie. I watched that movie my first night at college for the first time and then my college experience proceeded to be nothing like that.\n\nStill love the movie though.",
            "Lunch and then an ice cream cone at the creamery is an afternoon well spent.",
            "The secret to cougar gold is you buy it as a holiday gift for someone at a family gathering, then make sure they open it while you're there so you can eat half of it yourself.",
            "It's just $12 for normal shipping! Express shipping costs that $60.",
            "The trick is to always stay drunk",
            "Huh? Our cheese is made entirely on campus but the school and sold on campus as the MAFES store.\n\nhttps://www.msucheese.com/about-msu/",
            "It continues to age in the can.  Really delicious stuff",
            "We are the Dipping Dots of cheese. The future is now.",
            "And yet it clears Wisconsin cheese. Crazy how that works.",
            "Have you ever shared cheese with a Poke?",
            "You twist that dick!",
            "My cheddar don't slack up, punk ya better back up",
            "What’s funny is MSU has the highest percentage of blacks in the SEC",
            "We have a few good breweries (Untitled Art being my favorite), but I’d rather drink Bell’s than most of the crap we drink here. \n\nYes, we have way too many alcoholics.",
            "It's a big ass metal tin, it's not like you're ejecting it out of a can like cheeze wizz",
            "Now we just need an Idaho to complete the set",
            "Wait, you went to Wazzu and your college experience was *nothing* like Animal House? That sounds like a you problem.",
            "Oh absolutely, it's still good. Went there with my wife a number of years ago outside of tourist season and it was a blast.",
            "Yeah but I *really* need it now 🥺",
            "Gotta do something to thin out the cholesterol in the blood stream.",
            "Just making a joke about how the competition results that the UW fan linked up above are from cheese makers across the state unlike Cougar Gold or MSU's. The joke is how you're claiming the entire state because of your school's name like our guy is with the competition results. It was just a dumb joke my guy.",
            "No but I'm rootin tootin ready. Never eat cheese alone unless you're alone or with somebody.",
            "Talk shit about my Brie and the whole crew will act up!",
            "I mean, Mississippi **is** the blackest state in the US by percentage....",
            "Add me also to the Cougar Gold fan list.",
            "Bloody Mary, full of vodka, blessed are you among cocktails  \nPray for me now at the hour of my death, which I hope is soon",
            "Ooooooooooooooooooooooooooooooo\n\nIt’s 5’o clock on a Friday, my brain is fried and I’m dumb, my bad dawg.",
            "Might as well make it a party. This wildcat will bring the bourbon! (Who needs wine for cheese anyways)",
            "Gouda, Feta, c’mon throw your hands up",
            "In fairness, they did try to change that. The in US part, I mean",
            "Lmao, all good. Although screw the both of you since now I need to try your cheeses, and I'm not exactly close to either of your states here in Wisconsin.",
            "We'll bring the corn",
            "Get up,stand up, got the Havarti on back up",
            "https://cougarcheese.wsu.edu/",
            "Ours ships in the Fall for Christmas orders FWIW. But it sells out super fast. \n\nhttps://www.msucheese.com/product-category/cheese/"
        ]
    },
    "In response to the cheapest beer in CFB dispute between Tulane and the Ragin' Cajuns, BYU declares itself home of the coldest chocolate milk": {
        "title": "In response to the cheapest beer in CFB dispute between Tulane and the Ragin' Cajuns, BYU declares itself home of the coldest chocolate milk",
        "score": 614,
        "url": "https://www.reddit.com/r/CFB/comments/1dlafcn/in_response_to_the_cheapest_beer_in_cfb_dispute/",
        "content": "https://x.com/BYUfootball/status/1804210289564660210",
        "num_comments": 272,
        "comments": [
            "Wouldn't this perhaps have too much sugar for BYU students? Don't want them getting all rambunctious. How about some non-fat ice milk instead?",
            "I'd love to see an ice cream competition between schools. The Creamery chocolate milk and ice cream are craaaazy good. Would be fun to sample other schools' best!",
            "This is incredible banter and the most BYU response I can think of.",
            "Can't believe our social media team is just letting this stand, cmon dairy state!",
            "I'm waiting for BYU to get a NIL deal with one of the local soda shop chains.",
            "Congratulations!\n\nI don’t think anyone was challenging for your crown there but go off BYU!",
            "I was in Utah this Spring with downtown so I went to a BYU baseball game and had to go by the creamery. The chocolate milk was really good but it was chocolate milk, nothing special. \n\nHOWEVER the Cookies & Cream Milk was unreal! There’s some truth to the hype",
            "It’ll put you in a sugar coma, but the BYU creamery also sells cookies and cream milk and it is heavenly, easily my favorite drink money can buy.",
            "I’ve tried it, it’s so fucking good",
            "BYU chocolate milk and the ice cream in the stadium go so unbelievably hard. Believe the hype.",
            "that's...actually important information",
            "CHOCCY MILK!!",
            "BYU - home of visitors getting free ice cream and [The Cougar Tail](https://universe.byu.edu/2023/01/30/the-journey-of-the-infamous-cougartail/)\n\nThey love their sugar.  I was told they sold out of sodas in our section too.",
            "I love BYU so much",
            "NGL, milk during an 11 am kickoff in the South does not seem like a recipe for success.  Ill stick to cheap beer and sneaking in liquor thank you very much.",
            "/r/nottheonion",
            "Homelander is salivating rn",
            "As something of a chocolate milk connoisseur, I can confirm that BYU's chocolate milk is delicious.",
            "While I want to dislike this, its actually good.. and the Founders Ice Cream is on point.",
            "Southerners can correct me, but I believe the appropriate response is, oh well bless their little hearts",
            "How cold are we talking?",
            "Fuckin Cougars really gonna make me drive to Provo to prove this? Damn it",
            "Leave it to two schools from Louisiana to battle it out over cheapest beer.",
            "Thinking back to when the cougs came to Austin last season and I hollered “knock the fry sauce out of them!” The reaction felt not unlike how my ex-Mormon ex-gf reacted to the scenes inside the temple in *Under the Banner of Heaven*",
            "Peak off-season show down.",
            "All I remember about BYU stadium snacks was in 2021 seeing students sharing and passing around the 3 foot long maple bars and it kind of grossed me out.",
            "BYU got a lot to learn about these parts… thems fightin words",
            "Thank god for BYU for bailing out our “closest to a Buccees” shit",
            "i would totally buy chocolate milk at a football game.. not being sarcastic",
            "Lol I gotta give credit to anyone who can poke fun at themselves like that",
            "What a bunch of fucking prudes. After U of A, I hate BYU the most in the new Big 12.",
            "On the bright side, LES is probably a great place for shit like this:\n\nSneaky Booze Hidden Flask Pouch For Men And Women: Portable 32oz Undetectable Alcohol Bag. Concealable Plastic Wine Liquor Body Hip Flasks. Disguised Leak Proof Travel Bags For Cruise Concert Festival https://a.co/d/0fdxqmV4\n\nIt's likely so far outside the realm of possibilities at LES that they probably wouldn't even think to check.",
            "$2 beer is awesome",
            "I never understood the expression “corn-fed Midwesterner”, as far as I know the reason I played offensive line in high school was because of how much chocolate milk I drank",
            "I’m sure it’s delicious, but I just can’t imagine how awful you’d feel drinking milk at a September game in the south. My stomach is turning just thinking about it.",
            "hell yeah brother",
            "u/afoolzerrand can you confirm this?",
            "Shane Gillis started this rumor and they just ran with it.",
            "Which school has the best tendies and mac n' cheese?",
            "byu is literally a yogurt commercial",
            "Pretty sure any chocolate besides white chocolate has caffeine in it. That’s a no no AND a fifteen yard penalty.",
            "Most electric gay kids",
            "Reduced fat too? Damn this fools bringing the heat  🔥",
            "Utah States chocolate milk is colder and better.",
            "I need Utah states social media team to make a post about the chocolate factory",
            "Me personally I pour milk in my cereal bowl, warm it, and then pour the cereal after.\n\n&#x200B;\n\nFucking fight me",
            "This is not the way",
            "Any chance we can lure DeColdest to Provo for a sweet NIL deal?",
            "I'm sorry but...\n\nLAME!!!",
            "We need Decoldest Crawford to weigh in here.",
            "Send byu to the sunbelt or something.",
            "Wait.  Doesn’t chocolate have caffeine?",
            "Haha get it. It’s cause they’re a cult",
            "What losers.  Fucking weirdos.  ",
            "Coldest chocolate milk coming from people who claim soaking isn’t sex because you don’t thrust.",
            "Is that what the kids are now calling laying on each other and someone shaking the bed?",
            "I can assure you that MS States chocolate milk is better and colder.",
            "They lie down and have their friends pour the milk into their mouths, then they technically haven’t drank it",
            "> Wouldn't this perhaps have too much sugar for BYU students?\n\nMy gf's BYU-alum coworker drinks at least two Mountain Dews a day. \n\nReally the only thing I've learned about Mormons living in SLC, they may not drink alcohol, but they absolutely find their vices through sugar lol.",
            "Damn. Can't even indulge in some whole milk?",
            "Unflavored for me!",
            "Oh, my friend: \n\nhttps://www.saturdaydownsouth.com/college-football/byu-fan-cougar-tails-robert-griffin-rg3/",
            "I think you underestimate how addicted to sugar the average Mormon is",
            "Utah is basically the home of sugary drinks and treats. They have *multiple* massively successful beverage franchises that literally just sell mixed soda drinks and cookies. The giant dessert franchises like Crumbl Cookies, Dirty Dough, etc that are spreading to the rest of the country are all based there.",
            "You’ve never seen the BYU crowd completely sugar crash by halftime of a noon kickoff have you?",
            "Only if I'm allowed to add heavy cream to make it taste \n again.",
            "You joke, but Utah is obsessed with sugar. \n\nSource: I live here and there is a dirty soda or cookie shop on every corner",
            "I’m not as chocolate as you milk I am",
            "(Don't let the other Wisconsinites know but the best chocolate milk I ever had was in PA)\n\nPSU's won best chocolate milk at our 2021 World Dairy Expo too\n\nhttps://dairybusiness.com/penn-state-berkey-creamerys-chocolate-milk-wins-top-award/",
            "The other Cougars, at Washington State, are mighty proud of their Cougar Gold cheese...",
            "I mean that’s pretty much going to go to any of the ag schools or food science schools right? BYU is punching way above its weight class though, since it’s not an ag school \n\nThe list is basically Washington State, Wisconsin, Penn State, BYU, Clemson, Kansas State, Cornell\n\nIowa State just recently started a creamery, which I’ve heard is pretty good.",
            "Man they better have some elite restroom facilities because the lactose intolerant are not gonna make it through that competition unscathed",
            "You could create a trophy to give to the winner that honors the agricultural roots of the universities with fun add-ons like pictures of buildings on campus, famous statues from around campus, generic football player trophy, black and white photo of the same campus buildings and of course some laser beams.",
            "Facts.\n\nI convinced my SO to make a two-hour diversion in our Michigan road trip last summer to visit Michigan State, just to get ice cream at their creamery.\n\nIt was pretty decent. Didn't blow my socks off or anything, but it was nice and creamy.",
            "I'm ex-Mormon and this is *amazing*",
            "To be fair, your dairy consumption is oft eclipsed by your brewski consumption",
            "If you think that's bad, get a load of Miss State's claim:\n\nhttps://old.reddit.com/r/CFB/comments/1dldrly/in_response_to_byu_declaring_themselves_as_having/",
            "They just walked right in there and stole your cow!",
            "Better be Fiiz and not Swig, or Slurp, or Sip-N Drinks, or Splash, or Quench It, or Sipsanity, or Pop Drinks!",
            "There's a Wisconsin fan below who's wondering if Wisconsin is going to let this stand.",
            "Creamy AND dreamy lol it was so good",
            "The cookies and cream milk is just clogged arteries in a bottle. It's *amazing*, but man it's tough to drink more than like half a pint without feeling terrible.",
            "Was looking for this comment. If their cookies and cream milk could be sold internationally, there would be world peace. \n\nBYU’s Dairy Products Lab just makes great great stuff.",
            "I prefer a muddy float with mint brownie ice cream. ",
            "Overhyped imo but people adore it",
            "Yeah the BYU creamery (or really any BYU foodstuffs) absolutely bodies anything we have to offer. And we're still a dry campus/stadium so legally we don't have that going for us either",
            "Well damn do I need to make a road game to Provo now?",
            "Just like when Wisconsin came and played BYU. The Wisconsin fans sold out a few bars in or near Provo lol. They do love their \"sodalicious\" though.",
            "Underrated reference.",
            "I read that you guys buy the milk locally and pasteurize it on campus. It must be amazing.",
            "My MTC companion drank it every day and gained 10 pounds. I lost at least 30",
            "The scene that got me the most was the scene in his car, in his garage. That was brutally realistic, and definitely something that happens.",
            "I gagged so hard at that video",
            "I would say bring it, corn boy...but I think the game last year already settled that",
            "I can't imagine doing so for at least the first 2/3 of the season. \n\nhttps://www.youtube.com/watch?v=DeY0yPqibb0",
            "You're going to go to Jordan Hare on a September day and drink milk?",
            "An ice cold chocolate milk and a foot long warm maple bar we call a \"Cougar Tail\". Being stone cold sober has never been so good.",
            "At least you have us to fuel your alcoholism.",
            "They stole our hockey team but otherwise I don’t really understand why there’d be any bad blood",
            "Baylor should be up there too. At least for the most part, BYU is true to their bit. Same can’t be said about Baylor.",
            "Well that escalated quickly gif",
            "Most emotionally stable ASU fan here everyone",
            "It's hard to tell if you're being sarcastic, but in case you are not:\n\nI really don't think it's meant to be that deep. If anything, this feels like self-deprecating humor.\n\nAnd just as a side note, I can appreciate that BYU can maintain a status as a loud, passionate, and rowdy fan base without the need for alcohol. Personally speaking, I absolutely need alcohol to have the energy to yell and chant at sporting events. To bring your own energy without it is impressive, but maybe that energy is from spiked up blood sugar so IDK.",
            "Congrats. We never think about you.",
            "Well, it isn't like BYU and ASU liked each other in the WAC... This isn't new.",
            "Me too.  I hate being in the same conference as them.  They are redundant to Utah, so no cool travel involved.  I find the whole religion and culture rules weird as fuck. ",
            "Bruh that's just alternative oatmeal. ",
            "Broke: HVAC NIL\n\nWoke: Creamery on 9th NIL",
            "There are plenty of other places on reddit where you're welcome to argue about religion, so please take it elsewhere. Thanks!",
            "Fun fact: no one has ever actually argued this. It's a nonsense thing that people like Pat McAfee weirdly get fixated on.",
            "Sounds interesting. We should call it “soaking” for them, like they’re helping their friend soak the milk in their mouth",
            "I think I've seen this documentary",
            "Someone took the time to design this cartoon for soaking.  \n\nFreaking hilarious!!  \n\nhttps://en.wikipedia.org/wiki/Soaking_(sexual_practice)#/media/File:Soaking_Illustration.jpg",
            "This is an under appreciated comment",
            "Thanks, u/FesteringDiarrhea",
            "Caffeine was cleared a while back wasn't it. But for a long time caffeine was also a no no, if I'm not mistaken.\n\nA family member is a Mormon and he does indulge in soft drinks quite a bit. I think also caffeine. You indulge in what you can, when you can.",
            "I have no empirical data on this, but I would be hard pressed to believe that any state outside of Utah has more soda and ice cream shops per capita (although I'm tempted to even go as far as to say locations straight up).",
            "So. Many. Soda shops.",
            "Whole milk is good. I grew up on goat milk, so it's not too strong.",
            "That's the same for me too. Some place out by Wilkes-Barre. It was awesome.",
            "Ferdinand’s ice cream is great too, it’s also part of their creamery ",
            "What are we, chopped liver?",
            "I hear a lot of good things about Utah States ice cream out here. Haven't had a chance to try it yet though.",
            "Utah State is also probably in the conversation, as much as I hate to admit it.",
            "Been to Wisconsin’s, Penn State’s, Clemson’s, and Cornell’s. Cornell’s creamery was by far the best, imo.",
            "I am absolutely staggered that you've left out the biggest ag school on earth, although it's probably most well known for the beef-related uses of cow rather than the milk-related uses.",
            "You're leaving out the school with the best ice cream in the country? Shame.",
            "I'd sacrifice my body.",
            "Just post something about the best milk stout, best of both worlds",
            "Who’s h is only eclipsed by the number of DUI’s",
            "Are there really that many?",
            "you forgot at least Thirst, Sodalicious, and Twisted Sugar",
            "I genuinely can’t tell if this is a joke or not",
            "Wisconsin is surely opting to take on Miss State first:\n\nhttps://old.reddit.com/r/CFB/comments/1dldrly/in_response_to_byu_declaring_themselves_as_having/",
            "Damn, the Mormons got to U of U on temperance as well?",
            "I will say Baylor is a lot closer culturally to BYU than ASU is to BYU (pretty obvious I know lol) but for the scenery and dairy products it is worth it IMO",
            "How did you lose weight in the MTC? I’ve never heard of that happening haha",
            "Watching strangers swap spit in a line on a hot day with a manhandled slightly melty over-sized maple bar doesn't do it for you?",
            "ice cold?  yes.  anything else?  no",
            "That moonshine hits differently",
            "Every party needs a designated driver",
            "Fuck Ray, I like you guys.",
            "Go Mammoth/Outlaws/Yeti",
            "What happened with the hockey team?",
            "There are obviously zero official ties between the schools, but BYU and ASU have a few connections. We share some of the same donors and I believe ASU has the greatest number of LDS students of any public school outside Utah.",
            "SALT LAKE SUCKS",
            "For me, I don’t like the religion and think the culture is weird.  They are redundant to Utah. ",
            "As a strong proponent of the separation of church and state, I have no problem adding Baylor to my shit list.",
            "There’s a lot of pent-up angst and energy among people who live in this state for…reasons.",
            "You were offended enough to comment so that’s a fucking lie.",
            "Well the good news is that you don't have to be a practicing Mormon to play in the same conference!",
            "Not the religion, just the university itself.",
            "I refuse to believe soaking is real. Ya maybe a few students did it but it’s now this widespread practice? No way",
            "Living in Utah, I know it’s not common.  But I have utmost respect for any guy that convinced a girl to do it, especially if he got one of her friends involved.",
            "Caffeine was never an explicit part of the dietary code either way. But several historical church leaders (particularly Joseph Fielding Smith and Bruce McConkie) spoke against it, without outright banning it. So within the LDS church there developed a bit of a more strict sub-version of the faith, following a lot of additional warnings and proscriptions. It likely consisted a majority of believers in the 50s through 80s. BYU from the 1950s on was also the center for this more traditionalist Fielding-McConkie-Wilkerson form of the faith. So the school banned caffeinated soda sales on campus. \n\nBy the 1990s this McConkie form of the faith began to lose popularity. In 2017 BYU began to allow caffeinated soda sales on campus. There are still plenty of LDS folk who still follow the Joseph Fielding Smith and Bruce McConkie prohibitions on all forms of caffeine, but it no longer holds the position of “officialness” that it did a half century ago.",
            "It's a loophole. You can't.have \"hot drinks\" like Coffee and Tea b/c of Caffeine but you can absolutely pound that 2 liter of Mtn Dew throughout the day. :rollseyes",
            "They are allowed cold caffeinated beverages now, such as soda. No hot beverages such as hot coffee or tea though.",
            "Soda shops are a relatively new phenomenon. I wouldn't be surprised to see them grow in popularity in other places. Ice cream? Idk. Seems the same as other states I've lived in. There were a lot of frozen yogurt places for a while. Not sure if that's still true. The cookie shop thing is the latest thing spreading around.",
            "A lot of the soda/specialty cookie franchises that are spreading around the country originated in Utah, so I suspect you are right.",
            "Hillside Farms? 👀",
            "Do you want the honest answer, or the honest answer said in a nice way?",
            "It’s actually very good, nothing beats BYU Graham Canyon imo though",
            "Well yeah, I think of you guys more regarding meat than dairy. It was an incomplete list anyways lol\n\nI’m sure sickos committee will open that Pandora’s box and make a list lol",
            "I actually visited y'all's creamery last summer with my partner! It was really cool being able to look into the classrooms around the ice cream store and seeing all the pipes and everything.\n\nThe ice cream didn't blow my mind, though. It was good, and probably worth the hour drive each way to get it and have the experience, but the actual ice cream was just pretty good.",
            "Oh yeah. That’s just what I could list off the top of my head lmao",
            "Utah is a great place to start a local small business, especially if you are tapping an underserved Mormon market. Now that cookies and soda pop are saturated, I’m waiting for the rise of milk and/or milkshake bars. \n\nThe trouble is, when you don’t drink, you can’t just go to a bar to hand out with your friends. Coffee shops don’t work either. So you need a vice that you shouldn’t overindulge in that facilitates sit around and being social. I look forward to the fancy milkshake future. ",
            "Lmao he is actually missing a few",
            "He didn’t even name all of them.",
            "Tbf, I've never heard of most of these.",
            "It is definitely not!",
            "🤣",
            "We just drink at the tailgates and sneak it in.",
            "Both BYU and the UofU were founded by the same guy!",
            "Believe it or not there are actually a whole lot of mormons in the entire state making the rules",
            "The U of U was the original Mormon school lol. Like even today half the Mormon church leaders are U graduates.",
            "I'm just a choccy milk addict",
            "I definitely had extra weight to lose when I first got there. I was there for 12 weeks during the summer so I played soccer everyday and just ate PBJs all the time. The lbs flew off",
            "Only when it comes from your blinded holler uncle.",
            "It'll get you there, It'll get you there quicker,\nFruit jar full of that good corn liquor",
            "Have you seen Utah Valley drivers? I’d trust a drunk West Virginian over y’all to get me home safe.",
            "Coyotes, long story.",
            "Idaho State will have a higher proportion, but yes, ASU for largest number. A family in my ward in central California are all Sun Devils: Mom, Dad, Daughter 1, Son-in-law, Son. I expect Daughter 2 will do the same.",
            "Smells too, but that’s just more reason to dislike the Utes if anyone",
            "BYU is also not even in the same county as Salt Lake.\n\nThough if you are talking about the lake itself, it is meh at best.",
            "Sure it’s a bit weird but they’re in large nice and keep to themselves. Good neighbors to have.",
            "I've moved back to California, but I like to have fun at sporting events. Being loud is more fun than not being loud.",
            "Don't let Freud go to your head.\n\nWe cheer cause it's fun, nothing more",
            "Lol",
            "yet.... we're playing the long game",
            "I mean... if we're being honest, all of us are kinda cultish about our obsession with teenagers playing a ball game",
            "Some very anti “BYU” friends double down on this… it’s just a funny stereotype similar Alabama folks use tinder to organize family reunions.\n\nI’m sure it’s happened, but because of the ridiculousness of it, it spread like wildfire and the story grew.",
            "Akin to the butt funnel but you best believe I’ll be bringing it up the third week of October every year for eternity.",
            "It's absolutely not a thing. It was a stupid joke 15 years ago, and I can't believe it's still around lol",
            "Just went down a 5 minute Mormon rabbit hole and came across a big scandal concerning \"SEC violations.\" I got very confused.\n\n(Apparently it was a big case where the LDS church was caught committing shell company fraud by the Securities and Exchange Commission).",
            "It's just a fun way to make fun of weirdos.",
            "You have a firm grasp on reality. It's not real at all.",
            "Definitely more of an internet thing.",
            "Soaking isn't real but what about Jump Humping? /s",
            "Like climbing a 10 ft ladder with only 2 rungs on it",
            "Caffeine has never been the prohibition, it's coffee and tea. Some people extend their personal observance to it, some don't.",
            "I never understood this. Iced coffee is also off limits too though, right?",
            "Rolling your eyes and religious beliefs you aren’t familiar with is your choice of course. Caffeine intake has never been officially discouraged. Coffee and Tea have been discouraged since 1833, people have assumed that was because of caffeine, but that’s an assumption. Many members have taken the better safe than sorry approach and expanded this to include caffeine for themselves and their families.",
            "Just like the poophole ",
            "They got a few lawyers on loan from Hell and really took an axe to the rules.",
            "I think frozen yogurt shops were a big thing a while back everywhere. Definitely a lot of them in oklahoma in the late 2000s/early 2010s but not now.",
            "Y’all are just getting the cookie shops? \n\nThat was a couple of years ago for us",
            "Aw dang it let me look. \n\nEdit: [Yep that's the spot!](https://g.co/kgs/UdjK5m8)",
            "There is one thing that does... Chocolate Graham Canyon! They started selling it this summer.",
            "That's fair, I'm not even sure if we have a creamery on campus. Hard to compete deep in the heart of Bluebell/HEB territory.\n\nIncoming refugees from r/collegebasketball will give us bar graphs on a leaderboard before long and end this terrible era of confusion, I pray.",
            "This is why I don't go south of Holladay or north of the Avenues.",
            "what the fuck",
            "No joke, I am in PG and a milkshake bar is having their grand opening tomorrow here.",
            "I don't think they exist outside of UT, ID.",
            "Sneak is generous. More like carry it in. I was at a game last season and a girl came up with a grocery bag full of white claws and Jell-O shots. We had bottles of vodka and cans of beer in our pockets.",
            "The territory's flagship university changing name and locations is a microcosm of the relationship between the Church and the government.",
            "No way. I live in Utah and had no clue that was the case.",
            "I know next to nothing about Utah. I went to SLC and Park City when I was *maybe* 4. Haven’t had the chance to come back. Here’s the extent of my knowledge on your state:\n\n1. Mormons live there \n2. Jimmer Fredette \n3. You just stole the AZ Coyotes hockey team and the new name SUCKS lol",
            "If you do end up coming for a game check out the cookies n cream milk too. It’s pretty dang great",
            "Okay I could see that. I didn’t gain anything thankfully, but my MTC companion could barely button his pants when we left. We went stateside so we were only there a few weeks too. It’s like the kid had never eaten before and went hog wild on the all you can eat.",
            "Forgot about that, I saw your Arizona state flair and had college hockey on the brain.",
            "This is bandied about but is very overblown. The lake effect isn’t every day or even close to it.",
            "Always has been. I remember \"swimming\" at Antelope Island as a kid. By swimming I mean we swatted brine flies all day long. I shit you not, Google \"brine flies\" and it will suggest \"brine flies antelope island\".",
            "> keep to themselves\n\nYou're kidding, right? There's a gigantic part of their religion where members go all over the world and try to force their religion down everyone's throat.",
            "I think it’s when Pat Mcafee starred rolling with it and it caught on. I’m definitely not a byu fan but I thought “people can’t believe this right?!” 😂",
            "Funny thing is that Rhode Island and New Jersey allow consensual incest while Alabama is one of the stricter states on it, making it a Class C felony.",
            "Too be fair, theres a popular Utah fan on twitter that outed himself as having done it and then tried to backpeddle.",
            "\"ThAtS not A rEaL thing!\"\n\n\n\"I cAnT bElIeVe PeOpLe StIlL tHiNk tHiS iS a ReAl ThInG!\"",
            "I mean, maybe to them you're the weirdo.",
            "I've always been told that it was \"hot drinks\" which included coffee and tea, but it was b/c of the idea of keeping your body clean and not being dependent on any substance.",
            "so picking a choosing, got it.",
            "Iced coffee or Tea is still off limits but a hot glass of milk is Ok",
            "it's for...  we don't know, some dude decided.",
            "Better safe than sorry?\n\nSorry about upsetting the remixed God of their flavor of Christianity? They already made up their own version of Christianity, why not throw in some weird rules based on nothing?",
            "I mean it's been a few years. Crumbl and several of the competitors started in Utah.",
            "What?! Time to make a trip back to Provo",
            "Curious to see if it goes for the same industrial chic that the cookie and soda pop places go for or if they will pivot to a more coffeeshop or pub format. \n\nThat’s the one bit these places haven’t figured out - how to get a group to come in and have a few drinks and hang out while they spend more than they had planned. Having nailed the milkshake, my next bit of prophecy is someone is going to figure that out. Someone, somewhere (probably in American Fork) will say “I couldn’t pay tithing because I was out drinking coconut Diet Cokes with the boys.”",
            "At the Florida game, the guys right in front of me were hitting vapes and chugging mini bottles all day in the stands",
            "Yup. The University of Deseret was one of the first projects he authorized in the valley after the pioneers started rolling in. Schools in Provo began opening a few years later, but pretty much all of them had financial difficulties and cycles of closing and reopening for years. At one point, Provo's school was a southern branch of UD. Finally, Brigham Young Academy (fully owned by the church) opened in 1875, while we had been operating continuously since 1867. So we're the older brother, basically",
            "Y’all have cookies and cream milk for sale in the stadium? 👀",
            "I travel to SLC a few times a year for work and have never smelled anything but self-righteousness. And that's mostly in my head.",
            "Is it even from the lake? Thought that was a legend",
            "The inversion is much worse than occasional lake smell. SLC is much closer to the mountains than Denver but has worse winters and pollution as a trade-off",
            "They don’t kill you if you say no, so by those standards they’re ahead of the pack",
            "There is definitely a contingent of people that like to make BYU and lds members look bad no matter what, and thrive on adding fuel to the fire of hatred or mocking.",
            "I'm 30 and we (not mormon) were making jokes about about soaking Mormons while I was in high school in Southern California. It's been a thing for awhile",
            "People called it \"docking\" 20 years ago.\n\n\nIt definitely didn't catch on just last year.",
            "Because it has to be a real problem before they start legislating against it",
            "thank God",
            "Same.",
            "That's essentially correct, except that \"hot drinks\" is literally exclusive to coffee and tea, and doesn't include any other hot drinks besides those, and it does include cold versions of those drinks like iced coffee and tea.\n\nBut yes, you are right about the reasoning.",
            "Yes, in a manner of speaking, but the actual verse prohibiting it specifically says to avoid hot drinks, and the general interpretation of that has been tea and coffee.\n\nOf course, cold tea and iced coffee aren't allowed, but hot chocolate is, so it's really just whatever that one dude said one time that it was supposed to mean. The caffeine thing kinda was hinted at by some higher ups but afaik not *formally* prohibited. \n\nBut yeah soda is absolutely MASSIVE in Utah. They have drive thru soda shops like mini coffee stands. Shits wild.",
            "This sounds well researched",
            "It's totally worth it! Hope they make it permanent. Maybe it can be Kevin Young's flavor of ice cream, since they need a replacement for \"popes post game snack\".",
            "It isn't, actually. In your head, that is. When I was at school at BYU I couldn't stand Utah mormons. I was a Mormon at the time, but not from Utah, and it genuinely annoyed me so much even then. There were often discussions amongst friends about the differences between Utah mormons (and to a lesser extent Idaho) and mormons that lived in places where it isn't the dominant religion, we were all mormon.",
            "It’s from the lake and it happens like 4 days a year.",
            "I was just in Denver and didn’t even see any mountains. Disappointed.",
            "I also thought it was due to the side of the mountains. The weather generally blows west to east, so SLC being on the west side of the mountain range means the smog gets stuck there for a while, while Denver is on the east side and so once its passed the mountains it blows over quickly.",
            "No different than the weekend marriages and divorces in Vegas or Mormon horns, only it found legs thanks to social media. \n\nAt first it annoyed me. Then, like y’all have pointed out, it’s a bit incredulous to think someone believed it. Now, I’ve realized that it’s a great way to tell if someone has the capacity for critical thinking ",
            "Those student interviews do enough to make them look bad lmao. They’ll legitimately ask BYU kids some softball question like “Would you rather allow gay marriage or throw a box of kittens into a wood chipper” and they’ll be all like “Woooow erm, idk, that’s a tough one!”",
            "To be fair, LDS members (I remember that multi-million dollar campaign about a decade ago where the church ran TV ads saying that \"Mormon\" *was* the preferred term, but the church definitely doesn't want us looking into its history) often happily toss that fuel on themselves",
            "LMAO!",
            "Golden and Morrison are the best spots if you want easy access to the mountains and the city. Expensive to live there but worth it to find a Red Rocks concert and make a trip out of it IMO",
            "I was in Aurora for an AYSO conference. Mountains were pretty but far away.",
            "> Mormon horns\n\nI'm not familiar with this one, but I think I would like to be.\n\nEdit: I did a duckduckgo. Is it really just a sterotype that Mormons have horns? dafuq? lmao",
            "No the Mormon Super Date was totally real.  I heard about it from someone at EFY who's sister was at Snow College and leaned about it at a singles ward event. \n\nMASSIVE /S in case anyone buys this.",
            "Its social media. They ask people for like 3 hours and cut it down the the handful that looked crazy. I saw a video of students from another university who didn't know how many years were in a century, or couldn't do addition of two digit numbers. Not pictured were the 1000 people who were able to do that that didn't make the video.",
            "If you are on Reddit you have to be old enough to realize that all of these \"man on the street\" interviews are basically a demonstration of the ability for the creators to edit. Yes, if you interview 1000 BYU students, 10 of them will be batshit crazy, but you have to edit out the 800 people with perfectly normal answers and the 90 people with really well reasoned responses that if played with the right acoustic guitar would end up with a \"faith in humanity restored\" caption. \n\nIf you actually think they are demonstrative of BYU students, you are willfully allowing yourself to be duped because it follows your own bias.",
            "Yeah. \n\nThe upside to growing up with that is you aren’t bothered by soaking or whatever comes next. \n\nBesides, we have our own absurdities. Kids these days don’t really know Steve Martin, but I remember the number of people who told me he (among many celebrities) was secretly a Mormon, since if it came out it would ruin his career. There are enough Mormons in the pop culture sphere these days that I don’t think those stories crop up as much now, but I’m sure some still float around. "
        ]
    },
    "What’s the funniest moment in recent CFB history to y’all?": {
        "title": "What’s the funniest moment in recent CFB history to y’all?",
        "score": 44,
        "url": "https://www.reddit.com/r/CFB/comments/1dlpxsm/whats_the_funniest_moment_in_recent_cfb_history/",
        "content": "Hearing Ryan Day scream about “Ohio vs the world!” while being fried out of my mind still cracks me up #WheresLouHoltz",
        "num_comments": 141,
        "comments": [
            "Pole Assassin is an all time favorite memory for me.",
            "[First thing that came to mind.](https://streamable.com/dbjm7a)",
            "Nothing is funnier than losing by refusing to do the victory formation",
            "How is it not the picture of Stalions on the CMU sideline with the video glasses?",
            "Ooooh there’s a few that come to mind. The weird dog peeing Ole Miss Egg Bowl celebration, the whole Connor Stallions saga, and the Florida shoe throwing incident are on the list for me. \n\nBut my favorite was the Miami vs GA Tech game from the past year. Hilarious collapse and ending to that game, it’s an all time great collapse.",
            "Uh... when a Utah player drops the ball before entering the end zone! I wish I knew how to upload the video!\n\nPlus since you mentioned Ryan Day... I loved when Whittingham said \"you're welcome Day!\"",
            "In no order:\n\n[shoe toss](https://youtu.be/Fif3Rkl5_nQ?si=-2twZeybLT4vlc6i)\n\n[the piss and the miss](https://youtu.be/hPek6FrrKYE?si=RnFPYib3GTzv7He-)\n\n[what is Britney doing with her life?](https://youtu.be/1ZaWvk6j0hk?si=yIH29iRjKz0IHC4A)\n\n[he was giving him the business](https://youtu.be/Gmn7luiDPsU?si=j7zq3i_PNaqIZpXM)",
            "Georgia State decisively beating Tennessee in Neyland. \n\nNew Mexico State beating the dog shit out of Auburn in Jordan Hare.\n\nMarco Wilson cleat yeet.\n\n[Louisville's Willie Tyler doing a cartwheel in an attempt to distract Boston College's defense (didn't work)](https://youtu.be/WcPiSfyzPZU)",
            "Seriously. Who throws a shoe?",
            "Jameis Winston just slipping and dropping the football against Oregon in the CFP will always be top of this list for me lol. \n\nI also get a kick out of the UGA football players who get arrested for a traffic offense every other week. I have a buddy who went to UGA who swears this is an issue with Athens PD and not UGA.",
            "if I wasn’t a Gator, I would also think the cleat yeet was funny,  but . . , (::falls asleep crying::)",
            "Hugh Freeze coaching out of a hospital bed in the media booth.",
            "As much as I like Sam Darnold the jinx the announcers put on him vs Washington St was too funny. \"Sam Darnold wouldn't want it any other way\" Sam proceeds to turn the ball over USC loses. \n\n\n\n\n\n\nAfter Tennessee lost to Georgia St I spent the next 8 hours listening to Tennessee call in shows listening to drunk Tennessee fans roast the hell out of Jarrett Guarantano. \n\n\n\n\n\n\nAlso Jarrett Guarantano going into business for himself vs Alabama. Jarrett hands the ball off its a walk in touchdown. Instead it's a scoop and score for Bama. ",
            "I mean I think Maryland sweeping Texas during our home and home in 2017-18 was pretty funny but that’s just me",
            "Texas A&M missing the game winning kick against App State",
            "Last five years off the top of my head: \n\n2023: GT vs Miami\n\n2022: Texas A&M / Jumbo Fishtard\n\n2021: Tennessee Mustard Bottle\n\n2020: Florida Shoe Toss\n\n2019: Egg Bowl",
            "The piss miss has got to be it for me. Guy loses his team’s biggest rivalry game by imitating a dog taking a leak? That’s college football at its finest.",
            "Not recent, but I never tire of [Gators blocking Gators.](https://m.youtube.com/watch?v=lDjHRtbN9kk)",
            "Lane Kiffin & Mustard Bottles",
            "Utep [celebrating]( https://youtu.be/U7xIOiKWTCo?feature=shared ) in front of FIU’s Lamborghini.",
            "Cleat Yeet",
            "That time BYU ran a fake field punt on their own 5yd line on a 4th & 19 always cracks me up",
            "Honestly, who throws a shoe?",
            "Woah he has trouble with the snap and the ball is free! It’s picked up by Michigan State’s Jaylen Watts Jackson! \n\nAND HE SCORES ON THE LAST PLAY OF THE GAME! UNBELIEVABLE!",
            "Miami … ALL YOU HAD TO DO WAS TAKE A KNEE",
            "Bevo tries to take out Uga.",
            "I thoroughly enjoyed Lee Corso saying \"ah fuck it\" live on GameDay that time. I still giggle sometimes.",
            "Georgia 49\n\nOregon 3\n\n😂",
            "Civil War 2022\n\nOregon leading 31-10 with 4 mins left in the 3rd.  Beavs take a 34-38 lead with 8 mins left in the 4th *without throwing a single pass* and hold on to win.\n\nQBs stat line for the game:  6-13, 60 yds, 2 INT",
            "Jordan Battle recounting Nick Saban’s love for Deez Nuts jokes.",
            "The last 3 minutes of Iowa vs. Nebraska from last season was *flawless*\n\nRIP B1G West, you will never be forgotten",
            "Pitt going from first and goal at the 1 to kicking a field goal from the 1, down 7 with under 5 minutes remaining in the 100th and final scheduled edition of their biggest rivalry... And then ringing it off the post. \n\n\nhttps://x.com/nocontextpsuftb/status/1797628347117343077?t=sRdmMT4QE75enAuwkCr-SA&s=19\n\nI also never sit in that end zone, but we were right there for that game. You could hear a collective laugh as it hit the upright.",
            "The last few minutes  of the 2018 Commonwealth  cup. It was as crapshow down to the fumble into  the endzone that 3-4 UVA players failed to cover, leading  to a overtime touchdown win by VT.",
            "That Illinois/ Penn State overtime fiasco",
            "Not the actual game, but everything going on with pop tarts in that bowl game.",
            "Does the Pop Tart guy being lowered into a man-sized toaster count?",
            "Lennay Kekua. I'm not sure if it was funnier at the time, now it's just sort of surreal and kind of sad. But that was some crazy shit.",
            "West Virginia losing to pitt 13-9",
            "3rd & 93\n\nI’D LIKE TO KNOW WHERE LOU HOLTZ IS RIGHT NOW\n\nClimb to 325",
            "That time we beat Oregon three times in a row, but after each of the first two victories, their fans where so pompous, they acted like they let us win. Then we did it a third time in Vegas, and crickets.",
            "Michigan State vs Baylor in the cotton bowl and the kicker just gets lit up.[kicker crumble](http://2.bp.blogspot.com/-IaDyfW48eC4/VKXDlGBHwFI/AAAAAAAAxvQ/vxKSlEvElCU/s1600/kickerblammo.0.gif)",
            "Michigan getting caught red handed full cheating for 3(?) years and getting zero punishment for it whatsoever. Even the *entire* coaching staff abandoned the school to avoid punishments but nothing happened. It's more the fact that it's so sad that it's funny rather than just funny",
            "Urinating Dog",
            "Colorado’s hype train running of the rails after getting bulldozed by Oregon",
            "I’m going with the cleat yeet specially for the ref call afterward. \n\n“After the play, unsportsmanlike conduct, #11 of the defense, throwing the LSU player’s shoe 20 yards down the field.”",
            "The Oregon Duck dressing like Deion and being on College Gameday",
            "Recent history? I gotta go with Miami not taking a knee, the Florida player throwing a shoe, Michigan punter dropping the snap, Ole Miss peeing",
            "It's either Brian Kelly calling for the execution of his team or the PBJ tunnel incident.",
            "The book that guy wrote after Tennessee beat Alabama",
            "Me (Michigan fan) and my non Michigan fan friends doing a cheers and taking a shot as \"trouble with snap\" starts happening live was pretty damn funny for them.",
            "The Hugh Freeze liberty hospital bed in the coaches’ box is just unbeatable to me.",
            "Reggie Ball 4th and 19",
            "Miami vs GT.",
            "The Minnesota coach eating a dilly bar in a blizzard during a game was wild. Was this psychological warfare?",
            "Miami vs Georgia Tech lmao",
            "“Talking about winning bowl championships, they’ve w…they’ve won the biggest championship and that’s the championship of life.”  \n-Butch Jones",
            "No 20 UW - 7\n\nMontana - 13",
            "When Coach Cig grabbed a student assistant phone and shoved a picture of the prior play into the refs face while arguing for a flag",
            "Let A Naysayer Know",
            "Tennessee fans talking ungodly amounts of shit before the 2022 game in Athens and then blaming a very light rain for their loss.",
            "That first Texas loss to Kansas",
            "That player on Florida who tweeted before the Utah game “little aaaa stadium”. The karma was deliciously funny. ",
            "Anytime Alabama beats UGA…we’ve taken so much from them, lol.",
            "Miami. You know what I’m talking about",
            "When you’ve spent the last decade losing and you come up on your first winning season and think you can talk crap….. I ain’t mad atcha 🤣🤣🤣🤣",
            "It was the story that just kept getting better with each new reveal:\n\nChild bitten at Longhorns' coach's house on Halloween.\n\nBite was by a monkey.\n\nMonkey belongs to his girlfriend.\n\nGirlfriend is a stripper.\n\nHer stage name is Pole Assassin.\n\nThe monkey goes on stage with her.\n\nShe has been on Springer.",
            "That was pure gold",
            "/r/wallstreetbets used to be full of gems like this. Then GME came along. Sorry but this made me think of that",
            "What movie is that from?",
            "I'm gonna laugh so hard when texa$$ falls flat",
            "*Mario Cristobal wants to know your location*",
            "*1999 Baylor has entered the chat*",
            "I still don’t really find this funny. I honestly find it haunting. Like it’s one thing to lose on fluke mistake like “Trouble with the snap” but to lose because you actively chose to not just end the game? I don’t know if I could ever get over that. How do Miami fans still watch their team after that?",
            "Me watching the end while hysterically laughing: “dumbasses”",
            "Not the picture though, the funniest is the video where he peaks his head out and takes a picture with his spy glasses lol\n\n[Link](https://x.com/LateKickJosh/status/1719753191292535191)",
            "And that it was discovered by a message board poster…",
            "Damn just realized how absolutely baffling it is that Michigan didn’t get punished for that whole thing.",
            "Damn I didn't even realize it, but I think this is the answer lol. Just anything to do with Stalions was top tier college football comedy greatness",
            "Cleat yeet, ole piss, and Miami not kneeling it out are my top three. I don’t know enough about the stalions situation but I think this nails the top of the memes for the last few years. Only other one I’d add is pole assassin but I understand why you left it off as a Texas fan",
            "Ah yes, the ole Piss and Miss game.",
            "The piss and miss is iconic",
            "I was lucky enough to listen to it on radio as I was driving home.  Just flipping through games on sirius. The Miami announcer was melting down and ready to fight a ref",
            "🤣🤣🤣 Thank god Joe Walker scooped the ball up and ran it back. That game was going to be an ah whooping for Oregon…..Changed the Momentum real quick",
            "What is Britney doing with her life is one of my favorites",
            "I am partial to the [original giving him the business](https://youtu.be/Jl-s5O7n95A?si=7qjUuj1Ft3Vma56N) from the NFL",
            "He was giving him the business is probably the best penalty call of all time",
            "Jacksonville State beating FSU\n\nJust want to shout out Jax State making the banner today. Don't mess with our Lady Cocks, they seen some shit in 'Nam.",
            "I love Brohm because we do dumb shit like O Linemen doing cartwheels to try and set up our trick plays lmao.",
            "the old “Cletus yeetus playoff deletus“",
            "*reads Jameis Winston’s name* \n\nSIGH",
            "The funniest part of the Jameis fumble is the ref falling down",
            "I mean, tbf, we did have a freshman get jailed for going the wrong way down a one way street",
            "I’ve lived in Athens for 10 years and I’m gonna disagree with your buddy. Love this team to death, but it’s not an ACCPD issue on the whole. A couple of them? Sure, maybe. But not all of it.",
            "Guarantano got a lot of shit from fans during his time playing, but you won’t find many Tennessee players past or present that gave more for that team than him. He definitely wasn’t our best quarterback of the last 30 years, but he was damn sure the toughest.",
            "I watched the 2017 game while tearing out drywall from my house that had been flooded in Harvey, hoping it would be a nice thing to cheer me up. It did help give me energy to destroy a lot of drywall.",
            "Haha yeah, the only school that would ever do something embarrassing like that. Right guys?",
            "That was awesome. To me, the funniest part is that College GameDay was likely headed to A&M/Miami the next week, but came to Boone instead. Beautiful. Even though I know those guys print money, it was pretty funny and fun to steal a big chunk.\n\nThe outcome of that game also turns the previous night’s Midnight Yell from the least funny thing in the world to the funniest thing in the world.",
            "You called?",
            "I’ve never been happier about losing a game",
            "I heard this in Strongbad’s “babies having babies” voice for some reason and it was even funnier",
            "I can’t believe I forgot about this omg",
            "Sometimes, a team just has your number.\n\nAnd we had Bo Nix' number.",
            "Obviously I enjoyed that one, but the announcers absolutely let Oregon have it. I remember when Sean McDonough suggested they start the tackling drills on the plane ride back to Eugene…",
            "ngl i turned the game off after they went up 31-10, went home took a nap and woke up to 10 missed calls from my dad lmao",
            "That's fucking football right there!",
            "Oh man I had completely forgotten about that one.  Just rewatched the …ahem… “high”lights",
            "When worlds collide: the most Nebraska and most Iowa games of all time played simultaneously.",
            "[a true masterclass](https://youtu.be/oh46bPQ7JRQ?si=Ejo6pmE_YPc9Y8bJ)\n\nForgetting to start the clock really set the tone",
            "I wish I was offline enough to truly appreciate Lou holtz catching strays on live broadcast tv. Also you know that man went to bed hours ago.",
            "\"Nah bro, losing a close one to a good team and beating up on terrible teams is way more valuable than, like, actually beating good teams. We beat every other top ten team 99/100 times in the simulations I made tf up in my head, so we're basically the #1 team.\"\n\n-Oregon fans, all of last season",
            "Love",
            "I'm a fan of neither team but I am always happy when Alabama beats Georgia like they have been these past few years except in 2022(Georgia won for Vince Dooley).",
            "Hey! It was a *support* monkey!",
            "You forgot “He left his wife and children to be with his stripper girlfriend”.",
            "American Hustle",
            "> I don’t know enough about the stalions situation\n\nConnor was on the Central Michigan's sideline while they were playing Michigan State in Central Michigan gear and he was wearing video recording spy glasses. \n\nThere's a little clip of it, That's pretty solid meme material.\n\nEdit it was below \n\nhttps://x.com/LateKickJosh/status/1719753191292535191",
            "Hell yeah. If we hadn’t lost that game we’d have been stuck with an unqualified OL coach as HC for another year ",
            "\"Is she here?!?!\"",
            "Who???",
            "I’m apparently the most active Jax State flair on here so I was asked for input on the initial design of the banner, and I’m proud to say the nod on the top right to the Marching Southerners was my idea. As much as they’re synonymous with the school and athletic program, I thought they deserved their own corner of Reddit fame.",
            "Cletus Yeetus *committee only drops them by one rank*",
            "Crab legs was funny too.",
            "d e a r  s t r o n g b a d\n\n(and the reason is because you’re old now)",
            "Sometimes a team lets flashy uniforms and a fat bank account go to their heads.\n\nThen they play a real team. 😃",
            "You missed some electric handoffs from Ben Gulbranson as he ascended into his true form; Bengal Branson",
            "Most oregon fans were arguing us over Texas... who also lost to UW",
            "I miss you, PAC-12 brother.",
            "Bama has directly cost them two maybe three National Titles. It’s amazing, underrated series.",
            "Pretty sure he was getting that divorce even before he met Pole Assassin. There were rumors he had some side piece in Los Angeles area while at A&M (and still married, no less).\n\nHe'd meet with her everytime he'd go out on recruiting trips (which Cali was his designated recruiting area, so fairly often).",
            "no no, the best part is that the kid is psychotic \n\nhe wrote a Manifesto detailing his 10 year plan to be the head coach. He also was being paid by the alums to video record games every week, through a fake vacuum repair store",
            "Love the completely genuine exasperation lolol",
            "I enjoyed the beat down, but honestly the way Oregon responded after the loss gave me a lot more respect for them. I think they’re a solid team and I can’t wait to play them again.",
            "I mean, most oregon fans thought we were going to lose that game",
            "And unlike Oregon, we had greater feats to point to than \"lost to Washington, squeaked by Texas Tech, and beat up on mediocre Colorado and Utah teams.\"",
            "My name is Benjamin T Beaver.  Commander of the Stihl Curtain, General of the Dam Nation, loyal servant to the old alliances.  Member of a murdered conference, partner in a murdered rivalry.  And I will have my vengeance, in this season or the next.\n\n🫡🫡🫡",
            "The rumors around him have been there for as long as I can remember. No hate for guys like that, just don't get married.",
            "You had 1 good feat in week 2",
            "Even if that were the case, 1 is certainly better than 0, especially when that 1 is a top five road win. Let me know when Lanning gets one of those that isn't hypothetical. Hell, even Cristobal pulled that one off.",
            "Nobody was arguing for Oregon over Texas if they lost the ccg. It was if Oregon won the CCG they would have avenged their only loss vs a top 5 team on the road on a neutral site later in the year.",
            "And that's the problem with the polls ranking Oregon over Texas all season. It was based on a hypothetical instead of actual on-field results. Texas actually had a top 10 win, while Oregon was getting propped up for the *possibility* of getting one later on in the season. That's what never made sense. Even if that had borne out, Texas still would have won their own conference championship with a win over the likely SEC champion.\n\nIn either case, neither is justification for having Oregon ranked higher all year for \"eye test\" reasons, especially when Texas kept winning games with a backup QB starting due to injury.",
            "It was based largely on results as well as the fact that Texas had a worse loss. It came down to how the media viewed best win vs worse loss and it seemed like the media cared more about the loss. \n\nIt sounds like you have more of a problem with the media than Oregon. \n\nBut I do find it funny that Texas fans like to pop off to Oregon like they didn't also lose to UW in the 22-23 season, talk endless shit about beating them in the playoffs, only to lose again."
        ]
    },
    "The Penn State Whiteout Should Always Be At Night": {
        "title": "The Penn State Whiteout Should Always Be At Night",
        "score": 807,
        "url": "https://www.blackshoediaries.com/2024/6/21/24183082/penn-state-football-nittany-lions-whiteout-game-should-be-at-night-every-year-fox-big-noon-kickoff",
        "content": "",
        "num_comments": 213,
        "comments": [
            "From a marketing perspective, having the White Out at night vs a top tier opponent is good for the conference. Unfortunately FOX having multiple premium picks to throw it at noon lowers that chance.\n\nWish we made that one of our \"tolerances\" the big boys of the conference get, maybe trade it in exchange FOX gets one of our home games to put on Friday night.",
            "Going there in 2018 was probably my favorite away game ever..... great atmosphere, great game and the Penn State fans were really nice",
            "Fuck Fox for a variety of reasons but most especially Fuck Big Noon.",
            "I wonder if Penn State is working behind the scenes here to try to get a some assurances on start times because even if they do Illinois, if might not even be a night game. \n\nPretty ridiculous how the big ten doesn’t step in on the one tradition PSU has. ",
            "[This atmosphere](https://www.youtube.com/watch?v=VypxiD8GOxY) should be one that is NEVER messed with.  Listen to that shit.",
            "I also wish they were announced along with the B1G schedule.  I know there's a bidding process for games, but as someone who would LOVE to see a white out game, it's hard to plan in advance (and there's rarely any hotels available in State College for big games as it is).",
            ">So my plea to you, Fox executives: If deviating from the noon window is a bridge too far for you, do us all the favor and pick Oregon vs Michigan now. You’re sure to get enough eyeballs on that game to “win the window” just the same. And we, the people who still care enough about our traditions, get to keep what makes the Whiteout special.\n\n>Isn’t that why Oregon, Washington, USC, and UCLA are members of the Big Ten now? So you can showcase them? So Fox, do us all a solid, and showcase them, if you’re not going to play showcase the Whiteout at night.\n\nTotally agree that Oregon vs Michigan is the much better game and should get the noon slot. \n\nI mean... only a bunch of sickos would want to see Ohio State beat a team that they have won 11 of the last 12 against including 7 in a row.",
            "As a fan of a team that often plays against PSU in these white outs, I'd rather them put the games at 6AM.",
            "Blame Big Noon Kickoff for ruining one of the best atmospheres in sports.",
            "Of course it should. As an opposing fan I have a robust fear of white out night games in Happy Valley. Day white outs just don’t have the same effect.",
            "Whiteout game is on my bucket list. Wouldn't be the same (or even count imo) if it were a day game.",
            "Too bad all traditions in this sport are being taken behind the shed one-by-one and executed with a money gun.",
            "It’s should be illegal to make this game a noon game. Fuck Fox for that forever",
            "Since it’s much less likely that Michigan will necessarily be the biggest home game on Penn St’s schedule going forward I’m okay with this.",
            "After Dark, you say?",
            "I've been to 3 white outs irrc, one of which was just a student white out, and these fox execs need to go to one to just realize how amazing they are. They aren't just football. It's a goddamn spectacle.",
            "It may not be an old tradition, but there is something very special about a night white out.\n\nSo I am completely unsurprised that some corporate slugs want to milk that magic dry.",
            "I love Big Noon Saturday because I know I’m getting a big matchup early in the day, but I hate Big Noon Saturday because I’m getting a big matchup early in the day",
            "It should also be vs. UCLA this year instead of vs. Ohio State. Because I’m biased, but also because it’s in early October.",
            "Going to a white out at night against Oregon is my #1 bucket list for a regular season game",
            "Can’t stand Fox and the feeble efforts to dethrone game day. Beyond that, Penn State got ZERO protected rivalries amongst all of the conference changes. So we have this white out thing that most folks seem to love. That’s not getting protected either. I recognize that different entities made those decisions, but as we watch all of the traditions of college football crumble, maybe they could have saved this one. Penn State has a huge alumni fan base only rivaled by Michigan. Yet, they are treated like they’re a second tier D1 team. It’s disappointing.",
            "You want night time Whiteouts because it's a great tradition\n\nI want night time Whiteouts because I want fanbases other than ours to go through the same anxiety our fanbase goes through in the build up to the game",
            "Yes and it should be against their toughest home opponent. I miss seeing Osu play in those white out games.  Such a scene to see.",
            "I (slightly) disagree? But I'm old school. I like the whiteout for a game where PSU is not expected to win, where we're the underdog. Ohio State on Nov 2 or Washington on Nov 9 look like the best options. And, considering how early the sun sets in November I'd take a 6pm kickoff or whatever",
            "Blame the same greed that’s blowing up conferences and the ncaa in general for ruining yet another bit of the traditions that make college football what it is. Not sure why anyone would expect a decision to be made in the best interest of the sport vs $$$",
            "Unlike lots of outside fans who never have been to a PSU game want to think:\n\nThe white out is as much of a whole day celebration to the fans as it is an advantage against the opposing team.  It’s NOT fun at noon, it’s alright in the afternoon, and it’s an unbelievable experience at night for multiple reasons. \n\nIve been to ~10 white outs in my life, the only one i was like “meh” about was the only day one.",
            "I know it was because of having to compete with other networks but big noon is so frustrating. I want to watch those damn big B1G games at night, not at 12noon when I haven’t even gotten a buzz on yet",
            "White Out at noon sounds goofy to be completely honest.  Day games can get wild, sure, but there’s no feeling like a packed and hyped up stadium below the night sky.  If Fox had any sense they shouldn’t even consider having it any other time than the latest it can be.",
            "Tell that to Fox",
            "Could not agree more",
            "True",
            "Berg. Nern. Kerkerff.",
            "I don't know how to tell you this but literally nothing is sacred to TV networks. They'd make you play at Tuesday 10AM if it made them 1 penny more",
            "You're goddamn right.",
            "Wasn’t even aware that a whiteout during the day was an option lol",
            "And the Georgia Blackout Funeral uniform games should only be played during the day.",
            "Put Michigan @ Penn State on Big Noon for the end of time thanks.",
            "Well color games like this should also be held during warm games, most people don't have the same colors of jackets/coats so when you have them in the cold it gets stupid lol.",
            "Hard hitting journalism right here boys",
            "As someone with small kids and my Saturday evenings booked with bullshit, I enjoy Big Noon",
            "I thought it was. But i dont really watch much big10",
            "Water is wet",
            "I believe the first “White Out” I ever attended was 2007 (Notre Dame). That game was in daylight.",
            "[deleted]",
            "My dream is to attend an Oklahoma road game at Hapoy Valley and that game be a White Out game. I think most college football fans would love to be a White Out opponent (Auburn was honored by it in 2021) and I hope they keep it at night for tradition’s sake.",
            "When I hear whiteout………….\n\nhttps://www.youtube.com/watch?v=l99AXoG1AQE",
            "I’m a diehard Buckeye but I want to experience a Penn state whiteout. Especially if they’re playing TTUN. I wish we got as loud and wild in the shoe.",
            "I wish I was a paid to be as braindead as people who write articles like this. Thanks for the lukewarm take. Every team wants to have their special crowd thing to be a prime time game.",
            "Penn State is a Cupcake game",
            "The only way this changes if we don’t watch. Or stream it by “other” means.",
            "agreed.  As should all LSU home games.",
            "Could Penn State do another White Out if they get a home playoff game?",
            "The Big Ten has only two games that need absolutely protected no matter the cost. \n\n1) Ohio State Michigan is the last game of the regular season for them both (I'd be fine moving it up a week and ending on a bye for both teams to prevent a rematch 7 days later - but it needs to be both teams' last game)\n\n2) Penn State whiteout is at night against the beat opponent on their home schedule. \n\nThe TV execs can have their way with us otherwise.  These two things are off limits.",
            "It’s never made any sense to me that everyone dresses in white except for the players. \n\nLet’s change that",
            "Why this isn't already the case is beyond me. To the same argument PSU is also to blame because why would they pick a 330 game against OSU to be a white out instead of 7pm vs Washington. Like PSU gets to pick when it happens, no matter what they should always pick a night game. Personally I blame PSU over anything as they're in control",
            "Nah, it just needs to feel \"worthwhile\" and any timeslot can work for that, though night will always work best for it.\n\nBut saying \"it must be night\" is just a needless anchor. The school literally listened to Franklin, the program, and the fans and they  said \"Okay, we'll aim to do them at night going forward.\" And now people are bitching because, *surprise* nobody can assure their best game is at night because we have other hands that feed us. And we knew that was the circumstance when we made this decision.\n\nSo now, the game \"should always be at night,\" but people are going to bitch it's not going to be for \"Penn State's biggest game.\"\n\nAnyway, 3:30 games after like mid-October do pretty well too. I think the school should be more flexible for doing it later in the season. At this point, of the realistic options of games I think it ought to be Maryland this year. Not like any of the other options are that great and would help convince people to show up for the post-Thanksgiving weekend.",
            "I feel like that’s one of the things that makes a white out special it would be so awkward if it wasn’t a night game",
            "I feel like that’s one of the things that makes a white out special it would be so awkward if it wasn’t a night game",
            "They should have a shower stall game where everyone wears a towel and they get a set of thundersticks to simulate rhythmic slapping.",
            "Honestly the Penn State whiteout isn’t that special? It’s just another whiteout.",
            "Nah who gives a shit. They shouldn’t be able to dictate night games at will by declaring a certain matchup their whiteout game. Cry about it.",
            "Penn State fans should just be a quite as possible for the Ohio State game or just not go if it is at noon. Empty stadium would make for great TV. Doesn’t matter Big Game James will choke anyways.",
            "The part about protecting Michigan Ohio State at noon forever is correct. We should get a similar protection.",
            "> is good for the conference. Unfortunately FOX having multiple premium picks to throw it at noon lowers that chance.\n\nBecause PSU vs. a top tier opponent at a non-competitive timeslot (such as noon) is even better for the conference when it comes down to the bottom line. Like, BNK wouldn't be a thing if it wasn't as successful as it is at being an effective scheduling maneuver.",
            "Not getting marquee games and home atmospheres on prime time is the final straw that caused OUT to the SEC.",
            "All my homies hate Fox",
            "Seriously fuck them and the horse they rode in on",
            "From a marketing and viewer attraction standpoint it makes sense, as no one else targeted it.  From literally every other standpoint, it is extremely stupid.",
            "I was informed to \"quit bitching about our \"prime time\" spot at 11 AM.\"\n\nWhat's changed? I thought yall loved to yuck it up about Big Nude kickoffs.",
            "The most dangerous place in the world is between Brady Quinn and a camera",
            "Yeah, I don’t have any sources but I’m pretty sure people at Penn State pulled some strings to get CBS to take Iowa as a night game last year considering it was going head to head with Notre Dame vs Ohio State. I would imagine they are trying something similar this year (Franklin’s comments seem to indicate that) they just probably aren’t having much luck.",
            "I mean penn state go relegated in brand recognition with the addition of the west coast schools, not saying it’s warranted but when’s the last time you guys won a big game against Michigan or OSU? With Oregon, usc and Washington joining the conference yall might be the 5th biggest brand in the conference. No one wants to watch a game where you lose when Michigan runs the ball 30 times in a row in the second half. The big ten isn’t going to protect their 5th best team that may or may not be relevant with the new additions. The best way to solve the issue is win some games.",
            "I desperately need to see a whiteout primetime playoff game.\n\nImagine that.",
            "As an FSU fan who now lives in upstate NY I've very selfishly been hoping that if/when we leave the ACC we jump to the B1G so it'll be easier to see the Noles in person more often (especially since we are no longer annual opponents with Syracuse). And if that happens I will absolutely jump at the chance to go see FSU play @ Penn State in a White Out game. It looks epic.",
            "After this year's game, Kirk Campbell mentioned that part of the reason why Chop Robinson was whipping our tackles so badly, and part of what eventually led to us running the ball the entire second half, was because it was so insanely loud that our tackles couldn't hear JJ at all. They quickly switched to a silent count but the tackles were still struggling a bit with the timing, so it was either run the ball or JJ (who hurt his ankle pretty bad in the first half) was going to get fully killed.\n\n\nAnd that wasn't even a whiteout night game, which is known to be even louder",
            "Thanks Michigan bro",
            "The place was rolling that night. Could not agree more about wanting to showcase the great atmospheres in this sport. Big nude Saturday can eat a dick.",
            "What pissed me off was fox sports posting that clip last month as just a random offseason thing. Like read the room, you could have that if you weren’t so stubborn",
            "But money /s",
            "Logistically it also sucks, too. Penn State for a few years now has been better about pricing single game tickets relative to their draw. $30 sales for a late November Rutgers game, but you're going to pay a premium for Ohio State or Michigan. \n\n\nThis year, UCLA, Ohio State, and Washington were all similarly expensive. Many people thought that signaled a possible UCLA Whiteout (welcome to the Big Ten kind of thing) but UCLA is also rumored to be noon. No offense to UCLA, but that's not a premium ticket to me on the same plane as Ohio State, I don't think.",
            "Comes with the territory of having 3 media partners rather than 1 like the SEC.\n\nAlso I wish they were forced to draft individual games rather than stake claim to first pick certain weeks, it would definitely make the process of planning these games easier in advance.",
            "Look at the hotels in the Dubois PA area it's like an hour and a half drive into state college. It's right off of if you leave between 6 and 7 am on a game day there is hardly any traffic.",
            "Fox's likely reply? Fuck you we make money",
            "They totally could pick Oregon Michigan, but at 12 days out, PSU won't want to leave picking the Whiteout so open ended. Would be awesome if that's how it falls, though, and we get a second impromptu Whiteout. \n\n\nMakes me think back to before they did the full stadium ones and the student Whiteout was much more grassroots. People carrying signs around campus, yelling into lecture halls right when classes were letting out. I think that was also the first Facebook \"group\" I joined.",
            "Didn’t fox agree to not put Oregon at noon?  I thought I read that.  I too hope the OSU v PSU game will be a night whiteout",
            "That sounds like a good plan now we just need to somehow find a way to make fox agree",
            "Which psu game this year is rhe whiteout",
            "*monkey paw curls*\n\nOK--- 0600 GMT it is!",
            "Big Ten After Dark 11 pm kick.",
            "Jokes on you, 6AM is definitely still night in late fall (cries in the after glow of the solstice knowing its all down hill from here).",
            "Blame Big Noon Kickoff for ruining ~~one of~~ the best atmospheres in sports.\n\nFull stop: putting stellar matchups in an early slot inherently means you'll have less raucous of a crowd. Even more so for the 6 B1G teams in Central time having to do an 11AM kick.",
            "Hell even 2022 against OSU was at noon and wasn't a Whiteout, but it was still by far the loudest day game I've ever been to.  Still wasn't the same, though",
            "[The Land Grant Trophy must be protected at all costs or it could be next!!](https://youtu.be/QyYbGcihlSc?si=3ywIe8WAj7Arm_Ky)",
            "Their sentence is that they aren't allowed to run any commercials for the rest of the season giving everyone decades of their life back.",
            "The reality is that Penn State determines the whiteout after game times are decided. It’s just that Fox will put all the good ones at noon so the only option is to make the white out then or pick a lesser matchup that was slotted for the evening.",
            "You assume Fox execs care about football. Going to the game would do absolutely nothing for them.",
            "It won’t be as good of a spectacle as OSU, but if so much rather just lock in UCLA as a night game as a welcome to the conference, instead of having to do Illinois which could even be a 3:30 game ",
            "We did it once before and it sucked, a big part because the team was bad and the weather sucked. Penn state can get plenty loud for noon games, in 2022 Ohio state at noon was louder than the whiteout that year. The annoying this is this will be the third year in a row the whiteout is against a meh team instead of our marquee home game.",
            "I tried. They wouldn't listen.",
            "There have been a few that started with the sun up and gone into dark, the first full stadium one in 2007 against ND is an example. \n\n\nThey also played a wet fart of a Whiteout against Michigan in 2015 at noon which I think a lot of the changed opinion is coming from. No one wants a repeat.",
            "They've done it but the Whiteout is just as much as visual thing as it is the atmosphere. It's just not the same during the day\n\n[Day](https://a.espncdn.com/photo/2016/1020/r142883_1296x729_16-9.jpg)\n\n[Night](https://www.pennlive.com/resizer/dIUeXS8OgfKo_KyABLnVu7L1wF4=/arc-anglerfish-arc2-prod-advancelocal/public/BHM62A6AUJFHVJIZHI6BDPJHWY.jpg)",
            "That was the first full stadium one at all, actually. It kicked at 6 pm but it was dark part way through the game.",
            "Because CBS and Disney don't put anything comparable to it. It's effectively free space to put something that people will tune in for. Of the top 20 most watched regular season games:\n\n* 8 (40%) were at **Noon**\n* 6 (30%) were at **Afternoon**\n* 5 (25%) were at **Night**\n* 1 (5%) was at **Late Night**\n\nPeople will watch the most compelling games at noon and the audience has no problems doing so.",
            "FOX gets *hella* advertising revenue through these being at noon in even-numbered years when three of the schools in the fold are in battleground states MI, PA, and WI. ",
            "In 2016 we had the official white out against Ohio state and a few weeks later there was a night game against Iowa that Franklin called for a white out. So it’s possible.",
            "Ohio State is likely to be noon and there is no decided time for Washington.",
            "PSU gets to pick but there are no good options.\nOhio state will be at noon\nUCLA will be at noon\nWe won’t know the Washington start time until October and no one wants an Illinois whiteout",
            "Penn State literally is the only B1G school it seems like without a protected tradition or rival (cue unrivaled joke). We have been forced to open up B1G play on the road seemingly every season and forced into some Friday night games (granted others have had to play more of those games, but others have not). \n\nI just think a lot of fans... and not even just Penn State fans... would be grateful if the one thing we are really known for got the respect it deserved and protected like how \"The Game\" is. \n\nI always see posts on here how going to a White Out game is on a lot of diehard CFB fans bucket lists so it would be nice for it to always be at it's best/most beautiful which is at night.",
            "Franklin rightfully wants the Whiteout at night because they can get the most recruits there. It's the largest recruiting weekend of the year, and a noon game means many can't there easily after playing Friday night.",
            "When do you all announcement which game is the whiteout?",
            "Penn state didn't have a single big night game last year except the white out because of Big Noon. God forbid we want to keep one huge night game which also happens to be consistently ranked one of, if not the top traditions/experiences across all of sports.",
            "it was just as good, if not better, when it was a student only daytime whiteout, being in the student section 2004-05 was special",
            "If you attend one you would probably think differently.",
            "The university should have some input ",
            "You would think Fox would want it too. Like CBS had 1 night game a year with the SEC, Fox should want to try and get it for the whiteout game. It's definitely a more marketable game than whatever the same matchup would be at noon",
            "Iowa-Nebraska on Black Friday at noon also needs similar protection.",
            "Is Ohio State Michigan actually protected for noon or is just the obvious choice for Fox to put on Big Noon?",
            "Ohio State and Michigan have also each won multiple national titles each in the last 30 years\n\n(1994, I know, but you get it)",
            "I would, personally, love a night The Game",
            "Better protect a night game for everyone in the conference then",
            "We were pretty good under the old TV deals under ESPN prior to 2017, then FOX/ESPN from 2017-2022.\n\nEven when FOX was the 1st pick, they always took Ohio State - Michigan with that pick, then with the 2nd pick ESPN would take whatever game PSU's White Out was.",
            "Fanbase: fuck Fox Big Noon \n\nAdmin: oh yes bathe me in that sweet Fox Big Noon money",
            "Would Penn State consider a compromise with FOX and designate a Friday night game for the whiteout?\n\nNot sure if that'd be feasible with fans having to travel on Friday to Happy Valley. Also tough because the high school football playoffs drag into December.\n\nBut if I'm FOX, I wonder if that's a tradeoff they'd pitch. The network gets Penn St and another premier team for their Friday night slot. And Penn St gets to guarantee a night game for their whiteout vs OSU/Mich/etc.",
            "My brother in christ noon kickoffs have been a thing as long as I have been alive.\n\nCalling it \"BIG\" when it already existed isn't targeting it as much as it's, \"let's arbitrarily manufacture hype around it and see if people are dumb enough to buy in\". Which I guess actually is targeting it I take it all back but maintain that it's pathetic and worthless.",
            "PSU fans are the one fanbase that agreed with you guys.",
            "And I was totally fine with Iowa last year. It was a solid matchup and easy second best game. \n\nIssue is this year the options are insanely bad ",
            "Penn State has not beaten Ohio State or Michigan at home since the Big Ten and Fox started to make those games noon kickoffs. The last time one of those games was at night (not counting the covid year when nobody was in the stands) was 2019, when Penn State beat Michigan. Ever since then, those home games have been put at noon. I don’t think that’s a coincidence!",
            "This has been a problem since before the PAC schools were added.\n\nWe haven’t had a OSU whiteout since 2018 and a Michigan whiteout since 2019. \n\nIronically PSU is 2-3 vs OSU in whiteouts and 4-3 vs Michigan. It absolutely changes things! ",
            "West coast team wouldn’t be at noon, it would kill any rating UCLA would bring by being 9am local for them",
            "These Fox guys are just curmudgeons, everyone in the north knows you need at least one spontaneous white out a year. \n\nThe terror helps you know you are still alive.",
            "FOX agreed to not do noon games ET from the West Coast since it would be 9am PT. Essentially any top game from the West Coast will be on CBS or NBC unless FOX puts it on Friday night.",
            "I thought the B1G and Washington/Oregon were the ones making concessions to get them added, not the other way around",
            "Tbd",
            "I actually think Big Noon is an advantage for Michigan, since our crowd doesn’t get that rowdy anyway",
            "I want to see a USC, UCLA, Oregon, or Washington Big Noon game. 9 AM start",
            "On TV it sucks when games are at noon. But in person I *much* prefer noon games. Then the day is only 7am-6pm tailgating instead of 7am-9pm, and you're not anxiously waiting all day.",
            "Its worse, even the B1G commissioner is a media exec ghoul now.",
            "There’s just something different about night games.  Even at the same volume I can’t imagine it would be the same during the day.  Our games get plenty wild even at 11am, but the night games are just better, even if it’s not as good of a matchup.\n\nBut that’s another good point, I would assume you would want Whiteout to be the home game against the best team, because that is also going to be a more exciting atmosphere automatically.",
            "Bama in 2011 was at 3:30 but it was Sept so it was light the whole time.",
            "I took my ND buddy, after we went to the game at ND the year before. Before the game started, as the crowd got royally into it, he turned to me and said, “We’re fucked”. LOL\nThat was Jimmy Clausen’s first start. Going on to lead ND to the worst three years they had in a very long time",
            "My example was more theoretical in the sense that PSU needs to only do white outs at night regardless of opponent rather than a big opponent at 12 or 330. You pick the hardest game on your schedule that plays at night and make that the white out. End of story. I just blame PSU for not doing this and having the occasional white out not at night.",
            "Would love to attend a white out game! We need a home and home so badly methinks. The cult of the SEC vs the cult of the B1G!",
            "That's a reasonable argument. I feel there is a little more ground that we should be open to looking for. Like, we all very well understand that any timeslot can host any game of ours and we don't have any control over it. So, if we want to aim exclusively for night then we have to accept our options are limited.\n\nBut you and I have both been to end-of-season games at the 3:30 timeslot, they get dark. The lights come on. I think we still get a great feel out of that and it should not be totally neglected since it opens up our window of what would be a competitive team out of potential timeslots.",
            "Not to mention the poor, unfortunate saps who work/live in Philly, Pittsburgh, and the DMV having to decide whether to drive up Friday for the noon kick Saturday or wake up before the ass-crack of dawn Saturday to make it in time.",
            "Typically we have announced it in May prior to the season starting the past couple of years.",
            "Usually around now.",
            "It's normally announced  when the early times come out in may. This year it's probably  a little different  due to the four new west coast  schools. Normally the white out was the easy pick for whoever had second choice. However with the new schools it's a little harder (especially  in year 1.) CBS probably  took USC @ Michigan  first (probably  was the network that traded up with fox for the third pick) and Fox probably  took it before NBC had a chance due to that weekend  having both osu vs psu and oregon vs Michigan.",
            "Usually in May when tv times come out. The fact that it hasn’t been announced yet means the school is stuck in a tough place trying to figure out what to do with it. Either that or trying to pull some strings either the networks to make something happen",
            "I also read something a month ago about CBS being upset with the Penn State Whiteout ratings last year... It was a rain soaked blowout and they put it against Ohio State Notre Dame. What did they think was going to happen?",
            "But it's not more marketable because night has tougher competition. That's exactly why CBS ended up settling on 3:30 and later Fox on at noon. Fox putting a game on at night would directly competing with NBC's and ABC's biggest games of the weekend. Nobody else puts their biggest games on at noon, hence Fox's success with viewership.\n\nFox would only benefit moving out of the noon timeslot if Disney or CBS moved out of their preferred timeslots.",
            ">You would think Fox would want it too.\n\nThey have MLB stretch run/ playoffs / World Series at night. Guess you could argue for putting it November every year but then the elements come into play.",
            "Yes please. I unironically love this game every year.",
            "You aren't excited for the 630 kick off on 11/29?  Unless we get freak weather that week, everyone in the stands will turn into meat popsicles if they aren't careful.",
            "Personally I prefer a 2:30 kick for that game.",
            "That's a good question. I was more thinking of pre this existing Fox plan for noon games. How long have they had the first pick and noon slot? Like back into the mid 2000s?",
            "I honestly cannot remember a time that The Game wasn't played at noon so I just assumed that both teams demanded it be protected for the last week of the season at that time slot.",
            "Boo this man, real cfb games are the best justifications for morning beers",
            "That's fine.",
            "Fan base: haha we get to be the p2 and have our future secured\n\nalso fan base: wow why do I need 3 different subscriptions\n\nAlso also fans: why are my traditions dying\n\nIt’s called selling out lol. Aren’t we all so happy with the future of college sports?!?",
            "No. Whiteout is the biggest recruiting date for the program so you could not have it the same day recruits would be playing ball. \n\nAlso no",
            "There are classes all day on Friday. I couldn't imagine the crowd for a whiteout on top of a full campus.",
            "no. literally every fan and everyone in the administration - even CJF - said they hate Friday games. That's for high school. FOX can pitch that but everyone will pass, even if it's a game against the Steelers/Eagles all stars",
            "Not for big games. The idea is that no one was putting their “big” games at noon and putting a major game at noon was an easy way to easily get more viewers in that time slot since it’s the only major game then.",
            "Iowa was *ok*. Minnesota was a joke and it’s looking like we are going to get that again. The only good options are Ohio state and Washington and neither one is looking promising. I don’t get all the people that were hoping for a UCLA whiteout the last couple months, to me them and Illinois are the same.",
            "There will definitely be noon games when they're away.",
            "Rutgers has a 11 PM game. So they aren't that concerned with the local market of some schools and 9 AM is way more reasonable to watch a road game on TV.",
            "You have no idea what you're talking about. West Coast teams have been playing road games at Noon for a long time. Oregon over Ohio St. at the Shoe in 2021 was a Noon game.",
            "Almost like having regional conferences made sense from a time zone standpoint.  Dissolving the Pac 12 was so, so incredibly stupid and I’ll never stop being mad about it.",
            "Appreciate the clarification.",
            ">  since it would be 9am PT\n\nAnd why did they agree to that?\n\nBecause *most* bars/restaurants aren't open that early, so they'd lose viewership of the casual west coast fan.  And advertisers aren't stupid.",
            "instead they are giving USC - Rutgers an 8pm PACIFIC kick... aka, 11pm eastern game for an east coast team.   by the time that game finishes it will be past 2am for eastern time rutgers... but fuck em, it's rutgers, right?",
            "Jokes on you, its Fox so the game still won't end until 4pm. Its a sacrifice Allstate is willing to make.",
            "That's interesting. Usually when I hear someone's preference for noon kicks it's flipped: like knocking out their game on TV and having the rest of the day.\n\nUltimately, it doesn't matter what fans want because conferences and administrators will always be beholden to the millions of dollars from TV networks.\n\nAllegedly, ESPN/ABC is looking into counterprogramming Big Noon better, so if we see better SEC/etc matchups in that early window, does FOX rethink putting EVERY relevant B1G game at noon? Probably a pipe dream, but I'll take any hope I can get.",
            "When we can’t pick the time of the game that leads to games like the blowout against Minnesota. The point of the whiteout is to make an atmosphere that benefits our team against the team we need it the most. No offense to Illinois fans but that would be a massive downgrade for us compared to the normal opponents we play in the whiteout.",
            "There is no known night kick as of today.",
            "Rolling up 322 at 7am feels like a tradition at this point with all the noon games we've been stuck with the past few years.",
            "I think it was NBC who traded with Fox for the third pick, and they got Oregon/Ohio State.",
            "Appreciate it and all other responses - asked because I'm based in DC and making the rounds to some drivable games this year. I feel like if you're going to go to one Penn State game it simply has to be the white out but I hadn't found any info on the date. Just assumed it would be Ohio State",
            "Logic doesnt matter. Only numbers. Preferably big ones with many commas and a $ in front!\n- TV execs",
            "if some idiot wants to base their decisions on one single game, let them.",
            "This man speaks the truth.",
            "My hungover ass loves eatting a turkey sandwich and a left over of alcohol. I tell my gf that I’m busy from noon thanksgiving day til Sunday night. Greatest holiday season for football.",
            "Keeping The Game at noon was something the conference dictated with ESPN/Disney when they were the primary network partner. There were a couple times they wanted to move it to primetime on ABC but the conference said no, and when they had it at 3:30 the one year people had a cow.",
            "The 06 game was at 3:30 but that's the only time I can remember it not being at noon.",
            "It actually used to be a 1PM game some years until TV contracts with conferences became the thing in the 80s and 90s. So it's either been a noon, 12:30 or 1PM kickoff the entire rivalry except for the 3:30 kickoff in 2006.",
            "Kudos for being objective about it, lots of other entitled PSU fans lurking",
            "We? We didn’t do this…",
            "Mind if I add another no? No.",
            "Fair enough. Hopefully with NBC taking over that night window we get more opportunities to see more big time matchups for the whiteout.",
            "As if PSU wouldn't cancel classes for a Friday game.",
            "There’s nothing wrong with Friday games in general. \n\nIt just makes 0 sense for PSU to play a home Friday game. \n\nThey have a 100,000 seat stadium. And the majority of the people paying for tickets live 2-3 hours away and have to go to a job on a Friday. It just can’t happen logistically. ",
            "I would be shocked if any west coast team has a single noon eastern game. They were added to attract west coast viewers, scheduling them at 9am local doesn’t get west coast viewers. Just like how Penn state will never have a 11pm eastern kickoff when they are playing at a team on the west coast",
            "It is stupid and will be stupid.",
            "I've been to a bar in California showing NFL games at 10 am, and when we were on our honeymoon in Hawaii, there were bars advertising 7 am breakfast and football. \n\n\nHonest question, how many people even go to the bar for games? The high majority of people will be pouring some coffee, frying some eggs and watching the (limited) early games on their couch like I watch Gameday.",
            "It’s certainly a great experience. We all hoped it would be Ohio State until Fox hinted that they have  the pick for that game. The last couple years the school has moved to the stance that the whiteout has to be at night and not the best team. But this year it’s looking like we might  not even get a single night game, or if we do it’ll be Illinois so we’re stuck between a rock and a hard place here.",
            "If anyone needed tangible evidence that broadcasters are out of touch https://twitter.com/mulvihill79/status/1803089464727888280",
            "I thought that the tendency of rate of profit was to rise? What is this left-wing bullshit where we make more money but at a lower percentage than before?",
            "Perfect, thank you.",
            "The one year it was at 3:30 I had no idea. Just assumed it was at noon. Got hammered Friday night and was supposed to meet up with friends at the bar to watch the game. About 11:30 AM my roommate starts banging on my bedroom door yelling at me to wake up. I get up,  frantically shower, and rush to the bar thinking we’ll be late and it will be packed. My roommate and I get there and we are the only people at the bar. Call one of my buddies and ask what’s going on and he laughs and says the game is at 3:30! So my roommate and I got good seats, some food, and started drinking!",
            "Besides, everyone knows how awesome the tailgates are, still.",
            "Is this where the line starts for all those voting, \"hell no\"?",
            "People clowned Maryland when they cancelled classes for our Friday game against them a few years back. It would absolutely be necessary at PSU. \n\n\nI would actually like a black Friday game.",
            "I guess we'll see, but the plugged in people have UCLA @ Penn State on October 5 being noon. If it wasn't, I assume they wouldn't have already punted and made it the Whiteout.",
            "No one’s really watching UCLA anyway so does it matter",
            "In 2021 Oregon played at Ohio State at noon eastern and 9am pacific time",
            "Counterpoint: Rutgers @ USC is 11pm EST",
            "The \"casual fan\" will just record the game and skip commercials after they wake up.\n\n(Trust me, my old roommate was a casual tOSU fan and would do this)",
            "You can't drink all day if you don't start in the morning.",
            "Yep. Bring your friends.",
            "Why did the big 10 invite them then",
            "Counterpoint Rutgers",
            "That's not bad either. Before I moved away my lifting buddy and I would always miss the start of Penguins games but tape them. Work out, make some food and start like an hour late. We'd miss all the commercials, both intermissions, and finish live. It was perfect.",
            "USC’s plus one. Same reason you get dragged to your gf’s friends weddings.",
            "Eh, it's different when I was watching the game in the 3rd quarter(in my room) and he was reacting to the first touchdown of the game (in the living room) because that's the only one that had the DVR.\n\nIf you've got obligations that prevent you from watching, it's a different thing than getting hammered until 2AM every Friday night and waking up 1.5 hours after your \"team's\" game starts.\n\nI mean, I was drinking WITH him until 2AM most nights, and usually outdrank him.  I was just able to be up at 9-10AM"
        ]
    },
    "To what food or beverage should your team lay claim in the newly-launched \"Superlative in CFB\" war?": {
        "title": "To what food or beverage should your team lay claim in the newly-launched \"Superlative in CFB\" war?",
        "score": 203,
        "url": "https://www.reddit.com/r/CFB/comments/1dlg920/to_what_food_or_beverage_should_your_team_lay/",
        "content": "So far:\n\nTulane claimed cheapest beer; Louisiana Lafayette challenged that. \n\nBYU claimed coldest chocolate milk and sobriety. Some mild pushback, though not on the sobriety. \n\nMississippi State claimed cheese, angering Wazzu fans and Wisconsinites.",
        "num_comments": 588,
        "comments": [
            "Most toxic nuts.",
            "Best wood.",
            "Most efficiently slaughtered chicken\n\n\nfor those of you who don't appreciate a good dino nuggie \n- GT has a lot of students working on projects for various chicken companies around Georgia, and a lot of those projects revolve around the efficient slaughter of the aforementioned chickens. A friend of mine described the project he was working on as \"like a dry cleaner's carousel but for chickens\"\n\n- Other friend who works for Lockheed martin gets to shoot frozen chickens at active jet turbines to simulate bird strikes\n\n- Either way, nerds be fucking up some chickens",
            "Most helpful academic tutors!",
            "The Yellowest Hammers",
            "Tightest fitting jorts",
            "Best (worst) mixed drink: the boilermaker",
            "Soggiest Doritos",
            "Kansas: Best Trough Urinals",
            "Worlds worst mcdonalds",
            "Best Nukes",
            "Hottest Runza",
            "Queso, as in chili con (not about to wade into the bbq wars ‘cause all bbq matters)",
            "Best Aerial Tortillas",
            "Kool-Aid was invented in Nebraska. ",
            "We used to sell strawberry waffles at hayward field and I don't know of any other schools in that lane",
            "Best citrus and best twice divorced 49 year olds",
            "Best smoked turkey legs",
            "Fentanyl",
            "Oldest schnitzel spot.",
            "Oklahoma Baptist has made its official entry: coldest water\n\nhttps://x.com/OBU_Football/status/1804256933085614499",
            "Closest bojangles biscuit",
            "The Beavers play in Resers stadium.  It has to be potato salad\n\nThe Ducks would have to be craft beer - Ninkasi?\n\nedit - Resers makes semi edible potato salad (and beef jerky, pickled sausages, microwave burritos, etc) sold across the west coast and since they are based in the Corvallis area they are a sponsor of Oregon State.  The instate joke is Oregon has Nike and Uncle Phil and Oregon State has gas station potato salad money\n\nBoth stadiums have terrible food tho... Eat at food trucks outside",
            "Cold chicken tenders served under a chandelier",
            "Smallest cup of coffee that will give you heart palpitations",
            "Best soda - Dr Pepper ",
            "One of the NC schools should put a cookout in stadium so the state can claim to have the largest selection of milkshake flavors in CFB.",
            "Wazzu claims flags",
            "Best sports drink I suppose",
            "Alright, since we aren’t allowed to claim chili, I’m claiming beer. We were one of the only schools that always sold beer. We have great craft beer in Nippert and have had them for years. We were never afraid!!!\n\nFun side note: The Reds were kicked out of the National league in 1880 because they refused to stop selling beer. We really like our beer and have a rich history of brewing in the city. We have an entire neighborhood built on lagering cellars where over 100 breweries once stood.\n\nEdit: I want to support my case further. \nThe Bengals main chant? Who Dey? Based on a local beer. The 2nd and 22nd largest craft breweries in the country? Stones throw from Nippert. Largest Oktoberfest outside of Germany? It’s here. It’s ingrained in our cultural heritage in every facet of our city unlike anywhere else. This includes our sports and stadiums. We *are* beer.",
            "Pepperoni Roll for WVU",
            "Best chili dogs",
            "Finest Gabagool",
            "Best libertarian late-night hot dog joint.",
            "Best Breaded Pork Tenderloin Sandwich",
            "Best Cuban Sandwiches",
            "Brisket. Partially because we have meat scientists & dream of slaughtering cows. & partially for the audacity.\n\nNebraska - give them all the corn 🌽",
            "Best nearby smashburger joint",
            "I think we have the least and most edible mascot.  The real buckeye is poisonous, but the chocolate peanut butter ones are delicious",
            "App State: Best Wendy’s\n\nPenn State: Best Ice Cream",
            "Craziest pizza shop proprietor… for the love of god, don’t ask about breadsticks",
            "Best breakfast cheeseburgers",
            "I don’t know if we get full custody of Bells, or if we split time with K-College but we have to have a claim to best beer.",
            "Hottest fried chicken.",
            "Busch Light\n\n…just Busch Light",
            "Bourbon!!!!",
            "Most humid early afternoon starts in college football.",
            "Chaos",
            "Best bacon wrapped hot dogs (only the ones cooked on a shopping cart rolling away from LAPD)",
            "Best tap water",
            "Real poke bowls",
            "[*”I’ll stick my dick in the mashed potatoes.  Go Hogs!”*](https://youtu.be/hYU7yJ6gaF8?si=LjZgcvpqAH7bsY68)",
            "Cocaine",
            "Best boiled peanuts.\n\n\nGeorgia is known for many things as part of the core of the South, but it's unclear we are \"best\" at many of them when there's also great stuff in our neighborhood states. \n\n\nBut we have boiled peanuts at every small gas station and roadside stop, and they're delicious. ",
            "Best ice cream.\n\nPenn State and Wisconsin, we'll meet you in the alley to fight it out.",
            "Tennessee: Tennessee Whiskey\n\nOle Miss: Copious amounts of alcohol of the marginally pretentious bent",
            "Rutgers: Best damn Fat Sandwiches",
            "Best quesadillas",
            "Oklahoma State claims the Limeys at the Copper Penny. They go down dangerously easy, and so do you after enough of them.",
            "Fried gator",
            "Corndogs, for spite.",
            "TORTILLÍSIMAS",
            "Tennessee: most goalposts thrown in rivers\n\nGSU: most cars sitting in artificial bodies of water around campus",
            "Best carbohydrate ",
            "Best cheese. Fuck Mississippi State.",
            "World's only all-you-can-eat Chick-fil-A",
            "Best corn",
            "Gatorade",
            "Best ice cream?",
            "Best food on a stick",
            "At Georgia Tech we lay claim to rum, it’s been our wish since 1895.",
            "Georgia Southern has the Chairman of Chick-fil-a, the CEO of Arbys and the first Zaxbys opened within passing range of the main Dining hall at Georgia Southern, so We'll just go with the best fast food.",
            "Pepperoni rolls, unless there's a top notch bakery in Huntington.",
            "Best marijuana (legal)",
            "I wish Tech would just embrace the Tortilla Tossing.\nWe can then call the Student Section the Terrific Tortilla Tossers.",
            "We are claiming the Mississippi Mud Pie.",
            "No one does bourbon and corn dogs quite like us",
            "I nominate NC State for best ice cream. Shoutout Howling Cow.",
            "I think with the beer garden we have most inconvenient way to consume beer during a game",
            "100% it’s Viognier wine\n\nDon’t fact check me but 2/3 of UVA’s gameday crowd definitely overindulges at the vineyards pregame and can’t make it to the stadium\n\nRunner up is spudnuts (RIP)",
            "Stanford - White wine\n\nLSU - corn dogs",
            "Brandy Old Fashioned. No other answer for our Badgers.",
            "Tortillas",
            "Lemonade",
            "Marshmallows.\n\nFor those of you old enough to remember the reference....",
            "Most metal-ridden light beer.",
            "Best theme parks.\n\nBusch Gardens is ass.",
            "From the places I’ve been to I’d say we have the best greasy ass cheeseburgers. Not in the stadium but over in Pendleton. With every bite you feel your blood pressure rising. A cheeseburger steak with chili cuts my lifespan probably by 5 years but I can’t resist. Plus I don’t think anything costs over 10 bucks in there. (Macs for anyone wondering)",
            "Colorado should go with dankest weed though, right?",
            "Cincinnati: Best chili  \nStanford: Best nerd nachos",
            "Best Tailgating and Day-Drinking",
            "Petro’s Chili & Chips",
            "Best ribs.",
            "Bacon Chili cheese fries and pittsburgers….",
            "Best Alligator Sauce Piquante",
            "Tennessee can be the farthest thrown mustard bottles.",
            "Feel like we have pork covered.",
            "Well, ourselves of course",
            "Best campus winery",
            "Shrooms and weed.",
            "Best chicken wings\n\n\nNashville hot? Try a double-dipped turbocharged wing basket at Jeffersons",
            "The best recreational plant",
            "Orygun has some quality cannabis drinks. THC and/or CDB.",
            "Best hedges for sure",
            "Best crabcakes, baby!",
            "Dr Pepper is ours",
            "BYU might claim coldest chocolate milk, but we've got the [best](https://www.psu.edu/news/campus-life/story/richly-deserved-penn-state-berkey-creamerys-chocolate-milk-wins-top-award/)",
            "I mean… it’s cheesesteaks, right?",
            "Rocky Mountain Oysters.",
            "Ice Cream",
            "Soonerest Nachos",
            "Best turkey legs in CFB by far.\n\nAnd wild turkey.  Go tech.",
            "Fattest sandwiches.",
            "You see my flair, you see the vision",
            "Wheat/lentils\n\n\nCorn",
            "RUM",
            "Most aerodynamic Tortillas",
            "Arnold Palmer",
            "Mississippi State can keep cheese.  We’ll take brats and beers you’d actually want to drink.",
            "Best dilly bars.",
            "Hottest Chocolate. Kinda nice to warm the hands during November games, but scorches the tongue.",
            "Best turkey legs",
            "For my Leathernecks, we had great horseshoes in Macomb, but I don’t think we invented that, it’s just an Illinois thing.  \n\nWhen I was Speaker of Student Government, we wanted to come up with a purple Leathernecks drink.  We ended up serving gallons of everclear and grape soda at our tailgate when ever the coast was clear of uncool administration.  (A lot of admin drank with us though).",
            "Best video recording sunglasses ",
            "Purdue has Boiler Gold and Boiler Black",
            "[Chili that'll set you mouth on fire and you have to drink a two liter of Mountain Dew](https://youtube.com/shorts/ut18ctoygyQ?si=wHOlp3fpWhW-m5ZM)",
            "Best beer, most locally brewed beer",
            "Bourbon. No superlative, just Bourbon.",
            "Best cellphone service",
            "Best flying cheese product",
            "Best Turkey",
            "🥔",
            "The Peanut.",
            "Bourbon may I say more",
            "I guarantee you nobody is coming after cashew chicken.",
            "Begun, the corn wars have",
            "Texas Tech: Raider Dogs and Tortilla’s",
            "Bourbon",
            "Best Checkmark/“Swoosh”",
            "since we’re playing on the lakefront this season we could claim the title of coolest stadium view (when it’s not cold as fuck)",
            "For us KC brings the burnt ends, St. Louis brings the toasted raviolis, and Springfield brings the cashew chicken.",
            "Best gas station food",
            "KState makes good ice cream there on campus",
            "I'm sorry... Wisconsin has cheese. Probably beer too. You can't just claim something. You have to earn it.",
            "Best ice cream. MSU dairy store ice cream is the bomb. They have a flavor themed after each of the B1G schools. Can't wait to try the new flavors",
            "USC-Boring fans at home games",
            "We have a questionable title claim for being left out of the playoffs way before UCF did it",
            "Brunswick stew. lol",
            "Either Cougar Gold, or Fireball.",
            "Most drunken fights",
            "Best at asking people what their profession is.",
            "Robin",
            "Runza and Cornhead Lager",
            "Mixed drinks by the pitcher",
            "Clemson has the best Blue Cheese!",
            "It doesn't get much more Houston than Viet-Cajun. How about andouille sausage po-boys?",
            "The Lay-Z-est Shopper!",
            "Best alligator sausage poboys",
            "We have the best Dilly Bars, you can eat them while it’s snowing in single digit temperatures and the cold won’t bother you. ",
            "Oldest corn field",
            "Help a ND fan out I can’t think of anything.",
            "Salt potatoes",
            "The best corn beef and cabbage in the world along with the best Guiness.",
            "What!  70 days and we’re back to football.",
            "It's not my team but Baylor should definitely have the claim over Dr. Pepper.",
            "I’ve never been to another stadium where I saw more people eating turkey legs, so there’s that.",
            "Best homemade ice cream. Call Hall ice cream is legit.",
            "Best pizza? Ann Arbor is home to Dominos and Cottage in while neighboring Detroit is home to 3 more top 20 pizza places by volume + Detroit Style pizza.",
            "TBDBITL",
            "We're just calling \"best food\".",
            "Why would Wazzu have anything to do with cheese?",
            "World’s best Sweet Corn 🌽",
            "Colorado: Best oysters",
            "It's a double entendre",
            "Also the best chocolate candies.",
            "Very true 👍",
            "The only good nut is when I do",
            "Ummmm...",
            "Best hops? That fermentation science program is one of the best in the country so I'd go with Best Craft Beer for y'all!",
            "Between you and who Auburn",
            "Best potato salad and microwave burritos",
            "Nah.",
            "(Eugene has way more mills, Corvallis is farm country) \n\nSantiam canned corn",
            "Is that another way to say you hawk tuah’d",
            "Hey what the…",
            "And here I was going to go with \n\nMost Wafflest of Houses\n\nOr \n\nMost Housiest of Waffles.",
            "I've worked with several chicken plants in Georgia (on the ingredient side) and the number of chickens they slaughter is insane. At peak production, one of the plants kills over 500 chickens a minute.",
            "I need to keep that in mind the next time I'm recruiting at GT. Would you like to take a chicken to the bottom of the ocean to see how it handles hydrostatic pressure?",
            "⚡🪑⚡",
            "I’d like a word",
            "Now you just wait a second",
            "UNC would like a word.",
            "Thems fightin words! - UNC",
            "UNC would beg to differ",
            "Rammer jammer",
            "There it is.",
            "I wasn’t aware that you could eat jorts",
            "When I was 16, I watched the YouTube video \"my new haircut\", and began tossing Jager shots in glasses of beer. I was a fucking idiot and probably did it about 20 times before I realize red bull was supposed to go in the glass. Definitely way better that way.",
            "Wait what? You’re supposed to mix? I’ve always just taken the shot and had the beer for a chaser lol",
            "The yellowhammer from Galettes would like to enter this competition",
            "I liked yuengling and honey whisky",
            "Just take a shot and a beer ffs",
            "I love their nachos (don't hate me)",
            "My wife is an Auburn grad and we went to Momma G’s bc my MIL loved the one on Thach. To this day I feel swindled that the Doritos nachos I ordered turned out to be steamed Doritos slop with sliced pepper jack and jalapeños on top. Like wtf?!",
            "They closed the two that were in Mobile, AL 😔\nBest soggy sandwich and Doritos I ever had",
            "Like hell they are",
            "I’d gladly spend hours arguing about this, but the stadium renovation is removing ours soon so we’re out by default",
            "Hell yeah brother!",
            "The Vols would like a word with you",
            "The JMA Wireless Dome (formerly Carrier Dome) troughs would like a word 😂",
            "Will that be true after the renovation though?",
            "Tulsa would like a word",
            "Fuck you no way!",
            "Ummm.... Wasn't the question best food or beverage?\n\n![gif](emote|free_emotes_pack|scream)",
            "Who is left that still has them?",
            "We just took ours out, otherwise we would argue that 😭",
            "Excuse me?!?",
            "You’re not supposed to drink out of those.",
            "The Air Force Academy has trough/gutter/trench urinals poured in as part of the concrete floor, next to the wall.\n\n\nYou literally piss on the wall.",
            "Lmaooo oh my god, I didn’t know that was a thing FSU people talked about but I’ve been to that McDonald’s and it was a nightmare lol",
            "I saw a homeless guy walk in, drop his pants, take a shit and leave. Right in the middle of the lobby. Circa 2012.\nCombine that with blackout freshman and you’ve got quite the experiences in the McDonalds.",
            "Second that.",
            "The worst McDonald's I've ever been in was right outside the gates of Six Flags New Jersey right around Halloween when they were doing, like, scare nights? The McDonald's was far more terrifying than any of the haunted houses.",
            "I've not heard of this legendary place. Just Googled it. Is it the one in Orlando? My whole family is in Orlando and I might have to get eyes on this next time I visit.",
            "Tennessee and Washington: Check out our navy!\n\nActual Navy: Lul what?",
            "That works with both your flairs!",
            "They may be the best, but they’re not the most dangerous. I don’t recall the Navy misplacing any recently",
            "That goes to the winner of the Commander in Chief's Trophy",
            "And Koolest Kool-Aid, with a side of Dorothy Lynch dressing. ",
            "There’s nothing like a couple piping hot runzas on a cold ass Saturday",
            "Best hand warmers",
            ">(not about to wade into the bbq wars ‘cause all bbq matters)\n\nI agree 100%",
            "I mean does it really? Did you not see that monstrosity that our last coach put out.",
            "Shhhh. You're going to rouse the Razorbacks with that queso talk.",
            "I would have run with brisket tacos, or brisket nachos even, but sure, queso is up there.",
            "The only compliment I will ever give yall is that shit is gas. I will also agree that all bbq matters.",
            "I was ready to say “nothing” and then here you are, forcing me to agree with you. ",
            "Careful, you’re gonna have the Tech truthers who were raised on their one shitty Italian restaurants “mafia queso”. God that place was a wasteland.",
            "I'll start the BBQ war. All BBQ is great, Texas is best",
            "Hey, cheese dip was started in Little Rock!  Why don’t we go ahead and claim it?",
            "at 45th & Lamar!",
            "Greatest bbq take of all time",
            "Somehow my eyes skipped the middle letter and smashed the words into “areolas”.",
            "Excuse me?",
            "My brother, you can’t spell citrus without UT",
            "Damn tasty too. Reasonably priced last time I had them.\n\nThe issue is that they are too large to eat by yourself which is a decent problem to have.",
            "a southern tradition 🙃",
            "I love this sub.  The fact that some ADs monitor it and get in the mix is amazing.",
            "Ah, Shawnee. \n\nOr, as Okies refer to it, Shawmpton.",
            "And closest Waffle House All The Way Hashbrowns for that matter.",
            "We have Bojangles literally inside the stadium.",
            "Reser's started in Corvallis, but moved to Beaverton in 1959.  Funny enough, their headquarters is across the street from Nike's.",
            "When I last went to a Ducks home game in The Before Times of 2019, there was ABInBevWeylandYutani-owned Beer Valley for sale everywhere in Autzen. I didn’t really care since the prices were decent, they had smokestack-tallboy sized cans, and I actually think their beer is OK. Sure, I don’t like giving my money to that particular corporation, but I felt well taken care of. \n\nThe real secret of Oregon beer is Block 15 in Corvallis. Absolutely love everything about that place, including the food. 👍",
            "Soooo much better craft beer in Eugene! Coldfire, Oakshire, Claim 52... Ninkasi hasn't been good since like 2008.",
            "Ninkasi Megalodom 10% ABV IPA: Watch the Ducks score fast, get drunk even faster.",
            "I hate to say it, but legit claim with strong legal standing",
            "Don't you mean Best coke - Dr Pepper. This is still the south.",
            "But do y’all put extra syrup and coffee creamer in your Dr Pepper? I thought not!!! BOW DOWN TO YOUR SODA OVERLORDS!!!",
            "I mean, it has to be Greensboro, right? That’s where cookout started.",
            "Also cheerwine",
            "Sure but also cheese.",
            "Inarguable",
            "Well of course we called it Gatorade",
            "I was so pumped when I saw the selection at my first game at Nippert, it really is elite",
            "A huge number of contract breweries are also based in Cincinnati.",
            "Claim chili, King!",
            "Just as long as Cincy doesn't try to.",
            "What's on y'all chili dogs and how are they better than a Martinsville hot dog?",
            "Two of my least favorite things!",
            "Go to Smitty’s Tenderloin shop in Des Moines and try saying that again",
            "I was going to go with “Biggest Flag”, but that works too",
            "Hell yeah dude I'll extend it even further and just say best fried pork in general",
            "Who has the best Cuban in Tampa?",
            "Is this the one that got Harbaugh in trouble? If so I’ll give you this one.",
            "Best deli?",
            "My daughter's food allergy disagrees with your second point. My own love of chocolate + peanut butter would agree with you though.",
            "I get the feeling that a lot of land grant universities are going to fight over best dairy products.",
            "Wendy’s is better than Comeback Shack?",
            "Cincinnati has Graeter’s, they win ice cream.",
            "Wendy’s, the pride of Columbus, Ohio?! Hadn’t heard anything about the one at App State, what makes it great?",
            "Is that Leonardos?",
            "The breakfast of… *sigh* … the breakfast of champions.",
            "Our Sonoran Dogs will kick the pants off anything you have over in LA.",
            "I had one sip off a Louisville water fountain and thought to myself, “this is some crisp stuff”.",
            "Purdue had, hands down, the worst tap water I’ve ever had in my life when I was there. Like they pumped it straight from the Tippecanoe through an old rusty pipe straight to your faucet",
            "Flair up, presumably Hawaiian friend.\n\nETA: they did, in fact, flair up! Go Rainbow Warriors!",
            "Excuse me ☝🏾",
            "TCU might fight you for that title… you know how they get when they’re all coked up.",
            "Jimmy Carter thanks you for your service",
            "[excuse me?](https://www.scstatehouse.gov/sess116_2005-2006/bills/4585.htm)",
            "Wisconsin is busy defending cheese from Miss St! of all places....\n\nhttps://old.reddit.com/r/CFB/comments/1dldrly/in_response_to_byu_declaring_themselves_as_having/\n\nBut I do know PSU has a thing for their ice cream.  Maybe it's a land-grant thing.",
            "Washington State would probably like a word.",
            "Party on Wayne",
            "I came looking for Oklahoma State answers only to realize I have no idea what we have at concession… I’ve been to almost every home game for the last two years…",
            "Honestly, what were they thinking?\n\nNext, they'll be claiming they can out drink you...",
            "Inarguable",
            "And yet there’s Michigan with all that maize…",
            "Never heard of it...sounds made up.",
            "This explains a lot.",
            "We also have a great dairy store, whoever has the greatest trophy on the planet (land grant) should get to claim best dairy store.",
            "I would say you have the freshest water",
            "Viognier is INCREDIBLE and sorely underrated. Big fan",
            "Maybe the one in Florida is ass. Busch Gardens Williamsburg is awesome.",
            "~~Best theme parks.~~ Longest queues in the World. 🌎",
            "Didn’t Mac’s just announce they’re closing? Or was that a different place?",
            "How about best meat and three? You can’t go wrong with Paws or Esso",
            "UC Davis or Cal",
            "Definitely not. Too dry here. We’d probably be best tea or worst cocaine.",
            "That’s not chili.",
            "It’s heresy.",
            "Chili does not go on spaghetti",
            "https://youtu.be/ukCr6fG9pug?si=roizekbiArN5Hdo9\n\nMotherfuckers disrespecting chili.",
            "110% agree\n\nBest tailgate I’ve ever been to was at the 2018 Georgia @ LSU game. Y’all adopted us and we had an absolute blast.\n\nAlso…because of your handle\n\nThem Dawgs is Hell Don’t They",
            "It's gotta be moonshine. We sing a whole damn song about it. Hell, we sing about killing federal agents because of it!\n\nMoonshine. Ain't nothing better than Tennessee shine. (Barcodes mean it isn't shine)",
            "They don’t want to hear it Pawwwwwl",
            "Hail Mustard Bottle!!",
            "Penn State will fight y'all on that front.  I know they have a thing about their ice cream.",
            "I'm afraid that's got to be Iowa, sorry!",
            "Surprisingly fresh too",
            "It’s also true.",
            "Triple, at least.",
            "At least we named our teams after something actually in the state. ",
            "Actually prefer Trader Joe’s dark chocolate peanut butter cups. Please don’t take my flair. ",
            "Beavers are just better with wood, what can I say?",
            "You can be gamiest cocks.",
            "We also have a fantastic forestry program. So I thought wood was funnier.",
            "I think CWU probably has you beaten on the hops. The school is literally in the middle of the country’s  top hop country.",
            "FSU’s biggest booster is a lumber baron lolol",
            "Slather that shit on some wood and go to town.",
            "Grodiest Berks, bruh. ",
            "Yellawood is kind of ass ngl",
            "Where is your schools top rated forestry program. That's what I thought. Go back to Eugene and smoke some more granola.",
            "Iowa quietly hoping this new meme dies out quickly.",
            "Hey I think we’ve almost certainly got the closest Waffle House to our stadium!",
            "Jesus Christ, also, that’s a very A&M reply lol",
            "Yes, but we can simulate that in a lab without the need for a sub.",
            "Still one of the most jaw dropping things the NCAA has ever done when, relative to Mizzou, UNC faked an entire department, scapegoated women’s basketball, and otherwise got away with it all",
            "⚡️🪑🐯⚡️ 🪦",
            "There are dozens of us!",
            "Every night that involved a jagerbomb normally ended with me on a floor of some sort.",
            "A boilermaker is supposed to be like an Irish car bomb. Your drop a shot of whiskey in beer and chug it. It’s disgusting.",
            "This is called a beer and a bump!",
            "It’s more of a novelty thing in my opinion. When you move to Auburn, everyone says you have to go because it’s an Auburn thing. Think I only went like three times while I was there.",
            "We have a momma G’s in Troy, that place is so overpriced for the amount of food, ridiculous",
            "Shot, you can't go to a Men's room in Texas that doesn't have a trough urinal. They even had them in malls!",
            "True. Their whole stadium is a urinal",
            "Probably not, but I am going to claim it for now.",
            "Hell yeah brother, cheers from 11th and Harvard",
            "Look man this mcdonals is wosee",
            "Throw in a hot cocoa and then a third quarter Valentinos and I’m a happy camper.",
            "Buy two and put them in your pants pockets.  Only way to not freeze your balls off in November.",
            "you real af for this, here’s to Venables resurrecting those fucking terrifying defenses from the 2000s and not ruining perfectly good briskets",
            "Of course it matters. We can never forget that atrocity, and we must work together to ensure it never happens again. Exiling Lincoln Riley to California was a good first step.",
            "Arkansas will willingly drop their claim to chile con queso the moment they find out it's originally from Mexico.",
            "I’ve had solid brisket lots of places. Nowhere I’ve been comes close to Austin queso.\n\nBut also…HEB BRISKET QUESO 🤤",
            "My leftover from my recent brisket smoke went to nachos",
            "How do you feel about the brisket queso waffle fries from HEB? I guess I missed the brisket queso. New HEB here and there so many godddamn people.",
            "*gas*\n\nYou’re either 23 or 103.",
            "They're welcome to \"best starch-based projectile\" until one of the engineering schools builds a potato cannon.",
            "“All BBQ is great” how can you say this, when NC vinegar based BBQ exists",
            "Memphis would like a word",
            "We have that too",
            "It's an experience for sure. Yeah Tech fans throw tortillas.",
            "It just means more",
            "I’ve always assumed it was near Corvallis, although I’ve never seen it",
            "Is that the place on the south side of the highway just before you get to town - that’s kinda hidden in a commercial office park?",
            "I despise IPA's, so alas I avoid most craft beers.  But I have stopped at Ninkasi before a Ducks several times, as its walking distance from the cheaper motels down there and they will have a lager or stout thats not dew from the devils ass crack (IPA).  Pro Tip - Dont stay at the Campus Inn",
            "Nah I’m putting vanilla vodka in it ",
            "I read this as cough syrup for some reason and was like damn SLC bros go hard",
            "> But do y’all put extra syrup and coffee creamer in your Dr Pepper?\n\ndo y'all just get free dental care in Utah or what?",
            "... This is a thing? WHY?!",
            "Please…. Chili dogs, what the heck is that?  Cincy has the best cheese coneys.  Completely different category.",
            "Sounds like the same thing\n\nhttps://en.m.wikipedia.org/wiki/Carolina_style",
            "Late-night and joints?",
            "Or the old Porkies that was next to the state fairgrounds.",
            "Could be but Iowa is better known for its Maid Rite",
            "I’ve never actually wanted a UM fan to chime in before.  Actually I still don’t, FIU get in here and represent.",
            "The Columbia restaurant. It's in the Ybor City area and is a little \"nicer\" restaurant than you'd expect to go to for a Cuban, but IMO the awards it's won for its Cubans speak for themselves.",
            "No, unfortunately, that wasn't even at the good one",
            "That was at The Brown Jug, which is a historic Ann Arbor bar and restaurant from 1936.\n\nBy far, the best burgers in AA are at Blimpy Burger, where the staff is famously rude, sometimes downright mean. It would not be a good place to take a recruiting prospect.",
            "Oh shit that too!",
            "We don’t claim anything about having the best cheese. But I’ll fight anyone for best ice cream/chocolate milk",
            "Maybe but Ben and Jerry attended one of the courses run by the Penn State creamery",
            "Has anyone claimed best blue cheese yet?",
            "Nah. Comeback Shack’s 10x better\n\nWe got the best Wendy’s because ours is a double decker Wendy’s",
            "Come back shack has a special place in my heart",
            "It’s a [double decker Wendy’s](https://x.com/AppState_FB/status/1662197751239819266)",
            "Indeed sir. I need to figure out how to flair up",
            "Bless that man. \n\n\nHe was an ineffective President but he is an incredible person. ",
            "Georgia native here...that's borderline blashemous",
            "It absolutely is and I know many kstaters would die on this hill.",
            "Party on, Garth!",
            "Because *they are* the best?",
            "Thank you.  Visited Skyline chili once because of all the hype and asked myself wtf.  Then remembered that I was in Ohio so duh.",
            "No no, we don’t take that from Texans - you people get the vapors if someone even mentions the word beans.",
            "Wrong it’s delicious. I’m partial to putting Texas style chili on noodles, though.",
            "I’m saying… I live in Cincy now, and skyline is perfectly good, but it’s spaghetti sauce, not chili",
            "😂 Early Cuyler is fantastic. The original Gator Hater!",
            "As much as I hate to agree, Iowa definitely takes the sweet corn. Nebraska is Runza all day!",
            "so so so true",
            "You had me at triple",
            "Eminem sends his regards",
            "Let the truth set you free.",
            "The trader joes version of anything is almost always the best version.",
            "But aren't cocks, like ducks & witches, made of wood?? Gonna need a tiebreaker...\n\nETA: Sound argument found below. That king Arthur was full of it",
            "You're not wrong cuz, you know.... beavers...",
            "Sounds like Auburn and Org St are sister schools",
            "Theirs too?",
            "It's pressure treated pine. How dare you say that!",
            "I’m just an Oregonian who has worked in the timber industry.   Driving to Corvallis you pass more grain elevators than sawmills\n\n(my uncle was a professor at Oregon and my first college football game was Arizona at Oregon 1994?  I am more an Oregon fan, but like to see both Oregon teams do well)",
            "Shoutout to HJ Andrews Forest",
            "Is she an Iowa person? Sounded from the south in the video",
            "Nah man, we should embrace the meme. Put Hawk Tuah on our helmets like Minnesota does with Ski-U-Mah. New chant after a big play:\n\n*Hawk tuah, spit on that thang!*",
            "Hey, don't you dare disrespect the UNC underwater basket weaving team like that. They work very hard.*",
            "Christ almighty, I’ll keep doing it my way lol",
            "📝I’m still learning midwestern lingo",
            "Same. I never understood the appeal of Mama Goldberg's or Niffer's Place when I was a student in the 2000's.",
            "I'm probably a little older than you and grew up in Auburn. When you could get a Mama's Love and Mama's Nachos with a soda for $7 it was a great deal. I visited home last year and couldn't believe the price. I asked the kid behind the counter and they are still making standard wages. ",
            "Garbage truck convention",
            "I hate them so much. I can't use one, I blame the 'tism.",
            "I believe you and I'm horrified",
            "HEB queso, both brisket and chorizo, is unreal how good it is.  They cracked the fucking code.",
            "I don’t like upvoting a horn but this warrants it. HEB queso is unmatched.",
            "Close enough I guess? Is gas not cool anymore?? Are we still using fire? What’s the new term…",
            "I'll never understand the sauce wars. If the meats are smoked right, put whatever you want on it. I prefer to try meat without sauce first.",
            "Because I love vinegar baby",
            "Lemme just say that I was in Edmonton a couple weeks ago (go Oilers!) Went to a place literally called MEAT and had some pretty fucking fire northern BBQ. Different, but still good",
            "If I were a pig and you put mustard on me before eating me I’d be livid. Have some respect. Vinegar is king.",
            "Shut the fuck up Memphis",
            "Do you like Hazy IPA's or New England IPA's? I feel like I've met a lot of people that hate west coast style but try a hazy or NE IPA and change their mind on the style.",
            "*faints in BYU*",
            "Fuck that, just use Captain",
            "You speak the truth",
            "As an Ohio State fan, it pains me to acknowledge the best *real* coneys in America are in Michigan.\n\nAs a Cincinnati fan, I think that Skyline, etc, really are almost an entirely different thing. It’s hard to understand, much less explain.",
            "I hate that I agree with you as a Gator from Tampa, but I agree with you on everything you said.",
            "Getting an NCAA investigation over mediocre burgers?? pathetic.",
            "BRING IT",
            "The Michigan State/Penn state ice cream rivalry is the only one that matters",
            "Nice, you guys have taken your Dave’s Double very seriously!",
            "On mobile, click on r/cfb to get to the sub page. Then click three dots in top left, then change user flair.",
            "Look if you’re going to argue with someone who uses the word “queue” you at least need to use the right word\n\nthey’re",
            "There are even 6 Skyline restaurants in Florida now!!",
            "Cincinnati may, by an oddity of geography, lie within the boundary of Ohio, but Cincinnati is Cincinnati and the *rest* of Ohio is Ohio.",
            "This is the second time I’ve upvoted you in this thread. I sincerely mean this, you’re truly one of us.",
            "Best Auburn meme ever",
            "The Atlanta MLS team co-opted that meme\n\nThem Five Stripes is Hell Don’t They",
            "Their Indian food is why you have to say almost",
            "Yeah, but our mascot eats wood. What does theirs do? I rest my case.",
            "Yeah 🤣 his is actual lumber and not the processing like ole Jimmy",
            "I do a bunch of work with wood and pine is the cheapest stuff you can get",
            "Tennessee \n\nAnd zero people are surprised by that",
            "My God I love this sport so much\n\n🫡",
            "Yeah, it’s crazy. I go there for spirit nights for philanthropy stuff, but if it weren’t for a good cause, I’d try and file a restraining order against that place",
            "‘tism? Like baptism by pee?",
            "The booth had a ton of Porta potties, which I found better to use than troughs the one time I was there in 2021.",
            "Saying something is “gas” is definitely newish, based on my experience with working with 18-23 year olds. \n\nSaying something “is a gas” is an old timey phrase from like the 30s-50s.",
            "Exactly",
            "1. I agree that the meat should be good enough to eat without sauce. Thats the key to a good smoker and good BBQ\n\n2. There’s some bad sauce out there lol",
            "*farts in BYU*",
            "Cool, I'll check that out",
            "I’m sure on the west coast via the I-75 transplant pipeline from Ohio/michigan.",
            "Literally! I went to UC! I can only have so many flairs though haha, had to go with the team of my birth and my first alma mater",
            "Auburn ain't wild. They mild.",
            "HE DOESN’T CARE FOR AUBURN **T-PAIN**",
            "This guy trader Joe's",
            "Eat beaver…tigers are carnivores",
            "Pinebelt intensifies",
            "Autism, my guy.\n\nAfter all, we don't do sprinkling.",
            "Jumpin’ Jack Flash",
            "Well I work with a bunch of people who are that age. I’m sneaking up on 30. But I feel old cause I don’t have any connections to social media. Other than here.",
            "And their mothers smell of elderberries. ",
            "There’s also a webpage flair.redditcfb.com to go to. Good luck and go Rainbow Warriors",
            "But beavers are great engineers. They will build elaborate contraptions to trick and confuse the tiger. They will then build up suits of armor to fight back and destroy them. At that point they have a taste for tiger blood and go on the war path. Hunting down every and all tiger in the world and wiping them out of extinction. \n\nThe beaver will build more and elaborate ways the tiger could never hope to fight back against. Beavers will win that battle 9 times out of 10.",
            "I coached my kid’s little league team and the kids spent two weeks calling everything skibidi and I still can’t tell whether it meant good or bad. Being old is weird.",
            "Is that a new DoTerra product?",
            "Thank you and Go Buckeyes",
            "Chill Allan…I am not talking about Tuna",
            "Did that go the way you thought it would? Nope.",
            "(Pours coffee on the Org st fan)….you urine sounds feminine hitting the urinal"
        ]
    }
}