{
    "[DISC] Chainsaw Man - Ch. 168 links": {
        "title": "[DISC] Chainsaw Man - Ch. 168 links",
        "score": 1511,
        "url": "https://www.reddit.com/r/ChainsawMan/comments/1ddg2zm/disc_chainsaw_man_ch_168_links/",
        "content": "**Source**|**Status**\n:--|:--\nMangaplus|[Online](https://mangaplus.shueisha.co.jp/viewer/1021452)\nViz| [Online](https://www.viz.com/shonenjump/chainsaw-man-chapter-168/chapter/43165?action=read) \n\n#[Join us on Discord!](https://discord.gg/chainsawman) \n\n\\----\n\n[View Poll](https://www.reddit.com/poll/1ddg2zm)",
        "num_comments": 2012,
        "comments": [
            "So... you guys excited for the Elden Ring DLC? Personally I can´t wait for the new fists weapon type, been playing with an Ozen (from MiA) cosplay character lately and the only fitting weapon are the Caestus so it will be nice to get something more fitting.\n\n----------------\n\nNext chapter release: 25th\n\n------------------------ \n\n#[Head over here for the discussion thread of the last chapter](https://old.reddit.com/r/ChainsawMan/comments/1d7z43y/disc_chainsaw_man_ch_167_links/)",
            "HEY THAT WASNT SO BAD\n\nhttps://preview.redd.it/tye4kl04jy5d1.jpeg?width=1170&format=pjpg&auto=webp&s=826ec043f791e6c0d306b43f841695d586f7a914",
            "https://preview.redd.it/f8al17bdjy5d1.png?width=1080&format=pjpg&auto=webp&s=18ab9322910f09562cd9365bb2f6e8a5e9bce2cf\n\nLocal woman loses to herself",
            "https://preview.redd.it/k7okxkvxz26d1.png?width=1080&format=pjpg&auto=webp&s=109c90ae4da0715cad81c080a540f8b22d9d2b54\n\nAsa won against yoru, powerscalers in shambles.\n\nI want like an extended segment when she js fights herself like a meth addict",
            "\"Chainsaw Man, it is imperative you understand that I don't like you.\"     \n        \n*kisses him again* \n      \n\"To reiterate: I do (not) like you.\"",
            ">Death by Sushi\n\nsurely this is fine\n\nthat's not ominous at all",
            "https://preview.redd.it/dyrzn5ncjy5d1.jpeg?width=1598&format=pjpg&auto=webp&s=223584cc7b94191f3600bda9ab9b335256ea0b1a\n\nFujimoto at his best right here",
            "Someone save my bro 😭💔\n\nhttps://preview.redd.it/ojxs0zt6jy5d1.jpeg?width=1170&format=pjpg&auto=webp&s=63183d2c5124849b3bb536719a09c897bddc381f",
            "AsaDen stocks rising again? 😱\n\nhttps://preview.redd.it/xi6ax7sajy5d1.png?width=1080&format=pjpg&auto=webp&s=8503ec6ff8e1c71c94494f33c88737d33ed944e7",
            "https://preview.redd.it/3io6mpr2ky5d1.png?width=656&format=png&auto=webp&s=ab147206456242a2e262a398305add3b8d347928\n\nI'd kiss him too",
            "[deleted]",
            "Denji be like\n\nhttps://preview.redd.it/1ssm9ts7jy5d1.png?width=498&format=pjpg&auto=webp&s=ffd01176ace34164f91991bc5b50ae19df0884b6",
            "https://preview.redd.it/j8edlhgzjy5d1.jpeg?width=1080&format=pjpg&auto=webp&s=1b4177a53f8bd76dd389075c96c2f7bae9cd7be0\n\nThis sushi arc better be the most peak shit with the amount of buildup it got",
            "You know, despite everything that's happening and the context. Asa's feelings are actually really sweet. She doesn't even deny that she likes him and her concern is that he might think wrong of her. Is really sweet.",
            "Man...\n\nhttps://preview.redd.it/ukql44skly5d1.jpeg?width=3413&format=pjpg&auto=webp&s=94c751eec2b83c88f31ef5ad878bd7a98eed70d2",
            "Asa going full shcizo and fighting with herself...\n\nThis chapter is peak",
            "Kiss Love Sperm is a deranged fucking title only the autism of fujimoto can come up with this",
            "Denji, I know you’re traumatized but If your love interest is talking about herself as the “Other me.” she’s not tsundere, she’s possessed or schizophrenic.",
            "https://preview.redd.it/kgc1apgmky5d1.png?width=791&format=pjpg&auto=webp&s=0666991e359f7c98d06284709896cfa94c5b5ffc\n\nPls feed her 😭",
            "Forgot about the break\n\nhttps://preview.redd.it/jfy6rvuzec7d1.jpeg?width=923&format=pjpg&auto=webp&s=eda79a925c7de97e5209ecf78079346c772d9983",
            "Denji is too shocked to digest what just happened.",
            "https://preview.redd.it/n0snw563ky5d1.jpeg?width=1284&format=pjpg&auto=webp&s=382b024476c95a7e9147fb578910130e34250920\n\nYORU STOP IT HES EMOTIONALLY TRAUMATIZED YOURE PLAYING INTO HIS WORST INSECURITIES NOOO YORU NOOOOO THE CYCLES OF TRAUMA ARE REPEATING NOO",
            "It’s Denjover\n\nhttps://preview.redd.it/ag2wz38fly5d1.jpeg?width=1125&format=pjpg&auto=webp&s=07e51cf8a2b42045d453de352da4ce8f8e9cc64f",
            "https://preview.redd.it/icg1to8djy5d1.jpeg?width=268&format=pjpg&auto=webp&s=c393aa7599c555dfb317b7c2e6314535be4d6028",
            "The amount of awkwardness between these two is fucking hilarious \n\nhttps://preview.redd.it/ajb6xfsyky5d1.png?width=627&format=png&auto=webp&s=4ff8effafb8665bc5c4c7854e877f1045bce8f6a",
            "Just realized they’re all starving which means Fami can play them for pawns.",
            "Asa beating the living shit out of Yoru is so satisfying\n\nhttps://preview.redd.it/y1osyqd8oy5d1.png?width=571&format=png&auto=webp&s=413879d0dd6a9896d5c1be95885857bb70135b6e\n\n# Beat her ass Asa!",
            "this was a lot nicer than i was expecting lol.  people were doomposting way too much 💀.  i think Denji and Asa are gonna finally discuss their feelings over this sushi lunch",
            "https://preview.redd.it/x4kbfny6jy5d1.jpeg?width=624&format=pjpg&auto=webp&s=954ba7892e99b369fd99387e22e18afb761ab852",
            "The fact that she’s more concerned about the kiss than the handjob 😭\n\nhttps://preview.redd.it/z40cq3q5jy5d1.jpeg?width=1170&format=pjpg&auto=webp&s=9bd49dd2d0a03b9e20409b49e3827811d38d29fa",
            "We fools were too busy wondering who would be at the brothel to realise, the Sushi Restaurant was the Death Devil the whole time!",
            "https://preview.redd.it/iwakwmqujy5d1.jpeg?width=1080&format=pjpg&auto=webp&s=664622fa310dfec9503c280e1830f581fdd8ef07\n\nAsa really beating herself up",
            "https://preview.redd.it/quym5sumjy5d1.jpeg?width=1242&format=pjpg&auto=webp&s=62d2ea9a97d7f8c1f80a0e1a06e1fed9e403bef6\n\nPraying this goes somewhere and Denji gets to be in a stable relationship for once",
            "Yoru rn:\n\n\"I'm not a slut! I'm not!!\"",
            "Peak slut shaming chapter\n\nhttps://preview.redd.it/vdtjgxnjjy5d1.png?width=1080&format=pjpg&auto=webp&s=32689960e51df3f57b48598f8bed81866b56d79c",
            "https://preview.redd.it/njx2m7d5wy5d1.jpeg?width=404&format=pjpg&auto=webp&s=a6a3e5bd313941d4283a8ad0f29721bded949fd7\n\nFami doesn’t know what’s going on anymore either.",
            "Meanwhile, discussion among JP fans\n\nhttps://preview.redd.it/lkqw7rczz06d1.jpeg?width=828&format=pjpg&auto=webp&s=8d219f311a741db2cf4dc1533adbef4a8fd93b0b",
            "Post nut clarity:\n\nhttps://preview.redd.it/qgdvtldhky5d1.jpeg?width=912&format=pjpg&auto=webp&s=b0f83f57302ea92a5fb756f63f316e0be687b9fd",
            "I liked this a lot, and I think it did a good job capturing the complex nature of our relationships especially with Yoru insisting she only did it because it felt good and then Denji being hit with the emptiness of being told she didn't like him.\n\nAnd then poor Asa, she's just upset because she doesn't want Denji to see her as a \"slut\"...I felt so bad for her and Denji both at the end of this one.",
            "It has just dawned on me Fami has possibly been starving them on purpose in order to control both of them.",
            "Guys guys, she DOESNT like him. Not at all. Not even a little. Nope.",
            "I can't stop laughing she even did the disgusted shinji look on her hand + the fight scene\n\n\nAsa & Yoru somehow girlfailured their way to victory",
            "Isn't it rather dangerous for both of them to be hungry around Fami?\n\nShe can control those who are starving after all.",
            "- both protagonists are hungry \n- Famine, who can control those who are hungry, just sitting there ominously \n- Death by Sushi\n\nHmmmmmm…",
            "https://preview.redd.it/pnzocm7hqy5d1.png?width=1080&format=pjpg&auto=webp&s=8b24c3bdce170cf56f7c207f856e86595b807c9d\n\nLive denji",
            "First time she’s ever looked like this. She’s definitely meant to be lying about not liking him\n\nhttps://preview.redd.it/tsgm6p5t3z5d1.jpeg?width=828&format=pjpg&auto=webp&s=a5ed2fda965b193d242e8f294f58171dfab07b92",
            "I feel like they keep mentioning that they are hungry these last couple chapters. It makes me feel like Fami is up to something or maybe she’s already influenced the characters in some way without us knowing.  It just throws me off.",
            "https://preview.redd.it/ck417r7rh16d1.png?width=1187&format=png&auto=webp&s=5978affc47198a38a65205358f1222820d36a6c7\n\nSomeone please help this poor kid ![img](emote|t5_rmtrq|22174)",
            "https://preview.redd.it/zhqh2qiv4z5d1.png?width=719&format=pjpg&auto=webp&s=9a0d753796677f54d863b39c32b52fef1b727191\n\nBruh...",
            "So the three characters all come away with different takes on what just happened. It's important to note that in CSM, when someone is genuinely attracted to someone else, they blush. And the opposite is true, with Fumiko being a great example. She never blushed once when flirting with Denji. Yoru on the other hand blushes throughout the entirety of her appearance this chapter. Even after regaining composure and walking away.\n\nYoru is trying to claim it was a just a moment of passion born out of curiosity while still heavily blushing while talking to Denji and then going in for another kiss..one that seemed more tender than the lustful ones from last chapter. She seems to be falling for Denji but doesn't want to admit it to herself. \n\nDenji once again feels like he is just being used albeit with the caveat that some part of Asa seems to like him. In his last panel in the alleway he's on the ground blushing and in the light as the rain has stopped. It seems like he got part of what he wanted, someone to desire and want him but like the rest of his life it was twisted and not so straight foward.\n\nAsa just witnessed herself making out with Denji and losing the choice to do it herself when she was ready. It's already been shown that she had physical desire for Denji (her rant after the memory block) so the idea that she'd hate  touching/kissing Denji never seemed to track. Moreso she wanted to go at her own pace and Yoru decided to turbo charge it and not understand why Asa would hate her for stealing a romantic moment from her.\n\nAlso the shocked face last chapter  seemed to be Asa coming back through with intense emotion only to be forced back out by Yoru. Their transitions no longer cause huge body jolts like earlier.\n\nTldr, Yoru likes denji but doesn't want to admit it, Asa hates that she lost the chance to choose when to be intimate with Denji and Denji is wondering why all the women in his life are psychos.",
            "\"I only kissed you because it felt good.\"\n\nYeah, nobody is topping this. We have a new tsundere queen!",
            "https://preview.redd.it/0qa5qfbpjy5d1.jpeg?width=744&format=pjpg&auto=webp&s=3907e53847581c7dddcf3f4d6f276973471aee56\n\nShe switched back to Yoru in the opening itself",
            "I dunno gang, I really feel like Yoru likes Denji more than she knows herself, and is putting all the blame on Asa. She says she only kissed him because it felt good, but as Makima put it, those things feel better the more you know your partner.",
            "My only complaint is that the chapter went by way too fast",
            "Yoru’s in denial, Asa’s flustered, and Denji has absolutely no clarity\n\nActually about what I expected lol. At least we finally started cluing Denji in about War. \nNow we just need Yoshida and Fumiko to ruin the sushi date",
            "Yoru : \"I only did it because it felt good, I don't like you\"\n\nOk, now why does it feel good? And why do you keep doing it",
            "Restaurant at the end is called Death by Sushi.. surely no one fears sushi right? Sushi devil?\n\nhttps://preview.redd.it/ngybo4q4ky5d1.jpeg?width=3840&format=pjpg&auto=webp&s=b548f6426fee6379c95f7aa03c10a5608f1a996c",
            "Asa not vomiting or crying was not on my bingo but I am honestly surprised",
            "I'm surprised that Asa is more concerned on how Denji will think of her after the kiss and not the fact that she made him cum on her hand.",
            "Denji froze my guy hasnt moved for 40 mins",
            "https://preview.redd.it/hk5l5psr406d1.jpeg?width=1067&format=pjpg&auto=webp&s=99eb22f2dbd7444b56d9fc91a177ff50687b7fda\n\nThis looks so ridiculous out of context lol",
            "That whole \"Asa & Yoru are merging\" theory might've gotten some credibility after this chapter. Usually, Fujimoto draws both Asa & Yoru together whenever they're not around others but here, we can only see ONE of them taking over while the other one stays invisible\n\n\nThis could mean one of two things: either they are slowly merging and this is Fujimoto's way of showcasing that scenario or...both Asa & Yoru are fighting for the dominance of the body & personality. It could go either way but something is definitely up with their weird hybrid/fiend connection",
            "# When intrusive thoughts Attacks.\n\nhttps://preview.redd.it/ppuct9llt56d1.jpeg?width=1482&format=pjpg&auto=webp&s=8aea4772fe981d88e44fe7d0ddde6e6263599fd4",
            "She even gave him post-nut kiss 💀",
            "https://preview.redd.it/9gflgtb8my5d1.jpeg?width=1125&format=pjpg&auto=webp&s=afb52bf1fdcdc4ab021cb142ce05d74adb6a2812\n\nI feel like I’ve seen this movie before",
            "Ok bros we were all glad that Kobeni wasn't at the brothel, but what if she's working at the sushi place",
            "https://preview.redd.it/ii7bq0as806d1.jpeg?width=251&format=pjpg&auto=webp&s=5bc93968b5cbf7e0de83eaf59ffff61a9defde37\n\nBe like Fami\n\nShe doesn’t care about needless shit like “why did you kiss me?” or “he’ll think I’m a slut now!!”\n\nShe only thinks about food\n\nAnd right now, she is resting\n\nWhy you might ask?\n\nIt’s because she’s hungry… and tired\n\nFucking feed her, please. I beg of you, Fuji Motor 😔",
            "Fami better not...\n\nhttps://preview.redd.it/4eee2t0i516d1.png?width=723&format=png&auto=webp&s=07e4ee34a7100b19fc5be80fe53b35754c1de732",
            "Asa and Yoru provide such an interesting dynamic. For as pragmatic as Yoru presents themselves, this chapter alone shows how easily swayed they are by strong emotions. As someone mentioned elsewhere here, that panel of both of them walking separately shows a rift between them…and yet Asa’s emotions are so strong that they’re piercing into Yoru’s own.\n\nAsa and Denji are both surprisingly quite fond of each other despite only really going out once and having that memory wiped technically. Probably owes to their crippling need for affection and a safe, homely environment.",
            "So, yeah, Death by Sushi putting out some interesting dishes\n\nhttps://preview.redd.it/n6wow1jyz26d1.jpeg?width=316&format=pjpg&auto=webp&s=4333b2e6528697817292727969d4766228391ae3",
            "My god the emotional rollercoaster Denji goes through is just brutal. I just want to see our boy happy",
            "Fujimoto really good in \"slice of life\" genre dont you think?",
            "By the way, in japanese Yoru says the same line as Shinji from EoE. In case the homage wasn’t obvious enough. \n\n最低だ “I’m so fucked up”",
            "https://preview.redd.it/q1gg9l3rjy5d1.jpeg?width=4320&format=pjpg&auto=webp&s=ace411d50b22ceb5085b06a303487be92d54319c",
            "Asa: Denji thinks I'm a slut thanks to you!\n\nMeanwhile Denji:\n\nhttps://preview.redd.it/d4enjj0l2z5d1.jpeg?width=1125&format=pjpg&auto=webp&s=da4d17111926efa3c70e640ab9046cd476a0c240",
            "No one commenting on the fact that yoru just outed herself to denji?? Who else knows she inhabits Asa's body aside from the sisters?",
            "so does denji just think asa is schizophrenic or did he figure it out ",
            "I knew some people would set themselves up for disappointment when they thought 167 was gonna be this huge earthshattering moment for the both of them,when Fujimoto usually prefers to move on while letting these events linger in the back of your mind. And I love that about his style!\n\nMost times,there's no one true epiphany,no clear-cut way to change who you are or understand how you feel,you simply have to internalize it,keep going,and hope next time can be different. It's also why Denji keeps relapsing into being a victim,despite being aware since the end of part 1 that most only have their own interests in mind with him, and wanting to be his own person. It's just so hard.\n\nAsa and Denji simply had an akward encounter that hurt them just as much as it made them aware of what they feel,and that's ok. That glance across the traincar already says a lot.",
            "Yuro suggested eating raw uncooked meat after she just handled raw uncooked meat.",
            "ASA WORRYING SHES A SLUT IN DENJIS EYES NOW 😭",
            "Denji try to be happy challenge impossible",
            "Everyone around Fami claims to be starving and her head isn't heavily tilting to the side as usual. Surely nothing is going to happen at the sushi restaurant! \n\n\n >Fresh Raw Fish Testes \nimmediate PTSD for those two i see \n\n\nalso Asa has now become a mouth-breather like Denji lmfao",
            "#FUJIIIIIMOTOOOOOOO",
            "https://preview.redd.it/bqczywtrj16d1.png?width=1080&format=pjpg&auto=webp&s=7a6863dbb57173ff0ab7d77be2247526fb798bc8\n\nI love this\n\nOnly when Yoru walked out in the sun light then Asa appear",
            "This has got to be the funniest \" Why are you hitting yourself \" moment ever",
            "Yoru: “Only the other me likes you…her feelings flowed into me.”\n\nDenji: and my feelings flowed into her hand 🌚",
            "https://preview.redd.it/04qpsu964z5d1.jpeg?width=748&format=pjpg&auto=webp&s=6d2f956287c6f95f35817609183be57fbc2deb7c\n\nDamn she really touched his face with the cum hand.",
            "https://preview.redd.it/sasikoqndz5d1.png?width=1080&format=pjpg&auto=webp&s=f55ab55bbd9a1fbfed4a93c53b5397b1fdded9e4",
            "I'm not a slut, I'm not!",
            "I have a bad feeling about Fami and the sushi restaurant next chapter",
            "The post nut clarity devil get a little bit stronger today.",
            "Goddamn it, this manga really never ceases to surprise me lmao. Out of all the outcomes I expected, I didn't think about Asa worrying about Denji thinking of her as a slut. I did expect her to get angry with Yoru though. Also, I still think that Yoru's capping hard, she definitely has some feelings for Denji. Fucking love this story so much for being so unpredictable",
            "https://preview.redd.it/92a2ndv1376d1.jpeg?width=828&format=pjpg&auto=webp&s=e03963d2fc8ae88f4c5c9210f5052437edb42395",
            "Also, I am glad fujimoto writes csm and not twitter or reddit because I saw the worst takes ever good lord",
            "Felt too short",
            "https://preview.redd.it/x96w3zcxky5d1.jpeg?width=828&format=pjpg&auto=webp&s=ef4ce10ef6844a8d2f7622409d6520711cb213cd\n\nFuck it, let’s get sushi. See y’all in two weeks.",
            ">Death by Sushi\n\nDeath Devil confirmed.\n\nAnyway, this chapter was a tasteful follow up to what happened last chapter. Yoru is becoming more human, Asa seems to be able to wrestle control from Yoru when she's angry (idk if she can already do this before or if this info is new due to Asa becoming stronger), Denji is experiencing a roller coaster of emotions from what just happened and the gang finally gets to have sushi (inb4 this is where the next major fight happens). Denji and Asa being opposite seats across the aisle with their faces being flabbergasted was pretty funny.",
            "Fujimoto continues to add to the awkwardness of this uncomfortable moment, as Denji is left so confused at what Yoru says about why she kissed him and whether or not she likes him. \n\nOn the bright side.  at least Yoru made the distinction between her and Asa, but that may lead to Denji thinking Asa has a mental illness or is straight up crazy.\n\n\nAsa taking her frustration at Yoru by hurting herself was funny but also sad since she’s concerned Denji will think she is a slut and think less of her. Her insecurities were portrayed very well in that moment.\n\nI’m surprised that they are heading to a sushi place, and I’m confident it will be even more awkward with the others asking Denji and Asa what they did in that ally.",
            "I’m so glad Asa didn’t take over and blame Denji over what happened last chapter.",
            "Tsundere Yoru\n\nhttps://preview.redd.it/tgbe52hvvy5d1.jpeg?width=1170&format=pjpg&auto=webp&s=1af2719cba06bbda446ede4c537f733e920f06d4",
            "Fujimoto be like hmmm what would go well with extreme post nut depression Denji?...\n\n✨B A C K G R O U N D  A R T ✨",
            "lmao, only other me likes you, denji confused af",
            "Denji looks like he's been edited into the page.\n\nhttps://preview.redd.it/ufiez9t2rz5d1.jpeg?width=1080&format=pjpg&auto=webp&s=5249ee5031cb6435ddd83172c455fee81fbf7b3f",
            "People falling hungry... Ends in cryptic scene with Famine...\n\n**FUCK!!!**",
            "https://preview.redd.it/35r4uc8ab06d1.jpeg?width=886&format=pjpg&auto=webp&s=e1bf5beba8b353db9413ebb5977d38431eb17229",
            "I love Asa lol",
            "#REZE REPORT: Chapter 168\n\n#\n#\n\nShe isn't here. See you next week",
            "\"I only kissed you because it felt good\". This was supposed to be an excuse for Yoru but it's probably the best thing Denji could've asked to hear. She didn't kiss him to manipulate him or to incapacitate him, it was a kiss of pure affection.\n\nAnd Asa's main complaint about what Yoru did isn't that she didn't consent to it but what Denji will think of her now. But since Denji doesn't actually think anything bad about her and he knows she likes him, could the Asaden ship really set sail? I really hope so.\n\nThe sushi restaurant they went to is called \"Death by Sushi\". I wonder what that's supposed to mean, could we meet the Death Devil in the next chapter? Is it gonna be Kobeni working there as a waitress lol?\n\nThe contrast between the background drawn by an assistant and Denji drawn by Fujimoto is huge in this panel\n\nhttps://preview.redd.it/ruk89wn4oy5d1.png?width=1013&format=pjpg&auto=webp&s=59dfe65d0dba54f64a04557592242458c94607eb",
            "No sperm sword\n\nhttps://preview.redd.it/oi3yu5rfjy5d1.png?width=1080&format=pjpg&auto=webp&s=8ba9258ed4381fbe1a208299b4f45cf4c7690974",
            "I think if we look at Denji's sexual encounters, there's always this cycle of getting what he wants, but with a monkey's paw twist.\n\nHe thought if he could just touch some girl's boobs, he'd be happy. Then he touched Power's tits but they turned out to be fake. He wanted a kiss, but then Himeno puked in his mouth. He wanted a date, but then Reze bit his tongue off and left. He wanted a relationship but then Makima killed everyone he ever loved.\n\nNow he wants sex, and, just like previously he kind of got what he wanted. But now he realizes he actually wants to be loved, and the girl that actually maybe likes him is trapped behind Yoru. If anything this is kind of the least harmful one.\n\nIf you want to place bets on how a story will go, bet on the continuation of things that have already happened. That's what I do.\n\nIf people still want to read it as Denji getting SAd they certainly can. Though, transparently, I think it's clear that the point of 167 and 168, is just to say: Yoru wants to fuck Denji, Asa wants to fuck Denji but she actually likes him, Denji wants to fuck Asa but as always he is confused -- he thinks it's sex he wants but the desire for sex is a symptom for his underlying desire for companionship. They had a kind of spontaneous, if not over the top and ridiculous, sexual encounter and now things are complicated.\n\nIt's fine. We're fine. Everything's fine. Fujimoto isn't a pedophile or whatever. It's all good, lmao.\n\nAlso props for getting Yoru punched in the face",
            "[deleted]",
            "Kobeni will be working at the sushi place!\n\nEdit: spelling",
            "Asa was able to have some control over her body while Yoru was in it. This has interesting implications that they are *indeed* becoming one identity. I've never seen happen before. It was either 100% Asa or 100% Yoru. \n\nAlso, does it mean something that Yoru talked about Asa as \"the other me\"? She could've said \"I don't like you, Asa likes you\" and it would've sounded just as weird for Denji.\n\nAnd finally, come on Asa, for what you know about Denji, him thinking you're a slut is actually a good thing lol",
            "“The other me likes you, her feelings flowed into me”\n\nHopefully Denji hears that and connects the dots that she’s being possessed by a devil and that Asa is pretty cool. \n\nAlso what are we gonna do about Nayuta?",
            "https://preview.redd.it/47pmw2v92z5d1.png?width=215&format=png&auto=webp&s=06028fa923c52458e7f9f29e5b55b7da82f9108f\n\nAah hah hAAA now that he is sit, imma give him another kiss waaa ha haaaa",
            "fujimoto my king.... more than three panels a week please...... im starving...",
            "I’m gonna laugh if the sushi restaurant is hinting at the death devil appearance",
            "Asa getting angry enough to force back control from Yoru is interesting, something to do with her also having Yoru's powers, & treating their body's fist like her weapon against Yoru? ![img](emote|t5_rmtrq|22165)\n\nDenji & Asa continue their extremely maladjusted relationship, & after a brief moment of passion, once again forced on them by Yoru, go back to a frustrated distance because of each others actions & reactions ![img](emote|t5_rmtrq|22174)\n\nFujimoto's writing is really fantastic at having characters repressing/ ignoring difficult or upsetting emotions, a real life toxic flaw that is so rarely portrayed that accurately in most media ![img](emote|t5_rmtrq|22169)\n\nThat whole panel of Denji alone in an alleyway sure was a depressing callback, to after Power's death ![img](emote|t5_rmtrq|22164)",
            "Kobeni: Welcome to Death by Sushi! 🙃",
            "Cool little overarching storytelling device I noticed that Fujimoto is playing with right now.  \nChapter 90 was called “Super Power”.  Chapter 167 “Super Smooch”.  \n\nChapter 91 “Power, Power, Power”, Chapter 168 “Kiss, Love, Sperm”.  \n\nChapter 92? “Zombie, Blood, Chainsaw”.  It’s not an exact match up because the order is different but Chapter 166 also followed the similar “3 things” wording with “Rain, Brothel, Removal” \n\nbut anyways I’m sure the point I’m trying to make here was back in Part 1, these chapters were right before the penultimate fight AND Denji was very self aware of how he was living his life.  He even is crouched in the same pose in both ch 168 and ch 92. He’s also told to eat because tomorrow he has to fight.  Kobeni is next to him telling him it’s normal to be used and that there’s no such thing as a life free of bad things except for in your dreams.  So something big mentally is finally about to happen to him, hell maybe Kobeni really does show up at the sushi restaurant.  Maybe Denji gets his groove back.  Who the the hell knows\n\nIt’s fun if there’s a link between these chapters but idk what’s going to happen next with this dude so we’ll see 🙃",
            "wait is this a love story?!?",
            "The entire Asa/Yoru interaction was incredible. Probably the best presented interaction between them in the manga to date.",
            "Yoru and Asa is all concerned about the kiss meanwhile Fami is just fucking done with everything, wishing she could eat already",
            "Yoru-sama: Love is War",
            "This manga turned into fight club for a moment",
            "Fujimoto’s expressions are undefeated\n\nhttps://preview.redd.it/vcmqopkj5k6d1.jpeg?width=369&format=pjpg&auto=webp&s=79493c099b42e6655ae8643e41b1a98eb2ed43ea",
            "This is exactly what I wanted out of the Asa/Yoru side. It oddly triggered certain repressed memories for me. Long story.\n\nAnyway: death by sushi lmao thanks Fujimoto",
            "Cinema",
            "Asa punch her self with the cum hand. Cum punch",
            "says she wants to kill you\n\njerks you off\n\nrefuses to elaborate\n\nleaves",
            "Objective: read the new csm chapter\n\nChallenge: my mom is literally sitting right next to me",
            "I feel so bad for denji. I think he was really hoping she would say “I like you”, bc asa was the only girl he kissed before where nothing bad happened afterwards. Everyone has treated denji like an object and without nayuta he’s emotionally isolated rn. Hopefully the clue about “the other me likes you” will push him forward, but without some help it’s not looking good.",
            "https://preview.redd.it/tsq7uhgbjy5d1.jpeg?width=640&format=pjpg&auto=webp&s=0d3347b0aa605beacea580d5e2653ade8ad4147e\n\nNext Chapter Title: A Devil’s kinks",
            "Gets a handjob, cums immediately, girl tells you she doesn’t actually like you \n\nBrutal whiplash",
            "denji experiencing the most insane post nut clarity rn",
            "Loool Yoru went for another kiss. Bro, I canttttttt, the next is in two weeks 😭",
            "https://preview.redd.it/mirey0w6ly5d1.png?width=1080&format=pjpg&auto=webp&s=19e5c9e5021f4e326eeff32f336b15f6ff2b4edc\n\nThere is a 0 percent chance they're gonna eat sushi before something interruptes them",
            "Imagine the girl you like has two personalities, and neither of them can admit they want to be with you.",
            "Tsundere Yoru and Asa being scared of how Denji perceives her, not of the fact that the kiss actually happened \n\nAsaDen bros we are so back (?)",
            "Denji's dumbfounded look is exactly what I expect and wanted from this chapter. He's trying to process what the hell just happened. \n\nNeed to process let's get some sushi as fish is a brain food.",
            "Familiar face may be working at that sushi place",
            "I find it interesting that Asa has that much control over her body now. Either she's getting used to it and Yoru's influence is wavering. Or Yoru likes Asa enough to give her a little bit of control even if Asa is being hostile.\n\nThis could also imply that Asa could've stopped the kiss at any point but her horniness was stronger (which is already implied as Yoru said these aren't her feelings) and she let it happen. It's a bit unclear whether Asa experiences and feels things like Yoru does when she's in control or if it's more like an out-of-body experience. Or maybe Yoru was so into it that she stopped Asa from cockblocking her.",
            "Death by sushi. DEATH by sushi. Shit is going to get real soon mark my words",
            "I like how it stopped raining after she said her other half liked him. Lol",
            "Denji machine broke... Again",
            "I hope our favourite waitress likes working at Sushi restaurants",
            "Sushi and Death? Fumiko reveal incoming\n\nhttps://preview.redd.it/j22k4vimhz5d1.png?width=1681&format=png&auto=webp&s=b3506bdce7dea12ebef94cdc7f8ab37b900ae5e2",
            "Just noticed that the banners outside the sushi restaurant are advertising fish testes (sperm) and roe (eggs)\n\nVery subtle, Fujimoto, lmao\n\nInb4 Katana gives either Denji or Asa a plate of fish sperm without even realizing the irony",
            "Poor Denji. That full page of him looking dejected in the alleyway really hurt. It's like he realized that he was used for nothing but pleasure for the other person at his expense.",
            "Denji just looks completely done now. He has been through so much that his brain just stopped working. The combination of so much trauma finally catching up to him.",
            "Yoru says she doesn’t like Denji but in the next breath says that there is a part of her that does. I believe Denji is in shock and doesn’t know how to handle this situation. As he said before to Asa “You make no sense!”",
            "DEATH by sushi? I know what's coming next. The horny devil!!",
            "Speechless at how that continuation goes, mAh boy denji be thinking \n\nAlso, death by sushi? Surely the sushi won't turn sentient and kills everyone right? Like that one movie about killer sushi......\n\nBut this is fujimoto we're talking here......",
            "What I want to know is how much of the scuffle between Yoru and Asa did Denji hear?",
            "\"Why would you kiss him\", I'm surprised that's she's most worried about 😭💀🙏",
            "I knew it...I knew Yoru would end up having feelings for Denji, like this chapter really confirms it, she even went for a second kiss. She said she kissed because she wants to confirm that they've kissed before so she could turn Denji into a weapon, that memory got erased by Nayuta. \n\nInteresting that this kiss went even harder and the fact she is super aware that Denji is Chainsaw Man...is it like a kink or something?\n\nAsa, as always didn't like that and she means business, going so far to call Yoru a slut and punched her. She wanted that perfect couple relationship road and Yoru skipped that for sure.\n\nAlso, Yoru called out to Denji about the other her which is Asa of course, assuming Denji picked up on what that means, he could now be aware of who and what Asa actually is...which could lead to some, interesting complications.",
            "the both of them being hungry makes me worry about fami's power",
            "That second kiss was smooth af by war.\n\nAlso very interesting too see that asa is able too take over control (i assume war let her take control but still impressive)",
            "The Death Devil is a sushi chef?",
            "![img](emote|t5_rmtrq|22158)",
            "Man just leave my boy alone for once",
            "WTF IS THAT TITLE???\nHOW DOES HE KEEP GETTING AWAY WITH IT??\nHE SURPASSES THE EDITORS LEVEL WAY TOO EASILY",
            "Yoru convincing absolutely nobody when she says I'm not stupid, I'm not! and I only kissed you because it felt good! ×2",
            "They're down bad. Death Devil coming.",
            "168 could be used as a sushi commercial. Even I wanted to eat sushi after watching this.",
            ">Death by Sushi \n\n\n>Death\n\n\nForeshadowing?",
            "https://preview.redd.it/8ky6vr2hjy5d1.png?width=352&format=png&auto=webp&s=4ea82770dad6fd7779cccc57dd522a762f213a83\n\nShe smol",
            "“Death by Sushi.” Gonna lose my mind if this is where Death shows up",
            "Something weird going on with this page.\n\nhttps://preview.redd.it/5do4v075116d1.png?width=1681&format=png&auto=webp&s=9c2da732b99d819a09447564eaa8897e229f1b39\n\nThe Japanese is: 私の中の私が好きなだけだ  \nIt means something like: \\*The inner me likes you, that's all.\\*\n\nOr more literally:  \n\\*The me inside of me likes you, that's all.\\*\n\nThe English TL takes one possible interpretation and makes it so blatant that in the English version Denji would know for sure that there's 2 beings inside Asa/Yoru.\n\nWhereas in the Japanese it could be taken as \"Somewhere deep inside of me... I might like you\" which is why he's so confused (and explains his epiphany later in the chapter, when he perks up in the train.)",
            "bro really named the saddest chapter in part 2 so far “Kiss, Love, Sperm”",
            "I love this stupid manga so much lmao ![img](emote|t5_rmtrq|22176)",
            "Thoughts:\n\n- Re-read chapter 112: Between Cat and Criminal - this chapter makes a couple callbacks to that one, but with some important changes, so flip through that if you need a refresher\n- Notice how Denji is posed this chapter, especially on page 8 with all the cardboard and trash. Last time, he was the one who'd sold cigs to a homeless man. Now *he's* the homeless man - both in the sense of being literally homeless, but more relevantly, **he's the one who's been \"ripped off\"**. All of these kisses he'd thought were with Asa turned out to be with someone who looks like her and sounds like her, but somehow, isn't her. \"American cigs\".\n- Asa runs to catch up with someone just as they're crossing the line from the dark into the light. Last time, it was to ask Denji out on a date, but this time, it's to war with War. The lighting is drawn inconsistently, but the panels around the point where she says, \"That... hurt! I thought you liked Chainsaw Man! Shouldn't you be happy?!\" show her with her head \"half in shadow\". \n- I'm sure many have already caught on to the punny name of the sushi restaurant. \"Death by Sushi\" - *sushishi* can be rendered as 寿司死 (sushi-shi, \"sushi death\"). The fact that the flags are advertising fish reproductive parts - [milt](https://en.wikipedia.org/wiki/Milt) and roe, or testes and ova - likely weren't missed, either. Ch 112 was directly followed by the aquarium, while this chapter directly leads into a sushi restaurant. Establishments full of dead fish.\n\nPoor Denji. He's a pretty simple guy: he likes people who like him (ch 40), and he's also the type to forgive and forget *ridiculously* quickly. So while I'm sure this whole alleyway episode has just added to already tall pile of stuff he's struggling to mentally digest, I don't think he's going to begrudge the fact she sexually assaulted him any more than he'd begrudged Aki, Power, Himeno, Reze, Fumiko, or even Makima for all the shit they'd done to him. Denji's single brain cell is going to hone in on that confirmation that some part of Asa *does* like him, so even though he's been explicitly told that there are multiple \"sides\" to her, I suspect that he still hasn't clued in on what's going on with her scars yet. He has to devote more brain power to it (and get some food in him).\n\nIt's interesting that the first thing Asa takes offense to isn't in how Yoru misused her body. Neither does she seem all that flustered by Yoru repeating the fact that she likes CSM, even though this had been something which embarrassed her before. Asa's angry - and *afraid* - of being seen as a \"slut\", enough to have been able to wrest back control of her body. If Yoru was right, Asa's issue wasn't with killing Bucky, it was how others perceived her for having killed Bucky; analogously, Asa's issue isn't in having kissed (and groped) Denji, it's how she thinks Denji will perceive her for having done so.\n\nConsidering Fumiko's stated love of sushi, and also the way the aquarium incident ended (Yoshida looking up and making eye contact with Famine), I wonder if the group is going to run into them here.\n\nSee you in 2 weeks....",
            "Loved how the chapter completely humanized and gave context to the chapter before. It's a complex and nuanced situation. \n\nHope the fanbase will grow up : )",
            "Someone help out my man Denji get him out of here",
            "So Asa can now partially willingly take back control. That’s pretty significant.",
            "https://preview.redd.it/zqdf7xj2ky5d1.jpeg?width=1086&format=pjpg&auto=webp&s=bd7239b642834f68304c0075fafae0e5212a8dbf\n\nASA YOU GO GIRL DESTROY THAT LOSER DEVIL",
            "The post nut clarity hits like a truck.\n\nhttps://preview.redd.it/l186ghz6ky5d1.jpeg?width=386&format=pjpg&auto=webp&s=2788e019a91e696e3a2e3273ea35b89d76f3de59",
            "Looks like we were right\n\nhttps://preview.redd.it/nm8xf0xcly5d1.jpeg?width=1195&format=pjpg&auto=webp&s=029aad4bb23b9e82591ad54f44268fa3c8a752b8\n\nNow Denji knows but is probably confused",
            "https://preview.redd.it/u7li4836ly5d1.png?width=419&format=png&auto=webp&s=121ac42e8ee95b4a43bde9b9546f46fb81be18a9\n\nAsa seems overwhelmed after this, tbh hopeful for the future denji clearly likes her and she just said she likes him herself even crying over what he could be thinking of her, lets hope this doesn't get reset and they actually talk trough their shit in the upcoming chapters.",
            "This is super random,but Yoru saying \"gross\" and simply flicking away the cum on her hand reminded me of that South Park scene of Cartman saying \"ew,Ben Affleck spooge!\" and doing the same gesture (also,they're both being \"possessed\" by someone in that scene,kino parallels?!)",
            "Denji confused af right now.",
            "The Bi-weekly Devil has struck\n\nhttps://preview.redd.it/7g54gvosoy5d1.jpeg?width=999&format=pjpg&auto=webp&s=62cf674d28ab0457616d7e7a45aa9b14d8a11ea4",
            "Bro saw the driest lips a man can have and was like \"Mhm lemme get another smooch\"",
            "oh Fuji doing fight club reference with Yoru and Asa",
            "These last three chapter have been great, but also have made me feel even more sad for Asa and Denji as individuals. Asa being so worried that Denji will think she is a slut now and Denji being so mad that he only thinks about sex. They both just want to love and be loved so bad 😭",
            "Fujimoto has done a great job of making Denji look completely pathetic these last few chapters.\n\nPlease Fuji, let something nice happen to him. Just let him eat the Sushi in peace without torturing him, is that too much to ask?",
            "My heart breaks for Denji, he’s so confused right now. And I loved Asa bumrushing Yoru. “The fuck are doing kissing and grabbing on my man? And with MY body?”",
            "\"Only my other self\"\n\nShe is clearly lying there...",
            "Chapter writeup (essay incoming)\n\nNgl on first read I thought this was a lil underwhelming but we’re actually getting a lot of info about Yoru and Asa. It is cool to get some clarification on characters’a stances on the previous chapter, my reading is that Yoru has indeed been infected by Asa’s feelings and maybe the overall concept of love, she’s blushing the whole chapter, and is completely on the defensive. Immediately after washing her hand, she hardliners that she only kissed denji because it felt good, then stares at him and his mouth, has a thirst expression, then goes for another kiss. I think that sequence is interesting because it does illustrate a kind of desire we hadn’t seen from her before, perhaps an element of weakness contrasting how she was unequivocally on the warpath previously.\n\nDenji asking if she likes him and her responding that she doesn’t, it’s Asa that does and her feelings are flowing into Yoru which is why she’s acting on them is interesting in how the phrasing is probably the literally explanation, but also reads as a deflection, an “I don’t like you, I’ve just literally caught feelings.”\n\nI think it’s a really interesting approach to have Yoru’s character as a horseman contrast the others regarding love and desire. Makima weaponized and inflicted love, certain she couldn’t get it through any other means, and her method of desire sort of existed as her standom for pochita, Nayuta started on a similar path of manipulation before learning to love Dr ju and the pets, though she’s also a spoiled 12-year old punkass who gets what she wants, Fami is…somehow a functional embodiment of gluttony (her literal motivation for fighting the death devil is because humanity=yummy human food), and in that context, Yoru seems the most adolescent of the siblings, denying love but having been infected by it, and having no idea how to handle it or how it interacts with desire.\n\nHonestly I really like this chapter and the previous for how it seems Yoru is suddenly becoming a lot less static self-certain character and has a much more active internal life. That’s not to say that’s all though, Asa has some pretty interesting stuff too.\n\nWe see her for the first time in a while (I guess fuji did forget to draw the scars in that one point last chapter and Yoru didn’t dip after all), and she immediately chooses violence. Self-inflicted violence admittedly, but it is surprising to see Asa slam Yoru into a walk, immediately demand answers, and try to beat up Yoru.\n\nAgain, Yoru opens with another suspect line about only kissing denji to confirm suspicions of having kissed before and defending it on the basis that it felt good (for both of them) which Asa responds to by hitting her/herself with a pretty nice punch. Yoru’s never been physically abusive towards Asa, just zipping her out of her body at times, so it’s interesting to see Asa express so much directed agro and channel her frustration, where earlier in the series she probably would have just masked and yelled at Yoru instead of a direct confrontation like this. Good for her!\n\nComplicating that, I think it’s a really interesting detail that we see Asa’s anger comes from a place of self-image, worry of what people think of her, and prudishness (I find it hilarious that she’s this mad over kissing but seems to have no objection over giving denji a handy, but that’s beside the point abd maybe Fuji Forgor). I’m not sure if it’s 1:1, but translated, her main concern is that “He’ll think I’m a slut now.”\n\nThis really clicked me back in to the first chapter  of part 2 and how her defining “if I could do it all again” monologue paralleling Denji’s in ch1 is about wanting to be more selfish instead of how self-repressed she was in ch1 about wanting meaningful connections, to not be miserable and that like. She’s had a demon living rent-free in her head so we haven’t seen too much of a return to that “wanting to be selfish” angle, so I really like the text of this chapter for her being that Yoru is kind of fulfilling that thematic impulse/desire to love more fully, to act on her emotions and do what she wants to do outside her own inhibitions/squareness.\n\nI’m less sure what to make of Denji in this chapter, the most we get out of him is absolute bewilderment, which I think is warranted. From his perspective, the possibly bipolar/schizo weird girl he went on a date with has given him an amazing amount of mixed messages, from the movie date when she said she hated him then kissed him, wanting to fight him really adamantly and awkwardly trying to help him find Nayuta, to now, where CASTRATION PRANK GONE WRONG (GONE SEXUAL!?) and they have a really intense make out+handy sesh and afterwards she, really flustered, says she only kissed him because it felt good, kisses him again, then says she doesn’t like him, but the other her (interesting word choice) does, and those feeling flowed into her. Wtf is she talking about? Bro has absolutely no idea what’s going on.\n\nJokes aside, it is neat to see that Denji heard, however confusingly it was communicated, that someone does like him. Now that he’s gotten most of his basic needs (nut, affirmation), he can get the last one. Next chapter sushi chapter.\n\nAlso I like this cute lil panel of them both doing a dissociative mouth breather moment\n\nhttps://preview.redd.it/6y0hp36fyy5d1.jpeg?width=1125&format=pjpg&auto=webp&s=4cdefa0810215cbdaea4e89a3def0ff770dab41a",
            "DEATH BY SUSHI??? it is so over next chapter",
            "Whole chapter:  \nDenji: WTF..... WTF..... WTF... WTF...",
            "Gonna be honest, I am kinda loving this teenage drama being dropped into this batshit insane manga",
            "CSM fallout chapters hit different. That Denji panel is gonna be the go to for \"what are we even doing\" moments from now.",
            "at first i thought it said \"death by snu snu\" on the last page, lol.",
            "LMAO i just noticed the chapter name😭 \"Kiss, Love, Sperm\"😭 what happened to Live Laugh Love😭",
            "Feeling bad for both Asa and Denji. \nDenji, probably might get a bit if clue about Yoru/War Devil. I just hope that he doesn't start to hate Asa. That girl loved him truly. \n\n\nAsa and Denji need hugs rn. ",
            "Considering how horrific was Fami while eating spaghetti, I can only imagine what horrors will be unleashed when she goes for sushi raw meat.",
            "Great. The War Devil is a tsundere now and both Denji and Asa are paying the price.",
            "Yoru and Asa are steadily becoming one person, and Asa has enough power now to take over the body enough that she can pin Yoru against the wall to punch her. Yoru even considers Asa as a part of herself. Safe bet that they will become completely merged and separated only by death by the end.\n\nThere is an interesting play with the light and shadows again, with Denji sitting in the light and Yoru walking into the darkness and into the light. Maybe it represents Denji falling for Asa, and then Asa taking over the body again and reigniting her feelings for Denji. She doesn't deny the kiss felt good.\n\nThe sushi place is hinting at sex/reproduction by the signs out front advertising eggs(the roe) and sperm(milt). But the \"death\" in the name of the restaurant is too ominous.",
            "just my thoughts (which is no way meant to discredit anyone's feelings towards the last couple of chapters regarding SA) but i think the ch 168 interaction basically confirmed my suspicions about asa's feelings bleeding into yoru's actions. asa doesn't show any disgust toward denji, but toward yoru and herself—asa truly likes denji and is much more distraught over the way \"she\" comes across to him as someone who would not act on her romantic and sexual feelings so spontaneously. we learn from the very first chapter she's introduced that asa is insecure, socially inept, and cares a great deal about how she's perceived. she has moments of arrogance and selfishness, thinks she's better than others, but at the end of the day, like most teenagers, she craves companionship and validation. denji craves these things, too, and he's faced again with a girl who seems like she's just using him. thankfully he's at least given the hint that there's more than meets the eye here with the dual identity thing, but it's probably something that won't click right away given his past experiences and traumas. \n\ni might be reading too deep into this, but i think yoru in part embodies asa's shadow, as carl jung describes it, \"the thing a person has no wish to be.\" as asa's influence grows stronger in their shared existence, yoru, who is a devil with no regard for humans and their customs or what is socially and morally acceptable to them, facilitates the expression of asa's repressed emotional state.\n\nanyway i loved the ch and feel like the fallout is quite realistic! rooting for asa and denji's happiness ahhhh",
            "And now both Denji and Asa have had their first kisses ruined by someone else!\n\nAnd both involve unexpected expulsion of bodily fluids\n\n*Yes, indeed, there are cinematic parallels between the vomit and cum scenes, in this essay I will...*",
            "Going to a sushi restaurant that says „Death by sushi“ is a terrible idea. For sure nothing bad will happen there.",
            "this was a pretty damn great chapter.",
            "Are we going to adress that they are still starving?",
            "she was not as horrified and flabbergasted as i thought she would be",
            "Ugh another 2 week hiatus",
            "I'm sure nothing bad is going to happen in the sushi place with the weirdly ominous name.",
            "Concept of war = Tsundere. ty Fujimotor",
            "Not Asa literally beating herself up over what just happened 😭",
            "Our time to shine AsaDen warriors",
            "https://preview.redd.it/gshkjnh8s36d1.jpeg?width=1266&format=pjpg&auto=webp&s=38b97fc8fe6e39f6e2a85bb24c828828ada13d36",
            "https://preview.redd.it/fxpubj97pd7d1.jpeg?width=1092&format=pjpg&auto=webp&s=8fa5eed311ffaf7ccbd1ac29f2cbc00a09d95c50",
            "The kissing was too far and made Asa feel that Denji would think she’s a slut but sloppy rain handjob was alright. Just a brojob between friends, everyone needs a rub and tug from a homie once in a while fr",
            "It's bad but holly shit denji expression on the train, man it's stare is so empty \n\nPoor guy,peak fiction",
            "So Yoru wants to indulge in the feeling of love/lust, but puts all the responsibility for having those feelings on Asa. And coping super hard, denying any part of it could be from her.",
            "I absolutely loved Asa's reaction.. feels very on brand.\n\nThe background art in page 9 (and most of the chapter tbh) is so good.. it's actually making me believe in some of those 'the artstyle is just bad because Denji's life is messy/chaotic right now' theories. I'll reserve my judgement still with this\n\n\"Death by Sushi\" - **GUYS IS THE DEATH DEVIL GONNA SHOW UP??**",
            "#BUCKY IS ALIVE AND WELL IN PARADIS",
            "The time has cum",
            "https://preview.redd.it/yrvmq8ukjy5d1.jpeg?width=581&format=pjpg&auto=webp&s=fcd38e64edc9842df6beb0bf4a47659715e3ba76\n\nSo many new reaction imgs just dropped",
            "so >!Yoru said that Asa like Deiji, can we say the ship is fully sailed? !<",
            "That was pretty... normal ?",
            "Fujimoto: take this cliffhanger\n\nBreak next week btw",
            "Jesus Fucking Christ Denji can't catch a goddamn break.",
            "Seeing Asa Fight Club herself was golden",
            "The aftermath of Yoru and Asa arguing was fun, but I like the depth Fujimoto is starting to explore with Denji. Instead of asking for more action, Denji craved intimacy. ”Do you *like* me?”\n\nI wonder if Denji will be motivated to fight Yoru so that he can end up with the “other” Asa, after Yoru made that comment.",
            "https://preview.redd.it/spglzra2ky5d1.jpeg?width=1284&format=pjpg&auto=webp&s=4921272856d33dd8bed59435ad9e02e22f731a41\n\nEVIL SUSHI WOMAN TIME?!",
            "Actual breath of relief, lmao. I’m a little sad we don’t get to see Denji’s inner thoughts, but honestly that one panel of him in the alleyway is all that I need to know that Fujimoto knows what he’s doing. More importantly, I’m very, very glad that Asa is wrestling back control of her own body! She’s strong enough to fight back Yoru now. \n\nAnd we pick back up on the themes of hunger. They’re all hungry, starved, and unfulfilled. Fami’s involvement in the group is starting to rear its head, and… well, I’m thinking about Quanxi’s parallels to her being in a conveyor sushi place as well. \n\nLet’s see where this goes. I’m so excited.",
            "I finished this chapter faster than Denji did.",
            "https://preview.redd.it/2esji947ly5d1.png?width=1220&format=pjpg&auto=webp&s=4e46e08ec9871e5b6e053061ffe449f9cc50eda0\n\nThis panel here is amazing and sad at the same time",
            "We may actually see Denji get into a healthy relationship that doesn’t end up with the girl betraying him and then dying… right? RIGHT!?",
            "Yoru: *”I’ll clean the cum off my hand with this . . piss water!”*\n\nAsa: *”And I’ll smack your face with my . . . Cum and piss soaked hand!”*\n\n(Later on train)\n\nAsa: *”Wait, now my head is covered in piss and cum germs . . .”*",
            "Is this death devil foreshadowing or am I delusional?\n\nhttps://preview.redd.it/i4en4jrbmy5d1.jpeg?width=1170&format=pjpg&auto=webp&s=a4796ff45dc1e8bae54a54b847b0b7f4f584f6e0",
            "Oh, so we’re actually going for sushi?\n\nhttps://preview.redd.it/hyx8mq1fmy5d1.jpeg?width=406&format=pjpg&auto=webp&s=0fc713a0d94684ea0496638bb1b373bc38de59f2\n\nWe know who likes sushi.",
            "I like that Asa doesn't want Denji to see her in that way she wants to be seen as \"normal\" so badly, and it's sad because Yoru is still locking her in these situations. That said, now that we know Asa's feelings are pouring into Yoru, I wonder if the two will eventually fuse becoming one?",
            "AsaDen bros are we back?",
            "It's like watching fight club all over again.\n\nhttps://preview.redd.it/m25agt3lny5d1.jpeg?width=1920&format=pjpg&auto=webp&s=1cbf90c82e53dd0067fe5fb1a0b4f6d55f20bd3f",
            "so, now that they are both so hungry, Fami is gonna pull a surprise move and control them both...?\n\nplease fujirotor... don't",
            "Fami just sittin there on the bus next to him… MENACINGLY",
            "Only Fujimoto will go from the most hilarious looking page of Yoru punching herself\n\nTo a pretty somber page where Asa is crying her eyes out because of what happened",
            "So...if we're still going by the theory that every other arc is paralleling the one from part 1...last time the gang went out to eat at a restaurant after escaping a building and Denji having a sexual encounter start out with a kiss, shit ended up hitting the fan big time.\n\nBy which I mean it's time for Nobana to lock in and do some crazy cool shit",
            "I just realised that when yoru said only the other me likes you, denji has no clue what she’s talking about.",
            "Kobeni copium?",
            "Death by Sushi sounds and looks like a place you would see in one of Tarantinos movies.",
            "That Asa vs Yoru scene gave me \"Paranoia Agent\" flashbacks.\n\nAlso, gonna make a prediction that won't come true: while they are eating sushi, they will get attacked by either the Mercury Devil, Microplastics Devil, or Pollution Devil. Specifically one of those three. \n\nI'm gonna need to re-read Part 2 in a single binge session when it's over to see how it all holds up once it all comes together.",
            "The cum knife is a lie.",
            "Calling your restaurant “death by Sushi” is crazy considering the universe they’re in.",
            "Post nut clarity devil got hands",
            "https://preview.redd.it/piio4vpzuy5d1.png?width=681&format=png&auto=webp&s=823b7f5360545e9d03b38252a5a47376f4cc965a\n\nmacos finder looking asses",
            "well yoru has officially screwed there relationship thanks to her lack of emotional intelligence. Unless asa can will herself to explain everything then we’re about to enter the dark timeline",
            "Yoru is Tyler Durden 100% confirmed",
            "Yoru willingly gave up information to Denji about there being \"another half\" to her. Have Yoru's feelings changed? Would she take over Asa's body still if Asa tried to explain to Denji what's going on? ",
            "https://preview.redd.it/4000n148xy5d1.jpeg?width=1170&format=pjpg&auto=webp&s=0160121f400297e8555aae61806ec2b96361dd4a\n\nFujimoto is cooking.",
            "Man, Denji's face in that last page.  Just what kind of post-nut clarity is he having???",
            "\"How big will you make the death flag?\"\n\n\"Hehe Death by sushi\"",
            "Yoru makes love, not war",
            "Denji be like: 😦",
            "That Asa vs Yoru scene was very Fight Club.        \nAsa to Denji: \"You met me at a very strange time in my life.\"",
            "I feel so bad for denji he must be so confused. We gotta remember he is a clever boy, but he is a lil bit uneducated and lacks some emotional maturity skills because of his upbringing and past trauma😔.\n\nI think at some point in the series, Asa will try to confess or something to denji and he may actually turn her down, and she will realize that he is a little bit broken, maybe then she push harder and eventually they both will grow and accept each other flaws. And hopefully end with a cute and comic relationship.\n\nAnd then reze shows up lol",
            "“I believe we kissed before” was it not Yoru who initiated the first kiss at the house? Does she just not remember? Also I think this chapter might be a point towards the theory that people can’t tell the difference between Asa and Yoru.",
            "Yoru biting the curb 4K UHD 90 FPS. Glad Asa is fighting back too",
            "Denji hitting us with the 1000 yard stare",
            "The Queen of Mixed Signals.",
            "They'll meet Kishibe at the sushi place, i can feel it",
            "Chainsaw Man is always giving me whiplash. One minute,emotional damage. Next, hijinks. One minute, Denji is hit with this confusing conundrum, a girl doesn't like him but she kissed him because it felt good. Next, Asa is fighting Yoru which is simply hilarious. Although, as silly as that fight was, it was also meant to be emotional. Asa is going through somethings and so is Yoru. Remember the days when Yoru used to threaten Asa with death, now Asa is punching Yoru in the head.",
            "Count your days Fujimoto, when I find you… 🗿\n\nhttps://preview.redd.it/t5cx1ppqqz5d1.jpeg?width=719&format=pjpg&auto=webp&s=77ee44044a0090b2308d897c2cf4736f42181e1f",
            "Denji is baffled at what the fuck she's talking about lmao",
            "CSM is officially peak again",
            "\"I'm jack's handjob\"",
            "\"Kiss, Love, Sperm\" absolute banger name",
            "Character development? \n\nI'm too hungry for this...",
            "Wow great chapter. Not at all the outcome I expected. Great follow up.",
            "Is it Kobeni time?",
            "Schrodinger's handjob.\n\nWas Yoru giving a handy or did Denji cum at the mere touch of a woman?\n\nGreat chapter. People need to let Fujimoto cook.",
            "Well ain't we all a bunch of silly goobers rn.",
            "He’s got that post nut clarity now",
            ">Death By Sushi\n\nI'm sure nothing bad will happen at such a nicely named restaurant. \n\nAlso\n\n>Free Raw Fish Testes\n\nNut Devil Foreshadowing???",
            "https://preview.redd.it/zfqn5499py5d1.jpeg?width=155&format=pjpg&auto=webp&s=3dc7ff6f8a891bccf08e354bb4f670e7e71ff779",
            "https://preview.redd.it/satkfe7goy5d1.jpeg?width=1456&format=pjpg&auto=webp&s=8dbf8936a2a8e018eb11b3cf85519232be68835a\n\nAsa being able to wrestle control from Yoru and punch herself is huge when you realize that she can muscle out of Yoru’s control of her body. It made me realize that Asa probably has control of the right hemisphere of their brain since she used her left hand.\n\nHonestly it makes a lot of sense why these dorks are the way they are when you see what the right and left brain hemisphere controls. God save us all when they work together and become the “Asa” from the promotional art.",
            "Dath by sushi? Is that foreshadowing?",
            "Kobeni works at the sushi place I'm calling it now",
            "i can't wait 2 weeks bro",
            "This chapter is fucking gold",
            "FINALLY we get to the sushi. Took you long enough fungimami",
            "Denji has that post nut Shinji Ikari depression.",
            "2 WEEKS TO CONTINUE PEAK?!?!\n\nhttps://preview.redd.it/y00he7mzly5d1.jpeg?width=1200&format=pjpg&auto=webp&s=bab3e9a18d744f6626763c43d3db3d08c76f81b2",
            "Asa, sitting as far from Denji as possible on the train. Fami, just vibing until she can eat again. \n\n\nGod bless Fujimoto",
            "Yoru's tsundere arc continues at full speed\n\n\"I didn't kiss you because I *like you* or anything! Only because it felt good, baka!\"\n\nAlso, with Yoru openly referring to \"my other half\", it would be hilarious if Denji now thinks she has multiple personality disorder. But then again, it's possible he was too deep in post-nut clarity to even process that line.",
            "I CAN'T wait for the awkward lunch next chapter!",
            "Asa immediately being violent to Yoru makes me think the emotion mixing goes both ways",
            "After all that at least Denji will finally be able to get sushi.\n\nAnd with the Bi-Weekly Devil back hopefully we’ll get longer chapters again.",
            "Yoru and asa are both tsunderes and man these past few chapters are mad funny.",
            "Asa's reaction to the situation was a little unexpected. I really thought she would start berating Denji right here like she always did, but I guess she's changed a lot from her old self. And now instead she's having negative thoughts about what Denji might think of her now.\n\nSpeaking of Denji, poor guy's left confused. Yoru has made it clear she doesn't like him but claims that Asa does. But since Denji still isn't aware of Asa's situation of having her body possessed, he can't tell what Yoru's talking about.",
            "\"I'm too hungry for this.\"\n\nI felt that.",
            "I took a break from reading chainsawman for a year because of exams and this is what I come back to lmao. Honestly tho I gotta reread the past 30 chapters because I speedread them and I am sure I have missed half the plot points, I could use a little help freshing it up if anyone has the time. But yeah honestly I can't imagine how funny and sometimes disappointing can reading weekly/biweekly chainsawman be, you wait and then get a 15 page evangelion/ kanojo okarishimasu treatment lmao. Worth every penny tho",
            "Jesus why are Chainsaw Man's characters the most human of any manga. It's gotta be because they're just people the universe is happening to right? They don't want to solve the world's problems or become god they're just getting wrapped up in that nonsense. \n\n-Autistic girl is mad at inner demon for forcing the advance of relationship with earnest but dumb guy she likes.\n\n-Inner demon does not understand the problem.\n\n-Dumb earnest guy does not know how to process girl he likes saying she has multiple personalities and only one of them likes him, and its not the one that just kissed him.\n\nHow god damned good is Fuji that we can all relate to Asa so well?",
            "The visual metaphor of Yoru washing denjis cum down and Denji just staring at it is so fucking crazy. All that happened, all the shit he went through, and she just washed that off and pretended like it never happened while hes just left there. Only Fujimoto can make me want to write an essay about a guy staring at his own cum flowing down the gutter\n\nhttps://preview.redd.it/8zao35kpky5d1.jpeg?width=1079&format=pjpg&auto=webp&s=454716d1cfd83881b6e1d2604bfca35cc81c5973",
            "I think it’s such an Asa moment when she is more concerned that she/yoru kissed him, than giving him a handjob. I do feel bad for both and can’t wait to see how there going to react when it’s Asa and Denji without Yoru but I have a feeling that’s going to be a while whether by action or them just being awkward.",
            "I can deal with the 2 week devil if we get a 2 page spread in high detail of Fami mukking sushi.",
            "this chapter lasted 30 sec just like denji",
            "So what are we calling this arc? The Sushi arc?",
            "My sweet Fujimoto, they could never make me hate you…..",
            "Famine effecting Ashley....\n\n\n\nDennis got that post nut clarity",
            "Love and war",
            "Yoru going full tsundere this chapter. \"I didn't kiss you cause I like you or anything, just needed to confirm something. Also because it felt good. Idiot.\"\n\nAlso, Asa, you being a slut is the least of your problems when it comes to Denji's perception of you. From what he's seen, you look like the most bipolar, schizophrenic girl in existence. That's still probably not a dealbreaker for him, though.",
            "Danm everyone really made a big deal of the last chapter",
            "https://preview.redd.it/mskqgawewy5d1.jpeg?width=1012&format=pjpg&auto=webp&s=8e3b170dcac516fa65bbc1dc357ca45f134f13d8\n\nSlut -----------------\\^",
            "why did Asa or Denji not question the handjob but only the kiss 💀\n\nalso I'm really confused about Fami, I thought her objective was to get them hungry, why is she taking them  to eat sushi. Is it because they're cooperative anyways so it doesn't matter?\n\nlove this face though\n\nhttps://preview.redd.it/a5jq1z3o3z5d1.jpeg?width=196&format=pjpg&auto=webp&s=1b06a6411336c93f321e6aee8904065c4f14023e",
            "I like how Asa is like why did you kiss him!!! She did more than kiss him she jerked him off 😭",
            "I didn't really care too much about Yoru before but holy crap, these recent chapters are making her very interesting to me",
            "What if beam returns in the sushi joint?",
            "I was so high while reading this.. I thought Asa said \" he'll think I'm a slug now\" LOL",
            "I am loving asa and denji’s chemistry ",
            "Don't know which I am more impressed by. Yoru/Asa not starting off a ball kicking contest then and there or the fact that Denji can even nut let alone walk after Katana Man nutshot him like...25 minutes earlier. Pochita healing is STRONG.\n\nAlso wonder if Fujimoto ever saw Liar Liar at all.\n\n>!\"What are you doing!?\"!<  \n>!\"I'm kiCKIN MY ASSSSS! DO YOU MIND!?\"!<",
            "Jesus Christ… he’s just a kid. He’s just a kid. He’s just a kid so he asks his crush if she likes him. It’s the only way he can process it because he’s just a kid. Fuck, oh my god, he’s just a kid.",
            "Hell nah not the bisexual devil",
            "I’m convinced the people on Twitter who thought Fujimoto would make light of the last chapters final scene are stupid as fuck or never read the manga. “How he handles this is make or break.” 🤓",
            "Asa fr pulling a MR. ROBOT",
            "I wonder if there’s any significance in the fact that Asa is clearly controlling her body but Yoru’s scars are still visible.",
            "https://preview.redd.it/jayj7k1lky5d1.jpeg?width=1284&format=pjpg&auto=webp&s=88a61a17c7121448c632c1f922265b4dae01e9ae\n\nI really want to see how Fujimoto would direct a movie because these shots are PEAK",
            "https://preview.redd.it/2qx9hao7my5d1.jpeg?width=2160&format=pjpg&auto=webp&s=f1d544a97b950f77e8f8660805e468de79d6dff2\n\nYoru missed an opportunity while Denji was on the floor...",
            "Denji close your mouth challenge (impossible)\n\n  \nPoor guy is so confused, he said 1.5 sentences this chapter. At least he's gotten some breadcrumbs to figuring out that someone (Asa) likes him. Yoru being hilarious going back again for a kiss. Yoru acting on Asa's impulses confirmed too. Seems to be like a direct line to her freudian id. Asa was more upset about how Denji/CSM would see her after this than about her body being nonconsensually hijacked for a sex act. At least this means less trauma for my fav character",
            "Man I was so fucking relieved when I've read this chapter, after I saw the title drop beforehand",
            "This is a Wild RonCom",
            "This chapter must have called \"Tyler Durden arises\"\n\nSomebody pls hug Denji, he needs that more than the handjob",
            "Love the visual gag at the end with the salmon roe and fish testes signs",
            "Awesome chapter but holy shit I miss Kishibe",
            "LET'S FUCKING GOOOOOOO!!!!!!!",
            "Finally some Asa-on-Yoru violence",
            "Pretty tame chapter, it could've have gone a lot worse. Just casually washes off the cum.",
            "https://preview.redd.it/h74qe6l6ly5d1.jpeg?width=828&format=pjpg&auto=webp&s=540b30c7972ec0fded3dcde09c1e7367a7c95f2e",
            "https://preview.redd.it/q14w9fualy5d1.png?width=630&format=pjpg&auto=webp&s=b95838b0010ae078adf279adac0bf7dffbc4ac02",
            "She got rizz up twice 💀 denji really got that rizz inside him. Well \"was\", now the jizz is on yoru's hand.",
            "https://preview.redd.it/6p0vgbbumy5d1.jpeg?width=1350&format=pjpg&auto=webp&s=059ee13fdbcc13a77f2558bcc0b73b4c87126c34",
            "I knew it, Asa and Yoru are so in sink their desires are flowing into one another. It happened because Asa wanted to do it lol",
            "Damn i feel for bro. Denji learning why they called landmine girls",
            "did asa just take over yoru when she hit her?",
            "Denji and Asa are COOKED\n\nFUJI YOU COOKING WITH GAS\n\nSHOUT OUT FISH TESTES AND SALMON ROE",
            "denji 😔 asa 😓",
            "I was right with people overacting at the last chapter, clearly they don't know that girls can get freaky and Asa's freaky thoughts literally took over Yoru at that moment and her dumbass really think that it's ok to give in to wild ideas.",
            "Jesus, Denji is dressed like his child self. Dude's still being manipulated and exploited. And he's sitting there in shock the whole chapter after having someone force herself on him AGAIN, and then saying she doesn't like him when he had feelings for her.\n\nShit man, I just want him to find happiness...",
            "https://preview.redd.it/ypxkut28jy5d1.jpeg?width=719&format=pjpg&auto=webp&s=33a3598836860f87e990571afc2dab7f34b1e45b\n\nReze better be at the damn sushi place",
            "Cum is pretty viscous, just a little swishing in a puddle wouldn’t get rid of it. Denji’s load looked particularly thick and stringy, Her hand was probably tacky as fuck still. Asa was using that cum hand very recklessly, she rubbed her hair with it, then turned the cum hand into a cum fist and punched herself with it, then switched it back to a cum hand and rested her face on it.",
            "The only thing that really pisses me off is that asa/yoru haven’t explained to Denji yet that they’re two people >:/ you’d think a lot of the intense confusion and whiplash he gets from them would be at least less fucked up if he knew that fact. Like bitch AT LEAST tell him that???",
            "Damn this is bare awkward... I love it!",
            "So the death devil opened up a susi business and is just vibing",
            "Money on Fumiko being at the sushi place.",
            "When they decided to go to the bath house a few weeks back I said that it would be nice if they were able to split from the main group and have some kind of bonding moment lol.",
            "Another 2 week wait why does Fijiwater do this to us ![img](emote|t5_rmtrq|22174)",
            "\\> the shikanoko nokonoko meme but with Yoru dancing as Asa and Denji watch in deep confusion",
            "Poor denji was left confused by Asa/Yoru shenanigans 😭",
            "The title drop was way too wild",
            "By CSM standards it could've gone worse \n\n\nThe fact that a girl is hurting herself having a physical fight with her inner demon while having a mental breakdown while the guy gets the most depressing post nut clarity is NOT the worst option is beyond me",
            "Girl could’ve stepped in this whole time huh",
            "You say that like this hasn’t been the premise of this entire character.",
            "me when The Voices start winning",
            "Damn, someone’s gotta give my girl Yoru a hand, now she doesn’t have any.",
            "Based on last week's comment:\n\n*Goes on another date with Denji*\n\n\"Again, I do not like you\"\n\n*Marries Denji*\n\n\"Yes... but I do not like you\"\n\n*Has 3 children with Denji*\n\n\"Just a reminder, I do not like you\"",
            "I really wasn’t expecting a fuji take on a potentially tsun character, but I really like the contrast of how flustered/uneasy z Yoru looks this chapter.",
            "The death devil is just a random piece of sushi. Fujigoato you've done it again",
            "You really think Fujimoto would stage a fight in a place called \"death by sushi\"?\n\nYeah... yeah he would...",
            "I always love when Fuji does panels like this. They always convey so much emotion despite the lack of dialogue.",
            "Fr man, I don’t quite understand why people dislike this development. This has been peak fujimoto.",
            "We can finally change seating Denji in this meme.\n\nhttps://preview.redd.it/y32oymy9ky5d1.jpeg?width=1228&format=pjpg&auto=webp&s=8df07c7d31b0257cb7d5fb9034f83e7edfafcabb",
            "He's getting that post nut clarity hit",
            "This panel really took me off guard. Dennis is starved for love and only finding sex \n\nBleak",
            "Yeah, it looks like it didn't completely sever their relationship, it's just messed up for now",
            "Its weird but I dont think Yoru was being honest here, later she said that she kissed him to \"confirm her suspicion\" which sounds kinda bs tbh.",
            "“Her feelings flowed into me.”\n\nI wonder if Yoru is also talking about herself here, re: Asa’s fascination with Chainsaw Man. I like the theory that she fell in love with Pochita’s original form prior to the series, but she’s in denial.",
            "Nah yoru js coping she's endgame girl",
            "I love collecting photos of peak characters copying cats, thank you for your contribution 🙏\n\nhttps://preview.redd.it/fr7bx8jiyy5d1.png?width=217&format=png&auto=webp&s=c66ec1fc9ed13ba6c18819ee6bd3dfd6436f8690",
            "That's a visual queue that they are truly at odds with each other. Like in the beginning.",
            "too long",
            "https://preview.redd.it/3jtbqzw6ly5d1.png?width=1080&format=pjpg&auto=webp&s=23bcb122e6abee17f814a7edd3c6ade40bb2d0c7\n\nLive Denji reaction",
            "[deleted]",
            "*death* by sushi? Hmmmm",
            "Death by Sushi, Death devil appearance confirmed",
            "Is no one going to comment about this place advertising fish testes?",
            "Are we calling it the sushi arc or the cum arc?",
            "[deleted]",
            "If only she knew Denji **loves** The Sluts (TM, C, R).",
            "Certified Bruhjimoto Moment",
            "I laughed when I saw the title. Bro was too straight to the point.\n\nhttps://preview.redd.it/ild191wjky5d1.jpeg?width=442&format=pjpg&auto=webp&s=2ca4e280ea7a99e5b994c0092f25be67a4d320fd",
            "The fact that the last one had such a tame one compared to this one had me worried for a moment when I saw it.",
            "[deleted]",
            "She isn’t tilted I’m so nervous she’s gonna pull something",
            "Hit by the bi-weekly devil again sadge",
            "me 3",
            "Roller coaster ride for him.\n\n* Adoptive sister is missing\n\n* Home burned down\n\n* Family(pets) got burned too\n\n* Chopped up\n\n* Rescued and offered to be taken to a sushi restaurant then brothel\n\n* Ranted about his dick then got offered to cut it off\n\n* Got kissed and jacked off in an alley by \"Asa\"\n\n* Otw to sushi joint again",
            "Suffering builds Suffering -> Suffering builds Suffering",
            "What? This is the realest and most normal high school relationship he’s ever had.  I’ve had situations like this with real girls growing up.  Compared to her trying to kill him like Rene or makima this is chill.  Even Nayuta threatens bodily harm to him more",
            "OOO",
            "Okey but what would Fami prioritize, controlling them, or eating the sushi herself?",
            "5shadowing",
            "They are all hungry, but wouldn't say starving. If this is enough for her ability to activate, she really is as OP as other sisters",
            "tyler durden ahh",
            "Yeah sometimes people want the worst to happen lmap. I think fuji is going for the akward moment in the next chapter",
            "Lol seeing has how Asa can control the arm pretty good maybe she's the one would gave Denji a tugger",
            "Do ppl act think it's a handy? Isn't it js denji nutting after kissing a girl?",
            "“W-wwhy’d you grab his balls? Why’d you tickle his Dennistickles sexual style? Why’d you have to invite his cummy tubbies to emty themselves in our last remaining hand?” ~Fuji if he wasn’t a fraud",
            "Stable? Hahaha you’re reading the wrong manga by the wrong author",
            "Man, the second panel of asa/yoru is just cute af 😭",
            "The close up on Denji's mouth was spot on.",
            "Nobody knows what's going on anymore 😭",
            "The Asaden Brainrot",
            "Bro I’m stressing about this panel, is that gap opening? Or is it closing meaning this is gonna be another bad time for our boy?",
            "This Denji would be really happy if Asa said \"Yeah I like you\" but at the moment Yoru's in control, and Asa is too angry at Yoru and doesn't want to be seen as a slut who jerks you off on the 2nd/3rd date.",
            "KEEP COOKING",
            "That seems like a possibility...",
            "\"I don't like you! I don't!\" -Yoru as she kisses Denji, literally.",
            "Fami: By the power that was given to me, Denji and Asa Mikata, give me your food.\n\nDenji: Yes, master.\n\nAsa: Yes.\n\nYoru: YOU DID THIS SHIT BACK IN HELL TOO, BITCH!",
            "Nice catch, I was too distracted by asa slut shaming yoru",
            "Her expressions are strikingly similar to Asa's here. Plus, it's the first time we see Asa utilizing her body against Yoru while the latter is still in control, which could be indicating a gradual merging between them.",
            "That's a really good point",
            "All thru part 2, as unrealistic and corny as it sounds, a little part of me was imagining the war devil, as being part of Asa, would fall for Denji as well\n\nI doubt Fujimoto would cater to the sappy romantic in me but it's fun to imagine. Pens out fanfiction writers",
            "I get the feeling she never switched. It was just showing Asa reaction.",
            "Yes she's saving face. Denji is her arch enemy, but she still kisses him again even after regaining some composure.",
            "They all do🥲",
            "These are the questions that she needs to be asking herself 😂",
            "Death and Falling are having a dinner date.",
            "She's an awkward teenager and she's horny. She wants to fuck but she cares about how people see her because her interactions with boys comes from magazines.",
            "The classic \"Why are you hitting yourself\"",
            "https://preview.redd.it/c7xtb1j8ny5d1.jpeg?width=497&format=pjpg&auto=webp&s=11fe6b0cc27c5fcabb36eedeb5524d00b557d01b",
            "That's why the place is called DEATH by sushi",
            "Inumaki tryna communicate something ",
            "Unironically what made the part 1 characters so compelling.",
            "It'd be hilarious if Denji says something like \"I accept your schizophrenia and am wiling to make this relationship work\" and Asa gets offended that Denji thinks she has schizophrenia",
            "Remembering when they couldn’t escape the aquarium because of Fami",
            "Best page of the chapter for me",
            "I could hear Asa's running steps in this page. I love it so much",
            "Bro, she only has one arm so it's not by choice XD",
            "It's ok, she washed it off in that puddle on the ground",
            "Asa Mitaka casually slut shaming a horseman of the apocalypse",
            "NGL, I'm worried about Yoru/Asa being hungry, and the next scene has Denji chilling by Fami.",
            "People def overreacted",
            "Mfs thought this was gonna be trauma dumping SA bro",
            "They feel short because Fujimoto spends a lot of time doing the “same panel but slightly different facial expression” thing in order to show a character’s emotions. Takes a lot of the chapter up",
            "Yeah I’ve seen people say it’s over for them but I thought the opposite for once. \n\nPart 2 is about them, for better or worse",
            "Apparently she likes him and cares more about how he'll think she's easy now.\nAsa's priorities have never been completely right tbh",
            "It’s Denji, I’m afraid he won’t connect the dots until it’s a lot more obvious. I’m also not sure Yoru was being entirely honest with Denji ir herself…selves",
            "\"Nah, I don't like you\" * SMOOCH * \"understand?\"",
            "Denji is doomed to deal with mixed signals",
            "The sunshine also starts shining on him too, that's a nice detail.",
            "SUSHI DEVIL CONFIRMED?",
            "When * that * Quanxi chapter released in part I, there were rumors that Fuji had some dirt on one of the jump higher ups. People thought that was the only way he could seriously be getting away with it",
            "Had to double take. Looked like makima at first glance",
            "she sits so politely that monster",
            "Imagine a girl threatens to kill you and cut your balls off, then kisses you and gives you a handjob, then yells at you to not be cocky, then kisses you again, then says she doesn’t like the other her likes you, then walks away and does not elaborate. Poor Denji is brain dead at the moment LOL",
            "I hates war!\n\n*Steam libary are full of war related games*",
            "I guess Asa is trying to pretend that part didn’t happen.",
            "Bad in a sense.\n\nBut Yoru telling Asa and Denji 'she is into you' is such a big thing for asaden fandom.",
            "Falling devil is just gonna be chilling behind the counter lol",
            "never left",
            ">. And hopefully end with a cute and comic relationship\n\nFunny, that's exactly how I thought when I saw aki, power and denji living together.",
            "She did initiate, however Nayuta erased her and Asa's memory of the date after she walked in on them",
            "Every damn week. The cope is real with Kishibe....Unless ....\nhe came through and he is the one that saved Nayuta, It only makes sense\nIt's not copium if it's true",
            "Post nut depression.",
            "I'll go on a limb and say it wasn't really a handjob, more just having it grabbed while being kissed. Denji is both young and inexperienced with that stuff so being a quickshot doesn't seem unbelievable",
            "You just wanna get jacked off don't you",
            "COOK IN FUJOMOTOS PLACE",
            "What a fucking liar she was about to go for another kiss right before that",
            "And that's why we keep reading.",
            "The copium never runs out does it",
            "You sure do know a lot about cum.",
            "Violation allegations in shambles",
            "*has passionate sex where she says she loves Denji several times*\n\n\n\"I totally don't like you, remember that\"",
            "Mark my words. Someday Fuji will do a one-shot with no words and it will be the best thing Shonen Jump ever publishes (\"Goodbye, Eri\" being in second place, obviously)",
            "Yes yes, but I think he's talking about the paneling.",
            "Oh, wait. I got more depressed people here. Somebody pls edit Denji here.\n\nhttps://preview.redd.it/7fq2v8olly5d1.jpeg?width=828&format=pjpg&auto=webp&s=023e022a5c487e953482621460a227e4babe8558",
            "He's just contemplating how all the women in his are fucking nuts every single time.\nAnd he's probably so confused.\n\"I don't like you, the other me likes you\"",
            "We still have hopeeee\n\nhttps://preview.redd.it/et1hlnvbmy5d1.jpeg?width=1080&format=pjpg&auto=webp&s=fe32548562ebd1d2df8e5b9495817f277108f198",
            "Oh yeah I agree. She got so defensive with the whole “I only kissed you because it felt good!” Stuff. Like, girl, why do you think it felt good???",
            "Oh Yoru is in complete denial I think. I got the impression she refuses to admit to herself that she likes him. ",
            "https://preview.redd.it/3cfxehdj306d1.jpeg?width=250&format=pjpg&auto=webp&s=38ada996963447ede86d7a9b1a535f4a07e265fe",
            "She’s about to ruin AsaDen’s lunch date, right as they’re getting to the good stuff discussing their feelings, isn’t she? 😑",
            "Sushi cum arc",
            "well grippy socks and all that.",
            "He also just learned that there are two people inside Asa and that she actually likes him. That one seems like the hardest to process.",
            "Amazing point. Truly the power balancing only fuji could do (he takes weeks off to go on food tourism trips).",
            "Dude there are signs out front of the sushi place that blatantly states “fresh fish testes and salmon roe (fish eggs)”. Next chapter will have A LOT of sexual tension and awkwardness between Asa and Denji",
            "I don't think it's static who controls which body parts lol, but a funny thought",
            "she had her hand on his balls the whole time, not a handy but more than a kiss",
            "She was most definitely grabbing his dick, but I don't think Yoru applied the jerking motion. At least not the way we think. Their kissing and Denji's nervous shifting with her grip on him for a brief time all probably did enough.",
            "A MAN'S COPE CAN NEVER DIE!!",
            "Girl likes him likes him 🤧",
            "He needs proper hydration",
            "I think it’s a funny panel that they’re both doing the mouth breather  disassociate move.",
            "I wouldn't be surprised if Fujimoto made AsaDen official, but their relationship will definitely have his trademark twistedness.",
            "I think they're were \"flickering\" between each other as emotions got way more intense",
            "Yeah but this one especially 😭\n\nI wanted Asa to chew out Yoru even more",
            "Me when I find the person responsible for all of my problems",
            "Bro got used, abused, and thrown away again. When will the pain end? Like he said in part 1, everyone only cares about “Chainsaw Man”. What about Denji? 😢",
            "He just wants someone to like him, poor bastard. ",
            "I think genuinely Yoru does not know why lmao",
            "\"I only kissed you because it felt good.\" is an all-time quote",
            "IT WAS ME BERRY",
            "I kinda get the feeling the flickering isn’t really there anymore and they’re both becoming one, what with Asa being able to punch herself while Yoru is still “in control”."
        ]
    },
    "It's arrived ✨️": {
        "title": "It's arrived ✨️",
        "score": 471,
        "url": "https://i.redd.it/hodec0go708d1.jpeg",
        "content": "Finally, I'm so happy!",
        "num_comments": 13,
        "comments": [
            "its gorgeous",
            "bon appetit",
            "It's so peak",
            "Same bro i got mine yesterday",
            "Gotta be one of the coolest cover arts in the series\n\nFalling devil my beloved",
            "For you people who aren’t Australian you can use this to find who’s Australia or not because the volume 15 is now being released in Australia where it was preorder before this",
            "Hooray on getting it!",
            "It definitely is! I love this cover.",
            "Merci 🍴",
            "Gonna read it later 🙋🏼‍♂️",
            "Ayyyyyy congrats! You read it yet??",
            "Definitely!! It's such a cool cover.",
            "Yea"
        ]
    },
    "The Drop": {
        "title": "The Drop",
        "score": 140,
        "url": "https://i.redd.it/9gq2lsgf8z7d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Same energy\n\nhttps://preview.redd.it/jivwi1wjv18d1.jpeg?width=570&format=pjpg&auto=webp&s=ee87650e1e6184b4b8a06eafd5f93d54294b8cac",
            "The city overview and portrayal of the silhouettes looks pretty cool especially with the black and red scheme!",
            "Damn 😳 That composition is peak, well done! I love black/colour pieces like this!",
            "Damn, I believed it's true. Awesome art!",
            "Yup I was inspired by this",
            "wait...... isn't the this the backbround of the dark night returns??",
            "Technically yes...and no, it's a homage to it",
            "Yes it is. The boys comics back then was a satire of the entire comic book and superhero franchise in general, so its not surprising that they would do something like this"
        ]
    },
    "powahh by me :D": {
        "title": "powahh by me :D",
        "score": 652,
        "url": "https://i.redd.it/nm0lzyd8fw7d1.png",
        "content": "",
        "num_comments": 15,
        "comments": [
            "https://preview.redd.it/wbraaxr5438d1.png?width=500&format=pjpg&auto=webp&s=3427237dd16052b49d8ee52fdd2f3923cd6247ab",
            "This was honestly one of the most wholesome moments before Makima became hated by most of the fandom even more than she was",
            "The style and coloring tones are so good!",
            "***Bang.***",
            "![img](emote|t5_rmtrq|22171)",
            "That face\n\nIs like she knows what is about to happen, makes it more sad",
            "I miss her 😭",
            "Aww she brought me a birthday cake 🥰",
            "Peak 🙏",
            "![img](emote|t5_rmtrq|22171)",
            "Very nice.",
            "Moments before disaster… I miss her.",
            "14 candles on that cake...",
            "[deleted]",
            "Uhh, the only one sexualizing minors here is you\n\nFor reference here is the original art\n\nhttps://preview.redd.it/9ur54fynz18d1.jpeg?width=437&format=pjpg&auto=webp&s=0a7b17f9b007eb7c4bc2cdacae79ccd538303985\n\nIt’s almost identical to the original just in the artists own style\n\nClearly the artist was just trying to recreate this panel in his own artistic way, but there is nothing sexual about it unless you think people make fanart of their favorite characters because the artist is inherently lewd in nature? Like grow up dude it’s not that deep.\n\nI don’t even know what point you’re trying to come across here because as of time posting this comment everyone else is just appreciating the fanart, literally no one else is sexualizing her except you.\n\nGet a grip dude.",
            "A minor? What? I don't know if you've read the manga, but she's not even human. She is the embodiment of humanity's fear of blood, so I'm not sure how you plan on defining age for that.\n\nAnd she's not even sexualized here, unless you think women having tits is inherently sexual, then you might just be delusional"
        ]
    },
    "Power eating burger pochita": {
        "title": "Power eating burger pochita",
        "score": 100,
        "url": "https://i.redd.it/uxkp9oqvgz7d1.jpeg",
        "content": "",
        "num_comments": 2,
        "comments": [
            "The penciling especially on the face looks pretty good and nice burger design!",
            "Thank you"
        ]
    }
}