{
    "Research S.O.S.—Ask your research and technical questions": {
        "title": "Research S.O.S.—Ask your research and technical questions",
        "score": 2,
        "url": "https://www.reddit.com/r/chemistry/comments/1djgd01/research_sosask_your_research_and_technical/",
        "content": " Ask the [r/chemistry](https://www.reddit.com/r/chemistry/)  intelligentsia your research/technical questions. This is a great way  to reach out to a broad chemistry network about anything you are curious  about or need insight with.",
        "num_comments": 1,
        "comments": [
            "Any chemist here that can help me with a question?"
        ]
    },
    "Weekly Careers/Education Questions Thread": {
        "title": "Weekly Careers/Education Questions Thread",
        "score": 1,
        "url": "https://www.reddit.com/r/chemistry/comments/1dhvbw9/weekly_careerseducation_questions_thread/",
        "content": " This is a dedicated weekly thread for you to seek and provide advice concerning education and careers in chemistry.\n\nIf  you need to make an important decision regarding your future or want to  know what your options, then this is the place to leave a comment.\n\nIf you see similar topics in [r/chemistry](https://www.reddit.com/r/chemistry/), please politely inform them of this weekly feature.",
        "num_comments": 16,
        "comments": [
            "Question for former non-PhD core facility staff. Do you feel that working in an academic core facility made it harder to get an industry job?",
            "Hello! I’m looking for some advice from anyone who’s been through the all-too-common experience of a graduating uni with a bad GPA and still wanting to go to grad school. \n\nI graduated in 2019 from UMich with a B.S. in BCN, ~2 years of research experience with one publication as second-author, 3 years of work experience at a startup in drug discovery. I feel confident in getting 3 good LOR from my professor I researched under and my mentors in industry, however, I’m fighting an uphill battle with a 2.45 GPA. \n\nLong story short, I have a parent who relapsed in their opiate addiction during my time in school and my resulting mental health snowballed with a couple bad grades into a tenure I’m not proud of. I went into college wanting to go into higher education for chemistry and rediscovered that love while working on a project at my company, and am ready mentally to do my best in school.\n\nI’ve spoken with some admissions counselors and chair members at various schools in the Midwest and they’ve recommended a plethora of ideas: second B.S., Masters, Post-bacc. Overall another opportunity showing my ability to be successful in the classroom along with more research. \n\nWhat would y’all recommend? If it’s a masters or post-bacc, should I be raising my GPA with classes taken at a community college before applying? Any university or program you’ve had a positive experience with?",
            "If anyone has any experience with the ACS general chemistry exam, what can I do to prepare for it outside of getting the study guide",
            "As a self taugh artist I would know about the most creative job existing there. My hope is to find a job that mixing chemistry and creativity. Do you have any field suggestions that I can looking for ?",
            "Chem adjacent industries\n\nHello all! \n\nI’m a recent grad who’s been working as a lab tech for a little over a year now. While I find the principles that we implement interesting, and my coworkers are great. I honestly don’t see myself doing technical/lab work for the long haul. Are there any “adjacent” industries where I could leverage my chemistry knowledge while being able to work more closely with people or groups?",
            "I'd start by just trying to apply for PhD programs and seeing what happens.\n\nIf that doesn't work out, then I'd switch my sights to a low-cost thesis-based Master's. GPA shouldn't be as big a dealbreaker there.",
            "IMHO you can do this but you have other negatives besides only GPA.\n\nStart by asking your old professor or current employers if they can recommend you to anyone.  A direct referral can skip the application process.  If a PI wants you in their group, they will get your regardless of the application.\n\nWe consider a \"fresh grad\" as someone who has graduated within the last 3 years.  Check deeper into your prereqs for the PhD and some schools require you to have graduated in the last 5 years, or you have to take an exam / GRE.  They may require you to re-take one or two final year classes too, before the PhD coursework starts.  It's not significant, but it is more work they maybe don't want to do compared to other applicants.\n\nThe reason GPA is so valuable is it proves you have the ability to successfully complete 4 years of schooling.  It's a strong predictor that you can complete another 4+ years.  You can explain your reasoning for the previous dip but you have not explained or proven how you prevent bad mental health happening again.  There will be stressful events in the future (maybe not as extreme) and most people that start grad school won't complete (for good reasons too).  The method to prove it is obviously more schooling.  The post-bacc will be cheapest and fastest, plus expose you to new group leaders that may be willing to take you on.  Thesis-only masters is next and second BS is a terrible idea.\n\nGPA calcs can be manipulated in lots of ways and schools will do this to get candidates they like across the line.  You can use final year classes only, or core classes only, or last X years only.  That is why a post-bacc can be done as a quick boost, but it still requires some PI want you.  That's why I recommend finding a PI first before randomly applying as an unknown to the general candidate pool.\n\n[GRE is next-to-worthless](https://cen.acs.org/education/graduate-education/future-GRE/97/i5) for chemistry grad school these days, but it is a positive data point that doesn't cost too much or take that long.",
            "Study like you would for any exam. Read your textbook and notes, and do practice problems.",
            "Science illustration and science communication is what comes to mind first.",
            "Laboratory/Facilities management, technical sales for a scientific services or chemical or instrumentation company, environmental/health NGOs or government agencies, user/customer-facing roles at software companies targeting lab/biotech software users, etc.\n\nSort of depends on what you'd like to do!",
            "Thanks for the feedback! I appreciate the honesty.\n\nWhat other negatives do you see sticking out and any idea on how to address them before putting in applications? Just trying to give myself the best shot I can - reaching out to a connected PI is a great one!\n\nDo you think going the route of a research-based masters would be a good idea first? Shores my research and grades up. Since postbacc only would help my undergrad GPA so much realistically",
            "cool, thanks! I guess it's not a particularly eccentric exam then",
            "Besides the length since graduation and mental health story as strong negatives, it's okay.  \n\nThe job you have is a maybe but I wouldn't weight it either way.  Main reason people quit grad school is they find a good job.  But a good reason to start grad school is you found the limits at the job when you don't have a PhD.  This is all statement of purpose or interview stuff to convince a PI to take you on board.\n\nI did general admissions two years as an academic and we did hold a few places for hardship applicants.  Either Olympians/athletes or truly brutal emotional stories.  The thing about a hardship story is it usually gets you put into a too-hard box.  Academics have seen lots of people fail to complete for many reasons.  That's all they want in a grad school application, evidence that you will complete.  So we ask why were you unable to maintain a high GPA and all we hear is \"problem\" -> \"no-solution\" and looking at the other people in the queue and think \"easy\".\n\nPost-bacc you can study part time while still working and correct your biggest negative - inability to maintain stability in learning (aka low GPA).  Masters by research is a big time commitment and you can already demonstrate hands-on chemistry skills from your 3 years at a chemistry company, it's of lesser value and it takes longer.  Benefit to a MS by research gives you an opportunity to transition into a PhD in the same group/school or be in contact with other academics.  It's more direct but you may not need it.\n\nI still think your best opportunity is directly contacting academics via your network (old PI you published with, others on the publication, current company colleagues ex-PI). The fact you have a publication beats most other applicants, so don't undersell yourself on that, most grad school applicants don't have any publications.  Doing some legwork and e-mails now doesn't cost you anything and has an okay chance to get you accepted somewhere.",
            "I can definitely see how it’s viewed as that during the application process. In my mind, I was hoping to use it less as an excuse and focus more on - like you alluded to - the solution to what the problem was during undergrad (being the work I’ve put in thus far in research, industry, and myself).\n\nReally respect your opinion for being in the field and working in admissions - do you think it would be better to avoid addressing prior mental health issues in the application process and/or when reaching out to professors? I figured at some point I’d be asked to explain my low GPA and honesty is the best answer lol\n\nThat makes sense on your views of postbacc vs masters. I agree getting my foot in the door with a professor is the next best step, and maybe they’ll have a preference on doing a postbacc/masters while researching in their lab to showcase I’ve worked my way back to being stable enough to excel in the classroom prior to helping with admissions for PhD\n\nAgain, thanks for the helpful advice! Hope none of this comes off as defensive - I really just want to portray myself in the best light and chase my dream.",
            "My opinion only - living with an unwell parent is already a gigantic distraction.  You say that and mention you know in hindsight you should have taken a lower class load or deferred.  That's sufficient explanation.  You still need to back it up with some evidence you have control now (e.g. successful job, re-taking classes).\n\nOnce you bring up mental health you also need to really clearly indicate how you are controlling it today.  You mention a situational trigger of the parent, the outcome was anxiety/stress/depression, you control it by continuing to have therapy at some frequency or self-managed after some treatment and maybe medication.  Right now, as written, you are blaming the grades on bad mental health which is from a single trigger.  That's open, there will be more triggers.\n\nSo... You can take the extra classes and don't need the personal story, or you need the personal story and push through with your current excellent skills (publication, 2 years undergrad experience, relevant job) and have a convincing evidence your mental health is in control with ability to prevent it going backwards.  Not being rude: there are no pity points, we need you to be functioning for 5 years to complete, we aren't here to fix you."
        ]
    },
    "PSA for chemists with eczema": {
        "title": "PSA for chemists with eczema",
        "score": 129,
        "url": "https://www.reddit.com/gallery/1dlhuop",
        "content": "Years into my PhD, relentless hand eczema turned nights into restless scratching sessions and days into a blur. Doctors prescribed antihistamines and steroid creams, offering little relief. My eczema worsened, forcing me to take breaks from work, utterly drained.\nA coworker, an eczema warrior herself, suggested wearing cotton gloves at night after moisturizing. It didn't work, but it sparked an idea. I discovered people with eczema wear cotton gloves under work gloves. Bingo! Wearing them at work and under my motorcycle gloves became a game-changer. It turned out I wasn't allergic to nitrile, but sensitive to prolonged contact with certain textures.\nCotton gloves were my saving grace. Now, I can finally enjoy life itch-free. \nPics are of the worst it ever got and of the cotton gloves you can get at the pharmacy.\n\nTLDR: Those who developed eczema as chemists, consider wearing cotton gloves under work gloves, it might save you years of struggle!",
        "num_comments": 42,
        "comments": [
            "I have very mild eczema and my kid is much worse. Have you tried soft guard from Fischer? It absolutely works for my hands - latex, nitrile etc. I used to get these pinhead sized blood blisters where if I clenched my fist I would just bleed. Soft guard fixed that.",
            "I work in a manufacturing facility with chemicals, many of the workers wear these cotton gloves under their nitrile gloves. It also helps don and doff gloves when your hands are sweaty because it’s a hot, humid environment. Glad you are getting relief!",
            "My coworker wears these and I always say how classy he is wearing them.",
            "My grad school sold glove liners in the lab store. Everyone in my lab used them, and I soon developed the habit. I cannot imagine doing my job without them. It’s literally been like 8 years of glove liners and I do not understand how your average scientist wears just gloves every single day.",
            "Cotton gloves are cheap from Amazon by the bundle. I don't have eczema, but it makes prolonged wearing of nitrile gloves more comfortable.",
            "Cause of eczema is varied. There might not be a solution to it for everyone. Everyone thinks they know the solution for eczema.",
            "I might want these cotton gloves for other reasons... you say they're available in a typical pharmacy? Do they come in distinct sizes so I can find one that's snug?",
            "I had to sew myself some liners for our glovebox.  The butyl rubber was the only thing I’ve ever reacted to",
            "Nice to know!",
            "Works for me too. Went years without any problems then one day just started getting rashes after wearing gloves all day. The only thing that helps is cotton glove liners.",
            "My ochem lab TA told me about glove liners when he overheard me complaining about how gross and sweaty my hands felt when I had to change gloves. Literally blew my mind!",
            "At this point, this might sound sad, idk if it is the constant LN burns or mild eggsmuh or both for my hands. I am a bit older in age, I work in LN daily but i have no regard for PPE because… “it’s just cold” Have been buying ULINE glove liners in bulk for years and they irritate the hell out my hands! Especially around the knuckles. Going to try this with cotton tomorrow. Thanks for enlightening me today, cheers!",
            "I wouldn't be so sure it is eczema. You can get a fungal infection on your hands, very similar to athlete's foot, and it will look just like what you have on the picture. And of course humidity and the use of steroids will make it even worse, and it will spread and never heal fully. \n\nThere has been a recently - discovered multi-resistant strain of Candida aurum, and also Trichophyton rubrum that resists many common antifungals. But microscope test for presence of fungal matter in flakes of your dead skin can be done very easily and inexpensively by a dermatologist - the result takes about 15 minutes. I recommend that you take the test.",
            "thanks, dude",
            "Thanks for the tip. I have psoriasis, I might try these",
            "This has been standard practice for eczema sufferers everywhere I've worked. It does help, but eventually for me I became so sensitive to my own sweat that even with cotton gloves on I couldn't work full time in a lab without severe pompholyx developing on my hands. Whether the cotton gloves solve your problem or not depends a bit on what's really causing your problem",
            "Is that what eczema presents itself like? I should see a dermatologist. May be more than just dry af skin.",
            "Read somewhere it might be an allergy to the detergents used to clean the powder off the interior of nitrile gloves. Don’t know if it has relevance, but to me it feels more likely than a texture allergy(never heard of such a thing ).",
            "Most chemicals break through nitrile in 3-4 minutes. This is why in nail and hair salons they need to change their gloves if they get any product on their hands.",
            "Why is that marked NSFW? IF anything it should be the opposite as its educational and shouldnt be seen as unsightly as that is a form of indirect discrimination against those that do have eczema.",
            "Do you have a link for this? It doesn’t come up right away for me in a google search from Australia.",
            "Glad to hear. I really wish they had that at more universities.",
            "This is very true. A couple of my coworkers have it but none of their solutions worked for me. Nonetheless, hopefully my story helps someone!",
            "Working with rubber gloves over 2 hours a day is a risk not only because of the material. Your hand is in a humid environment where water acts as  a irritating chemical it self. Prolonged exposure can give skin sicknesses. Cotton gloves keeps your hands dry. Chemicals in the gloves can also be a factor.",
            "In Australia at least, they can be found in the pharmacy in various sizes. Hopefully you can find some that fit nicely!",
            "I have scars on my elbows/wrists from using our gloveboxes during a particularly gross summer about 2 years ago. No amount of baby powder could save me and I was in so much pain. I even had to get prescription ointment from my dermatologist to help the itching, and that barely did anything. Then one of the PIs down the hall recommended using stretchy cycling arm sleeves, and they totally saved me!",
            "We need more attentive TAs like that one!",
            "I hope they help, but as someone else has mentioned there are many causes for skin conditions. Don’t be too dismayed if you need to keep searching for a solution.",
            "Good eye! The picture I took was actually after my hand got infected from an open sore due to the dry skin. The gloves would have helped me avoid this altogether.",
            "Interestingly, it seems some types of eczema and dermatitis may be caused by a [reaction to Malassezia fungi.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4484996/) Leaving anti-dandruff shampoo with pyrthione zinc on the affected areas for a few minutes while in the shower seems to help in some of these cases.\n\nMy understanding is that these fungi do well on saturated fats, so skin creams have to be chosen with care.",
            "That sounds frustrating, do you have another solution for your situation?\n\nAlso I wish I came here earlier. Seems like a lot of people already know about cotton gloves and I suffered for a long time…",
            "Mine presented as itchy red patches that would spread over a larger area over time and was primarily on the sides/back of fingers. Sometimes I’d get little blisters that would itch too.\nIf you’re trying the standard solutions like moisturising and it doesn’t work, or if it’s bringing you moderate discomfort then I think it’s worth seeking treatment. I went for too long thinking it was just excessively dry skin that I was somehow not taking proper care of…",
            "Interestingly I get it if I wear latex or nitrile gloves in the lab or if I wear my cheap motorcycle gloves without liners.",
            "I have eczema myself and I don't think there's anything wrong with marking images like this as NSFW. There is no other more appropriate \"warning\" or \"read before clicking\" alert, but I do think that it's always better to err on the side of caution. Not everyone scrolls through reddit feeling fine with seeing wounds and injuries. Sure they can be informative and educational, but the same could be said for many other kinds of pictures.",
            "My hand, my choice.",
            "You can use stokoderm from sc Johnson",
            "Maybe they mean this:  \n\nhttps://www.thermalscientific.com/product/29611/safety--apparel/cleaning-safety/hand-cream/softguard-barrier-hand-cream  \n\nIt seems to be discontinued on the main Fishersci website though: https://www.fishersci.com/shop/products/softguard-extra-strength-barrier-hand-cream-pump-bottle/p-4525623#?keyword=softguard",
            "[deleted]",
            "The strongest steroids available! I used Dermovate as instructed by a dermatologist twice a week to keep it at bay, which is quite a lot for a steroid like that. Really though the only solution was to get a new job that wasn't full on in the lab all day, which worked more permanently",
            "I was diagnosed with irritant contact dermatitis due to wearing nitrile gloves, my skin was reacting to the sweat being in contact with my skin for long periods, cotton gloves and steroid cream helped a lot.",
            "Looks like dyshidrotic eczema. \n\nI used to get it really bad in graduate school, so I'd put on my steroid ointment at night and put cotton gloves over that and then wear cotton gloves under my nitriles. It was only ever annoying when I was using tons of DMF and DCM, so I'd be triple gloving with latex over nitrile over cotton.",
            "Oh shit it is discontinued. It was so expensive...",
            "Thankfully this one went away with antibiotics!"
        ]
    },
    "My Experience Job Hunting - May 2024 B.S. Chemistry Graduate (Details in comments)": {
        "title": "My Experience Job Hunting - May 2024 B.S. Chemistry Graduate (Details in comments)",
        "score": 77,
        "url": "https://i.redd.it/op4qewl8zz7d1.png",
        "content": "",
        "num_comments": 14,
        "comments": [
            "During my job search, I came across a few posts on this subreddit discussing careers, salary, and job prospects. I found these to be very helpful while I was applying, and thought I would put this out here now that my job search is complete.\n\nAs some background, I am from Missouri and attended a public university in Missouri. As a result, almost all of my applications were sent to companies in Missouri or in the neighboring Midwest. Before my graduation, I had probably sent out around 10-20 applications between March-May, without much luck. Once I graduated however, I created a LinkedIn, Indeed, Handshake and Glassdoor account and began to apply to most of the jobs in my surrounding area. I would say 100+ of my applications were sent in the past month (Late May - June) alone.\n\nWhile in uni, I did around 2.5 years of undergraduate research with a lab focused on organic chemistry. I also obtained a summer internship at a large chemical company as a QC intern one summer. I really enjoyed undergraduate research and therefore mainly focused on bench chemist/R&D based roles during my application process.\n\nI found that most of the companies that contacted me back generally had around 3 interviews, with the first being a generic interview with HR, the second being a virtual interview with chemists/lab managers, and the third being an in-person lab tour/interview. Of the 8 interview requests I got, I received 2 offers.\n\nThe first offer came right as I graduated, and was for a bench chemist position in a small town in Arkansas. I ended up rejecting the offer as I thought the town was too small and far from family. This job offered a base pay of 26.00$ an hour with a yearly bonus of an undisclosed amount.\n\nThe second offer was for an R&D chemist position in Missouri. This position offered a salary of 65k with benefits and I accepted this offer.",
            "I’m in the 30s in terms of number of applications sent out and I’ve just got my first call for an interview. It’s seems like a slim job market at the moment.",
            "Damn. I applied to like 5 places two years ago and found a job.",
            "Congrats and best of luck!",
            "It was a very different market two years ago. I (PhD) got the first job (small pharma discovery chem) I applied to. It was a great fit, but still. I even applied using the LinkedIn easy apply, lol.",
            "Yes, that is more typical.  \n\nShotgunning 124 applications and hoping for bites isn’t the best way to get a lab job.  The OP’s graphic shows the terrible returns on that strategy.",
            "So what is the best way?",
            "So you say it is better to just apply to 1-4 jobs and just get hired?",
            "If you’re like the OP and did an internship and undergraduate research, you should be using that network to help you apply for a handful of jobs that align well with your interests and skills.\n\nI will almost certainly hire you if you send me a well crafted résumé tailored for my lab and I also see that you worked with my colleagues and you have an undergraduate paper.\n\nI will discard your application unread if it appears to be a generic résumé sent blind, with no effort to tailor it for what we do here.",
            "Yes, you’re much better off targeting and re-writing your résumé for a handful of jobs that you are well-suited for, rather than sending off dozens and dozens of generic apps.\n\nEspecially, if like the OP, you did an internship and had years of undergraduate research.  You should be using that network to help you find a job.  That is really the whole point of doing both of those things.",
            "Good to know, thanks!",
            "Of course!\n\nNow it is a different story if both your internship and undergraduate research experience ended on unpleasant terms.  That could hold you back from future jobs and force you into a brute force method like the OP."
        ]
    },
    "Pronunciation of Halogens": {
        "title": "Pronunciation of Halogens",
        "score": 85,
        "url": "https://www.reddit.com/r/chemistry/comments/1dlb4mt/pronunciation_of_halogens/",
        "content": "Note: these are the typical US pronunciations; pronouncing iodine as eye-oh-deen is perfectly reasonable\n\nFluorine: flo-reen\n\nChlorine: klo-reen\n\nBromine: bro-meen\n\n**Iodine: i-oh-dine**\n\nAstatine: as-ta-teen\n\nTennessine: ten-nes-seen\n\nwhat in the actual f is iodine doing... you don’t get your own special thing just for being a solid\n\nEdit: Flo-reen is pronounced the same as floor-een, just with the r at the start of the second syllable, which is how I pronounce it. I initially typed them as flor-een and klor-een, then moved the r and didnt think of how the pronunciation would be affected",
        "num_comments": 86,
        "comments": [
            "Actually here in the UK we tend to pronounce it I-oh-deen.",
            "Eye-oh-deen\n\nFloor-een\n\nKlor-een\n\nBro-meen",
            "Near as I can figure it has to do with how the various English dialects stress the word. But probably a question for r/linguistics",
            "It’s just English being English.",
            "Flo-reen? Clo-reen? I don’t think so.",
            "My old af professor said it like I-oh-deen (US)",
            "I have always pronounced it eye-oh-deen. I’m from USA also",
            "Aus\n\n- Fluorine: Flu-reen \n\n- Chlorine: Klor-reen \n\n- Bromine: Bro-meen \n\n- Iodine: I-oh-deen \n\n- Astatine: As-ta-teen\n\n- Tennessine: Teh-neh-seen\n\nApologies; I’ve never been  great at writing words in my accent.",
            "This is the problem with American pronunciation. There's absolutely no reason to change the pronunciation of iodine in regard to all the other halogens, but you do it anyway, and assume you're correct. 🙄 The arrogance.",
            "I mean several of your pronunciations are just wrong",
            "I've heard other American chemists pronounce it \"eye-oh-DEEN\". Always sounds pretentious to me.",
            "I oh dine\nOr\nI oh deen",
            "Wtf is tennesseens",
            "Wait until you hear about aluminum….",
            "For consistency's sake, US chemists often pronounce iodine and strychnine to rhyme with bromine and morphine.",
            "I say fleur-reen so it's pronounced like it's spelled, which is one of the most wrongly spelled common ones imo. If I say floor-rine they miss the u.",
            "I say:\nFloor-een \nChloor-een\nBro-meen\nI-oh-deen \nAss-tuh-teen… \nIs it normal to use flo-reen? flow-reen???",
            "I’m an -een purist for all of them and I’ll die on this hill. American also, it’s just consistent.",
            "Ok guys, but how about our naming of anions? Using the suffix -ide to describe a negatively charged species. Bromide, for example, is negatively charged bromine (Br-). Chloride is Cl-. Methoxide is MeO-. \n\nAnd then… amide. Following the trend it’s a negatively charged amine, right? Right guys?! RIGHT?! It definitely doesn’t have two meanings that are spelled the same yet pronounced differently, does it?! Because that wouldn’t make any sense would it?! RIGHT EVERYONE?! \n\nI hate English so much sometimes.",
            "https://youtu.be/6lBFbZTuH_Y?t=4",
            "Haalaa jeans",
            "Bro - mine is how I have always said it. Never head Bro - meen in English. Endings kinda go out the window in my language, these are mine:\nFluor\nChlor\nBrom\nIod/Jod",
            "‘Alojenz",
            "As a high school student, what is astatine and tennessine? Never heard of them🫣",
            "Floor-ene\n\nKloor-ene\n\nBro-mean (though I guess if I followed my own convention I should say “brom-ene for consistency, but that sounds weird and ain’t happening)\n\nEye-uh-dean (maybe the heavier halogens need the consonant before the “-ine”, I basically pronounce this like the answer to the question, “What position do you have at your university?” “I, a Dean”)",
            "Thank you for letting me know of Tennessine!",
            "And we spell Sulphur as the Lord intended",
            "From the UK?",
            "I've always heard \"floor-een\" and \"cloor (rhymes with floor)- een\" but still not \"eye-n\" at the end like iodine \"eye-oh-dine\"",
            "\"flo\" and \"clo\" werent mean to be pronounced like flow and... not clow ig that feels like it would be pronounced differently... anyways that was just because thats where the syllable breaks in English, overall its pronounced floreen/kloreen to me",
            "seems to me from the other comments that that's just the UK pronunciation",
            "Considering that the pronunciation of a word is determined solely by a consensus on how it's pronounced, and the US has the third largest population in the world (I'm not sure if India typically pronounces it eye-oh-dine or -deen), we have a pretty big sway in what the \"correct\" pronunciation is.",
            "which ones, pray tell?\n\"or\" (as in fluorine and chlorine) is pronounced like the word \"or\"",
            "how do you pronounce tennessine? I pronounce it as either tennessee + n or move the stress to the second syllable",
            "You mean a lumen. Uhm, what’s light got to do with aluminium anyways?",
            "Personally, I think \"pronounced like it's spelled\" for Fluorine would be ['flŭo.ɹaɪn] (like \"flu or ein\" but faster and with the u in flu much shorter), whereas you seem to be saying you'd do it either ['flŭəɹ.in], ['fləɹ.in], or ['flœʁ.in] (flu-er-een, flur-een, and [french fleur]-een, respectively)",
            "see edit",
            "Interesting, I mean that makes a lot of sense, only elements I can imagine screwing with that at all are magnesium and manganese (assuming \"ium\" is similarly removed)",
            "Lower-period halogens, they're extremely short-lived though, with \"astatine\" even being derived from the greek word for unstable",
            "I will smite you",
            "And you say alumin-i-um which is more correct in my book.",
            "But not as nature intended.\n\nhttps://www.nature.com/articles/nchem.301",
            "It's spelled B-R-I-M-S-T-O-N-E.",
            "oil of lord lmao",
            "Just not from North America.",
            "South Africa actually, so UK influenced English",
            "I've always gone floo-reen, to differentiate from fluorene, which I pronounce as floor-reen.",
            "yeah I just spelled it with English in mind; words like \"nor\", \"or\", and \"for\" being similarly pronounced",
            "As others have said, the r goes to the first syllable.  https://www.merriam-webster.com/dictionary/fluorine\n\nThough flo-reen and klo-reen might be acceptable in, say, Alabama.",
            "Bro you realise there’s like dialects and accents, sometimes many in the same geographical area? Just because your dialect or idiolect pronounces it one way, doesn’t mean that other ways to pronounce it are in any way incorrect or somehow not the “main” variation as you are heavily implying.",
            "It's only 'correct' in your country.  \n\nIt might have escaped your US-centric notice, but the US is very much an outlier vs the rest of the world. Imperial measurements, Fahrenheit, etc. Your use of the English language is also very much a feature of your own country.",
            "Floor-een, chloreen, and iodine is still pronounced with an een",
            "I’ve always thought it was pronounced tennis + sine",
            "Its a light metal(oid)",
            "Manganese is Mangan, Magnesium retains its name, we are a little wierd thanks to H. C. Ørsted... He introduced most of the names we use. -ium does not get removed from most names. We also use some of the German versions, so Kalium rather than Potassium. And for the ones that really throw off kids learning: Brint (H) and ilt (O).",
            "I may be misremembering this but wasn't the American pronunciation developed as a sales pitch to make people associate it with platinum? That may be nonsense",
            "Excellent find and one must always go back to IUPAC\n\n>It is the International Union of Pure and Applied Chemistry (IUPAC) who deal with questions of nomenclature and naming when it comes to chemical elements and compounds. And so when IUPAC decided that element 16 should be spelled as 'sulfur' — either in 1971 (ref. 1) or 1990 (ref. 2) depending on the source — there should be no argument about whether there should be a 'ph' in there or not. It is not a question of American or Oxford English spelling, it is a given name — and 'correcting' such a name to a different spelling is wholly inappropriate. What would Fred Flintstone say if we insisted on spelling his name Phred Phlintstone! Just to hammer the point home, IUPAC only accepts alternative spellings for two elements, and neither of them is sulfur: 'aluminum' and 'cesium' are fair game, although Nature Chemistry uses aluminium and caesium.\n\nIUPAC is the arbiter. Chemistry follows the law of \"they who smelt it dealt it\" when it comes to naming. you made the stuff, you can publish whatever the journal will let you, no matter how outlandish. Until IUPAC rules. Then, the law is the law, and we expunge all antiquated name schemes. Where possible.",
            "Ah",
            "js curious, with \"floo-reen\" is that floo pronounced like the Flu? Ive never heard that before but it makes sense",
            "It may well go with the first syllable for you, English is an extremely fluid language, especially with regard to pronunciation. For me, the r comes at the start of the second syllable",
            "I’m not saying or implying that any way of pronunciation is \"incorrect,\" I’m questioning why the typical US pronunciation of Iodine is different from that of the other halogens",
            "I just said it was only correct in my country, that's the whole point",
            "it's pronounced eye-oh-deen typically in the UK it seems, while the US prefers eye-oh-dine. As i've mentioned in many of the other comments, I pronounced fluorine as flooreen, I just happen to typically move the r to the second syllable. Not meant to be pronounced flow-reen",
            "That explains it!! Thanks so much!",
            "Lmao even funnier bc (for Brint) there's already a B, Br, and Bi",
            "Not quite true. The fellow who named it spelled it both ways at different times. The British tended to use the extra i while the Americans went the other way. \n\nIt is one of those weird divergences like Soccer which was a British slang term for Association Football. The term caught on innthe US but fell out of favour innthe UK.",
            "If that's true you know more than I do. I always just assume we do anything because we are fucking stupid.",
            "Chemists who work with that element (I) pronounce it as Io-deen in the US.",
            "\"For me, the r comes at the start of the second syllable\"\n\nThus the Alabama example.",
            "If that’s the case, the bombast of your post and replies definitely didn’t communicate that very well judging by the general response.\n\nBut the answer probably has to do with English morphology:\n\n1. The ending “-ine” is pronounced either “een” or “in” or “ayn”. Think marine vs feminine vs bovine. No way to know which to use without knowing the word, although often all three are considered correct, such as in the case of iodine. I think it’s especially common for all speakers of English to mix these up either due to ignorance or more typically simply completely unconsciously.\n\n2. Early Modern element names almost invariably came into English through French or German (with one infamous exception being sodium and potassium (*Na*trium and *K*alium in German and all other languages) so the original pronounciation is definitely still the expected one that rhymes with the other halogens.",
            "Then don't spell it out as flow reen",
            "Letters are retained",
            "Here in Australia we use \"soccer\" because the term \"football\" is exclusively used to refer to games in which people carry the ball in their hands and pass by throwing the ball. \n\nYep, it makes a lot of sense.\n\nI think it's a similar situation in the US.",
            "Not at all. I actually find the spelling of American English a lot more sensible. Hell, where I live the pronounciarion of our town names essentially exist as a way to torture foreigners",
            "Yeah; I tend to prefer onsets over codas (a-la-ba-ma) because it, I feel, flows easiest, whereas codas (al-ab-am-a) requires the addition of glottal stops at the start of each syllable",
            "\"the general response\" being what exactly? Me being curious as to how others pronounce things and following up?\n\nOn points one and two, I'm well aware of the variation in \"ine\"'s pronunciation -- hence the purpose of the post: jokingly asking why the US (generally) pronounces Iodine differently from the other halogens",
            "I didnt...?",
            "ik I just meant I'd imagine its more confusing, like with English having K for potassium (from Kalium/Kallium) meanwhile theres a P, Po, Pt, Pa, Pu, and Pm",
            "Originally, football was a sport played on foot. Poor people played football, while rich people played sport oñ horses like polo, or went fox hunting.",
            "It's called football because it's played on foot, as opposed to, say horseback",
            "fun fact: the u in words like favour or flavour was added *just to seem fancier* by seeming more French",
            "Other people replying on your post that seem to miss that all you’re interested in is the linguistics of the matter. Everyone is more busy informing you that they do, in fact, say eye-oh-deen in the states lmao",
            "That's just one hypothesis, it's not a fact. Nobody knows why it was called football.",
            "yeah... It makes sense that it would be pronounced that way, I’m really not sure why ive never met someone who says it iodeen, considering the caliber of our chem teachers",
            "“but it is provocative! it gets the people going!”",
            "Well, if you’re in a uni where all professors and students use the same pronounciation, using the other pronounciation is always going to sound out of place. Be the odd one out :)"
        ]
    }
}