{
    "Weekly Discussion & Tournament Thread Index - June 17, 2024 [Mod Applications Welcome]": {
        "title": "Weekly Discussion & Tournament Thread Index - June 17, 2024 [Mod Applications Welcome]",
        "score": 8,
        "url": "https://www.reddit.com/r/chess/comments/1dhrino/weekly_discussion_tournament_thread_index_june_17/",
        "content": "# r/chess Weekly Discussion Thread\n\nYou are welcome to ask here all kinds of chess-related questions that don't warrant their own post. You can also discuss or ask questions about upcoming tournaments that don't have their own thread yet.\n\n&#x200B;\n\n**Moderation**\n\n**OPEN CALL** for new moderators! Interested in: creating event posts, hosting AMAs, making sure only the finest queen sacrifice puzzles make the front page? [Apply Now!](https://www.reddit.com/message/compose/?to=/r/chess&subject=Want+to+volunteer+for+mod)\n\n**Event threads**\n\nInterested in making threads for tournaments, but don't know where to start? Our [Event Template](https://www.reddit.com/r/chess/wiki/eventtemplate/) page is a great way to get the basic layout.\n\nAn alternative would be to start a subthread directly in the weekly thread.\n\n&#x200B;\n\n**Announcements**\n\n[**REWORK OF r/chess RULES**](https://www.reddit.com/r/chess/comments/1btdq9f/important_rework_of_rchess_rules/)\n\n**UPDATED Oct 27th** \\- [r/chess Announcement Regarding Coverage of St. Louis Chess Club and USCF Events](https://www.reddit.com/r/chess/comments/16dyy3u/rchess_announcement_regarding_coverage_of_st/)\n\n&#x200B;\n\n**Recent AMAs**\n\n* [GM Alex Colovic](https://www.reddit.com/r/chess/comments/1b81pab/hi_im_gm_alex_colovic_an_award_winning_chessable/)\n* [Lichess Team](https://www.reddit.com/r/chess/comments/1bbd4ke/lichess_team_ama/)\n\n&#x200B;\n\n**Active Tournament Threads**\n\n|DATES|EVENT|\n|:-|:-|\n|\\-|\\-|\n\n&#x200B;\n\n**Other Active Tournaments Web Links**\n\n|DATES|EVENT|\n|:-|:-|\n|Jun 10-18|[Stepan Avagyan Memorial](https://chess-results.com/tnr953203.aspx?lan=1&art=2&turdet=YES&flag=30)|\n|Jun 17-18|[Chess.com Chess960 Community Championship](https://www.chess.com/events/2024-chesscom-chess960-championship-qualifier-1)|\n\n&#x200B;\n\n**Upcoming Tournament Schedule**\n\n|DATES|EVENT|NOTABLE PLAYERS|\n|:-|:-|:-|\n|Jun 25-Jul 6|[GCT Bucharest](https://grandchesstour.org/tours/2024/)|Many 2700+ players|\n|Jul 10-14|[GCT Zagreb Rapid and Blitz](https://grandchesstour.org/tours/2024/)|Many 2700+ players|\n|Jul 25-Aug 9|[Speed Chess Championship](https://www.chess.com/events/info/2024-speed-chess-championship)|Carlsen, Caruana, Ding,   Firouzja, Nakamura, So, Vachier-Lagrave|\n|Sep 10-25|[45th Chess Olympiad](https://fide.com/calendar/53628)|(Hungary) Many 2700+ players|\n|Nov 20-Dec 15 (Tentative)|[FIDE World Championship](https://www.chess.com/events/2024-fide-chess-world-championship)|Ding Liren vs Gukesh Dommaraju|\n\n&#x200B;\n\n**Recently Completed Tournaments**\n\n|DATES|EVENT|PODIUM|\n|:-|:-|:-|\n|Jun 6-14|[UzChess Cup](https://www.reddit.com/r/chess/comments/1dat1tw/event_uzchess_cup_2024/)|Yakubboev, Abdusattorov, Yu|\n|Jun 10-13|[Bullet Chess Championship](https://www.reddit.com/r/chess/comments/1dcu3wy/chesscom_bullet_chess_championship_2024_day_1/)|Firouzja, Nakamura, Sevian|\n|Jun 2-13|[FIDE World Junior Championship](https://chess-results.com/tnr945372.aspx)|Kazybek, Emin, Luka|\n|May 27-Jun 7|[Norway Chess](https://www.reddit.com/r/chess/comments/1d1iyr5/event_norway_chess_2024/)|Carlsen, Nakamura, Praggnanandhaa (Open); Ju, Muzychuk, Lei (Women)|\n|May 25-Jun 2|[Aktobe Open](https://chess-results.com/tnr933360.aspx?lan=1)|Maghsoodloo, Predke, Sarana|\n|May 24-Jun 2|[Americas Continental Championship](https://chess-results.com/tnr926264.aspx?lan=1)|Garcia, Xiong, Henriquez|\n|May 14-22|[Sharjah Masters](https://www.reddit.com/r/chess/comments/1crj5dc/event_sharjah_masters_2024/)|Daneshvar, Murzin, Shankland|\n\n&#x200B;\n\n**Other Notable Threads**\n\n[Coach a Player - Recent Threads](https://www.reddit.com/r/chess/search/?q=coach+a+player+flair%3Acoaching&include_over_18=on&restrict_sr=on&t=year&sort=new)\n\n&#x200B;\n\n**Community Content**\n\nHere we'd love to highlight community content to show our appreciation for the energy spent. Content like Game analysis, info-graphics, etc., and we'd love to hear from you what kind of content you'd like to see as well.\n\n[Want to post your game to r/chess?](https://www.reddit.com/r/chess/comments/171m7px/want_to_post_your_game_to_rchess/) \\- for people who want to solicit feedback on their games\n\n[Advice to people asking for advice](https://www.reddit.com/r/chess/comments/1ckzkcb/advice_to_people_asking_for_advice/) \\- for people who want to ask about how to improve\n\n[Managing tilt in chess](https://www.reddit.com/r/chess/comments/1cm8b2x/how_better_managing_tilt_has_helped_me_improve/) \\- for people who are surprised about their rating variance",
        "num_comments": 26,
        "comments": [
            "[Cairns Cup 2024](https://uschesschamps.com/2024-cairns-cup/overview) is missing from the \"current events\" section and could use a stickied thread (it conveniently ends two days before the start of GCT Bucharest).",
            "Does anyone know why Sevian resigned in his game against Hong up on the clock in a drawable match?",
            "don't know where to discuss the Chess.com Chess960 Community Championship, so i'll just post here: lets go andrew tang andrew tang andrew tang\n\nat the round 7 mark, andrew is leading—he has won every game so far!",
            "[https://perpetualcheck.com/rang/index.php?lan=en](https://perpetualcheck.com/rang/index.php?lan=en)\n\n  \nThis is interesting in it captures performance rating over past 12 months. Hikaru and Fabi have had the pest APR over the period. Wei Yei is ahead of Magnus and interesting thing is Pragg is ahead of Arjun, Nodirbek A and Gukesh. Parham has played more games than anyone else(more than 1/3rd of the year). Its also interesting to see Sarana play 100 games without seeing him in any major closed or open tournament. Is it all in Russia.",
            "Is chess supposed to be a relaxing game?\n\nI tried playing some chess to decompress at night before bed and it did the exact opposite of that.\n\nI kept losing over and over again - probably like 10 games in a row and got increasingly enraged. Like, I just wanted a quick win before bed but that wasnt happening.\n\nIs this not the proper use case for chess?",
            "Hopefully nobody here is watching the Euros. Dedicated a segment of the preshow to sports betting. Stay safe chess kids.",
            "sorry for the basic question; i'm just coming back to the game after years and years.\n\nWhen people talk about their ELO are they referring to their score on chess dot com  and does this rating carry over to real life tournaments etc",
            "Is Hans Vidit match which is supposed to happen tomorrow still happening? Can't see any details about it on social media.",
            "Hey guys I am a complete noob. I like to play against my friends and low level chess bots. The thing is I only ever win by taking all the opponents pieces and trapping their king. How can I learn to checkmate without doing this? Seems like I am not learning anything from playing",
            "thank you for the info. At the moment there is a [bug](https://www.reddit.com/r/ModSupport/comments/1dekun6/unable_to_edit_scheduled_posts_in_mod_tools/) with scheduled posts that we need to sort out.",
            "As it says in the post, any tournaments without their own threads can be freely discussed here. :)",
            "Not if you're playing to win",
            "Competitive games are not usually relaxing.",
            "FIDE uses ELO, Chess.com uses Glicko, and Lichess uses Glicko-2 for their rating system. \n\nNone of these are interchangeable and ELO rating in chess should only be used to refer over-the-board rating (usually FIDE).",
            "The open event that was supposed to happen together with it (4 days, starting yesterday) has only the list of people signed up, no pairings or results. And they had a limit of 1000 people which they \"expected to sell out\" while they got only 300. Entry was $300ish, they might be seriously in the red.",
            "There is a stream set up for it on ChessBase India.",
            "You gain basically nothing playing against bots.",
            "play real people online",
            "Solve tactics and learn checkmate patterns.",
            "True, but people also often use the term Elo interchangeably with rating even when it is not an Elo rating, e.g. in those online ratings you mention.",
            ">And they had a limit of 1000 people which they \"expected to sell out\" while they got only 300. Entry was $300ish, they might be seriously in the red.\n\n\nNot surprised, they did fuck all to advertise the event. Just one announcement and after that they disappeared. Unless you follow chess news regularly you won't even get to know about this event.",
            "Even Vidit and Niemann hasn't posted anything about it recently  lmao. Not their  job though but it's still funny how quiet it is."
        ]
    },
    "Before Queens Gambit there was ♟️": {
        "title": "Before Queens Gambit there was ♟️",
        "score": 101,
        "url": "https://i.redd.it/bcsp13x4448d1.jpeg",
        "content": "",
        "num_comments": 14,
        "comments": [
            "Really good movie, even if you put aside the fact that they portrayed Spassky as a supervillain",
            "Searching for Bobby Fischer is superior to both",
            "Honestly it was pretty good as well",
            "Such a great movie. Loved Toby's performance as Fischer!",
            "I loved Searching for Bobby Fisher.  But I can't rewatch it because the true story is kinda sad.  A kid who got seriously burned out by a father who tried to exploit him every step of the way, and was ultimately more successful at doing that than his kid was at chess.  \n\nJosh Waitzkin retired from chess at age 23 and never crossed 2500.",
            "They casted liev Schreiber as Spassky lol. It immediately turned Spassky into a darth vader esque villain.",
            "Pawn sacrifice is a great movie, i’d also reccommend “searching for bobby fischer” which i believe is my favorite chess movie.\n\nI was a bit skeptical about tobey portraying bobby but i think he was great in this role and really impressed me. I don’t know why no one talks about his performance here. The inly reason i came accross this movie is because i love chess and not because i like tobey if that makes sense",
            "Hey, they ripped off the chess musical [poster](https://render.fineartamerica.com/images/rendered/default/poster/6/8/break/images/artworkimages/medium/3/chess-musical-bo-kev.jpg)",
            "Oh man what a pity. I was just about to watch it and I always thought Spasskys behavior towards fisher was super nice even though his own beliefs are on par with Fischers personal beliefs",
            ">they portrayed Spassky as a supervillain\n\nThey did not.",
            "underrated af for sure",
            "Spassky is one of few that early visiting Fischer's grave in Iceland. He's truly respect Bobby from various sources that I read.",
            "This movie does not portray Spassky as a supervillain. You can watch it. It's a good movie."
        ]
    },
    "VIDIT VS HANS MATCH, the trash talk has begun ": {
        "title": "VIDIT VS HANS MATCH, the trash talk has begun ",
        "score": 416,
        "url": "https://v.redd.it/2f1s9jvmh18d1",
        "content": "",
        "num_comments": 107,
        "comments": [
            "Haha great comeback line from Vidit",
            "they still look like they could go out an have a beer together after this concluded and I love that so much",
            "a streamer knows when the mic will capture his voice",
            "Could someone please provide a transcript of what they are saying? I can’t hear it properly…",
            "Vidit seems like the nicest guy, he could vibe with anyone.",
            "Why is Hans hair vibrating",
            "I will never understand Hans’ accent. It came out of nowhere. It’s like he’s trying to sound like a Russian grandmaster. Bizarre",
            "OUCH RIGHT ON HIS SOFT SPOT!",
            "Vidit is the man",
            "Owned",
            "If Vidit has a million fans, then I am one of them. If Vidit has ten fans, then I am one of them. If Vidit has only one fan then that is me. If Vidit has no fans, then that means I am no longer on earth. If the world is against Vidit, then I am against the world.",
            "Could this be the match up that finally puts Chess on the map?",
            "Could you tell me the source for your clip?",
            "trash talking before the match is a thing in chess now too?",
            "00:15 is that Boston Mike?",
            "I love it",
            "Where can we find the match?",
            "where tf can i see thisss???",
            "Where can we watch the games?",
            "Hans just needs to give up being the first American chess champion and go all in on chess villain.  Complete with face paint.",
            "Love the banter already haha.\n\nI love both of these guys, but only one can win sadly. Match is gonna be so hype tomorrow.",
            "samay raina proud student...",
            "Why does Hans try and sound Russian lol?",
            "What did Niemann Niemann say? I didn't understand anything",
            "Hans really set himself up for ‘But please don’t trash your room’ joke, but the host and Vidit didn’t capitalize.",
            "Dis Hans take that from Batman talking about Superman?",
            "Hans' face when he realized he blundered",
            "I'm confused... are we meant to care about who wins this match?",
            "Hans is not a nice guy wtf is wrong with idiots normalising shit behavior",
            "Hans is corny, but I like how he’s not hiding from the villain persona 🤷🏻‍♂️",
            "Hans is an insufferable prick",
            "slumdog chessville\n\npoor Vidit",
            "Vidit is somone who cannot avoid cracking a smile ... he is so jovial 99% of the time.",
            "They actually can, Hans turned 21 yesterday and is legally allowed to drink in the USA.",
            "This isn't an exact transcript, but summarises what they say:\n\nHost: \"*Hans Niemann you seem like a nice guy, despite the bad-boy image*...\"\n\nHans: 😜 (jokingly) \"N*o, I'm going to go back to my room and summon such hate and vitriol for Vidit, and I won't be smiling tomorrow\"* (meaning he is going to get into warrior mode and won't be in friendly mode for the match)\n\nVidit: 😎 (witty punchline) \"T*hat's true, you won't be smiling tomorrow\"* (meaning Hans will be upset after losing)\n\nHans: 😵\n\nVidit: 👋🎤\n\nHost and audience: 🤣😅😂",
            "Turn on the closed caption.",
            "Engine feeding trash talk lines???",
            "that's how strong his hate and vitriol for Vidit is, he's vibrating with rage",
            "He's lived in Europe when he was young and then in America and he's stayed in a lot of countries. It's not bizzare when you think of it that way.\n\nHe moved to Netherlands when he was 7 so it makes sense he has some mixing of accents.",
            "I agree his accent and tone is unusual but I always find it strange that people don't say the same about Caruana, yes he has italian parents but he grew up in Brooklyn, he has plenty of linguistic quirks lime Hans.",
            "Someone should do a compilation of his accent throughout the years maybe.",
            "It's just because he likes to meme, and that fake accent is funny for him to use and make people think he really sounds like that lol.\n\nEdit: For anyone downvoting me, do you have a better explanation to it than mine? Does his accent just naturally come out [when he starts talking about \"playing some russian school positional chess\" in this video,](https://youtu.be/wsneCN1IdQk?t=66) when it was a completely normal American accent before that?",
            "Yes, didn’t you seem the gleaming head?",
            "\nChessbase India stream in 19 hours.\n\nhttps://www.youtube.com/watch?v=1Q9BZh6lsM0",
            "Chessbase India stream in 19 hours.\n\nhttps://www.youtube.com/watch?v=1Q9BZh6lsM0",
            "Why would you love Hans?",
            "Both Hans and Vidit are play acting for the audience here. I am sure they both get along fine.",
            "Wut? This is basically a combat sports style press conference meant to create clips and hype around the \"fight.\" Obviously this isn't being taken seriously",
            "Relax dude",
            "It's just a yoke, bro. Relax",
            "It seems like they’re both just joking around",
            "Hikaru at Hans age was arguably worse. It's *exceptionally* possible Hans makes a face turn at some point, and frankly I can't wait. He's not there yet, but nothing he's done so far is anything other than be immature IMO.\n\nKeep in mind, nobody in any of this has actually *done* anything morally abhorrent. Chess drama is exceptionally tame, hard to genuinely \"hate\" any of the people involved.",
            "You a Mag cuck still salty?",
            "What are people normalising?",
            "That 1% - 😦",
            "haha, hey perfect timing!",
            "Perfect translation",
            "Sorry, but *where* is the closed caption? I have only quality settings.\n\nI google it requires add-ons (for certain browsers).",
            "Is that a blunder??",
            "That normally happens when you can't be around anyone of your natural accent. Like a Scot moving to a place with no Scottish people might revert to something more \"neutral\" over time.\n\nIt is extremely strange to happen to an American, you're surrounded by your accent",
            "That makes no sense at all.",
            "Just that many people in the Netherlands barely have any accent. His mother is Danish though, so maybe that's where his accent comes from. English is super weird as a second language because there is no standard pronunciation - you must pick an accent.",
            "I don't think the point is about having quirks or an unusual accent, the point is his accent changes quite clearly. Caruana's accent is consistent.",
            "Thank you so much",
            "thanks but i was asking about the conference, i am aware of the Chessbase India live stream.",
            "He’s a funny guy who does dumb stuff it’s great entertainment lmao",
            "Better than loving Hikaru 😂",
            "? What is there not to like?",
            "it’s banter… they’re trying to hype it like a boxing match or ufc event.",
            "Engine miscalculated at very low depth it seems",
            "But this supports his explaination about spending a couple years of non stop traveling for tournaments with only foreigners to talk to.",
            "The United States has an huge range of accents. Anyone who things theirs such a thing as an “American accent” has never been to America or talked to Americans. The US has a more diverse range of accents than anywhere else else in the world, this is a moronic comment.",
            "I mean if you bounce around a lot of places you conform to their accents slightly, even adults in college that go abroad can pick up an accent, it’s not to crazy for a kid to pick it up and have a stronger one.",
            "it's not that unusual. it doesn't happen for everyone, but it's not uncommon. i lived in various parts of the uk for a few years when i was a teenager, had a very international group of friends, and when i came back to the states my accent was all types of fucked. even now, over ten years later, if i am with british people or watching british shows, my accent kind of switches back a bit.\n\nit's probably a combination of that and some type of try-hardness that he feels is essential to his personality/image/brand, which tbh, it probably is, given that it gets him attention every time he talks. i wouldn't be surprised if he had a bit of a weird accent, people commented on it, and he thought \"oh wow this will make me stand out\" and just played into it\n\nedit: i'd also like to point out that a bunch of chess players have weird accents or other speech patterns. hikaru has a very specific intonation and meter he uses which is kind of an exaggerated 'streamer' voice i'd call it, half the chess world says \"but ok\" every other sentence for no reason at all (i couldn't get through the abhimanyu mishra interview on csquared because of how many times he said it), i think even fabi's accent is kinda atypical. and then you have someone like yasser. has anyone met anyone in their life talk the way yasser does? chess players are just sorta socially weird people and i don't think unusual speech patterns are that atypical for socially weird people",
            "Dude go to another country for a week.  Stay in London for a week and see if you don't start letting the accent creep in.",
            "It does though? He has grown up in a few places, so he knows a bunch of accents and so sometimes switches between them.\n\nWhat I dont understand is people thinking that he's faking his accent, which makes no sense at all. Literally why would he do that?\n\nNot to mention Hans also knows a bit of Russian and appeared in Russian podcast recently on Levitov. When you're learning languages, your accent tends to change.",
            "What?? Dutch people can have really bad accents, its one of the most distinct accents you can have",
            "I don’t think his mother is Danish, but maybe I’m wrong about that.",
            "bro, I never said i love hikaru and i dont. i dont even watch him no more since he's been advertising gambling. still i think hans is not likeable at all. plus, that mf doesnt even know how to dress decently. saw him in sitgess 2022 and he was \"rocking\" black/red af1 to a purple/yellow college jacket. jesus. that was even worse than him cheating.",
            "the cheating, the antics, the arrogance, the haircut and so on",
            "You are on fire!",
            "/r/shitamericanssay",
            "More diverse than anywhere in the world! How many languages do you speak?",
            "The American mind couldn’t comprehend European dialects, never mind Asian ones",
            "‘Murica",
            "It became ever more clear to me that there's an American accent when I came to America.",
            "Sure, but you never really lose yours. I've lived abroad for over two decades but I don't speak like caricature of evil Russian scientist when I explain chess moves.",
            "Can't wait for him to give an interview with Indian accent at the end of this match!",
            "The thing that stood out to me most about Fabi is he can’t say “eligible” and then there was one podcast where he said it and then was like I know you guys have something to say about how I pronounce that.",
            ">What I dont understand is people thinking that he's faking his accent, which makes no sense at all \n\nProbably because people (maybe one of the chess bras) that have interacted with him said he doesn't have it in person and puts it on for the camera combined with it seemingly appearing overnight.\n\n>Literally why would he do that?\n\nIt's not uncommon for Americans do it when they want to sound worldly. Especially those wanting to be the center of attention. Have you never heard someone could back from a semester abroad with a fake accent?",
            "Still dresses better than Naka 😉",
            "That’s exactly why I love him, well not the cheating part but everything else is fun",
            "4, what about you? Do you understand what an accent is? Do you understand why so many non native English speakers struggle so much to learn the language compared to other languages? English pronunciations and accents are incredibly diverse and there are more accents in the US alone than you would find across any other country in the world.",
            "You must not talk to very many different people then, or you’re basing that off of the he news, and the way people talk on TV isn’t the same way people talk in real life across the country.\n\nThe way people sound in Chicago is different from anywhere around them. You can travel any direction 4-6 hours around Chicago and there are a variety of different distinct accents in every direction. The way people sound in Chicago, Wisconsin, Michigan, Indiana, central Illinois, and southern Illinois are all different and all unique accents. Even within the unique American accents you have breakdowns, someone from Tennessee and someone from Sourhern Texas sound dramatically different even if they both have “sourhern” accents.",
            "Lmao fair enough",
            "there's barely a difference from how he always talks, you guys are mega exaggerating",
            "Yeah but was it in your adolescence?",
            "His voice slowly morphs into Sagars",
            "could also argue that the chessbrahs only say that about him cuz they are trying to be the center of attention. people will latch onto anyhting unique about a person to bring them down. at least he's not a cookie cutter gen z'er that starts every sentence with the word \"literally\"",
            "And he’s cuter than Naka 😉 and he’s packing more than Naka 😉 and he just has such a nice body 😉 should I add anymore for you?",
            "Oh Boy 🤡",
            "You wasn’t there. That outfit was trash.",
            "Bruh it’s chess not miss universe I don’t care about the outfits 😭",
            "And that’s propably how you look"
        ]
    },
    "I WON AGAINST Shakhriyar MAMEDYAROV'S SISTER!!": {
        "title": "I WON AGAINST Shakhriyar MAMEDYAROV'S SISTER!!",
        "score": 79,
        "url": "https://i.redd.it/m0d25skkl38d1.png",
        "content": "Matched against her for a random blitz game and I could see that the opponent was a WGM. Had no idea it was her until I won the game and googled Turkan Mamedyarova as mentioned on her chesscom profile.\nI'M OVER THE MOON RN",
        "num_comments": 16,
        "comments": [
            "I once shook hands with Anish Giri's father in law's second cousin thrice removed",
            "that's great! congrats!",
            "how is WGM 2050 at blitz, isn't WGM nearly IM?",
            "Honest question, how come Shakhriyar’s sister’s surname ends with an a, while his doesn’t? But that’s a great win",
            "Thanks!!",
            "Probably doesn't play very much online blitz. Her OTB blitz rating is \"only\" 2119, so not a huge amount higher - plenty of players will have a similar disparity between online/otb ratings depending on activity.\n\nShe's also well below her peak in general, all her OTB ratings are about 100 points lower than they were three years ago.",
            "I actually have a plus score against woman masters in online chess. They tend to prioritize serious OTB play. She's about 2200 FIDE",
            "In many countries last names work like that. Some small change between men and women applies on the same last name.",
            "Its a gender based thing in a language. I am not completely sure how it works in Azerbaijan, but in russian language all words have one of 3 genders (male female or middle) female gender words usually ends with letter \"a\" (or with letter \"ь\" indicating very soft sound of previous consonant letter, but its not important for us right now), so for females surname will often end with an \"a\".\nVolkov - Volkova\nIljin - Iljina\nDorofeev - Dorofeeva\n\nSo essentially the same word but different gender.",
            "https://en.wikipedia.org/wiki/Patronymic",
            "Come on man.",
            "Thats not the name of their father, Mamedyarov is a surname. Their father's name is Hamid, that why Shakh and his sisters full names have \"Hamid oghlu\" and \"Hamid qizi\" in their names.",
            "yes, Patronymic surname",
            "Hmm, do you mean that the surname itself originates from the names \"Mamed\" or \"Muhammed\". Then it s true, its a patronymic surname, but that does not explain why Turkan has an \"a\" in the end of her surname.",
            "Same gender rules apply.\n\nOriginates from Mamedyar",
            "Yes, but not because its a patronymic, but because it will work the same for all surnames to which declension can be applied."
        ]
    },
    "I resigned here, unfortunately": {
        "title": "I resigned here, unfortunately",
        "score": 83,
        "url": "https://i.redd.it/mw0gqg3ta38d1.jpeg",
        "content": "",
        "num_comments": 18,
        "comments": [
            "I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n> **White to play**: [chess.com](https://chess.com/analysis?fen=8/5k2/6R1/5pKp/7P/6r1/8/8+w+-+-+0+1&flip=false&ref_id=23962172) | [lichess.org](https://lichess.org/analysis/8/5k2/6R1/5pKp/7P/6r1/8/8_w_-_-_0_1?color=white)\n\n**My solution:**\n\n> Hints: piece: >!King!<, move: >!Kxh5!<\n\n> Evaluation: >!The game is a draw. 0.00!<\n\n> Best continuation: >!1. Kxh5 Rxg6!<\n\n---\n\n^(I'm a bot written by) [^(u/pkacprzak)](https://www.reddit.com/u/pkacprzak) ^(| get me as) [^(iOS App)](https://apps.apple.com/us/app/id1574933453) ^| [^(Android App)](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^| [^(Chrome Extension)](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^| [^(Chess eBook Reader)](https://ebook.chessvision.ai?utm_source=reddit&utm_medium=bot) ^(to scan and analyze positions | Website:) [^(Chessvision.ai)](https://chessvision.ai)",
            "That's rough buddy",
            "Kxh5, if the Rxg6 then it'a stalemate",
            "Is Kxh5 f4 a drawn endgame?",
            "Eric could have been proud, but isn't",
            "As Ben Finegold likes to say \"never resign!\"",
            "What was the time control?",
            "I fell for a stalemate similar to that yesterday\n\nBut I fell for it on a superior platform (lichess) which makes my story more riveting",
            "I'm sure if the opponent was a fellow 1900 he would not have resigned lol",
            "Rg4 is guaranteed drawn. Rxg4 doesn't work and Rf3 runs into Kg5. Anything else lose the f-pawn as well.",
            "A stalemate",
            "10min, down to 20s here",
            "how? white's rook can still move",
            "Oh yeah sure, i was just assuming the followup would be rook takes rook.",
            "Even then it's not a stalemate. Kxh5 f4 Rxg3 Rxg3 and then white's king can move along the h file but it's clearly losing because the g pawn queens",
            "Not stalemate necessarily, but after kxh4 its’s a draw no matter what black does",
            "Great point, didnt see that",
            "I just don't take on g3. Kxh5 f4 Rg4 Rxg4 Kxg4 and now I'm back in time to stop your pawn, or if you don't trade rooks I win your f pawn. It's a draw no matter what"
        ]
    }
}