{
    "r/ChikaPh Tea Thread": {
        "title": "r/ChikaPh Tea Thread",
        "score": 12,
        "url": "https://www.reddit.com/r/ChikaPH/comments/1dc5jgi/rchikaph_tea_thread/",
        "content": "",
        "num_comments": 1,
        "comments": [
            "gusto ko ng tsaa, matTsaa (matcha)"
        ]
    },
    "[MEGATHREAD] All About Alice Guo (Nationality, POGO Connections, etc.)": {
        "title": "[MEGATHREAD] All About Alice Guo (Nationality, POGO Connections, etc.)",
        "score": 298,
        "url": "https://www.reddit.com/r/ChikaPH/comments/1cxan3b/megathread_all_about_alice_guo_nationality_pogo/",
        "content": "Use this megathread for all manners of discussion regarding the Mayor of Bamban, Alice Guo.\n\nAny further separate posts about related to this topic will be taken down.\n\nThanks.",
        "num_comments": 122,
        "comments": [
            "We should help Sen Risa. \n\nCrowdsource ng iba pang info that can help\n\nMas fluent pa sa Hokien kesa kapampangan?\nAccent clearly shows na hindi sya lumaki sa Pinas\n\nChinese features makes you think that her mother is not Filipino \n\nBuhay pa ba ang parents nya? How about college? Jobs before becoming a millionaire?\n\n\n\nTanong sa PSA, wala bang controls and validation ang records nila? Kelan pumasok sa records ang birth cert nya?\n\nAnonymous naman tayo dito, lets share if we have info",
            "Sa mga inconsistencies na sagot, sa mga illogical na memories, sa mga questionable documents nya.\n\nIsa lang masasabi ko.\n\nGinagago tayo ni alice guo.",
            "My blood boils whenever I see people fawning over her on TikTok. The Philippines is absolutely cooked because so many people are uto-uto",
            "GUO MEANS \"WALL THAT SURROUNDS THE CITY\"\n\nAS IN GREAT WALL OF CHINA\n\nTAPOS GUO SOUNDS LIKE THE WORD \"GO\" IN POGO\n\n# BAKA ALICE GUO IS A GREAT WALL OF POGO?",
            "dapat lahat nang lugar na meron pogo yung mga mayor investigate lahat.",
            "Kaedad ko lang si ante mo Alice pero tandang tanda ko nung pumutok yung Mt. Pinatubo. \n\nKasi di ako nakakulong sa farm.",
            "i think it’s a bit absurd to be taking down individual alice guo posts. since an individual post can reach more audience as compared to just a single thread.  i get that it may be spamming the sub, however i think with this rampant issue going on, it’s very important to continue to spread awareness about her. one day naman this issue will start to quiet down eh so as much as it is in the present, it must be talked about, facts should spread as to remain vigilant and educate fellow citizens! this sub is a great platform to get word to spread around and i think it is a bit selfish if people are hindered to do so. i get that this is just a chika sub however it would be really great if this sub could also be used to its potential and actually contribute.",
            "Watched the whole hearing this morning. Walang sense mga sagot niya kapag pinapakwento yung formative years niya. I reckon shes not a chinese spy pero shes part of a sindicate. Tumakbo ng pagka mayor para makalusot itong mga illegal chekwa na mag business sa pinas. \n\nI think dapat din linisin ang mga agency ng gobyerno panong nabigyan ng legit birth certificate yan? Nakakuha tuloy ng passport and shit para makatakbo for public office.",
            "did y'all see this photo circulating on tiktok? apparently, the red scarf is a Chinese National Symbol. Young pioneers in China wears a red scarf as a symbol of honor and tradition. It also symbolizes their commitment to the revolutionary spirit of the nation.\n\nhttps://preview.redd.it/08nnn1oxgy3d1.png?width=805&format=png&auto=webp&s=c2ea6687ee24beec7195742a83b7fe08b0b964ea",
            "https://preview.redd.it/lhgfyhuhmw1d1.jpeg?width=870&format=pjpg&auto=webp&s=2d79612fdb38d18745d4d520f2c376bca349b46d\n\nanother receipts from sen risa ✨\n\nABS-CBN NEWS: LOOK: Senator Risa Hontiveros presented travel records from the Bureau of Immigration showing that Bamban, Tarlac Mayor Alice Guo traveled several times with her alleged sister Sheila L. Guo.\n\nMayor Guo mentioned in the first Senate hearing that she is uncertain about her family ties with Sheila L. Guo and Seimen L. Guo but later admitted, during the May 22 session, that her father confirmed that they are her siblings.\n\n(Courtesy: Senate of the Philippines/YouTube)",
            "https://preview.redd.it/lkip9wlflw1d1.jpeg?width=855&format=pjpg&auto=webp&s=aebefaeabd03f2dddc334ca189b5408a9fb81320\n\ngame over na si amnesia girl, sen risa has receipts ✨\n\nFROM ABS-CBN NEWS: LOOK: Documentary evidence presented at the Senate probe shows that Angelito Guo and Amelia Leal, the 'biological' parents of Bamban, Tarlac Mayor Alice Guo, have two more children. All birth certificates indicate that Guo and Leal are married, but the dates of marriage differ across the documents.\n\nMayor Guo claimed in an ABS-CBN interview that she is the love child of her Chinese father and the Filipina house help who worked for his family. She also said she was abandoned by her biological mother.\n\nApart from the birth certificates, Sen. Risa Hontiveros also presented a PSA certification that there was no record of marriage for Angelito Guo and Amelia Leal. They also do not have birth registration records.\n\nWith more questions on her personal background, Mayor Guo only said she was not the one who prepared the documents.\n\n(Courtesy: Senate of the Philippines/YouTube)",
            "ok na may malaking issue kay Alice Guo pero ang pinagtataka ko, diba dapat kasama yung comelec sa pagiimbistiga dito?",
            "Feeling ko, TNT from China sina Guo",
            "sa wakas nagmemegathread na rin dito",
            "May [thread si miss scor sa twitter](https://x.com/scorsaguin/status/1793222968698679542?s=46) asking mga followers nya na taga bamban",
            "Anong oras po new episode ng teleserye sa Senado later",
            "Buti naman. Nagmukhang Groundhog Day sa pa julit-julit na posts e.",
            "sabi she was born 1986? so most of her childhood are in the 90s. Batang 90s sya and yun yung gen na masaya ng childhood.. naglalaro ba sya sa labas like patintero tagutaguan? nagmemeryenda ba yan ng pancit canton? nanonood ba yan ng sineskwela, hiraya manawi at home along da riles? pinapakinggan nya ba si jolina, britney spears and spice girls?? ang daming memories nung 90s!! yung gen nga ngayon ang wala memories dahil ang masasagot lang nila ay ipad!",
            "Sana i-order nila ng CircleDNA test pra magkaalaman na ng ancestry. Ang sus nya talaga, walang mga core memories. Hahaha",
            "ipopost ko sana yung video dito…kaso bawal dahil may megathread na dito\n\npero btw, pinagsalita yung amnesia girl ng kapampangan at hokkien sa senado…konti daw alam nya sa kapampangan\n\nhttps://preview.redd.it/q46iheo9ky1d1.jpeg?width=1125&format=pjpg&auto=webp&s=13b9815d3c366113f52412d7b78f328048f7590b\n\nvideo link: [https://vt.tiktok.com/ZSYF1EE4w/](https://vt.tiktok.com/ZSYF1EE4w/)",
            "Oo sana lahat ng pics na evidence dito na din para isang library na.",
            "https://preview.redd.it/r4dfrfja0x1d1.jpeg?width=1125&format=pjpg&auto=webp&s=c5b567fd249e1b5b65767a38dde9b93b4cd13e5f\n\nayan na…..new video from sen ri\n\n[https://vt.tiktok.com/ZSYNvKw88/](https://vt.tiktok.com/ZSYNvKw88/)",
            "https://preview.redd.it/rd1fdfcj3x1d1.png?width=1080&format=pjpg&auto=webp&s=b13ad4ecc071af57799702389e45f8f68346da88\n\nMga Shan Cai simps, may pag-asa pa kayo!",
            "https://preview.redd.it/l7x61aug9n7d1.png?width=1719&format=png&auto=webp&s=958c07c5be182605c085ad871cb19e1171f3a768\n\nThis was posted on August 30 and she was called \"Pig\" which might have been a typo for \"Ping\"\n\nSo, siya nga?",
            "https://youtu.be/Cr1CKDk6RaU?si=0I59S_IewFkPQMQ1",
            "Hi! Could someone link the full versions of the hearings? I was looking for the first hearing kaso natabunan na ata sa youtube huhu",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "Si Bong Go ang tatay ni Alice Guo",
            "How about info on her siblings. They have PSA records. There’s a likely chance they carry PH passports. \n\nIt would be interesting to hear if they also speak Tagalog with the same accent, or whether they have a command of Tagalog at all.",
            "some of these were already addressed in the senate hearing today",
            ">Mas fluent pa sa Hokien kesa kapampangan?\n\nStupid assesment, there are still chinese born here with an accent, especially if they lived their developing years speaking in chinese. Stories of parents getting pissed their children starts speaking tagalog are not uncommon.",
            "Not sure about fluent sa hokkien. Her intonation is kinda meh.",
            "Honest curiosity - ngayong nalamang nagsisinungaling siya repeatedly, hindi ba pwede na siya dapat makasuhan ng perjury for stating lies?…. ideally? Haha (amongst other things na rin)",
            "Parang may pinagtatakpan siya",
            "[removed]",
            "witty ka diyan",
            "Paano kung i wordplay natin name niya. Like All Lies Real Go, Angel ito Go. I am A real",
            "Yung Mayor daw ng Pangasinan na linked kay Alis",
            "Agree!",
            "Iyan din iniisip ko kasi mas likely iyan kesa sa chinese spy. And tbf, mas madaling i-ask yung mga Duterte about politics in the Philippines kesa magsend ng spy na tinuruan pa talagang mag Filipino.",
            "Ang sabi nya before ay hindi nya maalala kung singapore o malaysia ang travel nya at hindi daw niya kilala yan si sheila l. guo. Isang kapatid lang daw ang kilala nya na may chinese name at nasa china na.\n\nthis alice guo is making a mockery and a circus of our senate. hindi pa ba pwede ikulong ito for contempt dahil sa patuloy nya pag-sisinungaling? Sen. Risa has already implied in the previous senate hearing that alice guo was not being truthful.\n\nBilib din ako dito kay Sen. Risa dahil ang haba ng pasensya dito kay alice kahit very obvious na ginagago na lang tayo.",
            "gagi nakakainis lang ang daming oras sinayang ni jingoy sa pagtatanong ng useless questions sarap ipatalsik",
            "itinanggi na kilala nung nakaraan, ngayon nahahalungkat at ang magaling na palusot at ayaw daw madamay. let her dig her own grave.",
            "https://preview.redd.it/99lpf4hmlw1d1.jpeg?width=847&format=pjpg&auto=webp&s=d18b968eb6980bb124360aedabd2a8290418c06b",
            "Glorified clerks lang ang comelec",
            "[removed]",
            "Parang sila yata yung iniimbestigahan. Buti nga na clear nila kung nao mangyayari kung sakali mawala sa pagka mayor si Alis.",
            "Tinanong siya ni Sen. Risa, kung member ba daw siya ng Fujian gang na kasosyo ni sa Negosyo.",
            "[removed]",
            "palaruin ng 10-20, tapos patintero😂 Pagsalaysayin ng favorite afternoon show or dubbed cartoon, imposibleng di nanood ang mga helpers sa farm ng Marimar, Gimik or TGIS! Since pinalaki ka ng mga helpers sa farm, sige nga ano ang favorite pocketbook nila?",
            "Ancestry/genetics != citizenship\n\n\nOne can be 100% Han Chinese or 100% Indian and still be legit Filipino\n\n\nThey should look further into her parents backcground esp her father. May duda ako sa mainland pinanganak si Mayora tapos smuggled lang sa Pinas nung bata siya",
            "ancestry is different from citizenship bruh",
            "r/2philippines4u",
            "[removed]",
            "[removed]",
            "[removed]",
            "di ko rin makita to, kahit yung date man lang para mas madali i-search",
            "Hi /u/low_profile777. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/No_Ad4767. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/Rich-Comfortable-955. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/SnooWoofers7565. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/iguanaalawi. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/SoftCoat2911. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/Individual_Sort_517. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/Funkoprotect. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/Prestigious-Cover-48. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/saysuuuuu. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/i1na8Key3-14. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/seacoralaquamarine. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/purplegirlyyy. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/Annual_Tale_4339. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/iguanaalawi. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/Acceptable-Rich-1664. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/Advanced_Ad_1390. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/Advanced_Ad_1390. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/Acesandpandas111. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            " Go is Wu in Mandarin",
            "![gif](giphy|MncRccQYx7LVu)",
            "Gagawa ka na nga lang ng issue, fake news pa.",
            "Baka nga di pa marunong mag Kapampangan.",
            "[removed]",
            "Cited for contempt ang madalas na ginagamit nila for repeated lying. Pero oo nga, ang haba ng pisi nila dito kay alice gou pero sa ibang naimbetahan ng senate ay napapa-detain nila dun. Baka kasi hindi power tripper itong si Sen Risa at dinadaan pa nya sa process whereas kung iba senador yan, binggong-bingo na yan si alice.",
            "Ang tatanga na lang talaga ng mga taga-Bambam kung patuloy pa rin nila sinusuportahan ito. Local chief executive nila manggagantso.",
            "Hi /u/RandomSnippets. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "[removed]",
            "Mali yung manner ng tanong Niya parang chismoso yung dating. Okay na sana yung info about the mayor na namamahala din daw ng POGO niya, at tumulong noong na raid sila. Si Dong C.",
            "Hi /u/tito_gee. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/Worth_Motor_2787. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "🤣🤣🤣",
            "My theory too. Mukang smuggled nga siya from 0-14 yrs of age.",
            "Here's a sneak peek of /r/2philippines4u using the [top posts](https://np.reddit.com/r/2philippines4u/top/?sort=top&t=all) of all time!\n\n\\#1: [New isekai just dropped 🇨🇳➡️🇵🇭 ](https://i.redd.it/e44lcpjw5tzc1.jpeg) | [188 comments](https://np.reddit.com/r/2philippines4u/comments/1cpitzk/new_isekai_just_dropped/)  \n\\#2: [Isekai](https://i.redd.it/k4jm38jpy91d1.jpeg) | [76 comments](https://np.reddit.com/r/2philippines4u/comments/1cvb3o8/isekai/)  \n\\#3: [Catholic school student L's](https://i.redd.it/9smynsawyy9c1.gif) | [113 comments](https://np.reddit.com/r/2philippines4u/comments/18wij0i/catholic_school_student_ls/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
            "Hi /u/Rich-Comfortable-955. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/Rich-Comfortable-955. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/secretlyy_evil. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/CompetitivePeanut433. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Birthday cake lang katapat nila.",
            "Sa mga taga Bamban kasi is nagsawa na sila sa mga dynasty ng tumatakbong Mayor as in mga political family nalang na wala naman nagagawa, kaya nung sumulpot yang Guo na yan, nagustuhan nila for a fresh start daw tapos malaki nga naman pagbabago ng Bamban ngayon kasi it's more civilized na",
            "Alangan! Kung ikaw naman bigay ka ng bigay syempre bobotohin mo cya rin cya diba?",
            "Hi /u/CompetitivePeanut433. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "real lack of professionalism talaga",
            "In the first place, sino din ba ang bumoboto sa mga political dynasty na yun? Wala man lang lumalaban na kahit independent kung gusto nila ng fresh start?\n\nOk, kung umunlad at umayos nga ang bayan nila kumpara sa previous administration. That's good. Dapat lang gawin ni Mayor yan bilang elected official. Dapat makita ng mga mamamayan nya kung saan napupunta ang binabayad nila sa cityhall, sa mga taxes.\n\nPero hindi purke't may nagawa sya ay magbubulag-bulagan na lang sila sa mga mali o questionable character ni alice.\n\nAno yun, tinapalan na lang sila ng pera para manahimik sila para hindi pansinin yun pogo, yun involvement nya sa mga dubious personalities. \n\nHindi ba pwede pumili at suportahan yun maayos at malinis na elected official?",
            "Maari nung umpisa pero Ngayon nalalalaman na questionable ang nationality nya at mga links nya with fugitives at sa paulit ulit nya pagsisinungaling. Ang tanga ko na talaga Kung patuloy pa rin ako susuporta sa kanya.",
            "Kaya tuloy pinagttripan nalang silang dalawa ni bato ni Morales at Enriquez sa kabila g Hearing🤣🤣🤣",
            "Stomach politics ika nga, for many Filipinos mas importante yung nasa tiyan nila kesa morality nila. Mas pipiliin ng average pinoy ma bigyan ng P500 kesa mag antay na uulan ang bayan nila. Plus yung mahihirap yung pa ang todo mag aanak non stop. Kung ako talaga ma proprovide talaga ako ng free vascetomy and ligation para mabawasan ang kahirapan.",
            "And somehow, pabor sa mga kurakot natin dahil may mga mahihirap na madali nila utuin or bayaran. Tapos mag rereklamo sila dahil kurakot yun binoto nila. It's a cycle and it must be stamped out. And true ulit na kung sino pa talaga Yun walang wala sa buhay, sila pa itong anak Ng anak.",
            "Kung ako pulitiko, mag aaprove ako ng abortion and birthcontrol. \n\nTapos kung mag hihingi k ng financial aid sa government, mandatory ang vasectomy and ligation. \n\nCruel ba? Mas cruel ang magaanak tapos todo mag hirap sa buhay at yung anak na iluluwal mo."
        ]
    },
    "Denise Laurel": {
        "title": "Denise Laurel",
        "score": 1023,
        "url": "https://i.redd.it/frvhs0kfg18d1.jpeg",
        "content": "First time watching Denise Laurel's vlog and ang dami nagssend ng gifts sa kanya the sabi niya \"Stop sending gifts guys, keep your money\"\nBilib talaga ako sa babaeng to huhu napaka-purr na tapos pati dito halos nababasa na napaka-genuine nga niya. I stan this 👸!!!",
        "num_comments": 149,
        "comments": [
            "ito talaga since PHR super girl crush ko to",
            "Eto talaga yung natural na plump lips",
            "Ang laki na ng baby niya!!! Sobrang tangkad.",
            "Sobrang ganda nito in person at ang bait! Nakita ko to sa Ortigas di ko maalala kung sino sya so napatitig ako kasi sobrang ganda nya. Nung narealize kong si Denise yumuko ako, tapos pagtingin ko ulit nginitian nya ko. Huhu. Goddess.",
            "That girl definitley has class. Never heard any negative write up about her",
            "Her face and her talent. Laurel e.",
            "Ang issue sa kanya gamit na gamit siya sa adobo.",
            "I know someone who knows her and the Laurels, mabait daw talaga si Denise, like siya yung pinakaclose niya. And again, musical talent runs in the family. Talented marami sa kanila.",
            "Sa Pangako sayo palang nila Echo at Tin nagustuhan ko na sya. Sya yung ank dun ni Ina Raymundo na spoiled brat.",
            "Why are they sending gifts to a rich kid? What are they hoping to get from that?",
            "Vampire of the philippines next to ina reymundo they age beautifully",
            "Ang ganda and cool nitong si Denise since Click days niya.",
            "She's really so pretty.",
            "Sakanya ko unang kinuwestyong gender ko eh hahahahhahahha",
            "Sobrang Laki at ganda ng Laurel Mansion nila sa San Pedro Laguna, Madalas kami magbike don kasi maganda view.\n\nDon mo marerealize sobrang yaman talaga nya. Tapos sabi nung bantay don sobrang bait daw nyan ni mam.\n\npag nauwi daw sila may dala rin sa kanilang pasalubong. \n\nMay mga makukulit nga lang na gusto pumasok sa loob ng mansion. Akala ata tourist spot.",
            "Hanggang ngayon hindi ko pa napapatawad nambuntis dito. Super on the rise siya kasi nun when she got pregnant. Nakabalik man siya but it wasn’t the same.",
            "GANDANG GANDA TALAGA AKO SA KANYA!!!",
            "naalala ko lang, she’s an ex president’s grand daughter ano? Pres. Jose P. Laurel ata, sya yun di ba? ♥️",
            "PHR era nila ni Rafael Rosell. Kakamisss. Si ante parang di tumatanda.",
            "May kamaganak kami na naging head maid sa kanila. Decaded nagwork sakanila and talagang turing sakanya parang pamilya. \nNung nagretire yung kamaganak namin, binibigyan siya ng bahay+ money at tuwing dinadalaw namin yung kamaganak namin na yun, pumapasok  kami lagi sakanila para makicr  HAHAHA. \n\nSadly, namatay na yung kamaganak namin pero  I can attest na mabait din talaga sila.",
            "Ms. D na super nakaka inlove ang lips!",
            "Akala ko si Jenna Dewan.",
            "Nkita ko sya dati, grabe uung mata nya, yun ata yung definition ng tantalizing eyes. Tas naka tulala lng ako sakanya hahahahah",
            "Until now, gusto ko pa rin iyong version nila ni Kris Lawrence ng \"I Will Take You Forever.\"",
            "Curious lang ano yung specific na tawag sa kulay ng lipstick nya?",
            "She’s pretty parin!",
            "I love her! Very natural at hindi pilit. Plus totoo ung lips niya diba?",
            "Worked with her in a couple of teleseryes, one of the kindest actresses in the industry.",
            "like Karylle, isa din to sa tantalizing yung ganda",
            "Ito yung maganda na bombshell, sobrang hot",
            "I will~ take you~ foreveeeeerrrrrrrrrrr",
            "One of my girl crush 😍",
            "Grabe ang ganda nya pa din kahit lumipas na panahon. Ang laki na din nung anak nya pero parang dalaga pa din sya. Crush na crush ko to si Denise lalo na nung time nya sa precious heart romances",
            "The Laurels are one good genes",
            "Girl Crush. Her Aura is so light and full of Optimism.",
            "Nakita ko to sa shang kasama anak nya, nakain sila. Ayy napakaganda nito at ang liit ng fez.",
            "Great actress and singer, super ganda at de buena familia. Anobe pinakyaw na lahat ;)",
            "Sya Yung naiimagine ko sa kada PHR novel na may haciendas na theme 😂 tapos si Rafael leading man. Hahahah",
            "Napakagandang nilalang 💕",
            "I saw her once sa MOA, grabe ibang-iba yung ganda niya sa personal.",
            "Kamukha niya si Aiah ng Bini talagaa.",
            "What did she get done besides the lip fillers?",
            "[removed]",
            "[removed]",
            "Crushable talaga to e",
            "I love her. Super pretty niya.",
            "[removed]",
            "Parang di tumatanda\n\nAng laki n ng anak nya pero sya ganun prin",
            "One of my showbiz crush talaga si Denise 😅",
            "I love her!! She's so pretty and kind and in my experience, very accommodating to people requesting pictures.",
            "[removed]",
            "[removed]",
            "I hope mabigyan ulit siya ng break kasi iba talaga yung PHR era niya.",
            "my favorite 😍😍😍😍😍",
            "Eto yung kontrabida dun sa isang PHR series na Paraiso ang ganda ganda talaga nya... halos di mo sya magawang kagalitan kasi ship mo pa sya compared sa bida lol",
            "Super pretty! Napaka alta ng beauty.",
            "Itobtalaga umpisa pa lang girl crush ko na. From LAUREL clan pa yan. Bilib talga ako.",
            "Grabe ang face card ni ate gurl. Sobra ganda pa dn. 😊",
            "[removed]",
            "May nakita akong tiktok nya na parang “bantayan daw” yung anak nya while mag washroom ata sya. Ang cute nila mag ina. Ang polite ng anak nya",
            "[removed]",
            "Fave namin ng ate ko yan. I’ve seen her several times at Powerplant, she is really bubbly and bungisngis kasi always nakasmile.",
            "Gandang ganda tlga ko kay denise!!",
            "Gandang ganda ako sa kanya simula nung una sya lumabas sa tv. Napakaganda ❤️",
            "Who is she dating? Or married na?",
            "I saw her in Jamba Juice BGC. She's so pretty and approachable kasi nagpa picture sa kanya staff ng Jamba. Pinagbigyan nya, all smiles. Maliit lang face nya, at mga around 5 ft lang na babae.",
            "One of the most beautiful local celebrities, inside and out. Also, talented pa. Sobrang galing nya magkontrabida. I really liked her doon sa movie nila nina Angelica, Dingdong, and Paulo.",
            "She interviews so well. Unlike the mainstream interviewers, meh.",
            "crush ko yan. grabe katawan kasi yung tipo ko talaga.. ang ganda pa at napakabait..",
            "Kung hindi nilagay name noya sa title, hawig niya diyan si Elisse Joson. Ang ganda pa rin ni Denise. Hot momshie pa!",
            "timeless beauty talaga✨✨",
            "This woman has an amazing voice, very kind, and treats the TV staff well. I was an extra years ago in one of her dramas with Jodi Sta. Maria and Patrick Garcia. Super bait nya and she liked to vocalize in between takes. She smiled a lot at the extras. Nakakatawa sya when she asked her P.A. if she had to wear a bigkis over her dress. She was referring to the obi or belt. 😂 \n\nShe's much nicer and more beautiful than Jodi.",
            "Para syang si Selena Gomez sa ss na 'to.",
            "pareho nong kay Selena Gomez, naglive sa tiktok, di nya alam yung para saan yung gifts, natutuwa sya nong una kasi akala nya pang filter lang, tapos bandang huli nalaman nya na about sa gifts, pinahinto nya yung live nya ",
            "Dito ako na-starstruck nung nakita ko sa trinoma way back many years ago pa. Nakita ko siya from a far talagang iba ang aura kaya napalapit ako (safe distance) just to admire her.",
            "[removed]",
            "Napanood ko siya sa phr You're mine, only mine ang ganda niya. May saya nila tignan dati ni Will Devaughn.",
            "Di ako nag fo follow ng babae sa tiktok pero naka follow ako dito, crush ko to dati pa eh.",
            "great grandfather pala niya si Jose P Laurel",
            "ganda nya tlga 🥰",
            "Hahahaha may random issue ako naalala kay Denise, yung natanggal swimsuit niya sa pool?? May nakakaalala ba nito? Napanood ko sa tv patrol dati hahaha",
            "balimbing to eh. maitim na lobo na nag unite with the maputi na lobo pero nakigpag team up rin pala kay sandrino. 🤭",
            "Sana hindi totoo na si Rafael Rosell tatay ng anak nya. Pakakups nun e.",
            "Siya ba yung nasangkot sa issue ni Vhong Navarro?",
            "Akala ko si Arci Muñoz",
            "Sobrang bagay sila ni Rafael Rosell sa show",
            "Sila ni Rafael di tumatanda. Hoping that they could do a movie or online show na rom-com. Viu, Prime, Netflix beke nemen",
            "Pinapanood ko yung Pintada talaga dati🥹",
            "She's so gorg and parang ang low-key lang nya talaga. Plus I've never heard anything negative about her",
            "Omg same!! Dito ko siya naging girl crush!! Di pa din ako nakakaget over sa tambalan nila ni Rafael Rosell!!! Hahahahaha",
            "Huyyy ako din and I was 12 siguro that time and I love looking at her face! so pretty and the lips din!! Super ganda parang si Angelina Jolie 😭😍",
            "[removed]",
            "Yes! And her features and bone structure are yung tipong many actresses are getting procedures to achieve. Legit one of the most beautiful actresses in Ph, not sure why her beauty is so underrated 🥺",
            "True dbaa bago pa umuso meron na agad sya hehehee",
            "Parang may dagdag din compared sa old photos niya pero it really suits her!! Di gaya sa iba na oa",
            "Teenager na anak niya, mga 15-16 ata",
            "[removed]",
            "Yes, met her in an event. She was is only local celebrity that is drop dead gorgeous in person. Her kindness and beauty talaga ay goddess level!",
            "I can vouch for that!",
            "Supreme!!! 1000/10",
            "Alam mo ikawwwwwww yung ngiti namin sa comments naging tawa e.",
            "WHHAHAHAH",
            "Wahahahahhaha Ang witty mo",
            "[removed]",
            "[deleted]",
            "And it's still a question to me (and maybe to others) bakit hindi siya nagka-music career from ABS-CBN.",
            "Yes I remember her lumabas doon. Kamusta na raw mga likod natin? Hahaha. \n\nPero tumatak sa kin yung sa \"Rouge\" na parang series ng MTV Asia, tapos kasama pa niya si Mariel Rodriguez (when she was still cool char). Tapos yung sa \"Encantadia\" where she played Marge na inaapi si Lira played by Jennylyn. Then yung role niyang Kalay na best friend siya ni JLC sa \"Maging Sino Ka Man\".",
            "I think way talaga ‘yun ng fans to show their appreciation. Kaya ayun sinasabi niya na they don’t need to give her gifts.",
            "ikr. sinabihan na nga sila ni ate mo denise na no need mag send eh",
            "I think may option to disable receiving gifts eh. Dba?",
            "[removed]",
            "Twice pa silang naging mag-ina sa teleserye, sa OG \"Pangako sa Yo\" (si Ina ang lumabas na 2nd wife ni Eduardo Buenavista played by Tonton Gutierrez) and sa \"PHR Presents: Midnight Phantom\" (actually si Ina talaga ang kinahumalingan ni Rafael, kaso he got spurned and initally act of revenge ni Raf na ma-fall sa kanya si Denise).",
            "Ang pagkaka-alam ko may museum rin kasi dyan nung lolo niya na si former VP Salvador H. Laurel kaya pinupuntahan.",
            "Yes, great-granddaughter siya ni Jose P. Laurel at apo siya ni ex-VP Doy Laurel.",
            "[removed]",
            "Hi /u/Glamourisse. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/After-Army9269. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/ubraindead. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/fabhersh. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/PutExpress888. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/Playful_Breadfruit97. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/FiibiiBee. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/Ayem_u. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Issue ba dapat Yun? Kala ko may kalokahan siyang ginawa",
            "I miss them huhu sana i-cast sila if ever may ph adaptation ng isang romcom kdrama",
            "I love them both! Kung meron man akong crush na local celebs, sila yun! Nag cucutting pa ako before para lang mapanuod yung PHR nila haha",
            "[removed]",
            "[removed]",
            "Hi /u/reesechoux. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "13! Haha still a baby for her",
            "Hi /u/Plus-While-757. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/Caffeinated-Mens-271. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Dahon ng laurel hehe",
            "She had for quite a time meron sa YouTube ng ABS star music plus pinapakanta siya sa showtime dati.. pero imo mas grinoom siya as actress og daytime series kween after noontime shows.",
            "May salonpas na palagi sa likod. Hahaha Oo nga nakalimutan ko sya dun sa Encantadia. Ang ganda niya talaha evesince e. Hindi tumatanda.",
            "Same sa rogue. Grabe, naalala ko hinype yun na malaking project nga kasi parang collaboration ng countries sa mtv asia. Tapos nakakapinoy pride na 2 pinoy, yung isa siya pa main character (denise laurel of course).",
            "Baka di niya po alam since di techy ang ate mo.",
            "Hi /u/AnnualNormal. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Yes, Actually natanong ko din yan. Kailangan daw i paalam muna sa San Pedro Tourist Office.\n\nPero ginagawa ng iba gusto walk-in agad. Akala katulad don sa kawit na pwede labas pasok.",
            "Hi /u/Vast-Attention7224. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "[removed]",
            "Hi /u/Holiday_Wasabi_9968. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/PutExpress888. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Cute nung video Nya na pls look after my son 😂 nag vlog takeover si kiddo",
            "What?! that boy is a 13 yr old?! And as far as i know currently 6'1 yung bata, jusqqqq",
            "Literal ginroom sa mga sexy series. Yun lang yung mga tanda ko na palabas niya 10 yrs ago, before ako nagstop manood ng local tv",
            "Hi /u/jigglyjigger. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "I've read your comment, yes po meron kasi may scar ata yun sya because of some tragic event parang nasunugan ata yun.",
            "Yes huhu!! What more pag 18 right??"
        ]
    },
    "So ayun na nga, Certified Flop,mga Mars! Meron bang na-shock? ": {
        "title": "So ayun na nga, Certified Flop,mga Mars! Meron bang na-shock? ",
        "score": 175,
        "url": "https://i.redd.it/pigv9mhes28d1.jpeg",
        "content": "",
        "num_comments": 115,
        "comments": [
            "Mahal na rin kasi ang sine ngayon so kung manunuod Ka, doon na lang sa quality.",
            "Water is wet.\nThe sky is blue.\nThe sun rises in the east.",
            "Aantay ako kung tatahol yan, mukang always blame gusto nya gawin eh.",
            "Meron pa syang isang movie na parang copy cat nung horror movie sa hollywood na The other side of the door.",
            "I feel sorry sa other actors na nadamay kay Xian Lim. On the other hand, mukhang pangit talaga yung pelikula...",
            "Monoblockbuster ka talaga, Xian!",
            "Nakita ko trailer niya dati, parang pang-tv na movie yung dating. 😬\n\nIt didn't help pa na may nakakabit na issue kay Xian. Regardless of what happened sa kanila ni Kim, parang safe to say na turned off sa kanya yung marami so....",
            "kung ako sa mga producer, kung maraming issue yung artista na gagamitin nyo at walang solidong fanbase, makipag partner na lang kayo sa mga streaming platform kase magfa-flop talaga yan sa sinehan.",
            "Karma ni Xian Lim yan buti nga...",
            "Dinamay pa si Coleen lol",
            "Tbf hindi narin naman practical manuod ng sine ngayon tapos low quality show papanoorin. After ilang days may mga pirated version na iyan",
            "Well deserved for Xian",
            "I guess bringing up his past relationship with Kim didn't help at all.   \n  \nIt might have even made things worse. hahaha",
            "saan kaya nakukuha ng confidence ang producers ng mga movies ngayon? Itapat ba namn sa inside out 2 💀💀💀, also confident sila na kikita sila?",
            "From a critic POV, its too clichèd. Kung pinoy horror film lng din Feng Shui na lng.",
            "I wonder kung naka magkano",
            "Curious lang po. Yong Fruitcake nina Joshua G. kumusta? Diba sabay sila nag premiere nito?",
            "Dasurv ni Xian (Gaza) Lim yan! Sana malaki ipon nya kasi flop era na siya.",
            "I don't think it flopped because of Xian. Mukhang pangit lang siguro talaga yun palabas coupled with the changed landscape of cinema post pandemic.",
            "Aside from Xian Lim’s issues, none of them actually have much star power to persuade the people to watch. I don’t even think regular people who don’t keep up with showbiz news would know any of them. I don’t even know who the other two are.",
            "Sana straight to streaming platforms na lang. Pero parang di rin ata bumenta sa execs ng Netflix or sa Amazon Prime hehe.",
            "hmm, sino kaya sisisihin kung bakit nag flop..?\n\nbaka trending nanaman si kim chiu dahil may mag-iingay..",
            "Bagsak talaga local film. Tapos hated pa si xian ATM. So this is expected.",
            "Sino ba ksi producer nyan? Talaga bang naisip nya na kikita yan pag si Xian Lim( kahit alisin na yung isyu nila ni Kim Chiu) ang bida.",
            "I wouldn't waste my money on this movie. Antayin ko na lang may mag upload nito sa YT. Sa mga nakapanood nito (kung meron), what's your take?",
            "Xian lim and his co-artist na cast must be embarrassed asf HAHAHAHAHA, may \"pinaghirapan po namin to\" pang nalalaman si xian sa pagpromote niya ng movie during mall shows 😂",
            "Kahit naman wala yung issue nila ni kim expected na yan.",
            "I don't want to sound very bias but, sa totoo lang ang daming magagaling na artists sa GMA pero sobrang pangit ng script ng mga teleseryes and movies nila. When it comes to these, gawang ABS-CBN talaga mas prefer ko. Hindi man lahat (wala naman perfect) pero karamihan sa mga palabas nila solid ang script. May patutunguhan yung story, napapanahon at hindi tulad sa GMA naka-focus lang sa pagiging war freak personalities ng mga characters (oo matapang tayo pero napaka-walang class naman ang image ng Pinoy pag ganun) na puro sa sampalan, sabunutan at sigawan lang umiikot yung story.",
            "Nega si Xian ngayon. The other 3 actresses doesn’t even have a big fanbase, medyo expected na ito. 😅",
            "as expected.",
            "binabalita pa ba to 😂 alam naman na ang outcome the moment it was announced na he was doing a film lol\n\nsucks for the other cast members and prod people, though",
            "R-18 ba naman",
            "Xian Lim who? 🤭",
            "Sinabay pa nila sa Inside Out 2. Syempre Inside Out 2 pinanood namin kesa dyan haha.",
            "Sisisihin niyan si Kim HAHAHA",
            "Malaking factor din talaga yung negative publicity about Xian Lim. Imbes na movie pinopromote, si Kim Chiu lage topic.😒",
            "Number one factor dyan yung mga bida. Why is the management even making sip-sip kay Xian at patuloy na binibigyan ng project when everyone knew na di na sya kakagatin ng masa.",
            "Good, wala ng kukuha kay xian lol.",
            "That means si Xian lang ang may gusto sa kagwapuhan nya. Ung ibang tao lapakels hahahhaha",
            "Endi tlga kikita yan akala kaz ng Xian Lim na sikat na xa kaya anlakas ng loob makipag hiwalay ki Kim. Ngaun nia malalaman na wala xang kaamor-amor at c Kim lang humatak sa kanya. May attitude din yan sa tunay na buhay kaz make up artist ung sister q dati sa ABS-CBN. Demanding daw yan lalo sa buhok nia. Ang mabait daw cna JM de Guzman at Papa P.",
            "kawawa mga chix nyang kasama. kupal kase sya e nasamay pa tuloy sila",
            "Nahila lang talaga ng pangalan ni kim to eh. Halatang pilit lahat sa tao na to.",
            "This would have flopped regardless of xian’s issues. Wag nating overestimate impact nya.",
            "GMA Pictures at VIVA Films, lagi talagang flop movies nila. Yung Viva ang daming releases pero mostly flops",
            "Downgrade si coleen. Datin siya bida sa movies starcinema. Ngayon support na lang siya sa movie ng mas starlet pa sa kanya. Never din naka graduate sa pagiging bold star kahit may anak at asawa na.",
            "mahal ng cine dun nako manonood sa may quality.",
            "May pa-\"bad publicity is still publicity\" pa silang nalalaman haha",
            "![gif](giphy|7k2LoEykY5i1hfeWQB)",
            "Actually ako ang na-shock at binigyan pa siya ng movie. 🤣",
            "Sino yung mga kasama niya sa movie?",
            "[removed]",
            "[removed]",
            "![gif](giphy|3kzJvEciJa94SMW3hN|downsized)",
            "[removed]",
            "[removed]",
            "Anong meron kay Xian Lim? Out of the Loop ako",
            "[deleted]",
            "Almost makes me want to hate watch it lol, may nanood ba dito hahaha",
            "Okay, ngayon ko lang narinig si Xian Lim, anong meron sa kanya?",
            "Sayang effort nung Sanya and her fans..nka ilang padlock screening pa naman sila",
            "I think Fruitcake din naman e flop. Masyado lang talaga kayong nega kay Xian since iniisip nyo pa din na sya ang reason ng break up kahit hindi naman. 🙄\n\nInaasahan ko na madownvote in 3….2…..1! 😂",
            "Pabigat kasi yung 3 na babae. Need ng name tag",
            "Shitty naman kasi ng quality ng GMA Films - di pa sila marunong magpromote. Lagi negative controversy lang ang dala. \n\nDapat ang Star Magic i-reward si Kim ng isang film. lol.",
            "And yung walang Xian Lim. Charot",
            "Sino kayang sisisihin niya this time? He does love pointing fingers at just about everyone except himself.",
            "Kumang Thong yata ang title",
            "🤣🤣🤣",
            "May nanalo na! 🤣",
            "Pero honestly, dalawang movie na rin ni Coleen ang pinull-out sa mga sinehan. This one and yung isa na tandem nila ni Diego Loyzaga.",
            "Sa true. 😅",
            "Kulto ni Kim",
            "ako naman Sigaw pa rin ang gusto ko.",
            "Parang flop din? Walang balita e.",
            "[removed]",
            "Truth. Kahit walang issue si Xian mukhang lalangawin pa rin yan",
            "Lol same.",
            "hindi po yata nagrereddit ang mga langaw",
            "Kahit libre yan sa youtube. Hindi ko pa din pag aaksayahan ng oras panoorin. Sayang oras ko. 😅",
            "Kanino  sinabi ni Xian yan, sa mga monobloc? 🤣",
            "Maganda concept ng serye nila pero sablay screenplay.",
            "And why do GMA always pushes Sanya? What’s something special about her ba? Same with the other girl Faye. It’s a bad move GMA.",
            "Hi /u/Cha1_tea_latte. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/rebeccavarnerj. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/darkgrxy. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Hi /u/GKCMO. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "I'm confused. Bakit... si Alden? Huh?",
            "Tf? Just because this movie was part of gma you're gonna add Alden up to this?",
            "Bakit siya nasali dito?",
            "[removed]",
            "To remind you naman, GMA films produces award winning films. Jose Rizal, Muro Ami, Firefly. \nThis movie might not be that good but to say na GMA fils are shitty is too much. Collab din yan with viva films.",
            "[removed]",
            "Wala din naman kasing hatak. I mean, di naman talaga sya considered na big star kahit nung nasa ABS pa sya.",
            "Coleen: ok lang, basta bayad ako😅 \nHahhaa",
            "Oh never heard that movie with Diego but gusto ko ung Mia na movie Nya and definitely she’s better than xian",
            "Red flag din pala yung katandem. Lol",
            "Yes and wag kang lilingon!",
            "600k kinita ng mga filipino films that opened last June 12, total for these films on opening day",
            "Hi /u/Sweet_Carry_7135. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Isama mo na ang mga monobloc! 🤣",
            "🤣🤣🤣🤣🤣",
            "🤣🤣🤣",
            "Parang pa-sikat na sana (ulit, since encantadia) si Sanya noong nakipagtambalan kay Gabby C. tapos biglang nawala ulit ang ningning.",
            "In fairness naman kay Sanya, almost all of her TV shows are successful since Encantadia. Halos lahat lumalagpas ng 3 months. \n\n\nKaso nga lang, may tinatawag tayong movie stars at TV stars. TV star sya as most of GMA's talents.\n\n\n GMA's decision to stop producing movies 10 yrs ago was really a massive mistake. DongYan nalang ata ang maaasahan nila sa mga pelikula lol",
            "Hi /u/Cheap-Excitement-591. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "AND, so yung awful films nila, bigla nalang natin makakalimutan. Sobrang baba ng hit ratio ng GMA films regardless of what can you say about Jose Rizal, Muro Ami, Firefly, at The Road. Literal na bottom of the barrel. Di man lang ayusin ng kaunti yung romcoms nila. Sorry not sorry.",
            "Hi /u/sophiaellev. We are removing this post due to the following reason:\n\n- Less than 200 combined karma\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChikaPH) if you have any questions or concerns.*",
            "Yes but compared sa mga kasama nya she got better film history . Edit: Di siya ganun ka galing umarte but she’s better than xian.. di pa siya nag love team I think",
            "Nakamagkano ang fruitcake?",
            "Wow. Holy crap. That seems low to me but to be fair, di talaga ko nanonood ng sine. Ig those numbers are so-so ba or what?",
            "Dinumog ng monobloc.",
            "Hindi talaga marunong mag handle ng talents ang GMA. Pag lumipat sya sa Dos kikinang yan.",
            "GMA had good romance/romcoms in the 2000s like I Will Always Love You, The Promise, Moment of Love, Till I Met You, My Best Friend's Girlfriend, and One True Love (my opinion though) but after 2010 it's almost like they lost the formula. Kahit yung camerawork and lighting sa ibang shows nila now is so bad na you’d rather turn off the TV na lang. I’ll replay their old shows on YouTube sometimes and their content in the 2000s really was more enjoyable.",
            "'Di ko sure. Pero nabanggit ni Direk Chris Martinez yan and 9M (memory lapse) ata ang opening Inside Out.",
            "I think its low talaga if that's true. Lalo na usual movie budget ay millions. ",
            "Korek.",
            "Cguro, minalas lang dn na kasabayan nila inside out 2."
        ]
    },
    "Janella Salvador sa Pride March 🫶🏻": {
        "title": "Janella Salvador sa Pride March 🫶🏻",
        "score": 87,
        "url": "https://www.reddit.com/gallery/1dls6qo",
        "content": "The woman that you are, Janella 🫶🏻 Honestly, I wish there comes a time na actors/actresses can freely express themselves without the worry of losing projects dito sa Pinas. That’s the only thing na I like sa industry ng US, even an openly gay/lesbian actors/actresses don are treated equally, they are still portraying straight characters. \n\n\n\n\n",
        "num_comments": 14,
        "comments": [
            "its good pero ano ba ang nangyayari sa career ng mga nag-oout na artista sa Pilipinas?",
            "Curious lang. Ano yung 2nd pic? Teleserye? Movie? Ad?",
            "🏳️‍🌈🏳️‍🌈🏳️‍🌈",
            "I pray that she succeeds. She has so much potential.",
            "So proud of her and Jane tbh. sobrang laki ng risk na ginawa nila sa MV ni Janella. They were explicitly portraying sapphic love in a country that still views lgbtq+ romance as either a phase or a sin.\n\nI hope this will open doors for gl and bl shows. Magaling pa naman ang mga pinoy writers when it comes to the romance genre ( and I hope there will be no fetishisation that will happen)",
            "Context? Nag-out ba sya?",
            "May chismis din dati na bi/les siya pero di aprub si Madam Jenine hahahaha",
            "na stuck sila sa gay/lesbian roles. Even mga nagmomodel sa industry, pinapa shut up sila regarding sa sexual orientation para makakuha ng more projects",
            "Depende kung maganda or gwapo.\n\nSa totoo lang gusto lang ng tao ang mga gay/bi/lesbian/trans kapag maganda. Example:\n\n- Michelle Dy\n- Klea Pineda\n- Kevin Balot\n\nBinabash at nilalait ng tao kahit talented:\n\n- Jake Zyrus\n- Vice Ganda",
            "music video ni janella",
            "Depende siguro sa management nila or medyo maluwag lang GMA? Kontrabida roles pa din naman projects ni Klea Pineda though hindi nakakahon na lgbtq+ yung character. And they post updates about her and her partner sa showbiz section ng news nila hehe sana ganun din treatment sa iba...",
            "**Michelle Dee. Vlogger and di naman ata member si Michelle Dy hehe",
            "Thanks!",
            "GMA has been more open for the past years compared sa ABS-CBN we have the dennis x tom then glaiza and rhian."
        ]
    }
}