{
    "June Banner: Juneteenth": {
        "title": "June Banner: Juneteenth",
        "score": 49,
        "url": "https://www.reddit.com/r/Christianity/comments/1d5pa8i/june_banner_juneteenth/",
        "content": "Disclaimer: My goal with this thread is not to belittle or take a side on today's issues. The goal is to showcase a specific celebration as well as Christianity's role in it. These kinds of things are difficult to stay completely neutral on while still making a point relevant to the topic at hand, but I have attempted to do so.\n\nYou are more than welcome to use this thread as a jumping off point for discussion. You are also welcome to use this thread as a simple means of learning some history.\n\nThis month's banner represents Juneteenth. Although the Emancipation Proclamation was issued in the US in 1863, the 13th Amendment was not ratified until December 6th, 1865. Even then, the last slaves were not told they were free until June 19th, 1865. Juneteenth has evolved to become more than just a day of remembering a scar that plagued the United States, but it has become a month to reflect on what it means to be \"free\".\n\nChristianity played a very unique role in the days of slavery as well as the push leading to end it. One of the first names given to June 19th was Jubilee Day. This was in reference to Leviticus 25:8-54. What is described was a festival dedicated to the Lord. The Israelites were to forgive debts, release others from bondage, and even restore some tribal lands. The freed slaves saw this as a perfect representation to their newfound freedoms.\n\nDuring the time of slavery, many slaves throughout the Caribbean islands of Jamaica, Barbados, and Antigua were given a \"Slave Bible\" as to not give them anything that might lead to rebellion. This version of the Bible left out most of the Old Testament. What was left were passages aimed at telling slaves to be subservient. This says something about the strength Christianity holds on those who read Scripture. Slaveholders did not want slaves to muster enough spiritual or mental strength to recognize the strength they had to escape their captivity.\n\nEven then, [The Haitian Revolution](https://en.wikipedia.org/wiki/Haitian_Revolution) happened.\n\nThis obfuscation of the Bible is one of the several aspects of slavery that Christianity has had to wrestle with since the Emancipation Proclamation was signed.\n\nWhile it is clear the main push to continue slavery was for economic gain, a main source used to justify this push was God's word, at least what was presented as His word. This greed was not found only within the political institutions that ran the governments attempting to call for the continuation of slavery. This greed made its way into the hearts of some churches as well.\n\nIn 1838, Theodore Clapp, Unitarian minister of the Independent Unitarian Society, New Orleans wrote:\n\n>I would say to every slave in the United States, 'You should realize that a wise, kind, and merciful Providence has appointed for you your condition in life; and, all things considered, you could not be more eligibly situated. The burden of your care, toils and responsibilities is much lighter than that, which God has imposed on your Master. The most enlightened philanthropists, with unlimited resources, could not place you in a situation more favorable to your present and everlasting welfare than that which you now occupy...\n\nAt the same time, Scripture was a driving force in the Abolitionist Movement.\n\nTheodore Weld was one of the leading figures in the push to end slavery. Unlike his counterparts who were using God's word to push for the continuation of slavery, he saw God's word as overwhelming in favor of a freed people:\n\n>No condition of birth, no shade of color, no mere misfortune of circumstances, can annul that birth-right charter, which God has bequeathed to every being upon whom he has stamped his own image, by making him a free moral agent,\" Weld stated. \"He who robs his fellow man of this tramples upon right, subverts justice, outrages humanity, unsettles the foundations of human safety, and sacrilegiously assumes the prerogative of God.\n\nSince the Emancipation Proclamation, Christianity has had to come to terms with the role it played in slavery. As we see in this subreddit, the \"clarity\" surrounding God's word and slavery is still debated.\n\nI hope this look at Christianity's role in all aspects of slavery brings to light the importance of Juneteenth, and why I chose it to be represented this month. Yes, on the surface, Juneteenth is a day to celebrate the freeing of the last slave in the United States, but it has become much more than that. It is a time to reflect on the values we hold as human beings and to question where we are moving. It is also a time to reflect on the word of God and to take a hard look at those who use it as a means to an end.\n\nJuneteenth is a stark reminder that even the holiest of things can be used as a tool for subjugation. It is also a reminder that, in the right hands, the Word can be used to bring good back to the world.",
        "num_comments": 232,
        "comments": [
            "> At the same time, Scripture was a driving force in the Abolitionist Movement.\n\nThe Battle Hymn of the Republic makes this extremely clear. One of the later verses says, in no uncertain terms:\n\n> As he died to make men holy, let us die to make men free\n\nThe Union Army knew what they were fighting to end, and directly tied it to Jesus' commandment that the greatest form of love is laying your life down for a friend.",
            "There are some places in the southern USA, where they have attempted to combine civil rights holidays with confederate remembrance. Like Lee-Jackson-King Day to honor Robert E Lee, Stonewall Jackson, and Martin Luther King Jr… yeah\n\nAnd when Texas first recognized Juneteenth as a holiday, they also recognized Confederate Heroes Day… \n\nA stark reminder of how the civil war still casts a shadow on this nation.",
            ">Christianity has had to come to terms with the role it played in slavery.\n\nNo it hasn't",
            "Help an ignorant non-American: What is that banner? In what way does it observe Juneteenth?",
            "I was wondering why a American Holiday I had never heard of was up there, this actual makes sense",
            "Confused Old Reddit noises.",
            "I see the silhouette of a cross in front of what looks colorful rock background. Is the banner supposed to have some other elements indicative of its theme?",
            "> Although slavery in the US ended in 1863 through the signing of the Emancipation Proclamation\n\nThis is not true. Chattel slavery was outlawed in the United States when the 13th amendment was ratified.",
            "Oh, also. Trivia to relate this back to Pride. You know how, for a while, the big talking point was civil unions and the difference between religious and governmental marriage? Yeah... If you look at when the government actually started issuing marriage licenses, as opposed to just using common law marriage, it's entirely plausible that they only did it to prevent miscegenation",
            "I need to say something here, playing a large role in something doesn't mean you were on the right side.  Any role that Christianity had in slavery and ending slavery was at best self serving at at worst only made things more difficult for Blacks to be accepted as equals in society.  Self serving evangelization i.e. presenting people with converting to your faith as a means to \"save them\" so you can feel good about yourself...this only furthered the idea that the Blacks were lesser because they largely followed African or Afro-Caribbean folk religions or traditional beliefs...this was the same treatment the native americans got and the answer from Christians was to \"save them\" by doing nothing about helping them save their land, but, taking every effort to convert them not only to Christianity but to a European way of life.  Juneteenth is not a Christian holiday by any means, but, is a day to remember that a group of  slaves in Texas were never freed despite the federal laws in place outlawing the practice and the owners...Christians.  Juneteenth should be to remember a horrible historic event and celebrate the freedom and equality we now have in our country and not an excuse for Evangelical Christians to pat themselves on the back.  Sorry if you this sounds harsh but I am only repeating historical fact",
            "I only wish the nation decided to call it something different. I can't get over the contracted June 'teenth thing. I don't have to get it. It might be absurd to get hung up over it. It might be nitpicky. It might be beside the point. But still, why can't we call it Emancipation Day? Or Texas Finally Caught Up With the Rest of Us Day? Freedom Day? Or goodness even just \"June Nineteenth\"? \n\nIs contracting numbers a norm in the southern dialect? Does this happen with other words? If someone's birthday is May 14th is that Mayteenth? It's a colloquialism I just can't seem to get over lol.",
            "Amen",
            ">the 13th Amendment was not ratified until December 6th, 1865. Even then, the last slaves were not told they were free until June 19th, 1865.\n\nI think you messed up your dates there.",
            "I'll tell you that there's a song called precious Puritans by a Christian rapper named propaganda that song talks about what kind of divide the Puritans had on Christianity when they got discovered as slave owners\n\nhttps://genius.com/Propaganda-precious-puritans-lyrics",
            "Good post.",
            ">During the time of slavery, many slaves throughout the Caribbean islands of Jamaica, Barbados, and Antigua were given a \"Slave Bible\" as to not give them anything that might lead to rebellion. This version of the Bible left out most of the Old Testament. What was left were passages aimed at telling slaves to be subservient. \n\nI think that this is misinfo. It wasn't a Bible and wasn't presented as such. It was just some selected sections of the Bible. Lots of stuff wasn't selected.",
            "[deleted]",
            "I'm from Scotland, so I don't know how much focus is places on the international abolitionist movement during Juneteenth, but the British Quakers were a big force in the early abolitionist movement from as far back as the early 18th century. \n\nThe Catholic Church has a complex history in general, and this issue is no exception; but the Church has also been extremely outspoken in support of abolitionist movements; Papal bull Sublimis Deus issued by Pope Paul III in 1537 forbids the enslavement of indigenous peoples.\n\nOther Popes have also not minced words on this. Pope Gregory XVI also issued a Papal Bull In supremo apostolatus in 1839 that states...\n\n> \"We, by apostolic authority, warn and strongly exhort... that no one in the future dare to bother unjustly, despoil of their possessions, or reduce to slavery Indians, Blacks or other such peoples... We prohibit and strictly forbid any Ecclesiastic or lay person from presuming to defend as permissible this trade in Blacks under no matter what pretext or excuse, or from publishing or teaching in any manner whatsoever, in public or privately, opinions contrary to what We have set forth in these Apostolic Letters\"\n\n\n\nChristianity is all across the abolition of slavery, and continues to be as we work to abolish it totally.",
            "Slavery is still going on today through human trafficking.\n\nWhat does Juneteenth do to prevent or make awareness that? \n\nAs a Christian asking other Christians.",
            "Based and Christpilled.",
            "Satan deceives people by infiltrating the Church and using scripture for purposes of domination and subjugation.  This is a spiritual battle and people seem to forget that or not understand the all evil comes from Satan's influence.",
            "The real question is, which side of the Word are we on?",
            "Maybe have a split banner with the pride flag? It was a trans woman of colour who kicked off our liberation.",
            "Jesus - the Gold Standard bearer of Christianity - is the lamp unto our feet and the light to our path when it comes to \\*wrestling with the topic of slavery.\\*\n\nPeople who say the bible 'approves of slavery' are generally using a microscope to find the quote mined verse they want to focus on while simultaneously dismissing the weight of every other page of the bible - a book which should be taken as a whole when arguing about what \"The Bible\" says.\n\nIn God's Word I find a mountain of bedrock theology throughout the entire book whose moral compass points to these 'True North' values;\n\n- Thou shalt not steal. (Slavery is wage theft.)\n\n- Treat others the way you would have them treat you. (Do you want to be treated like a slave?)\n\n- Greed - the love of money - is the root of all kinds of evil. (Ask yourself whether slavery is driven by greed.)\n\nWhen I look at Civil War America, I see a nation where most people were Christians. Most people did not own slaves. And most people (the majority) prevailed in their goal to end the practice they found to be immoral. I contend that if the bible DID approve of slavery, the predominantly Christian, bible believing majority of Americans would not have thought it important to abolish it.",
            "Ok if I just stick to celebrating Father's Day?  Fathers play a pretty important role in Christianity too.",
            ">June Banner: Juneteenth\n\nThis holiday has nothing to do with the bible, God, or Christianity.\n\n>Juneteenth is a stark reminder that even the holiest of things can be used as a tool for subjugation. It is also a reminder that, in the right hands, the Word can be used to bring good back to the world.\n\nThis is true for any holiday.",
            "Juneteenth is a dumb holiday, but I won’t stop the government from giving us another federally recognized holiday. ",
            "Julia Ward Howe’s husband Samuel Gridley Howe was one of the Secret Six who was funding John Brown’s abolitionist activities including the raid on Harper’s Ferry.",
            "Beautiful!",
            "Love this",
            "This is mostly accurate but please remember to be careful of putting people on pedestals. I'll refer you to the New York Draft Riots of 1863 for one of many possible examples.",
            "There's a Connie Willis book where the protagonist is asked to write something about how we still haven't gotten over the Vietnam War, and he writes something to the effect that a bigger problem is that we haven't gotten over the Civil War.\n\nCivil Rights for black people in the US shouldn't be a give and take where you have to mollify racist white people in order to get politicians to accept that we should celebrate its heroes and victories. It's not a \"both sides\" thing.",
            "General Lee's dying wish was that the CSA's legacy would not be preserved, he despised the confederacy, but he fought for Virginia, his homeland.  There was no attempt by any confederate generals or political figures to even contest the Union victory...even Jefferson Davis just accepted the consequences of his actions and even left his land to a favored slave.  There were no statues erected in 1866, no high schools were named after generals, the confederate flag (or what everyone thinks is the confederate flag, but the battle flag of northern VA) disappeared from pop culture all the way until the 1940s when the flag became the banner of the KKK and the united daughters of the confederacy began collecting money to build confederate statues and monuments, buy naming rights of schools and so forth all to intimidate black students from enrolling in white schools when they began integrating public school and bussing programs...I really think if more people really understood the full history behind all that, they wouldn't defend it like its actual historically relevant.",
            "I agree.   The fact that good Christians helped free the people that the bad Christians had enslaved does not absolve Christianity of it's role in creating slavery in the first place. \n\nThe words still exist in the bible, which were used to justify slavery then.  What is to prevent a future generation from going back and using those same words to justify enslaving a new race of people?\n\nIf Christianity want's to truly make amends for it's sin of slavery, and ensure that slavery will never again happen in its name, it needs to cut those words out of it's central text.",
            "This is the kind of statement you might want to elaborate on lol. It could be interpreted as either \"many of us are still in denial\" or \"there's nothing to come to terms with\"",
            "Juneteenth usually takes on the colors of Africa to represent the Holiday since most slaves were of African descent. You'll also see a lot of fists similar to ones used during the Civil Rights movement. The reason for the post is to show the connection, good and bad, between slavery as well as the end of slavery. \n\nJuneteenth is a celebration of the last slave being freed in the US. It was originally called Jubilee Day in reference to a verse in Leviticus, but it has been changed to Juneteenth. It is now a recognized, national holiday in the US. \n\nFor the banner generally, I'm going to choose some sort of international celebration each month to highlight with a banner as well as how it connects to Christianity.",
            "Interestingly enough, there are a lot of places where this is celebrated; although, I do believe the US is the only country that recognizes it nationally. \n\n[https://www.juneteenth.com/international/](https://www.juneteenth.com/international/)",
            "Never surrender!  New GUI is garbage.",
            "You just conform!",
            "The colors of the background are representetive of the colors used for Juneteenth. Trying to find a banner that fits within Reddit's banner parameters, which is 1600px by 480px is nearly impossible.",
            "Yes! Thank you. I knew I missed something. I just fixed it.",
            "Nope. The 13th Amendment only *mostly* banned slavery. It's unfortunately still allowed as a punishment.",
            "I've tried to argue that but I haven't found a good source for it.",
            "Do you have any support for this? I'm trying to look it up, but all I see is that the federal government started recognizing marriages in 1913 as a tax exemption in a tax bill mostly concerned with tariffs https://en.wikipedia.org/wiki/Revenue_Act_of_1913 . That article implies states followed suit from that",
            ">Any role that Christianity had in slavery and ending slavery was at best self serving at at worst only made things more difficult for Blacks to be accepted as equals in society.\n\nThis is a bit unfair. In the sense that reconstruction never truly ended and modern civil rights struggles are swimming in the same waters as reconstruction.\n\nThere is a huge chunk of the country that has resolutely *refused* to accept black people as equals in society. They continue to do so today, opposing any and all measures of equity and relying on dogwhistles and euphemisms to promote the policies that continue to perpetuate the inequalities. \n\nAnd yeah, lots of those folks are Christians. But they aren't exactly negotiating in good faith.",
            ">Any role that Christianity had in slavery and ending slavery was at best self serving\n\nOh, come one now. I'm the first to complain about the role Christianity had in the slave trade, but there were Christians who gave their lives to end it. How could that be self-serving?",
            "It is also called Emancipation Day. The slaves themselves called it 'Juneteenth' because not every community communicated emancipation to its slaves on the exact same day. Since no other holiday contracts like that, can't you just let it be?",
            "I liked the original Jubilee Day.",
            "Every year I have to remind myself that Juneteenth is the 19th, not the 16th, because of June being the sixth month.\n\nSay literally whatever else you want about the Armstice, but they nailed it with that 11/11 thing.",
            "[Here](https://www.npr.org/2018/12/09/674995075/slave-bible-from-the-1800s-omitted-key-passages-that-could-incite-rebellion) is a link to an article with more information about the Slave Bible. \n\n[Here](https://aeon.co/ideas/how-did-slaveholders-in-the-caribbean-maintain-control) is an article describing how slaveowners, specifically Caribbean in this case, did whatever they could to create a culture where slaves were not motivated to revolt.",
            "[removed]",
            "American Quakers were also instrumental in the abolitionist movement.\n\nIt's good to remember the people who supported abolition but we must also be careful of putting any person or culture on a pedestal. Catholics were instrumental in developing and profiting from the Trans-Atlantic Slave trade. In what is among the greatest examples of getting hit in the face with the point and still missing it, Bartolomé de las Casas campaigned for an end to the enslavement of Native Americans and suggested that African slaves be imported instead.\n\nThat said the Catholic church has put in a lot of work in healing the damage done while many other Christians are still arguing about whether there was any damage at all.",
            "That is very interesting!! Thank you.",
            "What? Why does a national holiday need to prevent human trafficking? It'd be great if it could, but that's such a strange response. Do we expect Veteran's Day to fix the VA?",
            "Something tells me if you actually worked with the celebration of Juneteenth to fight modern slavery, others would support you and people could get shit done.\n\nBut you want to fight against Juneteenth by mentioning that those who are celebrating it aren't doing \\*enough\\* to fight modern slavery, while you don't do shit to change that.\n\nLutheranism has had a huge Nazi problem for the past 100 years and you are making it worse.",
            "I have absolutely no clue what this has to do with the post.",
            "What are the different sides?",
            "[removed]",
            "Who? I've never heard this.",
            "How do you understand slavery regulations in Leviticus, for example?",
            ">  And most people (the majority) prevailed in their goal to end the practice they found to be immoral.\n\nThis isn't true.",
            "Obviously no one will complain about you celebrating Father's Day. Why are you acting as if there's a choice between the two?",
            ">This holiday has nothing to do with the bible, God, or Christianity.\n\nSure it does! I spelled out the ways it does in the post. Feel free to read it.",
            "The abolitionist movement was a markedly Christian endeavor.",
            "Why do you believe it is a dumb holiday?",
            "wdym",
            "You can say that again. This constant mollification of racist white people started immediately following the war when that bastard Andrew Johnson worked to kill the Freedman’s Bureau and any immediate reparations to slaves, returning them to a state of near-slavery while deigning to call himself the black man’s Moses.",
            "> Christianity of it's role in creating slavery in the first place.\n\nSlavery existed for thousands of years before even Judaism began...\n\nNow, the trans-Atlantic slave trade, supercharged by capitalism and industrialization?  That was indeed done by Christian societies, and yeah, we've got to repent quite thoroughly for that.\n\n> it needs to cut those words out of it's central text.\n\nThat's not how the Bible works.",
            "Who has the authority on earth to make changes to the Bible? The Bible is God’s very own word on paper, his instruction for his people. There are plenty of “errors” that people find in the Bible but I’ve yet to seen a single one that hasn’t been proven to be false. Yes, the Bible has had changes and additions in the past but that could also be God’s doing to give us the messages we need to hear. I don’t believe we should change the Bible but if it does happen then I trust that God will still give us the knowledge we need.",
            "The Bible can't be amended, but the various catechisms and statements of faith of denominations and churches can be.\n\nAFAIK, the Westminster Catechism has never been updated to make a clear statement against slavery, but it should be. It's a human construct, so humans erred in it's creation and humans should update and correct it when it is in error.",
            "[removed]",
            "The Bible in no way advocates for chattel slavery practiced in the US and the British Empire. In fact, kidnapping and enslaving people is punishable by death in the Mosaic Law. Wicked people took advantage of the fact that slavery was permitted in the ancient world and used it to justify a wicked and unjust system.",
            "> colors of Africa\n\nRed, black, and yellow (or red, black, and green) are the Pan-African colors. The first set are drawn from the flag of the Ethiopian empire. Ethiopia is the only African nation to resist colonization. The second set came from the United Negro Improvement Association headed by Marcus Garvey. The UNIA has had a positive impact overall, but they have a complicated legacy.\n\n  \nAlso, the fist is mainly from the Black Power era of the late 1960s and 1970s. Young black activists of this era favored a more assertive (and in some cases agressive) stance towards gaining civil rights. Probably the most famous imagery comes from the [1968 Mexico City Olympics where three athletes participated in a demonstration for civil rights on the medal podium.](https://en.wikipedia.org/wiki/1968_Olympics_Black_Power_salute)",
            "You're substantially correct, but:\n\n>Juneteenth is a celebration of the last slave being freed in the US.\n\nIt was the date of the last state ordering compliance with the Emancipation Proclamation. The last slave from the Atlantic Slave Trade was freed significantly later, and we still have illegal slavery here.",
            "And even then, it was only recently made a national holiday in the US. Texas was the first state to recognize it as a holiday, in 1980. Most states didn't recognize it until the 2000s, the last state being South Dakota only 2 years ago. Many states enacted provisions in the wake of the murder of George Floyd, which thanks to the pandemic was the first time people couldn't just ignore a case of the ugly end result of institutional racism...",
            "Got it, just curious.",
            "Razar, I specifically said \"chattel slavery\", which also of course was McClanky's intention.",
            "\"Let it be\" how? I'm expressing a personal nitpick that I caveated amply as a nitpick.",
            "As a nerd of the 90s, that just makes me want to celebrate a certain sparkle shooting member of the X-Men",
            "That's a good one too, yeah.",
            "I wrote 16th like 10 times for some reason.",
            "[Here](https://archive.org/details/selectpartsholy00unkngoog/page/n5/mode/2up) is the actual book, \"Select parts of the Holy Bible\". \n\nAs an example, the books of Leviticus and Numbers are ommitted in their entirety. It also skips from Deuteronomy to the middle of 1. Samuel. The things that was skipped isn't just passages that are possibly anti-slavery, and what's left in there isn't just things that tell slaves to be subservient.",
            "There’s an idea that the Catholic Church is so old that nothing is unprecedented in the Church.\n\nThere have been “Christian” arguments for slavery all over, but I think it’s important to highlight the people who actually follow the gospels on this and work to stop it.",
            "Juneteenth is a holiday celebrating the end of slavery even though it’s still going on. It’s like an oxymoron holiday.\n\nThat’s what I was getting at…\n\nHow can you celebrate something that hasn’t ended yet?\n\nThey should have a national holiday for human trafficking awareness, and put it on the same day.",
            "You are ignoring (perhaps both knowingly and purposefully, in which case ignore) that many peoples' perceptions of their Christianity is based in their perceptions of their whiteness. Support for Juneteenth and Black liberation is seen as an attack on their whiteness, and therefor an attack on their Christianity. \n\nWithin this framework, Black equality is a direct threat to Christianity, and therefore, to Jesus Christ.",
            "Literal, not going beyond what is written, abstract, by the Spirit, parsing out concepts applicable at all times and places, in its context at a time and place, I'm sure there are more.",
            "[removed]",
            "Marsha P. Johnson",
            "I understand them as *regulations* - not encouragements, not endorsements, not warm-hearted approval of slavery.",
            "But they abolished slavery didn’t they?",
            "Seems like maybe I'll get in trouble if I celebrate fatherhood and ask people to note Alzheimer's awareness month - my father has it.  It would only distract from the more important things, like Juneteenth and Gay Pride.",
            "As was the opposite!",
            "It's a silly addition that people made to try and placate modern political violence. The cause of the celebration is noble, but the rewriting of history that it was some popular celebration that the government only recently acknowledged is just rewriting history, which I disagree with.\n\nAlso, I don't care, I get another free holiday at work. Solid 10/10.",
            "The narrative that union soldiers altruisticlly fought for liberty is an exaggeration at best. Soldiers joined the union for many reasons including the draft. And there were some who violently opposed being drafted to the point that they started killing any black people they could find.",
            ">The Bible can't be amended\n\nWhy? What's the honest answer to this? The bible was amended frequently throughout it's history. Why is there suddenly an arbitrary date where it can no longer be adjusted?",
            "Removed for 2.1 - Belittling Christianity. \n\nIf you would like to discuss this removal, please click here to send a modmail that will message all moderators. https://www.reddit.com/message/compose/?to=/r/Christianity",
            "I invite you to read this thorough blog post on this topic.  The author has compiled it better than I could myself.  \n\n[https://michaelpahl.com/2017/01/27/the-bible-is-clear-god-endorses-slavery/](https://michaelpahl.com/2017/01/27/the-bible-is-clear-god-endorses-slavery/)\n\nHowever I want to emphasize the last paragraph of the article. \n\n>\"So the next time we hear someone talk about the “clear teaching of Scripture” on women’s roles, or saying that “the Bible is clear” on homosexuality, or [whatever the topic might be](http://rachelheldevans.com/blog/bible-clear), think about this: the Bible is at least as clear on slavery, yet thank God we no longer believe that slavery is God’s will. [We’ve read the Bible, and we’re following Jesus.](https://michaelpahl.wordpress.com/2016/07/21/bible-intro/)\"\n\nThis is the correct point of view as a Christian.  Slavery is evil.  We know it within our heart of hearts, and if we follow in the way and the light of Jesus Christ we cannot endorse slavery.   \n\nHowever, there are still places in the bible where Slavery is prescribed.  This is wrong.  And in keeping these in our Holy book we run the risk of misguiding future generations.  \n\n>Matthew 18:6 “If anyone causes one of these little ones—those who believe in me—to stumble, it would be better for them to have a large millstone hung around their neck and to be drowned in the depths of the sea.",
            "To be technical, we still have legal slavery. The Constitution still allows legal slavery if you're incarcerated. Perhaps this Juneteenth should be a reminder of that.",
            "[Knowing Better makes a pretty compelling argument](https://www.youtube.com/watch?v=j4kI2h3iotA) that (while chattel slavery was outlawed before then) the last chattel slave in the United States was freed during World War II **in 1942**, less than a year after the bombing of Pearl Harbor. He cites the case of [Alred Irving](https://en.wikipedia.org/wiki/Alfred_Irving_(former_slave)), enslaved in Texas.",
            "OK; just thought all the explanations would help.",
            "This might be a personal nitpick for you but others have done the same for more diabolical reasons. It has long been a practice of bigots to condemn black Americans for speaking dialects of English that only exist because of slavery.\n\nYou should really consider that your opinion of the name of this holiday might not be appropriate in this particular thread especially since this is a holiday that was only nationally recognized 3 years ago.",
            "... okay? Do you also take issue with the fact that Children's Bibles will market themselves as Bibles, despite the fact that they just contain a handful of child-friendly stories from the Bible?",
            "I'm not sure what your objection is here. The name given to this selection of Scripture is \"The Slave Bible\". \n\nhttps://www.history.com/news/slave-bible-redacted-old-testament\n\n>Most of the Old Testament is missing, and only about half of the New Testament remains. The reason? So that the enslaved Africans in the Caribbean islands of Jamaica, Barbados and Antigua couldn’t read or be read anything that might incite them to rebel.",
            ">As an example, the books of Leviticus...omitted entirely\n\nThis is so interesting, given that Leviticus is often cited as God condoning slavery.",
            "Yes but similarly we can't forget the people who acted to enable it. If we forget how we got there then we run the risk of going there again.",
            "That's very clearly not what you said. \"How will this stop X\" and \"How can you celebrate the end of X while it's ongoing\" are not the same point.",
            "[removed]",
            "Thank you. That makes sense. I confusedly thought you were referring to black liberation",
            "The Bible:\n\n-Explicitly states that someone who beats a slave within an inch of their life has done nothing wrong\n\n-Gives instructions for how to capture free men into slavery\n\n-Specifies that children of slaves are slaves and that free children can be enslaved\n\nHow is that not an endorsement of slavery?",
            "Are these regulations in opposition to things like those three bullet points you listed above?",
            "Who?",
            "Show me one person who got in trouble for noting Father's Day or Alzheimer's awareness month. Anywhere.",
            "You are a liar. You suggest that you will get in trouble, knowing you're lying out your ass, and when people ask for clarification you ignore them. Your Christ is based in lying.",
            "Colonial slavery was a markedly Christian endeavor? I suppose we disagree about what makes something \"markedly.\" I am here using that word to say \"the abolitionist movement was grounded in the Christian idea that all human beings are worthy of dignity and value, being created in the image of God.\"",
            ">It's a silly addition that people made to try and placate modern political violence.\n\nJuneteenth has been celebrated since 1866. The celebration did become more popular during the George Floyd protests, but that is pretty understandable given the context. \n\n>the rewriting of history\n\nI'm confused by this. What history is being rewritten?",
            "Didn't Texas first officially observe it in 1939? Given the Republic of Texas is less than two hundred years old, celebrating something for nearly half that Republic-come-State's lifetime sounds like a pretty well-established and historic tradition.",
            "Our government doesn't create national holidays to placate political violence. If it did, we'd all be celebrating \"Trump's 2020 Win Day\". You're just trying to call attention to the small percentage of BLM protesters who were violent.",
            ">And there were some who violently opposed being drafted to the point that they started killing any black people they could find.\n\nDo you have a source for this? I can't find anything on it",
            "Some religions are more friendly than others towards that type of practice. Advocating for or against that can be religiously \"political\" for lack of a better term.",
            "Try throwing in a / before the final paragraph to make the link work.",
            "Affirming the Consequent fallacy.\n\nBigots also drink water. Guess we can't drink water anymore because someone incapable of understanding nuance and focusing only on appearances might think it's the same thing.\n\n\nAppearances are irrelevant. Only authenticity matters. Only truth matters.",
            "What? This book doesn't present itself as a Bible.",
            "Leviticus also gives reasoning for releasing owned people, which I could more than understand why a slaveholder wouldn't want slaves to see.\n\n>If a foreigner residing among you becomes rich and any of your fellow Israelites become poor and sell themselves to the foreigner or to a member of the foreigner’s clan, 48 they retain the right of redemption after they have sold themselves. One of their relatives may redeem them: 49 An uncle or a cousin or any blood relative in their clan may redeem them. Or if they prosper, they may redeem themselves. 50 They and their buyer are to count the time from the year they sold themselves up to the Year of Jubilee. The price for their release is to be based on the rate paid to a hired worker for that number of years. 51 If many years remain, they must pay for their redemption a larger share of the price paid for them. 52 If only a few years remain until the Year of Jubilee, they are to compute that and pay for their redemption accordingly. 53 They are to be treated as workers hired from year to year; you must see to it that those to whom they owe service do not rule over them ruthlessly.\n\n>54 “‘Even if someone is not redeemed in any of these ways, they and their children are to be released in the Year of Jubilee, 55 for the Israelites belong to me as servants. They are my servants, whom I brought out of Egypt. I am the Lord your God.\n\nEven though this was directed at fellow Israelites rather than the slaves bought from other nations, even an inkling of hope may be enough to start a revolt.",
            "Leviticus contains regulations which gave radically progressive rights to slaves.",
            "What is also interesting is that it has the verse against \"man stealers\" in 1Tim!",
            "Well, when I look up Juneteenth, it says that it’s a holiday celebrating the end of slavery.\n\nBut my question is when exactly did it end?  Why is someone celebrating something that is still continuing?\n\nThat’s all…\n\nVeterans Day is a day to honor those that have died in battle has nothing to do with the VA hospital. If it weren’t for our troops, we probably would have been captured by some other nation. They deserve all the respect and honor they get.",
            "Could you tell me the verse for these? I would like to examine them, thanks",
            "No, not at all.",
            "The USA",
            "If the question is whether slavery is compatible with the ideals of the Christian faith as we understand it today, I think you and I would both agree that it isn't. \n\n\nBut that wasn't a sure thing at the time. Christianity does not have explicit moral commands against slavery and many Christians at the time fiercely defended the institution. It was a fairly radical minority that opposed it.",
            "No, slavery was not Christian *in that incredibly narrow sense*. It was Christian in that many of the people doing it cited their Christianity as a justification. You may believe they weren't living up to Christian ideals as you understand them, but that's not the sort of thing we put in history books.",
            "It really hasn't been. It's existed since 1866, but to act like it was any kind of widespread thing is silly. Making a new holiday because a drug addict od'd is silly.",
            "So they celebrated it once in 1939, what's your point? States acknowledge all sorts of wacky stuff as individual \"days\". It still wasn't widespread and was just a rabbit they pulled out of a hat to stop the constant violent riots.",
            "One group of goobers walking through a building is not the same as billions, with a b, dollars worth of damage and 23 murders. We have at no point in our history seen such widespread violence as we did in the \"summer of rage\" from BLM, and bear in mind, it didn't just happen once, it happened twice. When people stopped caring about the idiot kid who tried to murder a mexican dude they got mad about the drug addict who OD'd.",
            "Fwiw - I don’t think you and I agree on most things, but I value your contribution to the sub",
            "Human trafficking is a perfectly worthy issue. In many ways it is the modern form of slavery, sure. We can also talk about the rights of the incarcerated. \n\nBut both of these things are unlike chattel slavery, and that should be recognized. \n\nChief among them is the fact that slavery was *legal* in Texas until June 19, 1865. In some technical sense it was illegal, in that the Emancipation Proclamation -- which had legal weight -- had declared the emancipation of slaves in Texas two years prior. But that didn't actually impact the local ordinances until the government was able to use force to bring the law into effect. \n\nWhereas trafficking (which is still sinister and insidious of itself) is done in secret, the product of organized crime rings and so forth. \n\nSure, there is room for having a conversation as to whether the spirit of Juneteenth compels us to take further action. But that doesn't mean there's nothing to celebrate either",
            "Exodus 21:21, Deuteronomy 20:11-14, Exodus 21:4",
            "Oh, I see. Sorry, I thought you were arguing for a position I have seen a few times here which is something like \"there was no real slavery in the Bible.\"",
            "That's a country, not people. Which people in the US?",
            "I would say, at the very least, Christianity is incompatible with colonial slavery.",
            "I think this \"narrow\" sense is the best way to understand the issue. Otherwise, you can make anything \"Christian\" insofar as you have Christian people doing it.",
            "You didn't celebrate it, that doesn't mean it wasn't celebrated. The point you're missing regarding George Floyd and this Holiday is another reason that talking about it is important.",
            "Every holiday wasn't a thing until it was. Christmas became a big deal in Christian faith surprisingly late in history. \n\nJuneteenth had regular celebrations prior to 2020, but seeing as that was one of the biggest civil rights protests of our history (by many metrics *the biggest*) whether you like it or not, that gave new significance to the date. \n\n\nMLK was also plenty unpopular in his day - every bit as unpopular as many civil rights leaders today. His holiday reflected a change in public sentiment too. \n\nAlso, George Floyd didn't OD. The autopsy specifically cited cardiopulmonary arrest from \"subdual, restraint, and neck compression.”",
            "No, they first started celebrating it in the 19th Century :) It was formally recognised by the state in 1939, and repeatedly celebrated with state backing from then on in.",
            "If you're going to gloss the attack on the capitol, in which they erected a gallows while chanting the names of specific people they wanted to hang as \"goobers walking through a building\", I don't believe there's a chance of getting you to respond honestly. Have a nice day.",
            "Thank you. And you are fine, most of the times.... :)",
            "Im not sure I’m understanding your point",
            "I would be inclined to agree. But we also have to be honest about our history and the reason this was a minority opinion at the time.",
            "No, there's a difference between Christians doing something and Christians citing their Christianity as a reason to do something. Some Christians steal, but they don't cite the Bible as their reason for stealing, and thus we don't say \"historically Christians have stolen\".",
            "It was never a widespread thing. I'm very familiar with the incorrect point you're pushing.",
            "Yes, violent riots were very popular for a time because a drug addict OD’d. the autopsy said there were no life threatening injuries and that he died of a heart attack brought on by 10x the lethal limit of fentanyl being in his system. He was dead before the cops put cuffs on him. ",
            "And again, it being recognized once and then ignored has zero bearing on my stating that it was never some widespread thing. No one even knew what it was till BLM and their race supremacists demanded something.",
            "If you're going to gloss the repeated and targeted attacks on dozens of police stations and the targeted killings of people who disagreed with them to \"mostly peaceful\", I don't believe there's a chance of getting you to respond honestly.\n\n  \nYou raised the bar to saying that the BLM riots were mostly peaceful, don't get mad when idiots marching is compared to their insane level of violence.",
            "Sure, I think we can be honest and admit that those Christians who engaged in colonial slavery were acting **in opposition** to their Christian faith, rather than consistent with it.",
            "Alright, I will walk that back slightly. \n\nI would still say that a Christian who uses the Scriptures to justify doing something is a sloppy way of calling their acts \"Christian.\" Christians can use the Scriptures (or I should say *misuse*) to justify all manner of activities.",
            ">It was never a widespread thing\n\nI think the key question here is \"so what?\"",
            "\n>autopsy said there were no life threatening injuries and that he died of a heart attack brought on by 10x the lethal limit of fentanyl being in his system\n\nIt didn't say that. You fell for a Facebook hoax on that one. He had fentanyl in his system, but not a fatal level, and he died of suffocating essentially, which isn't going to show the signs of injury. The report explicitly shows he died from cardiovascular asphyxiation from the postural suffocation. \n\n\n>violent riots\n\nFun fact - these riots were less violent than many of the riots of the 60s civil rights era.",
            "Jesus Christ you morons are still on this shit",
            "Okay, so you just ignore facts so you can keep being a racist. Cool :)",
            "For me there's a push and pull. You don't want to be too quick to brush it aside - we have to wrestle with why they came to the conclusions they did. And the uncomfortable reality that if you and I were in their shoes, we might have done the same. If that doesn't induce humility, nothing does. Ethical questions of this nature are incredibly difficult and many times Christians do get it wrong. \n\nBut at the same time, yes, you do have to recognize that the abolitionists had the superior argument rooted in the loving care that Jesus exemplified.",
            "You need to read the words of the pastors who said that abolition was the greatest denial of God's Holy Word ever to pass the lips of men and other niceties.  Their support for slavery was 100% supported by their Christian faith. Pretending it wasn't damages our witness to the world and stunts our spiritual growth.",
            "Without saying you're right/wrong about the misuse, you do realize it's not really possible to discuss Christianity's effects that way? Only attributing to it those actions that jive with your interpretation of Scripture? Like should you have to stop and ask someone their opinion on whether Scripture forbids homosexuality before discussing Christianity's relation to the gay rights movement - just in case they think the anti-gay passages anti-gay Christians cited are being perverted?",
            "I don't see how you say it's a misuse of scripture.  Slavery is pretty heavily endorsed in the bible.",
            "I think that’s a question for you. I said it wasn’t widespread and you got really mad and called me a racist for being literate.",
            "[removed]",
            "It's certainly weird that people keep defending the trash who OD'd.",
            "[removed]",
            "What facts? That it was acknowledged once in the 30s? That it was never widespread? Most states didn't even recognize it until the last decade. Georgia didn't even recognize it till 2011.\n\nIt was never widespread and you and I both know you can't prove it because it's objective fact.",
            "Oh, sure, I think often of how slavery even in the most brutal forms was basically accepted by all peoples everywhere. The outright rejection of slavery is a new phenomenon in human civilization.\n\n>But at the same time, yes, you do have to recognize that the abolitionists had the superior argument rooted in the loving care that Jesus exemplified.\n\nBooyah",
            "What do you mean by \"their support for slavery was 100% supported by their Christian faith?\"",
            "No, the point I am making is that it is inappropriate to refer to some activity as a \"Christian\" one merely by associating an act with \"Christians do it\" or \"Christians use the Scriptures to justify it.\" The way I was referring to the abolition movement as a markedly Christian event is because it flows naturally from the Christian view that all humans are innately and equally worthy of value and dignity, via being made in the image of God.",
            "Sure, but the slavery which is tacitly endorsed is rather distinct from colonial, race-based slavery.",
            "Wrong person, bro",
            ">Being this silly is something we can work on together okay. You don’t need to be embarrassed. \n\nThis is the biggest \"le epic reddit moment bazinga fedora tip\" nonsense I've read in a hot minute lol. Young Sheldon ass comment.\n\nOkay darling/my dove/whatever other silly pet name you want to have -\n\nThe medical examiner specifically still found that the cause of death was asphyxiation. Listed right there at the top of page one. \n\nThis stuff is literally relevant to my job, I know how to read an autopsy report.The idea of lethal limits of any drug is context dependent. So for starters it depends on the individual. Lethal levels in a 5'3\" 110 pound woman who has never done fentanyl vary quite deeply from a 250 pound man with history of use. And beyond that, there are a variety of ways in which an overdose kills you. A common one you might be familiar with how people choke on their own vomit for example - so the way people die from overdose is context dependent. \n\nAnd beyond that, you have to get deeper into the labs. For example, you have to compare the levels of fentanyl in the blood vs. the levels of metabolized fentanyl (which shows how the body has already processed). [The expert toxicologist from the trial](https://youtu.be/IEwbQMLQ5x8?si=JBWzuM9F1mEiK_bR) explained it well, that when you actually dig into the vital ratios, Floyd's toxicology report shows levels lower than the average in DUI cases and well below the ratio average found in fatal cases.\n\nAs the examiner testified in the trial, the drug use and heart disease were *factors* in his death, they may have made it less likely he survived. Same as if someone with a coagulation disorder were shot, they're more likely to die based on their medical history, but it doesn't change the cause of death. \n\n>there were no life threatening injuries as well, as in no damage to his throat\n\nThat's normal in asphyxiation. He didn't die from physical trauma but the obstruction to his breathing that came from the subdual. \n\n\n>And also honey, if they were so non violent, why did they kill 23 people and cause billions in damages, unlike the 60s actual protests\n\nWell shmookims - I'm afraid the protests in the 60s were not so innocent as you may have imagined! The Detroit riot of 1967 - More people died in that one city alone in the riots of that year than the nationwide death toll from 2020. I can point to several examples of deadly riots from the 60s.",
            "Removed for 1.4 - Personal Attacks. \n\nIf you would like to discuss this removal, please click here to send a modmail that will message all moderators. https://www.reddit.com/message/compose/?to=/r/Christianity",
            "Extremely Christlike to describe fellow human beings as trash.\n\nYou’re a boring troll, your schtick has been old for a while",
            "There was a point when Easter and Christmas weren't widespread, so I guess you all should stop celebrating those now"
        ]
    },
    "Off-Topic Friday - Post nontopical things in this thread!": {
        "title": "Off-Topic Friday - Post nontopical things in this thread!",
        "score": 4,
        "url": "https://www.reddit.com/r/Christianity/comments/1dl4st5/offtopic_friday_post_nontopical_things_in_this/",
        "content": "For this week's viewing pleasure:\n\n* Randall Munroe of xkcd fame has been doing video what-ifs for a while, and a few days ago, he adapted [one of my favorites](https://www.youtube.com/watch?v=Jpy55EgMQgY). What if you drained the oceans?\n\n* You know all those weird AI Jesus pictures that were flooding Facebook for a while? [Someone investigated](https://www.youtube.com/watch?v=0iM7cQukgAg)",
        "num_comments": 15,
        "comments": [
            "Are any of you fans of Red Dead redemption? I'm finally putting the finishing touches on a rootin tootin essay I've been working on for months now about it. Should publish this afternoon. It's been a huge labor but it really connects back to some very personal struggles I've had over the past year. Probably my favorite thing I've written in a long time. \n\n\n>You know all those weird AI Jesus pictures that were flooding Facebook for a while\n\nI just saw a great one this morning! Huge armies marching while carrying a massive ... Bible? But like AI Still can't do text right, so it said like \"Hulcy Bulcæ\"\n\nIf y'all haven't come across Folding Ideas on YouTube, I highly recommend. His latest video [Is a really thoughtful reflection on](https://youtu.be/b3gZOt1Lo4A?si=F-r02zdUDNyp095k) creation, performative anger, and the parasocial gestures that come with recognizing your own insecurities in another online figure.\n\nEdit: it's up!\n\nhttps://www.reddit.com/r/Christianity/comments/1dle9dq/the_monastic_vision_of_red_dead_redemption_2/",
            "1) Doing much better physically, my voice is still recovering but my coughing is almost gone. My thanks to /u/Gnurdette for praying. Also I have read about 1/2 of The Master and Margarita and it is still very entertaining. So I encourage you to continue reading Gnurdette. It gets more and more surreal though. I wonder what book II. is going to be about.  \n\n2) I had no idea it is possible for a human to join a lion pride and not end up as a snack. But apparently it is:        \n\nhttps://youtube.com/shorts/G8k-eD53vbI?si=L8cGAw2lEbabDJEf  \n https://youtube.com/shorts/dIR7jeeMvzQ?si=oWRl6kX3ryAdcOIn ",
            "And now for my random other updates:\n\nI found... definitely a weird anime, but in a fun way. Delicious in Dungeon. You know how every D&D player has probably wondered at some point whether they could eat the monsters? That. The party has to abandon the party healer when a fight with a dragon goes awry, but while they want to mount a rescue mission, they're also broke. So instead of spending the money they don't have on rations, they decide to just scavenge and eat the monsters they fight instead. The dub voice cast also includes a few moderately big names, like ProZD from Youtube as a dwarf chef, live-action Nami as an elf mage, and Yen Sid as a gnome mage who shows up in a handful of episodes. It also includes some generally positive autistic representation, as opposed to something like TBBT. Laios... isn't confirmed to be autistic, but between things like his special interest in monsters and utter inability to read social cues, everyone agrees he's on the spectrum. (It even gets played for drama, not laughs, one time, in a fight that was painfully reminiscent of my senior year of college)\n\nI actually had a refreshingly candid phone screen yesterday. The recruiter directly mentioned that he didn't have any interview slots left for the position he was interviewing for, but he *did* think I would be a good fit for a role a coworker was interviewing for, and was going to check if there were any slots left for it.\n\nAnd then it finally happened. After several years of getting long haircuts, I finally had a not-as-good one. I'm... just going to compare it to the inverse of [this](https://64.media.tumblr.com/bbab4b05296873ae42312d5d40e00a4c/024345188313996e-d1/s2048x3072/68756373e277f5f97813d51800ff369035271069.jpg), but it was more of a miscommunication on my part. I was looking for chin length at the shortest, but it got cut into a slightly shorter bob than that.",
            "I finished Netflix’s 3 Body Problem. I absolutely loved the show. I am eager to watch the new season whenever it comes around.\n\nMy current comfort show is Murder She Wrote. As a Gen Xer, I am old enough to have watched this show when it first premiered. And I did. But I stopped somewhere along the way. There’s a YouTuber known as PushingUpRoses, and she has a video series “that time on murder she wrote.” I see what episode she will talk about, watch the episode on Peacock, then go back to watch her take on it. I’ve watched all but her last video.\n\nIt’s now been 25 years since the Matrix. I’ve bought the iTunes movie with special features. I’ve watched the movie once, next up will probably be the philosophers commentary on the movie. But I’m surprised by how well the movie has held up.\n\nOther 25th anniversary movies I want to watch: The Insider, Magnolia, Eyes Wide Shut, Go, The Winslow Boy, Existenz (never seen), and Titus. I saw a lot of these movies in the theater, now I get to see them from my home theater.",
            "Anybody playing anything fun? I just finished Wolfenstein 2 and frankly it started dragging, there's some bad design in there.",
            "Anyone have any good summer recipes? It's been above 90 almost every day this month, and my usual grill and/or salad staples are going to wear thin well before August at this rate.",
            ">Also I have read about 1/2 of The Master and Margarita and itvis still very entertaining.\n\nThe second half takes the painstaking setup of the first half, and turns it into an absolutely sublime ending.",
            "I'm shocked you hadn't jumped on delicious yet - I adore it. Such a lovely show.",
            "Delicious in Dungeon is great. I love anime that focuses on food. It's great. Food Wars is great too, it started off a little fan service heavy, but then settled in and the focus on the food and drama were great.",
            "Delicious in dungeon has been one of my favorite anime to come out in quite a while. It’s funny and dramatic and I’m sad that I don’t have more to watch.",
            "I'm really wondering how 3 Body Problem is going to handle things when the series starts getting crazy dark. There's a whole segment of the series called the the great ravine where half of humanity dies out and stuff get's terrible. I'm wondering how they are going to handle that.",
            "I'm (a month late) on the Valheim Ashlands update, but the group I play with was out of the country.\n\nDebating if the Aska early access is worth it, people seem to be happy with it and it's extremely up my alley.\n\nIf you've ever played Orcs Must Die, I just grabbed Castle of Alchemists last week, it's basically a top-down pixel version of that game, but requires synergizes your traps in a way that Orcs usually didn't.",
            "Persona 5, but I keep getting stuck on the same boss battle. I’m severely tempted to drop the difficulty level so I can get past it.",
            "https://www.foodandwine.com/recipes/jamaican-jerk-chicken\n\nhttps://eatsbyramya.com/recipes/halal-cart-chicken-over-rice-for-one/\n\nhttps://glebekitchen.com/kerala-fried-chicken/\n\nhttps://www.bonappetit.com/recipe/ultimate-blt\n\nSome of my current faves",
            "I remember some of the original Personas from when I was a kid. Good memories."
        ]
    },
    "My drawing of Jesus and a Lamb. God bless you all.": {
        "title": "My drawing of Jesus and a Lamb. God bless you all.",
        "score": 331,
        "url": "https://www.reddit.com/gallery/1dlngq5",
        "content": "",
        "num_comments": 42,
        "comments": [
            "Simply beautiful",
            "Wonderful🤗 Praise the Lord🙌God bless you🙏",
            "Pretty ♡",
            "Stunning.",
            "Absolutely gorgeous!",
            "Why does he look white??",
            "Aryan Jesus",
            "Beautiful! 🥰👏God bless you too, you're very talented",
            "Thank you for sharing your gift! 🙏🏽🤍",
            "So beautiful 🥹 God bless you too!!!!!",
            "Beautiful!! ✝️",
            "It is very beautiful💝",
            "Impressive! Good job!",
            "This drawing resembles like the guy I see at the gym here in Ohio.",
            "That really good. You did a beautiful job",
            "This is the most beautiful thing over ever seen",
            "Very nice 🙏🏼",
            "no one ever seen jesus... smh",
            "Prohibited in Leviticus",
            "Idk who that white man is but it ain't Jesus",
            "Why does he look like he is american? Jesus was brown skinned and looked more middle eastern.",
            "Jesus was black",
            "He wasn’t white AT ALL",
            "Thank you 🩷",
            "Thank you! God bless you ❤️",
            "Thank you",
            "Thank you 💖🩷",
            "Thank you 💖💖",
            "You're very kind, thank you ❤️❤️",
            "You're very kind, God bless you 🩷💗",
            "Thank you 💗🩷",
            "Thank you 🩷",
            "Thank you 💗",
            "Thank you 🩷",
            "Lol",
            "Thank you ❤️",
            "Thank you 🩷",
            "He wasn't, he was probably like brownish or olive white",
            "Of course! Keep up the great work <3 you got a talent!",
            "You're very kind, thank you 🩷💖",
            "No need to thank me. We should spread kindness through this world more, especially for the talented ones. God bless you.",
            "God bless you ❤️❤️"
        ]
    },
    "Let me clear some things about forgiveness:  1. You did drugs? God forgives you   2. You did sex before marriage? God forgives you   3. You are gay? God forgives you  4. You did smth evil? God forgives you  5. You said smth bad? God forgives you   6. You sinned-blashemed God?  God forgives you": {
        "title": "Let me clear some things about forgiveness:  1. You did drugs? God forgives you   2. You did sex before marriage? God forgives you   3. You are gay? God forgives you  4. You did smth evil? God forgives you  5. You said smth bad? God forgives you   6. You sinned-blashemed God?  God forgives you",
        "score": 53,
        "url": "https://www.reddit.com/r/Christianity/comments/1dlrrwg/let_me_clear_some_things_about_forgiveness_1_you/",
        "content": "I mean if you are believer of God and Jesus and repent and follow him. If you are unrighteous and do these things and you don't believe in God then you won't be forgiven. ",
        "num_comments": 111,
        "comments": [
            "You are never bad enough that you can’t come to God.\n\nYou are never good enough that you don’t need God.",
            "No matter everything you did, no matter how bad, God forgives you always because he loves you and his love and forgiveness is infinite beyond times higher than your bad deed. God loves you. ",
            "OP just had [a conversation a week ago](https://old.reddit.com/r/Christianity/comments/1dgek73/i_want_to_kill_myself/l8pld0y/) where they said blasphemy against the Holy Spirit was unforgivable and has acknowledged they knew they were changing it when making this thread. They appear to be taking this tack of focusing on forgiveness purely so they can look better while reiterating their opinion that homosexuality a sin.",
            "Not only do we need to repent for our sins, we must actively work on being better to not repeat our sins to truly be forgiven.",
            "why would you need forgiveness for being gay..?",
            "Note how all of these are things someone *does*… except being gay. Apparently that one is bad enough that simply being gay is enough to need forgiveness… because that’s a great message to send to every gay person out there. That their unchosen sexuality is so bad that simply by existing as a gay person, you’ve offended God.",
            "The Bible say blasphemy against the Holy Spirit (God) is the one unforgivable sin",
            "Well what I've read in the Bible is that even though God is ready to forgive, His mercy has limits. In Hebrews 10:26 it shows how He won't forgive those who practice willful sin, not showing any repentance. So if we truly want to have his forgiveness we need to avoid the things God hates",
            "If you are repentant.",
            "I do think people misinterpret what it means to repent and they think if they just say they are sorry, it is enough without any actual change. I think about someone who struggles with something like sexual sin who engages in it, apologizes, and then continues willingly.",
            "If you accept Jesus Christ and repent of your sin, yes.\n\nOr do you think you can just keep on sinning willy-nilly, thinking you are saved regardless?",
            "You need to qualify that friend. 😐 God only does that for those who repent and believe the [gospel.](https://gospel30.com)",
            "What do you mean by \"are gay\"? What does \"being gay\" mean for you?",
            "I changed my mind, non believers can still be forgiven if: 1. Are really sorry, 2. Don't want to sin, 3. Don't do sins again with wanting it sin. Even though, they lose in the end. ",
            "genuine question, what if youre gay but you never act on it? is that still a sin?",
            "Correction obviously God forgives all who come to him but the point is to stop sinning eventually to become perfect like Jesus or at least to the point were u hardly ever sin once in a blew it's a process think about it God doesn't punish you right away for all the sins we commit on the daily and we go to hell right away right... No we have our whole lives to reach the Lord so prayers and repentance isn't gonna just work overnite especially if ones been sinning their whole life ... Consistency patience mercy kindness start building this behaviors to ultimately change.",
            "If I committed genocide but I was really really sorry about it and afterward felt I truly repented… would I be allowed into heaven?",
            "Raped someone? Forgiven!\nKilled someone? Forgiven!\nDon’t believe in god?  HELL for you!!!!!",
            "Thank you!",
            "Just a clarification - being gay isn't a sin. Acting on those feelings is. Being gay is just saying you are tempted in a specific way. It's not different from me saying I'm tempted to sleep with someone before marriage. It's what you do with that temptation that determines if it's sin.",
            "I did so much sex before marriage and I don’t feel the need to be forgiven for that at all.",
            "When I was a Catholic, the priest forgave me.",
            "I think this post is better suited to r/Christian because the tone seems a little out of place here.",
            "Note: you can be forgiven if you are gay as a Christian and repenting.",
            "Except blasphemy against the holy spirit according to Matthew 12:31",
            "Thank you for letting us know. I love context.",
            "Exactly! People forget to add this part. Continuing in sin just because God forgives you is never a good thing ",
            "Because it’s a sin.",
            "Because Christians think homosexuality is a sin.\n\nChristians pretend to know what you need.",
            "it is sin",
            "🎵 One of these things is not like the other 🎶",
            "Need to distinguish the inner tendencies vs the act of having relationships",
            "Two of my coworkers said that I looked gay and then told me being gay is wrong. My boss told me to ignore it, the hate, because they were under 18 and I’m an adult. \nI chose to call HR instead.",
            "The problem is not that you were gay. It’s repenting of sin, saying that you trust in Christ, but yet your heart tells the lord that you still live in sin and continue being gay. A renewed heart in Christ will seek to live righteously and for the lord, not for the desires of their own flesh.",
            "Not to mention how weird and insulting it is to lump \"being gay\" with actual harmful things. OP thinks he's making some great point by being like \"God forgives your if you murder someone! Or even if you're GAY!\"",
            "As someone who use to identify for a while, i promise its not your existence, its the lack of sanctification work you’re willing to let the Lord to do in you. This is absolutely the same for someone straight, struggling with lust. And simply for every area of your life. There’s no area He doesn’t wanna touch. No area He can’t!🤍",
            "This whole “their unchosen sexuality” is not true at all\n\nGod did not make you gay\n\nI wasn't naturally inclined to seek sexual relationships with just one woman. Instead, my heterosexual drive pushed me to pursue as many attractive women as possible. The notion that God made me this way isn't accurate; rather, I was born with a tendency that Jesus in the Bible refers to as a predisposition to sin.",
            "I know, I didn't put that cuz for some ppl it would be scary. ",
            "“God hates”?\nAre you into the OT?",
            "Exactly this. It’s about how we go about our lives. Are we actually living for God.",
            "I agree and I know that. ",
            "I know, only believers and followers of Christ and who repent,God bless you brother😊",
            "where did u get that out of? believe the gospel?",
            "If I committed genocide but I was really really sorry about it and afterward felt I truly repented… would I be allowed in heaven?",
            "Sorry if the post confused you, well you are forgiven if you believe in Jesus christ and God and repent, then you are forgiven. ",
            "if you stopped not believing in god you would also be forgiven the same way if you kept raping you would not be forgiven. Standards are universal, repentance is paramount.",
            "Thanks, I like helping people and bringing them out of their misery by the best true way possible, believing Jesus christ and following him to become better. Even though some people don't see that to me and think otherwise, we will always have enemies. ",
            "OK, just saying for those who are thinking they can't be forgiven from God but they can. ",
            "Wouldn’t that mean you would just have to repent your whole life just for who you love",
            "Yep, you are right I agree absolutely! ",
            "Which is rejection of obviously good things with a clear headed mind. For example, Jesus healed someone (did a good deed), the Rabbis said that was demonic, and he (paraphrased) said that it actually was not and when they reject good like this continuously and clear-minded-“ly” they are irreversibly rejecting God",
            "Hahahahahahaha!\nOh, you’re serious? :-/",
            "Good old fashioned parentalism,",
            "*some* Christians think that.\n\n\nThe rest of us realise that love is love",
            "No more a tendency than a straight couple.",
            "I have a coworker who often listens to homophobic sermons while at work. I don’t have an HR to report her to and it took management forever to find just her because it’s an overnight job and people don’t like to do that so they don’t want to drive her off",
            "When did you choose to be heterosexual?",
            "I certainly did not choose to be bi.",
            "Your are not naturally demisexual, you are a normal heterosexual whose sexuality is functioning as nature intended. It's not sinful. It's exactly the way God made you.",
            "It seems like you described yourself has having not chosen being straight then.",
            "Whereas telling them they need forgiveness for being gay is super-inviting?",
            "Jesus! (among others) ..\n\nMark 1:15 NASBS\nand saying, \"The time is fulfilled, and the kingdom of God is at hand; repent and believe in the gospel.\"",
            "Yes, but universal standards are not upheld equally",
            "Yeah I personally am asking for forgiveness this morning because as of now I'm out of food and starving and I feel like a failure.",
            "I think is repent once in your life for all your sins in a correct way and you will be forgiven. God forgives you multiple times, I think. Idk I'm wrong on the last one. ",
            "I'm pretty sure that's wrong; the very next sentence says it's forgivable to blaspheme against \"the Son of Man\" (a repeated appellation for Jesus). Where did you get this notion of what it means?",
            "1 Timothy 1:9-10 is translated as homosexual in many respected Bibles like NASB1995 and the ESV. If you are a Christian it is perfectly reasonable to believe it is a sin.",
            "\n\t1.\tLeviticus 18:22\n\t2.\tLeviticus 20:13\n\t3.\tRomans 1:26-27\n\t4.\t1 Corinthians 6:9-10\n\t5.\t1 Timothy 1:9-10",
            "Other than in your Bible, where else does it say that being gay is a sin?",
            "Not really. A parent loves their child but not the way they love their spouse.",
            "What is love? Since your claiming love is love. Without some standard of what love is. Love cannot just define itself.",
            "ask the Bible what it thinks, not yourself. Truly, the heart is decietful",
            "exactly",
            "That’s rough",
            "5th grade is when I realized I liked boys because a boy in my gym class got hit in the face with a dodgeball and didn’t cry. ",
            "This is the best comment I’ve seen in a long time. Thank you for making me laugh out loud! :)",
            "Yeah because some people that are Christians and they are gay feel they can't be forgiven cuz they are gay, don't feel accepted to God you know etc. They have their own thoughts and ways and not God's ways and thoughts. They need to change that although being gay is an abomination to God. ",
            "what translation is even that",
            "What exactly do you need forgiveness for?",
            "You are not a failure, trust me. Nobody is failure or a mistake. Do you mean it really of what you did? (I think yes). Pray: Heavenly father, I know I am a sinner and I know that I sinned. I ask you your forgiveness and have mercy on me,a sinner. In Jesus's name I pray, amen. ",
            "They did not just blasphemy the Son of Man though when they said the clearly good miracle was bad, they either blasphemed or were very close to blaspheming absolute good which comes from God and through his Spirit and the Spirits guidance , this is why blasphemy against the Spirit is unforgivable. I got this notion from the verse, the interpretation i gave here is actually pretty common",
            "Yes, because people understand there are different ways to love people based on the context of the relationship. That doesn’t change that love is still love in the end.",
            "Love is love",
            "God is love",
            "I agree and also ask God by praying to him😊",
            "The Bible says God is love",
            "So is the bible",
            "Wrong person, not the question, and really not necessary to throw in that it's attractive for men not to cry",
            "Being gay is not an abomination… oof. That is not an option on either side of the debate. It is all about what you do with your propensities and temptations.\n\nGod sanctions a marriage between a man and woman as good. Any sex (regardless of gender) outside a marriage between a man and a woman is called sin. Being tempted to have sin outside that sanctified relationship is not sin; Jesus himself was tempted. It is only what we do with our temptations that determines whether we sin.",
            "Apparently, looking around at life, God didn't thing same-sex activity was that bad.\n\n*\"Various non-human* [*animal*](https://en.wikipedia.org/wiki/Animal) *species exhibit behavior that can be interpreted as* [*homosexual*](https://en.wikipedia.org/wiki/Homosexual) *or* [*bisexual*](https://en.wikipedia.org/wiki/Bisexuality)*. This may include same-sex* [*sexual activity*](https://en.wikipedia.org/wiki/Animal_sexual_behaviour)*,* [*courtship*](https://en.wikipedia.org/wiki/Courtship_display)*,* [*affection*](https://en.wikipedia.org/wiki/Affection)*,* [*pair bonding*](https://en.wikipedia.org/wiki/Pair_bond)*, and* [*parenting among same-sex animal pairs*](https://en.wikipedia.org/wiki/Homosexual_parenting_in_animals)*\".* \n\n[Homosexual behavior in animals - Wikipedia](https://en.wikipedia.org/wiki/Homosexual_behavior_in_animals)",
            "Nasb with Strong's concordance.",
            "For not being able to provide food for myself for the next week or two. I know it's nothing that actually needs forgiveness but I just feel like such a failure and right now I'm so hungry that I can barely think.",
            "Thank you. I am so hungry and can't afford food.",
            "If we weren't talking about blaspheming the Holy Spirit, would you ever say Jesus couldn't perform miracles or do absolute good on his own? I've got to be honest, this all sounds quite made up",
            "Does God define love, or do I? Is God love, or are my feelings my God? “Love is love” declares that love stands on its own with integrity, meaning, and grace. But the Bible doesn’t square with this. The Bible says, “God is love” (1 John 4:8), and “Love does not rejoice at wrongdoing, but rejoices with the truth” (1 Cor. 13:6). In grammatical terms, “love” is a transitive verb. The integrity of “love” is found in its corresponding object. If you love what God loves, then love is a moral good. But if you love what God hates, love is a twisted sin. To suggest that love has integrity on its own terms is to render it an idol and wrench it from its moral anchor: the God of the Bible.",
            "You are not a prophet, you cannot know by asking him. You can only know by seeing what the scriptures say.",
            "You asked when someone decided to be heterosexual, I answered lol. \n\nMy little 5th grade brain thought he (the 5th grade boy, not a man) was brave for not crying because most kids would start bawling. I don’t care if men cry. As an adult I think it’s brave for men to cry and I have appreciated my boyfriend’s openness with me when he has cried in front of me :)",
            "If only I could give you food through the Internet",
            "I don’t know if this helps, but there used to be some churches and community centers that would give you government cheese and canned goods with no labels. If you get to that point.",
            "Are you seriously trying to pray away this person’s hunger?",
            "Jesus did good on His own...The miracles were done by the power of The Holy Spirit",
            "If you don't know what love is, it might be beyond my ability to show you in a Reddit comment ",
            "Thank you so much. I don't have enough karma to post in the PayPal and Cash app or Assistance subs unfortunately. So I'm thinking about just being done.",
            "Honestly I am SO hungry that it feels unbearable.",
            "I do not believe you would describe Jesus as unable to perform miracles without help if you were not trying to salvage your interpretation of the verse.",
            "I do know what love is. I am trying to understand what you are claiming is love as a Christian? The God of the Bible does not define love is love at all.",
            "The 3 manifestations of God have different purposes, and the issue with neglecting that is we end up with the issues you mentioned above. I want to ask you, why was Jesus conceived through the Holy Spirit according to the Bible? Why did he not conceive himself? Our answer is that they have different purposes, Jesus (the Word) if the perfect image of God and is the Fathers way of reaching us; the Father also creates using his living Word. The Holy Spirit is the Spirit that guides us, and it is the Spirit that makes you know right from wrong, to do miracles, etc… and they are inseparable and each one works in unison with the 2 other manifestations all being begotten and proceeded by the Father (Nicene creed 325)\n\nWhat is your answer to that?",
            "I'm not really interesting in having another le reddit atheist debate today thanks",
            "Good thing im not an atheist."
        ]
    },
    "Sex in Christianity Question": {
        "title": "Sex in Christianity Question",
        "score": 67,
        "url": "https://www.reddit.com/r/Christianity/comments/1dlnjl3/sex_in_christianity_question/",
        "content": "For context, I was raised agnostic/ Episcopalian. \n\nMy question for the Christian’s who believe there should be no sex for pleasure and that its sole purpose is for reproduction, then why did God great the female clit? Its sole purpose is pleasure, so why would it be there? I mean this totally respectfully, I’m just genuinely wondering! ",
        "num_comments": 103,
        "comments": [
            "God is not against anyone's orgasms.",
            "Lmao songs of Solomon has a whole ass erotica on the pleasures of sex. If they were rly Christian they’d understand sex was built to be pleasurable. Actually there’s a lack of evidence for sex only being for children in the Bible. Most cultural Christian’s don’t know what they believe in or bother to read what they identify into. Look towards Christ and not people who suck at following him.",
            "There are Christian puritans and there are Christians against purity culture but support celibacy, yes pleasure still applies to sexuality, but is not the sole purpose, it is an enjoyable act for the reason that it is sacred.",
            "From what I know God made sex for us to produce children and enjoy with our partner...so it's not really bad unless you pervert it....I might've missed something",
            "Who are these Christians who don't think sex can be pleasurable?\n\nDo you have a source?",
            "Most here don’t know how to even find it so no harm done lol",
            "I don’t believe that God only created sex for procreation. We are one of a few species that actively has sex for pleasure. All the parts are there for pleasure, so if we aren’t meant to have it for pleasure and it’s meant to solely be a job to produce children I don’t see the point in the number of nerve endings in the clit, and the penis and the erogenous zones. Besides “be fruitful and multiply” there is no good Biblical evidence for sex being intended for procreation but there is evidence for pleasure derived from sex. Our bodies could be solely designed for procreation and not deriving any pleasure from sex if that’s what God wanted. Because I don’t think he would have given us something he didn’t intend for.",
            "God made sex to be pleasurable along with the other major roles it plays. Procreation, pleasure, and protection! Procreation is obvious as that is how we multiply. Pleasure so a man and wife can enjoy themselves and grow closer to one another! Song of songs is all about experiencing the pleasures of the other. Protection. Sex with your spouse will help their needs and keep them from going astray. If you are receiving plenty of pleasure from your spouse, would you seek it elsewhere? And vice versa, if you pleasure your spouse frequently, wouldn't you expect them to not wander off? Don't get me wrong, there is absolutely no excuse for adultery, however, 1 Corinthians 7 tells us to come together often so that Satan will not tempt you! So yes, you can have pleasure in sex with your spouse! Save yourself for marriage, then go wild and enjoy!",
            "I've never heard anyone put it that way. 😅 I'm a Christian who believes sex can be done for pleasure and that pleasure is one of the incentives for sex. It almost makes me sad in a way. Like if there was no pleasure in sex would I just not have been born? Is that all people care about. smh",
            "Protestants ruined everything.",
            "If God made it painful do you think people would do it?",
            "I think when it says pleasure it is more so meaning that you don’t do it as a recreational act, but do it with the purpose of creating. Don’t have sex with random people(one night stands, flings) because all it does is break you, but if you have having sex with someone who you are going to marry and build something with or genuinely love them then procreation is ok I guess.",
            "Sex is a part of the relationship between a husband and a wife, that was also created as a way of making children in our belief. It is enjoyable and can be done for enjoyment but God doesn't will (in our our belief) for us to do it in ways that are against His design for it, including dangerous to both health and social relationship ways like with multiple people, people who you don't trust to act safe and respect consent, and other rules.",
            "God gave us sexual bodies, full of pleasure. This isn’t just for producing babies. Sex in marriage should be a feast of pleasure (I think Dr. Allender said that in God Loves Sex). \n\nNot only that, but we should enjoy our bodies while we’re single. Our body’s pleasure is for us to enjoy alone in our own privacy. God designed sexual pleasure and it’s good! Strive for a positive view of sex and your body. There is no need to shame ourselves for enjoying what God gave us.",
            "Paul: \"it is better to marry than to burn (with desire)\"\n\nKids aren't mentioned there. Only desire. If you are free of that desire then he would rather you be like him (Paul) and refrain from remarrying (he was married at one point). If you have desires then he suggests marriage as a way to express them lawfully",
            "God: stop being so terrible to each other and just love one another \n\nMan: so does this mean I can’t have orgasms?",
            "Not many Christians follow the no sex outside of baby making in the 21st Century.",
            "So thanks OP for the wise question. Sex, religion, Christianity, The Great Jesus Christ and the greatest, God -a very interesting question with many wise viewpoint expressed here. I type like its of insignificance yet it really is of huge significance in the context of questions asked on reddit 🙏\n\nSex for pleasure, nothing sinful  about it and as you speculate parts of the human anatomy indicate they are there for pleasure only. \n\nWe can only ultimately on everything, ultimately knowing God is infinite intelligence speculate on the purposes of these parts 😊\n\n\nMany people (in front of God, I had a very uncontrolled sex drive at various points in time my life,  a single guy on a human level for the majority of my life) continue to paint a distorted picture of sex and religion. \n\nIt remains the highest pleasure on the physical plane- the physical union of two (or more in cases 😊🙏) human forms. \n\nI assure you there is nothing wrong for seeking/having sex for pleasure in this day and age within certain guidances (ofcourse no infidelity after marriage vows, for example- i act like this is nothing,  the amount of betrayals that will take place today...shameful🙏 make sure its mutually beneficial  🙏😊)\n\nYet many people make it genuinely the salvation of life (i was genuinely guilty of this for periods 🙏) and it genuinely becomes a problem to true spiritual progress, closeness with God.",
            "You can have as much as sex you and your spouse \"together\" needs .not every sex results in a child, share your sex life with your spouse and only ,not alone or with other than your spouse. Don't use any protection, but you can keep track on natural birth control like using the menstrual calendar",
            "Sex is good only for those bonded in marriage. All other manner of it outside marriage is sin. Of course GOD did give everything we need to enjoy but choose wisely that you cherish in godly path alone.",
            "Honestly I don’t even think god is against sec before marraige, as long as you find your person one day!!",
            "It’s made to be a pleasurable way to produce children within marriage.",
            "God intended sex to be pleasurable and for reproduction and for a man and a women who are married.  Anything else is a sin if you believe the Scripture.",
            "If they’re husband and wife and not doing it for pleasure but for child birth it’s not a sin but doing it for pleasure that’s a sin it’s lust",
            "I think you mean, \"God hates pedophiles\".",
            "fax",
            "The Song of Songs, also known as the Song of Solomon, is a biblical book of poetry that celebrates romantic love and physical desire. It is often interpreted allegorically in Christianity, symbolizing the love between God and His people, or Christ and the Church. Its value lies in illustrating the beauty and sacredness of love and marital intimacy.",
            "Paul clearly condemns it and recommends that you stay a virgin for the rest of your life but if it's too difficult, you should get married 1 Corinthians 7:8-9 says \"Now to the unmarried and the\nwidows I say: It is good for them\nto stay unmarried, as I do. But if\nthey cannot control themselves\nthey should marry, for it is better\nto marry than to burn with\npassion\"",
            "It is not the sex the focus lies on it is the relationship between Jesus/God and the church",
            "Beautiful explanation",
            "No, pretty straightforward, actually. God bless you.",
            "There are some that believe that. They are just really rare, and becoming rarer.",
            "I've agreed with a few of them in this sub. They tend to be kids parroting something they heard, or older conservative folk.",
            "What is your story my brother in Christ and why did you  choose orthodoxy, genuinely curious.",
            "It’s a long way from pleasure to pain. Absence of pleasure is not pain, and the nerve endings would still need to be there to properly communicate pain to the brain.",
            "You can have recreational sex with a long term partner, even spouse. It doesn’t always have to be for procreation.",
            "So does that mean a married couple should stop having sex once they can't have kids anymore?",
            "Except this isn’t biblically supported.",
            "He is",
            "Who said that it was about children",
            "What makes you think that? Is there a verse or something? Not trying to argue or anything I’m just wondering",
            "What a waste of a gift from God.",
            "No. A married couple should be able to have sex just for the act of sex. For the act of connecting and uniting. Women can only get pregnant a few days a month, so that would not be lust. Also the sexual desire itself isn’t wrong. No biblical evidence for this position.",
            "Lust is an overindulgent term though. Like gluttony, greed etc.\n\nAll those things can bring pleasure but when that pleasure becomes an obsession, that's where the pleasure ends and the pain begins.",
            "Those who downvote the Bible talks about sexual immorality and if ain’t married can’t have sex try again clowns out there who hate hearing the truth",
            "Yeah that and he also said it was better to be single so that you can devote 100% of your time to God as well.",
            "Paul never said he was a virgin.",
            "Basically what he was saying here was no matter what you do make sure you glorify God in it.",
            "Actually he says men that can’t control their urges should marry but there are some that will be celibate like him",
            "I didn't see where he condemned it. Paul was married himself. He had to be to be a Pharisee",
            "And that is just Paul's opinion.\n\nWe gotta stop putting these words of men on such a high pedestal.\n\nHe had his thoughts and opinions and their neither right nor wrong.\n\nGod created this world and all its pleasures for us to enjoy - for us to enjoy as we walk through this existence with him.\n\nI truly believe the Bible has more of the thoughts of the writers in it then sometimes us Christians want to admit. It gives us some level of comfort having direction from someone tangible we can point to.\n\nGod is not in the Bible and God is not the Bible. The Bible is a written record of historical events and does contain truth, but you don't need the Bible to know God.",
            "Highly questionable. This was written a thousand years before Christ came to this world. King Solomon was also known as a lover of many women. It's clearly about his first \"love\"  Abishag the Shulammite, the beauty that had been selected to warm Solomons father king David's in his old age (he was too old to \"get it up\", so no problems there). That is the plain reading of the text. While Christianity should focus on Jesus' life and teachings, not everything in the bible is about that.",
            "That is not an allegory, my friend. Romantic love and sexual desire are not at all why Jesus came to earth and died on the cross. I don’t think at all we are meant for a similar relationship with Jesus. His love was a sacrificial love, a serving love. Not erotic.",
            "The problem with \"allegory\" is that when we look at a passage or book of the Bible we have to try to understand it as close as possible to the way the original audience to whom the oral tradition/books were given would have understood it. Would *they* have understood it as allegory to the relationship between Jesus/God and the church/Israel? Would *they* have understood allegory at all? \n\nThey certainly wouldn't have understood it as allegory to the relationship between Jesus and the church, because, if it was written by Solomon, it was written in approximately the 10th century BCE (more likely 3rd century BCE), well before Christ in either case. Thus, *we* shouldn't understand it that way because that can't be how the author intended it, because he intended it to be understood by a contemporary audience.\n\nSong of Songs 8:4 *Promise me, O women of Jerusalem,*\n\n*not to awaken love until the time is right*.\n\nSong of Songs 8:8-9\n\n8 *We have a little sister too young to have breasts.*\n\n*What will we do for our sister if someone asks to marry her?*\n\n9 *If she is a virgin, like a wall, we will protect her with a silver tower.*\n\n*But if she is promiscuous, like a swinging door, we will block her door with a cedar bar*.\n\nI think the meaning is quite plain.",
            "Well that is the purpose of sex in itself to create a new life, yes there are actions were a women is not able to give birth, but generally speaking sex is for creation as well to unify to separate beings(men and women of course, hints why a penis can enter into a vagina)",
            "They still very much can because they already created children number 1, and number 2 they are unifying themselves spiritually when they do so it’s still ok. Example of my past point, if I slept with 30 women as far as flings, one night stands and little situationships but knowing I would never take them serious is “pleasure” because this is pleasurable for most men but…… it’s not purposeful in what God had in mind.",
            "K",
            "Sex isn’t a gift from god so try again when you read the Bible",
            "Majority of people when they do anything sexual they just which makes it a sin cuz it’s sexual immoral and people don’t like hear it so they downvote",
            "Yep, 1 Corinthians 7:32-34",
            "And never have a tent making business....wait but he did.\n\n[Edit]\n\nActs 18:1-4\n\nAfter this Paul[a] left Athens and went to Corinth. 2 There he found a Jew named Aquila from Pontus, who had recently come from Italy with his wife Priscilla, because Claudius had ordered all Jews to leave Rome. Paul[b] went to see them, 3 and, because he was of the same trade, he stayed with them, and they worked together—by trade they were tentmakers. 4 Every Sabbath he would argue in the synagogue and would try to convince Jews and Greeks.\n\nhttps://www.biblegateway.com/passage/?search=Acts+18%3A1-4&version=NRSVUE\n\nNot really 100% of the time.",
            "He didn't say HE was a virgin he said you you should stay unmarried like he is. Where he says you should stay a virgin, read 1 Corinthians 7:8-34",
            "Yes and it's better to stay unmarried",
            "No, he says you SHOULD stay celibate and get married if you can't.",
            "1 Corinthians 7:1-2",
            "So f everything Paul said because it's his opinion? These are the new testaments and everything he says should be followed",
            "…did you read it??",
            "What?",
            "You forgot v35\n\n1 Corinthians 7:32-35\n\n32 I want you to be free from anxieties. The unmarried man is anxious about the affairs of the Lord, how to please the Lord, 33 but the married man is anxious about the affairs of the world, how to please his wife, 34 and his interests are divided. And the unmarried woman and the virgin are anxious about the affairs of the Lord, so that they may be holy in body and spirit, but the married woman is anxious about the affairs of the world, how to please her husband. 35 I say this for your own benefit, not to put any restraint upon you but to promote good order and unhindered devotion to the Lord.\n\nhttps://www.biblegateway.com/passage/?search=1+Corinthians+7%3A32-35&version=NRSVUE\n\nBecause v35 is where Paul couches the whole explanation. His purpose is to promote devotion to God and not to put a restraint on anyone. So it's not an order. It's just advice. His advice to be more precise.\n\n[Edit]\n\nIow there's no condemnation here.",
            "Again what Paul is saying is don't change your life after becoming Christian only do your best to glorify God in all ways. \n\nTo put simpler he is saying don't focus too much on being single or getting married only focus on God and glory him through your life.",
            "If you make a firm decision and can control yourself",
            "Paul also wrote this:\n\n“But the Spirit explicitly says that in later times some will fall away from the faith, paying attention to deceitful spirits and doctrines of demons, by means of the hypocrisy of liars seared in their own conscience as with a branding iron, men who forbid marriage and advocate abstaining from foods which God has created to be gratefully shared in by those who believe and know the truth. For everything created by God is good, and nothing is to be rejected if it is received with gratitude; for it is sanctified by means of the word of God and prayer.”\n\n- ‭‭1 Timothy‬ ‭4‬:‭1‬-‭5‬ ‭NASB1995‬‬\n\n“the Spirit explicitly says” —> “doctrines of demons” = “men who forbid marriage”",
            "Take what he and other men said with a grain of salt.\n\nFollow God's direction. He will speak to you if you listen.\n\nIf you feel God is telling you to listen to Paul - good. Nothing wrong with that.\n\nBut don't make a blanket statement that we should follow Paul and everything he said simply because.\n\nPaul was still a man with his own beliefs and opinions.\n\nI view the Gospels as far more important than the letters. I think we need to discern for ourselves and follow God moreso than blindly follow.\n\nBut, that's just my opinion",
            "Paul spent 1 day out of the week on the Gospel.",
            "Paul was not married during basically everything we have written by Paul. But that doesn't necessarily mean he hadn't been married in the past. \n\nThere are good arguments both ways, and we don't have enough evidence to definitively rule out one or the other, in my opinion.",
            "Ok, I've just read the entire chapter and I think I didn't read your comment properly at first. \n\nOk, I understand your point now. However, Paul says it's better to not have sex in verse 1 and stay unmarried in verse 38.",
            "[deleted]",
            "Um, no. He is directly saying don't get married",
            "Exactly. What's the problem then?",
            "Did I forbid marriage?",
            "Yep, that's just your opinion. I'll take Paul's side thank you",
            "Oh I see what you mean. So even Paul wasn't following Paul, is your point? \n\nIt could be argued that sex is different than making tents I guess.",
            "During that time (because a chapter or 2 later it says he worked for 2 years in a row to spread the Word), so what? Acts 9 and others show us that he was visibly (in front of witnesses) given the Holy Spirit, and he has authority from the disciples and Jesus himself to preach in his name.",
            "Paul had a life before he was a Christian. What did he do then? What sex did he have then? We just don't know.",
            "Yeah it's better for devotion. But he's not saying marriage is bad on the contrary it has it's place and he also shares what married people should do.",
            ">Yes and this restraint would be your partner.\n\nNo. This is not what it says. You just can't make whatever you want up.",
            "You should try reading the entire chapter \n.",
            "Will and ability. Most do not have these. But also it's not a problem really: being married is good, being unmarried for the sake of Kingdom is better (unless you fall into sexual sin because of that I suppose)",
            "No, my point is that people should put their own ideas into the scriptures they read.",
            "Just showing that you shouldn't read your own ideas into the scriptures like the phrase 100% of the time when reality is much more complicated.",
            "Glad we agree!",
            "Acts 23:6 is where he said he was a Pharisee. You had to be married and head of your household to be a Pharisee. So he was married at one time.",
            "Yes and it would be better if every Christian was devoted. I never said marriage is bad, when did I say it's bad?",
            "[deleted]",
            "Alright I've just read the whole chapter and it supports my argument. Paul says that it's better to not marry and stay a virgin in verse 38. \n\n\"Now for the matters you wrote\nabout: \"it is good for a man not to\nhave sexual relations with a\nwoman.\" But since sexual\nimmorality is occurring, each man\nshould have sexual relations with\nhis own wife, and each woman\nwith her own husband.\"\n\nThese are the first 2 verses if the chapter, how can you interpret that in any other way.",
            "Yes being married is good but being unmarried is even better. Paul says this in 1 Corinthians 7:38",
            "My point was i believe that it’s not clear he only worked on sabbaths, and there’s dozens of times we hear or read that he did way more than just this this before and after this verse indicating that this was just during this stay.",
            "Interesting. This article \n\nhttps://www.gotquestions.org/apostle-Paul-married.html\n\nReferences that you had to be married to be part of the Sanhedrin. And yes I read that he was indeed a Pharisee and son of a Pharisee. \n\nIn the following link there's seems to be a conflict on whether Pharisees are required to be married.\n\nhttps://hermeneutics.stackexchange.com/questions/62698/did-pharisees-have-to-be-married-phil-34b-6",
            "Right you didn't say marriage was bad. I think I got confused with all the different discussions on this thread.",
            "No. It's not there.",
            "It's a pity we don't have the letter Paul is responding to, that might make things more straightforward for you.\n\nthis passage is actually bracketed by Chapter 5, where Paul responds to reports of incestual relationships being celebrated by the Corinthians.\n\nIn 6, Paul does some theology to back up his positions on sexual morality and why he thinks it matters- Bodies are involved in the resurrection, and we are raised in Christ, therefore our bodies are joined to Christ, therefore you shouldn't commit sexually immoral acts with your body.\n\nNow we come to 7 - you'll notice that the \"it is good\" part is in quotes, as if Paul is quoting the part of the letter he is responding to. Were the Corinthians asking \"*is* it good for a man to abstain from sex?\" Or perhaps they had not asked, and instead declared \"it *is* good for a man to abstain from sex with women.\"\n\nPaul's response indicates that he's still more worried about all the reports he's getting about Corinthians celebrating incest and *malakos* and *arsenokoites* (the highly contentious words often translated to mean homosexuals.)  because he starts in with \"since sexual immorality *is* occurring...\" which conditions his advice in terms of the Corinthian situation.\n\nPaul's pretty straight with his assessment of why he thinks this is good advice for the Corinthians in vs 5- \"you guys have *no* self control!\" There's a larger theme here about Paul's pseudo-stoic ideas about sex and passion, but that's a digression. vs 6 should be a big signal that this advice is for non-ideal situations. \"I'm not trying to talk *down* to you, I want everything good for you that I have for myself- but consider maybe you didn't receive gifting of self-control like I did.\"\n\nThis read is backed up in 8 - 9: \"If you have passions threatening to overtake you, get married! Otherwise, don't change your situation, because maybe you're actually more like me. Just don't make yourself miserable because you want to imitate me.\"\n\ndoes that analysis help clear things up at all?",
            "Well, it's unclear how much he spent on the Gospel and how much he spent working. What seems reasonable is that tent making would be an ongoing thing for him. You can't learn a trade just in one stay. It's probably an ongoing gig. One that he started before this stay and continued after this stay. And if it's a daily thing he probably had no reason to write about it.",
            "[deleted]"
        ]
    }
}