{
    "❓ \"Is Cities: Skylines II Worth It?\" megathread": {
        "title": "❓ \"Is Cities: Skylines II Worth It?\" megathread",
        "score": 96,
        "url": "https://www.reddit.com/r/CitiesSkylines/comments/1d58qe9/is_cities_skylines_ii_worth_it_megathread/",
        "content": "# \"Is Cities: Skylines II Worth It?\" 🤔\n\n... is one of the most common questions we see on the subreddit at the moment, leading to dozens of duplicate posts asking essentially the same thing: Should I buy the game or not?\n\nIt is our intent that this megathread will help collect information to help you make your decision, and provide a place to ask for more subjective opinions from community members. \n\n## General FAQs\n\nIf you're after general information about or help with the game (e.g. features, minimum or recommended specs, the situation related to modding, when the game will release on consoles), check out our wiki articles below. They'll provide you a decent base level of knowledge and help you understand more about the features and limitations of the game.\n\n- [Getting Started](https://reddit.com/r/CitiesSkylines/wiki/faq_gettingstarted_cs2)\n- [Common Gameplay Issues](https://www.reddit.com/r/CitiesSkylines/wiki/faq_gameplay_cs2/) \n- [Hardware Advice](https://reddit.com/r/CitiesSkylines/wiki/faq_hardware_cs2)\n- [Downloadable Content (DLC)](https://reddit.com/r/CitiesSkylines/wiki/faq_dlc_cs2)\n- [Modding and Custom Content](https://reddit.com/r/CitiesSkylines/wiki/faq_modding_cs2)\n\n## Patches and Bug Fixes\n\nAs of 2023-05-01 there have been 10 patches for the game. These patches have included over 400 changes to the base game. These include both major changes (addition of LOD models for citizens, introduction of modding support) and minor changes (updates to localisation text). You can review the change log for each patch below: \n\n* **1.0.11f1 (2023-10-26):** [9 row change log](https://cs2.paradoxwikis.com/Patch_1.0.X#1.0.11f1)\n* **1.0.12f1 (2023-11-02):** [17 row change log](https://cs2.paradoxwikis.com/Patch_1.0.X#1.0.12f1)\n* **1.0.13f1 (2023-11-09):** [18 row change log](https://cs2.paradoxwikis.com/Patch_1.0.X#1.0.13f1)\n* **1.0.14f1 (2023-11-16):** [21 row change log](https://cs2.paradoxwikis.com/Patch_1.0.X#1.0.14f1)\n* **1.0.15f1 (2023-12-01):** [46 row change log](https://cs2.paradoxwikis.com/Patch_1.0.X#1.0.15f1)\n* **1.0.18f1 (2023-12-14):** [42 row change log](https://cs2.paradoxwikis.com/Patch_1.0.X#1.0.18f1)\n* **1.0.19f1 (2024-01-31):** [63 row change log](https://cs2.paradoxwikis.com/Patch_1.0.X#1.0.19f1)\n* **1.1.0f1 (2024-03-25):**  [65 row change log](https://cs2.paradoxwikis.com/Patch_1.1.X#1.1.0f1)\n* **1.1.1f1 (2024-04-02):** [12 row change log](https://cs2.paradoxwikis.com/Patch_1.1.X#1.1.1f1)\n* **1.1.2f1 (2024-04-25):** [107 row change log](https://cs2.paradoxwikis.com/Patch_1.1.X#1.1.2f1)\n\n**_OK, but have those patches actually changed anything?_**\n\nCommunity member /u/Safe-Economics-3224 created a benchmark in the weeks after launch and has continued to post results after each patch has released. These give a good indication as to how performance has improved over the life of the game so far:\n\n- [1.0.12f1 (2023-11-02)](https://reddit.com/r/CitiesSkylines/comments/17o8ke7/created_a_benchmark_to_accurately_measure/)\n- [1.0.13f1 (2023-11-09)](https://reddit.com/r/CitiesSkylines/comments/17syube/patch_1013f1_hotfix_updated_benchmark_results_and/)\n- [1.0.14f1 (2023-11-16)](https://reddit.com/r/CitiesSkylines/comments/17ygxuj/patch_1014f1_hotfix_updated_benchmark_results_and/)\n- [1.0.15f1 (2023-12-01)](https://reddit.com/r/CitiesSkylines/comments/188zho8/patch_1015f1_hotfix_updated_benchmark_results_and/)\n- [1.0.18f1 (2023-12-14)](https://reddit.com/r/CitiesSkylines/comments/18kccdb/patch_1018f1_hotfix_updated_benchmark_results_and/)\n- [1.0.19f1 (2024-01-31)](https://reddit.com/r/CitiesSkylines/comments/1agy7ei/patch_1019f1_hotfix_updated_benchmark_results_and/)\n\nUnfortunately, /u/Safe-Economics-3224 has gone quiet since this the 1.0.19f1 patch and we've not been able to identify another reliable source of consistent benchmarking results. Big thanks to /u/Safe-Economics-3224 for all of the great work they did on behalf of this community.\n\n## What have the devs been saying?\n\nThe main channel of \"formal\" communication from the developers comes via the Word of the Week blog post shared each Monday by the Colossal Order CEO in the Paradox Forums. We maintain an accompanying megathread which captures a lot of player feedback and reactions to the news shared each week. \n\nAs these are shared weekly, the best way to catch up on past posts is to browse the [Dev Diary flair](https://reddit.com/r/CitiesSkylines/search?sort=new&restrict_sr=on&q=flair%3ADev%2BDiary) and dip into the more recent ones. Unfortunately, this link won't work on Reddit's mobile apps (please [tell Reddit if you'd like this fixed](https://support.reddithelp.com/hc/en-us/requests/new?ticket_form_id=23708886396180)) but in the meantime you can go to the main page of the subreddit and use the \"filter by flair\" options provided.\n\n## Live Gameplay Videos\n\nIf you're interested in seeing how the game is playing today, you can check out recent videos or streams from YouTube and Twitch. These will show you the \"real\" game, not marketing videos. As there is only limited mod support for the game at this stage, what you see will _broadly_ be vanilla gameplay and will help you understand how the game is performing at the moment.\n\n- [Cities: Skylines II game page on YouTube, sorted by Recent](https://www.youtube.com/channel/UCVM37E_mrP2kufE8Uu-YOSg/recent)\n- [Cities: Skylines II category page on Twitch, sorted by Recent](https://www.twitch.tv/directory/category/cities-skylines-ii?sort=RECENT)\n\n## Reviews\n\nMany critic reviews aren't necessarily reflective of the _current_ state of the game. That said, reviews are helpful sources of information to help you decide whether or not to drop your cash on any new game, not just Cities: Skylines II.\n\n- [Metacritic Page](https://www.metacritic.com/game/cities-skylines-ii/) (includes both critic and player reviews)\n- [Steam Review Page](https://store.steampowered.com/app/949230/Cities_Skylines_II/#app_reviews_hash) (you may wish to use the provided filters to show more recent reviews)\n- [Microsoft Review Page](https://www.xbox.com/en-GB/games/store/cities-skylines-ii-pc-edition/9PGZ346PSLN0) (you may wish to sort by \"recent\")\n\n## Try Before you Buy\n\nIf you're still unsure, Cities: Skylines II is available on Microsoft Game Pass for PC, which is a subscription service at a much lower monthly cost than the full retail price of the game. Microsoft is currently offering an initial 14-day trial for as low as £1/$1/1€ (which renews at full price after the 14 days).\n\n- [US$1 Game Pass Trial](https://www.xbox.com/en-us/games/store/xbox-game-pass-ultimate/cfq7ttc0khs0)\n- [£1 Game Pass Trial](https://www.xbox.com/en-GB/xbox-game-pass)\n- [1€ Game Pass Trial](https://www.xbox.com/en-IE/games/store/xbox-game-pass-ultimate/cfq7ttc0khs0) (this link goes to the Xbox Ireland store, check the local Xbox site for your country before proceding)\n\n## Refunds \n\nIf for any reason you can't make use of a discounted Game Pass for PC subscription (i.e. it may not be available in your region), you have the option of purchasing the game and refunding it within the store's refund window.\n\n- **Steam:** Request a refund within 14 days of purchase, as long as you haven't accrued more than **2 hours of total playtime** \n- **Microsoft Store:** Request a refund within 14 days of purchase, as long as you haven't accrued \"a significant amount of play time\"\n\nRecognising that you may not be able to reach the \"late game\" within 2 hours, you can use [this 100k benchmarking city](https://www.reddit.com/r/CitiesSkylines/comments/17fg7z9/benchmark_your_pc_using_this_100k_population/) to establish whether or not you're comfortable with the performance on your system.\n\n## Specific Questions\n\nIf you've got specific questions about items not covered in these FAQs, feel free to ask them below. If you've been redirected to this post by a removal notice, please understand that this is done to help keep the subreddit tidy by providing a centralised and dedicated location for **all** information related to this topic. \n\n___\n\n&nbsp;\n\n^These ^megathreads ^are ^scheduled ^to ^post ^at ^00:01 ^on ^the ^first ^day ^of ^each ^month. ^If ^it's ^late ^in ^the ^month, ^you ^may ^want ^to ^wait ^for ^a ^new ^post ^to ^appear. ^Please ^send ^us ^a ^[ModMail](https://www.reddit.com/message/compose?to=%2Fr%2Fcitiesskylines) ^with ^any ^suggested ^improvements!",
        "num_comments": 128,
        "comments": [
            "It's fun to play with the new roads (especially smooth highway connections) and the assets fun lasts for a bit. After many many hours though, it becomes dull and boring. \n\nI've been waiting over 7 months for metro crossings. Not even elevated metro, just a simple road crossing. Code mods have helped with some things, but a lot is missing. WAY too many half baked ideas in the game such as:\n\n- Tourism (barely exists)\n\n- Snow mechanics\n\n- Transit (lack of vehicles, mechanics such as forcing a limit of vehicles + more)\n\n- Metro (no elevated, no metro crossings, underground connections are a pain)\n\n- Bikes\n\n- Economy (maybe fixed/starting to be fixed in next patch)\n\n- Service buildings (way too big, no variety)\n\nMany more i'm sure I missed",
            "I have the game but haven't opened it since launch.  Are there any mods yet to change the look of the game?  When I see screenshots the lighting is always weird and bland.  Like overcast but with hard shadows.  It doesn't look right to me.  I saw someone play a desert map and it was way too saturated.",
            "Yes, but not to play hundreds of hours. \nCommunity assets are missing and that for me the only thing missing now. \nParadox mods sucks. Every time I launch the game I have to wait for mods update, close the game, reopen, reclose the game. Then sometimes it works, sometimes it’s not. Well big crap.",
            "After a few month i gave it a second shot. With mods there are more option to fix some \"bugs\". However, after a few weeks i'm tired of all the crashes (every time i play the game it crashes at least once), the bugs (super weird bugs), the traffic (no chance of doing something against ist), the performance (with 4080, 64gb ram and i7 i play with super ugly textures and my GPU is at 95% ). Its really frustrating as i really want to have fun. But it's more off a me cussing in front of my PC instead of having fun. I really hope they'll fixing it",
            "If this game gets itself fixed up soon then it's worth it, if they start spamming out dlc, then no, it won't be worth it.",
            "My game literally won’t load with mods but without is fine",
            "A lot of the answers in here are just being intentionally pessimistic. I think if anyone is looking *right now* and considering, wait a tiny bit longer and check again. They'll be releasing the economy rework (among a few other things) in the next week or two, which might make a substantial difference in a lot of the gameplay issues. There's still a lot of other stuff they need to address afterward, but you won't have to wait long to see if it makes a difference.",
            "If you haven't purchased it yet, you could probably hold off a little longer and wait until a game of the year version or a big sale.",
            "Not really, the game is bland and boring outside of the bugs.  This company kind of shot themselves in the foot not changing engines and making the game look and feel better than the first game.  It would have been far better to take the old game and just offer and upgrade along with the 100s of dollars in expansions we already bought along with it.",
            "I am waiting until they finish the game. It seems to me everyone who brought CS2 brought a beta. I just got CS1 and it is crazy to have 43 DLC's so far and I guess one more is coming Landmark Buildings which I see when I open the gave in a window above my listed DLC's.",
            "If you are a detailer that wants to build a realistic american city using 40 mods, then Yes. If you just want to play a city builder, then No. Simple as that for me.",
            "No. It hasn't been and still it's not.",
            "No. And at this rate it hardly has a future",
            "I think I'd like to get CS:II now that it has mod support but I have a few questions.\n\n\nAre essential mods like Move it! In the game? Any big missing ones?\n\n\nI rarely game much except on my steam deck. Anybody know if this game is playable on there yet? All SD reviews I've found are from launch. ",
            "I'm hoping I can say yes one of these months, but sadly still no.",
            "Current state no.   Once asset editor releases.  Maybe",
            "No it's not, the simulation is broken, the assets are ugly and look all the same and the grid breaks all the time\n\nI'm not even talking about performance\n\nSomeone just port the cs2 road tool to cs1 so we cam bury this mess",
            "The biggest thing for me is the lack of props. I like detailing and creating little spaces that make my cities look nice, and lived in. Benches, fountains, the little food cats. That was where a lot of the fun in Cities 1 came from for me. Can't do that yet, and until I can Cities 2 isn't what I'm looking for.",
            "No, because there is no variety in architectural styles yet, although I am glad that the new Sully mod which allows for a lot of details has been released.  but for me, the variety of architectural styles is important.",
            "Not in the current state. It’s kinda bland.",
            "I've been checking in and it seems like since release performance has gotten better and there are mods. But that's it. Now you move into the economy and simulation being fundamentally broken, the ancient tile system that an indie game made by one person made better instantly and lack of assets.\n\nMaybe later this year? Maybe...",
            "I wonder if preformance still sucks (rtx 3080, i5 13600KF and 32gb 3600mhz ram)",
            "I don't own the game but waiting for a sale I read on PC gamer that they are removing rent mechanic. Is that true and if so is there a mod to add it back in??",
            "if you have a good PC and don't care about getting asset variety it's pretty decent, and it's hard to go back to 1 after you're used to the improved scale and tools of 2.",
            "Short answer: no\n\nLong answer: noooooooo",
            "I think so 100%, as long as you have a semi-competent computer, it’s pretty good. I’ve completely switched to C:S2 from C:S1. Lack of asset mods has been lame, but that will be added soon enough!",
            "No.\n\n  \nI'm a completionist and spent over 300 hours trying to get 100%, only to get 98% because the last achievement won't fucking unlock for anybody in the world.",
            "If you want to play more than 20 hours, no",
            "Has the dawn strobing bug been fixed yet?",
            "I plan to build a new PC in the coming 8 to 12 months. But until then, has anyone been succesfully running the game with an 7th gen I7 and a 3060?",
            "I'm thoroughly enjoying it and would not go back to CS1.",
            "no.",
            "No, but perhaps the update coming this month on the economy and being able to add assets might change my vote to a maybe... Possibly a yes.",
            "I don’t think anyone mentioned this yet so I’ll put my 2 cents. If it’s your first city builder then I think it’ll be worth it, it takes time to get into mods and assets starting out (at least for me), so I think given time, you’ll get better with the game and experiment with mods as more is done, at least that’s what we should expect from the devs at least?",
            "I've recently picked it back up. Where I was hesitant before, I can fully recommend it now\n\nRoad building is genuinely fantastic. Whatever complex intersection you want, it just works\n\nThe in-game assets all look quite good. The different zoning types create a lot of variety\n\nPerformance has not been a major issue for me (3069 Ti)\n\nI don't really know about the economy as I have only played on infinite money\n\nAnd now with mods, detailing is also amazing. I'd say it's almost easier and better than CS1 already.\n\nThe only thing missing is custom assets. A big miss, but they will hopefully come soon. Luckily the base assets look quite good so it's not as big of a miss as it was for CS1",
            "It is. Road tools alone makes the game better than CS1. Once assets come in, it's over",
            "Nope.",
            "I'm sure there is a good article somewhere that lists features the cs2 has that cs1 does not have even with mods. any good recommendations?",
            "Have the graphical issues improved? I purchased CS2 day of release and there were an incredible amount of graphical issues such as clipping (I forget what the actual term is). My computer can run any game.",
            "I'm having significantly better performance on my 2070.",
            "Is it worth playing without mods? The only way I could play nowadays is with geforce now and it doesn't support mods...",
            "No, I honestly refuse to buy paradox products because of this games failure.",
            "Nope. Still needs another year. Unless it gets abandoned before then, which also seems likely.",
            "I've already decided that I'll wait a while. Somemething like a year or so, maybe",
            "to people commenting just yes or no, you are unhelpful. \n\nas someone who recently started playing the game via xbox gamepass (just $10 a month) I'd say this would be the best way to evaluate if the game is for you. after putting in like 20 hours, I'd say I'm pleased with the game despite it's bugs and flaws. literally daily, mods are getting added/updated to PDX mods. in my opinion, most essential QOL mods are basically already there so I'd vouch for the game. \n\nall that being said, I'm still going to wait for a sale to pick it up but until then, I'll get to enjoy it and a few others on gamepass.",
            "Yes. With obviously a ton of nuances.\n\nI'd say you have to be a fan of city building and urbanism, for a casual player there's not enough fun and challenge in core mechanics to keep you entertained for long, but we're slowly coming there with mods and upcoming patches and content.\n\nIt's more a city painter than a city simulation. Detailers can already do mad things, I see more and more screenshots that are almost photorealistic and a level of detailing that was completely impossible with CS1 full modded.\nBut these kind of people don't care too much about the economy and sim, it's more the kind of people that play with everything unlocked at start.\n\nMy personal experience: this is my kind of genre in general but I'm not a hardcore fan either. I like both aspects of CS franchise, ie. city painting and city simulation. I like detailing (and be able to do \"illegal\" things with mods), but not too much, the gameplay element is important to me. 50/50.\nWhile I was let down on the sim, I had a blast with the rest and had 100+ mods installed with no serious issue whatsoever, it's actually more stable and performant than CS1 especially considering the step up in graphics quality and scale of the simulation.\n\nOn the sim there are positive things to say too, I like that cims don't have pocket cars anymore, that traffic is way more dynamic and realistic (with a few annoying issues), and that the number of agents simulated can go waaay higher with much better performance comparatively. Economy is virtually ignorable right now but the *framework* is there to make it much better than it's predecessor.\n\nAfter 250 hrs, which is already money well spent for me, I felt a bit unmotivated to continue my city (regrettably so, I'd have liked to continue) because of the shallow sim I think, but I started modding the game instead, which is really fun. Modding in CS2 has incredible potential.\nNow I'm awaiting the economy rework, if it's good enough I'll surely play again as I already miss playing the game. If that's not it, then in a few months/year I should be able to pour hundreds of hours in this game again!",
            "Personally I've been enjoying it with the code mods and have had a decent time with it. Is it as good as CS 1 right now? No, but it's a lot better for a more casual play right now. Hopefully this year the game will become more challenging than cities skylines 1. \n\nRight now I would say get it if you are fine using just code mods, playing casually, and don't mind a bug here and there, then go ahead and get 2, but know you'll be waiting a while for patches to roll through. \n\nIf you like to get more of a challenge, have more options with assets, and don't mind spending quite a lot of time tinkering for detailing, then stick with 1 for now. \n\nI know at some point cities 2 will be way ahead of cities 1, right now it's definitely not there. \n\n\n\nTldr: CS2 is worth it if you currently want a more casual experience (until the game gets harder (hopefully)), are fine with lack of assets, and dealing with occasional bugs. Some code mods will fix issues.",
            "if you dont have either then get CS2 no point in getting Cs1 when it will soon be abandoned and Cs2 will get better",
            "Performance seems a lot better, and the code mods have fixed a lot of my gripes with the game.\n\nIf you like building a city's transport network, it's a pretty good time.\n\nIf you want to build a city for looks, then I'd wait until the asset editor comes out.",
            "Yes. Especially if you've played stock CS1.",
            "Which DLCs/mechanics introduced to CS1 through DLCs are already a part of the base game in CS2?",
            "I purchased CS2 the day it came out and was unplayable on my machine. Comparatively, I'm able to play games on ultra settings like baldurs gate, assassin's creed, God of war, Stanfield, etc. CS would crash, lag and freeze, and generally be slow even on the lowest settings. I tried optimizing based on their recommendations as well a CPP's and nothing helped. Steam finally let me return it after a few months of updates since nothing improved. \n\n\nWhat about now? I'm hesitant to purchase again...I doubt they'd let me return it a second time. Has the game improved enough for me to be able to attempt to play this?\n\n\nAcer predator helios 300 PH315-55-795C\ni7 12700H 2.3 GHz\nNvidia GeForce rtx 3070 ti\n64gb ram",
            "Been waiting to see more good reviews before buying it but things don't seem very promising in the near future. I hope CS2 finds its way soon!",
            "It’s a prettier CS1 with better road mechanics (except when your grid breaks randomly).",
            "yes, period",
            "No. Yes. Whatever.",
            "It's an incredible game. I've sunk so many hours into it, they' done very well. However, I still experience many bugs, there is a lot of polishing left to do, but still, it's fun to just imagine how utterly amazing it will be when everything is eventually smoothed out. Also keep in mind I play on a high end computer and a 42\" screen",
            "Is it on Xbox series s",
            "Worth it, if you’re looking for a long term goal. Possibly better than CS1 at the moment. When new bits are added like proper finance etc it will be an up to date city builder. Next will be multi-player with war options etc. Stormy seasons in the sea for boats and the likes.",
            "Performance is still apeshit. How about fix this?! Fuck you.",
            "Yes.",
            "-zoning bugs\n\n-cim/traffic bugs\n\n-water bugs\n\n-quay not useable for ports\n\n-build an elevated highway and put high density next to it, now cims will walk along the highway to their home and “float” down 40m to the entrance…\n\n-traffic cutting across 6 lanes of highway at the last second to use a ramp.\n\n-3x speed and traffic light timing seems to not be adjusted for traffic 3x speed. You’ll watch 4 cars make it through the light.\n\n-speaking of, can we just get some traffic controls?\n\n-seasons controls and LUT/camera controls. Why cant we just choose what our game looks like? The controls are already there…\n\n-also implement some of the tool mods that the community has been making into base game because they are necessary and shouldn’t require mods.\n\n-etc etc etc etc etc etc ad nauseam",
            "I played the game 60 hrs, last played a few weeks ago. \n\nCouple days ago I went back to cities skylines 1 with dlc and it was glaringly obvious the first is still the more complete and better game. \n\nI will say CS2 felt fun at first, but there's so much less game than CS1 and you as the player end up forgiving so much because you can see the building blocks for a really great sequel, those buildng blocks just don't and haven't come together since launch. It's missing so much. \n\nFinding out the entire shipping/economy system was fake and had no effect on anything is the city or the game was a really bad sign. 6 months after launch and it still isn't any better or better fleshed out is a sign. They're only significant dlc included like 2 new park buildings, and completely ignored tons of broken parts about the game. When I played a few weeks ago those parts were still broken. Bad sign. And, no mod support and no real prospect of mod support, which is weird for a game that blew up on the ability of community improvement. Bad sign. \n\nCities skylines 2 has also already lost its release momentum. The game has probably already reached its peak in popularity, and Paradox hasn't don't enough to earn anyone coming back to give the game a second change. \n\nUltimately, it just wasn't better than CS1. Sure, some sequels are worse at launch than their predecessor and getter better with dlcs, but CS2 isnt doing thay at all and its been 6 months. CS1 is still the supreme city building game, anyone who wants to build a city should and will play that. After my last few days I wish Paradox would put their time and effort into more DLC for that game. \n\nIf you take the road management tools from CS2 and out them in CS1, CS1 does everything single better. CS2 is probably going to get forgotten, unfortunately, as my hopes for that game were through the roof. I bought the game on launch. I just love city builders.\n\nEdit: fun tidbit, someone online discovered the whole economy/import/export depot was completely fake and had no whatsoever. There was talk of them giving guaranteed refunds even after the return period because of misleading and false advertising, but idk what happened to that. Doesn't matter, but the game still has never been able to do what it promised it could.",
            "Thats why i gave up on mods long ago on CS1 and went to console. Been sick of keeping my game alive, every dlc, update, etc made it collapse. \nPlaying pure vanilla is what i wanted, just play when i want without fear of crashing everything😅",
            "there is no more dlc this year from the devs. the only dlc this year is made by modders",
            "Yes, I have to restart the game a few times before it finally loads them",
            "Is it actually likely that will go on sale any time in the foreseeable future? I’m hoping for it but am not holding my breath.",
            "yeah but now they can sell you all the exact same dlc for hundreds of dollars again!",
            "Modded CS1 seems like the way to go since it's unlikely another breaking patch will come",
            "I play on the sd and I love it. I’ve turned the graphics all the way down and I’ve been able to get a city around 70k and counting. It runs fine. Just don’t expect to have high end graphics.",
            "Yes but all in beta and a bit unstable. Like there's a zoning control mod that's incompatible with move it (and those are 2 very popular mods).",
            "Do the mods not do it for you with find it/move it?",
            "What did you mean by \"an indie game made by one person made better\"?",
            "Depends when was the last time you've played the game. It runs somewhat better than at launch, but it's still not there yet. I'd wait for the console version first, if it ever materializes, as this would mean they finally made it run ok on run of the mill modern PCs (which yours isn't, btw, you are above PS5/Xbox Series X's specs).",
            "There's a big \"Economy 2.0\" patch incoming in a week or so. It will change the economy of the whole game but we don't yet how that affects gameplay and if we'd have mods reacting to it.",
            "There was a sale of Paradox like 1 month back, it's over now, but Cities: Skylines II was on sale",
            "You can still get if for like 23 euros if you know where to look.",
            "How can it be decent when the economy is broken lol",
            "Is i5 10th Gen, 1660Ti a semi-competent computer?",
            "Maybe this is a dumb question but is the second thing the justification as to why the game isn't worth it now? Or just an aside",
            "I'm running it fine on a i5-10400f + 3060. With fine I mean medium settings at 1440p 45-60fps.",
            "You and your nasa computer ",
            "I really hope they speed up the development for the game a bit. I know the game released broken and a lot has to be fixed but I thought it would at least be in a pretty good place after 6 months.",
            "Road building is fantastic, unless you want a tunnel.",
            "Ah yes the RTX 3069Tnice",
            "how much more does it feature than [Network Multitool 1.3.5](https://steamcommunity.com/sharedfiles/filedetails/?id=2560782729), [Node Controller Renewal 3.5](https://steamcommunity.com/sharedfiles/filedetails/?id=2472062376), and [Intersection Marking Tool 1.14.4](https://steamcommunity.com/sharedfiles/filedetails/?id=2140418403)?",
            "Graphical issues are better but are still not perfectly optimized. It's the rest of the game (simulation, basic gameplay, zoning, etc) that is still overall crappy and unbalanced and hasn't yet been fixed. Though CO is promising to update the economy with the next patch. I would definitely wait to try it again until after the economy patch comes out.",
            "no",
            "Yes it does?  That's why Paradox Mods is there now instead of steam workshop, because it works on cloud gaming services",
            "Not sure its worth it with mods. If there is a good discount sure. Without a fix to assets I would not recommend the game. Replayability is limited when every city looks identical.",
            "Yeah, I’m kinda worried that CSL2 is gonna face a similar fate to KSP2. Although Colossal Order isn’t owned by Paradox so they don’t face the same risk of being shut down at the snap of a finger.",
            "Solid review here. As a CS1 fan I’ve been on the fence about getting involved so far. Custom assets and mods so important for me so perhaps it’s time. But then I’ve waited this long. I can probs wait a bit longer for the economy rework etc",
            "Can you elaborate on why it's a nice transport simulator with respect to CS1?",
            "Nothing 100%, but there's things like specialised industry and trams which were both parts of DLC in CS1.\n\nReally, it's a completely different game so comparing it like that doesn't work that well. Base CS2 has far more than Base CS1 had",
            "Why not try it for yourself via the Game Pass trial mentioned in the main post? You've not given any information about your specs, so it's impossible for somebody to give you advice that's specific to your circumstances.",
            "That's a comma",
            "no, might release on console next year realistically",
            "Dreaming costs nothing",
            "Have they even hinted at anything regarding multiplayer? Seems like it'd be so much investment for not much(if any) reward for them.",
            "Fijne taart dag!",
            "Do you think in some months/year the game will become better than 1 taking into account mods & assets? I'm still playing 1 with 30GB+ of mods and assets, and from what I've seen, the transition is still not worth it.",
            "We all have different standards; personally I wouldn't touch unmodded Cities Skylines with bargepole.",
            "Vanilla CS is boring after few dozens of hours.",
            "Looking at other games they released, oh yeah, I'm sure it will be on sale at some point. I'm totally okay to wait for it to be cheaper and \"better.\" For when, probably a 10-20% at summer sale? Maybe a goty around christmas? I'm guessing.",
            "Give it another 6-12 months for PDX to pull the life support plug and Im sure it’ll be on sale to recoup any losses.",
            "It's still \"new\" so probably not a big discount, but maybe 10-20% off on Steam's summer sale.",
            "You can already get it for like 23 euros, just need to know where to look.",
            "The Paradox Way. It seems to be finally working against them though both this and crusader kings 3 have the problem of the previous game just having more content and systems due to DLC, that it's not even worth the new game unless you want to go down to basics again.",
            "Steam deck can handle it? I’m surprised.",
            "Manor Lords",
            "I played last a couple months ago",
            "Just an example of how unfinished this game is even after 9 months since release.",
            "The intersection freedom is better than CS1 modded (unless you use anarchy, which can then get glitchy). Lanes actually merge. Able to upgrade different transportation modes on roads without changing/deleting the road. Its unquestionably better than CS1 modded. There are detail mods out there for roads with more to come",
            "Thank you. Yeah, next time I play it, I want it to feel like a final product and not a work in progress lol. \n\nDef gonna wait awhile, the graphical issues really struck me as a bullshit issue that shouldn't have been experienced by users upon product launch.",
            "Thanks. If you're not ready for hardcore detailing I'd encourage you to wait a bit to avoid being let down, indeed and wait for feedback on the upcoming patch.\n\nOtherwise you can already do fun and beautiful things without even entering the editor. Want a park that also works as a fully functional train station bc why not, with an entirely custom building made out of meshes borrowed from Vanilla assets? It's possible. But that requires hard work. Add editor knowledge on top of that and there's a whole world of possibilities.\nThere's already a rapid multiplication of \"unofficial\" custom assets on PDX mods that helps a lot in getting a less repetitive city.\n\nSurveying Discords, like the City Skylines Modding one is also a good way (and a better way than Reddit) to have a better overview of what's possible and how good players enjoy the game themselves, definitely gave me inspiration and skills that allowed to enjoy the game more, and a constant itch to get back to it (well, I'm modding it right now which is a game in itself, but I mean playing it 😁)",
            "Simply just because the road building tool is so much better. Stuff that would take me hours in cs1 to get looking nice I can do in minutes. I'll routinely redo entire interchanges over and over and it'll still take me less time than building 1 in cs1.\n\nAlso rush-hour actually exists, so you can watch choke points build up",
            "Thanks for the answer!",
            "Using the game pass is one and done. I'd like to get people's thoughts on the game's improvements to see if it's worth trying since I'd only get the trial once. I added specs.",
            "Damn didn’t they originally say spring 2024",
            "I am playing since day 1, last time today. For me not, still enjoying it. Bought it on day 1 steam, went console on day 1 there and bought remastered then which i still play with almost all dlcs.",
            "Manor Lords is such a great game.",
            "Nothing much has changed since then. Mild improvements so far, but more performance and simulation speed improvements are coming, according to Colossal Order.",
            "you can also stack roads. either roads on top of eachother, roads under rails... lots of options. CS1 simply can't do that. \n\nhttps://preview.redd.it/galry7t5qv3d1.png?width=1840&format=png&auto=webp&s=6cb7e7ee8ab7ae2a67bebc9b498a1eb74ce7ce66",
            "Don’t know who’s downvoted that, thanks for the reply!",
            "They said day one it would be out on PC and consoles. They made a point about it being the same across platforms.",
            "That one is at the top of my list for when it leaves EA. I'm intentionally staying in the dark about it so it'll be super fun to play then! The game is such a cool concept!",
            "Okay thank you",
            "Ah it's okay, some people in this sub are like\n\nhttps://preview.redd.it/r1kmgoq7mz3d1.jpeg?width=200&format=pjpg&auto=webp&s=73b8a9313cff56091c55505421e53794487b590d"
        ]
    },
    "Economy 2.0 Patch will launch at 10:00 CEST on Monday 24/06/2024": {
        "title": "Economy 2.0 Patch will launch at 10:00 CEST on Monday 24/06/2024",
        "score": 398,
        "url": "https://forum.paradoxplaza.com/forum/threads/save-game-checklist-economy-2-0-1-1-4-f1.1688801/post-29711221",
        "content": "",
        "num_comments": 211,
        "comments": [
            "As a dev I can empathize with them releasing on a Monday.\n\nAs a working dude, dammit man they should have released on a Friday!",
            "Well at least Elden Ring has a 3 day head start for me to finish first.",
            "Stopped playing the game months ago waiting for fixes. Once we had mods I went back for a day but then stopped playing again to wait for this patch. So just twiddling my thumbs waiting and waiting…",
            "Paradox and their associated companies are having an absolute nightmare this week.",
            "Little hint for devs and generally anyone selling to what they hope to be a returning customer base (different if it’s a one and done transaction). \n\nUnder promise \n\nOver deliver \n\nIf you follow this, it’s far more likely your customers will leave happier despite the actions being exactly the same if you over promised. \n\nThe messaging and managing of expectations can be more important than *what is actually delivered*",
            "A disappointing update, but at least we have official communication about it now instead of being left in the dark.  I hope the patch is good.  I'm still very excited to play it, but this week's experience has left a bad taste in my mouth and makes me worry that their communication has not changed for the better.\n\nI've been a dev for 15 years.  One thing I've learned is that you can have your own internal targets, but only communicate dates to your customer when they're a sure thing.  Hiding behind words like \"might\" and \"expect\" don't help.  Yes, they're not promises, but they're still communicating *expectations*.  When you cast a wide net such as June 3 - 19, your customer is going to expect that the 19th is the latest they can expect delivery without needing additional information from you.  If you can't meet that date, you should be communicating why that's the case in advance so the 19th doesn't come, go, and your customer is beating down your door for an update.  \n\nIf I were CO, I would have said we're targeting Q3 for the patch.  As development progresses and we get closer to meeting our internal June 19th target, I would start whittling that down to June/July (Surprise!  It's early!), then late June, then June 24th ONLY when we've fully completed dev/QA and we have Steam certification.  This business of externally communicating dates when the length of development is unknown is for the birds.  Please don't give *any* dates that you're not sure of.  Instead, give us regular updates on how things are going and the things you're working on.  If you want to know the style of communication that gamers want, look at what the team building Satisfactory is doing and model after that.",
            "It's midsummer (juhannus) so dev's will be out mökki'ing, makes sense to not send it but still, this should've been known about and not teased this week...",
            "YEEEES! I start my holiday on Monday.   \nHyvät jussit kaikille!",
            "This patch will be make or break for the game for many people, so much riding on this. Hopefully it's the real deal",
            "Damn was hoping to play this weekend w the revamped stuff!",
            "Hope—-Mad—Hopeless—Surprise—Hope—Lmfao not even mad",
            "Same day as Victoria 3 spheres of influence expansion release.",
            "Happy the devs got it out. Not excited for that massive death wave, im currently teetering between 295k-300k. But sacrificing my city's population is a sacrifice I'm willing to make 😈",
            "What’s another weekend avoiding this game anyway.",
            "Do we think the tax bug will be fixed with this update? The one where suddenly one random industry will give millions in taxes or receive millions in subsidies?",
            "CO dev 1: \"Dang, looks like Steam can't certify and publish our patch until Monday. They're taking the weekend off to play Elden Ring.\"\n\nCO dev 2: \"Fortunately, it wouldn't have helped us much to release today. The players are spending the weekend playing Elden Ring anyway.\"\n\nCO dev 1: \"Well, that means we've got a few days of waiting until we can get the patch out.\"\n\nCO dev 2: \"Waiting? I'm going home to play Elden Ring!\"",
            "Welp, at least that's some information! I'm not sure why it was communicated so late though.",
            "At this point, it's not even about being on time; it's about the ratio of promises made to promises delivered. It's one thing for game updates to be delayed, it happens all the time. But little to no delivery and repeatedly subpar execution has led to a constant erosion of trust of the players.\n\nWe were told console versions would be released alongside PC since launch, but less than a month before release, the rug got pulled from under us and we were told Spring 2024. Well, here we are 9 months later at the end of Spring 2024, with promises now of October. Maybe third time's time charm?\n\nHow they released a whole DLC called Beach Properties without a single person at the company going, \"Hey wait a minute shouldn't we add beaches?\" is beyond me.\n\nI'm glad someone finally realized last month that releasing a weekly newsletter without weekly delivery or updates was a bad idea.\n\nAnd for Q3 and Q4 half of what we currently have to look forward to is... radio stations (audio files)? These need to be scrapped. 95% of players do not want more radio stations. They want functioning game mechanics and optimization.\n\nThe problem now is the amount of patches that it is going to take to fix the base game mechanics and content. We are at the end of Q2 and entering industrisemester, and we are witnessing in real time how long it is taking to fix ONE of the game's major mechanics/issues. Will we need an Economy 3.0 Patch? Time will tell, but it's entirely within the realm of possibility. \n\nThe communication has been abysmal, it has been one long chain of \"jk lol\"s, and it feels like every update is just more disappointment. Promises of major features and improvements have almost always come with delays and underwhelming execution. It’s frustrating to see a game with so much potential being mishandled this way.\n\nI really hope I'm wrong because I really want to love this game",
            "Lol the hype level for this patch everywhere seems so extremely high you think Skylines 3 is coming out.\n\nI hope they deliver this time because another dud wouldn't go over well probably.",
            "*Sticks head in the doorway* You guys still here?! Oh hey! Just stopped in to see if this is a game yet! *Looks at watch* See you in another 9 months! *wave*",
            "Doubt(x)",
            "OP, just for accuracy the official announcement does not include the year.\n\nNext time June 24th will be a Monday is 2030. Everything checks out, so please don't spread false information.",
            "My hypothesis. Let’s see how poorly this ages. \n\nQ2 Patch: 6/24\nQ3 Patch: 9/30\nQ4 Patch: 12/16\n\n2025\nQ1 Patch: 3/24",
            "How playable is CS2 these days? I built a new PC last fall for it. 4090 + 7800x3d. \n\nVery disappointed that I haven't played it yet.",
            "The same day as the victoria 3 update lol. With CK3 having updates soon I think the paradox ceo is definitely telling devs (even the non-in-house ones) “fix your games”",
            "When it becomes playable, I will buy it. Till then, nah.",
            "Paradox as always eager to snatch away defeat from the jaws of victory",
            "ngl, i've been excited as hell these last few days. kinda sucked to see i woke up semi early for nothing. ah well, back to bed",
            "Wonder what happened where they thought they had it done and ready enough to announce then went back on it.  Probably need to have a good discussion with the publicity team and the dev managers.",
            "damn, ill be on a work trip that week, well plenty of time for hot fixes to come out by the time i get back",
            "is cs1 still updated?",
            "So it will be August then.",
            "I just don't understand why they keep fucking up release dates. I'm happy they left us with a day now, but how hard is it to figure out a new date before saying it will be delayed? Just say a data farther back than you think and if it gets done early everyone will be happier.",
            "And then everyone will go on vacation leaving the users to complain all the summer about the bugs. Oh boy! /s",
            "This community might be the most ungrateful… they wanted it done before their holidays but it didn’t happen. Seems like the effort was there and communication. Once the deadline passed they reassessed and gave another target within a day. Get your panties undone and enjoy the game. And if you don’t enjoy it, play something else.",
            "[deleted]",
            "Almost a year, and this game is still in an unfinished state. Ridiculous.",
            " “console release when?”",
            "When GFN mod support? Steam workshop 🥲",
            "No push to production on Fridays ! It an actual rule at my work ( unless said production is actually down ).  Same for the days before holidays. \n\nAnd that one time where legal stuff meant we had to change on the first on the month, that happened to be a Friday.",
            "Today is Midsummer in Finland and Sweden. It's the biggest holiday here",
            "Release on a Friday if you’re trying to get out of doing something on the weekend 👍",
            "There's a holiday across Scandinavia this Friday, which is likely why things are postponed til Monday.",
            "Finish in 3 days? \n\nYou aren’t sleeping right?  \n\nRight?….",
            "I stopped playing once I heard about this economy fix. The city I've been working on has basically become a city painter despite not having unlimited money on. Nearly 800 million dollars from who knows where and nothing matters or effects anything. Also still waiting for my metro crossings :(.",
            "I haven't played it since November.  Kind of expected to wait at least a year before I'd pick it up again.",
            "Just tried this morning hoping maybe i became more of a patient person. Now i’m irrevocably upset all over again.",
            "I just heard about Life by You 😕",
            "It’s like they’re imploding. What an incredible mismanagement by everyone involved",
            "CO overpromised and underdeliveref",
            "That's my thing as well. Have an internal deadline that the employees must follow, but have vague/very conservative public deadline. If they said this patch was coming mid July and released it Monday, everyone would be happy. Shoot if they just called the first year of this game \"early access\", people would be much more forgiving. I understand it's a small team so the communication can be difficult, but they're becoming too popular to not get this down.",
            "This is exactly right. They left expectations wide open and they've left themselves little room to adjust. If this were the only mistake, or one of a few, I think we'd be much more inclined to be empathetic. But they've put themselves in this situation. People love calling this community toxic, both the company and it's players but CO created this community and its general demeanor.",
            "I work in customer service. All you have to say is \"in or around June 19th\". No reason whatsoever to mention the eleventh or any other date.\n\nIf its delayed after the nineteenth you just say that.",
            "You're making this patch sound like it's the end all be all. Like it's the last patch that'll ever be released. This patch just adds on to the fixes that have been done so far and prepares for the future fixes. It's just one part of a bigger process to fix the game.",
            "That's where I'm at",
            "I don't think it will make or break the game... It doesn't add or take away any features. It just fixes the economy and adds a few assets. It actually may break your cities momentarily but you can rebalance things to make it work again. It will however change how we approach setting up our city resources though.",
            "We’re lucky to get anything in the summertime. My Finnish associates work 4 half days a week this time of year. Let’s just hope it’s functional when it releases.",
            "Yep. So i wont even have time to bother testing cs2 for weeks to come if SoI does come without game breaking Bugs. Really had hopes to play cs2 with the new patch this weekend but guess it will be a few weeks for me now until i play cs2 again.",
            "How is this even playable at 300k? I have a city at 200k with a very capable i9/RTX4080 system and it just grinds along at a snail pace like I'm running a system from 1990!",
            "Got *what* out exactly? The update hasn’t even been released yet",
            "CPP has said and Avanya has also said that it’s been resolved.\n\nThe production equations had to be tweaked in order to achieve this.",
            "Fingers crossed",
            "Hmm this bug stopped happening with me, sad to see others still experience it",
            "I hope so",
            "They probably still hoped to get it out by EOD on Wednesday, but when that wasn’t possible they had to scramble to make this announcement which due to it already being late had to be pushed to today.",
            "If they were competent, they would have realized they weren't going to get it out by the end of Wednesday and just made the announcement right away.  \"Hey we added a few extra bug fixes we thought were important so patch is delayed until Monday\".  Would have avoided sooooo much of the flak.  Like it took you until the end of Wednesday to realize you wouldn't get the patch out until Monday?!?!  Clown show",
            "This game is in my \"someday\" category. I have faith it will eventually be as good as CS1. It just might take 6 years to get there.",
            "I think your expectations are set way too high.\n\nSeriously. I don’t agree with it, but this has been the norm for over the past decade. Delays get delayed. Game devs release an unfinished game, and take the better part of the game’s earlier years just fixing it up. Always overpromising and underdelivering the entire way. That’s how the gaming industry treats us, and as long as we keep giving them money, that’s how it’ll stay.\n\nIf you want to enjoy anything anymore, set your expectations low. Roadmaps are not promises. The next update is *not* going to magically fix everything, not for a while. If we keep throwing a tantrum at every little setback, we’re just going to be miserable.",
            "Based on prior experience with everything else they've done so far, I truly believe the economy will change. I don't know what's breaking beyond that, since they're having to delay the release to next Monday.",
            "LOL",
            "The 24th is a monday tho",
            "Your PC will run it fine. FPS will be solid. At high population, the simulation slow significantly.",
            "Anything over 100k population will make the simulation slow, however, I have a 4070 - R5 3600 and I can play with constant 30fps.",
            "7800x3D and a 7900XTX and the simulation is very sluggish at 300k.  The changes in this patch would take like 2 days of running the game to take effect.  I'd be curious to see how the simulation speed scales with more cores.  Anyone have a threadripper?",
            "It will work fine, but just be aware that your room will turn into a sauna. Speaking from experience",
            "I know its an unpopular opinion, but CS2 works fine. I haven't experienced any game breaking bugs, only minor ones that can easily be worked around. It's not great, but it's definitely not a *bad* game right now.\n\nI do have a pretty beefy CPU, so take my comment with a grain of salt.",
            "Releasing a broken big patch is snatching defeat from the jaws of victory. Waiting an extra couple days is fine.",
            "Sounds like, to use their own words, \"an issue popped up\" for which they implemented a fix that had to be tested again; this time, it's also a proper announcement and not just a tweet about their planned schedule.",
            "Nope",
            "No, it will be the 24th month, whatever that is called in swedish.",
            "> how hard is it to figure out a new date before saying it will be delayed?\n\nIt could be very hard, depending on the reason for the delay.",
            "Because shareholders and executives. Business wants shit done as fast and cheaply as possible. So they set impossible deadlines to force overworked game devs to hurry up and get it done.",
            "One of the biggest criticism seems to be that the communication was and is *not* there.",
            "Crazy that we are ungrateful for wanting a complete product.",
            "It’s kinda different when they give us a road map that they don’t follow.",
            "I don't have anything to be grateful for.  This is not a personal favor to me.  It is an exchange of money for a product.  The product is defective, and so it is not an act of benevolent charity for them to fix it.",
            "Consumers should actually be complaining a heck of a lot more and obviously voting with their wallet.  Bad press is good too for added pressure.  Being quiet does absolutely nothing.  Shit sucks for many and gaming is a hobby to escape things.  So when that hobby continuously flops... yeah people are going to get angry.",
            "This is pitiful. Why make excuses for them? Every piece of communication from them has been a disaster.",
            "Trust me, I am playing something else.\n\n\nI want to like this game, I really do. But it's just not great in its current state. I want to see CO redeem themselves - but so far they've yet to deliver.\n\n\nHere's hoping for Monday's patch, if it does come out Monday.",
            "Fandoms on social media are the worst. Games, Movies, Sports, Music, etc. This subreddit is no different.\n\nPart of this is a complete own-goal by CO announcing a date before it was ready. That's just poor communication, something which has dogged this game since launch. I genuinely don't understand how they keep messing this up.\n\nGamers, however, have this knack for getting hyped up by marketing, then disappointed by the finished product, getting enraged about it, and then repeating the cycle. I swear some people in these communities have the memories of goldfish coupled with a desire to be relentlessly kicked in the junk.\n\nOn top of everything else, the anonymity and instantaneous power of the internet encourages a ton of negativity, making everything worse. Instead of writing your thoughts in a letter and putting it in the mail, or writing something in the newspaper or a magazine, you can just post some toxic nonsense on reddit that takes 5 minutes to write, and about 30 seconds of rationalization. On top of that, places like reddit encourage the loudest voices to get the most attention, they want you to \"engage\" so you use the app more, and see more ads.\n\nTLDR: CO needs to fix their communications issues. But, also: the internet makes everyone more toxic and negative.",
            "nah bruh its the developers dangling the carrot and then going \"lol syke\" and not telling anyone other than discord.....its unprofessional. If you say you have a delivery for me....in a few hours...then no word...then its pushed back again and again....",
            "i made the mistake of opening your post history to see what kind of degenerate posts comments like this and... some things can't be unseen",
            "Microsoft historically releases patches on Tuesdays. \n\nThe reason being that final checks occur Monday, and when something goes wrong (and it will), you have the week to fix it.\n\nSo a Monday release is a lot smarter than releasing on a Friday where gamers would be screwed with whatever bug was found all weekend.",
            "What's wrong with a Monday?",
            "I gave so many excuses for Kerbal space program 2’s glacial pace of development and lackluster communication but I won’t be fooled again. Cities skylines is unfortunately following a very similar trajectory.",
            "Excuse me, a year?",
            "They already addressed this, they said the goal will be late this year I believe?",
            "GFN mod support is up to nVidia. So tell them you want it.\n\nSteam WS is not happening. When will people get this.",
            "When nVidia decides to support it, never",
            "Steam workshop is not happening, and honestly pdx mods is better with setting up presets. I just want asset mods!",
            "Bigger then christmas winter break? /s",
            "Unrelated to Finnish devs, but Baltics have that holiday too, not just Scandinavia. :(",
            "[deleted]",
            "No shit. Way under delivered on the base game. Hopefully this can help but I’m skeptical",
            "Small team should make communication EASIER",
            "If this patch ends up being another buggy stinker I don't think anyone's gonna wait another 6 months. I'd say the player reaction to this patch makes or breaks the funding of continued development, at least as far as Paradox the publisher is concerned.\n\nI really hope it's a good patch.",
            "I mean it is for the foreseeable future.\n\nPlayed on release for 15 mins and couldn't stand it. \"Guess I'll wait till the games sorted then\"\n\nHear about this update. \"Oh guess I'll give it another go when it's released\"\n\nIf I hop on and it's still vastly more enjoyable and playable to be on CS1 instead the games gonna be played for another 15-30 mins and not be touched until another 6 months or who knows, even a year",
            "I agree with the post that this is going to be defining for the future of the game... A lot of people similar to me gave up and abandoned ship last [insert month -  for me was Dec] when it became apparent the thing was flawed, slow, impassable at many levels. This release is drumming up a lot of hype whether they like it or not, if I come back to a more or just as broken game after this release prob not coming back again.",
            "Yeah, I'll be in the same boat!",
            "Resolved already or resolved in Economy 2.0? Because if it's supposed to have been resolved already I should report that it's still occurring",
            "> It just might take 6 years to get there.\n\nTo be fair, CS1 took 8 years to get as good as it did.\n\nIt really wasn't that impressive when it launched",
            "It is a growing trend in the industry but the problems specific to this game are (1) the constant rug-pulling so close to the dates they announce and (2) the consistent, unrelenting underdelivery with almost zero good updates since launch.\n\nImagine running a race, but every time you complete 95% of the race and can see the finish line, the finish line gets moved to make the race twice as long as it was originally. \n\nAnd you don't even know if that will be the only time they decide to move the finish line. \n\nAnd at the end of the race, the winner finds out that the prize money is nothing near what was promised.\n\nAnd nearly every race you run this happens to you. \n\n**And only after one of the races you ran was voted one of the worst races of all time ever** (Beach Properties DLC), do the people in charge of the races admit that they are screwing things up and say things are going to change.\n\nAnd yet just months later, they keep doing the same thing.\n\nThere are ways to tactfully handle development delays, but CS2 is not privy to them.",
            "Parent commenter is saying that there’s a (joke) chance that the announcement IS talking about 2030, as year is not stated in the official announcement.",
            "Have you checked hardware utilization? I have to imagine that 3600 is holding back back the 4070 specifically in this game",
            "What about bugs and mechanics?",
            "Linus has a video where he runs the game on a threadripper.\n\nHint: It does not run well...",
            "I want constant 60+ fps with my ryzen 5600, rx5700xt, 32gb of ram and wd black 850x ssd. Game is not even looking that good...",
            "We've been waiting since Oct.23/2023",
            "I’d bet good money there’s gonna be some bugs with the patch anyway. And plus many of us have to wait for our mods to get updated anyway. Will be a good while til the game is actually playable.",
            "To be honest given their record my expectations are low. We'll see if they can go even lower",
            "It should have been better communicated when they realized they were going to miss the window but I'm glad they caught it and are spending the time to fix it.",
            "I bet it has to do with tile upkeep as it was a feature that got tacked on late into development it seems",
            "Toyotathon I believe",
            "In every gaming subreddit shareholders seem to be the ultimate scapegoat guilty of everything bad happening to every game. Game delayed? Shareholders. Game rushed? Shareholders. Bugs? Shareholders. Missing features? Shareholders. Microtransactions? Shareholders. Lazy coding? You guessed it, shareholders.",
            "lol have you ever worked in any company?",
            "I wish I could like this twice...",
            "I mean it's better that they delay it a week, than release a buggy unplayable mess.",
            "The thing is, there isn't really anything comparable on the market at the moment, so people who want to play a city builder are basically forced to buy a CO game. As disappointing as all this delaying and lack of content is, CS2 is still the best modern city builder.",
            "It's not about defending them, \"Us vs. Them\" is a reductive mentality that only leads to negativity & unhappiness. \n\n\nFocusing on positives & trying to find opportunities for gratitude is just generally an easier, calmer way to live",
            "Because they're a small dev team comprised of human beings doing their best.",
            "Damn should have just listen and not went and checked myself",
            "Yeah, I'm a software engineer and many teams target Monday or Tuesday. They'll often have feature deployment freezes for Thursday-Sunday too.\n\nHonestly, them releasing it at all is surprising to me. I work with a bunch of Finns and they're all starting their summer holiday right now (much of my company started today). They'll be gone for a month. Usually you do a 1-2 week freeze before a big break like that. I'm guessing CO forced a staggered break this year so only half the team is out at any time (which likely means some unhappy people, if my own experience asking for that is anything to go by)",
            "It's the perfect day to complain about if you desperately need something to complain about. IMO, it's better than Tuesday.",
            "Time flies by really fast, doesn't it?",
            "I said almost a year. 9 months. My point still stands.",
            "Times I wish there was a sarcastic font - thank you tho",
            "So it is good time to build a PC without nvidia components 😅",
            "Possibly yeah. Depends on the person you ask ofcourse, but for a large number of Finns Midsummer in more important than Christmas (personally, I got married on Midsummer and would rate it above Christmas)\n\nAlso, the summer break is usually longer.\n\nJust picture 4th of July in the US. It basically like that, but instead of fireworks we have bonfires (if there isn't a wildfire risk) and the sun doesn't go down fully",
            "I know, isn't it on a different day in the Baltics tho? In Finland and Sweden it's always celebrated on the Friday and Saturday closest to the summer solstice. Isn't it the 23rd or something like that in the Baltics?",
            "> Actually, just let CO be fully independent.\n\nPretty bold statement given that the only bits of useful communication and action we have gotten since release were when Paradox got involved.",
            "That's just not true. Larger, robust teams have larger communication teams with better communication strategies.",
            "Half of the CS1 game base came in the last 3 years.\n\nIf the game keeps getting better, there's no reason to suspect this is the end.",
            "People say this same shit every time they're about to release a patch. It's a complex game with a lot of interconnected parts built by a small team. It's going to take time to get it right. \n\nI'm just grateful there's a studio out there doing a modern city builder instead of their own version of a half assed town builder/gathering sim set 100s of years in the past. I swear there's one of those games released every year.\n\n>I don't think anyone's gonna wait another 6 months.\n\nIt doesn't matter. The people paying attention now that'll stop playing will just be replaced by other players buying it in the future. If CO pull it off with the fixes over the next whatever years, players will return.",
            "Lol it’s not even close. Cities is paradox’s cash cow they are going to milk this thing for many years to come wether this patch makes it an amazing games or breaks it again it doesn’t matter.",
            "I played the game for a few months at the end of last year but decided to put it down for a while until a few updates had been released. I started playing again about 2 weeks ago and it's improved enough to keep my attention so far.\n\nI stopped playing CS1 around the same time CS2 was announced and after playing and getting used to CS2 I can't go back to the first one. I started CS1 in 2015 and I've played it to death. I had been hoping for a sequel since about 2018. By the end it was just too much effort and I had too little time to be fucking around with broken mods, missing assets and bugs that were never fixed and it always felt too shallow for me. It always felt like a city painter pretending to be a proper city sim game.",
            "You played the game for 15 minutes and hated it, but you expect this patch to change that? Why? This patch is addressing balancing issues that would be encountered after many many hours of gameplay.",
            "I thought most people hated you game because of the lack of features, mod support and stability/poor optimization. They've fixed most of those issues to a workable level IMHO.",
            "In most cases you have to let the simulation run for a bit, even longer if your city is big to let the changes take effect and things to balance out",
            "Resolved in Efonomy 2.0",
            "Mods are what carried CS1.  You would think though they would have learned.",
            "There definitely is the issue of potential bottlenecks, but I guess with the performance of my games, I haven't really needed to worry too much, but it will be something I look into though :)",
            "There's no asset mods, so everything has a grey hue to the buildings that make it look brutalist, however, no major bugs. Mechanics on the other hand, you'll have to define.",
            "It is supposely a big patch.  There will absolutely be bugs/issues.  There isn't a way around it with software dev.  The stupid part is they didn't give themselves breathing room for a couple hotfixes before they leave for vacation.",
            "To be fair, the same company that made Cities: Skylines 2 also made Cities: Skylines, so we know they are capable to good stuff.",
            "It was beyond boneheaded to suggest in their dev diary this week that we might have the patch in-hand within 24 hours. \n\nThese people have no idea how to manage customer expectations.",
            "Wouldn’t shareholders make more money off a popular game that more people want to buy?",
            "The more I work as a software dev, the more I realize there is just tons of incompetance.  Like I am not amazing by any means by holy fuck the simple mistakes game studios make is crazy",
            "Yeah, in reality this is just a fumble from a team that is still figuring out their release process, and how to communicate effectively. They gave a hopeful date, they didn't quite hit it, they moved it and that sucks a little. They'll learn from it, and will hopefully add in more time to their schedule for next release.\n\nThey will definitely fumble another release date in the future, but they'll consistently get better at it. Those saying that they should be giving conservative estimates are right, but it's also a damned if you do and damned if you don't announce a date. They're trying and I appreciate that, even if they didn't get it right this time.",
            "Yes. Updates are always appreciated. \n\nOther companies that don’t provide updates when they are behind schedule don’t get another contract.",
            "I'm so tired of this argument man, there are countless game devs out there who routinely manage to stick to a roadmap they laid out. Yes, it's no big deal if it goes wrong sometimes. But it goes wrong *every single time* with CO.",
            "Yes. And if we didn't meet deadlines we'd be fired lol",
            "Correct, but that doesn't absolve them of responsibility for their continued, repeated communication blunders.",
            "The older version of this same game is still available for purchase and is still being purchased by many people",
            "Me.  You are describing me.  LOL.",
            "I am positive that I haven't played this game for 2 months and have played other games instead.\n\n I am negative that I pre-ordered this game.\n\n I am positive that I'll never pre-order another game ever again.",
            "That's great, but what am I gonna do with all these flags and signs I got printed that say \"Fuck Bid...\" I mean \"Fuck Cities 2\"?",
            "They're not a <10 man indie team. They're a small professional studio with a big publisher. Flubbing up communication means two companies dropped the ball, and there's not been enough improvement to outpace the loss of goodwill for many people.",
            "I don’t think this is the best they can do. \n\nCommunication alone could have been improved over and over. \n\nThey don’t seem to learn from their mistakes. ",
            "This is the last patch before their summer holidays",
            "The only teams that ship on a Thursday before a holiday are teams that want to work the long weekend.",
            "Too fast if you ask me",
            "In the future use \"/s\" at the end of your comment. It shows it was ironic/a joke.",
            "What does GFN have to do with nVidia components?",
            "Good question. I always confuse the dates when it’s the right time for bonfire (prob 23rd) and what not, but we have 23-24 free, no work. So its usually celebrated during that time.",
            "Thats very true. I’d also like to preface that it’s very easy to blame the publisher - but since we’re not really fully informed on their practices, it might be CO’s fault just as much as it is Paradox’s",
            "It does matter though - it’s only a “cash cow” as long as players are invested. \n\nBased on the initial release and the disastrous DLC roll outs, there is basically zero good will left in the community. It’s hard to bring a game back from the dead when you have no incentives to keep the player base engaged.",
            "Not a cash cow if there's no cash or cows... Enjoy milking the pigs.",
            "> Cities is paradox’s cash cow\n\nReally?",
            "It ran at 30fps with nothing on the screen, I can wait for performance to improve. Then hear about all the other issues with cims and whatnot.\n\nIt's not great waiting for a game to run well, then start sinking hours into it only to find there are simulation and balancing issues.\n\nIf it's been this long and I can't open the game up and have an experience that at least compares to and is as enjoyable as CS1 then yeah I'm probably not touching it again unless there's another big patch x months down the line",
            "There was so much to hate at launch. For me it’s always been broken basic gameplay. The choices I make managing the city don’t seem to matter, so it’s just a city painter (with almost no assets, which also sucks). I stopped playing a while ago, played some CS1 then stopped that too. I will try this patch but if it still fails to be a functional game, I’m uninstalling. If the game is still alive in a few years maybe wake it back up and give another try, or maybe (please gods) someone else enters the genre — then it’s goodbye CS forever. I fear the game is too broken to fix but willing to give this patch a try.",
            "Yeah most games are more GPU heavy, but CS2 is definitely a CPU intensive game",
            "Why didn't they do more beta testing?\n\nOh wait we are the beta testers. 😑",
            "True, though i'm more pissed off about paradox, because they are the publisher. And publishers don't really care if they are selling a good product.",
            "I do have to agree here. If they'd said nothing in the first place (or a non-commital 'later this month') then there's no 'delay' story for people to latch onto.\n\nI'm not even particularly bothered by the delay; I've mentally shelved CS2 pending substantial improvements. But at the same time I can't pretend it's not an own goal.",
            "Yeah I have to agree.  And announcing such a time frame when the patch wasn't done is concerning with respect to other decisions. Its such a basic expectations management thing.",
            "Yeah but it goes both ways. Shareholders also lose money more often than not. And the same way they are “greedy” when they profit from their investments, then by the same logic they are also “charitable” when they lose money. Some popular games exist solely because of shareholders. Modern AAA games require huge amount of money and resources that no independent group of devs can posses. Not trying to defend shareholders here, just describing a more nuanced view of how real life and economics works.",
            "This is true for every industry. It’s just that it makes you feel good when you’re blaming the “rich” and “powerful”. Especially on Reddit, more than any other internet platform.",
            "Dude... they have existed as a studio for over 10 years.  They have released several games before CS2.",
            "It isn't really \"voting with your wallet\" if you buy another game from the same company. Also, it's not a modern game, it's 9 years old, doesn't get updates anymore and not a lot of new mods/assets.",
            "Lol!!\n\n\nThat's basically my take on it, too. \n\n\nI'm kinda optimistic that maybe some day it'll be a good game, I mean I see a ton of potential... But I put my first 40 hours in and haven't touched it since.",
            "What?",
            "CO [says ](https://forum.paradoxplaza.com/forum/threads/save-game-checklist-economy-2-0-1-1-4-f1.1688801/page-7#post-29711320)they have time to do one more with any hotfixes they miss.",
            "Thank you",
            "Jealous. I think it used to be on the same day in Sweden and Finland. But then some hotshot Swedish manager decided that midsummer should always be on a Saturday so they have to give less free days to people. At least we get Friday off as well as most people celebrate on the eve",
            "Besides stellaris yes",
            "Theres been three or so major parches already to address performance issues and its improved a lot already",
            "I was disappointed that it just felt like a lazy sequel.  They didn't really do much we haven't seen before.  Like... why don't we have a road builder?  Or more custom zoning?  Or... etc.  I mean I will probably play more once they get stuff sorted out just because there are no limits and I can build a bigger city but...",
            "It sucks because I upgraded my RAM to support modding, but haven't been able to utilise its potential yet :(",
            "I won't deny that management usually sucks too.  But like...  devs aren't blameless.  I worked with someone who was absolutely fucking terrible and they left for a job at Microsoft so.........",
            "It's surprising how different a release process can be from game to game. CS1 is probably a pretty well oiled machine at this point for releases, with well established processes and known variables. CS2 is a new experience, even if the team is the same. Never assume that anything is easy when it comes to a new release. New code base, new tools, new processes will take time to figure out.",
            "Yes????? How is it not. They are completely different revenue streams. \n\nAnd yeah I know it’s old that’s why it’s kinda pathetic how the new one isn’t any better.",
            "In Estonia we celebrate Victory Day on the 23rd, that's why we have 2 days off work.",
            "You're forgetting tiny indie title Crusader Kings 3, which seems to have sold over two million units compared to city skyline 2's one million units, and its half a dozen DLC packs compared to CS2's... One?",
            "Then I'll find out if the game is worth sinking hours into on the 24th",
            "back to CS1!",
            "No, just no.  They have been working on this game for YEARS.  Experience building and releasing software does not change that much from product to product.",
            "They are different games, sure. But you are still indirectly giving CO money for screwing up CS2.\n\nAlso, CS1 doesn't really have a future. Once CS2 gets better and gets assets and console version, whenever that might be, few people will play it anymore. And unless someone makes a new competitor, which i don't see happening in the next few years, the people who don't buy CS2 now will probably buy it eventually anyway.",
            "Game released 4 years ago sells more than game released one year ago. More news at 8.",
            "Well there's a difference in opinion and experiences on how game releases work here.\n\nRegardless I do think it's worth cutting the dev team some slack; mistakes happen and they aren't intentionally missing the date. The comment that prompted my reply was in relation to execs and shareholders pushing for the release date. That's just not the reality, it's just a dev team shooting for a goal and missing it due to some process issue, which is quite common for larger releases.",
            "CS1 has a future the same way SimCity4 had a future: the sequel disappointed upon release. Instead of making a new game that was better than its predecessor, both Maxis and CO pushed out a buggy, unbalanced game that met very few of the expectations people had for a *sequel*, especially with as much time as there was between games. Lots of things nobody asked for, and little of what was requested unless it received a sub-par implementation.\n\nJust as I still play SC4 and never bought SC5, I still play CS and won't buy CS2 unless major improvements are made.",
            "You are missing the point and don’t seem to understand how a for-profit business works to sell products. CS2 has to be provable as its own revenue stream to survive. If more people are buying an old product than the new one, that not only indicates to them that their future revenue is in jeopardy, but it also shows them that they have a perfect jumping off place for improvement. Make the new game more like the old one."
        ]
    },
    "ZOOM IN! High Res Aerial photo of my newest project.": {
        "title": "ZOOM IN! High Res Aerial photo of my newest project.",
        "score": 233,
        "url": "https://i.redd.it/y9wqi590c28d1.jpeg",
        "content": "The City has a population of approx 80k people. The goal of this project was to build an organically grown city that is largely unplanned and influenced by topography and natural features. Transport infrastructure is built on an as needed basis as realistically as possible… aka lowest cost solution to fix hot spots just like real life. This explains all the at-grade intersections except for the busiest traffic locations.  Also tried to minimize highway infrastructure cutting through the city centre. Traffic during rush hour gets pretty bad but the city has an extensive tram, metro and bus network as an alternative to driving. What do you guys think?",
        "num_comments": 20,
        "comments": [
            "How did you do that? Is there a mod that does this??",
            "Wow very cool photo. Looks like a real Google Maps satellite layer 👍",
            "looks sick asf",
            "How did you make it so that the surface near the water didn't \"break\"? My textures near the shore always look so bad at a distance.",
            "beautiful! looks really like a organic grown city!! :)",
            "Some reason the downtown (? the part near the beach) has a road layout that reminds me of central Edinburgh",
            "looks like he made like screenshot and than merged them. thats how i do it when i want a hires photo architecture/cityplan.",
            "Ahh haha yea I meant a mod to do the satellite photo. Makes sense, something I’ll maybe try at some point with my city! :)",
            "A mod that does what? Builds your city? This is just a well designed city",
            "Thanks :)",
            "Thank you :)",
            "Looks like multiple screenshots were used to make this photo.",
            "Yup. About 60 top down screen shots at a zoom where everything is rendered then stitched together in light room!",
            "Thanks! That was the aim, if you look at a few of the major roads you can see where they cut through the existing urban fabric. So it’s quite clear where the old and new roads are.",
            "Can’t say I modeled anything off Edinburgh directly, but I suspect you are speaking of the Edinburgh New Town, north of the train station? I’ve been before, it’s such a contrast from the narrow random alleys of the old town to the perfect grid of the new town.",
            "Yup took about 60 screen shots in a grid and used Lightroom to do a panorama merge. Not the best way to do it, but does the job. I have a background in geomatics but don’t have the crazy expensive photogrammetry software available to me sadly 😂",
            "are you slow? He clearly asked about the resolution, no need to be a jerk",
            "Yes, sorry, I do mean the New Town. I’ve never visited Edinburgh, and my knowledge of its layout largely stems from playing Forza Horizon 4 lol. I think what reminds me of it is the the grid and the green spaces above it, as well as the fact that there’s a roundabout on the left side that reminds me of Moray Place.",
            "I agree that's absolutely not clear what was being asked. Also the irony of telling someone no need to be a jerk while making an ablist asshole comment of \"are you slow\". Be better.",
            "Clearly? Where at all in any way remotely did they ask that?"
        ]
    },
    "WIP Coming Home": {
        "title": "WIP Coming Home",
        "score": 24,
        "url": "https://i.redd.it/0rctvfoab48d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Looks sick! Is this the GTA5 map by any chance?"
        ]
    },
    "Is it possible to build something like this?": {
        "title": "Is it possible to build something like this?",
        "score": 203,
        "url": "https://i.redd.it/dhp0jc77m08d1.jpeg",
        "content": "Is there an easy way to do this? I know one method but it doesn't look the best and takes up a lot of space\n",
        "num_comments": 21,
        "comments": [
            "Not cleanly Vanilla. Until we get asset mods, I would be splitting the roads and using two separate 2 lane, one way roads, and a tram track in the middle of them. It'll look a bit better modded because you can place the assets closer together with Move it, but you could do this vanilla as well, it'll just be much wider and farther spaced out.\n\nEdit: Played around a little using Anarchy and Move it, here's an example of a short, unrealistic ramp, and a longer, more realistic ramp. You could make these vanilla as well, they would just need a little bit more spacing. I would like some road networks that are a bit tighter and waste less space to make this more cleanly. For example, no inner parking or sidewalk.\n\nhttps://preview.redd.it/bxmaegwgt08d1.png?width=3840&format=png&auto=webp&s=645a30d4738cb32420d785869b9f7fd129b34eb2",
            "No, but we were pretty damn close to being able to.",
            "Nope, at least for now. I’d suggest split the 4 lane 2 way into two 2 lane 1 way on each side and make them far apart. Insert a standalone tram ramp in the middle, then connect to an upgraded rail 4 lane 2 way",
            "possible in skylines 1 with the vanilla overpass project mod. Not currently possible in skylines 2.",
            "Why won’t Colossal Order give us highways that shoot laser beams?!?",
            "Trying to build two way road into one?",
            "Delete the bit where it needs to connect. Connect the rail. Connect with 2 one way two lane roads?",
            "man i wish regular roads without parking and sidewalks were available that could drive *right up beside* walls for things like this.",
            "Were \n\n\n(About your flair) I thought you could have metro crossings?",
            "I never quite understood why they added Vanilla to that name.\n\nIt being a mod/asset inherently doesn't make something vanilla.",
            "A custom intersection set of sorts. 1 unit wide.\n E.g:\n\n- 2 lanes + 1 footpath + curb [left OR right]\n- 1 lane + no footpaths [just curbs]\n- 1 lane + 2 footpaths\n- 1 lane + 1 footpath + 1 curb",
            "Even just for a skinny 4 lane road.",
            "It's physically impossible in CS2. They aren't allowed to intersect roads.",
            "I would guess that it’s because the assets are Vanilla-like. The roads are modeled after the vanilla roads so that they fit in with vanilla CS. If you are a KSP player then this would be the equivalent of a “stockalike” mod",
            "It makes me sad, before the game came out, based on the dev diaries, I thought adding/subtracting a lane or side walk, parking, with the replace tool was how road building was going to work. No more fixed lane networks, just add/subtract road element. Want to remove the sidewalk? Replace tool. No more parking? Need to create an asymmetric road by adding a lane on one side of the road? Replace tool. Bus lane on one side, bike lane on the other side? Replace tool. Instead, we got kinda a partway of that.",
            "Ah, I play CS1 because my pc 😭",
            "Well technically they wouldn't be metros then. Metros don't have intersections.",
            "Vanillike",
            "At least the foundation lends itself to something like that later down the line via an update or mod.",
            "If this happens I would reinstall c:s2",
            "Vanilla CS2 runs better than (moderately) modded CS1 on my PC lol"
        ]
    }
}