{
    "/r/Civ Weekly Questions Thread - June 17, 2024": {
        "title": "/r/Civ Weekly Questions Thread - June 17, 2024",
        "score": 8,
        "url": "https://www.reddit.com/r/civ/comments/1dhufkg/rciv_weekly_questions_thread_june_17_2024/",
        "content": "Greetings r/Civ. \n\nWelcome to the Weekly Questions thread. Got any questions you've been keeping in your chest? Need some advice from more seasoned players? Conversely, do you have in-game knowledge that might help your peers out? Then come and post in this thread. Don't be afraid to ask. Post it here no matter how silly sounding it gets.\n\n##To help avoid confusion, please state for which game you are playing.\nIn addition to the above, we have a few other ground rules to keep in mind when posting in this thread:\n\n* Be polite as much as possible. Don't be rude or vulgar to anyone.\n* Keep your questions related to the Civilization series.\n* The thread should not be used to organize multiplayer games or groups.\n\n## Frequently Asked Questions\nClick on the link for a question you want answers of:\n\n* [Is Civilization VI worth buying?](https://www.reddit.com/r/civ/wiki/faq#wiki_is_civilization_vi_worth_buying.3F)\n\n* [I'm a Civ V player. What are the differences in Civ VI?](https://www.reddit.com/r/civ/wiki/faq#wiki_i.27m_a_civ_v_player._what_are_the_differences_in_civ_vi.3F)\n\n* [Should I play Tall or Wide?](https://www.reddit.com/r/civ/wiki/faq#wiki_should_i_play_tall_or_wide.3F)\n\n* [Where should I settle my cities?](https://www.reddit.com/r/civ/wiki/faq#wiki_where_should_i_settle_my_cities.3F)\n\n* [How have Domination victories changed?](https://www.reddit.com/r/civ/wiki/faq#wiki_how_have_domination_victories_changed.3F)\n\n* [What are good beginner civs for Civ VI?](https://www.reddit.com/r/civ/wiki/faq#wiki_what_are_good_beginner_civs_for_civ_vi.3F)\n\n* [In Civ VI, how do you show the score ribbon below the leader portraits on the top right of the screen?](https://www.reddit.com/r/civ/wiki/faq#wiki_in_civ_vi.2C_how_do_you_show_the_score_ribbon_below_the_leader_portraits_on_the_top_right_of_the_screen.3F)\n   * Note: Currently not available in the console versions of the game.\n\n* [I'm having an issue buying units with faith or gold in the console version of Civ VI. How do I buy them?](https://www.reddit.com/r/civ/wiki/faq#wiki_i.27m_having_an_issue_buying_units_with_faith_or_gold_in_the_console_version_of_civ_vi._how_do_i_buy_them.3F)\n\n* [Why isn't this city under siege?](https://www.reddit.com/r/civ/wiki/faq#wiki_why_isn.27t_this_city_under_siege.3F)\n\n* [I see some screenshots of Civ VI with graphics of Civ V. How do I change mine to look like that?](https://www.reddit.com/r/civ/wiki/faq#wiki_i_see_some_screenshots_of_civ_vi_with_graphics_of_civ_v._how_do_i_change_mine_to_look_like_that.3F)\n\n* [If I have to choose, which DLC or expansion should I purchase first?](https://www.reddit.com/r/civ/wiki/faq#wiki_if_i_have_to_choose.2C_which_dlc_or_expansion_should_i_purchase_first.3F)\n\n* [Why can't I build a district or wonder on this tile?](https://www.reddit.com/r/civ/wiki/faq/#wiki_why_can.27t_i_built_a_district_or_wonder_on_this_tile.3F)\n\n* [Why can't I build a national park here?](https://www.reddit.com/r/civ/wiki/faq/#wiki_why_can.27t_i_built_a_national_park_here.3F)\n\n----\n\nYou think you might have to ask questions later? Join us at [Discord](http://discord.gg/civ).",
        "num_comments": 38,
        "comments": [
            "Can you choose to only have a certain time period in civ 6? Like if I just want it to be the classical swords and horses and not expand into modern tech and armies can I set a game up with a stopping point?",
            "Did anybody try the new monthly challenge, Terra Ingognita? \n\nI've been enjoying them so far and although I like the idea of the current one, it seem very broken.\n\nEven on emperor it's trivially easy to rush Cartography and just take over the entire new continent before other nations even bother to explore, leaving you with insane resources and luxuries.\n\nIn my quickly finished game at Prince, London had two cities that could do nothing but rebel at disadvantageous locations. Liking the idea I started again on Emperor, and it was even smoother other than slightly more trigger happy Barbarians...",
            "I got into a game where I couldn’t for the life of me set up any campuses with greater than 1 adjacency bonuses. How do I overcome this? I fell way behind on science and never caught up.",
            "Hi. I'm new here, so don't know if I ask in the right place, but anyway. I have R&F, my friends don't. Can I do anything to play as Genghis Khan in game with my friends? Or we all need to own R&F?",
            "How good does Civ VI work on the Nintendo switch? Is it playable or is it very laggy?\n\nAnd is the Anthology dlc worth it (on switch)?\n\nEdit: I bought the base game! Because it’s €3! Now the question about the Anthology DLC still stands, right now also on sale for €20",
            "Is “God of the Sea” pantheon applied only proactively to new fishing boat improvements? \n\nI had several already improved fishing improvements in my civilization when I picked this pantheon, but I am not seeing any improvements to production from these. I just improved a fishing tile since I picked pantheon, and I see the extra production. \n\nIs there a way around this? This is stupid, but is it worth it to get a builder, destroy all fishing improvements, and rebuild them? Feels like a waste to do pantheon without the tiles I already own",
            "Is $25ish the cheapest the Civ 6 Anthology gets? I saw it listed on steamDB for $11.50 but only for a single day",
            "I have been playing Civ V for years but I have never managed to win the game at level 5. Does anyone have any suggestions for strategies to try so I can beat it? Which leader is the best? \nThanks! :) \n(ps I don’t have any dlc or anything fancy like that)",
            "Got a new pc and am wondering if you could transfer your hall of fame to your new pc\n\n\nMy new pc hall of fame has all leaders not highlighted and the victory type/amount of victory tries.\n\nIs there a way to transfer the files over?",
            "Is there any way to edit existing game saves to remove a mod depndency? I started a game on Windows and it had the Julius Caesar mod enabled - although I'm pretty sure the game doesn't use it in any way, but I then tried to transfer that save over to a Linux machine and, although it can find the save, it won't load it because the Julius Caesar mod isn't installed. \n\nI have connected to my 2K account, but I'm still not getting JC. I also tried contacting 2K support who said I need to contact Aspyr support - and their support site isn't working for me!",
            "I was running away with a game and then out of nowhere my GPT began declining and then massively went into the negative for no reason. I googled it and people are saying it’s enemy spies. How do I prevent this from happening? I started putting spies in my cities as defense but they can’t catch the enemy spy. I’m about to lose now.",
            "Multiplayer is being weird, I've seen multiple videos and researched, and everyone with the same config doesn't seem to have the same problem as me. I can't find my friends in the world, we've put it in huge and it's still super small, and everyone's map is different. I have no idea what is happening as we're all begginers. Help is appreciated. We're all playing Civ VI.",
            "So I've never been one to indulge in other era starts besides ancient (and classical if im feeling spicy). Knocked out a renaissance one for the achievement but noticed old wonders like hanging gardens wernt available. Pretty sure I checked early on and saw they were unavailable so were they sniped by the AI or straight up not available with a renaissance or later start?",
            "There are mods to do it, but unsure of their names, being a console player.  You can’t do it without mods, and I’m really hoping Civ 7 will give us something like that. \n\nWithout mods, the best you can do is play on the slower game speeds, which lets you spend more time in each era and you can explore much of the world that way, but the production costs increase accordingly so it still takes a long time to build said units.",
            "As the game goes on, a districts's value is more down to it's buildings than it's adjacency bonuses, so you can focus on those. You can also consider putting envoys into scientific city states. Pillaging can be a great way to pick up science too.. Sheer number and size of cities will help too.",
            "I usually don't prioritize or even bother building a campus until I'm done making industrial zones and commercial hubs for all my cities.  The passive science you get from population is generally enough to keep your research going at a reasonable pace in the early to mid game. After my city has good income and production I may make a few campuses if I'm not aiming for a science victory, or many campuses if I am.  ",
            "yes you all need the dlc",
            "if interested the game and all dlc are on huge discount on steam",
            "It's extremely slow and is basically 100% guaranteed to crash if you play on standard or larger map sizes.",
            "It should apply to current boats. Any chance it's a display bug? Like, if you click on your city and tally up production sources, are the pantheon bonuses there?",
            "it definitely applies to existing ones as well for me",
            "For now, yes. It might drop in price closer to a Civ 7 release.",
            "When jumping up a difficulty level, I find its easiest to pick a civ that really drives you to a particular victory condition and a particular playstyle. Its been awhile since I've played Civ V, but I'd think a few good civs, and the reasons for playing them, would be:  \n-Venice - you may have to save-scum a bit to get a decent starting coastal location, but then you can focus just on trading, building trading wonders, getting a ton of gold, playing Tall/Tradition/Rationalism.  \n-England - play an archipelago map, and build a strong navy and conquer most of the world.  \n-Zulu - same, but land-based. Play Pangea, build up a military, run over all your neighbors.  \n\nAlternatively, just play the really strong civs (Poland, Korea, Babylon) and lean into/really understand how to play well. For instance, Poland - what are the optimal social policies. For Korea/Babylon - how do you maximize science.  \n\nFor what its worth, the DLC really improves the game. It takes Civ V from a \"B\" game to an \"A/A+\" game.",
            "I'm not sure but I wonder if you log into a 2k account on both if that works. Or if you enable cloud saves through steam on both devices if that does anything.",
            "You can do it by copying the HallofFame.sqlite file from your old pc to your new pc. Should be in Documents\\\\My Games\\\\Sid Meier's Civilization VI.\n\nThats how I did it, iirc",
            "If you hovor over the GPT in the top left it should tell you where your money is going. Make sure your spies are defending either on or adjacent to the commercial hub districts. Start trading with the highest yield trade routes. Delete units or put in the military card that reduces unit maintenance. Put in other cards that increase GPT.",
            "Do you have any more info? Do you all show up in the same lobby before starting?",
            "Wonders from previous eras aren't available.",
            "Is it possible (or semi likely) to play at slow speeds and end the game before transitioning into later periods?\n\nRise is nations let you pick certain time periods, tbh that should always be an option for these types of games \n\nBut yeah I mostly play on Xbox so I guess I’m beat",
            "Yeah I tried to spread wide and make as many campuses as possible but it was simply too slow. And because of opportunity cost the time spent on campuses was time not spent on builders and commercial districts and my production suffered and I fell behind.",
            "That’s wild to me",
            "Without GS enabled I find it rarely crashes on standard maps.  I do a lot of “just one more turn” play, so I often have games going well beyond 500 turns.  For me this is okay, because with late game play I find GS pretty much breaks my enjoyment anyway.\n\nBut yeah, it takes a while at that point to process turns.",
            "Thank you :)",
            "We simply start the lobby on the default rules but the map for everyone of us is different",
            "It’s probably easier with some civs than others.  Like I’d imagine with Rome you could build up a large army fairly quickly and conquer everyone on Terra or Pangaea.  Maybe someone more skilled than me can whip up a culture or religion victory that quickly, but tbh that doesn’t seem like much fun.",
            "I'm not sure if this would work, but in advanced setup you can change there to be a set limit of turns. You could maybe have the slower game speed and end the game in a lower number of turns? That way you would have more time in the earlier eras and end the game by the time it starts getting later. Just a thought, not sure if it would work but you could try.",
            "I kind of agree with the other commenter. It depends on your difficulty, but I generally focus on putting down the most amount of cities as possible first. I might put a campus in my capital and maybe my second city if I'm focusing science. But if you focus on having a lot of cities and your core cities having high population, then you'll find that your science and culture just balloons. Don't forget to put Pingala in your highest pop city and level him up because that should be at least ten science and culture each. Religion can help too. It can help boost your population through food output. Or you can get tenants and buildings that boost your science and culture.",
            "Go to multiplayer, > unified play> start the lobby> grab the join code> have people join with that join code. Before you start the game, do you see everyone in the same lobby as you? Can you see their steam names? Send a picture to confirm."
        ]
    },
    "Civilization VII Megathread": {
        "title": "Civilization VII Megathread",
        "score": 128,
        "url": "https://www.reddit.com/r/civ/comments/1ddoyil/civilization_vii_megathread/",
        "content": "A little late, but share your thoughts of the nrw upcoming game here. Reminder to keep things civil.",
        "num_comments": 226,
        "comments": [
            ">Reminder to keep things civil.\n\nNo thank you.  I will keep things civilization and DOMINATE!  Eff your warmongering penalties, I shall prevail!\n\n\n\n... I'll see myself out now.",
            "I hope they add more ancient civilizations that no longer exist, like Sumeria, Babylon, Phoenicia, etc.",
            "I am once again begging for navigable rivers",
            "I just want employment/immigration/industries cycle. I want people to flock to my cities with jobs from rival civs!",
            "If there’s no Napoleon I’m rioting. \n\nI’ll still play it, of course. But also riot.",
            "I really hope they keep some version of the district system. I feel like it adds so much to the gameplay and look of the map.",
            "I would like more variety between different Civs. Venice from Civ5 was a great example. Having a Civ which could, for example, work five tiles from the capital instead of 3 would be amazing even if they had other penalties and would make the game totally different for different players",
            "I’m very worried about the multi-platform launch. The fact that a switch can barely run Civ VI but will be a Civ VII launch platform reads to me like VII will not even come close to pushing the envelope of 10 years of compute advancements since the Civ VI engine.",
            "Some things id like: \n\nI want  more alt leaders focused on different victory types for the same civ. Catherine can stay for culture for France but add Napoleon for domination and war. Japan can easily have different leaders that focus on either war, culture or even science/industry. \n\nI'd love even more, even bigger True Start Maps. Give us True Start China and let a dozen different Chinese dynasties compete to become the most powerful. True Start Africa so African civilizations get more focus.\n\nGive us scenarios again but make them even better. Add a Sengoku period scenario to unify Japan, or even alt history scenarios like conquering Europe as the Mongols.\n\nMAKE NAVIES MORE IMPORTANT!",
            "1: I would like to see is more contemporary/modern era civilizations or units like the Soviet union, Peoples republic of China, Argentina and post-reunification Italy. \n\n2: Another thing I would like is MAD/mutually assured destruction. One thing I liked about Humankind was when you launched a nuclear bomb it took a turn so it gave the enemy a chance to launch but in civ who ever declares war first is the one to launch and hit in the same turn which feels like the total opposite of the purpose of nuclear bombs which is to deter aggression. \n\n3: No Asset limit along with more life to city's something akin to the City Sprawl Graphics mod for civ6 to make city's feel more thick and dense and really urban. Maybe little trains on train-tracks you make   \n  \n4-This ones more of a loose idea but some sort of minor nation mechanic that works almost identical to city states, I like city states but I feel like bigger entities (thinking 2-4 citys) that are non-player would allow more opportunity's as well as provide better interactions between majors and minor nations with new diplomatic dynamics. It always felt off or strange that the world is filled with these massive powers like Russia and the United states and the only other political entity there is are these tiny 1 city states. I do see the glaring issue that I feel as if it would be difficult to add and make it feel civ-like (as well with lag from Ai troop spaml).",
            "After seeing a few Korean historical dramas I'm ready for Khitans and Jurchens.",
            "I’d love them to expand upon monopolies and corporations more, and think it’d go well with a way to either sell tiles to other players or a return of something like the civ v great general and citadels. Add both an aggressive and cooperative way to obtain more of your monopoly resource without conquering the city. \n\nI’d also love to see Vassals with adjustable taxes. Instead of wiping someone out of the game have them contribute to your empire, while also their own empire, allowing them to rebel at a later point if they like. This would remove the need to micromanage a whole continent if that’s not your play style, at the cost of the full benefit of those cities. Have all luxuries count toward the conquering nation’s monopoly, to add more interactions and depth with that system.\n\n\nAnd I have been asking for it on threads for years, but I want a scientific America as powerful as civ v Korea/babylon. I think JFK would be a very fitting leader to have in the franchise given the way the science victory condition works. Though a production monster would perhaps be even better, I’d love to see FDR return.",
            "Hoping for a way to go to war over a tile or set of tiles without having to take an entire city along with it.\n\nThere's a strategic resource or choke point I want, but I don't want the population center associated with it. \n\nA much lower threshold to achieve in a peace deal for a civ to cede it to you, and very thematic.",
            "My pc is not gonna be able to load it and I'm feeling super sad",
            "Though of the day, with advances in ‘AI’ (and I know it’s not AI) I think the game can really make some fantastic autogenerated maps with ‘territory borders’ which revolve around terrain difficulty/coasts/forests/rivers and improve upon the current hex system. Imagine a wood being divided into smaller regions emphasizing it’s difficulty to trek through but plains being larger territories making them easier to cross.",
            "I hope that civilizations get more unique mechanics that are exclusive to only them to really make civilizations stand out more from each other rather than they have some \"stats and number differences\" at the end of the day. \n\nLike let's see a unique Mandate of Heaven mechanic that only China has, or a Manifest Destiny mechanic as America.\n\nMy concern with this idea is that this would make each civ more taxing to develop, and thus there would be less civilizations overall probably, and people love to see more new civilizations, so they can't be too different.\n\nCiv 6 was a step in the right direction to me with unique leader and civ abilities over just Civ 5's simple civ abilities, but I'd like to see Civ 7 expand even more on what differentiates each civ.",
            "Unpopular opinion, but I'd like a really different game from V and VI. They should keep the basics, but I'd want a complete evolution. I feel like most people just want a Civ VI.5 (while Civ VI itself was a Civ V.5). I would prefer more experimentation.",
            "I genuinely think Patrick Wyman (Tides of History podcast and author) is narrating Civ 7. He's been to their offices during development, and a host of Trashfuture podcast (friend to Patrick, who has been on the show) has also said he believes so. Could be wrong but seems like a reasonable source.",
            "It always makes me wondering how Russia is going to be represented in games after 2022 since the country is getting cancelled all over the Western hemisphere.",
            "I like the way Civ 6 lets you modify your government easily, with the social policy cards system, but I'd quite like a more long term commitment mechanism like in Civ 5. \n\nPerhaps having two systems, the Civ 6 version that gets new choices every civic research completed, and a more rare upgrade opportunity that occurs with specific civic unlocks, similar to the governors in 6.",
            "I hope there are new mechanisms for air combat and sea combat:\n\n+ Aerospace zoom of control, Air Superiority.\n+ Multiple turn bombard missions, instead of fly as fast as ICBM\n+ More options to airdrop troops\n+ Bring back sea blockade from CIV 4\n+ Automatic trade routes privateering\n+ Escort ships to trade routes",
            "I wouldn't mind if CivVII delved also more into the late game with Expansion to the Moon or Mars. Practically an extra playset for the Moon and Mars, simultaneously. That might or might not be interesting. I wonder if it was somehow possible to move Civ into the Solar System once the initial space race is over, practically turning it into some kind of For All Mankind or The Expanse. Probably too much to wish for.\n\n  \nEither way I never found my way into VI, and still play V and Unciv religiously. I like the religious wars aspect, it was too simple in V.  \n\n  \nI would love some canals to connect inland cities with the sea.",
            "Do we have *any* information on gameplay yet?",
            "I've been out of gaming for about 4 or 5 years now. How long have teasers encouraged wishlisting instead of preordering? That's a nice compromise for both consumer and producer, as opposed to preordering.",
            "I wonder who will replace Kongo to fill the african power vacuum. Im hoping for benin",
            "Chandragupta was a step in the right direction for India. Time to remove Gandhi and have an actual Indian Prime minister as leader of India. Older leaders like Chandragupta should be turned into their own civs, and more Indian civs please like Marathas, Guptas, Sikh Empire, Vijaynagara Empire etc",
            "I'm trying to think what they could do to make CIv VII really stand out from the other Civs.\n\nCiv VI felt so close to a perfection of the formula IMO that I don't know what the next big step could be. \n\nI hope there isn't too much focus on a new combat system. Combat is very low down on the list of reasons I play Civ. I'd like health to come back and be an important part of city management, and I'd like immigration to be a thing (quite surprising it hasn't been before now). And yeah, navigable rivers would be cool. But what's the USP going to be?\n\nIt would be really interesting if the games were much more dynamic. Civilisations actually rising and falling throughout the game, instead of the same base list gradually shrinking. But it would be really hard to make this work in a way that isn't frustrating to the player and doesn't make the player feel overpowered. I don't see Firaxis going with this.\n\nI think they might make combat the USP, but like I said, I really hope not. But I just struggle to think what the next step could be that would make Civ VII feel like its own game and not just DLC.",
            "For the love of god fix the combat. I'm tired of siege doing like 3 damage against walls which the AI can just spawn. Defensive play in VI is way *way* too easy. If you're not ready for war, you should be punished for it. Siege units are already incredibly weak, at least let them dish out good damage. And if we're gonna keep the city attack (I say remove it and only the encampment should have it), you at least need ranged units garrisoning the city for it to activate.",
            "1. Naval early discovery and warfare(in all eras) are massively lacking in Civ 6. I hope to see some better AI and mechanics for this in Civ 7. (Current US Navy, British/German WW2/1 Navy\\[Yes I know, Uboats... subs are boring\\], Spanish Armada, Portuguese Exploration Fleets, and Age of Pirates to take inspiration from)\n\n2. Tech overhaul: Tech tree's have always bothered me in these types of games, everything is too linear. I want to see some sprawling tree's I want tech choices to matter. If one player goes down a military tree, they should have a distinct advantage against one who doesn't. There are advantages in current iterations, but they seem nominal and the catchup mechanic makes it so they aren't so special. Also, you should be able to pour more research into a specific tech to \"level up\" that tech. (Maybe you're playing Germany in 1940's your Airforce contains BF 109Bs but if you route more research into your airforce tech you can upgrade them to BF 109Gs for a better performing unit. This can also apply to non combat techs, its just easier to make the comparison with combat techs)\n\n3. Tech Sharing: To combat stagnant researching periods, you should be able to trade techs for resources/gold/units/political leverage. Maybe you're playing a trading nation, you focus on trade and gold production, your neighbors are a cultural powerhouse and are slowly influencing your nation turn by turn. Why not trade some of that gold and some political leverage, for some military tech to help you keep them at bay. You get a boost to military, military nation gets to field their soldiers for some more turns, and they can call in a little political favor.\n\n4. AI in general just needs to be less predictable. World Congress needs to be reworked to be more meaningful, and much more taxing to be on the wrong side of it or make it so you can form your own congress(UN/BRICS as an example). Major wars should be an event, you should have to pick a side, even if you're just providing aide and not fighting in it. These wars should slow down the game significantly until they're resolved. The world, or most of it, is in a scrap, not much else is getting doneor matters.\n\n5. Slow the game down slightly. The era/tech pacing seems too fast. Of course leave options for faster games.\n\n6. BIGGER MAPS. Civ 6 seems very small compared to competitors games.",
            "A lot of \"create an empire that spans all of human history\" 4x games have come out since Civ VI. Humankind, Old World, Millennia. I don't think I ever remember them having this many competitors when Civ III, IV,V, was the latest game.\n\nI'm excited to see if any of those games end up giving them some inspiration.",
            "A few ideas for new civs:\n\nKievan Rus\n\nZaporaozhian Sich \n\nSoviet Union - Production based, T-34 unit?\n\nBarbary States - special unit is Corsair.  When it coastal raids the impacted city loses 1 pop, barbary gains 1 worker (that has to sail back to one of their cities)\n\nSomething from Anatolia like Hittites or Phrygians\n\nManchu\n\nWestern North American indigenous groups\n\n  \nThoughts?",
            "From the trailer you can tell there will be:\n1- sumeria (ox carts)\n2- egypt \n3- china (Great Wall)\n4- mongols (Great Wall fighting scene)\n5- England, France, America",
            "can we just make germany and holy roman empire separate civs",
            "I don’t have any crazy wishlist improvements for 7 really, but I would love if there was more variation between how cities look. Seems like in 6 there’s 3-4 city styles, so sometimes 4 or 5 cities in your civ will look exactly the same with the same buildings. I also like the metropolis suggestion a few comments down.",
            "Things I hope to see in civ 7:\n\n- Better balance for playstyles. In civ 6 large empires dominated everything completely oversimplifying the game to the point not doing it felt bad and doing it felt different bad because everything had to be done manually.\n\n- Less mandatory micromanagement. Automated workers back. Some form of automated city planners or puppet cities you can use like civ 4-5. If I just want a town for iron, oil or whatever don't force me to manually build billion things in a place I care nothing for.\n\n- Vassals from civ 4.\n\n- Tech and map trading back in some form.\n\n- Better wonders like pre civ6 to give them proper risk/reward.\n\n- Rid of needing to place wonders to tiles replacing the yields.\n\n- Mega cities with no size limits, no more of the dullest cities ever like civ 6. With any luck some level of merging of cities even like in real life.\n\n- Armada, Great person and barb -systems from 6.\n\n- Either dynamic promotions based on what unit has done or civ 4-5 style free options. Get rid of the super narrow options civ 6 promotion tree gave which ate half the fun of wars.\n\n- Natural disasters and random events.\n\n- Ditch the mobile platform and art-style to give us nice graphics again.\n\n- Bring back the most known leaders even if they are controversial(such as Mao, Stalin and Hitler) instead of only using safe ones.\n\n- Strong nation and leader bonuses so differences to other leaders are notable. Civ 6 had horrible start with blandest bonuses initially.\n\n- Civ 6 government system as base, but one that builds over time. Not in giant leaps from one system to another and it should lock chosen perks or slowly over time switch them.",
            "I think what I'd most like to see is some sort of \"out region\" mechanic. As it is now, unless you build an entire city for it, outlying resources are basically useless. It would be nice to be able to establish something that isn't a city to, say, exploit coal. \n\nHistorically mining camps and things like that have absolutely been things, after all. \n\nI'd also like to see the zone a city can work expand over time. Not just in the form of borders, but, like, when you unlock modern roads make the 4th ring workable or something. \n\nI'd love to see suburbs become a thing too. Neighborhoods did that a little bit, but, IRL it's not \"city\" and \"nothing\", there are lots of small towns and shit too.\n\n\nThe Craziest one that I'd really love, is not letting people settle for the first 5-10 turns. Have there be an unlock before settling is an option. Would help fix the issue with terrible starts, and also feel realistic.",
            "I hope that we see more visual cues about the chosen policies, happiness, or yields of each Civ.\n\nI want to see cultural cities of shining marble defending themselves against the tents and huts of warlike barbarians. Autocrats should have cities like imposing fortresses. Religious hubs should be filled with the spires of cathedrals and minarets. I want to see imposing Soviet apartment blocks, and belching smokestacks. Spotlights should light up the night during wartime. Just give us as much visual information and flavor as you can.\n\nAlso, you should be able to build a special settler as a wonder. This settler will found Las Vegas, with a unique look and tourism modifier.",
            "Already excited for Civ VII. This and the new Anno will really test my resolve to not pre-order games.",
            "For the narrator I think we should love away from British accents to ... Marion Cotillard. I would listen to every single loading screen.",
            "They should make the map an actual globe shape instead of flat. What do you guys think?",
            "Is this the thread for things we would like to see in 7? \n\nIf it is, I'd like to see being able to group forces of different upgrade paths. Like have an archer linked to a swordsman but can't link 2 swordsmen until you earn the tech to merge units together like armada and fleets, and have them be able to use their abilities, but only one per turn. Like, you can either use the ranged attack or the melee attack, but not both, but both will work in defence.",
            "I couldn't read all comments, but I have so many cool ideas - cool in my imagination at least.\n\n* I think the game should include some sort of achievement or bonus if the player is able to \"replicate\" a actual historical event in game - either through war, or science, or religion, or culture...\n* I also would like to choose between different leaders for each civ that grant different bonus according to the historical moment of said leader\n* I would like to enter and \"walk\" through my cities or at least my capital\n* I would like my spies to be actual characters that I can interact with. And maybe you can catch enemy spies in your territory because they look kind of off.\n* Resources should be \"finite\" as in eventually you run off of said resource and the tile becomes a regular one but also at any given time it \"reapears\" somewhere on the map\n\nAnd so many more ideas",
            "I just want no desyncs in MP",
            "* Economic Victory. I suppose a Cultural Victory is kinda sorta one now, but I’d like to see it as a separate way to win. *Revolutions* had it as a possibility, but the conditions were simple — get 20K Gold and built the World Bank wonder. I’d like something far more elaborate, dominating the world with goods and manufacturing. \n* Leaders being replaced. Why not have the possibility of, for instance, Russia’s leader changing from Catherine to Lenin?\n* Bring back the Palace screen (when was the last time they had that, Civ II?), “We Love the King Day” and the advisors with “personalities” (Sid Meier for science and Elvis for culture).\n* Religious schisms. You’re running a Civ that follows Christianity, which was created in another Civ. You can create Protestantism! \n    * Similarly, religions that form from another, like Christianity coming out of Judaism.\n    * (Yes, I know, both of those are over-simplified.)\n    * The ability to run an officially atheist state — maybe penalties to culture and happiness but bonuses to science.\n* Better religious conflict than in Civ VI. The dueling prophets seemed exceedingly silly to me.\n* Cities are nearby each other and eventually grow so big you can merge them. *Humankind* does this. As a resident of the Baltimore-Washington area, this one has personal relevance to me.\n* The ability to relocate your capital, presumably at a significant cost.\n* [More skin on *Love Boat*](https://www.pinterest.com/pin/bloom-county-comic-strip-by-berkeley-breathed--416020084338784042/) (Sorry, that’s a *Bloom County* deep cut I just tossed in because it amuses me.)",
            "Hope they introduce machine learned real AI, not dumb bots that start with three four times the starting units. We are in 2024 after all.",
            "You made a typo in the word ‘new’.",
            "I'd love for trade routes to get more in depth and have the capacity to be more mutual outside of specific civ or wonder bonuses. \n\nI'm imagining a system based around basic, luxury and strategic resources, where each generates trade power for the city it belongs to you. \n\nCities would then gain a small portion of the yields generated by neighbours in a friendly manner, with the dominant trade partner gaining a greater amount. Normally this would be a symbiotic relationship with no yields being lost, but policies/wonders/civ bonuses could turn the relationship parasitic so you could literally drain the yields from foreign cities. (Or maybe this would just happen once a city becomes *too* dominant in terms of trade power)\n\nSimilar to Monopolies & Corps, you could use Merchant units to build Industry and Corporation improvements to generate additional trade power greater than the sum of its parts. Additionally, with the right techs Merchants could be used to set up longer range trade routes as well as building or taking over the Corporations of foreign civs, sending their trade power to their home city (or perhaps just the closest city). \n\nThis would actually bring an economic victory into possibility, by making the trade system something a single Civ could come to dominate, boosting their own economy with the yields of foreign powers.",
            "more vanilla scenarios and bring back roman ones! like rise of caesar, rise and fall of rome or like something similar, regicde mode, landships, mods for console and leadership titles (like civ 2, 3 and rev everything from govt title to civ ruler title), scenario maker on console and finally if they are going to add alt leaders, make have unique shit instead of traits, like Washington has milita barracks and minutemen and Abe has union soldiers and Nixon with C.I.A.  Civ traits return and finally the praestorian guard",
            "I’ve been sitting on this idea, but i think they need to add a new mechanic to account for changing population densities. I get they wanted to remove one city wonder stacking for Civ 6, but it went too far the other direction. Land for your cities have districts, wonders, and strategic improvements  competing for it all. While starting in a rural low density, eventually with later eras, you should unlock an urban toggle, then eventually a suburban one, and end with maybe a dystopian/utopian variant of these for the inevitable future era.",
            "This announcement awakened the worst in the sub. First, it was spammed with nattator options, and now it's flooded with those unfunny pics.",
            "Thanks for the megathread, mods. Now please remove the dozen other shitpost threads about Civ 7. Thank you.",
            "For improved systems, I really hope they put work into improving trading and diplomacy interactions with bot leaders. What if bot leaders could \"remember history\" in some way, and react based on crucial past events? Holding grudges or returning favors based on the last few hundred years. \n\nAs for new features, it would be cool to see some sort of Metropolis implementation. Maybe when three or more cities combine inner borders, it becomes a metropolis. My thought is that this could alleviate some of the tedium of the late game. Maybe cities in a metropolis can dedicate their production gains to another city in the same metropolis? In a way, it's similar to creating armies or corps out of grouped units. Or maybe there are some systems that become autonomous? Just a thought, but there's gotta be a way to keep the late game from slowing to a crawl.",
            "What if they added a doomsday victory? You are the reason the world ends. And there will be different ways to do it like war, disease, death laser etc. This could be a fun game mode.",
            "I go through phases of getting **super** into Civilization and then taking a long hiatus from it, only to come back strong as ever and binge the hell out of it. I was around for when UrsaRyan first started his badly drawn posts, and I'm so very pleased that after the official announcement of Civ VII and coming back to this sub, UrsaRyan is still going strong. I still feel like we need to make him a Great Person in the next game, lol.",
            "I would love to see religion get overhauled. It just feels like another thing to \"micro\" in the mid-late stages and I haven't really felt like I enjoyed religious mode in any of the civs.",
            "I guess i'm pretty alone in my opinion but i would wish for maybe less options to create a game but instead more focused and balanced variants. Personally i would love a setting with streamlined/simplified rules for better mutliplayer matches or shorter games like in civ revolution.",
            "I'm hoping for some more civs new to the series. Brunei, the Franks, Judea, Mughals, Florence, etc.",
            "Bring back corruption. Make it associated with city size/distance from the capital, kinda similar to Civ III.\n\nI also wouldn't mind going back to some Civ V ideas, specifically city layouts and the game's art style. I'm sorry but the Civ VI animation style was atrocious. I really hate this shift to cartoonish looking games. And I wasn't a fan of the city districts format",
            "I would really like for them to expand on diplomacy and offer more interesting things to do than waging war.\n\nCulture and Tourism was a step in the right direction but it felt really unengaging and I always ended up starting wars just out of lack of other things to do.",
            "I think changes in geography would be fantastic to have. I like the idea of having varied elevation, like in the game Humankind for example. I hope they also include navigable rivers, barrier islands, and even natural harbors. Adds more importance to the strategic nature not just in terms of resources but also place itself. Give a uniqueness to it.   \n  \nI would also like to see right off the bat, more varied vegetation and biodiversity. What I would love to see is forests changing appearance based on latitude and elevation.",
            "What's the best starting build order in Civ VI? My go-to is Monument -> Scout -> Builder, but I want to try playing higher difficulties and I'm not sure if that's the best.\n\nSimilarly, what should I do about governors? I usually start with Magnus and his first promotion so I can full-on settler rush when I get monumentality, but I'm not sure how viable that'll be at higher difficulties.",
            "I have the basic version of Civ VI so I don't have the expanded civs like Canada or the Cree. But I really feel like the game needs Ghengis Khan. In Civ IV, he was always declaring surprise wars on me. I'd like to see Napoleon back too. ",
            "I hope it has more exciting resources and lots of new natural wonders. \n\nI would love if there were animal resources that are only available on one or 2 tiles, and include things like pandas, giraffes and kangaroos, and the more you trade them the better your zoos are. \n\nThe same with food resources, bananas should be replaced with lots of different fruits, which have slightly different bonuses. And fish could be the same.\n\nOne of my favourite aspects of the game is exploring the map, so I would also love if there were more mini quests, similar to how you get a free military unit if you go on the hex where the meteor shower has been.",
            "New regligion civ :ＴＩＢＥＴ",
            "All very good ideas, imo. Replaceable leader would make for very interesting gameplay especially in slower modes. I always play for economy too, so it would be cool to have the victory option. 👍",
            "I hope they let us pick which tile the city will expand to next, sometimes VI will prioritize amber over oil..\n\nMaybe we could trade nukes..? 🌚",
            "Random thought... not including Ptolemy, Seleucus, and Antigonus (and maybe Antipater) was a missed opportunity for Civ 6. They had multiple leaders per Civ and yet didn't include one of the most famous divisions of empire ever?\n\nAlso, this gave me an idea. What if all Civs came with multiple potential leaders, and a revolution could occur within your empire where one of these leaders rises up and breaks off a piece of your empire? This would make a lot more sense than the current 'free city' mechanic.",
            "An AI that acts like a real player instead of a cartoon villain and an improved mulitplayer experience.",
            "Nothing was better than Civ IV Beyond The Sword!",
            "I think it'd be cool if your leader was completely separate from the country you pick. Like I could chose to play as the Zulu and then pick Pedro II as my leader.\n\nI think this could make for some interesting combinations, and allow for you to change things up a bit for your preferred country without depending on Firaxis to add an alternate leader. Another benefit could be allowing for a more expansive pool of leaders. It'd be easier to add a good leader from a country that might not make into the game (like Lee Kwan Yew of Singapore) or just someone that wasn't necessarily a head of state but did a lot behind the scenes.",
            "# Better Implementation/Balancing of melee/ranged combined units\n\nIt draw my attention recently that these units gain range attack after update like Persia Immortal and Skirmisher lost melee attack action due to bug or balancing? Which crippled the potential of these units. \n\nInstead of forcing them as ranged units, should add new conditions to limit their melee attacks, such as melee on wounded units only, or low health units only.",
            "PLEASE just once put the Mughals in the game. There's 300 years of history and great rulers to draw from. Fuck do something stupid like making Babur an alternate leader for India if you have to. I'm begging at this point\n\nEdit: Mughalbstinence-induced typos",
            "SID MEIER! OMIT THE DISTRICT SYSTEM FOR CIV VII AND MY LIFE IS YOURS",
            "For russia, I'm hoping Rasputin is going to be the new leader",
            "I would like the ability to relocate or harvest/remove luxuries. Also, I would like to see districts eliminated, but in the event that they're not, I would like the ability to relocate them post-completion to another tile (for whatever they want to make it cost). Finally, there's a mod with a lot of features for the ocean (I can't remember the name), and it would be nice to see something like that added, too.\n\nP.S. I feel like, in relation to tech development vs. the timeline, marathon games aren't balanced. In other words, make them longer to actually feel like you're aligned up properly with the year(s). Also, I would like civilization specific wonders, etc.",
            "Cities should be really small until the industrial revolution, it should be weird for a city to be bigger than 4-5, then after the industrial revolution cities can become 10-15 and 20+ in the information era.\n\nNot only it's historical but also it would help mitigate the early game advantage since industrializing before the other civs could completely flip the game around.",
            "Colonies and or forts",
            "I might be biased, but I think armenia deserves to have its civ",
            "All I really want is for them to fix the things that have been broken for so long:\n\nCompetent AI: Please for the love of god(s), teach the AI competent city planning, naval warfare, aerial warfare, etc. The game would be so much more fun if the AI actually interacted with the game's mechanics properly\n\nFix the multiplayer: After all this time, multiplayer is still unstable\n\nI'm sure there are other things, but if Civ VI's AI was actually competent, I would not have been able to shake off my addiction to the game",
            "We need to be able to sell units in some way. Arms sales is important aspect that is missing so far. Maybe available after the modern era.",
            "I hope Firaxis doesn't give me one of the Pedros for the Brazilian leader.",
            "Put Ho Chi Minh in the game you cowards!",
            "Where are the mods on these shitposts?",
            "I just want all starting cities to be a (minimum) 2/2 regardless of what tile they settle on.",
            "As long as the policy cards don't make it in and If they also allow for significant modding it'll be great.",
            "I hope it is very different from 6 and more like 3/4.",
            "I tried civ7 on steam yesterday, terrible game, much worse than civ6😵‍💫🤡",
            "I'm just wondering, is it possible to write a post here as an open request to the development team? It's fully neutral about history and possible cultural appropriation avoidance.",
            "please don't be like civ 6 please don't be like civ 6 please don't be like civ 6",
            "More like decathread or centithread amirite?",
            "*Denounces you*",
            "Why did you have to ruin an actually funny comment with redditism",
            "I feel like they didn’t add Assyria in civ 6 because they already had Sumeria and Babylon but I’d be all for it",
            "Nabataea please!",
            "Yeah, the way Humankind has. Assyria, Akkads, Hittites, Medes, Etruscans, Urartu, Lydians, Phrygians... Add them all!",
            "In the more niche category, I’m hoping for the [Kingdom of Tungning](https://en.m.wikipedia.org/wiki/Kingdom_of_Tungning)",
            "I think if they've got to release a stripped down civ first, this makes a lot of sense.",
            "They should at least improve movement in tiles adjacent to rivers or something like that. You brought up a really important point, after all rivers were super important in REAL LIFE civilization development.",
            "Interesting idea",
            "My immediate thought on this and how you could make it work is kind of latched on to the Loyalty system already in place, right? So in theory you have Loyalty as a factor in Migration Pull, and you could tie that in to the existing districts system. So if you have high Loyalty/Migration Pull in one of your cities from say having a Campus that's 2 levels higher than your opponents then you can start attracting more of their scientists to your Campus. A plus to your Civ and a minus to your opponent.\n\nI think that'd be hard to balance and get working, but as a bare bones concept it works. What would you have in mind?",
            "Yeah that would be cool. Having corporations be more expansive would be great. Being able to regulate industries for your country as well to protect it from external competitors as you grow.",
            "_Monkey's Paw curls_\n\nWelcome Napoleon, Emperor of the Principality of Saint Helena!",
            "I'd really enjoy one of the actual famous kings of France. Louis XIV, Philippe, François Ier, or even Charlemagne and Richelieu.",
            "\"My Liege, you are not invited to *Civ VII*!\"\n\n(\"Amour Plastique\" plays)",
            "I didn't realise Napoleon was a luxury resource?",
            "Very French",
            "Honestly, though, I'd rather have Franks and Charlemagne",
            "Robespierre pls",
            "Maybe they'll do him Like Alexander of Macedon.\n\nNapoleon of Corsica.",
            "Districts were _the_ new thing in Civ VI. There is 0 chance they will remove it. It's at the same level as the hex map and unstacking units. \n\nThat being said, there's lots of room for improvement. I wouldn't be surprised if they gave us more options with districts, or at least with the buildings inside of them. Right now only Encampments and Government plazas have options for buildings in districts, I could definitely see that increasing for other types of buildings. Like the theatre square could get options for buildings that give more specific GAWM points but not others. \n\nWhile I wouldn't be surprised that they keep the one district per yield thing going, I would be surprised if we have the exact same district list as in VI.",
            "I'm hoping that districts serve as more of an improvement that is worked.\n\nI want specialists to be the main source of specialised yields like faith, science and culture, rather than buildings. Buildings should just increase the yield of the specialists.\n\nBut I am with you on keeping districts, definitely. Unpacking cities added a lot of character imo.",
            "It definitely needs changing and the number of districts probably needs paring back\\* but I agree it would seem like a backwards step to just remove it entirely. I'm not quite sure what you do with it. I've had a few ideas but I'm not sure any are great and they're in polar opposite directions.\n\n- Have districts grow on their own organically like the cottages in Civ 4. That way you don't need to do any footling around with them once you've planted them, or constantly repair both them and the buildings within them whenever there's a bit of wind\n\n- Have districts have their own build queues. Would make the game micromanagey as hell but would stop building and repairs in the districts from slowing city development down to a crawl. Also could see some advantages in having encampments being able to build units direct, taking units out of the city build queue allowing everyone to have bigger armies for more fun combat\n\n- Have a max of one of each kind of specialised district per civ. This way placing your district is a real decision, and it'll push you to either go tall or highly specialise your cities if you're going wide. And then maybe in the late game there's a civic that allows either as many districts as you want but only one per city (for wide players) or as many districts in a city as you want but only a max of 3-4 of each kind per civ (for tall players)\n\n\\* Like you could easily merge holy site, campus and theater square into one district you call \"monastery\" - you can still have specialisation by making certain buildings within the district either/or. You could also definitely merge commercial site and industrial zone (call it \"marketplace?\"). And then you could throw entertainment complex in with either. You can also definitely merge dam and aqueduct (\"reservoir\"). Oh and FFS get rid of Government Plaza. Not wild about waterpark either.",
            "Make every tile a potential city.\n\nInstead of districts, you can have things like college towns, mining settlements, farming hamlets, fortified monasteries, walled cities, fishing villages.\n\nBigger cities with higher populations  get more building slots. That way you can still play tall, and wider civs are encouraged to have a lot more smaller pop tiles.",
            "I would absolutely love something like this",
            "I also think that cultural artifacts should be more pronounced. And unique. And that global events should help craft unique artifacts. Like for example if a war happens that you win there are great songs and plays made in memory of it. It deepens the patriotic fervor.",
            "When I saw the carnival in the trailer I immediately assumed that it meant the return of Venice.\n\nBut since no one mentioned it I'm kinda afraid to share that thought. Maybe it's just a reference to culture mechanics. Still, I think that Firaxis is aware of Venice's popularity in Civ5, it wouldN'T (edit, I don't know how I missed the negation there) surprise me if it came back in Civ7, maybe together with an altered form of Civ6's system that allows multiple leaders per Civ (Venice wouldn't exactly represent Italy, but it is an Italian city state).",
            "Oh yes I need some Venice-like Civ again. Loved micro managing the shit out of my one city and playing city states against the enemy and just buying everything in the world. Miss that.",
            "> MAKE NAVIES MORE IMPORTANT!\n\nTrade should be much faster over the ocean. Long distance land-based trading was rare (there's only a few historical trade routes like this _ever_) and not nearly as lucrative.\n\nIf the ocean becomes an economical advantage, then you have a basis for naval purpose. It doesn't need to be about random campaigns at sea where there is no terrain at stake. The money is what is at stake.",
            "Is blockading a thing in civ 6? I'm this sale new here, but if not that would be a fun thing to stop other civ trade routes with the navy.",
            "I never played V, but I liked how for IV, you could choose  2-4 (?) leaders for each civ.",
            "Rather than city states, they should be called buffer states. This is what happened historically, empires wanted buffer states between them that they could influence and slow down an invasion. They could keep most of the city state mechanics just change the names and nerf their expansion, rather than disallowing it entirely. Also it should severely harm relations with neighboring civ's if you DOW buffer state.\n\nActual city states should be seen only on peninsulas and islands, imo.",
            "I never thought about it, but it's true. You should be able to pre-target ICBMs and set them all off at once.",
            "You should also be able to rebrand your empire as well. If you were the Roman Empire but take heavy losses maybe rebrand as the Byzantine Empire. And then later Italy. If you change your type of government you should be able to decide to be something different. If a revolution is successful the new country is United States or something. Creating colonies might be nice too. If there is land you can’t quite get to yet but you want to acquire trade goods send colonizers. But then you better add them to your country soon or they’ll make their own country.",
            "this is such a sick idea, instead of taking over the 1 tile with the enemy's city on it, and automatically taking control of all of that city's tiles, the borders move around depending on where you have control.",
            "I think it could also be cool to be able to take a tile with no war, giving the other Civ a Casus Belli with no penalties, many such examples of this in history, like Germany taking the Sudetenland",
            "I wouldnt worry about it, they're developing it for last gen consoles so the minimum requirements cant be too high.",
            "I’m looking forward to a new level of interaction with AI leaders, city-states, even things like the barbarian camps and villages",
            "I’m a little less optimistic with overall complexity to the game with the fact that it’ll be able run on previous gen consoles",
            "Love this suggestion. I would gladly take more unique and varied playstyles at the cost of less civilizations to boot. Age of Empires 4 took this route, and I think it is better for it.",
            "Agreed. My favourite civs to play in vi are the ones with really unique mechanics such as Eleanor and Mali that really force you the play the game differently beyond just some passive stat bonuses.",
            "I recall a previous interview from Ed Beach that said Firaxis have a template for iterating on Civ.\n\n*33% of the game systems should remain the same.\n\n*33% of the game systems should be improved.\n\n*33% of the game systems should be new. \n\nI doubt those numbers are exact percents after development is finished but more likely goals when starting. If that design still holds true then you'll probably see some systems with a complete evolution (like districts for VI) but not a total rework of how Civ plays.",
            "What kind of experimental features would you like? Some wacky ideas I would like to see is the map as a globe, the multidimensional terrain system from Humankind, the ability to research multiple techs at a time, perhaps closing tech vranches if you choose a certain option, a longer future timeline to play into (2100?) , more terraforming options (man made islands?) to name a few",
            "That'd be awesome! Love his podcasts and his book",
            "Russian history isn't getting cancelled though. That's only a thing that regimes like Putin's do.\n\nStill, it would be fun to have a ruler from Kiev/Novgorod for a change.",
            "I think anyone before Lenin wouldn't make much of an issue, to be honest. If they want to be cautious, they can choose Kievan Rus instead (common ancestors for Russia, Belarus and Ukraine)",
            "They should make Ukraine a playable Civ",
            "If it stays, they better to change cossacks and Lavra to something else. Both are cultural appropriation from other countries.",
            "this is what civ 6 did no? with the government types (monarchy, democracy, autocracy) being changed every couple eras and the policies cards constantly shifting",
            "Dear god yes, give me the ability to link a naval unit with a trader. \n\nAlso love the idea of long-range bombers taking multi-turn missions.",
            "Expansion to the Moon and/or Mars sounds more like a separate game.\n\nI always thought of *Alpha Centauri* as “what happens after a Science Victory”.",
            "Definitely would be cool if there was like an expanded later game mode where it’s kind of like Alpha Centauri but with the Moon, Mars and other parts of the solar system. Wouldn’t it be cool to be hours and hours deep into your civilization and suddenly you’re in a game that’s like The Expanse? Planetary politics becomes a thing. Martians. Moonians. Belters. And so on. Perhaps this can kick in if one civilization finds a way to take over the whole planet. Then the solar system is next but you kind of have to start small again. Meanwhile on other planets settlers begin asserting themselves more.",
            "Absolutely none",
            "I suspect it will be turn based",
            "They'll push the preorders once there are preorder bonuses. It's not either/or, it's both.",
            "Why does Kongo need to be replaced? And by a west African country at that.",
            "Hausa and Swahili would be my preferences.",
            "Dahomey?",
            "True, but Ghandi is like their trademark. ",
            "Sioux tribe? Could be sick af",
            "It's probably a lock that Rome, Mongolia,  China, India, and Japan would be included. Probably the Ottomans too. Basically any Civ that has been in practically ever game is safe. Russia may be questionable but I think they are in.",
            "That's never gonna happen, and imo it shouldn't, either.",
            "Also more environmental variation. Would be cool to have a proper continental identity, with different flora and even fauna on the map. \"Oh, I'm playing Egypt in not!Australia this time!\", with more orange deserts, kangaroos in plain tiles, etc.",
            "I agree..\nHitler in Civ II was never seen. He was only in scenario mode. I don't remember if there was a German that you interacted with. \n\n\nI believe Stalin was in that game and visible. I remember him having a walking stick or some sort of pole?\n\n\nIf they included Mao in IV, I agree, he should return.",
            "technically impossible to do with a hexagon map, unless you do some wonky things like adding pentagons or have some overlapping tiles somwhere\n\n[https://stackoverflow.com/questions/12847654/hexagon-grid-on-sphere-without-pentagon](https://stackoverflow.com/questions/12847654/hexagon-grid-on-sphere-without-pentagon)",
            "More ideas:\n\n* The ability to combine resources to make more beneficial ones. For instance, if you have Gold and Gems, you can make Jewelry. \n* An expansion of the Rock Bands mechanic to other eras. For instance, once you develop the Printing Press, you can send Books to other Civs. Television allows you to send TV shows.\n    * And for the love of Sid, if Rock Bands remain a feature, some variety in the music they play! (Or, for those of us who want Philomena Cunk as the narrator, they play a snippet of [*Pump Up the Jam*](https://youtu.be/9EcjWd-O4jI?si=XTRtxjLIWfnq6ksl))",
            ">I’d like something far more elaborate, dominating the world with goods and manufacturing.\n\nMy issue is I would argue at that point that is just an extension of your culture or your domination over other civs.",
            "Merging cities to create a metropolis! I concur.",
            "I think as a player you should always be known as God. The game is a god mode game after all. Then you can see reins of leadership over time in your land. If it’s royalty a long line of succession with unique names of every leader. If it’s a democracy then regular elections and a party system. The politics could be influenced by what’s happening in the game. For example if a war happens during a certain King’s rein and you win that King is memorialized in a bunch of ways. Statues in cities. Places you conquer get renamed after the King and so on.",
            "IMO playing against these would be awful. They'd probably just be too good at the game",
            "Legit devs could easily make ai to beat any player. They don’t cause that’s not fun.",
            "Not really the right thread for this question but this short is sums up most peoples moves.\n\n[https://youtube.com/shorts/5gpetgzbBDg?si=BMNjF0XnrGREy56x](https://youtube.com/shorts/5gpetgzbBDg?si=BMNjF0XnrGREy56x)\n\n  \nAs for governors I see people usually pick Pingala as a default start. He can double your culture and or science early on. Magnus can be good if you have a lot of chops.",
            "Nah I think it's good that leaders aren't players out to win the game, but rather historical figures interested in developing their nations in different ways, whether through science, culture, religion or warfare. \n\nI'd just like them to be more reasonable. Wilhelmina doesn't have the right to be mad at me over not sending her trade routes if she's way too far away, surrounded by barbarians and isn't sending me any trade routes either.",
            "I'd prefer having Hindu kings as it adds more variety to the game culture wise. We already have Muslim and middle eastern kings in other civs.\n\nIn fact I'd prefer having civs separate from India, like a separate Mughal civ, Maratha civ, Sikh Empire civ etc",
            "Pedro's Petropolis best Polis. Constantinopolis and Sevastopolis wish they were Petropolis.",
            "I shall establish a new religion called \"Denouncing egv78\"",
            "Thank you kind sir for this chance for me to announce a formal war and suffer less war mongering (me who has 200 grievances against you and still cares if i can declare a formal war)",
            "the Neo-Assyrian empire was one of the most influential Mesopotamia cultures ever. it'd be a crime to not have it in civ7",
            "Humankind has a lot of cultures, but the downside is that they feel really underdesigned and similar to each other.",
            "They will get lumped together as china.",
            "That's a short lived 17th century kingdom, why are you hoping for it specifically?",
            "IIRC in Civ 4 improved resources needed to be connected by either road or river to city centers before they were actually usable. Because building roads took time away from other improvements and required technology, rivers were vital in the early game and as a player you ended up relying on them for infrastructure in a way that (sort of) mirrored actual history. Would be nice to see this system come back imo",
            "I feel like its already reflected in other ways, but not in one total skill:  \nLoyalty shows people in a city wanted to stay in the city (entertainment, amenities, security, power, food, housing)  \nScience, production, culture, and gold are all indications of how many of each population point are working in each industry in each city.   \nTourism reflects temporary migrations (vacations, work studies)  \nWorkers reflect citizens moving in and out of cities to work in suburbs, rural areas, or even moving to a completely different city. \n\nHowever, the concept of citizens leaving one country to go to another is complicated and workers illustrate exactly how restricted that is: you can go work in a territory of your nation (suzerain-citystate), but you can't readily just go to another country and work. Fleeing a country for work or depression is akin to the loyalty falling and a city joining another nation but it's not a perfect equivalency",
            "this would actually be amazing lol",
            "Yeah honestly. France deserves way more than just 2 versions of a queen who wasn’t even French",
            "Louis XIV would be a nice return",
            "How about multiple options for rulers of each nation, each with different benefits?",
            "its the name of the chief pig finding the truffles",
            "I feel like having some wonders being able to occupy a district would be good. Maybe a maximum of one wonder per district. It feels right to have Big Ben actually in the Commercial Hub, or Broadway in the Theater Square. Some would still need their designated tiles, but with most requiring the presence of a specific district anyway, it seems like it would make both districts and those wonders feel better. The wonders take up less space and districts contain more varied and valuable buildings than the exact same chain for most of them.\n\nThe only problem is if you want a city to specialize in a particular resource, you're limiting the number of wonders you can have. Perhaps make it optional? So, if you have a free district, you can build it inside there, but if you don't you have to build it outside the district?",
            "I think they should break district tiles down into sub-tiles, and have multiple buildings, wonders, and improvements that can be built in that district. Once you fill up all the sub-tiles, nothing else can be built in that district. Adds a strategy and planning element to your districts with the added bonus of having every district appear slightly different on the map. One of my pet peeves with districts (outside of uniques) was that they all looked the same across every civ, every game. Got really monotonous to look at.",
            "I really really disagree with combining districts like this. Currently the specialist district list pairs with certain yield types nicely nearly one to one. Campuses give science, theatre squares culture, etc. Combining those core districts into one just means everyone has to build that district in each city because it's so good. \n\nI personally really like the Government plaza. Not only is it one per civ (which IMO they should expand on), but also allows you to pick different buildings which forces the player to make interesting decisions because opportunity cost. Like what if there were \"national districts\" that were like extra specialist districts but you could only build one per civ, but they would be better than regular districts of that type. This would allow you to specialize your cities more, and differentiate your core cities from your other cities. You could also build multiple national districts in the same city maybe to provide an avenue for tall play.",
            "I mean, in real cities you don't normally see business offices mixed with coal power plants. I disagree about merging them like this, as well as the others. I think it's better from a gameplay perspective to keep them separate. One thing I will say is that every district should have two yield types if possible, like the harbor, but one is more dominant than the other.",
            "I actually like water park because it kinda hurts to use a valuable land tile for amenities so it’s good when you can use a comparatively worse coast tile. Plus it’s good for harbor adjacencies, which are otherwise hard to get. ",
            "I don't think it will happen because Civ has always been about making Civs slightly different and snowballing those changes. Even on Diety though, I tend to play the game the same more or less and it makes little difference overall",
            "I think this would be a really interesting mechanic and it would help to boost the cultural progress of chronically-at-war type civ playstyles",
            "I think having more civilisations like Venice make the game fun. A Civ like the Phoenicians could offer some kinds of bonuses connected to the cities being far from the capital. Plenty of civilisations in history were powerful across disconnected colonies and trade locations. An Ottoman Civ with benefits to puppetting/suzerainty would mirror their relationship with conquered North Africa more closely and would add huge variety to the game",
            "Kinda? \n\nIf you're at war, you can pillage traders at sea but theyll just go through your units otherwise. But blocking every tile with ships does mean you can trap their navy in a Bay/gulf, but it won't do much since the AI never builds a navy to blockade.",
            "This is a great idea. In general, more tile control would be nice. Being able to trade land with neighboring cities would be huge, for instance.",
            "This has been civs core design philosophy for like ever as far as I can remember. And Ed Beach is again the lead designer so I highly doubt they are straying away from it.",
            "I mean that is probably a great way to do it.",
            "Some ideas:\n\n- Changes to population. Culture, religion and ideology tied to each pop. Conflicts may break out between pops and leaders of different culture, religion or ideology. Pops can migrate between cities.\n\n- Changes to religion. Get rid of the one religion per civ nonsense (Civ VI has two Chinese religions and three Indian religions). Ability to convert to different religions. Religious reformation and heresy.\n\n- Changes to world congress and diplomacy. Congresses are created between allied or friendly civs and not emerge spontaneously. And under no circunstances they force you to obbey decissions you are against. No city states.\n\n- Changes to resource management. Certain animal and plant resources can be replicated if terrain is appropiate (example, you can breed horses outside of their original steppe and you can grow coffee outside of the tropical regions of Ethiopia).\n\n- Changes to technology and civics. Certain techs or civics are tied to great characters or other unique ways to obtain them. The other civs have to trade for it or steal the secrets somehow. Sometimes, techs or civics can pasively extend to othe nations (think how gunpowder was discovered in China, brought to middle East by the Mongols and from there it extended to Europe, or how the American Revolution inspired further revolutions in both South America and France).\n\n- Changes to military. Allow more than one unit per tile. Manpower should be limited by money and food. Cities need garrison.\n\n- Changes to districts. Tiles are divided into seven slots (one per side and one in the center) and one building or wonder fits each slot (maybe some bigger ones need two?). Buildings may need to be built adjacent to other buildings and in most cases in tiles adjacent to the city center. This is to form cohesive cities and to prevent Civ VI city building gore (the city center is an empty husk, the campus is on the other side of the county to get an adjacency bonus and the landscape is dotted by wonders).",
            "I do like the idea of closing off tech branches based on what you research.  Like, e.g., if you research apprenticeship maybe market would be closed, so you'd have to pick between production focus or gold focus for your empire.",
            "Yeah, that would be fun",
            "Aah, sounds like a fair solution",
            "Which countries?",
            "I'm refering to the Civ 5 social policy system. Where you choose between permanent enhancements to your civilization, in small, five-point trees. Tradition is geared towards building tall, Liberty is geared towards building wide, Honor enhances combat. \n\nGovernment types explain how leaders come to power, and policy cards are specific agendas whoever is power currently focusing on. The Civ 5 system was more like defining your civilization's cultural identity, the characteristics of your people that endure across time, across governments and social upheavals.",
            "If only we got a good SMAC follow up. \n\n  \nBut yeah, Moon/Mars is probably a separate game, considering most games would end well before that.",
            "Ahh, well",
            "Hah! Ok, fair",
            "I heard it's gonna be first person looter shooter",
            "My guess is it'll be strategic, too.",
            "I think its unlikely that kongo will return, at least not as a base civ, as fun as they were.",
            "I was wondering if it was geometrically possible, but yeah I mean the devs could probably maintain ice barriers at the poles where overlaps or other shapes could be added.",
            "This is not EU4/HOI4. and religion basically revolves around deity, which makes things more complicated to implement.",
            "Yeah machine learning AI is a bad idea since it will just learn to exploit and cheese the game. I'd like to see AI that is hand-crafted like in Civ 6, but is actually capable of decent city planning and warfare (currently there is practically no naval or aerial warfare at all).",
            "Of course they have to have easier versions of the AI, which can be done in training. There could also be the most difficult version that might be almost impossible to beat due to how good it is at the game. I think it would be a fun experience.",
            "Shit sorry, I thought I was in the help thread.",
            "Oh yeah, separate civs would be the ideal and now that Civ VI opened the floodgates with having both Germany and the HRE there's no reason to not have India and separate historical empires too. I was just joking about the worst possible way they could implement the Mughals",
            "Assyrian unique unit in Civ V was Siege Tower but they made that generic in Civ 6, wonder what would be their unique in Civ 7?",
            "Because it’s a short lived 17th century maritime kingdom",
            "I feel like this is a cool idea that'll be really hard to implement because the art will have to be like redone for every district/ wonder combo.",
            "I feel districts and wonders take up too many tiles if you do it that way - which essentially forces you to build a wide empire as well as making city building an unsatisfying game of jigsaw puzzle pieces which never fit quite well enough to be fulfilling, as opposed to the more direct dopamine hit it was in I-V.\n\nBut I feel like were narrowing in on something here which is keep the wonders-take-a-tile thing from VI and combine with the national wonders from V.",
            "It just takes up too many tiles then, and Civ has (rightly IMO) never prized literal realism all that highly.",
            "You need a good Waterpark because otherwise your coast is too easy to raid.",
            "Absolutely. I would love to see an AI engine that generates stuff for fun on this as well  and have it work for you rather than just against you with the adversary civilizations. Like imagine if the same generative AI power of ChatGPT were able to constantly create unique variations of your own civilization. Rather than everybody getting the same world wonders for example the generative AI would be able to create unique ones that reflected the culture being created. \n\nI also think earlier stages of the game should be stretched out in some way. Like I always play on the fastest mode because I hate waiting 25 turns for my first worker to be made. But then I just blow through the ancient times. In no time it's the modern era. All because I just want some workers to build roads with. Back in those days didn't they just grab slaves and force them to work? As the society evolves eventually you reach anti-slavery as a cultural norm. Wouldn't that be the time when workers are hard to come by?",
            "Cossacks:\n\n- Cossacks origins start on territory within bounds of Ukraine, later spread down by Dnipro through Kavkaz (Novocherkassk).\n\n- In Ukraine, Cossacks are seen as symbols of the fight for freedom. In Russia, they’re more a part of the historical narrative, often serving the government.\n\n\n\nLavra:\n\n- Lavras aren’t just a Russian or Ukrainian thing. They’re significant in Eastern Orthodox traditions and can be found in various countries.\n\n- For instance, there’s Mar Saba Lavra in Jerusalem (532 A.C.) and Asia Lavra in Greece (961 A.C.).\n\n- Ukraine currently has five Lavras, including the oldest one, Kyiv Pechersk Lavra, founded in 1051 and named a Lavra in the 12th century.\n\n- Russia has only two Lavras, both from the 18th century.\n\n  \nSo, the question is - why those 2 entities were selected as symbols of Russia? Just change them to \"[Streltsy](https://en.wikipedia.org/wiki/Streltsy)\" and \"[Kremlin](https://en.wikipedia.org/wiki/Kremlin)\" respectively would be more than enough.",
            "yeah having both is an interesting idea. like having both a constitution and laws. The former tends to be a lot more rigid and change less frequently while the latter is a lot more fluid with laws being added and repealed all the time. Forces you to commit in the big picture but still allows flexibility in other ways.\n\nCould make for interesting effects in the way you interact with your citizens too. Like maybe they get upset if you do something that deviates from your constitution or founding principles or whatever.",
            "No I just mean the style of game. The character we all play is God essentially. Rather than like a first person where you play a character on the ground",
            "Completely agree. An actual AI will find some dumb strategy and just try and do that because it's optimal,  but that's not fun to play against.",
            "I'm so glad we have Chandragupta for India for civ vi. I've never played Gandhi once in civ vi, it feels so stupid to have him as the ruler rather than having an actual PM of India lol",
            "I don't think it would be too labour intensive for development. I imagine the district would be modelled separately from the wonder. So, you need to model versions of districts with or without space for a wonder, and the just insert a scaled down version of the larger, taking up a tile, model for the wonder.\n\nSo, the harbour district with The Great Lighthouse and the harbour district with The Colossus would have the same model for the district itself, with an empty space for a wonder, and the wonder's model is overlayed on top so it fits in that empty space.",
            "It doesn't seem that hard? Rather than an adjacency it's just in the district.",
            "I personally really like the challenges of optimizing an imperfect jigsaw puzzle that the current district system provides. \n\nYES I was thinking just like the national wonders from V, but as districts! This way your cities feel more different and specialized.",
            "Cossacks also were a part of Polish-Lithuanian Commonwealth. And the territory, which is Ukraine nowadays, was split then between Russian Empire and Rech Pospolita. Historically speaking independent cossacks and Ukraine were never a thing existing together. Zaporozhskaya Sich - maybe, but it's also a territory with cossacks serving both Rech Pospolita or Russian Empire (later known as Black Sea cossacks). Anyway, most of the time exactly Russian Empire had cossacks on its lands, basically gave lands to them in exchange for border control, and it was not some kind of servitude, believe me, it was more of a mutual agreement. We Russians too see cossacks as a symbol of freedom. Just look at this great monument. https://www.tripadvisor.com/Attraction_Review-g298532-d6834956-Reviews-Monument_Cossacks_writing_a_letter_to_the_Turkish_Sultan-Krasnodar_Krasnodar_Krai.html . \n\nBe careful my friend. Trying to cancel Russia you may also manage to erase and rewrite some chunk of history like good old Putler doing in order to cancel Ukraine. \n\nFor lavra I have nothing to say, you may be just right here. We don't even use the word Lavra to describe monasteries. We call them literally monasteries. Having streltsy as a special unit of Russian Empire also makes more sense to me, than cossacks. I guess to an average John cossacks=russia.",
            "See the imperfect jigsaw puzzle turned me off big time to civ6"
        ]
    },
    "Let's choose the leaders for Civilization VII, Chapter 5: Germany": {
        "title": "Let's choose the leaders for Civilization VII, Chapter 5: Germany",
        "score": 384,
        "url": "https://i.redd.it/ittqxpctn38d1.jpeg",
        "content": "In your opinion, Ivan III would be a good option for Russia. Now it's time to see what a good option you have for Germany. I'll give you 24 hours to determine this, I'll be looking at the most liked leader pick.",
        "num_comments": 275,
        "comments": [
            "https://preview.redd.it/bjxxwq25q38d1.png?width=870&format=png&auto=webp&s=6b7372a24b1e4cc44779833aa93f243879e04089",
            "Frederick II Hohenstaufen, The wonder of the world, and the Pope's greatest hater(who still casually just got Jerusalem through diplomacy). Let germany be the culture/science civ it deserves to be for once.",
            "Otto the Great. United the German tribes and restored the HRE through a mix of diplomacy and military success.",
            "\\[Removed\\]",
            "My pick would be Otto the Great. He created the HRE, conquered northen Italy, united the saxons and ended the Hungarian invasion from the east defending Christianity.\n\nHe is a bit underepresented for what he did and came from a German background.",
            "*opens comments* Oh boy here we go!",
            "Frederick the Great. The civ could have ideas around Prussia",
            "... I don't know if you guys are history buffs, but...\n\n![gif](giphy|1RaGAz2p13Wpo7kI2L)",
            "Go with the person under whom Germany as a nation was formed: Kaiser Wilhelm I",
            "You could actually play Hitler in the WW2 scenario of Civ 2. I was very young when I played it and this was the first time I ever had heard of him. I'm not suggesting having Hitler as a leader.",
            "**Emperor Charles V** (and make him a dual leader with Spain). He was the most powerful man of his time, ruling Spain, Austria, Naples, Sicily and Burgundy, but he has never been in a Civ game (although he was planned for Civ3). He won an election against Francis I of France (his archrival) and Henry VIII of England. While a devout defender of Catholicism, under his reign the Peace of Augsburg was signed, which allowed the Princes of the Empire to choose between Catholicism and Protestantism.",
            "Konrad Adenauer",
            "[The choice is obvious. You know who will be picked.](https://files.catbox.moe/m8f3r8.png)",
            "A controversial sugestion perhaps.\n\nThe angry mustace man who started a war: Wilhelm II",
            "Everyone knows the most famous German leader and everyone knows they would never.",
            "Erich Honecker\n\nPickles replace bananas as a bonus resource on german territory",
            "The player base has a unique chance to do something hilariously dark\n\nAlso, my nomination is Konrad Adenauer",
            "Otto von Bismark\n\n* bullied the french\n* united germany\n* founder of the modern german social security system",
            "Arminius. Liberated the Germanic tribes from the Roman’s and fought off Rome when Rome was at its peak.",
            "Otto von Bismarck for Prussia would be amazing. I think it would a civ focusing on military, being able to organise troops differently from other civs. Although Prussia should get a bonus for recruiting great people too",
            "Willy Brandt.",
            "I really liked the choice of Ludwig II as an alternate leader for Germany. So why not continue where we already started and incorporate more leaders in the same vein to showcase the richness and diversity of German history? I know lots and lots of Prussians will be suggested here, and I'm firmly against that. So let me instead propose three different leaders:\n\n1. Robert Blum. 1848 revolutionary and still an embodiment of German liberalism to this day.\n\n\n2. Friedrich Ebert. The first democratically elected leader in German history.\n\n\n3. Ludwig Erhard. Created the modern German social market economy. \n\nI think all of these three candidates could serve to shift Germany away from a military civ to more of a cultural and economic one, which is a change I really want to see for Civ VII.",
            "Konrad Adenauer, first Chancellor of the German Republic.",
            "Merkal",
            "For Spain I would use Carlos III, more geared towards culture than military.",
            "I think a Weimar-style Germany would be pretty cool, minus political instability (or maybe include that with loyalty). Weimar culture is very unique and was incredibly popular, so it could be an interesting cultural civ.",
            "Rome should have Augustus",
            "König Söder",
            "Arminius ? With forest terrain combat bonuses and stuff",
            "Honestly I don’t mind any (besides obviously the warmonger(s)) I just want Germany to be a economic and cultural/science powerhouse instead of the usual militaristic style\n\neither cultural or science depending on the leader",
            "Going really old school but Arminius. He learned latin and studied and Rome and then used his knowledge of Rome and its tactics to defeat the Roman and prevented Roman influence in Germania. He was getting so powerful following this successful campaign that he was assassinated, but its presumed he could have attempted to unite Germania and become a bigger threat to the Roman empire.",
            "It's time, bring back Alt Fritz.\n\nAfter all, out the gate he's the First Servant of State.",
            "Helmut Kohl, legit think it would a good idea to show a German leader post DDR. He would be a diplomatic inclined leader. I’m imagining him also having loyalty influence, if that mechanic is maintained.",
            "Since Bismarck was already in V, Barbarossa in VI and ppl already made Adolf jokes im just gonna say Hermann the cherusker / Arminius.",
            "Maybe Louis the German? First ruler of East Francia and grandson of Charlemagne",
            "Hermann the German aka Arminius.",
            "No Prussian imperial militarist type leader please, Germany is too often stereotyped as agressive militarist industrial nation, I think Germans themselves are not happy about that. Barbarossa was a step in the fresh direction after five iterations of militarist Prussian empires. \n\n\nEither Konrad Adenauer/Willy Brandt or some great HRE emperor such as Otto or Frederick II Hohenstaufen, to promote Germany being culture/science/economy civ. ",
            "Rosa Luxemburg",
            "Charlemagne. Just to piss off the French.",
            "Too many potential leaders, Blücher Moltke and even the Kaiser Friedrich III.\n\nBut we know who will be the winner already, The Angry argentine painter.\n\nUnser Führer Adolf Hitler\n\nhttps://preview.redd.it/7ohns9b5o38d1.jpeg?width=1300&format=pjpg&auto=webp&s=287ef1d519fa89d20f35113f8f36eaa67c549c4d",
            "Frederick the great would be my choice",
            "otto von bismarck",
            "**Otto von Bismarck**. Germany needs a militaristic leader who somewhat deals with unifying local cities and bringing them into the German Empire.\n\nThe other options are either mustache man, or those who enabled him, so yeah. Otto!",
            "This is why civs need multiple leaders",
            "Bismarck",
            "Otto von Bismarck",
            "why are all the comments gonna be [deleted]",
            "Johan von Brandenburg I, best one",
            "Otto the Great. Also, I think we could have Charlemagne leading both France and Germany like Eleanor leads England and France, if there’s no HRE.",
            "OTTOOOOO!",
            "I'll throw in a different one. The British Royal Family.",
            "For Germany, Firaxis has a few routes to go. The only real Post Unification Leader that isn’t Hitler but still incredibly influential like Bismarck, and or find someone from the previous HRE or Prussia.",
            "Frederick II, the successor of Barbarossa, oversaw the HRE at its peak (arguably), resolved the 6th crusade with diplomacy (how?!), spoke like 6 languages and an avid patron of the arts & sciences who founded the oldest public, secular, non-sectarian or state-funded university in the world and one of the world's ten oldest universities in continuous operation. He was also the first king to outlaw trial by ordeal. This man was the real deal",
            "How about a little bit of trolling? \nMy pick Erich Honecker.",
            "Karl Doenitz of course",
            "![gif](giphy|LRVnPYqM8DLag)",
            "I kinda want Karl Marx…",
            "Louise of Mecklenberg-Strelitz, Queen of Prussia during the Napoleonic Wars and a shrewd and loved one to boot.",
            "I'll be boring and says Otto von Bismarck this time",
            "Arminius",
            "Let's go with a bit of an outside the box pick: Arminius.\n\n\nNow, while he did not lead Germany per se after the inclusion of Frederick Barbarossa, that may not matter that much. Plus a german civ focusing on ambushing enemies and having a bonus for fighting agains more advanced civs would be a nice change.",
            "Otto von Bismarck obviously",
            "Add Pacifist Hitler",
            "Clausewitz",
            "Cowboy Wilhelm.",
            "Otto von Bismarck, the Iron Chancellor who orchestrated the creation of the German Empire.",
            "Florian Schneider obviously \n(Founding member of Kraftwerk)",
            "I'd say Wilhelm I. He gave Bismarck the \"go\" to unite Germany.",
            "I vote for two leaders - Frederick the Great as Prussia and Bismarck as Germany. First one will be military perks and second one diplomacy and production",
            "Friedrich Wilhelm Viktor Albert von Preußen, one and only Wilhelm II!",
            "It should be the guy who led Germany to great military victories, transformed the socio-economic and political systems, and feuded with the catholic church. Can't exactly place the name",
            "H",
            "Would love to see Charlemagne. He could be shared with France as he is seen as father of both nations. He was the first emperor of the HRE, so in a way the founder of what would turn into Germany more than a thousand years later.",
            "Adenauer",
            "Wilhelm 2.",
            "Mix things up a bit: Konrad Adenauer. First Chancellor of post WW2 Germany and co-initiator to many things that made Germany and Europe so succesful",
            "Wilhelm II",
            "Bismarck",
            "Can we get Bismarck again?",
            "George the 3rd",
            "Otto the Great, Fredrick the Great, Otto von Bismark, or Willy Brant should lead Germany.",
            "Otto von Bismarck",
            "Stupor Mundi",
            "**Angela Merkel**",
            "They should add hitler as the final boss of the game",
            "Konrad Adenauer\n\ndemocratically elected\nnot a warmonger for once\nactually a leader of Germany not HRE, Prussia, Bavaria\nnot part of the nobility \nwe had Gandhi and Curtis in 6 so he is old enough",
            "I would love to see one of the chancellors from 1945 onwards as a leader. Konrad Adenauer, Willy Brandt and Helmut Schmidt come to mind as options. I believe it would be the first time democratic Germany is represented in Civ as well.",
            "Otto von Bismarck",
            "My idea would be Frederick III...German emperor for 99 days and a great \"what if\" in German history.\n\nAs crown prince, he often opposed the conservative Bismarck, particularly in speaking out against his policy of uniting Germany through force.\n\nLiberals in both Germany and Great Britain hoped that as emperor, Frederick would move to institute democratic reforms in the German Empire.\n\nSadly he passed away early in his rule and his wacky son Wilhelm II took the reigns...and we know how that ended.\n\nAs a leader he could have bonuses to diplomacy and culture...maybe increased loyalty to newly taken cities (if that will be a feature).",
            "It is time.",
            "In the spririt of this sub, that can't decide if the Habsburg-led German empire should count as Germany or not, i propose:\n\n[Archduke John](https://en.wikipedia.org/wiki/Archduke_John_of_Austria)\n\nThe brother of the Austrian Emporer was elected imperial regent during the revolution of 1848 in Frankfurt/Main. Without any military power he was mostly ineffective and had a very short lived \"regency\".\n\nNevertheless he is a perfect embodiment of the german democratic movement of that time. They tried to compromise on everything, instead of going the french way:\n\n* of royal blood, but democratically elected\n* Habsburg, but not really powerful enough to threaten Prussia\n* trying for all german speakers instead of the Bismarck solution.\n* liberal and married the daughter of a post master.",
            "Kaiser Wilhelm II",
            "Fredrick II Hohenstaufen.\n\nAlso, as others suggested, maybe add in Charles V as leader for both Germany and Spain",
            "Bismark, the guy that unified Germany with blood and iron.",
            "Where’s my boy Bismarck at",
            "Charles V ",
            "Otto the first for the creation of HRE",
            "Willhelm ii",
            "Either Wilhelm I or a certain mustachioed Austrian gentleman",
            "Willhelm 2 cause kaiserreich",
            "Hilary Clinton, USA",
            "I don’t see the issue with Hitler. It’s our real lived history. He is one of the most famous world leaders. Obviously not for good reason. Maybe they don’t want people to play as Hitler?",
            "Adolf",
            "I don't see him suggested too often, but my vote is Friedrich Ebert, the first president of the Weimar Republic.",
            "Angela Merkel? Green technology and that stuff….",
            "Arminius",
            "Hitler, bonuses, creating troops cost less industry, armies have extra spots, more war support, collecting religious relics increases productivity, during times of war population declines by x per x turns, POW camps being unique building-increase productivity y% by each POW taken. . It happened, don't shun history, don't get over it, just acknowledge it happened.",
            "Female leader to stabilise the sausage fest.\n\nAlthough,  I dont know any female leader for Germany.",
            "Wasn't a great leader, but still iconic, Hindenburg? I think a Weimar leader could be cool",
            "We know that we will get Hitler as one of the first mods anyways lol",
            "We all know who we're thinking of lol",
            "Angela Merkel",
            "We all know the answer. Yes, I mean [Adolf ](https://en.wikipedia.org/wiki/Adolf,_King_of_the_Romans)himself.",
            "KEEP POLITICS OUT OF MY CIV GAME!!!!111!!!!",
            "Rolling w a classic. Bismarck",
            "Friedrich Ebert, first president of the Weimarer Republic and therefore first democratically elected head of state of Germany.",
            "Maria Theresa. I know, \"Austrian\", but anyone pre-1871 can also be described as Prussian or Bavarian or Saxon or going a lot further back Cherusci (Arminius) or Visigoth (Alaric). I don't think Austria is too likely to be in as a separate civilisation. High on culture and good at generating loyalty in citires from other civilisations (she was more popular in Hungaray than previous Habsburg rulers, from what I understand).",
            "Anyone who isn't a Prussian leader, really.",
            "Merkel!",
            "Angela Merkel\n\nUnique Ability: Aussitzen\nThe longer a war lasts, the stronger the combat strength of her troops become",
            "Dude, Ivan the III was the Grand Duke of Moscow almost the entirety of His reign (tho He did layed the foundations needed to form the Tsardom of Russia, but still His primarily the Grand Duke of Moscow first & foremost)",
            "Wilhelm the 2nd",
            "If we didn't have a Prussian civ then I'd love Frederick the Great",
            "Angela Merkel could be funny.\n\nMama Merkel is always there for Germany",
            "Kaiser Wilhelm the II could be duel Germany/Prussia?",
            "Helmut Kohl.\n\nHe was the second longest serving Chancellor after Bismarck, reintegrated Eastern Germany, and the treaty of Maastricht which had led to a relatively long era of peace amongst Europe until 2020.\n\nOtherwise Charlemagne.",
            "Helmut Kohl",
            "- Germany - William I  \n- Greece - Alexander The Great  \n- Rome - Aurelian  \n- Egypt - Ramesses III  \n- Japan - It's either Emperor Meiji or Emperor Taisho  \n- China - Emperor Taizong of Tang Dynasty  \n- India - Nuclear Gandhi  \n- Spain - Philip II",
            "I say we choose the best german ruler to ever live. Kaiser Wilhelm II",
            "Oh boy, more white men :D",
            "We can joke around here but Sid actually considered Hitler as a German leader while developing the first Civ. Even to the point where Sid decided to include Turks in the game rather than Germans because the game wouldn't sell in Germany if Hitler was one the in-game leaders. He would re-add Germans to the game in the last days before release.\n\nNot that I think it's a great idea, though",
            "Someone already did 😂",
            "![gif](giphy|3o84sw9CmwYpAnRRni)",
            "Please, just this once.",
            "😏",
            "Angela Merkel would be a great leader, prove me wrong.",
            "This is the only Frederick we should be discussing about.",
            "King Philosoph",
            "Only thing about Frederick II is that he was Sicilian born and raised, German was like his third or fourth language and, if I recall correctly, he barely visited Germany at all, so even if he was emperor is he a German leader?\n\nPS: I'm a big fan of *Stupor Mundi* , so I'd be very pleased to see him represented",
            "*von Staufen\n\nHohenstaufen was their ancestral castle, the family name is just Staufen",
            "If you’re doing non-Modern germany and skipping Charlemagne, Agree Otto the Great is the choice. Beat back the Hungarians, was crowned emperor in Rome and ruled from there for a while, tried to repair relations with the Byzantines. lots to work with",
            "\"Tribes\"? He ruled in 10th century, there weren't any \"German tribes\" at that point. \n\n\nOtherwise I agree, he would be nice",
            "Was this the failed mustache painter comment?",
            "My only opposition towards a Holy Roman Emperor as German leader is that HRE is kinda their own thing. It's like calling Rome as Italy and stuff.\n\nI want HRE to be its own Civ like in civ4",
            "That would be my pick as well",
            "It should absolutely be Frederick. Military based Civ but with a very easy path to spec towards a culture victory instead, which isn’t a path most potential German leaders would really orient towards. You could also give him Flying Artillery as his unique unit.",
            "Out the gate, first servant of the state!",
            "Germany as a nation is way older than 1871. But if you want a leader that really embodies the German spirit of the 19th century (and not just Prussian militarism), you've go to pick Robert Blum.",
            "Except he didn’t really do much to create that state. It was all Bismarck. And do we really need another Bismarck?",
            "I am, you could do so much with the leader bonuses",
            "I'd love to see Charles V in Civ, but I fail to see how he is German in any modern sense of the word. I could imagine him as a double leader for Spain and Germany, however.",
            "Austrian/burgundian lineage, born in Belgium, spend most of his life in spain. Dont see how this would fit for german leader.",
            "He should be an Austrian leader. Austria is a separate civ from Germany as we saw in 5.",
            "This! would be fun if civ7 will have some kind of autonomy/vassal system",
            "Had the largest European empire since Roman empire.",
            "Also had a magnificent jawline",
            "If we take a post-WWII leader, it has to be Willy Brandt.",
            "While maybe not the ideal person (don't know much about him), I would indeed love to see a post-WW2 leader. All these kings, emperors and whatnot are nice, but I'd like to see more modern era leaders too. \n\nUnder Adenauer, the BRD joined NATO, re-instated German armed forces (Bundeswehr etc.) and is considered one of the founding fathers of the European Union. Germany in Civ under his leadership could lean into defensive militarization and diplomacy, with maybe a hint of culture to account for his anti-communist stance.",
            "Personally, I really hope it won't be another HRE emperor (Civ 4 had it right imo to have a seperate German and HR civ). Adenauer or Ludwig Erhard would be great to represent the modern republic and would mean a Germany that isn't military-focused for a change.",
            "TIL there is an ERB with Frederick the Great",
            "This is literally the second worst choice after the most obvious one.",
            "![gif](giphy|5nFShZWwq3fdm)",
            "I need to hear the story behind this one",
            "i vote this just for the french bullying",
            "It's kinda a weird choice, this guy is too ancient to be called a German, since in civ games, Germany usually refers to high and late medieval HRE, and pre-WWI Germany.",
            "Germanic tribes of that era has as much common with \"Germany\" as Gauls with France - not that much, and they differed enough to be a separate civ on their own, similarly to Gauls. ",
            "I'd rather have a Germanic civ seperate from the usual Germany.",
            "Also massively problematic for his glorification and constant in Prussian propaganda. Not a good choice.",
            "I think Bismarck should have some sort of ability to expand through successful wars without outright conquering cities, tying into how he historically united the German states by winning wars against other powers.\n\nSomething like applying loyalty pressure through defeating units, or gaining the ability to \"culture bomb\" adjacent tiles in the nearest German city.",
            "Prussia should be its own civ, for this next iteration of the franchise, I want Germany to be free of Prussian hegemony once and for all.",
            "bismarck has been the leader of germany for way too many civ games",
            "Probably the greatest German statesmen since the Weimar Republic maybe even of all time. Won a Nobel Peace Prize too. He built the foundation for the Mauerfall and reunification.",
            "I really hope there’s a method for economic victory and Erhard would be perfect for that depending on how they set it up.",
            "He also opened the first autobahn in 1932",
            "Friedrich Ebert as a leader would be my second favourite choice.",
            "Kohl is far too recent and also massively responsible for many of the problems the country faces today. To choose him would be like choosing Reagan for the USA or Thatcher for England.",
            "post dance dance revolution??",
            "I don't know dude, I don't like the way he look. There's something evil in his eyes.",
            "he will show up as a great general, trust me",
            "Painter Adolf with bonus to culture",
            "Not really a leader but a great shout",
            "Both are Prussians, and therefore not suitable to lead Germany.",
            "You mean of course Emperor Heinrich IV.",
            "I",
            "Why? He was a horrible emperor and had his reign ended by a revolution.",
            "Then we have to add East Germany too.\n\nWith a trade bonus towards Russia and \"Eastern countries\", and a Penalty to \"Western countries\"(double for West Germany)\n\nAnd for East Germany, Honecker is the only option.",
            "Maria Theresia is the only real possible option. But, she really isn't fitting, she is really only Austrian, since as a Woman, she wasn't even Empress of the HRE by law but her Husband",
            "There are already a lot of female leaders in civ 6",
            "Merkel is too recent. Apart from that, you've got Maria Theresia (who's more Austrian, though) and, my favourite of them all, Kunigunde, wife of the Emperor Heinrich II. They were a real and very fascinating power couple.",
            "Gustav Stresemann should be the call if they decided to go Weimar-era. That guy got shit done. ",
            "A Weimar leader would be good, but preferably not the one who ended Weimar..\n\nHindenburg appointed Hitler as Chancellor. He's pretty infamous in Germany as the conservative who enabled the Nazi takeover. And with the Nazis getting strong again today, and some German conservatives again wanting to form a government with them, all of this feels a little bit too close home right now..",
            "Friedrich Ebert.",
            "Ewwww",
            "I think they have a rule against using leaders who are still alive.",
            "homie we are doing germany",
            "I've heard that Moscow is part of Russia so far.",
            "No Isabella or Philip II for Spain this time. Spain has a centuries-long history, and has been in Civ since the second game, but only those two have ever been chosen as leaders. They are both great leaders, but there are many others that deserve a chance to be known.",
            "Oh wow…\nHe wasn’t at all.\nHe was the reason we decided to leave the monarchy behind us…",
            "... Like, who else ought to lead Germany? It is a european nation with a single female \"ruler\" in history, who is very very recent. Are you going to write, \"oh boy, more black men :D\" after we are through with mali, ethiopia, zulu, Kongo, Nubia? (not to mention other possible sub saharan african nations in civ 7?)",
            "Damm Caucasian countries have Caucasian leaders. Who could have though of such a thing?!",
            "Mods are being cowards though",
            "https://preview.redd.it/1n8kwe78a48d1.png?width=1280&format=png&auto=webp&s=f5856c84f07b0614a63a94fa69543626e6f719ea",
            "well, Frederick the great deserves his epithet, but, he is also very basic + Germany ought to be free from the militaristic/prussian angle for at least one game",
            "Also, he would be a (somewhat controversial admittedly) possibility for a Germany/Italy dual leader, since he was frankly much more fond of the latter. And his image has improved in spite of Papal Propaganda. (Though Italy still deserves a second, seperate Leader obv.)",
            "He just wanted to chill, do falconry and perform silly experiments (traumatized and disabled two children for life)",
            "Admitettedly, He spent only a few years in germany, some before being crowned emporer, while he was still just German king, and some to the end of his life. But, We also have eleanor of aquataine for england, who only went there when she divorced the King of France. And we also have Dido, who doesn't even exist, and ruled Carthage, not phoenicia.\n\nI think it is fine, a dual Italy(or sicily) and Germany Frederick II would probably be the ideal solution imo.\n\n(He is easily my favourite emperor, such a cosmopolitan, speaks Italian, French, Arabic, Greek, German and so much more, he is so underappreciated. Truly the first renaissance noble imo)",
            "I'd agree if I wrote that in German, but in englisch, they are still commonly called Hohenstaufens, for whatever reason",
            "The term is indeed used by historians to refer to the old duchies of the Carolingian empire, but I agree, simply translating \"Stammesherzogtum\" to \"tribe\" is confusing. English Wikipedia calls them \"stem duchies\", which is also not an ideal, I would opt for a a descriptive term like Early Medieval or Early Feudal to avoid confusions.",
            "Brush up on that history",
            "Was this the animal rights dog lover leader that banned smoking and human zoos?",
            "Yeah but the same logic applies to Friedrich der Große",
            "Prussian artillery was mediocre during Frederick II’s era, the flying artillery basically did nothing but die.\n\nIt was Prussia’s musket infantry that was the superstar of that era",
            "Frederick is so basic tho. I think there are much more original options",
            "In what sense did a German Nation exist before 1871?",
            "Germany as a nation is not way older than 1871. You going to tell me Italy was a nation before 1861?",
            "Extra damage against all Israel civ units.",
            "The German Civ doesn't really represent modern Germany at all. It much more so represents the lands ruled by the King of the Germans (King of the Italians and Emperor of the HRE)",
            "Charles V wasn't Spanish either, he was born in modern day Belgium. He doesn't really fit in any modern sense of Dutch, German, Burgundian or Spaniard as he was partly all of them. \n\n\nCatharina de Medici is also not French so it has never stopped Civ before.",
            "He ruled over German lands. He wasn't Spanish either, yet he's one of the most important Spanish kings.",
            "One of the most powerful Holy Roman Emperors, if not the most.",
            "Those Habsburg genes.",
            "Gerhard Schröder - automatically agrees to any and all proposals made by the Russian civ, regardless of how terrible they are.",
            "might be too recent but Adenauer should be fine because we had Gandhi and Curtis multiple times",
            "Why not go for a WWII leader?",
            "he also was instrumental in having the war crime trials for ordinary wehrmacht soldies stopped.\n\nas fun as more recent leaders are, for germany they are all either too controversial or not \"great\" enough",
            "It's in Alexander the Great vs Ivan the Terrible.",
            "SAME!",
            "You better go listen to flute busting Prussian.",
            "Why its worse?",
            "Yeah, that would be really cool",
            "Is that a little Bavarian speaking there? :X",
            "I mean for good reason",
            "Literally this, his gervenment fumbling reunification is one of the worst things to happen in post war germany",
            "Deutsches Demokratisches Republik \n\nGerman Democratic Republic",
            "And I read that he doesn't like Jews. I think this is a bad call. I wouldn't invite him to my party.",
            "What if they made him the polar opposite of in-game Gandhi?",
            "Odd looking duck...",
            "Are you referring to the image above with this...?",
            "T",
            "T",
            "Look, I'm primarily reacting to Ivan III first & foremost. There's just too many candidates for Germany compared to Russia for example",
            "Sure, that's completely true. What I'm saying is: that almost the entirety of Ivan the III's reign Russia wasn't called Russia, but rather \"Muscovy\" (or whatever the term You can call the Grand Duchy of Moscow). It's still disputed, but I do believe Russia was created once Ivan the 4th proclaimed himself \"Tsar of all the Russias\" (in hindsight, Ivan the III also adopted the title of \"Tsar\" but never referred Himself as \"Tsar of all the Russias\"",
            "> oh boy more black men :D\n\n Whaaaat lmao why is this so funny to read",
            "Yes Frederick the Great clearly had no interest in culture",
            "Ludwig sitting in a corner building castles",
            "This is exactly my opinion. There is another Friedrich though, our first democratically elected leader.",
            "A nation refers to the people, usually united through culture and language.\n\nA country is a political construct which holds territory.\n\nOne can argue that the UK is made up of 4 nations in one country, or that there is only one Korean nation, even if there are two Korean countries.",
            "The German-speaking region of the HRE was known as Regnum Teutonicum since the 11th century, the term \"Deutschland\" for the area is in use since at least the 15th century. The idea of a German nation is way older than 1871, of course Germany was separated into various smaller states, but all were part of the greater HRE, and later also the German confederation as well as the short-lived German Empire if 1848. 1871 was solely the victory of Prussian hegemony over the smaller German states, who didn't become German overnight but had been so for centuries before.",
            "I mean, the HRE was literally called \"Holy Roman Empire of the German Nation\" since 1512. \"Sacrum Imperium Romanum Nationis Germanicae\" if you want to be technical. The German Nation is a pretty old idea, it's just that until 1871 there wasn't a singular German State who managed to unite that Nation. \n\nTechnically speaking even Prussia didn't manage to do this, since Austria was considered German at the time. Hence their membership in the German Confederation and the term \"Kleindeutsche Lösung\" (Lesser German Solution) for a German state without Austria, as opposed to the \"Großdeutsche Lösung\" (Greater German Solution) which would include it.",
            "Well, the Kingdom of Germany was founded back in the 800s and every Holy Roman Emperor was also King of Germany.",
            "I refer you to the response above by u/traingood_carbad, who perfectly explained why this reasoning is not true.",
            "love it",
            "Yeah I agree, no one embodies German fighting spirit and courage more than Dietrich Bonhoeffer, thank you for the suggestion.",
            "Because the \"Holocaust\" Leader Agenda likely won't pass the 10+ ESBN rating criteria.",
            "Because he was a terrible leader",
            "Because he's an Austrian, not a German.",
            "I mean, look at my flair. I already rarely play Germany, I sincerely hope it's not Prussia once again in CIv VII.",
            "He'd become ultra pacifist after the discovery of the nuclear weapon?",
            "L",
            "U",
            "Not what I am saying. I just don't want a prussian to represent Germany, since that, even with the most cultured of them, comes along with militaristic baggage",
            "mmmmmh, possible, sadly, Weimar is, as great as it was in many aspects, not exactly a very glorious period. Would be fun to see, but I don't think it will happen, since Civ leans to older leaders anyhow.",
            "Yes and the regions we now call Germany were extremely diverse in culture and language before the 18th century. There is a reason the term Kleinstaaterei exists. Of course the founding of 1871 didn't come out of the blue but it is THE crucial step for the 'Germans' of the time to think of themselves as one people",
            "I am not even sure we are disagreeing that much, but my main problem is your usage of the term \"Nation\". I won't deny that there were huge connecting similarities between the territories but you can't say ideas about a German Nation (as in: the German speaking people as one people, seperate from the rest of the HRR) were popular or impactful during the middle ages. German Patriotism was very much a product of the rivalry with France in the late 18th and early 19th century. So yes, \"German\" as an identity is older than 1871, but not by much.",
            "I see your Bonhoeffer and raise you Georg Elser",
            "Ah but surely Aryan race would, and you could give some nice bonuses for the facism government type",
            "But to be fair, he is iconic and very German.",
            "He was born in Berlin?",
            "E",
            "Nope, that crucial step was 1848, not 1871.",
            "Don't make the mistake of mixing the German word \"Nation\", often tied directly to nationality and nationalism, to the English word \"nation\", which can have broader meanings (think of the indigenous First Nations for example). German as an identity distinct from French, Italian or Polish is way older than the 19th century. Of course this identity didn't mean the same thing as during the era of nationalism in the 18th century or as it means today. Even today, there are difficulties surrounding that word, and while I am of German nationality, I would not say I feel connected to any kind of German \"Nation\" more than I do to any other community.",
            "Yeah there were multiple important steps but now we are arguing about 20 years, that's nothing in the grand scheme of things. Your initial comment made it seem like you meant to say a German Nation existed since god knows when",
            "I certainly believe the German nation is older than the 19th century, while German nationalism of course isn't. But those 20 years very much matter. 1848 was a popular movement that laid the groundwork for German democracy and liberalism we still enjoy today. 1871 was a Prussian military victory that laid the groundwork for the death and destruction of the first half of the 20th century"
        ]
    },
    "I feel like they should have a Austrian Civilization in Civ 7": {
        "title": "I feel like they should have a Austrian Civilization in Civ 7",
        "score": 375,
        "url": "https://i.redd.it/wo90olt2k18d1.png",
        "content": "",
        "num_comments": 68,
        "comments": [
            "I did actually miss Austria in Civ 6. Austria in Civ 5 was one of my favorites because the diplomatic marriage ability was insanely fun.",
            "I liked that Civ5 Austria had Hungary representation in the Hussar UU. Same with Denmark having Norwegian ski infantry and Sweden with Finnish Hakkapeliitta",
            "I miss Maria Theresa, Austria is a huge player in world history it's actually strange they weren't in civ 6",
            "It was Hungary’s turn to use the controller",
            "Welcome message for the leader: \"There are no kangaroos in Austria \"",
            "If they do an HRE leader again, there’s an argument it should be Austria instead of Germany",
            "IDK I feel like it would be cool. What bonuses do you think they would have?",
            "Wait why is Austria ancap?",
            "I think German Empire and Holy Roman Empire should be two different civilization too.",
            "But Australia is already in the game",
            "Could we also have Denmark back?",
            "I hope we get more civs from the HRE in general, in stead of a German civ. Prussia would be awsome, and a Lübeck/Hansa civ could also be interesting. And albeit not German, a Bohemian/Chzech civ would be cool",
            "Franz Joseph would be a cool leader",
            "Austria was the hegemon of the HRE for a long time. We had the “HRE” sort of with Fredrick Barbarossa leading it as “Germany” so idk",
            "Hol up\n\nCan civ VII be done entirely in the style of Poland ball comics? You don't even control units, you just control a clay (country) individually and fight other clays.",
            "Yes I would also love to get Austria back as I really loved playing them",
            "I do think in civ6 they replaced austria with hungary... I hope there will be both in civ7",
            "Australia always gets me",
            "https://steamcommunity.com/sharedfiles/filedetails/?id=1570652296",
            "You play Austria then I play Germany. Anschluss time",
            "The thing about the Austro-Hungarian empire is that it incorporates multiple different cultures/civilisations under one ruler. Austria \\*on it's own\\* is one of many German states; it's hard to make it distinct until it becomes more than the specifically Austrian section.",
            "And their leader would be the painter...",
            "Aren't Austrians Germans? Heck, the King of Bavaria of all rulers was chosen as the second German leader in Civ6 (even despite the fact His NEVER the historical character known for ruling ALL of the Germans, unlike Barbarossa)",
            "They'll probably only have one Balkan state. Civ 5 had Austria and civ 6 had Hungary. If they had Austria, I would hope they would implement a puppet government system again, and give Austria bonuses for that. I believe they had something similar in civ 5.",
            "How would an Austrian civ be meaningfully different from a german civ?",
            "I think Austria has a fascinating story, but I believe a German civilization covers it. Multiple leaders with an Austrian leader would be a great solution though. Unless there were like 70-80 civs (yes, I kmow Austria has been in Civ before).\n\nI mean, the only reason Austria didn't join Germany was their rival Prussians pushing for a Kleindeutschland, so that Austria would have had to give up their non-German territories to join the new German state.... Something they were never going to accept.",
            "Fully covered by the HRE. Only one civ per ethnicity please",
            "because its not already eurocentric enough sure lets add liechtenstein and luxembourg and the kingdom of westphalia while were at it",
            "Was that the one where you could purchase a city state and then it becomes yours?",
            "https://steamcommunity.com/sharedfiles/filedetails/?id=1570652296",
            "Yeah, although it’s always preferable to just have those civs.",
            "To be fair, Hungary was a major player too up until 1918, especially under Matthias Corvinus. It was good that they chose him for Civ 6. I'd like to see Austria back though, Maria Theresa was awesome in Civ 5",
            "Not until they invented Zoos at least",
            "Not with that attitude there aren't.",
            "Bonuses to making friends and allies.\nThe Habsburger Motto was \"they others may be doing war but the prosperous austria is marring.\"",
            "Definitely some form of diplomatic bonus, that truly is the thing Austria was historically iconic for, whether through whatever city state system the next game has or any wider diplomatic mechanics. I very much doubt they’d go with him for various reasons, most notably not being an actual head of state, but Metternich would be a unique pick; he has a whole bloody period of the 1800s named after him.",
            "If they make diplo more interesting they should definitely get some unique feature there.",
            "I always wanted a Fürst Metternich Leader for Austria, someone who is mainly built about espionage and diplomacy!",
            "What losing to Serbia does to a mf",
            "Because of all the Austrian economists.",
            "There's an entire discipline called [Austrian economics](https://en.wikipedia.org/wiki/Austrian_school_of_economics) (Hayek and von Mises being the big two) that's basically warmed-up ancap with a nice suit on.\n\n(I wrote my thesis on Hayek and I am like 90% Austrian Economist.)",
            "and as not viking, please? \n\nMargrete I with the Kalmar union seems so obvious",
            "Bohemian/Czech would be great. Make it Jan Hus",
            "I’d recommend Ulm but it would probably be another broken civ like Russia or Basil.",
            "Neither Austian nor Hungary are Balkan states. I think we should get a Bulgarian or Serbian civ in civ 7, though.",
            "I shall inform you that no austrian would ever consider Austria a balkan state.\n\nSincerely,\nAn austrian",
            "Ironically enough, we don't have any true balkan state. There really is only greece and byzantium. both of which aren't really balkan proper.",
            "Makes sense.",
            "The HRE is really only Germany here. Austria is quite seperated historically. That's like saying we can't have scotland because England is lead by Victoria, and England is already much more Great Britain than england tbh",
            "Why not, they are definitely pulling same weight as Polynesia or Mapuche",
            "I mean Austria was a great power for a very long time. Although I agree that it'd be great to have less European civs, Civ 7 isn't out yet. \nWe don't even really know Kuch about it yet, so if Austria is like 1/15 European civs sure I'd prefer it to have been a non European.\n\nBut if Austria like 1/5 European civs, I think it wouldve very much earned that place.",
            "Austria is one of the central powers of world history. We have the Mapuche for god's sake, who, while cool, are a footnote in history at the edge of the world. Austria for centuries was among, if not the dominant power in Europe",
            "We're not talking about minor dutchies in the HRE, we're talking about Austria which for centuries  was the most powerful entity in Central Europe. It had control over Hungary and Bohemia. Large influence as the holder of the Emperor within the HRE.\n\nCould it be seen as Euro centric? Sure.\n\nBut that doesn't mean we shouldn't add more non European kingdoms and empires. Like the Timurids, I'd split India up into the many different and unique cultures and kingdoms that grew in the subcontinent over the 1000s of years.\n\nSplit up the Arabs into many of their unique cultures and Kingdoms. Bring back many of the native American nations too. It's not just add a European empire and just leave it.",
            "You dont know anything about history do you?",
            "Yes and it's so annoying if you're going for Patronage and Austria is annexing all the city states.",
            "Yeah ofc, but can't stuff the game with every civ from modern times, let alone all of history",
            "Maybe if they keep the Suzerain mechanic into the game, once you get a certain amount of Envoy's in a city state, you get them as a puppet state permanently, as you put a Habsburg on their \"Throne\"",
            "to be fair: that only became Austrias/Habsburgs motto after the realisation that we just **suck** at war. there's not a single war that austria won lol. and the few single battles we won were all with massive outside help.",
            "Serbia… and russia",
            "Or perhaps Christian IV (I think he was a somewhat popular as a mod in CIV IV)",
            "Charles IV would be the obvious answer since he was 1) famous 2) influential and most importantly 3) the emperor of the HRE",
            "Include Bulgaria, and make the Byzantine leader Basil II, then give them bonuses when fighting each other.",
            "That would be neat.",
            "Brothers and sisters are natural enemies. Like Greeks and Balkans. Or Byzantines and Balkans. Or Japanese and Balkans. Or Balkans and other Balkans. Damn Balkans, they ruined the Balkans!",
            "That's literally *exactly* what their ability was in Civ 5",
            "What the actual fuck are you talking about. You don’t become an empire spanning the globe without fighting. The Austrians fought off the Ottomans in the 1700s and 1600s, they expanded into Poland, Italy and Germany. They beat the Italian multiple times in their wars of independence (which were only eventually won because France intervened). Austria suffered defeats in Napeiloenic wars, but were also the first country to inflict a defeat on Napoleon and later was an intergeal part of the collation that crushed him. Even in WW1 they weren’t terrible fighting on 3 and sometimes 4 fronts during the war, and holding the line (much better performance than countries like Italy). Austria’s military history is filled with some of the most important military leaders in hisotry with Schwarzenberg, Arxhduke Charles, and Eugen of Savoy, the fact that you think Austria entire military existence was bad shows you’re lack of any historical research into the subject, and instead basing your thoughts just over the fact that Austria Hungary lost WW1.",
            "Ähm - Beruhig dich. Österreich hat gegen die Ottomanen verloren - es waren die Polen, die die Belagerung Wiens beendet haben.\n\nweit vor dem 20. Jahrhundert und dem 1. Weltkrieg waren die Österreicher eine militärische Lachnummer. von Königgrätz über den Bergisel, über Trient bis nach Mexiko. \n\nred' nicht so als würdest du dich in der Geschichte meines Landes besser auskennen als ich.\n\nedit: und weil du Prinz Eugen von Savoyen erwähnst: ja - er hat ein paar Kriege gewonnen, nämlich den Venedig-Österreich-Türkenkrieg und den Spanischen Erbfolgekrieg. Bei beiden hat er aber nur wegen der Verbündeten gewonnen, nicht wegen dem Habsburger-Heer.\n\nÖsterreich kann vieles, aber kämpfen gehört nicht dazu.",
            "I admit I’m not Austrian but I got enough basic German knowledge to try and address your points. Poland did in fact save Austria at the siege of Vienna in 1683, however the push back into the Balkan Ma including the devasting victory at Zenta was under Habsburg generalship and control. Koniggratz was a major loss however, it would be unfair to confine Austrian military hisotry to one defeat just as it would be to say Prussia was shit militarily because they lost decisively at Jena-Auerstadt.\nThe Mexico expedition was mainly Napoleons idea and can’t be attributed to Austrian military I competence. Don’t know about the rest you are saying but your main points even if right wouldn’t consign Austrian military hisotry as one only of losing."
        ]
    },
    "How DARE you": {
        "title": "How DARE you",
        "score": 678,
        "url": "https://www.reddit.com/gallery/1dldhnp",
        "content": "",
        "num_comments": 41,
        "comments": [
            "anybody else find it odd that we can just instantly see all civs stats for the rest of the game as soon as you’ve met them? i feel like you should only get access to that information if you have a certain level of diplomatic visibility.",
            "Mansa Musa is always trying to steal my money. I wonder if that's just part of his AI personality",
            "You know who the criminal is. You know the drill. Time for you to confiscate the gold back. ",
            "Game respects game",
            "My favorite is when a great work is stolen and you just look at the trade screens to find it. Then you have to take it back by conquering all their cities minus a small one in the corner so they stick around to remember what they did.",
            "please what is your secret to such vast wealth",
            "Happened to me. Had an alliance with 5 out of 6 civs, so it was pretty obvious that France was about to get nuked.",
            "Can a spy steal what Big Ben earns when you build it?",
            "What the flip man",
            "And it's Mansa Musa, bro does NOT need to steal money",
            "Remember kids, the spies can’t steal from Harbors! COASTAL CITIES RULE",
            "That would be a cool feature of a future game \"corrupt government\" where you can essentially steal your own income (\"double income per turn\") essentially at the expense of loyalty penalty.",
            "Burn them all",
            "Lore accurate mansa musa",
            "There's a reason I always have a spy camping the commercial hub of whatever city I have that produces the most gold.\n\nIt's like free spy exp.",
            "You gotta get spies to counterspy in your top gold production cities",
            "Is that a lot of gold??",
            "For sure. It takes all of the mystery out of calculating your moves and guessing the strength of your opponents.",
            "Wait I feel dumb where do I see this. Usually I just pull up rankings or see the trade menu.",
            "If you’re on PC there is a good mod that hides most of the stats, but also lets you unlock them based on your relationship with them. I’m sorry but I can’t remember the name of it right now. Maybe stats evolved or something?",
            "I mean you can always just turn ribbons off tbf",
            "I'll kindly wait the remaining 23 turns before our friendship declaration comes to an end\n\nAnd then he will cry",
            "It kinda erks me that when you \"kill\" a Civ, their gold just disappears. Like, it has to be somewhere right?",
            "Step 1: Play as Portugal\n\nStep 2: Profit",
            "Portugal is the big one, but also huge Archipelago map, Owls, feitorias, running a LOT of trade routes from Lisbon alone (I'm guessing 30+, maybe even 50+), Hunza, Bandar Brunai, other trade city-states, trade policies, ecstatic. You can get multiple thousands per turn from a single city as Portugal.\n\n\nIf game speed affects spy speed, I would also guess they are on a slower speed, meaning that ~50k gold is spread over more turns.",
            "People tell you to play Portugal but you can do it also with Mali with Mansa Musa. You just need a good flat desert, a suguba in every city and let's get the GP and wonders that give +1 or more trade routes + economic city states. The amount of gold is so awesome that you just buy your victory, whatever victory it is",
            "Dutch, trade routes out the wazoo",
            "options -> interface -> show yields in HUD ribbon, you can choose always on or show on hover",
            "You're far more polite than I would be. Id drop a nuke to cancel the friendship immediately xD",
            "That was your friend?",
            "Money should be stealable by conquest up to a certain tech. Like, all your gold is divided between your cities based on pop: lost a city, gold goes with it",
            "Step 3 - Don’t build a commercial hub unless you have spies protecting it.",
            "Really good point :)\nYou can add Torre de Belem and Great Zimbabwe (I got lucky to be able to build it due to the terrible placement restrictions) + all the GP who add trade routes + Reform the Coinage dedication + several gold modifiers such as Merchant Republic's 15% gold or Kilwa's effect with 2 trade city states I'm suzerain of",
            "Thanks so much for the explanation! I’m a newish player and 30 trade routes is mind blowing, will def check out Portugal!",
            "That sounds really fun too! Thanks for adding on, everyone here is so helpful :)",
            "Bruh that's broken.",
            "Actually he only stole me what I earn in 8 turns lol",
            "Wait, you can do that?",
            "If those are his friends, I don't want to meet his enemies.",
            "Ooh I see thank you! I def need to do a run practicing all of these things now :)",
            "true.\n\n1. as the saying goes, keep your friends rich and your enemies rich and wait to find out which is which\n\n2. I find this fimiliar to what happened in burkina faso between compaore and sankara"
        ]
    }
}