{
    "Weekly Questions Megathread": {
        "title": "Weekly Questions Megathread",
        "score": 11,
        "url": "https://www.reddit.com/r/ClashOfClans/comments/1diu6t5/weekly_questions_megathread/",
        "content": "Hey Clashers!\n\nIn order to foster better discussion  on the subreddit, we're going to be redirecting all simple questions about the game and personal progression to this [Weekly Questions Megathread](https://i.imgur.com/VFqpkk5.png).   In this thread, you can ask any question you need answered about Clash of Clans, even if it isn't necessarily about learning the game itself.  Questions posts with simple answers (anything that one or two sentences can adequately address without discussion potential) will be removed and redirected here.\n\nIf you're a veteran player, then please consider scrolling through and answering any questions you see, even if they already have an answer. Hearing multiple opinions is vital, and the discussion will help new players learn about the game.\n\n\\_\\_\\_\\_\n\nFirst, please check out [**subreddit's F.A.Q. page**](https://www.reddit.com/r/ClashOfClans/wiki/index/) for answers and guides to the most common questions or one of the many fine wiki pages for stats and other quick references on all aspects of the game.  [Coc.Guide](https://Coc.Guide),  [Fandom Wikia](https://clashofclans.fandom.com/wiki/Clash_of_Clans_Wiki), and [Clash.Ninja](https://Clash.Ninja)\n\nSome other frequent topics that might help you:\n\n[Should I upgrade my town hall?](https://www.reddit.com/r/ClashOfClans/comments/dvgmoe/guide_im_th9_should_i_go_up_an_answer_to_this_faq/)\n\n[Help I deleted my account and now I can't play.](https://www.reddit.com/r/ClashOfClans/comments/w2w7gk/weekly_questions_megathread/ih3ff5b/)\n\n[Why is CWL unfair?](https://www.reddit.com/r/ClashOfClans/comments/lxg3nv/guide_clan_war_league_explained_ask_questions_and/)\n\nTrying to zap something? - [Zapquaker Calculator](https://zapquaker.netlify.app/),  [Lightning Spell Radius](https://imgur.com/FcVMsmL), [Tutorial Video](https://www.reddit.com/r/ClashOfClans/comments/n1iu32/lightning_spell_tutorial_solid_short_version_here/)\n\n[What is the latest game news?](https://clashofclans.com/blog/)\n\n[Looking for voucher links? Here is a handy list](https://www.reddit.com/r/ClashOfClans/wiki/clash_voucher_links)\n\nFor base design questions check out /r/COCBaseLayouts\n\nFor recruiting see /r/ClashOfClansRecruit\n\nReddit now supports uploading images directly in comments through new.reddit or the official mobile app.  Otherwise -use [IMGUR](https://imgur.com/) or another image hosting site to add photo links in comments.",
        "num_comments": 557,
        "comments": [
            "#[150 super medals and ice cubes](https://link.clashofclans.com/?action=voucher&code=5bfda93c-942e-4586-81a1-5b1dbbf9f93b)\n\n#Check the app stores for optional updates. Many users are reporting downloading that catches them back up on the streak event.\n\nHey Chiefs! A quick shout-out to the top commenters from [last week's megathread](https://www.reddit.com/r/ClashOfClans/comments/1ddhowt/weekly_questions_megathread/) for going over and beyond in helping their fellow clashers with their queries.\n\n| Author                |   # Helped |\n|:----------------------|-----------:|\n| u/Ladyhawke74         |         81 |\n| u/lrt2222             |         36 |\n| u/TerryDaTurtl        |         26 |\n| u/CongressmanCoolRick |         23 |\n| u/CuteBenji           |         19 |",
            "Have you ever considered housing space instead of time as the tiebreaker?\nI think this will bring much more enjoyable and creative attacks to watch rather than the spam meta 😢\n\nAlso please fix siege machines ordering after finishing an attack, I've been saying this for years now.",
            "https://preview.redd.it/cwyscxdb9p7d1.jpeg?width=2400&format=pjpg&auto=webp&s=2886edb8062582c62f5bbbf3fbf5587f38d9717f\n\nWhy am I not progressing? Got two attack of 100%",
            "Anyone know if they are going to put the apprentice builder in the supercell store? I can buy it ingame for $2.99, but not from the supercell store. ",
            "I'm just wondering where to look in order to find sweaty clans as a TH13. Since ores winning wars has been so much more important and my current clan isn't doing too hot.",
            "Do u guys get 2/7 of the streak challenge? Think mine is bugged",
            "https://preview.redd.it/p632k9fhoq7d1.jpeg?width=2400&format=pjpg&auto=webp&s=dbfb26a069e0a3410c8d75ba04011c4f41b39129\n\nHello\n\nIs there anyone who knows how to complete this streak event task 2 and well I did try to complete the task but after doing a total of 100% it didn't move and well I tried a lot of times. Is anyone experiencing a similar issue and if you overcame it. Suggest a way to complete the task.",
            "Does anyone have issues with streak event...??\n\nIf any one completed the task 2 of event.",
            "Anyone having issues with the streak bonus? I’m not getting credit even though I am hitting the percentage.",
            "is it just me or you guys are also experiencing a bug with the streak event where you are able to get more than 60% destruction on a base",
            "i know they are still fixing the issue, but what happens if i lost my streak already? will i get it back?",
            "Is anyone else's Streak Event bugged? Mine is stuck on get 75% destruction. I 90%ed and 3stared already but no task progression.",
            "Is the hero upgrade thing they mentioned the apprentice builder? Or is it something else?",
            "Why isn’t the apprentice builder in the supercell store?",
            "Did anyone else experience hex code to colour text has stopped working? It used to work, but after the June update, it no longer works.\n\nAn example would be <c59C8F3>blue</c> for blue.",
            "Since the builders apprentace dropped I am thinking about rushing to th14 to max it so I can maximize it's value. I am a th11 rn. Thoughts?",
            "Is it just me or whenever you upgrade the town hall or use a hero potion for the boosts it doesn’t actually boost the hit points and the damage only the level",
            "Just started and am considering buying the builder pack. It’s 2.99 and comes with a builder and 500 gems. It seems like a better value if I wait to get it for my 4th builder since that costs more gems. Does it matter? Will it still cost 2.99 if it’s my 4th builder?",
            "How do you guys play Clash Of Clans for a long time at a time? All I do is attack then upgrade or remove obstacles if I can then get off until my army is ready.",
            "Any ideas what this green bull is?\n\nhttps://preview.redd.it/w0an0k952s7d1.png?width=1080&format=pjpg&auto=webp&s=c39c86ea5cb0b1eba5197fe77bd0703b5e27bfd3",
            "Is the rocket spear worth maxxing?\n\nAlso what’s the best combo for champion right now?",
            "Just hit 62% on destruction and task didn't complete... What I am not seeing?\n\nhttps://preview.redd.it/dsk3mq1l8s7d1.png?width=1080&format=pjpg&auto=webp&s=7dde58a67b07e824f43a90052aa95165c0d95bbd",
            "https://preview.redd.it/dv4odyegcs7d1.jpeg?width=1201&format=pjpg&auto=webp&s=fcc850940a660e4cff0c49efbf93c448ca64f66e\n\nFinish walls or upgrade to TH15 and finish walls while waiting for the new basic upgrades to finish (cc, lab, camps, storages, new defenses, etc)?\n\nMany people in the ole clan tell me to finish walls but I think sitting on 6 builders is extremely inefficient.",
            "I just 100%ed a base but the 60% challenge of the streak event doesnt seem to be completed. Why so?",
            "what army should i be using? im th9 and i use gowipe and spam dragons but neither of them seem to be working well due to inferno towers. what is a new army i could try?",
            "What's the deal with the dragons in the game. I see a lot of dragon attacks compared to edrag attacks, I tried seeing why this is and I see something about a speed meta? What does that mean and what's thr best dragon to use?",
            "Can someone explain to me the free gems from the suoercell store thing? I saw it in a post about getting gems F2P for the AB, but it seems confusing for me. Can someone explain it to me?",
            "Should I listen to the builder roadmap on the top of the screen? Or is there a better way to approach upgrading",
            "I have four builders and I've been thinking of buying the apprentice. I have 1500 gems and next builder costs 2000. After how many builders is it usually worth buying the apprentice?",
            "Is anyone else experiencing an issue with watching any Clan War Attack replays?\n\nAs soon as I finished my attack (less than 3 minutes ago from right now), I went to go watch my attack and it says \"Replay is no longer available!\"",
            "Fireball or Builder Apprentice \n\nCurrently I am early to mid th13 and just reached to 1500 gems again to buy fireball, but since builder apprentice came out, I am wondering if it's better to buy and max him first and then buy equipment.",
            "No more medal links coming? Could do with 1 more to get another set of ores",
            "https://preview.redd.it/toqja1ufvc7d1.jpeg?width=155&format=pjpg&auto=webp&s=11aeb16e65930b3f7db2201fe475dd4044ac3d0f\n\nHey everyone,\n\nI found this weird thing in my Clash of Clans village and I have no idea what it is. I put a picture of it here. It's this small square thing with a triangle in the middle. It's on the ground between some of my other buildings.\n\nI've looked everywhere and can't figure out what it does. Can someone please tell me what this is and what it's for?\n\nThanks a lot!",
            "Has anyone else having problems with the scenery loading up after the new update",
            "Hey,\n\nI want to surround my village with 3x3 trees and I was doing great until they just stopped spawning... I read online that the max amount of obstacles is 45. I have 31 trees and 7 stashed. That makes 38!! Am I missing something?\n\nI tried contacting supercell but they couldn't help me on this matter. Support is there for accounts and other related problems.\n\nHelp! 😔\n\nhttps://preview.redd.it/ke7xc6ih1d7d1.jpeg?width=2400&format=pjpg&auto=webp&s=5d22b0822adb9ca25a89d9c902b5f0b52421e900",
            "Is the apprentice builder worth maxing for me?\n\nI have played this game for quite a while, except for builder packs and gold passes I haven't spent any money on the game. I have reached 7768 gems today, without paying much money. I have all the books and runes you can have 2 times, but I don't think I will use those. Also I am not looking forward to spend my gems any time soon. \n\nShould I just max upgrade the apprentice builder or is it not worth it? I think, especially because I wouldn't spend my gems anyways, the apprentice builder is a good thing for me, right? What is your oppinion?",
            "Could someone please clarify whether the level 1 apprentice builder reduces any construction time? If the builder operates at 1x speed, does this mean that at level 1 he would reduce an upgrade time by one hour? And at level 2, would he reduce the time by two hours, and so on? Thanks in advance!",
            "Is there anywhere to see a comprehensive list of upgrade time/cost reductions? The 'full patch notes' doesn't specify",
            "Anyone else have any idea how to reorder your accounts? One of the things I was hyped for, but can’t figure out how to do it.",
            "Anyone else notice the DE truck in the space scenery with the goblins chasing it is gone?",
            "I got 1600 gems rather upgrade my builder apprentice (which I already have lvl 1) or buy the frozen arrow equipment for my Queen?\n\n(Already have the gaunlet)",
            "Hello, where do I see if supercell uploads new voucher links? How often does the link in this reddit to voucher links updated?",
            "Worth it to buy rocket spear? I will unlock hog puppet soon so do I just buy ores to upgrade hog puppet or buy rocket spear so I can have 2 equipment combos",
            "Is it worth upgrading the builders apprentice with around 12k gems ?",
            "It's not a question, but can anybody look whether they are facing the same issues or not...\n\n[https://www.reddit.com/r/ClashOfClans/comments/1diyj5z/did\\_anybody\\_notice\\_this/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/ClashOfClans/comments/1diyj5z/did_anybody_notice_this/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
            "How much does the ice effect from the ice golem and ice hound slow? I can’t find this information anywhere.",
            "Will you ever change the wall rings value? Because 8 wall rings to 6 million doesn't make sense to me so I'm just wondering if the ratio will change along with the cost reduction.",
            "Where would Supercell post a voucher for a few extra super medals at the end of the current ice bath event?",
            "Will spiky ball come back to shop for gems?",
            "When is wild west king coming in the shop ?",
            "Im at TH9 and have an opportunity to get the rocket spear... of I buy it, will I actually have it when I unlock the hero?",
            "I have 700 gems and just unlocked grand warden, should I save for fireball or buy apprentice builder",
            "Can anyone else not listen to music any play at the same time anymore? Since the update my iPhone pauses music as soon as I open the app",
            "anyone know how to open base links on google play games beta",
            "Obstacles, except gem box, have stopped spawning in my home village. According to the wiki, there is a limit of 45. I currently do not have 45 obstacles active, but have a lot of them stashed after shovelling. Does the 45 limit include the stashed ones?",
            "Do battles no longer automatically end when all your troops are dead?",
            "Is getting no defensive reward from raid weekends normal in the early stages of clan capital or is there something wrong with my bases?\n\nhttps://preview.redd.it/q8w6g2rpve7d1.jpeg?width=1170&format=pjpg&auto=webp&s=88829d727f85ff6a451870d7fca099de06dabf7f",
            "I have all five builders. What’s the best way I could spend my gems?",
            "Should I get the Giants Gauntlet or buy the apprentice builder first",
            "need advice on the superwall breaker event, have two options:\n\n1: buy the rc equipment. not a huge fan of it since it seems very situational, but currently about to unlock the rc for the first time so ik i won't have other equipment choices for a while\n\n2: buy ores and shovels. currently moving a lot of obstacles i never got around to so this saves me a lot of gems and gives me a head start for the rc equipment.\n\n  \nis there any leak of other rc equipment coming out in future events (ik the olympic events are coming up)? If yes, i'll likely not buy the equipment but if there isn't i'll probably get it",
            "should i get the rocket spear even if i don't have a town hall 13?",
            "https://preview.redd.it/bpbfg8d64g7d1.jpeg?width=392&format=pjpg&auto=webp&s=24fb9ef2aeff0c349aa48f851ca9c0d8872ecc8a\n\nHi all! Just wanted to ask if this is worth the 1500 gems? If not, what would you recommend?\n\nAppreciate any thoughts!",
            "I’m th12 with 1.3k gems. Can the apprentice builder still be valuable at level 1?",
            "https://preview.redd.it/zi72nqwweg7d1.jpeg?width=2448&format=pjpg&auto=webp&s=153379b0241166a52e136566058eba54bc0f5cfd\n\nHow",
            "Do people only get 10 Hour shields in fake legends?\n\nMy base got 3 starred and noticed the shield only lasts for 9h55m and the attack was 5m ago",
            "Will epic equipment come back in an event?",
            "How are pro players picked? For the World Championships. Curious on how all of that works. Do investors just pick top players from the leaderboards and say hey wanna join Team X? Or how does it work",
            "should i max builders apprentice quickly? like is it important?",
            "**Is there a good Sneaky Goblin/super wall breaker army combo?**\n\nI’m town hall level 12 and I have the super wall breaker activated from the event and sneaky goblin. My workshop is just level 1 so I only have the wall wrecker unlocked. Admittedly I rushed to town hall level 12 and have caught up since then but I’m not familiar with a lot of Th12 strategies. Any suggestions and/or tips?",
            "My Google play account is linked to an email that no longer exists as it has been shut down by my uni. Can I still access my village at all?",
            "[deleted]",
            "Has anyone figured out how to fix the \"transaction pending please wait\" bug with the store and Google play yet? Tried everything and looked up solutions for hours and nothing works. I was using the Amazon app store version but I can't use that anymore",
            "What’s your guys opinions on the most op army in TH10 I need some help",
            "https://preview.redd.it/i0kcme0ysi7d1.png?width=2532&format=png&auto=webp&s=947283bc0f1baf7573c38c63b92d32943e137e85\n\nIve looked up so many totorials on how to attack th13 bases but i can never get the 3 star. Is there a way i can attack this or how do i get better at attacking th13 bases and tips?",
            "https://preview.redd.it/3dzmi8zh1j7d1.jpeg?width=2532&format=pjpg&auto=webp&s=3585cc885c1f844e42bb158ef45f074337d5225a\n\nWhat should I upgrade next",
            "how many gems can you earn monthly put of Supercell Store as a f2p player?",
            "Anyone have the more recent link for free cubes and medals?",
            "Help with hero equipment please.\n\nIs the giant gauntlet and frozen arrow worth it?\n\nhttps://preview.redd.it/dq1yf16ndj7d1.jpeg?width=2340&format=pjpg&auto=webp&s=e1657932fb4b6b011875107ede83816dfd19a251",
            "I read the above \"Should I upgrade my town hall\" and now I am in dilemma. I am th14 all heroes maxed and about 70% army maxed out, core defenses like eagle, giga inferno, scattershot, infernos are maxed out and all builder huts are of level 2. Should I skip to th15 or should I max all out?",
            "I'm on th 13 , what strategies should I use  to collect a large amount of loot in a short period?",
            "How long does it take usually to tank out of legends league? I accidentally signed up and now I can’t even get 50% for the streak event because I’m th13 with no heroes up",
            "Frozen Arrow or lvl 4-5 Builder Apprentice ?\n\n\nIm a TH13, getting ready to upgrade TH’s, I have 1.5k gems & I was wondering if I should either get the frozen arrow or upgrade the builder apprentice to lvl 4 then save up eventually to get him to lvl 5? I use mainly air attacks so I run giant arrow & healers on my AQ, to help take out air defenses and sweepers. Lmk what y’all think ty",
            "Can someone please clarify how the star bonus works after you have accumulated two bonuses? Bascially I want to know the longest period of time I can go between collecting star bonuses before I am missing out/wasting time.\n\nMy current understanding is the following: the countdown for my third star bonus starts after I'm eligible for my second star bonus (i.e. 48 hours since being awarded my last star bonus). This countdown continues but once it reaches 0 (i.e. 72 hours since being awarded my last star bonus), it doesn't actually stack.\n\n  \nThanks!",
            "Is it a feature or a bug that I can not purchase clan castle troops with my raid medals when I'm not in a clan?\n\nhttps://preview.redd.it/npj639xnqm7d1.png?width=2340&format=pjpg&auto=webp&s=3e0f217266b1e467d4b1f9f0fe2354bd6618f628\n\nMy clan castle is empty in this screenshot",
            "Doesnt the streak event give us multiplier for ores as well? I was expecting that 😞",
            "Everything I've seen online says the TH15 Upgrade Pack is a level 3 spell tower, level 1 monolith, 2 books of everything, and a rune of gold, but this is what shows up in my shop for the TH15 Pack. Was it simply changed, or do I need to build one of the spell towers first? Am I missing something?\n\nhttps://preview.redd.it/jdcqanacvm7d1.png?width=1388&format=png&auto=webp&s=f402db08ef691ebd916b26c373926a159d71de4f",
            "Will the super troop spotlight medals disappear after the event ends?  Is this a use it or lose it currency?",
            "https://preview.redd.it/msu88wic5n7d1.png?width=1263&format=png&auto=webp&s=c0b61750f14454c0508075927731f47576ea7275\n\nOpinion on my clanmates base. Rushed or nah?",
            "What external resources are there?\n\nI know about the Zapquake calculator and the progress tracker but is there something that tracks the TH distribution per league?",
            "1.) Is the gold pass worth this late into the season? I have the regular track maxed already and I'm considering if the books/boosts are of any value at this point, don't really care about the warden skin tbh.  \n2.) Is the archer queen skin available for sale anywhere? Been playing all season and haven't seen it show up in the store even once :/",
            "can anyone say when builder base update arrive??",
            "I want to ugprade to TH16 soon  \nI have 2 building hammers, 2 BoB, 1 BoF, 2 or 3 BoH and 500\\~ CWL medals left after buying the second building hammer  \nI can't upgrade Ricochet Cannon & Multi AT because these aren't maxed (they are all kinda \\~18sh for the moment and I'm maxing 4 of them only)\n\nWhat should I focus? I was thinking:\n\n* book TH\n* book lab\n* hammer pet house\n* hammer monolith?\n* spirit fox lv 2 -> queen +2 lv with some DE runes\n* book/hammer RR lv 3 + upgrade healers/valky & siege barracks lv 5 w/ goblin builder (troops i use the most yet)\n\nidc about CC because i don't need the 2nd siege barrack available\n\nis this plan doable or are there better options?",
            "https://preview.redd.it/tb009143pp7d1.jpeg?width=2556&format=pjpg&auto=webp&s=50cc8b1609a2ec94ffe3137fa29d95947cee9060\n\nAnyone know why they’re saying sorry?",
            "https://preview.redd.it/97dm8amlsp7d1.jpeg?width=2436&format=pjpg&auto=webp&s=614e9e14ad9507ca3c4d63ef1204a8943f82334c\n\nIs this \"Starter Pack\" worth it? Doing some research, it seems like the builder pack is but I haven't found anything about the starter pack.",
            "Question about log launcher. If I use warden eternal tome on log launcher does health stop decreasing? I believe in theory the health should still decrease automatically but when I look, I can't really tell sometimes since I think I may have missed the ability to protect the launcher but I'm not 100% sure. Thank you in advance with this question.",
            "How long do troops stay in your base after you train them? I queued up an army before going to bed so that it would be ready when I woke up, but they were gone? Do they disappear after a set amount of time? Can't find anything googling.",
            "What's the streak event suppose to do? Does one get bonus % when they change league tiers? Or is it end of season?",
            "I recently started playing again after like 10 years without playing. I started fresh. I'm TH4 at the moment. Should I be upgrading every single unit in the Lab? Or are there some not worth? Cause it costs HELLA Elixir 😭 Thanks in advance!",
            "Why did some people receive the builders apprentice for free and others had to pay for it?",
            "I just received a free builder potion for an “apprentice bug” I didnt even notice the bug. What was that about",
            "Guys does anyone know how I lost 6 hours of shield in my first attack after being attacked?  I had 10plus hours of shield and then came back to 3 almost 4. Is that a bug?",
            "How long does it take to reach th6 currently (obv rush), need some alt accounts for clan games!",
            "Come back to coc after like 5 months and just remembered my dumbahh put my age as 13 for some reason. Is there any way to change this as I can only join family friendly clans.\nWouldn’t mind maybe starting a new account from scratch as I was only th7 anyway",
            "Anyone know the max lvl for skeleton spell in th12?",
            "Have walls prices been reduced within last few days?",
            "I have two Book of Heroes saved and two available from the season pass. I'll have to use 3 of them within 7 days of the end of season (to collect and save one from the season pass and not lose it for just a few gems).\n\nDo I use the 3 books on the AC/BK for the greatest amount of builder time saved or on the RC to shorten my time at TH13? Or is there something I'm missing?\n\n* Option 1: Use all three on the AQ and/or BK to get the most time value from the books.\n* Option 2: RC takes a total of 104 days (AC and BK take 67 days), which means I won't be able to use her the entire time I'm at TH13. If I wait until the very last minute of those 7 days post end-of-season and use 3 books I could be at level 11 w/ the RC and reduce the total time to max out at TH13 to 86 days.",
            "only got the RC epic equipment, what one should i get next? on like 750 gems but not sure if another equipment will come in the next event but idk when that is going to be",
            "How do some people have multiple books or hammers?",
            "My boost potion didn’t last 24 hours, has this happened to anyone else?",
            "something Im not sure but why is the range of single inferno less than that of multi inferno? Shouldn't they be the same given that they come from the same defence and both target air and ground?",
            "Priority use of gems? I hopped back into the game after multiple years of inactivity. The hero equipment is new to me. I understand that the Giant Gauntlet and the Ice Arrow are the best epic equipment currently. Would it be better to prioritize epic equipment over the new apprentice? Currently  a new TH13 in a clan with friends who just started CoC. Also would it be best to wait on the new epic equipment before buying any? (Currently have 1500 gems)",
            "Does anyone know if you can still claim rewards from the event pass (not the shop) after the event timer ends? I know the event shop stays open for another two days, but are you still able to claim rewards from the pass itself during that time?",
            "Is it worth buying ores using super medals?\n\nAnd how should I upgrade hero equipment strategically, i know this kinda sounds nonsense but there must be an order of doing so that i can get the best use of ores. I am th8 btw, \nMy Earthquake boots are lv-5 and rage vial is lv-3, barbarian puppet is lv-1",
            "If I use the BA when there is 8 hrs left on an upgrade, will I be losing an hour? Because the normal builder will also work for that one hour which will result in an aggregate work hours of 9. Please clarify regarding this issue should I use my BA when upgrade time is > 8hrs or > 9hrs?",
            "I got given a free Builder Potion in the item shop today and it was titled ‘We’re Sorry’\n\nNobody else in my clan was given this? I have no idea what they were sorry about or why it only applied to me.\n\nDid this happen to anyone else? Any ideas why this happened?",
            "Will we get additional super medals and ice cubes like before? I already claimed the 150 one.",
            "I just bought the event pass on the supercell store before knowing that they close purchases once the event has 24 hours left. Does anyone know if that pass just gets saved and I can activate on the next event? Or did I just waste my money?",
            "I just realized i never get personalized offer’s eventough i have them on in the settings. Anybody heard of this? I only get the classic wide array options but never a “JUST FOR YOU” one, i see posts of people getting them but i never do.",
            "So I just saw something odd I decided to use a war attack before going to sleep yet all the members of the enemy clan used their attacks within a 20 minute time span is this sus or normal?",
            "I've finally maxed out my TH9 and started the upgrade to TH10, which will take 1 day and 23 hours to complete.\n\nI'm unsure whether to use the Book of Building now or save it for later upgrades. With 10 days left on my Gold Pass, I want to maximize the boosted upgrade times for the upcoming TH10 upgrades.\n\nWhat do you suggest?",
            "Is the streak bonus possibly bugged? Unlocked second task, got exactly 60% on my attack, and it didn't complete the task. Maybe I need 61% or?",
            "How do you complete the streak event??  I'm on task 2, it says get at least 60% destruction and I've 3 starred a  multi player battle and it still says time left 18 hours and there's no  way to start over. Does streak mean I can't do a multi player attack  that doesn't get 60% before accomplishing it? Because it certainly looks  to me like it's saying to just accomplish that task in the allotted  time. What am I missing?",
            "# What attack strategy do you use when your Grand Warden is on upgrade for 8 days?",
            "TEMPORAL SOLUTION FOR STREAK BUG\n\nDo an attack between 60 and 70 percent (I had to surrender to get that percentage but it worked).",
            "So they really did not give f2p enough medals for weapon and decoration?\nAlready claimed the first link... Need 175 more...",
            "JUST got to th14, should I prioritize on getting the druid asap?\n \nl've already upgraded lab and cc and im wondering if the troop is that op that I should get it before upgrading forge?",
            "Is it ever worth using Hero Books on pets? My Unicorn is only Lv 5 and I kinda have 2 hero books to burn through before I can get the one from Clan Games",
            "On my th13 account i have all heroes down and wanted to ask is it possible to get 75% on it or not,and if yes what strat to use,currently trying with dragons with overgrowth",
            "what should I buy in the super troop event shop as a th10?",
            "Should i save for appentice builder upgrades (I have him on lvl 1) or for giant ganulet for king (th14, 3500 trophies, I have 400 gems rn)",
            " \nDoes anyone have a list of all the time and cost reductions of the June 2024 update or where to find them? I know clash ninja has the before and after times but I would really want a full list of every upgrade.",
            "I'm th9 I keep running out of resources. Should I just go to th10? And see if that helps.",
            "The post of clan games have faq that mentions Thread near the end of clan games for joining clans for getting rewards, but can't find the thread from last 2-3 clan games, is the thread permanently closed?",
            "I can't log into supercell id after the update. It's been 3 days but the problem is still there. Also \"in-game help and support\" does not work. Is there a way to fix these?",
            "Man, mass sneaky archers are so good in clan capital, I almost 100% 3 districts with it in 6 attacks.\n\nHow long can they keep up this 2 attack per district",
            "If I put 3 interlocking jump Spells over a body of water in raid weekend can my untis jump the lake",
            "I got to TH13 a few days ago, so I didn't upgrade RC equipment a lot. I have Seeking Shield, Royal Gem and Rocket Spear. And I think I will try using hybrid. But I don't know what equipment should I have on RC.",
            "why are players coming into our clan, attacking in the raid and then leaving?  are they able to to take raid gold to their other clan?",
            "Where’s the gold pass? Returning to clash after about seven months and can’t find where to upgrade for the 20% cost reductions.\n\nhttps://preview.redd.it/9uxjyj7hhy7d1.jpeg?width=1669&format=pjpg&auto=webp&s=32a3b359f7c089d19c3f1affda1cd3fd0d29c4cb",
            "I’ve recently made my clan public and have had over 300 Chinese or Japan users join and instantly leave. The clan location is United States and language is English does anyone have any idea what’s going on?",
            "I have 3 more levels on my barb king, valks, and skelly spell, and 1 more level on minions with everything else max as a th12. I’m worried if I don’t max now I’ll be way behind on lab at th13 since of the new building reductions. Should I just go up anyway or wait?",
            " i have an apprentice builder in my main village at 4x boost and one on an alt with 2x boost how has the 2x boost saved more time than the 4x boost ? both started at the same time",
            "I’m looking for information regarding shields in Legend League. I purchased a shield last night and I’m still being attacked.",
            "Are there any new voucher links, because I really need 180 medals in the RC event for the abillity?",
            "how do we get more spell storage in capital?\n\nso we just got to capital 9 and unlocked super miners ✔ they are currently going to level 2 and we can carry 2 freezer or 2 heals, how do we get more spell storage? I was in a maxed capital clan I think we had 3 heals.. pretty sure but now I can't remember how 🙏",
            "Why is the Wild West royal champion skin not showing up in shop? And it’s only the Royal champion. The king, queen, and scenery are all there. Is it because I’m TH12 and since I don’t have RC yet I can’t buy skins for it?",
            "About the clan recruitment tool are there like any known issues? For example that besides saying you don't want to be suggested you are still found in the clan recruitment tool? Or that you are red and still get invites from non-friends? Also is it possible that when you become clanless your settings change to be invited and suggested?",
            "Can I change my local location? I made my account in the US but now I live in the UK. My account still has local location set to US. Wondering if there was a way to change it",
            "might be dumb question, but i just got the builder's apprentice, and at level 1, if he only works for an hour, with a multiplier of x1..... he doesnt do anything...? like, a building will advance an hour, on the duration of one hour that the apprentice works for....",
            "Does it matter which TH i attack in clan war? My enemy clan has THs from 5 which is going to be the easiest 3 stars..",
            "Does the war arena scenery remove obstacles\n\nhttps://preview.redd.it/6vgc8mgih18d1.png?width=2400&format=pjpg&auto=webp&s=eb00ddb9fa13318466a46851e7d62d6e612d0ef2\n\nLike if I purchase the war arena scenery will I lose all my Christmas trees and stuff, on the view scenery it shows the base without obstacles such as Christmas trees.",
            "https://preview.redd.it/53hrvaus828d1.jpeg?width=1792&format=pjpg&auto=webp&s=084b1028411981b5bc2185638dbc0310cb4e7258\n\nDoes anyone have a link for this specific base?",
            "I drop a single ice golem to tank then I drip 1 drjmuod to heal but the druid just stands there and doesn't heal. Does anyone know why?\n\nDoes the druid only heal certain troops or certain housing space? \n\nAlso Druid is single target, but I think the healing ball bounces to multiple troops. Is it single or multi target? Thanks",
            "Started playing recently. Bot my Builder Base to TH5.\n\nLooking at online examples of bases, they all have two gold reserves, two gold mines two elixir collectors and two storages.\n\nBut my seconds are all greyed out, and when I click on them, they say they unlock at TH6? 🙁 how do all the examples have the extra gold generators but I don’t? Any thoughts appreciated",
            "When will theu fix the 2 rows deployment option? I use lots of troops and dragging back and forth is such a pain.",
            "# Back to COC after 5 fucking long years.\n\n\n\nSo hey!. 1st of all I hope you all are doing great. So here is my tale. Back in 2019, when I was in 9th grade, I quit the game because my th7 account was lost as my dumbass never saved it in google play. In fact, I didn't have a phone back then. But after 5 LONG YEARS, I began to play this game once again 2-3 weeks ago and I am in a clan with my school mates as many of them were still playing COC. I have an almost maxed out TH5 and my Builder Base level is 4. When I left. TH12 had just arrived and Builder Base was pretty new. TH12 was also the 1st town hall who could defend itself (and still does) along with Ice Dragon being a brand new troop. I have so many questions tho, like how does battles happen at builder base? Have Boxer Giants and Bombers became heroes? And I am sure there are some changes at main village too so I do need a summary of what really happened in COC in my 5 year long hiatus.",
            "Is it worth to rush th6 for clan games?\n\nJust reinstalled couple days ago to make a f2p account and discovered that for clan games i have to be at least th6.\n\nRn i am th4, is it worth rushing to th6 to partecipate to clan games to get rewards?\n\nI'm not in a rush but right now i have 3 builder that are always working but wanted some more gems to get the 4th builder and also woldn't mind having something more to do since the mission for now are mostly for upgrading structures and i have full storages",
            "The free-to-play tokens I received from the event is not enough for the Decoration?! Typically, the total tokens can be used for the Main Item and 1 or more Decoration items. Now im sad, why Clash devs? 😕",
            "Since I am in endless loop purgatory and can't do the upload (kindle/Amazon issue) and sadly can't play.... I would love to hear how the upgrade is working. Problems fixed? Are you liking the new features?",
            "🎆⚡️🚨\n\nHi guys! \n\nI recently wrote a post regarding update suggestions, it took me ages and I put a lot of thought into the ideas.\n\nI have received no responses at all, I’m really disappointed with the turn out 😔\n\nThe thing is, I think some of the ideas are really good/would be great additions to the game. Some of the things I addressed are actual issues with the game that need to be fixed! \n\nThe thing is, I have come to realise, only people who are really into the game and are interested in the development/betterment of the game will want to read the post, and I know you people are out there! I just don’t know how to reach you… \n\nI thought it might be worth speaking about it here as I believe this is where people with a lot of interest in the game + a constructive spirit go, as I come here to answer questions sometimes for that very reason, I know there are other people who come here to answer questions for the same reason! \n\nIf you are somebody who loves the game and is actively interested in the development and wellbeing of the game, PLEASE check out the post and let me know what you think 🙏 - Some of these things *actually* need to be brought to Supercell’s attention like broken/incorrectly functioning features, some are just ideas that people can add to or remove from/build upon. \n\nHere is the post:\n\nhttps://www.reddit.com/r/ClashOfClans/s/bwwx49N31R\n\n❤️\n\nI would also be very happy to hear feedback in terms of how to make the post more engaging/attractive and how to get more of the right kind of people to see it - Any advice is welcome, I would be very appreciative! 🤗",
            "How good is the recall spell?",
            "https://preview.redd.it/xduhf87a6d7d1.png?width=920&format=png&auto=webp&s=938cacf4f3047969952881f9da01f544c3664a31\n\nTelling me I already saved two days lmao",
            "True/False?\n\nHigher townhall level shortens upgrade times?\n\nExample given (fake numbers just to illustrate):\n\nCanon lvl 5 takes 2 hours at TH10\n\nCanon lvl 5 takes 1 hour at TH12\n\nShouldn’t I just rush to TH16 to complete the game waaay faster, compared to completing TH’s one by one.\n\nAside from getting more coins/elixir/DE from gems with higher storage lvls.\n\nThanks im advance!",
            "Happened to me too",
            "Just was about to ask something similar 😅 hope they get a fix soon.",
            "There have been several posts about it being bugged. Hopefully, it gets fixed soon.",
            "Probably not if its not already there now.",
            "/r/ClashOfClansrecruit \n\nhttps://discord.gg/Clashofclans",
            "Yeah same",
            "Mine completed.",
            "Right now it’s bugged",
            "Did you do a total of 100% in one attack or multiple? Any of those attacks get 60% in just one?  Others have reported that it didn’t work for them either.  It did work for me so maybe it was a bug that was fixed?",
            "There’s a bug right now",
            "I completed the second task without issue, but there are several posts about it being bugged. Hopefully, it gets fixed soon.",
            "It's bugged for many people and has been posted about several times. Hopefully, it will be fixed soon.",
            "Just found a temporal solution: do an attack between 60 and 70 percent (I had to surrender to get that percentage but it worked).",
            "They are working on a fix:\n\n>We're aware of the issue and currently work on a fix!\n\n[https://x.com/ClashofClans/status/1804069500607664571?t=tZIGa6Gj_aD9EC35_ELGBA&s=19](https://x.com/ClashofClans/status/1804069500607664571?t=tZIGa6Gj_aD9EC35_ELGBA&s=19)",
            "Do you know if you get the 120 gems back for continuing the streak",
            "okay, good to see someone else with the issue. Not alone here",
            "They are working on the issue:\n\n>Quick update about this issue: We have located the root of the problem, but we still don't have a fix for it. The issue is that the event is using the game's internal timer instead of the player's. \nWe apologize for the bad experience, and we're doing our best to get the fix out as soon as possible.\n\n[https://x.com/ClashofClans/status/1804460905301741931?t=lqkQ3C6MxMAtkC2kfc48pw&s=19](https://x.com/ClashofClans/status/1804460905301741931?t=lqkQ3C6MxMAtkC2kfc48pw&s=19)",
            "Same here. Just got scammed 120 gems to continue and not restart. Thank you supercell…",
            "There is rumored to be more things coming in the near future to help you out.",
            "There is rumoured to be an event where you can use heroes while upgrading ",
            "Why would it be in the store when it is something you buy in game with gems?",
            "It’s been reported in here.  \nhttps://www.reddit.com/r/ClashOfClans/s/6kJ39lC42T  \n\nSpecifically:  \nhttps://www.reddit.com/r/ClashOfClans/s/k8R7dagrAy",
            "thought 1-5 levels are valuable enough(500or750gems for 1hour/day),and6-8 levels 1000gems/(hour/day) are crazy,you have to use it 336days to make it equal to 2hero books for 7day hero level up.Just save gems for books or goblin worker.So i think rush to th12 or further 13 is okay(for 6 7 builders),and u won't lose too much fun at 12 13.",
            "you mean it only changes the displayed number, not the actual stats to match that new max level?",
            "IIRC, the price goes up, the more builders you have. This is because, without those packs, the 3rd builder costs 500 gems, the 4th 1000, and the 5th 2000. The costs for the builder pack scale similarly depending on which builder you're unlocking.",
            "No, it will go up to 5",
            "thats what most people do.  \n\nsometimes ill hang out in chat, practice FCs and stuff",
            "Some people have multiple accounts, do builder base, talk shit in clan chat",
            "Giant gauntlet",
            "I don’t think so. Haste and hog is great",
            "As the other guy Said haste and hogs is good, also there's the option for haste and healing gem\n\nMaxing an epic is never worth it. Usually you'd go to lvl23 or 26, never max (if you want variety of equipments)",
            "It is a bug that others are reporting also.  Mine completed on one of my accounts but not on another, so seems inconsistent.",
            "Upgrade th it may not be as satisfying but sitting on the builders is as u said stupid",
            "Upgrade to TH15",
            "You are correct. Time is the biggest bottleneck in this game, and having idle Builders is sabotaging your progress.",
            "Its not working properly",
            "If you’re th9 attacking th10s then nothing is supposed to work all that well for three stars but if try zap drag or zap witch, there are lots of videos on them.",
            "When the inferno towers are set to single, try QC GoHog. That's what I use to hit up with my TH9 in war, often with surprisingly good results",
            "Dragons, at pretty much any townhall they're available, are a solid choice considering the existence of lightning and earthquake spells.\n\nEspecially considering that if you've been using mass dragons at earlier townhalls you're basically getting better and better over the weeks.\n\nAs for the army comp, some funneling troops is preferred but may be optional, the rest are dragons.",
            "If you're talking about the pro meta, dragons are better than edrags because they are more reliable - they aren't affected by any CC (ie archers vs edrags), work on any base (erags suffer with spaced buildings).\n\nAdditionally the current base meta stacks a lot of defences around a central TH to stop roots - and pros are countering this with clone blimps. Dragons don't need spells so you can bring clones, while edrags do require spells.\n\nAgainst normal bases though edrags work well if not better than regular dragons",
            "There are challenges that, when completed in-game, give you points. For every so many points, you unlock rewards. The challenges reset each week, so you can continue adding to your points for the entire month:\n\nhttps://preview.redd.it/deb7m4vvxx7d1.jpeg?width=960&format=pjpg&auto=webp&s=9dbaa2a7a36b7527bf0d7efc5c960235232aaae4",
            "log in to store.supercell.com and you will start earning points until you get rewards. for free",
            "There is a better way.  Upgrade offense and heros first.  It is more fun attacking, and easier to get resources when you have a stronger army.\n\nThis guide is about rushing but talks about upgrade priorities that are good whether or not you are rushing.\n\n[https://www.reddit.com/r/ClashOfClans/comments/18gsgwg/new\\_th\\_new\\_callmetee\\_rush\\_bible/](https://www.reddit.com/r/ClashOfClans/comments/18gsgwg/new_th_new_callmetee_rush_bible/)",
            "Do not buy the Apprentice Builder before you have all of the Builders that are purchasable with gems. You get way more value from a Builder than from the Apprentice.",
            "imo, it's best to get better at his other equipment and spend the gems on the apprentice to progress faster. The fireball won't help you max. His other equipment is also more important than some other heros. Eternal tome + any of the other equipment are equally good.",
            "As the event is nearing its end, there will probably no additional link",
            "That is the centre point of your village.",
            "We don't know what it is \n\nBut we know what it is for.\n\nIt's actually for knowing where the centre of the map is. This is for people who are making new base's.",
            "Yes. I did an attack, and mine came back. Seems temporary.",
            "People like you wasting supports time with pointless requests. \n\nThe limit is 45 which includes stashed obstacles. They won’t stop until this is reached.",
            "saving things forever to never spend it doesnt make sense.  \n\nBuy the apprentice builder if you arent near maxed 16.\n\nIf you have epics to buy thats a better deal though IMO",
            "you basically save an hour off a build per level",
            "[https://www.clash.ninja/guides/when-is-the-next-update](https://www.clash.ninja/guides/when-is-the-next-update)",
            "Top right of scid screen is an edit button, then you can drag the IDs up or down. \n\nits not available to everyone yet it seems, the rollout is either slow or buggy.  Seen a few others say its not there but then hour or so later it showed up.  Just keep checking back.",
            "equipment IMO.  We all got this far in the game without the apprentice builder.  You can live without it or wait to get it later.  That frozen arrow is nice and will improve your attacks immediately.",
            "The links are usually given out on clash of clans social media channels or given to content creators who will share them with their YouTube or twitch audience",
            "if you want to use it in the future, its worth it- especially if you still need to save up gems for apprentice builder",
            "Its 6.5k, which is a lot, but if you play the game regularly it eventually pays off. So yeah",
            "https://preview.redd.it/yzxn7orz9e7d1.jpeg?width=968&format=pjpg&auto=webp&s=49a8ee2ab75aae919c6fb1b316e54dd6e94f4903\n\nPost here 👆🏻",
            "according to fandom, ice golem does 50% (fire rate on offense, speed and attack speed on defense). ice hound doesnt say but given the th13 giga bomb effect is also 50% i would say the ice hound is the same.",
            "It will get changed its just an error ",
            "I don’t expect the ratio to change with the discount ever it’s been that way forever and f2p playeds may be upset if gold pass made magic items stronger",
            "they would probably give it to creators to pass along to their viewers. \n\nif another one pops up, reddit will have it, and we'll pin a link with it in this thread",
            "https://link.clashofclans.com/?action=voucher&code=5bfda93c-942e-4586-81a1-5b1dbbf9f93b",
            "Eventually yes",
            "Epic Equipment returns to the Trader for 1500 gems, approximately 2 months after it was initially released in an event. This means the Spiky Ball will likely return in July or August.",
            "Yes",
            "unless you really want fireball, i would just get the builder. fireball is great for warden walks and blimp attacks but if you arent doing those youll get more benefit from the new builder.",
            "you cant",
            "Yes, the stashed ones are counted towards the limit. Gem boxes and special obstacles will spawn (provided you have a 2x2 space for them in your active layout) despite the limit.",
            "Yes. I hope one day they change it to only consider 45 active decorations/obstacles. Because currently its just a way to scam players from getting those extra bit of gems by clearing obstacle spawns. Even the recent surplus of decorations through events seems to be forcing this issue.",
            "they still do, sometimes theres an odd delay when you have a poison still going though.",
            "It happens.  There aren’t that many who are so new in capital AND still attacking.",
            "If there's any Epic Equipment you haven't acquired yet, especially the Giant Gauntlet and Frozen Arrow. After equipment, you might consider the Builder's Apprentice, Hero Books, or Ores (especially Starry and Glowy).",
            "I would prioritize the Gauntlet over the Builder's Apprentice.",
            "Do you mean like max out the apprentice or just the initial purchase? I would go with gauntlet tho",
            "No leaks, I’d get the equipment and just not upgrade it for now.",
            "I would rather than paying 1500 gems later.",
            "The only equipment that is strat-proof, and the only one I don't swap out. The only caveat: worth buying after you have all five builders",
            "Yes, this is the most important and versatile equipment in the game. Only exception is if you don't have 5 builders yet, you should save for those first, then save for this.",
            "Yes. It’s a must have.",
            "You can upgrade it to level two and yes it worth it if you planing on playing for long time",
            "Compare it to goblin builder which costs 40 gems/day.  For 500 gems you can get 12.5 days (300 hours) of upgrades.\n\nApprentice at level 1 basically saves 1 hour per day (with perfect use which probably won't happen).  So after around a year the apprentice overtakes the goblin in value.\n\nDo with that what you will but at what is effectively 1/24th of a builder (at lvl1) I'm in no hurry to get the apprentice.",
            "If you’re asking about the layout it’s because in clan war you can participate without upgrading layouts so you can have a th5 base with everything th9 level if you haven’t updated it since then",
            "Yes, in Legend League (not signed up for the Tournament), you receive a 10 hour shield for being 3-starred.",
            "The only way we've seen epic equipment return is in the trader, for 1500 gems. If you don't buy the rocket spear in this event, you can get it in a few months. As of right now, it's unlikely to see if in a future event. \n\nOnce every hero has 2 epics, we'll see if they change their mind on this.",
            "I wouldn’t fell an urgency to rush it but it will pay off in the long run",
            "It’s the best farming army. I usually take ~8 swb and the rest sneakies. 3 jumps, 3 haste, 2 invis. Really easy to farm and trophy push since you can almost always get the th especially if you have heroes up too.",
            "Yeah they work very well together most people agree it’s the farming army in the game a wall wrecker helps but make sure to bring jump spells and invisibility’s to protect the goblins while they hit high hp buildings like townhall and clan castles",
            "Make a new account and contact support through it",
            "Tons of bugs pop up right after updates, most are fixed within few days",
            "You tried support?",
            "Zap + EQ the infernos then golems + witches for the rest",
            "What level are your heroes and troops?",
            "Your sad little th11 heroes",
            "Here is link to a post about how many gems you could collect as f2p.  \n[https://www.reddit.com/r/ClashOfClans/comments/1diptr7/how\\_to\\_get\\_gems\\_in\\_the\\_fastest\\_way\\_as\\_an\\_f2p\\_for/](https://www.reddit.com/r/ClashOfClans/comments/1diptr7/how_to_get_gems_in_the_fastest_way_as_an_f2p_for/)",
            "What do you mean more recent? Are you saying there was a second one?  I’ve only seen the first one (for this season).",
            "yes to both.  Id spend rest of your gems on apprentice builder.  Its way too expensive, but that wont change and the earlier you start using it the earlier it pays for itself",
            "Just go up if you want to.\n\nTH15 is a massive increase in firepower for CWL and theres good loot too",
            "sneaky goblin farming. in this event you can also bring super wall breakers for free. spells can be a mix of jump, rage, and invis (personal preference).",
            "Good luck. You're are probably stuck with other people who want out of legends to complete the streak event so you may have few defenses.  All you can do is not attack and wait",
            "This late in the season can take much longer because the others in low legends are not very active.",
            "Id personally go for builder",
            "You're wasting time after you have 2 bonuses stacked. The third bonus's countdown will not start until you finish your first bonus",
            "You get one per 24 hours.  can stack 2.  \n\nyou need to hit every other day to get 2 bonuses basically",
            "You must be in a clan before you can reinforce your **Clan** Castle:\n\n>If the player is in a Clan, they can reinforce their own Clan Castle using Raid Medals won from Raid Weekends,\n\n[https://clashofclans.fandom.com/wiki/Clan_Castle](https://clashofclans.fandom.com/wiki/Clan_Castle)",
            "Streak event multipliers are applied to the loot bonus, not the daily star bonus.  \nThere are no ores in the loot bonus.",
            "supercell supposedly has removed buildings from store offers in the most recent update",
            "Yes",
            "Yes, so make sure you use them before they disappear. If you don't use them, they will get converted to gold, , but it'll be a disappointing amount, so you're way better off spending the medals you've earned. I didn't use mine in time the first two times I'd earned them from events, but I finally caught on. You can get some great new hero equipment this way.",
            "You have 2 extra days after the event ends to use your medals. You can see the time remaining at the Trader, where you spend the medals.",
            "Of course, it's rushed.",
            "There's [Clash Spot](https://clashspot.net/en).",
            "1) The Gold Pass is great value, but when you buy this late in the season, you are missing out on most of the value of the Boosts.\n\n\n\n2) The Wild West Queen is in the shop within the game, and in the [Supercell Store](https://store.supercell.com/game/clashofclans).",
            "The devs are primarily focusing on the Main Village this year, so we likely won't see an update for Builder Base anytime soon.",
            "A bug caused people to lose the benefit of using the builder apprentice.  It has been fixed and they said they would send out a builder potion to those who were impacted by it to make up for it.",
            "I wouldn't spend my money on it.  Resources are easy to acquire so you're really just paying a dollar for a builder potion.  It's fine value, I guess, but I'm of the mind that micro-transactions like these are a slippery slope.   There's also no need to rush to endgame.  Being a TH7 or TH9 is loads of fun, too.",
            "The health of the Log Launcher continues to degrade, even under the effect of the Eternal Tome:\n\n>The Eternal Tome, which prevents damage on other units, does not stop this HP decay.\n\n[https://clashofclans.fandom.com/wiki/Log_Launcher](https://clashofclans.fandom.com/wiki/Log_Launcher)",
            "they don't ever disappear unless they're event troops. my guess is that you closed the game really quickly after clicking train, the same is true for starting an upgrade",
            "You get extra loot - per attack.\n\nThe loot bonus, ie. extra 320k gold/elixer in titan 1 gets an extra 10-100% added to it",
            "upgrade the ones you like. as you go you can get research potions from the clan capital raid weekend and eventually youll have more elixir than you know what to do with.",
            "It cost 500 gems.   You could use 500 gems or you could buy it with real money.  Your choice.",
            "there were some crashing issues for people who got the apprentice builder",
            "I had the same issue. I think the game is adding the 4 hours that are lost in the second attack by mistake",
            "Shouldn’t always the first only remove 3 hours?",
            "probably about 3 days given youre always on. town hall takes about a day total, 2 gold storages to afford town hall need 1 day each, 1 elixir storage needs 1 day to afford max gold storage cost. split that between two builders and its two days, but the new buildings youre required to build will probably take up another day for the builders.",
            "It's not possible to change your age, even through support. You can be back at TH7, with a new account, in a couple of months.\n\nIf you start over, do not delete your current account, but instead, just ignore it. Deleting an account has the potential of locking you out of the game and requiring a factory reset of your device to be able to play again.",
            "Level 6, with a Level 10 Laboratory.",
            "There were several cost/time reductions with the update, ~~but walls were not included~~\n\n\n\nedited (thank you, Nymrinae)\n\n>Wall 15 went from 5 to 4M, Wall 16 went from 8 to 6M.",
            "max AQ",
            "If you don’t have the Giant Gauntlet, then I would recommend getting it when you have enough gems.",
            "Magic items purchased with money as well as from certain rewards, stack beyond the limit. Additionally, especially with the Hammer of Building, the rewards for returning players can stack above the limit.",
            "Which boost potion?  \nResource potion is the only one that lasts 24 hours.",
            "Because it is so much stronger.",
            "The range of Multi Inferno Towers was increased to 10 spaces from 9 as a balance change in the June 29, 2018 update.\n\nSince the Single Inferno does more damage to a single target in a short amount of time, it makes sense for it to be a little more limited in range.",
            "Equipment",
            "I would prioritize giant gauntlet over the BA for sure.  Given recent equipment leaks I might save gems after that and see if there is any equipment worth buying (in other words, if you get the new equipment for free just by playing, you may have no use for the one you are about to buy).",
            "Is there a reason you cant just claim now?",
            "I do buy ore when needed and I recommend looking up videos by Itzu on hero equipment for various halls and attacks.",
            "If you assign the BA to work with 8 hours of work left, in theory, 9 hours of work could be completed in that hour.  \nBut in reality the upgrade will be completed in about 53 minutes.   \nThe BA gets off 7 minutes early, and so does the builder.",
            "Never mind - literally a few posts below this there is a post with over 1k upvotes, I’ll take a look now",
            "We never know if they will be releasing another voucher or not. All you can do is wait and see.",
            "You have the pass on your account and can use it for a future event.",
            "The \"Just For You\" offers are generally for people who don't spend money or spend very little. The offers are to encourage them to start spending.",
            "It's not uncommon for clans to coordinate their attacks, and everyone attack at around the same time. Additionally, there are some clans where it's a single person with multiple accounts that attack one after the other.",
            "Honestly don't get wrapped up in only doing the most efficient things at all times.  \n\nUse it for something that makes sense now.  you have camps, lab, cc that all increase your power immediately.  \n\nYou're playing a game, don't optimize the fun out of it.",
            "Update, attacked again, got 63% and it worked, I'll leave my comment in case it helps others",
            "They are working on a fix:\n\n>We're aware of the issue and currently work on a fix!\n\n[https://x.com/ClashofClans/status/1804069500607664571?t=tZIGa6Gj_aD9EC35_ELGBA&s=19](https://x.com/ClashofClans/status/1804069500607664571?t=tZIGa6Gj_aD9EC35_ELGBA&s=19)",
            "update your app",
            "![gif](giphy|dYzd7l6IdYY6I)\n\nTwo options cry in fetal pose or sneaky goblins 😂",
            "If you want to 3 star try something like QC superbarbs.\n\nIf you queencharge the whole base you dont need warden",
            "for me it did not was an hour ago maybe because of that",
            "Tried this (on latest update), scored 64% and still didn't work",
            "They never did.",
            "Nobody knows how OP it is yet.\n\nAlso its more of a supportive troop, so i would level your main troops before getting the support high",
            "For now, it seems to be a good support troop in root rider spam attacks, which you haven't unlocked yet (TH15-16 exclusive).  \nHowever, if you're using a hero part (King + Queen + low housing space support) prior to starting your main attack, you might want to add one or two of these bad boys to the mix. \n\nIn terms of priority, I'd say it's a nice to have but not a must have. So upgrade your blacksmith and then go for it.",
            "Sure, using magic items on an upgrade is fine if it prevents addititional magic items going to waste.",
            "edrag spam is the way with blimp",
            "Equipment then ore.",
            "I recommend the Giant Gauntlet. The Apprentice Builder can be leveled up slowly as you play.",
            "Giant gauntlet is amazing. Seeing as you’re already th14 I’d go for the epic equipment. The AB upgrades are marginal unless you max it and even then you have to never have it on cooldown to)",
            "They can be found here:\n\n[https://www.clash.ninja/guides/when-is-the-next-update](https://www.clash.ninja/guides/when-is-the-next-update)",
            "I’d make sure your collectors are all upgrades, then grind your best attacks to move up leagues - loot bonuses are higher in masters for instance. You can also do easy loot attacks (goblins, queen walks, jump haste and rage spells). \n\nBut I don’t particularly like rushing bases, although i know alot of folks used to rush to th11 then max from there. I might consider YouTube strategic rushing if you really want to move on. Hope that helps!",
            "Loot is easy to get and won’t be easier at th10. My guess is you aren’t attacking very often and aren’t using the next button enough to find good targets with lots of loot. Focus on loot not trophies.",
            "Just attack more.  Dragoms+Lightning Spells are an easy 3* on most TH9s.  If your queen is available, it's even easier as you can use a giant arrow to take out an anti-air or two.",
            "They start a new \"Mooching Thread\" every month, for the last 36 hours of Clan Games.",
            "Theres an optional update out now, try downloading it.  IDK if it will help your issue, but try it and let me know please.",
            "There are many options to 2 hit most districts.",
            "No. Jump Spells just give a troop the ability to jump.With the ability, they can jump up to 2 spaces.",
            "you freeze the water to cross it not jump",
            "Hi there!\r\n\r\nIt appears you have been shadowbanned by reddit.  This is an action taken by site admins and not the mods of this community.  No one except mods can view or reply to your messages unless they are manually approved by us.  You can read more about what shadowbanning is, and how to get your account unbanned on the [unofficial shadowban subreddit](https://www.reddit.com/r/ShadowBan/).  Specifically, read the pinned posts as well as the guides in the sidebar (about section on mobile).  Many of those guides say its difficult but the process has gotten much easier since those were written so don't be discouraged. \r\n\r\nThis may be because you were found to be violating Reddit terms of service,  but it also sometimes is done as an error, often to new accounts. \r\n\r\nIf you believe you have done nothing wrong, you can contact the Reddit admins to [appeal the ban here.](https://www.reddit.com/appeal)",
            ">are they able to to take raid gold to their other clan?\n\nYes. They also use up some of the 50 attacks that your clan is limited to for Raid Weekend. Once all 50 attacks are used, no one else will be able to attack until next weekend.\n\nSetting your clan to \"Invite Only,\" at least during the weekend, is highly recommended to combat this.",
            "You are on the returning player rewards track right now.  Complete that first then the regular season rewards and gold pass will be available.  The gold pass finishes at the end of the month so I would wait to purchase the gold pass on July 1st.\n\nAlso you get bonus rewards if you purchase the gold pass on the supercell store instead of in the app.\n\n[https://store.supercell.com/](https://store.supercell.com/)",
            "Whenever you come back after inactivity, the game offers you another track to complete which is generally relatively easy to complete.\n\nAfter you complete the track, your get back to the season pass, but completely maxed out this time. At least that's what i remember from back 6 months ago.",
            "During raid weekends, it’s best to keep clan to invite only, or set a high entry requirement.  \nUnscrupulous people set up bots to enter unsuspecting clans and use up the 50 capital raids.  \nCheck your capital raid log for evidence.",
            "If you have idle Builders, then you should move to the next TH. Having idle Builders will hinder your progress more than anything else.\n\nAdditionally, it's not necessary to max everything in the Lab. Work on what you need for attacking, and then upgrade everything else when possible.",
            "There's a bug with the counter. Make sure you have you downloaded the optional updates.",
            "You must be signed up for the Tournament and not just be in \"Fake Legends.\" Additionally, the shield must have been purchased before the League Day ended.\n\n[Legend League Shields](https://support.supercell.com/clash-of-clans/en/articles/legend-league-shields.html)",
            "There's only one voucher, which is linked above.",
            "Upgrading the Spell Storage, in Wizard Valley, increases the amount of spell capacity you have. The maximum spell capacity is 7:\n\n[https://clashofclans.fandom.com/wiki/Spell_Storage](https://clashofclans.fandom.com/wiki/Spell_Storage)\n\nThe most Heal Spells you can carry into an attack is 2, leaving you with 1 spell capacity for a Lightning or Jump Spell.",
            "The Wild West Champion shows up for me. Are you sure you haven't already purchased it?\n\nhttps://preview.redd.it/knebqbujbz7d1.jpeg?width=796&format=pjpg&auto=webp&s=dff6e0611d1a1c713edd643788578d0aad3b655d",
            "From what I’ve seen, they don’t offer for $ sale things you can’t use.  Thus as a th12, you are not offered the RC skin in the money shop.",
            "It can only be changed through support, and as I understand it, it can only be changed once.",
            "The building will advance an extra hour if the apprentice works with the builder.\n\n\nI have lvl 2 and mainly use the apprentice to get the end time a little earlier before going to bed.",
            "Say if the building has 2 hours left and you put the level one apprentice then it would be completed in that hour",
            "War is a team effort.   You should coordinate a strategy with your clan to maximize the chance of winning.  \nTry to find attack the hardest base that you can 3 star as that is likely the most strategic option.   \nThis usually means attack a base at the same townhall, or just one step below.  \n\nAttacking too hard a base and fail would mean a clan mate would have to clean up after you.   \nAttacking too easy a base might rob a weaker clan mate their chance to contribute to the war.",
            "Sceneries don't remove your obstacles. Be aware, however, that the War Arena Scenery is for your war base, not your main village.",
            "I can answer your third question: It's chain targeted, so like an Electro Dragon. It can hit up to 5 troops as single target, but unlike e dragon damage the healing doesn't get consecutively weaker from chaining to new troops",
            "Before they reworked Builder Base last year, people used to have all those structures at BH5. With the rework, they moved them to BH6 but allowed those who already had them unlocked to keep them.",
            "Rushing to TH6 for Clan Games and the Clan Capital would be extremely beneficial. The rewards will allow you to procure the 4th and 5th Builders quicker.",
            "why? because there are offers in the shop for more medals",
            "I think I am dealing with the same thing. Every time I try to log in, the game crashes or closes. Same for several of my friends and clanmates. I'm on Android and PC.",
            "Nice effort on the post.  \nIMO, the post is too long, and many would not read past the first paragraph.   \nMaybe break your post up.  Present 1 or 2 suggestions at a time.",
            "its good for more advanced attack strategies but not something youd bring without a plan for",
            "It’s  solid option, but currently a lot of other spells are much better than it.",
            "In just one attack I did a total of 100% and I did cross check and after that I did complete another 100% and it didn't move and is it a bug.",
            "https://preview.redd.it/rufm1vmjpq7d1.png?width=1080&format=pjpg&auto=webp&s=894ae457de1b9e2fea1ee6d3105a020f271d765c\n\nHere is the Attack",
            "Then it's a streak event right and if we didn't complete it by the time we have given.Then the streak is going to break and we are supposed to start from the beginning ri8 or we need to use the gems.",
            "Hopefully Or else I need to start from the initial position or I need to gem that.",
            "is there any update if it’s fixed now? cause i dont want to waste my gem restarting the event only for it to not work lol",
            "There’s an offer to buy for 2.99$ in the CoC store",
            "That's good to know. Hopefully they fix it soon.",
            "Yes exactly",
            "Thought so, thank you",
            "Ok thanks",
            "Ok thanks ill do builder base more.",
            "Omg. I think this isn't a new bug? Last event like this also had some bugs",
            "I’m not rushing but I’ll DEFINITELY give this a read",
            "alright ty",
            "That's the thing... They did stop and haven't been spawning for weeks.\nOther obstacles spawn normally.\n\nI'm not wasting any time. As a user that has played for 10+ years and that has spent a fair amount of money on the game I think I have the right to contact support once in my life.\n\nThat still doesn't answer my question.",
            "I just realised, that with th11 I can't even max him anyways, so I upgraded him as high as I could. Thank you",
            "Thank you so much.",
            "Thx for the quick response!!",
            "saving up gems for apprentice builder and i guess rocket spear can be helpful sniping single inferno for wars. seen many bases with boxed single infernos.",
            "ok ok, thanks for the answer",
            "They changed it!!",
            "I mean they reduced costs and time so I just think it made sense",
            "They did it lol",
            ">Even the recent surplus of decorations through events seems to be forcing this issue.\n\nDecorations, such as statues, don't count toward the limit. Only Special Obstacles, such as Christmas Trees, and Regular Obstacles, such as rocks and trees, count toward the limit.",
            "Thanks. I figured. Purchased.",
            "TBF both can be run in actual army's together but both are support/clean up",
            "Its proving very hard lol apparently I need my old game tag which I have no idea what is 😭",
            "Yea they're useless. They just keep telling me nothing can be done on their end",
            "This, but if the infernos are single go after wizard towers instead.\n\nThough honestly, pretty much any attack is OP at TH10, if you have a siege and full CC.",
            "my troops are all max for th12 and e drags are max for th 13 heroes: king-55, archer queen 65, warden 35, rc-10",
            "LOL I meant with gold n elixir because i have too much",
            "Thank youu",
            "All active vouchers are usually posted at the top of the weekly questions thread. I don't see it here, u/HS007 pinned it in last week's thread, can we pin it here as well?",
            "Alright, thanks for the answer lad.",
            "This! plus Army Camps don't grow, only need to upgrade troops/spells   firepower.",
            "Thanks",
            "Ty!",
            "damn that's unfortunate, just a couple days late I guess\n\nthe instant upgrades are honestly way more valuable to me personally and taking away one of the two books of everything sucks...\n\nthanks for letting me know\n\nEdit: apparently in the supercell online it's still listed as the rewards for the old pack. Has anyone tested if it would actually give you the old rewards or just the new rewards listed in game yet?",
            "Thanks this is exactly what I needed",
            "Yeah that's what I figured. I already have gold coming in faster than I can spend it so it feels kind of unnecessary and might spoil the early sense of progression. Do you agree that the builder pack is worth it though?",
            "Ohh thanks. I thought so too but I'm glad you cleared it up. This is very helpful to know.",
            "Yeah just like he said, but right now it’s bugged",
            "Appreciate it! Is there any early game unit that is really stronger/good in the mid to long term? Like some must have for TH6-10",
            "Thanks bud ! 😁",
            "Preciate u been looking everywhere for an answer lol",
            "They were. Wall 15 went from 5 to 4M, Wall 16 went from 8 to 6M.",
            "Will it come back in an event? or is gems my only resort",
            "If a season ends, do the books of the pass stack? Or do I just get the gems?",
            "Yeah that one",
            "I don’t have enough room in storage for all of the glowy ore. I want to make sure it doesn’t overflow and waste glowy",
            "Hello bro, ihave been facing really severe bug/glitch that is login screan or account change tab or connected supercell tab which swipes from leftside when we click is not loading(but if i click randomly the functions working as i thought its not loading the UI i have to click base on diffrent phones 😑) please help me caz i reinstalled still not working my mobile samsang J7 on next working fine till last june 17th update please some one help me",
            "I forgot to exchange half of the medals in the Haaland event so I thought I would exchange it early now so I don't forget.",
            "Thank you. That kinda sucks but it’s my fault so oh well",
            "Wow ok didn't know there were people who took this game that seriously thnx",
            "Thanks man but I've upgraded everything else. Just waiting for the upgrade to TH10 to finish.\n\nAre there building upgrades in TH10 that take 2+ days?",
            "Just 3 stared someone and still didn’t work 🫠",
            "It's updated",
            "They are working on a fix:\n\n>We're aware of the issue and currently work on a fix!\n\n[https://x.com/ClashofClans/status/1804069500607664571?t=tZIGa6Gj_aD9EC35_ELGBA&s=19](https://x.com/ClashofClans/status/1804069500607664571?t=tZIGa6Gj_aD9EC35_ELGBA&s=19)",
            "![gif](giphy|26AHLspJScv2J6P0k|downsized)",
            "tried it but barely got 40%,best i got was 67% with drags and slammer with balloons",
            "Thank you!",
            "This is not good advice.\n\nThe difference in loot bonuses are negligible in the ranks a TH9 can realistically farm in.  Crystal III (which is sbsolutely stretching it for a TH9) still only gives 40k gold/elixir.\n\nFinding bases with 5-10x that loot that are easy 3*s with Zap Dragons only takes a few minutes of \"nexts\" at most in Silver and Gold.\n\nOP just needs to attack more.  Two in the morning, two in the evening should be more than enough to keep his upgrades rolling.  If not, then two at lunch.   Collectors ain't gonna really matter because if he can pop on to collect, he should be able to get two hits in for way more loot than he can get feom mines/collectors.",
            "tried to install and uninstall it. either still not working or that update not out in my country yet. will update when that bug is fixed.",
            "OK, guess thats what the freeze spell is for then. Does anyone actually use it to slow defences, or is it primarily for water crossing?",
            "thanks...changed to invite only",
            "Thanks. The only thing requiring builders rn is my barb king so the rest are all idle, and since everything I have left to upgrade only takes dark elixir I’m full on the other resources, so I had a feeling I should move up",
            "hadnt downloaded it ! thank you !",
            "All of this “information” would have been helpful before I bought it",
            "So will it be available one I hit th13",
            "Oh wow. Thanks !",
            "Oh right yeah gotcha, appreciate it",
            "I figured it would be something like that. Makes it a little irritating trying to get inspiration for base design though. Appreciate the response though, just wanted to make sure I wasn't being too stupid and missing something :)",
            "Bro, no way! 😭😂😅",
            "Xing fingers for a fix any minute!!",
            "Thanks for the feedback mate, I’ll try to get around to it this weekend!",
            "If I were to create a condensed post, only including the most necessary and probable to be agreed with/liked suggestions/points, which points would you say I should include?",
            "Have you tried again? Since mine did complete maybe there was a delay or a bug that was fixed?",
            "They haven't posted anything, nor is there a patch to download, so I would assume it hasn't been fixed yet.",
            "Do they usually put those in the supercell store?  My guess is it would be there now if it was going to be there.",
            "if you post some evidence we can forward that to the devs",
            "They don’t stop. It’s not bugged. You’ve clearly miscounted",
            "Really I have maxed walls so I can’t check can you link an image or something",
            "Thank you for clarifying that!",
            "If you know which clan you were in you can access your profile from there or any friends that were your friend in the game they can access your profile for the player tag.",
            "This base you QC the TH, then super hog the rest.  dont be afraid the the singles, that what freezes and skeles are fot.\n\nStart practicing QC and th13 will be a breeze",
            "I honestly forgot until I saw your ping. Thanks. Pinned back. \n\nAlso voucher links are usually kept updated on our [wiki page](https://www.reddit.com/r/ClashOfClans/wiki/clash_voucher_links) as well.",
            "army camps do have a th15 upgrade",
            "I bought the first two builder packs.  Didn't do the third one, though.  \"Worth\" is a pretty personal thing, though.",
            "the balloon at th6 and then dragon at th7 (plus lightning spell at th6(?) ) are really popular and strong. youll have to learn some more strategies and tips after th10 to keep getting 3 stars. when you unlock heroes, do your best to upgrade them all the way since they get really strong as well.",
            "You are correct, I completely missed that when checking!\n\nI edited my post.",
            "Thank you thought I was losing the plot, my 15-16 upgrade cost just fell from 8-6 wall rings and then was paying around 6m with cost reductions to now paying 4.4m",
            "No equipment has returned via event. Currently, the only option, if you didn't acquire the equipment from its original event, is by purchasing it from the Trader for 1500 gems.",
            "Magic Items from the Silver/Gold Pass do not stack but will be sold for a small amount of gems if not claimed.",
            "I used one yesterday at 8pm and in the morning wasn’t active",
            "And you can’t spend it now why?",
            "Have you downloaded the optional updates? There have been a couple of small updates that have corrected several of the bugs.",
            "I think inferno towers take awhile. I might use it on army camps or infernos.",
            "You have builders sitting idle while you upgrade your town hall?\n\nIf so, use the book.  It's curently worth 4-5x the upgrade time of your toen hall as you'll get that idle time back.  Even 16 hours later (at the time of my post),it's still incredible value as I don't think there is anything that's 5+ days long in TH10 with the gold pass.",
            "They are working on a fix:\n\n>We're aware of the issue and currently work on a fix!\n\n[https://x.com/ClashofClans/status/1804069500607664571?t=tZIGa6Gj_aD9EC35_ELGBA&s=19](https://x.com/ClashofClans/status/1804069500607664571?t=tZIGa6Gj_aD9EC35_ELGBA&s=19)",
            "Just found a temporal solution: do an attack between 60 and 70 percent (I had to surrender to get that percentage but it worked).",
            "I rarely see it used for anything except to slow defenses.",
            "ive never used it to cross water, but use it all the time on defenses. id much rather go the long way around and slow a defense or just use air troops",
            "I have NEVER used it for crossing water. just bring all super miners and 3 freeze and freeze as many defences you can. primary splash damages. and just unleash all miners in one spot 📍 \nthank me later. you will 2 shit every district and 3 star the capital",
            "Not exactly sure if you have to get the RC as well.  But yes, it should be offered to you, assuming the timer hasn’t expired.  \n9 days left.",
            "Looks like there is one for Kindle. No change here yet unfortunately",
            "Oh really \nWell I need to check and if it's fixed it's all good or else I need to start over and some of my clan mates have the same issue .",
            "It's really a bug and mine isn't fixed and I did complete the attack with 70% and it didn't move.",
            "Honestly idk if it’s like that completely but it feels like it cause whenever I do an attack using the boosts it doesn’t seem like the level 1 (original level boosted to level 25 with th boost) RC does the damage it’s supposed to at level 25",
            "How have I miscounted if I say specifically that the obstacles keep spawning in my village... Just not the 3x3 trees. It's been like that for over 1 and 1/2 months.",
            "See\n\nhttps://preview.redd.it/yhxgzyd6uk7d1.jpeg?width=2340&format=pjpg&auto=webp&s=dc1759165eb2433c3368f092b97f6ea7645edfc3",
            "Its been years :( i was in a clan called tigers but I've been through them all and there is noone I recognise in them. I use to play with a guy called Androslav who I think would remember me but I couldn't find him either lol",
            "ight thx bro",
            "Awesome, thank you!",
            "I stand corrected..  thanks!",
            "Thank you very much! When you say Balloon at TH6, don't you mean Barracks Level 6? Cause it looks like I can get Balloons at TH4 just by upgrading Barracks from level 5 to 6.",
            "Okay thank you. What should i upgrade while i’m saving for the gems? Or just save all my ores for the gauntlet when i get it? I’ve been upgrading seeking shield at the moment but not sure that’s the right move",
            "I don’t have shiny ore.",
            "just reinstalled too not fixed 😢 i used my mom phone to click buttons randomly it worked but i cant check the add accounts as i cant see user interface",
            "Appreciate that man! I decided to save the book of building.",
            "it doesn't affect equipment, is it because your equipment is low level?",
            "Oh right I didn’t realise you meant just the 3x3 man.\n\nJust make sure your base layout has lots of open spaces to make the tree spawning more likely",
            "Those were showing up as 8? I think I misinterpreted the original post I assumed you meant like a wall discounted at gold pass price going from 8 to 6 million still costing 8 that wall should’ve always costed 6 odd",
            "yep, my bad. balloon at th4, lightning at th5, dragon at th7",
            "Itzu has a great guide to help plan which equipment to work toward for each hero [HERE](https://youtu.be/sCbtzzXrlLA?feature=shared).\n\nFor equipment you haven't unlocked yet, your heroes initial equipment will work fine.",
            "Not even for a couple levels just to burn off the glowy?",
            "There are several bugs from the update, which the devs are working on. You will need to give it some time. Hopefully, they will get it fixed soon.",
            "No I know it doesn’t effect the equipment but just normal damage it doesn’t seem like it does the max damage it’s supposed to",
            "Nope. I’d have to gem some shiny ore, which I’d rather not do, hence the original question",
            "simple enough to test really.  sacrifice a layout and toss an eagle unprotected in the corner.  add up dps and time until it dies, see if the math checks out.  \n\nor any other higher HP building you can get a hero too that makes it simpler to count",
            "I’m not 100% but I’m pretty sure the track closes and it’s just the shop that stays open.",
            "I’ll see and get back to you",
            "Okay so I did that apparently a level 25 with a boost rc destroys it with 9 hits and a level 21 rc without boost destroys it also with 9 hits but for the last hit the hp is much lesser than the one of the 25 with boost rc I also tested it with a level 10 rc and it took 10 hits"
        ]
    },
    "They are fixing the streak issue": {
        "title": "They are fixing the streak issue",
        "score": 182,
        "url": "https://i.redd.it/gnmaaic53w7d1.png",
        "content": "Thank god I haven't did today's streak attack yet",
        "num_comments": 84,
        "comments": [
            "**Check the app stores for optional updates.**  Many users are reporting downloading that catches them back up on the streak event. \n\n[Clan Games Rewards announced here](https://www.reddit.com/r/ClashOfClans/comments/1dkys42/clan_games_rewards_june_2024/)",
            "I couldn't get the second task done until an hour before the time was up, now I can't get the third task completed.![gif](emote|free_emotes_pack|facepalm)",
            "Third task is not registering also...",
            "![gif](giphy|FoH28ucxZFJZu)",
            "Interestingly, didn’t have the issue until the third day",
            "too bad my streak ended and I have to start over.... this is so dumb.",
            "Will my streak be reverted to the second task bcz i've lost it due to this issue",
            "Issue with the third day now..what a disaster. You’d think they fixed it from the original streak event chaos",
            "They need to give rewards to the people who have experienced the bug issue. I mean the streak reward",
            "https://preview.redd.it/c5ngxnfthx7d1.jpeg?width=1170&format=pjpg&auto=webp&s=bd1f18fa5f206eab2e6975e667977a48578407e8\n\nMe waiting for them to fix the issue",
            "I have two accounts both on task 2.  I got over 60% 2 star and it counted on the first account.  On the other account, I got a 3 star twice and neither counted.",
            "Day 2 is fixed.  Day 3 is NOT.  Will not progress after two 3-star attacks.",
            "Is there a bug or something with Supercell ID switch? I click it but nothing shows up, click randomly and instantly switch.\nAlso, 3rd streak at 75% isn't working? Again? ",
            "When? I STILL CANNOT CLEAR THE 3rd fucking day and I've gotten 7 fucking 3* since it started...",
            "Mine stopped working on 3rd day on only 1 account. 2 accounts managed to complete day 3 but 3rd account not working after getting 100% bunch of times.",
            "Thanks to this thread I installed the optional update.  I'm still getting the day 3 award on some accounts but not others, on the same device.\n\nFunnily, on one account where I had gotten 100% just before the 24h cooldown expired, I watched it expire and then award it to me instantly.\n\nEdit: I have noticed that the battle completion screen pops up much faster now, which is nice.",
            "This happened the last time too. They should just do a different event",
            "Having the same issue with day 3",
            "This is BS. It's been 13 hours since they posted it and now it's Saturday in Finland. Nothing is going to happen until Monday. Thanks Supercell! \n\nHas the new community manager showed up at all? Seems like Darian would have said something instead of just ignoring the community.",
            "Could we at least get some info of what the remedy will be ? will the event last longer ? should we pretend it's working and keep track of our own progress on all our accounts ? will they assume everyone completed \"days-until-fix\" ? will they restart the event from scratch ?\n\na modicum of communication, say from a Community Manager, would seem the bare minimum, in the absence of a fix. #playersarepeoplenotsheep",
            "Disappointed it took them 24 hours to acknowledge it. No one from the team spent even a minute on Reddit yesterday?",
            "Mine worked after using 60 gems because the time ran out",
            "how did the goblin bulider work means which are the principle of that hoe did he select gems amount of any upgrade",
            "bruh who cares about the streak event,  fix the the sc id button ffs😭",
            "Nice to see that the expanded dev team can resolve issues quicker now 🤣",
            "Imagine if early access made it into clash of clans",
            "I’m having this issue and have tried several different avenues for completion and nothing has worked. Here’s a list.\n\n1. Went into airplane mode and back to data\n\n2. Turned my phone off and back on\n\n3. Force closed and reopened my clash of clans app\n\n4. Completed a raid to varying degrees of completion, 75%, 79%, 90%, 100%\n\n5. Cleared existing armies, built new army and attacked\n\n6. Didn’t skip and attacked first base that populated\n\n7. Didn’t use heroes at all\n\n8. Didn’t deploy a siege machine\n\n9. Tried on data and WIFI",
            "Last event i had the same issue and i had to use gems to keep up my streak.... Supercell needs to give compensation for this shit.",
            "I have 4 accounts on one device and 2 accounts are stuck, and 2 accounts are all ok. Last time there were also problems with this event, why didn't they learn anything from before? Very strange.",
            "Couldn't do my day 3...hope i don't lose my streak because of it...i cant be spending gems, not like i have any left after getting the apprentice .",
            "Mines worked out so far. No issues with any of three days.",
            "How about fixing the login issue!? I can't log in with my supercell ID.\n\n  \nPlayed the stupid tutorial like a dozen times now.",
            "Now fix day 3 please Supercell. While you’re at it why don’t you fix the rest of the days too so we don’t have this frustration on days 4, 5, 6 and 7?",
            "Is this fixed yet, I still can’t get it to register and missed a full day",
            "Too late I need to restart from the first one.",
            "Mine is the 3rd 🥹",
            "FREE LEVEL 8 APPRENTICE BUILDER AS COMPENSATION",
            "Remove the streak event for god please",
            "i cannot finish the 3rd streak, what is wrong, i already manage to get exactly 75%, still nothing",
            "Still not fixed![gif](emote|free_emotes_pack|rage)",
            ".....why they have to launch an event if it's bugged asf 😐 am stuck on the 3rd on I did everything cancelling a attack at 75%  doing the full 3 stars and I have 1 hour left so fuck it 3k shiny ore ain't worth me raging!",
            "Just happened to me twice on 1 account on challenge 3 and worked on another",
            "I'm stuck on task 4",
            "I have the same issue for the 4th day. I did three attacks with other 85% and still no completion",
            "Day 4 problems here (only a single attack so far but it was 100% and didn't count).  First 3 days went fine.",
            "3x 3 stars and 1x 98% and still not completing...",
            "It’s still broken",
            "i'd rather it be removed from the game.",
            "Is this issue region specific? cause i don't have any problem\n\nhttps://preview.redd.it/wknpeza85x7d1.jpeg?width=4032&format=pjpg&auto=webp&s=4813a26f3c3cfc82854c5b6a477fbacc3b51decd",
            "[deleted]",
            "I'm pretty sure the cause of this bug is the daily unlock timer is out of sync with what you see.  On your side, you see day 3 as unlocked but the game doesn't actually think it is unlocked it until sometime later.  In the last streak event there was this same bug and you could actually see the messed up timers.  Some were more than 24 hours and it wouldn't count your battle unless the timer was < 24 hours.\n\nMy day 2 wasn't counting my battles until about 1 hour before it was to expire.  Now my day 3 is broken.  I'm betting it will work at the same time tomorrow, about 1 hour from when the daily timer expires.",
            "Same",
            "same",
            "Same here. The first 2 registered with no issues",
            "I did an attack an hour or so ago and 3rd day worked for me, same with 2nd day. Not sure why and I'm too scared to jinx it.",
            "Same, I have 4 accounts and all were fine up till today, also 2 so far have worked for the 3rd... MEANWHILE, I ALSO had one that WAS on the second (I didn't do any attacks for over 24h earlier (day1) and when I swapped to the account... It popped up and gave me the reward despite having done no attack for it....\n\nSupercell may be completely fucking incompetent... But at least they are consistent about it.",
            "Of course not! At least that is exactly what happend to be the last time we had this event. Like we literally have this exact same bug, again LMAO",
            "the audacity to ask for gems for a streak lost is insane",
            "Update:  I ended up with 13 wins ranging from a 60% 1 star to a 64% 2 star to multiple 3 stars.  None of them counted for the streak event.",
            "You can't log in or switch accounts. I've been locked out of my account on my tablet for a few days now. Playing on my small phone is terrible.",
            "Was a holiday in Finland, midsummer.  I guess its a Nordic thing to take that more seriously and not work. \n\nAlso, did you by chance receive a newsletter about the sub here?",
            "Bro, a bug like this won't be fixed with any alternative you can come up with 😂🤣😂",
            "I’m not using gems for that shit. If I complete it then I complete it but I’m not wasting money on a dumbass event they don’t want to fix",
            "No, it wasn't fixed as of around 20 minutes ago.",
            "don't worry, you will.",
            "tried and nope.",
            "That could be it I haven't had issues but I skipped the first timer with gems.",
            "I can 100% confirm this is not the case.\n\nI have 4 accounts, I attacked in a specific order yesterday, and the timers in my attack log/the wait time for my star bonus on my accounts reflect that..\n\nMy 1st and 3rd accounts to collect/start the event progress have completed the 3rd day... my 2nd account has 17 hours left and I HAVE GOTTEN 7 3 stars.\n\nI already installed the update, didn't help.\n\nI already tried only attacking the VERY FIRST search... Didn't help...\n\nThis is just straight up F broken because the Developers are incompetent and didn't even try to fix it... THIS IS THE SAME BUG FROM LAST TIME.",
            "the audacity to be an asshole.\n\nOPs asking for his streak to be reverted since because a literal bug preventing them from advancing, its not a matter of OP's fault, but the game.",
            "I used to think so, but I click in areas where my account login was, and then suddenly it switched.",
            "Ah that makes sense, thanks for that info. I did receive a newsletter, was that in there and I’m dumb for missing it? 😁",
            "Hey you never know. The first 2 worked just fine for me, and like any part of troubleshooting, it helps to eliminate variables 🤷🏽‍♂️",
            "https://preview.redd.it/n1bhg38tw18d1.jpeg?width=3024&format=pjpg&auto=webp&s=ab46df8c17e874cfac49151ef844f3549e279629\n\n3rd cleared. No problem for me",
            "So far so good for me",
            "Yeah I think when you gemmed the first timer, it sets the timer to correctly sync with what you see. I might do this when my next timer gets down to costing 1 gem because this is getting ridiculous and I'm not waiting for Supercell to \"fix\" this. (Spoiler: It's not getting fixed)",
            "What I am saying is that 17 hours counter that you’re seeing is not what the game server is actually using.  What you see (17 hours) is not in sync with the game server, which probably thinks you haven’t even unlocked the next day.  It’s the same thing that happened last streak event, except you could see the messed up timers.  Some people had over 1+ day timers.",
            "I think you misread this guys comment, I think he meant that it is SUPERCELL being fucking audacious EXPECTING THE CONSUMER TO PAY FOR THEIR FUCKING MISTAKES...\n\nWell they are just proving/reinforcing that they really are greedy sub-human garbage with no integrity when they DON'T compensate us... Yet again.",
            "No nothin special in the newsletter.  admins said it would go out to \"a few thousand core members\" and I'm just curious who all we shouted out would have actually seen it.",
            "not sure they care enough to work on it over the week end... maybe you'll get streakovid monday ? ;-p\n\nI got it at step 3 on several accounts that didn't get it at step 2, I'm guessing step 4 has it too.",
            "So.... What your saying is that those incompetent developers actually made it MORE broken instead of fixing it? At least the timer was accurate before..",
            "oh my bad man, I read it wrong.",
            "I saw it and I think it’s pretty cool, hopefully it isn’t too much work to create."
        ]
    },
    "After 5 seconds of hard work he's off for a 23 hour nap": {
        "title": "After 5 seconds of hard work he's off for a 23 hour nap",
        "score": 1633,
        "url": "https://v.redd.it/s88n4ab9c08d1",
        "content": "",
        "num_comments": 73,
        "comments": [
            "When people say we don't need the Apprentice Builder, this is the post I'll reference to say why it's required to have.",
            "Mental health day",
            "Most relatable character",
            "galway city county council",
            "I just did this with a level 1 cannon as I upgraded my town hall thinking I’d get my apprentice back and learned the hard way that I had to wait 24 hours lol.",
            "Honestly. Apprentice builder was a waste of my money. I didn’t have enough gems to get him so I bought him for $3. Really wish I could get that $3 back even though I don’t even need that $3",
            "Stop exposing me at work",
            "I use him on obstacles to get his face off my townhall. I’m townhall 16 and only have walls left so I don’t need him for buildings atm",
            "This makes me appreciate the normal builders more. Never in my life have I seen such a lousy apprentice!",
            "I did this too. 🤣😂🤣",
            "Me while studying for exams (exams are tomorrow)",
            "Such a pathetic apprentice",
            "they need to get rid of so called cool down.",
            "Our co-leader did the same and he was pissed lmao",
            "Average construction worker:",
            "I'd love to raid your base l'm running low on resources",
            "Dint know he need to sleep",
            "City construction workers be like",
            "He's like the Gen Z",
            "500 gems for shit\n\nFor shit\n\n![gif](giphy|YRPBhd3vscg5Fxx1DQ|downsized)",
            "He’s manning the village. What’s not to ❤️?",
            "Now you know",
            "i trained pekkas to keep that MF away from my gems (![img](emote|t5_2usfk|50980)) but now i'm training pekkas to keep this MF from my hard earned gems",
            "That’s a complete joke",
            "Kids these days...",
            "He's not worth it. \nIf you're almost maxed then I can't see what he would do for me?\nI'm not going to get Aprentice Builder because of that.\nIf I was a lower TH and in a hurry, then yes.",
            "He must be Gen Z /s",
            "Did you use it to take the gems out?\nIt’s known if you use it for something shorter than the one hour. You will loose the rest of the time. \n\nSo use it only on building that have one hour or 8 hrs left for a maxed apprentice builder.",
            "You really did that to impress people on Reddit is crazy..",
            "I am honoured!",
            "Supporting my greedy boi ❤️",
            "Golden comment",
            "HAHAHA",
            "Bahahahah, Spain without the s",
            "I upgraded mine level 6, and I managed to save 18hrs on my King, when you don't have the pass it's a welcome help. But the 1hrs work and 23 rest need some changes, they could have done things better",
            "He does make up for it after a while, I wouldn't call it a complete waste!",
            "I'm sorry ):",
            "Big braining it",
            "Haha yeah the normal builders are goated. Love those guys",
            "Great minds think alike",
            "You're welcome to, I'm getting sick of legends league I need loot and 8 attacks a day against th16s isn't enough 😭",
            "I respect it! Total chad",
            "I already knew haha",
            "I know, thanks haha. It was just a joke post",
            "That is the joke",
            "Yall stop down voting bro was just confused and I didn't know this .",
            "I sacrificed a whole 4 hours of upgrade time to make a joke. I didn't do it to impress anyone haha",
            "Sure, kid.",
            "Projecting at its finest. Sounds like ur in denial about ur true self. Lol",
            "Just stop my guy, and there’s still time to delete ur comment.",
            "U said that already. Is that all u got? 😂",
            "Yeah! If anything I appreciate his comment because he was just trying to help",
            "A joke for who? Reddit. otherwise you wouldn’t have posted it. So you did indeed do it to impress others",
            "[removed]",
            "Keep defending your boyfriend. I’m sure he appreciates it",
            "You wrote that comment in defense of your bf? Or what?",
            "You haven’t said anything WORTH saying something different.. soooo ????",
            "You sound like a fun person to hang out with",
            "Time to leave the conversation. No need to keep replying to people and it's going downhill, so going to ask you kindly just to leave the post.",
            "Sheesh, I would hate to wake up and be you. You’ve clearly got something personal going on but keep spitting responses that won’t fix you, keep it up we won’t stop laughing at you along the way big guy",
            "I wouldn’t want to hang around you anyways. So for you it doesn’t matter if I am or not.",
            "![gif](giphy|SqflD5OvHoWILB7qWm)",
            "🤣🤣🤣🤣 another person who thinks Reddit is REAL LIFE! I’d hate to be yall as well. I PROMISE. Soon as I click off this app. Shit that matters takes place. Keep acting like you’re so high and mighty cause of Reddit goofy",
            "Your entire reddit history is arguing with people. I think that's the crazy thing.. sad sad sad",
            "Can’t even entertain someone so small. Good luck swine you need it",
            "What else is Reddit for? To make friends? 🤣🤣🤣 yall so damn lame. You’ll say something else which will inevitably be a lie",
            "You tripping",
            "Yall trippin for taking Reddit so serious.. anyways Make my egg n cheese the OCKY way",
            "Huh???"
        ]
    },
    "Once in a lifetime opportunity": {
        "title": "Once in a lifetime opportunity",
        "score": 1994,
        "url": "https://i.redd.it/lyr2yqfcvz7d1.jpeg",
        "content": "",
        "num_comments": 53,
        "comments": [
            "With the streak event going it would be extra neat.",
            "Moisture",
            "Whenever ever I see things like this I always accidentally skip them",
            "High loot is correlated with abandoned bases, as full collectors give more rewards than gold/elixir storage.",
            "Then muscle memory kicks in and you press skip",
            "That's how you know the CoC gods blessed you",
            "Then you realized you forgot to train troops",
            "Then ur muscle memory will kick in & u will click next",
            "Until all of it is only in the storages and you only got sneaky’s🤣",
            "This happens all the time",
            "Holy shit dude. Right after being this post, I get an exact base like this. Inferno burnt and eagle smoking.",
            "When I was doing 10-15 attacks in a row this was my exact reaction 😭",
            "What's the 2nd pic",
            "Found one just like this yesterday 😁😁",
            "https://preview.redd.it/pkhn2mz3t28d1.jpeg?width=2796&format=pjpg&auto=webp&s=3df92608e45c06a0b7c7a73ab3c8cd12a543e3fd\n\nDelicious",
            "It feels like a dream![img](emote|t5_2usfk|9414)",
            "Someone would probably still fail to 3 star",
            "Can anyone explain how these defneces wore out!???",
            "https://preview.redd.it/bulxsgutc08d1.png?width=1080&format=pjpg&auto=webp&s=85ec7c55c67451c82e815daed21bff4f507e4de0",
            "What am I looking at?",
            "https://preview.redd.it/qs2bcix4l18d1.jpeg?width=2400&format=pjpg&auto=webp&s=14b31e8a1c002a27be42d194be550ad966ab5a53",
            "This will never happen… jk",
            "Hey Everyone I am in need of a clan. I am not very active but I always do my war attacks and cwl attacks. I am a almost max th12 and focus on war. I am a decent attacker with 1400+ war stars on my account. I also do my share of clan games. I prefer a clan with crystal 2 or above cwl league as my current clan is in crystal 1.",
            "*Extremely rushed*",
            "maybe if you the devs were competent enough to have ACTUALLY made the streak event work this time... NOPE and they expect us to fucking pay for it again when its broken.",
            "Fish",
            "I don't believe you",
            "You farm with only sneakies? I always bring 4 super WBs and 2 jumps so that I can get just about any storage",
            "Skill issue",
            "This",
            "How it's possible means without builder upgrading.",
            "X-Bow out of ammo",
            "https://preview.redd.it/glpr8ckqa28d1.jpeg?width=1334&format=pjpg&auto=webp&s=db11e35fc37da9cdb2c6679beefaa1a2121f5be2\n\nThis was before equipments",
            "CoC",
            "Starting off with I’m not very active was brave and foolish",
            "Bugs happen dude",
            "I don't even try with the events anymore, too much , too expensive, fuck it",
            "Maybe if you did a bit of research you wouldn’t look like a moron by being blatantly wrong",
            "I bring two jumps also but sometimes you still can’t get to deep storages especially DE. I don’t like bringing two super troops because that’s 50k DE every couple days.",
            "Probably",
            "Thats true, I am not active in the sene that i come attack and go. Apart from that I am a pretty good attacker, my war stars tells that story. I am mostly interested in war part of the game. For donations and etc I have my other accounts as well. So even if i am not that active it’s not a problem I guess.",
            "My guess is that people aren't mad that this is an annoying bug.\n\nThey're mad that there is an annoying bug that's the *exact same* one as last time.",
            "[removed]",
            "Damn dude is that guy your stepdad or smt?? His comment was pretty dumb but this comment was so harsh 😂",
            "Blatantly wrong about what?",
            "It's a tradition at this point.",
            "Yikes, didn’t know it happened last time too",
            "This dumbass acting like the devs killed his family😂. Chill bro, its just a game lmao",
            "Hello menoobslayer, **[your comment](https://www.reddit.com/r/ClashOfClans/comments/1dlffhl/-/l9p4hjk/) in /r/ClashofClans has been removed for the following reason(s):**\n\n>Rule 1: Follow Reddiquette. Keep it civil. You may argue about ideas, but personal attacks are prohibited. Hate speech of any kind will be removed and users banned.\n\nAbide by [Reddit's site-wide rules](https://www.redditinc.com/policies/content-policy) and [Reddiquette](https://www.reddit.com/wiki/reddiquette).\n\n\n\n---\n\nAny questions, [message the mods](https://www\\.reddit\\.com/message/compose?to=%2Fr%2FClashOfClans&subject=about my removed comment&message=I'm writing to you about the following comment: https://www.reddit.com/r/ClashOfClans/comments/1dlffhl/-/l9p4hjk/. %0D%0DMy issue is...).\n\n[subreddit rules](/r/ClashofClans/about/rules) | [reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette) | [reddit's rules](/rules) | [new to reddit?](/wiki/reddit101)",
            "Some people just don't get sarcasm",
            "Venting be like: you never get anything good out of it, just ppl saying chillax",
            "I think it’s just hard to tell online, I get into misunderstandings texting my boys so much more often than irl. God tier misunderstood sarcasm with that “I don’t believe you” tho, I changed my mind. You have my utmost respect",
            "Haha yeah no hard feelings, but that person has some anger issues lol"
        ]
    },
    "Having to always upgrade heroes has made clash boring": {
        "title": "Having to always upgrade heroes has made clash boring",
        "score": 178,
        "url": "https://www.reddit.com/r/ClashOfClans/comments/1dlskv1/having_to_always_upgrade_heroes_has_made_clash/",
        "content": "I haven´t played for almost two months now because having to constantly have my heroes upgrading and not being able to ever use them makes the game incredibly boring",
        "num_comments": 88,
        "comments": [
            "Same.\nI am bored of the game. Atleast 2 of my heroes are always upgrading. I want to use them and do actual 3 star attacks but I can't for months.",
            "At this point I only use hammers and books to upgrade 90% of the time",
            "Since TH14 I'm not waiting for heroes to be ready. I upgrade them with books and hammers and this way I don't need to opt out from cw.\n\nAlso, when I max everything and I'm ready to level up to another TH, usually my heroes are maxed so I'm not late with them.\n\nI know Book of heroes and Hammer of heros is not the most efficient way to spend those resources, but this way I don't need to wait for them.",
            "Not being able to use Heroes while upgrading is a stupid idea. They did because this is the biggest revenue generator for supercell",
            "It gets better once youre done with TH13. ",
            "Last two times i quit Clash of Clans it was because I couldn't use heroes, now i started playing again and i'm so close to quitting again",
            "For strong heros you need both ores and upgraded heros. The tricky part here is that war is a large source for ores (one of the very few sources). It's annoying that you are in a major disadvantage when upgrading your heros during war. Grinding for ores and grinding for hero levels are both major aspects of the game and are currently separated by war. Imo, now after the equipment update, SC should do something about the 2 separate grinds and bring them more together",
            "Just don't upgrade your heroes and buy pots with raid medals. \n\nUpgrade heroes for what?",
            "I'm in th14 almost max and I was done with the hero upgrading in 2 months(f2p) when i reached th14, i did all the GW upgrade with books and hammer",
            "I am about to max my Th14 (f2p) and I never felt this was a major issue. I mostly use books for warden and queen whereas I don't find much problem in keeping RC and King down sometimes.\n\nOn my Th12 account I put 2 of my heroes for upgrade constantly still I am able to 3 star 80% of the time after the massive nerf at TH12. I am able to do LaLo with just the Queen Charge without the Warden and the King.\n\nThis may seem like an absurd thought but actually putting 1 or 2 of your heroes down can push you to better strategize so that their absence isn't much of an issue.",
            "It will be worth it when they get maxed",
            "I feel you. I let my heroes get behind (they are maxed now) but it took 20 months to max then. I maxed my queen first and I wasn’t able to use her for 9 months to get her from lvl 45 to maxed.\n\nI was trying to upgrade them all at once but as a casual player it’s not possible to earn the resources to keep them all down at higher lvls.\nWarden was the second hero to max due to it being a different resource.",
            "I stopped playing after years. I max my heroes, they raise the level, they add new heroes, they add pets - all yours for the small price of thousands of dollars, or you could just wait....and wait....and wait....  \nIt is nothing more than a business model trying to get you to use real money. No thanks.",
            "I just don’t upgrade them anymore and they’ve been stuck at around th12.5 kind of levels even though my defenses are almost maxed hahaha. \nI’m still able to 3 star bases in Legends league because of the equipments so I just found upgrading them as almost useless.",
            "It looks like there’s an event coming up soon where they will be testing hero use while upgrading. Also with equipment you really don’t need to stress about hero level too much. I basically only level my heroes with books but their equipment is maxed and when I use hero potions it helps but not enough to make me put heroes down for months lol. Just play how you want to play you can enjoy the game without completely maxed hero’s as long as they’re not stupid far behind. In a real crunch I’ll use hero potions during cwl but like I said 10-15 levels behind but with maxed equipment and my attacking is pretty great I’m not gonna ruin my enjoyment for months for a slight edge",
            "I think they said on summer update you will be able to",
            "They should do that. If we upgrade our hero. But we can use hero in our battle also. \nIt'll be very helpful.",
            "I am still having fun with the game since I've got a maxed account, but I will say any and all motivation I had in grinding out some mini accounts (to get them maxed so I can play multiple th16s) is completely gone.\n\nThe introduction of the hero equipment basically made it nearly impossible for me to F2P 6 additional accounts (with my main having the gold pass/other purchases)",
            "I just don’t upgrade heroes after TH14 besides books from the pass/clan games. The dps increase is very minimal at high levels and equipment matters way more anyway. If you’re really desperate to triple in close wars, use a hero potion and get them all the way to max.\n\nFocus on winning wars to maximize ore income.",
            "I always max a hero first and then move on to the next hero this way I can use them in battles and wars.",
            "Ever since equipment upgrades heroes is like blowing on lava to cool it down,doesn’t do much",
            "Ok so don’t upgrade them?",
            "They need to balance the pressure to pay & use heroes by adding more interesting content without heroes: challenge, achievement,  raid weekend is a nice time if you enjoy breaking bases, and builder base.\n\n\nThe dream is heroes in war. I'd settle with heroes in Friendly Challenges.",
            "95 level heros are unnecessary\nThey should reduce levels",
            "CCPercell has made this game significantly worse.",
            "It is all about time we spend for upgrading.... Too long. It cost all your special moment of life for a game that its server will power off someday..... Numeric is our shadow. Always here even light is coming...  Like someday all the way doesn't matter.",
            "skill issue",
            "Skill issues.",
            "In my opinion its great, people constantly complaining that the game is too easy. Attacking with two heroes instead of four makes it more challenging.",
            "Let me ask you this, why do you have to upgrade heroes. I used all my 6 builders on buildings only. We go to war 2 times a week and I spend 300 raid tokens to get the hero potions. During the clan wars we need 7 so it's like 3 every week which is not so bad. I also use my training potion during this time and do lots of multiplayer battles. The rest of the time without hero potions I just use a spam army like gowitch or electro dragon to farm resources.",
            "War for a month and then upgrade all your heroes the next month, rinse and repeat.. thats how i do it",
            "I just recommend something what if each hero you upgrade will give you some few ores cause hero equipments are expanding at fast rate and epic equipments really cost alot of ores so that people will still engage to upgrade heroes anymore cause for me upgrading heroes are useless now since what the point it's because of few HP and DPS back in the days we're upgrading heroes because we also upgrade there abilities but now nuh uh it takes you really long ages just to upgrade a specific hero",
            "Then you might have started upgrading the wrong things. \n\nI've never been in your situation and I've been playing for quite some time. \n\nSometimes people don't think about what they should upgrade. \n\nIf you do it right then you'll never be in that situation. \n\nI don't get it why people say it's to hard, just play some more.\n\nStop whining about it and do something about it instead. \n\nEven f2p players can do it so they can attend in war, you need to change what you upgrade first.",
            "I heard that they're working for a solution which will make us able to use heroes for a specific time while they are upgrading. Similar to potion may be.",
            "this summer you will be able to use them whilst upgrading during a special event",
            "as a th14, you don't need all 4 heroes to 3* a base using super archer blimp and then hydra. Of course having heroes makes it easier and makes u able of hitting a wide variety of bases, but if you dont, just search for compact bases and you are fine",
            "Past 8days upgrade times sure, but before that it makes no sense",
            "This is why supercell is so adamant about having us use heroes while upgrading, and I am not giving up to their greed. \nI rather skip CWs and work on my heroes. Sure I will miss out on ores but at this point I just have to max the epics and I am anyway unable to use my heroes outside of CWL",
            "This ^. There's gotta be system in place",
            "If it’s their biggest revenue generator then it seems like it wasn’t that bad of an idea lol",
            "it WAS the biggest revenue generator. unless you can show me current numbers (which probably only SC has). but with all the monetization they brought since TH16 and still are planning, there's no way that heroes are still the biggest generator. now they only still have that system because they want even more money, and because they know the veteran players are used to it and even defending it.",
            "I can’t believe people buy book of heroes more then gold/event pass.\nI am already getting the passes and the occasional offer if I feel like it’s worth it, but with how annoying the grind for DE is, I would struggle to manage more then the monthly 2/3 book of heroes.\nMaybe there’s people that wanna have heroes available and only use books: they are going to spend thousands or finish the next century; I might underestimate stupidy",
            "Explain why? I'm at TH13. I see everlasting grind ahead.",
            "Except for the 25 lvls for the royal champ",
            "That's the literal point of any video games I don't know what you're surprised about?",
            "If they do that be ready tohave everyone complain that they wasted time upgrading theirs for nothing",
            "or reduce cost, upgrade times, and boh price.",
            "They already reduce the time and resources needed to get to level 95 which is a better way to go about it than taking away levels from people who already upgraded.",
            "This is so counterintuitive it isn't even a good joke",
            "So true, they doesn't have the basic knowledge.",
            "Exactly, putting down 1 or 2 heroes for upgrade can actually push you to better strategize and this way the game becomes more fun for me. \n\nOn my TH 12 account I rarely have more than 1 hero available for attack, still I am able to do 3 stars using LaLo with only the queen. With the King any kind of spam attack, even Super Giants spam gives 3 stars like 90% of the time.",
            "“if you do it right then you’ll never be in that situation” dawg I jus wanna attack w all my heros and not wait decades",
            "I heard a long time ago that they are planning to add a fifth hero to the game but you can still use any 4 of them for an attack. This can massively solve this problem since you can put down 2 of them and still have 3 available to attack.",
            "Don't bullshit bro. Heros are important in every TH.",
            "3 star without heroes definitely possible. Idk why downvotes",
            "Incorrect, I did just this as th14 and it quite literally is almost impossible against a decent th14, UNLESS you have warden, but since warden is basically a cheat code for every army you might as well could use any army at that point",
            "Yeah it does. Books only stack if bought, so if people are waiting until hero upgrades exceed 8 days before using them, they won’t be able to use the books from events or silver/gold pass. I’d rather be able to use all of my heroes constantly.",
            "Its the biggest revenue generator and the biggest revenue killer. I assume most players quit around th12/13 because the hero grind becomes intense around there.",
            "Defending it because it’s the bullshit they already had to deal with. Imagine how much of a gut punch it will be to Th16 vets when they finally change it.",
            "my clan leader never bought a pass and saved gems for boh.\n\nhe maxed his heroes and got 10k spare gems, so he is ready for the next th.",
            "Just stop upgrading them and only use the free 4-5 books per month.",
            "Those happen on th13",
            "a rounding error of idiots will be like that. vast majority will just be happy for the newer players and glad that any future levels wont be as much of a hassle",
            "You already have one above",
            "This will just come with time at the lower town halls",
            "You only NEED heros in Wars, other than that you WANT them ...\n\nIf you think it's boring, u r just suck at playing ...",
            "Do it, just don't upgrade them wait for events to stack books and hammers and upgrade them with that, just don't stack heroes lvls through various town Halls or you'll never have them in proper level",
            "Well how you play is up to you. \n\nI buy what I think I need and it has worked for me all the time I've been playing COC.\n\nEarlier I didn't mind using 3 of 4 Heroes, but in Legend League it's not doable if you want a good result. \n\nSo I saved up a lot of Books and got my Heroes finished. \n\nIf you plan ahead then it's not that much of a problem 1 Hero is upgrading. \n\nBut in War and CWL I wouldn't go without all 4.\n\nBut that's me, how other plays it's their business.",
            "i truly wish people on reddit had the ability to read",
            "ikr i feel like th14 is way easier than th13",
            "Im nearly done on th13. The pain ![img](emote|t5_2usfk|9423)",
            "Can confirm I rarely play after th13 coz of long boring heroes upgrade and clan leader kicking you out on attacking without heroes.",
            "I'm TH16 myself and that's a shitty attitude. besides, upgrade times for heroes (and anything else) will always be the highest for us, so we benefit the most when they finally let us use heroes while upgrading.",
            "Free books where?",
            "Ok so how do I learn good skillful strategies like qc lalo without archer queen then? You don't need heress to attack but the skill ceiling with heroes is very high and not having access to that would very much restrict you from improvements",
            "How can you save up books if there’s a maximum of one book of hero’s at a time?",
            "I wish you could explain yourself right instead of making my reading ability wrong. What do you mean read what's so encryptic in your comment that I can't comprehend.",
            "They clearly can , hence the downvotes",
            "Regretful that you interpret that as a shitty attitude. In my opinion it’s just common sense. No logical reason to defend the current situation besides a lack of personal benefit.\n\nIf you still have a good amount of hero upgrades to do then of course it will benefit you greatly.\n\n\nEdit: Did you really just hop on your alt accounts and downvote me and upvote yourself within the same 60 seconds of commenting? lol",
            "One from Pass, usually one or two from events, 2-3 from gem trader.",
            "You learn sneaky goblin while your heros are being upgrading u dumbo ...",
            "man, he said he can't 3* for months, im just giving him some advice, im not bullshitting",
            "Oh wow someone disagrees with me and I’m getting downvoted and they’re getting upvoted! Maybe it’s because people agree with them? Naaah I’m always right, they must be using alts.",
            "No people just disagree with you, there's isn't a big plot its just that you got shitty opinions",
            "There's a difference between bases you could 3 star WITHOUT heroes and bases 3 starred WITH heroes \n\ntry reading and comprehending what OP said first, before tutoring whole reddit genius",
            "Genuinely couldn’t care less about being “right”. What I’m saying makes sense. Unless you’re a financial benefactor to people buying books of heros, why else would you defend it?\n\nQuirky response from you, truly. Although when there’s 3 downvotes and the person has 3 upvotes less than 60 seconds after they commented, it’s fishy.\n\nAnything else peanut gallery?",
            "I would just like to point out that I am downvoting you and am NOT part of his peanut gallery",
            "More than 2 people online at the same time? It can’t be"
        ]
    }
}