{
    "r/BlackOps6 is now open, for all discussion about this year Call of Duty game": {
        "title": "r/BlackOps6 is now open, for all discussion about this year Call of Duty game",
        "score": 7,
        "url": "https://www.reddit.com/r/blackops6/",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Warzone Season 4 New Patch Notes (June 11th, 2024)": {
        "title": "Warzone Season 4 New Patch Notes (June 11th, 2024)",
        "score": 77,
        "url": "https://www.callofduty.com/patchnotes/2024/05/call-of-duty-mwiii-warzone-season-4-patch-notes",
        "content": "",
        "num_comments": 186,
        "comments": [
            "What about fixing Find A Party?",
            "Wait a second... They nerfed the crossbow? Are they actually serious?",
            "# GAMEPLAY\n\n* Removed Thermobaric Grenades from Gulag loadouts. \n\n# WEAPONS \n\n**» Battle Rifles «**\n\n* **Sidewinder**\n   * **JAK Thunder LMG Kit**\n      * Reverted an unintentional removal of the ramping rate of fire property.\n      * Increased initial rate of fire to 555rpm, up from 375rpm.\n      * Decreased ramped rate of fire to 780rpm, down from 857rpm.\n      * Decreased shots required to reach ramped rate of fire to 9, down from 15.\n      * Increased delay before ramped rate of fire begins to decay to 350ms, up from 250ms.\n\n**» SMGs «**\n\n* **AMR9**\n   * **JAK Atlas Conversion Kit**\n      * Fixed an issue causing more damage than intended to be dealt when bullets hit the helmet area of an Operator’s head.\n\n**» Marksman Rifle «**\n\n* **Crossbow**\n   * **Blastcap 20\" Bolts**\n      * Stuck damage decreased to 110, down from 200.\n      * Inner damage decreased to 110, down from 150.\n      * Outer damage decreased to 35, down from 50.\n\n# BUG FIXES\n\n* Fixed an issue allowing players to use the Biometic Scanner multiple times to manipulate the keycard they receive. \n* Fixed an issue preventing players from controlling the train on Urzikstan after it is hit by a Bunker Buster. \n* Fixed an issue causing a weapon to be displayed with unintended statistics or visual properties in the Gunsmith when deselecting a Conversion Kit.\n* Fixed an issue causing players to be kicked back to the menu while viewing Event Camos.",
            "And find a party still doesn't work lol",
            "So they killed the crossbow again then? I knew they would because they hate fun. That means only a down to neck and head I think.",
            "Thank god they nerfed the crossbow. Now I can continue to never die to it and constantly get one tapped by the Kar98 instead",
            "Karzone",
            "I couldn't apply plates earlier.  Hope this bug isn't back again.",
            "STILL NO FIND A PARTY FIX, ARE YOU FUCKING KIDDING ME ? ",
            "But why ? \n\nThe crossbow requires skill in most cases and can quickly become very punitive if one misses a shot \n\nI don’t think this nerf is justified",
            ">Crossbow nerf\n\n>No Kar98k nerf\n\nJesus Christ",
            "Unless they fix the find a party feature I don't really care because I'm not playing.",
            "They nerfed the crossbow what the fuck\n\nI still think Raven is decent but jesus Christ. Raven has no fucking clue how to balance guns, even SHG's does it better. They had to do more work too yet are going through all MWII guns too.",
            "They didn't even mention the find party feature being broken",
            "Crossbow nerf was unnecessary.\n\nAlso, buff the Kar98 to 100m.",
            "I was having fun with the crossbow(didn't know it got buffed, just was feeling nostalgic cause I used to run crossbow in WZ1 all the time), and I jump into a game and realize it's not one-shotting but thought it was enemies having EOD. Why would they nerf the crossbow man :/",
            "![gif](giphy|4c08skdkNmtoMZIypI|downsized)\n\nRIP KING",
            "Weird how no one hates the XRK because its:\n\nA) An actual sniper rifle, meaning it handles like a sniper rifle in exchange for dealing sniper class damage\n\nB) Doesn't have such ridiculous aim assist that 6 year olds are peeling wigs off with it. \n\nMake Quickscoping Hard Again!",
            "I really really hate Raven Software. Who the fuck asked for the Crossbow nerf?",
            "hey everyones running and one shotting with the kar? time to nerf the crossbow! i swear the devs brains arent fully developed",
            "What is the absolute meta loadout right now? Haven't played in months",
            "I guess i will play dota2 until they fix kar98",
            "Fucking rotations",
            "Thank god I uninstalled",
            "what with the kar98 nerf stuff ?\n\nit not like it gonna take down someone across Urzikstan right ?\n\ni'm on MnK and i find it difficult to kill someone from long range , too many hitmarks so i really don't know what nerf you guys talking about , even at mid range the headshot only takes the armor .\n\nif i'm missing something plz tell.\n\nactivision need to find the best balance without killing the fun.",
            "No Kar nerf, not playing then. This meta is so stale. Enjoy it if you do. I do not.",
            "Kar needed a nerf",
            "Do anything to the Kar, anything!!!!",
            "Idk why kastov aftermarket is banned in ranked resurgence",
            "Anything about randomly permabanning accounts?",
            "Crossbow and precision airstrike nerf? Two great things in the game and they ruined it. I hate this company",
            "Shit game.",
            "🤣 Nothing surprising. They just continue to kill off the fun elements and keep the annoying, boring elements in. Will they ever replace the idiotic, brain dead decision makers to reverse this negative trend? 🤔",
            "Wtf lol",
            "They still haven't fixed gun image previews in loadout menu lol half of my guns appear as glitchy rectangles in the menu",
            "This game listens to every single wrong person. It's not fun.",
            "No duos resurgence huh? Fuck us then.",
            "Lmao, unbelievable.. I think I'm deleting this game until they fix the Kar98",
            "Thankfully they aren't bowing to pressure from bots to nerf the Kar98",
            "I don’t have a problem with this. Getting hit in the foot with a crossbow and getting downed was a bit much. Chest and upper, sure. But I also like the kar98 and wish they would buff the rest of the snipers instead of nerfing everything.",
            "Fuck everyone was complaining about the Kar.\n\nI thought it would continue to fly under the radar",
            "Sweet, it was broken. You could shoot someone in the toe and instakill/down someone in solos.\n\nThere's so much shit in this game that needs to be fixed it's atrocious \n\nThey are going to nerf the kar because they aren't going to fix the rest of the marksman category bolt actions. And I'll be surprised if they ever update mw2 snipers to not need explosive rounds. \n\nI'll bet money the superi will be getting both damage nerfs and movement nerfs. With the right attachments you run faster than melee weapons and even killstreak movement. I'm in favor of the movement myself but they aren't going to update the rest of the smg class to compete.",
            "Im ok with the no kar nerf. Let us snipers have some more fun before they nerf it to the ground",
            "K98 is the menace and they nerf crossbow lol! They also haven't addressed server lag. I quit the game because of how unbearable it was.",
            "I know!!!!! Like wtf!!!!!! I’m starting to think they did this shot on purpose",
            "I’ve literally stopped playing because I can’t find a team that doesn’t have mics from the 1950s or they just have no mic at all.. it takes too long to find a good team with the Xbox LFG section. I was starting to have fun on the game too",
            "Fucking seriously. I don't play much, and it's hard to get together with my buddies because of work and life schedules. I would like to be able to know who I'm playing with. Getting tired of playing with kids or dudes breathing into the mic with loud ass music in the background who doesn't drop cash for buybacks or loadies.",
            "Bro spend upwards of 5 minutes of waiting in party finder to even find people, get some, search for a match, back out re search because you're stuck at connecting 2 or 3 times, get in a match finally, one teammate just rages and quits in a respawn game mode, others get discouraged and quit for whatever reason. Do it again. Main reason why I'm playing warzone less is basic functions like the fucking menu don't work.",
            "Find a friend? ",
            "Ugh… Nerf something else!",
            "I saw a video and was like “sweet! Gonna Xbow some fool!” Now they nerfed it? I’ll continue with XDefiant",
            "It was overpowered. Killing in one shot anywhere in the body with explosive bolts",
            "They’re obsession with nerfing anything that slightly breaks from the AR, SMG, and Sniper meta is so weird.\n\nGuns like the crossbow should never be meta, but at least let them be viable for a fun alternative to meta builds without completely trolling.",
            "Crossbow never dies !",
            "Not enough crossbow skins ready in the wings. Need to sell more k98",
            "Right, how dare the players have fun with other then meta being pushed in bundles and battlepass",
            "They are literally brain dead, what a waste of time this game is",
            "I’ve had that one a few times recently on pc too. Last time it worked again after I picked up another plate. I had 2 in inventory but it wouldn’t put them on.",
            "That’s been happening to me occasionally some sometime in season 3. ",
            "Are you really surprised?  I'm not.  The people who run this company also run a clown show.",
            "They hate fun",
            "Except it wasn’t that hard to hit people with it. Takes about as much skill as any other sniper honestly.",
            "People taking this as you wanting the Kar nerfed.\n\nThey’re just pointing out the hypocrisy of nerfing a fun niche gun that was already objectively worse than the most popular sniper in the game.",
            "Crossbow got nerfed?! No!!!!!",
            "Y would the nerf k98?",
            "Phenomenal decision by the devs, unironically ",
            "[deleted]",
            "Kar doesn't need nerfed, let a sniper live for once. It's already enough headshots don't down opponents unless you're rock throwing range",
            "I was enjoying the crossbow, too. \n\nAnd… it’s nerfed.",
            "I’ve been using it last couple days and it stopped one shotting, assumed I hit the hand or smth then saw the patch notes :(\n\nGlad to find a fellow WZ1 crossbow user tho",
            "The aim assist and body damage are the real issues, the Stalker is very similar to the Kar otherwise, slower ads by like 150-200 ms, but much better bullet velocity, and a slightly shorter 1 shot range.",
            "There are dozens of us, dozens.",
            "Kar98 + Sperm 41",
            "Kar98 and literally whatever else you want as a secondary",
            "Time for a deserved range buff ",
            "Bye lol",
            "Nobody will even notice.",
            "Word",
            "No",
            "Lol people still play on Xbox?",
            "It is beyond frustrating! I have found streamers on Tik Tok that go live at certain times of day that create custom games with people that have mics so we can all have fun again. It have finally brought joy to the game for me. Other than that I’m raging all day with uncooperative players that don’t use their mics.",
            "I fail to see how this is significantly different than the kar.\n\nThe crossbow velocity is atrocious and in practice, is much harder to hit a shot to the body than it is to quickscope a headshot with the kar.\n\nThey nerfed something that requires more skill and is used and abused far far less. I think this means activision still has a lot more kar bundles to sell.",
            "Did you see crossbows winning every game, or did you see people with kar + superi loadouts winning more often? Balancing by people whining in solo queue is the absolute wrong way to balance. That’s how we end up with dogshit melee options while meta streamer builds remain untouched.",
            "[deleted]",
            "It was also downing people if it landed in a room you happened to be in. I haven't seen it in forever but it was starting to become popular.",
            "Well.... I had fun with my crossbow for a week... Damnit",
            "It's been two weeks and it's one of the most important features.\n\n\nHow unfortunate that any hope hasn't even been communicated yet. ",
            "wayyyy more skill. The velocity of the bolt is like 1/3 of the meta snipers. Not to mention the drop, the single fire and long reload times. It was fun because it was challenging but rewarding when you finally got a hit.",
            "Then nerf arrow drop or something, here it’s useless now..",
            "Have you played in the last couple weeks?",
            "Why tho ? It’s a free weapon you can get very quickly",
            "Man, publishers love players like you. Literally bought a free weapon.",
            "Idiots pay money for a free gun",
            "You are part of the problem, please don't keep ruining the game by supporting pay to win systems.",
            "It's a marksman rifle",
            "86 meters you have quite the arm on ya lol",
            "> It's already enough headshots don't down opponents unless you're rock throwing range\n\nTell me you don't actually play the game without telling me. They down from a long way away.",
            "Seriously. I’m going to be pissed if they nerf the Kar this soon",
            "Anyone that downvotes you needs a lesson in sarcasm.",
            "What's sperm 41?😂",
            "Yes, that counts as anything!",
            "Sadly the bots have found my comment, I'm amazed their aim is good enough to hit the downvote button",
            "....yes?",
            "Its very difficult to hit moving targets at distance with it, yes, but killing people with an arrow to the foot made no sense, and it wasnt hard to use at close range (and I say this as someone who got over 800 kills with it after the stealth buff). It was obvious it was going to get nerfed",
            "Just because it wasnt as used as KAR98 doesnt mean its not overpowered.",
            "LOL, got over 800 kills with it after the buff, which is why I know it was busted. Cry about it.",
            "It had terrible blast radius and would only kill you from a non-stick if you were already really weak.. \n\nThere was no reason to nerf it.  It actually required a different play style to use and wasnt overused in lobbies.",
            "False. I was getting pounded in the back of a van with it and wasn't close to a down.",
            "It’s because it’s not affecting the streamers so they’re not gonna fix it anytime soon",
            "A third? Try a tenth, its velocity is like 108 m/s with one accuracy attachment and one velocity attachment",
            "Have you played WZ1? It was like this OP for 2 years. Apparently everyone loved it back then, and were begging them to add it back lmao.",
            "It’s almost unplayable at this point",
            "Was going to say, I don’t use it but I have it unlocked, I didn’t  pay for it",
            "Also it's bullet velocity is better than snipers 🤦",
            "You're damn right lol,  obviously being sarcastic but it's a damn sniper/rifle 200 ft is the best they can muster",
            "86m is the one shot hear distance.. tell me you don't know distance without telling me.",
            "Don’t worry the Kar aims for us so we are chilling",
            "See, no matter what people think about the kar98 in the game, this is grade A shit talk.",
            "Calling people bots when you need a 1 shot kill weapon with such a strong Aim Assist is really a hot take. Only people who can’t hit their shots properly and with constancy love the Kar98k lol",
            "I'm not even very good with the kar but the snipers are all already nerfed enough as is. Let a sniper be a sniper. It's piss poor they have just a limited headshot cap",
            "Maybe? 🤣",
            "Single shot weapons shouldnt be in warzone period defeats the whole purpose of armor.",
            "At that point then, it's no different than most shotguns or smgs. By the the time you get a stick and the bolt explodes you could have just fried the enemy with any other close range option and been more efficient. Not to mention the penalty for missing is your immediate death.\n\nI'm not suggesting the crossbow shouldn't be nerfed. But it's a double standard to say the crossbow is overpowered when the kar is significantly more overpowered for similar reasons.",
            "A weapon on the extreme end of high risk / high reward is not overpowered in the slightest",
            "Not saying it was super op. But when you've forgotten it existed lol",
            "That's true.\n\nStreamers don't use find a party.\n\nThey have dedicated parties.",
            "This community either doesn’t know what they want or suffer from severe amnesia lol",
            "Hated it then, hate it now. Last couple of weeks has been the most miserable state of the game in recent times.",
            "It is not the same. As a veteran who’s been playing Warzone since day 1 and seen all the Metas I can tell you with certainty it’s not the same, not even close. At least on WZ1 you had players who ran different combinations, such as: Grau/MP7, Kilo/MP5, EM2/OTS 9, Cooper Carabine/PPSH and more. It is not the same when EVERYONE on the lobby is running it and has such a strong Aim Assist. The Kar98k is not even a proper sniper, it is a Marksman Rifle, it has not right to be such a OP weapon. When you have a full squad running it and aim at you at the same time to down you with only 1 bullet it stop being fun. Not even as close like the WZ1 Kar98k.",
            "Well my take is that you are missing the context.\n\nKar98 was a very good weapon on WZ1 for sure. But the competition was different:\n\n- AR with way more bullet velocity \n- AR with way less visual recoil\n- sights with 3x (vlk) decreasing both visual and actual recoil\n\nThat makes an AR very competitive against the Kar98.\n\nOn top of it, the movement was miles better, with more flow, speed and no recharge of slide cancel.\n\nAll in all, kar98 had counters. Now, it is just plain better.\n\nI have played WZ1 since day one...not tripping here.",
            "It was actually a lot better in wz1 but the ARs were better to counter it",
            "I think we can agree cod is divided on this front. If it was up to me snipers wouldn't even exist in the game let alone kill in 0 TTK from all ranges.",
            "For someone of my level that is lol",
            "Imo the problem isn't the one shot range, it's that it's so incredibly easy to use mixed with that range and damage. Stalker has similar range but it didn't take over because it's harder to use. Kar is like a sniper with training wheels. \n\nAnd sniper meta in general just kinda sucks. If you don't want to use it and trade shots from a roof all match breaking each other over and over, then you gotta deal with getting 3rd partied from someone hiding on a roof across the map constantly, it's crazy annoying and makes the gameplay much worse in general",
            "Yes... In this game that's a long way to one shot 🤦‍♂️ \"Throwing rock range\" 😂",
            "63m is a one shot kill, no down. ",
            "This makes no sense. Firstly, there are mouse players. Secondly, if you can't hit your shots, the last thing you want to use is a bolt action rifle!",
            "Exactly, people act like they are being 1 tapped at 300 metres",
            "I think they either should be or shouldn’t be. Just adding it after months of it not being in the game, is going to make people very upset.  It’s a big change to gameplay",
            "It's double standard to think a hit anybody in the corpse is harder than a headshot lmao",
            ">But it's a double standard to say the crossbow is overpowered when the kar is significantly more overpowered for similar reasons\n\nBut I never said the Kar wasn't overpowered? In fact I complained about the fact that the crossbow got nerfed but the Kar98 didn't in another thread. How is that a double standard?\n\n> At that point then, it's no different than most shotguns or smgs\n\nIt is different. Shotguns in this game are (mostly) easy to use but are all either trash or mediocre at best.  Crossbow wasnt hard to use at close range (in solos/duos) and was a guaranteed down if you hit the enemy (which, again, wasnt hard to do at close range and with Aim Assist)\n\n> Not to mention the penalty for missing is your immediate death.\n\nNo? You can just run (if you are positioning yourself correctly in the first place) and/or switch weapons. That was the same argument people used last year to defend the Lockwood 300 with the double trigger attachment (that was so annoying that the devs just gave up nerfing and just removed the attachment from the game altogether)",
            "A weapon that kills with a single shot even to the foot isnt overpowered? Sure, whatever you say",
            "That was the best part honestly.  I loved the crossbow in wz1.  Then they nerfed it for wz2… I confused so many people recently with it and I was having a blast.",
            "[removed]",
            "For sure, I got 200+ downvotes in another post when I mentioned most ppl absolutely hated how OP the K98 was back then lol.",
            "So true! You’re both right.",
            "Or maybe the community wants something different than you?",
            "Tbh I haven’t played it much in WZ2, but isn’t it less OP than WZ1? \n\nIn WZ1 it was a one shot down at any range (until like last few seasons), WZ2 i heard it’s max ~80meters.",
            "This. The AR's is what Ive been thinking but you're right about the movement too. Its easier to headshot people now",
            "I’d love if they just added a helmet like in PUBG that would prevent the one shot down. And tweak the availability and purchase price for it as needed so that sniping isn’t too op.",
            "If it were up to me snipers wouldn’t be in any fps game lol",
            "86m in game is a long way??? 250+ is a long way",
            "The same people saying that probably just run around with no plates or don't move after they get hit the first time.",
            "Hitting headshots with the aim-assisted kar is at worst equal to hitting a body shot with a crossbow. I argue it is easier to use the kar, and I imagine many others would also.\n\nIt doesn't really matter how easy or hard the crossbow is anyway, because its effectiveness is in close range where a ton of other guns are better. The same same can't be said for the kar within its effective range.",
            "To summarize: you said the crossbow was overpowered, and quite simply it was not and is not - especially when compared to the kar.",
            "the chance of hitting even the foot though is extremely unlikely. I used the xbow, I enjoyed it due to the extremely high skill level it took, but making it not a 1 hit down makes it impossibly bad and useless.",
            "Please compare the TTK of the crossbow explosive tips to any meta smg, AR, the Kar, or a decent shotgun. I’ll wait",
            "I was about to try it since seeing it recently, I didnt know it was semi viable, too bad.",
            "Well they are.\n\n\nThey bring zillions into the game, whenever they purchase a bundle everyone buys one (i.e. skeleton bundles) and they shift the meta by making insane amount of content about them.\n\n\nThere's no reason Activision shouldn't listen to them. ",
            "I'd say nerf the range or something. Or slow down its fire rate. I'm a seasoned KaTT user and Resurgence has become far too saturated with KAR snipers.",
            "No. It’s clearly evident that the general community doesn’t know what they want. “We want rebirth, we want the kar back, bring back 1 shot sniping, we want wz1 movement back, we want this, we want that”. Then complains when it finally gets here. “The kar is too OP, rebirth is too sweaty, you can’t move without being sniped, people move to fast like they’re on crack, blah blah blah”. It’s an endless cycle of people complaining for the sake of complaining",
            "In WZ1 the assault rifles had 1200+ bullet velocity, (mostly) only 1 damage drop off so killed much faster at long range, much less sway and random recoil deviations, and so little visual recoil that a 3x optic was the meta for full autos for the entire life cycle of the game.\n\nWe have none of those things now. There is no effective counter sniper to use to balance out the Kar being OP.\n\nThat is the real problem. The other long range options are bad.",
            "They are probably running across open spaces and not trying to stay near cover, or taking pointless fights with ARs when they shouldn't.",
            "I would really want why don't you put more emphasis on the word AIM-ASSIST? Si the kar is easy to use because of the maksman aim assist, good, how about we fucking nerf the aim assist instead of the fucking weapon? While we are at it, maibe fucking buff the snipers as well, so they won't get overshadowes by a marksman rifle, lmao",
            "It was, which is why it was nerfed this fast despite not many people using it (and restricted in ranked within one day after the buff).",
            ">  the chance of hitting even the foot though is extremely unlikely\n\nAt long/medium range against a moving target? Maybe. Against someone at 0\\~20 meters? Not really.",
            "TTK? lmao. You hit them once with an arrow and run so they dont shoot back at you, simple, really.",
            "That's cuz the KATT is not a rebirth sniper. There's different snipers for rebirth. \n\nThe Katt is really a BR sniper and slow playstyle gun. Really it needs better BV to even be good for its slow movement/ads and its aim sway drawbacks. The Kar and XRK are far superior for rebirth so it's not a matter of over saturation as much as they are just plain better for what the design of the map/mode is.",
            "The optics actually helped your recoil which is the biggest reason why they were better.\n\nI much prefer the 3x scope meta vs the AR's iron sight meta we have now. Iron sights are lame unless they are the grau",
            "Finally someone talking some sense!",
            "Sure, but what you're talking about is orders of magnitude more difficult to implement and will never happen.",
            "You really want to use the devs decision to nerf/buff something as an indicator for something?",
            "Yes these devs know exactly what they're doing, great point.",
            "Based on your experience it's not a rebirth sniper.\n\nI've usually had great success with it.",
            "Well, Treyarch removed a overpowered weapon from ranked and Raven nerfed it, so I guess two different dev teams do know what they're doing.",
            "You'd have better success with either of the 2 others I mentioned that's the point. Use what you want it only hurts you... but its not a reason to say the KAR being oversaturated in the mode is a problem.\n\nThat said I'd love them to make more light snipers useful by placing short 1 shot range caps and movement speed variations/ads variations/aim stability variations on them like they have with xrk and kar. This would give people reasons to actually use some of the other 10+ snipers/marksman rifles. As well as the opposite for the slower bigger bolt action snipers... they NEED a straight up 1 shot range cap... delete explosive rounds or make them NOT 1 shot but have splash damage... cuz you know that's what explosive rounds insinuates. It was so dumb for it to sewer BV just to get a 1 shot."
        ]
    },
    "Me and my little brothers first warzone win": {
        "title": "Me and my little brothers first warzone win",
        "score": 145,
        "url": "https://v.redd.it/wr753f1sg08d1",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Awesome!!!!",
            "I'm surprised this is you're first win! You played so well!",
            "Nice job boys",
            "Almost shidded my britches when you pulled out the bomb drone. GG",
            "Did u pick up that precision airstrike at 30 seconds",
            "awesome, me and my cousin are still struggling to win on resurgences but hopefully we'll get one.",
            "0:20 Aim Assist is wild!!",
            "Sens?",
            "nice",
            "Did you let him get a kill 🤣",
            "sweeet!!!!",
            "GG but nerf RAA that's ridiculous. No way the average MKB can do that.",
            "Settings?",
            "That .410 is still usable?  I thought they nuked that into the ground.  One of the few ones where you can mount a shotgun on your shotgun along with the AK 12 gauge.  (Although the flamethrower or grenade launcher were more serviceable, but the novelty is fun)\n\nEdit: I'm a dumbass, and you weren't using that gun, but I'll leave the post up for no real reason whatsoever.",
            "Use the flare!!!!!",
            "Prob as a duo he meant",
            "Yes, the aim assist played so well",
            "Swore he was about to blow himself 😂",
            "I did not",
            "It's ridiculous lol",
            ":/"
        ]
    },
    "Aim assist (teach me)": {
        "title": "Aim assist (teach me)",
        "score": 9,
        "url": "https://www.reddit.com/r/CODWarzone/comments/1dls5f5/aim_assist_teach_me/",
        "content": " im a siege player mainly (gold ranked) so id hope it would be accepted i can aim better than your average controller cod player. When i watch clips of peoples AA its like soft aimbot. When i play my aim assist is like a gentle suggestion rather than snapping to people and staying there. Why am i a worse average aimer in a game that requires less aim skill? What am i doing wrong? Ive defended AA for a while because of my own experiences with it but i cant ignore weight of evidence. How to activate the god aim?\n\nEdit i play on and xbox one and a 2016 32 inch tv 🤷‍♂️ dunno if that makes a difference, heard people saying it does.",
        "num_comments": 30,
        "comments": [
            "Follow this - https://x.com/hecksmith_/status/1647204477160636416   \n\nAnd watch this - https://m.youtube.com/watch?v=frjx63T5FQU  \n    \nAnd this for complete console settings - https://m.youtube.com/watch?v=vVxgm2hogWc",
            "Dynamic response curve\n7/7 .80 default aim assist",
            "Dynamic aim response curve\n\nStrafe with left stick while shooting",
            "![gif](giphy|NBPhWGmDS1Kuc)",
            "Have a good sens that's not too high. \\~ 6,6,0.77. Use that left stick to take advantage of aim assist. If I'm engaged in a fight, I simply perform some type of movement that's perpendicular to the direction I'm fighting in. \n\nDon't judge yourself based on what you see streamers doing. Too many rats out there using extras.",
            "Cheaters. Your answer to why you can’t reach these levels is because these people are cheating. Nonhuman can aim like these cheaters that’s why it looks so unnatural. And no you don’t get that type of sun from moving your left stick",
            "Your first mistake was u believed reddit nerds with m&k who says AA is aim bot and snaps to people and lock on them.",
            "Set your left stick dead zone at 3/70 and right stick at 4/99. Abuse rotational aim assist almost all the time with these settings",
            "👍🏻",
            "Cheaters trying to gaslight you into thinking rotational aim assist is broken. Yes, it does help aim but it‘s nowhere near aimbot. Most of the people you run across, especially in ranked, are not just abusing roational aim assist; they are using SweatPlay (a customized and obfuscated DS4Windows) and alternatives. They‘ll go above and beyond to gate-keep this and will downvote anyone exposing it, including this comment.\n\nJust watch.",
            "sad times when the advice to aim better on controller is just \"learn how to abuse aim assist\"",
            "A human on controller is NOT tracking and hitting every shot on me as I slide by them and change directions. I used to break ankles all day before RAA.",
            "Doesn’t do 100% of the aiming, but it does do 60%.",
            "It does to a degree its just not 100 percent. Somethings clearly going wrong for me when my aim in a game with aim assist is worse than a game without it. Only asking for advice related to that",
            "Is honestly is completely broken, as a mnk player swapped to controller recently it gives you unnatural tracking allowing you to stay on target and hit all your shots with fast paced movement \nA lot of cheaters will use smooth aim though which can look a lot like rotational aim assist \n\nBut I’ve got quite a few clips recently on controller that I would have 100% reported for cheating when I was playing mnk",
            "This is the problem.   \n    \nAim assist is so strong that people like you can’t tell the difference between it and actual cheating.  \n    \nThere’s a reason so many have switched to controller, and that the top 250 are like 95% controller lol.",
            "We’re downvoting it because you’re blatantly lying",
            "Makes me sick to see, as a mnk player recently swapped  to controller it sucks \nWish I could play my preferred input and not be at a disadvantage 😂",
            "Make it 90",
            "Watch the videos I posted, and there are plenty more on YouTube that show good practice to do if you’re having trouble.  \n    \nIf you are starting fresh, it does take time to understand what you need to do to get it to activate.  Just gotta keep practicing",
            "No advice these people are cheating",
            "must need a dual sense or Xbox controller because I get none using my 8bitdo ultimate on pc.",
            "Top 250 pay for boosting services. It's been proven that very few are legit or even real accounts.",
            "I'm still on mnk. I am a glutton for punishment apparently.",
            "Yikes lol",
            "You don’t need any type of special controller, every controller will get the same.  \n   \nYou either don’t have the right settings or are not activating it correctly.",
            "Replace top 250 with “top tier player”, my point doesn’t change.",
            "Yep it’s definitely punishment missing a few shots and dying to someone with artificial aim and tracking 🤣 \nFeel it will only get worse with the new movement in the next black ops \nWill be interesting to see if they actually fix mnk aim back to warzone 1 era or nerf aim assist a bit",
            "eh I feel it a bit here and there in mwz but it's not there in mp or wz. Just ends up like an awkward mouse.",
            "Honestly sounds like your not activating or understanding the rotational aim assist and trying to actively using your left stick too much to aim, possibly with to high of a sensitivity\n5 or 6 was a good starting point for me"
        ]
    },
    "Super lucky dub from unintentional gas play. It took a second to process that we had won. NSFW language.": {
        "title": "Super lucky dub from unintentional gas play. It took a second to process that we had won. NSFW language.",
        "score": 47,
        "url": "https://v.redd.it/ilevviv9s08d1",
        "content": "",
        "num_comments": 6,
        "comments": [
            "I thought the video was repeating for a second there when I kept watching the same flare go off in the same place lol, hilarious W",
            "GGs what smg build is that",
            "Ggs my man",
            "Lmao that flare was the MVP",
            "What Isauce said - it’s the mcw with the conversion kit, 40 rnd mag, rapidstrike grip, dr6 handstop, and the scratch-20.",
            "Not an SMG it's the MCW."
        ]
    }
}