{
    "Welcome to r/comicbookmovies!": {
        "title": "Welcome to r/comicbookmovies!",
        "score": 9,
        "url": "https://www.reddit.com/r/comicbookmovies/comments/1am5olj/welcome_to_rcomicbookmovies/",
        "content": "Hello! If this is your first time coming here: Welcome! We are glad you are here! If you are a current member, welcome back! This post will be your source for clarification on rules, how to reach mods with any issues and any other potential issues in the future. \n\nWe want to start by saying first and foremost that this is a safe, fun space for all. We ask that you are kind and respectful to others when you comment, reply or post. We want everyone to enjoy their time here and to feel included. So please, be respectful of others feelings, likes, choices, etc. While we try not to ban people for minor offenses, being repeatedly disrespectful of others, homophobic, sexist, racist, hateful, etc. will likely result in an immediate permanent ban. If you believe you are a target of any of this, please do not engage and instead report the incident, as engaging could also result in your ban, as well.\n\nThis sub is a informative sub first. Any news related to movies, shows, games, comic, animations, etc. is our focus here. Other content such as, but not limited to: Rankings, Questions, Casting Choices, VS, etc. If you would like to post this kind of content, another sub related to that topic would be a better choice for you. We do allow these kinds of topics to be posted on Sundays 12AM ETS, but they must also follow the rest of the rules for this sub to be allowed.\n\nReddit, along with other social media, has been overflowing with scam and bot accounts in recent years. To try and combat this, we have created an automod to ban any accounts it believes to be an issues. If your account has been banned, there is a good chance the automod has blocked your account for a variety of reasons. We do our best to prevent bots, scams, trolls, etc. from coming to this sub. For this reason, if the automod believes your account to be one of these possible types of accounts, it will automatically ban your account. Some reasons the automod may ban your account are, but not limited to:\n\n\\- Your account is new and/or low karma\n\n\\- It detects your IPS Address coming from a known spam/bot Address\n\n\\- You had a previous account already banned\n\nIf you believe your account was ban inappropriately, please message the sub itself about this issue. When messaging, please be respectful and understanding of the situation. If you are disrespectful and inappropriate, we will likely keep the ban in place. Personally messaging Mods will also result in the ban staying in place. Reply to the ban message respectfully, and a mod will get to you as soon as possible.\n\nHopefully this is helpful to yourself and will help you while being apart of this sub. We hope that if you are new you will follow the sub and add to the community. Again, we welcome you here and hope you have a great day!",
        "num_comments": 0,
        "comments": []
    },
    "A new photo of David Corenswet as Superman has been spotted on the set of ‘SUPERMAN’": {
        "title": "A new photo of David Corenswet as Superman has been spotted on the set of ‘SUPERMAN’",
        "score": 415,
        "url": "https://www.reddit.com/gallery/1dlh75y",
        "content": "",
        "num_comments": 68,
        "comments": [
            "https://preview.redd.it/wi05v2mce08d1.jpeg?width=292&format=pjpg&auto=webp&s=2e2f0949301ff815626b74a141ab08890f17343c\n\nHe used his freeze breath in the background 🥶",
            "> “Lex Luthor Wins Arcane Genius Award”\n\nInteresting.",
            "The scene with the train is 10/10 in terms of how he looks, the other image is too grainy for me to judge but the top half looks good… I need to see the legs part more.\n\nBut my GOAT is looking good so far…",
            "“Don’t you mean a photo of David Corenswet was captured on the set of Superman” \n\nNope, literally meant a photo of David Corenswet was spotted on set \n\nHaha",
            "Trunks trunks trunks!\n\n![gif](giphy|JQFuCdFbQAbNaawknQ)",
            "Photo is a little grainy for me to give an opinion on but I'm still excited for this movie.",
            "\"No fatalities...\"\n\nSo they're clearly going in a very different direction.",
            "Red underwear outside his trousers?",
            "he looks awesome people have to stop complaining about everything",
            "Chocos = Martian Manhunter",
            "what’s the newspaper actually saying aside from the headlines cuz to me it’s just a bunch of nonsense",
            "Looks great but anyone else curious enough to read the small copy on the page? Reads like AI-generated babble",
            "So coooool",
            "This is unironically a better suit reveal than the official one. And I can barely see it",
            "Trunks look dumb as hell",
            "Superman saving 20 people and using frost breath in his first movie this is a million times upgrade compared to man of steel when he saved not really anyone and mostly killed over 20 people",
            "Superman wearing some tiny red shorts over his suit? I hope this movie is actually good. DCs track record blows",
            "Looks like he’s wearing tan chinos on his lower half...?",
            "I have total faith in Gunn. That being said, I'm not a huge fan of what I initially see in the costume and the shield. I just don't care for the high collar.  I'll reserve my total judgement though until I see it moving on screen.",
            "I'm hyped as hell, that small news article itself helps show what kind of world Gunn is building. \nAnd it's very comic booky.\n\nI think we may get our very first very accurate comic book Superman film\n\nNo hate on the previous films, but this seems like it's going to be really damn accurate",
            "I hope to god this movie is a phenomenal success both critically and at the box office. DC (at least in live-action cinema) has lacked quality storytelling for a decade now, and I truly think Gunn could turn things around. That all hinges on these movies being superb, though.",
            "I hate those trunks w every fiber of my being",
            "Idk. The trunks look like shorts. Hope they aren’t",
            "Very homelander. Very exciting!",
            "Suit still looks trash. Doesn't mean it won't look good in the final film but so far not impressed",
            "He doesn't need protection he should be wearing something thin and tight like women's yoga pants. Let's see the high definition cock and balls outline.",
            "Ooh I am hyped. I missed the frost breath.",
            "The question is is it an award created by Anton Arcane, or does it just refer to the dictionary definition of the word arcane?",
            "I feel we get a pretty good sense of what he looks like in that other one too.\n\nWe can see the silhouette as well as the trunks and belt.\n\nWe can even see he used his freeze breath",
            "What scene with the train?",
            "And belt too",
            "![gif](giphy|ItabziIspdC7e)",
            "They look great",
            "I don't understand why people like that shit, it's goofy as fuck, yeah it's classic and stuff, doesn't mean it looks good in real life, looks childish as hell",
            "He looks stupid big, and I love it\n\nLike damn, David bulked up, a lot",
            "A decade? Didn't we have Wonder Woman, The Suicide Squad, Joker, The Batman, all of them critically acclaimed",
            "It’s a new Superman movie it’s going to make money no matter what",
            "In what way?",
            "Huh?",
            "Trunks and belt is an OG design, man.",
            "Don't know why a lot of Superman material started moving away from the freeze breath",
            "Most likely Anton Arcane. they're doing a swamp thing movie so it makes sense",
            "The top half looks good and I even like how the trunks look, I need that full 4K HD shot of him after these images.",
            "https://www.reddit.com/r/superman/s/eDIbpBARZR",
            "![gif](giphy|y2JIV6kY7cNzO|downsized)",
            "Why so serious?\n\nLet things be goofy",
            "Luckily for us the movie isn’t real life.",
            "People get tired of over serious grey looks so I think it’s time for characters from comics to actual embrace the comic",
            "Should rephrase - CONSISTENT quality",
            "Yeah, I'm scratching my head. Wtf.",
            "The collar and overall denseness of the suit reminds me of homelanders design. Reeves suit was paper thin, Routh had some thicc and Cavill had a bit more. But this looks most.",
            "The trunks and belt are great. The collar is what makes it look bad",
            "who gives a shit if its og if it looks bad (im not saying the og suit looks bad)  \nalso it should be noted that very subtle changes can make all the difference in fashion",
            "Buddy Superman and Lois uses it a lot and my adventures with Superman just introduced it what are you talking about",
            "Right! They look SO good. Like so good, makes me wonder why people don’t still do this?\n\nOh yeah. I remember. Cause it’s 2024. Not the 1930s. And it looks awful.",
            "My honest reaction lmao:\n\nhttps://preview.redd.it/4w7s8bszc08d1.jpeg?width=554&format=pjpg&auto=webp&s=5786fcf893a39e67665d97f5c97aadbcd3900c83",
            "I think he's talking about the way the suit looks in the pic and how David is posing sorta resembles Homelander.",
            "Yeah, nah.",
            "Almost like the entire point is that the modern suit we're used to is an evolution from Clark having to make do with the clothing and materials around him at the time.",
            "In fifty years I think he used it like twice, once in Superman returns and the other from Snyder JL. That is if you only count live action movies",
            "He still wears it in the latest comics too. Tf are you talking about?",
            "![gif](giphy|z6sDWNhC3gk48)",
            "But Homelander poses like Superman",
            "Yes, it's the denseness of the fabric for me, and the collar",
            "you missed my point and thought i was still attacking the suit. i was attacking your reasoning. and i hate you personally. also do you wanna get married",
            "Whedons version used it too, same moment. But different camera angle. One of those stupid changes that added nothing.",
            "Exactly.",
            "He usually has hands behind his back which I thought might be a nod to Hitler."
        ]
    },
    "Ralph Ineson on starring as Galactus in 'THE FANTASTIC FOUR':": {
        "title": "Ralph Ineson on starring as Galactus in 'THE FANTASTIC FOUR':",
        "score": 83,
        "url": "https://i.redd.it/tsfh0rp1j28d1.jpeg",
        "content": "Source: https://youtu.be/AqLLFsGey64?si=2n7O3-SbF8tJ6uqq",
        "num_comments": 6,
        "comments": [
            "Ineson: So what exactly does my role entail?\n\nFiege: You're a space-travelling giant that eats planets.\n\nIneson: Fuck yeah.",
            "![gif](giphy|OfsbX3fVv0Sti)",
            "One of the few Marvel castings that sound unique and interesting.",
            "It should be me instead",
            "“How can you say no to a role like that?”",
            "You already had your chance as the cloud."
        ]
    },
    "Delroy Lindo is no longer in ‘Blade’": {
        "title": "Delroy Lindo is no longer in ‘Blade’",
        "score": 163,
        "url": "https://i.redd.it/c88yflcky08d1.jpeg",
        "content": "",
        "num_comments": 26,
        "comments": [
            "I'm starting to think this movie might not even happen at this point!",
            "Just cancel it, they screwed it up way too much. I bet Ali drops next",
            "If Mahershala Ali is smart he'll follow him and then Marvel should put the movie out of it's misery.",
            "At this point, just can the whole project. Marvel announced this back in 2019 and still haven't even begun filming yet. They've gone through two directors and had six different writers.",
            "I'm sure he'd like to retire at some point before he dies.",
            "Maybe they should just canonize the 1998 blade film and then bring back Wesley Snipes, who says the day Walker is incapable of aging?",
            "Who's in this movie at this point?",
            "This movie has Lucasfilm energy",
            "I’m just waiting to hear Mahershala has left the project. This movie just can’t seem to get off the ground",
            "Thats the saddest news from this whole Blade thing. \n\nWhat a LOSS",
            "I don’t anything that isn’t instantly improved when you add Delroy Lindo",
            "Ik it’s been said before but it really does baffle me that it’s this hard to make a movie about killing vampires it really does baffle me",
            "JUST CANCEL THE WHOLE FUCKING IF AINT HAPPENING!!!",
            "Probably for the best tbh. I’d hate to see marvel make a joke out of Mahershala.",
            "Yeah. At this point, just do it after Secret Wars in what will probably be a semi-rebooted MCU with a younger actor.",
            "💯 this film is now looking for it's 3rd director and is supposed to start filming in Aug 2024. It's pretty bad when the only good news about this reboot in five years  was its announcement.",
            "He's notorious for being incredibly difficult to work with. They would probably rather scrap the movie than hire him as anything more than a cameo. Just a guess.",
            "Ali still lol",
            "![gif](giphy|l4EoRZIv3zd0XqsNi|downsized)",
            "Didn’t he approach Marvel?",
            "Yep and they don't have to keep explaining where the fuck they were during infinity war",
            "I'll be amazed if this film is ever able to escape from development hell and still manages to be good.",
            "He also has a habit of not paying his taxes.",
            "Aren’t they squandering one of the greatest talents that ever approached them?",
            "I’m pretty sure both are causing problems.",
            "my guess is he came to them and had a pretty specific vision for what he wanted to do with the character. marvel then tried to get him to compromise his ideas to fit into their overall universe and plot lines. Ali probably wanted to do something like The Batman or Joker — a really good superhero movie, with no strings attached. Only issue is that’s not what the MCU is. But maybe with a talent like Ali, Marvel should’ve let him do whatever the fuck he wants lol"
        ]
    },
    "Another photo of David Corenswet as Superman has been spotted on the set of ‘SUPERMAN’": {
        "title": "Another photo of David Corenswet as Superman has been spotted on the set of ‘SUPERMAN’",
        "score": 142,
        "url": "https://i.redd.it/i0ctovgba08d1.jpeg",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Written by Clark Kent",
            "$8.50 for the paper!?",
            "I really like this marketing method, feels very down to earth, like a little window into the mundane of the everyday world of the DC and not just the big bombastic promotional stuff.",
            "I love details like this. Set dressing is an underrated aspect of filmmaking",
            "I can’t wait! James is going to make something special. He’s a good director.",
            "$8.50!",
            "Man I wanted this movie to fully be in the past",
            "Drives me crazy that movies have newspapers that are as obviously fake as the takeaway coffee cups are empty on tv. Just stuff like layout and paragraph length. Plus, $8.50 for a newspaper? Does it come with bacon?\n\nBonus gripe, big name authors like Stephen King who don’t know the first thing about how newspaper articles are written and just make up new stories that a high school journalism teacher would send back for a total rewrite.",
            "He capitalized Train randomly. What an awful reporter, I bet even Superman could do a better job.",
            "Photo by Jimmy Olson",
            "LMAO bro a narcissist",
            "Inflation is alive and well in the DCU",
            "Why? Genuinely asking, not trying to annoy",
            "Eh, we’ve had plenty of media being set in the past. Setting this story in our current time with all the fuckeries going on is the better choice, and the harder choice",
            "You say that, but Lois has a long history of being awful at spelling.",
            "Great caesar's ghost I just noticed",
            "He's like Peter Parker getting all those sweet shots of Spider-Man.",
            "To bring a rare new idea to a really old idea."
        ]
    }
}