{
    "Mod Sticky: New Users, Please Read This Before Posting": {
        "title": "Mod Sticky: New Users, Please Read This Before Posting",
        "score": 189,
        "url": "https://www.reddit.com/r/computers/comments/bhc9kl/mod_sticky_new_users_please_read_this_before/",
        "content": "If you are coming here as a new account, welcome! If you are trying to ask a question please read below in order to ensure that your post gets the help you need.\n\nBefore you post, check the sidebar to see if there is a better place you could be asking your question. You are always welcome to post your question here, but you may get quicker or more specialized help by posting it in the right subreddit.\n\nAlso, before you ask a question, please GOOGLE IT. Low effort questions that are easily googled will be downvoted. Please don't be a [Help Vampire](http://slash7.com/2006/12/22/vampires/).\n\n##Posting tips to get your answer fast:\n\n1. Tell us as much information as you possibly can.\n2. Tell us what you have already done to try to fix it\n3. Tell us what changed when the problem started\n4. Make a title for your post that actually describes the problem. \"Please help\" is a terrible post title.\n5. Make a **TEXT POST** and NOT a **LINK POST**. If you are a new user and you make a link post it will be removed automatically. If you want to share pictures, upload them on an image hosting site like [imgur](https://imgur.com/upload) and then paste the links into your text post.\n\n---\n\n###Click [HERE](https://www.reddit.com/r/computers/submit?selftext=true) to ask a question.\n\n###Please read the rules [HERE](https://www.reddit.com/r/computers/wiki/rules).\n\n### There is a more detailed posting guide [HERE](https://www.reddit.com/r/computers/wiki/index#wiki_what_do_you_want_to_do_today.3F)\n\n---\n\nThanks and enjoy your stay!",
        "num_comments": 0,
        "comments": []
    },
    "Attn r/computers users - this sub's harassment filter has been turned on.": {
        "title": "Attn r/computers users - this sub's harassment filter has been turned on.",
        "score": 9,
        "url": "https://www.reddit.com/r/computers/comments/1ca0mpl/attn_rcomputers_users_this_subs_harassment_filter/",
        "content": "Filter is currently set to \"low\". \n\nPlease (preferably a few weeks from the date of this post) let us know if you think.  \nWe can either turn it up to high or turn it back off entirely. \n\nThanks!",
        "num_comments": 6,
        "comments": [
            "I cant harass people anymore? whats the point of this sub then",
            "dammit i cant harass people anymore, what a shame",
            "RemindMe! 3 weeks \"let them know what i think about the subs harassment filter \\[working well? not working well?\\]\"",
            "I know right!?\n\n>!This feature is long overdue!!!!!<",
            "I will be messaging you in 21 days on [**2024-05-13 05:44:23 UTC**](http://www.wolframalpha.com/input/?i=2024-05-13%2005:44:23%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/computers/comments/1ca0mpl/attn_rcomputers_users_this_subs_harassment_filter/l0pd03t/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fcomputers%2Fcomments%2F1ca0mpl%2Fattn_rcomputers_users_this_subs_harassment_filter%2Fl0pd03t%2F%5D%0A%0ARemindMe%21%202024-05-13%2005%3A44%3A23%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201ca0mpl)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|"
        ]
    },
    "I figured out why my laptop was so slow": {
        "title": "I figured out why my laptop was so slow",
        "score": 152,
        "url": "https://i.redd.it/zacymwc5d18d1.jpeg",
        "content": "None of the thermal paste was on top, none of it was touching the cooler! Whoever did this last is dumb (definitely wasn't me)",
        "num_comments": 47,
        "comments": [
            "Yeah because its a fucking Pentium",
            "Well you're using 15 year old bottom of the barrel hardware of course it's slow",
            "Are those burn marks???",
            "15 year old laptop and the thermal paste expired, they didn't do it last, it's just because it's old. \"Too much\" thermal paste doesn't negatively impact performance and it just gets squeezed out the side, so in manufacturing you might as well just go for it.",
            "Bruh",
            "its not the last person to do it, its just dried out after 15+ years",
            "Shit is cooked.",
            "It looks like the damn discord logo man tf???",
            "If you really really cannot afford a new pc, at least check the used market for anything from the last 10 years, there's probably a ton of complete office pcs for 50 bucks on ebay that perform multiple times better... even an old, budget tablet will run better than this Pentium... I feel like good thermal paste would be worth more than this laptop",
            "Repasting can do wonders. My i7 8xxx NUC \"tvpc\" kept throttling just playing 1080p videos, with the fans running at full speed. After I cleaned it and repasting, it is now much better. Went from 98°C and throttling to around 75°C",
            "Not necessarily. First you need to check its temperatures. If it's thermal throttling, then you check if it is a known design flaw and if everyone's complaining.\n\nOnly then should you open it and assume it needs to be repasted.",
            "Your processor has eyes now.",
            "You cooking that shit",
            "daaaamnnnn...",
            "why its số burnt looking",
            "That is certainly not the perfect amount of thermal paste..",
            "Wow that's a mess. Fortunately that thermal paste is presumably not conductive or you'd be having a very bad day.\n\nStill, when you're working with hardware that is 14 years old, especially when it's the second lowest-end model available in that generation of 14 year old products, you're not going to be doing much... The hardware is just slow, modern hardware is many, many multiples times faster that any remotely modern software is going to have a bad time on that CPU. You could get a much more modern laptop for under $200 that would run circles around that CPU. You could aim even higher for cheaper if you go with a used desktop.",
            "Thats from like 2004",
            "Pentium 6100 from 2010. 2 cores, 2 threads. \nThat's why its slow.. ",
            "I work with what I have. It's a hand me down",
            "Bottom of the barrel my ass....It should be 6 feet under..",
            "Like being born without legs and suddenly realising you cant walk like is OP actually trolling right now or what?",
            "Thank God it's not. That's my camera reflection",
            "I could be wrong but I think that's a socket based laptop CPU (I can be wrong tho hmmmm.)\n\nBut you're right tho, comparing my friend's Ryzen 5 Laptop and an i3-4100M really is a wild performance boost they could have got if they got a later gen CPU. (But as for me, my laptop was a gift. I'm still Saving for a decent later gen Intel laptops at least)",
            "Dose it not specifically say 08' on the chips sticker?",
            "TDP 35W.\n\nI doubt cooling was a big issue.",
            "Apply new thermal paste and see if anything improves, but it will always struggle with modern tasks. I have used a i5 430M as my main system for 10 years, which is older than your P6100 surprisingly and it just did not cut it anymore. There are so many things it is bad at in 2024, but you have to work with what you have.\n\nI actually upgraded the 430M in my laptop to a i5 580M from AliExpress as it is a socketed chip anyways. That has given it a bit more life but compared to even a modern 5600G it is outdated as it can be. So you might look into that as AliExpress has a lot of cheap CPUs now, I have seen the 430M for as low as $2, so anything from the P6100 line should not be more expensive anyways. Depends on your laptop supporting multiple CPUs.",
            "Honest question. Why? It's a great time to build a desktop PC if you want help.",
            "I'll also add in here - being from 2010, there is a good chance that this laptop has a spinning hard drive and somewhere between 2 and 4 GB of RAM. Even if not, check your Task Manager. If it says Disk 100%, it needs replaced. If this is the case, I'd look into upgrading both. Upgrading the storage will mean a fresh install of Windows. RAM can be upgraded to 8 GB of DDR3-1066 SODIMM.\n\nEdit: I noticed that the CPU is socketed, rare for laptops. Staying at 35 watts, you could upgrade to an i7-640m. If the motherboard supports 45 watts, you could upgrade to an i7-8400m, and at 55 watts an i7-940XM. Not that higher watts mean less battery life.\nFor a more complete list of processors available, you can search for Socket G1 / rPGA988A / PGA988. Make sure to cross reference them with your laptop model for compatibility.",
            "Ultre low end cpu from 14 years ago, bro\n\nBRO",
            "Oh fuck I really thought it was lmao\n\nAs for your laptop, I suggest you to install a good and light Linux distro such as Lubuntu and give your laptop a second breath.",
            "Definitely socketed, rPGA988A. It can probably be upgraded with a considerably faster dual core CPU, like an i7-640M. It'll never be anywhere close to fast though.",
            "Actually came out in 2010",
            "Non gaming CPUs tend to get extremely cheap, as they tend to get useless quickly. I recently got myself a celeron 440 for about 2 bucks because I needed something with a low tdp",
            "Intel Atom and AMD C series say hi",
            "Eh its still op has a better cpu than my backup win xp laptop wich has a sempron 3100+",
            "But hey, that i7 should be enough to play basic 1080p and some basic 2D gaming (3D gaming is out of the question, except older ones)",
            "Raspiberries are expensive in my country\n\n\nSo a whatever 100to300usd notebook do wonders to use as home theather etc, currently im using one i7 4300 / radeon8500m / 2x 4gb ram notebok for this\n\nLiterally notebook started desintegrate plastic around screen but still working and its more expensive get another chassi / battery / keyboard than get a brand new i5 12gen / 8gb ddr4 or maybe 5 vivobook whatever notebook",
            "Why not arm? Better performance per watt, probably cheaper too",
            "At this point is better to have a pencil and note as backup…",
            "Plus my home theather notebook uses a sweet 45w charger, very efficient energy wise",
            "I have 2 lga 775 motherboards and wanted to use one of them, the pentium d in one and Pentium 4 in the other would raise my bills too high and I didn't want to build a whole new pc since I had 2 spare",
            "At least it can run diablo II and half life",
            "I have one core 2 quad q6600 and gtx560 but sadly find the parts (motherboard, memories etc to turn him on are expensive and dont worth try restore",
            "Oh yeah well ima draw that shit with my pencil and paper LOL",
            "It's lga775, used ddr2 is cheap af and you can mismatch sets, the mobos shouldn't be a problem either but it depends on where you live",
            "No bro, in brazil theres no aftermarket for old components like those\n\n4 or 5 years ago an am4 socket(ryzen) kit with rysen 5, 16gb ram and mobo was more cheap than get those exact components to my lga775/ddr3\n\n\nOn usa theres even stores selling lego bricks for pennies and a easy to acess market for old/vintage components\n\n\nLike i said: notebook chassis + battery + keyboard repair pieces are most expensive than get a brand new notebook, so outside will to burn money, try repair/reassembly those items here are burn money\n\nLet me explain the math\n\nNotebook chassis.... 270brl\nBattery....... 250brl\nKeyboard.... 80brl\n2014 notebook\n \nBrl to usd is basically divide by 5.5 ( 1usd = 5.5brl), so the cost is around 100usd\n\nThis notebook in perfect state dont worth more than 130usd to sell in brazil.\n\nI literally can find used notebooks fully working from 2021 around 140usd or a brand new one around 250usd, even the lowest config will be far better than my 2014 one\n\n\nSame applies for desktop hardware"
        ]
    },
    "lmao": {
        "title": "lmao",
        "score": 73,
        "url": "https://i.redd.it/vec06s2jk18d1.png",
        "content": "",
        "num_comments": 17,
        "comments": [
            "SSD stands for Server System Driver and HDD stands for Headphones Display Driver.",
            "best comment ever :)",
            "My brain is short circuiting after looking at that. I spent 5 plus hours researching those two things alone before building my PC, and this is just hurting my head to look at. \n\n\nDid they just decide not to search up the anagrams or something?",
            "I was struggling to understand that comment. And then I realized they don't think comas are important...",
            "What a comment 😂",
            "hmm hey i bought mouse with my pc but there is no tail how the hell it still works?",
            "Is he at least good at gaming?",
            "When talking about storage, r/wrong (why does absolutelywrong not exist, someone should make that)\n\nedit: r/thatsasubreddit?",
            "What?",
            "ssd is display driver hdd is the display",
            "[deleted]",
            "Made my day💀",
            "r/confidentlyincorrect",
            "May I introduce you to the concept of a joke?",
            "Dumbass",
            "r/PeterExplainsTheJoke",
            "is this going to become a meme?"
        ]
    },
    "Can someone let me know how much I could sell my computer for?": {
        "title": "Can someone let me know how much I could sell my computer for?",
        "score": 27,
        "url": "https://i.redd.it/n1l49blym28d1.jpeg",
        "content": "I got this computer a few Years ago as a birthday gift but was never able to actually use it so I was wondering how much I could sell if for ",
        "num_comments": 52,
        "comments": [
            "About $70",
            "125 should be your starting point for negotiation but be ready to come down",
            "You have to go by parts specifically, the GPU is around 70-80 and the Ryzen CPU is still 60, the 240gb SSD is roughly 30, and 2tb HDD is roughly 50 used, the ram is maybe 20 \n\nRoughly $245 brand new, if that PC is in perfect condition, then it could go for a decent price, but this doesn't include the case, motherboard, power supply, fans and heat sync and the extra things that came with the PC, so for a decent guess the motherboard is probably 30 used, fans 15 and heat sync 10\n\nAdding 55 \n\nFor a grand total of 305 \n\nIf I was negotiating with you I'd try to drop it to 200, if I was trying to low ball you I'd drop my offer to below 100-150, this is a decent PC even being so old\n\n\nI know this all from legit Googling the parts prices and looking at specifically newegg.com where a lot of new and used PCs/parts are sold. If you could take the time I suggest you look yourself before losing out on a lot of money.",
            "200-250€ MAX",
            "$50",
            "I would pay you to keep it.",
            "Free if they need 2 pay shipping. Recycle it yourself,",
            "One potato",
            "150€/USD",
            "$3.50",
            "Given your specs, and because it's a Cyberpower brand (I've had them before in the past \\[they do NOT last\\]) and 28+ years in IT, I'd give you US $150.00 for it (if it's brand new in the box)..\n\nBut I wouldn't want it :)\n\nI'd give it away to someone",
            "about 200 euros",
            "200",
            "Fiddy",
            "Considering that the 8GB variant of that 580 goes for ~50, and the 2600 is also ~50, the mobo might push it up to ~130. Sorry but the SDD and 8gb RAM are almost worthless, ~20 for both. All in all maybe $150 on a good day, but realistically u should settle for 120",
            "40 - 180 bucks at best.\nUnless you find a fool that would pay more for it by the looks of it.\n\nHardware is too outdated to be taken serious.\nAs an office PC however still an option.",
            "100 usd",
            "Broken ribs",
            "150? Maybe 200? Pc market is rough and it is used. I could build very similar new for 300ish",
            "Much less than if you just asked them to return it if you weren't going to be able to use it.",
            "I'd say 100 and below 200 max, at least in the US.",
            "Windows 10 license is worth 100 bucks, so I'd say 101$",
            "About 200 USD.",
            "2600, RX580, 8GB ram and a 240GB SSD (Crucial?) are all not expensive or parts that have much desirability. Truth be told, 200 is about right, but I would not be surprised if it will not sell for that. PC parts depreciate like craze, always have done and always will do (minus temporary crazies like the crypto boom).",
            "150-200",
            "200 - 250 USD",
            "Would consider it for 200$",
            "I was gonna say about 3.50, but then I saw that it comes with a 7 color gaming mouse, so I'm gonna go ahead and say $70.",
            "Between $210-$300, can also be specified that is new & unused, maybe can even get it close to $300 as it has no internal wear considering it wasn’t opened, the price of the GPU you have has dropped since then & the 2nd Gen Ryzen 5 being a few gens old names it in this bracket 👊🏼",
            "Add 8gig ram more and you can sell it easily for 250 euros",
            "I'd say like 300-400 USD (on the high side, realistically more like 200-300).\nIt was great back in 2018-2019 but now it's a bit outdated. However, for basic 1080p gaming it's more than fine. Also no ram speed listed.",
            "Without clear specs like memory speed and timings it is like selling a car that has four wheels and a windshield",
            "atleast 400 bucks if you find a kid who want's to play fortnite lol. but maybe 250-300",
            "This is about right. Though you have to admit it’s a good upgrade platform. Bios update, 5000series ryzen, 16gigs of ram and a decent used cpu and … a new case and some fans and a new PSU and… hey at least the Mainboard is reusable. 😂\n\nEdit: just noticed. If the marketing team is mentioning the „adjustable RGB fans“ (which is like all of them), you know they are really struggling. 😂",
            "Ya 70 for the GPU lol",
            "60-90€ is for 580 8gb here so yeah",
            "yo op he is helping",
            "For 60 you can get a 3600. That SSD is 15 used.\n\nThis is a proprietary hot box.\n150-200 is the absolute max.\n\n Lower if he really wants to sell it.",
            "$320.99 is apparently the brand new Price try to sell if for 250-300 lol",
            "Too much",
            "And there it is 👍",
            "I bought a cyberpower pc in 2008 and believe it or not it still worked before i tossed it a few months ago.",
            "It's worth like $120 Max. $300 is crazy",
            "300-400 USD is an insane price for this man what the hell",
            "When the right hand side of \"features\" is fans, flashy lights and support you know it's trouble.",
            "Whats wrong with the case",
            "You can get the 8GB version of that GPU for less!",
            "It looks like one of those cheap Chinese „gaming“ cases which are basically just pimped cheap office pc cases with abysmal airflow.",
            "Where? Im genuinely asking please let me know",
            "yo where can u get this",
            "AliExpress. There's soyo and Elsa, which are well known. But beware, these are 2048sp and have been mined.",
            "AliExpress, those are the 2048SP version but still great price to performance ratio and with 8GB of VRAM actually usable today compared to just 4GB.\n\nAlso just looked over on eBay (Europe!) and there are a few non 2048 580's for $50 - 60"
        ]
    }
}