{
    "Verify as professional": {
        "title": "Verify as professional",
        "score": 39,
        "url": "https://www.reddit.com/r/Construction/comments/18xlfes/verify_as_professional/",
        "content": "Recently, a post here was removed for being a homeowner post when the person was in fact a tradesman. To prevent this from happening, I encourage people to verify as a professional.\n\nTo do this, take a photo of one of your jobsites  or construction related certifications with your reddit username visible somewhere in the photo. I am open to other suggestions as well; the only requirement is your reddit username in the photo and it has to be something construction-related that a homeowner typically wouldn't have. If its a certification card, please block out any personal identifying information. \n\nPlease upload to an image sharing site and send the link to us through \"Message the Mods.\" Let us know what trade you are so I know what to put in the flair. \n\nLet us know if you have any questions.",
        "num_comments": 78,
        "comments": [
            "This is super funny.   If there was a sub that seemed like it was for pros only it wouldn't be this one. R/ Homebuilding 99% for diyers giving bad advice to other stupider diy ers.  R/ Construction.  65% diyers giving bad advice to 35% construction alcoholics unwinding and getting feisty at the end of the day.  Maybe you should have to take a pic of your beer to get the diy mods to know your a pro.\n\nCan we talk about monopoly framing now.",
            "Let the DIYers in. It’s entertaining to us and possibly helpful to them if they can sort legit advice out of the board stretcher replies. \n\nA couple years ago r/electronics cracked down on “dumb questions” and now there’s a separate questions subreddit with a dickhead moderator who responds to every question with some snide-ass reply. One good subreddit became two of inferior quality. \n\nIf you really want to make a difference in the world create a collar tie knowledge test that must be passed before giving structural advice on stick framed roof systems.",
            "Big “NFL refs blaming the players for announcing the wrong number” energy right here",
            "Can you get rid of that guy who keeps classifying people as either contractors or homeowners, he’s nuts",
            "You're telling me you can't tell a customer question from a pro question?",
            "It's pretty easy for me to tell. Asking something every man in the field knows like \"are these cracks above the door safe\" or \" I put rubber on my foundation when the whole yard slopes towards my house, but don't understand why water is still getting in, but by the way I'm a landscaper\"   \n\n\nMake me mod. I'll ship these homeowners out by the bucket full",
            "Is this a joke? Like for real.. is it? If it’s not, this is so dumb. Let the homeowners and DIYers ask their questions. We will sort them out as we see fit.",
            "Copy of my LLC’s liability insurance work?",
            "[deleted]",
            "I'm posting here to see if the mods will listen. I followed this page when my wife and I bought our first house. The posts used to be real-life advice and responses to real issues. Recently, this page has digressed to construction-fails with zero context or blowing up real folks just asking for help. Did I miss a recent change in what this page is really for? It's now more like twitter/x type posts only looking for clicks or clout. Please enlighten me.",
            "Would my osha card and picture of work truck be enough?",
            "Then tell people where to post their homeowner questions please?! ",
            "So here's an issue - all my jobs have NDAs where I can't share photos (critical infrastructure, etc.). How does this work? I also don't really want to get doxxed as well if I share a P.Eng number.",
            "How can I verify myself?",
            "I sent a Massage by the Mods a pic and you haven't expressed interest.",
            "Thank you for addressing this issue. It's crucial to maintain the integrity of the community by ensuring that professional tradespeople are accurately represented. I support the idea of verifying with construction-related images or certification cards featuring the reddit username. It’s a practical method to differentiate professionals from homeowners. I'll make sure to follow the outlined steps and appreciate the clear guidelines. If there are any updates or changes to the verification process, please keep us informed. Thanks again for helping to maintain a professional standard in the community!",
            "Not sure how to share a pic on here, but I specialize in restoration work, primarily termite damage restoration.\n\nI am licensed I can email you my verification",
            "I think the verification should be username written on your pack of cigs or lost Mary sitting in the work truck next to your one hitter (or bubble😂) with at least 4 days worth of fast food wrappers on the floorboard in the background, and then comes the test question. “What is the purpose of an afternoon safety meeting?” Or maybe they are shown pictures of nasty ass fat women and told “this is my sister, would you fuck er?” Which as we all know, there is only one right answer. Or take a shitter selfie completely drenched in sweat. This way you keep out the real goofs who just stop by a job site on the way home after a long day at the T-Mobile store.",
            "Do I need to do this to make a post?",
            "Construction workers have the best job.",
            "If the rules are going to be enforced, I'd like to see them all enforced and not just bring the hammer down on homeowners. There's been one particular poster recently who seems to be in repeated violation of #1 and #9...",
            "Can I just link my instagram for verification? If so...\n\n Www.instagram.com/@joellehuntsberry",
            "awesome thank you.  Will do it with happiness.  Now get the r/carpentry mods to do it.",
            "I'm not an alcoholic but matter of fact I'm drunk tonight and I'm always angry and need to vent as I run reconstruction for a national restoration company that works with tpa's evidently I'm now in multiple states and some mit. F'k yeah I need to unwind and tonight I realized I was in a pissing match with 6 m'frs that shouldn't be trusted with extension cords over electrical. Then again maybe I just should have called it a night by now. Now some smart ass wants to see my credentials?",
            "At the end of the day? What do y’all do while your at work?",
            "I agree with you on r/electronics, but respectfully disagree on the DIYers here.  They are annoying.  Have one thread that they can post questions on, without spamming the whole sub.  \n\nI used to be more open minded but the stupidity and repetitive questions are really annoying",
            "> let the DIYers in\n\nFull disclosure, I’m an instructor far more than I am an operator now. Mostly MEWP. \n\nI do classes weekly, from skill levels varying from 30yr veteran operators, to 30m greenhorns, in the same room. \n\nI make a point to say this - and I encourage questions and input because of the diverse group. And after thousands of trainees, I still get questions from both sides that I’ve never thought about before, vague ansi code, etc. It makes me better as an operator, and an instructor. \n\nPoint being, it’s a seriously dangerous quality to thing you know everything and commit yourself to not teaching others.",
            "It was certainly a mistake. Not blaming others. Just looking for ways to make it easier. Tough to tell sometimes with residential work whether someone is working on their own home or someone else's.",
            "There are some, yes. Here's two recent examples:\n1. Person posts a photo inside a house and asks if its asbestos.\n\n2. Person asking how much it cost to install a Murphy bed. \n\nBoth were made by professionals.",
            "just ask a question about our lord and savior Milwaukee.  We milwaukee construction guys will loudly start proclaiming gods truth.   The Dewalt people will strongly point out how wrong we are.  And everyone outside of construction will wonder why we care so much.",
            "This is not a requirement. This is an option. \n\nThis subreddit is not for homeowners and DIYers. They can ask questions in the sister subreddit /r/AskContractors. Industry professionals who want to see and participate in those discussions can go on that subreddit as well. Its not either/or. This provides more organization as not everyone wants both.",
            "Only if it's a $2 million or more GL, we don't do this $1 million policy holder crap 😁",
            "The one i mistakenly removed was not a personal DIY project. It was for their work. Tough to tell sometimes when its residential.",
            "Don't think you're gonna get an answer lmao",
            "This subreddit is intended for construction professionals. Some posts are silly like memes, portapotty humor. Some are serious like career advice. \n\nThe number one complaint since I became a mod on this subreddit were the numerous homeowner/DIY type of posts. We average over 250 complaints a month on this, far and above any other reported post reasons.  There are other subreddits more suited for these types of posts such as /r/HomeImprovement or the recently created /r/AskContractors.  Thats the beauty of reddit; you can filter what posts you see based on which subreddits you follow. \n\nThat being said, there does seem to be a recent increase in bots reposting short video clips which we're starting to address now.",
            "Yes",
            "Perhaps hardhat on top of a piece of paper with reddit name? Can edit out the P.Eng number and name in photo as long as reddit name is visible in background. Chances are people not in the industry won't have anything with a PE stamp on it.\n\nAlso open to other suggestions",
            "The instructions were in the post you replied to.",
            "Clearly not ☺️",
            "Can you point out the poster? Use \"message the mods\" if you prefer. If things don't get flagged/reported, chances are I don't see them, especially if it's in posts with dozens or hundreds of comments.",
            "Have you tried permaban? I get one every drunken reddit experience.",
            "It’s often hard to tell the difference between construction and construction. Honestly, people should come to this sub for knowledge when doing a project no? Or should they go ask other homeowners that diy’ed stuff the wrong way? I never really understood that.",
            "A professional would know that you'd have to test it to confirm if it is ACM. At least by PLM.",
            "People in the trades do have a back-and-forth about that. I don't really care though, and I don't think anyone here is going to say I'm a homeowner",
            "My husband is a Milwaukee nut and I’m all out Dewalt. We each have our own tools and trailer set up. It’s a battle of wills lol. We do restoration mostly termite damage…makes for interesting work for sure. We get everything from just some damaged trim to entire walls and so on.",
            "I have Milwaukee tools but will always use Dewalt angle grinders. The Milwaukee ones are not great. ",
            "This is literally Reddit. Anyone can post anywhere. Yes the mods can delete or regulate as they see fit, but my point is that real tradesmen will recognize real tradesmen. Also if we see someone asking a genuine question that we can help with, we totally will. If we see someone being a dumbass, they came to the wrong subreddit and we will probably call them a dumbass. I think the idea of “identifying ourselves as tradesmen” is absurd. It comes out in the wash bro.",
            "Hey, some of us only do low dollar resi work.",
            "Bummer, we work on 10 - 40 million commercial projects and only have insurance for 1m",
            "How do I prove that im a former contractor. And now a projectmanager in the same field. And im from Denmark?",
            ">NDA\n\nSent. Keep in mind, I also sub in as a Super as well depending on what my team needs so kinda curious as to what title I wind up getting lol.",
            "Oh yeah anything news and entertainment long ago.",
            "So r/plumbing is open to the public. We have a lot of good people giving good advice over there as well as a ton of homeowners who just decide it's a good time to spout out whatever bullshit they want. Half the threads you go into, there are a bunch of mouth breathers saying \"use Teflon on compression fittings\" or \"my local plumber doesn't charge that much, yours should charge less\"\n\nWe had a wave a couple weeks back where one person posted about a toilet with a crack in the porcelain. Lo and behold everyone who had cracked toilets said \"what about mine\" and it got to the point where threads were being made by pros saying \"if your toilet is cracked, replace it. Stop asking if it needs to be replaced, replace it\" for a week all it was, was pictures of cracked toilets even though every answer was \"if it's slightly cracked at all, it needs to be replaced\"\n\nI think r/construction would go downhill quickly if we started letting every homeowner post stuff like \"I paid a handyman $20 an hour and this is what he did, why is it so bad?\"",
            "That actually wasn't the intent of the sub, and doesn't seem to be the consensus currently based on opinions of posters voiced here.\n\nSubreddits are meant to organize posts. This one is aimed at discussing topics within the construction industry, whether it be something as serious as cost estimates or something as trivial as port-a-john graffiti. Participating in this sub doesn't prevent one from participating in another related sub.\n\nIf a lot of people feel differently, than it hasn't been voiced.",
            "that's funny.  That said, your husband sounds very wise",
            "huh.  I've never had a problem with them, used them a lot.",
            "Which is why this is optional. Dont like it, don't verify. It doesn't prevent you from posting. Some people like this idea, so why not.",
            "ACCESS_DENIED",
            "Is there anything construction-related you can take a photo of and have your reddit username written on a piece of paper within the frame of the photo? Could be a photo of a construction site. Hardhat? A full size set of drawings? I am open to suggestions.",
            "I feel like r/construction is already full of homeowners.  I get the stupidest responses to some stuff I post here.  Sometimes its 3 obvious construction guys getting downvoted, and a bunch of homeowners having fits at our truth",
            "if your toilet is cracked what did you eat?",
            "Yeah I see your point. And I will be glad to make a post over on that sub next week. The plumbing  in my crawl space is atrocious and needs some tlc. Slowing down my encapsulation project.",
            "Here's a sneak peek of /r/Plumbing using the [top posts](https://np.reddit.com/r/Plumbing/top/?sort=top&t=year) of the year!\n\n\\#1: [3 year plumbing apprentice, how did I do?](https://i.redd.it/3xrk5nimmqeb1.jpg) | [2248 comments](https://np.reddit.com/r/Plumbing/comments/15c348k/3_year_plumbing_apprentice_how_did_i_do/)  \n\\#2: [How screwed is my landlord?](https://www.reddit.com/gallery/15egy0h) | [3094 comments](https://np.reddit.com/r/Plumbing/comments/15egy0h/how_screwed_is_my_landlord/)  \n\\#3: [About lost my apprentice today to these damn things. Ya’ll take it easy on these things, drink WATER.](https://i.redd.it/d35w9zqd409b1.jpg) | [2094 comments](https://np.reddit.com/r/Plumbing/comments/14mcpj3/about_lost_my_apprentice_today_to_these_damn/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
            "Honestly dude, asking for verification on an anonymous professional forum is obviously completely invasive and the top comment in this thread - mine - is openly mocking you for passing out consequences to the sub’s users for your own mistake. Internet verification is for gonewild and roastme. “Prove you’re a pro” is just gatekeeping. I’m going to unsubscribe because this is a Moon-sized red flag for the future of the sub, but maybe getting this reply directly will cause you to pause. Like, in my mind this is playing Captain Obvious, but you have a WAY bigger problem with racists and unsafe workers on this sub than you do homeowners. \n\nYou do you, Elon Jr.",
            "I agree strongly.  I used to be much more open minded about homeowner posts, but the stupidity drives people like me away from the sub.",
            "But what is the true purpose? Why? Like I said, we can tell who is who. Maybe you should just add a requirement in the “rules” that if you’re not a tradesmen, don’t post here? Then it would be your problem, not ours.",
            "Ill send you some pictures tomorrow. \nFrom my hardhat, drawings and from my current project",
            "What is the opposite of taco bell?",
            "Not everyone can tell who it is either. We get a lot of false reports. We've removed posts that were by professionals but just seemed like they were homeowner posts, especially if they do residential remodel work. Posts by verified people won't get removed if they seemed borderline DIY/homeowner.\n\nNo homeowner or DIY posts are in the rules. \n\nI'm still not sure why you're against something that's optional that doesn't affect you if you don't participate.",
            "Cheese....lots of cheese..."
        ]
    },
    "Moderators Wanted": {
        "title": "Moderators Wanted",
        "score": 3,
        "url": "https://www.reddit.com/r/Construction/comments/1dkvy13/moderators_wanted/",
        "content": "/r/Construction is looking for new Moderators.\n\nIf you're a working professional in the construction industry and would like to help our existing moderator team please consider joining us.\n\nPlease use the link below and add a short message about yourself, your previous moderation experience and anything you think we should know when considering your application.\n\n[Apply for Moderator.](https://www.reddit.com/message/compose/?to=/r/Construction&subject=Mod%20Application)",
        "num_comments": 0,
        "comments": []
    },
    "Best Helper": {
        "title": "Best Helper",
        "score": 310,
        "url": "https://v.redd.it/bws4uuzsix7d1",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Real good boy!",
            "Wouldn't get much actually done but it would make for way better days with a dog on site.",
            "Good doggy.",
            "Good doggy.",
            "Aawwww.. I want a dog without the responsibilities",
            "Isn’t that green wood PT wood which contains nasty chemicals?",
            "Isn’t your phone screen burning your retinas? Live a little."
        ]
    },
    "My arms vs my legs": {
        "title": "My arms vs my legs",
        "score": 210,
        "url": "https://i.redd.it/6rl9ozdkv18d1.png",
        "content": "",
        "num_comments": 32,
        "comments": [
            "omg I thought you arm was resting on a rock",
            "Switch to long sleeves",
            "After working outside, everyone tells me “wow you’re so tan!” \n\nLittle do they know.",
            "You need to give that Caucasian fella his legs back, my friend.",
            "Why do you have a pic of me???",
            "I went to an octoberfest event and wore lederhosen, it was like I had a fluorescent bottom half. I think I blinded everyone.",
            "My man please be careful. I worked construction and looked like this. Now have melanoma.",
            "I wonder what percentage of this sub could take this exact picture? I know I could.",
            "That's called a farmer tan, son",
            "The struggle is real, lol.",
            "Anyone else look for picture #2",
            "I wound up a foreman hanging iron when I was in my twenties. We were installing sheets on the roof of a boat storage. It was 400' long. I worked the front and had the bosses buddy screwing down sheets on the backend. Called him Dandy Dan , he saw himself as the lady's man, anyway l looked back and there's Dandy Dan, screwing down sheets in nothing but Speedos and tennis shoes on. I was like what the fuck Dan? He said \"you know I hang out at the pool in my apartment complex, I don't want the girls seeing tan lines on me\" I blew a gasket.",
            "Perfect",
            "Florida?",
            "I swiped to see your leg. That’s invisible",
            "Yep.",
            "When was the last time that your balls saw the light of day?\n\nJokes aside, I’m also like that, just not to that extreme.\n\nI’m naturally tanned, but all this years working indoors made it more obvious which parts of my body aren’t as tanned as the others.",
            "I see nothing wrong here",
            "You are not alone",
            "Damn, my guy doesnt know they make shorts for men too",
            "Yep",
            "Hello fellow Irish man 🤣🤣",
            "Skin cancer has entered the chat",
            "That's a hairy rock!",
            "Dude I did not see the leg without my glasses",
            "It even cools your body wearing long sleeves.  100% the way to go.",
            "Got laughed at last week when I put sunscreen on before a roofing job. Enjoy looking 70 when you're 45 fellas. I hear skin cancer isn't great.",
            "Melanoma is a serious thing, speciall fo ur on constructions",
            "Only If it’s Florida and commercial construction. The resi boys just work in shorts…",
            "People worried that they are destined for melanoma treatment have downvoted you.  Guys, you can't out tough cancer.  Wear sunscreen or long sleeves.",
            "actually. yah. i dont know why you are downvoted.  OP.  you should go to a dermatologist.  that type of damage...  you are at real risk for melanoma."
        ]
    },
    "18 years working for others and I'm on my 1st build as a licensed contractor for myself. ": {
        "title": "18 years working for others and I'm on my 1st build as a licensed contractor for myself. ",
        "score": 309,
        "url": "https://www.reddit.com/gallery/1dljzio",
        "content": "4.5 days 2 framers one labor slowing us down. Studs came 10 ft bundles for 9 ft walls. My gc dropped the ball. 42x100 with a 4/12 roof. Rolling trusses Monday after we finish sheeting the walls. Interior partition walls will hang from the trusses and float from the slab. ",
        "num_comments": 49,
        "comments": [
            "Dude congrats. Everyone of us is has fear of taking the leap! Keep quality over quantity and you will make a name for yourself",
            "Never hears of partition walls floating from the trusses like that. Sounds interesting, how do you tie them into the slab? \n\nWhat's the purpose for it where your at?\n\nAnd did you have to engineer you trusses to hold your wall weight, also curious how that's attached to trusses?",
            "18 years ago the  EDMONTON oilers played for the stanley cup in game 7 AND SO TOO DO THEY THIS YEAR.\n\nLETS FUCKING GOOOOOOOO",
            "you can never stop working for the man",
            "You gonna be ok with the foundation height/drainage? Seems low but might just be the pictures messing with my eye.",
            "Man I wish I knew how to build things like this.",
            "Congrats! I really should try for my GC license",
            "You got this! All the best!",
            "Congratulations!",
            "I have a huge fear of trusting subcontractors to the point it hinders me sometimes. How do you take that leap and give new ones a chance?? Or was your sub network from when you were working for others ? I end up doing it myself but now I need to sub things out as I get busier lol",
            "Man 4.5 days for that is…not ideal",
            "Thanks man!! I was pushed to do it with my lax job ending due to boss moving. I wasn't gonna go work for anyone else. Glad I did it! Did a few remodels without licensing but it's on now!",
            "Top plate of the wall hangs from trusses. 1.5 to 3\" gap between bottom plate of wall to a pt plate shot down on wall layout 10d spikes hold wall aligned plumb. Colorado has a soil called bentonite clay. It heaves slabs. Footers are under the walls shown in the Pic. They all need sheared with sheeting still. And trusses are engineered to hold it yes. This whole project is engineered.",
            "My guess is he intends to do the partition walls like a basement finish out.  Block up the sole plates 1/2” off the slab, pin in place with Ramset shots, remove temporary blocks.  Lets the partition walls float in place with no structural bearing.",
            "I'm not even an oilers fan but go oilers. Fuck the panthers!",
            "The man is different. Lol",
            "Not my problem. I'm just a sub on this building it. But it's not in a flood zone and it's about 6\" above grade",
            "I bid it for 3 weeks framing. I'll profit plenty. Also the plans have issues I had to solve on site. 300 ft of walls ain't bad. Been in remodels last 6 months",
            "Can’t believe this is getting downvoted. Don’t know who’s framing for y’all, but this is two days of work with a competent lead/super and two framers under him",
            "Love it. I always get told i need to start my own business. I just am scared tbh and my bosses treat me well. I dont blame you i hope you prosper brother!  If you are ever in the pnw let me know i got hvac connections all around.",
            "Oh, word. :)",
            "When plans are right and windows are where they're supposed to be it's alot faster. It's 95 degrees and I'd rather sit back smoke a joint and stay busy. I'm not a framer. Just a carpenter whose built customs for other people. You have no work on your page I won't consider you a threat",
            "One day of work if you study the plans before showing up and smoking a joint",
            "I was born in grants pass haha",
            "You didn’t spend time with the plans at all before you started? And fair the heat affects shit alright, but if you’re framing a place all your money is predicated on the speed with which you do it. Do your thing, but it’s not impressive so I don’t get why you posted it. ",
            "I'd put 5k down saying no 2 framers are building a 42x100 in a day. Lmfao get outta here! My 3rd labor guy did anchor bolts and window sills. 2 guys framed and squared and plumbed walls ready for trusses damn near.",
            "Go Ducks!",
            "Lmfao. Bid for 3 weeks. Framing. 3 weeks metal siding and roof. My 63k paycheck when completed is kind of impressive for my first project as a contractor. You're a buster bud. I've built mansions in Alaska, Oregon, colorado. Never been outrun on the job. Outsmarted as a kid but not out worked.\n\nAnd again. Numbers on the plans were not correct. Studying the plans would've made it worse.",
            "“Studying the plans would have made it worse.” You don’t know what you’re talking about. You study the plans so you catch the mistakes. And cool you housed them on the amount of time, but it’s still not impressive work",
            "All the numbers in your comment added up to 69. Congrats!\n\n      3\n    + 3\n    + 63\n    = 69\n\n^([Click here](https://www.reddit.com/message/compose?to=LuckyNumber-Bot&subject=Stalk%20Me%20Pls&message=%2Fstalkme) to have me scan all your future comments.) \\\n^(Summon me on specific comments with u/LuckyNumber-Bot.)",
            "Is Alaska nice",
            "It’s his first job looking a set of plans give him a break. 😂 Sounds like an ignorant SOB for his first job out on his own lmao atleast Reddit can give him an applause for not getting a whole lot done and smoking a joint\n\nPoor guy said his GC dropped the ball because he had to cut wall studs. Put the joint down rack em up and gang cut those bitches yourself LFG",
            "PM I work with lived in Alaska for over a decade. She loved it, but from the sounds of it the weather is so shit it would be miserable for most",
            "Not my first job as lead. Just first big job as a business owner. 300+ ft of walls with walls straight a d laid out ready for trusses? 2 hrs of sheeting and it's ready for trusses. I'll take the reddit negativity. You're the only 2 complaining",
            "What was the weather like",
            "It’s not a big job boss and about as simple as it gets. Slab on grade, one wall height and trusses. Good one to cut your teeth on just going out on your own. Im not complaining just giving you a hard time. You’re a carpenter, I’m a framer, I have to give you a hard time it’s in my nature. Your work looks good and I like that the headers are held up to the plates. The engineering sounds weird but I don’t work in Colorado. We use Simpson STC clips or fasten master NLBs to allow for truss/wall movement where I work. Never hung a wall off the trusses and let it float on the ground before in 15 years of framing on the west coast. I’d be interested to see that detail up close when it’s done",
            "Mostly tropical.",
            "This isn't my first one. It's my 7th as lead in my 18 years as a carpenter. Not bragging in any way. My dad is a contractor I was under his wing at 15",
            "Really? Where is it freezing cold 24/7? Maybe the Yukon Territory in Canada?"
        ]
    }
}