{
    "r/ContagiousLaughter has a discord server!": {
        "title": "r/ContagiousLaughter has a discord server!",
        "score": 34,
        "url": "https://discord.gg/VruY5kvcmc",
        "content": "",
        "num_comments": 38,
        "comments": [
            "![img](avatar_exp|168247521|winner)\n\nI am definitely interested in this community",
            "Really appreciate, I am joining it.",
            "😊😊",
            "[removed]",
            "Awww beautiful ",
            "Puke. Where's my nail-studded club?",
            "Seal's like 'Bro, you heard the one about the fishnet?' Get it? Cause, ocean.",
            "[removed]",
            "![img](avatar_exp|164576676|heart)",
            "![img](avatar_exp|164958354|clown)",
            "![img](avatar_exp|164958354|bravo)",
            "![img](avatar_exp|164958354|clown)",
            "Me too.",
            "Looking forward to seeing you there!",
            "hey!",
            "And it's also filled with actual humans, and not spambots like you, u/FearlessThroat89. Begone.",
            "![img](avatar_exp|154183670|heart)",
            "![img](avatar_exp|144607175|bravo)",
            "![img](avatar_exp|150247823|bravo)",
            "![img](avatar_exp|164958354|bravo)",
            "[removed]",
            "Your submission has been removed because promotions, advertisements, and spam are not allowed. \n\nPlease refrain from spamming in the future. Thank you!"
        ]
    },
    "Dad gets stuck inside the swing": {
        "title": "Dad gets stuck inside the swing",
        "score": 355,
        "url": "https://v.redd.it/p0hy5dfb838d1",
        "content": "",
        "num_comments": 20,
        "comments": [
            "**Please report this post if:**\n\n* There is no audible laughter involved\n* Video is funny because of a 'joke' or situation - not the actual **laughter**\n* There is no audio (Images & GIFs included)\n* Laughter is edited in from a different source\n* No timestamp in the title for a laugh occurring at specific time (long videos)\n* Laughter is not on good terms (dickishness, bullying)\n* It's a compilation\n* It's a selfie reaction\n\nRead more about the [rules of this subreddit here](https://www.reddit.com/r/contagiouslaughter/about/rules/).\n\nWe have a discord server!! Join us here: https://discord.gg/VruY5kvcmc\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ContagiousLaughter) if you have any questions or concerns.*",
            "It was the way the woman came 'running' over that took me out.",
            "Good thing someone was close by. Was gonna say it’ll be real awkward when a grown man starts to take his pants off while riding a kid’s swing. \n\n“Officer, I was just trying to get unstuck!”\n\n👀",
            "It's very refreshing to have a video that isn't just a clip from the infinite dimension of podcasts.",
            "Can't say I haven't been there! 😂",
            "this is too funny. ahahaha",
            "We have entered the zoo panda stage of our evolution.",
            "call the emergency services )",
            "Kid in heart, toddler in brain.",
            "For a perfect finale he just needed to forcefully push the swing away in disgust and get clonked on the swede.\n\nCome on swingman, we love happy endings.",
            "Right? Like a real life cartoon character",
            "That's how most people run barefoot over gravel.",
            "When he finally gives up and lies down and the woman just can’t hold it in anymore, that sent me.",
            "Thank god for your comment, I was about to forget this was Reddit haha",
            "Oh my god, I see it. You're right! 😂"
        ]
    },
    "Hamuk": {
        "title": "Hamuk",
        "score": 3875,
        "url": "https://v.redd.it/keef3f0txy7d1",
        "content": "",
        "num_comments": 178,
        "comments": [
            "**Please report this post if:**\n\n* There is no audible laughter involved\n* Video is funny because of a 'joke' or situation - not the actual **laughter**\n* There is no audio (Images & GIFs included)\n* Laughter is edited in from a different source\n* No timestamp in the title for a laugh occurring at specific time (long videos)\n* Laughter is not on good terms (dickishness, bullying)\n* It's a compilation\n* It's a selfie reaction\n\nRead more about the [rules of this subreddit here](https://www.reddit.com/r/contagiouslaughter/about/rules/).\n\nWe have a discord server!! Join us here: https://discord.gg/VruY5kvcmc\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ContagiousLaughter) if you have any questions or concerns.*",
            "Hamuk is snail. \n\nEri Puk is Eri Silk, a domesticated silk worm from North East India.\n\nSource: I come from that part of the region.\n\nEdit: They are not saying anything specific to make fun of him. They are just laughing, probably because he is just recording stuff on the road, which is not a normal behaviour in that region.",
            "There making fun of this dude for waking around filming himself. As is tradition",
            "They're making fun of him because he is an attention seeking streamer, that's why",
            "[deleted]",
            "He thinks they're laughing about the food. They're just laughing at the white dude filming everything.",
            "This reminds me of going to the Silk Road Market in Beijing. I was literally only there to look around and *maybe* buy some trainers. One woman seller started laughing at my height (I'm nearly 6'6\") and walking behind me like King Kong or something. Then another grabbed my one of my ankles so I had to drag her as I walked like a toddler.\n\nIn about a minute I had a bunch of laughing women grabbing me and trying to stop me going past their stalls, with a crowd of onlookers laughing at me.\n\nOne of my favorite memories of China tbh but I was red faced at the time.",
            "Lmao, I loved her putting her phone up like she was recording him in response. You don't need to know what they're saying to know they are laughing at him.",
            "Now i want to understand the joke here",
            "Please explain to me",
            "The lady pulling up the phone pretending to film back is absolute gold",
            "eri puk",
            "They’re laughing at the dude, not with the dude.",
            "Keeda market, Nagaland?",
            "Oh man, their laughs are so deep.  I love it",
            "Ayyy this is definitely from somewhere in Nagaland, India lmao. English is their official language. Going to bet this is probably filmed in Dimapur, it's the first place you go to before you start your Nagaland journey. \n\nThese aunties are laughing because it's probably their first time getting filmed while being asked about the stuff they are selling. Without the camera they probably wouldn't have I assume. \n\nEri Puk is silk worm, Hamuk is snails. It's the same in Assamese, which is my mother tongue. The Dimapur market isn't for the faint hearted though, they used to sell dogs which was banned few years ago. From Hornet eggs, to toads to other wild animals, it's actually wild how varied their cuisine is.",
            "They are laughing because he is filming everything like a total derp.",
            "They're laughing because they are displaying the snails and worms they have plucked away from the fruits and vegetables. The display is both to have a place to keep them and to show the customer that they actually check the produce and remove any bugs they find.  They laugh because they don't understand his language and perhaps think he wants to buy them, or they laugh because they understand that he thinks they sell them or eat them.",
            "They are saying 'Foreign idiot' and 'dumbass'. Feel bad for him.💯",
            "Probably laughing because he’s a grown man thats never seen a snail.\n\nhttps://preview.redd.it/6ic7m3y7iz7d1.jpeg?width=460&format=pjpg&auto=webp&s=5425f3822e59caaf9e086176343f0015687967da",
            "Ah yes, ye olde “speak loudly and slowly until they understand me” method of international communication. Never fails.",
            "So, if I say Eri Puk, it means domestic silk worm. Not @#$%^&* in Telugu 😅",
            "Telugu people attendance",
            "The moment the lady in blue mocks him by holding her phone up like she’s recording and the accompanying laugh was terrific",
            "Banana Hamuk",
            "Lmao, never thought I'd hear \"hamuk\" on reddit.",
            "Stop sticking phones in people's faces just doing their jobs and living their lives - these people are excruciating.",
            "Dude doesn’t realize they’re clowning him",
            "What is that 🤔 \n\nHahahahhahahabh",
            "That huh got me",
            "They’re laughing at you bro believe me, you’re actually embarrassing yourself",
            "Man that last chick was definitely grilling him",
            "They are laughing because they know! 🤣🤣🤣",
            "Funny 😂🤣",
            "Greatest argument for hatred I've ever heard. I'm sold",
            "Haha",
            "That's a beautiful laugh",
            "Christ it’s irl [Borat](https://youtu.be/faXDCp0BDU4?si=120ZDn6F0RTOwMHn)",
            "r/guwahati",
            "I feel like the internet has a hard on for shitting on people recording. They think anyone who records themselves is an attention seeking whore who is destroying the peace and quiet and ruining everyone's life. Just some guy experiencing other cultures and learning and sharing it or documenting it.\n\n Then  these random ladies think it the funniest shit they've ever seen ,a guy not know they eat worms and shit and wanting to know, and just recording i guess they don't have tourists. Then everyone on reddit treats him like a fucking douchbag because he *check notes* wants to know what food a lady is selling that he has never seen before...wow.",
            "Is the joke that both of those items are considered good for \"male potency\" and he is probably the most attractive man they've ever seen in person?",
            "Shouldn't be normal behavior anywhere..",
            "Is this Kohima? I've been around here",
            "She even points her phone camera at him to mimic him and the guy's still clueless",
            "And we call it Shamuk 🐌",
            "I was going to say, they look like they're from NE India. Different language, but they definitely behave just like my aunties 😂",
            "Eri Puk in a couple states in India means crazy cunt. I'm not joking.",
            "Nagaland?",
            "It’d qualify as good old-fashioned mockery— and would’ve left a pretty nasty wound— if he had any idea what was going on. Still hilarious \n\nHe keeps saying ‘worms’ and seems to think that’s what they think is funny. Wild and crazy times \n\nCan’t believe he kept flipping his phone back and forth, onto her and whatever he was looking at, after she did her murderous  impression of his dumb ass phone face asking questions\n\nLove her expression when she gets up, deciding not to finish him. *lemme stop lemme stop*",
            "gahori xamuk 🤌🏽",
            "I have lived in Europe my whole life and have never seen anyone film like that here. I am pretty sure it's only normal in America.",
            "This needs to be the new standard",
            "They’re*",
            "They damn well should, pointing a camera and badly pronouncing the basic language is a bad look.\n\n\"WHAT IS THIS\" doesn't work better when you increase volume.",
            "yeah. trying to play it off totally candid w/ your gear in other's faces doesn't come off as natural I guess.",
            "Yep, from what I can read the vibe there is definitely not being friendly to say at the very least. What makes it worse is I think dude lowkey feels it but tries to play it off like he doesn't know they think he is a clown and is laughing at him, watching this cringes me out.",
            "Based",
            "Maybe, but they're still the ones selling worms",
            "Yes! Absolutely",
            "Next streamer I see, I’ll laugh and yell HAMUUUK and point at them",
            "I thought they were laughing cuz they didnt know what to say",
            "why",
            "Yea, they don't understand him (he asks several direct questions with no answer). 100% laughing at him for filming everything.",
            "Grabbing your ankle is wild",
            "Absolutely not. I'm kicking them in the face. Gonna carry pepper spray if I ever go there, not dealing with that level of insanity.",
            "He's walking around with a camera",
            "They're openly mocking him for filming himself and random strangers as that's not considered normal or polite out there.\n\nYou can see her mimicking him by holding up her phone at 10 sec and attempting to say 'Worms?!'.",
            "I think it's more like \"silly foreigner probably has never seen snails or silk worms as food lol\"",
            "I think I’d do that if some random tourist came to my farmers market, tripping balls over tomatoes and some other random common food stuff. WhAt ArE ThEsE?!?!",
            "Snails are called hamuk in their language.",
            "Eru puk",
            "Hamoook",
            "Bruv in my south Indian language it means \"dumb pussy\" lol. Not sure if it has the same meaning in whatever language they are speaking.",
            "Eri puk = silk worm\nHamuk = snail",
            "What are they saying",
            "bro nah, idk about the worms but those snails are def for eating its a delicacy accross SEA. given the fact that the worms seems pickled maybe they are eaten too (not common in my culture so idk, but the snails are def common)",
            "To have such confidence and be so wrong is amazing",
            "Is that what those words mean?",
            "I have never seen someone guess something do wrong",
            "No, the joke is a grown man shoving his phone into the faces of innocent people trying to make a living. \n\nThey find it hilarious how dude has 0 sense of respect.",
            "what???",
            "You still see people with their phone out in the public in Western countries. It's not that prevalent in NE India region yet.",
            "Easy to say for the Big-Worm- industry trying to void off the exposure of their own being sold.",
            "Oh no, Recording culture of others so bad! Edit: people downvoting this are taking their right to record in public for granted lol. You probably couldn't imagine a situation where you actually needed to record but wouldn't be allowed. A police is infringing your rights? Too bad, no recording in public... So much for freedom and rights but so ready to throw those beneficial rights in the trash because of mild annoyance from some tourists. Majority of worlds documentaries wouldn't exist with rules like that lol.",
            "Somebody hates freedom",
            "The video quality is not good enough for me to see the first two letters of the two wheeler number plate. That could tell us which state it is from.",
            "Yeah seems these ladies are speaking nagamese",
            "Yes , I recognise that place",
            "Are foreigners allowed in Kohima? I thought that at best they'd be able to visit Assam or Meghalaya and Sikkim. The other 7 sisters would require special permissions for outsiders no? Even OCI can't freely travel in NE india.",
            "Xamuk, isn't it? 😄\nNot sure how to explain the pronunciation of the 'xa' in xamuk.",
            "Yes but in a completely different state in an entirely different language.",
            "The guy clearly is not American",
            "Thank God you were here! I had no idea what that sentence meant before you came along and cleared things up!",
            "There were\\*",
            "Yup. This right here",
            "Eh, this is how everyone should act when they see a streamer out in the wild. They look ridiculous. Many of them have main character syndrome. He didn't ask if he could record them he just starts doing it. They were even nice enough to honestly and directly answer his questions before laughing at him.",
            "Proper Reddit comment, here. They're all just laughing, no one is laughing at anyone, they're all just having a giggle. There's no negativity.",
            "Well they understood him well enough to answer his questions accurately, but otherwise yeah they’re just laughing at him for filming",
            " He asks several questions in an awful, stuttering accent, and then expects locals to respond. They KNOW he's an idiot.",
            "Not even the weirdest thing in China",
            "I almost wish you'd seen it",
            "Yeah, fuck that.",
            "Yeah good luck pal",
            "👁📱👁 wOrmS",
            "Euugghhueurhuehue",
            "🤣🤣🤣🤣",
            "Came searching for this comment lol",
            "These appear to be North East Indians who speak a very different language. It's like how 'tikka' means diced/cubes food in one Indian language and 'butt' in another.",
            "Which language?",
            "+1",
            "They just said the names of snail/worm idg why they're laughing either tbh",
            "[deleted]",
            "I have no clue my good friend, hope i helped someway",
            "# KEEDA MARKET, NAGALAND",
            "No. Hamuk is snail and eri puk is silkworm. They are making fun of him for walking around recording his activities, I guess. Can't see any other reason they're laughing like that, unless he's dressed more zany than the locals are used to.",
            "To be honest, I never saw anyone ever doing that in vienna / Austria in the middle of Europe. I think it's (thankfully) just a us thing for now",
            "Literally no one suggested stripping anyone of their right to record in public, but go off.  Saying it shouldn't be normal behavior is like saying farting in public shouldn't be normal behaviour, which it isn't, yet it remains fully legal.\n\n\n\nEdit: Farting in public is like filming in public: one should do it discretely, infrequently, and as far from other people as possible.",
            "You wrote all of that and never thought “maybe people care about mutual respect.”?",
            "Just because it’s legal, doesn’t mean it’s nice.",
            "in a lot of countries filming people in public without consent is illegal - breach of privacy and you can get sued, especially if you post it online.\n\nyou can film police in public as they are public servants ( in most cases) just not allowed to share the video online.",
            "It's fucking annoying, yes.\n\nPut down the phone, live a little. You will never watch the videos or photos you have taken ever. People are just flexing \"yo check this out, I've been here\" <- blud no one cares.\n\n  \nEdit: I'm not from that area. I still hate tourists tho. The only way anybody can see the world now is through a camera lens.",
            "Wut",
            "Congrats! Your edit granted you few more downvotes.",
            "People also have the freedom to not be dicks but here we are.",
            "Yeah, could be somewhere else in NE",
            "Nope nothing like that",
            "I guess is the same as in the \"x\" in pinyin?",
            "More accurate :)",
            "Yeah u right. But i didn't say he was American",
            "There we're",
            "Intentionally debasing yourself just because someone is filming in public is insane. Just ignore it and move on.",
            "Your typical redditor would experience PTSD from this experience for years afterwards, going over it in their heads a thousand times asking themselves \"was this okay?\" \"did I forget to obtain a signed consent form from everyone on the street before i hit record?\" \"What will twitter think of me...?\"\n\nWhether they were making fun of him or not, I'm sure that everyone went home unscathed and forgot about it a few hours later",
            "It's very visible to people with a sufficient level of emotional intelligence.",
            "Fair, but I wonder if it is just the recognition of him calling an item a “funny name” compared to what they call it. They don’t seem to affirm his questions. \n\nI personally deal with a language barrier every day, so I was just commenting that I noticed that from experience.",
            "Telugu",
            "They're making fun of him for recording. That's why she held up her phone to his face while laughing at his face",
            "Not sure why you would make this comment. You didn’t attempt to help at all…",
            "I live in California and I don't think I've ever actually seen someone recording an interaction like this in real life, and I would be weirded out if anyone did it to me. Maybe teenagers do it? No idea.",
            "I went to Vienna and Salzburg in 2016 and there were a ton of people on their phones, doing all the same shit as everyone else. Selfies, food pix…Austria is no different, sorry to burst your bubble",
            "Where do people make calls? At home?",
            "Farting in public is normal behavior we just pretend that none of us does it. You guys really like lying to yourselves https://youtu.be/A3YXmlGvbl4?feature=shared",
            "Im going to finger an avocado in public",
            "Cry about it ill record my travelling all i want",
            "\"in a lot of countries filming people in public without consent is illegal - breach of privacy and you can get sued, especially if you post it online.\" most of those being dictator type countries that actually like to record you on state cctv and block you from voting and who have corrupt cops and officials pushing those laws to prevent documentation . if you can film police in public you can film anyone else try proving me wrong since you're making that up",
            "\"It's fucking annoying, yes.\" Just because you're annoyed that a tourist is documenting their trip doesn't mean their right to record should be revoked in a public place. What kind of dictator thinking is that \"im annoyed so he shouldn't be allowed to do that\". I definetly watch the photos and videos i have taken and its nice to share them with my friends, just like the photos and videos they share with me. And even if no one cared, so what? Go cry in the corner im gonna record anyway lol. Totalitarian opinions be like",
            "you really are trying your best to make me give a F about some internet up/downvotes lol i dont care",
            "This guy is just documenting his experiences to share with the public. Which is a basic human right as documented in the US constitution and other free countries as well. I'm sorry it makes you uncomfortable but so did civil equality and still does for a lot of people. Which does not make it right to despise people for doing something or looking some way that you are used too. Those who would compromise freedom, for comfort or security, shall have or deserve neither. You need some education and tolerance my friend.",
            "I am aware that it sounds like that ,but not what i meant",
            "Th'erew e're",
            "I'm not sure what you mean? Intentionally debasing themselves by physically mimicking what he's doing and laughing at him? Is that what you're trying to say? ...He can just ignore it and move on, no?",
            "Lol, no.",
            "I say this all the time. I have never seen someone out in public walking around making a video of themselves or getting in people’s faces. But go on here and it apparently it’s everywhere.",
            "That is NOT what I said. I know they are all doing that, but that's not running around recording their own interactions with random people",
            "/s right",
            "Wut again",
            "You talking out your ass... i think that all of european union has this law in place as well as most other european countries. It also goes both ways for normal everyday people and officials/goverment too.\n\nfor example if  as youve stated some tv crew films me, i can send a request for removal of the video. They have to by law, either remove the video or censor my face. If they dont do that you can sue them for breaching your privacy.\n\nnot only that any public live recording ( goverment /company street cameras etc) can be saved for only 48 hours, or its a breach of your privacy. Taking a picture of registrations and posting them online = breach of privacy, and i can go on and on....\n\nBut yes americqla has more freedom and no corupt cops cuz you are ao free 🤦",
            "He is not just recording his own experience though, he is recording his normal conversations with normal people for no reason at all. That's just incredibly rude and completely unacceptable if he didn't ask them beforehand which I highly doubt",
            "It’s not totalitarian to think that a person recording you is an asshole or to see and treat that person with absolute disdain and mockery.\n\nWhich is what I do.\n\nHonestly, recording like this is basically wearing a tee shirt with the words “Entitled dickhead walking” on it.\n\nIf it’s just you recording your friends, that’s fine though.",
            "Putting in a lot of work for ‘not caring’ lol",
            "> Which does not make it right to despise people for doing something or looking some way that you are used too. Those who would compromise freedom, for comfort or security, shall have or deserve neither. \n\nYou have the right to despise anyone for anything. That's freedom, brother. \n\nOP is condemning the behaviour, calling it not normal, and guess what - they have the right to say that and they are correct in their case. They're not going out of their way to remove this guy's freedoms in any way. \n\nGrow a thicker skin, realize the difference between people saying they don't like something and actually infringing on someone's freedoms and stop using these god awful cringe quotes like \"those who would compromise freedom, for comfort or security...\" out of context in topics that don't warrant it. Coupled with you telling people they need some education, it comes across as deeply ironic.",
            "[removed]",
            "Their're where'er",
            "....yes? he's replying to someone basically saying \"everyone should be an asshole to anyone who films in public\" like...why? \n\nfirst of all, this is not a big problem. I haven't ever once encountered someone like this. if I did, I would just ignore them and move on, doesn't affect me in any way, why would i go out of my way to be mean to them? \n\nsuper weird to spread a bunch of negativity for no reason, even weirder to encourage others to do so",
            "I guess on a planet of ~8 billion people if even as many as 20 million are doing something you're still not going to see it very often. And I don't think 20 million people do this.",
            "You understand not every American is a streamer right? Austria has streamers too. I know what you’re saying, you’re just wrong lol",
            "\"for example if  as youve stated some tv crew films me, i can send a request for removal of the video\" thats gdpr for a company. If i record you on a public place i dont need to delete it lol. You couldnt post any sources despite me telling you to so just be quiet and stop making those claims. Btw im european so i know our laws pretty well",
            "takes me 2sec to say idc",
            "Your submission has been removed. This is a happy place. \n\nPosts or comments not in keeping with the tone of the sub may be removed. This includes (but is not limited to) slurs, hostility, discrimination, and sexual comments.\n\nPlease be more respectful in the future. Thank you!",
            "B..but America bad!",
            "sure but the whole interaction would look completely different. aside from taking pictures and filming strangers being illegal in austria you’re gonna majorly piss of anybody you just start filming to their face so i can only assume that streamers in austria ask before they start filming",
            "the law is not only for companies its for every1. You are allowed to film and post it yes, but if i see myself in the video and request you to remove me from the video or censor my face you must do so or i can sue you.\n\nkeep talking out your ass tho 👍\n\nedit: here is the [said law](https://zakonodaja.com/zakon/kz/149-clen-neupraviceno-slikovno-snemanje) for my country Slovenia, feel free ti translate it with google.",
            "I think the biggest thing to bear in mind is that everything is set up and very few things are authentic. Including in America. The streamers here ask first too, because you can sue for “likeness” here. As in, “you used my image without permission and made money off it, so now you owe me royalties”.\n\nSo American streamers are also most often asking for permission first as well.",
            "I don't know how many ways people need to explain to you that just because the guy is American doesn't mean it's normal for Americans to do this. It's not legal in parts of the US either and people would not be super thrilled. This is an influencer being annoying.",
            "Wrong there is no expection of privacy in public area and your face in public is not private information. No one needs to delete it. I already told you that only countries with dictatorships have these authoritian rules. Find me a 1st world country with democracy that does this and then look at all the 95% of ones that don't lmao. Recording your travelling and culture of others fall under legitimate interest in gdpr so you're allowed to record the street with other people in it"
        ]
    },
    "Fishing with friends": {
        "title": "Fishing with friends",
        "score": 1152,
        "url": "https://v.redd.it/zibi7j0eo08d1",
        "content": "",
        "num_comments": 39,
        "comments": [
            "That’s the first time I actually started laughing out loud at one of these.",
            "This is fucking hilarious! I lost it when the board hit him.",
            "Flippin hilarious! The kicker was the plank towards the end LMAO",
            "It looks like a scene from a Winnie the Pooh cartoon🤣🤣🤣",
            "Fishing and laughing with friends is the best combination!",
            "OMG I’m cackling was not expecting the plank to the noggin 😂🤣",
            "what's so interesting about your fishing trip? \n\nJust an ordinary moment on a fishing trip with your best friends🤣😍:",
            "Hey! You don't want to do tha........ 😆😆😆",
            "omg, this one got me good 👍😂",
            "here hold my rod and watch this 🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣",
            "\"Que gordo boluuudo jajajajajaja\"",
            "Ass splinters are no joke.",
            "His tummy is probably very bruised too.",
            "I would love to fish with them, although I have never gone fishing.",
            "Fucking phenomenal lol",
            "After the board hits him: “ tell me you were filming that!”  You gotta have a sense of humor.",
            "Good way to start the day. Thanks op!",
            "Plank got me",
            "Even with the video muted I could notice they were fellow country men (Chilean).",
            "Honestly that dock looks like a stiff wind would have knocked it down in a couple of years anyway.",
            "Fucking loving this!!",
            "I think even the fish in the water liked it)",
            "Ole!",
            "The bridge punished the man twice \n\nThe first time when he grabbed and then started punching pieces of himself \n\nDon't hurt bridges, treat them with respect )",
            "Spirit of Risitas",
            "I want to be his friend so bad",
            "Holy shit this made me light headed…\n\nGood find!",
            "I feel that alcohol was involved",
            "Unpopular opinion : being fat is a handycap",
            "[Old repost](https://www.reddit.com/r/ContagiousLaughter/comments/inz4rd/never_trust_an_old_dock)",
            "Same! Great post OP",
            "I think any fishing trip with friends turns into laughter. Such fishing is not for fishing) Such fishing is for hanging",
            "*No pun intented*",
            "It's almost midnight after working a very long day, so I'm sleepy and expected to close-mouth smile. Did not expect to burst out laughing.",
            "r/CartoonMoment",
            "Yeah, that's a significant drop he had.",
            "Argentinos",
            "I….can’t stop watching and laughing it’s just toooo good! The friend at the end trying to poke his stuck friend 😝",
            "Ah xuxa. Me equivoqué 🫤"
        ]
    },
    "Denny or iHop?": {
        "title": "Denny or iHop?",
        "score": 2644,
        "url": "https://v.redd.it/p2ktbwqguy7d1",
        "content": "",
        "num_comments": 103,
        "comments": [
            "**Please report this post if:**\n\n* There is no audible laughter involved\n* Video is funny because of a 'joke' or situation - not the actual **laughter**\n* There is no audio (Images & GIFs included)\n* Laughter is edited in from a different source\n* No timestamp in the title for a laugh occurring at specific time (long videos)\n* Laughter is not on good terms (dickishness, bullying)\n* It's a compilation\n* It's a selfie reaction\n\nRead more about the [rules of this subreddit here](https://www.reddit.com/r/contagiouslaughter/about/rules/).\n\nWe have a discord server!! Join us here: https://discord.gg/VruY5kvcmc\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ContagiousLaughter) if you have any questions or concerns.*",
            "Is that Harland Williams?",
            "Ihop joke is gold.",
            "Is this the cop from dumb and dumber?",
            "It's like you're talking gorgonzola when it's strictly brie time baby!",
            "Do you work for this podcast by chance op?",
            "Harland is a better comic than 99.99% of comics ",
            "Legend!",
            "The nonchalant delivery of “Or was it sumpin’ else…” Got me good.",
            "This guy is never not on",
            "He is so quick",
            "Pull over!",
            "That man is a genius. I love him, his face lives rent free in my head.",
            "Watch Harland's old appearances on Conan. The man could break Conan into hysterical laughter like no other",
            "Harland does a weekly podcast you should check out called The Harland Highway.",
            "When ppl are funny but don’t laugh at their own jokes it makes it funnier for some reason",
            "This is the type of humor your uncle has and makes you keep laughing in the most inappropriate places lmao",
            "It’s Sonar!",
            "This man chose violence",
            "Dude I want that Danzig shirt",
            "6 min abs not 5",
            "Harland is amazing, and Jordan is fucking great too. I think people will be seeing much more of her.",
            "![gif](giphy|5zkLhCHTnX1za)",
            "johnjacobjingleheimerschmidt, BA LA LA LA LA LA LA",
            "He is so fucking quick.",
            "The most underrated.",
            "Are they brother and sister",
            "Is that the guy that made Puppy Dog Pals?",
            "he looks like saul goodman's father.",
            "Harland Williams absorbed the comedy midiclorians from Norm MacDonald's rotting corpse",
            "He's so goddamn funny",
            "Lol",
            "Herc! Herc!",
            "Oh wow the guy who drank the piss on Dumb and Dumber!",
            "He’s taking the hooks of there jokes and using them to make his own non-Sequitur",
            "Where has this guys been since Half Baked?? He’s so god damn funny",
            "What is this podcast plz?",
            "brooooo she's jackeedddddd",
            "I miss this kind of humor",
            "We are living in the best timeline.",
            "i was drinking coffee asshole. hahahahaha.",
            "She has voice of Vin Diesel",
            "This too murican for me to find it funny",
            "I don't get it. Does \"Denny\" sound like another expression that would make the \"I hop\" joke work? Is Ayhap/ Ayhop/Ihop a common first name? Is Denny a person working at Apple? Please help.\n\nI genuinely don't get the joke. I'm not Canadian or American by the way.",
            "American Tom Green",
            "[Step into my office!](https://www.youtube.com/watch?v=rb7FgSzeGqg)",
            "He came a LOLLOPIN ",
            "👍🏼🎉",
            "Ikr, I feel like I haven't seen this dude in 10 years. Then saw a clip of him on Joe doing a bit today and now this. Shit didn't know the guy was still doing comedy 🤣",
            "What about when he explained it immediately afterwards and then followed it up with some knee slapping middies, which he also went on to explain",
            "\"Get the hell outta here!\"",
            "No he the cop killer in half baked",
            "oh man...you should really check him out if that's all you know him from. one of the quickest wits in the game. He's having a resurgance after being a consistent guest on Kill Tony.",
            "No, he's the hiker serial killer from There's Something About Mary.",
            "What a great clip to promote Harland Williams",
            "Not atm",
            "Dude is just so effortlessly funny and chill. Seems like a good hang ",
            "If you watch his kill Tony episodes he is absolute amazing",
            "because he IS a comic. i dunno what the rest are doing.",
            "He somehow does that thing where you keep talking when you shouldn't and you just keep making it worse, except he keeps talking and the joke keeps getting better",
            "No it’s a cardigan, but thanks for noticing!",
            "Just like his godfather's face in his head.",
            "Maybe 4 people are going to get this reference, and I am one. I appreciate you for this. \n\n\"I don't hear everything, and I am very trustworthy!!\"",
            "Bein Ian with Jordan",
            "Denny’s and IHOP are both breakfast restaurants in North America. Hope this clears it up friend!",
            "But they’re both Canadian???",
            "Why",
            "No not six, I said seven! Who works out in six minutes?? You can’t even work up a good sweat",
            "Use your words",
            "It’s okay, we can’t all have a varied and interesting sense of humor",
            "You little pumpkin pie haircutted freak",
            "SAY HIS NAME!    \"....butternuts!\"",
            "He’s somebody’s bitch!",
            "Pop-pop-pop-pop-pop 🍿",
            "like you're on a break or something? Back in 15!",
            "Dr. Phil might have to take a 2nd place trophy because Harland is a god.\n\nI highly recommend [this podcast](https://youtu.be/dQUvis7r408) with Mark Normand on Harland's podcast. Without a doubt they are the best two riffers in the game right now.",
            "Harland roasting David Lucas was legendary.",
            "Very Norm Macdonald",
            "Killer boots man!",
            "Hella underrated",
            "Just a couple of lobsters duking it out",
            "Thanks!",
            "Holy shit, thanks. Clearly I would have never guess that. This guy thinks fast!",
            "TIL why Harland Williams reminds me of TomGreen",
            "Growing up in Toronto in the 90s…Harland was a staple of pride in the comedy scene. Green was from Ottawa, but Williams was homegrown.\n\nGreen was definitely more successful and probably a bit more innovative with his approach…but pound for pound, Harland knocked him out of the park when it came to comedy and wit.\n\nEveryone knew Tom Green…but when your friends said they liked Tom Green…Harland was always the guy to tell them about to one up.",
            "Because you’re fuckin’ fired.",
            "Cuz you're fucking fired.",
            "😢",
            "You suckin back on some of grandpas old cough medicine?",
            "Maybe one day? I dunno?",
            "What are these seatbelts made out of, cactus?",
            "The answer to the original question is \"No.\" by the way. You can add \"I'd love to work for them.\" but don't be all mysterious."
        ]
    }
}