{
    "Weekly Food Safety Questions Thread - June 17, 2024": {
        "title": "Weekly Food Safety Questions Thread - June 17, 2024",
        "score": 9,
        "url": "https://www.reddit.com/r/Cooking/comments/1dhug9b/weekly_food_safety_questions_thread_june_17_2024/",
        "content": "If you have any questions about food safety, put them in the comments below. \n\nIf you are here to answer questions about food safety, please adhere to the following: \n\n* Try to be as factual as possible.\n* Avoid anecdotal answers as best as you can.\n* Be respectful. Remember, we all have to learn somewhere. \n\n\\------------------------------------------------------------------------------------------------\n\nHere are some helpful resources that may answer your questions: \n\n[https://www.fsis.usda.gov/food-safety/safe-food-handling-and-preparation](https://www.fsis.usda.gov/food-safety/safe-food-handling-and-preparation)\n\n[https://www.stilltasty.com/](https://www.stilltasty.com/)\n\nr/foodsafety",
        "num_comments": 11,
        "comments": [
            "I'm marinading whole chicken leg pieces to have with rice later. My question is, is it safe to cook the rice with the left over marinade in a rice cooker?\n\nI'm basically wondering if a rice cooker gets hot enough to kill all the bacteria in the marinade from the raw chicken.\n\nThanks in advance.",
            "What is the best way to store and open package of bacon?",
            "I didn’t know I needed to soak my asparagus, I just rinsed it like a regular vegetable and roasted it in olive oil. It’s gritty so I think it still had dirt on it, can I wash it a second time and then throw it in the air fryer to heat it back up? I don’t want to waste it.",
            "I bought a lb. of skin-on salmon that consisted of two fillets.  I removed these from the plastic tray they came in and placed them in a glass container in the freezer.  Now they are stuck to the glass container.  I want to thaw and eat only one fillet and leave the other in the freezer.  Does anyone know how I can achieve this, considering that they're stuck to the glass container?  I figure I will have to thaw the container with both fillets inside at once.",
            "I just finished thinning my 3 yr old apple trees.  Is it safe to use the baby apples to make pectin? I am wondering if there is too high a concentration of cyanide in under developed apples.",
            "I just ordered some mussels (St. Jacob scallops) ate like 2 and started to feel that they actually taste strange- like they left a bitter/spicy taste, as if I you'd eat a nutmeg or ginger (edit- i found a better comparison- as if you chew some rosemary leaves) that numb, lingering feel on the tongue. Waiter told me its cause they added some pepper, but damn I know the difference between hot as in spicy and tongue numbness you can get from some things. I know its mostly glassballing here, but how are the chances that these scallops were bad?",
            "I always put it in tupperware. Bacon has a tendency as any meat to oxidize quickly and become grey",
            "I've never had to soak asparagus - are you sure it wasn't just some seasoning making it gritty?\n\nFrom a food safety standpoint you're fine to rinse it and cook again, but it'll probably be overcooked",
            "Could it have been Szechuan pepper on them? That makes your mouth weirdly numb.",
            "I put it in a gallon ziplock bag so I can squeeze out all the extra air",
            "After I posted this I went and tried another piece and it was fine, I wonder if the first piece I tasted was slightly over looked when I rinsed them. I also may have over seasoned it and that was making it gritty, who knows."
        ]
    },
    "what was your favorite family meal growing up?/what do you still ask your parents to make for you as an adult?": {
        "title": "what was your favorite family meal growing up?/what do you still ask your parents to make for you as an adult?",
        "score": 175,
        "url": "https://www.reddit.com/r/Cooking/comments/1dljl12/what_was_your_favorite_family_meal_growing_upwhat/",
        "content": "i’m 24 and childless as of yet, and i’m trying to get into cooking and really hone my skills so that when i do have kids, they will grow up and still ask to come over for dinner with me because my food is just *that* good. i’m looking for those kinds of recipes. \n\nwhat was this meal for you?  \n\n\nmy answer: my Cajun mom makes a mean rice and gravy and always pairs it with an insane baked jalapeño mac and cheese.",
        "num_comments": 269,
        "comments": [
            "Chicken and dumplings. I’ve tried to make it, but I cannot do it like my mother does, and she’s always happy to make it for me. Definitely cherish the times she’s spent teaching it to me, even if it’ll never taste the same.",
            "Roast. With carrots & potatoes,  in the oven, so you have the crunchy edges. \n\nAlso fried mashed potato pancakes, her mom used to make them too.",
            "Congee when I’m sick",
            "A layered casserole, from bottom to top: ground beef cooked with onion & garlic, frozen green beans, tomato soup, mashed potatoes. Bake in the oven for 30 - 45 minutes until potatoes are golden brown. \n\nI don't ask my parents to make it for me but I often make it for myself.",
            "Twice a year my mom visits to stay for like 8 weeks. As a single dad to a girl it helps tremendously. I always ask for Sancho. Labor intensive stew (Latin Americams have each their own take and so do different households and reguons. Stock is the king as it used usually like 5 different meats/cuts, usually served with large groups so we invite aunts , uncles. She makes it in this ridiculously huge pot I keep in my small kitchen apt just for that.",
            "Beef stroganoff",
            "Chicken and dumplings for sure. I’m so glad I figured out how to make it before my mom died. Also what we called “chicken and cheese” which was chicken cooked in a cream of mushroom based sauce and covered in cheese. So rich and so good.",
            "hamburger gravy with mashed potatoes!!! i could probably make it myself but idk. i just like it when my dad makes it :\")",
            "My great gramms made pinto beans with ham hocks and cornbread. So crazy simple and so good; and though she’s gone I still make em. There’s a memory in every bite. ❤️",
            "Chili- ground beef, peppers, onions, various beans, canned tomatoes… not sure everything she puts in it exactly but I don’t even want to try to recreate it yet\n\nChicken noodle soup- chicken, chicken broth, celery, onions, matchstick carrots, egg noodles, cracked black pepper. Tastes better when she cooks it",
            "I'm in my 40's and the only chook (congee) I will eat is my mommy's",
            "Before my mom passed I always asked for. Bicker fried steak and her weird amazing white people\nChicken enchiladas. Really anything that she made I was so happy to eat!!",
            "Mac and cheese\n\nSwedish meatballs\n\nLasagna\n\nMeatloaf\n\nPad Thai",
            "My dad does a lot of incredible backyard barbecue. Has an insane homemade barbecue sauce and even smokes and grills bacon. My personal favorite is smoked salmon and it's now the only way I can eat salmon. Everything he makes is restaurant quality outstanding. I have an apartment and can't even have a grill so it makes it extra enticing to go home for good barbecue!! He never cooked while I was growing up so this is a relatively recent hobby and my goodness we are so glad he ventured out.",
            "I just loved \"sloppy joe\" night.  Going wild with the tangy ground beef mix, scooped onto soft hamburger buns which nearly dissolved, and lots of pickle slices on the side as a \"vegetable\"  LOL.  1960's for the win, baby.",
            "For my kids who are 27 and 31 its my chicken and dressing ( my dressing is a mixture of half no sugar cornbread and toasted french bread. ). \nAll their friends who eat with us say it’s the best. \nAlso, my homemade chicken and dumplings ( the flat rolled out dumplings not drop dumplings).  I made a big pot, put the leftover a big gallon bowl. My daughters boyfriend came over the next day.  They were missing. He ate the entire bowl. I was his music teacher, he said I didn’t know my music teacher Mr C, could make the best Dumplings. \nToo funny.  \nNow he always ask me to make chicken and dumplings for him.",
            "For me, it’s cubed steak with gravy and fried salmon patties. My mom’s just can’t be beat. \n\nFor my kid, it’s my meatloaf and fried chicken cutlets.",
            "There were two meals my mom mad LY.\n\nOne was her lasagna. The noodles always came out toothsome but not chewy or turned to mush. And the sauce and ricotta was always well seasoned.\n\nThe other dish was her meatloaf. Yea j know, it's nothing really to write home about. But she always made a spcal sauce to go with it. It was just a ketchup glaze, either. It was a base of ketchup, brown sugar, worchestershire, and a bit of yellow mustard.",
            "My stepmother does a really, REALLY nice veal schnitzel with mushroom gravy.   \n\n\nIt’s been my favourite since I was a child. It’s one of the first things I asked her to teach me when I left home…and I still don’t get it right, so I come over for my schnitzel fix.",
            "My mom uses left over turkey and pinto beans from Thanksgiving and toss those into a crock pot with green bell pepper, corn, potatoes, green chile, and turkey stock... she calls it her \"green chile\" stew and it's very different than any green chile stew you can get at a New Mexican restaurant, but I crave it more than anything whenever fall hits. Tried like crazy to recreate it, so far no dice. It smells, tastes, and feels like home.",
            "My British mom made an awesome roast beef and Yorkshire pudding",
            "Mom used to make French dip sandwiches the day after she'd make roast beef. No grocery store delis in those days where we lived.\n\nWhat I loved best was she would just make a whole bunch of sandwiches, not just one each, and serve them on her large cutting board. Eat as many as you could. \n\nThat was so good.\n\nDamn, I miss my mom.",
            "Parmesan crusted chicken\n\nHam balls",
            "Meatloaf, baked potato and green beans. And my mom fried canned green beans with bacon and they were delicious. Lol",
            "Salmon patties, rice, pinto beans, and cornbread. I make it every week just like my mom did.",
            "Taco/ burrito  night.we would make ground beef with  taco seasoning, heat up a can of beans, slice up lettuce and tomato ,grate cheese, fry up corn tortillas and heat up flour tortillas ,then go to it!",
            "Pork n beans with hot dogs, fried potatoes with onion,",
            "Lasagna, specifically my grandmother's recipe.\n\nGrandma also made a cookie that is just pie dough slathered in butter and cinnamon sugar, then rolled up into a pin wheel before baking. She called them Hoosier cookies. I think they go by many names depending on the region you're in. She brought them every Thanksgiving and the only person in the family she taught to make them is me.\n\nAlso my grandma's pumpkin pie. It's the original Libby's recipe on the side of the can. The one made with sugar and evaporated milk, NOT the one with condensed milk. The texture of the custard is so much softer and creamy as hell. My mom makes the condensed milk version and it just doesn't compare. \n\nI'm sure you can tell that I have much stronger memories of my grandmother's cooking. My mom is a good cook, but Grandma is the best.",
            "My mom used to make a dish we called “Company Pasta” because she always made it when company came over. It’s fast, easy, cheap, and delicious, and I have such intense nostalgia for it. I can still see the big bowl she served it in.\n\nIngredients:\nOne box pasta (we always did penne)\nOlive oil \nOne onion, chopped or diced \n4oz tomato paste (can or tube; can eyeball it)\nOne can diced tomatoes (whatever size you have)\nOne log goat cheese (6-8 oz to taste)\nPlenty of fresh basil, chopped\nSalt & pepper to taste\n\nInstructions:\nBring water to a boil and salt generously.\n\nSauté onion in olive oil with a pinch of salt until translucent. Add in tomato parts and stir until onions are evenly coated. \n\nAdd pasta to water.\n\nAdd canned tomatoes to onion mixture and stir well. When the mixture bubbles add the goat cheese and stir occasionally until the cheese is completely melted. Immediately remove the pan from the heat and mix in the chopped basil. Season with salt and pepper to taste.\n\nCombine pasta and sauce in a large bowl and top with a few extra ribbons of basil if you have any left. Enjoy!",
            "I'm the Mom and Grandma who cooks what the kids want now.  They always ask for at least one of the following and if they are staying for a week? Well, let's just say that they get every single thing on the list before they go home.\n\nChicken and Dumplings  \nMaryland Spring Chicken  \nLasagna or Stuffed Shells  \nMexicali Casserole (an old casserole from the back of an egg noodle bag)  \nBaked Mac n Cheese  \nBeef Stew  \nSwiss Steak and Spaetzle\n\nBreakfast ALWAYS is my pancakes.  And for longer stays they also request biscuits and gravy.  And the spoiled brats usually talk me into making pizza for lunch, kettle corn for movie snacks and homemade ice cream with tarte tatin for dessert.  Yep, I said spoiled brats.  They have me wrapped around their little fingers and they know it!",
            "Honestly, anything. \n\nI'm in my 30's and to this day have never had a sit down meal with my parents/sibling, let alone a home cooked one. They were always working and when they weren't, neither really cooked. \n\nKids spell love T-I-M-E. Just build the memories when they get here and the rest will happen organically.",
            "Huevos rancheros. Biscuits and gravy. Chicken fried chicken with mashed potatoes/gravy/black eyed peas/steamed spinach. Steak tacos. Green chile stew.",
            "I love my moms chickpea soup …",
            "Grandma #1's spaetzle and goulash. Although I can make both, she always made it seem so effortless when, in fact, it's labor intensive. \n\nAlso, Grandma #2's tamales, specifically the sweet ones. I never learned how to make them before she passed away, and I deeply regret it.",
            "Matzo ball soup! (We ate it year-round in my family)",
            "Lamb stew. My grandmother makes the best lamb stew and i would ask for it but i can't afford it 😂",
            "Stuffed peppers",
            "This is adorable!!! The answer is roast chicken. I make my own now: I stuff as much lemon, onion, and garlic into a bird as I can, add a bay leaf if I'm feeling fancy, and if I'm feeling EXTRA fancy I will stick a spoon under the skin to loosen and then stud the breast with butter and chopped garlic (under the loosened skin). Roast at 400 until the meat thermometer says it's good.\n\nBonus: I also dream about Dad's classic summer barbecue...",
            "My favorite thing as a kid my mom made was meatloaf. Seasoned with french onion soup mix, oatmeal as the filler and a lot of ketchup. Now I make my own meatloaf from scratch and usually improvise the seasonings so it's different every time. As an adult I tried the old onion soup method and it was just ok. Mom was never a very good cook. Lots of Mac and cheese, hamburger helper and shake n bake.",
            "Enchiladas and roast chicken (not together)",
            "City Chicken on rice\nPoached eggs on toast\nRoast Turkey and stuffing baked so the top gets crispy.",
            "Mom’s meatloaf",
            "Mama’s beef stew and her hamburger soup!",
            "Teriyaki (from scratch) tofu or chicken, skewered on the hibachi. Or lomo saltado!",
            "My grandmother's meat pie and yorkshire pudding",
            "Pot roast!!!",
            "My mom’s shepherds pie. Or her chicken wings. Ugh. Now I’m hungry 🤣",
            "Porcupine meatballs",
            "Salmon and eggs on grits. Me, my sister, my brother, my niblings, all ask for it, even though we can do it ourselves. It tastes like… a family dinner on a Wednesday night.",
            "My mom makes this breaded chicken but with potato flakes instead of breadcrumbs. She adds potatoes to the pan and bakes it all together. So good 🥰 I could make it but I like it when she does ❤️",
            "A classic New York east coast American dish: spaghetti and homemade meatballs.  My mom has passed, but I make it for myself and it always made me think of my mom and my childhood home.",
            "Zummaborscht and roll Kuchen.\n\nChieltya and schinka fleisch.\n\nWurst, with boiled potatoes and schmauntfat.\n\nBeans, schmauntfat, and homemade tostadas.",
            "My kids had different tastes but they would both still ask for meatloaf, mashed potatoes and corn (biscuits on the side).  I don't make regular meatloaf -- mine is fluffy and has SW spices and cheese.",
            "Mom’s pot roast. I cannot get the gravy even remotely the same as hers.",
            "My grandma’s goulash. Not typical goulash, it’s cubed beef chuck meat and mushrooms with egg noodles in a brown gravy. She doesn’t cook anymore but my dad makes it and it’s not the same, but it’s my comfort food.",
            "Fried  chicken,  mashed potatoes and peas",
            "Iced pfeffernüsse cookies",
            "Roasted Chicken with Roasted Potatoes and Steamed Broccoli coli. My favorite part was that the broccoli was like little trees.",
            "Pot toast with carrots and potatoes. My mom made the *best* pot roast. I loved the carrots and potatoes, too.",
            "Stamppot or pannekoek.  \nStamppot is basically mashed potatoes seasoned with a little bit of vinegar, mixed together with veggies. You can top it with unsweetened applesauce or sauerkraut. My absolute comfort is broccoli and carrots with chicken sausage mixed in, topped with both sauerkraut and applesauce.  \nPannekoek is like a thick crepe. Growing up, it was bananas and whipped cream inside--which is still a favorite.  \nI know how to make stamppot, but I occasionally bother my mom to make pannekoek when I visit!",
            "For me, it’s sopa de albóndigas which is a traditional Hispanic soup with meatballs with potatoes and other veggies.\n\nBy the way, the rice and gravy with the jalapeño Mac n cheese sounds so good",
            "Middle Eastern meal of rice and stew.",
            "My dad makes the best beef stew. It eventually became our Christmas meal bc we loved it so much and didn’t want to eat the same foods back to back between Thanksgiving and Christmas. \n\nI also will forever love my mom’s potatoes and onions that she bakes in the oven. It’s literally so simple but so good.",
            "My mom makes the best Spanish bean soup. I still ask her to make it when it gets cold outside. I can eat that stuff by the pot.",
            "Neither of my parents particularly like or excel at cooking, but my dad made some bomb ass chili when I was growing up. Super economical and infinitely adjustable, so he was able to dial it in. Also, like most stew-y  big-pot-of-stuff meals, it's even better as leftovers.\n\nHe doesn't remember his recipe, but I don't think that's important. Find a basic recipe and adjust it to your taste. Then, if/when you have a family you can adjust it further to better accommodate them. Maybe your kid loves animals and wants to be a vegetarian when they turn 8 (literally what happened with my sister) - no problem, take out the meat and put in black beans for protein. Maybe your SO hates onions - you should probably break it off because that's insane, but alternately, throw in some carrots to replace the sweetness you lose from sacrificing your onions.\n\nIt's hard to irreparably fuck up. It's cheap. It can feed a crowd. It can be about as healthy as you want without feeling like rabbit food. It doesn't need to be pretty.",
            "My dad learned how to make enchiladas. I always like them. we are not Mexican. they were nothing like restaurants but still good.\n\nboth my parents passed away years ago. They never made anything for me as an adult. I long surpassed them in the kitchen. If anything I cooked for them.",
            "Also, cheese enchiladas,  yum!",
            "My favorite meals were enchiladas, fried chicken and chicken cacciatore. My mom was a great cook, but those were my favorites. My son likes my scrambled eggs and spaghetti. 😕",
            "My mom's enchiladas. No, they aren't authentic enchiladas, but they are really good and I love them.",
            "My mom makes beef stroganoff over rice and it’s so good I lick the plate every time.",
            "Shepherds pie.  My dad puts a little curry powder in his.  It’s so good.",
            "Breakfasts were my favorite, cooking with my dad. Didn’t matter what we were making. So when I visit, he and I always cook breakfast together. Most recently it was sausage/cream gravy over homemade biscuits, with hashbrowns made from freshly grated potatoes (I detest the frozen shredded crap) and eggs sunny side up. Totally gluttonous.",
            "Arroz con gandules",
            "My nana’s meatloaf. The meatloaf itself is a pretty standard recipe I guess (although it does include curry powder, which is a little unusual) but the special sauce for basting it with is lit, never had another one like it.",
            "Roast, rice and gravy is always my birthday home-cooked meal. Can always eat the hell out of that when my mom makes it. Even better since the advent of the Instant Pot.",
            "Cube steak with cream gravy. My grandma taught my mom how to make it and it was the only real meal my mom could cook.",
            "When my Mom was alive, I always wanted creamed new potatoes with spring peas.",
            "My mom does the best hamloaf. It's a very midwest dish. And then hamloaf sammys the next day, so good with crisp lettuce, mayo on white bread. My dad made the best pancakes. It was the only thing he could make besides steak but I miss his pancakes the most.",
            "If my mum were still alive I would ask for gnocchi and empanadas, both made entirely from scratch. On different days though because one of those is enough for a day!",
            "Pasta Salad. It was omnipresent at Mom's side family affairs. I've had the recipe passed down, but somehow it's never tasted as good as Mom's, which also never tasted as good as Grandma Betty's.\n\nFettucine al dente, diced tomato, green bell, summer sausage. Wishbone Italian Dressing. McCormick Salad Supreme.\n\nWishbone/McCormick circa 1993 are very different products than their current offerings, unfortunately.\n\nI've been a fan of the recipe for 35 years, I'll continue to be a fan for 35 more. And you can bet I'm experimenting every single time I make it to get as close as possible to that 90s pasta salad vibe.\n\nThus concludes the Ode To Grandma's Noodles.\n\nEdit: Runner up, Mom's Lasagna. When you smell that tomato-wine-cheese combo walking in after school, you know it's about to be a good night and you better get your homework done fast so you can be early to the kitchen and get a good corner piece.",
            "Poori and Bhaji! (An Indian dish - Fried bread with a potato curry)",
            "Volga German heritage here. Fried noodles and beans, and green bean and dumpling soup.",
            "Pot roast. Basic ass homemade pot roast. \n\nWith some nice cheap rustic toasted bread.",
            "Broccoli/broccolini/broccoli rabe/Brussel sprouts!! My parents cooked the hell out of what was often portrayed as the most hated vegetables in kids shows, but I love them. They always roasted them and they were amazing",
            "Chicken Paprikash, similar to a chicken and dumplings. I feel like I make the gravy actually better than my mom, but I can't make the nokedli as good as hers.",
            "My dad was single dad and worked lots of hours hand still made us dinner every night with two vegetable.. it was crazy healthy, but he cooked simple but filling meals. \n\nAs a kid, I HATED meatloaf and what made it worse is he insisted we helped make it with him.. he never measured anything just threw it all in pan…\n\nI appreciate it so much now and while I can make it.. it’s still not DADS meatloaf.. \n\nMy sister and I both have our own versions but would both happily eat dads over ours.",
            "Pan fried vermicelli, hits the spot everytime!!",
            "Mom’s Church lady rice and my husband makes it",
            "My mom’s pot roast was my go to for my birthday meat request.",
            "My Dad's ceviche, he's been working on that for 30 years he just perfected it five years and somehow it still always hits like the first time.",
            "My mom's beef stew.\n\n\n She's been gone for 28 years now, and I finally figured out how to make a stew that is just like it. Brings back the memory of the family meals every time I make it. It's where I first learned the rule of the one(s) to get the bay leaf in their serving has to be on cleanup duty. Mom seemed to get way more than her share of the bay leafs",
            "Turkey tetrazzini. The recipe is from a cookbook that came with the microwave they got in the early 80s.",
            "Hot ham and cheese sandwiches. Jack cheese of any kind. Lettuce and a dash of hot sauce inside. \n\nSpaghetti and marinara works well, too.",
            "Potato soup from my grandma, and when my husband used to do Pest Control & he was in her town, he would visit and she'd always make him a Reuben. I love my Mimi.",
            "My mom makes really good gyros",
            "My mom had this insanely good recipe she called Chicken Dijon. We have no idea what the recipe was sadly.\n\nWe lost my mom at a fairly young age to cancer. My mom was a military wife and mother of a big family so all recipes were long-since stretched with other ingredients to save money and feed growing kids. For the longest time her cancer treatments seemed to be going ok so we had false hope. By the time anyone thought to ask about recipes she had lost the ability to speak or really comprehend. So many of her recipes I will never taste again. I’ve never had meatloaf as good as hers. She would make extra so me and my brothers could take meatloaf sandwiches to school all week.",
            "I’ve been craving my mom’s Swiss steak. No clue how to make it.",
            "Wednesday lunch at my dad’s school in the 50s: meatloaf, spaghetti with meat sauce and mashed potatoes with brown gravy over everything. My husband won’t let me make it, says we have to have the meatloaf and spaghetti on separate nights.",
            "Squash Casserole and Green Beans - I’m a chef and it just doesn’t turn out like hers",
            "Pozole Rojo",
            "The only thing that comes to mind is my mother's mother's thanksgiving cornbread dressing. But by definition that was once a year. It wouldn't make sense to eat it any other day. Very standard southern recipe. Cornbread, onion, tons of celery, chicken stock, salt, pepper. Mix until a bit soggy, bake until mostly dry inside and golden brown on top. My dad's family is cajun but they're all pretty bad cooks. I learned almost everything from youtube. Thank god for youtube. Isaac Toups' jambalaya recipe is amazing.",
            "Tuna casserole with little square toast topped with melted cheddar cheese. Omg.",
            "Chipped beef on toast.  I never realized that it was a last minute dinner when my single dad didn't want to go to the store, my brother and I loved it.  When I moved in with my dad to take care of him in his final Parkinson's battle, I made it for him, he hadn't had it since the 80s, and damn near cried at how good it was.  That's the good stuff",
            "We were just talking about this tonight. For me it was my homemade biscuits and sausage gravy. I have never found any that were better than my mom made. Fluffy biscuits, rich gravy and good amount of mild sausage and just the right amount of salt and pepper.",
            "My mother was a terrible cook. My favorite was when my mom was out of town and my dad would make steak, baked potato and salad. Basic, delicious and the best thing that came out of our home kitchen.",
            "Lots of cozy rose sauce pastas before I had swim meets as a kid. Easy to make, can be made pretty healthy, and if your kids do sports, they need CARBS the day before and of their sports to have the energy. Simpler times.",
            "My mom always made this dish called Mothers Rice. \n\n1 can Campbell’s chicken gumbo soup, 1 can Campbell’s beef consommé & 1 cup of rice. Put in casserole dish with lid or tin foil, bake in a 350 degree oven for one hour.",
            "My mom would make chip beef gravy over toast. Years later I was feeling nostalgic and decided to make a batch. Oh my God is that stuff salty.",
            "Knödel with Pork and Gravy. This meal HAS to also have a side salad with my Omas (now passed, but my Mom makes an acceptable near-dupe) homemade Oil & Vinegar Dressing.\n\nAlso, Turkey Tacos/Nachos and Black Bean Soup. These 2 are my Moms Recipes, whereas the Knödel is originally my Omas that my Mom has mastered fairly well with American ingredients.",
            "My parents are passed on but when I was a kid my Mom would experiment with different variations of Cottage and Shepherd's Pie. She finally settled on one that was tomato based but I actually ended up making up my own which was a beef gravy based one.\n\nI also like to make Chicken and Dumplings and Chili Pie with a corn bread topping. I like meat based casseroles, stews, soups, pot pies, stuff like that. I'm also big on hand held meat pastry pies and have about a dozen different ones I like to make from different countries. \n\nWhen my Dad was still alive before he got sick and lost all interest in food I used to make different casseroles and meat pies because I knew he'd at least try those and it was real food unlike the Stouffer's meals he'd practically live on if you let him. \n\nMy Mom rarely cooked except on holidays. Most of the time I ended up cooking for myself and later I'd end up just making big pots of pasta sauce, stews, chili or soups so they would eat real food too. Otherwise they'd just exist on eggs and sausages or bacon for breakfast and whatever bar food was available any given night at whatever place they ended up doing Happy Hour at. \n\nI was cooking whole meals by the time I was 10. I learned to cook by reading cookbooks. My Mom taught me a little. She wasn't a bad cook most of the time but I'd say at least 3/4 of her recipes involved boxes or cans and rarely more than a few steps. She never really cooked much from scratch. \n\nI am admittedly lazy when it comes to making baked goods from scratch. I will often start with a mix and add stuff rather than start from scratch and sift flour and all that. But mostly when it comes to eating regular food I like to cook mostly from scratch from fresh ingredients. \n\nThe only major cheat when I am cooking stuff like soup is that is I do like Better Than Bouillon and will always add some even when I make stock from a chicken. I don't mind chicken stock but I like it a bit richer and thicker, and I get that with the BTB stuff. \n\nMy soups are always hearty with thicker broth like stews or chowders. With rare exceptions I don't like thin broth soups much. \n\nThese days I have to watch carbs because I'm diabetic so I have to work around the potato/crust thing. I can't make things like Cottage Pie or Pot Pies as much as I used to. I tend to make chili and soup more. Every once in a while though I've still got to have some kind of meat pie.\n\nI'm definitely a meat and potatoes/pasta person. Most of my favorite down home meals involve one or the other so restricting myself to a more low carb diet can be hard...",
            "My mum made the best roast dinners i've ever had. RIP.",
            "As a Kenyan, I will say Pilau and Nyama Choma.\nShe has a way of making it and it's always tastier every time.",
            "My mom makes amazing lasagna!!! My husband even likes it, and he is super picky with food.",
            "Cream of mushroom chicken with rice.",
            "My dad's fried pork steak, mashed potatoes, brown gravy, corn and crescent roll meal, his staple. \n\nMy mom's Mexican casserole with my favorite dessert, hello dollies, I asked for every birthday growing up.",
            "My mother was a horrible cook and would rather eat out with her friends and leave us kids at home to fend for ourselves. I had to learn how to prepare food for my siblings at a young age. My favorite item, which I still make (albeit a spruced up version) is hot dogs wrapped in crescent rolls with cheese.  \n\nMy wife would humor me and let me make them once in awhile, but she absolutely hates them. We recently found a frozen version that are pretty good and gives me that fix.",
            "Ooh great question. Some of my favourites were kedgeree (a Scottish dish with rice, eggs and smoked fish, with heaps of butter and parsley), my Dad's home made souvlaki, mutton roast, Mum's tomato soup, lemon meringue pie and lemon delicious pudding.",
            "My dad, 74, still makes killer fajitas, and always makes it when I visit. In return I make him chicken and dumplings which I learned how to make from Grandma, his mom.",
            "I've never seen a box of hamburger helper in person, but do that with generic grocery store ingredients.\n\n  \nBoxed fish fillets, diy fries with Russets and peanut oil, diy coleslaw\n\n  \nBeef mashed potatos, brussel sprouts.  Beef braised - low, slow, wet, tomato based liquid.",
            "\"Long cooking\" spaghetti and meatballs. Not very Italian at all. Tomato paste and sauce, onion, salt, and pepper cooked all afternoon. Served over thin spaghetti. It just takes me back to my childhood. My mom still makes it occasionally for my brother and I.",
            "My parents were not great cooks. I make just about everything they used to but better. The only thing I have no mastery of is the BBQ. So I always ask for that when I go visit.",
            "Spaghetti.My Grandma made a mean spaghetti sauce. I wish she was still around to make it. I've been able to come pretty close to replicating it, but it's never as good.",
            "My mom’s beef menudo is my favorite! However, she acquired her coworker’s Nigerian stew recipe and it’s my favorite dish she makes now :)",
            "My favorite meal for as long as I can remember is my dad’s steak tips and Parmesan noodles. Really simple but always delicious.",
            "I love my dad's Mac and cheese and Tacos. \n\nI know how he makes mac and cheese and his Tacos, but I can never get it to taste the same.",
            "I liked my mom’s tuna noodle casserole, it was a mix of egg noodles, cream of celery, peas, tuna fish, and some Kraft singles. My mom didn’t cook a lot of things but I always liked that.",
            "enchilada suizas and fideo soup",
            "Sweet and meaty spaghetti. Whatever my mom makes, I always request this. It has ground pork or beef and hotdogs, sautéed with onions and garlic and sweet style tomato sauce. She would even add shredded cheese into the sauce so it melts and makes it taste cheesy too.",
            "Spicy stuffed peppers, knockoff Ruby Tuesdays potato cheese soup, and I’m blanking on anything else, but that jalepeno Mac & cheese sounds amazing. Are you willing to share the recipe?",
            "My dad makes a mean tri tip. The best version is marinated in a balsamic vinaigrette mixture and grilled. He still makes it for me every time I go home to visit.",
            "Corned beef & cabbage. Pork & beans. Both over top white rice. Simple. Delicious.",
            "Fish and chips. I make it myself now when I have company",
            "Sinigang na hipon (shrimp in tamarind soup) \nhttps://panlasangpinoy.com/sinigang-na-hipon-sa-sampaloc/\n\nand sopas (macaroni soup)\nhttps://panlasangpinoy.com/filipino-chicken-macaroni-sopas/",
            "My Ma made a great chicken Kiev. Rip Ma 🙏",
            "I’ve always loved cheese. For me it’s bread, crackers and cheese",
            "Kraft Dinner and Hotdogs!",
            "Oh man where do I start! I'm Jamaican my favorite dish growing up? I used to love pork back ribs with mashed potatoes and gravy, I also love me some oxtail, curry goat, and curry chicken",
            "My Dad's turkey and dumplings.",
            "Cotton soup (Pamuk corba), made out of milk, butter and flour. My grandma always made it when I was sick. I still crave the taste everytime I have flu.",
            "I haven't had it in AAAAAAAAAAAAAAAAAAGES but my mom used to make Turkey Noodle Soup and Beer Bread shortly after Thanksgiving (obviously, for *TURKEY* noodle soup) and it would warm the soul. Mom's in the other room on hospice, and I'm disabled and stuck in either my computer chair or the bed behind me in the living room/my \"bedroom\" here, so maybe i could get one of our caretakers to get the recipe out of Mom to make it, but it's way too much hassle for not enough payoff.",
            "A few years before my Nana died it was my job to learn how to make the Sunday sauce, the meatballs, and the garlic bread. I knock it out of the park every time, they say it tastes just like hers. Now I can make it whenever I want I don’t have to wait for a special occasion; I like to freeze some in cute little containers and give them as gifts too",
            "I had a horrible accident 4 years ago, and had to live at my parents place for three months where I recovered and learned how to walk again. Mostly confined to a hospital bed inside their small place, until I could walk the stairs back up to my own place. When my dad would get home, I’d ask if he’d make me a grilled cheese sandwich. He always made me a couple. You know, the homemade kind with white bread, butter, and Kraft singles. Slightly burnt. With a side of campbells tomato soup. \n\nIt healed me. I couldn’tve asked for anything better. I cherish those meals and memories more than anything in my life. I love my parents very much.",
            "Beef curry was always may favorite. Followed by chicken curry, pulled pork (vinegar based), and bbq chicken wings.\n\nI have been able to replicate all but the bbq wings.",
            "Stuffed cabbage that my great-aunt and nonna used to make. I have the recipe. \n\nMy mom makes the best baked Mac n cheese ever. \n\nMy dad’s scrambled eggs are legendary.",
            "Hands down, lasagna.",
            "Bagna Cauda, it’s not really a meal but more of a dipping sauce to dip bread, lettuce and other vegetables in. My grandma used to and still makes it for us and we pretty much eat it as a meal.",
            "My grandmother made the best beef stew, it wasn’t even like beef stew because the veggies were usually on the side but every time I came home from school and smelled it cooking, I was so excited.",
            "Catalina beef stew. My mom would make regular beef stew but with a bottle of Catalina dressing added. So good.",
            "My mother's tortilla soup, paired with her sweet iced tea.",
            "My mom's stuffed green peppers with rice balls. I've tried making it a few times but I can't make it like she does!",
            "I believe fresno city has a program for firefighter. I’ve heard it’s hard to get into, but if you can get into that hopefully it can increase your chances of becoming a firefighter since it’s so competitive.",
            "Chicken and dumplings.",
            "Chicken and leek potpie with biscuit crust.(mom)\n\nSpecial egg sandwiches, Freestyle multi meat chilli(dad)\n\nCanned baby potatoes sautéed with garlic, m&m meats bacon wrapped filet mignon with a raw onion slice, Caesar salad(grandpa RIP)\n \nMacaroni and cheese(Nana RIP)",
            "We had hot salty chips (when $2 worth came in butcher paper and would easily feed a family of 5), tomato sauce and fresh bread and butter every Friday night. Us kids thought that this was heaven. I still eat it and love it.",
            "Chile relleno soup😬",
            "My mom makes a mean tamale pie and we also do tacos on a plate which gets a lot of requests \n\nWe also have the Green Mill original deep dish pizza recipe which is bangin",
            "Meatloaf, Pancakes and baked potatoes!",
            "Barbecued chicken. My dad has had a smoker (grill) since before I was born. I still love that meal.\n\nBarbecued ribs and t bone steaks are excellent also.",
            "My mom makes American Chop suey and I just can’t make it the same. I suppose I could suck it up and buy the Pinecone tomatoes she uses but it’s just easier to get her leftovers 😉",
            "pasta salad & this broccoli chicken pasta",
            "My favorite was always a roast chicken dinner on Sunday. Mashed potatoes, gravy, some type of veggie, probably some rolls or cornbread. Traditional Sunday chicken roast. \n\nBut I'm not in contact woth my parents, so I just make it for my kids every Sunday through the cold months.",
            "One of them was kippers in custard https://imgur.com/a/CMwii\n\nAnother was apple squidge.",
            "Yogurt soup.",
            "Grilled cheese sandwiches, pancakes and omelettes. Parents treated cooking like a race against the smoke alarm, and these were about the only things that ever won!\n\nAnd I say that with humor obviously - being a parent and cooking at the end of a long day are both tough, and there was no YouTube to teach them any better. \n\nTheir only solution was to keep a child on hand to prod the smoke alarm with a broom handle and while another pumped the kitchen windows like set of bellows.\n\nAlthough knowing my parents, that might have just been a tactic to keep us from wandering off before tea time…",
            "My mom's beef stew. Or her home fried potatoes for breakfast. And my dad's enchiladas",
            "Kartoffelpuffer and Vanillekipferl, nothing better than my mum's",
            "Roast chicken, roast potatoes and gravy",
            "My mums bolognese was always a favourite of mine. She would cook it on low heat for like 4+ hours. Just a standard ragu though: onion, carrot, celery, garlic, 2/3 beef mince, 1/3 pork mince, tomato concentrate, red wine, tinned or fresh tomatoes (depending on season), splash of milk, bay leaf, dried oregano, fresh basil (and parmesan rind if you have one sitting about), lots of black pepper and salt and let simmer for 4 hours.",
            "My mom wasn't a big cook. But my grandmother was. She made homemade chicken soup to die for. Her secret stock tips were to throw in a whole, unpeeled onion (people balk when I say this - it was clean, just not peeled) and a whole parsnip.",
            "I move heaven and hell to avoid eating anything my mom makes. She cooks like she hates food. Growing up we didn't even have salt or pepper in the house.",
            "Polish pierogi (dumplings) with potato and cheese filling. Also clear chicken broth with noodles (we call it Rosul) and pork schnitzels with mashed potato. Dishes of my Polish childhood.",
            "51 years old here. Mom is 82. I still go to her house for her liver and onions. My wife and kids do not eat it and it's one of those meals that's only good when Mom makes it. 🥰",
            "My mom made a skillet lasagna when I was a kid that I loved and always requested as my birthday meal…RIP everyone else, who didn’t want hot lasagna in late August.\n\nETA: She also makes an incredible wedding soup, so good that any time I’ve tried to order it somewhere, I’ve just wished it were hers.",
            "Chicken and dumplings. My mom’s dumplings were light and fluffy. I’ve never tried making them myself and now I’m wondering why. My mom is 94 but still living independently in our family home so I’ll have to ask for her recipe",
            "Bit of an inverse I’m 23, but my parents always ask me to cook my chicken, chorizo and Mexican style rice for them",
            "My mother's chili. And I still ask her to make it. Its a lite sweet from a bit of sugar and a little smoky and spicy from chili spices.  Absolutely delicious.  When I was sick she used to make chicken and rice soup and I will ask for that too when. I don't feel great!",
            "My mother made this dish with beef tips in gravy with bacon and onions, served over rice. I didn't like most of her cooking, but love this one and It's now my comfort dish.",
            "Indian spicy goat curry with wheat bread and rice",
            "Used to be mac and cheese until I realized that it was literally just cooked macaroni and Velveeta mixed together on the stove top.  Still the best I've ever tasted, though.\n\nThe one I've worked on is beef and noodles.  Egg noodles and small bits of leftover pot roast or whatever.  It's simple but was always seasoned perfectly and absolutely delicious.  When I've worked on my dad for the recipe, I've always gotten \"you take some of this and some of that\" replies.  \n\n\"How much?\"\n\n\"Until it looks and tastes right.\"\n\nI know he's not purposefully being a dick; that's just how he cooks.",
            "Gyoza",
            "My mom makes sick enchiladas. She's got the seasonings down perfect, and uses ricotta for the filling.,",
            "Omg can you please share the recipe f this Mac and cheese pretty please",
            "The existential question is how did you get to be 24 and can't cook? \n\nRice is easy. You need a pot. And rice. Chicken stock (better than water). For Cajun, butter, paprika, cumin, S&P. \n\nGravy is usually a bechamel: flour, butter, dairy. If you have drippings from roasting meat you sub that in for some of the butter. \n\nMac & cheese is onion flavored Mornay, bacon or sausage, peppers, thin sliced tomato, and bread crumbs preferably made yourself. \n\nI've never met a Cajun or Creole who didn't try to teach anyone that didn't move fast enough to get away, so not being able to recreate your mother's food is entirely on you. You should have been making food with guidance by eight and able to cook on your own by twelve. \n\nYou have a lot of catching up to do. Focus on technique, not recipes. Listen to your mother. Do what she says. Learn to cook.",
            "I love that you’re thinking about this while you’re young. My kids are your age and, a few weeks ago, I asked them what their favorites were. Gumbo and Spaghetti were at the top of their list.\n\nIf I were to do it again, I would make specific meals for specific events. Like, “we always have _____ on the first day of Summer” or “on so-and-so’s birthday we have _____.” Doing that would’ve made more ”special” meals.\n\nThese are my “signature” dishes:\n\nSpaghetti (sometimes with meatballs)\n\nGumbo and rice\n\nMeatloaf with mashed potatoes and gravy\n\n\n\nI’d love it if you shared your mom’s recipes you mentioned. I love Cajun food AND I love mac and cheese.",
            "Despite all the from scratch amazing meals I’ve made over the years, my adult children still ask for the chicken divan from their childhood made with canned cream of chicken soup.  While reading these responses I realize it’s not actually the meal but the memories associated with the meal.  Many of the favorites aren’t world class dishes, just simply food made at home.  I think you could adopt any dish that your future family likes and it will stick with them as a symbol of mom and home.",
            "My grown kids ask for chicken with peanut sauce (I quadruple the recipe so it can be used generously), and my mashed potatoes are a big fave… and my mom’s bran muffins from the 90s. My mom is finding it more and more challenging to cook but she used to make a mean stuffing and a decadent cauliflower cheese for Christmas… mince tarts… she still makes a great dark fruitcake with marzipan top.",
            "Homemade spaghetti of any kind (so many uses), veal marsala, some bastardized version of chicken saltimboca except with a mushroom topping between the prosciutto and cheese (can't find it online, so I can never lose the recipe card from my mom), and a chicken with a rosemary cream sauce. And pierogi with kielbasa for Christmas eve.",
            "pot roast or beef stew, potato soup",
            "Korean mom, kimchi jigge",
            "Lasagna and some random dish which is basically chicken wrapped in chipped beef and baked in a sour cream and cream of celery sauce among other seasonings. 11/10 over rice.",
            "The things I look the most forward to if I visit my parents are honestly things I usually do not make myself. It is kind of ironic since I didn't even like it that much as a child, but fresh cod with cod roe and fish livers is pretty high up on that list. Other things would be things that serve a larger crowd, like a leg of lamb or roasted pork belly.",
            "I always thought it was my mothers pumpkin soup, then after visiting her once, and she made it, i realised i could make it far better.",
            "My mom’s (ham bone) navy bean soup, her homemade Mac n’ Cheese, diced up butter fried potatoes at breakfast, or our every Sunday dinner for years - grilled tri tip, green salad, ranch beans, and (good local) sourdough rolls.",
            "My moms chicken and dumplings",
            "My mother died when I was 23 but her chicken and dumplings were the best I’ve had.",
            "I had this last night and it was soooo good. It’s a definitely a meal that makes you feel homey.",
            "My husband can make the best chick n dumplings and idk how!! Like the best I’ve had!! He won’t share how and I’m not mad about it lol",
            "I found that it's all in the broth -- if your mom was like mine, she focused on teaching the dumplings themselves and the final steps and skipped over the first ones... and those first steps are crucial.\n\nIt's been a long time, and while my chicken and dumplings has improved, it's also just not the same. The version she made with stew beef, however, is absolutely beyond me and I have no idea what I'm missing lol.",
            "Oooo mixing an egg into leftover mashed potatoes and frying them into cakes in some butter was an amazing after thanksgiving tradition in my house growing up. Smells and tastes so good!!!",
            "Moms Sunday roast always the best. Then she'd do a beef stew with the leftovers. It just felt like love eating it.",
            "Yum. Making roast with mashed Sunday, our heat wave is over.",
            "I just made congee for my sick kid today. Personally, I do chicken broth, with slices of ginger, lots of garlic, a little soy sauce, a splash of fish sauce and simmer my rice in it. Today I sliced up some leftover asian meatballs and stirred that in and topped it with green onions. She ate it for lunch and asked for more for dinner. (Also, I usually top it with a fried egg, but alas, I was eggless).",
            "Hamburger pie, Baby! Right out of the red and white checkered Better Homes and Gardens.",
            "I have the same recipe out of an old Pillsbury cookbook from-the 1980s. A yellow hard copy book.",
            "Oh my lord! This is my husband’s favorite meal his mom used to make - minus the green beans but I bet she put those in and he conventionally forgot that part. 🙄\nWe call it Daddy’s favorite meal - Hamburger Mashed Potatoes Tomato Soup thing. Haha!\nGotta look up the real recipe now",
            "So like an American iced cottage pie?",
            "And then a layer of lady fingers soaked in sherry and a layer of whipped cream..",
            "Sancocho?",
            "This is a true family comfort food.",
            "My mom made the same thing!! I also still make them! Such comfort food.",
            "Don’t forget the fried taters!",
            "This is just so cute.",
            "Meatloaf! And then cold meatloaf sammys the next day. So good.",
            "This all sounds amazing. Plus, it’s nice to know your dad developed a hobby later in life and got so very good at it!",
            "My father had a similar experience. My mom went back to work my senior year of high school to help with finances and he had to figure out more frequently cooking for a family of 7 with something more than just grilled steak, burgers and hot dogs. \n\nWe had some freaking overcooked pork, terrible lamb chops, dry chicken and inedible mushed vegetables until we collectively got it right. But he/we eventually got it right and now he's an excellent cook.",
            "Can I have your  recipe please? My mom made flat rolled out dumplings and she died before we could make them together",
            "Oh, I forgot\nAbout the damn meatloaf!! That is def one I cannot or anyone can replicate!!",
            "My mom never made cube steaks but my grandma would pressure cook them with a can of tomato soup, green peppers and onions over mashed potatoes. I miss my grandma’s cooking. I make this but no one else likes it as much as I do.",
            "Both of these sound utterly delicious.",
            "what are... ham balls?",
            "This is mine too. Beanie weinies with fried potatoes, and corn bread.",
            "I love the pie dough more than the delicious pumpkin pie. Never knew to roll the leftover dough it to make cookies. Will try.",
            "Fantastic choices",
            "I bet this is awesome. Chickpeas are one of my favorite foods and I don’t often hear people talk about special chickpea recipes.",
            "I’ve never heard of that!! Is there a recipe she shared or is it a mom thing??",
            "Is stamppot cooked like a fritter or is it more like bubble n’ squeak? (Mixed in a pan)",
            "Seems to be the most common through line in a lot of childhood favorites!",
            ">I also will forever love my mom’s potatoes and onions that she bakes in the oven. It’s literally so simple but so good.\n\nI'm standing here looking at a bag of russet potatoes and two Vidalia onions. Could you please share your mom's potatoes and onions recipe? My 90 year old Dad would be so happy. \n\nThank you!",
            "You are blessed to have had the opportunity.  My Nanas recipes died with her.  The sauce, meatballs, manicotti, pizzelles and butter cookies.   I’ve tried to find replacements over the years but haven’t been successful.  I did cook with her when I was young but she died when I was around eleven and of course, no written recipes.",
            "I knew they were magic",
            "My grilled cheese and soup is magic for my daughter too 💕.   I’m glad you made it through your recovery and that you had great parents to help you heal.",
            "Can you share the stuffed cabbage? I’ve never had that before and sounds good!!!",
            "Same! We’d walk to the shops and then fight all the way home over who got to carry them, because they were still warm.\nEventually the official ‘chip swap tree’ was designated, so then we just fought over who got them first!",
            "I’m sorry you lost your mom so young!",
            "I feel your pain, I lost my mom when I was 26. That was 15 yrs ago and I still want my mommy and her homemade beef stew. I've tried to replicate it and it's just not the same",
            "Are you suggesting she died for the dumplings 👀",
            "Probably on the back of a Bisquick box like most secret recipes are found.My grandmother's secret family recipe for cretons which is a French Canadian pork spread is so common that I found it online exactly as she made it.",
            "You had leftover mashed potatoes? Pffft… amateurs",
            "Do you buy the chicken broth or make it yourself?",
            "I suggest using fish sauce instead of soy sauce. Keeps the congee's color light and adds better flavor (in my opinion) vs soy sauce. \n\nFor my toppings/addons, I usually put shredded chicken and boiled eggs but if my butcher has tripe or pig intestines (gross, i know) i add those instead",
            "How much garlic is lots of garlic? This sounds amazing!!",
            "100%!! Too funny to know where it came from, and it totally tracks. We had the same cookbook, and the same dish with same name was a staple of my childhood.",
            "It had some excellent recipes which I still make.",
            "Look for their cheese soufflé. Cheese, bread, butter. I used to make it for my kids and they loved it.",
            "I have this plus my mom’s red Betty Crocker cookbook from her bridal shower in the 60’s. \n\nI feel like I should go buy something contemporary to carry on the legacy. \n\nAny suggestions?",
            "https://youtu.be/_ajaKENN-Wk?si=T_0tFlolSPOtXw0Z\n\nThis is how I make mine\n\n2 cup all purpose flour \n1/4 cup shortening \nEnough milk to pull it together ( I start with 1/3 cup).",
            "I agree! My Mom made the best meatloaf. We have the recipe that she used - it was one that she made up herself. My brother, who is an excellent cook, made it, but it's not the same.",
            "I guess they are a very Midwestern dish. It’s pretty much meatballs but made with pork and ham. Like this recipe: [Ham Balls](https://www.julieseatsandtreats.com/ham-balls/)",
            "Also interested",
            "Love cornbread too.  I love cornbread with great northern, navy, or pinto beans too. And fried potatoes with that as well. \nI even like onions and hot dogs fried in my potatoes too",
            "Nothing better in my eyes! The *best*",
            "It’s central Asian food. There’s 2 ways of making it. Some people sauté the chunks of meat, diced onion, chunks of potatoes and sliced carrots. Then fill the pot with water and add 2 cups of chickpeas and let it simmer for couple of hours. The other way is, you fill the pot with water first and add your meat and whole peeled onion, sliced carrots, potatoes and chickpeas and seasonings and let it simmer for 2 +hours. \nMy mom does the second one but she add lots of bones with marrows and fatty meat. So it becomes super delicious. Not oily at all, just rich with flavors . I know how she makes it but it never tastes like hers.",
            "It’s labor intensive, lol. And I don’t really have measurements since I’ve been eating it all my life. My family recipe is stuffed cabbage with Italian influences — traditional stuffed cabbage has a sauce that is on the sweeter side, but ours is more like marinara sauce.   \n\nI do have a far more simplified way to do it that I call stuffed cabbage soup. It tastes almost exactly the same, but instead of cabbage rolls, it’s pieces of cabbage cooked with meatballs and kielbasa. Would you like the recipe for that?",
            "Yes ! And fight over the crispy ones at the bottom. Yum",
            "Thank you. We were close. It was sudden. Appreciate your condolences 🩷",
            "Correction.",
            "Nestle Toulouse. Grandma's best recipe.",
            "No. We don’t have bisquick in our house cuz it is gross!!",
            "🤣🤣🤣",
            "I use “better than bullion.” I have many carcasses to boil down, I just lack the foresight.",
            "She got a fever pretty suddenly, so i used box shit. Otherwise, I would have picked the meat off an astronaut chicken from Harris teeter and boiled up them sweet, sweet bones. (With onion tops, celery ends, some baby carrots, and prepackaged \"poultry herbs\")",
            "The double fried ones?! Perfection.",
            "That’s awful! I was 41 when I lost my mom, and it was horrible. I felt like an orphan. I just can’t imagine you going through that.",
            "I’m gonna need that recipe 🤌",
            "That it is.It's like wallpaper paste you can kinda eat.I make almost everything from scratch but some products have interesting recipes on their packages.",
            "I’m sorry you went through that too. So hard when loved ones are taken early. \n\nA neighbor who is in her 60s mom lived till all she was over 100 years old … I sometimes wonder if people appreciate having their parents with them for so long.  \nIt’s a good thing when people are so fortunate.",
            "I’m not sure I can find it. She died 52 years ago. I’ll see whether I have it.",
            "I’ve often felt this way about grandparents, I lost the last of mine when I was 16, but always see people older than me post about being with their grandparents, and I can just hope they appreciate the time they get with them.\n\nLost my dad while I was 27, about a month into covid. Hardest thing I’ve ever had to deal with."
        ]
    },
    "At age 35 I've developed a severe egg allergy. Need breakfast ideas.": {
        "title": "At age 35 I've developed a severe egg allergy. Need breakfast ideas.",
        "score": 7,
        "url": "https://www.reddit.com/r/Cooking/comments/1dlu9yd/at_age_35_ive_developed_a_severe_egg_allergy_need/",
        "content": "After an accidental encounter with eggs last week, that sent me to the hospital, my husband has banned eggs from the house.\n\nNow I have to figure out breakfast ideas for the whole family. Previously breakfast was often omelets or French toast.\n\nCurrent breakfast rotation includes:\n\n- home made poptarts\n- from scratch muffins\n- waffles\n- fruit\n- home made croissants and breads\n\nWe're looking for something savory instead of sweet. Hoping to add 3 or 4 savory ideas to the rotation.",
        "num_comments": 26,
        "comments": [
            "Bacon, Avacado, and Tomato on sourdough sandwiches\n\n\nCountry Ham and Grits.",
            "I can’t have eggs either, so if I’m really missing it I go with some scrambled tofu. \n\n\nOtherwise it’s either: \n\nGreek yogurt with fruit and granola \n\nBacon or sausage with a small thing of Greek yogurt \n\nSmoked salmon with cream cheese on a bagel thin\n\n\nIf it’s a weekend and making food for kids I’ll do biscuits and gravy or pancakes make with the Krusteaz mix (it’s the blue one that doesn’t add eggs)",
            "hash without the eggs, so potatoes, sausage, peppers, etc",
            "Chickpea omelette’s are so good and so easy",
            "Biscuits and sausage gravy",
            "Biscuits and sausage gravy.",
            "Potatoes and rice are my staple starch. For protein, sausage, chicken, bean/soy… you can also consider something to dip bread into. Like shashuka without eggs. \n\nAlternative- oatmeal, cream of wheat?\n\nJust out of curiosity did you always have it and it got worse? Best of luck to you and praying you don’t have another encounter.",
            "Biscuits and sausage gravy are your new best friend.  Best side is grits with butter, salt and pepper.",
            "Do you have allergy to both egg yolks and whites?",
            "Oatmeal. Simple and easily customizable",
            "Why don’t you just eat leftover dinner for breakfast?",
            "Yogurt?",
            "Avocado toast. Corn fritters. Anything vegie fritters. \n\nAlso, you can make muffins, pancakes and waffles without eggs easily. I’ve come to believe that our rampant egg use is a conspiracy.\n\nEggs for sponge cake - yes! So necessary. \n\nEggs for gluten free cake/flourless chocolate cake - yes.\n\nEggs in pound cake - unnecessary. \n\nEggs in banana bread - completely unnecessary.\n\nEggs in cookies - mostly unnecessary.\n\nEggs in biscuits - unnecessary.\n\nEggs in meringues or pavlovas - turns out, completely replaceable with aquafaba.",
            "You can also do savory pop tarts or pastries. Fill them with ham and cheese or something like that, instead of fruity flavors, and that's a solid savory option.",
            "I mean, it's not gonna be a 1 to 1 analog, but doing silken tofu as a scramble is definitely at least something to switch up as a sub.",
            "lt isn't the healthiest in the world, but I love a nice crispy frozen hashbrown patty with some cheddar cheese and sour cream on top. Snip some green onion on top if you're fancy.\n\nCorn tortilla + hashbrown (fresh or frozen, take your pick) + some sauteed spinach/tomato/onion also makes a delicious morning meal.\n\nSome rice and fried spam is good - honestly any rice + topping savory combo really hits the spot.\n\nSometimes I'll do a breakfast BLT. \n\nHaving a bag of frozen waffles in the freezer is great for a quicker carby option - a nice little waffle PB&J sandwich, or PB&Banana, or just maple syrup. \n\nCould pick a hearty breakfast cereal and lean into that, too. My personal favorite is some oatmeal squares with sliced up banana and sometimes a splash of chocolate syrup to turn the milk chocolatey for a sweet treat.\n\nHope some of these help! Breakfast is honestly the meal I find it most difficult to want to consistently eat, so I prioritize quick and easy. Healthify or fancify at your own leisure. :-)",
            "Youre 35 and you still believe in breakfast foods? Mise en place the night before in your fridge and you can eat anything you want. Have a salad. Maybe have a tuna bagel? Loaded baked potato.",
            "That does sound good! Thank you!",
            "Do you just scramble firm tofu in a pan and heat it?",
            "Adding to rotation! Thank you!",
            "Also vegan French toast is a thing",
            "Man! It's been forever since I had Shashuka! That sounds amazing!\n\nI didn't realize it was an allergy. So I had it, but didn't know. I'd always get sick if I ate just plain eggs (like an omelet). But I always thought it was a mental block. I've always thought the idea of eggs was kind of gross (despite being delicious).\n\nAnyway, one day I ate them and my eyes were watering uncontrollably and they itched, and then I had what I thought was an asthma attack. I was on the phone with my friend (who is a doctor) and she was like \"that sounds like an allergy to me\". So I cut them out.\n\nI had a few accidental exposures that all had about the same kind of severity as far as reactions go. But this last one was a week ago, and it was baked into something, so I didn't think much of it. I couldn't breathe, and my whole face swelled up.\n\nSo now my husband has tossed everything in the house with eggs, and has banned eggs of any sort being brought in.\n\nI also have a life-threatening allergy to peanuts. So we're aware of how to navigate it. Eggs are a much bigger pain in the ass though.",
            "I don't know yet. I have an appointment for an allergist. But I live in a very populated place, so it's scheduled for 10 months from now.",
            "Because I really enjoy cooking. Lol. That's literally my only answer for you. I make absolutely everything from scratch.",
            "Home made hot pockets! \n\nWhy didn't I think of that? Great idea! Thank you!",
            "My husband is the one that eats French toast. He's a gym bro. It was mostly to add protein to a food he enjoyed. But! Others in the house might enjoy this! I'll give it a shot."
        ]
    },
    "You’ve just eaten the last pickle and are looking down at a jar of pickle juice": {
        "title": "You’ve just eaten the last pickle and are looking down at a jar of pickle juice",
        "score": 9,
        "url": "https://www.reddit.com/r/Cooking/comments/1dltkqo/youve_just_eaten_the_last_pickle_and_are_looking/",
        "content": "I figure most people just throw it away or pour it out their nearest kitchen window but there must be things you can use it for, post pickle consumption. ",
        "num_comments": 58,
        "comments": [
            "I have chicken marinating in a jar now.  I will do a light breading and air fry.",
            "Pour it out the window?? Who does that?",
            "Add carrot sticks and bell pepper strips and let them pickle!",
            "Wear it like a sexy cologne",
            "I add it to my deviled eggs",
            "it’s a lovely drink! but if that’s not your style you can always make more pickles, or use it as a brine",
            "Cut up some chicken breast and fill the jar up. Let that sit over night and bread and fry it up! Best chicken nuggets ever.",
            "put it in micheladas / bloody mary’s\n\ni drink some after a bike ride to replace salt i sweated out",
            "If you live in Philly you drink it.",
            "Dressings and vinaigrettes",
            "poach fish (cod, catfish, some kind of white fish) in it.  No need to season the fish, you just put the juice in the pan, maybe add a bit of sugar,  bring to a boil, put in fish, cook each side about a minute or so, and that's it.  reduce the juice till it's thicker and that's your sauce.",
            "I use it for quick pickling veg. Or brining chicken. It’s also nice to add to a dressing, especially potato salad.",
            "Add it to vodka",
            "Drink it. Also it’s the secret ingredient in ketchup/mayo fry sauce",
            "Flick it on your sandwiches for flavor",
            "It's full of electrolytes! Possibly not as tasty as an isotonic sports drink tho",
            "Add a touch of it to potato salad, coleslaw, burger sauce, etc",
            "Ultramarathoners drink pickle juice for electrolytes and to settle the stomach. That is liquid gold you have right there.",
            "I use it in so many dishes. I’ll mix it with yogurt to make a marinade for chicken. Or use it to marinate chicken on its own. I add it to salad dressings. Mix it with mayo to make dill pickle potato salad or chicken salad. Throw some carrots, daikon and green beans in there for refrigerator pickles. Add a splash of it to eggs before scrambling\n\nDumping it is a big waste of a cheap ingredient that elevates a lot of dishes.",
            "Use it for brining chicken when you want to make chicken sandwiches/burgers.",
            "I slice cucumber and throw them in but I love the idea of using it to brine chicken. Going to try that.",
            "Drink it it's good for you and delicious.\n\nAlso can be used as a base for salad dressing, marinades, add it to soup stock, or beans, name popsicles, the possibilities are endless",
            "Slurp",
            "King Arthur has a recipe for [using pickle juice to make rye bread](https://www.kingarthurbaking.com/recipes/sandwich-rye-bread-recipe). I've made this a couple of times; if I did it again I'd cut the pickle juice down to 2/3 cup and top off with water (the flavor was a bit too dominant, and I like pickles).",
            "Drink it. But only if its real pickle juice not the chemical bine from preserved pickles",
            "Add peeled boiled eggs, wait a few days, and you have picked eggs (but this must stay in the fridge so the time) This is really better for pickled beet juice, but it's interesting to try dill or sweet pickle brine as well. \n\nAlso I haven't tried it, but I've seen pics of homemade popsicles made from pickle juice. It made me think of also trying freezing it in small ice cube trays to add to something like a bloody Mary.",
            "If you’re a runner/cyclist/endurance athlete, a shot of pickle juice can be a game changer for dealing with cramps and helping you retain water during your workouts. It’s liquid gold, don’t throw it down the drain!",
            "Fermented pickle brine is an excellent rehydration agent in the summer, especially when made into popsicles. I wouldn’t use vinegar based pickle juice that way but something like Bubbies brine makes a gut-healthy alternative to sports drinks.",
            "Add a splash to martinis instead of olive juice",
            "I’ve got a jar of pickle juice in my fridge right now, just waiting for the next time I fry up some chicken.",
            "Make a slaw, tenderise chicken, use it to cut mayo for an easy salad dressing.",
            "Marinating chicken and chasing whiskey are the most common uses. Also, rehydrating after a long cardio effort.",
            "My neighbor adds it to her meatloaf. ",
            "A friend of mine saves his dill pickle juice and uses it around Christmas time when it's time to make borscht. ",
            "In this heat wave? Drink it!",
            "Drink it!",
            "Brining chicken or making pickled eggs.",
            "Use it in sweet and sour sauce for meatballs",
            "Drop in some sliced red onions and/or jalapenos. Wait a few days. MMMMMMM.....",
            "I dip my fingers in it and flick in on my sandwich. My roommate doesn’t understand",
            "Window??",
            "Pickleback\n\nhttps://www.thespruceeats.com/how-to-make-a-pickleback-shot-4156982",
            "Pickle steak, add cucumbers to make your own pickles, brine chicken for frying or grilling, or just drink it",
            "I have the opposite problem, I don’t care much for pickles but I like pickle juice. I wish they sold the juice by itself sometimes",
            "Present it to your nearest trans women. Most of us love salty pickles and the juice.",
            "I am absolutely going to try this. How long do you let it marinate for? I don’t really experiment much but I do have an air fryer now and ofc pickle juice lol. I already know i like fried pickles but I’ve never thought of marinating something in pickle juice and then breading and frying",
            "If you want to make sure no plants ever grow there.",
            "Plot twist: OP lives in the 5th floor of an apartment building",
            "Try mixing it into your tuna sandwiches.",
            "This ☝️",
            "I don’t and I do. It’s delicious!",
            "Once had some drinks with a dude who brought vodka and had everyone chase shots with pickled eggs. Worked way better than I thought it would and also I love quail eggs.",
            "Unless your roommate throws it away.",
            "Probably everywhere too, but in Australia you can buy 75ml bottles advertised to drink during sport to reduce cramping. Drank one of my mates, it is vile. And $60 a litre",
            "I'm not who you're replying to, but I'd marinate for a good long while. The book Salt Fat Acid Heat explains the science behind marinade times, what salt does for juiciness, how acid tenderizes, etc. it's a pretty good read, and is available at most libraries.",
            "Chick a filet uses pickle juice! Mine has been in 2 days because I didn’t want to cook yesterday.  But it doesn’t need long",
            "Oooh yeah."
        ]
    },
    "What is everyone eating in this heat wave?": {
        "title": "What is everyone eating in this heat wave?",
        "score": 315,
        "url": "https://www.reddit.com/r/Cooking/comments/1dl61us/what_is_everyone_eating_in_this_heat_wave/",
        "content": "Other than the usual hamburgers and hot dogs and salads, what other meals for two are good for these hot days?\n\nI'm looking for ideas don't involve using the oven. I'm open to slow cookers, and maybe even an air fryer once in a while (but that still creates a bit of heat), but I am trying to keep the house cool. 🥵\n\n**ETA**: I'm in central NY. High 80's to high 90's with extreme humidity is very much a heat wave for us. It's been this hot since Monday and will continue until after next weekend. This type of weather is normal for end of July/August (but not always the humidity). This is not our normal mid-June weather.",
        "num_comments": 599,
        "comments": [
            "Sandwiches are always great for no cook days.",
            "Cold [soba noodles with dipping sauce](https://tiffycooks.com/cold-soba-noodle-dipping-sauce-5-minutes/). Make the sauce in bulk and it'll last in the fridge for a month. Noodles just need to be boiled for a few minutes, so as long as you can handle the stove top on for a little bit. If you have an induction stove top then you can benefit from less excess heat.",
            "Buy a rotisserie chicken and use it for pasta salad with lots of veggies, strawberry spinach salad, chicken salad sandwiches, chicken enchilada dip, quesadillas only take a couple minutes on the stove.\n\nTabbouleh, bruschetta, homemade salsa and guacamole with chips, spinach dip",
            "Cold plate. Assorted lunch meat, pickles, potato salad, coleslaw and veggies with dip.",
            "Gazpacho!",
            "Greek yogurt with cucumbers and minced garlic scapes.",
            "I don't get bored of cold rice bowls. There's a ton of veggies in season, most of which are fine raw, so it's basically rice with salad. And I keep the dressings light and bright.  \n\nAs for protein, I'm not averse to some canned stuff if need be.",
            "I threw some boneless pork shoulder in the slow cooker yesterday with garlic, ginger, hoisin, and soy sauce, then sliced up some carrots, cucumber, and cilantro and made knock-off bahn mi for dinner. \n\nI also have some frozen shrimp which I may toss in the air fryer this weekend (it cooks so fast that any heat your air fryer gives off would probably be negligible), would probably either have those on tortillas with a spicy mango slaw or on a hoagie roll with some shredded lettuce, remoulade, & hot sauce.",
            "Blender cocktails, anyone? 🤣\n\nWe are doing salads tonight. Maybe tuna poke bowls tomorrow. I love cold sesame noodles and someone posted that idea here and now that’s my craving. So, probably those.\n\nETA: I did get an amazing avocado gazpacho recipe when I was in Costa Rica. I may do this tonight, too.\n\n20g Onion\n100g Avocado\n20g Kale\n120g Spinach \n10g Basil \n1 cup Coconut Milk \n100ml Orange juice\n30ml Lemon juice \n200ml Cold water\n40ml Oil \nSalt, pepper\n\nBlend and eat! Maybe a little basil drizzle. Cold shrimp if you’re looking for protein.",
            "Pasta salad!",
            "I tend to lose my appetite when it's hot. Salads and smoothies feel right.",
            "Ciabatta with apricot chutney and some soft cheese, I usually put in the panini press for about 2-3 Minutes.\n\nSometimes I add a bit of prosciutto or some leftover rotisserie chicken.",
            "Snyders of Hanover pretzel pieces. Goddamn these things are good. Every single flavor is amazing. How do they do it?\n￼",
            "Popsicles? I make popsicles out of everything, I'm having an orange juice popsicle at breakfast and a margarita mix popsicle dropped in tequila when I want a drink.\n\nPopsicles.",
            "I keep a bag of frozen dumplings and steam those for a quick meal. \n\nSandwiches. Especially tuna salad (mom used to make it during summer break from school, it’s an all time fav of mine)\n\nShrimp salad. \n\nThe other day I made fish with a lemon caper sauce and some rice. Delightful.\n\nLots and lots of fresh homemade salsa.",
            "Cold sesame noodles",
            "Charcuterie boards",
            "I used to have a cookbook specifically for cold food in summer, let me look for it.\n\nEdit: it’s called eat cool. \n\nSome broad suggestions: cold poached fish, lots of use of the grill, cold noodle dishes.\n\nI can provide recipes if you message, I don’t want to violate copyright lol",
            "Caesar salad topped with salmon cooked in the toaster oven broiler",
            "Pasta Primavera is one of my favorite summer meals. Lots of fresh veggies",
            "Pasta al Limone",
            "pitas with hummus, tzatziki, chopped cucumbers + tomatoes\n\ncold asian noodle dishes with lots of raw chopped veggies (plus a medium-boiled egg if you can stand to use the stove, skip if not)\n\npasta salad with pesto, tomatoes, mozzarella, arugula",
            "Green bean salad, every day because I can’t stop making it. Basically the same as pasta salad, but swap the pasta for bleached green beans & add in a whole bunch more vegetables— tomatoes, red onions, bell pepper, banana peppers, edamame, radish,  blanched broccolini, basically whatever I’ve got in the fridge. It’s twice as refreshing as pasta salad. Add some avocado and chickpeas and it can stand on its own as a meal. It also keeps well for a couple days in the fridge.",
            "Tuna pasta salad",
            "Tarator – Traditional Bulgarian Cold Summer Soup\n\n\nINGREDIENTS\n\n\t• 1 English Cucumbers Large\n\t• 4 Garlic cloves\n\t• Handful of fresh Dill\n\t• 1 ½ handfuls Walnuts Raw or roasted, chopped\n\t• Yogurt (½ large container)\n\t• 2 tsp Salt or salt to taste\n\t• 2 tbsp Olive oil\n\t• Water about 2 Cups\n\t\nINSTRUCTIONS\n \n\t1. Chop the cucumbers into small pieces. Finely chop the garlic, or use a garlic presser. Chop the dill and walnuts.\n\t2. Add the yogurt, salt, and pepper. Mix everything. Then add the water and olive oil. Mix one more time.\n\t3. Transfer to the fridge for at least an hour or till cold. Serve and enjoy.",
            "I have the A/C on, so it's cooking as usual.",
            "I baked some rolls ahead of time and we had tuna and Swiss with chips one day, grilled chicken (ran outside to light the grill, then back in, outside to throw on chicken, then back in and so on) and a green salad from the farmstand, then we did takeout the last day of the heatwave. \n\nYou could totally purchase rolls; I just had a recipe I wanted to try. \n\nAnother one we like to do is a mezze/cheese platter mash up. I’ll make some combo of hummus, baba ghanouj, tzatziki, or muhammara. Pita triangles, assorted veggie sticks, cubed or sliced cheese, and maybe a cured meat. Some olives, pickles, and whatever fruit you’re looking to use up works too.",
            "Panzanella salad. Cubed bread (I usually toast it) with tomato, cucumber, onion and dressing. Topped with meat I grill outside. Delicious and very easy to come together.",
            "Shrimp rolls",
            "Honestly nothing more nostalgic for hot summer weather than cold cuts in rolls with chips or potato salad",
            "Naps",
            "cowboy caviar. put it in a big burrito with rotisserie chicken and avocado 😋",
            "Today I'm making breakfast burritos for lunch. Sausage, egg, and cheese. Then dinner is going to be a tuna poke rice bowl. For this weekend, I'm planning to make some chicken salad sandwiches for lunch, and tonight I'm marinating some chicken thighs to make chicken satay tomorrow on the grill. For Sunday, I'm thinking of firing the grill again for some beef kefta, fatoush, and hummus & muhamara dips.",
            "I ate my homemade quick cucumber pickles for breakfast and had a cup of coffee. \n\nQuick pickles: peel and slice cucumber, mix with sliced green or red onion, equal parts lemon juice and soy sauce, fresh cracked pepper or diced up small jalapeno or red pepper flakes, dill, smashed garlic, let marinate for at least two hours enjoy.\n\nFor lunch I am having leftover fried chicken and a green salad with lettuce, radish, lentil sprouts, some more of my cucumber pickles, vinegar and oil dressing salt and pepper if needed. \n\nFor dinner I am having hardboiled eggs, cheese, salami, and more pickles.",
            "I really like cold foods during heat waves. Meera Sodha's bun cha is a great recipe, especially for serving to a group or if you need leftovers. \n\n[https://www.theguardian.com/lifeandstyle/2018/apr/07/vegan-spring-veg-noodle-salad-with-pickled-cabbage](https://www.theguardian.com/lifeandstyle/2018/apr/07/vegan-spring-veg-noodle-salad-with-pickled-cabbage)\n\nIt can be made veggie or you can easily add a meat like chicken, shrimp, etc.",
            " Frozen blueberries (bought fresh then washed and popped in the freezer- better texture that way)",
            "Room temperature silken tofu doused in homemade chili oil and herbs has been my lunch all week",
            "Watermelon, tomatoes (I like campari), sweet basil, and chunk feta. Chop, refrigerate, and throw together for a crazy delicious salad that tastes like summer.",
            "Korean spicy cold noodles with lettuce cucumbers red onions and boiled egg on top!!",
            "Cold soba noodles with tahini, and raw cucumber and carrots. It's very refreshing.",
            "Summer is when the tomatoes are delicious!  BLT sandwiches, Caprese Salad with Fresh Basil, Caprese Sandwich with Pesto.",
            "Just margaritas atm. We're gonna need some guac if this keeps going, though",
            "Macaroni salad, lots of fruit, green salad with strawberries and blueberries, carrots ,cucumbers, celery. Outshine frozen fruit bars, grilled chicken ceaser salad.  Homemade pickled cucumbers. Turkey, bacon, avocado sandwiches.",
            "I made up some cold salads for the week (chicken salad with rotisserie chicken from grocery store, seafood pasta salad and mac salad)\n\nEdit: (to your edit) I’m also in CNY! Hope you’re staying cool 😎",
            "Corn salad. Corn cooks in the husk in the microwave in 8 minutes. Dehusk, cut from the ear and add whatever you'd like. I suggest onions, peppers, and any protein, but a smoked sausage would be great. Season and sauce. Salt, chilli powder, mayo, some fresh herbs, etc. Eat cold. \n\nLots of fruit! Fruit is delicious and cooling. \n\nSummer feels more like summer if you're eating fresh summer fruit and veg.",
            "All about the salads! And lots and lots of Greek yoghurt + fresh fruit...",
            "I'm in central New York, too. Omelets.  Bush's Baked Beans with a sandwich. I love them cold. [https://www.bushbeans.com/en\\_US/bean-recipes](https://www.bushbeans.com/en_US/bean-recipes)\n\nGet an Instant Pot if you don't have one. [https://www.pressurecookrecipes.com/](https://www.pressurecookrecipes.com/)\n\n[https://www.365daysofcrockpot.com/](https://www.365daysofcrockpot.com/)\n\n[https://www.ayearofslowcooking.com/](https://www.ayearofslowcooking.com/)\n\nfrozen chicken nuggets in air fryer",
            "Pulled pork salad. \n\nLeave the kitchen while the slow cooker is running, add a glass of beer once in a while.\n\nServe a nice scoop of hot pulled pork with a green salad with a Cole-slaw style dressing.",
            "Sous vide…sous vide everything so i neither heat up the kitchen nor so i have to go outside.\n\nI do it in a cooler, so heat loss into the room is very minimal",
            "Believe it or not chicken noodle soup is quite refreshing on a hot day.",
            "Civiche",
            "Been having nicotine and water for lunch a lot.",
            "Pasta salad and sandwiches",
            "Sandwiches and salads. ",
            "Planning a potluck with friends and on the menu so far: ground turkey meatballs, chicken, salad, cucumber, crèpes with berries. We’ll probably eat inside but like to eat seasonally anyhow. Grilling is an option but we try to avoid using the oven.",
            "Beer and water",
            "We’ve officially hit corn on the cob and potatoes and/or meat season. Everything can be done on the grill and keep the house cool, and it all still tastes good cold. We also do fruit smoothies a ton. If my husband ate salads we’d do that too.",
            "Subway 🤷‍♀️",
            "If you want a protein heavy meal- pulled pork in the slow cooker is a good one. Add a cold coleslaw or any kind of salad on the side. Yum.",
            "Fruit salad with Greek yogurt dressing.",
            "I made a buffalo chicken wedge salad with bleu cheese crumbles, Bleu cheese dressing, and diced tomatoes. Delish. Cold cuts, I was craving Cajun turkey. I sweat excessively at work every day since the AC is out. Normally it's a temperature controlled environment. Go finger the AC stops working right as we get hit with this heat wave. And I'm so not used to working in this stuff.  Only been eating cold foods.",
            "Aldi has a twin pack of pork loins and I’ve been cooking both in slowcooker very plain, just salt, pepper, and like 1/2 cup of chicken broth. Then I either cool and slice, and serve with mashed potatoes (instant pot) and gravy, or I shred and serve with bbq sauce in lettuce wraps. My kids are picky eaters so they prefer to add the sauce themselves.\n\n\nChopped cabbage salad with leftover chicken or defrosted frozen prawns, topped with crushed raw ramen noodles and sesame dressing. \n\nSummer rolls\n\nPasta salad (I cook it in the morning before it’s too hot out)\n\nTuna salad sandwiches or on top of baked potatoes (slowcooker potatoes) I put diced celery, dill relish, and mayo in mine. We put Fritos in the sandwiches.\n\nBLT’s\n\nEgg salad - IP the eggs. \n\nSushi rice with frozen mixed veg and I use toasted seaweed snacks to pick up some rice and veggies and eat. It’s extremely lazy and I wouldn’t eat this in front of company but it’s yummy. \n\nAbendbrot/snack plate. All the deli faves.",
            "So I wanted to be light. I cut up cucumber, onion, bell pepper, I have already cooked cold garbanzo beans, mozzarella, pineapple, cantaloupe, and jalapeños. I set it out for all day for my family and I personally like to use avocado salsa mild hot.  All\nCold and cut. \n\nTomorrow I am going to display, orange, apples, tangerines and kiwi, turkey slices and ham slices with cold cheese cuts along with same vegetables as tonight. This way in the morning to evening everyone will eat and then I will wrap it up ( if anything’s left) \n\nSunday I am going to display cottage cheese, peaches, apple, English muffins, cream cheese plant base, and salami, turkey and onion, chives, cucumber, broccoli and tomatoes cherry with a red bell pepper. \n\nI plan on keeping everything cold, and easy to grab and snack and go.",
            "We live in Florida and are used to hot summers, and of course we couldn't live very comfortably without air conditioning.  Thankfully, the new A/C unit is quite efficient.\n\nWe also use a portable induction burner on a table out in the patio to make things that will smoke/smell up the house, like smash burgers, anything shallow or deep fried, etc.  The house has one of those rinky dink fan exhausts over the stove that barely filters the air instead of pulling it to the outside.  One of the top things I'd like to fix! \n\nPlanning a pulled pork possibly this weekend.  The last time I made it in the Instant Pot (could easily put that outside on the patio table as well), and used Puerto Rican pernil type seasonings (sofrito, cumin, lots of garlic, cilantro, oregano).  It gave us the basis for pulled pork across several dishes, from enchiladas to Cuban sandwiches to a Chipotle-style bowl (just had to add a little chipotle sauce).  I'll probably buy the pork from Aldi, which has the smaller Boston butt cuts suitable for just two of us.  I made a huge one last time and we were eating it all week.\n\nWe also have a bunch of falafel in the freezer from a project a few weeks ago.  They are best fried, whether shallow or deep fried, but they can be air-fried, best on a bit of parchment or silicon mat so they don't fall apart removing from the tray.  Great in a pita with a little Greek salad stuff and some tahini sauce.  Admittedly, they do take some planning, as you've got to soak the chickpeas for about 24 hours before grinding them.",
            "Just crushed a hummus platter.",
            "https://www.reddit.com/r/Cooking/comments/1dj8f6s/any_ideas_for_cold_no_cooking_at_all_tofu_dishes/\n\nhttps://www.reddit.com/r/Cooking/comments/1dl2woe/ideas_for_dinners_that_wont_heat_up_the_house/\n\nhttps://www.reddit.com/r/Cooking/comments/1di6kkk/what_are_you_cooking_during_the_heat_wave_that/\n\nhttps://www.reddit.com/r/Cooking/comments/1dgnf6b/protein_ideas_that_wont_heat_up_my_house/\n\nhttps://www.reddit.com/r/Cooking/comments/1dfrzmd/heat_wave_recipes/",
            "I live in the deep south and have the air conditioning on year round, so I'm always cooking/baking.",
            "Heat wave? This is normal summer now baby",
            "Lots of sandwiches and cereal lol",
            "Shrimp ceviche. Had some from the store last week and decided to make my own. Easy, no cooking, fresh and yummy!",
            "Gazpacho!!",
            "Watermelon and fruit salads",
            "Poke bowl salad. A bunch of veggies, a healthy splash of ponzu sauce, and whatever fish you like.",
            "I’ve made 2 different pasta salads this week that can be full meals. (My son loves pasta salads) Typical tuna-Mac salad but my favorite was the antipasto salad with peppers, olives, Genoa salami and provolone(I use Asiago-like the funk). Made a red wine vinaigrette type dressing. Light but filling.",
            "Garden salad, pasta with a few veggies and shrimp in a garlic butter sauce, cold veggie plate with cheese & crackers, and I picked up some frozen microwave meals last night that were on sale",
            "Ice cream, ice cream and more ice cream 😉",
            "Salads. Lots of salads.  Sub sandwiches and homemade pizza .",
            "had another idea. either chicken, egg, or tuna salad sandwiches are underrated. Or you can put your own spin on them a la Chicken Salad Chick [https://www.chickensaladchick.com/menu/restaurant-menu/chicken-salad/](https://www.chickensaladchick.com/menu/restaurant-menu/chicken-salad/)",
            "When it's hot out I eat cold foods, Salads, Charcuterie, Sandwiches Occasionally I will BBQ paired with Potato Salad and ColeSlaw.",
            "Same - I am currently grilling outside in the afternoon.  It sucks but keeps the heat out there!\n\nOn rotation is Caprese, Charcuterie with whatever is on hand, and Corn Salad (the lime/olive oil kind, not the gross mayo). Supplementing with lots of fruits, veggies, and hard boiled eggs.",
            "I've been making turkey rollups:\n\nGiant tortilla\nGarden veggie cream cheese\nLunch meat turkey\nSpinach\nCheddar/Colby jack, or cheese of choice \nThin sliced apples\n\nRoll it up and slice into pinwheels.\n\n\nOr crockpot meals.",
            "Hello from Syracuse! We tend to cook a lot but in this heat been doing _a bit_ more takeout / convenience meals, salads, sandwiches, and thanks to our insanely long summer days some 8PM grill sessions when it's gotten a bit cooler out so we don't heat up the kitchen.\n\nI lived in Florida for 20 years before moving here so thankfully that has me well prepared to exist outside in this level of heat - especially since it's nowhere near as bad as the same temps in Florida due to being less humid here. In Florida it's basically this hot but more humid from Memorial Day until mid-October.",
            "Cottage cheese with cut veggies in it. Sour cream with blueberries & bananas. Lots of iced tea, chilled shrimp, ice pops",
            "Veggie wraps with ranch, jalapeno sauce, tomatoes, cucumbers, avocado.",
            "As someone who grew up in the south, I don't know how you people survive without air conditioning",
            "Girl dinner mostly",
            "There are 2 things I can tolerate eating during a heatwave in Cyprus (and we get a lot of them): \n\n(1) watermelon, raw halloumi, and fresh mint leaves. Can eat with a slice of bread for more substance \n\n(2) Ice cream \n\nGood luck",
            "Today for example: \nBreakfast: coffee, and a peach and half a banana. \nLunch: pasta salade \nDinner: yogurt and a few cherries. I’m going to make popcorn since i still feel hungry but cant imagine standing in the kitchen and cooking or ordering food because thats how i end up broke every month",
            "Beans, rice, and crock pot chicken. Might as well be healthy while I’m miserable from heat.",
            "Ceviche is always good for a hot day.",
            "Rice paper summer rolls with shrimp, basil, rice noodles etc. with a peanut satay sauce.",
            "Pork loin schnitzels with hollandaise sauce paired with a potato salad and a cold beer 🍺",
            "https://sweetsavoryandsteph.com/healthy-greek-chicken-salad/\n\nTry this and you won’t be disappointed. I make a giant batch and eat it for 3-4 days for each meal and I don’t tire of it.",
            "It's also worth noting that burrito bowls are delightful when they're cold. So either make your own or stop by your favorite place and throw it in the fridge for later.",
            "cucumbur",
            "Carnitas.\nI throw a pork shoulder in the slow cooker, toss in come garlic, cumin, coriander, cinnamon, paprika, salt and some lime juice.  \n\nTacos for days- I love cold left over tacos",
            "It's 111° in Palm Springs today, and yesterday we had a temporary (4:30 to 8:30 PM) blackout, due to excessive demand for electricity, and we we went to Trader Joe's (they had power) and I bought a Cobb salad, and my brother bought shrimp spring rolls.  We had no lights, and so it would have been difficult to cook (we had gas), and we did not eat until the electricity was back on.\n\nThere is liable to be more of this during this summer.\n\nBecause the humidity is 9%, the heat index is 101°.  Yesterday the humidity was 5%, and it felt like 96° when it was 104°.",
            "I’m in Cambridge, MA, and we also do not usually have this kind of weather in mid June. It sucks.  \n\nCan I suggest not a salad but an AMAZING salad dressing? 1 cup nutritional yeast, 1/3 cup soy sauce, 1/3 cup apple cider vinegar, 1/3 cup neutral oil like avocado, pinch of garlic powder OR 1 clove garlic, put it in a jar or other container & then put your immersion blender in & blend until smooth. This is my go-to vinaigrette. And it goes well on lots of things other than salad. The nutritional yeast gives it this richly nutty, umame flavor.",
            "This spring roll bowl recipe is a go to for me during hot days: [https://pinchofyum.com/spring-roll-bowls](https://pinchofyum.com/spring-roll-bowls)\n\nThe only heat required is cooking rice noodles, which I usually just do with hot water from the kettle.",
            "Take out",
            "We're having BLT's with avocado 🥑",
            "Fish tacos. Grilled on the Weber outside. Along with a pitcher of watermelon agua fresca.\n\nOnly 84F on my patio, light breeze and ceiling fan. Not bad at all.",
            "“extreme humidity” lolololol come to Houston",
            "Hi there! Former CNYer, current Western NYer here and I concur, it is stupid hot this week. I did a couple different kind of skewers: caprese (mozzarella, basil, tomato, balsamic glaze), prosciutto and cantaloupe, and an Italian pasta salad themed one (cheese tortellini, olives, salami, pepperoni, provolone, all quickly dipped in Italian dressing). \n\nI also did a salad with arugula, watermelon, pickled red onions, feta, with the balsamic glaze drizzled on top.",
            "Mahi tacos/quinoa bowl with pineapple jalapeño corn salsa. 15 min to make the fish and the salsa is refreshing. You can also open a can of black beans, rinse, and use that instead of the mahi for no cook. Microwave quinoa/brown rice comes in clutch when it is hot outside.",
            "I’m in upstate NY too and this weather has been brutal. We have been doing various platters of food. Veggies or fruit. Meat, cheese and crackers. Tomorrow will be pasta salad with all the veggies. I plan on boiling the pasta early before it gets hot.",
            "PB&J, Fluffernutter, Nutella, and Biscoff cookie butter.",
            "Honestly dude, check out a recipe for carnitas or barbacoa tacos. They’re the go to for me in a wave like this. Slow cook a pork shoulder/chuck roast for a few hours, shred it all up, then throw a pile on a corn tortilla with salsa verde, lime juice, cilantro, and onion. Peak summer eating experience tbh \n\nPairs even better with a nice Marg or a Cerveza",
            "Heat makes me sick so about the only thing I consume is cold milk.",
            "even when it's hot, we still do hot dinners usually, so tonight we're doing the rice cooker and a quick saute stir fry.",
            "your best bet if you want to keep the house cool is some kind of sandwich. I once smoked a pork butt and made Bahn Mi with it....so fucking good. Or just do pulled pork sandwiches. Or just go get some salami n shit from the deli and make Italian subs.",
            "Chili is very slow cooker friendly.\n\nCold Korean noodles are great for hot weather. You’ll need to turn the range on to boil water, only for a few minutes.",
            "I bit the bullet and cooked up a ton of ground beef a few days ago. Now if I need to make something I only need the stove on for a few minutes to heat up whatever sauce I'm adding it to. Already made sloppy joes and tacos.\n\n Only thing I'm eating before dinner is a bagel that's been in the fridge all day and cream cheese, maybe a yogurt. Too hot to eat more than that.",
            "We like to do a charcuterie plate with a simple salad.",
            "You guys having a heat wave? :( it's been drab and grey the whole day here\n\nIf you're ok with boiling water, somen is delicious and refreshing",
            "Grab bowl. Throw in lettuce and tomatoes and then extras and some tahini or other food dressing. Olives on side (buy em fresh)",
            "I make soft tacos with ground turkey year round.\nI'm about to make pot roast in my crockpot/slow cooker. Chili in the crock pot is good too.\nOther than that, I eat a lot of sandwiches when it's hot.",
            "I've got about 12 pounds of ribs on the smoker. Grill them super quick to get some char just before we eat and good to go with a side of slaw.",
            "I had tortellini soup for lunch, it was yum.",
            "I used air fryer or toaster oven out on the front porch.\n\nYou can use cast iron pots and pans on your grill. You can make all of your regular stove top and oven foods right on your grill.",
            "I rarely turn on the oven throughout the year because I use my toaster oven. Last week I roasted a whole chicken in it, and yesterday I did  fish fillets topped with breadcrumbs and roasted asparagus. I make a lot of frittatas in there for the summer, as well. \n\nI’ve also been using it to roast and chill shrimp for shrimp cocktail.",
            "Roast beef wraps.",
            "Last night, I made grain bowls - made a pot of quinoa on the stovetop, but everything else was cold (beans, corn, tomatoes, greens, cheese, avocado).",
            "I made up a few things in the air fryer earlier in the week - pork tenderloin, turkey breast “tenderloins”, a variety of seasonal roasted veggies.  Used the Instapot to cook rice and slow cooker for some black beans and we’ve been just putting together various combinations all week.",
            "Sandwiches. Salads. Pizza.",
            "https://www.foodandwine.com/soup/cold-soup/cold-soups",
            "Chicken salad out the wazoo made with rotisserie chicken so I don't even have to cook that (I'll air fry the chicken if I gotta cook it) I switch between sweet and savory ones to keep from getting bored, and some Chicken Salad Chick copycat recipes. Tuna salad and chickpea salad, too.\n\nCowboy caviar\n\nMeat and cheese and crackers, I like to add fruit or pepper jelly, maybe a side of pickles or olives or peppadews\n\nTuna bowls - the rice cooker doesn't heat up the house, and I keep microwaveable minute rice on hand for crucial times. Rice, soy sauce, maybe some microwave steamed edamame, a packet of flavored tuna on top, a drizzle of spicy mayo or Kewpie, green onions/sesame seeds",
            "I actually almost never use my oven to cook. We grill and use the traeger a lot, almost daily year round. I do some stove top meals, especially soups in the winter, or taco meat and tonkatsu, and sides.\n\nI have recently invested in a Zojirushi rice cooker and use it almost daily for hardboiled eggs, rice, oatmeal, steamed veggies, and other meals (I find recipes on IG) that are quick and easy to prep and push a button.",
            "Just lots of various salads. Grilling if I have to cook, because I don't want to add heat to the house. But I'm a salad girl when it's even remotely warm outside",
            "Everything",
            "Beer and ice cream",
            "Taco salad. Just make taco meat from preferred protein source (I usually use ground turkey), and a premade bagged salad from the grocery store. Throw in some avocado… done.",
            "Tacos tonight. The meat cooks quick and doesn't really heat up the whole house.",
            "I smoked a bunch of ribs and chicken yesterday and am using it for Smoked chicken hoagies, chicken salad over lettuce, hand pies in the air fryer, etc.  Sides are cucumber salad, watermelon with balsamic vinegar & feta, cottage cheese with sliced pears.  We actually decimated the ribs yesterday so no leftovers with them.  If you don’t have a smoker, you can grill or even just use your oven and do a bunch of different meats at once.",
            "This has become a go-to hot weather recipe. It makes a big batch and it just gets better by the day. You can use smoked salmon or trout instead of the tuna, or leave the tuna out altogether. You don't even have to cook rice, just get some of those pre-cooked packages: [https://www.foodandwine.com/recipes/sardinian-rice-salad](https://www.foodandwine.com/recipes/sardinian-rice-salad)",
            "[cold miso sesame noodles](https://www.bonappetit.com/recipe/cold-miso-sesame-noodles)\n\nSoooo good!",
            "Rhode Island clam chowder. Basically clam chowder without the dairy. Clams, Onions, garlic, carrots, potato, corn cooked in clam broth with black pepper, thyme, bay leaf, dill, parsley and chives. \n\nIt’s nourishing but light enough for summer.",
            "Anything I can cook on the grill which is another way of saying whatever I want.",
            "The same thing as always. My oven has never heated my house. A slow cooker would generate more heat in my kitchen than the oven, but I'm not a huge crock pot person.",
            "Chili",
            "Very little during the day, tbh. Tonight we’ll have Niman Ranch pulled pork sammies on brioche with my grandma’s coleslaw.",
            "Luckily in Manitoba we're at a nice 15-25 degrees C\n\nBut in that heat wave I'd do ceveche, tuna salad, tuna melts, turkey salad, chicken salad, pulled chicken via rotisserie from the store or bbq and run inside and only dash out to flip haha.",
            "We use the outdoor grill as much as possible. If we need the stove or oven we use them in the AM. we'll often use the grill for those things, too; I sautéd some brats last night on the grill. I just have to keep oven mitts out there so I don't grab the hot pan handle out of habit with my bare hands (I last did it about 3 years ago).",
            "Pulled pork this weekend",
            "Ceviche. Pasta salad. Sandwiches.",
            "Had a salmon blt for lunch and a fruit smoothie for breakfast",
            "Pasta salad with chicken,tomatoes, feta and pistachios with a lemon creamy dressingor Italian pasta salad with salami olives and provolone is SO good\n\nHummus, dolmas, tzatziki, and a tomato and cucumber salad \n\nGazpacho, sausage and cheese and good bread\n\nChilled cherries, nectarines or watermelon for dessert",
            "Ham steaks. Sautéed in a bit of butter. Mashed potatoes and green beans! (Mine are fresh from the garden) garlic bread made quickly in the air fryer. 😋",
            "Chilled Miso-Dashi broth with ramen or somen noodles and various toppings, sort of like this\n\n[https://rhubarbandcod.com/chilled-shoyu-somen/](https://rhubarbandcod.com/chilled-shoyu-somen/)",
            "Cold tofu dishes, chilled tuna salads, cold sliced chicken sandwiches...",
            "Quinoa and bean salad, mix equal parts cooked quinoa and beans, mix in some fresh veggies (broccoli florets for me), and toss with a lemon-cilantro dressing (lemon juice, olive oil, and chopped cilantro). It's light,  full of protein and fiber, and delicious.",
            "Lots of pasta/potato salads. Grilled stuff (ribs, corn on the cob and such, not just HD and HB) that doesn't heat up the house.\n\nA particular favorite of late is to peel and de-silk CotC, but to leave the leaves intact to the end of the cob. Brush the corn with a paste of oil and Old Bay seasoning and push the leaves back to their original position for grilling. Very tasty and refreshing.",
            "Mexican shrimp cocktail. Make a big batch to eat for days.",
            "do you have a charcoal or propane grill? Cooking outside is always popular when it gets hot.",
            "I made hard boiled eggs. Best move ive made since 20 degrees ago",
            "Cold pasta salads of all sorts, with extra protein added!",
            "I eat two meals a day and sometimes one meal is just a liquid protein shake and a salad 💀 I’m so lazy.",
            "I like to cook big batch of fajita, outside on deck in my elec skillet.  I do in morning. I cook batch of marinated chicken, then batch of marinated steak strips. Then insaute the marinate peppers and onion. I keep in big glass bowls in fridge. When you want to eat just reheat and add toppings. I like finely shredded cabbage, chopped tomato, pl Greek yogurt and cheese.  Also love big batch spaghetti sauce in crockpot, place in individual glass bowls in fridge. I do with meatballs sometimes. I’m a big fan of cooking big batch in morn then not cooking next 3 days. Taco filling works like this, crockpot chili too.",
            "Cheese fondue. I'm a glutton for punishment.",
            "Pasta salad,though you'll need to cook the pasta.\n\nMy recipe: tri-color rotini, dices tomatoes w garlic salt, cubed ham steak, dill havarti cheese chunks, black olives, marinated artichoke hearts, parmesan cheese, and Italian dressing.",
            "I'm throwing hunks of meat on the smoker for a few hours and coming back inside.",
            "Grilling burgers outside tonight. With pasta salad and green salad.",
            "Primarily focusing on things I can make in the pressure cooker or relatively quickly on the stovetop. Also cooking in bulk. I made a big pot of mapo tofu early in the week and have been slowly making my way through that. Will probably make Chicken Provençal in the pressure cooker this weekend or early next week. I don't mind cooking during heat waves, but I want to avoid turning the oven on, or standing over the stove for an eternity. Wings, which I would normally broil, are definitely out of the question.",
            "I made taco pasta salad and it was pretty good",
            "I've been doing panzanella.  It's a bit annoying to have to run the oven for a bit, but the flavor is so worth it.",
            "Salads. Potato, pasta, Greek, ceaser, egg. Buy a cooked chicken from the grocer.",
            "make spring rolls and peanut sauce",
            "I made a little charcuterie box for lunch today. Some sliced meat and cheese and crackers,with grapes, olives and peppers, tomatoes and cucumber slices.",
            "Soba :3",
            "I’ll be making this tonight.\n\n**Chunky Summer Gazpacho**\n\n* 2 pounds tomatoes, cored and chopped (about 10 Roma)\n* 5 bell peppers, cored, seeded and chopped (red, yellow, orange)\n* 1 medium red onion, chopped (about 3/4 cup)\n* 1 tablespoon minced garlic\n* 1 lime, juiced\n* 1 English cucumber, peeled, seeded, chopped\n* 1/2 cup fresh flat-leaf parsley, chopped\n* 1/2 cup cilantro leaves, chopped\n* 1 tablespoon tomato paste\n* 32-48 oz tomato juice, to taste\n* 2 tablespoons extra virgin olive oil\n* 1/4 cup avocado oil\n* 2 tablespoons Worcestershire sauce\n* 3 tablespoons sugar\n* 3/4 teaspoon ground cumin\n* 1/2 teaspoon cayenne pepper\n* 1/4 teaspoon freshly ground black pepper\n\nCombine all ingredients in a large (very large) bowl, stirring well to thoroughly mix.\n\nTransfer about 2 cups of mixture into blender or food processor and puree; add back to unprocessed mixture and stir well.\n\nCover and refrigerate at least 2 hours before serving. (Serve chilled.)\n\n*Optional*: mix in some small thawed-from-frozen, de-veined, tail-off cooked shrimp (51/60 count per pound) to chunky gazpacho before serving to add some protein for a low-calorie, flavorful lunch.\n\n*Note / Tip*: recipe can be made with all-olive oil if avocado oil is not available. The avocado oil is a bit sweeter so if olive oil is used solo, additional sugar may be needed.\n\n*Nutrition*: about 105 calories per cup",
            "I’m doing Caprese Sandwiches tonight. Tomato, mozzarella, pesto, and some balsamic vinegar. I might also add some cucumber and some chicken, if I’ve got some in the fridge.",
            "the only real answer: https://www.maangchi.com/recipe/naengmyeon",
            "Prosciutto and melon with burratta and balsamic vinaigrette and gazpacho!",
            "Souvlaki and Greek salad",
            "Ice cold egg salad sandwich(I put the bread in the fridge too), cold meats and cheeses, berries,  cold pineapple, chips and salsa that’s chilled in the fridge, and ice water and electrolyte drinks",
            "Instant Pot chili. Instant Pot chicken curry. Instant Pot everything!",
            "Are you familiar with https://en.wikipedia.org/wiki/Ploughman's_lunch ?",
            "Take air fryer to garage or porch, so heat stays outside.",
            "chicken salad, tuna salad, lettuce salads…",
            "When it gets really hot, I like eating *cold sesame peanut noodles* w/ bits of cucumber and possibly black beans (or leftover shredded cold chicken.) Look up Andrew Zimmern's recipe; he has recipes for it in a number of places, all of which are different from each other. (The only problem is it requires boiling noodles which puts a lot of steam into your kitchen.)\n\n*Wurstsalat* is a cold and filling meal and it keeps well if you want to make a huge batch of it and eat it for multiple meals. I've made it a number of times with varying levels of authenticity in the ingredients and no matter how you make it, it's all good. Just make sure your wurst is precooked as this is a no-cook recipe. I recommend using a better pickle with this rather than a low end one. (Note: you don't have to cut things into sticks if it doesn't make sense. As long as most ingredients are about the same size, it's okay if you slice the sausage into rounds/use precut pickle chips/etc.) [https://www.daringgourmet.com/swiss-wurstsalat-sausage-salad/](https://www.daringgourmet.com/swiss-wurstsalat-sausage-salad/) Feel free to double the dressing if you like. We like to pair a crusty bread with it for some carbs and to dip up the juices afterward.\n\nFor slow cooker, I do a pork shoulder with Puerto Rican & Cuban flavors. I double the mojo from [this recipe](https://www.seriouseats.com/cuban-roast-pork-shoulder-mojo-recipe) (but only put half on it), cook the pork via [this recipe](https://www.seriouseats.com/puerto-rican-pernil-slow-cooker-recipe), then go back to the first recipe to pull the pork & make the sauce with the leftover mojo. It's even better if you add fresh cilantro for the sauce, but still totally delicious without it. Makes a ton and the leftovers are spectacular: freeze 'em for later or have fantastic tacos on day 2 or 3.\n\nAnd there's always the idea of a some kind of *grazing tray* for dinner. Some combination of charcuterie, cheese board, crudités, relish tray, with some kind of flatbread (or crackers) and dips or spreads. You can go Italian antipasto, you can go Middle Eastern/Mediterranean mezze, you can go German with Abendbrot or Brotzeit, you can go Korean with a bunch of banchan or Spanish tapas inspired, or mix it up with whatever you have in the fridge. I try to keep meats, cheeses, crackers, pickles, dips, and fruits (dried or fresh) and nuts around specifically for this kind of easy but flavorful meal.\n\nYou can do as much or as little actual cooking as you like. Like for the mezze I might make falafel (or heat up some premade kibbe from Trader Joe's) but everything else is premade; if I'm really feeling like cooking, I may make my own [hummus](https://www.foodiewithfamily.com/homemade-hummus/) (so easy, so cheap, makes a ton, you can vary it a million ways) or baba ganoush (which is basically hummus, sub the chick peas for roasted eggplant) as well. But if all you want to do is buy stuff and arrange it, that's totes valid as well & I do it too.\n\nBut my old standby for eating while being hot, it's hard to go wrong with *pimento cheese spread sandwiches* and cubes of cold *cantaloupe* from the fridge. Maybe even have some *gazpacho* if you're feeling fancy, or switch out the sandwiches for some *Saint Andre cheese* (goes AMAZING with sweet ripe cantaloupe.)\n\nAnd, for my money, nothing beats a good cold *tuna salad sandwich*. ;)",
            "Wraps!  Hummus, veggies and lunchmeat.  Much better than a sandwich.",
            "The wife made a salad out of watermelon, feta, and fresh mint.  Would recommend!",
            "I make it with capellini and a lot more of everything but it's great\n\nhttps://cooking.nytimes.com/recipes/12861-orecchiette-with-cherry-tomatoes-and-arugula",
            "For my daily meal, I'm almost exclusively eating a sandwich (usually a soft hoagie roll with whatever I like on the thing because I can't be asses to go out in 107F to the shop downtown) paired with fruits with a high water content that are in season. I'm on the other end in California, but here's what I'm eating fruit-wise: watermelon, canteloupe, strawberries, grapes, pineberries, oranges, peaches, plums, nectarines and apricots. I can't eat them ice cold because of dental problems, but I try to get them to a little above room temperature before eating so I experience some relief.",
            "Nigiri. If you can get some good fish, just cook rice, mix in rice vinegar, sugar, and salt, and mold it into little nugs to put your fish on top of. If not fish, good thinly sliced steak does well too.",
            "Sliced tomatoes. Rotisserie chicken. Salad.",
            "Home made Thai basil fried rice with ice cream for desert",
            "Mediterranean all the way",
            "Grilling almost every day. Tonight is grilled pizza using leftover ratatouille (also a great summer meal) as the sauce. Tomorrow is grilled swordfish with vegetables and a grilled potato. Also doing burgers one night and making a verde pozole by grilling a bunch of chilis and tomatillos. Yeah it’s hot outside, but the grilling doesn’t take long, the food is fresh and delicious, and it keeps the house cool. Cool down while you’re out there with a michelada and wear your daddest tank top and flip flops and your Chicago summer is set. ",
            "Vietnamese spring rolls. Lot and lots of spring rolls. It's basically a salad burrito",
            "Cold Asian noodles with chopped veggies & tofu in peanut sauce at room temperature",
            "Watermelon. \n\nGrapes.",
            " Cold cuts and pasta salad.",
            "I made a frittata last night! Veggies, some microwave bacon, cheddar & Jarlsberg. Delish",
            "Tuuuuuna! I love a good Tuna Sandwich, Tuna Pasta Salad, Tuna & Crackers. On an extremely hot day I will usually reach for coconut water and even better if it’s with the pulp/ jelly!",
            "The whole reason I have a gas grill is so I can fire it up quick and use it during the summer to cook stuff and keep the heat outside! (Yes, I do have a charcoal one as well but I  use it for parties or on stuff that wouldn’t cook fast.) \n\nShrimp also cooks super fast (inside or outside!) so  just sauté that quick inside and pair it with any number of chilled sides and you’ve got dinner without heating up the kitchen still.",
            "[Japanese cold somen is a great choice.](https://www.justonecookbook.com/somen/). Just One Cookbook is legit.",
            "Chopped cucumber tomato romaine salad w a garlicky lemon olive oil dressing with either hummus, grilled or shredded chicken etc, add feta if want—inside a wrap or pita. Dip in a tzatziki if you like. \n\nPearl Cous cous salad with diced roasted carrots, sliced almonds, feta and gremolata swirled in. Serve with fish chicken or shrimp or eat alone. \n\nTuna salad w shredded carrots, red cabbage, celery, red onion, green apple and mayo, wrapped in a big leaf of green or romaine or on water crackers.",
            "https://carlsbadcravings.com/best-slow-cooker-french-dip-sandwiches/\n\nFrench dip made in the crock pot",
            "Pesto pasta. Boiling water sucks but it's not for long",
            " Poke. No salad, no rice. Hawaiian style.",
            "I just had a bowl of yogurt with cooked rice (it’s called curd rice in India, and is a common South Indian meal and helps in cooling down the stomach). \n\nMix some salt, and add savory tempering (a tbsp hot oil with mustard seeds, cumin seeds, small amounts of grated ginger and chili for the zing). Additionally, you can also mix some grated cucumber and carrots with to the yogurt rice 😊",
            "We've had a few salads and some Buffalo chicken wraps.",
            "High school cafeteria food for dinner as we’re attending an awards ceremony in the cafeteria",
            "Greek yogurt with frozen fruit",
            "I’ve been getting a lot of use out of my air fryer this week since it doesn’t heat the kitchen up as much as my stove. Yesterday I just did charcuterie for dinner. Tonight it’s pizza.",
            "sounds like gazpacho time",
            "Quinoa salad. 15 min of heat on the stove for the quinoa, then just add leftover chicken (or none, and sub chickpeas or something else for protein), chopped Tomato, cucumber, red or green onion, parsley, artichoke hearts, red pepper, roasted garlic, feta cheese and I like it l add some dill. I let it cool then add some balsamic and lemon before serving. It’s also great over lettuce. You could also add some cilantro, jalapeño, cumin, black beans and a bit of salsa to make it more southwest in flavor. Corn would also be delicious in any version. \n\nHearty, filling, cool, and fresh.",
            "I made a delicious mango chicken salad. I used a mango Indian chutney, mayonnaise, cilantro, toasted almonds, and then just served it on top of some naan. Quick, easy and fresh tasting!",
            "I love sandwiches on a hot day. Big ol' chicken bacon spinach sandwich with pickles and onions and garlic mayo and hot sauce, maybe some avocado. Put that bitch on ciabatta and was it down with a big iced coffee or tea. \n\nBE REFRESHED",
            "Tomatoes and cucumbers. \nIn sandwiches, in bowls, by hand,",
            "Lots of salads, especially unconventional lettuce-bed salads: tabbouleh, seafood/ceviche, fruit, horiatiki, beet. Don’t sleep on mint and basil for freshness. By the way—why the hell aren’t peppermint things offered in the summer!? I digress. \n\nYogurt-based snacks, jicama with lime, tzatziki in place of bbq sauce on sandwiches.",
            "Cottage cheese and whatever (chicken, fruit, etc.).",
            "Watermelon as a snack and green salads.",
            "Cold rolls with peanut sauce. Always a banger. Can make em veggie only or any protein shrimp hicken beef pork. I like some fresh sprouts usually the brocolie sprout blend I get at the store cuz why not. Shredded carrots maybe some cucumber maybe some cilantro and rice noodles. Add your protein. Roll em up. As for the sauce. Heat up a decent amount of sesame oil throw in ALOT of garlic and cook for a minute or two. Had a tablespoon or two of hoisin stir it up. Add a 1/4 to a half cup of peanut butter I prefer chunky. Mix till combined and I then ad  d milk slowly till it combines and trust the process it starts to look like a mess but it will come together in delicious peanuty goodness.",
            "I just ate a big bowl of watermelon.",
            "If you can source good veggies, a Greek salad. Fresh tomatoes, red onion, cucumber, Kalamata olives (jarred works in a pinch here) Organo, salt, olive oil.\n\nIf you can't find feta from Greece I usually just do those pearl mozzarella things. Doesn't have the same zing but still pretty good",
            "Caprese salad. Layer a bed of lettuce, sliced tomatoes, fresh mozzarella blobs, fresh basil and a few shakes of balsamic vinegar.",
            "Shopska salad - Bulgarian dish \n\nTomatoes - pink are best, must be juicy (heirloom)\n\nCucumber\n\nOnion\n\nWhite/feta cheese - crumbled\n\nOlives - optional (kalamata)\n\n\nNice toasted bread for dipping the sauce from the tomatoes that combines with the olive oil and crumbled cheese. \n\nSince 5 days this is my lunch and dinner. Pretty happy. Can’t wait for lunch tomorrow",
            "Rice, leftover sumac chicken+onions and some yogurt on a pita.\n\nI did the chicken in the air fryer (on roast) yesterday - it's good for not heating up my kitchen more than it already is :(",
            "Same. Tabbouleh. Rotisserie chicken one night, and then a big salad 2 days later, with a sesame soy and Thai peanut dressing (made 2). Tuna salad on an everyseed bagel. Protein shakes, iced tea.",
            "Cold beer. Cold pizza. Perhaps a popsicle or two.",
            "Gazpacho, caprese, yogurt and berries, lemongrass chicken skewers, Thai peanut noodle salad",
            "Lots of fruit, some salads, caprese anything, ceggie mixes from the garden, and some good pork steaks",
            "Lots of salads and smoothies. Staying in the AC this weekend.",
            "96 out. Giant Bavarian Pretzel. French Onion Soup (Cheese). Thick Cut Bacon. Belgian Waffle. Cheeseburger w/Sauteed Onions & BBQ Sauce. French Fries. Onion Rings.",
            "Frittata, tabouleh with grilled chicken, Caesar salad with grilled chicken, Italian pasta salad, taco salad, and tuna fish salad on croissants with a side of chips.  I also have cheese, crackers, and fresh fruit (pineapple, cantaloupe, apples) on hand in case an actual meal is a bit much.\n\nLook into anything that can be made on the stove-top or skillet as well.",
            "Had grilled sausage & pepper grinders with pesto for lunch today by the pool. Accompanied by air fried sweet potato fries (because I’m not deep frying in this heat) and store bought tuna mac (a guilty pleasure pool-side necessity).",
            "He heat has backed off in my area. It's a nice temperature and overcast today. I finished my gardening without dying of heat stroke and made mac & cheese with cut up hot dogs in it. (KD for us Canadians)",
            "Get a smoker, makes smoked meats (brisket, pulled pork, etc.) Vacuum seal freeze then reheat in sous vide. Don't get hot, doesn't heat up the whole house and quick easy carnitas/brisket/chicken bowls are my go to. Just do a quick roast on a few peppers/tomatos/onions in the counter top oven, rice, and shredded lettuce, cilantro, sour cream or cheese with your favorite hot sauce.",
            "Chopped Greek salad with pita chips. Eat it like salsa. It’s very nice.",
            "Clearly: Ass Pegasus.",
            "Cold turkey sandwich. Cold pasta salad. Cold coleslaw. Deviled eggs. Something I can microwave lol",
            "Cold picnic foods. I’m polishing off a chicken salad sammie with sprouts and shishito peppers, and a pasta salad. Nobody heat required. Ice cream for dessert.",
            "Ceviche",
            "Crockpot Chicken enchiladas casserole \nChicken salad \nBbq pork butt in crock pot\nLondon broil Italian salad dressing pulled beef and peppers crash potatoes (in crock pot then smashed and fried In Airfry. \n\nI have used crockpot and airfry a lot this week.",
            "No food. Just smoothie.",
            "Sandwiches, salad with rotisserie chicken",
            "I’ve been barbecuing a couple of tri tips, then sobbing up for everybody to grab as they want. Then grill corn and last night I grilled pineapple as well. \n\nYou could use the tri tip for various salads. I made a fantastic corn salad from the grilled corn. \n\n[https://heygrillhey.com/grilled-corn-salad-with-lime-vinaigrette/]\n\n[https://thefoodcharlatan.com/how-to-cook-tri-tip/#wprm-recipe-container-32005]\nThe above is a great & simple marinade, but lately I’ve just been using Pappy’s. I rub it all over the tri tip & then light the bbq. That’s been plenty of time for it.",
            "Nothing 😃 it's not even on purpose, I just have zero appetite for anything that isn't cold water lol",
            "Stuff that's easy to make in a microwave, like cheese/shrimp grits.",
            "Take out!!",
            "In Texas it's fajita time all the time",
            "Gazpacho",
            "Gazpachos, crudos and ceviches are great for the heat.\n\nYou can also make some incredible delicious salads, if you buy precooked meats or use tuna. \n\nChicken salad,  tuna salad, salmon honey mustard salads, and pasta sslads.\n\nSandwiches and wraps. \n\nDips and crudites...",
            "Crab Louis salad with fresh Dungeness crab legs, black olives, hard boiled egg and homemade Russian dressing.",
            "Yesterday me and my partner had a salad and apple slices. Today we’re making a version of BLTs that we call BALs, cuz we both don’t like tomato so we put on avocado instead. So we gotta some fry bacon soon, hopefully we survive.",
            "Fruit, cheese, and bread",
            "I eat a concerning amount of watermelon this time of year.",
            "If you have a toaster oven, roasted tomatoes are like CANDY",
            "Central AC so is doesn’t matter lol.",
            "Cous cous is your summer friend! No stove needed just \nBoil the kettle, mix the cous cous with a bit of olive oil and salt, add an equal amount of boiling water and cover tightly with lid or plastic wrap immediately for about 5 minutes, fluff and add herbs, some lemon, and any veggies and or meat from the bbq",
            "I don't eat when it's this hot, but if I am, I try to do stovetop meals like spaghetti or stir-fry it takes little time and doesn't heat the kitchen too badly... I also eat more yogurt and smoothies.",
            "Quesadillas for dinner. One filled with leftover salad. The other one filled with leftover rice bowl. It went pretty well.",
            "Watermelon and feta with mint, tabbouleh, shrimp cocktail, cold sesame noodles, gazpacho, hummus with crudités and pita, frozen fresh cherries and berries (thawed just enough so as not to break a tooth), four bean salad, black bean and corn salad with avocado and jalapeño, blackberry and steak salad with arugula, goat cheese and pecans.",
            "Ceviche tacos.",
            "I cook chicken in bone broth in the instant pot. The chicken is good refrigerated in a variety of wraps, pasta and salads. \n\nI also do a batch of eggs in the instant pot (I have the 3 qt size).\n\nI also use canned beans for salads and wraps with crumbled feta or goat cheese. \n\nI prefer to use a vinaigrette dressing in my summer salads because I have a paranoia about hest and mayo.",
            "You all are making me feel terrible. I do not love most raw veggies and fruit is a snack to me, not a meal. Salads bore me without meat and cheese and croutons piled on. I'm not judging a single one of you as much as I'm more judging myself. I feel so picky sometimes and it's terrible. \n\nI've just been cooking mostly as normal and sweating while I do it. Some fish with rice and roasted green beans. Porkchops with a fruity pan sauce. Some Asiany beef lettuce wraps.",
            "Caprese salad is best in the summer. ",
            "Mediterranean turkey bowls with lemon cauliflower rice (and cucumber- tomato salad, homemade tzatziki)",
            "There's a heat wave?",
            "Salads. I use one day to prep different protiens s9 I only heat up the house one day a week.",
            "Last night I made a lemon, asparagus, shrimp pasta with an avocado, tomato, spinach and cilantro salad.",
            "Some take out, let others do the cooking. :)",
            "Cold barbeque chicken (leftover from a restaurant meal) and potato salad.  And it was delicious.",
            "I am in Minnesota. We don’t necessarily have a heat wave quite yuck. However, the other day I made a large batch of chicken salad and I like to add dried cranberries, toasted almonds, and celery to my chicken salad mix. I will either eat this straight up as it isor my preferred way is to eat it in a pita. Last week I made sourdough pita bread and it turned out really good. So chicken salad in a pita bread.",
            "Microwaved jacket potatoes with lemon tuna mayo and microwaved frozen petit pois. Lightly spiced couscous with feta cubes and pomegranate seeds. Fresh quiche eaten cold with dressed salad leaves. Orzo pasta salad with romaine and microwave poached eggs. Caprese salad with bread. Coronation chicken or brie & cranberry baguette. Cheese & cucumber & chutney sandwiches. Smoked paprika houmous & veggie wraps. Lime cream cheese dip and salsa with tortilla chips and crudités. Toasted pitta breads filled with store-bought cooked chicken, salad leaves, and sweet chilli sauce. Tinned mackerel on toast topped with baby spinach. Cheese and crackers with grapes. Ramen pot made up with extra water then tipped into a bowl and topped with salad veggies, pickles, sesame seeds, microwave poached egg, and cut-up deli meat. Microwaved oatmeal or cold cereal with goats milk and fruit. Snack platters with all sorts of bits from the fridge/cupboard, such as: cherry tomatoes, bell pepper, carrot, radish, sauerkraut, pickled beetroot, cheeses, dips, nuts/nut butter, seeds, breadsticks, pretzels, potato chips, popcorn, cookies, berries, applesauce, dates, raisins. And if using your stovetop is an option: Pesto & goats cheese stovetop frittata or pasta. Fajitas with sour cream. Pancakes with ricotta or Greek yoghurt and fruit. ",
            "It's warm in Seattle - and this is what I just made.\n\nIn a rice cooker, I put in 1 cup washed white medium grain rice, and 1/2 cup barely. I used pressed barley.  \nOn top of that, I put a couple of Aidells sausages, and some frozen veggies.\n\nAfter it was all done cooking, I ate in a bowl with a healthy squeeze of Hoisin sauce.   \n  \nA healthy, easy to make meal.",
            "Sautéed squash and spinach. Sandwiches. Pasta salads.",
            "Me and my roommate make a salad of tomatoes, feta, green peppers, onion, carrots, and whatever other veggies were feeling all tossed in zesty Italian dressing. Easy and delicious",
            "BLT pasta salad! Nice and cool, a little prep but I use cherry tomatoes to cut down a little. Best part is you can make a bunch and eat it for days!",
            "I had a great cucumber salad today—some spices and rice wine vinegar. Delish.",
            "Sausage sandwiches tonight.  Baked chicken legs tomorrow.  Probably spaghetti next week.  I'm not really changing my diet though I'm not deliberately doing a lot of intensive stuff, either.\n\nGotta keep the kitchen door closed if I want to leave dishes in the sink or strainer for even 5 minutes (destructive cats), so the kitchen heating up from the oven isn't really a deal-breaker.",
            "Cold soba noodles (you do have to cook the noodles and boil water tho) with sides like marinated cucumber, Shrimp, tuna, or crab onigiri, I mix the seafood of choice with kewpie mayo, sriracha, soy sauce, panko bread crumbs, green onion, and diced jalapeño. I usually have a bit of sliced avocado on the side with it and fresh cucumber. \n\nChicken or tuna salad croissants with celery and almond butter and fruit on the side\n\nFresh fruit in general, finger sandwiches like cucumber dill cream cheese or smoked salmon and cream cheese, or cold charcuterie as a meal with fresh bread\n\nChicken lettuce wraps\n\nSpring rolls\n\nSlow cooker beef, chicken, or pork tacos with guacamole and chips\n\nCold Thai peanut noodles with shrimp \n\nCold pesto pasta salad with white beans, sun dried tomato, basil, and mini mozzarella balls\n\nSmashburgers \n\nSalads, two favorites include one with spinach, strawberries, blueberries, and blackberries with feta cheese and chopped walnuts and pepitas with a berry vinaigrette, or a chopped salad of broccoli, Brussels and kale etc with blackberries, pistachios, and grilled steak and a sweet dressing.",
            "It doesn't exactly help your current situation, but I do a lot of prep during cooler months, then vacuum seal and deep-freeze portions.  That way it takes less effort (and heat) to make meals when it's miserable out.\n\nChicken thigh meat is a big one.  It can become a wrap or salad with ease, or if you can stand a small amount of heat, turn it into chicken tacos, BBQ chicken sandwiches, chicken rice-a-roni, chicken cheese dip, red beans and rice, etc.  Those hot dishes are all ones cooked with a lid, keeping the heat to a minimum.\n\nPulled pork, cooked hamburger crumbles, bacon bits, cooked breakfast sausage, cooked roast beef, ham, and corned beef brisket are all meal starters I have ready to go, which can make dishes that don't heat up the kitchen nearly as much as if they were raw.",
            "So much fruit.",
            "Pasta salad\n\nPulled pork sandwiches (slow cook the pork, and a quick air fry the next day gives you *Amazing* nachos)\n\nSubs / sandwiches \n\nWeirdly, soup. It’s lighter and easier somehow.",
            "Just had myself some cold pieces of rotisserie chicken, a slice of pepperjack, a few pickles and some chips and salsa 🎶girl dinner🎶",
            "Dinner tonight is egg salad sandwiches and tomato-cucumber salad. Nice and cool!",
            "Salads ( sorry) ice cold smoothies,  avocado toast with a variety of toppings, sushi 🍣.",
            "Just had an arugula salad with pan seared chicken tenders, cucumbers, dates,avo, almonds and chickpeas with balsamic dressing from scratch!",
            "no clue what everyone's eating.  I'm eating wings.",
            "Air fried baked potato and salad tonight.",
            "There are a lot of great Korean dishes that are served cold. When it gets really hot, I like to make a big batch of these [spicy cucumbers](https://www.maangchi.com/recipe/oi-muchim) so that I can have some to snack on throughout the week. That website has lots of other good recipes, and the [youtube channel](https://www.youtube.com/@Maangchi/videos) that goes with it is adorable.",
            "Thank goodness for my crock pot!",
            "Baking this in the toaster oven:\n\nCoat naan bread with olive oil. Put it on the little baking sheet that comes with the toaster (cover the pan with foil or parchment paper first). Sprinkle on some Italian seasoning. Top that with Balsamic vinegar or vinaigrette and spread it around.\n\n\nPut a slice of tomato on it and top that with mozzarella. Bake it for ten minutes at 375°. You just want the cheese to melt.\n\n\nIt's something filling and nutritious but it doesn't heat the house too much.",
            "Grilling protein and vegetables, fresh seasonal vegetables, steamed corn",
            "Last night I made a salad of arugula, stone fruit, prosciutto, tomatoes, burrata, nuts, and a balsamic dressing - cold, juicy and refreshing. I’ll make cold pickle & cheese sandwiches. You can buy pre-cooked shrimp w/ cocktail sauce at Costco. Medieval nights with apple, bread, sausage & cheese. Deconstructed sushi bowls with lots of cold ginger. Breakfast for dinner - frozen waffles w/ peanut butter, cold whipped cream & cold maple syrup. ",
            "Hummus.",
            "Classic in my fam: Pizza Pasta Salad\n\nCook, drain ,and cool some pasta (shells are best)\n\nAdd Italian dressing\n\nThrow in a bag of mozzarella, and pepperoni (chop to size preference)\n\nMy mom always liked olives, I always picked em out.  But you can jazz that up so many ways, esp with seasonings\n\nIt does create heat. So pull the trigger and make a good amount of pasta to get some days out of it. This is a great \"set overnight\" recipe, as the pasta absorbes the dressing.  Add more as needed the next day.",
            "Dunno. I'm freezing because my landlord has the AC on high and my basement apartment is like a cave. A chilly cave. \n\n\n\n\nI had soup and toast today. I'm wearing a hoodie and fluffy socks inside. ",
            "We have watermelon with almost every dinner — sprinkle with Tajin! \n\nWarm meals — we have been eating grilled chicken - sliced over a salad made with romaine … lots of variety … onion, mandarin oranges, radishes, cucumber, pepper … what ever we have.\n\nWe use the heck out of our outside grill — tied to our natural gas line",
            "tuna melt rasin bread sandwich",
            "Imagine my surprise you didn't mention ice cream or some cold dessert",
            "Blts with chips and I cut chicken breasts into strips, put them on skewers, and season each one differently so everyone gets something they like. \n\nWaiting for tomatoes to come ripe for air fryer Asiago roasted tomatoes. I can't wait.",
            "Smoked meats, smoked Mac n cheese, corn boiled outside on a gas stove, grilled vegetable\n\nBasically anything that can be done on my smoker or grill 😅",
            "Our air conditioning system is working fine.  Our forced hot water heating system works fine.  Outside temperatures don’t matter for this retired couple.  We had vegetable and shaved meat wraps  with elaborate salads and fresh fruit sliced up for our two meals today.",
            "Salads, sandwiches, burgers on the grill, got a take out pizza today.",
            "Salad, cups of ramen, lighter meals in general. Tonight we did teriyaki salmon with carrots over rice and turning the broiler on to get the salmon crispy was.. uncomfortable lol.",
            "No heatwave in the UK!",
            "Lots of sandwiches. Things that can be eaten room temp out of cans, like sardines and salmon and beans. I improvised a sandwich spread that is going to be a new fav around here -- sardines, cream cheese, scallions, dill, and sweet pickles. \n\nI made [risotto in the Instant Pot](https://damndelicious.net/2018/03/21/instant-pot-mushroom-risotto/) the other day, that thing doesn't generate much heat.",
            "This is when German dinner (called Abendbrot) is perfect. A plate with different cold cuts, meat spreads, sliced cheese, soft cheese and good with good hearty, chewy, rye bread. Serve with pickles, fresh cut chives, fresh sliced tomatoes from the garden and a variety of salads; tomato salad, cucumber and dill, carrot salad, potato salad, sauerkraut salad and of course meat salad (Fleischsalat).",
            "Sandwiches and unfortunately a lot of take out",
            "Shrimp, crab legs, scallops, lobster one pot or skillet, one burner -quick and easy.",
            "Caldo de Pollo🐓🐔",
            "I had steamed shrimp - steamed in my ninja, in foil-came out perfect. Chilled it for peel and eat. Added a steamed side veggie. Easy peasy. I bought a roasted chicken, picked on it along with some marinated mushrooms and will make chicken salad, which I usually eat with crackers or chips. I’m having sandwiches one night with a cold pasta salad. Cucumber salad is fantastic during these hot days. I like to keep it simple too-I live in a motorhome, and it gets hot as hell sometimes. Chicken Caesar salad one night too and I just use iceberg lettuce with a good store bought dressing, some of that roasted chicken…",
            "I live in Korea and Cold noodles 냉면 (naengmyeon) is my go to.",
            "With my air conditioning cranked high",
            "beer brats with krout and onions.  And of course a cold beer",
            "a childhood (and current) favorite of mine is this tuna salad my mom makes. canned tuna, mayo (maybe half mayo half sour cream if u want), chopped lettuce, diced tomatoes and finely diced red onion, salt. tastes best if you let it sit for at least a few hours. it's a comfort food of mine now\n\nedit: let it sit in the fridge, i mean",
            "Watermelon",
            "Honestly, toast with a heap of cottage cheese, Calabria olive oil, salt and pepper. My kitchen is a sauna right now.",
            "butter chicken",
            "Tuna Salad Sandwiches,\n\nGrilled Chicken Tacos with Goat Cheese, cilantro, onion and salsa\n\nTurkey Club\n\nGreek Food like Gyros or salads.",
            "We are making fire oven pizza (backyard) and fresh strawberries with homemade whipped cream for dessert 😋",
            "I grilled enough chicken breasts in the evening to last us a couple of days on salads. Also made potato salad at night before bed, and red cabbage slaw. We prefer cold foods in this heat.",
            "Sometimes, I get a cantaloupe, some prosciutto, nice bread and good cheese and we just do snack plate dinner.",
            "Caesar salad with grilled chicken (or leftover protein if you cant bear to go outside). I recently did a grilled shrimp thst had been marinated briefly in lemon and garlic; went perfectly with Caesar.",
            "Cold soba",
            "I just got to NoLa this afternoon, I had a 3 lb bag of Crawfish",
            "Bbq",
            "Cold food only. Like I’m cooking food, sticking it in the fridge, and eating it cold.",
            "This week was salad and watermelon. Next week is snacky bits (cheese+crackers, sliced veggies) and more watermelon!",
            ">I'm in central NY. High 80's to high 90's with extreme humidity is very much a heat wave for us.\n\nThat's adorable! I just roasted a whole chicken, in the oven, in coastal Texas. I don't regret it at all.",
            "Salads, sandwiches, watermelon, peaches, and popsicles",
            "Food ",
            "Naengmeon :]",
            "Aldi has a cheap 17” knock off black stone for $60 right now. Can cook almost anything on it. Keeps the heat outside. Easy maintenance.",
            "I made taco salads tonight for dinner with black beans.",
            "Smoothies are my go-to when it's super hot indoors.",
            "Fresh (not cooked) spring rolls.  Just need rice wrappers, and I like to fill with mango, shredded carrot, cukes, lettuce, avo, cabbage and cilantro.  You can really use any veggies you've got lying around.  Then I whip up a curry peanut sauce for dipping, with maybe some sweet chilli sauce as well.  So delicious, fun, and cool!  I recommend looking up a video on how to wrap the rice wrappers if you have never done it before.",
            "Look up the korean dish naengmyeon",
            "Chicken or tuna salad pita pockets, and salmon poke bowls! Easy to make multiple portions, and it lasts well in the fridge for a few days.",
            "We're having spring rolls a lot. Not the fried ones, but the ones in the thin rice wrappings.",
            "Split pea soup with smoked ham shanks and ham pieces. \n\nFrom my grandma: Delicious Green Grape & Cucumber Gazpacho\n1 pound seedless green grapes\n2 cups diced English cucumber (unpeeled)\n2 scallions, green parts only, chopped (I use 4 green onions)\n¼ cup fresh dill, chopped (I use 1 tablespoon of dried dill)\n2 ounces cream cheese\n3/4 cup half & half\n½ cup plain yogurt\n1½ tablespoon white wine vinegar\n2 tablespoons good olive oil\nKosher or sea salt if desired\nIn a blender, combine all ingredients. Blend to a smooth puree.\nSalt to taste. Chill for 2 hours. Serve cold",
            "Spicy Indian dishes in the slow cooker and rice.",
            "Tonight we had BLT’s & raw veggies on the side. (Edit) Tomorrow, we are grilling.",
            "I’ve been making lots of quesadillas \nOr nachos.",
            "Watermelon gazpacho.",
            "I'm north of the border great lakes\n\nTacos\n\nI get factory made corn tortillas via Chicago from the grocery store",
            "I wish we’d get a heat wave 😢😢 (freezing in Northern WI)",
            "Celery and peanut butter. Sandwiches. Cottage cheese and fresh fruit or tomatoes. Yogurt smoothies.",
            "Ceviche! It's cold, and the citrus is quite refreshing in the heat. Super easy to make too.",
            "Ramen or couscous using water from the electric kettle+time",
            "Cold pasta salad, macaroni salad, potato salad",
            "I’m crazy I made soup yesterday :( or was delicious",
            "I make cold foods on super hot days (salads tend to be my go to, but cold pasta dishes are also great)\n\n  \nAlso can't go wrong with just a sandwich and some chips! (I have a tendency to crave eggsalad sandwiches on the hotter days personally)\n\n  \nAlso possible to make some cold soups as well, depending on what you're feeling like.",
            "Naengmyun x 1000000000000",
            "BLT",
            "Water",
            "I caved and made a bagged salad. I hate salad but i was not gonna stand over the stove. Also got fixins for a tuna salad sandwich for later this week. For snacks been eating celery dipped in hummus.",
            "Chicken noodle soup. It's 51 degrees where I'm at in California",
            "Had blt last 3 days.  It's been awhile so went all in.  Roasted garlic loaf Wright bacon Romain and good tomatoes.  Were so good",
            "I made a small portion of black pepper beef and noodles on my flat top. I came away sweating bullets but it was so good it was worth it. Now I know what I’m making for dinner tomorrow night.",
            "Cold pizzas. As in cooked pizza that you leave in the fridge afterwards.",
            "- Spicy peanut zoodles.\n- Watermelon arugula feta salad\n\nMaybe odd, but falafel bowls. I make falafel all the time, but when it's summer I make falafel crumbles, sort of like granola, and then make a salad or bowl with all the same stuff I'd put in a regular falafel wrap/sandwich thing. You do have to bake the falafel crumbles, but they can be used for a few days and don't need to be eaten hot.\n\nOther people have mentioned that summertime is sandwich time, which I heartily agree with. It's also the best time to learn or brush up on pickling, fermenting, marinating veggies, etc. because all that stuff makes homemade sandwiches 1000x better. I always have pickled radishes at the very least.",
            "Today was brisket smoked in our smoker, Mac and cheese, and baked beans. All cooked outdoors to keep the kitchen cool.\n\nTomorrow is grilled chicken with a peach bourbon barbecue sauce. Sides will be a kale salad, jalepeno poppers, grilled zucchini, confetti cornbread, and a peach cobbler. \n\nSunday is Chinese lettuce wraps with sesame scallion noodles and fresh fruit.",
            "It's not super hot here in the PNW (yet), but our older buildings aren't equipped with central air and I'm ridiculously sensitive to any sort of heat thanks to a few meds I'm on. Here's what I've been doing lately! \n\nCold cubed watermelon, pineapple, and sliced strawberries with Tajin and my auntie's lemon dip. \n\nRice paper rolls with marinated tofu.\n\nCucumber and hummus sandwiches.\n\nCold cereal.\n\nPanzanella.\n\nRice with silken tofu and chili crisp.",
            "The same thing we eat every night, Pinky! .... idk a good transition. \n\nI'm in Maine rn. Nobody in this hell-hole we call New England believes in A/C, yet May hits and every house gets window-units on every sill. They're still building new houses with only floorboard heaters and it drives me nuts. Why is HVAC such a hard concept up here?",
            "I make a delicious chicken Caesar salad with penne, shredded chicken, romaine, green onion, basil, cherry tomatoes, garlic, feta and Caesar dressing. The last time I made it I was out of Caesar dressing and used a balsamic pear dressing instead. It was out of this world. Other than that, watermelon feta salad with cucumber and red onion, sandwiches, BLTA, Caprese salad, etc.",
            "Red beans and rice ",
            "I feel sorry for anyone eating hamburgers and hot dogs. They are made from factory farmed meats - including bits you would not normally think of eating. We only eat small amounts of free range meat or organic meat as it tastes incredible and lessens the animal’s suffering. I wish it was cheaper but I am willing to pay more for it",
            "I made the Spanglish BLT the other night after tripping over a post about “food tips or recipes from movies/TV shows”. It’s essentially a BLT with a fried egg on it. Only needed my cooktop and toaster oven",
            "'mater sammichs!",
            "Cold soba noodles with blanched bok choy and chicken. For sauce I mixed miso paste, soy sauce, sesame seeds, grated ginger, chopped garlic, rice vinegar and ssamjang",
            "Throw some chunked up chicken and whatever produce you like into a bowl with some Greek yogurt, lemon juice, and whatever herbs you have on hand, leave it in the fridge until you’re done with whatever you had to do for the day, stab ‘em all together some skewers, and they grill up in like 5 minutes. One of my fave easy meals in the summer, and the marinade keeps the flavors nice and refreshing!",
            "Someone mentioned cold soba noodles with dipping sauce. There's also a Korean cold noodle dish that I would argue is even better. Naengmyeon! They literally put ice in the cold broth. There's a savory version and a spicy version. I tried this in Korea for the first time a few months ago. It's sometimes ordered to cap off a meal of Korean bbq. Highly recommend if you like Korean flavors!",
            "I am in Florida and that’s our normal weather so I went on a run, walked my dog, and went to the beach.",
            "This is my specialty! I literally purchased a \"summer oven\" for my family of HEALTHY size eaters (athletes & wrestler)!\nThe 10 Qt Vortex air fryer oven.   I'm definitely NOT saying this is for all budgets and family sizes, but I can cook a full meal in this thing and have very minimal (if any) heat output. Four years ago in my area because of the high temperature, we also have energy saving hours where electricity prices are doubled -of course its during dinner hours. This solves both issues.   \nWe often have 2 or even 3 lean meat choices per meal, and several vegetable salads hot and cold.  I meal prep what I can on Sunday for the family. \nThin sliced steaks - sometimes called \"minute\" steaks(as is or sliced for salad)\nBadia Complete Chicken/thin sliced pork loin (salad & sandwiches) \n(Badia Complete is somewhat similar to Mrs.Dash)\nBbq chicken (as is or diced for BBQ sub sandwichs)\nMinced beef & cheese sub sandwich (Philly sub style)\nPasta salad \nChicken tacos (crock pot meal)\nBbq ribs ( crock pot then air fryer)\nCrock pot pulled pork sandwiches or nachos\nBeef tacos or nachos\nWe eat just about anything BUT hamburgers and hot dogs on 100 degree days.",
            "Tuna salad on toasted English muffin, top with a slice of Swiss, nuke for a minute or so . Tuna melt.​",
            "Boil pasta in the AM for cold pasta salad with shredded rotisserie chicken from the store (or one I cooked early in the morning)",
            "Cold pasta salad.  Cucumbers.  Tuna poke bowls.",
            "Cucumber sandwiches!!!",
            "BLT is the top contender for summer sandwiches",
            "I know it’s early but hoping to score a tomato at the farmers market… time for some tomato Sammie’s",
            "I love making these with a nice cucumber salad on the side, so refreshing!",
            "Cool idea (pun intended).",
            "Yum! As an alternative to this, I love cold spicy noodles salad: shredded carrots and cucumbers, gochujang, Kewpie mayo, sesame oil, soy or ponzu! Sometimes I also mix up some diced kani.\n\nIt's delicious! You can use soba, udon, or ramen. In a pinch I'll use capallini instead.",
            "Just in case someone wants to make sauce easier way, use Kikkoman's hon tsuyu. \nJust need to mix water. Based on ratio of mixture you can use tsuyu for other things such as tempura sauce, katsudon sauce, etc.\nI love soba noodles. Works well with shrimp tempura. I get my frozen shrimp tempura from Costco. So many, so cheap, compared to how many is in it (i like to deep fry things myself, but man these frozen ones are good enough and easily accessed)",
            "We bought a rotisserie chicken. I had garlic confit and have been spreading that on a piece of bread, then chicken, then avocado slices. Salt and pepper. But chicken enchiladas has me intrigued now.",
            "That's what I did this week. I got a couple discount rotisserie chickens. Made a big batch of chicken salad and some chicken ceaser pasta salad!  Nice and cool meals.",
            "Rotisserie chickens make *The Best*  chicken salad. I work at a grocery store, and over in the deli, they use rotisserie chicken breast for the chicken salad. It's the best chicken salad in the city, I swear.",
            "I bought a rotisserie chicken this morning. We are turning it into snack tray dinner: some cheese, berries and grapes, a small veggie tray, a handful of crackers. Sorbet for dessert.",
            "That's a great idea. Thanks!",
            "I’ve been a slut for curried chicken salad. \n\nChicken salad plus curry powder. Maybe throw in some peanuts or pistachios. Maybe a dried fruit, like golden raisins or cranberry. \n\nThrow in to a tortilla, pita, or naan.",
            "Can you tell us more about the chicken enchilada dip? It sounds divine.",
            "Taco salad too!",
            "Yaaaas",
            "Yes, I was going to suggest this!",
            "This is my plan! I’m making it tonight",
            "The first week I made 4 quarts. Second week I made 6 quarts. The next week I made 10 quarts. Last week I made 4 gallons. It’s all gone right now and I’m so sad. I’m definitely making more Monday.",
            "Real easy cheat, use canned chopped tomatos and a blender, food processor to make the base",
            "Off top of your head, recipe?",
            "All the chilled soups. There are so many chilled soups made from so many different fruits and vegetables and those are the only thing that I survive on when it’s hot. I work outdoors.",
            "I made tzatziki last night, and it was delicious with some toasted pita bread and sliced tomatoes.",
            "Ooo I was just in Central NY and EVERY produce vendor at the farmers market was selling garlic scapes—great call",
            "Pardon my ignorance, but I’ve never heard of a cold rice bowl. Do you just cook the rice and then refrigerate it until it’s cold?",
            "Oooh!  I have some coconut rice and Brussel sprouts and Lima beans or asparagus as well yummy that’s my dinner!  I’m kid free tonight",
            "Where I'm from we essentially make a tuna salad but substitute lettuce for rice. It's delish and refreshing during our long brutal summers. I like mine with tomato onion corn olives capers peppers, salt and pepper lemon juice, a boiled egg and mayo or olive oil",
            "I use a rice cooker for my rice and it adds very little heat to the house.",
            "Rice bowls and grain bowls with lentils or beans are something I could eat almost every day. My favorite is rice or mixed grains, black beans, some chopped walnuts and olive oil mixed in. Serve slightly warm, top with cold diced cucumber, tomato, garlic, parsley, crumbled feta, olive oil, S+P. \n\nHEAVEN. And it's super filling. I've even seen hardcore meat-eaters go crazy over this combo.",
            "too many ppl sleepin on bahn mi",
            "Bro I fucking love banh mi why have I never one considered what you did here! genius!",
            "I did the pork in the crockpot as well! Can of root beer, tons of sliced onion, S&P. Put it on the porch (screened) overnight and done in the morning. Some of my family like Sweet BabyRays and some plain so I take some out before adding bbq at the end",
            "Yep. Pulled the slow cooker out a couple weeks ago. Using it a couple times a week, which gets leftover meals. Do that plus sandwiches keeps the heat in the kitchen to a minimum.",
            "Avocado gazpacho sounds great. Thanks!",
            "Ooo thank you!",
            "I made elote pasta salad tonight!",
            "The perennial answer.  Versatile, healthy, and cold",
            "Sounds delicious.",
            "Crush them up and use them as a coating for a fried pork chop or batter shrimp. The toughness of the pretzel makes it extra crispy.",
            "I only let myself eat the honey mustard ones on road trips otherwise I’d be a thousand pounds",
            "I swear they add crack. Those are my favorite snacks of all time. I can eat them until I give myself a headache. And I almost don't care.",
            "The new Hot Honey ones are so good",
            "Fucking yes!!! I smashed a whole (mini? Maybe?) bag of the buffalo ones today and then looked at myself like… I wasn’t even hungry. Pretty sure I ate my calories for the day. But goddamn they are my favorite snack and I could not stop lol.",
            "I love those, so let me put you onto Combos. The pizza flavor puts pizza rolls to shame, lemme tell ya",
            "I like the big sourdough twists with Palmetto’s jalapeño pimento cheese.",
            "What is the recipe?",
            "99% of recipes cannot be copywrited, as they are not considered an \"original work of authorship\". I learned this working in a bookstore and it blew my mind.",
            "Cold noodle dishes are the way to go! With quick proteins cooked stovetop or toaster oven for those of us without a grill.",
            "This is one my faves, something about the salmon and flavor of Caesar dressing together. Such a good combo! I also put a little black pepper and a half of a lemon squeezed over the salad",
            "That sounds like a great meal!",
            "omg I know that I will love this, I'm a lemon freak",
            "Cold, ready to eat hard boiled eggs are usually available in most grocery stores.",
            "Oooh--thanks for this idea!  I've never heard of green bean salad before. :)",
            "Oooooo great idea thank you!",
            "i’ve never heard of this but i’m Intrigued, what is the consistency? do you use it as like a dip? or just eat it with a spoon?",
            "Same here, but I pretty much refuse to turn the oven on during the summer anyway. Usually, I'll use the grill like an oven instead.",
            "No one asked if youre rich!",
            "Mmm.. muhamara...",
            "this just gave me a craving I cannot shake lol",
            "This is the only way I can eat blueberries. Periodt.",
            "Similar👍🏻 I've been marinating tofu slices in the fridge with my own homemade mixes and just eating them cold. But it was 115 yesterday",
            "I like this idea.",
            "Margaritas here as well 🤷🏼‍♀️",
            "Do you add the beer to your face or to your slow cooker?",
            "That's my breakfast, except the water's been filtered through ground coffee first.",
            "I have a table on the back porch. We often have a slow cooker,instant pot,air fryer or induction burner on it. It is in deep shade so I don't mind running out there.",
            "All the effort you put into retrieving and providing these links when OP couldn’t take two seconds to search existing posts, smh",
            "Fluffernutter!",
            "Ooh, your sandwiches have me intrigued! That sounds divine",
            "Chicken and toum- is a winner in a wrap forget the confit..\n\nEgg salad\n\nCold noodles and chicken\n\nGazpacho\n\nGrilled fish - super fast and healthy with a salad or anything.  Eat more fish",
            "Happy cake day!  And could I have your recipe for chicken salad?  I can never get the proportion of mayo right, I usually add too much.  TIA",
            "Happy cake day!\n\nThat sounds delicious! A nice cold chicken salad, a chicken Waldorf salad would be very refreshing with the fruits and it would also help with the hydration to be eating juicy grapes and celery",
            "Why did I never think of this?",
            "Grapes work great in curried chicken salad. Cut them in half",
            "Here’s a recipe: https://www.delish.com/cooking/recipe-ideas/a49954/chicken-enchilada-dip-recipe/",
            "Garlic scape pesto has been in heavy rotation in my kitchen the past few weeks. So good!",
            "Nope, it's just room-temp rice. By the time you mix it with whatever stuff such as soy sauce (which I keep in the fridge to preserve its quality for longer), oil, veggies, pickles etc., it goes down to room temp. It's not cold, but it's not hot food either.",
            "Cook it the day before. Use a bit less water than you would normally use. Cook normally. Scoop out of cooking device. Spread on a clean surface to dry and cool down. Pack into plastic containers and toss into fridge to use over a few meals.",
            "It's literally one of the most perfect sandwiches.",
            "My kroger started selling shaved pork and it's been perfect for making bahn mi.",
            "It was so good, I begged the chef at the hotel I was staying at to give me the recipe. He was so kind to do so!",
            "How do you get ‘em to stick?",
            "Why are those specifically such a roadtrip food? My parents only ever got them for roadtrips and STILL bring them along when they travel… but they never just showed up in our pantry",
            "It’s 100% worth it IMO",
            "I haven’t seen those yet, but now I’m on the hunt!\n\nHave you tried the Nashville Hot Chicken? Incredible.",
            "Snyders kill Combos imo. When we were kids, Combos used to be good. But their “cheese” has no flavor anymore. Whereas Snyders’ flavor is so highly concentrated it’s like a party in your mouth and *everyone’s* invited.",
            "Boil some noodles eg soba until done, then quickly blanch in ice water. Add to a sauce made of sesame oil/tahini, vinegar and chilli oil, soya sauce and green/spring onions and roasted sesame seeds to taste. Peanut butter is also a good substitute, and you can add a little sugar to taste if you like. I also like to add roasted seaweed or furikake, and a soft boiled egg on top. Cucumbers and tomatoes are also nice.",
            "That’s a fun interesting fact! 😊",
            "Hi, I like it thin like 1% fat milk. And drink with a spoon. Salt to taste. I like it salty. More savory.\n\nThe olive oil, I add and stir till it’s evenly distributed. I like seeing fine oily dots in the soup. Better visual.",
            "We’re not rich, we would just actually die if we didn’t have AC. The elderly are particularly vulnerable, especially in the southern southeast",
            "I'm not rich.  In the majority of the US, especially the lower 1/2 of the country, A/C most always comes with rental units as well as homes.  There are exceptions, but I don't know a single person without A/C.",
            "Eh, it's a bit frustrating, but then Reddit's search really sucks. And people are using lots of different words - \"heat wave\", \"hot weather\", etc, making searches harder.",
            "It's really easy and tasty!",
            "I do a half and half of mayo and ranch dressing, shredded Parmesan cheese,bacon, celery, paprika, mustard, onion and garlic powder. \nI eyeball the measurements.",
            "Thank you! I always just eyeball everything. Spoonful at a time until it's how I like it!",
            "I just cut all of mine from my garden today.",
            "Thanks. We’ll have to try it. I bet it’s good with some leftover grilled teriyaki chicken.",
            "depends on the execution (the marinade) and the sauce. we just got a Vietnamese place and the Bahn Mi is....pretty unremarkable",
            "I’m not who you asked, but I do a light flour dusting on the meat to help things stick, and then dip in egg with a bit of oil beaten into it, then press into the coating and try not to jostle too many pieces off as you get it into the oil!",
            "I just discovered Combos last week knowing I love a good flavored pretzel, and I thought it was super flavorful. Maybe it’s the novelty of it for me, I guess time will tell though lol",
            "100%. The heat down here is truly indescribable to people who don't live in it. There really is no such thing as \"no ac\" in the southeast. I live in Georgia, the other day I checked the temperature, it said 101 with a \"real feel\" of 112. And people don't understand that this is not a west coast 112, it's like the thickest, heaviest heat you can imagine, and it's really unimaginable I think to people who aren't from here. To not have AC down here would literally be dangerous. Throughout the past week, my county has actually been issuing warnings about the heat to people who would be the most vulnerable in this kind of weather. Yes, we have the AC on all day every day, and it is with very good reason",
            "Grew up in KY and this is 100% true BUT there’s no need to heat up the house more — we shouldn’t really be cooking like normal (if that includes using the oven and stove burners a lot) because that’s such a waste of energy.",
            "In the west coast and the north, AC isn't common. Almost 30% of Californians live without AC in their homes.",
            "I’ve never put mustard in it! I might try that! Give it an extra tanginess.",
            "I like the spice, acid, savory, fresh, soap balance",
            "The air is soup.  That’s how I always describe it to people.",
            "I always heard \"hot as a dog's mouth\".",
            "I’m in MO and the other day it was 95 but heat index 110 so I get it. The humidity hear is also horrendous, the best way I can describe it is when u breathe you feel like your swallowing/breathing in hot fog 🤷‍♀️ there is no way we would ever survive without AC…..it’s so hot that it runs pretty much all day, super annoying money wise",
            "Ok, fair. I personally do a lot of crockpot and outdoor grilling in summer",
            "All of my CA friends have A/C, but they all live in southern CA.  My friends up in North Dakota do not, which is why I said, \"the lower 1/2 of the country\".  \n\nAccording to a federal study done in 2020, something like 90% of Americans have A/C.\n\n[Nearly 90% of U.S. households used air conditioning in 2020 - U.S. Energy Information Administration (EIA)](https://www.eia.gov/todayinenergy/detail.php?id=52558)",
            "Definitely, liquid mustard is good, but mustard powder is where it’s at.",
            "wait...youre a cilantro soap guy....and you still eat cilantro?",
            "Yes! Exactly. And it's not a \"rich people\" thing, the money is definitely not free flowing for me or my neighbors, but I would say that most of us would go without plenty of other things in exchange for not having to deal with living in homes that would easily be 90 degrees in the summer, if not hotter, without any AC. The people I know down here who have very very little still have some type of AC.",
            "Yes, and not having AC up north or on the west coast is a very different thing than not having AC in Georgia.",
            "Ah ok, that makes sense to me! Not sure why I didn’t think of mustard powder before!…..do u so just a pinch? 1/2 tsp?",
            "No, I just hear people describe it that way. I like it. Im more a lavender soap guy.",
            "I'm a cilantro-stink bug person and I've taught myself to eat it.",
            "I'd be willing to give up all food to run my A/C.",
            "That’s the thing is you and I have to budget differently just for the summer 😂 if people were to see our electric bills they would probably be aghast. I see that too with people that can’t afford the AC to run will just buy a window AC or something to have a little 🤷‍♀️ you made a good point in your first comment, if we went without AC there would be a lot of people in the hospital for heat stroke. \n\nIs that a common thought that people have, you must be rich if you have AC? I’ve never heard that in relation to the US. I’ve heard that said about other countries. I’ve lived in the Midwest all my life so this is all I know, so just curious.",
            "It’s pretty potent, I’d say between a pinch and 1/4 tsp. \nRed pepper flakes for more heat and don’t hold back on the paprika. \nI also add turmeric powder just because I try to add that to my diet whenever I can (but it stains so watch out)",
            "werd. i fuckin love cilantro, hold the lavender tho",
            "Shit when it's this hot it's hard to even have an appetite anyway so what's the point? Absolutely, give me the AC",
            "I thought that was wild too, but the person who I was replying to in my original comment, they were replying to someone else who basically said they must be rich because they have their AC on!! And then someone else replied to me basically saying that plenty of people live in this kind of heat with no AC. I'm like um, where lol",
            "I do agree that its hard to want to eat when walking into a hot, wet blanket.  Last summer, I went to visit one of my BFFs in Florida (Tampa Bay) and OMFG.  We were out walking his dog in August and saw an alligator by the pond.  I didn't even care if it ate me.  It was so fucking hot.  The alligator didn't even move because I think it was thinking the same thing.  Just make me into boots already."
        ]
    }
}