{
    "Please Stop Reposting": {
        "title": "Please Stop Reposting",
        "score": 7090,
        "url": "https://www.reddit.com/r/CrazyFuckingVideos/comments/y3l1b1/please_stop_reposting/",
        "content": "I'm going to start temporarily banning people for reposting highly reposted content on the subreddit. It's super annoying and no one likes when a subreddit gets spammed with the same posts back to back for weeks.\n\nAlso hope y'all are having a good day :p",
        "num_comments": 577,
        "comments": [
            "**DISCLAIMER**: We allow posts to resurface every few months to revive good posts we forgot about and to give new community members a chance to see these golden posts. \n\nWhen I mean reposts I mean posts that get spammed every week or day back to back so don’t go _too_  crazy with the reports. Thanks!\n\n_Luke in mod chat_: “r/crazyfuckingvideos more like r/crazyfuckingreposts! 🥲”",
            "#Finally",
            "Within 15 mins this very post will be cross posted back to r/CrazyFuckingVideos",
            "Yes, it’s the main reason I unsubbed similar subreddits like WTF, unexpected, oddly terrifying, WCGW. People repost the same thing over and over again across all similar subreddits… whats the point? Reddit karma can’t turn into cash you know?",
            "[removed]",
            "[removed]",
            "Hear hear!!",
            "Thank you, I agree that shit is mad annoying",
            "Crossposting from r/CrazyFuckingVideos to r/CrazyFuckingVideos should be a permaban. There's no plausible deniability there that someone didn't know it was a repost, they're just undoubtedly morons.",
            "Would you be mad if I reposted this",
            "This is an upvote based website, if a repost gets upvoted to the front page its because enough people didn't see it.\n\nThe more you know..",
            "Anyone gonna take one for the team and repost this?",
            "How can I check if a video i have is a repost?",
            "Can we comment “reeeepppoooossst” like in the good ol’ Reddit?",
            "A while ago I made a comment from another account relating to this, everyone downvoted me, it was something among the lines \"This is the 4th time I've seen this post on this subreddit this year\"",
            "The robots would be very sad if they could read this. LOL",
            "I bet this is going to be the one time one of these posts actually makes a difference.",
            "[deleted]",
            "I just un-joined this and other subs cuz it’s just the same stupid shit every day for months.",
            "No you’re not\n\nMy thread has a shit ton of OLD ass reposts",
            "Thank you. Every time I comment it’s a repost I get banned. Like fuck how many times do we have to see the same fucking thing?",
            " Seems nobody is getting banned here seeing i have seen every big video of this week being reposted today.",
            "I appreciate the time and dedication you take to stay true to the subreddit's values. It really makes a huge difference. Thank you!",
            "This was a [repost](https://www.reddit.com/r/CrazyFuckingVideos/comments/109rk4h/walmart_brawl_turns_into_warzone/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
            "I  see reposts all the time. Sometimes they appear only two posts away from a duplicate. Sometimes they reappear described in a slightly different way but it’s the same post. It’s irritating.",
            "Just imagine the confusion being a random person that’s not online much or new person on Reddit and getting banned from a page for simply posting a video. \nI understand the frustration but if you’re that trigger happy and frustrated that much then perhaps you should surrender your rights to someone with better capacity to deal with the territory that comes along with having such responsibility. It’s called maturity and controlling your emotions. \nYou can always tell when it’s a kid. The ego massage from banning people because of something so minute is too satisfying for a kid to handle. And if it’s an adult then yikes.",
            "But what about todays lucky 10000?",
            "i cannot be stopped",
            "I hate getting banned for posting a video that I didn’t even know was a repost. I get it if I’m posting the same video over and over. I clearly know I reposted it but I get banned for posting a video one time. It’s fucking lame.",
            "I happen to like reposts. It's nostalgic.",
            "What??? I was hoping to see that kid light the bonfire a few more times!",
            "Yes please",
            "A sensible decision",
            "Thanks for this. I had noticed it became a greatest hits feed",
            "Excellent",
            "**ONG**",
            "Helllll yeah brother!!!! Hate the repetitive posters",
            "Less talk more action, ban them all. Losing my patience with them!!!!",
            "Can you also filter by videos that have been cut shorter with an iPhone 6s iMovie text at the start to gain votes too please.\n\nJust watched the same video, 4 times.\n13, 29, 52, 1 minute so annoying :(\n\n❤️",
            "Why even make his post when y'all just allowing reposts",
            "So many fucking reposts lately, why not merge this sub with r/wtf, it's often the same shit just posted here as well to farm some karma.",
            "i  know this guy named Nabil and he says he re-posts stuff just to piss you off",
            "Please do, it’s annoying seeing the same shit i saw 2 days ago",
            "If it’s so reposted, then downvotes should handle it. I don’t post ever but I can be on here all the time either. Who cares",
            "“I swear to god I will pistol whip the next person that says shenanigans!”",
            "Yes it’s BS",
            "Wooooooo you are appreciated! Don’t forget it! I’m super thankful for your effort and intent!!!",
            "I always do a little research before posting something. Search results are not exact because I always get my videos deleted for reposting, where is the original post? I don't know.",
            "THANK YOU! I’m sooo sick and tired of seeing the same shit over and over 😑",
            "Temporary bans ain’t gonna stop bots bud.",
            "Are you actually going to start doing this? So. Many. Reposts.",
            "It's not really on you mods but I am noticing a lot of posts made with bullshit explanations in the title recently. The chicken breast thing and the \"manager wouldn't let her leave\" thing are both made up stories used to get more clicks.",
            "Love u",
            "nah",
            "Thnx I hate that",
            "Can you please do something about the shit posts and reposts? This sub used to be good but now it’s just reverberated TikTok’s, reposts of things that are years old and boring videos that don’t even belong here",
            "I was wondering why I couldn’t comment on these posts. It is kind of annoying when I want to actually ask someone a question based on a comment they made while the thread was still unlocked. But hey, Reddit’s not a place of freedom of speech anymore, so I get it.",
            "[removed]",
            "This is my favorite post.",
            "Awesome! Thank you so much.",
            "Please stop locking every post",
            "Unfortunately, by their very nature, the reposters won't be reading this. They just post the hot new thing and don't even know you can sort posts by new.",
            "[deleted]",
            "Y’all need to make a sticky post telling people to not be racist. This place is a goddamn cesspool.",
            "But what if I want to see the guy get out of his truck to dance for a music video, Am I supposed to just scroll up 3 posts?!",
            "Please stop locking threads. I almost wonder if ppl repost just because they can't continue a dialogue regarding the topic because threads always get locked down",
            "Thank you! Every single time I complain on any sub about something being a repost, I get downvoted and replies about how I need to get off the internet if I can recognize reposts. \n\nNo. F you. I want good content and I’m not going to defend karma whores.",
            "Good luck lol😆 This sub is just karma farmers and misinformation posters😆😆😆",
            "I agree it's a bit of a pain to see the same repost again and again, but how are people supposed to know if something has been posted lots of times in the previous day's? Not everyone uses Reddit every day, if you come on here after a week to post  are you supposed to scroll right back through every post to check what you want to post hasn't been posted before?",
            "Thank you! Holy shit Reddit with the lame ass reposting!!",
            "THANK YOU!!!!!!!!!",
            "Thank god",
            "Yes thankyou",
            "Thank you!!",
            "What took you so long?",
            "[removed]",
            "Reddit is just one big repost. Why are you starting now. Its too late. You won’t  have any content.",
            "also a reminder - no death posts please - we are temp banning for those as well - nobody likes seeing them",
            "Good I was tired of seeing all the samebullshit reposted over and over and over yesterday.",
            "Yeah the reposts are overboard",
            "who the f has time to see every post every day?",
            "Good, but why is Reddit taking down the video of the cop who shot the dog? People need to know about this bullshit.",
            "Please stop locking comments. Tell me why you locked comments on the organized mass looting video posted earlier today.",
            "I mean it’s a sick sub guys. But keep it fresh and new. \nReposting is old man let’s make this a good sub",
            "[removed]",
            "thank you",
            "Amen",
            "The hero we all needed!",
            "Yay! New sheriff in town!",
            "Thank you",
            "[deleted]",
            "Finally!",
            "I know right! That reminds me, I got this video of some guy jumping onto some gym equipment and flipping upside down and landing on his head. I've been meaning to post it for a while. I'll get that up soon. Let's keep the fresh content flowing!",
            "Finally",
            "Praise Henry 🙏",
            "Fucking Finally",
            "I thought it was just me",
            "True!",
            "Thank you!",
            "[removed]",
            "[deleted]",
            "Thank you",
            "Take my free award",
            "What did you expect when creating a non original subreddit? Theirs like 50 ‘CrazyVideo’ subreddits",
            "Absolute good mod\n\nDecisions like this keep subreddits high quality",
            "What’s the deciding factor on if something is highly reposted or more? The majority of content here has half the people in the comment section that have never seen it, half complaining abort reposts.\nWithout reposts, 99% of the content would never get seen by more than a handful of people",
            "Yes! Very excited about this!",
            "What happened to watch people die",
            "https://old.reddit.com/r/CrazyFuckingVideos/comments/ybiloz/he_really_shouldnt_have_said_that/          \n\n\n\n\n\nYeah, can we stop with this one as well? I can count ten times it's been here but this one was allowed to get up in the thousands of comments??",
            "About time",
            "Thank you",
            ">I'm going to start temporarily banning people for reposting highly reposted content on the subreddit. It's super annoying and no one likes when a subreddit gets spammed with the same posts back to back for weeks.\n\nNeed some clarification. What constitutes a \"repost\"? Is the content that's been posted on CFV before? Or the whole of Reddit?\n\nI also need to know how to check to see whether something has already been posted. The content may have been released under a different title, and a search to see if it has been posted before or not may turn up nothing (due to different title than the search keywords).",
            "Thank you.",
            "Is it that serious tho?",
            "How do we know what's been posted and hasn't been posted before? I don't have time to watch all of these videos.\n\nWhat if someone hasn't seen the reposted video and has no clue there was a 2nd original video buried much deeper?",
            "[removed]",
            "Thank you",
            "Yes pls!",
            "Thank u",
            "ALSO have a nice day",
            "For real I see the same vids every day every week every month I love this subReddit but fuck please start banning these reposts",
            "There are some users that just repost an old video and adda question in the title to farm karma. I hate it so much",
            "Thank you for saying it!",
            "[removed]",
            "I don't think I will",
            "Sub is still 99% reposts, most with bullshit titles.\n\nMaybe instead of a sticky you might want to just enforce the rule...?",
            "This is relevant to all the Kanye shit",
            "You have a crazy good day as well",
            "L",
            "It's good for someone who dont be on this a lot",
            "[removed]",
            "[removed]",
            "recording > reposting",
            "ONG",
            "K. I'm not going to be childish, and repost this post.",
            "![img](emote|t5_45hae8|4103)",
            "MAKE ME!!!!!!!!!!!!!!!!!!!!!!!!!!!!!    :<0",
            "Smh",
            "Thank you!!!!!",
            "Finally thx bro",
            "I make an effort to search for a video before I post. Most of the time it's already here.",
            "Y’all ban-happy. Chill.",
            "It do be like that.",
            "Lol of course they lock the comments in the post with the pitbull, shocker",
            "Post some gore",
            "Hello \n\nCan i please request this to he a permanent ban instead of temporary because of the following reasons:\n\n1. Most repost are bots who farm karma to sell account (yes, politicians and other who use such accounts to manipulate people on social media buy this ready to use account. All hail capitalism....)\n\n2. Many of the people who are shit posting will NOT bother asking to be unbanned via chat.\n\nIn both cases, this sub will be filtering out thoes users who only farm karma.\n\n\nFor anyone else: please remember to block user. Regardless what sub, if you block the obvious karma farmers, you won't see thir post anymore",
            "the amount of times i see the same post like 5 times. sometimes partly over different subreddits  but  just god damn the reposting on this is so bad. seeing the same post 10 times in2 mins. from a few moths ago yeah i need a reminder. but i saw this video 2 mins ago please no more mister :(",
            "This sub is a bigoted shit hole. Adios!",
            ".",
            "Thank you! I come here for the fresh content but it sucks when I see the same stuff over and over again.",
            "gods work 🙏🙏🙏",
            "I’m just hoping people start posting again at all on here. It’s been dead since protest.",
            "I’m sure someone here thought about reposting this post.",
            "I see reposts OP",
            "OK",
            "Finally",
            "Ban u",
            "Unfortunately, I always have to take screenshots to translate",
            "but i wanted to see the \"motherfuckerrr\" lady in the grocery store for the 89th time. i am a 12 year old idiot.",
            "My kind of mod.",
            "I don't know how to earn comment points 😕",
            "I love seeing highly reposted videos right under this pinned message.",
            "How come when I report now \"recent repist\" doesn't appear as an option? Shall I mark them spam?",
            "Why are the comments turned off from that ‘yet another American car meet that goes wrong’ video???",
            "Maybe im just not adventurous enough but I feel like leaving all these giant things that can kill me instantly alone is fine with me.",
            "Test",
            "I wish you'd take over YYYN. I've gotten so sick of the constant reposts that I barely visit it any longer.",
            "god bless u mate",
            "It is improper to republish my cock in your ass because it is unclean.",
            "If it wasn’t for reposts many of us wouldn’t see a lot of the stuff we see. Not all of us scroll endlessly though weeks and weeks of posts. I get same day reposts or even next day reposts but no reposts less than a month or two?",
            "Awhhh uncle Tommy want wingy ! Poor baby",
            "Is this still available? Does it still work?",
            "Good",
            "just found this sub IrrationalMadness\n\nlike ol days of sub cfv",
            "just found this sub IrrationalMadness\n\nlike ol days of sub cfv",
            "It seems though no means of telling if a video has been posted before if the title has changed?",
            "That's why robots are used; they couldn't care less about anything else.",
            "Yes, yes, yes!!",
            "Who cares who got it out there first? I like revisiting times long since passed.",
            "I'm hoping today is treating you well, as well:p",
            "It's the major reason I stopped following WCGW and other weird and scary subreddits. People keep reposting the same stuff on all the related subreddits... Seriously, why bother? Bad rep on Reddit doesn't translate into actual dollars.",
            "This works perfectly. Banning them is necessary because else they won't learn their lesson.",
            "FATALITY",
            "When someone repeatedly reposts the same material on this subreddit, I will temporary ban them. When a subreddit is inundated with duplicate posts over an extended period of time, no one enjoys it.",
            "# REPOST",
            "[https://www.reddit.com/r/CrazyFuckingVideos/comments/17se5e5/inmate\\_gets\\_a\\_swirly\\_in\\_prison\\_toilet/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/CrazyFuckingVideos/comments/17se5e5/inmate_gets_a_swirly_in_prison_toilet/?utm_source=share&utm_medium=web2x&context=3)y\n\nhow to i report this crime",
            "you're a nerd",
            "sorry",
            "\"no\"\n\n\nLiterally every single person that posts in this sub...",
            "[removed]",
            "Then stop sucking Samsungs ass",
            "Yes indeed. I don't mind a repost from a while back, but I'm sick of downvoting the same fucking videos from several weeks ago.",
            "Yeah right. Finally, some say that. Well if no one tell that, they think it's fine and no one trying to stop them. Well people should stop it, before it get worst.",
            "Great minds....",
            "That would be so meta",
            "I hate it. Well they keep on repeating those video because it has many likes, they don't have any right to do it. It's their video at first place. Shame those poser and spammers.",
            "/r/Oddlyterrifying had a field day with the uncanny valley tweet",
            "[removed]",
            "[removed]",
            "W",
            "Thank you for that...and for spelling it correctly. :-)",
            "Hear ye hear ye!",
            "It makes me take annoyingly mad shits",
            "Yeah right is so annoying for real. Well most of us are so annoyed to those kind persons. I bet they are not happy on their lives.",
            "Always wanted know...Is there a way to know if something has been posted besides scrolling thru the entire subreddit? Like, can you search for an image or post?",
            "You know you can shut off cross posting right?",
            "[deleted]",
            "[removed]",
            "That’s why they use robots because robots don’t give a shit about anything.",
            "I detect a little /s.",
            "Redtube?  You 13 or something lmao?",
            "Yeah. I guess everyone is so sick with those post. Me too, I can argue that this is been for a month's or a year. This problem has not been resolved yet.",
            "Yeah I think so, your just sick and annoyed on those post. That's why you want to make a thread about this. You don't have to feel sorry about.",
            "Yeah, well it's not our fault to make a lot of comments on the same post because it was clearly reposted. And maybe we don't have any idea if it is already reposted.",
            "give appreciation to the dedicated person for a huge difference  thankyou!",
            "Maybe you should check first the main video or original post so that you'll be safe from getting banned",
            "LMFAO",
            "Yeah right. Well someone actually make this as a post rather that on comments. Well much better, atleast everyone would know.",
            "I know right. But they would not do this anymore. It's not a good thing to be a redditors. If up on likes, I hope you make your own post.",
            "Yeah right. Atleast this redditors is just a concern citizen. I commend her kindness though. I really hope, Reddit find its way to ban those redditors.",
            "Same though. Those on hot and top categories, will the post that they are going to repost. We're all sick of that.",
            "Man I was just thinking that. Mods need some help, this place is wild",
            "Maybe you should take a break from Reddit if you can recognize reposts.",
            "Well I think you are though. If can't manage to give a good comments just leave, we don't need you here.",
            "Personally, I'd say yes. On subs like these, where it's strictly about posting other people's content for entertainment, and not a resource for answering questions, getting opinions, collecting information, etc., I think if you don't regularly surf the sub, you shouldn't post in it. I think you have a responsibility to make sure you're not posting duplicate content. \n\nIf you view that as an issue, you probably care too much about trying to farm karma.\n\nJust my opinion.",
            "If you can't spend a few minutes scrolling through Hot, you don't really need to be making a post.",
            "Probably based on other posts by the same user. They probably repost a lot. But if someone were to repost once or twice, I doubt that gets you a ban.",
            "Sort by the top post of the week then, do you know how to use Reddit?",
            "Well I think they were just remember it every single day and just being sick to those.",
            "If it's not your own video it's a repost",
            "YOU'RE WELCOME!! lol Well he's so thoughtful though. He's making post about this and it gives us to make an effort just like him.",
            "I hope it help you just like me. Well we really home they would be able to update this app and make some changes though. He's so kind.",
            "We're actually glad his here to be this kind. Well we are all sick on those repitive post that caused by posers.",
            "Me too. Everytime I keep on commenting on those repitive post that it's a repost, well I don't know why my comments get remove. I was just stating the facts.",
            "Yeah, I think Reddit is actually a repost. Well everyone is been annoyed on this, for all these years. Hope they make changes to it.",
            "I do.",
            "Lame.",
            "Maybe you should get off Reddit for awhile then?",
            "I think you are the MF!! you deserve to be ban. lol Well I guess people like you is happy of getting someone else post.",
            "Shut up narc. We like those.",
            "…who?",
            "We do have that comment bot, on most posts there is a pinned comment and if it's a rule breaking post then just downvote the comment and then it hits a point where the bot removes.\n\n&#x200B;\n\nAlso we have like around 3 reposts bots but there aren't any reposts bots that are super good against moving images (aka gifs, videos, etc) so most of the repost catching is done by our amazing mod u/jasontaken but a few posts get through :/",
            "Yeah, well it's them that will suffer the consequences. We are just here to give them advices that they can do or not do.",
            "Yeah. But we actually get involved about this. Everything about this, we get envolve.",
            " also when people reposts the reposts an hour later",
            "recent repost option should still be there",
            "Or reposts the same day !!",
            "[removed]",
            "Who cares who sent it first I like seeing blasts from the pasts I’ve missed",
            "TIL",
            "[removed]",
            "If you’re crossposting from a major sub like 95% chance it’s a repost since that’s all those subs are anymore.  Also you should get in the habit of sorting by top posts of all time when you join a new sub.  Before you post, check the top posts of the week or month.\n\nNo one is going to ban you for reposting that thing that got 1000 upvotes on a random Thursday 3 weeks ago.  This is about popular posts that end up reposted every 2 days or weeks.",
            "If it's not your video it's a repost",
            "Crossposting itself isn't the problem.",
            "Sarcasm tags are shit",
            "Violation of rule 2 of the subreddit lol.",
            "Good for you though. For me it's a bit hard to detect it. Hope Reddit would be able to detect those in the future.",
            "Nah bro, this is the one time this will wokr, cmon, that's the reason we all are here right? To see it work for the one time. Woo buddy, history in the making Let's GOOO!!",
            "Fair enough.",
            "Good luck convincing someone who doesn’t surf Reddit very often that they have any responsibility towards any subreddit.",
            "Yeah, but everyone can make post. No one would stop them, if its the thing that makes them happy, let them be.",
            "Do you know how not to be a dickhead?",
            "Someone should check-in on Jason… Guy is probably beaches of Normandy hardcore after all he’s seen. Good work and happy to hear about the efforts to limit reposts.",
            "Finally",
            "[removed]",
            "No doubt about that at a point people just gets fed up and starts downvoting to such posts!",
            "Well, some people do, I meant, especially when they created the video from scratch, not anyone's content, should hold no rights to repost unless it is not copyrighted",
            "I'm mad that shit is annoying.",
            "Awww did I hurt your feelings by pointing out the flaw in your logic? 🎻",
            "gotta give credit where it's due, there are other moderators like u/random-homo-sapien that do a SHIT TON of actions behind the scenes. probs to them tbh. \n\nAnd yes we are sending in therapists to check up on jason and r_h_s on the daily basis.",
            "u/Frequent_Spinac is a comment stealing karma bot. It copies and pastes comments from below in the thread. Report it as a harmful bot under spam to get it banned.",
            "I shit while mad and now I'm just annoyed",
            "No, because I didn't see the point you was trying to make. I didn't realize most people vote on every single post! If I'm not interested in the headline or have seen it before I just scroll down looking for something I do want to see, without voting. Are the statistics available on Reddit to show most users act like you? It would be interesting to see the breakdown.",
            "My therapist hasn’t come in the mail yet I think you got the wrong address"
        ]
    },
    "All posts and comments related to Israel, Palestine and Gaza are now prohibited!": {
        "title": "All posts and comments related to Israel, Palestine and Gaza are now prohibited!",
        "score": 473,
        "url": "https://www.reddit.com/r/CrazyFuckingVideos/comments/1cg90zg/all_posts_and_comments_related_to_israel/",
        "content": "We understand that lots of people are interested in the ongoing conflict in the Middle East and want to discuss it on Reddit. Unfortunately, due to the very high number of users who are unable to talk about it in a civil manner, we are forced to **temporarily ban all posts and comments about Israel, Palestine and Gaza**.\n\nThis ban also includes **videos from protests** in support of either side, **older videos related to this topic** (from before October 2023), and **randomly bringing up this topic in the comments of unrelated videos**. You might be banned if you decide to post or comment about it. This post is the only and last warning.\n\nWhy the ban? Well, all these posts and comments lead to is harassment and insults towards other users over different opinions, hatred (both Islamophobia and Antisemitism), glorification of violence (against both Jews and Arabs/Muslims), misinformation about the situation, and in some cases even the terrorism support. We are not interested in this content when so many users can't discuss it like decent people.\n\nIf you are interested in a civil discussion about the topic, please use other subreddits instead.\n\nThank you for understanding.",
        "num_comments": 1,
        "comments": []
    },
    "Hmmm… who knew?": {
        "title": "Hmmm… who knew?",
        "score": 401,
        "url": "https://v.redd.it/kgk43lvkf03d1",
        "content": "",
        "num_comments": 81,
        "comments": [
            "Show-off",
            "The longest [walrus baculum](https://www.youtube.com/watch?v=Ony5vb01qYc) is near a meter long. Some Inuit's still use them to club seals.",
            "I heard he had a pair of his ribs removed so he could do that.",
            "\"Watching a walrus wank\" wasn't on my list of things to do today, but here it is.",
            "Alright...that's enough internet for today.",
            "The John Holmes of pinnipeds",
            "He hawk tuah on that thang?",
            "Let's be honest you would of you could....",
            "If this happened in Florida, a local politician will demand for the manatee to be executed for public indecency",
            "That’s some Gumo-Gumo-No action.",
            "Give it a little huak taw, spit on that thang",
            "Been trying to leave the phone alone all morning. This is my punishment.",
            "let's be honest most guys would at least try as well if their body would be capable of",
            "I guess there's nothing wrong with self love.....",
            "Bro is not wasting any calories",
            "It’s nice to know Justin Long is adjusting better..",
            "Man if I could do that I'd never leave home.",
            "Goddamnit Wally.",
            "Inb4 a Boeing engineer gets skewered.",
            "Lol!",
            "Idk I really thought this was a nsfw video at first I had to really see what was going on",
            "Is that a breathing air orso",
            "That's a gift",
            "Thankfully for his sake Mr hands is no longer around",
            "BWD category?",
            "That's Gandalf",
            "I'm not sure how I should react to this video",
            "#I AM THE WALRUS, GOO GOO GAJOOB",
            "Horny Horny Hippo",
            "And not even watching porn doing it? Wow!",
            "I watched this happen live in front of a group of children and when he finished they all ran and screamed.",
            "Capri sun!!!!",
            "Is that what Marilyn Manson did?",
            "There are 68 comments on this video. Need to change this",
            "I do that in my dreams sometimes!  Wake up feeling confident like a god!",
            "Marlyn mason of walruss",
            "Seeing the things that get marked NSFW vs the things that don't on here makes me wonder why we even have the tag.",
            "Straight jorkin his peanits",
            "I told you never disturb me when I’m cleaning my room",
            "We are all jealous of that performance !! \nOr because we are not enough flexible ( yoga can solve that ) or because our ding dong is too small",
            "[deleted]",
            "Probably where the term “dicked down” came from",
            "I use mine to club ants",
            "Fascinating how far the rumor had spread even though most people didn't have the internet back then. \n\nI always thought it was only spread in Germany until I recently read that it was also known in the USA.",
            "Marilyn Manatee",
            "It was on mine though",
            "Wank and blow himself*\n\nLegend",
            "I just woke up and this is my first video of today.",
            "I tried but the zoo keepers caught me jumping into the water and threw me out.",
            "I hear it feels much more like giving than receiving",
            "Nah fam suit yourself",
            "That's what I thought at first. But, I have read and heard from many places that it feels more like giving head than receiving it. Ever since then, the appeal has dissipated.",
            "Pretty sure that’s a walrus.",
            "This happens every day at the Wild artic exhibit at Orlando's Sea World. Sometimes they use a Barrell or whatever toy they have in the exhibit that day.",
            "Not a manatee",
            "Would you swallow??",
            "I’m not jealous at all bc idc who’s ding ding it is it’s not going in my mouth & dudes that say they would are lowkey gay imo…   \n  \n  \nQuick question for the dudes that want to suck (their own) dick, would you swallow??",
            "Don't expect anyone else to want your cock in their mouth then",
            "Not as gross as your grammar.",
            "why not",
            "Certainly spawned Boner. [Further reading](https://www.susanelainejones.com/post/2016/10/27/no-boner-jokes-please) (for the not too squeamish) along with eye opening pictures. Don't miss Neptune's trident of rice rats.",
            "A swiss army stick of sorts.",
            "Manatee Manson",
            "I hope it was everything you dreamed it would be.",
            "I'm going back to sleep and trying again.",
            "Ah I see what you did there",
            "Savage, lol",
            "\"Shut the fuck up, Donny! V.I. Lenin. Vladimir Ilyich Ulyanov!\"",
            "Depends on the day.  Definitely not on Tuesday",
            "How is it any more gay than jacking off? You'd still be fucking the same person, lol.",
            "Never once has anyone verified with me that Id put my dick in my own mouth before they put my dick in their mouth",
            "Fair enough… live your life",
            "It’d be a dick in your mouth.",
            "So a dick in your hand is fine? Would another dude's dick in your hand also be fine?",
            "Idk where you got the idea that I use my hand to masturbate in the first place, but fyi I don’t bc i don’t like the way dick feels in my hand",
            "That's wild, man. At that point, you can't be telling me you don't realize you're not the norm, right? I got the idea that you use your hand because I've never met someone who doesn't. It's as normal as wearing socks or taking showers. You kinda assume everyone does.",
            "Bluds been touching dick his whole life and still is scared of it"
        ]
    },
    "Boxer suffers seizure mid-fight ": {
        "title": "Boxer suffers seizure mid-fight ",
        "score": 419,
        "url": "https://v.redd.it/rrynko17z28d1",
        "content": "",
        "num_comments": 48,
        "comments": [
            "Good on the other boxer recognizing something was wrong and not continuing.",
            "other boxer saw it before the ref and pulled back his stance. great sportsmanship!",
            "Poor guy, hope he is ok",
            "Good to hear he's good. Sucks to train for something then learn you cant continue.",
            "Article regarding this: [https://www.dailymail.co.uk/sport/boxing/article-13556231/Tramaine-Williams-discharged-hospital-tells-fans-good-boxer-suffered-seizure-midway-TCL-fight-v-Ryan-Allen.html](https://www.dailymail.co.uk/sport/boxing/article-13556231/Tramaine-Williams-discharged-hospital-tells-fans-good-boxer-suffered-seizure-midway-TCL-fight-v-Ryan-Allen.html)",
            "Happened in the opening minutes of the first round and no punches were landed at that point.",
            "Great restraint on the other boxer",
            "Epilipsy :(",
            "Credit to the other guy for not taking a swing. We all know there are Boxers out there who would",
            "Shoutout to Allen for not taking his head off there",
            "real sportsman for not beating the shit out of him the moment he was able to",
            "Was the seizure triggered by the situation or was it really really bad timing?",
            "He's got that +900 ping",
            "Fuck that's scary. Thankfully the opponent recognized something wasn't right and didn't clock him",
            "The batteries are dead",
            "Thought green shorts was taunting him.  Totally unexpected.",
            "Boxing is scary af men",
            "This non contact fighters getting out of hand!",
            "Honestly pretty cool , you can see as soon as he realizes something isn't right, he backs off",
            "He realized pretty much instantly. Great self control",
            "Carpe diem. To seize the day.",
            "That's what usually happens in boxing...WTF",
            "Career is over",
            "Williams wrote in an Instagram story: 'I'm good, the doctor said I was too dehydrated. I'm good though.'",
            "In the article about this, they said it was probably caused by dehydration (my guess is from the weigh-in). In the match, he hadn't gotten punched yet. Tho tbf boxing isn't known to be particularly healthy for your brain :/",
            "As he was ready to punch him when he saw a lack of defence. That was close damn, great man",
            "Another casual fan",
            "Yeah he got KO’d by a ghost. Happens all the time.",
            "No, just no. He didn't even get hit to cause the seizure. It was just insane timing.",
            "Ya Temporal Lobe Epilepsy. Scary shit if you dont know you have it. Your fine one second, then you start to get a feeling of Déjà Vu. You feel okay during those moments, you literally are going through an old memory like it's real and kinda enjoying and your body is still physically working properly..\n\nShortly after 30sec to 1 min. You get a real hot body flash till you start sweating.. your body doesn't want to work right even tho your trying to move. You start to fight it cause your still aware as your basically catatonic.\n\nBoom your mind goes and you black out before you hit the floor. You wake up in a daze but your almost back to normal within a minute. Not knowing you scared the living piss out of everyone around. Let alone it happening when your driving.\n\nLike I said. Scary shit\n\nEdit: Read the article too and it's all too similar. \"Dehydration.\" TLE It's not easy to diagnose unless there's video like this. No symptoms or after effects except from the fall you take.. and I'm sure he still wants to box. But ya. Been there seen that.",
            "Its hard to diagnose epilipsy, but by the look of this its definitly epilipsy, that twitching is grom epilipsy.\n\nIt can occur for some people once a day, I have severe occurs several a day even with medicine, some have it once a week/month and maybe single time.\n\nOnce it occurs you will need to take medicine on daily or weekly routine.\n\nSome might “heal” from it and by that I mean they won’t have it anymore but likely by taking medicine on some routine.\n\nBut I mever heard of someone healing from it.\n\n\nThe cause of it is unknown, some are born with it and some have randomly, I think mine begun due to lots of head injures like that boxer since youth, or maybe (severe usage of) alcohol.\n\n\n\nWhoever reads this protect your head from injures and limit the amount of alcohol.\n\nI was in coma for three month due to three to six hundreds seizures a day and was defibrillated twice.",
            "He's a pro boxer that doesn't want them to revoke his license. If he was \"that\" dehydrated he would have been cramping up well before he passed out. Let alone regardless of needing to cut weight they're still pros. That was not from lack of water.",
            "I've lived your very description right up until the blacking out part. The deja vu feeling is so intense and you're right it is enjoyable in a lot of ways.\n\nLike I said though, never blacked out. I dont think I have thay though...? Maybe another explanation.",
            "We've got a girl at work that has seizures. Probably a few a month. I wouldn't wish that on anybody, I just feel awful for her. Luckily she does have tells before she goes into one and we can get her sat down before it starts so she doesn't seriously harm herself.",
            "Reading this made me feel scared",
            "I've got temporal lobe epilepsy. I've had everything you said except I've never blacked out . After the deja vu feeling I usually got a bit nauseous and had to lay down for a bit . Meds have fully stopped it though . Didn't have my first symptoms until I was about 28",
            "It varies, I have tonic clonic for example.",
            "While I don’t have epilepsy, I do have PTSD induced seizures. Epilepsy isn’t as hard to diagnose as people think. EEGs are used to deliberately cause a seizure. When I had a seizure during my EEG, they were able to rule out epilepsy because my brain scans weren’t abnormal. \n\nThe trickier diagnosis is for other seizures, as they can be more severe and far less predictable and repeatable from epileptic seizures. \n\nEither way, having any kind of seizure sucks. I wouldn’t wish this on my worst enemy.",
            "Yeah same here . It was always the same \"memory\" I guess you could say . I used to try and predict what was next . And almost straight after the episode I couldn't really remember what that memory was .",
            "It's happened many times when I haven't lost consciousness but basically on the floor catatonic. Thats why I remember the sweats so much. Immediately get bone chilling cold and crawl to bed or the chair and your body is so exhausted usually pass out after comfortably. Wake up like normal 30 min later but saying \"Fuck\" to myself\n\nBut also had 4 staples in my head for heading a table when I didn't know what it was or what had happened to me back then.",
            "You could be having a 'simple partial' or 'focal aware' seizure.  Only when it progresses to a 'complex' one does loss of consciousness occur.  This precursor event is often referred to as the 'aura' of the main seizure, and is often not recognised as a seizure in itself, because of the lack of loss of consciousness.  People learn to recognise their particular ones.  Other symptoms can include a strong smell with no source, or strong feelings of fear and/or joy, almost religious in nature (side note: there are theorists who speculate that temporal lobe epilepsy may explain many revelatory visions mentioned in the ancient holy books).",
            "Blacking out is like sleeping without knowing you had a seizure, it can be seconds it can be several minutes.\n\nBrain danage is much more severe than those you aware but you dont feel pain.",
            "It's good she has people around for her that support the situation like you guys. The seizure is pretty manageable even if you can lay on the floor before. But the fall.. you can even see in the video the guy goes head first full weight dead falls into his face. You could imagine if that was concrete or happened before you can pull over your car.",
            "I was around the same age too",
            "In the UK, criteria for an epilepsy diagnosis is 2 verified (I.E. Witnessed) seizures within a 12 month period.\n\nI started having them in 2019, I have a calcified growth (suspected cavernoma) on my right temporal lobe ~5-7mm in diameter.\n\nMedication has completely controlled the grand mal seizures, nearly reached 4 years without one, but I still get one or two auras a month.",
            "Yes! No matter how hard I try I can never remember what it was. But when it's happening I know I've lived it before.",
            "Never I can pick like one piece out a memory that was so vivid and real 5 minuets before"
        ]
    },
    "It's not a game": {
        "title": "It's not a game",
        "score": 1823,
        "url": "https://v.redd.it/woj1ckcvk08d1",
        "content": "",
        "num_comments": 219,
        "comments": [
            "Stupidity and guns don't mix",
            "Also leg shots are a lot deadlier than people realize",
            "“Push It To The Limit”",
            "Cheddar Bob’s pen pal.",
            "The only upside is he only shot himself and not someone else. Hopefully he recovers and learns from this.",
            "Lol the accent evaporated instantly.",
            "I just watched this like ten times. Fucking hilarious 😂 😃 😄",
            "Before taking apart a firearm, you always clear it ladies and gentlemen. 😁",
            "Anybody else notice he was doing decent trigger control and reasonable handling until he tried to do the take down? Yet he still left a hot in the chamber and dropped one into his own leg. Over and over again, I tell people, \"Proceed like the gun is actively trying to kill you/someone. Act like that little shit will get paid for it.\"",
            "At least didn´t blow his homie´s head",
            "I’ve seen plenty of movies. So I’m an expert. It went straight through. So he will be fine.",
            "Well deserved.",
            "Thank god he only hurt himself and not someone else",
            "And that's how I got my street cred.",
            "I always enjoy these videos. Idiots pretending to be badasses got handed the Darwin card, yet they still make the videos public.",
            "This hurt my face watching this careless idiot.",
            "The song is fitting cause he definitely pushed his braincells to the limit.\n\n  \nall 7 of them.",
            "🤣",
            "The irony of acting like a fkn know it all telling somebody else some sht about their gun...lol",
            "Natural selection! Hahaha",
            "\"You needa clean dis ho\"\n\nHe needed to *clear* that ho...",
            "Well deserved…",
            "You love to see it. Let the trash take itself out",
            "I used to be an adventurer, until I took a bullet to the knee",
            "And I thought this was going to be a gun safety video. \n\nGuess in a way it was...a what not to do video.",
            "This guy pushed it to the limit",
            "Should have been his head.",
            "Not to excuse idiocy, but disassembling a Glock does require pulling the trigger like he does. And it hasn’t changed since the 1st gen model in 1985\n\nAbsolutely horrendous design!",
            "Thanks for posting",
            "They should use this video to show the dangers of mishandling weapons.",
            "I mean I didn’t hear any English other than the limit until he’s says he shot himself I thought this was a foreign country lol",
            "He FAFO. Play stupid games...",
            "huge smile on my face",
            "Was expecting the skyrim intro lol",
            "He had his disassembly all foocked up",
            "I have a feeling he didn’t have to swear to God for his buddies to believe he shot himself.",
            "Shot his leg in a closed vehicle. Enjoy the gunshot and tinnitus lol",
            "He pulled that trigger TO THE LIMIT 😏",
            "The Scarface soundtrack in the back is great",
            "That soundtrack tho",
            "Homie didn’t clear it before he tried to strip it.",
            "Not to worry! I'm sure he has studied and practiced effective tourniquet use!",
            "What do you mean it's not a game? He's clearly playing pin the bullet on the dummy and won.",
            "You see this?  All you have to do is pull this slide and then pull this little lever and BOOM: instant Darwin Award!",
            "As a gun person, watching that made me tense up so badly. ",
            "You can tell this guy just parrots' things he's heard. Dude is clueless about firearms, but he heard someone else say something about cleaning the gun so that's what he defaulted to, to seem knowledgeable.",
            "I’ve seen 3 people do that, so fucking stupid. If you don’t know how to use a handgun, don’t use it. One guy pulled out the magazine and forgot to pull the slide to eject the chambered round, shot his hand off.",
            "Kids... here's an example of the evolutionary theory at work.",
            "Some people should just stick to Airsoft guns or no guns at all.",
            "Hilarious 😂",
            "Cheddar. Bob.",
            "It's nice to see the gene pool regulate itself. Hopefully, the trend continues.",
            "you could tell he doesn't know how to handle, disassemble or anything! he was doing what u don't do 😭",
            "lol",
            "FAAFO",
            "Zero surprises here",
            "Push it to the limit. PUSH IIIIIITTT!!",
            "What an incredible concept…….have half a brain……get a Glock which will spit anything……..chamber a round and pull trigger while pointing at your leg      Oh shit !!! The thing went BANG !! I is gonna be in trouble \n\nMamma I’ve been shot",
            "Well deserved",
            "Why is the soundtrack an 80’s montage?",
            " If anyone is wondering what he’s trying to do it’s take the slide off the frame. On a Glock you depress the barrel slightly and take down a small lever that releases the slide. The slide WILL NOT release off the frame if the hammer is cocked and a round is in the chamber. Never try to remove the slide when the guns is loaded. Remove your magazine, rack the slide 3-4 times and then proceed to disassemble. \n\nThis is literally in the instruction manual and takes virtually no firearms training to understand. But I don’t think he read the manual",
            "😫",
            "Man, someone said \"break a leg!\" His response was \"Hold my Glock!\" \n\nThe simple saying .... \"play stupid games, win stupid prizes,\" fits well here\n\n\n/s of course, but it's hard to feel sorry for blantant stupidity. Even a moron knows not to do that.",
            "You point a gun at yourself, you deserve every second of pain if it goes off! That is a cardinal, basic ass rule of handling a firearm. Right behind always treat it like its loaded.",
            "He def opened up the limit",
            "Cheddar bob irl",
            "That’s what you get punk!",
            "SMMFH…",
            "Karma",
            "Caught lacking.... common sense",
            "Why would you try and clean it with the magazine in can the slide even come off with it in I've never tried",
            "That was a quite gun shot",
            "Trailer Park Boy",
            "Ha!",
            "Forgot to do his ACTS and PROVE",
            "Darwin award of the week !",
            "He fucked around,  and found out.  Genuinely,  I hope he survived.",
            "Accent went away",
            "My leg started hurting watching this…",
            "What an idiot!",
            "“Walk along the razors edge…”",
            "Push it to the limit",
            "Darwinism at its finest",
            "bro pulled a cheddar bob lmao",
            "All along the razors edgeeeeee 🎶🎶🎶",
            "Americans and their guns, hilarious 😂",
            "#STOOPID",
            "The background music is perfect, makes this look like a scene from GTA Vice City.",
            "Wow! He shouted louder than the blast.",
            "What language is that? I thought it was the US that had trouble with idiots getting their hands on guns.",
            "Huh, what a silly thing to do for our entertainment.",
            "Continue? 9.. 8.. 7.. 6.. 5.. 4.. 3.. 2...    I'm sorry you are out of credits",
            "The song makes this unbelievably hilarious.",
            "At least bro got good taste in music.",
            "-100000 aura",
            "Someone needs to edit this into the “push it to the limit” scene in Scarface 🤣🤣🤣",
            "Love The Way he looks at the door thinking he hit that \nand then 😳🥺",
            "Fck around and find out...",
            "Man, I’m not joking when I say this… Glocks have their “safety” on the fucking trigger. Now I’m sure people will shred me for calling it a safety but seriously, it’s… on…. the…. Trigger… that being said, law enforcement and military, I DON’T WANT A SAFETY I HAVE TO TURN OFF. As a civilian, the benefits of a legitimate safety NOT ON THE TRIGGER outweigh the consequences. I have always felt this way and have not purchased Glocks specifically because of this.",
            "Press checks are dumb AF, and off the bat the way he is holding the gun to perform a press check is a very unsafe.  Also dude obviously has zero trigger discipline.\nHope he came out of this alive to learn his lesson. \n\nMany people have died of a 9mm leg shot and modern self defense ammo has gotten incredibly efficient at tissue damage.",
            "You not “real” unless you don’t care about him Safty!",
            "lol fuckin glocks , don't ya have to have the trigger depressed to pull the slide. dude didn't make it safe before trying to pull the slide. bet he'll remember next time.",
            "more qualified than biden",
            "Isn't that the newest gun *armorer* for Baldwin's latest movie?",
            "What language are they speaking?  This isn't English is it?  I'm so confused",
            "Gunshot hurt so much that he went from speaking gibberish to coherent English",
            "Someone turned friendly fire off.",
            "Human beings and guns dont mix\n\nEdit: Is there any evidence to the contrary? Not even the army or police can use guns ethically",
            "If it hit that artery, then yessssiree!",
            "Can’t forget about those femoral arteries",
            "gunshots, mostly fatal.",
            "Albert Sidney Johnston, probably the top Confederate General in the US Civil War before Lee came to prominence, was killed at the Battle of Shiloh from a gunshot wound to the leg. It hit his Popliteal artery by his knee.",
            "Yeah, big arteries in the leg.",
            "Hit one of my first deer with an arrow to the leg. I had no business hunting back then. Dropped dead in no time at all though. Artery was severed",
            "MC Cheddar Bob",
            "I got a buddy who was a victim of a shooting he wasn’t involved with, the round went through Both of his legs. He was in a wheelchair for a bit, now after 10+ years he can still walk",
            "Actually a time where the background music is kinda perfect 😆",
            "“Living on the razors edge” 😂🔫💥",
            "\"Whuss wronnng wi chedda baaab?\"\nFavorite line in the movie",
            "I hope the gun is doing okay too",
            "“There is no cure for stupidity, except death.” *~Sanjuro Kuwabatake*",
            "Nah, he will probably take it out on others.",
            "I'm enjoying the background song too. Reminds me of Scarface.",
            "The momentary frames of him clutching his leg, it’s like it was storyboarded. Dialogue too",
            "The sound he made 🤣",
            "Technically he did clear it… 😉",
            "Lol thats pretty good",
            "Honestly, looked like he put his finger in the trigger guard, but yes still left the gun hot.",
            "All these guys have Glocks too, the gun that famously has no safety. It's weird.",
            "Are we not doing phrasing?",
            "No diddy",
            "Yeah, but he probably messed up someone's seats in that car though.",
            "Actually the front right spinner…hubcap was also destroyed as a result of his neglegence",
            "It's only an 'absolutely horrendous design' for those too stupid to remove the magazine and clear the chamber first. Some 9 million of this 'absolutely horrendous design' have been produced to date, and only an infinitesimal number  by comparison of stupid handlers have managed to miss the first two disassembly steps.  For those, however, who understand the connection between 'trigger pull' and 'loud noise,' the necessary steps are obvious.",
            "That’s why you don’t point it at yourself. Even if you do have an accident the barrels not pointed at someone or something that will get hurt.",
            "If he's disassembling a Glock, he needs to learn how to do it properly and in order. \n\n1. Release the magazine \n2. Rack the slide to clear the chamber \n3. Point the glock in a safe direction to pull the trigger \n4. Remove slide for disassembly.",
            "Was he attempting a field stip? Kinda looks like he was trying to pull a fancy press check.",
            "I think this idiot was trying to pop the slide and didnt realize there was one in the pipe.",
            "> Glocks have their “safety” on the fucking trigger.\n\nGlocks do not have a manual safety anywhere, much less on the trigger.  There is a mechanism that blocks the firing pin unless the trigger has been pulled plus two other safety mechanisms--all function automatically, there is no need to turn them on and off.",
            "He was attempting to do a takedown on glocks it  requires pulling the trigger still beyond dumb taht he didn't check the chamber",
            "I’m pretty sure it’s just always been on",
            "In the infantry we are taught that there is no such thing as friendly fire.",
            "They always will mix. Take them away and they will just be reinvented.",
            "But sea slugs and guns on the other hand...",
            "Dude not even. If the bullet hit the bone it can ride the bone up or down the leg causing massive amounts of damage. God forbid it goes in the bone, then it can travel down the center destroying the bone marrow. Best case scenario is it's a through and through",
            "That’s true, the femoral arteries run medially after they bifurcate though and then end up behind your knee, close to the popliteal fossae. \n\nSo this guy probably hasn’t hit an artery directly. Mind you bullets tend to change direction and then track vessels when travelling at high speeds so it could end up being fatal here.\n\nIt looked like it was distal femur, I reckon it’s embedded in the bone if the bullet didn’t fragment.",
            "What I've learned with humans is that we're either 1 and done like Lee Harvey, where it hits everything in 1 shot - or tanks like Roy Benavidez where getting shot is more of a suggestion.",
            "Not true. Most gunshot wounds are not fatal.",
            "In a funny way, this is actually false - a single 9mm handgun round has low overall lethality, moreso if we were to imagine it hitting a limb. People can typically survive a single gunshot wound if given medical care, and sometimes even if not.q",
            "Big muscles too.",
            "Thoughts and prayers.",
            "That's a good quote.",
            "I wonder if that's because it's Scarface's theme song?",
            "I dunno if this is racially insensitive to point out, but when he switched from flexing for the gram mode to my life is in danger mode, all of a sudden his accent got a lot less thick lol",
            "He was trying to take the slide off, with Glocks you have to pull the trigger in order to take down the gun it can't be 'cocked'\n\n1. Make sure firearm pointed in a safe direction\n2. Release magazine\n3. Cycle chamber\n4. Keep finger off trigger, visually and physically inspect chamber to ensure there's nothing in it. \n5. Still pointed in safe direction? Ok to pull trigger and continue takedown of the firearm",
            "It’s a horrendous design because disassembly requires violating cardinal rule #3. \n\n“Keep your finger off the trigger until you’re on target and ready to fire”.\n\nPulling the trigger for a purpose other than firing a round just feels wrong.",
            "No you can see him try and pull the switches down to field strip",
            "Cops seems to have friendly fire turned on somehow",
            "When I taught rifle shooting in the army I was (almost) convinced that in every platoon there is at least one guy who is too stupid not to accidentally shoot anybody like this…",
            "Uh what?",
            "They can print them out now.",
            "[deleted]",
            "Yea I was just about to say that",
            "JFC .. that sounds like it’s going to cause ALOT more pain. \nBetter than dead ..  but yeah.",
            "Wouldn't the bullet just pass right through from that distance? Idk I've never had to deal with gunshot wounds before.",
            "mind explaining your jargons? you really shouldn't explain like that. most won't understand you.",
            "i think caliber is a huge factor as well",
            "You’re so right. It would be amazing if we taught our children how to stop bleeding in schools. Even if your country has no guns, that would save so many lives if children knew what to do when somebody was losing lots of blood. Or even just basic first aid would be excellent for children to learn, because most adults don’t even have this knowledge.",
            "But I thought that adrenaline protected us if we are shot anywhere that's not on the head?",
            "Roy Benavidez was definitely part terminator.......no normal human being could ever endure everything that he did.....I mean FFS the guy jumped out of a helicopter above the jungle canopy and crashed through the trees and limbs all the way to the ground in the middle of THOUSANDS of enemy troops. Then he took off running past them while being shot and shooting them and took one or 2 to the face and his eye was hanging out n he put it back in his head. Then he proceeded to rescue a bunch of American soldiers who were pinned down in the middle of a field by those thousands of enemy troops. He carried 3 or 4 of them to a area by the treeline that was somewhat out of the firing line and the chopper he jumped out of hung around and came down and he loaded up the dead and wounded soldiers and somehow managed to escape while his intestines amd guts were hanging out of him and one of his eyes too......I mean if ever someone ate the 1UP mushroom and decided that today was a good day NOT TO DIE, it was him......in my opinion the greatest soldier to ever live......bcuz AK rounds really do some damage.....I think he was shot a total of 23 times....when he got to the hospital they pronounced him dead and when they were zipping up the body bag, he said NOT TODAY and sat the fuck up n nearly gave the dr a heart attack.....the man was simply on a totally different level.......they don't make em like that anymore.......can you imagine if there were 2 of him???? My god!!!!!!",
            "Statistically you are almost twice as likely to survive being shot multiple times than once. It could be that a single shot is more likely to be well aimed whereas multiple shots are not, or it could be that the shock response is stronger with multiple shots causing more blood constriction and keeping you alive long enough to get medical attention (the paper I read didn't offer a definitive explanation and I'm sure there are various explanations on a case by cases basis).",
            "It's the bleeding that gets them.",
            "That's not my leg.",
            "If that is the case, you're going to have trouble with a substantial number of bolt-action disassembly procedures. MILLIONS and MILLIONS of bolt-action rifles require a trigger pull to complete bolt removal-after opening the bolt, for the same reason as one removes the magazine and checks the chamber of a Glock.",
            "I like the phrase \"keep your booger retrieval device away from the boom switch!\"",
            "They see everyone else at the enemy.  It's only friendly fire to them when one cop shoots another.",
            "Lol, I believe you.",
            "There's nothing friendly about it. When you get shot it really does not matter who shot you, either way you end up with a hole in you. It's said to remind folks to stay in their own lane when moving in a firefight.",
            "Because it's a very common myth, like how a .22 is more deadly because it pinballs inside your head. Bullets go in a straight line, they don't \"ride\" bone. They either bounce off or go through, usually the latter.",
            "😂😂😂😂😂😂",
            "Really took the words right outta your mouth eh",
            "It really depends on bullet type/ composition, load, angle, caliber and if it hits a bone. I guess the answer is probably, but it's not certain if this is a 9mm.",
            "BANG BANG make leg go BLEED BLEED.",
            "[deleted]",
            "Roy was in Nam.. he was shot multiple times with 7.62×39. Lee got one tapped by a .38...",
            "It's situational. From what I've been told, a .22 placed right behind the ear is incredibly deadly and leaves a drop or two of blood. Very little evidence to clean up. ",
            "I've taken cpr twice, more than basic first aid once (some level above basic but not much).\n\nI've never once had to use it. I've worked construction my whole life. The worst thing I've ever seen is a broken leg from falling from a THREE FOOT LADDER. We just made him as comfortable as possible,had him sit there, and kept an eye on him until the ambulance came.\n\nKnock on wood that I don't ever need my skills because practice makes perfect and I have zero practice. \n\nI'm good with bandaids and sometimes duct tape, and I did hurt myself while alone in the back country and patched myself up enough to get back to the road, but that was mostly improvisation.",
            "That’s my elbow",
            "If only Pat Tillman had stayed in his own lane, he'd be with us here today smdh",
            "556 spins though right?",
            "[deleted]",
            "I did not say that to offend anyone. idk why you're so pressed. the guy is explaining something to a public forum with lots of people not under any medical field. if his goal is to educate, why not make it easy to understand?\n\nI'm sorry if my inquiry offended you for whatever reason.",
            "just a lil tap from a .38",
            "Not try to be \"that guy\" but effective range matters too. If the shots came from further than 300 yds with a 7.62 it's a lot less likely to be fatal. I'm saying that knowing nothing of his story.",
            "Even with good training, most of the time the best response is just to call 911. I'm medically trained, did 2 years internship in the ER before switching to psych, and I still find it funny how useless I am in many situations. Playing softball with my wife's squadron, a guy caught his cleat on a rut while sliding into home. I was standing close enough to hear the ACL pop, and they called for anyone medical. I ran onto the field, looked at him, and said \"Yup, he's hurt. Unless anyone here has some fentanyl or morphine on hand, not much to do until the EMS get here.\" It's like they were expecting me to do medical magic and unfuck his knee, but.... yeah. Training is useless without equipment. That's why I have a tourniquet and an Israeli bandage in my bag that I carry most of the time.",
            "That's my purse. I don't know you!",
            "Everything but shotguns and very very VERY old guns are rifled and spin. (Not trying to sound like an ass just thinking more) If you mean tumble? Then they both generally tumble as well, but a 5.56/.223 is a much longer bullet going much faster so the tumbling causes soooo much more damage and cavitation.",
            "Very bullet dependant. I think the only thing that would just stop would be a .22 because there is no copper jacket. Most everything else would bounce or deflect to some degree or another.",
            "I'm not saying bullets aren't bullets. I'm just saying I would rather take my chances with a .38 over an AK blasting my goofy ass multiple times.",
            "(Edit) I completely agree. A contact gunshot wound is waaay worse than overall getting shot.\n\nIt's a Wikipedia article, so take that how you will. Dude took over 37 hits. Bullets, bayonets, and explosive shrapnel. He's a Medal of Honor recipient for his service in 68. Dude was literally the Juggernaut lol. \n\nhttps://en.m.wikipedia.org/wiki/Roy_Benavidez#:~:text=Benavidez%20had%20a%20total%20of,Center%2C%20where%20he%20eventually%20recovered.",
            "What's an Israeli bandage?",
            "I always heard that FMJ will tumble.",
            "[deleted]",
            "Wow. Crazy how he didn't almost get the MoH and then got the assist at the 11th hour. Thanks for the link, great story. We learned about all our USMC MoH winners in boot camp but not other branches.",
            "I think they don't call them that anymore, but it's a gauze bandage that has medication in it that helps clotting, to stop bleeds faster. Commonly used in IFAKs (Individual First Aid Kits) that attach to body armor for military. I also carry packing gauze and an Ace wrap, which is more useful 90% of the time than an Israeli bandage or Quik-Clot.",
            "Everything tumbles. Hollow points tumble, hard cast tumbles, ftx hollow points tumble, segmenting ammo segments then tumbles. It's really hard to push any straight through flesh at high speeds. \n\nMaybe a cannon ball or an APDS tank round won't tumble, but that's about it.",
            "Absolutely! Kinetic energy is measured as a square of velocity. KE=(1/2) mv^2 . So a .45 acp while being double the diameter and weighing 3-4 times as much as a 5.56mm, is moving at less than half the speed. So the wound would be much less traumatic with a .45 mainly cause of the cavitation. Shot placement plays a huge role as well, but from the same distance, I would much rather be shot with a .45.",
            "My favorite part of Roy's story is that you can read his story and go \"oh shit,\" then you see what he looks like and you immediately go \"Oh, that makes sense\"  lol. Dude looks like the kinda guy to get shot and still kick your ass."
        ]
    }
}