{
    "⚠️ READ FIRST BEFORE POSTING ⚠️": {
        "title": "⚠️ READ FIRST BEFORE POSTING ⚠️",
        "score": 117,
        "url": "https://www.reddit.com/r/CreditCards/comments/14w92cc/read_first_before_posting/",
        "content": "Hello and welcome to r/CreditCards[!](https://imgur.com/FbKfcoH)\n\nI highly encourage you to [review them here](https://www.reddit.com/r/CreditCards/about/rules) (or below) before posting.\n\n___\n\n# Official Rules of r/CreditCards\n\n### Rule 1: Be respectful\n\nAll users are expected to engage in respectful and civil communication, and refrain from harassing or insulting others. Any form of hate speech, including but not limited to racism, sexism, homophobia, transphobia, or any derogatory language targeting an individual or group, is not allowed.\n\n### Rule 2: No referrals in posts, comments, or private messages\n\nAll users are prohibited from disseminating referral links through posts, comments, and private messages. Any deceptive behavior aimed at exploiting referral links for personal gain is also a punishable offense.\n\n### Rule 3: No link shorteners\n\nAll users are prohibited from using link shorteners, e.g., tinyurl, etc.\n\n>*Link shorteners refer to services or tools that condense long URLs into shorter, more manageable links. They can hinder transparency by concealing the actual destination of a link, therefore they pose potential risks to the community. These are examples:* [*bit.ly/3JMIUCz*](https://bit.ly/3JMIUCz)*,* [*tinyurl.com/2zrnmkzf*](https://tinyurl.com/2zrnmkzf)\n\n### Rule 4: No self-promotional content\n\nAll users are prohibited from posting any self-promotional content.\n\nSelf-promotional content includes but is not limited to:\n\n* Articles/Journalist websites.\n* Interviews/Surveys (not including reddit polls).\n* Apps, Webpages, and other self-developed tools.\n\n### Rule 5: No irrelevant content or spam allowed\n\nAll users are prohibited from posting irrelevant content that does not pertain to the subject of credit cards. This includes spam, which refers to unsolicited or repetitive content that is intended to promote or advertise products, services, or websites.\n\nIrrelevant content includes but is not limited to:\n\n* Auto Loans, Mortgages, and other non-Credit Card Loans\n\n* Debit Cards\n\n* Gift Cards and Prepaid Cards\n\n* Bank Accounts\n\n* Financial Products that are not Credit Cards\n\n### Rule 6: No promotion of illegal, fraudulent, or nefarious activities\n\nAll users are prohibited from posting content that promotes illegal, fraudulent, or nefarious activities.\n\n**Any posts or comments that violates any of these rules are subject to removal. The offending user may be subject to warnings, temporary bans, or permanent bans, depending on the severity and frequency of the violations. Ignorance is a not valid reason to break the rules.**\n\n___\n\n# Unspoken Rules of r/CreditCards\n\nWhile you may not be banned for breaking the unspoken rules, we **highly** suggest you follow them to make everyone's lives easier.\n\n### A. Looking for your first card? [Read this first.](https://www.reddit.com/r/CreditCards/comments/9r5h2y/looking_to_get_your_first_a_new_credit_card_read/)\n\n### B. Use this for credit card recommendations\n\nPlease use the following template so that everyone can make appropriate recommendations:\n\n* Current cards: (list cards, limits, opening date)\n   * *e.g. Amex BCP $8,000 limit, May 2019*\n   * *e.g. Chase Freedom Flex $10,000 limit, June 2021*\n* FICO Score: *e.g. 750*\n* Oldest account age: *e.g. 5 years 6 months*\n* Chase 5/24 status: *e.g 2/24*\n* Income: *e.g. $80,000*\n* Average monthly spend and categories:\n   * dining $800\n   * groceries: $400\n   * gas: $100\n   * travel: $100\n   * other: $30\n* Open to Business Cards: *e.g. No*\n* What's the purpose of your next card? *e.g. Building credit, Balance transfer, Travel, Cashback*\n* Do you have any cards you've been looking at? *e.g. Chase Freedom Unlimited*\n* Are you OK with category spending or do you want a general spending card?\n\n**Remember to use the correct post flair:** ***Card Recommendation Requested (Template Used)***\n\n### C. Review the basics of credit cards before posting\n\nHere are some resources to get you started:\n\nSubreddit Wikis:\n\n* [r/CreditCards Wiki - Index](https://www.reddit.com/r/CreditCards/wiki/index/)\n* [r/CreditCards Wiki - Credit Card Basics](https://www.reddit.com/r/CreditCards/wiki/credit_cards_basics/)\n* [r/PersonalFinance Wiki - Credit & Debit Cards](https://www.reddit.com/r/personalfinance/wiki/creditcards/)\n\n**Many questions can easily be answered with a quick google search.  We encourage you to take a moment to do your own research. It helps you gain a deeper understanding, sparks better discussions, and promotes self-sufficiency.**\n\n### D. Familiarize yourself with common abbreviations and lingo\n\n|Term|Definition|\n|:-|:-|\n|1/5 AmEx rule|A rule where you can only get approved for 1 AmEx card every 5 days|\n|2/90 AmEx rule|A rule where you can only get approved for 2 AmEx cards in 90 days|\n|AmEx Pop Up Jail|A pop up message informing you that you're not eligible for an AmEx card welcome offer. [See this wiki article for more information.](https://www.reddit.com/r/CreditCards/wiki/american_express_pop_up_jail/)|\n|5/24 Chase rule|A rule where if you've opened 5 or more accounts in the past 24 months you cannot get approved for a new Chase card. [See this wiki article for more information.](https://www.reddit.com/r/CreditCards/wiki/chase_5-24_rule/)|\n|AAoA|Average age of all of your accounts.|\n|AF|Annual Fee|\n|AU|Authorized User|\n|BT|Balance Transfer|\n|CLI|Credit Limit Increase|\n|FTF|Foreign Transaction Fee|\n|FICO Score|The **industry standard** credit score used by 90% of credit issuers - it can be found at [MyFICO.com](https://MyFICO.com), [Experian.com](https://Experian.com), [CreditScoreCard.com](https://CreditScoreCard.com). This is **NOT** the score given by Credit Karma, Credit Sesame, Capital One, etc.|\n|MSR|Minimum Spending Requirement (usually referring to sign-up bonuses)|\n|PC|Product Change (i.e. upgrade)|\n|SUB|Sign-Up Bonus|\n|VantageScore|An **unreliable** credit score created by the 3 major credit bureaus to compete with FICO score. It is only used by a handful of credit issuers such as Synchrony and Golden 1 Credit Union.|\n\n___\n\n# Other important announcements:\n\n* ### [Official User Flairs Thread - learn how to customize your user flair here](https://www.reddit.com/r/CreditCards/comments/14pt05t/official_user_flairs_thread/)\n\n* ### [Suggestions, Ideas, and Feedback - post your suggestions here](https://www.reddit.com/r/CreditCards/comments/14zqp6c/suggestions_ideas_and_feedback/)",
        "num_comments": 69,
        "comments": [
            "I just got Manning Faced and Rick Rolled in the span of 3 seconds",
            "Heed Rule 1 whichever mods told us to check our entitlement.",
            "Thank you for this reminder. So many posts of card recommendations with 0 info. Like just copy and paste the template and fill out the few prompts. It's not that hard and you're not going to get a good recommendation off of little info.",
            "Thanks for this. I would note that VantageScore ***is*** used by a small number of lenders. Notably, Synchrony Bank uses VS4, and, if I recall correctly, so does Golden 1 CU in California.",
            "Still looking for the username of the mod that told the entirety of this sub to check their privilege. \nAbsolute coward that this mod still won't admit fault.",
            "1. I’m happy to narc, but the report button still shows the old rule list. Should I report under one of the non-applicable rules or skip reporting?\n\n2. For your consideration: I’d suggest locking threads that get a lot of traction and pinning one of the knowledgeable comments to the top.",
            "[deleted]",
            "Testing to see if my flairs worked please ignore",
            "Does anybody know how to get a post accepted? I tried making a post but it said \"awaiting approval from moderators\". 5 days later and still awaiting approval. who do i message? does it usually take this long?",
            "What does it mean when it says \"canceled by credit grantor\"  on credit karma on one of my credit cards that I had stopped paying?",
            "Hi I am new to Reddit how do I message modd approval for self promotion? I am a Loan Underwriter which will give the group continuous growth and fresh perspective for credit card advice.",
            "Rule 6 is interesting because it seems posts seeking advice on not paying debt and getting away with it are being taken down. May I remind you, not paying debts is not something that is illegal, fraudulent or nefarious. If they were, credit repair companies would not exist lol.\n\nSo definitely something more going on.",
            "Why is my MyFICO score different from Experian? Shouldn't FICO scores be universal?",
            "How do I apply chase Instacart credit points to online sites like Amazon?",
            "I don't really think my question warrants a full post so here goes. Hopefully someone lurking sees it.   \n\n\nI currently have a corporate Amex. I'm wondering if it's a good idea to get a Chase Business card and use it in the same role. It wouldn't be through my company, but it would allow me to take clients out and book hotels in an ecosystem I am currently in vs not being able to really use the Amex points. I have the CFU and CFP (and the Venture X but that's my personal catch-all card).",
            "Hi",
            "My post hasn’t been approved yet. I will appreciate the help thanks",
            "Testing",
            "[removed]",
            "I have two offers: 1) Amex platinum 125,000 membership points after $8,000 spent in 6 months \n2) venture x 90,000 bonus miles after spending $4,000 in first 3 months. \n\nAnyone have any advice?",
            "[removed]",
            "Real question is how does everyone put their specific cards as their flair?!",
            "What does “Chase 5/24 status” mean ??  I see similar #/# references in the subreddit with no explanation.",
            "[deleted]",
            "Congratulations, you have earned the privilege to use the following user flair for 1 week\n\n\"🤦 i clicked on a shortened link and got rick rolled 🤦\"\n\nThis user flair is unique and can't be used by anyone else.",
            "I was very tempted to click but I remembered that this is the Internet. Thank you for your service 🫡",
            "Thank you! I updated the table to reflect this",
            "1. Thanks for bringing this to my attention. The report reasons should be fixed now. You should pick the reason that best fits. I may add another report reason: \"Other\" for submissions that are questionable and require the attention of the mod team.\n\n2. Although I would love to do that, due to the sheer number of comments being posted, it's difficult to read every thread and decide which comments are worthy of pinning. I figured it'd be best to let the community decide with their upvotes and downvotes. Personally I believe pinning is warranted in urgent circumstances, however I will make exceptions for extraordinary high-quality comments that bring value to the community (if I happen to come across them). Locking will be reserved for threads that break rules or start becoming uncivil. \n\nThank you for your suggestions!",
            "Ding ding ding! We got a winner!",
            "Looks good to me!",
            "Hey, sometimes we can't get to every pending post. Please post it again, I will make sure it is approved.",
            "You’re more likely to get an answer if you post in the weekly lounge thread",
            "Your submission violated rule 5 which states:\n\n\"All users are prohibited from posting irrelevant content that does not pertain to the subject of credit cards. This includes spam, which refers to unsolicited or repetitive content that is intended to promote or advertise products, services, or websites.\"\n\nAs a result, your submission has been deemed inappropriate and removed.",
            "Your submission violated rule 5 which states:\n\n\"All users are prohibited from posting irrelevant content that does not pertain to the subject of credit cards. This includes spam, which refers to unsolicited or repetitive content that is intended to promote or advertise products, services, or websites.\n\nIrrelevant content includes but is not limited to:\n\n- Auto Loans, Mortgages, and other non-Credit Card Loans\n\n- Debit Cards\n\n- Gift Cards and Prepaid Cards\n\n- Bank Accounts\n\n- Financial Products that are not Credit Cards\"\n\nAs a result, your submission has been deemed inappropriate and removed.",
            "https://www.reddit.com/r/CreditCards/comments/14pt05t/official\\_user\\_flairs\\_thread/",
            "**Here's some info on utilization and its impact on credit score:**\n\nIgnore the 10/20/30 utilization %. It’s only applicable when you need to apply for a new line of credit, 1-2 months out.\n\nUtilization is suppose to fluctuate, can be easily manipulated, and holds no memory. It doesn’t build credit--think of it as a finishing touch when you need to optimize your score.\n\nFeel free to safely and organically use 100% of your credit limit within a month and let whatever utilization report, provided you pay off your statement balance in full before due date. Every month. Every time.\n\nFor more info, please read this post: \n* [Putting the \"30% rule\" myth regarding revolving utilization to rest](https://www.reddit.com/r/CreditCards/comments/12s5fyf/putting_the_30_rule_myth_regarding_revolving/)\n* [Credit Card Basics - Utilization](https://www.reddit.com/r/CreditCards/wiki/credit_cards_basics/#wiki_utilization)\n\nI can be summoned to comment by using command(s):\n\n`!utilization`\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CreditCards) if you have any questions or concerns.*",
            "Mom, get the camera!",
            "Same to me!",
            "Re: Pinning a comment\n\nI should have linked the specific thread, but now I can't find it. When I see this happen again I'll ping you if that's ok?\n\nIt was a post that got quite a bit of comments. u/BrutalBodyShots and a few others had contributed helpful and accurate information but their comments were buried in a sea of nonsense. \n\nMy thought being that if any lurker happened to click, it could be helpful to have one accurate/helpful comment pinned at the top.",
            "Hello i need help with my post being approved",
            "Sorry one user only :(",
            "Feel free to send me a DM when you find it",
            "Hummmm, you've got me thinking now as to which thread you're referring to...",
            "I found the thread that made me think about pinning a solid comment to the top of the thread: I found the thread that made me think about the value of maybe pinning a comment: https://www.reddit.com/r/CreditCards/comments/14xfrwx/are_banks_purposely_restricting_credit_limits_and/",
            "I'll look for at again later today. \n\nIf I can't find it I'll ping you both when I see another one, where there's a ton of noise that buries the accurate/helpful comments.",
            "Stickied the comment",
            "Sounds good!",
            "This is your comment that I thought should be pinned to the top of that thread: https://www.reddit.com/r/CreditCards/comments/14xfrwx/are_banks_purposely_restricting_credit_limits_and/jro1g55/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1&context=3",
            "Ah yes, gotcha.  I do think you make a good point regarding the productivity of posts and their positioning within threads.  While I agree that up votes are a good measure to go by in practice, they are by default going to happen more to earlier replies in a thread.  If the most productive comment comes (say) a day late and is buried below 20 other replies, the chances of it receiving the exposure and up vote potential that the first 4-5 replies received is much lower.  Good replies can definitely get lost in the sauce, no doubt."
        ]
    },
    "Weekly Lounge Thread - Week of June 16, 2024": {
        "title": "Weekly Lounge Thread - Week of June 16, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/CreditCards/comments/1dh55f2/weekly_lounge_thread_week_of_june_16_2024/",
        "content": "This thread is meant for casual and/or off-topic discussions. It's also for simple questions or discussion topics you feel aren't worthy of their own post.\n\n&#x200B;\n___\n\n### Please read the [rules](https://www.reddit.com/r/creditcards/about/rules) before posting.\n\n#### 1. Be respectful.\n\n#### 2. No referrals in posts, comments, or private messages.\n\n#### 3. No link shorteners.\n\n#### 4. No self-promotional content without prior mod approval.\n\n#### 5. No irrelevant content or spam allowed.\n\n#### 6. No promotion of illegal, fraudulent, or nefarious activities.",
        "num_comments": 77,
        "comments": [
            "Will this be the week we find out what Walmart replaces the Capital One Walmart card with?  Hopefully....",
            "You can now link your Starbucks and Marriott accounts to earn a few extra points for hotel stays and coffee.\n\nhttps://stories.starbucks.com/press/2024/new-starbucks-rewards-and-marriott-bonvoy-relationship-unlocks-exclusive-benefits-for-loyalty-members-to-fulfill-their-passions-for-travel-and-coffee/",
            "Does anyone know a good credit card that will limit the amount an authorized user can spend?",
            "Forever I've been alternating between two cards: AMEX Gold and Southwest Visa with little to no attention to details on spending on each one, just using each one for half the month so I get some MR and Southwest miles. But as I've delved in to this more, I feel like I'm missing out on points left and right. While I'm not interested in churning, I'm looking to maximize point gain with cards. So I was thinking this setup:   \n\n\n\nDining and Groceries: AMEX Gold  \n\nAll in Person Purchases: USB Altitude Reserve Infinite (utilizing mobile wallet for effective 4.5% return)  \n\nTravel and perks: AMEX Platinum   \n\nAmazon Purchases: Prime Visa  \n\nOnline spend and in person non-mobile wallet: Southwest Visa   \n\n\n\nAnything I'm missing / not thinking of? For reference, I live in Denver so major Southwest hub and I travel at least once a month on average. Credit score is about 815. Travel internationally about once a year.    Thanks for any guidance!",
            "Credit Karma is \"showing offers based on my credit profile\". I see CHASE PREFERRED card, does that mean I'm off their blacklist? I burned them 8+ years ago. I don't want to waste a Hard Inquiry so please advise\n\nCredit Score 806",
            "I got the Chase Freedom Flex last month. Now the offer is 5% cash back on all grocery for a year. Is there any way for me to get that offer?",
            "Can someone eli5 the BILT card value? I know you pay rent with it, but what rewards does it provide? \n\nI live in a HCOL area and my rent is $2.5k. However, I basically only use the chase trifecta and am unsure if signing up for the BILT is worth it?",
            "Do USB Cash+ category selections roll over between quarters? It currently says you can \"modify\" for the next quarter, so I assume if you don't do anything then the current quarter selections carry over?",
            "Any insight as to why when using Apple Pay, CFF transactions show up as pending and no amount next to it? CFU and CSR both show the transaction amounts..\n\nIrritating when tracking expenses",
            "That’s a good line up. If you can keep your mind straight with it then Do it 😂",
            "[deleted]",
            "does anyone know if you can double dip with the VX travel credits?\n\nmy annual is hitting soon, and now the venture x portal applies credits instantly from what I see.\n\ncan I:\n\n -Book travel using the new years credit (i used up my 2023 travel credit, and now I see it’s been replenished on the portal)\n- wait for AF to post\n- downgrade",
            "CLI and closing account.\n\nI’m going to close one of my line to reduce duplicate and  consolidate, while doing this I would like to get CLI on my other credit lines.\n\nI don’t particularly care about fico score as I already got the mortgage I need and already in 820+ range, closing this credit line is negligible to utilization as the other lines limit are high and this is relatively recent line so it won’t impact AAoA.\n\nWhat order of operation do you recommend doing this? My logic order is this:  close the account, let it post to CRA and request CLI. My thinking is that there will be less available credit so the banks would be more incline to extend credit as opposed to CLI first then close the other account. What do you guys think?",
            "Is the Autograph card not eligible for Wells Fargo Deals? Not seeing it. Is Deals only for Active Cash?",
            "Is the PayPal card still worth getting just for the 3% if you constantly use PayPal for purchases despite them nerfing the 2% catch all to 1.5%?",
            "Is the Apple Card worth it if I’m looking into buying a refurbished iPhone through the Apple site? I was offered a 10k limit on top of my current 35k from the 3 cards I already have. I use Apple Pay a lot and I could see this possibly taking the place of my current online shopping 1% back card. I also worry that 4 cards is starting to be a lot to mentally juggle for what goes where.",
            "I just got the CSP on June 15th making me 4/24. I will be 3/24 in February 2025. How long should I wait before opening my first Ink to start the SUB game with those?",
            "In the complicated world of Marriott card eligibility rules, if you have the Bonvoy Business Card are you able to open Chase Marriott cards without the SUB or are you not able to open Chase Marriott cards at all?",
            "The Verizon card seems pretty insane for watcha get. $150 credit, 4% grocery and gas and 2%  on bill. Then would use citi custom for 5% restaurants.",
            "Do timeshare annual fees count as travel for Venture X or CSP?",
            "Should I try calling us bank to get a $1.05 foreign transaction fee removed from my statement?\n\nI bought some washing accessories from Arcteryx, which is quoted in USD, and I thought they were a big enough company, but apparently they are still only considered canadian or something, and I ended up getting a fee.\n\n  \ni honestly never thought that would even be possible. I assumed FTF would be a thing for foreign currency transactions, or actually physically being in a different country.",
            "Chase Pre-Approval\n\nIf you're pre-approved, is there ever an error? I ask because I was blacklisted 8-10+ years ago and now I see all the cards available. Do not want a hard inquiry if I'm not sure. \n\nAlso, will branch give me better SUB? I want the Preferred",
            "In general, If you are denied for a card that has an increased SUB, and then by the time the SUB expires you are approved through recon, do you still get that elevated SUB?",
            "I want to get a beginner level chase travel card, but I see the sign up bonuses have just expired, worth waiting for the next promo? Or should I just go ahead and buy now.",
            "Student card verification:\n\nApplied for CFR student yesterday. Stupidly used personal email instead of student email. Trouble is, they sent a verification docusign link and I don't yet have a schedule or transcript etc. because the year hasn't started and neither has class scheduling. Can i call to change the email and would that verify my student enrollment? Can I use an acceptance letter? Or confirmation of enrollment deposit type letter? Any thoughts?\n\nThanks",
            "I've had Chase freedom unlimited throughout college. Started new job and got savorone. Feel free to correct me, but to my understanding it seems like a good idea to just get the cards that I find useful now and to let them age so that my score is good later. Is there a recommended minimum time between getting cards that I should follow? Currently looking at bilt, amazon prime, venture x, and maybe citi custom cash. I know that venture x won't let me for a while since I just got savorone. Score is currently 744",
            "does anyone know if you can double dip with the VX travel credits?\n\nmy annual is hitting soon, and now the venture x portal applies credits instantly from what I see.\n\ncan I:\n\n-Book travel using the new years credit (i used up my 2023 travel credit, and now I see it’s been replenished on the portal)\n\n•\t⁠wait for AF to post\n•\t⁠downgrade\n\nthanks!",
            "In lockdown on personal cards and need a new business card with a spend of $4k or less to get the bonus. It needs to be a card outside of Chase and US Bank and cannot AMEX Blue or Gold or BoA Business Travel.",
            "AMEX Gold Card, Platinum, BCE, BCP \n\nCan always call to confirm if other cards within AMEX allow this.\n\n\"You can set a limit as low as $200 for the Additional Card Member. You can also allow the Additional Card Member to access your full credit limit.\" - [SOURCE](https://www.americanexpress.com/en-us/support/additional-card-member/faqs/)\n\n  \nAdditionally, most business cards allow you to set a spending limit. For example I can set a limit on my Chase Ink Preferred.",
            "Southwest isn't a good card to earn SW miles. Are you using the spending to hit Companion pass? Otherwise you can substitute with Chase UR cards (CSP/CFF/CFU/CIP/CIC/CIU).\n\nPlat is a coupon book and lounge voucher. Value depends on whether you can use the coupons and not on the earn rate.\n\nDoes Amazon warrant its own card? Can you use Apple Pay on Amazon?",
            "No. CK knows nothing about you and Chase. Even Chase may not know about it immediately. They may approve the card and close it a few weeks later. Common bank stuff.",
            "I have never seen a DP of them matching this kind of offer, but I guess there’s really nothing to lose by sending them a secure message asking",
            "I use Bilt for points on HOA fees and dining out (3x). You need to have five charges per month to get the point on rent and HOA fees. It is worth it to me.",
            "BILT has Hyatt and United as partners. Look at their transfer partners for cpp",
            "Rent is the primary one.  Their 3x Dining is competitive every day.  They double earnings on the 1st of every month making it a 6x Dining, 4x Travel, 2x Catch-All for one day.  Not super-convenient but viable for reoccurring expenses and ones you can control (i.e. I plan on buying my plane tickets on July 1st).  If you have local restaurants in the BILT Dining portal you can even earn BILT points while not even using the card.  The dining network is still somewhat limited though.",
            "The wording is misleading. They don’t roll over. You have to select each quarter.",
            "I just got the Amex gold with 90k for 6k/6months Id look around for extra points.",
            "You want to apply for six new cards at once? Three of them with Wells Fargo? I don't know if that's possible though I'd be interested to see how it works out for you. \n\n\nYou should prioritize chase if you really want the FF because of 5/24, and probably leave Amex for last. For the three WF cards, consider that the attune may have a higher minimum starting limit and stricter UW, so you may need to apply earlier in the process for that one. And also consider prioritizing based on your spend - how much are you spending on rent/groceries/golf/etc, and which card is more important to you to get (since you probably will not be able to get all six at once, and are less likely to be approved for two Wells Fargo cards within six months and the bilt makes 3). Consider also that chase may shut down your account entirely when their monthly reviews show 6 new accounts opened back to back - it has happened before. Tbh I'd nix chase entirely, though you'll be locked out of all their cards for two years since you'll be at 5/24 anyway. If you're just using the attune for golf only, I wouldn't prioritize that one tbh. \n\n\nI think you should pick one or two that make the most sense based on your spend and long term goals, and not based on churning SUBs. If you want to churn subs, the churning sub is a better place to learn about that. Looking at the long term, your strategy doesn't make a ton of sense, and doesn't seem well thought out. ",
            "VX is by account anniversary, not calendar year. You an wait for your AF to post, spend the credit, then downgrade.",
            "Don’t think it matters either way. If both cards are from the same bank, you might be able to shift the credit limit from the card you’re closing to the other card.",
            "As long as your utilization does not materially change after closing the card, closing then CLI is better because the bank will consider you to have more \"room\" for credit line compared to your income.",
            "It's available on mine. I guess it's just a small bug. I've also used it for a Disney+ offer and it worked. I think if you activate it in the Active Cash page it goes for everything",
            "My wife only has the Autograph and there are deals present for her and we've used them a couple times.  Might some sort of bug, you could try reaching out to customer service if they don't eventually show up.",
            "Yes, but beware of Synchrony.  Amex BCE is an alternative for online purchases, if you'd rather try that.  I have both--Synchrony hasn't (yet) given me trouble, and one online purchase (getting a virtual item) didn't get 3% on the BCE.",
            "it could be a good general catch all 2% cash back but if you already have other cards that give you 2% CB, don’t get it.\nSet up autopay & no micro manage, 4 cards are easy.",
            "30 days between business and personal. 95 days between 2 business.",
            "It’s usually recommended to wait 3 months between Chase cards.",
            "~~Business cards should be separate from personal card. You should be able to open and get the SUB. With Chase if they let you open you're eligible. If you're not eligible they will not approve the application.~~",
            "It's a really good deal if you are already using Verizon.  It also codes Walmart as grocery, so unlimited 4% there as well.",
            " [\"My Chase Sapphire Reserve treats MF's as travel and earns 3x points\" ](https://tugbbs.com/forums/threads/credit-card-category-for-maintenance-fees-amex-visa.347375/post-2880488)",
            "You could try asking for a one-time courtesy, but I wouldn’t bother for that amount",
            "Pre-approvals are basically marketing, so you may or may not still be blacklisted",
            "I've had good luck with chase pre-approvals. But again they're not binding agreements so it's always just not good enough to make any decision off of.",
            "Yes. You get the SUB for which you applied, regardless of when approval happens",
            "You can check USCreditCardGuide.com for historical data to see how often we get elevated bonuses.",
            "I would wait at least 3 months between applications.",
            "[Citi American Airlines Business World Elite](https://www.citi.com/credit-cards/citibusiness-aadvantage-platinum-select-credit-card?category=business-credit-cards&intc=citihpmenu~creditcards~smallbus&afc=1A5)?  65k miles after $4k spend in 4 months.  Those reqs don't leave a whole lot of other options.",
            "I really appreciate this. This is for someone traveling to Europe for a few months, so AMEX isn't the best option, but seriously, thank you for the info.",
            "Unfortunately I'm in the Google ecosystem as opposed to Apple so the USB card doesn't work for online mobile wallet transactions, hence the Amazon card, but if there is a better catchall online shopping card I'm all ears.\n\n\nAs for Southwest, hitting the companion pass has happened before but not every year. And with the approach I'd be taking here, I doubt I'd hit it again. Of the other chase cards which has the best base multiple?\n\nAnd the Platinum card is as you said mostly for lounge access and other perks, but I worked out the math on the credits and it works for how we spend, so that's one isn't bad for me.",
            "I’ll send one and try",
            "How many total points do you earn a year?",
            "Ah gotcha. Thanks.",
            "I see $300 credit in my account before the af posted though?",
            "It makes sense with more room to grow on closing then CLI. The card to be close is the one with the lowest limit and I charge about $1k/mo, it won’t significantly impact the utilization since my other cards are more than double limit that this card offers.",
            "Weird. Thanks. Still waiting for my card to arrive, so maybe it takes time to appear.",
            "thanks, never heard the 30 day wait before for the personal to business",
            ">With Chase if they let you open you're eligible. If you're not eligible they will not approve the application.\n\nWhile this is generally true, in the case of the Marriott cards, Chase will show a pop-up when applying if you're not eligible for the SUB. And [since last week](https://www.reddit.com/r/ChaseSapphire/comments/1dgrl7v/late_post_sapphire_approval_when_failing_524_and/), it also appears that you can get Freedom and Sapphire cards without the SUB as well.",
            "I appreciate the reply but I dont think thats true. [Frequent Miler](https://frequentmiler.com/marriott-card-eligible/) has a great article detailing when youre ineligble for SUB and you’re def ineligble for a SUB on any Chase card when you have any Amex card. \n\nWhat I need clarity on is will they deny you a card completely or are you just inelgible for SUB if I have an Amex Marriott card and want a Chase Marriott card",
            "Wow. Thats actually wild. I definitely will be choosing that card next over bilt",
            "Ty \n\nI was leaning towards that as well. It’s a tiny amount. Still annoying ",
            "Thanks",
            "Oops... forgot that I have that one. Another suggestion?",
            "About 30k on the Bilt card. They have also offered some kick-ass transfer deals in the past. I was able to transfer points to Virgin Atlantic with a 75% bonus. I am not a fan of Wells Fargo, but I will put up with them to get points on my HOA fees.",
            "Is this after your anniversary? If they let you have the credit then feel free to spend it. You can still downgrade later.",
            "Didn't realize this is so complicated. Don't know. Sorry. \n\nYou can see CreditDogo's post (replying to my original post).",
            "You can check Amex’s cobranded biz cards (Delta, Hilton, Marriott). The MSRs start at $6k, but you have 6 months to meet it, so they may work for you.",
            "Oh very nice! I might need to get it. My rent is $2.4k a month so I think it may be worth it",
            "Thank you! This confirms you can still get the Ritz card eventually even if you start with Marriott cards. You’ll just miss out on atleast one SUB from a Chase card"
        ]
    },
    "Credit cards are like Pokémon ": {
        "title": "Credit cards are like Pokémon ",
        "score": 120,
        "url": "https://www.reddit.com/r/CreditCards/comments/1dlji2n/credit_cards_are_like_pokémon/",
        "content": "Is it just me or are credit cards like Pokémon. I got my squad of 5 and I always look forward to using them wondering which one I’m going to use next. They’re always on me and have their own advantage. I just caught a new one which is the freedom flex, and my freedom rise just evolved into a freedom unlimited. My discover it was my starter and my savor one is the strongest one with the highest limit. Idk maybe I’m just thinking this because I have like no social life….. ",
        "num_comments": 43,
        "comments": [
            "This is why we call it a game.",
            "..... Well, and we want to catch shiny pokemon (limited edition cards or huge SUBs) and use different cards to counter different types of purchases",
            "Credit cards got me out of my stock trading addiction",
            "LOL this is one of those posts where both my interests link up but also yes!",
            "The Amex black card is the final catch \n\nOnly few can catch it",
            "Literally lol, got me collecting all the regional ‘mons at credit unions, shinies as the metal/cool looking cards, and the legendaries as high value rewards cards",
            "So it's a conspiracy theory that Pokémon brainwashes kids into being future credit card addicts?",
            "I wanted to collect 1 of each payment processor, still missing an amex but I’ve already covered all spend categories I want lol",
            "Yes ! Gotta catchem all.",
            "Gotta catch them all!",
            "chase sapphire reserve is kyogre",
            "This is exactly how they want us to think 😂😭",
            "My brother and I joke and make this same comparison often lol",
            "More like fantasy football to me, but yes, definitely scratches that collection itch. It’s definitely a game.",
            "And here I am - surrounded by couple diglets and zoobats trying to keep em happy and satisfied 🫡",
            "I’ve always felt that the credit card optimization is its own meta game.",
            "I love the credit card game. Haven’t gotten a new card since December 2023 but im waiting right now😭 I need my credit age to grow a bit more again before I scoop up another card. Something about getting more credit cards & earning rewards is just so satisfying. I love to see that we got a community of people loving them too! lol",
            "There’s also seeing where you’re at with the various banks and their rules. Like Chase’s 5/24 rule is like only having 4 moves per Pokémon in how it limits your options. And finding how difficult cards strengthen each other is like how you want your Pokémon team to complement each other.\n\nI am definitely a nerd.",
            "No wonder so many people are in heavy credit card debts",
            "Have you had dreams about them yet?",
            "My Rise is upgrading in August, what did they do? They send a new card with same number?",
            "Welcome to the game",
            "Wrong genre reference here, but the 3 Hilton Aspires are the Blue Eyed White Dragons.",
            "I mean yes, optimizing is a fun game to a point, but I don't really want to be like \"OK, I've got $1.75 in rewards at Bank A, $6.30 at Bank B, $2 at Bank C, 1500 points at Bank D...\"",
            "Multipliers are like moves. There’s usually around 4 multipliers per card. Benefits are like their passive special effects like Groudon’s drought which makes the battle field sunny",
            "Yeah you should probably just close your oldest account. Wont affect you at all",
            "The banks want it to be\n\nThe more you have, the more you spend \n\nThat's how they make money",
            "I'm trying to catch all the legendary(premium) cards. I just need U.S. Banks and BOA",
            "I’m still sad I didn’t manage to get one of the 747 cards!",
            "Do you mean like video game wise or tcg wise?",
            "Why Team Travel rolls its eyes at Team Cashback. Status >>> pennies saved.",
            "Bank of America customized cash rewards card is Groudon",
            "So what’s the 3-headed blue eyes then?",
            "I agree, it’s extra stress you don’t need. The freedom rise being upgraded wasn’t even that necessary as I got the same benefits from the savor one",
            "Why",
            "Both! Although I’m more into the video games as I only got into the collecting aspect of the TCG as an adult 😄",
            "Team Travel = Valor \n\nTeam Cash Back = Mystic\n\nDebit card users who carry a balance on their credit card = Instinct",
            "Ironically it would be hilarious if WF released a counterpart to the sapphire called the ruby",
            "Is that considered an evolution?",
            "Same here haha I was just asking because I wanted to know what CC do you use to buy cards? I’m starting to buy tons of BBs from eBay, TPC, etc and I want to maximize my cashback. I’m currently using my quicksilver.",
            "If the Congress gets around to actually limiting CC exchange fees, Team CB is basically dealing with a hard salary cap.",
            "Citi Custom cash would be arceus",
            "Haha fair enough I don’t use one since most of the stores near me are resale shops so I tend to make deals with other collectors however the new WF Attune might be a good choice since you get 4% cash back on a lot of really cool niche categories one of which is Hobby, Toy, and Game Shops"
        ]
    },
    "Why does no one talk about BofA CCR 3.5% at Costco with PR": {
        "title": "Why does no one talk about BofA CCR 3.5% at Costco with PR",
        "score": 52,
        "url": "https://www.reddit.com/r/CreditCards/comments/1dlk4z8/why_does_no_one_talk_about_bofa_ccr_35_at_costco/",
        "content": "3.5% with preferred rewards at wholesale clubs in insane. Yes, there’s a $2,500 limit per quarter on combined categories, but technically you could just get another CCR. Even without PR, 2% still ties with the Citi card.\n",
        "num_comments": 96,
        "comments": [
            " I like buying E shop card for 5.25%",
            "I LOVE my BofA Preferred Rewards.  I have..\n\nCustomized Cash 5.25, 3.5, 1.75%\nUnlimted Cash 2.6%\nBankamerica Card balance transfers\n\nI actually closer most of my other credit accounts..",
            "You have the US Altitude Reserve that will get you 3% (4.5% for travel).\n\nYou have the Redstone Visa that will get you 3% & now the Robinhood card at 3%. \n\n\nBoth without having to put your funds with BoA & no caps.",
            "I like using by USBAR for 4.5%",
            "Noob question but how do you get preferred rewards? I only get 2%",
            "AAA Daily advantage gives 3% at Costco and 5% at grocery stores. And it’s a no AF card",
            "That’s pretty good if you already have $100k parked with BoA, but if you don’t you can use Venmo uncapped at 3%, also works at Walmart at 3% (codes Walmart and wholesale as groceries).",
            "For those who live in Arizona, Vantage West's credit card is a Visa and gives you a 5% category of your choice. You can choose Wholesale. It's 5% on the first $1,500 each quarter.",
            "I do this but get Costco gift cards from their site. Use it in store and for gas. 5.25% for both and easy to manage the quarterly limit.",
            "AAA Everyday gives you 5% back on groceries & 3% back at wholesale Clubs",
            "That requires too much assets putting in a subpar service bank.  In short, the small extra benefits doesn’t outweigh the hassles.  Just like no one talk about the free Amex Platinum with one free authorized user, with 1 cents per point redemption if you want to cash out the MR points.  The requirement for all those benefits is even easier than the BoA.  If no one talk about that one, I can hardly expect people talk about one that’s even not as good.",
            "Many CCRs are Mastercard and most people don't want to go through the rigamarole of buying Shop Cards off the internet just to go spend it in-store.",
            "Have 4 of these in the family ... Best card for me ..flat 5.25% is 😎",
            "Aww, feels bad using some of my 5.25% quota on 3.5%!\n\nBut it's a gamble, this quarter I only ended up maxing the quota on 1 of my 3 CCRs. So I could have been using it on groceries/wholesale.",
            "I have 3 CCRs, 2 Visa and 1 MC. But it doesn’t matter. I always buy shop cards online. 5.25% at Costco all the time. The down side is I need advance purchase of those shop cards, but that’s minor.",
            "BofA custom rewards are among the best no fee credit cards if you are platinum honors.\n\n(Cheers)",
            "Does BOA let you transfer points from a spouse to yourself?",
            "I never considered this card but I didn't realize that IRAs would count for the preferred rewards. Transfer some of my IRA over, put it in a mutual fund, and reap the rewards. I may have to look into it. And since wells fargo got rid of my free bank account for having a loan with them, I may need a new bank as well. Are bank accounts still free with preferred rewards?",
            "FYI, you can get multiple BofA CCR cards so that you won't be constrained as much by the $2500 quarterly limit.   I have a co-branded one from my university and a regular one.  The following posts discuss the co-branded ones but unfortunately many have been discontinued.\n\nhttps://www.reddit.com/r/CreditCards/s/8iCIUi1hV1\n\nhttps://www.reddit.com/r/CreditCards/s/o5yXoHGP7S\n\nI'm not sure if you can get more than one regular CCR from BofA.",
            "Is CRR Mastercard? I thought USA Costco only took visa",
            "Cause you have to have money managed (at which point your loosing way more than your earning in management fees alone) or put a large amount into CDs (not everyone wants to do this given CDs lock money up for a period of time)",
            "Are you saying that buying costco shop cards from their website/app will code as an online purchase and not a warehouse store purchase?  My BofA CCR 3% category is online so that's why I'm asking.",
            "That’s smart lol. Didn’t even know you could do that",
            "Could you clarify what you're talking about?",
            "With what card??",
            "Premium rewards would get you 3.5 travel/dining and 2.625 base",
            "This is what I’m moving to. Simpler setup. Closing almost all my other cards.",
            "BofA does give 5.25% for platinum honors. But yes, it is the best if you already use BofA/Merill; o/w getting 100k is a little tough.",
            "Both of these cards will eventually get nefed . Like the AOD 3% visa, which I have . Was unlimited,  now has 1.5k monthly cap.",
            "I have way too many inquiries for USBAR. Also, I have a really short credit history since I’m only 19 so I have a harder time getting approved for cards like the redstone as well. I have a great relationship with BofA so it just works for me.",
            "The Altitude Reserve  has an annual fee and can only be redeemed for travel to receive  4.5% . BOA is pure cash back . I have the Altitude Reserve. Would not open a Merrill account just to get the bump in credit card rewards.",
            "One has an annual fee, the other does not. As far as cards without AFs, the CCR is King at Costco.",
            "Wouldn’t be approved unfortunately :(",
            "With Apple Pay?",
            "Except it's 3%.  Stop conflating earning and redeeming.",
            "For 75% rewards boost you need at least 100k in your accounts (though they could be in Merrill brokerage accounts or CD’s). Other reward level boosts exist for 25k and 50k as well (and 1 mil but it’s not much extra).",
            "I like this one a bunch. Its going to replace amex bcp....downgraded to bce.\n\n4% us bank go.  Restaurants.",
            "This.  Wife and I each have one to max out.  $500 annual max cashback (Either 10k grocery spend @ 5% or 3% warehouse club 16,666 spend @ 3% or a combination somewhere in between.\n\nSo with our two cards we swap one for the other in June/July.  Also comes with a nice $100 statement credit.  AAA's portal is frustrating - if you make changes to your account (email or phone#) it takes 10 full days to update.",
            "I’m loving mine.  The cash back is adding up quickly.",
            "I do! Using walmart pay i get 5.25%",
            "Why do you call it a subpar service?\n\n  \nMorgan Stanley requires 25k in checking account for free Amex Platinum, which earns you 0%, making it the worst deal of all time. Even a decent HYSA will get you as much $ as the annual fee of Amex Platinum.",
            "Is this the Morgan Stanley Amex Platnium? What are the requirements to make it free?\n\nI remember something requiring a Cash Plus account, but I'm not clear on what type of other accounts are needed or minimums to get the credit.",
            "I probably agree with you (most of my banking is at either Chase or Fidelity). But I just moved over 100k of stocks that were buy and hold anyway to ME to get the platinum honors benefits. They weren't doing much at another broker, might as well move them to BoA to get some benefits. The ME platform is terrible compared to the real brokers, but that makes no difference to me.",
            "You don’t have to keep it all in a checking account",
            "Custom cash is visa, unlimited is Mastercard",
            "I have both",
            "How do you have 4 of these cards?",
            "Get a costco e shop card on the remaining amount",
            "No . But I'd you are Preferred Rewards you can add your spouse. And they get preferred rewards also",
            "Yes they are!",
            "Another comment brought to my attention it changed to Visa as of 2 years ago. I thought it had always been visa",
            "merril lynch fees are high but merril edge fees aren’t much higher than fidelity. Low enough that preferred rewards makes up for it by a lot",
            "Yes if your category is online and you shop at Costco dot com, it will code as an online purchase.",
            "Codes as online",
            "Yes.",
            "pretty much, i assume",
            "After you order them once, you'll get them almost instantly .",
            "If you have the BOA CCR card and Premium Rewards. Set the category to online. You now have two ways to earn at Costco 3.5% in store. If you purchase the Costco Shop Card online, you can use the digital card to pay for your Costco purchase. Since that was an online order, you earn 5.25% \n\n2% * 1.75 = 3.5%\n\n3% * 1.75 = 5.25%\n\nThis requires 100k at Merrill / BOA. \n50% boost if 50k. \n25% boost if 20k",
            "If you follow this sub regularly, you’ll find out this is really r/USBAR…. /s",
            "Which card is tied to Merrill? Costco Citi?",
            "When the teams consistently missed the mark, and also giving five different answers in five different call, evaluating to legal team and they can’t even interpret their own legal writing, it’s hard to not calling it a subpar service.  If it’s only one, it’s okay.  But call the CD team and ask them, they can answer CD product, called the credit card team to define the category, they can’t give me an answer (they will tell you MCC code, but when MCC code matched and still not trigger the reward, nothing else was done, they rather like to refund $550 annual fee and cancel the card, but not to rebate the $150 streaming credit, that how incompetent their team or system is, they preferred to reset and lose more money than go find out the issue).  When the FTC involved and demand them for answer, they chose the reset button instead of fixing the problem.  And when I have no other option since that’s the only offer they offered me, they replied the government case resolved.  Self investment, they only know how to open and close accounts, any issues, good luck, they were like, I don’t know what’s going on.  CD’s interest rate is too low when compared to such high penalties (other banks either offer high interest with similar penalties, or similar interest with lower penalties).  It’s not one off thing, it so many problems with so many of their different products.  Oh, their Alaska credit card, also don’t offer travel protection, and you are required to use the card without travel protection in order to get the companion fare, and/or the free check in.  Alaska card is the only product that makes the special where no others offer (but Bilts partnership with Alaska Airline makes it no longer as exclusive as well), but always come with draw back.  Chase is simply better on everything that BoA isn’t too bad of, and things that BoA maybe better than Chase, I can always find it better in Costco.  Maybe other banks are also offering subpar services now, or as bad.  But nevertheless, the CCR is still not a good option, USAR and USAC+ duo kill the CCR and Cash unlimited combos.  USAR has no cap on Costco.",
            "I am not totally sure , but I don't think you can open this account anymore. Anyway, it's not free . You have to park 25k in an account, making 0% interest. There's always an opportunity cost.",
            "Problem is, everything qualified, is had (maybe except the manual active management since I don’t have that with them).  CD, lower rate, penalty (the penalty can be higher than the interest accumulated, meaning a loss, on a CD.  Money market, HYS, also low rate.  When ask for customer service, no support after the product is sealed and purchased.  Self Investment, bad user interface, and also difficult to transfer funds, and then when funds return due to non-transfer, it doesn’t automatically put the funds back, it’s in dead water, took a week and many phone calls to close the old account and open a new account.  Checking and saving, lots of fee (unless meets requirements), low yield.  If they have one stand out product for me to put the money in to meet the PR, that will be great.  Unfortunately, I tried so many of their products, being a PR Platinum tier for years, and finally come to the conclusion, not worth it.  Oh, and those mortgages or car loan discounts, still more expensive than Costco executive member ($120 annual fee) or even just the normal member ($60).",
            "Looks like [they switched it about 2 years ago](https://www.reddit.com/r/CreditCards/comments/r2enb0/converting_bofa_mastercard_to_visa/) (which is honestly farther back than I thought).  Anyway, that's why I don't do mine anyway.  It's Mastercard and serving it's purpose as my Online Shopping card.  But you bring up a good point that's probably competitive for Costco.",
            "I don’t remember how but me and s/o have 5 CCRs. Two Mastercard and three visa. Have always been tempted to get a couple more but didn’t bother to find out how. You seem to be a good person to ask :)",
            "Ah ok. So that answers your question of it not being talked about lol",
            "Is it still a percentage of assets under management?",
            "Pretty sure it codes as wholesale club—have done this with my Chase Freedom before\nEdit: for the 5% quarterly category",
            "Ah I see, thank you. If I have my work 401k through them, do you know if that would qualify?",
            "No, bank of america owns merril. Having 100k or more in assets across any type of BoFa account gives you 75% reward boost, so (from 2% to) 3.5% at wholesale clubs. However, I said the standard 2% (so without preferred rewards already compares with the citi costco card",
            "You have to have a membership, but can use a Visa card to pay for purchases. Doesn’t have to be Citi.",
            "No bank is perfect. The Altitude Reserve and the CCR are not the same card , one is a no annual cash back card, and the other is a travel card with a fee. All are good cards that I have. As for the Altitude Reserve for 5 months, all my moblie wallet payments only received 1%. Nobody could tell me why . But they eventually fixed the issue. There are reports that Chase has closed accounts for no reason. We all know about Wells Fargo issues.",
            "TLDR\n\nMy experience with BofA has been amazing and all the issues are resolved pretty quickly. And all banks have various issues with FTC that are settled.\n\nTheir CDs are bad yes, 4.71% interest on savings account I get is better than many CDs, which is ironic. And I never use CDs so it hasn't impacted me that much.",
            "Wow, this wasn't my experience at all. I opened a free no-fee self-directed Merrill Edge account and transferred in ~200 shares of VOO from Fidelity. A few days later they were there, transferred \"in kind\" so no taxable event, along with tax lot and cost basis information. Didn't matter to me whether those shares were sitting in Fidelity or Merrill Edge.",
            "It can be in a self managed Merrill Edge account where you can buy a vanguard S&P 500 index fund, a short term bond ETF like BIL at 5%, or individual stocks.  BofA doesn't care what you own, it just has to be above the amount required.",
            "Just move a mutual fund to their management. I have this with Wells but I’m now thinking about switching this to BofA for the higher rewards. I already have a CCR Visa.",
            "Merrill Edge",
            "Oh damn, didn’t know that. I got mine almost 2 years back so I thought it’s always been a Visa.",
            "My experience is that the more you have, the harder it gets. My last came by way of product changing my a travel rewards to CCR.",
            "Yup lol",
            "BOA issue both a visa and Mastercard version.",
            "Nope, how chase codes it doesn't affect how boa codes it. Everything from Costco website is online purchase with boa.",
            "codes as online purchase for bofa",
            "Yes, it codes as wholesale club. But, the processing method is online, so BOA pays the higher online purchase tier. Simple.",
            "That would be a question better for your HR department. \n\nIf you have a 401k left over from a previous employer, you can roll it over to an IRA at Merrill and that will qualify.",
            "At wholesale clubs you get 2.625 with the PR card, not 3.5.",
            "It’s good that you have good experience with them.  But for me, they screwed my self direct, they screwed my credit card (now it’s cancelled but took up the 5/24 slots), screwed up many of my things with them.  More importantly, when I complained, they were kicking the balls to different departments, and each one said it doesn’t belong to them and kick back to another department just with a different rep, then giving me a different answer after the new rep reads the note from their own colleague of the same department.  Not standardized, not trained, and not willing to resolve problem, also no follow up.  The business department is slightly better (I was Platinum Honor with personal and still a gold with business, that’s the kind of relationship I have with them).  I was with Chase and had some kind of sapphire tier, I don’t remember I was treated that way.  I also went to bank branch to see real rep, and called as well",
            "lol yeah not sure how they got that experience but using Merrill with a self directed account is super simple for me",
            "It still comes down to whatever they offer, that individual product, are there better alternatives.  Checking and saving used to be strong due to high coverage, until Chase bought WaMu in 2008 or 09.  Investment, Morgan Stanley offers better card products (Free Amex Platinum and one free Authorized user, that’s almost $900 value).  Requirements is also easier to hit, world wide free no fee ATM is also offered.  By the way, when you enable special offer to their reward (example, July thru September, 3 additional %), the 75% preferred reward will be disabled during the same period.  Way too many trade off, way too many “got you”.  The special also always covered with that maybe issue 1099 language, and always no customer rep, not even their legal team, can answer their own Terms and Conditions.  That’s the biggest issue, a team that responsible for what they wrote, doesn’t know how to interpret their own writing (and also don’t know who roll out the product so not sure who they can ask).  Just chaos",
            "Thank you, learned something new!",
            "tbh i realized so many things get coded as online for me",
            "Ahh, did not know this—thanks!",
            "2% * 1.75 = 3.5 ✨\n\nalso i’m not talking about the PR card, it’s a custom rewards with preferred rewards boost",
            "I am sorry you had mostly bad experience with them. Unfortunately, you will find examples of bad customer service with any product or business. At the end of the day, we are all humans and perhaps someone who was helping you had a bad day. It is nothing new. I have been with BofA for 20+ years, having held various accounts and credit cards, including mortgages, HELOCs and auto loans. I actually started with them when they were LaSalle Bank. I cant say I always had the most positive experience, but overall the expieinces I had weren't any worse than what I experienced with Chase.",
            "To be clear, you probably weren't wrong: it likely codes as Wholesale Club, too. Every BoA transaction has its MCC code and also an \"Online?\" status. Online Shopping just looks at the Online flag and excludes certain MCCs like Utilities and Healthcare and stuff.\n\nSo a lot of purchases would code as two categories. HomeDepot.com is both Home Improvement and Online Shopping, DoorDash is both Dining and Online Shopping, etc."
        ]
    },
    "Chase is scamming me out of a SUB??? New rule states only 1 Chase SUB EVERY 48 MONTHS": {
        "title": "Chase is scamming me out of a SUB??? New rule states only 1 Chase SUB EVERY 48 MONTHS",
        "score": 39,
        "url": "https://www.reddit.com/r/CreditCards/comments/1dllhrp/chase_is_scamming_me_out_of_a_sub_new_rule_states/",
        "content": "I recently opened a CSP and FIRST sapphire card ever in-branch for the elevated SUB (75k UR for $4k spend and 85k UR for $6k spend) on 6/17 with a 750 FICO score, 2/6, 2/12, and 2/24. I noticed that there was no SUB tracker under my CSP account on the Chase app so decided to give customer service a call. The first time I called (yesterday 6/20), they escalated my issue to the marketing team and I decided to wait 24 hours for an update.\n\nWith no update and after three rounds with customer service today, a supervisor decided it was an appropriate time to gaslight me. He told me that I agreed to a pop-up message stating that I was told if I want to proceed applying for the CSP, it would be with no SUB. I can promise you that there was no such pop-up and I even went in-branch today to talk to the bank teller who completed my application. She assured me that there was no such message and is going to see what's going on next week once her boss is back in the office.\n\nThe super condescending and rude supervisor also told me that \"last week\" a new anti-churning regulation came into play where ONLY ONE SUB is given for ANY Chase card every 48 months. I confirmed multiple times that I have never opened a Sapphire card and that this was indeed for ALL Chase cards (I opened a CFF in April of this year). I asked multiple times where the fine print regarding this new rule was, but he would condescendingly and continuously say \"\\[my first name\\], I assure you, you will not be getting the bonus no matter what\"\n\nThe whole ordeal with the supervisor left a terrible taste in my mouth and honestly would rather not do business with Chase again. I really do appreciate the bank teller who helped me out though, as she has been the same person who I have gone to open all of my Chase accounts with. However, if this is true, it might be over for Chase...",
        "num_comments": 69,
        "comments": [
            "Tracker doesn't always show up right away and Chase reps are notoriously uninformed. Hit the MSR and the SUB will post. I bet you see the tracker show up in the next week or so.",
            "I absolutely do not believe this. I believe a rep told you this, but I don't believe it to be true. It would be way bigger news, on every blog, YouTube card guy's pages, etc. I bet the tracker shows up shortly. It's been 4 days. There is a new popup message, but it didn't say anything about not getting any chase sub at all for 4 years.",
            "I approved for CSP on 5/28 and got it via mail days later, and found the 4k spend bar on the app a week later. I can't find it online. You need to be patient. GL",
            "That’s wild. I opened a CSP June 2023, CFU May 2024, and CFF June 2024 and I got SUB for all of them no questions asked",
            "Similar thing happening to me at the moment since I opened a CSP. But every rep I’ve talked to has had no idea why I wasn’t eligible. Opened CFU last year so that would obviously be within the 48 months, but there was clearly nothing about a 48 month rule when I applied for all sign up bonuses, only sapphire. \n\nI’m assuming it’s a mistake with the new approval without bonus system they have, but this post just expedited my timeline to submit to CFPB\n\n\nEdit: forgot to mention that I absolutely did not in any way have a pop up. Obviously if I did then I wouldn’t have finished the application",
            "This would cripple Chase's credit card division and gift the billion dollar market to its rivals. Not impossible but unless Chase has some inside info on the imminent demise of the industry, I just don't see it. Waiting on additional data points.",
            "This is wild. Our website states:\n\n\"This product is available to you if you do not have any Sapphire card and have not received a new cardmember bonus for any *Sapphire* card in the past 48 months.\" \n\nSo how is this happening??? I'm going to try and find out more tomorrow after I log in.",
            "There’s no way that this is all true. HUCA.\n\nIf anyone is wondering about the new pop-up message (even though it doesn’t pertain to OP’s situation at all): \n\nhttps://www.doctorofcredit.com/source-chase-now-approves-sapphire-reserve-freedom-unlimited-cards-without-signup-bonus-chase-popup/\n\nEdit: Ask Sebby did a video of the new pop-up message recently, to help clear up some confusion: https://youtu.be/8X5QP5uwnQE?si=b7jywmoLLetCcqut\n\nNote that he is misinformed on one thing: 5/24 dropped off on the 1st of the 24th month, and not the card(s) actual opened date.",
            "I've opened the chase trifecta and the united explorer all in the past 7 months. I have received the SUB on all.",
            "I didn't even know there was supposed to be a tracker lol I got my CSP on 6/15. I see no tracker in the app. I'm still going to do the requirements for the bonus. If I don't get the bonus in 3-4 months maybe then I'll complain",
            "I’ve watch a lot of YouTube videos on credits and this is definitely something that has been happening. Got to make sure everything is clear.",
            "Dang, if this is true my strategy for next year is completely ruined since I got the CFU last year. I was planning on getting a new CSP next year since it was finally 4 years.",
            "same thing happened to me... applied in branch and teller confirmed 75k and 85k in branch offer before we did the application. i got my card and tried looking for the sub tracker but couldnt find anything about it so i called customer service and they said i have no sign up bonus on my card. they created a ticket for me and im waiting to hear back",
            "Never heard of this new rule… So now we have to worry about Chase 5/24 and Chase 48 rule??? 😂😭",
            "No way… this is going to change the game big time. Especially if this includes co-branded cards.",
            "Blame the shenanigans of people product changing to multiple Freedom cards, so they can get back in line for another SUB. I’m actually surprised it took Chase that long to do this. Amex is already wise to this and even WF is denying perceived churners their new 4% card.",
            "I know that it's 48 months from the last time you got a Sapphire bonus, but it's supposed to be 24 months for any non Sapphire UR earning card. So that's interesting to be claiming 48 months for all cards.",
            "Does anyone know if this will affect Ink cards? Those are the important ones.",
            "As a data point, I opened the CFU end of 2020, and the CFF in 2022, and most recently the CSP in May 2024 for the 85k SUB. I have gotten SUBs on all 3. if this is an actual change it's very recent...\n\nDefinitely follow up with in your in branch bank teller next week, the person you talked to sounds like a total ass hat who just wanted you out of his hair.",
            "Whoa, 1 SUB every 4 years? That's a bit extreme.",
            "I opened a United biz card at the end of March and got the SUB a month later. I got the CSR at the end of May and have the SUB tracker in my app.\n\nLooking at the fine print for the Sapphire offers right now, it still says no SUB if you currently have a *Sapphire* card or if you've received a *Sapphire* SUB in the past 48 months. Not other Chase cards.\n\nI think this is case of clueless reps and perhaps bad IT. The reps don't know how to fix the problem, so they just claim you're not eligible.",
            "So… what you are saying is if I got my CFU in may 2024 and I am looking to work towards the trifecta over the next year or two… I wont get a sign up bonus on a CFF if I were to apply for it before may 2026…? And after that I have to get a Sapphire card in 2028 if I want a SUB on that as well? That is absurd, no??\n\nEdit: 48 months is 4 years so it would be May 2024 to June 2028 to July 2032 to complete the trifecta with SUB (thanks for correcting OP)",
            "File a CFPB complaint asap before they actually add in fine print",
            "I’ve gotten two SUBs from Chase in the past three months. Most recent one was two weeks ago.",
            "I have the points match in my CFU and there is not a tracker for me to see. I got the 75k Preferred and see the tracker. I wonder is that’s going to screw either of my bonuses.",
            "When I got my reserve, the tracker never worked.  After second statement (which I had spent required amount), my bonus showed in my UR balance.",
            "Check my post. Same issue but I was able to escalate and get it resolved.",
            "I’ve had a CSR since Feb 2023.  On Thursday 6/6/24 I got a CFF online.  Couple days later\nOn Monday 6/10/24 I went into a branch and got a CFU which was immediately available  in my Apple wallet so I used it right away.  my CFF didn’t arrive until 6/15/2 Father’s Day weekend which is when I started using it.  The sub on each was $200 with low spend of $500 within the 1st 3 months o each card. \n\nI noticed that when I’m viewing my CFU (opened 2nd but activated immediately in Apple Pay so used 1st) there is a “new acct bonus” that says I only have $62.46 left to spend by 9/7/24 to earn 20k bonus awards.  If I look at my CFF acct there is no “new acct bonus heading.”  I didn’t actually get that card until last Saturday and I’ve only charged $125 and about no",
            "Why would Chase allow unprofitable bonuses for churners?  They like long term relationships.  A bank would be unprofitable if it  kept giving free cash to everyone.  There has to be limits.  A bank would gladly give a bonus if they thought it would bring additional revenue.  Credit cards make money on merchant fees, interest, and other fees and other ways.  I have done bonuses before which I received as a new customer with Credit card issuers but I did not churn bonuses with the same company trying to get free cash.  I didn’t keep some of those cards because there was no long term relationship to be had once the bonus was up based on the card offering.  I kept others which I received the bonus on and they made some money back in merchant fees on their end or customer referrals snd the like.\n\nThe vast majority of customers that don’t get the bonus are going to be customers that Chase doesn’t see as profitable customers.  There will be some mistakes made where bonus aren’t applied correctly as well.",
            "I hate Chase's customer service. They gave me the runaround with one of their \"utility\" offers. I was peeved and reported it to the BBB. A Chase rep called me back, didn't admit Chase was wrong, but still resolved my issue.",
            "I’m about $3000 in and no tracker yet for me either. Kinda nervous that I won’t get it so I’m glad someone posted about this",
            "OP, please keep us posted on what happens with this!",
            "My husband got approved for the CSR just a few days ago (final day of elevated public offer) and he is getting the SUB without issue. He got a sub from a different card less than 4 years ago so that can’t possibly be true. Something else has to be going on",
            "lol if this is true I would end my entire relationship with Chase. ",
            "There goes my ambitions for opening up some Ink cards to churn next year. Time to pack it up and go to WF bros",
            "It doesn’t make sense for Chase. We aka proper\nchurners never stay under 5/24 to begin with; this new rule would only push away normal users",
            "How about you wait a few weeks? It’ll eventually show. You’re freaking out over nothing. No one scammed you. Relax pal, sometimes the trackers show late.",
            "Send them a demand letter and be ready to take it to small claims. They will settle with you. The cost of appearing in small claims would outweigh your SUB",
            "I’ve never heard of this supposed rule and it’s BS if they didn’t tell you about when you applied. That’s almost false advertising, and it’s not cool. \n\nThat being said, if this is true, it’s good that Chase is doing this. Hopefully it will dramatically slow down all this churning nonsense.",
            "Well it's been fun helping you guys out with Chase credit cards but I am absolutely not okay with my post being shared everywhere. \n\nHere's to your \"Chase underwriter on Reddit\" checking out.",
            "That’s insane. I was going to apply for the CSP soon. Do you know a good alternative??",
            "That’s insane! I was planning on opening a CSP soon. Do you know any good alternatives??",
            "Seriously. Sounds like OP is freaking out over nothing. It’s been four days, why even bother? Hit the min spending requirement and deal with it then if you don’t get the sign up bonus.",
            "the problem is, this is a widespread issue. ChaseSapphire subreddit has multiple posts and datapoints about the exact same thing. I'm one of them and I called to inquire about my SUB, just to be told that they saw how I was offered, but not eligible. None of the representatives had any idea why. The official ruling was that I previously held a sapphire, which is just complete bogus and I have plenty of proof (number of accounts, timing of accounts, rewards status, among others) which was all just submitted to CFPB. Maybe for OP its a different situation, but my tracker is most definitely not showing up, and it's absolutely not the fault of anyone except the bank for basically scamming us out of a sign up bonus that we're eligible for, according to the rules at signing, but not once they retroactively change them.",
            ">This would cripple Chase's credit card division and gift the billion dollar market to its rivals.\n\nSeems like a bit of an overstatement IMO. The average credit card customer has 3-4 credit cards *total*. Not 3-4 Chase cards... 3-4 *total*. The typical CSP/CSR cardholder (putting aside the folks on this sub and the churning sub) probably has the CSP/CSR plus a legacy student card plus one or two store cards.\n\nThe Sapphire program has been a loss leader for Chase for years. It wouldn't be completely shocking if they were taking more stringent measures to limit their losses to churners.",
            "Agreed.  This would be an industry shakeup that would make mainstream financial news if this was really the case.  OP say he was told it started weeks ago. If this was the case I'm fairly sure we'd have heard about it by now.",
            "Wait, what is going to cripple Chase’s credit card division?",
            "So it's just for the Saphire family.\n\n\nIf you have CFF or CFU, you're safe.",
            "I have called four times at this point, one time even being in-branch in their conference room. All the same response...",
            "Same bro... got the CFU was waiting for the 5/24 to line up for me... Now 48 months 😭",
            "I hope other banks don't follow Chase.",
            " I guess I'm the guinea pig :/",
            "I am fine with being denied a given card or even being denied a bonus provided it is something that was explicitly laid out in writing at the time of application.  SUB denial after the fact on the basis of some internal, unpublished rule is a different animal though.",
            "Even so, if true, the bank needs to provide disclosure.  Not accept the application, and the spend, and then retroactively apply a SUB restriction to an account.",
            ">even WF is denying perceived churners their new 4% card.\n\nI agree WF's underwriting for the Attune seems (from the admittedly limited DPs we've seen to date) unusually stringent... but it might be more WF being skittish about having uncapped 4% categories, and less about deterring churners. How many churners are really going to leap after the Attune for its $100 SUB?",
            "Yes, it is. Which is why I question the validity. \n\nGoing from the current language of 24/48 months to basically ONE SUB every 4 years across all Chase cards is too extreme.",
            "It would be a SUB every 4 years, so 2028 and 2032 :(",
            "Note this is not about the separate new Chase policy of offering their cards without a SUB, where previously they would have auto rejected the application. This is in the context of what OP’s suggesting, that Chase limiting SUB to only once every 4 years across all its (core) cards and not just to single cards or card families like the Sapphire. So hypothetically, getting a freedom SUB blocks your Sapphire SUB for 4 years.\n\nIt would be shocking because despite being a money loser, the sapphire program has been a huge boost to the Chase brand. Jamie Dimon himself wished that they lost more money on the Sapphire as that would mean they won over more customers with more opportunities to cross sell.\n\nNow imagine if all the people who got into the Chase system with a freedom flex or unlimited early and then a year or two later decided to get the sapphire. They get told after their application that they are ineligible for a bonus because of a previous bonus on a completely different card. They would be furious.\n\nThe backlash and negative PR and brand damage would be big for Chase. Even Citi split the Premier from the Rewards+ so that their bonuses wouldn’t conflict and rightly so because it’s a penny wise and pound foolish gimmick. It saves a bit of money but can royally piss customers off that you actually want to bring in, I.e. the travelers and high spenders. Putting all the card bonuses under one family won’t hurt churners since they’d know to only cycle the high SUB cards, which is what people did with the Citi premier.\n\nI don’t really doubt the OP’s story per se, as any one can get screwed by any of these banks at any time. I just don’t see this as a new strategy by Chase (without more data) and right after their elevated offers on the sapphires. I’m inclined to think OP was somehow not eligible for SUB either by design or error and the CS explained poorly.",
            "Which part are you referring to, cause the 48 months Sapphire SUB rule has been around a long time.",
            "Chase phone reps are known morons, fyi.",
            "A $100 is $100.",
            "WF is clearly a bank that didn't do their homework on the BILT and is now probably sabotaging the Attune out of paranoia.",
            "Thats wild. Should I bail on the trifecta rush?",
            "I really hope this isn’t true. I got the CFF couple weeks ago and just got approved for the CSP with 75k SUB. It better happen or I’m gonna be pissed. Nowhere does it or did it say I wasn’t eligible when applying",
            "I’m assuming that’s in reference to OP’s unfounded (other than by known idiot Chase phone reps) claim that the 48-month rule now applies to all Chase apps rather than just Sapphires.",
            "Or they just want customers who are going to actually use the card, not optimizers who only used the card for rent and 5 other micro transactions to satisfy the requirements.",
            "I don’t think what OP was told is true, I think the chase reps are misinformed.\n\nI opened CFU prob a year and a half ago, CFF like 6-7 months ago, and the CSP like a week ago. The tracker is up for my CSP and I’m getting the SUB.\n\nThe people in charge of OPs case are not in the loop.",
            "Thanks for letting me know. I wouldn’t be applying for a few months anyway, but I will keep a close eye on what’s going on. Would be a pretty crazy move on Chase’s behalf especially since they have to know that many people finish the trifecta in 1-2 years"
        ]
    }
}