{
    "Cyberpunk 2077 FAQ": {
        "title": "Cyberpunk 2077 FAQ",
        "score": 98,
        "url": "https://www.reddit.com/r/cyberpunkgame/comments/1c4zdow/cyberpunk_2077_faq/",
        "content": "# Part 1: Basics, Game Mechanics, & DLC questions\n\n**0. What is Cyberpunk 2077?**\n\nAnswer: Cyberpunk 2077 is a 2020 action role-playing video game developed by CD Projekt Red and published by CD Projekt, and based on Mike Pondsmith's Cyberpunk tabletop game series. [Source](https://en.wikipedia.org/wiki/Cyberpunk_2077). Similar games [can be found here](https://www.reddit.com/r/LowSodiumCyberpunk/comments/187u2z4/games_like_cyberpunk_to_get_into/).\n\n**1. Should I buy the game?**\n\nShort answer: Yes.\n\nLong answer: Yes, the game is really great. [Here is the sales tracker for Steam](https://steamdb.info/app/1091500/).\n\n**2. Should I buy the DLC?**\n\nShort answer: Yes, the DLC is also great. [Here is the sales tracker for Steam](https://steamdb.info/app/2138330/)\n\n**3. Is the game playable now?**\n\nShort answer: Yes.\n\nLong answer: There are still some bugs, like any game. But the game is in its most playable state. However, playing on last-gen consoles like the PS4 will still have issues.\n\n**4. I have an old save, should I use it to start the DLC or make a new save?**\n\nShort answer: make a new save\n\nLong answer: Saves created before the 2.0 update will have to re-spec their build from scratch, as that update came with a complete overhaul of the perk system. Therefore, your pre-existing build may no longer be viable.\n\nIf your save was created after 2.0 then it would be fine to use it after buying the DLC.\n\n**5. When should I start the DLC?**\n\nShort answer: after the start of Act 3, before starting the endgame (Nocturn Op55N1).\n\nLong answer: >!There are 3 separate main questlines during Act 2. The DLC is accessible after completing 1 of them, specifically the questline with Evalyn Parker and the VDB's. You can start the DLC after completing Transmission/Never Fade Away, however conventional wisdom advises you complete all 3 main job questlines first and start the DLC before starting the endgame (Nocturn Op55N1).!< It’s up to you.\n\n**6. When do I have to start the DLC?**\n\nShort answer: whenever you want, no rush, just don’t trigger it by getting to the Dogtown gate.\n\nLong answer: >!after recieving the call to start the DLC, as long as you don’t approach the general area at the Dogtown gate that triggers the relic malfunction, you can start the DLC at any point after unlocking it. **However,** once you DO approach the gate, get the relic malfunction, and start talking to Songbird, you will be locked into the next several missions of the DLC. Attempting to leave mid-mission may result in failing the entire Phantom Liberty mission line.!<\n\n# Part 2: Game Mechanics\n\n**7. How do life paths affect the game?**\n\nShort answer: Different prologues, occasional changes to dialogue and how some Jobs play out.\n\nLong answer: >!When you start the game, you must choose V’s life path among the 3 options: Nomad, Corpo, and Streetkid. Afterward, you will then begin 1 of 3 different possible Prologues, taking about 15 minutes, before they merge together in to the beginning of the “The Rescue” where you save Sandra Dorset. Throughout the game, your life path will provide different dialogue options to choose from, which impacts how different NPC’s interact with you. There is also a different Side Job available for each life path. Life path has no substantive impact on endgame outcomes. !<\n\n**8.  What Character Build should I go with?**\n\nThat’s up to you. Watch some YouTube videos and check out the official [Build Planner](https://www.cyberpunk.net/en/build-planner). [Here](https://nukesdragons.com/cyberpunk-2077/) is an alternative third-party build planner.\n\n>![Here](https://cyberpunk.fandom.com/wiki/Cyberpunk_2077_Cyberware)!< is a list of all available cyberware.\n\n**9. What happened to clothing mods? Do clothes affect anything?**\n\nPrior to Version 2.0, clothing could receive modifications, including armor mods. This was the primary way of increasing your armor. After 2.0, there are no longer clothing mods; clothing is mostly aesthetic, though a few rare articles do provide some minor stat buffs. In order to increase your armor, and other similar things previously provided through clothing mods, go through cyberware. The Armadillo mod has been removed from the game.\n\n**10. Love Interests?**\n\nThere are 4 possible love interests in the game. [see the full guide here](https://www.eurogamer.net/cyberpunk-2077-romance-options-male-female-panam-kerry-river-stout-5077), likely contains spoilers.\n\n**11. What do those percentages mean in the pause menu?**\n\nShort answer: Ultimately, nothing\n\nLong answer: While there is no official explanation beyond what is stated when you hover over them, it is colloquially accepted that they mean, from left to right: >!Your notoriety as a merc, your relationship with Johnny, and how far the relic has degraded you.!< Ultimately, they have no substantive impact on the game in any way. They are either a vestige of mechanic(s) that were not implemented, or just set dressing. They can ultimately be ignored without consequence.\n\n**12. New Game Plus (NG+)???**\n\nNG+ Is not happening. The Developers have said they're not working on it and have shifted focus to the sequel game. There is a [pseudo NG+](https://www.nexusmods.com/cyberpunk2077/mods/5144) mod available for PC.\n\n# Part 3: Endgame and Secret Ending\n\n**13. When is the endgame, when is the \"point of no return, when should I start it, and can I finish other missions after beating the game?**\n\n>!When you approach the elevator to Embers for the Main Job mission Nocturn Op55N1, you will be prompted with a pop-up stating \"Point of No Return\". As it states, you should complete other side jobs and gigs before beginning the end Game as you will not be able to stop until you complete the game.!<\n\nAfter completing the game, >!(unless you chose the Phantom Liberty ending)!< you will be given the option to return back to before the Point of No Return and be given various rewards. You will then be able to complete other Side Jobs and gigs as before.\n\nYou will be able to complete the game again as many times as you wish choosing any of the endings you unlock.\n\n**14. How do I unlock the secret ending?**\n\nThe only way to unlock the secret ending is by choosing the correct dialogue options while talking to Johnny in the oil field. These options are:\n\n>\\[Inscribe Johnny's Initials\\] \"Let's do something about that.\"\n\n>*\"The Guy who Saved My Life.\"* (Not a required choice)\n\n>**\"Nah, fucked that up too.\"**\n\n>**\"What do you want from me?\"**\n\n>**\"OK. But as second chances go, this is your last.\"**\n\n>*\"You were a real dick in the beginning.\"* (Not a required choice)\n\n>*\"When you said you let down your friends...\"* (Not a required choice)\n\n>*\"Smasher biz really got to her.\"* (Not a required choice)\n\n>*\"Yeah, I'll call Rogue.\"* (Not a required choice)\n\nYou must then complete the Side Job “Blisterin’ Love”. Nothing else matters. Your “Johnny %” makes no difference.\n\n**15. How do I start the secret ending?**\n\nWhile on the rooftop with Johnny during Nocturn Op55N1, when you’re looking at your list of options for who to call, **wait approximately 5 IRL minutes** on this menu. Then Johnny will speak up and offer you another solution. Choose: \"Let's hear this plan” and agree to >!attack Arasaka alone.!<\n\n**16. What are all the available endings?**\n\n[See the full spoiler-filled guide to all available endings](https://www.ign.com/wikis/cyberpunk-2077/How_to_Unlock_All_Endings_in_Cyberpunk_2077), including the DLC\n\n# Part 4: Technical issues\n\n**17. My game refuses to boot; what do I do?**\n\n* Remove mods\n\n**18. \\[X\\] isn’t calling to start a mission; what do I do?**\n\nHere are a few strategies to trigger missions to start:\n\n* Save and reboot your game.\n* Complete side-jobs.\n* Sleep in apartment bed for 24 hours & walk out of room to the main elevator.\n* Drive to the badlands and back.\n* If you still don’t get the call, repeat the suggested list.\n\n**19. A glitch is preventing me from progressing in a mission. What do I do?**\n\nRoll back go a previous save and try again.\n\n# Part 5: Unlock weapons and decorations\n\n**20. Where do I get the apartment decorations?**\n\n[See the complete list here](https://cyberpunk.fandom.com/wiki/V%27s_Apartment/Memorabilia)\n\n**21. Where do I get the guns on the wall in the stash?**\n\n[See the complete list here](https://www.reddit.com/r/cyberpunkgame/s/0F3IabBvaD)\n\n**22. Is there a list of every iconic weapon?**\n\n[Iconic Weapons Wiki](https://cyberpunk.fandom.com/wiki/Category:Cyberpunk_2077_Iconic_weapons).\n\n[See Phantom Liberty list here](https://www.reddit.com/r/cyberpunkgame/s/oTDN3UqxyC)\n\n# Part 6: Misc.\n\n**23. Which gigs and missions can be failed?**\n\n[See the full list here](https://www.reddit.com/r/cyberpunkgame/s/7HUvDo0chl)\n\n# Part 7: Mods\n\n**24. Can Console versions of the game run mods?**\n\nNo. only the PC version can run mods.\n\n**25. How do I install mods?**\n\n* [See the guide here](https://steamcommunity.com/sharedfiles/filedetails/?id=2992198278)\n* [Full list of Console Commands](https://docs.google.com/document/d/1iYE1y1dNNXZ3kgd_8kx9ZOvAKOTds9tWlXJv3I1Zj28/)\n* [Most popular mods on Nexus Mods](https://www.nexusmods.com/cyberpunk2077/mods/top/)\n\n# Part 8: Archive of old Megathreads\n\n[**Wiki**](https://www.reddit.com/r/cyberpunkgame/wiki/index/)\n\n**Prologue Discussions**\n\n* [Corpo](https://www.reddit.com/r/cyberpunkgame/comments/k9bx01/rcyberpunkgame_corpo_prologue_discussion/)\n* [Nomad](https://www.reddit.com/r/cyberpunkgame/comments/k9byfj/rcyberpunkgame_nomad_prologue_discussion/)\n* [Streetkid](https://www.reddit.com/r/cyberpunkgame/comments/k9bwjc/rcyberpunkgame_street_kid_prologue_discussion/)\n\n**Old FAQ’s**\n\n* [FAQ/Simple Questions](https://www.reddit.com/r/cyberpunkgame/comments/k3obxq/newcomers_look_here_faq_simple_questions_thread/)\n* [PC Specs Megathread](https://www.reddit.com/r/cyberpunkgame/comments/k0llf4/pc_questions_megathread/)\n* [Console Questions](https://www.reddit.com/r/cyberpunkgame/comments/k2r53r/console_questions_megathread/)\n\n**Updates and Miscelaneous**\n\n* [**Bugs & Glitches**](https://redd.it/kdjq1j)\n* [**Spoiler Formatting Guide**](https://new.reddit.com/r/cyberpunkgame/wiki/rules/spoilerformatting)\n* [\\[19-11-20\\] Cyberpunk 2077 — Official Gameplay Trailer](https://redd.it/jx72zf/)\n* [\\[19-11-20\\] Cyberpunk 2077 — Night City Wire: Episode 5](https://redd.it/jx35yk/)\n* [\\[27-10-20\\] Cyberpunk 2077 on Twitter](https://redd.it/jj4kdt/)\n* [\\[15-10-20\\] Cyberpunk 2077 — Night City Wire: Episode 4](https://redd.it/jbqwg7)\n* [\\[05-10-20\\] Cyberpunk 2077 has gone gold!](https://redd.it./j5h5lw/)\n* [\\[18-09-20\\] Cyberpunk 2077 — Night City Wire: Episode 3](https://redd.it/iv9fgf)\n* [\\[18-09-20\\] Welcome to Night City - www.nightcity.love](https://redd.it/iv8vsa/)\n* [\\[11-08-20\\] Official Subreddit Lifepath Poll](https://redd.it/i84u1c)\n* [\\[15-05-20\\] *Free Talk Friday* Announced](https://redd.it/gkea56)\n* [\\[10-08-20\\]  Cyberpunk 2077 — Night City Wire: Episode 2](https://redd.it./i79cvu)\n* [\\[25-06-20\\] All of the articles, videos and impressions from media that played the Night City Wire preview!](https://redd.it/hfqcbi)\n* [\\[25-06-20\\] Cyberpunk 2077 – Night City Wire: Episode 1](https://redd.it/hfqdf4)\n* [\\[30-08-19\\] Cyberpunk 2077 – Deep Dive](https://redd.it/cxl3at)\n* [\\[10-06-19\\] Cyberpunk 2077 – Official E3 2019 Cinematic Trailer](https://redd.it/byomxv)\n\n# Please Post a Comment With Any Missing or Incorrect Info\n\n^(Last) ^(Updated:) ^(2024-05-09) ^(v1.2.1)",
        "num_comments": 68,
        "comments": [
            "[removed]",
            "[deleted]",
            "Can this be pinned to the top and always show before any other posts?",
            "# Pc users, how many sound channels does this game have? I've heard that if you don't have a dolby atmos home theater, you can only play in stereo?",
            "Great job, thank you :D",
            "I think I’m nearing the end for both dlc and main story line.\n\nDo I finish the main story first then phantom liberty or vice versa?",
            "hello. Does anyone know the name of the song that plays in the privileged mission?",
            "I am level 40, and I have reached the max (50) in street cred. I can beat pretty much any enemy I come up against. And yet I still feel like I'm missing something. Like I'm playing the game all wrong.\n\nFor one thing, I have something like 500,000 eddies. I feel like if I was playing the game right, there's no way I would have that much money. Now granted I loot everything (and I mean everything) but I break everything down - I think I've only ever sold stuff like twice. Also, when I go to gun shops they neve have anything better than what I already have in pickups; when I go to ripperdocs, they never seem to have anything that's much of an improvement over what I already have (and I don't feel like what I have is anything special); in short there doesn't seem to be anything to spend my money on.\n\nThen there's my armor: it's at 429/1135. I'm not finding any armor cyberware that brings my actual armor rating (429) anywhere close to it's capacity (1135). What am I missing? Why do I have such a humungous armor capacity that I can't find any way to use?\n\nAnd finally there's carrying capacity. It says I can carry up to 409 kilos, but I'm actually carrying like 95. (Again I break down (scrap? whatever it's called) everything I pickup that I don't need (that isn't better than what I'm already carrying). And remember I loot everything. Why do I have such a huge carrying capacity? What am I missing? What should I be carrying that I'm not? Does this have something to do with armor rating?\n\nAgain, at level 40 and max street cred, I feel like I should have a better grip on this game, but I'm just feeling like I'm missing out on so much.\n\nWhat am I missing out on?\n\nPS - I rarely use any of my cyberware unless it's called for on a mission. I'm not sure I really get how it all works, when the game's not walking you step-by-step through a mission, either.",
            "Has anyone got a solution for the Sun Glare bug?\nEverytime I play the game during day time our outside, it's hard to see a few meters infront of me. Idk if it's a graphic setting issue, or I need to update my drivers",
            "Can someone make this a question post instead of just Faq",
            "So what actually is the percentage of “friendship” with Johnny actually do? Is it like an abandoned/vestigial feature?",
            "[deleted]",
            "Do the dialog options related to skill like cool change or scale up? Or are the numbers fixed?",
            "Anyone know todays patch notes ? Just got a big update on Steam.",
            ">!Is the Coma ending from phantom liberty or main game? i took the So Mi ending is the coma ending on Reed's side of the story?!<TIA :D",
            "Is there a way to rotate your V preview on clothes shopping screens? I can only move her side to side, up and down, and scroll to zoom in and out.",
            "Advice on how to find side quests and storylines without having to check online?",
            "Guys I I finished game 3 times already, once keeping my body and Panam and I are together. 2nd I give Johnny my body and. Panam wants to now chop my d!c% off lol. 3rdly I help Honako, and they lock me on the moon and tell me they cant do anything. Now I got the Dlc, however, my concern is before I finish the Phantom liberty story, I decided Im gonna finish all the side stories, gigs, Pd Scanner, etc.. I am happy to report, night city is basically completed. However, I AM NOT ACCUMULATING ANYMORE PERK POINTS, the yellow ones. Is there a limit to how many you can open, or can you 100% the perks? \nP.S. Thanks & sorry for long intro.",
            "Are there any more bug/crash/performance fixes planned to be released? I think the game is slightly more playable now than it was on launch but the amount of glitches make it really hard to actually play on console at least.",
            "Are we able to post bugs we found here?",
            "How are you supposed to craft tier 4 and 5 weapons, I have tier 4 components but no weapon schematics in tab ?",
            "Is there a reason why my friends ui has more different ui than mine? for example the skill trees look different, he can listen to the radio whilst walking, his journal looks different and much more.",
            "How do tell which ncpd scanner is the one with named criminals. I have been avoiding them since they are too many but I got a weapon schematic from one of them with named criminals. How do you tell from the map?",
            "In metro, what are the Xbox controls to stand?",
            "How do you unload bullets from gun?",
            "I'm still hoping for a NG+ option for console plebs like myself...",
            "Are you certain about this?",
            "Fixed.",
            "It is already pinned. We will be removing posts that are answered here.",
            "PL first",
            "What's your cyberweare capacity? You need to hunt down those little capacity shards they sprinkled  in unmarked encounters throughout Dog Town.\n\nTo be truly heavily armored, you need Rara Avis and Chitin, both iconic cyberware you unlock at Dog Town. They take up a lot of your capacity but you'd be extremely thick-skinned.\n\nFor legs,  dump double jump and go with charged jump. That cyberware costs significantly less cybperware capacity and offers significantly more armor.\n\nThe rest is whatever armor-boosting cyberware you can afford. Universal Boosters and Paininuder have been my favorites, but that character has a higher than than normal tolerance. If you really want to reach the pinnacle of armor, replace active camo with more armor.\n\nThrow in a second heart and Regina's reward Axolotl, most enemies just don't stand a change.\n\nYou are gonna eat sniper rounds and survive.",
            "Wdym?",
            "It has seemingly no actual impact on the game or interactions.",
            "You need to complete all main Jobs in order to begin the endgame. 1 possible ending will be available to you. Before you begin the endgame, but after you complete these main jobs, you can start some side jobs that will eventually result in you unlocking other possible endings. \n\nThis guide will be updated in a day or so with more info about possible endings",
            "I can't say for sure they scale all the time, but i did notice during Spellbound when i returned to Nix the requirement for INT did increase by one. I had left the quest and came back because I originally needed 9 to get the extra eddies out of him but then when i came back a few quests later it was 10.",
            "They do scale",
            "[https://steamdb.info/app/1091500/patchnotes/](https://steamdb.info/app/1091500/patchnotes/)\n\nI don't see anything about new patch today.",
            ">!yes!<",
            "wander around? Look at the yellow exclamation points?",
            "No idea",
            "If you want. But there’s nothing we can do about it.",
            "You’ll find some eventually. Or upgrade things",
            "Is he running v2.0 and you’re running v1.6?",
            "Shoot the gun",
            "You definitely don't need to select \"think you and Rogue should go\" to access the secret ending, you can just say nothing and wait 5 minutes. I can confirm that through testing",
            "Here to confirm as well - just did this last night for the first time.\n\n...I thought it would be more difficult.",
            "Oh ok I tried to check but didn’t notice it pinned, I will try again.",
            "Add help thread to the title or sth so others who could help/looking for help can check in.",
            "Isn't it used to determine how Johnny reacts >!during the Phantom Liberty ending when you're in the AV ? In one playthrough, Johnny was pissed at me and  resented the fact that I was gonna erase him, in the other he was chill and said goodbye.!<",
            "[deleted]",
            "Good to know. Thanks!",
            "Happy cake day!",
            "i believe i finished act 1 and there were not more than five quests that way.",
            "okay that’s reassuring .",
            "it could be, i’m on an xbox one s and he’s on pc if that makes any difference",
            "Does anybody who isn't a nutjob troll on Reddit actually know how to get the bullets from the gun? I just started yesterday.",
            "Maybe. I think those dialogues change based on if you unlocked the rogue ending. Not sure though.",
            "Correct",
            "Thanks!",
            "You can see the version in the start screen in the top right",
            "There is no other way. Thats not a troll answer, it’s a fact.",
            "i’m on 1.61 and i think he’s on a newer version, am i limited to being on 1.61?",
            "This is not. The other one is 100% standard issue trolling on the internet. Especially when this could have been mentioned from the start.",
            "https://www.cyberpunk.net/us/en/update-2.0#:~:text=What%20platforms%20will%20the%20update,base%20game%20of%20Cyberpunk%202077.\n\nXbox One does not appear to be supported",
            "What are you talking about? I am the only one replying to your question",
            "oh alright thank you. also i can have multiple saves with different life paths right? i wanna start a corpo save but i still wanna have my streetkid one",
            "What don't you get? It seems pretty clear to me.\n\nA = Previous reply not legitimate. Which is the definition of trolling. Not an actual reply.\n\nB = Could have replied legitimately from the start.\n\nSo what do you not comprehend regarding what I am talking about?",
            "Yes",
            "ok thank you 👍"
        ]
    },
    "Night City Lo-Fi Radio: The community just collab'ed to make a fan-made Cyberpunk 2077 LoFi album with 100% of the proceeds going to charity! Check it out to support a good cause!": {
        "title": "Night City Lo-Fi Radio: The community just collab'ed to make a fan-made Cyberpunk 2077 LoFi album with 100% of the proceeds going to charity! Check it out to support a good cause!",
        "score": 144,
        "url": "https://youtu.be/oCIzK6--3FM",
        "content": "",
        "num_comments": 15,
        "comments": [
            "[This is a charity collab between r/CyberpunkGame and r/LoFiHipHop! 100% of the proceeds from this project will be donated to the Limbs for Life foundation, supporting prostetic care for amputees that would not otherwise would not have access to it! The best way to support the project / fundraiser is just to check out the video, but if you'd like to contribute to the cause directly, you can do so here](https://ko-fi.com/sageninemusic/goal?g=200)",
            "Lofi HipHop Cyberpunk Beats to netrun and zero chooms to",
            "Do y’all play a lofi version of pon pon shit?",
            "Good stuff, chooms!",
            "okay this is sick. if there was a mod where this was a radio station in the game??? peak",
            "Has anyone turned this into a RadioExt modded radio station yet?\n\nIn fact, they should do it and then they can route the donation points to a charity",
            "Omg please a spotify version so we can use it with the personal radio mod?!",
            "Zero gonks. Kiss your choom.",
            "Stop !\n\n![gif](giphy|S4H2ZREgH8c2EG6TmV|downsized)",
            "Or just upload it to spotify and there is a mod that adds a personal media radio station that works with spotify.",
            "Haha you’re right…in night city tho…",
            "Doesn’t that require Spotify to be running in the background (which is an alien concept to me but hey ho)",
            "Yes it does, basically all the mod really does is press pause or play automatically based on if you select the radio station or not/get in and out of a vehicle etc. \n\nBut also you can just start spotify without even leaving the game if you have windows game bar enabled (Windows Key + G) as it's an inbuild widget. \n\nI use it on top of custom radio stations so I can listen to whatever I want or them, best of both worlds, perfectly work together too.",
            "Seems like it would be better to just use RadioExt to set up a custom radio station, that way it can be controlled by other mods that interact with stations (i.e skipping tracks, making radio artwork etc)",
            "Well it is a custom radio station but for some reason it doesn't show on the radios in the world yea. But a custom radio station would be a set of tracks or whatever, like they all are, instead of the entire library of spotify."
        ]
    },
    "What do two lesbians bring on their second date?": {
        "title": "What do two lesbians bring on their second date?",
        "score": 1726,
        "url": "https://i.redd.it/arvf1zpg508d1.jpeg",
        "content": "",
        "num_comments": 163,
        "comments": [
            "Matching MaxTac uniforms.",
            "Everything. They're moving in together",
            "A U-Haul",
            "THEY BRING THE MOTHER FUCKIN RUCKUS.",
            "For V and Judy? Trauma, a lot of trauma.",
            "![gif](giphy|RqvQ7W20H8Ovmk3kSJ|downsized)\n\nJudy: I dunno\n\n*beep beep*\n\nJudy: V what’s that:.:\n\nV: Ooohhh just the moving truck…\n\nJudy:……  *beep*",
            "I guess we'll never know, since it's the same date every time.  According to CyberPunk.",
            "In general? A wedding ring and a moving truck.",
            "The scuba suit 😈",
            "5 things (coming from a lesbian)\n\n1. Extra set of clothes \n\n2. A drama movie (extra sad)\n\n3. Car air freshener ( because you know it smells like Wendy’s)\n\n4. Hair ties\n\n5. Double ended dilldo",
            "Hopefully more lesbians.",
            "Oh my days\n\nI don’t have my glasses on and thought that was a yellow dildo behind her 💀",
            "A Subaru, a wedding ring, and a sourdough starter for their bakery.\n\nKidding, love ya ladies",
            "Is the 2nd date too early for scissoring? ",
            "Toys and lots of lube?",
            "A uhaul. v makes this joke in this scene",
            "Popcorn?",
            "Eric Cartman Plush",
            "Sir John Phallustiff...",
            "A Subaru.",
            "I swear that joke has a hidden meaning that I don't get or it's not funny",
            "Banana",
            "A change of clothes",
            "A promise",
            "Lesbian? That just means she likes what I like",
            "Thought that was a banana behind her and had some questions.",
            "Emotional damage, nearly drowning, & Johnny S?",
            "boxing gloves",
            "A third girl?",
            "Still bummed she wasn’t romanceable as Male V.",
            "That side eye tho that Judy is giving\n\n![gif](giphy|H5C8CevNMbpBqNqFjl)",
            "Sir John as a non lethal",
            "a pair of scissors? idk, im not sure i understand lesbian culture 🧐",
            "House keys",
            "Awww. I was hoping there would be an actual lunch line.",
            "Why does Judy have a tail",
            "Probably some candles to light with that huge flame thrower from the first date.",
            "Two way dildos.",
            "A basalisk tank",
            "I was gonna say “scissors” to be funny but in reality I’d say a big fat joint cause I’m a stoner and I’d want to chill at one of our places and watch a movie with some Chinese food but that’s the opinions of a straight dude",
            "a u haul",
            "A digitised terrorist",
            "A very sad ending where ONE OF THEM. MOVES TO GOD DAMN PITTSBURG. WHILE I WAS IN A GOD DAMN COMA.",
            "BFC 9000 and Sir John.",
            "Sex toys, drugs and alcohol",
            "Scissors",
            "......scissors?",
            "Themselves",
            "A toothbrush lol",
            "The moving van and their cat",
            "Gatorade",
            "Matched pink pistols",
            "A lead pipe",
            "Why does she have a tail",
            "Looks like a yellow rubber dong sticking out of her back pocket.",
            "Domestic violence.",
            "A dildo",
            "ankle fracture",
            "Depends... what are they doing?",
            "Each other.",
            "Holding hands in Trader Joe's.",
            "Wait is it a thing that lesbians just move in really quickly?",
            "nail cutters",
            "A double ender and a toaster.",
            "marriage papers",
            "One under ripe banana 🍌",
            "evelyn's cigar, some guns, some tech and some nds",
            "Probably the same as two straight people seeing as it's only a second date.",
            "They could bring the Sir John Phallustiff or BFC 9000 weapons  :D",
            "A huge Strapon",
            "Sir Buzz Killington. 😏",
            "That post is in a right dodgy position lol. I had the same date with her and my V is male so she must be a pansexual.",
            "Dildos for a sword fight of course.",
            "Broken ankles?",
            "Scissors?",
            "a briefcase full of the finest BFCs.",
            "Clothes",
            "They’re scuba gear?\n\nWait, that’s a ladder",
            "I beat Tucker Albach unconscious and now she’s on the floor of my apartment whenever Judy comes over. I don’t know if she gets suspicious. I tried it with NPC’s but they disappear. I want to acquire a pile of them. Sometimes Judy just walks through them, and kicks them around like they’re trash when she comes over for a date. I lime to think she’s in on it.",
            "Adamn Smash forearm model.",
            "Their boyfriends because they haven't realized their sexuality yet.",
            "bibs",
            "![gif](giphy|MY44QmlRa8SBO)",
            "Moving truck",
            "...I still absolutely love her tattoos...",
            "Clams and stuffing",
            "Giant rubber penis",
            "hormone-blockers",
            "A celebrant.",
            "Nail clippers.",
            "Couch, tv, and plans to open either a butcher shop or a pickle brining facility",
            "Why’d I think the bar at the back was a dildo 😭",
            "In my experience they move Halla fast in relationships.\n\nKnow a frends that literally moved together when they knew each other like 3 weks.\n\nSo don't know much about date levels. But I think it would be a much bigger step then that is normal in Heterosexual relationships. At least in my experience with the bunch of people I have seen. The dynamics is very fast with steps",
            "Their home depot card and a pickup truck",
            "Cheese. Women love cheese.",
            "I wouldn't know, I've never been on a first date with a lesbian.",
            "A petard? I don't know.",
            "A snorkel, for diving",
            "![gif](giphy|XbCYVioitl3NHmS7wz)\n\nA gun",
            "Panam",
            "A fishy smell.\n\n![gif](giphy|Bng9nsAhSaDVxWsSLh)",
            "A 2 sided John Paul stiff",
            "one cup.",
            "[removed]",
            "Beings Scissors on there second date",
            "A receipt for their U-Haul rental",
            "That's the energy",
            "No joke. From the lesbians I've known and been friends with, they go from \"nice to meet you!\" to \"I do!\" so damn fast!\n\nObviously it's not all of them, but many get into very serious relationships very quickly.",
            "why is this post calling my gay ass out so much",
            "![gif](giphy|3ohzdHq4D1cdP4WwSs)",
            "Unless they already moved in together before they both realized they are a dating couple",
            "She does give you a key to her apt right after hooking up for the first time.",
            "our timeline was\n- first date: tea and lego building \n- second date: demoing her my favorite trading card game\n- third date: never ended",
            "One drives there in a Suburu, the other in a U-Haul",
            "GHOSTFACE CATCH THE BLAST OF A HYPE VERSE",
            "Well well well\n\n![gif](giphy|5SHpVP36FrpyE)",
            "🐝👐🐝",
            "everytime I see \"Ruckus\" it reminds me of Ruckus saying his deafult voice line in paladins \"RUCKUS... \" and then the bot \"and Bolt.... in the house...Why do I even say this?\"",
            "This is the TRAUMA TRAUMA~",
            "Go Trauma Team!\n\nOh, .....wait.",
            "You mean the whole trauma team?",
            "BREAKDOWN BREAKDOWN! LETS BREAKDOWN BREAKDOWN",
            "Frankly, I had the same reaction as Judy. I just don't get why lesbians move in together so quickly. Any answer would be appreciated.",
            "Give me that Gif. What's it's Name, where can I find it?",
            "Yea seriously what *days* do we play in the game? We know the time but never the day… Just that it’s not July per V’s quip to the Peralez’s",
            "Quality over Quantity",
            "And the tank so they don’t have to come up for air…",
            "6. u haul\n7. wedding ring",
            "Do lesbians like Wendy's? r/todayilearned",
            "5.) should have been Curly Fries (for Rhyming purposes)",
            "considering its cyberpunk, it isn't out of the question.",
            "Glasses, eh? I see how your mind works...\n\nAnd I raise my glass to you. 😆",
            "It’s an existing joke in the real world, there’s no hidden meaning.",
            "![gif](giphy|l0HlOy8SuKnbYWPss)",
            "Lol",
            "75% of lesbians marriage end in divorce quickly too only 25% in gays men marriage, that stunning",
            "*Oh my god they were roommates!*",
            "MY GLOCK BURST, LEAVE IN A HEARSE, I DID WORSE",
            "\"No relations\"",
            "TRAUMA²",
            "Dating as a lesbian is extremely difficult. Finding other single gay women is a struggle, *let alone* finding one who is your type, mentally stable etc. So often, when you find someone you click with, you're both motivated to move fast.",
            "Just use giphy and search cyberpunk 2077 or cyberpunk judy",
            "You can check the date on various monitors.",
            "Gunna get wet tonight.",
            "Where I’m from we do. It’s full of us.",
            "I thought it was saying lesbians smell like Wendy’s.\n\n5 and driver smelling like meaty onions after too much use; throwin off that pH.\n\n“I keep that thang under the passenger seat”",
            "Wendy’s doesn’t serve curly fries 😔",
            "This isn't a flattering statistic, but it is interesting.\n\nI also applaud gay men for such a low rate.",
            "The big question is who is more happy?",
            "I COME ROUGH TOUGH LIKE AN ELEPHANT TUSK",
            "Not Wu but I appreciate the all caps. Man's name.",
            "I never thought I’d see a comment in a cyberpunk sub that accuracy explains my life 😭😂",
            "Shit. I never found the date. Guess I gotta start another run then.",
            "the strange things is the mains 5 reasons of divorce in lesbian marriage are the same reason reported by women in straight couple divorce, how end 50% of the time",
            "YA HEAD RUSH, FLY LIKE EGYPTIAN MUSK",
            "My heart goes out to you... It really does.",
            "So when you remove men from the equation women are still unhappy with their spouse? Huh interesting.",
            "AWWWW SHIT!",
            "WU TANG CLAN SPARK THE WICKS, AN' HOWEVER I MASTER THE TRICK JUST LIKE NIXON"
        ]
    },
    "Close to 500 hours and i never knew about this!": {
        "title": "Close to 500 hours and i never knew about this!",
        "score": 975,
        "url": "https://v.redd.it/0wl7l0klgz7d1",
        "content": "This happens when you boot the game after the mission where you nab the mayo named dude Hellmeen, its so weird to hear Keanu say \"cojones\" but it makes sense for him to say it in the game xD",
        "num_comments": 51,
        "comments": [
            "Well i noticed it on launch cause i didn't have the game installed on an SSD.",
            "Played on PS4....I heard most of these far far far too many times. \n\nI personally want to either sink \"The Whale\" or microwave burrito bitch",
            "I know right? The various loading screens based on the story are so cool! \n\nNerve knee there was one for the VDB’s at their net runner hideout.",
            "C‘mon Johnny, it’s not like I knew that beforehand..",
            "I always like the Ruth Dzeng monologues, in part because she's voiced by Erika Ishii, who has done some awesome work with Geek & Sundry on actual-play TTRPG shows (and can also boast of having [played](https://youtu.be/04fipuaUCe4) Magic: The Gathering with Joseph Gordon-Levitt).",
            "I love how those little stories and cutscene images change as you progress in the game.",
            "well it's not V and panam really think about collateral damages when doing their stuff...",
            "Each main story quest changes the loading screen. [I made a video with all the differences](https://youtu.be/SH_DKybruKg):\n\n- prologue and act 1 are V's apartment\n- Post heist is the landfill\n- the one you're showing now, the kang tao AV\n- doctor paradox after talking to alt\n- arif iqbal after kidnapping hanako\n\nAnd some ones you might not have known, the epilogues have their own loading screens if you save and load during the epilogues:\n\n- Rogue, Arasaka, and Don't Fear the Reaper paths are in the afterlife\n- Panam and the Aldecados has the mining site you raid.\n\nBoth of the epilogues talk about the crashing stock price of Arasaka after your raid.",
            "Despite how fast games load for me now, I still use the loading screen as my phone time.",
            "Man so fun",
            "What is cojones?",
            "I just realized after beating this game like 20 times, that you walk when you hold down the left trigger (to zoom). This whole time I was messing far too much with my thumbstick, trying to match NPC walking speeds.",
            "I know right?! I can't stomach a cold burrito either...",
            "HEY YOU!  YEAH IM TALKING TO YOU!",
            "That’s why I wait till the loading screens finish the dialogue",
            "Damn, my game always loads so fast I’ve never listened to these. I’ll have to do that now.",
            "If we're being honest, that was partly Panam.\n\nShe probably deserves to be legendary NC merc herself really.",
            "Hot damn!",
            "Dawg… wtf do yall be doing to be playing one character for so long?",
            "I mod so much my game crashes often, I've experienced most of these",
            "God things like this remind me how much I love this game. I thought I played through for the last time before the sequel but may have to boot up again.\n\nI sincerely hope they learn from how much the community loves roleplay and really stuffs the sequel full of it. That and things like this that make you feel more in the world.",
            "Ig u only notice It on an hdd",
            "I never knew until recently. My friend was streaming the game during her first playthrough and she'd often go afk during while loading in.",
            "I actually forgot about this. Makes me wonder why NCPD didn’t put more effort (or any) into figuring out who did it. Would’ve been cool to see some NCPD vs Aldecaldo street fights",
            "the one with with cop woman interviewed on tv is also fun",
            "well that tell me that u have a ssd since my hdd  took ages i had listen to it no matter w",
            "You guys really skipped the loading screen?",
            "ONLY €$120 mill against a corp? Them be rookie numbers.",
            "I think this was meant for older consoles that had HDDs, (unless you swapped it like I did for my friend)  \nI'm on PC but this was really a cool concept, and it changes as you progress the story, shame it has some conflict with PL and main story and sometimes doesn't make sense to be seein certain one",
            "I got here on about 300 hours. Just randomly",
            "I mean it still asks you to \"continue\" by pressing (x) button on SSD so you can stay on that screen for a whole hour it wouldn’t change a thing . \n\nEvery time the background changes there is a new story that’s worth listening to .",
            "Same lol",
            "Lol",
            "Microwave burrito bitch makes a pass at you at the Black Sapphire but you can't say yes",
            "How is it on PS4? Or should I play it on some other console?",
            "Yeah my loads before the long silence ends, one time I was busy on my phone when it was loading, suddenly heard \"HEY YOU.... YEAH YOU!...\" Scared the shit out of me",
            "she also does work with Dropout TV.",
            "If I remember correctly, if you haven't completed some other main quests, the Dr Paradox loading screen adds the \"mikoshi, gotta get us there V, ASAP.\" Or something like that.",
            "Balls",
            "YOU CONNECT TO THE NET, RIGHT?",
            "Exactly, I don't get the HDD comments, this is literally content one chooses to skip by choice not because the SSD finished loading faster.",
            "If you have the option play it on pc or next gen as the ps4 version never got the 2.0 update or dlc plus makes the ps4 run hot.",
            "Recently started mine up again after a few years. You'd be better off playing it on another console if you can, PS4 never got anything past the 1.6 updates so it's missing some features and mine crashes every few hours. Drive too fast and you'll be waiting 30 seconds for the world to load around you. \n\nStill enjoying the game though! If PS4 is your only option, it's still playable.",
            "I wouldnt advise that version, I hewrd them because the loading screens take forever and it used to crash a fair bit.",
            "Haha yea I was just… “waaaaaaah, wait what?!” \n\nYOU THINK YOU’RE SAFE TAPPING INTO THE NET BUT YOU’RE NOT!”",
            "Thank you",
            "WELL, I WOULDN'T IF I WERE IN YOUR SHOES!",
            "I guess it is just cause a lot of people tend to skip stuff they are not forced to listen to :D",
            "I have both the PC and PS5 so I guess I will try PS5 then...thank you both👍🏽",
            "“Netwatch never sleeps”"
        ]
    },
    "Does anyone know how to access this area, if it’s a major spoiler don’t tell me, if not t b can someone explain how to get in here.": {
        "title": "Does anyone know how to access this area, if it’s a major spoiler don’t tell me, if not t b can someone explain how to get in here.",
        "score": 930,
        "url": "https://i.redd.it/o7i1a4aywy7d1.jpeg",
        "content": "Im on my 2nd play through and I’ve never once visited this area but I entered the house and it had a thin wall and a button that did nothing, stuff on the computer that looks like the guy  is pretty nice (althought it does seem pretty malicious), and I can’t enter the barn but it looks like theirs an area in it ",
        "num_comments": 83,
        "comments": [
            ">if it’s a major spoiler don’t tell me,\n\nSorry mate, but I have to tell this to you: **THIS IS A MAJOR SPOILER**",
            "The Peralez's will mention a cop you might want to talk to called River, he should call you. Its related to his quests.\nHave fun 😁",
            "> stuff on the computer that looks like the guy is pretty nice (althought it does seem pretty malicious)\n\n  \nHoo boy.",
            "Start talking to River.",
            "This is like the reddit banter about the red death in Fallout 4 subreddits right?  This can't be a real post.  The set up is just too perfect.",
            "You'll get there later in a mission with >!River!<",
            "It's related to a questline.",
            "This has gotta be bait",
            "I love how everyone in the comments agrees on \"let's NOT spoil this for OP\"\n\nThat's a rare thing to find on this site",
            "This was such a good quest.",
            "You could find the place on the map out of quest, but just do the Peralez quest, it will put in touch with River, and at some point you'll get there",
            "You’ll come to it in a mission arch involving a side character. Anything else will be a major spoiler.",
            "There's an interesting quest, you'll get there.",
            "You're telling me, you've had one playthrough and you haven't visited this place?",
            "Bait post. You obviously know something is here.",
            "River’s quests got bugged for me so I never got to do them, what is this place?",
            "You need to do River's quest line.",
            "If it is where I think it is...\n\nIt is a major spoil.\n\nI never realized how good the place is looking the day and... \"Before\" 😂",
            "\\*saluting\\* Major Spoiler!",
            "Ay mi madre, yes, this is a quest that you won't ever forget",
            "Please post your reaction when you learn",
            "It’s just a normal dairy farm. Nothing to see here. Totally normal cattle…",
            "Talk to River.",
            "do the river missions-",
            "Related to one of the most boring characters but an incredible questline",
            "Make a friend in the NCPD.",
            "Most important of all, let River drive you everywhere. When he offers you a lift, always take it.",
            "I actually stumbled on to this area after Judy's questline.  It's a stone's throw from the reservoir-side cabin.",
            "Ahhhhhh....... IIRC that's the location of the very best quest in the entire game. It's a shame the rest don't live up to it.",
            "Try doing more quests and it'll reveal itself",
            "make a screenshot by a kiroshi level 2",
            "Hang out with River",
            "I wish people would have left it at major spoiler and leave out anything else. Discovery is one of the best parts of this game.",
            "It's a side quest you can do after talking to River Ward",
            "OP, we demand an update once you finish the related quest.",
            "Ohboi",
            "OP is lying trying to get engagement on his post",
            "a companion quest",
            "Talk to River, his questline is amazing. Just dont try to get romantic with him",
            "It's a quest. It's not a \"fun\" mission in the slightest. A highlight of the depths that Night City can go.",
            "You don't want to go in there.",
            "Well I’m just now meeting Rivera so hopefully this is a well rewarding mission or something",
            "Yeah just recently had this, thankyou for this",
            "Innocence lost.",
            "Aye yai yai",
            "Is this the mayors computer or something? 😭",
            "Oh jeez",
            "Welp, this just got awkward…",
            "Total life lesson.",
            "Unlike the Red Death, this is unironically a nerve-wracking quest, legit it's actually disturbing",
            "The red death still gives me chills, it was harder than a dark souls boss",
            "Going to go speak to him, thankyou for this",
            "Do any major rewards (iconic weapons) come from this quest?",
            "I can DM you if you want. Don't want to spoiler openly",
            "Yes\n\nPay close attention to everything you see\n\nI'm not gonna spoil anything but just trust me and don't half-ass this",
            "Yeah River will call you back after that mission is done.  Just keep helping him out and you’ll come here during his questline but remember to check everywhere in that side house for a unique melee weapon.",
            "Good news is, since you’ve been here, you can skip a little bit of it, as you’ll be able to identify the location.",
            "You met Gerald of Rivera?",
            "Hahaha, that's what was weirs about my last playthrough! Totally forgot River existed.",
            "Damn now im wishing his name was actually rivera. Might have helped his game a bit",
            "You never met River on your first playthrough?",
            "just play through a certain questline and youll see",
            "I can't wait to see your post about this area after you finish the quest.",
            "And your saying the red death isnt??!!",
            "Yes, 2 iconic weapons >!one of them comes from the quest you get from River after finishing this!<",
            "What’s the quest called? I’ll look it up on YouTube so I can see a video",
            "Can confirm. Pay attention and don't leave.",
            "God this mission. \n\nI can't say anymore since I don't know how to spoiler on mobile but it was uhhh... *Sick*",
            "I had actually done that on my first playthrough, and then once 2.0 came out I never visited it before the quest and had to piece it together with River. It's a small but noticeable change foe the quest line",
            "Its easy to miss stuff in this game. My first playthrough I completely missed Merediths special little gig...\nI also missed scorpions final goodbye 😢",
            "River’s questline specifically",
            ">! Its called \"The hunt\". It makes sinnerman look like a lovely summer afternoon. !<",
            "Use \"!<\" and \">!\" at the end and beginning of a sentence respectively",
            "Even better: there’s two farms.  If you’ve only visited the wrong one, you can lead River to the wrong place, and fail the quest.",
            "This is true. I missed a lot as well.\n\nWhich is why if I saw something, I figure everyone did. lol",
            "Sinnerman wasn't really all that bad imo",
            ">! Like dis? !<",
            "There's some really weird hidden quests no one would probably know about without the Internet.\nUp by the dam where the 666 boys are there's a random bike in a random garage which used to be completely unmarked. You had to go off and randomly find this one guy in a city of thousands of npcs",
            ">!exactly!<",
            "!>hemburger<!\n\nEdit: I give up. No matter how I type this I never get it right",
            ">!Donuts!<",
            "You made the order wrong. It's like this:\nat first > at the beginning\nthen !\nthen \"Word\" \nthen ! again\nthen < at the end\n\nJesus I had to edit this 20x until I could show it properly."
        ]
    }
}