{
    "I’m Robin Williams. Director of Threat Intelligence and AI at Prelude Security. Former CTI manager at Home Depot. Here to talk about AI, threat intelligence, and automating CTI analysis. AMA": {
        "title": "I’m Robin Williams. Director of Threat Intelligence and AI at Prelude Security. Former CTI manager at Home Depot. Here to talk about AI, threat intelligence, and automating CTI analysis. AMA",
        "score": 146,
        "url": "https://www.reddit.com/r/cybersecurity/comments/1dkbrjj/im_robin_williams_director_of_threat_intelligence/",
        "content": "Hey folks,\n\nI’m Robin Williams, I’ve spent over a decade in cybersecurity, focusing mainly on threat intelligence and purple teaming. I previously managed the threat intelligence program at Home Depot and led security research at Prelude Security. In my current role as the Director of AI at Prelude, I’m building AI-enabled capabilities that transform threat intelligence into actionable detection rules, hunt queries, and more.\n\nI’m here to discuss my journey in cybersecurity, my experience running threat intelligence programs, building AI agents, leveraging large language models (LLMs), and much more.\n\nLet’s dive in—Ask Me Anything!\n\nEdit: I will do my best to answer the rest through tomorrow at 12 ET!",
        "num_comments": 109,
        "comments": [
            "What is it like having the same name as the actor / comedian?",
            "Vendors have yet to explain to me, as a practitioner in a smaller shop, where the value is in threat Intel.\n\n\nHow did you measure value delivery?\nWhat prereqs do you need to get value out of operationalizing threat Intel?\nWhat is minimal staffing for an effective Intel effort?",
            "What is your general workflow for collecting actionable threat intelligence? I had an entry-level CTI role and I often found that I didn't know how to find actionable threat intel. I setup STIX via TAXII servers from open source feeds like Alienvault and would add IOCs that were found by various twitter users. But it often felt like I was taking stabs in the dark and hoping that the IOCs were useful to our ISAC members.\n\nAlso, how do you know when threat intelligence is actionable? Do you correlate APT's and IOCs and then look into whether or not the APTs target the industry/critical infrastructure sector that you work with?",
            "What are the top 3 things you would recommend doing when starting a CTI program for a small inhouse team...",
            "Greetings Robbin William\nThanks for doing AMA.\nHere are my questions:\n\nWhat would be your advice to the new generation coming in Cybersecurity field.\nWhat do you think about the role of AI in Cybersecurity",
            "In a world where Identity Security is front and center, key and critical to protecting the crown jewels in any organization, what is your vision on how to protect against rogue NPEs such as AI within the confines of a business?\n\nTo add some context, nearly everything in the business that has access to data or resources, people and non-people, require access through an identity to leverage the interaction with data and resources. Given that LLM (read AI) is a type of non-person identity and the first of it's kind to have simulated autonomy, what kinds of mitigation strategies do you imagine are necessitated by the use of this new technology type?",
            "I have a few career questions for you, I get these often:  \n  \n1) Which cybersecurity specialization(s) do you believe are underrepresented?\n\n2) Which roles have been the hardest to fill in your experience?",
            "How did you convince senior leaders who didn’t have a tech background to take the threat seriously and actually do something.",
            "What happened to Prelude’s co-founder? All mentions of them have been removed and seemed like they left in a hurry.",
            "Where is AI most likely going to be innocently (not malice) mis used and what can companies do to steer users to appropriate use. \n\nWhere would you like NOT to see AI in it's present form.",
            "What was it like to work with Matt Damon in Good Will Hunting?",
            "Greetings Robin, just stumbled into the AMA and there is a topic I would very much like to know your opinion on.\n\nWith the rapid increase of AI based detection tools, there is a growing number of \"black box\" detection systems that hide the information that lead to a trigger from the analysts.\n\nHaving been in the position of building AI agents, how would you go about ascertaining the indicators that lead such an agent to consider a file/data packet/behavior as malicious and how will analysts be able to rule an event as a false positive without having knowledge of what exactly was the trigger?",
            "How do you get stakeholders to adopt and utilize a CSAP platform? Our platform is up and running, but not many of our external to Cyber Security stakeholders are in there currently. \n\nAlso, how do you approach onboarding new stakeholders into the platform so that they get the most value?",
            "What tasks do you generally include in purple teaming? I’ve heard purple teaming described many different ways",
            "Ok, help me with something I am currently fighting. I need to come up with a way to quantify risk, and it has to be based on CTI. Like, if group A likes to attack our vertical, and they do these TTPs, how many dollars is that risk worth? \n\nI've looked at FAIR and some CISA guidelines, but there has to be a better way, right?",
            "if you had to learn again how would you do it? I'm currently following Cisco's skills for all free online course but I'd delighted to get your input.",
            "What are you actually using AI for in the context of security? What has been your greatest challenge when dealing with noise?",
            "What was the most complex attack you prevented at Home Depot?",
            "The thing is, vendors care most about their platform beeing adopted, which is relatable. Imho if the industry would cooperate more, implementing standards and promote collaboration, blue team work would add more value to everyone.\n\nFollowing the next gartner hype cycle seems like a circus lost it's true purpose. \n\nNow throwing ai at everything because of fomo won't help infosec at all. Does your team contribute to open source and give back? Without knowing your platform i bet that there's at least 50% open source libraries on board.",
            "Is HD's IT and InfoSec teams as much of a contractor laden, miserable, low morale environment as rumored around Atlanta tech circles?",
            "I loved you in patch Adams",
            "Are all threat intelligence software centric? What about physical security?",
            "Do you get confused about the word salad that you identify as? Why should we care about you?",
            "What would be your recommendation for how SEs should approach customers?",
            "What are your favorite resources to stay up-to-speed on TI & AI?",
            "What have you found to be an underappreciated skill set in purple teaming?",
            "How would you go about bringing a team out of the vicious cycle of becoming a glorified RSS feed? \n\nAnd second part; if you were starting as an analyst and told to get operationally (not tactical) based intelligence to support both incident responders and detection engineers.... Where would you start",
            "I’m a senior GRC person (5 year) with some CTI experience (1 year) in the past, looking to transition back to CTI but don’t really want to go back as a junior. Do you think GRC to CTI is a viable transfer / any tips?\nThanks!",
            "If you were hiring a new grad, what skill must they have and what skill will push them to the top?",
            "I thought u were dead....But hey,...loved you in 'Dead Poets Society'....jk😅😅...Do you think SOC analyst role is gonna disappear in the next 2 years",
            "Are you hiring? :)",
            "shout out to VC - Chemistry",
            "If you’re looking for people with a clearance and I can remote I’m open for discussion.",
            "What do you do when extensions persuade you to get a discounted purchase from a different retailer?",
            "What 'technically innovative' product features have you been most excited about? \n\nDo you have any guidelines - formal or informal - for determining when a problem would benefit from an AI solution vs. traditional automation/scripting?\n\nThreat Intelligence, as I understand it, consists of importing external Observables & querying for their presence in internal data sources. How does AI fit in to that? Are we... predictively generating conceivable UnObservables...?",
            "Hey, thanks for being here, really appreciated!\n\nI really want to get into the CTI-side of the business (currently in Vuln Mgmt) but I don't know where to start to get hands-on experience without having a clear purpose (like an actual job would provide).\n\nAny tips?\n\nThanks a lot in advance!",
            "Hi u/EnoughAbrocoma5190,\n\nWhat are the good references in starting a AI security policy for a corporate or government entity? Is the AI RMF from NIST a good starting point? Thank you.",
            "How do you get good labeled data?",
            "I just graduated with my bachelor’s in cyber and hold cysa+ and sec+. I have been applying to cyber positions for months now, with no luck. I have an offer for an operations program at bank. Do you think i should go for it or keep looking for an entry level position in cybersecurity? If not what path do you recommend to follow and get my foot in the door?",
            "Hey Robin, thanks for doing this. What's the half life (before it's expired or no longer true positive) of the threat intel your AI is discovering?",
            "I can definitely appreciate the speed of gathering threat intelligence to determining potential impacts and deploying IOCs or alerting stakeholders of which vulns are getting attacked in the latest campaigns. prior to building a solution, which solutions did you use, how many people did you have, and how did you measure your success?",
            "Why can’t I use homedepot.ca on an Ubuntu system?\n\nIs this an IDS/IPS OS scan rule?",
            "How can someone new get in the field when there are so many gatekeepers for cybersecurity.",
            "What resources do you recommend for learning how to build AI agents?",
            "Digital signature are really digital seals. Why do we give the same legal status to digital signatures (really digital seals) that we give to physical signatures, but do not give that status to physical seals.",
            "Why did you leave us :(",
            "Is threat intelligence valuable from a business perspective to SMB’s? Do you think this is something they would be willing to pay from a MSSP.",
            "Hey Robin, I actually work at Home Depot as a in-store associate, I’m about to graduate in August with a bachelors in Cybersecurity and Information Assurance. It’s been rough applying for jobs in the field and getting little to no responses. I even applied for cybersecurity jobs within Home Depot and gotten no responses yet. \n\nAny advice for someone who’s starting out in the field trying to get their foot in the door?",
            "Is there a way I can build a custom threat intel platform for free without paying half a million for a product that just pulls stix data and RSS feeds? \n\nShouldn’t a true threat intel platform (who claims to scan the dark web for data) be able interpret Korean and Russian and all the languages of the world of attackers and identify if the company is at risk? Also who invites you to their private telegram channels to decode messages?",
            "Hi Thanks, if an organization receives a bunch of iocs regularly what the steps should they take to convert to detections? What study materials and framework would be ideal to get stronger in threat intelligence? Thank you",
            "Hello ... I work for a startup; we are a fintech dedicated to solving the most complex problems in money movement. We want to implement a project to automate user creation within the company's internal applications, which would streamline the onboarding process. What strategy do you recommend to achieve this without spending more than $300K on a license for, for example, Teleport, Cyberark, Savyint, or Apono?",
            "What’s your opinion about the huge Cdk cyber attack on 15,000 dealerships? And still not resolved going day 3.",
            "Hello Mr. Williams. I’ve been interested in cyber security as a career for sometime, but never took the plunge. I’m a 39 year old copper, worked as a Patrol Deputy and Municipal cop for a combined 10 years of service. Seeing and bagging dead bodies, responding to domestic violence calls, dealing gang members, violent offenders, going to court, and getting shot at, longer fits my lifestyle. Investigating corruption is cool, and rewarding. But the assignments for that are few and far between in my area.  \n\n My question would be, is it too late in the game for a career change? And do you have any advice or guidance on the matter of what type of path in the field of cyber security would best suit the education and experience of a middle aged cop?  \n\n I really just want a healthy work / life family balance. I started an introductory course on cyber security with coursera. But aside from that, I honestly have no idea. For what it’s worth, I used to build and sell home brewed gaming PC’s in my younger days for fun, and have some experience with Linux OS. So I’m not a complete dinosaur, just need some one with experience to point the way.  \n\n Thanks for doing this AMA. You’re a gentleman and a scholar. \n\nEdit: I’ve been looking into cyber security Bootcamps, are there any that you would recommend? ",
            "The AI agents in attacks are going to be huge it’s just starting too. Next year or so is going to be a huge nightmare for a lot of companies lacking defenses and skimping on proper ITC staff.",
            "Hey Robin! \n\n\n\nI'm an Ex Cyber Intel Analyst from Lockheed Martin's SOC :)\n\n\n\nDo you have any experience with NDR? (Network Detection & Response)\n\n\n\nIf yes, did you find TI feed ingestions useful?\n\nIf yes, did it help you generate higher quality TI?\n\nIf yes, did it help you with threat hunting?\n\nIf yes, did you find it to be useful in general?\n\n\n\nIf no, have you heard of it? Considered it?\n\n\n\nWhat are your thoughts on behavioral models for detections?\n\nHow are their TP/FP rates?\n\n  \nCheers,\n\nGrayson Berman",
            "Should i quit ?",
            "Depends on the day! haha",
            "Scary thing happening on the Internet elsewhere, and I'm here to spook you.",
            "I'd start here:\n\nI like to follow these general guidelines for actionability to start:\n\n1. Relevant: ex: Is the threat relevant to your organization’s industry?\n2. Accurate: Is the intelligence verified and cross-referenced with multiple sources?\n3. Timely: Is the information current and does it provide a window of opportunity to mitigate the threat\n4. Specific: Does it include specific details that can be acted upon (e.g., IP addresses, malware signatures, behaviors)?\n5. Context: Does it provide enough context to understand the threat’s potential impact and required actions?\n\nGetting answers to these questions right away is a good start to determining action/if is actionable.",
            "I like to follow these general guidelines for actionability to start:\n\n1. Relevant: ex: Is the threat relevant to your organization’s industry?  \n2. Accurate: Is the intelligence verified and cross-referenced with multiple sources?  \n3. Timely: Is the information current and does it provide a window of opportunity to mitigate the threat   \n4. Specific: Does it include specific details that can be acted upon (e.g., IP addresses, malware signatures, behaviors)?   \n5. Context: Does it provide enough context to understand the threat’s potential impact and required actions?\n\nGetting answers to these questions right away is a good start to determining action/if is actionable.\n\nCorrelation should absolutely be a part of your process with threat intelligence.",
            "The basics work well.",
            "It's exciting and if you have an undeniable passion and obsession on the problems you are trying to solve nothing else matters.\n\nAI is set to augment and accelerate but with the caveat of knowing and understanding it's current imperfections. Humans still make mistakes and we should expect AI too as well.",
            "I think a fair bit of IAM applies to this problem. I also think AI doesn't need access to everything. It should be limited and controlled and have it's own ID and such as a user within the organization. Data access controls etc. I think a multi-prong approach works well here and industry likely has solved this in some ways already with IAM.",
            "1. Risk and compliance.   \n2. All of them are challenging and continue to be for hiring.",
            "We must recognize this as very painful to start.\n\nProof is a good start. Why is the threat serious? Why is it serious for the senior leaders in the room? \n\nI like to approach things like from the business perspective and understand what the business loses if this threat turns its sights on any inch of the organization.\n\nIt is ultimately up to the business to make the decision that's best for the business despite ringing the alarms and i understand all too much how that feels.",
            "Innocently tossing your companies data at AI without understanding how that data is being used once it leaves your hands. A lot of the times your data will be used for training future models for example which might not be something you want to have happen with internal documents for example.",
            "What good is a \"black box\" model if we can't see the decisions being made behind the scenes? Is really the first thought I have for this one.   \n  \nI personally believe we can protect what is important for business while allowing transparency so everyone knows more about the what and why when they're using the tools. It's something I think the cybersecurity industry is very lacking in currently.\n\nWe can do this by being honest about current capabilities upfront and working together to make those capabilities better through transparency in the decisions being made and allow folks to adjust those decisions at any point.\n\nSeeing is believing. imo and we must show each step along the way and the thoughts behind the decisions.\n\nBut black box or not I should know when a change is made in my environment the instant it occurs and all the steps that were taken and why.",
            "Imo. It depends on what the goal of the exercise is. Does it need to be handled in the traditional purple team sense with only attack + defend or can more be brought in.",
            "I'd recommend you look into cyber insurance firms. They have their own recommendations and methodologies for evaluating loss and probability. You could probably engage with local firms as a mean to get insight into where their decision points start.",
            "From my experience, no. But I don't speak for every part of the environment.",
            "I can tell you the boots on the ground staff does not approve of any of their internal inventory or POS system. I get told often how separated brick and mortar is from Corporate…it’s weird.",
            "1. Yes.  \n2. You shouldn't. You should care about the problems in cybersecurity not me.",
            "Oh I use so man honestly and they shift around for me personally. I like combinations of social media + more corporate level reporting.",
            "suffering.",
            "Make it actionable and don't stop until it is.",
            "I would use your GRC skillsets to aide and accelerate your intel skills. The business has to understand the risks of indecision more rapidly.",
            "The ability to find the answers you seek no matter what.",
            "No I do not. Hopefully accelerated though!",
            "I think AI RMF is a good start. CISA/NSA have also released some guidance.",
            "Congrats! That's a good question! I think there's benefit to having hybrid skill sets within cybersecurity so I would go for it it was me and keeping looking for that foot in the door.",
            "I feel like there isn’t enough gate keeping. So many people in the field who know nothing and are essentially paycheck thieves.",
            "That doesn't answer the asked questions at all. If 99% of your Intel doesn't match the criteria you've laid out, it's basically a waste of effort v redeploying those dollars elsewhere. How are you showing value/ROI on the licensing and staffing? How are you justifying Intel over other investments?",
            "Thanks ChatGPT",
            "Industry targeting was a part of the threat intelligence zeitgeist when APTs were sloppy.\n\nJust imagine what needs to happen for someone to draw that association. A vendor has to correlate that information for you between their customers. No vendor has a significant sample size and most have gotten worse at attribution.\n\nEvery type of threat actor from governments to 15 year olds has shown if they have a chance to indiscriminately compromise a bunch of people they will.",
            "Complete non answer lmao",
            "True this. AI will do it 10000 faster though. The Analysts are going to have fun and those companies lacking proper defenses and resources are gonna get hit hard.",
            "I mostly agree, with a few caveats. In my experience IAM can often have a scope that is too limiting, especially when looking at the bifurcation between sensitive and non sensitive data sets.\n\nGiven that the general organizational maturity around holistic Identity Security practices is very low, it may be that assuming these key and critical controls are already in place is giving enough of a wide berth on the requisite controls relative to the Identity Security implementations.\n\nOr, I could be completely wrong and there's nothing to worry about...",
            "Risk and compliance is very non sexy, very dull work. But a necessity…",
            "How do you suggest people learn? Most entry level positions in cybersecurity requires you to have 3-5 years cybersecurity experience..which defeats the purpose of it being \"entry level\" and certification and online can only teach you so much without having real world experience.",
            "I will give you an actual answer. Imagine you get hit by a common malware. A big org barely cares because they have a fancy EDR that can let them go on autopilot. \n\nThreat intelligence, at least technical intel, COULD help you block proactively or before a second stage reaches your asset. Its hard to evaluate, for sure, but that’s the thing with threat intelligence. It is what you make it unless youre a big organization.\n\nVendors also offer lots of other things which are clearer value adds. Compromised credential monitoring, domain takedowns, or monitoring if someones selling your data. Youre right it’s harder to get value from those as a smaller org. What youre paying for is quality of data, most often, not tangible defense.",
            "I don't. I think it's all important the dots have to be connected to other areas of the business though to justify anything over anything.\n\nYes 99% of it doesn't match but what is the 99% telling us? How can we use that despite the criteria.   \n  \nNot saying intel should be more important in this case but we justify spending millions on vulnerability management yet we continue to see high levels of exposure to vulnerabilities or low and slow patching. Where else is money being wasted? I think the justification comes across several point within the organization, buy-in, exercises, etc.   \n  \nPaying for intel is expensive and a whole bunch of other factors you have to justify through. I have personally done it by bringing intelligence into Purple Team exercises more deeply so even just working with what you have as best as possible seems to be a good course of action if the intel fails to meet criteria.   \n  \nYou have to do it accelerated as the intel decay's etc etc so having some automation is helpful.   \n  \nHow fast can we just make this intel actionable? filtering, correlation, etc  \n\n\n1. Detections  \n2. Control testing  \n3. Threat hunting, etc.\n\nIs there value to having a threat hunt come from the intel? I think so. Maybe not in all cases but in some but its very specific to your needs.",
            "you're welcome.",
            "Then you're doing it wrong.",
            ">Most entry level positions in cybersecurity requires you to have 3-5 years cybersecurity experience..\n\nThis is both untrue based on personal experience and just 10 min of looking at analyst jobs open near me. Many of the jobs are looking for this experience:\n\nBachelor’s degree in computer science, Information Technology, or a related technical field or: An Associate degree in Computer Science or related technical field plus 2 years of relevant work experience\n\nThis is aligned with my experience and everybody I know from my graduating class. We were are all able to find an analyst job with just our college degree and internship experience during college.\n\nWhat happens in most instances is people will work in these entry level analyst jobs for a few years. While working in these jobs you don't really learn anything beyond surface level understanding of anything. Then they apply for the very high demand senior positions that you should have a lot of technical skills for. Because you never really learned much beyond surface level you're very incompetent.\n\nThe people hiring are also normally from the same background and pretty incompetent. In general if you're able to just speak like you know things, you can get by without any deep knowledge. It's led to an environment where less than 10% of security professionals are actually effective. Blind leading the blind.\n\n>How do you suggest people learn?\n\nThis is hard. I'm still part of what I'd consider the blind. I feel like a paycheck thief. What's wild is that I know more than people in senior positions that are earning more money. I don't feel like there are many structured learning paths for digging deep below the surface. I've had great experiences with SANS. Taking FOR508 and obtaining my GCFA was amazing and helped me learn a lot about DFIR. I was able to use what I learned from that course to start digger deeper following my interest. SANS isn't really a great solution though because it's very expensive and not all orgs will be willing to pay for it.\n\nI've had the most success finding something that I think would be cool, then backtracking and learning everything I need to be able to accomplish it. Two things I wanted to do that gave me the motivation to learn more and dig deeper were: creating video game cheats that could bypass anticheat & creating harmless malware that could bypass windows defender so I could mess with friends.\n\nThese two goals lead to me learning some C, Python, and Assembly. Learning how malware is designed. How to obfuscate code and different kinds of encryption. Modifying malware to avoid signature based detections. How to avoid certain heuristic/behavior based detection. How to inject code into other processes. How Windows Defender works. Learning about intercepting and modifying game function calls.",
            "Appreciate the feedback. This reinforces my thoughts that Att&ck coverage with log monitoring is far more valuable than threat intelligence if you have the analyst skills. We've consistently seen threat intelligence data as stale, and stuff that's been lighting up our behavioral and signature alerting for at least a week before it shows up in feeds.\n\n\nI suspect Intel is only valuable at the far left and right of the maturity bell curve. You need to either have no dedicated analysts, or be a Microsoft.",
            "From a budgeting perspective I could very easily hide threat intelligence in Cybersecurity / IT and not even put a dent in the budget. As far as justification it’s not that hard. The sales team selling the product can help you with that",
            "These guys are really hung up on threat intelligence. Dude is protecting homedept not the cia.",
            "Well yes, behavioral detections eat signature-based detections for breakfast. Wouldn't you rather smack the pen out of someone's hands instead of waiting until after they write their name?\n\nAlthough I might not go that far, I think there's a way to get some value at any org, I understand the sentiment.",
            "I'd say that ATT&CK itself is part of Threat Intelligence concept, since techniques are being developed over information regarding real attacks and Procedures are provided for each techniqe, giving you example of how threat materialized in terms of given Threat Actor.\n\nHow would you design behavioral detections, if not by reviewing/analyzing information about TTPs provided by Threat Intel?\n\nDon't consider Threat Intel as only IoCs, there are huge parts of it operating above it.  \nThere are 4 domains: technical, tactical, operational and strategic :)",
            ">...is far more valuable than threat intelligence if you have the analyst skills.\n\nThis is where ROI is tied directly to the maturity of an organization's security department. Vendors add value when they fill gaps in an org, but not when capabilities already exist and are being leveraged.",
            "My thought isn't that intelligence is useless. It's that the intelligence that vendors are selling generally isn't worth the money."
        ]
    },
    "Mentorship Monday - Post All Career, Education and Job questions here!": {
        "title": "Mentorship Monday - Post All Career, Education and Job questions here!",
        "score": 29,
        "url": "https://www.reddit.com/r/cybersecurity/comments/1dhkxcn/mentorship_monday_post_all_career_education_and/",
        "content": "This is the weekly thread for career and education questions and advice. There are no stupid questions; so, what do *you* want to know about certs/degrees, job requirements, and any other general cybersecurity career questions? Ask away!\n\nInterested in what other people are asking, or think your question has been asked before? Have a look through prior weeks of content - though we're working on making this more easily searchable for the future.",
        "num_comments": 245,
        "comments": [
            "Hello everybody, went back to college after 9 years, decided to pursue cybersecurity analyst certificate before pursuing my cybersecurity degree, my college has a course where I take 2 semesters to get the certificate, it also counts as college credits. \n\nNow I don’t know much about where to start on my free time when it comes to getting a headstart before the fall semester starts in august. I’m current taking 1 class at the moment which is CIS-1 Intro to Computer systems. I have ADHD and have trouble taking notes and all.\n\nI have no experience in anything at the moment, just typing skills lol. \n\nAlso thought about the US NAVY for CTN.\n\nAdvice, recommendations where to start and all welcome. Please advise.",
            "I've been doing an internship for nearly a year now (and I could potentially stay up to 2 years). I'm hoping for a full time position to be offered but having worked in infosec do I need to do the typical help desk job before moving into an infosec role? (I have my associates and A+, Net+, Sec+, SSCP, and GSEC, if that even matters).",
            "Hello everyone. I am curious to hear opinions on the odds of getting an entry level cyber security job (leaning towards blue team) with no IT work experience, no degree in Cybersecurity (degree is in psychology) but with Google IT support professional certificate, Google Cybersecurity Certificate, CompTIA Security + certificate and blue team level 1 certificate. I have been reading and studying the field closely and listening to what others have to say and it seems like landing the first job is rough. I will not be discouraged by what anyone has to say I am all ears. Thanks.",
            "Recent college grad in the process for a few months now, trying to figure out how to get into the field. While doing so recently I stumbled upon the career pathway website from [Cyber Seek](https://www.cyberseek.org/pathway.html). I'm still a bit lost of what direction I should be going based on my current experience. I would also say I'm lost because I'm trying to learn a lot of different things. In my experience attached below, what feeder role do you think best aligns with my current experience and skills so far? Would love some tips or guidance.\n\nSkills: Troubleshooting, Technical Support, Technical Writing, Linux, Java, Python, R, PostgreSQL, ServiceNow, Jira, \n\nGovernance, Risk, Compliance - Audit Intern:\n\n* Developed 36 role-based training modules to support the Security Governance framework, standardizing security responsibilities organization-wide.\n* Executed data protection projects, ensuring compliance with privacy standards for Personally Identifiable Information.\n* Assisted in the refinement of Security Governance documentation, bolstering the company's compliance and risk management.\n* Concluded the internship by delivering a presentation summarizing the experience and providing constructive feedback to the organization.\n\nCashier experience\n\nLead Help Desk Worker at my college’s music library                                                            \n\n* Provided technical support with computer, phone, and tablet devices, ensuring a seamless digital experience within the facility.\n* Provided comprehensive assistance to library users, improving the accessibility and utility of resource directories.\n* Acted as an intermediary for interaction among students, staff, and visitors, achieving effective communication and maintaining high satisfaction in service delivery.\n\nWorking on virtual homelab rn\n\nThank you for any advice given!\n\nTLDR: Based on my GRC-A internship and lead help desk worker experience, what cybersecurity feeder role should I be going after to narrow my searches and learning?",
            "Hi everyone, \n\nI am in my early 30s. And would like to work in the cybersecurity industry. Here is a bit about my background, my plan, and what i hope to achieve. Please advise me. Thank you!\n\nI hold an AA in business admin, and for the past 10 years I have worked as a technician that deals with 3D imaging software and the equipment that captures these images. (so i do a lot of part replacements, and calibrations). I also have the general knowledge of PCs. (From building them, trouble-shooting, networking software, and database migrations.) Within this job I have done helpdesk for multiple years when I am not on the field. \n\nThese are the certs I hope to get within the next year. \n\nComptia A+ , Comptia Networking + , and Comptia Security + (And possibly eJPT from INE)\n\nAnd at the same time, I will also begin the learning process by participating in discord communities, practicing capture the flag activities, building a home lab, reading books on IT, and networking with others within the industry.\n\nI hope to get a job as IT support specialist. Then as career progression Network Administrator, Systems Administrator, or Information Security Analyst.",
            "\nHi guys! I'm 24 and I've been working as cyber security consultant for almost 2 years now, I've a very standard salary and I work in fully remote so I can't complain that much, but I start to feel a bit stuck. I would like to take a certification and then find a different job, to take my career into the next level and to find the right motivation to improve my skills because I don't know very much honestly. I've started in a very entry-level position and I still do very simple stuff in my company, like vulnerability assessments or helping my collegues in penetration tests by testing some vulnerabilties with the help of automatic tools like Qualys, Nessus and Burp Suite. What do you recommend for someone at my level and with this type of experience? Thanks in advance!",
            "Hello everyone. I have 4 years of experience in IT as RPA deveoper, almost 2 years as a Business Analyst and  Product Manager in IT. I also have an MBA. Planning to switch to cybersecurity.\n\n1. Would it be easy to switch?\n2. What would be some good roles?\n3. What courses/certifications can I take?\n4. How long would it take to make the switch?\n\nPlease, advise me.",
            "Should I do linux +?\n\n\nI am doing some certification classes with my degree with the college. I finished my bs in cybersecurity. I'm going to do sec +, cysa +, I was wondering should I do linux +? I want to do soc analyst and somewhere along the line maybe to pen test. I know certs don't guarantee work but I have no experience. ",
            "How do you actually remember stuff? Yes I take notes but how do you guys remember them? especially hands-on projects?\n\nEspecially on Interviews where you have to explain what you did on this certification or on this project?\n\nThanks!",
            "Where should you start if you have zero prior knowledge or education?",
            "Hello, I was recently hired as a cyber security engineer, they have asked me to to everything, check for vulnerabilities, put them as tickets, check up with the guidelines, conduct security training etc etc. \nThis is my first job out of graduation. As well as there is no one of cyber security in my company, how to proceed?",
            "What should my focus be? \n\nI’ve been active duty Air Force (E-7) for 16 years. I’ve been in a cybersecurity career field for 10 of those years. Unfortunately, most of the positions I’ve been in during that time are not very technical. I have some, but limited experience, with vulnerability scanning, RMF, and incident response. The past few years I have been in positions that focus more on leading people and their wellbeing. Meaning, I don’t have much technical experience. \n\nWhat I do have…obviously a clearance, Sec +, CASP, bachelors, and masters, both in cyber security. \n\nI plan on staying in the military at least 4 more years and hope to gain some more certifications during that time (CISSP, PMP, CEH, etc…)\n\nWhat should I be focused on now to better prepare myself to enter the civilian job market? \n\nThank you!",
            " \n\nHey, I hope you’re all doing well. I was hoping I could get some advice. \nSo I have been working in my current company as a SOC Analyst for 5 months and am trying to pick what certificates I should focus on. \nI have the Google Cybersecurity Certificate and did some training with Black Hills Information Security. That’s all. I know that neither of these things have much, if any weight, in the job market. So I would like to get some more certificates under my belt to make myself more employable in the future. \nMy long term goal is to get into cloud security, but that is definitely a few years away.\n\nMy certificate plan for the rest of this year:\n\nJuly: Comptia Sec+ 601\nIt is the last possible date that you can take it, and I plan on buying the test by the end of this week.\n\nNovember: CCNA 200-301\nI want to do this one because we often have networking issues at work, and I would like to be able to help. I have done a lot of studying for Comptia NET+, but I do not want to take both test and CCNA seems to be worth more.\n\nDecember : AWS Cloud Practitioner Foundational\nI am not sure I will be able to study for this one along with CCNA, so I might not be able to take in until next year\n\nNow onto my questions:\n\nHow does this sound?\n\nSince I am currently working in a SOC and can put that experience on my resume, should I even bother with SEC+?\n\nAre there any certs that you all recommend? \nI am still new to this world and there is a lot I don't know. So any help on what Certs are actually usefull would be great.\n\nI would also like to get Blue Team Level 1 (and 2), but I can’t afford it and my company won’t pay for any of these certificates. So those two will have to wait until next year, if I even go for them. I am not sure how useful they will be for the goal of working in cloud security.\n\nI also plan on getting a python certificate next year.\n\n \n\nPs.\n\nYou might all be wondering “How did he get a job in a SOC with no “legit” certifications?”\n\nWell, I speak English and Japanese and the company I work for had just opened their SOC department and was looking for bilingual people. They have been “training” me up over the last few months. In short, I got lucky. I am sacrificing pay for practical experience, but I believe that it will work out in the long run",
            "Hello yall, I've recently decided that I'd like to pursue a career in cybersecurity. Really, I'd just like to know if there's anything I can do to improve my chances of landing a job in this field over the next few years or sooner. \n\nSome background info about me if it helps:\n\n- I'm 18, and will be entering college this fall to pursue a degree in CompSci (I don't know how much this helps if at all, but I'd like to land something by the time I graduate.)\n\n- I've participated in an internship over the summer with a moderately sized IT company for the past 3 years, mainly doing work as a field tech for the local public school system. I also plan on doing similar work while I'm pursuing my degree.\n\n- I'll also be completing the A+, Net+, and Sec+ CompTia certifications once I've saved enough to purchase the courses. (I read that these were the best to get your foot in the door for IT?)\n\nIf there's anything I could do to or something I should change to increase my chances of breaking into the field I'd greatly appreciate any advice.",
            "Hi everyone, hope you’re having a good Monday, I’m a postgrad student with no work experience shifting from engineering to cybersecurity. I have a sec+ and two labs related to Siem and phishing respectively. What would you suggest I do to get my first job and where would you suggest looking for jobs. Ps: I’m an international student in the country I’m in.",
            "Hi folks,\n\nHope y'all are well.\n\nI'll keep it short and sweet.\n\n----------------------------------------------------------------------------------------\nMy background:\n\nRecent law grad (L.L.B) from South Australia who is seeking to swerve into cybersecurity GRC rather than the traditional lawyer route. To be clear I'm not a licensed law practitioner, and I don't plan to be one either (as off yet). The intensity of the workload in pure law was a bit much for my anxiety.\n\nAlways been a self learner so was naturally drawn to the mentality in cybersec. I'd been prepping for cybersecurity on the side because I had this idea in my mind that there's not many professionals in law with a Cybersec background and vice versa. So it just made sense to pick it up. Now my main goal is getting into a law-cybsec hybrid position. I find red, blue and purple equally interesting so I'm just keeping on open mind on that end.\n\nJust finished Google's cybersec professional cert. Currently prepping for CompTIA's S+ and maybe A+ and ISC2's CC. \nI also understand that it would be important for me to do courses on the most used compliance frameworks used in Australia. Not too sure how I'll be going about it just yet.\n\n----------------------------------------------------------------------------------------\nMain queries:\nGiven I have basically no cybersecurity work experience and I wish to enter GRC;\n\n1) What certs should I be doing? I've seen people gunning for CISSP but that requires prior work experience. So in particular, what are entry level certs for GRC (if there are such certs at all)?\n\n2) How would I go about leveraging my legal background in cybersec GRC? There isn't an entry role per say that I can see online. So I'm imagining I have to work my way up to a GRC position. But how does one do so with my background? What would like look like?\n\n----------------------------------------------------------------------------------------\n\nOpen to any other recommendations and being educated on other perspectives.\n\nAny help would be greatly appreciated!\n\nP.S. Maybe I lied about it being short. My bad G",
            "I'm going to university this year hopefully provided I meet my offer, either Imperial College or King's College (I'm in the UK). I'm going to study Computer Science with a year in industry, and from what I've heard, they usually push you towards jobs related to software engineering, as that's what gets good money.\n\nI'm more passionate about cybersecurity myself. I've done a bit of TryHackMe and competed in a GCHQ led course/competition which has confirmed my future ambitions. I am willing to work hard and put in the extra effort, but I'm not sure where to direct it.\n\nSo, my question is, how can I break in to the industry? Ideally landing my year in industry internship in a job related to cybersecurity. Should I go straight for it? Or is it better to take the software engineering jobs and pivot into the role?\n\nThanks",
            "Hey, \nI'm completely new to cybersecurity. \nI have IT degree and I'm trying to get into cybersecurity. What do you think about starting from CCNA and CompTIA sec+, then \nopting for an entry-level network admin/engineer or entry-level cybersecurity role and then gain experience while working on my skills and the rest of certs? (CySA+ and then maybe CyberOps Associate certs. Then later CISSP or more certifications while working).",
            "Hello all, \n\nI am working on transferring over to cyber security from a critical infrastructure physical security background. I currently maintain several hundred networks worldwide, issuing patches, AD, and network management (closed systems require around 90% travel) as a govt contractor. I have been doing this for about 7 years and I am ready to work in one location. I have a BS in Intelligence and Security Studies, Sec +, Net+ and currently studying Python (plan to take the free Harvard course on CS). I am also going to get my Masters at WGU in Cyber. \n\nI cannot get an interview at all. I'm a few hundred applications in and I get nothing but rejections or ghosted. \n\nI am at a loss. I make six figures now, but I am ready to be home for more than a few weekends a year, so I am even applying to jobs that are below my paygrade. Still nothing. Short of applying for a help desk role and taking a 60k pay cut. \n\nI have looked at Network Engineering, SOC analyst, Systems Engineering, Cyber analyst, threat analyst. You name it. \n\nThe first 100 apps or so I really only applied for things I confidently felt I was qualified for, and now its just anything I partially qualify for. I am at a loss. This stuff is taking a toll on my mental health. \n\nHelp a brother out with any advice. \n\nTIA",
            "Made a post on this sub, but think automod wants me to comment here instead.\n\nAnyway, I want pivot from my current role to GRC and am wondering how to do that.\n\nFor a brief overview of my background I have a CS degree and graduated in 2021. First \"SWE\" job from 2021-2022 was kind of a bait and switch, didn't learn much there. Next job 2022-2023 was a real SWE role. It was a startup that was having some problems so I left again after a year for a larger company which is my current role. \n\nIm now in the finance sector at a large company. Its a \"SWE\" job in name only. I wear a lot of hats but I do a lot of work related to release/project management, configuration, QA testing, and support. My team mostly deals with backend tools and infra.\n\nOne of my main responsibilities is handling coordination and communication of our deployments. Said deployments can be tricky and time consuming because there is a *lot* of red tape and bureaucracy. \n\nI essentially keep track of changes going out, kicking off build pipelines, and creating change requests. Change management here is super stringent and I do a lot of communication with them to ensure our shit actually gets released. \n\nWe cant just deploy whenever we want there are specific dates and times so I help keep track of that too and help the team with the insane emergency release process when we have do that.  \n\nMy other tasks tend to vary all over the place. Ive helped a lot with sonarqube CVE related items (typically code library upgrades), QA testing, and support work. Some config/automation work using proprietary automation software (yes that is as awful as it sounds) \n\nThe WLB is shitty and we regularly work 60+ hour weeks. Because its so difficult to push changes out, along with shoddy software that breaks all the time and insane expectations/deadlines from business makes this a tough role.\n\nFor GRC, my motivation longterm is to get into a non-technical role with better WLB. \n\nMy soft skills are solid and I also enjoy reading/writing documentation. Im fine with attending meetings. Im a routine oriented person and it sucks not knowing when im going to be done with the work day or what my schedule is gonna be like. Im ok if its a bit \"boring\" (honestly GRC sounds interesting to me).\n\nI know these jobs can vary a lot but from what ive read searching this sub GRC seems like a great fit for me.\n\nWith that said, what should I do next from here based on my career experience? I know certs like Sec+ and then CISSP are important, but what about working experience?\n\nI'd ideally like to leave this job sooner than later but I know a career pivot like this will take some time. Another thought was going the cloud/devops route for a bit while grinding certs then getting into GRC.\n\nAny advice is appreciated!",
            "I really want to apply to SOC tier 1 roles. Would a CCNA and Sec+ be enough? Should I get the Cysa+ before I apply? Or would I have to start at help desk instead?",
            "Do you know some free and effective resources to study for the CompTIA Pentest + exam? I can't afford an academy, and the exam already seems quite expensive. Thank you very much in advance.",
            "[Resume](https://i.imgur.com/W2Y04nk.jpeg). Short version, working on year 5 of general IT, have Net+, Sec+, and AWS Cloud Prac.\n\nSuggestion for what to study next? Just seems like a good idea to keep a book cracked, so to speak. \n\nLong term interest is in security and risk management or maybe security assessment and testing. Next job goal, however, is anything specifically security. \n\nMy company is 0% cloud, the AWS cert just seemed like a good investment.\n\nI have udemy free through work, if that changes anything.",
            "I'm looking to move from IT (Systems Analyst) into cybersecurity. I have Sec+ and ISC2 CC along with 6 years of helpdesk 1, helpdesk 2 and Systems Analyst. What certs should I look at next and what roles should I be looking for if I'd like to get to the Cybersecurity Analyst level?",
            "How different is a BA vs a BS in cybersecurity? I currently have a Sec+ cert and most job listings I see are asking for a degree. Im halfway done with a BS in Criminal Justice and a minor in cyber. I goofed. My school offers a BA in Applied Computing with a focus on Cybersecurity and a BS in cybersecurity but only in person.",
            "In spring 2026, I will be graduating with a masters degree in information systems management and an emphasis in cybersecurity. I have experience working on campus at an IT help desk and I’m currently working as a back-end web developer, also on campus. \nSo I’m definitely not starting from ground level here, but I’m a little directionless as to where to go from here. What kind of internships should I be looking for next summer? What kind of jobs should I be looking for immediately after graduation? What certifications should I t  try to get?\n\nAny guidance is very appreciated",
            "I need to know if anyone here has landed a job in cybersecurity through the military? I plan to join the Air Force (still being considered right now) in the future and have been told many times that landing a career in the Air Force through the military is a good choice but I haven't personally heard from anyone who has done it or knows anyone who has done it, so I'm a bit worried? Even if you haven't done it yourself I'd like a response to this thought and if you think it's sensible.",
            "Hi everyone :) first of all thank you for creating and mantaining this amazing sub. \n\nI am a 27 year old Internal Control specialist working in the automotive industry (currently based in Mexico). Because of my position I recently got involved in some IT GRC activities (rolling out ISMS policies for our branch and training our personnel on cybersecurity best practices) and became really interested in this line of work.\nMy educational background is completely unrelated to IT (BA in International Relations). However, I am the “tech guy” in the office and I even stepped up as interim helpdesk for minor user support during 1 year when the IT guy quit. \n\nI would like to leverage my Internal Control experience to land a job on GRC, I would like to get certs like CRISC/CGEIT/CISM (even CISA, but I’d like to stay in the risk management/governance area rather than actual auditing), however, I am not sure if someone with a non-technical background like me can make it. I understand how networks and OS work (linux and windows) and as I said I do have 1-year on-hands helpdesk experience, but I am afraid that not knowing technical cybersecurity stuff will make it almost impossible for me to pass the exams.\n\nWhat would be the best path for someone like me to successfully shit careers to GRC? According to my research , I think CRISC is a potential career booster, and I can leverage my Internal Control experience to meet the 3-yr requirement. Maybe pursue CISM after that. \nMy mid-term goal is to become a Risk & Compliance Manager. Also, I do want to educate myself in technical stuff too so, what kind of technical certs should I get for that? (I am considering CompTia Sec+ after a self-taught cyber fundamentals course in the CISCO learning platform).\n\nTL;DR \nI am an Internal Control specialist (Finance, Entity-level) that recently got ISMS and IT governance related functions. Is this a point where I can switch careers to GRC?\nWhat certs might get me interviews on GRC roles as soon as I get them?",
            "Why should i study Cybersecurity and not Engineering or Economics?",
            "Hello what is a good online school to get a degree in Cybersecurity? I just got my AAS in IT and would like to continue my education. I recently been doing a Google search and Devry University, Strayer University and UoP I have been looking at so far are these good schools?",
            "Happy Monday everyone, I graduated with a Bachelor’s of Science in Cybersecurity May 2023. I have struggled to find a job after college. I have looked into consulting, sales engineering, and other avenues. The problem I see with the market is the experience does not match the title where I am looking for entry level positions that are requiring 2-3 years of experience. My question is if it would be worth my time to go into a IT Support Analyst role? Would I be able to pivot into a role of cybersecurity after x amount of years in support? Thanks in advance!",
            "Monday yay!!\n\nHello, I am 19 and an E3 in the Army, I am almost done with my AIT training to become a 25B (IT Specialist).\n\nI am currently in the Army Reserves and will be picking back up school full time majoring in Data Analytics, and minoring CompSci, and Cybersecurity. I am also working to start CompTIA Sec+ within the next 2 weeks, and am looking at doing CompTIA CySA+ and doing CISSP in the future when I have the experience. Obviously I have a clearance as well.\n\nMy questions are:\n\n1. What other certs should I be working towards? Are the certs I am planning on doing worth it, if not what are alternatives I should look at doing?\n\n2. How should I leverage what I already have towards getting a job in the defense side of cybersecurity? What roles typically are best for defense? Should I be trying to still get internships for IT roles while I'm in school or just use my IT experience from being a 25B?",
            "Hello, I am hoping to break into the cyber security industry. I ended up going through a university to get a BS in cybersecurity. However, where I go from here is a big mystery. Ideally, I'd like to get a job or internship just to start, even if it isn't permanent, just to have more relevant information on my resume. \n\nI am studying for the sec+ to get certified in sec+. However, outside applying with what I have and no relevant job information besides  delivery driving and a fire safety tech. With only my own little home projects and a degree. I'm not sure what to do or how to go about the future.\n\n\nIf you have read this far, thank you. Any advice or criticism is welcome.",
            "I live in Australia, and I would like to start a career in cybersecurity, any online courses that are nationally credited?",
            "I'm currently in IT Operations and just acquired my Security+ cert. I feel that I'm not doing enough, whereby I learn a new skill, the next thing I know I have to learn a wealth of tools, skills and have experience in all of them. Perhaps I'm going about it wrong. But I would love to have a mentor and understand where I'm going wrong and understanding why I'm stuck in IT an role.",
            "Is it beneficial or not to put on my resume that my Sec+ cert is \"in progress\"?",
            "So I sadly got laid off from my position last month, was an IAM position but as of late wasn't really doing any sort of technical work or anything dealing with access controls as the work was very specific to the company sadly, didn't even touch Sailpoint. Prior to that position, I worked in IT doing help desk & some systems administration.\n\nGot a reasonable amount of severance and stock which should hold me over until end of the year hopefully. In terms of certs, I have Sec+, BTL1, & AWS CCP. I plan to complete CYSA+ and a couple of splunk certs by end of August and of course mostly focusing on practical courses to pair it with the conceptual knowledge from the certs.\n\nBiggest focus right now is Networking though, recently went to a Bsides conference in upstate NY and going to another cybersecurity meeting in NYC later this month. Anyone know what conferences I should attend that are best for networking purposes? I know the market is going to seriously slow down in the summer, so using this time to really upskill & network & hopefully find a SOC role sometime in the Fall.\n\nOverall, is this a good plan?",
            "Trying to determine what certs are ideal for my situation. I've been working as a digital forensic analyst for about 5 years now in the public sector. I want to make a switch to private and go into maybe dfir or risk analysis type stuff. Don't have any certs beyond just basic software specific stuff so where should I start?",
            "I'm looking to get into cybersecurity. I'm into ethical hacking and Security Analyst (SOC). I was looking for appropriate courses regarding these. I came across some of the popular ones such as CompTIA security+ and the one from Google. They seemed to be filled with lectures rather than practical hands on examples with interactive and immersive learning that may go beyond the lectures that covers fundamentals.\n\nI have tried ethical hacking with python from zaid course. I liked it as it walked you through real life examples and projects.\n\nWould you kindly suggest me some good courses where i can dive deep into Ethical hacking and SOC with practical learning rather than video animation lectures?",
            "\n\nCyber security Job Hunting in Canada\n\nWhat are some advices and tips you can give me  to land my first SOC Analyst job in Canada or US, i have  tech degree and a professional cybersecurity bootcamp, got my Comptia security + certificate recently, im currently doing a  diploma program and i want to know anyone who got job offer  who holds study permit",
            "Is it still worth getting into cybersec? I have a decent job right now and not sure if it's worth spending my free time and money to study cybersec or if it's saturated to the point where I wont get hired.",
            "I am currently pursuing Cyber sec degree in india.\nI have studied networks, linux, OS and Cryptography as part of my degree and I would consider myself an intermediate in that.\nHow to show these skills to the recruiters?\nAny projects that you would suggest.\nAlso I am learning ML now.",
            "Hey guys I was thinking about going to school for Cybersecurity operations and management degree online, I was wondering if it's worth it and what school is the best? If not, Cybersecurity operations and management then what do you recommend. I definitely plan on getting certifications in the future after I get my foot in the door.",
            "I'm getting into a cybersecurity boot camp at my local university its a 6-month course but I'm afraid I will not get many opportunities since my work history is in sales and most recently it's been driving commercial vehicles. I'm quitting my job because of conflicting schedules therefore I'm looking for recommendations for jobs I can apply for while I go through the course that will look good on my resume. my schedule is MWF 6:30 PM- 9:30 pm so I will have all morning and afternoon.",
            "Looking for advice, I have worked in data for 5 years and recently got layed off, so im taking this time to look into possibilities. Cybersecurity really  catched my eye. \n\nOnly thing that has me nervious is that i dont have a comouter science bachelor degree im self taught and have reached a senior position in data trough experience and certifications.\n\nSo, should i focus in getting a bachelor degree before cybersecurity? Or can i get a job without a degree?\n\nAre there any certifications I could take as a beginner and is my background in data useful for cybersecurity? \n\nThank you all for any help.",
            "[deleted]",
            "Hey, I'm thinking of starting a cybersecurity career, and I'm currently in school. I live in the UK and I have some questions about starting out. Should I go to uni or do comptia qualifications? What I'm really asking is if employers here and abroad look for uni degrees, certifications, or both? If university, what UK degrees should I do? I'm thinking of some red team jobs, so what would be some jobs with good pay? Is there anything to do before doing any uni or quals?",
            "[deleted]",
            "For cybersecurity, how good do you need to be at maths?\n\n\nHello,\n\nI am thinking about going into cybersecurity as I leave school so I wanna do some research. \n\nI am not the best at maths so I am kinda scared. Every website I look at gives me a different answer but in your opinion how good do you need to be at maths to be a good cybersecurity analyst? \n\nHave you ever struggled on a task that involved maths? How often do you use maths in your day to day job role?\n\nThanks",
            "My original post got deleted, but here's a self reflection of my current state in Cyber. Any advice will be helpful.\n\nHey guys, currently I'm a student closing in on my Bachelor's in Cybersecurity. I graduate next year and so far I've held a 4.0 GPA (mainly to keep my full-ride scholarship), and I recently got the SecurityPro certification from CompTIA. However, in my 4 years or so of college and years of living, I haven't worked a job. I've tried a couple times to apply to retail, I've applied to several internships (remote, since commuting to a certain city would be torture), and haven't landed anything. Some more persistence would probably get me somewhere, but I think I'm afraid of change, possibly coupled with some laziness.\n\nIf I get a job and it turns out my classes are difficult, then I have less time to study and hold my 4.0. If I don't have a job by the time I graduate, then I have no experience and trying to find a job will be hell.\n\nI want to go for the Google Cyber certification as well as Sec+ since apparently there's a \"dual cert\" if I do that. I want to finish school first before going for the certs since I can fully focus on studying for the certs and not have to worry about the 3 discussion posts and 6 replies I have to do that week.\n\nI'd like to set up a home lab, but I know that certain labs are more significant and fruitful than others, so I'm at a loss of where to start in that department.\n\nI haven't done any cyber competitions, and I haven't done any CTFs. I either don't qualify for the cyber competition (due to lacking required or recommended knowledge/experience), or I just ignore them entirely. As for CTFs, I haven't made an effort to start them because laziness.\n\nOn one hand, I know I can tackle whatever it is I set my mind to. I don't think I'd have a 4.0 if that wasn't true in some way, but I lack direction and motivation I guess. School motivates me to do assignments due to the consequences of not doing them, so I work hard and ensure everything I turn in is nigh-perfect. I just fell like everything seems daunting, and I see other beginner/fresh-graduate posts who have done way more than me and it just makes my hard work in school feel worthless.\n\nI think laziness and procrastination are the source of my problems, since I can't motivate myself to do extra-curriculars and video games provide me with more enjoyment than the frustration of learning something new and sucking at it.\n\nIdk. I'm looking for advice, or words from those who are/were in a similar position as me. This post may just be pointless since I'm self-aware of my problems, but I would appreciate any sort of interaction. I really can't air out my thoughts to someone irl, so here I am. Thanks for reading through my woes.",
            "I recently finished my first year of Cybersecurity and in the first year I did Python and Java for programming languages as well as programming techniques and an introduction to cybersecurity (basic stuff and intro essentially).\n\nNow my holidays have started and have just recently received my results and have done fantastic in my first year, and I'm wondering if I'm doing enough to become better at programming and learning cyber security. I recently finished a python online course through CS50 and recently started doing the cyber security online CS50 course but I feel like I'm not doing enough? I watch all these videos of people making such cool programs and games with such ease and I can't help but compare myself to them. Like ik people from different universities being able to do more like develop cool programs and apps and such. A few of my friends even worked in almost the same courses as me but theyre doing internships and game devs and stuff using C++ and other code.\n\nSo far I've only done python and Java but soon ill be learning C++ and other code language\n\nFor context this is my first time learning python or even doing coding at all as I didn't take comp sci for GCSE or A-levels but rather took ICT instead.\n\nIs there anything I'm doing wrong or that I should be doing to improve? any advice / feedback would be great.",
            "Hello, Reddit community!\n\nI have over 20 years of experience in IT and more than 8 years in Information Security. Throughout my career, I have earned several certifications, including CISM and CRISC, among others. I'm now looking to advance my knowledge and skills further by pursuing a master's degree with a strong focus on cybersecurity leadership, targeting CISO roles in the future.\n\nI've the following online programs in mind and would love to hear your thoughts, experiences, or any insights you might have about them:\n\n1. **University of San Diego** - MS in Cyber Security Operations and Leadership\n   * The US version is around $32K USD, and they now offer an Indian option specifically for Indian nationals, which is around $6K USD, as recommended by their US representative.\n   * I liked their program, especially the coverage of blue team operations, Incident Response, forensics, etc.\n   * [https://onlinedegrees.sandiego.edu/masters-cyber-security-operations/classes/](https://onlinedegrees.sandiego.edu/masters-cyber-security-operations/classes/)\n2. **University of Illinois at Springfield** - Master of Science in Cybersecurity Management Online\n   * [https://onlinecbm.uis.edu/degrees/technology/masters-cybersecurity-management/](https://onlinecbm.uis.edu/degrees/technology/masters-cybersecurity-management/)\n\nI'm particularly interested in programs that offer a solid balance between technical skills and leadership training. If you have attended or know someone who has attended any of these programs, please share your experiences. Pros and cons, the workload, the support from the faculty, the relevance of the curriculum to real-world scenarios, and any other insights would be greatly appreciated.\n\nAdditionally, I was considering the CCISO certification from EC-Council, but recent online reviews have been less than favorable. If anyone has recent experience with the CCISO, please share your insights.\n\nMoreover, if you have any other recommendations for online master's programs in cybersecurity with a focus on leadership that are not on this list, I would love to hear about them.\n\nThank you in advance for your help!",
            "Does anyone know any good companies that do remote internships?",
            "I completed my UG in Btech - IT last week and am trying to get into cybersecurity. I have been studying basics in networks, OS, CTFs etc for the past 2 months. I don't know what I should do to get into cybersecurity domain. I want to get an entry-level job in the field. What do you think I should do? I have 3-4 months at best to study and I must get a job to pay for living expenses after that.\n\nI'm planning to study to get eJPT or Comptia security+ or A+. I'm hoping to get security analyst or junior pentester role. is this an entry level job if not what role should I try to get into?\n\nThanks in advance for any help/ insight! Please give it to me straight, if anything I want is completely unrealistic or unreasonable, I would love to know.",
            "Is there anyway I can get SOC experience ? I don't even mind if its voluntary. I just typically need atleast 6 months. I am UK based.",
            "Hi all, I graduated from my Software Development degree yesterday and I'm starting my first job as a developer in about a month. \n\nI'm really excited because I can get a lot of freedom at this company to learn and improve their product. I really want to make some big jumps in my career and my overall knowledge. Given I get a lot of freedom to learn there, what would you guys suggest I try to pick up? \n\nAt the interview we already talked about how I can help setting up a Kubernetes environment and improve their Azure spaces. We also talked a bit about security, which is an interest of mine, so I also would like to learn more about that. But, given it's my first real job in the field, I'm kinda at a loss about how to pick up these things, how can I make sure I get to do what I want to learn? \n\nHope you guys have some tips for juniors!",
            "Hello Cyber fellows,\n\n\nI hope you all re having great time!\n\n\nI'm interested into conducting self studies through the Cyber Security area. But, I'm a bit frustrated as I don't have a clear goal or path to walk through. I've been practicing through HTB machines for a while and I figured out that I'd like to get into the Blue team instead of the Red team. What would you suggest me to do? I'd like a straight plan for getting into the Blue Team.\n\n\nThank you all!",
            "[deleted]",
            "Hey there!\n\nIm exploring the cybersecurity landscape and eager to learn from experienced CISOs and industry experts.\n\nI have 10 years of experience in the field and want to speak with people who live the problem and want to share his thoughts...\n\nIm working on cybersecurity proejct alongside remarkable partner and would love to speak with experts!\n\nCan someone help me make the connection? Im trying to cold reach out to cisos but its not THAT effective to the amount of effort im putting\n\nThanks guys",
            "Do you have any experience working in IT? If not, I would look for entry level jobs that would allow you to go to school.  Even a help desk position would be better than sitting on your hand waiting to get through school.  Try to get an internship with a cyber company.",
            "nobody needs to start at the helpdesk, that is outdated thinking\n\nSure help desk is a fine job on campus while you're in school, but shouldn't be your first job after you graduate",
            "> do I need to do the typical help desk job before moving into an infosec role?\n\nNo. It's not a hard requirement.\n\nThe reason we advocate more generally for cyber-adjacent employment is to help foster a pertinent work history. Such work experiences are [the most weighted factor employers consider in an applicant's employability](https://bytebreach.com/assets/images/isaca_survey.PNG).\n\nIf you get an offer, that means an employer has deemed you as having such pertinent work experiences - there's no need to step back.",
            "Due to a year of experience in your internship(assuming the internship is infosec related) , I would say you are far more likely to land a full time position than most people. Keep applying for SOC and other security roles, but have a help desk/systems tailored resume ready as a plan B.",
            "First thing, you have to accept that some places just have unrealistic expectations so there will be plenty of applying for jobs before you find the right one.\n\nWith that out of the way, I run a SOC and I would much rather hire someone who has an interest in cybersecurity than someone who just did a degree in the field and nothing else. \n\nThe field is quite saturated with people wanting to get into a SOC role, so make yourself stand out. Work on side projects, research threats as they are found so you can talk about them, have a reason you want to do the job.\n\nI’ve just hired 2 more people onto my team who don’t have cyber security degrees. What they could do though is sit and talk to me about why they wanted to do the job and then show me the effort they have put it.",
            "0-50%\n\nDo you have a college degree?\n\nDo you have any basic IT experience? help desk, desktop support?",
            "Welcome!\n\n> I am curious to hear opinions on the odds of getting an entry level cyber security job (leaning towards blue team) with no IT work experience, no degree in Cybersecurity (degree is in psychology) but with Google IT support professional certificate, Google Cybersecurity Certificate, CompTIA Security + certificate and blue team level 1 certificate.\n\n[Speculative.](https://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oy55z/)\n\nWe've seen weaker profiles land work and stronger profiles struggle to get callbacks. Even if we saw your actual resume (vs. how you presented yourself in your comment), we'd lack the context about [how you're performing your job hunt](https://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9ogpq3/), what opportunities are available to you, and - since we're not the employer - how you interview and whether you're the right fit.\n\nAll told, we'd just be guessing.",
            "Where are you in the world?\n\nWhat part of your country?\n\nWhat city do you want to work in?\n\nWhat Industry do you want to work in?\n\nWhat was your major?\n\nAre you on LinkedIn?\n\nHave you taken any basic entry level certification exams - security+, network+?",
            "Welcome!\n\n> Recent college grad in the process for a few months now, trying to figure out how to get into the field.\n\nSee:\n\nhttps://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oftbi/\n\n> what feeder role do you think best aligns with my current experience and skills so far?\n\nRather than recommending a particular role to you (since I don't really know you or your aptitude), I'd instead direct you to these resources which can help you with your survey of the professional domain:\n\nhttps://www.reddit.com/r/cybersecurity/comments/smbnzt/mentorship_monday/hw8mw4k/\n\nAlso these resources, which include 1-on-1 interviews with folks from different jobs for added insights:\n\nhttps://www.reddit.com/r/cybersecurity/comments/sb7ugv/mentorship_monday/hux2869/",
            "Why do you think taking a certification exam is the answer?\n\nCerts - [https://pauljerimy.com/security-certification-roadmap/](https://pauljerimy.com/security-certification-roadmap/) are meant to COMPLIMENT your an experience in an area, they are not job training nor a replacement for experience",
            "Welcome!\n\n> What do you recommend for someone at my level and with this type of experience?\n\nCandidly: goal-setting.\n\nYou've observed dissatisfaction, which is a good impetus for action.  You also appear to be in a pretty accommodating/flexible work environment (which is great!). But you lack clear, unambiguous, actionable goals. This makes it challenging both...\n\n* (A) for your employer to provide you challenging/engaging tasks (since they lack nuanced feedback about what you're looking for professionally) and...\n* (B) for yourself to know what it is you want to do (and thereby align your efforts in service of a particular goal).",
            ">Would it be easy to switch? No\n\n>What would be some good roles? That's what you need to research\n\n>What courses/certifications can I take? That's based on role - [https://pauljerimy.com/security-certification-roadmap/](https://pauljerimy.com/security-certification-roadmap/)\n\n>How long would it take to make the switch? Too many variables, nobody can give you a specific time period",
            "Welcome!\n\n> Would it be easy to switch?\n\n[Maybe?](https://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oy55z/)\n\nWe still don't know what particular kind(s) of role(s) you're trying to pivot into, which employers you're targeting, how your resume looks, etc. Even if we did have all of that information, we're not the employers/interviewers you'd speak with - so we'd lack the context to know how optimal a fit you'd be. Based on feedback we've observed in the subreddit, [folks can have very disjointed job hunting experiences](https://old.reddit.com/r/cybersecurity/comments/15k4qzt/mentorship_monday_post_all_career_education_and/jvgc311/); some people with much weaker employability profiles than you have found work, others with better credentials have struggled to attain callbacks.\n\nAll told, you've got some good things going for you at-a-glance, but how well your experience might go isn't clear-cut.\n\n> What would be some good roles?\n\nSee related resources:\n\nhttps://www.reddit.com/r/cybersecurity/comments/smbnzt/mentorship_monday/hw8mw4k/\n\n> What courses/certifications can I take?\n\nSee related resources:\n\nhttps://old.reddit.com/user/fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oyo33/\n\n> How long would it take to make the switch?\n\nWe have no frame of reference relative to your situation, nor do we have a clear inclination of how you'd plan to go about your [job hunt](https://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9ogpq3/). Might be a week. Might be several years. Unknowns include:\n\n* Whether you're open to returning to school\n* What kinds of opportunities are in your area\n* What constraints you're observing in your job hunt\n* How much runway you have to perform the job hunt\n* Your comprehension/experience in the pertinent tools/methodologies of a given role",
            "Assuming youre in a current role as a business analyst, you might have a good shot if your current employer is willing to hire from within. Make sure to look into the basics of cyber certs if you don't know them already (security+ , gsec, CEH) to get yourself a leg up compared to other people without any credentials.",
            "> I finished my bs in cybersecurity. I'm going to do sec +, cysa +, I was wondering should I do linux +?\n\nMy $0.02:\n\nNo one is asking for that vendor neutral certification; you're covering the more impactful ones offered by CompTIA.\n\nSee related:\n\nhttps://old.reddit.com/user/fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oyo33/",
            "> How do you actually remember stuff? Yes I take notes but how do you guys remember them? especially hands-on projects?\n\nIn addition to notes, I require consistent engagement.\n\nIf I stop doing something, I'll forget the nuances of it in time - especially if it was a complex/nuanced task. I'm several years removed from my time doing GRC work (for example), and I've already forgotten details of the work I used to do; I remember the big strokes, but I'd need to read up on some of the finer points (and in our professional domain, it's knowing those finer points that matter).\n\nBut detailed notes that are structured in a way conducive to how *you* can x-ref is so valuable.\n\nIn the case of projects, I think the important bit is knowing what you mean to use the project for in the future. If you plan on referencing it in a resume - for example - you'd do well to develop a canned narrative that you can drop into if brought up in an interview which hits the salient points.",
            "For me, it’s all about time in the trenches. The more often I use a skill/piece of knowledge, the better I’ll remember it. If you’re taking notes, try reviewing them often and put them into practice (ex: spin up and secure an AD environment; write some software that implements cryptography). If you’re into podcasts, Cal Newport (comp. sci. prof) was recently on Huberman Lab and discussed what he did in school to retain what he learned.",
            "Comptia’s security+ gives a decent base and good amount of vocabulary. Check out YouTube for simple introduction courses that cover sec+ materials, that’s how I got started :)",
            "Welcome to the club! I recommend a few things. First, keep up on related current events/news. Cybersecurity is all about keeping up with new threats and technologies, so it’s good to get in the habit early on. Second, Google will be your best friend. I know people don’t like to be told “just Google it”, but learning how to properly use a search engine will help immensely in this field and many others. Anything from new terminology to answers to specific technical questions can be found. Last, there are many, many facets of cybersecurity outside the standard offense and defense. Everything from a blue team SOC analyst to designing secure firmware for smart devices to reverse engineering malware to hacking into foreign nations as part of the intelligence agencies. Take your time to explore the available paths because you never know what might pop out at you. I’d recommend looking at platforms like tryhackme to explore a variety of options.",
            "See related:\n\nhttps://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oftbi/",
            "you should go to college",
            "> As well as there is no one of cyber security in my company, how to proceed?\n\nI'd start at the highest levels: understanding what (if any) regulatory/compliance measures your organization has to observe (be it laws, statutes, etc.); knowing this, your next order of business is drafting policy (assuming none exists) for your organization to be reviewed/approved by the highest levels of your organization which is designed to meet/exceed to stipulated regulatory/compliance measures; this may be based on applicable frameworks that already exist, if helpful (e.g. NIST).\n\nThe idea with the above is to set yourself up for success; if you present leadership with documentation that is well-researched and grounded in the law, then later when you need to go about submitting invoices for software licenses, third-party audits, etc. you can point to that same documentation and say, \"this is in accordance with policy *you* approved in order to keep us compliant\". This is consistent with the overall practice of having security serve the organization (vs. making the organization serve security).\n\nEverything else you named - while not inappropriate - feels preemptive without an established, formalized process that is both well understood and acknowledged by leadership. The risk you run in not doing the above groundwork upfront is that at some point someone might say \"no\" or \"why?\" (and you don't want to be in the position of saying things like \"best practice\" or \"that's just the way things are\"). Alternatively, a worse position would be that eventually you come to understand something you were doing was inappropriate, harmful to the organization, etc.",
            "I’m actually active duty AF as well and about to start a skillbridge in August. ( company to TBD, but it’s with Hiring Our Heroes) I have a few friends that recently retired as well and currently work in cybersecurity roles.\n\nYour last four years will fly by considering around the 19 year mark you’ll be busy taking terminal leave and in a skillbridge program. Here’s my advice for years 16-19.\n\nUse your AFCOOL to at least get CISSP and PMP. Bonus if you are able to get cloud security certs like CCSP and vendor specific ones from AWS/MSFT.\n\nIf you don’t have LinkedIn start working on it now and building a network. Get with Hire Heroes USA to build a civilian resume. They’ll take all your EPRs/EPBs and translate them to civilian terms. Your main advantage right now is time. Feel free to PM me if you want to chat further.",
            "> What should I be focused on now to better prepare myself to enter the civilian job market?\n\nMy $0.02:\n\n* Obviously: don't do anything between now and then that would jeopardize an honorable discharge. I'm sure this is implied and well understood for you as an E-7, but it cannot be understated.\n* Determining what *specifically* you want to do when you transition out of military service (which will both inform what trainings - if any - you need to consider pursuing).\n* Deliberately networking with some of the commercial consultants you encounter (if not those through your colleagues); the pipeline from active duty service to DoD consulting is pretty veteran-friendly (especially given your professional history). Anecdotally, I did this from an entirely unrelated MOS in the Marine Corps.\n* For employers outside the DoD sphere, you will probably benefit from allocating some deliberate effort to your resume/interview coaching. Your separation process will likely cover this at length, but the jargon/lexicon that comes trivially to you within the Air Force can be unintuitive to the commercial sector.\n\nOutside of the above, being any more narrowly prescriptive risks sending your astray; you've got a lot of good things going for your employability insofar as you've presented yourself in the comment.\n\nEDIT: I put together some resources here, but most are probably not pertinent until you're closer to separation. Feel free to bookmark and return back as the time approaches:\n\nhttps://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oy73k/",
            "In my experience, for an Analyst position, hands on training with labs are the better ones to go with. You'll be able to play around with different tools, new scenario's and actually understand and educate yourself.\n\nMy personal favorites are Certified CyberDefender (CCD) and Blue Team Level 1/2. I found BTL2 a steep increase in difficulty from 1, you can save that one for later in your career.",
            "Great to see your focus and research you have done! Cyber Security is a very broad field of work. As you have stated a lot of basic networking certifications to focus on networking knowledge. Combined with your Compsci + programming skills this sets you up with a great starter kit to enter Cyber.\n\nAs most companies require experience, I see you've also thought about that! Make sure that you get a referral at the company you're doing the internship at.\n\nHave you done any research on what kind of job you're looking for? I.e. more technical like analyst or engineer? \n\nMy 2 cents, check if there are any academy like job entries at companies that will set you up with a learning path to a job as Analyst or Engineer. As you are still young, there is plenty of time to focus on a field. Getting the basic experience and fundamentals done is critical.",
            "> What would you suggest I do to get my first job\n\nSee related resources:\n\nhttps://www.reddit.com/r/cybersecurity/comments/smbnzt/mentorship_monday/hw8mw4k/\n\n> ...and where would you suggest looking for jobs.\n\nSee also:\n\nhttps://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9ogpq3/",
            "Hello!\n\nYou’re in a special spot regarding cybersecurity. In my humble opinion, you would be a very good candidate for a position to counsel cyber teams from within a bigger law team. That or you could consider starting your career with the compliance side of things. \n\nThe reason I’m saying what I am is because, in my own humble opinion, there are a few ways to go into cybersecurity:\n\n1. You have 5 or more years in an IT field and you switch over.\n\n2. You have a lot of experience piloting systems for the business and get your cyber skills up.\n\n3. You do the SOC type of work where you will face so many types of alerts that you either get good or be swallowed whole…\n\nSince I’ve already recommended the compliance side of things, I’ll justify why I think the risk and governance reason would not be suitable for you NOW. (Because I know your law background could be tremendously helpful with some experience behind your belt.) Managing risk is about understanding the context of the system, evaluating what would be the impact of the risk being exploited and the potential of this happening. This requires IT experience to properly do. The governance side requires you have experience in IT to understand how what you’re working on will implement the day to day of people. Aiming for the highest standards is well and all, but you are actively working on writing something that will be actionable and achieve the desired goals.\n\nNow, as far as certifications go, they are useful to have your resume looked at by HR. I would never hire someone only based on their certifications. I think your current plan makes sense. You can get a CISSP with no prior experience, you would be know as an associate if I remember correctly. When you have the proper experience you could then be recognized as a full CISSP holder. Go for the cybersecurity part of your plan (I would drop the A+).\n\n\nSo, the tldr of my recommendations: Compliance/auditing or law work to help IT teams would suit your degree. Keep your certification plan for now, it looks good for the cybersecurity part.",
            "Welcome! See:\n\nhttps://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oftbi/\n\n> how can I break in to the industry?\n\nBy cultivating a rich work history in tandem with your formal education. Such cyber-adjacent work can include software engineering.\n\nSee related:\n\nhttps://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9ogpq3/\n\nAdditionally, being in the UK, you may have additional licensure requirements to observe by the time you graduate. You should be mindful of the evolving changes in the time to come:\n\nhttps://www.ukcybersecuritycouncil.org.uk/professional-standards/the-council-s-route-to-chartership/\n\n>  Should I go straight for it? Or is it better to take the software engineering jobs and pivot into the role?\n\nIf you can get the work, go for it.\n\nThe reason we advocate for folks (including students) to *additionally* pursue cyber-adjacent lines of work is because of [how impactful having a pertinent work history is](https://bytebreach.com/assets/images/isaca_survey.PNG). [The early-career job hunting experience can be really challenging](https://old.reddit.com/r/cybersecurity/comments/15k4qzt/mentorship_monday_post_all_career_education_and/jvgc311/), and most people don't immediately find work in the professional domain of cybersecurity straightaway. However, if you're fortunate enough to find an opportunity, seize it!",
            "Welcome! See:\n\nhttps://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oftbi/\n\n> What do you think about starting from CCNA and CompTIA sec+, then opting for an entry-level network admin/engineer or entry-level cybersecurity role and then gain experience while working on my skills and the rest of certs?\n\nMy thoughts:\n\n* [I'd prioritize employment above certifications](https://bytebreach.com/assets/images/isaca_survey.PNG); it may be implied, but I wouldn't *delay* looking for work to pursue certifications. I'd do them both *concurrently*.\n* Your choices of certifications are appropriate for where you're at in your career. See related resources: https://old.reddit.com/user/fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oyo33/\n* It's unclear what *specifically* you're looking to do within cybersecurity; our professions are not a monolith - there are [many different roles](https://www.reddit.com/r/cybersecurity/comments/smbnzt/mentorship_monday/hw8mw4k/) that collectively contribute to the domain. Your selection of certifications likewise reflects this lack of focus (being largely vendor-neutral and generalized in subject-matter).",
            ">I have a BS in Intelligence and Security Studies,  - **Not relevant for cyber security**\n\n>Sec +, Net+ - **no longer relevant as you're not entry level, with 7 years experience you should have other certs such as CISSP**\n\n>and currently studying Python - a**lways good to know for technical roles for automating tasks**  \n(plan to take the free Harvard course on CS).  **Why? It's not going to matter on your resume**\n\n>I am also going to get my Masters at WGU in Cyber. S**kip WGU, in general there's no reason to get masters in the commercial sector** \n\n\n\n>I'm a few hundred applications in and I get nothing but rejections or ghosted.\n\nAre you cold applying?\n\nAre you using linkedin for NETWORKING? actually connecting with recruiting, peers, hiring managers?\n\nHave you connected with any IT staffing companies or headhunters?\n\nAre you involved in any security groups, associations, conferences?\n\nMost job happen because of referrals not cold applying\n\n  \nIf you're getting auto rejected then your resume is not passing the key word search on their automated scans\n\nBlow up you resume and start from scratch\n\nstart with plain text and no formatting just to get everyone on 1-2 pages\n\nkeep headings generic\n\n* Summary\n* Experience\n* Education\n* Certifications\n\ndon't list skills, hobbies, references, all that shit is outdated\n\nUse a basic font like Arial or Times - no colors, no columns\n\nWhen you have titles and dates, make sure to use commas\n\nBusiness Systems Analyst, Acme Inc, June 2000-June 2005\n\nCompTia Security+, Issued 1 June 2023, Expires, 1 July 2026\n\nBS Computer Science, University of Geese, 2006\n\n  \nUse the summary section to pull out from the job posting so you are matching keywords exactly as they are asking for them\n\nWhen you are building your resume highlight all the key terms in the job description and search your resume for those - you may not hit 100% of them but you better be close or you're going to get auto rejected\n\nSave your resume as the name of the job posting, when you upload it to their job page",
            "If you're at a big bank, then they have compliance, risk, security groups\n\nWhy don't you start talking to them, their roles and requirements and make an internal move\n\nIts much easier to get hired internally and move around vs applying somewhere off the street",
            "> Another thought was going the cloud/devops route for a bit while grinding certs then getting into GRC.\n\nI haven't worked in GRC but I work with GRC a lot at my place. So take my advice with a grain of salt.\n\ncloud/devops seems a lot more hard to get into imo than GRC. For new grads and those in this thread who have never worked, I'm very much in the boat that they need to get work experience wherever they can.\n\nFor you.... man I think you have the experience  (especially if you get those certs) to just... make the change. Are you applying now? You might just get something. You'll be competing with new grads and people who don't know as much as you.\n\nAgain, I'm probably not the best contact just my two cents.",
            "Do you have a college degree?\n\ndo you have any job experience?\n\nYou're not going to get hired based on just certifications - they are not job training",
            "Welcome!\n\n> Would a CCNA and Sec+ be enough?\n\n[Speculative.](https://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oy55z/)\n\nAssuming you had nothing else going for your employability, you'd probably have a tough time of job hunting.\n\n> Should I get the Cysa+ before I apply? Or would I have to start at help desk instead?\n\nSee related:\n\nhttps://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oxlrx/",
            "Please don't take Pentest+. It has zero respect in the industry and zero value to recruiters.\n\n\nYou'd be much better off with the eJPT or the PNPT (which still don't have respect, but teach better skills) or better yet, CPTS or OSCP.",
            "have you gone to your library?\n\nIf you're enrolled in college or at least have an old but active college email you can get a student discount on the exam\n\n[https://www.comptia.org/blog/voucher-discount](https://www.comptia.org/blog/voucher-discount)",
            "> Do you know some free and effective resources to study for the CompTIA Pentest + exam?\n\nI would direct you to /r/CompTIA, the subreddit dedicated to that vendor's certifications. They'll have resources there to help you.",
            "AWS and Azure are generally high value, but you might run into some trouble with the higher level certs if you don't have access to the platform at work.\n\nISACA CRISC seems to serve your longer term goals. CISM and CISSP after that.",
            "At the 5 year mark, you should be working hard to make it to an associate level position. Based on your position at an MSP, you are already performing associate level work but you're simply not advertising yourself as such in the resume. Also, definitely work towards some level of cloud certification so you have working knowledge of hardening cloud assets. \n\n Regarding your resume, I dont know what \"identified and resolved devices with missing EDR solution means\" (just kidding I do, but its just worded weird).  I would include a skills section to your resume and start tailoring your applications toward the jobs that are more aligned to your goals. \n\nAnother thing I noticed is that you downplayed ransomware incidents, many professionals even in cyber security never had the opportunity to be exposed to a real IR scenario which it seems like you have based on your resume. Get more acquainted with regular information security terms that will help you get the perspective needed for a real cyber job. I would recommend learning about governing bodies and entities that provide information about information security  (sans GCIH, NIST, CIS, cisa etc)",
            "You should be applying now, you have the IT experience and certs to get started. Apply to every (non-senior) cyber role you find: SOC, cyber, infosec, vulnerability management, security engineering, etc. It's just a numbers game.\n\nIf you want another cert - cloud certs are always high value, CySA+, BTL1, and OSDA are all strong mid-level analyst certs.",
            "> What certs should I look at\n\nRelated:\n\nhttps://old.reddit.com/user/fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oyo33/\n\n> what roles should I be looking for\n\nAlso related:\n\nhttps://www.reddit.com/r/cybersecurity/comments/smbnzt/mentorship_monday/hw8mw4k/",
            "A criminal justice degree is not ideal if your goal is cybersecurity. You could talk to your advisors and see if you can transfer to a tech degree without pushing back your graduation date. If you have good grades, there is usually wiggle room for credits that don't exactly line up. Doesn't hurt to ask.\n\nBA vs BS won't matter as long as it's relevant. Computer Science, Computer Engineering, Information Technology, and Information Systems are all strong degrees for a cyber career.",
            "> How different is a BA vs a BS in cybersecurity?\n\nGenerally speaking, a bachelors in the arts (vs. the sciences) is less intensive in engineering coursework, dropping things like mathematics for more holistic classes like politics, business, law, psychology, etc.\n\nIf you aspire to work in a more technical/engineering role in the future, I'd encourage BS vs. BA. [More to-the-point, I advise Computer Science more generally](https://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oxryb/), but that belabors the point.",
            "> What kind of internships should I be looking for next summer? What kind of jobs should I be looking for immediately after graduation?\n\nIf you're not familiar with the job landscape more generally, see:\n\nhttps://www.reddit.com/r/cybersecurity/comments/smbnzt/mentorship_monday/hw8mw4k/\n\n> What certifications should I t try to get?\n\nSee related:\n\nhttps://old.reddit.com/user/fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oyo33/",
            "What do you mean landed a job through the military? Are you asking if folk who work in cyber in the military can get out and get hired? Or are you asking if you can do cybersec in the military?",
            "What is your ASVAB score?  Does your contract state that you are in a cyber MOS?  \n\nIts possible to do ok with an IT MOS as well, but obvioulsy not as preferred.",
            "Security work is not entry level in any industry other than the military\n\nSecurity people regardless if they are in technical or non-technical roles are coming from IT/Operations roles before moving into security roles\n\ncommon paths might be\n\n* Software engineer to security engineer to security architect\n* network analyst/engineer to security engineer to security architect\n* Software engineer/QA/Testing to pentesting\n* Network analyst to SOC analyst\n* Business systems analyst to risk/compliance\n* systems analyst to security engineer",
            "> My question is if it would be worth my time to go into a IT Support Analyst role?\n\nIt is unclear what your existing work history is (you didn't link your resume), so we don't definitively know. Assuming you have little/no work experience (which is common in students/new grads), the priority is attaining *any* work *immediately*; oftentimes that means pursuing cyber-adjacent roles vs. directly into cybersecurity ones. See some of these resources, which suggest various positions that can feed into cybersecurity:\n\nhttps://www.reddit.com/r/cybersecurity/comments/smbnzt/mentorship_monday/hw8mw4k/\n\n> Would I be able to pivot into a role of cybersecurity after x amount of years in support?\n\nIt's much easier to make the transition when you both...\n\n* (A) Are job hunting from a position of active employment and...\n* (B) Have fostered an applicable work history, [which employers weight heavily in terms of your employability](https://bytebreach.com/assets/images/isaca_survey.PNG).",
            "Certs don't matter today. Major in computer science, attend or transfer to a target school, get a good [internship](https://www.levels.fyi/2023/), and make sure you are competitive for campus recruiting and can perform well during the interviews, especially the LC ones. \n\nIncreasingly the security workforce at good companies are really just pivoted software engineers.\n\n25B experience isn't terribly relevant outside of niche gov contracting work. 17C would be slightly more relevant.",
            "There's no reason to jump right into certifications unless they are a requirement for AIT graduation\n\nI would just major in computer science",
            "> What other certs should I be working towards? Are the certs I am planning on doing worth it, if not what are alternatives I should look at doing?\n\nRelated:\n\nhttps://old.reddit.com/user/fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oyo33/\n\nYour described certifications are appropriate. However, you should be aware that CompTIA - in offering vendor-neutral certifications - may not always offer the most effectual credential depending on [what *specifically* you want to do](https://bytebreach.com/posts/what-certifications-should-you-get/) in the long-term.\n\n> How should I leverage what I already have towards getting a job in the defense side of cybersecurity?\n\nProbably the cleanest transition would be with a DoD contractor (e.g. Booz Allen Hamilton, Boeing, Northrop Grumman, etc.).\n\n> What roles typically are best for defense?\n\nThe most *prolific* are probably in the GRC space. \n\n> Should I be trying to still get internships for IT roles while I'm in school or just use my IT experience from being a 25B?\n\nIt's hard to say without observing your resume. On paper *at present*, you're probably looking at internships.",
            "Ideally internships are done while you are still a student. If you're a recent grad, you might still have a chance.\n\nOutside of that, just apply to any entry-level cyber and IT role. With no experience, you're generally looking at help desk, but you could get lucky with a jr sysadmin, NOC, SOC, etc role. Make sure you resume highlights the customer service and troubleshooting of your non-IT jobs. Soft skills are always relevant.\n\nHome labs are good way to practice some hands on skills, it's not a replacement for corporate experience, but it can help fill out your resume with keywords.",
            "Internships are for CURRENT students\n\nYou have graduated welcome to the job market\n\nDo you know any programming languages?\n\nHave you gotten any certifications?\n\nIt's time to get into an IT/Operations role as you're not going to start out in security\n\n* Systems Analyst\n* Software Engineer\n* QA/Testing\n* Network Analyst\n* Systems Admin\n* Business Systems analyst \n\nThose are some examples",
            "> I'm not sure what to do or how to go about the future.\n\nMore generally:\n\nhttps://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9ogpq3/",
            "Not Australian, but I have heard second-hand about the Cert 3 & 4 in information technology and others having good results with those.",
            "And?\n\nThis is a field that requires annual professional development, which may include learning new tools, processes, regulations, getting certifications, reading the news, going to conferences, webinars, etc\n\ntechnology doesn't stand still and in security work in particular neither do the threats\n\nYou're never going to learn everything, nobody does, however that doesn't mean you can't specialize and learn one particular area really well",
            "Totally understandable.\n\nHowever, these rolling Mentorship Monday threads usually cater to more \"one-off\" questions (vs. establishing long term, personalized interactions). For the latter, your best bet is in finding some in-person engagement opportunities (see your local OWASP chapter, BSides get-together, meetup groups, conferences, etc.).\n\nIf - on the other hand - there was anything in particular you're finding at issue, we'd be happy to help as we're able.",
            "No, because there is no way for any applicant tracking system, HR/recruiter or more importantly a hiring manager to verify that\n\nthey will just think you're trying to game the system with keywords and not interview you\n\nyes that sounds cynical but its true\n\nwhen you have actually passed the exam, then you can put it on your resume and linkedin profile",
            "> Is it beneficial or not to put on my resume that my Sec+ cert is \"in progress\"?\n\nIn tandem with [this guidance](https://bytebreach.com/posts/how-to-write-an-infosec-resume/), no.",
            "If you are going to complete it in the near future (1-2 months), I think it's fine. Give the real ETA for when your test is scheduled. \n\nHitting ATS keywords is important. Just don't misrepresent yourself. If just opened the book and read the introduction, it's not worth putting on.",
            "CISSP is a general catch all cert that HR always look for. With that you can check out the local market and start applying for jobs that are open and look interesting.",
            "Welcome! See:\n\nhttps://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oftbi/\n\n> Would you kindly suggest me some good courses where i can dive deep into Ethical hacking and SOC with practical learning rather than video animation lectures?\n\nIf you're trying to work professionally in cybersecurity, I think you may have your priorities misaligned, given what [employers weigh in an applicant's employability](https://bytebreach.com/assets/images/isaca_survey.PNG).\n\nSee related:\n\nhttps://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oxlrx/\n\nHowever, to more directly answer that questions you asked:\n\nhttps://bytebreach.com/posts/hacking-helpers-learning-cybersecurity/",
            "GO TO COLLEGE!\n\nSecurity work is not entry level",
            "No!\n\nthis is not how you get started\n\nYou need the IT fundamentals first, you don't just dive into pentesting/incident response\n\nWhat do you know about networking?\n\nDo you understand TCP/IP and OSI models?\n\nDo you understand different programming languages? Do you understand different operating systems\n\nDo you know what the OWASP Top 10 is?\n\nDo you have a basic understand of how the internet works?\n\nIf none of this sounds familiar then that's where you need to start",
            "> What are some advices and tips you can give me to land my first SOC Analyst job in Canada or US\n\nSee:\n\nhttps://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9ogpq3/",
            "This is such a vague and subjective question, I’m not really sure what you expect the answer to be. \n\nEspecially when you give absolutely no context to where you work now, what you are interested in, etc.\n\nI work in cybersecurity and can put food on the table and pay my bills. It’s worth it for me. I have no idea if it will be for you.",
            ">Is it still worth getting into cybersec?\n\nWhat part of the world?\n\nWhat industry?\n\nwhat role?\n\nCyber security isn't one type of job",
            "If you are passionate about cybersecurity, sure it's worth pursuing.\n\nIf you are just chasing a paycheck and/or media hype / FOMO, it's not worth it.",
            "> Is it still worth getting into cybersec?\n\nI'd ask for you to more narrowly constrain the question. Put another way, \"is it worth getting into given <circumstance>\" or \"is it worth getting into instead of <alternative>\".\n\n> I have a decent job right now and not sure if it's worth spending my free time and money to study cybersec or if it's saturated to the point where I wont get hired.\n\nCan you expound on this?\n\n* Is your experience pertinent/transferable?\n* By \"study\" do you mean go to university? Do you have a degree already (and is it applicable)?\n* Would your \"study\" activities prohibit working concurrently?\n* How much runway do you have?\n* What do you envision doing in cybersecurity *specifically*.\n* How close to retirement are you?\n* Where geographically do you reside?\n\nSo on and so forth.\n\nAbsent details, I can only say: \"maybe.\"",
            "> How to show these skills to the recruiters?\n\nRelated:\n\nhttps://bytebreach.com/posts/how-to-write-an-infosec-resume/",
            "Why do you consider yourself intermediate in those areas? How and where have you applied those skills?",
            "You're in college, you have no skills yet\n\nSkills are obtained on the job\n\nrecruiters don't care what classes you have taken",
            "Welcome!\n\n> Hey guys I was thinking about going to school for Cybersecurity operations and management degree online, I was wondering if it's worth it and what school is the best?\n\nGiven your stipulated area of study, this feels unusually specific. What I mean is that most people interested in going to graduate school (as it relates to our professional domain) usually look to study either:\n\n* Computer Science (more generally)\n* Cybersecurity (vs. something more narrowly constrained to \"operations and management\").\n* or an MBA (typically towards gearing your career towards management).\n\nCan you expound on what it is you're looking for in your graduate studies in order to help us better understand the kinds of programs you're interested in?\n\nIn the interim, I can gently suggest Georgia Tech's offerings:\n\nhttps://pe.gatech.edu/degrees/cybersecurity\nhttps://omscs.gatech.edu/\n\nIf it's of any value to you, I expounded at-length on my experience through the school/program here: https://bytebreach.com/posts/omscs_writeup/\n\nAs for \"is it worth it?\" question, that's tougher to answer. [For most people, I'd say \"no\".](https://old.reddit.com/r/cybersecurity/comments/1cqlqr4/mentorship_monday_post_all_career_education_and/l40rdyh/)\n\n> If not, Cybersecurity operations and management then what do you recommend.\n\nMore generally:\n\nhttps://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oxlrx/",
            "undergraduate - computer science, computer engineer, information systems, system engineering",
            "Just know that the degree won’t necessarily “help” you get hired after you graduate.  It’s a nice to have but what hiring managers and teams are looking for is substance.",
            "> I'm getting into a cybersecurity boot camp at my local university its a 6-month course but I'm afraid I will not get many opportunities since my work history is in sales and most recently it's been driving commercial vehicles.\n\nI'm concerned that you may have enrolled in a ThriveDX offering. See related:\n\nhttps://www.reddit.com/r/cybersecurity/comments/19chv2g/comment/kj8dpbl/?context=3",
            "do not waste money on a bootcamp and certainly don't quit your job because of it\n\nAll those bootcamps are not part of any university they are either from 2U or ThriveDX  - JUNK!\n\nIf you don't have a college degree you are better off going to your local community college and taking evening classes or whatever fits around your work schedule",
            "> So, should i focus in getting a bachelor degree before cybersecurity? Or can i get a job without a degree?\n\nSee related:\n\nhttps://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oxlrx/\n\n[While it isn't a hard requirement to have a degree](https://old.reddit.com/r/cybersecurity/comments/14w83m5/poll_do_you_have_a_degree/), it's probable that you'll encounter some [challenges making your pivot without one, especially lately](https://old.reddit.com/r/cybersecurity/comments/15k4qzt/mentorship_monday_post_all_career_education_and/jvgc311/).\n\n> Are there any certifications I could take as a beginner and is my background in data useful for cybersecurity?\n\nSee resources:\n\nhttps://old.reddit.com/user/fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oyo33/",
            "Welcome!\n\n> I learn best by actually doing the work everyday so I'm wondering how I would be able to get into cyber security as a job as a student?\n\nMore generally:\n\nhttps://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oftbi/",
            "came across this news article if it helps  \n[https://www.darkreading.com/cybersecurity-careers/cybersecurity-jobs-gap-may-come-down-to-certifications-gap](https://www.darkreading.com/cybersecurity-careers/cybersecurity-jobs-gap-may-come-down-to-certifications-gap)",
            "Security work isn't entry level\n\ngo to college - computer science, computer engineering, systems engineering, information systems, math, whatever stem MAJOR \n\nYou're going to start out in IT/Operations roles, not security",
            "Have a browse here; https://www.ukcybersecuritycouncil.org.uk/careers-and-learning/",
            ">I have a MS in Computer Science and 1 YOE as a software engineer\n\nThen why in the world would you take a step backwards to get a 2nd bachelors?\n\nLook  SANs is fine for individual certs, but there is no reason to get 9-10 certifications \n\nYou're a software engineer, stick with that for a few years, then move into application security",
            "I did a BA in cybersec. 3 stats and calc 1 as well as some other business focused classes. \n\nIn life in general I have never used math more advanced than algebra. I was a military accountant and even then we mostly used calculators for anything significant. Now working in cybersec I use 0 math as well.",
            "You won't use much math in day to day work. Maybe some basic stats at most.\n\nMost tech degrees have some math requirements though. Usually stats and discrete math at least, maybe some Calc and linear algebra if you go Computer Science.",
            "> For cybersecurity, how good do you need to be at maths?\n\nProfessionally? Anywhere from so-so to incredibly. The range of work that collectively contribute to the professional domain of cybersecurity is really broad. On one extreme end you have folks involved with cryptography (and quantum algorithms), on the other you have folks on the periphery of the engineering space (e.g. sales, insurance, project management).\n\nAcademically? [I encourage undergraduates pursue degrees in Computer Science](https://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oxryb/), which requires a non-trivial investment in studying math. However, CompSci is not a hard requirement to get involved in the field professionally.\n\n> in your opinion how good do you need to be at maths to be a good cybersecurity analyst?\n\nAs a domain that is rooted in engineering, I think you only stand to benefit by deliberately engaging the math that undergirds modern computing. It moves whole categories of problems from \"I'm helpless and can't do anything\" to \"I've seen something like this and I can figure it out, given time.\" It makes you more employable, more capable, and positions you to be in a better position than adversarial/malicious agents out there.\n\nWill you ultimately need to apply these intensive math intuitions/algorithms regularly? Probably not. But when the need to do so *does* arise (and it has several times in my career), it's incredibly useful.\n\n> Have you ever struggled on a task that involved maths?\n\nCertainly. Math is hard. It's hard for a lot of people.",
            "Welcome!\n\n> I graduate next year and so far I've held a 4.0 GPA (mainly to keep my full-ride scholarship), and I recently got the SecurityPro certification from CompTIA.\n\nGood job!\n\n> However, in my 4 years or so of college and years of living, I haven't worked a job.\n\nThis is *very* problematic, but at least you're aware that it's an issue.\n\n> I've applied to several internships (remote, since commuting to a certain city would be torture), and haven't landed anything. Some more persistence would probably get me somewhere, but I think I'm afraid of change, possibly coupled with some laziness.\n\nAs you say, these issues are all things within your ability to control. You can:\n\n* Make the commute; though it may be torturous (I can relate; at one point post-college I was making a one-way commute that took between 2-3 hours for several years), internships are seasonal - so you wouldn't be committing to doing this long-term.\n* Look for roles that aren't exclusively remote, which helps limit the competitive pool of applicants.\n* Either exercise some more diligence (if laziness is the root cause) or seek therapy (to equip yourself with the tools necessary to handle your anxiety around changing circumstances).\n\nAbsent the above, you might also look towards part-time workstudy within your university (as an intermediary alternative).\n\n> If I get a job and it turns out my classes are difficult, then I have less time to study and hold my 4.0.\n\nWhat are the terms of your scholarship, exactly? For example, if you get a sub-4.0 GPA what happens? Do you pay back the scholarship in its entirety? Does the scholarship cover room/board? Are you dropped from admission to the university?\n\nI ask because I want to know how much risk you might reasonably expect.\n\n> I want to go for the Google Cyber certification as well as Sec+ since apparently there's a \"dual cert\" if I do that.\n\nSee related:\n\nhttps://www.reddit.com/r/cybersecurity/comments/13hrkhr/comment/jkis9ew\n\n> I'd like to set up a home lab, but I know that certain labs are more significant and fruitful than others, so I'm at a loss of where to start in that department.\n\nI'd encourage you to frame your lab efforts more in terms of projects and less in terms of setting up a lab for the lab's sake.\n\nIn other words, you're going to want to be able to speak to what you've done with your lab (vs. saying you architected/built a lab just to say you did so). Structuring your efforts as such helps also with your labs' specifications and lessons you might learn along the way.\n\nFor example, if I asked you to [setup a honeypot to observe rogue SSH attempts](https://www.reddit.com/r/cybersecurity/comments/18zbzob/ssh_login_attempts_from_all_around_the_world/), how might you do that? And what then might we do to extend this project to be an interesting research effort? These are interesting experiences that implicitly require an appropriately configured lab environment.\n\nSee related:\n\nhttps://www.reddit.com/r/cybersecurity/comments/sxir9c/as_a_entry_level_professional_trying_to_get_into/hxsm5qn/\n\n> I haven't done any cyber competitions, and I haven't done any CTFs. I either don't qualify for the cyber competition (due to lacking required or recommended knowledge/experience), or I just ignore them entirely. As for CTFs, I haven't made an effort to start them because laziness.\n\nThat's fine. [Most aren't impactful/consequential to your employability.](https://www.reddit.com/r/hackthebox/comments/11hs9hl/comment/jawng7p/?context=3&utm_source=reddit&utm_medium=usertext&utm_name=cybersecurity&utm_content=t3_142rs62)\n\nHowever, you are missing out on some really interesting problems, opportunities to exercise your practical application capabilities, and outside chances of rewards (e.g. [I was one of the 2022 finishers at the NSA's Codebreaker challenge](https://bytebreach.com/posts/nsa-codebreaker-challenge-2022-writeup/), which came with - among other things - solicitations of employment).\n\n> On one hand, I know I can tackle whatever it is I set my mind to. I don't think I'd have a 4.0 if that wasn't true in some way, but I lack direction and motivation I guess. School motivates me to do assignments due to the consequences of not doing them, so I work hard and ensure everything I turn in is nigh-perfect. I just fell like everything seems daunting, and I see other beginner/fresh-graduate posts who have done way more than me and it just makes my hard work in school feel worthless.\n\nMy $0.02: it looks like what you prefer is structure and instruction. When left to your own devices (i.e. pursuing employment, certifications, competitions, etc.), you falter. I don't doubt that you're good at what you do, but you need to [just do it](https://www.youtube.com/watch?v=ZXsQAXx_ao0) and get out of your own way.\n\nHere's the kicker: [you know what the consequences are if you don't](https://www.reddit.com/r/cybersecurity/search/?q=no+work+experience).",
            "If you have been in the industry 20 years then you should know none of what you listed is going to help you get to the CISO role\n\nDo you have any \n\nteam management experience?\n\ndepartment level management experience? director level?\n\nexecutive level management experience - VP and above?\n\nDo you understand the business side of things? because the CISO role isn't down in the weeds technical its meeting with the other C-level execs as well as the board of directors\n\nDo you have an MBA?\n\nNobody cares about EC Council, like how many times a week does that need to be repeated here for it to sink in with people\n\nThis would be the only academic program for CISOs - [https://www.heinz.cmu.edu/programs/executive-education/chief-information-security-officer-certificate](https://www.heinz.cmu.edu/programs/executive-education/chief-information-security-officer-certificate) but only if your employer is paying for it",
            "hahahaha\n\nyeah, that's not a thing for security work",
            "Remote internships have a ton of competition. You're much better off using your school's career center, career fairs, and professors' networks for find the local internships that aren't posted on public job boards.",
            "Y'all downvoted me for asking a question.",
            "Welcome\n\n> What do you think I should do?\n\nhttps://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9ogpq3/\n\n> I'm hoping to get security analyst or junior pentester role. is this an entry level job if not what role should I try to get into?\n\nI'm dubious about your prospects at attaining work in penetration testing straightaway. Those roles are incredibly competitive.\n\nSee related resources, which speak to various cyber-adjacent roles that feed into long-term trajectories:\n\nhttps://www.reddit.com/r/cybersecurity/comments/smbnzt/mentorship_monday/hw8mw4k/",
            "Apprenticeships are a thing in the UK but they are generally tied to official training or education.\n\nI doubt you would find any voluntary SOC work.",
            "just focus on what is in front on you and that is learning your role\n\nthere is a big difference in coding in college vs actually working on application and putting them in production for customers to use",
            "First off, congrats on both the graduation and new job! That is so great.\n\nI agreed with Deez, it is really awesome to want to go above and beyond, but this is going to be a whole new world. Don't become so obsessed with being a superstar and focus on being a good team player and knowing your role. You will have plenty to learn just with your job.\n\nAlso, make sure you just keep in mind (use emotional intelligence) that you don't want to be the new grad telling all the senior engineers everything they are doing wrong. There is so much you'll be able to learn from them.",
            "Welcome!\n\n> I'm interested into conducting self studies through the Cyber Security area. But, I'm a bit frustrated as I don't have a clear goal or path to walk through.\n\nSee related:\n\nhttps://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9oftbi/",
            "The questions you're asking here can be answered by spending some time reading the subreddit.",
            "If you have ever bothered to read any of the posts here you would have seen perhaps\n\nSECURITY WORK ISN'T ENTRY LEVEL!\n\nAnd maybe you're going to need to go to college\n\nand perhaps start out in an IT/Operations role\n\nand you might have seen that all bootcamps are WORTHLESS, overpriced junk",
            "I do not have any experience working in IT, currently working in an office, I will look for entry jobs at the moment. Thanks for your advice 🤝🏽",
            "Do you recommend any program languages I could learn in the meantime? Other advice and such?",
            "I should've clarified this but yes I intern with an infosec team. Thank you!",
            "Thank you for your input. I will for sure tackle some projects!!",
            "No cyber security degree, no IT experience",
            "Thanks for the insight.",
            "I’m in NC. I am on LinkedIn but don’t have too many connections. Majored in information science. I’d say I wanna go into incident response. I haven’t taken any certification exams though. In the process of trying to and figuring that out. Atm I’m not sure what city I wanna work in.",
            "I see thanks - I used to take notes on only what I need which was bad as referencing them later is not useful for me as I have to go back to the original source.\n\n>for example - you'd do well to develop a canned narrative that you can drop into if brought up in an interview which hits the salient points.\n\nMost of my projects are much more related to the blue team side -  I was worried because I am making projects (mostly from YouTube) that I will just completely forget about them and waste my time but thanks I should just pick the relevant projects to the role I am applying and develop a narrative talking about the key points only.",
            "Thank you so much!! Anything else you want me to focus on?",
            "Hello. It appears as though you are requesting someone to DM you, or asking if you can DM someone. Please consider just asking/answering questions in the public forum so that other people can find the information if they ever search and find this thread.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cybersecurity) if you have any questions or concerns.*",
            "Thanks for responding. I'll look into getting a referral from the company I work for as well as the academy job. Is there somewhere specific I should be looking for a job like that? Also, what should I be looking for when it comes to one of these jobs?\n\n I'm still doing research into what I'd like to specialize in, but haven't really made a decision cause I feel like I don't have a good enough picture of what they do. Like what's the difference between an analyst and an engineer? Are there other jobs besides those two?",
            "Thanks a lot for your informative input.\n\nIt does help me feel somewhat like I'm on the right track-ish.\n\nI have a few minor follow-ups. Could I get some further clarification on these?\n\nFrom your previous posts, would I be correct to assume you're in a similar type of role with CISSP and CISM? Someone benefits from a hybrid skillset, with one being in legal? \n\nWhat would the position/role/job you've mentioned (counselling cybsec teams) be called exactly? \n\nCould you speak on whether the position you recommend requires me to be a legal practitioner? By the sounds of that, it would seem that I would be required, or at the least, greatly benefit from, being a law practitioner. I would ideally prefer not to get licensed as it comes with its own costs and responsibilities.\n\nThanks again for all the delicious information.Your prior posts were also very helpful!",
            "> You can get a CISSP with no prior experience, you would be know as an associate if I remember correctly.\n\n/u/New-Monk4216 is correct!\n\nYou can sit and pass the CISSP exam without meeting [the specified prerequisite years of experience](https://www.isc2.org/certifications/cissp/cissp-experience-requirements). However, ISC2 (the certification vendor) will not confer you the full certification until you *do* meet those prerequisites, instead providing you the more ambiguous \"Associate of ISC2\" status, as they mentioned.\n\nSee related:\n\nhttps://old.reddit.com/r/cybersecurity/comments/1ddhi38/thoughts_on_the_cissp_certification/l866ede/",
            "Thanks for the reply!\n\nIt's a great deal of information, and I'll be sure to read through everything you've linked once my exams are over.\n\nAll of this is planning for the future. My intention is to work towards a career over the course of my university experience.\n\nAs someone who hasn't even begun university yet, is there anything you would recommend to do right now? Or should I take it easy and work through the respective channels as the time comes?\n\nThanks again",
            "> It's unclear what specifically you're looking to do within cybersecurity; our professions are not a monolith - there are many different roles that collectively contribute to the domain. Your selection of certifications likewise reflects this lack of focus (being largely vendor-neutral and generalized in subject-matter).\n\nI'm trying to become a Cybersecurity Analyst. Are these certifications good enough to guarantee me a job in the market? Or do I need to replace some of these certs with other/better certs? If so, what do you recommend because I'm completely new to this and have minimal idea/ information about Cybersecurity. Just looking to get started.",
            "\"I have a BS in Intelligence and Security Studies, - **Not relevant for cyber security\"**\n\nThe only reason I got it is because it was the one online program with my school that I could transfer to and complete while traveling. And I figured the analytics nature of the program would be useful to me from a conceptual standpoint. I was going for my EE before I got into this field and ended up having to quit due to travel.\n\n\"and currently studying Python - a**lways good to know for technical roles for automating tasks**  \n(plan to take the free Harvard course on CS). **Why? It's not going to matter on your resume\"**\n\nIts free and I am used to the school format. So I figured it would be useful to me to speed up some learning. There is no obligation to complete or even do any assignments, so the structure of the class is all I'm after.\n\n\"I am also going to get my Masters at WGU in Cyber. S**kip WGU, in general there's no reason to get masters in the commercial sector**\"\n\nI have seen the vast majority of mid to senior level jobs require a BS in CS. I can get this program done in a year - figured it would bridge the gap since my ISS degree isn't really relevant.\n\n\"Are you cold applying? Are you using linkedin for NETWORKING? actually connecting with recruiting, peers, hiring managers? Have you connected with any IT staffing companies or headhunters? Are you involved in any security groups, associations, conferences? Most job happen because of referrals not cold applying\"\n\nYeah I am definitely cold applying. Being in different TZ (overseas), makes joining conferences difficult. I will definitely work on networking. I'll have to look into some tips on that. I haven't connected with any headhunters either as my previous experience with them has left some bitter interactions.\n\nI have tailored my resume as best I can to follow the ATS format.\n\nAlso the CISSP is on my radar and I have the study materials for it\n\nThank you for your response !",
            "I have not started applying but working on adjusting my resume for GRC roles. Then can see if I can go ahead and make the switch.\n\nI dont have any certs yet, not sure which ones I might need or would what help. \n\nSalary is something Im considering too, I wouldnt want a big drop from where I am now (120k)",
            "Thank you!! Damn all those exams are expensive. By the moment im studying through youtube as I´m gonna take those exams only to get the skills, but im not sure if finally im gonna pay and make the exams. \n\nThanks again!",
            "Yes! All resources im finding are from internet and from librarys, I found a few books that are helping a lot but most of them are about laws.\n\n Im not 100% sure now if im gonna take this exams, because people with more experience are saying that the CompTIA Pentest + exam is not that good or useful coz there are better courses.\n\nThank you!",
            "I've been told I probably should do any of the isaca certs until I'm in an actual security role. Do you disagree with that?",
            "I've done some retooling on my resume that addressed some of the issues you had, I just had the image already.\n\n> I dont know what \"identified and resolved devices with missing EDR solution means\" (just kidding I do, but its just worded weird). \n\nWait, I haven't heard this before. Can you tell me what you find weird about my wording? And do you think that's also true about the allowlisting line?\n\n> Another thing I noticed is that you downplayed ransomware incidents, many professionals even in cyber security never had the opportunity to be exposed to a real IR scenario which it seems like you have based on your resume\n\nI've been involved only tangentially. I helped reimage workstations after one and identified a second, but the owner where I work did everything else himself.",
            "This advice is on point.",
            "Much appreciated! I think I've seen/read too many of the negative posts about how getting a foot in the door is impossible without a million high level certs and 10+ years of security experience (although, I have seen many job postings with that requirement for entry level stuff. So  that's frustrating.) \n\nI think my current plan is to finish studying and then take the 2 exams for the Windows Server Hybrid Administrator Associate cert and then tackle the CySA+. I'm close to being ready for the az-800 exam, which is why I want to finish that Server cert first.",
            "Thank you for the links!",
            "Yup. My degree is a BA in cyber. Had a ton of business as well as cyber security focused classes. The best part was I didn't have to go further than calc 1. Had so much more time for self dev type stuff vs a CS degree.",
            "Yeah, I had originally planned on going into a criminal justice career but my health took a turn for the worse and it’s no longer advisable for me to do a career in that. I’m hoping some criminal justice classes transfer as electives. Thanks for the info!",
            "Do you think that an associate's in criminal justice would stick out with a BS in Cybersec? I got my AS in criminal justice when I was in high school and am now 1 year away from graduating with my BS in cybersec, just curious. :)",
            "Thanks for the info. I was looking into focusing more on blue team roles rather than development or engineering. So maybe a BA will better fit me.",
            "So the question would be will it be worth my time going into a IT Support Analyst role? For the last year after college while looking at jobs I have been out of the industry working another job.",
            "So I am not in the industry right not but had an internship doing consulting that only was during the summer between my Junior and Senior year of college. At the moment I am in an Administrative assistant role not concerning IT at all. Thank you for the input I agree that I do need to pivot and look for more feeder positions. With the Cybersecurity degree I thought with the knowledge coming out of college I would be able to advance to that type of position.",
            "Thank you for the advice, I will take it into account for the future",
            "Thank you",
            "I know java and python.\n\nI'm working on sec+ and believe I could do net+ and A+ fairly easily if I did a good 2 weeks of study for each.",
            "Thank you for the link.\n\nI will start going through this and improving my stuff.",
            "Makes sense. Though the last few places I've worked haven't even bothered to verify the certs I do have.",
            "Hello!\n\nYes, i am well familiar with the fundamentals of networking which is why i didn't find the courses i mentioned as attractive as it was not enhancing my knowledge in the desired areas to get me ready for a job worthy position",
            "[removed]",
            "In the US\n\n In general. \n\nI know.",
            "I'm not passionate about it but it's something I'd be good at from my background. I'm exclusively interested in making more money than other options. In that case I'll take that mind, I would guess it's hard to land entry level jobs?",
            "Thanks :)",
            "I mean theoretical part of it. For ex, modifying the cypto system based on underlying math just to make it consume less resources but not compromising its security",
            "So I've always followed anonymous and everything they do, and I want to be like them ( writing it I realize I sound like a two). But anyway I've always been passionate about learning, always wanting to know how to code, always wanted to know how to hack and how to prevent hackers from stealing data.",
            "Are certain schools better than others? I was looking at CIAT and Harrisburg University.",
            "Yes, it's a program offered through eDX.  Am I better off getting the certifications on my own and if I do will I even have a chance of getting hired without a degree?",
            "what if I get the certifications on my own are you saying I will still not get hired anywhere as a cybersecurity analyst Unless I have a degree? I don't expect the same salary as someone with a degree and I plan to go back to college but unfortunately, right now, I work 12-15 hours M-F sometimes Saturday and it's the only way I can provide for my family right now.",
            "Hi, thank you so much for your answer. After reading your posts and others, I've decided to first enroll to get my bachelor degree ill start in september. \n\nIn the meantime, (I'm currently in Costa Rica) and was advised by people working here to get a splunk certification since it goes well with my background in data engineering. Also, thanks to my experience in Azure, I've seen there's a lot of openings that look for Azure (AZ 500), so my plan is to take advantage of that and get deeper into cloud. \n\nApart from that, I feel more attracted to becoming a pen tester or ethical hacker, so I have a list of certifications I could take. I'll share a game plan for this. Let me know what you think, please, of the certifications and the order: \n\n\n#### **Phase 1: Foundational Knowledge and Entry-Level Certifications**\n1. **CompTIA Security+**\n   - **Duration:** 3-4 months\n   - **Focus:** Basic security concepts, network security, threat management.\n   - **Potential Positions:**\n     - **Security Analyst**\n     - **IT Security Specialist**\n\n2. **Certified Ethical Hacker (CEH)**\n   - **Duration:** 3-4 months\n   - **Focus:** Ethical hacking techniques, penetration testing, vulnerability assessment.\n   - **Potential Positions:**\n     - **Penetration Tester**\n     - **Information Security Analyst**\n\n#### **Phase 2: Intermediate Certifications and Practical Experience**\n3. **Microsoft Certified: Azure Administrator Associate (AZ-104)**\n   - **Duration:** 3-4 months\n   - **Focus:** Implementing, managing, and monitoring identity, governance, storage, compute, and virtual networks in a cloud environment.\n   - **Potential Positions:**\n     - **Azure Administrator**\n     - **Cloud Operations Specialist**\n\n4. **Offensive Security Certified Professional (OSCP)**\n   - **Duration:** 4-6 months\n   - **Focus:** Hands-on penetration testing skills, practical hacking techniques.\n   - **Potential Positions:**\n     - **Senior Penetration Tester**\n     - **Ethical Hacker**\n\n5. **Microsoft Certified: Azure Security Engineer Associate (AZ-500)**\n   - **Duration:** 3-4 months\n   - **Focus:** Implementing security controls, managing identity and access, protecting data in Azure.\n   - **Potential Positions:**\n     - **Azure Security Engineer**\n     - **Cloud Security Specialist**\n\n6. **Gain Practical Experience**\n   - **Methods:** Freelance work, internships, personal projects, or part-time roles in cybersecurity.\n   - **Potential Positions:**\n     - **Junior Security Consultant**\n     - **SOC Analyst (Security Operations Center Analyst)**\n\n#### **Phase 3: Advanced Certifications and Specialization**\n7. **Certified Information Systems Security Professional (CISSP)**\n   - **Duration:** 6-12 months\n   - **Focus:** Comprehensive knowledge of information security, including architecture, management, and controls.\n   - **Potential Positions:**\n     - **Senior Information Security Analyst**\n     - **Security Architect**\n\n8. **Microsoft Certified: Azure Solutions Architect Expert (AZ-303 and AZ-304)**\n   - **Duration:** 6-8 months\n   - **Focus:** Designing and implementing Azure solutions, advanced cloud architecture skills.\n   - **Potential Positions:**\n     - **Azure Solutions Architect**\n     - **Cloud Solutions Architect**\n\n#### **Phase 4: Professional Development and Job Search**\n9. **Networking and Job Applications**\n   - **Join Professional Groups:** LinkedIn groups, cybersecurity forums, local meetups.\n   - **Job Boards:** Apply for remote and on-site positions through platforms like LinkedIn, Indeed, Glassdoor.\n   - **Tailor Applications:** Customize your resume and cover letter for each job application.\n   - **Potential Positions:**\n     - **Cybersecurity Consultant**\n     - **Network Security Engineer**\n\n10. **Build a Strong Portfolio**\n    - **Include:** Certifications, practical projects, detailed documentation of your work.\n    - **Showcase:** Hands-on experience with penetration testing, cloud security implementations, and Azure solutions.\n\n### Example Career Path with Azure Focus and Positions\n1. **Months 1-6:**\n   - Complete CompTIA Security+ and CEH.\n   - Begin working on personal projects or freelance work in cybersecurity.\n   - **Positions:**\n     - **Security Analyst**\n     - **Penetration Tester**\n\n2. **Months 7-12:**\n   - Obtain Azure Administrator Associate (AZ-104) and Offensive Security Certified Professional (OSCP).\n   - Continue gaining practical experience through internships or part-time roles.\n   - **Positions:**\n     - **Azure Administrator**\n     - **Senior Penetration Tester**\n\n3. **Year 2:**\n   - Achieve Azure Security Engineer Associate (AZ-500).\n   - Start applying for entry-level to mid-level cybersecurity roles.\n   - **Positions:**\n     - **Azure Security Engineer**\n     - **Cloud Security Specialist**\n\n4. **Year 3:**\n   - Work towards CISSP certification.\n   - Begin pursuing Azure Solutions Architect Expert (AZ-303 and AZ-304).\n   - Network extensively and apply for advanced roles.\n   - **Positions:**\n     - **Senior Information Security Analyst**\n     - **Azure Solutions Architect**\n\n5. **Year 4+:**\n   - Continue professional development, seek higher-level certifications as needed.\n   - Apply for senior roles.\n   - **Positions:**\n     - **Senior Security Consultant**\n     - **Cybersecurity Architect**",
            "My impression was that because the employer won't subsidize certs but *will* subsidize a degree-granting program, /u/Carl-Rodd is weighing the merits of the SANS program (i.e. dressing-up attaining a bunch of certs under the guise of the vendor's undergraduate  degree). Put another way: have the employer subsidize something vs. nothing. In that vein, I'd suggest they look at https://www.sans.edu/cyber-security-programs/masters-degree/ instead in order to pick-up some more tailored certifications.\n\nI concur with you otherwise.",
            "Great thanks!!",
            "Thanks! \n\nI’m good with some maths - just not the advanced stuff",
            "An excellent write up. Your assessment is actually quite accurate, now that I look at it; I've always had some sort of structure to guide me and now that I'm nearing the end of that part of my life, it's, frankly, a bit frightening. But you're definitely right. To answer your questions and concerns you posed:\n\n1. \"What are the terms of your scholarship?\"\n\nIf I fall below a 3.5, I lose the full ride and pay out of pocket, which would practically cause me to drop out. I commute, so no risk of homelessness or anything, but I'd like to not pay for college, haha. I could probably get away with B's and C's given how late it is in my college career and all the A's have racked up, but I personally want to keep my 4.0.\n\n2. As much as I'd like to being a home lab, your final observation puts a thorn in that plan; I need some instruction on how to go about it. I could \"just do it,\" and if I did, I wouldn't be very good at articulating WHAT (idk how to use italics on mobile) I did; if I was asked about a home lab, I'd say I did this, this, and that, but without instruction idk if I could explain how and why the home lab works, if that makes sense. I wouldn't even know where to begin without some sort of guide or walk-through. I think I need to find something that's practical and interesting, like you said.\n\nAgain, thanks for your response. I appreciate you taking the time to give me some hope and guidance.",
            "I do have the experience on team management, department and executive level management and been progressing in my career and learning as I progress. \n\nEven though I had a great set of technical certifications and years of experience, when I had a diploma (had to discontinue education due to personal reasons previously), there was a stage where I could never get into a managerial role, as this part of the region I work, the basic qualification was to have a Bachelor's degree. \n\nDuring the pandemic period I completed my Bachelors while working and soon after the completion and updating my LinkedIn profile, an HR from a company reached out for a great opportunity. Could be a coincidence, but I felt that was the turning point. \n\nSimilarly I would like to progress with a masters degree and hence looking for a suitable program, but came to the thought of having a leadership oriented program like the ones I listed. \n\nNot thinking that just getting masters would do but I believe its a combination of lot of things along with the education that includes and not limited to networking, community knowledge sharing, gaining business knowledge along with the technical bits and a lot more.\n\nThanks for the link, I wouldn't be looking at the company sponsoring my education but would be exploring this option.",
            "Yes I understand! I have already worked in a company for around 8 months now, as an intern, working on a real product for a full service digital agency. So at this job I'm having the chance to go even further and use it to get further into new subjects.",
            "Thanks! Yeah, you're right. Maybe I'm just being a little ambitious :p",
            "My apologies, I figured I would ask. Thank you for the advice. I’ll scroll through here and see what others have said.",
            "I get with any IT staffing company\n\nGet contract to hire role, business systems analyst, systems analyst get your foot in the door",
            "Sorry friend, but I lack context to be meaningfully prescriptive.\n\nLike, if they recently (or actively) are affected by cybersecurity attacks then handling that is probably more important (as the lone cybersecurity employee) than debating policy *first*.\n\nI also don't know any details about the systems/data you'd be handling (and - to be clear - I'm not inviting you to tell me); understanding them and getting familiar with normative operations *first* is likely key in drafting policy. You want to get the key stakeholders involved (i.e. no one will like policies affecting their work that they had no voice/awareness in its drafting, especially if it its detrimental to the workflow).\n\nThere's also something to be said about being aware of how your ROI is being perceived by the people responsible for deciding whether you should be retained/let-go. They have priorities/agendas for you - if you're not meeting those (and instead are campaigning for policy creation/adoption/enforcement), your tenure is probably going to be short. Drafting policy takes a *long* time, so it's likely you need to also be doing other things in order to point out the many 'wins' you're providing to your employer concurrently.",
            "To help you out a little more company wise I would need to know your country of residence. In general there are 4 different kind of companies you could be working in:\n- Security Vendor (Palo Alto, Darktrace, F5)\n- Managed Security Services Provider [MSSP] (Eviden, Accenture, IBM)\n- Government (Muncipality, Military etc.)\n- Private Sector (Healthcare, Finance etc.)\n\nAs for Cyber, there are many many many jobs to fulfill. To name a few:\n- (SOC) Analyst\n- (SOC) Engineer\n- Cloud Engineer\n- (Cloud) Architect\n- Helpdesk\n- Penetrator Tester\n- Incident Responder\n- Digital Forensics\n- Consultancy\n\nCheck out some content online (Youtube, Cybersecurity reddit) about what every job consists of.\n\nIf possible, reach out in the company you're doing the internship at to meet with any team member that is doing anything related to Cyber and ask if you can accompany them for a day.",
            "> What would the position/role/job you've mentioned (counselling cybsec teams) be called exactly?\n\nSome resources that might help with familiarizing the job landscape more generally:\n\nhttps://www.reddit.com/r/cybersecurity/comments/smbnzt/mentorship_monday/hw8mw4k/",
            "> I'll have to look into some tips on that.\n\nSee related resources:\n\nhttps://old.reddit.com/r/u_fabledparable/comments/17xlmrc/cybersecurity_mentorship_references/k9ogpq3/",
            "I see, yeah that salary is going to be tough to match, as my experience shows that SWE is the most lucrative position, especially at this level.\n\nBut hey, it sounds like you have a good plan and fair expectations. Best of luck!",
            "I'd say it depends on your learning style. Obviously being involved in daily security works makes testing for security certs easier. But it's not a requirement. ISACA is really lenient with their experience requirements, you have up to 5 years AFTER you pass to submit your experience. ISC2 requires it up front.",
            "Just one person's opinion, but \"deployed installation for missing EDR (mention edr tool here) and maintained x% compliance\" could work as well.",
            "> I think I've seen/read too many of the negative posts about how getting a foot in the door is impossible without a million high level certs and 10+ years of security experience\n\nI have a bachelors degree and a dozen certs. Not a single interview has brought them up. They ask about my professional experience and thats it.",
            "Thanks for the info! The BS my school offers goes into calc 2 so I was dreading it. I barely passed calc 1. I’ll try the BA.",
            "Might help if you are going into LE, but otherwise it probably won't hurt or help.",
            "blue team still falls under engineering.",
            "get whatever IT experience you can",
            "Based on the question you posted and information provided, its unclear how far along your professional career. If youre interested in learning SOC work, it would be good to learn the CYSA+ or GSEC material. We're not sure what you mean by job worthy, because if youre trying to skip straight to the SOC without getting into a help desk, youre gonna have a bad time.",
            "Well, you like many seem to be under the misconception that courses alone are going to be enough to get a job\n\nDo you have a college degree or are you currently working on one?\n\nDo you have any job experience in any kind of IT related role? help desk, desktop support, network analyst\n\nBecause neither pentesting or SOC analysts are entry level roles\n\nSecurity work is not entry level in any industry other than the military\n\nSecurity people regardless if they are in technical or non-technical roles are coming from IT/Operations roles before moving into security roles\n\ncommon paths might be\n\n* Software engineer to security engineer to security architect\n* network analyst/engineer to security engineer to security architect\n* Software engineer/QA/Testing to pentesting\n* Network analyst to SOC analyst\n* Business systems analyst to risk/compliance\n* systems analyst to security engineer",
            "And how would I know that doesn’t apply to you if you didn’t clarify that.\n\nCyber might not be for you. You need to be proactive and able to research things for yourself, not have others hold your hand.",
            "If you have a background in IT or Dev, it probably won't be hard to land an entry-level cyber job.\n\nIf you're just chasing money, software engineering is generally a better path on the tech side. Cyber pays pretty well at high levels but entry- and mid- pays are generally mediocre, inline with other IT roles.",
            "Are you in PA?\n\nWhy not penn state online or one of the regional campuses",
            "yeah delete that, don't do any of that\n\nThat list is completely devoid of reality on how corporate jobs and titles work and how long people spend in roles\n\nRead - [https://jhalon.github.io/becoming-a-pentester/](https://jhalon.github.io/becoming-a-pentester/)",
            "Np. Math is my weakpoint as well. I almost didn't pass my calc class as well. Big reason I went the BA instead of the BS.",
            "Frightening can also be exciting. A lot of public speakers say that they feel the nerves and instead of feeling fear they feel excitement and it allows them go.\n\nYou have nothing to lose. Find a job and it interferes with college then quit. You gain experience and lose nothing. \n\nHome lab -focus on something productive. My go to would always be NMAP. Learn how to use to to enumerate, fingerprint and exploit. It's lightweight, powerful and incredibly useful in a job.",
            "Hello, so I had a talk with them. \nThey do not have any policy as such, so they have asked me to make a policy. How do I proceed??",
            "Thanks a bunch for those. Will put em to good use my good sir!",
            "Thank you I will look into this tomorrow. 0100 here in Asia",
            "If you go the BA route you are going to learn less useful information. Use that extra time to work on your own stuff. This is very critical. Get an internship as well.",
            "Fair enough, thank you for the insight!",
            "Apologies if i wasn't clear enough in my earlier comments.\n\nMy goal is to land a SOC (starting from tier 1) job and a lot of them has common requirements and knowledge of frameworks such as MITRE ATT&CK, SIEM and much more.\n\nNow most of the courses like the one from Google Cybersecurity professional certificate and CompTIA security+ does not cover these and nor does it give you hands on experience with software and tools we can use on the defensive side, the how and where of threat hunting and such. I do understand network layers, TCP/IP, DNS and the basics. I would like to get into practical part of it where I am visually presented with tools, data, threats, how and where of these threats hunting and tools and measures to take to solve them. Similar to as it might be in a real job environment. I do not have advanced knowledge in such areas, maybe that's what i am looking for mainly. My knowledge is restricted to only the fundamentals and i would like to learn more!\n\nI came across Certified SOC analyst from EC-Council. I am not sure how well enough would it be for my goals and how far will it take me towards landing a job.",
            "[removed]",
            "Its tough being a one man department without guidance, but this is how some careers start. I would look into NIST or ISO for the creation of these policies. Depending on what policy they are asking to create, you can deviate their standards to something that fits your enterprise. \n\nHere is a crash course on cyber related regulations that would serve as your priority list . Focus on these first:\n\n[https://www.upguard.com/blog/cybersecurity-regulations-by-industry](https://www.upguard.com/blog/cybersecurity-regulations-by-industry)",
            "Yeah, I was looking at getting my CysA+ while I do the BA route since I already have Sec+. Thanks man.",
            "I appreciate the eagerness, I really do. However, there are thousands of applicants like yourself that do not have the credentialed backing to support your ability to jump into a security role. First and foremost, I believe you when you say you an understanding of the fundamentals but unfortunately thats not enough to convince the hiring manager who takes on that risk when trying to hire someone for a security role. By all means, keep applying for these positions even if the chances are small to jump straight in. In the meantime, I recommend going up the ladder (help desk > sys admin > specialist > cyber). On your way up you might just find something you love more than infosec.\n\n I would be able to give more information on how to get the hands on training that you're looking for and have made some videos on creating a red/blue environment that will give you that opportunity. Go ahead and look at my profile if interested. We can also discuss getting a call started and I can provide mentorship on getting you closer to your goals.",
            "Yeesh. Yeah you’re definitely not going to be good in cyber with such a thin skin.",
            "If you have to ask simple questions and can't do the research yourself you probably don't belong in the industry. \n\nPeople gave you the benefit of the doubt and you still managed to crap all over yourself.",
            "You're the one that got worked up about it",
            "I am asking a simple question to get peoples perspectives. Yes, I can obviously just look it up myself, but its not the same as a conversation",
            "no u"
        ]
    },
    "How realistic is Mr Robot?": {
        "title": "How realistic is Mr Robot?",
        "score": 18,
        "url": "https://www.reddit.com/r/cybersecurity/comments/1dlroom/how_realistic_is_mr_robot/",
        "content": "",
        "num_comments": 47,
        "comments": [
            "The actual hacks? They had a lot of solid guidance on how things worked so mostly pretty realistic. The rest, nope.",
            "They consulted experts on the tools and techniques, so as TV shows go its relatively good. I really liked how he applied real world solutions to real world problems; like bypassing MFA by just distracting the guy and looking at his authenticator app instead of using 'hacker magic'.\n\nThe results were often a bit implausible though. Like, you really knew what forensics software this shady organisation were going to use on your disk, and their forensic workstation was connected to their operational network in a way that let you pwn all of their infrastructure, doing all this recon and exploit dev alone in a miniscule timeframe? The 'we can blow up the building with computers' stuff was dubious too, but as a hacker series goes it wasn't too painful to suspend disbelief - especially if I watched it again knowing the twist.",
            "I've only watched the first season but the techniques and tacticts are real and are often employed by pentesters.\nFor the rest, Eliot is the equivalent of a team of senior pentesters, therefore not that realistic.",
            "I think the biggest stretch is when anyone works on someone else's code they instantly start typing in a bunch of commands instead of staring at it for a moment in confusion and saying \"What the fuck is this shit?\" as happens in real life.",
            "The attacks themselves are pretty realistic but what is not is the speed at which they work. If you are targeting a specific organisation it generally involves banging your head repeatedly against the wall and going down holes that lead essentially no-where. Where as Elliot seemed to hypothesize a chain and it just worked the majority of the time.",
            "Probably one of the most accurate for hacking. Most shows/movies don’t even come close.",
            "Yeah pretty realistic in that drug dependencies are a requirement in some teams 😅",
            "I am pretty sure they consulted David Kennedy on the tools, tactics, and procedures. That dude is legit and the hacks displayed are all clean and proper how a pentester or hacker would do it. \n\n\nThe actual storyline on the other hand is another deal altogether.",
            "social engineering FTW",
            "The technical aspect of the show was technically very competent and botherline the best\n\nBut it is still a tv drama, so...yeah\n\nSuspension of disbelief",
            "Some tools and concepts are real enough.\n\nThe results they achieved, not so much.\n\nSo 30/70.",
            "If memory serves me right, it was broadly pretty on point with its terminology, technical concepts, and methodology. Though definitely not dead on accurate. A show that is likely isn’t going to be as interesting or captivating to watch. \n\nAlso, fun fact: Rami Malek took coding courses prior to and after the first season to give his character portrayal while on camera more credibility and authenticity.",
            "Not at all. The most realistic hacker movie in my experience is _Swordfish_.",
            "In the way that it portrayed hacking, it is pretty spot on, as opposed to the normal way, like on NCIS.\n\nIn terms of plausibility, though, it's still TV.",
            "They had consultants to make it more believable. As for Elliott himself... well I suppose someone with a technical background and mental illness could be driven to do what he does. However, I haven't met many people at that cross section. If you're hacking because you're alone and traumatized please consider getting some help or talking to a friend.",
            "Random flashdrive on a parking lot is realistic.",
            "I’m a pro penetration tester, one of the greatest joys of Mr Robot (first season particularly) is how real the hacking is. Obviously it is exaggerated, but in comparison to some of the stuff put out by Hollywood, it is borderline documentary.",
            "Everyone else has touched on the tech side, so I’ll focus on some other elements.\n\nThe drug use isn’t too far off. Most people aren’t that far down the rabbit hole, but it’s kind of an open secret not to drug test your security/IT people if you aren’t legally required to. \n\nWeed is almost universal, I’d say about 75-80% of the industry is consuming some form of weed on a regular basis. Mushrooms seem common amongst malware reverse engineers. \n\nSome of big tech middle management is on “banned” neurotics. Think bulk modafinil from India. \n\nPentesters seem more like a poppers and molly crowd. Sometimes coke and other hard drugs if things aren’t going well. \n\nLots of smart people justifying to themselves how they aren’t addicts, because they are functional.",
            "To start with, pretty realistic.",
            "Season 1. Cyber security employee “what’s a rootkit?” Fml.",
            "Some extra background for you OP. \nhttps://youtu.be/_bBrj6QBPW0?si=C6xyFLOB4XYcLMGm",
            "The extra wifi AP plugged into the network was on point, although the actual target would have MAC controls on switch ports so it wouldn't have actually worked in practice but it was cool to see a real intrusion technique.",
            "Just a random anecdote I had on a test lately. I managed to get ssh access to an interface on a client server because of a poor password and username choice for an un-patchable service exposure. The connection put me into a VM that for whatever reason then had kernel access for power and heat monitoring of the physical server. I was able to disable the heat monitoring and cooling completely...then could have overclocked it causing physical damage. Was pretty Mr Robot like imo. The other thing that I could do was reboot this particular VM to boot in to sh which would have given a very very nice access point to company data.",
            "I do that looking at my own code.",
            "So true.",
            "Uhh, you obviously have never seen the movie Hackers. I mean, it's right there in the name!",
            "Didn’t he use David Kennedy as an alias when he went into a meeting to avoid getting caught for something?",
            "Kidding right?",
            ":)",
            "Lmao where the hell do you work? Everyone I work with is generic office people whose idea of an exciting night would be more than 3 beers.",
            "lol, this reads like a fan-fiction of a cybersecurity office.\n\nMy office is just a bunch of dudes with families. Maybe a couple that smoke a little weed here and there.",
            "Stuff like that is just to explain things for the audience, it’s clunky but it’s often necessary.",
            "You say this like it isn't extremely common for cyber analysts to not know what they are talking about.",
            "You mean cyber security account executive (Angela), they’re not going to know everything about everything.",
            "I’ve operated in several fortune 100 networks, NAC is pretty rare.",
            "Depends if the NAC is MAC or certificate based, first one can be easily by-passed, second one hardly. But then I saw organization being able to physically locate devices being plugged inside their network. A very passionating field indeed.",
            "Dave Kennedy is referenced, which damn near shook me out of my chair when I heard it, it was Offsec they consulted with. Kali Linux was released with a Hollywood screensaver to celebrate the end of Mr Robot.",
            "https://www.youtube.com/watch?v=u1Ds9CeG-VY\n\nThis isn't you on the daily?",
            "In secure government operations centers it's been standard for at least 2 decades.",
            "MAC based can be bypassed if you have some extremely detailed and sensitive information about the network, but the important line of defense there would be that any unassigned ports they have are black holed into a dead VLAN until assigned to a device. You need admin to the switch to put a device on a live VLAN in any secure network like an FBI field office.",
            "I love when my cubes aligned",
            "Sure but the network that you’re referencing in the show wasn’t a secure government operation center, it was a corporate building.",
            "I don't remember specifics from the show but it's not that far fetched if you have physical access or just exploit an endpoint on the network.",
            "Extremely detailed ibformation like when you unplug an computer and add a sniffer?\n\nor add a hub in the equation. Device unlocks, hub hubs, boom - correct vlan",
            "I did a pentest at a small bank once with NAC. My coworker got a valid MAC address off the coffee maker. Printers also work but look more sketchy when poking around as a visitor."
        ]
    },
    "U.S. Treasury Sanctions 12 Kaspersky Executives Amid Software Ban": {
        "title": "U.S. Treasury Sanctions 12 Kaspersky Executives Amid Software Ban",
        "score": 11,
        "url": "https://thehackernews.com/2024/06/us-treasury-sanctions-12-kaspersky.html",
        "content": "",
        "num_comments": 3,
        "comments": [
            "This post links to The Hacker News (THN). The moderators of r/cybersecurity strive to maintain a professional subreddit which will often discuss news, and further acknowledge that THN is a popular source of news within the cybersecurity community at large. We always wish to act in the best interests of the community and will not restrict news content which is accurate and valuable.\n\nHowever, it has come to our attention that THN has been accused of plagiarism since at least 2012 (ref: [attrition.org](https://attrition.org/errata/plagiarism/thehackernews/)), allegedly copying article contents from original authors and modifying them without appropriately crediting the original source. Their behavior has been met with repeated criticism, including making false statements (ref: [@thegrugq](https://twitter.com/thegrugq/status/902600568262107136)) and renewed claims of plagiarism (refs: [news.ycombinator.com](https://news.ycombinator.com/item?id=18783493) c. 2018, [reddit.com](https://reddit.com/r/privacy/comments/mczutz/the_hacker_news_profiting_off_extensive/) c. 2021). Due to these incidents, THN links have been banned from several subreddits including r/privacy, r/technology, and r/hacking.\n\nWe would hope that THN is now appropriately crediting sources of its content or writing its own original content, however we are unable to police each and every article. Please ensure that the information in this article is factual, and where possible, please choose to support high-quality ethical journalism directly. If the community feels this warning is no longer relevant, we will remove this AutoModerator action. Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cybersecurity) if you have any questions or concerns.*",
            "What kind of Software were they selling?",
            "What? It was Security Software! Consumer Anti-Virus. Like I said in another post, Kaspersky advertised on fucking NPR for like 20 years, I bet half of America blindly downloaded their spyware. Operating in plain sight..."
        ]
    },
    "How do you do threat modeling?": {
        "title": "How do you do threat modeling?",
        "score": 4,
        "url": "https://www.reddit.com/r/cybersecurity/comments/1dlvg6b/how_do_you_do_threat_modeling/",
        "content": "What is your approach to threat modeling? There are many different ways to do this on the Internet. Which one do you use and why?\n\nEspecially when it comes to insider threats? Perhaps you could recommend a must-read?",
        "num_comments": 2,
        "comments": [
            "Find all the trust boundaries and apply the STRIDE method to each one",
            "Quite new to Threat Modeling in practical terms. I settled for Data Flow Diagrams and Message Sequence diagrams and listing possible threats and mitigations for each point. Because they are familiar for non-Security people and don't have this aggressive undertone. (Kill Chains, oh no...)\n\nWhat really bugs me is how time consuming some formal methods are especially for complex systems and on the other hand some having serious down sides.\n\nI found this overview quite interesting: [https://shostack.org/resources/threat-modeling](https://shostack.org/resources/threat-modeling)"
        ]
    }
}