{
    "QUESTIONS & KARMA MEGATHREAD": {
        "title": "QUESTIONS & KARMA MEGATHREAD",
        "score": 25,
        "url": "https://www.reddit.com/r/darksouls3/comments/1bq9c0r/questions_karma_megathread/",
        "content": "Ask your Dark Souls III questions here!\n\nHead over to /r/SummonSign for jolly cooperation, or r/pumparum for trading/items.",
        "num_comments": 318,
        "comments": [
            "I need karma to post - an upvote would be kind",
            "Need karma to post lads, want to post a dark souls 3 Yohrm tattoo I just done 😎👍!",
            "Any chance i could get some karma to post?",
            "Being unable to post anything has been quite annoying, especially since I cannot get karma to post if I cannot make a post and I don’t particularly wanna comment on people’s posts just to get Karma, when will the requirement be lifted, if ever?",
            "I need karma for a post, I can understand it's needed, but man, I just need help in my character creator 😞",
            "My post keeps getting deleted because I don't have enough karma apparently.  \nCan you guys help me with a humble upvote? Thanks in advance",
            "upvote please :o",
            "I need karma to post LOL. Pls upvote :)",
            "do i need luck scaling on my weapon for bleed to scale, or does luck flatly effect bleed buildup no matter what",
            "I'm 10 hours into this game and I really feel like I'm doing everything wrong... I played ER, DS1, DS2 and I must say DS2 I clicked after few hours. In this game I simply can't. Not sure if my approach is bad but I can't stick with this. 10 hours on and off on \"best\" (/s) Dark Souls game is a little weird. Thing is I really enjoyed the start of DS1 and DS2. Not sure if maybe I'm burned out but I need some help to point me in right direction.",
            "help in need for posting, thanks in advance!",
            "need karma to post! if you could upvote i would be very thankful 🙏",
            "Could you lend me some upvotes so I'm able to post? I'm new here...",
            "I'm new to reddit, how much karma do i need here to be able to post videos here?",
            "Could I get some karma please? Thank you all.",
            "Hey i could use sone upvotes so i become part of this community , cheers",
            "How much karma do i need to post?",
            "I was going to make a separate post before I saw the karma requirement, so I’ll ask here instead. I recently decided to try DS3 after playing Elden Ring. ER is my only previous experience with soulslike games, so I wanted to know if there were any major differences I should keep I’m mind coming from ER. I’m unsure if DS3 has a respec mechanic like ER, and I don’t want to make a bad build if any stats are less/more important in DS3 than ER. For example, I’ve heard that vigor was more important in ER then previous games, so should I invest more into offensive stats?",
            "Can I get some Karma, want to post my sister Friede tattoo. Thanks in advance 😁",
            "Need karma as I need to ask questions I can't find any info for so pleeeaseee",
            "Hi! I want to do a playthrough with the demon's fist while using pyromancy, the thing is, there are enemies that are resistant to fire and I need a second weapon. I wanted to know what you guys can recommend as a second weapon for this build :)",
            "My post deleted for not enough karma so here is my question: \n\nNeed advice about my faith build.\n\nI'm playing (you guessed it!) a faith build but not like a full miracle based, like an paladin who uses miracles when needed. Anyways I went out of this road and made my build mostly based on miracles and I don't want that now I'm trying to figure out how should I reallocate my attributes. Here is the equipment I've been using:\n\nSunlight straight sword +5\n, Sunlight talisman +10 \n, Golden wing Crest Shield +5\n\nI have nearly all the miracles but I've been using mostly\n\nSunlight Spear\n, Lightning blade\n, Soothing sunlight\n, Tears of Denial\n\nBut now I don't want to use any of these, I've set my eyes on frayed blade but is requires 40 dex. Oh and I want to play Spears of The Church covenant so I need to make my build pvp based.\n\nLevel 101\n\nVigor 29\n, Att 31\n, End 26\n, Vit 17\n, Str 18 \n, Dex 24\n, Int 7\n, Faith 40\n, Luck 13\n\nHow should I make my build??",
            "What is the Karma requirement?",
            "need karma to post, please updoot",
            "Well, since apprently i need to karma to make a post, i'll paste it here:\n\nWhat should i expect ?\n\nSo, i beat DSR, Elden ring, and am now fresh off bloodborne, what should i expect from Dark souls 3, do it differ in anway ? Obviously bloodborne was more agressive, and elden ring was a open world game that was a tiny bit more forgiving, how would you describe DS3 ? I also played a bit of sekiro but am not counting it here since i didn't finish it, not cuase i didn't want to, but becuase my friend who was lending me his account to play it, got banned and i no longer has acsses to his library of games\n\nFollow up question: The elite knight set was the set i used for my entire run of dark souls remastered can i get it here too ? And if not how do i get the armor on the cover, it looks just as badass ?\n\nLast question: i've never beed into magic, what swords/greatswords, would you reccomend ?\n\nI currently beat gundyr and am at firelink shrine",
            "is there a faster way to farm convenant items than invading other worlds?",
            "NG+ Question \n\nDoes all of your inventory transfer with you? Mainly the covenant items? Trying to go for the platinum um and need 30 of each of them",
            "I've got a question about attack power:\n\nI've got the Greatsword (Guts sword) infused with a heavy gem and upgraded to +5, as well as Vordt's Great Hammer upgraded to +2, with my strength currently at 39. The physical attack power on the Greatsword is 224 + 201, while Vordt's hammer is 233 + 138. According to these numbers, the Greatsword has higher overall damage, and yet I'm one-shotting a Lothric knight with the hammer (light attack) while the Greatsword requires two light attacks.\n\nIs it strike versus standard damage? Or maybe the frost on the hammer that's giving it extra oomph? Just curious how this works.\n\nThank you for any help!",
            "Just defeated Yhorn the Giant with Siegward, and right after i finished talking with siegward a cutscene started of my character being teleported. Then the game started to load, and it didn't stop loading. I restarted the game, waited for more than a hour for it to load, and tried to overwrite a save with my save and it still doesn't load. Maybe i could make it work by teleporting my character to another location but I dont know how to do it.\n\nThe save doesn't seem to be corrupted, it doesn't show any error messages and the time played and the SL still show up normally.\n\nWhat can I do to save this? I really don'ty want to restart my save with 30 hours of playtime.",
            "I need karma for a build related question. Can anyone upvote?",
            "I'm having problems with my randomised run, sister friede turned into a thrall and now when I go to activate the boss it keeps attacking me. What do I do?",
            "not sure how much karma i need but im here anyway, also when my post go's through moderation please cheek it out",
            "I need karma so i can post",
            "Need karma to post, as i have some serious issue with the gane i need help to resolve so i can even play it.",
            "How should i finish the game\n\nSo i started playing through datk souls 3, and i am very endgame. I just beat Dragon Slayer Armour (kinda a pushover ngl) and im pretty theres like two bosses left in the main game the prince (idk his name) and the lord of cinder, also haven’t done nameless king ether (not planning on doing him cause my friend wants to watch).\n\nBut my question is should i play through the dlc now or should i finish the base game first then do the dlc?",
            "I'm doing a full completionist run in DS3, but I didn't remember that basic soul items found during exploration get replaced with better soul items in NG+ (not talking about boss soul items). If I used all of my basic soul items in NG, can I find all of them even on NG+ or do I need to mule them from a ng character?",
            "Hey everyone I cant post bc if not enough Karma so here is my question. \n\nI am trying to kill Yhorm and I read that lightning is his weakness. So I infused the Claymore with it and it doesnt seem to be lightninging. Do I need to pump up my faith in order to see effects? If so, is there a way I can respec? \n\nThis is my first playthrough. I have played Elden Ring so if you can compare any tips to that, that might help me understand but this big fuck is rly hard",
            "So I can’t create a post yet because karma. So here it goes.\n\nHey. It’s time I’m going to play ds3 again. In every souls game I run around light weighted with a ultra greatsword and bonk everything to death while rolling half naked around 😅\n\nSo please guys pick something for me to use that’s way out of my comfort zone.\nMany thanks :) \n\nSo I can’t create a post yet because karma. (I always thought karma was something that happens afterwards and not before. Or am I wrong)",
            "Is the DLC included on The Fire Fades Edition disc? I got it used and idk if it's supposed to have been a download code in the box or its on the disc. Mainly asking so I know whether I need to buy the dlc or not",
            "I want too make a discussion about the nostalgia nods but due lack of karma i could not so may i ask so i for votes so i can post here.\n\nHere is my post.\n\nWell there are many nods in Dark souls 3 we do not have to forget that their are also many new things added to the souls formula like pretty much all bosses are new they have deep lore and what not, new NPC and some memorable quest lines.\n\nNow what about the nostalgia nods well they are present i suppose like Onion knight Anor Londo some equipment ect and perhaps there is a nostalgia bait aspect too it but on the other hand they are expended on previous characters or world, i mean the best one is Patches he was probably the best in this one. Not only that this game theme deals heavily on the old age dying out and trying to haphazardly keep it alive, so seeing dead NPC creatures or broken buildings is an extension to that idea.\n\nIDK i want discussion so go nuts ps the Dylan Sucks 3 is just a dumb joke...",
            "I need karma to post, I promise I will be a good boy when posting something.",
            "how do i get summoned is there restrictions",
            "I'm needing help with siegward's questline\n\nso i know all the steps and such, but he isn't spawning in the well.\n\npatches is in firelink (skipped him posing as siegward by going to rosaria's first), he isnt selling the armour and siegward isnt in the well. \n\ni opened the doors at the top fyi, i've tried all the things for it but nothing is working. any help?\n\ni'm on ng+ so i have his set already but i wanna do his quest again",
            "Im playing ds3 rn and I want to know the best way to end this game (ik what the endings are so u can spoil ig). I dont want to know what the \"happy\" ending is because after some searching it seems that no one really knows what happens after any of the endings. I just want to know which one is the most climactic and most satisfying to end off with. I played ds1 and did the ending where you light the bonfire in case that adds to what ending would be best for me.",
            "Okay, I'm a little uncertain about the karma requirement seeing as I already had at least one upvote and still got my post deleted. Also, not sure if my original post broke any rules since it was a recording (see rule 9), but I saw a similar post earlier so I had thought it was allowed. Might as well ask a question while I'm here. Any tips on dealing with Sister Friede on SL1? I lost my original SL1 run save, so I have to do this again, and remember I was struggling with her last time. I even beat Nameless King, but not her. So, any tips?",
            "I'm lost. \n\nQuestion 1\n\nI am generally okay with open games, which there are several different paths that can change the course of your play, but in this game, I just can't get used to it. \n\nShould I just stop worrying about discovering everything, and leave things for my next run?\n\nQuestion 2\n\nI don't really struggle with bosses. \nNormally takes 3 to 4 tries to get the boss and continue the game. \nWhat's being an issue is the trash mobs in the areas that I somehow just can't get used to their movements and positions. \nI really enjoy fighting the bosses, but whenever I finish a boss, my enjoyment plummets cuz I have to waddle through places that I don't know where is what enemies, with bonfires that are hard to find in a streamlined matter (Sekiro did way better job with Statues I guess) and I just don't feel like I'm getting better at all, cuz all it takes is some mob in between bosses to kill me over and over. What should I do?",
            "(Didn’t have the karma for this as a thread so copy-paste…)\n\nI’m looking to make a build just to play differently and do something weird. I can’t re-find the video to save my life, but I was inspired by a PvP build that used a right-handed shield and left-handed weapon, trading into all attacks with the “kick” push. \n\nI was thinking of recreating this as a Raw gouge build (trading with the push takes a ton of stamina and missing the input means eating an attack), using the Pierce Shield for more oomph and maybe a axe or hammer… something that could do good Raw-infused after they stagger from the bash so I don’t have to invest in the usual STR/DEX. If it needs only 10 STR (same as the shield) that’s even better.\n\nAny suggestions for making this more viable? The shield choice, offhand weapon, rings, buffs…? Heck, I’ll just take general thoughts.",
            "Would like to know what I can do to optimize my damage besides level up more as I'm currently using Homing Soul Mass and Soul Spear as my main sources of damage with a +9 Court Sorcerer staff. I'm not doing bad for mid game, but I feel like I could possibly do more damage.",
            "I have 10+ estus and total of 14 flasks!! Why oh why am I missing something I have allocated everything for heals but no luck",
            "how wast is it to speedrun the paltinum of the game with knowledge and friends helping for drops/items ?  \nbecause i see someone claiming they platinumed the game in 26 hours, wich sems unlikly, even with multiplayer and save reset for ending, anyone know if its doable ?",
            "What is an SL1 run I keep hearing people talk about? I have only started DS3 recently and I am in Carthus Catacombs.",
            "I know of the torch, but are there any weapons that passively give off light? I don't like the super dark areas and want something to help with that if possible",
            "99999 souls in one can get me banned?",
            "I need help for karma to post thanks !\n\nalso \n\nI JUST LINKED THE FIRST FLAME LET'S GOOOOOOOOOO",
            "so like who exactly is souls of cinder. Ive heard people say that SoC is our player from ds3 but Ive also heard some other ambiguous answers. I want to know like who exactly is this guy and why are we fighting him",
            "Hey guys, would love to post, can I get some karma?",
            "I need some karma boys,Help would be appreciated.",
            "Hello is there a specific subreddit to get help on Dark Souls 3? Or is this sub okay?\n\nThank you!",
            "Normally don’t post, but needed to ask a question, so some karma would really be helpful.",
            "Just need some karma to post😎😎😎😎",
            "I need karma to post some ideas i have so any help would be very much appreciated!",
            "It took me more than 1 week to finish the game, didn't expect to finish it this fast but there are days I would go from Pontiff all the way to Dragonslayer Armor.\n\nIn Elden Ring I was using a Dex build (Bloodhound Fang/Morgott's Cursed Sword) so this time I tried Strength build. Eventually I found out Gut's sword/Yhorm's is as fun as swinging Great Club around. So effective to one-shot mobs or stagger them to death.\n\nBiggest struggle I had in the game was probably Pontiff and Dancer. Otherwises I can say most of the bosses are very fair to play (and easier than I expected). Twin Princes is awesome, Soul of Cinder is badass and Nameless King is flashy (at 40 vigor and 14 flasks +10 it's too damn hard to be killed).\n\nI think I prefer the way the level design in DS3 than in ER (just like \n in Sekiro where ). It's nicer to run around and find out I made a shortcut to the original bonfire and it all connects together.\n\nOn my way to clear the DLC, and hopefully will play DS1/DS2 after this",
            "I'd like some karma, if you don't mind. I'd love to add some more pictures to the sub.",
            "i just wrote sucha long post to discover there’s a “karma requirement” 😩",
            "i was thinking caestus because it can be infused and upgraded to +10 but demons fist and dark hand seem good, though ive never touched either of them before\n\n\n\nim excluding weapons like claws cause i feel having that extra range is kind of silly when the idea is getting in the bossess face and just throwing hands, also i plan to take pyromancy too for this playthrough since ive never done it before. which infusion and which stats would you guys recommend? this is purely for PvE",
            "Where's the best place to invade right now?\n\nI am level 115 and sort of new to PvP. I've been invading at Ariandel Chapel with some success, but 95% of hosts here either have other phantoms with them or are nowhere to be found so I end up warping home. I tried Pontiff once but took way too long to find a host so not sure if I'm overleveled or what.",
            "Ok so maybe I've gone a bit psychotic from this fucking horrendous farm but I'm pretty sure the stairs themselves on the stairs to anor londo play a part in the droprate for the proof of concord kept from the silver knights. I just spent 95 minutes farming the two silver knights on the stairs to anor londo and what I always do is lure out the spear guy and kill him first then go for the swordsman. I did this for 96 minutes and got ONE single proof and it was at the top of the stairs from the second guy. Then I tried maybe lowering my item discovery to 200 and doing it only at the top of the stairs. I did this after 17 times got another proof of concord kept. Then I tried it again with 500 item discovery and indeed the drop rate went up to about one proof of concord kept every 7 runs, with me getting two of them per run twice. So 100 minutes later I had 12 more proof of concord kepts. Now I tried farming again luring the spear knight down out of the stairs and again I spent more than 20 runs with no proof of concord kept before giving up. So by this I'm thinking maybe theres some sort of bug with the area itself that affects the drop rate depending on where you are? Or maybe i've just gone insane? also will using cheatengine offline to spawn these fucking items get me banned or is it like in DS2?? ((just asking teehee teehee teehe god fucking help me.)",
            "Any paired weapons as good as, or better, than the sellsworn twin blades? Ever since I picked the starting class that starts with them, I've been hanging onto them all the way to now where my next boss is Dragonslayer Armor, then Lothric Princes. I love katanas, so I decided to try out Uchigatana and the Washing Pole. As fun as they are, they just feel much weaker than the win blades. Haven't experimented with any of the other paired weapons yet, but seems like there's a bunch of them. Are any of them on the same level as the win blades? Or is it safe to just stick with these until the end? Doing a mainly Dex build",
            "if i use the Dark Blade miracle with an int scaling talisman, does the int effect the miracle's buff? Im asking because I've heard people say only faith can effect buff miracles",
            "looking for advice about Ghru spear witch!\n\nI've never gotten around to doing poison stuff in this game even though it looks super fun. I think it would fit a gross magic kind of guy, probably with the Karla set down the line. I was thinking about doing raw ghru spear with weapon buff spells but wasn't sure what road to go down buff-wise. Faith would give me access to lighting buffs, magic buffs, holy buffs, fire buffs, and dark buffs, but i have to get past abyss watchers before i can start thinking about that stuff. with int, however, i get buffs as soon as vordt is out of the way. plus i can use frozen weapon later on for dual status effects, though it doesn't scale so i prolly won't use it.\n\nalternatively, should I just do a luck build...",
            "Howdy there jolly strangers.\n\nI have an odd request from anyone willing to help. I would like to know the dimensions of the Hallowslayer Greatsword in real metric as I would like to have one made for myself. Anyone willing to help?",
            "I just want to know if the female character in DS3's running animation is faster than the male's as I've heard that is the case in \"Dark Souls\" but I don't know which games the statement applies to.",
            "I died to npc invaders and after that they didn't invade again what's the problem?",
            "today i summoned a mad phantom and got nothing when i killed them , is there a reward that i missed ?\n\nalso it seems like mad phantoms are actual players not npc , is it true ?",
            "Post got deleted, so I leave this here: what happens if you don't meet the \"magical stats\" (Int or Fth) requirements for \"non magical weapons\" (such as the swordspear or the firelink sword)?",
            "First time on the sub posting/commenting, but I'm trying to find out about a possible cheat/mod that was used against me in a pvp encounter and want to ask if theres preventive measures or if I just have to submit and accept the situation",
            "\"Caution, you have been penalized\nInvalid game data remains present on your account\"\nI received this message today, I only used mods to increase the texture quality to 4k, to change the buttons to PS5 and to increase draw distance (which I belive was the problem, even tho the modders says it shouldn't cause ban).\nI removed the mod just now and logged in again, same message, how can I fix this? Do I lose my save because of that?",
            "I have a little bit of a random question, but is there a way that anybody can get me some really detailed close-up screenshots of Yuria of Londor, from multiple angles(full body and upclose) including as close as you can get to the hilt of her blade Darkdrift on her waist? I’m working on a costume, but I am having a really hard time finding detailed game screenshots and dont own the game.",
            "I accidentally killed Orbeck of Vinheim and now I don't know if I can give Logan's scroll to Karla.",
            "How do I avoid Fight Clubs. I'm just trying to do Red Sign duels to get my last covenant items. I hate Fight Clubs, they just are not for me. Pontiff and High Wall are the only pvp hotspots I know of but they're also flooded with Fight Clubs that have mods to auto summon all red signs. What do I do?",
            "I wanted to post this but I can ask it here too:\n\nDoes anyone know where the remixes of Dark Souls 3 themes have gone? I cannot remember the channel but he had epic remixes of all the boss themes, one of the most famous ones being the Abyss Watchers. \n\n  \nIt would be really sad if they're gone forever.",
            "I didnt receive the \"Light the First Flame\" achievement.\n\nas the title says, i didnt get it. i dont use mods either. \nI thought steam might be lagging and so i decided to check if the achievement thingy is working by getting all 10 Undead Bone Shards. \n\nI got all 10 shards, still no achievement. I restarted steam. Still no achievement. Wth xd\n\n(its been 6hs)",
            "I read a comment on one of the souls sub-reddits that Vitality is one of the most important stats in the game, but I just beat the game + DLC's without leveling it at all (level 10). And found the game quite easy, the toughest boss was Friede at around 5 tries. I know i'm not a good player because I get hit a lot and miss time my rolls, so this must not be right, right? I ask because I've seen people talk about the importance of this stat multiple times.\n\nAlso, if I did not read item descriptions am I dumb for not having any idea about the lore? I just beat the trilogy and I don't think I could write two sentences about the lore.",
            "I can't post because of Karma Requirements, but I need you're help either by upvoting my comment, so I can make a post or by helping me with the problem I explained below. Thank you :)\n\n  \nI have a really strange problem. Ever since I installed the unsqueezed mod to get ultrawide support, the game crashes everytime I get a steam achievement (f.e. after beating a boss). There is no error screen. The game shuts down quietly. Another strange thing is, that along with the normal steam achievement sound the metal gear solid alert sound plays aswell. This is probably also caused by the mod. I already reinstalled it multiple times and tried both the Special K and the DS3Tweaker Method. Has anyone else experienced this? I there a fix for it?",
            "Hi, I want to play a magic caster from NG to at least NG+2. I want to use all 3 types of magic, maybe each per run or can reset mid run. Some melee weapons like sunlight straight sword or moonlight great sword are required because fp are not enough to fully clear an area.\nWhat is the best base class for it?",
            "hola ,tengo una duda ,quiero comprar dark souls 3 para pc por primera vez ,pero no se cual es el que tiene los dlc incluidos en la compra en steam ,con comprar la vercion deluxe edition ya viene inluidos los dlc de la ciudad anillada y cenizas de azrael o solo se puede comprar por separado ?",
            "I found an old save that had the Twin Spellblades with a sharp gem, 71 dex, 25 vigor and 20/20 endurance / stamina. Naked. Rings to boost equip load and dmg based on lower equip load.\n\nIs this build OP? I have no idea what I was doing to get there but I was located at the start of the Ringed City DLC when I opened it and had beaten the Soul of Cinder.",
            "so when is return to lothric this year? \niirc it used to be around summer but did it get moved because if the er dlc?",
            "hey question if I do not get the quiet resolve gesture from anri can i still get the marriage portion?",
            "IN Dark Souls 2 SOTFS I could use my keyboard number pad and had the Decimal point \\[ . DEL \\]as my Dash backstep roll.. and the Number pad + was my jump.\n\nBut in Dark souls 3 it will not let me use those same ones. Num pad 8, 2, 4, 6 work fine for my forward, back, left, right.. but it will not let me remap what I want.\n\nSo I am guessing AHK will be the way to go, but I can not find any videos or tutorial of how to remap the controller button B to the \\[. DEL \\] button on the number pad.\n\nAnyone know how to do this?\n\nI dont play online, this is offline, and not on steam.",
            "If I'm planning to go for Friede's Scythe, should I use this raw gem on Uchi?  (On the high wall of Lothric)",
            "Came from Dark souls 2 . Was looking forward to Dark souls 3.   Those Lothric Knight , the one after the Wyvern, and the other one the way down to the Big Dragonrider looking dude.    The first one with the shield and sword..\n\nThese dudes got like unlimited stamina.  stab stab stab stab stab..  I roll around then, but then they just bash bash bash with shield I try to attack and they stab stab stab stab stab stab stab stab stab stab stab stab stab stab stab stab stab stab stab stab stab stab stab stab stab  bash bash ..\n\nForget this game lol. \n\n# \n\n#",
            "If I've got a level 150+ character, do I have any chance of getting enough summons for 30 sunlight medals or am I better off farming them from Lothric knights?\n\nBecause I farmed Lothric knights for an hour and got a fat zero of them with 340 discovery",
            "[deleted]",
            "Hi. I play on Steam Deck. \nIs there a way to find a player (Steam ID) summoned twice in my previous game?\nI found a subcategory on \"Contacts\" menu named something like \"Game partners\" (not sure if it's the real name, my Steam UI isn't in english) but it's empty... :/\n\nAny idea?",
            "where to find delicious shit?",
            "I need to farm vertebra shackles. Do the skeletons in the ambush at the end of Carthus drop them? I need a way to farm them, thank you.\nEDIT: I did all 30. I farmed at the Carthus Catacombs Bonfire, backtracking past the ball, the two swordsmen.",
            "Is the farron greatsword a good weapon to use?",
            "I’m have an actual question but I would appreciate it if I got an answer and some karma to post. So I’ve got Elden ring and sekiro,and I wanna get some new games so I wanna but the dark souls series and blood borne. Which one should I do first?",
            "EDIT: I DID NOT LOST IT ALL! I HAD AUTO CLOUD STORAGE ACTIVATED WITHOUT KNOWING!\n\nIF YOU PAY PSPLUS COPY YOUR SAVEFILES ON THE CLOUD.\n\nSorry for the Caps, I am very happy for not having lost all my progress.\n\n[PS4]\n\nI just lost a 55 hours save file of Dark Souls III.\nI was farming Wolf's Blood Swordgrass at the Keep Ruins Bonfire, and suddenly my savefile is damaged. \nDeep in NG+ making all the boring tasks to get all achievements, and now It's gone forever.\n\nHOW DOES DARK SOULS III, AN 8 YEAR OLD GAME BY ONE OF THE MOST SUCCESSFUL VIDEOGAME STUDIOS OF THE LAST 15 YEARS, STILL HAS GAME BREAKING BUGS.\n\nI feel useless, and a time-waster...",
            "Finishing a sorcerer run in ds1, so I am checking to do a run in ds2 or ds3. Last time I checked in forums and reddit the sort of collective agreement is that magic is harder initially as the combat is a lot faster but then levels up at the end. And pyromancy is easier than sorcery as it scales better and has more stuff earlier and the level requirement makes easy to do dark stuff. Is this still the case? Or there have been any change or patch lately? Thanks.",
            "Are there any more pyromancy books or what have you beyond the abyss watchers? Just beat them with my strenght build, am stuck at them on my mage build, and am in the swamp or almost to the swamp with my cleric, pyromancer, and dex builds. Any tips or something would be much appreciated, friendos.",
            "I want to start a new run after some years, which weapon type should i use?\n\n\nAlso it is worth it to go for an hybrid faith+strenght/dex build? Is it fun?",
            "Best weapon for a 40 str/40 dex/40 int/40 fth build?",
            "Are shields actually worth using? \n\nI'm trying to keep my weight under 30% and I'm only just managing it without a shield, so I'm gonna have to put a \\*lot\\* of levels into Vit to start carrying one, but I'm not really sure what the point is. I tried using one at the start of the game but I still recieved a ton of damage using it and I don't understand how the parry works at all, I seem to get hit no matter how I time it.",
            "About softbans\n\nI got softbanned maybe a year or something ago due to forgeting to move out a modded save file and i havent felt like getting it removed until recently, but when i was playing multiplayer with someother softbanned players one of them dropped 99 champion souls, I didn't use any of them and dropped them immidietly, but can i be unbanned even though i picked up a cheated in item on a save i currently have loaded?",
            "I made it to anor londo, I’m level 46 but I think I’m underleveled and I don’t know what to do. Enemies don’t give me enough runes to level up unless I kill like 12 of them and I’ve got no idea how to level up. I just feel so stuck even though in ds1 and ds2 I was perfectly fine.",
            "What kind of damage does Friede's as well as the Dancer's black flame do?",
            "Hey, i'm having an issue with steam and dual shock 4 controller on PC.\nEverything works great while playing on big screen except for switching targets.\nMoving the joystick doesn't work. Any idea how to fix this?",
            "I'm looking for someone who wants to clear the Mound Makers Covenant (Vertebra Shackles)\n\nWe could help each other.\n\n&#x200B;\n\nor anyone just willing to help me getting the 13 I need will do, the offline grinding is driving me insane\n\nthanks",
            "So I beat the Ringed City without ever meeting Lap, is it to late?",
            "Does two-handing a weapon that does not have any scaling (Fire/Deep) affect its damage?",
            "Can I play the dlcs after completing the main game? Or does this game immediately start new game plus after completing it like Bloodborne?",
            "Should I buy Dark Souls 3 on base PS4 or XBOX Series S, which is the better version?",
            "Is there a lore reason why sometimes your characters makes the big jumps and other times just falls to his death?\n\nFor instance Demon in Pain and Demon from Below, you access the fight by jumping such a large distance and you dont get damaged.\n\nHowever everywhere else, unless you use Spook or something similar you get fall damage.",
            "anyone know the minimum soul level to be able to use every single spell / item? also could use upvotes for posting",
            "What are some of your head canons relating to gameplay? \n\nI go first:\n\n\nThe reason the ashen one is able to wield all weapons masterfully because of the souls he/she consumed also gives him/her insight on how to use it.feel",
            "just beat the horde of soldiers guy and ive been using claymore since i started the game i have 23dex and 15 str what other weapon should i use",
            "I have both a question and an in-game karma thread.  A friendly summon dropped 250k worth of consumable souls for me.  I'm level 40 in the cathedral of the deep doing a melee pyro spec.  Should I use them?  Feels wrong.",
            "Please recommend me a fun weapon or build for my return to this game.",
            "am i going through ds3 too quickly? im only seven hours in but im lvl 40 and in irithyll dungeons. every boss so far is just really easy",
            "Hi, I'm using soulsplanner to make a build for my next playthrough. However, when I put my attributes on the planner it says I have 5 more levels than I actually have. Why is that? It is because of the Dark Sigils levels?",
            "I don't think this requires a full thread, but is the game \"dead\" with ER and it's DLC being out? I'm getting my ass cooked by abyss watchers and after making sure I'm embered and all settings are open to everyone, I can't find a single non-NPC summoning sign. I even tried placing my sign down for a while and wasn't summoned either.\n\n\nI've been stuck here for 3 hours and will probably look into farming levels because I've never been hard stuck on a boss like this and it's pretty discouraging",
            "Yo I’m new to the game and been playing through taking my time - what should I do about weapons? I’m currently in the farron swamps (ew) and rocking a great machete - it hits hard but it’s so slow - should I keep it or look for an upgrade, any recs?",
            "Hey Dark souls… players!\n\nI’ve recently gotten the BloodBorne plat and now I’ve bought DS3, it’s great! I’ve beaten IudeX Gundyr but I have a problem, parrying feels weird. Like in BB you parried with a gun and while I have successfully parried like three times it just feels weird, Any tips on parrying? Also I know there’s like poise and poise breaks, what‘s that? Also I’ve heard you can parry Gundyr and can you parry almost all human-bosses here too?",
            "Do passwords interfere with other multiplayer functions? Like if I set up password \"help\" with coop friend, it doesn't interfere with invaders? So there is really cost of keeping a password on and also doing casual looking for multiplayer invasions/signs, right?",
            "You will probably never read this but thank you Anathol, I'll name my first child after you.",
            "I have to beat Nameless king and am struggeling a ton, so i was thinking of switching to a pyromancy build.\n\nMy current build is a INT one, without any spells just for MLGS.\nMeaning i also ignored atounment\n\nIm around level 90, and only leveld a bit of strg, Most into Vit, End, Int and nothing else. \n\nI started as the knight class btw.\n\n\nSo, what would i need for a pyromancy build, and whats the best location to grind souls in as i dont have any big souls left (oops).\nAnd should i respec?",
            "Any good guides for someone replaying this game intent on trying to knock out the NPC quest lines and every boss (DLC included)",
            "Does anyone know how to get unrestricted? My little brother played my game with mods last year and now I can't access multiplayer. All the information I can find on it is outdated and doesn't work anymore.",
            "D'oh, I forgot about RTL. Will hop on tonight. If you meet Friendly Trader on pc, say hi",
            "What is the soul of a demon Best for if I'm doing a strength pryo build",
            "Need help farming vertebrate shackles , can a brother help me please 🙏 last thing I need to platinum the game",
            "How do you deal with those turtle guys in Ringed City, i swear to god, i spent the last 2 days from the Ringed Inner War bonfire and the journey to the lake was miserable, and wtf is that hoardes of mobs that you need to plunge attack ? Am i suppose to get better? Or just run through them ?",
            "What's the current state of cheaters/hackers in PC multiplayer? Haven't played the PC version in ages, do I still need the Blue Sentinel mod or anything else to protect me from hackers while playing online?",
            "Whats the best build for a new player,i saw a lot about dex or dex faith",
            "I really want to play with the washing pole but dont know what my build should be life. I would really appreciate it if someone can help me!",
            "Need some help with vertebrae shackle four mound makers , i want to skip the farming, please help",
            "So basically i just beat aldrich but i died just before cutscene popped(still got the slain screen) but the game seemed to want to teleport me but ofc i died so i sent back to before the boss. Now idk where to go and im worried my game is softlocked",
            "Anyone know about Return to Lothric this year?",
            "idk if this is the place to ask but, any reccomendations for a budget prebuilt gaming pc or laptop that can run honestly anything in the souls series? my current laptop is not made for gaming at all and unfortunately can't even run PTDE.",
            "Any recommendations for my build?  I've got +10 sharp Sellsword Twinblades.  I guess I'm going for a Dex/Faith build, but don't really know what that entails.  Also, people say the Twinblades melt bosses, but I'm not really seeing it.  Am I doing something wrong?  Should I respec?\n\nhttps://preview.redd.it/eula5ds5jd5d1.jpeg?width=2560&format=pjpg&auto=webp&s=39dcc8f1da381b099204ab6c33be12e3fa21448b",
            "I have no idea whether to take the dark sigil free 5 levels or not. Currently struggling to kill the curse rotted Greatwood im about level 20-24 something like that ~ running a deep battle axe thingy at +2, fire mail breaker +1, longbow +1 in left hand (also tried rapier with fire resin thingys on the boss) and Pyro glove +1, and a bell chime thingy in the other. I do have some shields to try as well - been running the silver kite shield but took it off so I could change my armour try up my poise but I don’t like what I’m wearing so I might go back to the nicer outfit 😂. 5 estus and 2 ashen at estus +1",
            "Can I give myself rings with the cheat engine and go back online without being banned? Also would this also work for the +rings that you can only get on new game plus runs?",
            "Is a blood/ poison gem better for a luck build or should I just go hollow and add resin",
            "So my current pyro save has glitched somehow and won't let me continue it, I'm going to start a new save as a STR main however I've literally never played a physical dmg character in a dark souls game so I was looking for suggestions on how best to start? (Ps all I wanna do is tank and bonk)",
            "I'm just starting Dark Souls 3 over again, I'd only gotten like 8 hours in before. I've beaten Dark souls 1, most of 2, bloodborne, and sekiro, so I'm very familiar with the gameplay loop.\n\nWhat are some fun weapons (or spells) to aim for in the first half of the game? Either boss soul weapons or ones you can just find, I'm still early enough in the game I can go for whatever build.",
            "I need some tips on how to beat the Twin Princes. I play a pyromancer with a strength weapon . I can usually beat phase 1 but that damn twink in phase 2 always kills me with his spells(miracles? they are not blue , so i dont know)",
            "Is it true I have to do nameless king to do the DLCs? He was kinda kicking my ass so I left him for later and went to the painting area but a friend told me I need to focus the nameless king first",
            "Currently doing a Str/Faith build and struggled quite a bit. Most of my souls are spent buying miracles/spells so it's quite weird going into Pontiff with just 18 vig.\n\nI have to use the ring that adds 1 more spell slot for Dark Blade + Deep Protection. So far with 25 Faith I haven't felt the advantage of using heal miracles compared to drinking estus yet.\n\nAm also using Zweihander.",
            "I just killed Kafka accidentally, is there a way to resurrect her or get the item she would sell ? I didn't give her the two pyromancy tome I had so give her souls to the merch does not help me \n\n  \nWhy the fuck is there an auto save in this game",
            "Is any weapon viable for PvE? I really want to use a scythe or the zweihander",
            "I am going to start playing ds3 and want to 100%. Should I play it blind or is there a guide with the bare minimum to keep me on track",
            "I'm desperate against the Lothric Prince. Any help or suggestions? \n\nI'm on Xbox Series and I use zweihander +10 or Irithyll blade +5 with onion mam Armor.",
            "I am using lotric knight sowrd , its +10 with heavy gem infusion. i am at 45 strenght and 18 dex.   \nI have read that i should do sharp infusion and go 45 dex insted of strength .  \nhow much will i gain from this switch .. since i have only one gem that allow me to switch wep infusion",
            "I’m currently level 90 and want to use the moonlight greatsword for the last few bosses I really need to know where to put my stats can someone help me?",
            "DE beaches are better!!! Jkjk ocean city is amazing with tons to do.  Just make sure you got the money",
            "who is Vorkshas mom? Because we don’t know of any other dragons that are white and Seath is stated as “Albino” like it’s very rare! But Seath married Fillianore/Gwynevere but also had a kid with Gwyn???? Ik he’s a male but it’s dragons so who knows!",
            "Can I switch between the dlc's? Started with ringed city but Gael doin Gael things... So I wonder If can just switch to the other one? Or do I have to finish the on I started?",
            "When I break an enemies guard and am allowed to do a special attack (by doing a light attack near them) is that special attacks damage boosted by the Hornet Ring? Is it considered a critical attack?",
            "Any idea when the game will be on sale on the playstation store ? I can't find an used version that comes with the DLC where I am, and I would like to play it on my TV (I already own the base game on PC)",
            "What's the current soul meta? Also what are other SLs with good PVP activity currently? I'm at SL90 +10 and I want to try and get good at PVP but sometimes I find it difficult to find invasions.",
            "Early faith weapons?\n\nI'm doing my first faith/strenght run. I'm planning on using Wolnir Holy Sword and Sunlight Straight Sword. But intul then, what should I use?\n\nRaw Zweihander? Raw Claymore? Raw straight sword? Saints Biden?",
            "How do you meet patches in the cathedral of the deep? I checked the wiki and as far as I know I haven’t gone too far (haven’t killed the deacons or gone to rosaries bedchamber) I opened the double doors in front of the cathedral which should cause him to spawn. The bridge that he’s supposed to lower on me when I walk across it is not even raised and I don’t know how I’m supposed to raise it",
            "I need help with dark-eater midir .\nIt took 2 attempts for nameless king, freya and gale but, i cant kill the dragon",
            "In Road of Scarifice I got invaded by a Blue guy at the same time as Yellowfinger Heysel. I couldn't see the name coz Heysel name came right after. I attacked Blue guy and died. \nAre blue guy friends or foe?",
            "I need karma to post my problem, please Help.   \nmost of my keyboard keys don't register while playing, the only keys that work are the numbers and the alt + ctrl keys. Anyone knows how can I solve this ???",
            "I have a build question to ask as I'm in a tight spot but also I'd like to be able to post my journey art journal here (like in the ds1 and ds2 subreddits ) when I finish so I'd appreciate some karma. (I'm trying not to browse the subreddit and get completely spoiled)",
            "How active is this game on PS4/5 relative to PC? Thinking about switching from PC because I'm sick of hackers.",
            "me too sadly :(",
            "Grant us karma, grant us karma! Plant karma on our brains to cleanse our beastly unability to do anything on Reddit!",
            "I help you brother",
            "You are good to post now, mate!",
            "Why do we need karma to post",
            "ok can you upvote me",
            "Luck will effect bleed and poison even if the weapon doesn’t have luck scaling",
            "There's no shame in talking a look at fighting cowboy's walkthrough. Might point you in the right direction.",
            "Over the years I have played Dark Souls 3 the one thing I have noticed is that a majority of the enemies hit like trucks. \n\nSo unless you are a dodging god, I highly recommend focusing your vigor stat, until at least 39 and wearing decent armor while maintaining a fast-ish roll. Early-game and mid-game can be very challenging and the best combat strategies are singling enemies out one by one and being aggressive. \n\nThe reason for being aggressive is because a majority of enemies and a lot of bosses can be staggered.\n\nIDK what class you chose but restarting a new game is a good way to get a feel for the game and I highly recommend playing the mercenary or pyromancer. The sellswords (two-handed) are some of the highest-damage starting weapons and pyro because most enemies are weak or not resistant to fire. \n\nIf you got any questions feel free to DM me.",
            "Experiment, friend. I almost mastered the game after my fifth time. You should try different classes, different weapons, different aproaches to bosses. More you experiment, more you will understand how the game works. For example did you know that katana build works wonders with the twin princes with its parry option.",
            "Reddit's official rule is that posting videos can't exceed more than 10% of you contribution to the community.  So, 1/10 posts for a video.\n\nAt least that was the rule a couple years ago.",
            "DS3 does have a respec mechanic, available through a creepy lady at the top of the cathedral\n\nAs for stat differences,\n\nVigor is still important but the soft cap is around 30 or something. \n\nEquip Load and Stamina have their own attribute each.\n\nSpell Slots are pretty rare and are tied to the Attunement stat. If you want more spells slots then that, you will need to wear extra rings.",
            "sure brother",
            "Looks like the dark hand might fit. It can't be upgraded, but its dark damage scales with int and faith.",
            "I will upvote you",
            "i know im late, but expect ds3 to have relatively easy levels compared to the other souls games, its main draw is the amazing bosses which in my opinion have the best overall quality in the souls series. If your a experienced souls player, you'll breeze through the first quarter of the game. To get the armor in the cover you have to beat the final boss.  I beat the game with the claymore, so thats the greatsword i recommend(i didnt use magic)",
            "Some enemies drop covenant items\n\nDark Wraith - Pale Tongue\n\nLothric Knight - Sunlight Medal (You also gain a Sunlight Medal whenever you co-op with a Warrior of Sunlight, whether you are the summoner or the summoned warrior of sunlight)\n\nCarthus Gravewarden Skeleton - Vertebra Shackle\n\nAll types of Ghru - Wolf's Blood Swordgrass\n\nSilver Knight - Proof of Concord Kept\n\nRinged Knight - Filianore's Spear Ornament\n\n&#x200B;\n\nAll of these items are extremely rare drops so it is recommended to equip the Gold Serpent Ring, Symbol of Avarice, and Crystal Sage's Rapier while farming for these items, as well as using Rusted Coin consumables as they can be infinitely purchased from Patches.",
            "All non-quest items transfer. Anything that is specifically essential for quests, progression, and influence of merchant stock are removed (keys, black orb, ashes, scrolls, etc.)\n\nSo yes, covenant items will stay in your inventory",
            "Lothric Knights are weak to Frostbite.",
            "yes",
            "ok",
            "ok",
            "You’re good to go mate.",
            "Ashes of Ariandel is scaled for late game even though its accessibly quite early. After Dragon Slayer you still have two main story bosses. If you have not entered the Consumed Kings Garden you have two bosses in that area and two more in Archdragon Peak (including Nameless King)\n\nPlaying Ashes of Ariandel now can come down to personal preference, some people would have played it earlier. I'd hold off Ringed City until after or directly prior to you fighting Soul of Cinder. However Ringed City can be accessed early if you complete Ashes of Ariandel.",
            "All pick ups reset on each NG cycle",
            "Use Storm Ruler. it's a sword you can find by his Throne at the end of his boss room. It's weapon art fires a massive wind bolt/wind slice that does a ton of stance damage to Yhorm, especially if you aim for his head.",
            "Going for a Status build or a sorcery build could work. Status builds typically require light and fast weapons",
            "Minimum spoilers then: find and give the Fire Keeper her eyes, side with her. Generally accepted as the “best” ending.",
            "Generally: Dark Souls III is a linear game: you can poke around, but there is usually only one active way forward with only a few real sidepaths. Any exploration is for future knowledge to beeline to what you want for that run. Once you know the way forward, it’s generally best to just go rather than pick a place clean. \n\nAs for regular enemies… I end up thinking of them as just a series of minibosses until I pass that area. DSIII really asks you to be on your toes at all times, more than the other games besides Bloodborne. \n\nOnce you know where the boss is, though, it’s often time to Bone out, spend your souls, and perfect the art of the runback.",
            "Correct rings will help a lot. I’m not sure if the Lloyd Sword ring helps, but I often put a Clutch ring (with a Steel Protection ring to ease off the downsides) on my casters. Of course, the best “increases the damage of Sorcery” ring you have… finally, different staves have better or worse scaling at different INT. See if any you’ve found beat out the Court Sorcerer staff at you INT level.",
            "a SL1 run is a run where you start as deprived and never level up",
            "Soul of Cinder is the amalgamation of every single individual who has ever linked the fire, from Gwyn onwards. And potentially including the Chosen Undead (DSI protagonist), Solaire and the Bearer of the Curse (DSII protagonist).\n\nIt is the final test for those who seek the First Flame, to see if they are powerful enough to link the fire and extend the Age of Fire.",
            "You’re good to post.",
            "You’re good to post.",
            "You can just use this sub!",
            "Sorry about the multi post. It said try again later, and it didn’t look like it posted. I deleted the duplicate posts.",
            "You’re good to go.",
            "Update: The DLC tired me out to the point I couldn't play for days after reaching a safe bonfire.\n\nI don't like falling because of a random item to a zone I get bullied by 3 tough mobs. Every mob in Painted World is such a pain to deal with.",
            "You should be good to post mate.",
            "I hope they get rid of the mods of this subreddit and replace it with more chillax ones. Nothing kills a community faster than power-hungry mods.",
            "Same, bummed me out",
            "It's not invading but popular high level/late game pvp areas include the Balcony directly outside of Pontiff's bonfire, which you can often find red signs there for pvp, (red signs do not have the area boss restriction that normal invasions do, anyone can accept them so long as you are in a similar level/item level range) and the very first bonfire at high wall of lothric. These are both common pvp Hotspots.\n\nYou can very often find red signs in these areas or you will very quickly get your red sign challenge accepted in these areas. \n\nI will warn you that the Pontiff Balcony also has a high volume of \"Fight Clubs\" (People spam accepting ALL red signs to get as many people in one place as possible to fight for there amusement and forced to follow some arbitrary etiquette and ruleset that can not be communicated or easily understood)*\n\nWith trouble getting pvp at Pontiff, it may have been an off hour, or just Red Orbs being not as effective as Red Signs at high levels\n\n\n*Disclaimer: I personally hate Fight Clubs so my statement on them is heavily biased and may not be an accurate description of them due to existing distaste",
            "Oof, congratulations, you’ve been softbanned. It’s ties to your game, not a particular save, and I don’t know if there’s anything you could do about it. Essentially: you can now only play with people who have also been softbanned.",
            "The host of the Fight Club I'm getting constantly forced into used cheats to teleport me into Pontiff's Boss Room and backstab and heal me constantly to lock me in and stop me from Warping out. What do I do??? I don't even know who I'm supposed to block on recent players on steam since the Fight Club had like 5 people in it. I hate Fight Clubs use a password or something! Leave me out of them!",
            "AHK keylist says to use NumpadDot \n\n[https://www.autohotkey.com/docs/v1/KeyList.htm#numpad](https://www.autohotkey.com/docs/v1/KeyList.htm#numpad)",
            "How many did you kill in that hour?  \nWas it 100? :D",
            "It's a weapon",
            "Fun is subjective. Objectively this build would be ass.",
            "Pick a weapon, then stats. Your build is bad anyway.",
            "People usually stay under 30% weight for the light roll. And if you can light roll, blocking isn't going to be that useful. If you don't care about the light roll, then you can get your weight up to 70% for the medium roll.\n\nAs for generic shield use, you would usually want high damage reduction stats on the shield to minimize what damage comes through and a high stability value to keep the stamina usage down. Naturally, shields with the best stats tend to be heavy and require high strength.\n\nAs for parrying, it's kind of a high risk- high reward strategy. I barely understand it, but at low skill level it's best used on bosses with slow telegraphed attacks so you can try to get the timing right. So long as you are occasionally successful, you get to deal a lot of damage and get a small break to heal up for the next attempt. Trying to reaction parry random enemies is gonna be considerably harder.",
            "No items can ban you. Bandai have completely removed item bans in 2020 to solve the issue of cheaters forcing invalid items in players' inventory and banning them. No matter how broken or illogical the item is, you can't be banned for it in DS3. Only exception is attuning DLC spells from DLCs you don't own.",
            "It also depends on your build very much. I wouldn't say you're underleveled, try pumping vigor to 40, rest in endurance and use raw dragonslayer axe or raw broadsword. Make sure to have something equipped in all armor slots",
            "Friede does dark, Dancer does magic",
            "No",
            "No",
            "You can",
            "The one that has 60 fps.",
            "Whichever you want. Broadsword and sellsword twinblades are the best ones",
            "It will ruin your experience. You can save them for later to make a SL125 build for PvP after finishing the game",
            "there isnt really such thing as too easy- you're just good at the game is all. just let it ride. if you want, you could always double back to areas youve been in and explore them more, look for rings and npcs, or just screw around with other weps. but you still have plenty of content ahead of you if youre in irithyll dungeons",
            "Because you're using either knight, hunter, scholar or priestess ring",
            "Yeah random coop is not a thing. Try summoning someone via password",
            "If you like it - sure",
            "Parrying in Dark Souls is a little less straight forward than in Bloodborne. Aside from some guns firing quicker than others, its always the same thing mechanically. You shoot them as they swing at you and they get parried. In Dark Souls, the timing has to be mostly perfect. I cant really give you a tip on when to parry, because for me, it eventually just became a feeling. You just \"get it\" eventually. Things that definitely help tho is, for example, to under no circumstances using a medium shield to parry. Different shields and other left handed weapons have different parry frames and animations. Medium shields are the absolute worst, and should not be parried with, unless your goal is just flexing. The best thing to use for parrying are fist weapons, such as caestus, they got a quick animation and quite a few parry frames. Other than that, there are also small shields, with obvious choices, such as the small leather shield or the target shield, which actually have a special parry animation, but I'd actually advise against using shields that have that animation. It just takes unnecessarily long, giving you less time to go for the riposte. Instead, use a small shield such as the iron round shield or the llewellyn shield, which is more easily accessible, due to not having to be farmed for. They got quite a bit of parry frames and also have a quick animation.\n\nHere is a really good video on parrying: [https://www.youtube.com/watch?v=QRdBwOG27yA](https://www.youtube.com/watch?v=QRdBwOG27yA)\n\n  \nAs for poise, this has been a mechanic since Dark Souls 1. What it basically does is allow you to shrug off attacks. They will still deal the normal amount of damage, but you will not get staggered. In Dark Souls 1, this was absolutely stupid. You could trivialize that entire game by simply wearing heavy armor. In Dark Souls 2, poise was nerfed a little, but worked more or less the same. In Dark Souls 3, they did the only right thing, and pretty much chucked poise as it was out the window. Poise is still a stat that armor gives you, but it works significantly different now. Together with DS3 poise came a new system called hyper armor. Hyper armor works like poise from the other 2 Dark Souls games, except it only activates when you are swinging your weapon, and different weapons have more or less poise health than others. Poise health is an invisible bar that weapons have. Your poise stat determines how much that bar is filled. Generally, the bigger the weapon, the bigger the poise health. Daggers, straight swords, curved swords, katanas, fist weapons, spears, rapiers, whips, scythes, and axes have no hyper armor, at least not on their R1's or R2's. Hammers, halberds, and greatswords have hyper armor when wielded with 2 hands. Curved greatswords, ultra greatswords, greataxes and greathammers always have poise. The amount increases when wielded with 2 hands, but you always have some. Greathammers have the most out of all the weapon types. Generally, if you care about poise, you should stay between 30 and 40 poise for it to be effective. But since most weapons just straight up do not have hyper armor, you can also just wear whatever you want. Also poise breaks are simple. If you run out of poise health, your poise will break, which causes you to stagger. Your poise health will automatically reset back to 100% after 30 seconds, but some weapon arts allow you to recharge it immediately. Perseverance on caestus resets your poise health, and so do all stomp weapon arts.",
            "When you have a password on, the only thing that is affected are summon signs. You can still get invaded by just about anyone in your level and weapon upgrade range. You will only see summon signs with the same password tho.",
            "The nameless kings first phase is weak to lightning, and his second phase is weak to fire and dark. So before respeccing your entire character, switch to the broadsword, which has a stat requirement of 10 in strength and dex, and is therefore perfectly usable by your character. Infuse it with a raw gem, upgrade it to the highest level that you can, buy a bunch of gold pine and charcoal pine bundles from the shrine handmaid, and then try to fight the nameless king again. Gold pine bundles add 120 lightning damage for 10 seconds. Charcoal pine bundles add 110 fire damage for 10 seconds. You can apply them while sprinting, so just apply them every time before attacking.\n\nOtherwise, if you really wanna respec to pyromancy, here is a build: [https://soulsplanner.com/darksouls3/163167](https://soulsplanner.com/darksouls3/163167)\n\nIncrease or decrease strength and dex depending on what weapon or weapons you intend to use. Infuse with either chaos or dark. Or raw, if you intend to buff your weapon using carthus flame arc. If you want other pyromancies, another 2 good ones for PVE are chaos bed vestiges and black fire orb. What armor you use doesn't really matter, but I'd recommend not wasting too many points into vitality. Since you started with knight, this build would require you to be at least level 97, instead of 90, but it works just the same. Its just a little less minmaxed.\n\nAlso a good place to farm souls at, is before the stairs that lead to the twin princes. When you walk outside the building with the elevator and look directly at the stairs, when you go sharp left, there is a path up to the roof. On that roof are a bunch of gold winged knights. These guys drop 13k souls each.",
            "You need a weapon that has a strong attack that can make them flip and land on their backs. Something like a great sword e.g. I did not manage to do that reliably with normal swords, rapiers, katanas or stuff like that.\n\nYou can run through them though, they stay at their relative locations. \n\nThe mobs you mean are they these big things with no heads and a dark orb thingie there? You can kill them one by one mostly, but you can also run through. You don't have to kill everything in Dark Souls (III) especially depending on your loadout.",
            "Flip ‘em like a pancake",
            "The easy way for a new player is Dex or Str build. Fun and a good variety of playing. And it's relatively simple to make.",
            "Here is a template: [https://soulsplanner.com/darksouls3/177398](https://soulsplanner.com/darksouls3/177398)\n\nArmor you can choose for yourself. The hornet ring is basically just a placeholder. The first ring you have equipped should be one that you can easily live without, so that you can replace it with whatever fits your current situation. But ring of favor, havels ring and prisoners chain are pretty much mandatory for this setup. I have gold pine bundles on this build, simply because they are an easy source of an extra 120 lightning damage, without having to spec into any stats to achieve said lightning damage. They only last for 10 seconds tho, and while you can apply them even while sprinting, if you are lazy, you can just use gold pine resin instead. Thats 95 lightning damage for a minute. Blessed caestus is there primarily just to give you some passive HP regen, but it isn't necessary. Its also a good parry tool tho, and it has the best weapon art in the game, perseverance.",
            "This exact thing happened to me but when I ran back to the boss he was still defeated and I could light the bonfire",
            "What's your budget",
            "Unfortunately, there isn't really anything naturally dex/faith (saints bi-dent comes to mind though). It will require you to lighting or bless infuse whatever you're using. If you truly want to get the most out of those stats and you plan to have more faith in the future, you'll want to use sunlight/darkmoon blade with the lingering dragon crest ring. The more faith you have the more of a damage buff you'll get from those spells. A buffed weapon with those spells will always do more damage than just a lightning or blessed infused weapon. \n\nAs for the sellsword twinblades, speed runners use them because they scale well on a single stat for being a starting weapon and can carry the game. If you every watch those runs, they use a lot of resins to apply buffs or status effects that the specific bosses are weak to. Personally not my favorites either though. \n\n  \nSide note, I'd also suggest swapping your vigor and endurance. You don't really need that much stamina with dex weapons. 20 max is usually conservative and I'd shoot for 35 vigor (usually using the prisoners chain to hit that).",
            "Vordt's Great hammer is a great for bonking and Persevering through damage, available fairly early too. Ultra greatswords (Zweihander) with Stomp are also neat at tanking and dishing out damage.",
            "I wouldn't really call any of the base game spells or weapons super unique in DS3. If you want the wild stuff you'll want the dlcs but you'll most likely get all that stuff post end game unless you beat the ashes dlc early... That's where most of the gimmick stuff is.\n\nHere's my default build list:\n\nFor casting, the most fun I've had was tied to pyros using chaos bed vestiges (early-mid-game) and then transferring to the Izalith staff and using dark sorceries once I got the DLC spells (45-45 int-fth). There are a lot of pyro spells early that carry. \n\nSorceries are fine but are pretty basic in terms of repeating stuff from the previous games. Faith is just really weak in DS3 compared to previous iterations. \n\nPure strength build are ultras so the greatsword (early), lothric knight greatsword (late) and Vorts great hammer (first boss weapon) are my favorites. Usually use all three at some point. \n\nPure dex just sorta ends up being katanas (uchi is in firelink) with the exception being the best longsword in the game, lothric knight sword (first area farmed) being an S scaling dex infused weapon. The starting twin blades are really good too but I prefer the added bleed status effects of the katanas. \n\nYou'll eventually end up with the frayed blade if you run the DLC as a dex charater but that requires you to defeat arguably one of the hardest bosses in the series. \n\nQuality would be a good option as well if you want to just try everything. 40-40 str-dex basically lets you play with everything and you can scale the regular weapons as you please. Ultra and regular curve swords (plenty of options early) shine here along with alot of the greatswords like the claymore (first level) and executioners sword (early game). Then of course Gaels greatsword after beating the ring city is awesome.",
            "Great chaos fire orb will be the better bet than chaos bed vestiges. You'll want the extra lava damage especially in the second phase when his trying to revive his brother.",
            "Look up \"Twin Princes cheese.\" There is a glitch in the game that trivializes phase 2.",
            "No its not",
            "I'm just starting a faith/str run. How do you feel the Zweihander? Is it good?",
            "Just play whatever feels fun. I've gotten a SL11 character with +1 weapons to the end of the game to twink on low-level characters with end-game gear. My point is there isn't a wrong way to play if you are comfortable with failing a few times along the way!",
            "My way of play Soulsgame : I go blind and just check some guide when I'm lost or then I have to check some facts (order of the zone, or when I really like a NPC and that I want to do the quest).",
            "For me most quest in ds3 are really subtle, you have to read between the lines and think of consequence. Hell, even one choice of dialog without proper context can lock you out of certain quest and ending..\n\n  \nBut since you're going 100% anyway, you better off playing for one playthrough and read it all in NG+.",
            "If you're really desperate, there is a glitch that the Princes don't move in phase two. If you look up \"Twin princes cheese\" or similar, you should find how to do this. If I remember, you have to kill them while standing in a particular part of the room, then snipe the sorcerer brother with a bow.",
            "45/18 heavy - 363 AR\n\n12/40 sharp - 394 AR\n\ndefinitely better on sharp, and you save a bunch of levels too",
            "int and str for dmg",
            "You're free to switch between both at any point in time, it's not like the bonfires won't let you travel.",
            "I assume you meant Hornet Ring, and yes ripostes are boosted (the special attack from guard breaking/parrying)",
            "This might be a silly suggestion, but you could probably just plug your PC into your TV. You can then just connect your controller to your PC and play from your couch. Otherwise, maybe there is a sale after the release of the Elden Ring DLC?",
            "DS3 meta SL has always been 125. If you want to be sweaty, you go 133. Invasion meta is SL90, but you can find invasions on most SL's. Figuring out what upgrade level to use is simple, just take the first number of your SL, and thats your upgrade level. SL20 +2, SL40 +4, SL60 +6. This works up until SL90, after which you just use +10 weaponry.\n\nAbout actually finding invasions, if you are on PC, try this: [https://www.nexusmods.com/darksouls3/mods/405](https://www.nexusmods.com/darksouls3/mods/405)\n\nThe red eye orb is absolute garbage, wex dust on the other hand automatically searches through all areas of the game to find a suitable match. You don't even need to discover the areas first. You can start a new game, create a build using honest merchant (another mod), use wex dust, and invade everywhere in the game, without having to leave firelink even once.\n\nIf you are on console, you are kind of out of luck. You are completely at the mercy of the red eye orb and player numbers. The only thing there to help you, are these little ember symbols next to bonfire names in the teleport menu. The more embers there are next to it, the more players in your level range are near that bonfire.",
            "Probably just invest some strength first and a Heavy Claymore or similar to hold you over until you get the Faith weapons",
            "Completing the first part of Siegward's quest is a pre-requisite as well, have you defeated the demon with him?",
            "Upvoted, but you can ask here if you want",
            "What kind of hackers are you referring to? People that are just straight up hacking, things such as invincibility, insta-curse throwing knives, daggers that oneshot you with a single R1, etc. Or are you talking about people that always have the max amount of siegbräu on them, and late game armor and weapons in early game?\n\nThe former is exceptionally rare in my experience. And I have over 2k hours, doing primarily invasions. And even when someone was hacking, it was usually just someone throwing me around the map, which is honestly more funny than really a problem.\n\nThe latter is not gonna be much different on PS4/5 or xbox, at least from what I have been told. Invaders on these platforms just dupe items, instead of using tools such as CE and Honest Merchant.\n\nIf you seem to encounter a disproportional amount of hackers, you can use this: [https://www.nexusmods.com/darksouls3/mods/723](https://www.nexusmods.com/darksouls3/mods/723)",
            "Micolash!",
            "So the sub doesn’t get spammed. It makes sense tbh",
            "No worries man, I tried to play with a different class I pretty much beat the game in few days. Most of the bosses were first tried (not trying to flex). Idk, I guess I was just stressed because of my personal life. But when I found some time to fully take this as Souls there weren't much issues.",
            "thanks man",
            "Makes sense. Thank you!",
            "Thank",
            "ok thanks, of all the main bosses i have the princes, nameless king, (already beat the dragon and have the bonfire for nameless king). and the lord cinder, and whatever dlc bosses left, i think ill finish the princes then do sister friede then the ringed city and after that do lord of cinder, and nameless king whenever i feel like it he kinda just seems like an optional boss i can do whenever.\n\nthanks for your input",
            "Oh, I know that; my problem is that pickups like \"great soul of unknown traveller\" get upgraded to items like \"great soul of a proud paladin\" and I don't seem to find NG soul pickups in NG+, at least as pickups, as some items like \"fading soul\" are dropped by some hollow undead or rats. I know it's not something necessary for platinum, I just wanted to do the best completion possible, consumable comprised.",
            "Just so I know, how do I use the lightning effect on my claymore?",
            "Okay good to know. I started off use that so I already have it leveled, not sure how I got it if its an endgame weapon.",
            "Thank you, I see that SL1 - Soul Level 1 I take it.",
            "Sister Friede is definitely the hardest boss fight so far even when my death count for her is just 14 compared to god know how many from Pontiff. I feel I was lucky in phase 3.",
            "Just raise a ticket with Bandai and they get it sorted, I got mine sorted.",
            "Would I be better off just not using a shield and having better armor instead? I've been stuck on Abyss Watchers for a long time and it said online I'm supposed to be parrying them but attempt after attempt I still haven't been able to pull off a parry a single time",
            "Really? so if a cheater drops 99 cheated in items to me i can take them with no consequenses?",
            "thank you",
            "Where can I find him?",
            "Thanks",
            "Actually the reason was me holding a Hollow weapon+10, which grants me 5 levels of luck for covenant item farming. But thank you for answering me!",
            "I watched the video… didn’t understand much BUT I consistently parried the Abyss Watchers phase 2, like 5 times in a row until they died. So I have at least became better at parrying?",
            "Thanks. This was helpful! I now understand what poise is and such! I’ll look into the parrying video later ",
            "Also, I would assume the knight’s shield is a medium shield. As I chose the knight class",
            "Thanks for all the tips!\n\nIm currently grinding up my faith stat and plan to respec unecesary stats into Atounment\n\n\nI plan on using thr MLGS untill thr end after nameless king so ill keep strg and Dex at the lowest possible value",
            "preferably under $500 i guess but if i need to go higher that's fine.",
            "Thanks!",
            "I played DS1 after DS3 and used Zweihander the whole time there. It's fun just pancaking people.\n\nI feel the hardest part of the run so far is not spending souls in level, gotta buy all the miracles I need first (some is 10k+ souls). Gotta go clear some parts normally before attempting Pontiff again but yeah.\n\nOverall I don't really like it that much since it's like Str build just because I am too panic to reapply buffs half-fight.",
            "As long as there are no big missables, I might end up doing that.",
            "Yeah, I remember getting really annoyed with ds2 questlines because you're forced to summon them in battle and talk to them only after certain battles",
            "Thank you, I'll try another day and if I have no success ille check. Thank you",
            "Ok but Gael isn't in the church. Where can I start it then. Different location?",
            "Yes I did and I talked to him at the well and he asked me if I’ve seen someone wearing his armor. I’m already passed that point so it doesn’t matter I’ll just talk to him at the tower at fire link shrine. But yeah I’m just confused about how that bridge is supposed to be raised to begin with, the two levers I found on the ground raise the other two unrelated gates and supposedly the lever to raise it is on the other side where rosaria is which ruins the questline. Every video I saw about patches the gate was just already raised but for me it never happened",
            "You are not going to change my mind, and I am talking about insta kill hacks, they are becoming increasingly common and Blue Sentinel isn't flagging them. And they don't even need to hit you with a knife anymore, they just press a button and you die. Fun stuff.",
            "Hmm, maybe you are just burned out, try to play other games or stop playing games for a while. Similar thing happened to me once and I stopped gaming for few months, and when started to play games again I felt joy similar to my first time ever playing a game! Don't go hard on yourself, that would only make you view gaming as a chore.",
            "you're welcome",
            "For the lightning \"effect\" I assume you mean giving it the aura of lightning surrounding the blade.  \n\n\nInfusions do not add that effect to weapons, they do add a small hit effect of the enemy you are hitting getting lightning/fire on them but do not add the aura over the weapon itself. If you want your weapon to glow or get covered in fire or lightning you'd need to either use a buff spell (Lightning Blade) or a Resin (Gold Pine Resin). You can not apply buff spells or resins onto weapons that are infused with elemental or status infusions though, only Standard, Raw, Heavy, Sharp, or Refined infusions",
            "Did you kill Siegward?",
            "Yeah that's it.",
            "[Finished the game](https://cdn.discordapp.com/attachments/1215242253027639307/1244377788350468176/image.png?ex=6654e4a0&is=66539320&hm=b9b48700725f4e222ee0d07542fa9f8d8de59fe3e684e843f9e0f73a97348d6d&).",
            "Yes it would be better. In PvE, roll is always better than a shield due to lower stamina cost.",
            "Possibly, from my understanding, most people don't use shields for blocking. It's usually for parrying, or item buffs like the stamina regen, or because they want to two hand their main weapon. So armor with better stats or fashion is a common pick over a blocking shield. But don't expect noticeably better results from better armor. The damage reduction improvement is going to be very small.\n\nCan't offer much advise on Abyss Watchers, they wreck me every time on every character. I did succeed through parrying on my last character, but I had to pick a specific attack with a clear visual and good delay so I could mentally prepare for the parry. I got the parry right in about a third of my attempts, which was good enough to eventually win.",
            "You can take whatever without consequences, even smth like ?WeaponName? or stormruler +69. Item bans do not exist.",
            "Yes, the knight shield is a medium shield.",
            "https://www.newegg.com/p/3D5-005E-00001?Item=9SIASGMJX80481\nAnd top it off with a rx 6600 xt for around 200$",
            "Or you could go with an rtx 4060 for around 300 $",
            "There are only the optional areas which are not really easy to find without help (archdragon peak is a a big problem without spoil you).",
            "There should still be a painting scrap next to the altar at Cleansing Chapel if Gael is not there",
            "For me, getting Patches to appear with the raised bridge only occurs before Siegward can be talked to in the well, otherwise I'm not sure",
            "Never had it",
            "Hey Dude u want max lvl in elden or ds3? I found a way",
            "Thank you",
            "Yes, that must have been it",
            "Does the game get better after Abyss Watchers? I decided to take a break from it and try the Cathedral instead but it's just as annoying, the whole area is basically designed for you to just keep running passed everything and hoping you dont get cornered at a deadend and get stunlocked to death by the hordes of enemies chasing you, and after coming from a pretty annoying poison swamp area the game has kinda been more annoying than fun for a long time at this point.\n\nIs it even worth actually persevering with? I really liked Dark Souls 1 (the first half anyway)",
            "Guess I’ll have to find another shield then ",
            "Ok thank you I’ll try that next time",
            "No thanks",
            "The area outside the cathedral with the weak but respawning mobs? Yeah, you are expected to run through most of that graveyard section to avoid getting mobbed. It's more straightforward once you get across the bridge to the actual cathedral. That said, most of the areas will be trying to kill you in one way or another.\n\nIs it worth to preserve? I want to say YES, but that's because I beat the game and enjoyed it. But that wasn't always the case, first time I played DS3, I quit somewhere around Road of Sacrifices. Too stressful, felt like I was constantly being punished and could only succeed through cheesing or blind luck. Some time later I came back, and tried switching up my playstyle. Instead of using longsword + shield, I tried using the Vordt's Great Hammer. The extra range and stagger damage changed the game for me, and carried me to the end.",
            "👍🏻",
            "I don't really know which playstyle is optimal, atm I'm just two-handing that ice sword you get from one of the minibosses without a shield and spam-rolling around enemies"
        ]
    },
    "I did it.": {
        "title": "I did it.",
        "score": 156,
        "url": "https://i.redd.it/msmsbh19p28d1.jpeg",
        "content": "A week ago, my gaming laptop suddenly broke, taking my previous run (40 hrs and every boss up to freide)with it. So, using my window Surface 8 that I use for school, on lowest settings and 800x600 res, and another 20 hours, I beat every boss in the game. GG",
        "num_comments": 7,
        "comments": [
            "Low performance cant hold bro back",
            "Good job man🙏",
            "Bro cooked",
            "Nice dedication running it back! It's like the time I had to start Sekiro all over again before I could beat Isshin...but that wasn't due to any technical issues, it was a personal choice I took because I sucked!!",
            "Congrats",
            "Haha that's impressive, what sort of of FPS was it getting?",
            "(His laptop)"
        ]
    },
    "Tell me your experience. ": {
        "title": "Tell me your experience. ",
        "score": 75,
        "url": "https://i.redd.it/2a17g5w3m38d1.jpeg",
        "content": "",
        "num_comments": 59,
        "comments": [
            "Nameless was the one who took me 50 tries, but the every time I loaded in I was eager like it was both my first and millionth time.",
            "Nameless 10  \n\nMidir 14 \n\nAbyss 17 \n\nI guess I had it better than most people...",
            "I'll start:\n\nNameless King 50 times\n\nMidir 20 times \n\nAbyss 15 times\n\nFirst time Abyss were so hard. My favorite bosses are Gael and Dragonslayer.",
            "Abyss around 10 times, the king around 25-30 and Midir is my lex Luther still haven't beaten him",
            "Namess king was the only boss I didnt manage to beat on my +2 lvl 11 build. I even managed to beat lothric legit in that run but nameless was just too much. \n\nMidir nr 2 fromsoftboss ever no questions asked.\n\nAbysswatchers is such an enigma for me. One time I absolutely wreck their shit and bully them to death and the other time they wreck my shit and bully me to death. Thank god they have about 1.69 poise bevause if they had more they's be significantly harder.",
            "Abyss Watchers 5 or 6 tries, really liked them.\n\nNameless King of course took me at least 50 tries. Dude mopped the floor with me.\n\nAnd Midir.... It's a complicated relationship. I absolutely hated him. There were some tries that i didn't even land a single hit. He took me at least 80 tries before I quit the game because of him. Then suddenly one day I came back and it clicked for me, you have to dance with his moves. Now he's one of my favourite bosses ever made.",
            "Nameless King is my favourite. He is difficult, beautiful and handsome. Also with a tragic and hard lore. I didn't count the tries on him, but it was somewhere around 30-40. This was the most interesting boss fight in the game.\n\nAs soon as I understood that the abbys guys fight each other I knew it would be an easy fight and it really was.\n\nI haven't tried Midir yet ;)",
            "Nameless King is still fun, one of the few bosses I come back to offer my sword to others\n\nAbyss Walkers are still annoying. Just one of the necessary bosses, but one that still surprise one-shots me\n\nMidir... fuck Midir.",
            "Abyss Watchers 1st try - They are fun but also fair, thanks to the mad one that also fights them. The second phase feels like a standard elite mob.\n\nMidir - Took me maybe 3-5 tries. I fought him like a Monster Hunter dragon, which made it pretty easy. I think he is the first and one of the few FromSoftware dragons that is actually fun to fight.\n\nNameless King took me a few more tries, probably around 10. After a few attempts, I was pissed because of his first phase. I still think he is cool to fight, but I hate the first phase. Even though it is pretty easy and fast to go through, it is still no fun.",
            "1st time\n\nFuck knows, I used mist in the end.\n\n1st time",
            "The watcher's were fun, \nNameless felt like some anime shit cool lore\nThat dragon is a hacker fuck it and it's species",
            "Nameless, I genuinely struggled and ran out of embers, took 20+ something tries.\n\nMidir, got him to half health of first try but struggled on prior attempts until a sunbro with a Lothric knight GS carried me.\n\nAbyss watcher, kinda hard but dealt with him first try",
            "Bane,\n\nDuh,\n\nCool.",
            "This is gonna be funny af, nk-217 midir-1, pontiffy-4",
            "Dark Souls 3 is my first action rpg video game. In the first playthrough i cleared Abyss Watchers in like 20 tries.\n\nI haven't been able to get through Nameless King and Midir, but have tried Midir for, like, 20 times and Nameless King for over a hundred times. \n\nI wonder how people in the comments have it so easy :')",
            "Abyss watchers: 2nd try\n\nMidir: not fought yet\n\nNameless king: 4th try\n\nLooking forward to midir though",
            "All  base game boss 4 tries or less  , midir/gael i think 5-6 tries. I'm a souls vet so its not really saying much but the muscle memory from older games do help.\n\nDs3 don't have as much BS boss like those in Ds2. I find the boss in ds3 to be fair. Quality claymore build , my favourite build.",
            "* namless king around 6 tries\n* midir was 5-7 tries \n* my beloved abyss watchers took me 3 tries",
            "Damn this is so interesting,\n\nNameless king: 4 times\nAbyss watchers: 1 time\nMidir: 8 times\n\nI never knew the abyss watchers were considered hard",
            "Total Deaths:\n\nNameless: 4\n\nMidir: 6\n\nAbyss: 3",
            "Nameless and midir I beat with sommons no regrets\nAs for watchers took like about 7 or 15 tries they were fun",
            "Nameless 2 \n\ncould have been 1 but i took a friend with me and he died like 3 sec in phase 2 .-. so i had this mf with x2 life  still managed to clutch him to like 1/10 of his life. After that i faced him alone and won with like 9 Estus left.\n\nMidir 20\n\nAbyss 3",
            "It took me around 20 attempts for nameless king, 3 for abyss watchers and i haven’t played the dlc yet",
            "Nameless was around 8.\nAbyss Watchers 1.\nMidir 17 - It only took about 10 tries to learn his moveset sufficiently, but I was using Friede's Scythe and it was doing no damage, so the fight was taking forever and eventually he would hit me with something. After 16 tries I had finally realized, that something was wrong, so I returned to my refined longsword and killed him first try.",
            "- Nameless king 10 tries , extremely fun \n- Midir 15~ tries , cool fight \n- Abyss watchers 2 tries, great fight",
            "Nameless 7 times\n\nMidir 20 times\n\nAbyss watchers 46 times 💀💀",
            "I find all these bosses absolutely amazing... Midir and NK being my top favourites...\n\nMy first Play through death counter (strength build) :-\n\nNK : 15+\nMidir : 20+\nAbyss watchers : 3\n\n2nd playthrough count (dex)-\n\nNK: 25+ (I found NK a LOT harder on dex)\nMidir: 8-10\nAW : 2nd try (parry only)\n\nFor some reason, I never really found the watchers that difficult . I thoroughly enjoy the fight, the OST , the boss' moveset, but fortunately never had any trouble.\n\n\nThe boss that I had struggled the most I believe, is Friede... More than 30 tries I presume... But she's my favourite fight in the game...",
            "I managed to defeat Nameless on my first playthrough without any trouble. I got him for the first try. But when I attempted a second playthrough, it took me around 50 attempts.\n\nMidir is a piece of shit and watchers are good but not that hard imo.",
            "Nameless King: 1\n\nMidir: 50+\n\nAbyss: 12-15",
            "Nameless king I sadly didn’t fight untill ng+ 3 I kept forgetting to do it while going for the plat and by that point I had just spent DAYS on the stairs so I just wanted to kill him with my friend who had a high lv strength build + dlc so I didn’t kill him in my own \nThe other two haven’t fought no dlc :(",
            "Midir is the only ds3 boss that made me alt+f4 in a rage.\nI struggled against many bosses on my first playthrough, and some of them frustrated me, but none of them passed me off enough to force close the game and cuss.\n\nIt took me way too long to realize you have to cuddle with his head and run away when he attacks.\n\nI hate Midir",
            "I'll go from bottom to top:\nMy low level ass got killed to many times\nI'm still having nightmares\nHonestly I somehow had an easier time at the \"hardest boss\" than I did midir",
            "I hate nameless king’s arena, can’t tell the depth, and the camera keeps breaking.\n\n\nMidir was probably the boss that require locking in the most, which is so fun and felt like a true test.\n\nAbyss watcher’s gimmick is so sick, but also easy to cheese",
            "Nameless 2\n\nMidir skip (very bad boss)\n\nAbyss 1",
            "Abyss watchers: S tier (super fun fight with a really unique \"gimmick\"\n\nMidir: C tier (not fun to fight imo)\n\nNameless King: S tier (he's difficult but not too hard, but the fight is such an awesome spectacle",
            "Nameless king: 5 hours(lost count of the attempts)\n\nMidir: haven’t tried yet\n\nAbyss watchers: first try",
            "Nameless: Haven't beaten yet, at least 80 attempts so far from what I remember on needing to ember farm. Actually want to put my head through a wall lmao\n\nMidir: Same as Nameless. Fuck this dragon specifically.\n\nAbyss Watchers: 1st try",
            "Abyss Watchers are one boss I never had a very hard time with. I like the overall design and flow.\n\nMidir made me rage quit-delete the game. After downloading the next day and getting the hang of it I quite enjoyed the fight. \n\nCheesed Nameless King on my first playthrough and then got him fair and square on my second. Very fun boss after it clicks. \n\nFavorite boss in the game, and potentially ever, is Champion Gundyr though. Slave Knight Gael is up there too with Nameless King.",
            "Had to summon the legendary pawel to beat\n\nI don’t have the dlc\n\nI 2 cycled them so they became my harem",
            "Abyss Watchers took me like 3 tries, how is it hard? Just asking",
            "Nameless took like 20 tries the first time, i had to switch my build around to even kill him. Abyss watcher took 3 tries. Haven’t fought Midir yet",
            "Nameless King : 31 tries\n\nEarly Dancer kill : 80 tries\n\nFriede : 2 tries 💀\n\nGael : 3 tries\n\n1 more covenant and I'm done with the plat 😮‍💨",
            "Nameless or Dancer was the one who killed me most. Midir took me about roughly 15 tires I think. Gael about 10. NK took about 20. And Dancer too.",
            "Nameless took me a few tries to get the hang of, but once I did he became my favourite boss. I've probably beaten him a good 100+ times as a summon because I enjoyed him so much.\n\nMidir I only fought a few times, got lucky when I summoned someone and we took him out by the skin of my teeth!\n\n  \nAbyss Watchers, oh man, definitely in my top three of the base game, I like to Cosplay as them since the Farron Greatsword special move is just so unique and awesome!",
            "nameless king gave me HELL but i did manage to solo him and i was SO happy :')",
            "I beat Nameless the same day I beat Oceiros, Gundyr and the wyvern, I didn't use any shield, so Oceiros took me more time because of that damn charge. But I was super proud of myself in the end\n\nMidir took me plenty time with his a bit too often fire breath, but I wouldn't call him too hard. And he was the boss that I had to turn the online off because of that message right before the ladder. Bastard.\n\nAbyss Watchers was the hardest among them because of how early they are. I struggled a lot, yeah.",
            "Abyss Watchers? 8 attempts  \nSublime. The mechanics, the aggression, the music. The Phase 2 transition.\n\nDark Eater Midir? 22 attemots\n\nHonestly, after dealing with the atrocity which is ER dragons, Midir is a masterpiece\n\nNameless King - 14\n\nOh my poor poor muscle memory.",
            "Nameless King: 2\nMidir: 1\nAbyss Watchers: 2",
            "Around 20 tries for name less. 1 try abyss watchers. Midir not fought yet. Just have started ashes of ariandel dlc. Soul of cinder was so easy.",
            "Nameless 10+, phase 1 unironically the hardest for me I really hate the camera  and is so easy to miss the head O swear\nMidir 20+, I always do bad with fights that take too long I eventually lose focus, I ended up building wolfs greatsword for this.\nAbyss watchers 2 tries, probably one of the most overrated bosses in terms of difficulty, the fight is cool for sure",
            "Nameless king: 2 attempts but i first tried his second phase \n\nMidir: 8 attempts \n\nAbyss Watchers: 2 attempts",
            "Nameless king was a genuine blast. Took me forever, but it was genuinely one of the best experiences I’ve ever had in souls. I had to learn his moveset attempt by attempt, careful craft a strategy, it was awesome. When I finally beat him, I cheered like I won the champions league lmao\n\nMidir I’m still convinced is honestly just not beatable by normal means. I had to use the mist cheese. Forgive me😔\n\nWatchers are an all time great fight in the franchise. Super badass. And when the red-eyed ones start helping you? Unbelievable. Never found them all too difficult, but certainly a few tries to overcome their aggressiveness.",
            "Nameless king 10+ tries\n\nMidir 3 tries\n\nAbyss watchers 3 tries\n\nNameless king fucked me up pretty much,the other 2 not so much.All of them i very much liked",
            "That the boss that broke me the most. Ornstein & Smough, Gargoyles, Ivory King..",
            "Good score!",
            "I got Midir down to 1/16th, got greedy, died and never got that close again. He haunts me to this day.",
            "If he's stunlocked, he's literally got nothing to do .. but if WE get stunlocked, we've literally nothing to do... lmao",
            "First phase of NK is filler content ... Whenever I think of getting to NK, I think of directly landing to his 2nd phase... I go to fight him, and I immediately get disappointed because the first phase exists... Sure it's epic aesthetically, but tedious mechanically"
        ]
    },
    "Damn, I love irithyll dungeon so much": {
        "title": "Damn, I love irithyll dungeon so much",
        "score": 24,
        "url": "https://v.redd.it/69mcmxsmn38d1",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Lmao what happened? XD",
            "Its your fault for playing too close to the black hole",
            "This was so funny! 🤣",
            "The sound",
            "The forces of irithyll dungeon demanded a sacrifice to the hole",
            "Ah... I see... XD"
        ]
    },
    "just fought midir for the first time and killed him first try": {
        "title": "just fought midir for the first time and killed him first try",
        "score": 250,
        "url": "https://i.redd.it/ygudrb4xpz7d1.jpeg",
        "content": "",
        "num_comments": 76,
        "comments": [
            "Impressive if true",
            "This dude be playing bloodborne in dark souls 3",
            "Bro is a hunter",
            "My brother in Christ look at the blades you wield",
            "Congrats! He is my favorite boss! So damn epic",
            "Your health bar is almost as big as Midirs",
            "i havent played inna min but i remember him being the most difficult boss for me, good shit",
            "Folks giving you shit for using good weapons but that doesn't mean the boss is just an automatic win. Beating him first try is an awesome accomplishment he's a major pain in the ass, great work!",
            "Need hard evidence please. Photo off the internet doesn’t suffice.",
            "Seeing that weapon I'm not surpirsed 😅",
            "Definitely not me. Was SL70 with a +9 Partizan lol",
            "nice!",
            "Congrats! \nThis might be just me but if I ever get close to killing a boss first try I just get myself killed, I always want to see the bosses whole moveset",
            "Bro your build... Is made to crush through bosses 🤣🤣🤣\n\nNext time, try midir with an ultra great weapon...! (Now that's real fun)",
            "I beat him before the game even came out",
            "What armour are you wearing? I'm not very familiar with DS3, but now I wanna do another run with that outfit.\nThanks in advance!",
            "Well done ! Took me 4 tries, I couldn't adapt to his attack patterns that fast.",
            "👍",
            "Ok",
            "Understanding his attacks when you stand in front of him requires a good reflex. You are master and Elden Ring dlc will be a piece of cake.",
            "I see Sellsword twin-blades.   \nIts completely fine to use those. It is completely fine to have beaten Midir first try. You didn't do anything wrong. I am not saying that you did anything wrong.   \nI just want you to know that this happened due to the weapon, not any skill, or patience, or all the stuff people usually go through to beat this guy.\n\nI've seen multiple people beat him first try with this weapon specifically so... yeah.",
            "I too was able to kill him on my first attempt, same will Gael. My heart was racing for both after I finished",
            "[removed]",
            "Do you want a medal or a tap on the back?\n\n\nOr you want us to bow down and worship you?",
            "Bros gotta be the nameless king reincarnated",
            "now fight  >!Bayle the Dread!< in Shadow of the Erdtree :(",
            "I doubt it",
            "sellsword twinblades, who could’ve guessed lol",
            "Saw the blades man but I'm happy for you I used a Scythe and it tool me 3 whole days. Then I beat him when I was just messing around 😅",
            "Tinha que ser BR para conseguir um feito desse kkkkkk",
            "Ganhei essa batalha por esses dias e puta que pariu que delicia de boss.",
            "Parabéns amigo, agora mata ele com build de mago",
            "Bruh the op stuff in this game is so op it is absurd. My first playthrough i cosplayed a holy knight and used a blessed lothric knight greatsword, was doubting lightning but chose blessed cuz it sounds better for the cosplay. I didn't know I was holding a mini nuke on my shoulder cuz godamn. Nameless king first try, gael first try, midir 3 tries, friede 2 tries. That shit was too good it kinda ruins the game 😂😂😂.",
            "My casual ass skipped him after failing dozens of times, because I had flashbacks from DS 2's DLC dragon wasting my time running back and forth (walking simulator).\n\nNow Midir is my favorite boss.",
            "Dude you're literally using the most Busted weapon in Dark Souls History",
            "My brother in Christ, you are using the meltsword winblades.",
            "and my cock is 3456 m big",
            "\nYou are using rather broken weapons, but good job.",
            "True if real",
            "https://preview.redd.it/a4kbr77qvz7d1.jpeg?width=1360&format=pjpg&auto=webp&s=0b2339211bf1e60f38b1b02172a7e4dfa1e66b1f\n\nYES I AM",
            "i didn't thought they were this strong i just like dual wielding. next time i'll try a different build and see if i manage to beat him first try again",
            "XD I saw that right after reading your comment.\n\nSellsword = Sellout",
            "They’re not OP(unless buffed)",
            "yes i was so hyped to finally fight him! he's easily on my top 5 dark souls 3 bosses list",
            "Maybe it's because of the size of my screen cuz i've seen bigger health bars",
            "Maybe I should post mines as well",
            "Please be respectful at all times.",
            "I thought about using the crow quills bc i was cosplaying the hunter from Bloodborne and i saw somewhere that he was weak against thrust damage, so i switched to the blades without knowing i would end up melting him🫠",
            "Glória ao sol meu desalmado kkkkkkk",
            "Confesso que apanhei mais dele na ponte do que na arena mesmo kkkk",
            "Pretendo, tem link pra alguma build de mago?",
            "Lmao i was cosplaying the hunter from Bloodborne and i only used dual wield weapons bc they look cool and katanas",
            "Midir has such nice fire aoe compared to other dragon bosses, he gives you so much time to run away from it.",
            "Sorryy😭🙏",
            "Swear whenever I see someone post a personal accomplishment in the fromsoft community there are always people like you trying to make it seem like their achievement is as worthless as a used piece of tissue just because they were using a certain weapon or item in the game known to be fairly strong and/or useful. Do you do it out of jealousy or spite because you don’t like how happy they are with the way they did it or what? Genuine question, why do you and so many others put people down in these games?",
            "Real if Impressive",
            "https://preview.redd.it/glzv0n0vs28d1.jpeg?width=737&format=pjpg&auto=webp&s=a7ebc7ec92f76a896c3f90a81760d0a10c2f6fd6",
            "That is the way, i did the same when i played for the first time years ago, bloodborne wannabe in a world full of knight armor, its a tough drip choice",
            "It’s just a meme man. Use what you want idc they’re just known for the highest AR in the game\n\nEdit: DPS not AR",
            "Sellsword is a little bit stronger than other weapons\n\nI killed Midir, Gael… in the first attempt too",
            "I mean a greatsword to a dragons head is pretty fun",
            "Nah, it's not even that big, I'm just playing. I'm allergic to levelling vigor in any From game, so I'm just not used to it. ",
            "Maaaano essa porra na ponte é um caralho kk",
            "Want some cheese to go with that whine? I said good job.",
            "Monumental given that it is non-fictitious",
            "I think Lothric GS has the highest AR actually. Sellswords have highest DPS",
            "I preferred the Warden Twinblades for the bleed on top (you lose a little AR, but for bosses the bleed makes more than up for it)",
            "I got gael first try but midir wiped the floor with me lol",
            "Got them both on my second attempt with Mourne's great hammer (paladin Leeroy cosplay).",
            "Seems I have my answer, because you’re an asshole.",
            "unreal if epic",
            "Ah thanks. You are right.",
            "And you’re overreacting in that classic Internet fashion. Beating Midir in one attempt is an impressive feat, that doesn’t really have to be said. OP was proud enough to post about it after all,as they should be. If anything I think using weapons that are a little unbalanced reduce the worth of the achievement by the same amount said used tissue paper would: barely at all.\n\nYour reactions suggest that you have no idea what you’re talking about or what the souls games are about. You’re just trying to superficially look good for clout.",
            "If they were unbalanced they’d get nerfed like the OP weapons and summons in ER did, also if you think the difference between beating him in 1 attempt with any weapon compared to twinblades is barely at all then why’d you try use them to dismiss the achievement? \n\nI know exactly what I’m talking about because I see it way more than I should, seems like you hate the idea other people can do well in these games because it makes you look less special. You’re trying to save face because you know what I’m saying at least has a bit of truth to it. 😂😂",
            "I don’t care at all about how well someone else might do in these games, aside from being happy that they’re doing well. I hope next time they can conquer an even harder task, like beating Midir in one attempt with a less optimal build. I’m hardly trying to dismiss the achievement, I’m trying to encourage them to strive higher, albeit it seems not very well.\n\nIm not special at all for beating Midir or any tough souls boss, nor did I claim to be.\n\nFromsoft grows with each installment and maybe they missed these twinblades or some of the other weapons that dwarf a lot of the others. In Elden Ring they were more thorough.\n\nWhen I said that you didn’t know what you were talking about, I was talking about conquering a challenge in a souls game, not dismissing achievements, being transactionally virtuous and taking things out of context.  Anyone can do the latter. The former requires someone to actually play a Souls game(which anyone can do if they want to.) It seems you’re more interested in social media than souls games though, thus my doubt as to whether you played the games or not.\n\nThe well earned satisfaction and pride that comes from beating a souls boss is something that can only be experienced first hand, which you’d understand if you played the games. I have even less reason to believe that you have now than earlier. Midir is one of the hardest bosses in the series, and beating in one try, even with a broken weapon is an achievement to be proud of. This is also something you’d have to play the game to truly know.\n\nI admittedly had to use a broken weapon my first time beating Midir and several other fights in the series. Over time, I grew past the need for that and even started handicapping myself in those fights for fun. I would like to see this person grow as well, as I would with any person playing these games.\n\nThus far, you have misread my intentions, albeit accidentally. I hope this clears things up. If you continue with the line of thought that you started this little chat with, I will know that you misread it maliciously, and have/will do it much more. In that case, this chat is over, permanently.",
            "\"seems like you hate the idea other people can do well in these games because it makes you look less special.\" \n\nWhat is a projecting?"
        ]
    }
}