{
    "r/Dating is NOT the place to soapbox Incel/Blackpill rhetoric.": {
        "title": "r/Dating is NOT the place to soapbox Incel/Blackpill rhetoric.",
        "score": 5792,
        "url": "https://www.reddit.com/r/dating/comments/es2cek/rdating_is_not_the_place_to_soapbox/",
        "content": "There has been a slow and steady influx of unwanted and misguided conversation plaguing our boards over the last year or so. I don't think this is a surprise to any of you all. While we ultimately encourage healthy discussion around both the positives and negatives of dating the overall spirit of this sub has been lost. Many of our readers have expressed their concern to our moderation team and we honestly feel the same way.\n\nOur \"No Soap-boxing or Promoting an Agenda\" rule has always been on the sidebar for our users to see but I want to stress our current stance on the topic. **Soap-boxing will and has always included red/black-pill ideology, \"alpha-male\" talk, and the subset of vocabulary that comes with it.** \n\nThis means that using our board to preach about how there is no hope for men (or women) who are conventionally unattractive is unwanted and will be removed. Using our board to discuss how you think women are shallow and will only choose the top percentage of men is unwanted and will be removed. Even just a mention of the term \"Chad\" is unwanted and will be removed.\n\nWe can sympathize that dating is difficult and is even more difficult for people that might not be the prettiest. It's no secret to anyone. What we value though is genuine discussion and helping those who actually want and need it. The countless misogynistic threads about how women and society aren't fair to men are toxic and don't do anyone any favors. There are better subreddits that would love to discuss these types of concerns with you in a more healthy way. Misandry is as equally intolerable. \n\nAt the end of the day let's lift each other up. Let's share our experiences and learn and/or laugh from them! Ask the questions that need to be asked. But let's not lose sight of what dating is really about.\n\n**EDIT: If you do see any rule breaking behavior please report so that we can take action. It's hard to see every comment. Thanks!**",
        "num_comments": 44,
        "comments": [
            "Welcome to /r/dating. Please make sure you read our [rules here](https://new.reddit.com/r/dating/about/rules) and remember to:\n\n* Be polite and respect each other. Do not call people names, engage in slapfights, or give bad/unethical advice.\n* Do not soapbox or promote an agenda - you will be banned\n* Follow reddit rules. Do not post content that promotes hate based on identity or vulnerability. Do not bully or harass other users.\n\nIf you have any questions, please [send the mods a message](https://www.reddit.com/message/compose/?to=/r/dating).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating) if you have any questions or concerns.*",
            "Reminder: please review our rules, especially rule 4:\n\n- No broad generalizations, e.g. \"All women are x and do y\"\n- Speak from specific personal experiences when giving advice.\n- No victim-blaming\n- This is a default message - your post has not been removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating) if you have any questions or concerns.*",
            "Reminder: please review our rules, especially rule 4:\n\n- No broad generalizations, e.g. \"All women are x and do y\"\n- Speak from specific personal experiences when giving advice.\n- No victim-blaming\n- This is a default message - your post has not been removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating) if you have any questions or concerns.*",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]"
        ]
    },
    "Do guys really prefer sexually experienced women over virgins?": {
        "title": "Do guys really prefer sexually experienced women over virgins?",
        "score": 121,
        "url": "https://www.reddit.com/r/dating/comments/1dlo69s/do_guys_really_prefer_sexually_experienced_women/",
        "content": "I recently attended a reunion where the conversation turned to sex and body counts, (which I was so interested about as I'm a virgin and is always being teased by my bff because of it) and I was surprised to find that most of the guys present preferred women with experience. Their reasoning was that experienced women know how to please their partners, whereas virgins require guidance, which can be tiresome. This made me wonder if being a virgin is seen as a drawback. Having saved myself for the right person, it's disheartening to hear that experience might be more valuable to men than emotional connection or other qualities. Is this really what matters most to them?",
        "num_comments": 228,
        "comments": [
            "Welcome to /r/dating. Please make sure you read our [rules here](https://new.reddit.com/r/dating/about/rules) and remember to:\n\n* Be polite and respect each other. Do not call people names or engage in slapfights.\n* All advice given must be good, ethical advice.\n* [Do not post hateful or harmful rhetoric - you will be banned](https://www.reddit.com/r/dating/wiki/rules)\n* Follow reddit rules. Do not post content that promotes hate based on identity or vulnerability. Do not bully or harass other users.\n\nIf you have any questions, please [send the mods a message](https://www.reddit.com/message/compose/?to=/r/dating).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating) if you have any questions or concerns.*",
            "its definitely the opposite. i lost my virginity when i was 23 because of personal beliefs and from 15-23 i was HOUNDED for that vcard. and i was almost raped a couple times as well for it. my frenemies would always tell guys, and guys would see it as some kind of challenge. it was super exhausting, and they just love the idea of innocent/purity. it's so icky",
            "wait until multiple dudes DM you on here just because you posted this. guys like virgins they fetishize it. I find it gross though as a virgin. I don’t want to be a kink lol",
            "I don’t care I just want someone who’s not going to dislike me",
            "Not a massive deal breaker for me but as someone who is still a virgin ideally I would like the girl to somewhat be in the same boat as me",
            "I prefer women who allow me to be myself, it has nothing to do with sexual experience. Don't really care what your experience is. It's how do you care about my soul",
            "Emotional connection and experience are not mutually exclusive.  You can have both.",
            "The real underlying appeal I would argue is enthusiasm. Women who have had many partners know what they like, and therefore it's more likely the sex is good when you both see that your wants are compatible. But there's many 'inexperienced' people who still learn what they like pretty quickly and are just as enthusiastic as anyone, and they're awesome.\n\nI do think this makes sex with a virgin a bit against the current because you still have to learn about what you like, let alone what your partner does, but there's no guarantee that an experienced lover will be a good one, I've had many starfish lovers that prided themselves on their past experiences, and a common thread there was lack of communication on their part, which is one thing that I would expect you to be stronger than most at the beginning if you are saving yourself for 'the one' and you meet someone that clearly you both love each other enough to finally want to have sex with them.",
            "obligatory people arent a monolith statement.\n\nI personally would prefer to do something with someone who knows how to do it/ what they want.  Dead awkward starfish sex is cool and all but its not my thing.  There are some men who will value this but the overwhelming amount of people who have had sex will prefer someone who knows how to have sex.",
            "I get why that conversation bummed you out. Just because those guys prefer experienced women doesn’t mean everyone does. Your choice to save yourself for the right person is personal and special. The right partner will value that and appreciate you for who you are. Don't let one conversation make you doubt your worth. Stay true to yourself, and the right person will come along!",
            "I think everyone has their own preferences about this",
            "Doesn't matter coz I ain't getting either🥲",
            "I personally like experienced women,bcoz I like women to dominate me. If a virgin girl is of dominative and horny mindset then it's ok for me! The thing that matters is compassion and creativity while love making, understanding each other and love that's it!",
            "There are still many guys who prefer virgin women. Don’t worry and don’t date someone who doesn’t respect your beliefs.",
            "I've never known another man who actually *wants* someone who's \"experienced\", as we usually don't like the idea of someone else having our person before us. Kinda an odd pit of the stomach feel. That said there's alot of guys in the world, so there's definitely *someone* into that...",
            "I never cared about that or ever will. if I love someone, it’s is what it is either u Respekt and accept the past of ur current date or partner or not.",
            "The right person is the right person \nI can see how a Virgin can be a lot more work and responsibilities because of the capacity to be an ass hole if you decide you just want a one night thing or to not see them again",
            "Honestly having more experience doesn’t mean you’ll be better at sex. When I was with my first boyfriend he was surprised that I didn’t at least give a BJ to someone before because I was good at it. However, when I was with a guy who had way more experience, sex was really unsatisfying, and I basically had to teach him not to violently scrape my insides with his fingers like he’s performing a curettage. And he told me he wouldn’t even bother trying to find my clit, saying it’s impossible and he just can’t do it. So really having slept with many people doesn’t guarantee someone will be a better partner. I think it’s more important to have good communication and passion between the two of you.",
            "Hell no.. Most normal guys don’t want a girl who sleeps around",
            "Nothing beats experience, js",
            "I’m not someone with lot of experience but what I want is mutual concent and respect, it’s just not about making more body counts it’s about enjoying the  moment with the other person.",
            "Preference most of the times want that innocence but in a freaky way 😭",
            "The jist is if you love the act of sex (learning someone's turn ons, foreplay, mutual enjoyment) then you will prefer expierence. If you want someone who doesn't know your bad or good and you still think coodies are real but you want to say you had sex then virgins seem like the better choice.\n\nI'm not saying your a virgin and you first time is destined to be with someone who's mentally a child I'm just saying what being virgin or not virgin all else equal attracts.",
            "Naaaahh my preference is nothing selected",
            "I've found it doesn't make a difference tbh... 🤣 As crass as it sounds, as long as she can guide me in/slide me back in, it's all the same. Sex is enjoyable, as long as she's putting effort into it and having a good time, it doesn'#t matter\n\nHandjobs... all the women I've been with seem to be under the impression is a grip the skin and yank it, idk why. experienced or not, didn't make a difference. I've had to tell them, it hurts to do that lol\n\nAnd for the record, ***everyone*** needs guidance during sex, just because one partner enjoyed it one way, doesn't mean ***everyone*** enjoys it that way. Sex is about communication too. It must be a porn thing, that you just fuck em' all the same and they love it.",
            "Some men will fetishize virginity.\n\n\nSome will romanticize it.\n\n\nSome won't care.\n\n\nSome won't want the \"baggage\" that can come with it.\n\n\n\nSociety is weird about virginity in men and women in different ways, which means people are going to be weird about it. And whole there's a lot of romanticized about two people being each other's firsts... honestly both of those people are going to be better off with their first being someone who A. Knows what they're doing. B. Knows what they like and how to communicate it. And C. Respects the other person's boundaries and right to a mutually enjoyable experience.\n\n\nNow, a bad first can be more unpleasant for women than men for simple physiological reasons, but a bad first can negatively impact how either views sex in the long term.",
            "It doesn't bother, we all got to start somewhere. Save yourself for the right person, dont jump into bed because you feel pressured into it, it is fun at first but it gets boring after awhile, if theres no passion it's pointless.",
            "Personally, I don't care, or didn't care in the time in my life where it was relevant.\n\nEvery new partner is a teaching experience, if you're doing it right.",
            "A good man will want to be your one and only. Your bff needs to leave you alone, fyi she is likely jealous",
            "I just like women",
            "Virgins should pair with virgins the worst is when a virgin chick gets used by a bad boy then left. As a guy I’d prefer a casual relationship be with experience but I don’t want an experienced girl as a wife",
            "The whole weird virgin fetish is for creeps and kids. When I was younger I didn't mind to help girls find themselves. I took my time and we tried a lot of things. I pleasured them in many ways. Now I just don't care about sex as much. I prefer having less but high quality sex over a lot of bad, slow or boring sex. I'm 30 and mostly date older women because they're very wild, fun and open in bed. I never asked and yet they always eat my ass. They always sit on my face instead of worrying about a lot of non-sense. They actually give good blowjobs which is honestly uncommon with women under 30. \n\nOf course, for an actual serious and long term relationship I need more than good sex but once again, older women are usually more emotionally intelligent, more mature and reliable. They also have a lot more to talk about. I love to date women between 32-38 for something serious.",
            "The thought originated along with the “women are property” mindset. Most of the guys I know (early to mid 30s) are sexually active themselves but want to marry a virgin.",
            "I am totally against this. Boys love virgin girls more than experienced ones. I never heard from any male guys interested in the experienced one. They only talk about this when they are in a friends-with-benefits type of relation or a temporary relationship. Also, this is just not about being a virgin or experienced it's more about whether this person will stay loyal and be there for them for a long-lasting relationship or she will in future find some faults and say goodbye. Many of the virgins are seen to have a patience mindset rather than to hookup with anyone.",
            "There are two kinds of guys who care about virginity - sweet, Mormon-esque guys who REALLY care about soulmates and wanting to wait together for marriage…and absolute fucking creeps who only see women as sexual property. Both are creepy, but the Mormonesque guy get’s a pass from me if he walks the walk and acts with respect. The other guy is the absolute fucking worst.  \n  \nPersonally, I want a woman who’s experienced and knows what she wants.",
            "Depends, but yeah I do. I recently broke stuff off with someone mostly because she was a virgin in her late 30s (I'm M41). That we'd probably be sexually incompatible was one thing, but the real red flag was that she'd never been in a relationship before. I just wasn't up for being someone's first of everything at this stage in life.",
            "For relationships? Nope. \nFor casual? Yes!",
            "no one wants a shy starfish",
            "All my boyfriends did. They said I rocked their world, versus their dead starfish exes.",
            "I've had a relatively large amount of sex with both. Specifically 6 virgins, and A LOT of experienced women. \nI definitely prefer experienced women for the down and dirty sex, but also treated the virgins who chose to share themselves with me for the first time with the same high levels of consideration, respect and reverence as all of my other partners...we just approached things slower, and with more caution. \n\nOnce you've done something, you can't un-do it. Be certain that it's what you want to do and be kind to yourself throughout the process :)",
            "For me for example, it's don't matter. I just prefer big girls",
            "I have never taken a woman's virginity, so I wouldn't know. It's a compelling idea, but that window closed a long time ago for me.",
            "It depends on the guy. Frankly, even with 'experienced' people, there can be learning curves with different lovers since not everyone is the same. And when it comes to 'guiding' a virgin, some guys might certainly find it tiresome, but plenty wouldn't care or might even enjoy that part.",
            "Very few men would say this matters MOST. I think you might have misinterpreted what they were saying. It sounds like they were talking about the narrow issue of sex and intimacy and said they prefer experienced partners over virgins, that's not the same thing as saying that that's the most important part of a relationship or that they value that over emotional connection. \n\nAs for the question itself, each man has his preference. Personally I agree with them, I would prefer a woman who had experience. But I also more than anything want someone who gives a shit about me, who I get along with, who I enjoy being around. If I met that person and they happened to be a virgin then I wouldn't toss them aside just for that. I might feel pressure to perform, sure, but if I liked them that much I would want to please them and make them feel good. And by contrast, there are men out there who actively prefer virgins to women with experience. It's far from a unanimous opinion among men.",
            "Nope, I'd prefer it",
            "I don’t care either way. But I appreciate a loyal, kind, and loving woman who can be my teammate and my equal partner against the chaos of the world. \n\nBut also a silly and maybe a little feisty one too xD",
            "I personally think so. Because some of guys want to enjoy sex with experienced bhabi type women. Bhabhi look very gorgeous and sensually attractive and boys keept in mind that these woman give real pleasure because they experienced.",
            "I got 0 so I don’t mind at all. I feel like the laws to dating and sex is that if you are a virgin, then you must only seek out other virgins. No if’s or buts about this. So ya, I get what you are feeling.  At some point you will feel bad about not meeting societal and social expectations.",
            "Not me, I’d rather my gf/wife be a virgin over being sexually experienced. I think part of the fun for me is exploring, growing and learning together.",
            "I do",
            "No\n\nIt's actually the opposite if anything",
            "Depends on what type of guys you are mixing with. Creeps, conservatives & religious guys would tend to prefer virgins whilst most normal liberal guys probably want some experience/it doesn’t bother them a whole lot.",
            "NOOOOOOOO IF A GUY EVER SAYS THIS HE’S LYING TO U",
            "Before I had sex I wanted a virgin girl, because I saved up myself, right 😂 And afterwards I was okay with not virgin girls. Ah the lies we tell ourselves! So this preference depends only on circumstances and conditionings.",
            "A lot of guys prefer to dare experienced women - usually easier and less effort. Many of these same guys want to commit to/have long term relationships with/marry virgins or at least much less experienced women. If you're saving yourself for the \"right one\", your being a virgin should not be a problem - as long as you are ok with his double standards on who to date/hookup with vs who to build relationships with. Most don't consider sexually available or experienced women to be capable of serious relationships and keeping commitments made...despite the fact that they believe themselves to be trustworthy regardless of sexual experience and history. They'd tell you it's different for men and women for all sorts of completely ludicrous reasons.\n\nI'd say - if a guy values you just for being a virgin while he has played around a lot - be wary of him. He'd have double standards in other things too. If he sets the same/similar standards for himself, he'd make a better partner. But there are not too many of those out there. But there are so me. Good luck",
            "If someone has never had sex, I can accept that. It's okay if someone isn't experienced. I respect a person who isn't just passing it out. I'm never just passing it out, myself. And I just can't fetishize virgins because I honestly prefer someone with at least a little experience.",
            "Beggars can’t be choosers…",
            "I prefer sexually open and sexually curious women. That can be a virgin, too. I want to have fun with her, I don't want to have persuade somebody, because I need strong consent.",
            "I personally don't find it creep. Believe me there are soooo many guys out there who are still virgin and just wait for the right moment cause for them it's not just sex but making love to a person that melt to. You're just in the wrong app 😔",
            "Depends on the guy's experience in sex with both actually. But as a guy, I'd prefer virgins more than sexually experience ones since there's no pressure or occasions to rise above to. You're just there for the experience and pleasure of it. Then again, it's just me.",
            "Nah 98% of men in my circle don't even consider that whether that woman experienced or not",
            "I prefer more dominant women in bed ..",
            "I accept who accept me either they have experience or not. In the end of the day we are just humans who wants to love and to be loved",
            "48M I’ve never been with a virgin and wouldn’t want to be. Just from the few that weren’t virgins but had little experience……..nope.",
            "Not really",
            "Yes. Only fkn weirdos refer virgins. I like loose holes.",
            "Well majority of us prefer women, experience or not doesn't matter.",
            "Honestly?? I don’t care either way. What I want is chemistry, personality, and compatibility.\n\nI will say that touch and sex is an important part of my ability to feel intimacy with someone. And intimacy is important to me in a long term relationship. Not just straight penetration but sexual acts in general. It’s one of the big ways I get close with someone. \n\nIf you want to be celibate until marriage then that is a deal breaker for me personally. No shade on you for that btw.\n\nBut if you just want to be sure you’re losing it to a good guy I completely respect that too and I’d be willing to put sex on the back burner for the time being if my chemistry with the girl is NUTS. It’s all subjective lol.",
            "I honestly prefer someone with some experience. Doesn’t have to be crazy pro experience but at least someone who knows what they’re doing. Now if it’s someone who’s a freak like me then omg I’m all for it!!",
            "As Virgin I hoped I find a good Virgin not that I care too much still",
            "Not really, what any man or woman will find more interesting is chemistry. Intercourse is also about communication as everyone has different reactions to certain stimuli and preferences such as roleplay or roleplaying. Long story short everyone is different and learning about your partner will always be more preferable than any sexually experienced person.",
            "Yes.",
            "I (27M) am also virgin and I see the situation as that : if the woman I’ll be with is virgin, then cool we will progress and learn together.\nIf the woman I’ll be with is experienced cool she can guide me (and I’ll do everything with eagerness just to prove her I’m worth too compared to others)",
            "At this point, just any woman would do",
            "Its more fun, easier going and stressles. Otherwise they must enjoy being a teacher. How will one dance not knowing the moves?",
            "Flat no. \n\nNot especially virgins, but 'experienced' in women can come with a LOT of other baggage. \n\nNot generally, but it absolutely us something to be careful of, when you're a guy looking for a long term partner.\n\nFor guys, there's a massive difference between sex and relationships, and 'less experienced' women with good character are more likely to end up in the long-term relationship category. \n\n...now I'll await the barrage of hate from the 'experienced' ladies...",
            "I'm not a guy, but I'm sure if someone likes you, I mean REALLY likes you or even loves ou, they won't care. I was 23 when I lost my virginity and the guy wasn't even my bf. We just really had the chemistry and attraction and I wanted to do it and with him, he was a nice person, I trusted him etc etc. \n\nI told him and he seemed surpised, but gave no sign that this would bother him and he was nice. I think I nice person will know and understand that this has nothing to do w your personality. I wasn't too shy or prude bc I was a virgin. I wanted him so bad, it was the most natural thing and it broke down the walls. I used to stress SO much about my virginity before I lost it, bc I thought ppl will think I'm weird or something. Meanwhile I was waiting for the great love and it did not come for so long. So I let that idea go, that I'd loose it with the perfect person, cuz there's no such a thing called perfect place or person or time. And then he came, how I was into so much sexually, and we did not end up together (for various reasons), but it's still a fond memory. \n\nAnd ever since I know indeed, that it doesn't change anything.",
            "Inexperienced guys lacking confidence prefer virgins because (they think) they're easier to handle (and control).\n\nExperienced women are much more confident, know what they like and want, and make far better partners (both in and out of the bedroom)",
            "everyone starts out from being a virgin",
            "I actually prefer a sexually experienced girl. But that’s because I’m experienced myself, and I feel like it’s easier when my partner knows what she wants",
            "No, keep saving yourself for the right person (husband). A guys whos serious about relationship wont care about sex as much as you would have thought. If possible find a guy who wont ask for sex during dating stage… most of the times it just lust not love. \n\nAlso I think virgin girl should be pair with virgin man so  you can experience learning new things together.. its more fun and loving.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\np/s from a virgin man. (I do have a gf) just my opinion tho.",
            "Gotta give em that hawk tuah you kno what im sayin..\nJokes aside..\n\nYes. For me anyway. Experience is a big thing and it’s both ways.",
            "![gif](giphy|3o7aCRloybJlXpNjSU)",
            "After a certain age, yes.\n\nSomeone else mentioned 15-23.  I think that’s a good window for when guys might prefer a virgin. \n\nI’m 40 now and recently divorced, and was talking to a 33 year old woman.  She revealed that she’s a virgin but wants to lose it.  \n\nWhen I was younger, “virgin who wants to lose it” would be the greenest flag in the world.\n\nBut now, at 40, it was a deal breaker for me.",
            "Virgins don't understand anything to contraception.",
            "Guys hate competition. As long as they're the best, biggest, & hottest you've ever had and you're so crazy about them as to do anything they want....they don't really care about anything else.\n\nNow, if all those things were true. I'd wager to say that would be a terrible experience for you. A relationship is a partnership and a struggle. For it to work right each partner needs to be able to hold their own.",
            "Well, I had never been with a virgin but I had heard many bad stuff from girls about their first time.\n\nI never went for someone who I knew was a virgin but I kind of resolved to give someone the best experience possible if they happened to be a virgin.\n\nLike chalking up my hands, taking 2 shots of pre-workout using a belt and a cock ring etc.",
            "Wouldn't that mean increased expectations from the guy? I would definitely pick soneone with less experience, I don't want to be compared with the best in the business 🤣",
            "Both, time to time",
            "Me personally, I could care less if she had sexual experience or not",
            "Personally as a virgin…the men I encountered prefer it 😅 makes me wonder sometimes if that’s all they are after.",
            "No, of course not! \nIf you or anyone else has to pick traits. With everything else being equal; would you pick discipline and self control, or indulging and momentarily satisfaction?? \n\nTHAT is the value of a person being virgin man or woman. It’s about the discipline and impressive self control that a person has, to remain a virgin. That is what is special about it. \nAnyone that picks the latter is either too young to know better, or just simply wants a person to have sex with (those are usually described with a less PC word, other  than ‘experienced’) and not build a life together. \n\nIs it fair to assume you were hanging out with tweens?\n\nAlso, keep in mind there’s a difference between a partner you marry VS person you hook up with.\n\n\nWhich person do you want to be?",
            "I’m a guy and I’m a virgin and honestly I wouldn’t care.  I date for love not sex. Yes sex is included but it’s not what I would date for",
            "I have always preferred virgins NOT as a fetish or kink but because there was a bit more value to my brain that the girl has been with only me and no one else. it made her that much more special to me and never wanted to lose her. girls with \"experience\" would always turn me off because they would do or say something during sex referencing what they like and that's not as special when you don't find out together and then you're just hollowing out a girl thinking \"how many guys have done this?\" But as I get older (m28) I tend to care less because (trauma?) virgins are less common now. also most the virgins I have cherry picked ended up going on a sex rampage after their first time; so I don't seek them.",
            "I don't think it's a drawback, but I definitely want to be with someone that knows how to have fun in the bedroom. Knows their body, what turns them on and their partner.",
            "Different horses for different courses.\n\nSome people fantasise about the idea of a virgin or purity or something. Some dudes really value that. \n\nOthers prefer a woman with enough experience to do a decent job.\n\nI think the balance for most men is somewhere along the lines of ‘A decent enough experience so you’re going to be good in bed but not telling me how many dudes you’ve slept with because it’s weird to think about’. \n\nGentle reminder: I don’t think reddit users really speak for ‘the general normal populous’ haha.",
            "\"Do guys...\"\n\nNo. There are four billion men on the planet. Statistically, no.",
            "I can see the reasoning about the guidance part, but also think that that's the case even if the woman has experience. There are things that I may like that she never did or she does in a way that don't pleases me. \nEvery \"couple\" has to figure this things out. Me and my high school gf lost it to each other and was fun to discover things. When I met my fiance, she only had one partner and she didn't enjoy it with him. (She lost it to him and he said \"brace yourself, it's gonna hurt\". I mean, I get \"I will try to be gentle\" or \"It might hurt, so tell me\" but straight up it's GONNA hurt?! Are you doing it on purpose?!) Anyway, got sidetracked in the end but my point is she had no clue about what she liked cause she never felt it, so we discovered together.\nEven nowadays, if either of us wants something specific, we need to guide the other. But for penetration alone, anyone can figure it out pretty quickly.",
            "Personally virginity is a drawback for the reasons you mentioned but everyone is different and has different values.\n\nYou simply should do what you believe is right for you and lose your virginity when you think you're ready",
            "If you had a choice would you rather have new underwear or used? ",
            "an experienced woman can have more emotional connection?? being a virgin doesn't affect it in any way",
            "As interesting as that would be, I'm not trying to scare anyone. So if I'm dating a virgin I wouldn't want to scare them by talking about sex, which I would be eager to have while they might be apprehensive.\n\nBut if the person I'm dating isn't a virgin, it would be easier to bring up the topic.",
            "I’ve taken my fair share of vCards, but I do prefer a more sexually experienced woman.",
            "No. Some prefer it, most don’t care either way, and typically only those looking for a hookup prefer someone experienced (male and female). Because in that case it’s about the quick easy sex and not a connection. Whereas in the pursuit of an actual relationship, for many, it’s the opposite.",
            "Guys like girls with some experience, but not too much.",
            "Ok, so I have no problem with a virgin, I THINK… but I’ve never actually been with one LMFAO 🤣",
            "I never really understood the virginity fetish. It sounds quite alien and unreasonable to me. I'd have a seasoned, experienced partner any day of the week instead",
            "Im going to be honest. Most men dont give a rats ass. I personally prefer a non virgin because it becomes a weird thing otherwise.",
            "For sex, yeah. For relationship, no",
            "For those who just want sex primarily then they won't really care and the more experience the better but when it comes to long-term engagement (e.g. monogamous marriage), a man with options will probably invest in a woman who will increase his standing in the eyes of his peers, who will be faithful to him, whom he can lead and show the world - this person is unlikely to be the chick who's done everyone, has her goods on display on social media for all to see and who's been dating millionaires on yatcht and mansions. There will always be exceptions I'm sure but in general the Virgin will have more leverage to nogotiate marriage and stability.\n[I appreciate many here will not like my answer but it's not about being pc but about giving the OP an honest answer]",
            "I dont because i dont like seeing women in pain, it isnt a deal breaker obviously",
            "I think many guys prefer dating someone who hasn't been heartbroken. It's not necessarily about virginity. It's about love. Personally I prefer to date someone who is highly sexual and highly kinky but also reserved or maybe at least not having dozens of sexual partners. I don't really mind if a girl has been sexual. It doesn't bother me, but at a certain point I feel like, maybe it's not a good idea to sleep with this person on occasion, because they are exposed to a ton of germs. It also really depends on who a girl is having sex with. If she was having sex with femboys, I wouldn't care a bit, or other girls for that matter, but if she is being run through by like convicts and meth heads, then yeah I'm going to have a problem with that. It disgusts me. \n\nWhat is the appeal of virginity? \n\nTo some it is the idea of a girl who is naive, and will stay with them, for others it's Chasity, and also the idea that someone loves a person for being themselves or something. To me that comes off as very manipulative and weird. Personally I'd rather a girl be happy and date who she wants. I'm not really the type to want ownership of someone. I'm more looking for someone who is on my level and has similar values to me, and enjoys sexuality. Most of the reason I date is because I went to cuddle and do other things. If not for that, there isn't much reason for me to put up with a lady, unless she is naturally just very cool like a cool person to hang out with. Those girls are highly sought after, so dating them isn't the best prospect.",
            "Were these men aware that you are a virgin?\n\nThey probably assumed that all the women present were sexually experienced, and that assumption probably influenced their answer\n\nPretty sure most men are just fine with a virgin, as long as she’s going to be open with him",
            "What the fuck is a virgin ? Virgin Milk ? Virgin vinegar ? Virgin oil ?",
            "Save yourself. No need for experience haha. Pwede naman virgin na may alam sa ano ah.\nI think not all men are like that, siguro babaero lang sila.",
            "Doesn’t matter. Treat me like a functioning adult and like I matter, and I can handle the rest.",
            "As a heterosexual man, I can honestly say that virgins interest me. They are like new planets, treasures waiting to be discovered, but since finding a virgin female partner in my age group is a dream, I mostly prefer experienced female partners who will not cause any problems.",
            "*It really doesn't matter to me either way*. It's nice to think that I'd be her first but it's also nice if they have experience. ",
            "Speaking from my personal experience- if you’re an older virgin - meaning you made it to your 20s without sleeping with anyone, men see you as a challenge. “You’re hard to get and therefore worth the chase. You’re fascinating because everyone else sleeps around. Your standards must be high.” Ugh. Yet nobody cares why you wait/waited for so long.",
            "Most men prefer virgins, but most men will also lie, if the guy was talking to a girl who had a lot of experience, he might have just said it because he wanted her, but all things equal most men prefer virgins.\n\nOr rather most men don't care but there are more men who prefer virgins than the other way around",
            "Virgins better for my because I trust her more than others",
            "No it’s actually the opposite most men prefer virgins if it’s for a loving relationship not a pure sexual one",
            "A good dude isn't going to worry about this. Your experiences are your own. More importantly is how you are treated not if you've had sex or not",
            "Yes and no but im a virgin myself and what i seek in a partner is more about drive to make a great family and help foster a younger generation of good examples. Not be down for promiscuity and thinking its okay",
            "Star Trek said it best.. \n\n#to boldly go, where no man has gone before.. \n\n😂",
            "Its weird, men themselves don’t know. Young guys want older woman and old guys want younger / virgins",
            "Less the better",
            "Thanks for starting this topic!\n\n\nSocial constructs and these beliefs is what makes living life as a women so damn hard sometimes\n\nWe love that we have beautiful curves. Strong intuition and many other things\n\nBut when it comes to “virgin” or not. There’s so much double standards\nSome guys are more misogynistic than others\nSome guys educate themselves and learn/unlearn what beliefs is worth keeping and what’s not\n\nAs a virgin 27F I’m also so tired of these BS…",
            "Search retroactive jealosy. If you want long term, do not rush",
            "Virgin girls babe as we can see some future with them exp women with too much have too loose & unworthy many times for even one night’s",
            "Idk, but for me i dont mind if they are experienced or not",
            "Noooo. No.",
            "Ask that question in reverse.",
            "Ido",
            "Ido",
            "Yup",
            "No",
            "No, no seal no deal",
            "It's a biological thing, as women want a strong and providing man. Not a fetish or a kink.",
            "In my experience only dudes with small dicks like being with virgins. Not a dig at the unimpressive of us, but because of the pain that penetration causes the two experiences I've had taking virginity were not enjoyable.",
            "You say \"save yourself\" for the right person. What exactly are you \"saving\"?  If you are looking for a running buddy, would you decide to never run your whole life to save yourself when you find your running buddy?  If have a few relationships you mature a lot. You get much better at \"Partnership\". You learn to function with a partner on good and bad, including intimacy.   \n\nThere is nothing you \"save\", and you will be incompetent and maybe disappointed with misguided expectations when you finally are done \"saving yourself\". Maybe you \"saving yourself\" is a crutch you use to avoid the effort growing into an adult, mature and great partner.",
            "Jesus, I'm so sorry you had to deal with that. That sounds like a really scary thing to have dealt with for so long. The whole idea of a \"challenge\" there creeps me out so much as a guy. Idk what the fuck is wrong with guys who think that way. Hope you're doing better now.",
            "Wow I’m sorry for the horror you had to go through for being a virgin.",
            "Yeahh I tossed my v card into the sea at 23 as well\n\nBut I didn't put up too much of a fight to the first girl lol, I was already eyeing her already",
            "Some guys don't know how to draw boundaries on their fetishes.",
            "I like experienced women, nothing against virgins but it’s weird to specifically seek a virgin out in any gender",
            "At the end of the day u r a girl, deserve respect, so doesn't matter if you are a virgin or not,  you should be treated with that simple approach of respect",
            "Most guys want experience. Creeps want virgins.",
            "So, you have now stated you are a virgin, knowing you'll get DM's... Sure you don't like it? 😉",
            "You’re right! Yuck. Unsolicited dick pics should be illegal",
            "Rip you inbox now as well lol",
            "DM me",
            "It’s because virgins have no comparison experience, they won’t know if these guys are awful or great.",
            "I definitely don't know anyone who wants a virgin.",
            "Based 😆🤙",
            "Fax",
            "Same",
            "100% same",
            "Agree",
            "Yeah I totally agree",
            "Same",
            "Very true\nI'd 100% prefer a virgin,  and it's just me.\nShe just happened to find herself around people who would choose experienced women, so there's no reason to doubt her worth as a virgin 👍",
            "99% of the 'do people like X?' questions in this sub can be answered by this.",
            "Guys who are inexperienced or bad sexually prefer virgin women.",
            "That's your low self esteem and ego talking because you don't want her to have had better and compare",
            "Sexual experienced does not always mean sleeping around, it could also be 1-2 partners before that",
            "Agree here 100%",
            "Ps the guys probably said they preferred experience under the assumption that the girls weren’t virgins and wanted to make them like them",
            "Can't imagine having dead starfish sex with the same person for 10 years",
            "On the other hand romantics. Most love seeking with long time plans, a big familly or geligious fans will go for virginity. Also there is plenty of individual situations inbetween this. Not mentioning that world is turning up side down now and going mad crazy least to say.",
            "aw thank-you. i appreciate that, i had some pretty shitty experiences but i'm glad i did not experience it for the first time under those circumstances. yeah it creeps me out too, i always thought it was weird and the fact i was pressured. i'm so happy i didnt give in, i'm much too stubborn. i often thought it was strange to fetishize it even if it's been a thing for centuries.",
            "yea some guys don’t know boundaries at all it’s really scary tbh",
            "This one. Any guy that thinks your virginity is super special is probably a predator or using religion as an excuse to control people.",
            "thanks 🫶🏼",
            "> At the end of the day u r a girl, deserve respect,\n\nRespect is earned, regardless if you're a man or woman. \n\nRespect isn't automatically given just because you're a specific gender.",
            "This.",
            "no I don’t like it but I’m not going to change how I talk to people to avoid creeps.\n\n\n\nit’s giving “look what she was wearing she was asking for it” 😬",
            "period. it’s disgusting",
            "🤣🤣🤣🤣💀💀",
            "What's wrong with you?",
            "Hahahah. I get you. But, who says people in relationships don't have a spicy sex life!?\nYou just need to choose the right partner! Its upto you, you can make it *the dead starfish sex*😂 or an exploration session.",
            "I have grace for all and everyone's journey looks different, but it sounds like most dudes didn't have positive role models in their life and they have some serious healing to do when it comes to expressing sexual needs in a healthy manner",
            "Ur welcome lady",
            "I hate the \"respect is earned\" saying. You don't need to earn my respect. Everyone I meet automatically has my respect. If you're an asshole, you'll lose it, but you don't need to impress me and earn it.",
            "Brother I guess u didn't understand, if in case u have posted it. I would have given you the same reply. Man or woman doesn't matter.",
            "This?",
            "I agree!",
            ">she was asking for it\n\nI don't agree with that, and I know majority of men don't.\n\nHowever we both acknowledge predators exist. As stated by your DM comment. Preferably don't draw attention from the hyenas.\n\nYou don't have to change the way you talk, you can just leave out one single key word. \"I find it gross though\"  your point is stated clearly. \n\nAs a well off man, I don't go into a crack den and say \"damn I hate thieves, like it would totally suck if a thief stole all this money I have on me\"\n\nIt's common sense survival, nothing about loosing rights or whatever.",
            "Sorry if truth offends you but u find your sugar coated bs just as offensive",
            "This is kind of overstepping and you didn't even notice. She didn't ask.",
            "it just implies agreement with your statement! :)",
            "I’m relating to the poster. and mentioning something about me that gives what I allege credibility and give a basis for my take on the matter. \n\ninterestingly you use the exact same sentence as me but replace “virgin” with “well off man” as a means to drive YOUR point. \n\nso if people DM you asking for money maybe you just like that huh?\n\nI’ll post whatever I want and ignore creeps like I already said I’m aware of it. make no mistake, our “disagreement” started when you suggested I like when it happens which is baseless and gross.\n\nI also loved how in your message you said I don’t have to change the way I talk then proceeded to describe how I can change the way I talk.\n\ntake a walk buddy",
            "This isn't a survival situation, it's reddit calm down",
            "The thing about public forums like this is, posting in them is kinda consenting to having your position commented on.\n\n\nIf you dont like that, go find an echo chamber forum or take a break from the internet.\n\n\nAnd before you say you didn't ask, read the above again.",
            "👍",
            "Oh okay \nThank u for helping",
            ">so if people DM you asking for money maybe you just like that huh?\n\nI do 😁, it's nice being charitable to those who need it.\n\n>you suggested I like when it happens which is baseless and gross\n\nMy apologies, I get a little edgy sometimes 😂\n\n>then proceeded to describe how I can change the way I talk\n\nNot the way you talk, just how much you talk 🤭\n\n>take a walk buddy\n\nI'm actually kinda sick right now, haven't been out of bed for a bit, might be a good idea 👌",
            "Why? You seem like the elevated one. 😂\n\nI was mentioning a broad natural human instant that we should all have, kinda like fight or flight. \n\nHell, it could even actually be survival. You know how many preds are on the Internet, looking to gain enough trust to potentially meet up?",
            "okay mr beast thanks for the insight ✌🏼",
            "Well garsh thank god for you protecting all the virgins from internet preds! You really saved some lives today 🙌",
            "Don't forget to like, subscribe and hit that bell!",
            "Your welcome 😊 All in a day's work.",
            "I’ll pass 😬🫶🏼"
        ]
    },
    "My boyfriend wants to have a threesome but I don't ": {
        "title": "My boyfriend wants to have a threesome but I don't ",
        "score": 51,
        "url": "https://www.reddit.com/r/dating/comments/1dlqzdw/my_boyfriend_wants_to_have_a_threesome_but_i_dont/",
        "content": "It's been a while we've dated, and I could always see hints that we wanted to have a threesome but I've ignored it. We like to explore different bdsm stuff and experience them, but threesome is something I can never agree to. \nI'm a very possessive person by nature and I have jealousy issues, I believe what's mine is mine and Im not the type to share, and including a third person into this even for a moment would make either lose feelings for him or take drastic measures towards the third person and I don't wanna do either.\nI've been feeling under the weather ever since the conversation and I want to talk him out of this without hurting his feelings. what should I do? ",
        "num_comments": 113,
        "comments": [
            "Welcome to /r/dating. Please make sure you read our [rules here](https://new.reddit.com/r/dating/about/rules) and remember to:\n\n* Be polite and respect each other. Do not call people names or engage in slapfights.\n* All advice given must be good, ethical advice.\n* [Do not post hateful or harmful rhetoric - you will be banned](https://www.reddit.com/r/dating/wiki/rules)\n* Follow reddit rules. Do not post content that promotes hate based on identity or vulnerability. Do not bully or harass other users.\n\nIf you have any questions, please [send the mods a message](https://www.reddit.com/message/compose/?to=/r/dating).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating) if you have any questions or concerns.*",
            "I’m a guy that has done more shit than you can think of and I can say if you’re not comfortable with anything just tell him outright. \nIf that doesn’t go well, you should find someone who actually respects you. Respect shows the love more than any other bs you seen in any romcoms or disney movies. \nAnyways, once you open the relationship there’s no way back. And whoever tells you differently they just lying themselves.\nAlso might be the case he has a fantasy of fuckin two women at the same time. Or just a woman that’s not you, and wants to make you accept it. \nThis never ends well. \nI would just end it outright if I was you. \nEach to their own but if you don’t want that or it gives you the ick or don’t feel comfortable with it, just don’t. And move on with life. There’s 8 billion people in the world to choose from.",
            "girl, telling him you’re not comfortable with it should not hurt his feelings. \n\nif you get anything other than an “okay I understand” leave that man’s shit right on the curb 🫶🏼✨",
            "It’s not about talking him out of it, it’s simply “no, not doing that, it’s outside my comfort levels and I just don’t want to”\n\nWhen it comes to consent and sexual preferences, no is a full stop and and that’s it. He has no choice but to accept it as his preference doesn’t override yours. Just like with other things in a relationship when you have a fundamental difference, it becomes “I accept it, let’s forget about it” or “I need that and realise it can only happen elsewhere”\n\nThose are his choices",
            "It’s all about preference/comfort and it should be respected anyways. So shoot it simply, reply will be yes or no but at least the subject will be moved forward. All the best!",
            "Men obsessed with this idea even after being told a firm no typically do not care about their partners feelings much. They are often selfish partners in general.",
            "Add another man it’s also a threesome",
            "You're either into or your not, nothing wrong with either. If this is something he is strong wanting to try, than maybe he should find someone else.",
            "Mentally have a talk with yourself and DETACH ASAP.",
            "RUN",
            "Honestly the moment they asked for this would be the moment I would walk away. I would advise you to do the same if this is something that you are feeling pressured into. Who cares if you hurt his feelings when he has deeply hurt you by prioritising his fantasy of shagging someone else over that.",
            "Girl! I see your post and I see your replies and I'm so very sad for you. I'm also scared as to what the future brings for you.\n\nTo be so infatuated with somebody or so in love or so connected that you allow yourself to go against your boundaries and allow yourself to be disrespected in your wishes and desires can only end badly.  I'm sure it feels like you're trapped in many regards, and I hope you can find yourself and find what's best for you.\n\nI understand the BDSM dynamic, and while you've given so much power to your partner, in the long run the power really lies with you. He can go only as far with you as your safe word. So in essence, haven't you been giving the safe word?\n\nSo what are you going to do? Are you going to respect yourself and your boundaries?\n\nI'm a big fan of relationships and in particular marriages and while it's easy for others to say just drop the guy and walk away, that's one approach. If the relationship has value, perhaps you need to seek out some professional counseling to see if you can resolve this issue. I think that process could resolve this issue, and potentially others in the future, one way or another.\n\nBut please listen to your gut, respect yourself, respect your boundaries and hang firm on enforcing them. I wish you all the best.",
            "I am going to guess Mr selfish wants it to be him and two women? And definitely doesn’t want another dick in the room🤣\n\nSeriously though tell him NO and it’s never happening!.",
            "Does he want another girl or boy in?",
            "Had an ex like this. I told him early on the only way I would be comfortable with this if we had one with another man first. Then he changed his mind at the time when I said this. However slowly over time he started bringing it up again. Among other things, like having kids together and moving in together asap. I declined that as well, as we hadn't been dating a full year yet. So he decided to cheat and then became verbally abusive when I called him out about it.",
            "hmm am a woman but this is so sad",
            "My ex girlfriend’s best friend wanted to have sex with us. But my ex girlfriend didn’t want it to happen. At that time we were dating, but now when I think about it, It would’ve been an experience in life and I don’t think I have regretted it. But right now I regret, I mean it was not in my control.",
            "Time to move on from him.  Looks like a lof of compatibility problems down the road",
            "Tell him that you don't want it. If he doesn't agree, he doesn't deserve you.",
            "I didn’t read all of this because I’m a guy but sounds like he’s bored of you. As someone who’s experienced threesomes before someone is always left out and it’s usually the person least interested. Find someone who loves you because jealousy either way is toxic",
            "I bet he wants MFF - I would suggest you let him know you would think about MMMMF - bet his thinking changes 😀\n\nLet him know it would be hot to see him pegged by one of the guys.",
            "If you are not comfortable with that just tell him dont hurt your mind more if he refused he can find someone else,period!",
            "Basically if that’s not the end of that you have a long term booty call, not a boyfriend.",
            "If you go through with this situation you happen to be in, it could be the best worst thing to unlock your full potential you could ever experience, at least this way, the perceived “fear” and “pain” that causes the shame belief to spike up will ultimately be somewhat of new emotional freedom you didn’t know you needed or could exist.\n\nWomen have a hard time quantifying sleeping with someone without being attracted to the man while a man can have sex with a women he dislikes and have no connecting at all.\n\nHas anyone considered looking into childhood trauma?\n\nThe people pleasing side of you saying yes to this threes-some  will ultimately cause a lot of resentment within you that will be unresolved and eventually turn into cancer and manifested into some weird disease\n\nAll these pent up emotions , of the choices that are made when your “gut” told you not to do it, causes and leads to a lot of neuroticism and the beginning to the end of any relationship when one partner is not aligned with the other…..\n\nAnyway…….. make sure you don’t misunderstand  ideology as a fact of some sort and lie to yourself of the “should” and “shouldn’t” …. Follow your gut, if you’re in an incompatible relationship out of fear of being alone ….  When other people cheat and or have interest in others it never personal… it’s all unresolved traumas\n\nOf course to get to understanding what sick and tired of being sick and tired is to identify why people attract the people they do…. It’s profound to see how ordinary we are and we all suffer the same no matter where in the world we are",
            "I am assuming he wants a threesome with another woman. Tell him that the only way you will agree to a threesome is if it's with another guy, AND a guy of YOUR choosing. Trust me, he won't want to have a threesome anymore.\n\nIf he still agrees to it, however... Choose his dad. Or his brother. I GUARANTEE he won't wanna do it anymore.",
            "for me it was an excuse to betray me \"legally\".\n\ninstead of telling me, look i am seeing another guy. she told me, lets have sex with another guy you dont know \"so i do not have to feel guilty betraying you\". \n\ni left her after a few days. could not marry and share half of my stuff with someone like this.",
            "Just say no.",
            "No means no!  Period.  He can go fuck himself!",
            "You are doing the right thing. In a committed relationship both parties have to agree equally in activities. If one is uncomfortable about a decision, then the activity should be forgotten. If one partner still harps on said uncomfortable activity, there will be more future problems.",
            "if you dont want to do stuff. dont do it and communicate it.",
            "He is not respecting your feelings and not deserve your love please stay away from him",
            "Tell her directly that you are not comfortable about it. It is a type of cheating also. If he respects and loves you then he won’t repeat it.",
            "Girl .. Youu better let his ass know LOUD & CLEAR 💯💯💯",
            "Sooner so it if you don't want to. If he keeps pestering you suggest a MMF threesome, his response will be telling.",
            "Tell him sure and pick out a trans person and I bet he changes his mind.",
            "He's probably cheating",
            "The urge to purposely misinterpret his request and start boyfriend shopping on Facebook/insta beside him tho? \n\n\"This is John he's only been to prison twice, he's perfect right?\"",
            "Then tell him that?",
            "Sometimes you need to give your partner what they want sexually. We all have different itches that need to be scratched. Threesomes are a play on non-monogamy and are not something a monogamous partner needs to be open to.  It’s the antithesis of your relationship arrangement.",
            "Sometimes fantasies are best left as fantasies. Real life can complicate things.",
            "U don’t satisfy him enough. Yikes all around",
            "Tell me him only if its MMF.",
            "You’ve said no stand tall and stand firm, tell him to stop asking you. You’ve already told him the answer which is now. Girl you’ve got this 🌸",
            "Me too Im married and I want to try exchange wife I don't know is that possible",
            "If he doesn't take your no with a beating heart and keeps persisting on this then tell him the only threesom you want is with another man and not woman. That will shut him right up.",
            "Don’t",
            "51M here. \n\nTell him you will do it, but on your terms only. Your terms are:\n\n(1) The third partner is another man.\n\n(2) The two men have to have oral and penetrative sex first, while you watch.\n\n(3) Your boyfriend has to be the bottom; he fellates the other man first,  and then your boyfriend receives the anal sex...with a condom, of course. \n\nAfter your boyfriend has been penetrated, only then will you join in. You will start with the other man first while your boyfriend watches.  Only when you give the okay may your boyfriend touch you.\n\n\nIF and only IF you are satisfied with his performance, but more importantly, with your own experience, will you _consider_ the possibility of a FFM threesome. And you have veto power over the woman.\n\nIn other words, make HIM say \"no\".",
            "then dont",
            "You can ask him to do threesome with other two girls and come back to you when he is done. Tell him you’re not interested. It’s not that difficult.",
            "Tell him you are OK with it but only if it’s with Jahmale a nice local basketball player you just met.",
            "I think is has got to be far the most sensible comment... but when he says once you open the relationship there is no going back and he is right 👍",
            "This was really helpful thank you so much",
            "Well put. I’ve heard from real life story too\n\nof a friend being asked to join a threesome. He chatted with the guy to understand more\n\nUnbelievably (for me) the guy eventually just said “we’ve tried once and it’s so much fun. I can never go back to just two person only and im tired of seeing her naked : boring)\n\nAll these things apart\n\nIf he disrespect your boundaries while you seem to try your best to be the best partner (but not betraying yourself)\n\nThis dude don’t deserve you anymore. Maybe he did before",
            "I guess you're right, thanks for the support girl",
            "^^^^  THIS. ^^^^",
            "Yess I got that mate, but what if he wants to leave after all this? I've been attached, it's gonna be a little tough",
            "Well yes, I did that, and he seems to be very upset about it, I told him I'm totally comfortable with anything he wants but that, but he's holding onto it for dear life and it's genuinely effing my head up cause I'm attached",
            "So does that mean all that care and love was a facade?",
            "Oh",
            "This was my first thought",
            "Thank you so much and yes it will be very hard if he leaves cause he was with me on one of my darkest episodes of life and I've completely given control over him and walking away would be hard but I will not betray myself to keep someone who doesn't respect me or doesn't consider my boundaries. After all even though he helped me at one point, I've been with myself all along, and I will keep your words in my mind, thank you so much",
            "I just know he'd be pissed if she suggested having 2 men lol",
            "Well he is interested in trying new things\nThanks for the advice!",
            "A girl",
            "Thank you so much for telling me all this it really helped, I'm grateful for you understanding my situation",
            "🤣🤣 There you go!",
            "I posted this with only one intention \"I was confused and needed some more opinions and reality checks to see if I should feel shitty about saying no or not\"",
            "I will definitely add this line when I talk it through in person with him",
            "Thank you for your support!",
            "This is the most amazing answer I ever heard .. \n\nWow just wow im still in a daze 🥰",
            "You make it sound like this is a bad thing",
            "This was one of the best responses, thank you",
            "Can I have you this?? 🥇🥇🥇🥇",
            "People like you deserve a special place in hell..... 😂 😂 😂. It was a joke but this is the evilest idea ever.",
            "You are fucking weird.",
            "Got your point",
            "Once you try anything new together there’s no going back. I’ve seen couples breakup over hobbies they tried together and one got way into it more than the other. With sex,  it’s just more volatile. \n\nIf you aren’t interested, say so and draw a hard line. If he continues to push, show him the door…",
            "Agreed",
            "If he wants to leave because you didn’t want a threesome then that clearly shows how he sees you and your relationship. Let the trash take itself out. He doesn’t respect your boundaries and you wouldn’t want to be with someone who does that to you. You’re not the first person to be love with someone who doesn’t respect their boundaries. Yea it’ll be tough but you’ll live and find someone else who actually respects you.",
            "Ok and?\n\nIf he wants to leave he has that right…that’s life. Relationships end and we’ve all been attached, you won’t lose a leg. Marriages after 15 years end and ppl move on, there’s nothing unique here. Breakups do hurt but that’s life.\n\nYou can say you don’t want a threesome, absolutely valid\n\nIf it’s something he’s determined to check off (and it’s probably not something that would happen just the once) then let him go and be free and do that if that’s what he’s determined to do. I wouldn’t wanna hold someone back if they were determined to do something I had zero interest in participating in. I’d hope they’d decide our thing was more special but I’d never want someone to stay and moan about it and/or feel like they’re missing out…go do your thing. There’s others out there for us both",
            "Even if you did have a 3some he still might leave",
            "If this is the case,  you really need to be prepared well because if you go in it’s not one time case and may repeat because he likes it and you like him. This has anything to do with dear life?",
            "Yes, if he doesn’t respect your sexual boundaries he doesn’t respect you period.",
            "My instincts said the same, but the history is kinda stopping me",
            ">I will not betray myself to keep someone who doesn't respect me or doesn't consider my boundaries. After all even though he helped me at one point, I've been with myself all along,\n\nSo glad to see this!\n\nStrength!",
            "He was lmao",
            "Exactly! Lol",
            "Yes but is he interested in trying new things for him? You? Or as a couple?\n\nWe are all different with different boundaries and honestly I will be in the minority here but I have never had the Urge for or the want for a 3sum and if my wife suggested it to me I would be looking for signs of cheating.",
            "Surprise, surprise!",
            "He just wants to fuck another girl and not be called out on cheating.",
            "You should never feel bad for having feelings, ever. And any SO worth their salt should be doing everything they can to keep your away from that state of mind.",
            "OP isn't interested in a threesome, no matter what the permutation. This is merely a suggestion to help OP put the boyfriend in her shoes, and think about it from an alternate perspective as to why she might want to decline.\n\nFrankly, it sounds like the boyfriend views her as a sex object first, rather than a relationship partner. I think this relationship is doomed, based on the way the boyfriend is apparently treating her. Her post here is a final sanity check to see if she is correct to feel uncomfortable about this topic and request.",
            "It is definitely not, but I feel uncomfortable about and looking for advice, i do not intend on hurting your beliefs",
            "If the boyfriend can't take it, he shouldn't dish it out.\n\nAnd neither should you.",
            "I will keep that in mind, thank you",
            "And you are still with him?? Girl leave",
            "He wants to try it as a couple, I also feel like I'd be cheated on, I gave him a lot of control over me as he asked and I wanted loyalty in return now he's not sticking to his part of the relationship",
            "Seriously.. there are plenty of guys wanting to see their gf f****ed by other guys. I really don‘t know why though.",
            "Thank you so much for understanding and having my back🫂",
            "We all understand OP doesn’t want a threesome. She’s not saying no to it because we’re all assuming he wants FFM. What if she tells him about the very detailed and specific scenario that you thought of and he says Yes. I know I’d say yes. Sounds like a great time. What should she do then? It’s not an alternative perspective, it’s the exact same perspective and she doesn’t want anything to do with any of it. \n\nFrankly, the way you and many others made the same suggestion that the other person has to be a man so he’ll say no comes across as homophobic",
            "Oh no! My comment was in response to the comment above mine. It was not directed at you. You are allowed to feel the way you do we all have our boundaries. I didn’t take offense to anything you said.",
            "I barely get \"some\" from my wife, not going to ask her to double it. Double of zero is zero.\n\n![gif](giphy|MWs5EeZ3K10JoLVVnc)",
            "I can guarantee you that I am not the boyfriend.",
            "To add, if he genuinely did care, he would put your emotions and desires above his own. \n\nUnfortunately if he is trying to force you into a three-way, he doesn't have his priorities right for a healthy relationship.",
            "ask him for a threesome with another man instead then see the look in his face.",
            "Well he then apologised saying \"I wouldn't feel okay with it but if you want to be touches by other guys i wouldn't take it out of you\"",
            "Girl… trust your instincts. You know what you have to do, I know it’s hard, but you want your partner to respect and have loyalty to you.",
            "No I think he wants it for himself and is trying to guilt trip you into it by saying to try it as a couple. \n\nCouples do things when both people in the couple agree. If one person doesn’t agree then it just happen doesn’t matter what ever reason because a relationship is based on mutual love and respect and if one person is pushing to do something they don’t want to do it doesn’t work!.\n\nYour BF has to be made to understand you are 100% monogamous and you will not or ever share a partner it’s that simple. That’s exactly how I feel and i phrase it as I am greedy and I would not want to share my partner with anyone no matter the reason.\nObviously he wants it with you because he already has you in his life so just needs one other woman. Which is easier than a single guy trying to find two women down for a 3sum.",
            "I'm a guy, and I'm turned on by the idea of double penetration.  I would definitely be down to have a MFM threesome.  I don't have a girlfriend though, and I'm much less interested with the F missing. :)"
        ]
    },
    "Napping a date?": {
        "title": "Napping a date?",
        "score": 33,
        "url": "https://www.reddit.com/r/dating/comments/1dlqfcl/napping_a_date/",
        "content": "Ive been on 2 dates with this guy and he knows im not ready for anything intimate like sex or kissing ect but he is asking to nap together for the third date?",
        "num_comments": 51,
        "comments": [
            "Welcome to /r/dating. Please make sure you read our [rules here](https://new.reddit.com/r/dating/about/rules) and remember to:\n\n* Be polite and respect each other. Do not call people names or engage in slapfights.\n* All advice given must be good, ethical advice.\n* [Do not post hateful or harmful rhetoric - you will be banned](https://www.reddit.com/r/dating/wiki/rules)\n* Follow reddit rules. Do not post content that promotes hate based on identity or vulnerability. Do not bully or harass other users.\n\nIf you have any questions, please [send the mods a message](https://www.reddit.com/message/compose/?to=/r/dating).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating) if you have any questions or concerns.*",
            "He's either 85 or he's making moves on you.",
            "I don't care what his intentions are but nap dates really should be normalized.",
            "I’ve had a similar situation before, she wasn’t ready for anything sexual and I respect that boundary. We had 2 dates already, now I didn’t ask her to a nap date she asked me. We both had work at similar times that day so I said I’m gonna take a nap before work and she responded “Nap Date?” I said “sure as long as you take your shoes off at the door” (Inside Joke)\nAnyway we napped I drove her to work and picked her up for an actual date.",
            "Ok let me counterpoint this all. I love to be close and intimate and snug- with people I’m into; but also friends sometimes. All of that is ok, for the record. \n\nThere are times where this is all I want, but if I’m really into you, a “nap” or “night over” means getting close enough to be aroused— there is no pretext but if that’s what happens, thank the stars. Maybe we both are and it advances…\n\nAs with every thing on reddit, just ask. Worst thing that could happen is they say “no…”",
            "lol this one genuinely made me laugh",
            "this girl that I’ve been texting for a week, we met at a party, did some xtc, raved the whole night, got back home in the morning, cuddled and napped, didn’t have sex, just probably the best nap in my life.",
            "Either really weird or really wholesome no in between",
            "woah there, what a casanova.\n\nno kissing, and then napping - nah, he doesn't just want a nap.",
            "A nap date is an amazing date idea! But only once you've established some sort of relationship with them.\n\n\nMaybe suggest something that doesn't involve being inside?\nOr just drop him and onto the next ! ✨",
            "Girl .. nahh .",
            "I’ve definitely napped with someone as a date. I was like “I wanna hang out but I’m tired” and they said “why don’t we just take a nap together”",
            "It's a trap. You're going to have something hard hitting your back and he's going to be like c'mon, please.",
            "Just curious but how old are you and him?",
            "girl that’s weird as hell 😭\n\ntell that man immediately that napping is NOT something people do in third dates",
            "That's just his way of trying to get you to do what you're not ready to do, so if he wants to \"nap\" then tell him to go home and GTS.",
            "It’s probably not but it should be. I think people underestimate how amazing naps are. Imagine getting to do that with someone you like.\n\nEdit: but not a third date thing that’s like we are married and have kids already type of date 🤣",
            "Could go 2 ways: he enjoys cuddling and it's been a while for him.\nOr he's trying to fuck",
            "Sounds like he just wants to snuggle with you. Laying close to each other and sinking into each other’s arms and napping for maybe an hour or so. Sounds very romantic.",
            "Tell him you have trouble napping because you are behind on some bills and can't feel like you can rest until they are paid. If he cares he will ask you to hand him the bills to put your mind at ease so you can take a nap but make sure the bills are paid first.",
            "I suspect that he's expecting that nap to become what many of the naps I had with my now-wife when we were dating: a make out. It's possible I'm wrong, and he just wants a nap, but I suspect he's hoping the cuddling will turn into kissing, or that he'll at least be able to put a hand on your butt as he holds you.",
            "He's going to dry hump you and try to hold your boobs while he is big spoon.",
            "I would not. Who knows what kind of shenanigans he might try while you are sleeping. Or maybe offer to go nap at a public library. At least there are other people around, he might be dissuaded from trying anything.",
            "No.",
            "WTF?! RUN! BURN YOUR PHONE",
            "Nap at your respective homes while on the phone lol",
            "my ex bf wanted to nap all the time but there genuinely were no other intentions he's just tired ALL the time cuz his sleep schedule is fucked",
            "A nap is more like for date seven or eight.",
            "Nap dates are pretty good idea tbh",
            "I’m 36 and a nap sounds awesome. How soft is the bed?",
            "Hanging out and falling asleep naturally and taking a nap together = cute and sweet as hell\n\nPlanning a date in which someone comes over and takes a nap and that's the date = it's a trap",
            "i think if the possibility of him making moved on you this soon makes you uncomfortable then suggests something else\n\nto me “lets nap together” is the same as “netflix and chill” ahaha. a roundabout way to get you to come over and have sex without actually saying it\n\nthere is a small chance hes being genuine, but again dont go and potentially put yourself in a dangerous situation",
            "Sounds like a \"Nasty Nap\".  They're taken naked or with few clothes.  The intent is to sleep, but somehow, somebody snuggles a bit too close.  They're awesome, but you're not ready yet, so politely decline the idea.",
            "Nap = spoon??",
            "You trust him enough that he will respect your boundaries? If no, then do not engage in napping or other near intimate activities.",
            "It’s pretty basic to assume that someone’s just trying to progress this along… I mean sure, that could be it. The fact is that napping together is an intimate thing regardless of sex and some guys are just craving a little intimacy.",
            "A *nap date* is where you go round one another's house to snuggle and cuddle in bed, maybe watch a movie, maybe binge a series",
            "If you don't wanna nap tell him that you don't want to. Don't rush things, take your time especially if you told him you wanna take things slow.",
            "Starts with something innocent like \"just a nap\" then he says aw we should cuddle I like cuddling... then... well we all know where it's progressing to, I ain't gonna get more graphic. It's just a trap tbh and people that don't respect boundaries are not good news.",
            "Hard pass, move on.",
            "He's trying to get you in to bed so he can have sex with you.",
            "They should!",
            "No and thennnnn!",
            "And thennnn.?",
            "Hah worst thing that could happen is they ghost you and then make a Reddit post questioning everything.",
            "Going by the naps, I'd day about 4😆",
            "That's what I'd hope.",
            "Nap Trap, Paddy Wack. .",
            "Why does cuddling then being intimate have to be a trap? I’d prefer that over modern dating conventions…",
            "And then and then and then and then and then and then and then and then and then and then and then and then and then and then.",
            "Tbh I am kind of confused like what age guy would even say he lets take a nap. \n\nAlso if you shared something with him to like express you are not ready for anything intimate and he understands then its possible its just a nap but the situation just feels sus to me"
        ]
    },
    "Why are gfs pissed off when their partners masturbate?": {
        "title": "Why are gfs pissed off when their partners masturbate?",
        "score": 262,
        "url": "https://www.reddit.com/r/dating/comments/1dld0fp/why_are_gfs_pissed_off_when_their_partners/",
        "content": "Isn't it the most human thing to do. Everyone does it since long before people met their partners, including women.So why is it a big deal when guys masturbate in a relationship. The quantity of sx doesn't decrease, the quality enhances if at all. Porn is an issue, it involves comparison and expectations but why can't you just maaturbate without porn? There are n number of reasons why masturbation is required.",
        "num_comments": 248,
        "comments": [
            "Welcome to /r/dating. Please make sure you read our [rules here](https://new.reddit.com/r/dating/about/rules) and remember to:\n\n* Be polite and respect each other. Do not call people names or engage in slapfights.\n* All advice given must be good, ethical advice.\n* [Do not post hateful or harmful rhetoric - you will be banned](https://www.reddit.com/r/dating/wiki/rules)\n* Follow reddit rules. Do not post content that promotes hate based on identity or vulnerability. Do not bully or harass other users.\n\nIf you have any questions, please [send the mods a message](https://www.reddit.com/message/compose/?to=/r/dating).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating) if you have any questions or concerns.*",
            "It’s really one of two options: \n\nIf your sex life is unhealthy and it bothers her: Then it’s because your masturbation is likely part of the reason your sex life is unhealthy.\n\nIf your sex life is healthy and it bothers her: she’s likely insecure and is struggling with the idea of you potentially thinking of other women, even if you aren’t acting on it\n\nEdit: terrible typo",
            "Those who have an issue with it obviously lack the hawk-tua energy.",
            "Not all girlfriends have an issue with it.",
            "masterbating isn’t the issue for me it’s excessive porn use when you have a partner that’s unhealthy",
            "If someone has an issue specifically with you masturbating and not other things related to that you should address that specific person.\n\nWomen in general are not pissed off with their partners masturbating.",
            "Because they want that cum for themselves, you’re hogging the goods! 🤣",
            "A lot of the women who are upset are saying that it does actually affect the frequency and quality of the sex between the two of them.",
            "sidenote: there are a lot of men also who have an issue with their woman masturbating, and it often sounds like a control issue, pretty messed up in my personal opinion.\n\nI mean, if your partner isn't pleasing you, or is withholding sex, or weaponizing it, etc etc, That's an issue. But self-pleasuring, well, it's YOURS, you can play with it ffs :)",
            "Literally no one has a problem with this unless you are ignoring or turning down your partner in favour of solo adventures.",
            "Quality and quantity of sex decreases when my bf masturbates. Idk what you’re talking about dude",
            "It depends on what he's masturbating to and why?\n\nIf it's porn or other naked girls, and it's an addiction I'd get pissed off too, as that would make me feel inadequate\n\nIf he's masturabting more than us having sex, then I'd wonder what we are lacking sexually/emotionally\n\nSome may take it as, why go solo when we can have sex together\nSome may take it as the man doesn't feel satisfied with them\nSome girlfriends don't have a problem with it at all",
            "Because they’re trying to sleep and you’re shaking the bed a little",
            "My gf has bought me jerk off toys for when she’s not there.  Smart gf’s dont hate their guys masturbating.  Means they’re ALONE. 😅",
            "I don’t think masturbating is the issue. Just having your partner jerk off to other women is kind of icky?",
            "Honestly man, read spicy romance. It can be just as alluring, and women tend to prefer that kind of tension so it'll give you an idea of how to act. Beyond that, you're not actually looking at another woman, it's fictional. The majority of the women i've been with don't have a problem with the act, they have a problem with the reason",
            "Only some do, and it seems more from personal insecurity than anything else. It's definitely not exclusive to women, and people who have a problem with their partner masturbating usually have attachment issues that make them jealous, perceiving masturbation to mean that their partner would rather pleasure themselves than be with them. They want to be the one in charge of your sexual pleasure because then they have control over someone they're attached to, and they feel invalidated if they don't.",
            "Not my lady she masturbates more than me and it gets us hype for the real thing. After dinner I’ll get a “I just fucked myself in the shower” and it makes my dick hop. \nI’d say for the girls that do it’s insecurity surrounding porn or the idea that they can’t get him off as well as he can himself which is just silly. 2 totally different things.",
            "Why would you take care of business yourself, when you can have sex?",
            "Who has an issue with it? I feel like this is a tiny minority. \n\nI have an issue with porn but no issue at all with him masturbating. I’d rather he told me about it but that’s just because it’s a turn on not because he ‘needs’ to tell me.\n\nEdit: I WOULD care if it impacted our relationship or sex life though. If you’re masturbating INSTEAD of having sex with me, then I’ll have a problem.",
            "Not everyone does. I had an issue with it when my partner stopped having sex with me and rather masturbated. I was always the one who initiated and he didnt put in the slightest bit of effort. Then I had a problem.",
            "It becomes a problem when someone prefers masturbating more than having sex with their partner. Otherwise I see no reason for being pissed off for such a thing.",
            "i mean if he preferred to jerk himself off than to have me do it or suck it I’d be a little hurt to be honest 😭\n\nbut if I am not around or don’t want to then it wouldn’t bother me as long as he’s not watching porn",
            "Cum isn't going in them & going to waste ig idk 🤷‍♂️🤷‍♂️",
            "Cuz mostly they are masturbating to porn and it's an issue for alot of women",
            "I had an ex who had a problem with me using toys, despite the fact that we were very very long distance at the time.  \n\nMy current boyfriend doesn't have a problem with me masturbating or watching porn, and I don't have a problem with him doing either of those things, either.  We both have really high sex drives and currently don't live together, so can't really take care of eachother in that regard at the moment every time we're horny.  🤷‍♀️ We're both secure enough that what the other is doing to \"help themselves\" (as he calls it) doesn't bother us",
            "I'm single but when I'm in a relationship I don't care if my partner masturbates as long as he isn't watching porn and as long as he isn't doing it so much that it's affecting our sex life",
            "She's insecure.",
            "I don’t mind in theory but my first boyfriend was a 1 nut per day type and nothing pissed me off more than trying to get some action and hearing “I already came today” dude was also a major porn addict",
            "I get mad cause its a waisted load that im willing to take",
            "I'm guessing they feel inadequate, like the partner shouldn't ever need to take care of things themselves when they can have her",
            "I 22F never understood how someone can be upset with their partner for doing so either! My ex was the same way and would flip out when he thought I was masterbating. Like boy I’ll get myself off on your mother’s kitchen table if I’d like and you wouldn’t be able to do a damn thing about it lmaao. Acting like that is definitely a red flag for me!",
            "I don’t know a single woman who has an issue with it. Literally no one.",
            "They tend to get pissed off when I masturbate with their friends.",
            "I was with you until “masturbation is required” lol \n\nIt’s not actually required to live. \n\nBut yeah, no one is annoyed at masturbation (separate from porn) unless it’s to the level of some compulsive disorder.",
            "Who’s actually comparing their partner to a pornstar? Are you boyfriend’s slow?",
            "My partner and I are pretty open about it and both do it.\n\nI have gotten annoyed occasionally when he helps himself, but only when I feel like we haven't had sex recent enough (and that's based on our own personal libidos). I do know some people use it as a stress release or because they just want that quick pick-me-up, so my frustration is short lived and life goes on.",
            "Well how much u doing it and can you still please her",
            "I only have an issue if it affects the amount of booty I am getting. Then it’s a problem",
            "Mines not",
            "I read this too quick and thought it said parents instead of partners lol",
            "Because their partners could be bleeping them instead.",
            "I only care when it gets in the way of our intimacy",
            "They're prude control freaks",
            "we’re not",
            "They want to own your joy. They want to be the toll booth to your happiness.",
            "Because they have internalised they idea that a mans sexuality is his partners responsibility.",
            "I don't feel like masturbating is the issue, more just the time and place? I'm sure some women are weirder about it, but if I'm laying in bed not doing anything and ready for action why are you hiding away in the bathroom jerkin it on your phone?",
            "Cause it’s a sin and god will strike you with a bolt of lightning 🥰🥰\n\n-Sandra",
            "I mean, it's kinda nice to masturbate with your gf sometimes also, just sayin'.....",
            "Im good with it. Hell, I go off by myself too. Sometimes I just want the quick orgasm without the help of the man you know? Just me myself and I. I used to get pissed off at my ex who watched porn but that was just me projecting my insecurities bcus I didnt look like the girls. I feel much more secured in myself now that I’m nearing 30.",
            "Nah man\nNot everybody does it\nFalse assumption",
            "Not all girlfriends have an issue with this. I don’t, but have heard girls complain about feeling insecure feeling  they weren’t good enough or satisfying him enough as to why he still needs to masturbate.",
            "Coming from a man, masturbation isn't a requirement. That's the wrong way to frame it. Frame masturbation without porn in addition to sex as a sign of your own virility and explain to your gf that an excess of libido indicates health in men",
            "I think it’s a weird control issue. Like wtf?? How do you feel like I cheated on you with MY body😅 gtfoh. I can’t do controlling.",
            "Masturbation is fine to me, porn isn’t tho. \n\nI don’t understand these types of women either. Masturbation is natural and everyone does it for the most part",
            "I couldn't tell you. Never as a girlfriend or a wife have I ever been upset about a man jerking it or watching porn. I do the same thing myself, and I like watching my man do it.",
            "I would want to join in the fun unless he likes it alone then have your privacy, it’s completely normal we all do it, unless she is a prude and she doesn’t flick her bean 😂",
            "I personally want my partner to have a healthy relationship with masturbation. I think it helps with understanding their bodies and exploring sexual fantasies so that things can then be better with me.",
            "Women before you marry them want to be everything to you, even the center of your universe.  By doing this they feel inadequate when the men fantasize over other women",
            "It’s when they rather do it to women that look nothing like you and then make it sound like a prize because you have sex maybe twice a week. Oh and doing it while I’m there 😂",
            "If I'm not around, go to town but don't let me find out bc it makes me feel I missed out, that's my job fucker. If I'm around try to get me in bed, if I'm not into it then, go to town. Basically, it's like watching the show you watch together by yourself, like at least invite me🤣",
            "I give it extremely sexy plus add alittle fun and do it both at the same time",
            "Insecurity.",
            "Dude I do NOT know. It must be insecurity, the same reason why people get jealous. Me personally? I would never.",
            "Lol.... I'm the gf that will ask to watch lol",
            "I think women think it means your taking attention away from them or something",
            "Some want to control that aspect of his pleasure. \n\nSome don’t want thoughts / fantasies of exes or sex workers entering the equation where it comes to his pleasure. \n\nSome may just want him to save it for her.",
            "As a gf, don't do it while I'm in the room. Otherwise do your thing.",
            "Haha because they think they cant handle their needs so they r not enough nd not satisfying",
            "Because Narcissism?",
            "this goes other way around too.. i had an ex who would give me the silent treatment for hours if i did it and he would constantly gaslight me into “i know you did it, i just know” scary as shit lmaoo ( we were long distance and only seen eachother few times a year)",
            "I believe they find it to be a way of their boyfriends saying that they aren't satisfactory for them enough. A lot would feel that way about their significant other as much as vice versa. Though no matey which way,  it would be significantly petty and makes one more dishonest with one or the other. It's natural for someone to want to masturbate when the urge comes to them and it should be nothing to shame someone for. ",
            "Because we wonder why you aren’t doing stuff with us instead. Oh and if there is porn it’s basically like cheating",
            "It never bothered me.  I did it too.  Lol",
            "This is my personal opinion looking at all the stories I have read about it, I am not too sure about why they don’t want their partner watching porn, either insecurities, religion etc but it seems in most cases the partner is lying about it and that’s why they are vocal about it",
            "My gf doesn’t mind it. She does it too 🤷🏽‍♂️",
            "I don’t mind if it’s without porn. I don’t trust that it is tho, so many ppl have lost their imaginations. 😔",
            "Life preservation.  Man and woman have sex for different reasons",
            "I think that emotion varies from gf to gf. I’ve had many who enjoyed watching (and doing their own fapping while doing so)",
            "It might be because they don’t want their man thinking of another woman?",
            "it's fear, insecurity and terror of losing control over their partner. Because if you can't get what you need physically by yourself, what would you need your partner for? The partners who care about this are all shitty people that need to feel in control at all times. Because sex and the physical aspect is all they have to offer. Without it, they bring nothing else to the table and so if their partner can get those needs met elsewhere, they fear that their partner will leave them. Which they should, because again all partners that display this behaviour are bad people.",
            "The only and ever time I got pissed off was when we were on vacation and we hadn’t done it in a while and he was in the shower jerking off. Kinda solidified that we were at the end. Other than that in other relationships could give a shit. I’m doing it too.",
            "😑odvii knowledge shouldn't need explaining, but it means ~to them~ you find them unattractive and rather your hand over them.\n\nThey want you to sweep them off there feet and do things with them, why are you touching yourself if you have someone there to do it? Lol \n\nLike you said everyone has needs, some rather other itch it, then themselfs and it 100% dose effect s@x life.\n\nYour 100% less likely to go at it like an ape out of a cage who been tied up with hormones pills for a few days if your lowering you own arousal levels.\n\nGo a week without touching and do something with them and i bet you will put a helluva lot more passion behind it then if you were doing that daily.",
            "My gf doesn’t care. Granted she’s on a trip right now but we just masturbated together. She’s also been filming me porn to watch. When she’s in town she wears me out to the point where I wouldn’t want to but she wouldn’t care if I did. \n\nMy guess is the specific girls with the problems feel like they aren’t enough for the guy so he has to satisfy himself. I know that’s how it works for a lot of girls who don’t get enough out of sex so they probably assume the opposite is true as well.",
            "I had gf like that 27 years ago we did not last two months dating!",
            "i really think it depends on how old you are and how mature you are. cause when i was 18 and my boyfriend did that i would think it was cause i didn’t satisfy him, but now that i’m older.. it can be hot! but i don’t mind it, and i don’t think MOST gfs do!",
            "I honestly couldn’t care less. It’s my partners body, not mine.",
            "It’s not the masturbating- it’s the excessive porn use. Getting off to someone other than my partner. It’s lusting over other women. It’s a quick dopamine hit. And it fries your dopamine receptors. Touch yourself all you want. But porn is a no",
            "I'd say if you are meeting up with your girlfriend and do it before hand, it may be a problem. But if you don't see each other often, why not\nEdit: i'm proud of that before hand line",
            "Too much jerking off can and does affect his desire, libido, quality of the sex in the bedroom and the amount of effort he puts into sex with a partner. Sex is better when he saves it up for his partner.",
            "Probably because they don't want them to think about anyone else but them and on the LEWD and PERVERTED side of things, they just don't want all that waste baby making material literally going down the drain and/or their partner getting tired before the MAIN EVENT!",
            "If y’all can’t understand why SOME people would feel some typa way especially in certain circumstances? Your ignorant asf if you just can’t think of one reason why it might make a partner feel off ? Do what you do but you don’t have to down other people with their own opinions. If you have a problem with it just leave them !😭",
            "Masturbation is fine but why are so many ppl SO unsatisfied all tha time . If you have a parter and y’all are sexually happy why is it a problem to not do certain things . Especially pertaining to porn . Just find someone more like you and let the other person find someone more like them",
            "I genuinely have no idea as a woman why people are mad about their partners masturbating.\nSome guys have a hard time getting it up if they are fap addicted though, that's a proble.m",
            "Mine isn’t I tell her when I’m going to go masturbate",
            "Usually, cause they feel like they're not enough, so you go and masturbate instead of communicating with them. That or they're just insecure about themselves",
            "If you’re not hitting it right to being with in the first place, you shouldn’t be diddling yourself. That’s how I feel about my relationship with my husband- LOL.",
            "It’s not always appropriate to jerk off at certain times with kids in the house. \n\nAs long as the man in question isn’t traumatizing anyone, idgaf what he does.",
            "Because i only want him to cum with me but im not really gonna get mad about it, its normal",
            "Here it’s the opposite!My gf is the one who masturbates all the time (and watch weird porn movies).The funny thing is,when she knows I masturbate, she get pissed.But she seem to be addicted.She spends more than one hour mostly to find the right porn.I seriously think about to stop to go to her and just start watching porn movies too.Because it seems that she doesn’t care.So,why should I care.I think porn movies are bad for the relationship.I watch porn sometimes,but super seldom.Anyways,if someone prefers to masturbate in relationship,then there must be something wrong",
            "Masturbation weakens men. If a man can withhold himself from loathing in self serving pleasure and use that drive in the gym, his job, or building a family a lot more can get done. Plus, if I’m always available for sex endless times a day and can please him to his fullest extent - why is there a need to get off to strangers online. Porn is an addiction and it kills the mind and ruins having actual sex. A powerful man restrains from masturbation and deserves it all. He also has more potent sperm to reproduce. All things women desire. That discipline in itself will create a really submissive woman to him who pleases him daily. What’s worth more? Porn and whacking off alone and being a fucking loner or a woman to please him endlessly, drive and determination, and a fuck ton of healthy strong sperm ready to make babies. Call me greedy but I would want that all to myself. Nothing is more sexy than that.",
            "I don't believe this is a common attitude that women have. A lot have issues with porn use, but usually not masturbation itself.\n\nI've found most women who are anti-masturbation are from very repressed religious upbringing with a very unhealthy view of sex that is heavily skewed by the religious upbringing. None of the women I've dated have even cared about porn either. \n\nBut ya, I'd say anyone who is against masturbation is a giant red flag.",
            "I feel like it's a mismatch of libidos and women always want to control their man. Women hate when men do this or watch pr0n because the women are jealous that they themselves cannot live up to the expectations of women in those videos. So rather than admit that they're wrong, they'll just make their men feel miserable to the point where the man breaks up with them. And this is what happens in a world where women can get great sex with a hot guy for free within hours of setting up a dating profile.",
            "I would say that it might stem for an insecurity in the relationship or in themselves and it's a good opportunity to open up the lines of communication and offer reassurance. If it continues to be an issue that cant be resolved, than it's likely an incompatible match. ",
            "I just told to my man today I got me some nice toys since he's addicted to porn and masturbation \nAnd we wasn't in good terms since I found out \nOur sx isn't that bad but I can't go whole week without it \nAnd guess what found out some toys are really better than actual thing 🤣\nSo we are equal now lol",
            "They want to to control men",
            "Maybe they just want to be a masterpiece by the time you’re done painting her. Or maybe that’s just me lmao",
            "Me and my wife just got into pretty big tiff you might say.  She through that in the mix at one point.  But the fight was about me having to wait until things were right for when she wanted it . Ends with alot of disappointment, feelings of rejection........ and everything else. But after keeping an extra eye and pay attention for last few months. I'm finding out that she has been looking at either porn soft porn or something in the nature and rubbing one out almost daily.  Now if I did it daily I have no problem having sex with her the same day. Well I brought it to her attention and she denies everything  I just have a drug fueled brain . And it's all me . Even when shown video of her doing it under a blanket says it wasn't happening and it all in my head. And she wasn't doing anything.  I told her I was done and leaving because our sexless marriage has been a lie and if she is this horny all the time that must be me that she didn't want to have sex with and I'm our. Longer story shorter she says we'll have sex at least 3 times a week as per 1 per 8-10 days. And will be all about it now . We'll see but she still won't admit even with proof right in front. I only showed her 2 videos of probably 40. She won't entertain them but promises it will be lots better. I guess time will tell if not I'm done ,( we been together 20 yrs)",
            "masturbation reduces sperm quality and regular masturbation increases libido over time causing libido mismatch and lower sperm quality makes getting pregnant hard\n\nand here you are saying its necessary for human beings thats way to one sided of an argument and definetly not rational\n\nits the same as cheating because women want to be the only thing in a mans life just like a man wants to be the only thing in a womans life so for a woman to see a man sexually relieving himself to sonething other than herself there is a slight feeling of betrayal\n\nalso nit every person masturabates some actually get along without it and only learn about pleasure AFTER sex",
            "why would you feel the need to masturbate while I am there? Unless ofcourse i am miles away ,that is understandable. Masturbating is addictive and you might end up losing interest in sex coz your mind is focused in your hand and dick.",
            "My woman doesn't have an issue with it. She went to Florida with her GFs and she asked me if I masturbated when she got back. I told her of course, you weren't here to have the real thing... She also asked if I watched porn and what kind... She smiled, opened up that kind of porn on her phone, and started stroking me...",
            "I always thought it was so weird and almost uncomfortable whenever my ex (f25) did right next to me in bed after sex sometimes. but if she caught me hard or with morning wood then we were in a fight because she thinks my brain is a porn browser.",
            "Cause they think they’re the ONLY one who can make you hard ☺️",
            "\"sex kid\"\n\nFBI, um, yeah, I'd like to report a crime.",
            "the sex life being unhealthy one is real- never had a problem w a partner masturbating until my recent bf. our sex life and the amount we had sex slowly declined throughout the relationship but then i found out that when I was gone, he would masturbate pretty much ery day… huh. like u have the real deal right here! especially if they’re watching porn, real gut punch right there",
            "Or maybe if your sex life is unhealthy, that could be the reason he's masturbating.  She not allowing sex, got to get his jollies off somehow.",
            "This",
            "Hawk-tua is CRAZYYYYY 😭",
            "Nah she finna go viral real soon 🤣🤣🤣",
            "If this isn’t the top comment by the end of this thread so help me god",
            "Or they want to be doing the hawk tua",
            "This is peak internet 😂",
            "Hawk-tua?",
            "I literally just saw that clip an hour ago. Tooo funny. Lol",
            "This, because I don't. Hell, I encourage it especially if I'm not around.",
            "It only seems that way because their the only ones (or their boyfriends) posting about it online on places like Reddit. My guess is probably because they can’t weaponize sex, if their partner is stimulating themselves.",
            "Exactly",
            "What would u consider as excessive porn usage? How many times a week?",
            "If that partner isn’t willing to deal with the problem then porn is the only solution",
            "That would be me",
            "There is scientific data that says women need to be nutted in at least once a week for their mental health.  What, are you some kind of monster to deny them their basic health needs?",
            "I've had women tell me this, and I reply, okay, can you keep up ?",
            "Lol. It's ewww! Wt the use though?.",
            "It can. But it doesn't have to.\n\nIf you mbat several times a day then yeah, it's gonna affect performance.\n\nBut if it's once in a while, when she's away, or even when she's around but you do it together, then IMO no problem.",
            "It most certainly does. Been there.",
            "I'd love to watch if she did.",
            "Not sure what man (or woman for that matter) in his right mind would ever have an issue with it.\nFuck, I always encourage my partners to do it when I'm not around and most definitely when I am around.\nLove to watch (well watch each other).",
            "Porn is one thing, masturbation is another. U can masturbate to porn but u can also masturbate by urself. I’m fine with masturbating but not porn in a relationship",
            "isnt that the same thing?",
            "This is the most accurate response. Idc if they masterbate, but sometimes I want the attention. Like why not both enjoy each other instead of you alone. I feel left out. Not always but if I’m there and you go to the bathroom alone instead of doing the activity together it sucks.",
            "narcissists",
            "Man my gf is the same way. I'll make her cum, and stop to catch my breath, cause we go at it hard and within a couple minutes she's got her toy on her, and then I'm ready. I usually help her with her toy! It's great!",
            "Less effort",
            "You'd suck it? Are you single? 😂",
            "If it's a issue with porn why don't they film videos for him",
            "I have a friend that does. She told me if her boyfriend ever watched porn she‘d reconsider the relationship. It’s a requirement for her.\nI didn’t say anything to that, if my ex would’ve been like that I‘m sure we wouldn’t have lasted as long as we have lol.",
            "I've seen a few women say this, and it's such a weird stance to take.",
            "My ex",
            "why?",
            "Not required but for many life is pretty unpleasant without it, especially if they're not having frequent sex.",
            "And in my defense lol, it’s done even the next morning after we just had sex. To the point where it consumes the person. I think porn can be a great healthy bonding agent in a relationship, but not when you choose it and women and/or men online over your partner you live with",
            "Beside this comment being cringy for other reasons, masturbation does not equal porn. I know many men and woman that masturbate without porn, including myself most of the time. I'm a woman and once in a while I watch porn, there is really any kind you like.",
            "I'll take being a fucking loner any day over being with a submissive woman who wants my sperm to make babies.",
            "If she was doing it right after sex it’s because you did not make her cum.",
            "they should be???",
            "lmfao corrected the typo",
            "Creating typos without a license.....get a rope.",
            "That’s totally understandable. It’s really one of those things where normally it shouldn’t be a problem but if you’re not having sex and he’s masturbating then it’s like come on man…",
            "Also very true",
            "“Allowing”?  I don’t want someone who all allows me to to have sex. I want someone who eagerly and actively participates about as much as I do.  Why settle for less?",
            "“Hey babe whacha wanna do?”\n\n“How about hulu and Hawktua?” 😂🤣",
            "Hasn't she already though?",
            "sound one makes when spitting [https://www.tiktok.com/@dmarloww/video/7379047990247296287?is\\_from\\_webapp=1&sender\\_device=pc](https://www.tiktok.com/@dmarloww/video/7379047990247296287?is_from_webapp=1&sender_device=pc)",
            "I had a partner who tried withholding sex not realize I could go just as long as she could.",
            "honestly porn is said to be an addiction if used to much i’d say excessive is like using porn even when you aren’t home or when u don’t need to let’s say u have a partner u shouldn’t be watching porn even after having sex with them u shouldn’t be using porn at work or in public place that’s even worse of a sign when someone is a porn addict. i’d say twice a day is okay if you are single it’s just a dirty thing but most of us don’t realize because of how addicting it is i can’t give u a specific number it would depend on how it’s used and why",
            "if u know anything about porn addicts you’d know they masterbate at work & many other places even when they’ve had sex it’s an addiction",
            "Lmao, source.",
            "🤣🤣🤣 That explains my issues hahaha",
            "My ex couldn’t keep up with me. When I’m in love, forget it. I did it in a parking lot, in the bed of my truck with people walking around. Yeah, I’m fucked up. I used to wear dresses all the time for easy access. I’m actually surprised I was never arrested for the places I have felt the need",
            "Sorry, I didn’t really understand your question. 😅 either way I’m gonna say some random shit 😂. Every woman and every guy, and every relationship is different. Although many may align in certain ideas and desires. If a woman doesn’t want their man masturbating, I personally believe that out of all the soft and hard limits that someone could have, that’s kinda an odd one. However, it’s the responsibility of the two in the relationship to figure out the dynamics and ways something like that can work for them. This aim is so both of them are satisfied, and agreeable to the chosen solution of this *friction*😉 that is causing issues between them. \n\nEvery person has the right to their autonomy, and every person has a right to feel hurt, frustrated, angry, all the feelings. And every person has the right to desire the kind of life they wish to live (without their SO masturbating?👀). But a relationship is a partner dance, and in order for it to be a graceful, and beautiful one, they need to give and take, and agree on the way they decide to move together. Typically, A man leads, but a woman shines. This means a man must be certain in the choices he makes, but those choices also must be reasonable and achievable for the woman he’s dancing with to be able to gracefully demonstrate her mastery over the domain the move allows her. (Same goes for her choices and his response to them, don’t be a dick.) If they cannot agree, or they cannot share the balance of the dance-floor, then they need to find a new dance partner that works well with how they both enjoy to move. This is a metaphor for teamwork, and collaboration, and also compromise. \n\nSometimes problems and issues are tricky, sometimes it’s just little fumbles throughout the dance. Hopefully they both love and enjoy each other throughout the process of stumbling about. We all need to have leniency when the other isn’t perfectly adept at keeping a dance, every dance, at the standard which an Olympic multi-time gold-medalist may be capable of. (We all make mistakes, fuck up, or annoy our partner at our idiocy/incompetence sometimes, try not to keep your standards too high about stupid shit. 😂)We need to respect that we can be shit at dancing, maybe it’s a bad day, or maybe we’re new to the tango when we typically waltz. Either way, we need to be kind and compassionate and flexible when choosing what has true meaning to us in the ways our partners moves even if it bugs the crap out of us on occasion. It may just be a little bump in the road but could also help in our journey of growing closer and being better dancers together. \n\n💃 🧑🏻‍🦽\n\nTldr 🥔: just let the bro masturbate if he wants to, don’t backseat drive his penis 😂",
            "Lol and then there's that. Lots of us find our favorite sex doing that extremely hot lol.",
            "What if your both in bed and she wips out the clit mixer 9000 when she could have just asked for your help.",
            "It really depends what your partner's thoughts are. The lines are going to be in different places with different people, if they're even there at all",
            "TIL I attract narcissists. Cause every woman I’ve dated has taken it as a personal insult",
            "🤝",
            "I'm just saying, I'd much rather have sex with a vagina, and bust inside of it. Feels waaay better than stroking it.",
            "Even if they didn't, watching porn shouldnt be an issue. In my opinion in only becomes a problem when they choose masturbation over being with them(and they are willing and available), or if their reality of expectations becomes skewed because of it. Otherwise porn shouldn't be stigmatized, who's to say how much is unhealthy, it's going to be different from person to person, and whether they understand what is realistic and what isnt. I've seen posts of ladies who say they cried when they found their boyfriends porn history and they were not the same body type as them. That's crazy, porn is entertainment, and a sandbox fantasy. Does that also mean people in relationships can't watch movies with their celebrity crushes in them because they've thought about them naked? To them i say, bring on the Ryan Gosling movies!",
            "Well don't ask me, some ppl just don't feel like film it or take pics.\n\nI get your point tho, some girls just wouldnt do it, being insecure, scared of sharing stuff like that after break up or something.\n\nIt's a good thing to spice up your relationship but everyone are different 🤷🏻‍♀️",
            "\"The problem is my behavior but she has to fix it and it's not my responsibility \"",
            "I don’t blame her it’s icky",
            "Does it matter which type of porn, or just any porn is a deal breaker?",
            "I don’t know your ex, my guy. Maybe you’re dating the wrong women. I dunno",
            "Good question.  Maybe they get jealous of friends helping friends.",
            "Yeah why?!?",
            "Oh I know it’s very commonly enjoyed lol",
            "no we communicated well and she had usually multiple times but she was just addicted to the pleasure",
            "Should? Yes! Are? Yes! Can there be more? YES.",
            "To be fair, if you're into dark humor, it was funny as fuck.",
            "LMAOOOOO",
            "Yeah for sho, but I’m talking her name might change like the cashmeousside girl",
            "Yeah once a woman turns herself into a commodity in a relationship it's pretty much done...",
            "If she's withholding sex, which is her main commodity, then it's time to withhold paying the bills, protecting and providing. Should it go on, then it's time to look outside the door without notice.",
            "And if you know anything about toxic relationships you’ll realize gfs will say they don’t want sex or won’t have sex until marriage and a guy has needs, so unless your advocating for rape or cheating, masturbation is the only way to stop having an errection",
            "**DOES SEMEN HAVE ANTIDEPRESSANT PROPERTIES**\n\nAbstract\n\n... Not only were females who were having sex without condoms less depressed, but depressive symptoms and suicide attempts among females who used condoms were proportional to the consistency of condom use. ... These data are consistent with the possibility that semen may antagonize depressive symptoms...\n\nhttps://pubmed.ncbi.nlm.nih.gov/12049024/\n\nSpread the word.  The world NEEDS to know.",
            "Excellent!!! Go girl!!:)))",
            "As I listened to your long-winded and possibly confusing advice I was reminded of Dr. RUTH, and visions of a couple of Karen's now I'm going to masturbate and dance",
            "Oh she wouldn't have to ask.\nI'd be happy to help her with my talents AND with the clit mixer 9000. 😁\n\nThat said, I'd also be just as happy to give her space and let her have her own fun while I watch.\nA mix of everything is best.",
            "If you believe watching porn is a behavioral problem, then you completely popped off and made a valid point. Too bad it's not.",
            "Any porn. No matter what",
            "There's a whole big world out there outside of your circle",
            "It could be concerns about sexism. I was disgusted to find out that my bf had only been masturbatung with my male friends. Have you tried being more gender-inclusive?",
            "I dunno bro, this sounds very suss 😭",
            "That’s sad",
            "Oh god not behad bhabie. At least Hawk Tue is going viral for being a fantastic woman not some bratty nitwit lmao 😂",
            "Her main commodity?",
            "Ew you are vile. Some people have different boundaries & preferences. You can simply not date someone who you aren’t sexually compatible with.",
            "i get you but totally irrelevant to this topic it’s about men who masterbate & why it’s an issue to women in my case it’s an issue with porn use any women who has had this topic with me have that experience they don’t like porn use when in a serious relationship",
            "😳\n\nWell this certainly escalated.",
            "Damn. I thought you were taking the piss lol",
            "LOOOL, Spread indeed.",
            "Lmao xD I’m glad you’re having fun with it, as you should be \n\nI hope you enjoy masturbating to dr Ruth and dancing with your Karen’s 😂 be good brother! 🍻",
            "wow, I mean, I don't know her reasons, so I won't judge, but that's kinda new. \n\nidk maybe she was worried about porn addiction or something.",
            "I disagree. Nothing and no one exists outside of my direct realm of comprehension. You’re not real either, figment of my imagination.",
            "The more you answer the more weird it becomes. So continue answering please",
            "some girls are just weird. was married to this girl for 4 years had sex almost every day and never saw her vagina. she always covered it out of insecurity for some dumb reason, so shed always have her hand on it and play with it as an excuse almost to cover it up. I could make a whole post about this chick and the crazy shit she did. Wouldn't let me go down on her unless we were under the covers in the dark, shed record me during sex but keep the videos to herself. shit goes on.",
            "Yes her main commodity. Why else is she withholding sex and not something else? Why is it often the case with women who hold some kind of grudge or resentment towards their partner, or they want them to do something that they withhold exactly that thing. Because of the list that men need the most in a partner, sex comes first and all the rest comes next.\n\nSo basically she's not doing her duty and the man should not be obligated to fulfill his duty in return then. A man's main commodity in a relationship is the things she expects automatically from him, aka his duty, his role, Regular sex isn't number 1 for women., however protecting, providing and catering to her emotions are.",
            "No one is gonna be OK with no sex and no masturbation.  Not a single guy on earth.  You will only find people willing to lie about it.  Congrats you made sure your partner is a liar",
            "him or me ? 😂",
            "Reddit is my new porn",
            "Nah I just think she wants to be the ONLY girl her boyfriend looks at. Her bf and her were broken up for a little while recently, and what she was most sad about was that she was his first in everything and that she won’t find another guy „untouched“ again… which I found super weird too, but whatever",
            "It’s not new it’s actually a fairly common take",
            "What's \"weird\" about ending gender inequality by asking my boyfriend to self-administer a handy-j with just 1 or 2 friends of mine and whoever is tuned in to the Instagram live?",
            "no one said anything about no sex 😂 damn men are dense these days huh my topic was not about no sex if u and your partner aren’t having sex & u have to masterbate so much maybe you guys aren’t meant for one another lol",
            "Not you lol",
            "I decided to add footnotes and a tldr when things started sounding confusing 😂",
            "It's new *to me*. I need to brush up on all my porn takes.",
            "You could do better",
            "no one was talking to you, the comment I responded to called the person vile when he said if there is no sex, the man will masterbate.  I responded to her, and told her no one is going to be ok with no sex and no masterbation.",
            "yes he’s vile just his view on things shows why he got issues 😂",
            "I already did your mom.",
            "he brought up rape & cheating as an example to what he said i think he’s vile",
            "I think I’m in love with you",
            "I wasn't talking to him either, and you were not the one who called him vile.  I was responding directly to the comment made."
        ]
    }
}