{
    "Weekly Vents and Successes Thread - June 17, 2024": {
        "title": "Weekly Vents and Successes Thread - June 17, 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/dating_advice/comments/1dhkxry/weekly_vents_and_successes_thread_june_17_2024/",
        "content": "Welcome to /r/dating_advice. Please use this weekly venting/celebration thread to get something off your chest, good or bad, without asking for or offering concrete advice. All individual venting or ranting threads will be removed and directed here.\n\nRemember our [rules](https://www.reddit.com/r/dating_advice/about/rules/), be sure to include ages and genders if you need help with a specific situation.\n\nPlease report any rule violations using the report button.",
        "num_comments": 20,
        "comments": [
            "Welcome to /r/dating_advice!\n\nPlease keep the [rules](https://www.reddit.com/r/dating_advice/about/rules/) of /r/dating_advice in mind while participating here. Try your best to be kind.\n\nReport any rule-breaking behavior to the moderators using the report button. If it's urgent, [send us a message.](https://www.reddit.com/message/compose?to=%2Fr%2Fdating_advice) We rely on user reports to find rule-breaking behavior quickly.\n\nThanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating_advice) if you have any questions or concerns.*",
            "Was seeing a guy for 2 months, 2x a week, texting all the time, sleeping together, etc. He decided he doesn’t see us working well long-term and that we’d be better as friends and I’m simply shook? \n\nThings felt good and easy and fun but he said there’s no romantic potential and we’re better platonic and I just??? \n\nFiguring out how to not beat myself up for giving it my all and it not working out is probably the most challenging part. I thought there was potential for something but now I’m being so self-critical and am very fearful of putting myself back out there. Don’t even really know if it’s related to him or just the internal battle of rejection.",
            "I (39, m, virgin) was talking to this girl on tinder for a week (my second match in almost five years). I thought I was pretty savvy with this stuff but then she dropped the onlyfans link. Feel pretty stupid now and really crushed. I probably wasn't even talking to that girl to be honest, was probably her boyfriend or someone who manages her stuff.\n\nI should've stayed negative and not let myself feel any hope, at least that's how I feel right now. Inching towards being the 40 year old virgin for real. Getting really tired of getting up everyday to bust my ass at work and be exhausted all the time, feeding myself, having to brush my teeth and piss and shit. And do it all again the next day. I'm just a body keeping himself alive because it's the routine while I get nothing out of being alive. \n\nAnd therapy just doesn't cut it for me anymore. I know my issues and I'm trying my best, but life feels empty and pointless. I just want to experience intimacy of any kind. Life is so lonely. It has to get better at some point, right?",
            "I've had 3 incredible dates with this dude that I'm into. I am being positive, but cautious as I am still trying to get to know him. On our third date, we opened up to each other about our family life and such. We last chatted on Friday about his weekend plans, and mine, and then we didn't talk Saturday or Sunday, which is fine. I texted him today and there's been no indication that he will be reaching out to me at all. I'm 26F and he's 34M. I feel like I'm overthinking things, but I am also negative to the fact he may respond back being that I just don't want to get hurt. If he does ghost me, then how should I go about getting over that fact? I've never been ghosted before, either, so idk. I'm just ranting. I feel like I'm going freaking crazy.",
            "29M here with very minimal dating experience, just had a first date with 30F that's left me really confused. \n\nWe were having a nice conversation on the app for around a week until I asked her out, which she said she was hoping I would do, but come day of it seemed like a switch flipped and she was completely disinterested? When we met up, I tried to make conversation by asking about her hobbies- she gave me mostly short answers and didn't really ask me anything in return. I don't know how I would've said anything uncomfortable since there weren't any heavy topics and it felt hard to talk about myself since she didn't seem to engage much. I also tried to then lighten the mood by asking her if she wanted to play a little game, which she went along with, but it didn't really seem to land either. I'm not the best looking guy in the world for sure, but my pictures are up to date, I dressed nicely and made sure my hygiene was on point, I tried to show I was interested and actively engaged, I tried to be very considerate to not do anything that might make her uncomfortable.... and she unmatched me shortly after? I don't have a problem with not having a connection, but as someone who is new to dating / anxious / getting close to 30, man did that just feel super discouraging. Is dating really that hard? Why would someone agree to a date just to act like they don't want to be there at all?",
            "Over the weekend I (29F) got a nice rejection text from someone (38M) I went on an amazing first date with a few weeks ago. He said he thought we had great chemistry (I agree) but he doesn't know if we'd quite work long term. And I'm just so confused and honestly frustrated that he wouldn't even give it a chance. I did respond and say I actually do think we have long term potential so if you change your mind and we're both still single feel free to reach out. IDK if that was desperate but I figured I have nothing to lose.",
            "I’ve been seeing this guy who seems really cool, but I don’t think we have a romantic connection. We’ve hung out multiple times and haven’t even kissed, the most he’s done is put his arm around me. Plus the conversation still feels super stilted. Which sucks because it’s been really nice having someone to go on dates with and do different activities with, but obviously I don’t want to lead this person on. Anyone else feel like mutual attraction/compatibility feels so rare these days?",
            "25th birthday coming soon and still never had a boyfriend or been kissed. went on a handful of dates (<10) my whole life. I'm just so sad I don't know why I can't find love. Granted I think 50% is me and 50% of the reasons have been life circumstances (moving a lot, work challenges, covid etc) I just feel like I'm getting so old now.",
            "Talking to this girl for about about 2 months. Multiple dinner dates—texts/phone calls/kissing sessions.  \nWe went out last weekend and did an “active” date because she “wanted to see me in the wild”. Long story short—we spoke last night and I got the old—we aren’t compatible convo and she doesn’t see a long term future with me. I tried to smoothly press for specifics but she wouldn’t elaborate and actually got testy with me. I’m 45 and she is 38. She has 2 kids and asked me if I want more kids (I have son starting HS so I said that wasn’t in the cards for me. She told me that she was back and forth on more kids but not committed either way.\n\nI can’t help but beat myself up for screwing this up.\n\nAny help ?",
            "I went speed dating today, met an awesome girl. She was really pretty and super popular so I'm probably 1 of 10 guys who was into her. I gave her my number and I did my best after the event to talk to her and connect with her but I felt like it wasn't enough. After I left I ended up passing her and her friends nearby and we waved bye to each other. Honestly I wish I pitched myself and my ideas for a date (based off of what she was into) at that time. Pretty frustrated right now because of this.\n\nReally hoping she'll text me during the day but experience has taught me that she won't. 😢",
            "Random vent, but I had **three people** cancel dates this week and one “thanks but no thanks text”.\n\nI’m so over dating apps. If I didn’t have a few months, left the pinch premium, I would probably delete my account.",
            "This is a vent people.  \n\nIs anyone else the only single person left in their friend group? Cause I am currently and honestly it can feel so isolating sometimes. I’ve never been the ONLY single person and on top of it all, I was travelling for a few months and it just seemed like when I came home everyone was cuffed and I wasn’t even there for the progression of the relationships (which I love). \n\nI just feel bad sometimes for getting angry at my friends for making more of an effort to see their boyfriends rather than me (especially after being gone for 5 whole months) but I also understand that most of them are in (short) long distance relationships so I feel guilty for getting jealous. \n\nAnyone else riding this bus???? It sucks.",
            "There is a guy I was going on dates with for around a month. We go on dates, have sex, have a common pet project. We are exclusive from the beginning. Can talk about anything, comfort and support each other, and express feelings of sympathy towards each other. Basically, in my book, this could already be called dating. \nBut he says that serious relationship is about having a common goals/affairs. So, he thinks bf/gf relationship starts when you start living together. \n\n\nSo, according to him, right now we are just hanging out together. This exact wording makes me anxious, so I asked him if that's what we are ('just hanging out') forever, or is it going to move forward? And he told me it can be something more, and expressed his warm feelings towards me. We even talked about children and marriage, even though in a half-joking way. \n\n\nSo, I'm not anxious anymore, but his way of thinking seems a bit goofy to me. As I said, in my book if we like each other and this is not locked in 'no strings attached' (as in fwb) status, it's basically already dating.",
            "Sorry abt your situation. I have just gone through something similar. You are not alone.",
            "GOOD LUCK. I feel like talking to multiple people at once if you can is the best way to get out of that anxious state in the early stages.",
            "Probably matched with someone she's more interested in but still felt obligated to go on the date with you.",
            "Maybe he's worried about the age gap being a problem.  Maybe he's got something else going on and it was easier to tell you \"it's not going to work\" rather than explain the whole situation to you after only one date.\n\n\nComing in with a man's perspective,  it was his way of politely telling you he saw something he really didn't like, and was just being as nice as possible to you, and your feelings.  \nAfter dating enough people, he may be able to look past good chemistry and know there weren't enough boxes checked off to make a long term relationship work. \n\n\n\n\n  I hope you find someone who will value your Resting bitch face and have a meaningful connection with someone who checks all your boxes too.  ",
            "dating is the wild west",
            "Good idea. Thank you for the tip!",
            "That’s for the perspective. I’ll survive but it does sting a bit. I’m choosing to believe it’s because we live in different boroughs in NYC so it would be a bit of a hike to see each other because that’s the least personal explanation."
        ]
    },
    "Come Join the official r/dating_advice Discord Server!": {
        "title": "Come Join the official r/dating_advice Discord Server!",
        "score": 174,
        "url": "https://www.reddit.com/r/dating_advice/comments/10c9a3c/come_join_the_official_rdating_advice_discord/",
        "content": "The r/dating_advice subreddit has an official Discord server! All rules in the subreddit apply in the server. The Discord is a great place to get real time advice on dating, and you can even get feedback on your dating!\n\nhttps://discord.gg/JQF7QF5Wvb\n\nIf you have any questions please reach out to the moderators via mod mail on the subreddit. Thank you!",
        "num_comments": 4,
        "comments": [
            "Welcome to /r/dating_advice!\n\nPlease keep the [rules](https://www.reddit.com/r/dating_advice/about/rules/) of /r/dating_advice in mind while participating here. Try your best to be kind.\n\nReport any rule-breaking behavior to the moderators using the report button. If it's urgent, [send us a message.](https://www.reddit.com/message/compose?to=%2Fr%2Fdating_advice) We rely on user reports to find rule-breaking behavior quickly.\n\nThanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating_advice) if you have any questions or concerns.*",
            "Welcome to /r/dating_advice!\n\nPlease keep the [rules](https://www.reddit.com/r/dating_advice/about/rules/) of /r/dating_advice in mind while participating here. Try your best to be kind.\n\nReport any rule-breaking behavior to the moderators using the report button. If it's urgent, [send us a message.](https://www.reddit.com/message/compose?to=%2Fr%2Fdating_advice) We rely on user reports to find rule-breaking behavior quickly.\n\nThanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating_advice) if you have any questions or concerns.*"
        ]
    },
    "Guy says he's not ready and then has a girlfriend right after": {
        "title": "Guy says he's not ready and then has a girlfriend right after",
        "score": 71,
        "url": "https://www.reddit.com/r/dating_advice/comments/1dln75n/guy_says_hes_not_ready_and_then_has_a_girlfriend/",
        "content": "So I had a situation recently that feels like a trope - guy I was seeing was consistently taking me out on weekly dates but after a few months when I asked what was going on, said he wasn't ready for a relationship, and gave a whole speech about reasons why. Saying he hasn't been able to think about relationships at all, and needs to sort his feelings out, and relationships haven't been on his mind whatsoever.  \n  \nNext thing you know, a month and a half later he has a serious girlfriend.\n\nI know that when someone says they're not ready theres a \"with you\" silently tacked on the end, but why is it always the case they have a serious girlfriend seemingly RIGHT after they say this? Is it because they're dating multiple girls at once, and they tell the rest of the roster they're not ready, or is it a thing where they're somehow primed from dumping a situationship to suddenly be on the hunt for a GF? Because this exact pattern has happened to so many people it seems like there has to be something going on with the timing?",
        "num_comments": 76,
        "comments": [
            "Welcome to /r/dating_advice!\n\nPlease keep the [rules](https://www.reddit.com/r/dating_advice/about/rules/) of /r/dating_advice in mind while participating here. Try your best to be kind.\n\nReport any rule-breaking behavior to the moderators using the report button. If it's urgent, [send us a message.](https://www.reddit.com/message/compose?to=%2Fr%2Fdating_advice) We rely on user reports to find rule-breaking behavior quickly.\n\nThanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating_advice) if you have any questions or concerns.*",
            "You were a placeholder until he found a better match for a relationship",
            "Yes sometimes they have their eye on another woman and sometimes they meet a new woman. Also doesn't mean it's going to work out with that new woman. ",
            "Feeling sorry for yourself is the most dangerous mental trap out there. Self-pitying thoughts carry no value. Thinking them just hurts you and encourages you to give up. They don't offer any meaningful insight, they don't make you feel better, they are simply self-destructive.\n\n\nHis little speech about not being ready for a serious relationship was just an attempt to break it off without hurting your feelings. There could be no specific reason at all, it's hard to define why you \"click\" with one person but not another. Or you burped once and he's a weird little baby and got turned off by it. Unfortunately the specific reasons are something you can never know.\n\n\nAccepting rejection and moving on is difficult. You wanted something, you felt it in your grasp, and then it was ripped away and there's nothing you can do about it.",
            "Tbh its also an easy way to dump people... i wouldnt read too much in to it.",
            "Because it's just a cop-out line for when they don't feel like saying what's really on their mind. Like, I caught up with my ex yesterday (from about 2 years ago), we talked about dating. She says she still uses \"Sorry, I just got out of a long relationship and I'm not ready for anything\" as her goto dump line. People will say whatever they think is going to hurt the least.",
            "Maybe the gf was the person he secretly liked and was hung up on while he was dating others.",
            "I always say this and people never listen.\n\n“I’m not ready for a relationship right now” = “I don’t *want* a relationship with *you* specifically, *ever*. I’m ready for someone else”\n\n“You deserve better” (while rejecting you) = “I don’t want you because I’m not attracted to you”\n\nThis is *always* true. Zero exceptions. Don’t let anyone manipulate or gaslight you into believing otherwise",
            "I spent four years with a guy who hadn't been in a long term relationship, only one relationship before me, not much sexual experience (32 years old). He was quite shy but lovely guy, I helped him gain loads of confidence, shaped him into an amazing BF (also great in bed), I helped him decorate his house, would help him pick really nice clothes when out shopping, encouraged him to go to the gym, even wrote out workout programmes for him, things a long term GF would help with. We went on holiday, had a fab time, even spoke about living together. We couldn't have got on any better than we were. \n\nWe had a stupid argument a few days later and I never heard from him again (he worked offshore so was gone for a month). I'm stubborn so refused to reach out to him and that was it.  \n\nWe did speak a couple of months later, he was living with someone else by then. He was married and had a baby on the way six months after we had the stupid argument. \n\nFour years we had been together, once I had helped him with his social anxiety, helped build his confidence and get some experience that was it!\n\nYes I was hurt at the time, my ego was bruised and I wanted to know what she had that I didn't, then I realised that for him to have treated me like that, he wasn't as great a guy as I had thought he was, so fuck him!\n\nKarma is a wonderful thing though, he  began to message me all the time, emailed me always wanting to chat, looking for advice, wanting to meet for lunch, complaining about life with my replacement, again proving that he wasn't a great guy by treating the new partner like this by wanting to keep in touch with me. It did give me great satisfaction tbh and then I cut him off completely.",
            "Guy here, that’s happened to me before with a lot of girls. Usually I chalk it up to just being the placeholder because they’re exploring their options. It does get very discouraging but I have to remember the right one wouldn’t do that to me, and they won’t do it to you either. I’m single after a very unhealthy relationship which happened three years ago sort of figuring out what I want in a partner again I’m sure you’ll meet the right one. Cheers my friend!",
            "Don't worry about it too much. Now you know this man has low character. He enjoys stringing you along for sex until he gets the woman he really wants. You may think that the new girlfriend has it made, but you know his real personality. He is not a catch.",
            "Sometimes you go into a relationship hoping it’s the one, when deep inside you know it’s not. Sometimes being in a relationship teaches you what you’re actually looking for. Not that it’s big differences, but maybe even just subtle things that aren’t quantifiable. A little more this, a little less that. Things that are unique to that person, but someone else might think differently.",
            "Honestly, I would surely prefer an \"I'm not ready now\" without much details, than a straightforward \"Yeah, I'm just not that into you\". Just move on.",
            "To create perspective: I had a similar situation myself about two years ago. I was the one who gave the speech and was then in a relationship a few weeks later.\n\nI actually really liked both women. I dated one of them, but she was somewhat reserved and I didn't feel the spark 100%. The other lady was in my circle of friends, we went partying together a lot and I never thought I had a chance with her. Then there was one night. Boom. Relationship (now over again).\n\nNeither of them made a mistake at the time. My gut feeling guided me. Nothing more. So you don't need to feel bad. It probably really wasn't your fault.",
            "I have had the same issue a lot and part of it may be they just don’t want a relationship with  you, but part of this which I had to realize for myself as well was that I was allowing it by people pleasing and allowing “girlfriend privileges” like sex and sleepovers and plenty of time without any commitment.  It helps if he has some fear of losing you, some time to miss you and something to gain by committing. I started being less available for guys and not allowing sex or inviting into my house or spending the night at theirs without commitment. Try to put a cap on how often it goes on. Usually one month should be enough two tops, so don’t let them string you along forever. Walk away after the first “don’t want a relationship.” It shows confidence and that you don’t need them. Sometimes they will come back wanting one, other times they won’t, but then you can move on and find someone who does and you haven’t wasted too much time or energy.",
            "Yep  agree place holder I did this\nYou will do untill somthi g better comes along it's always nice to know when you get rejected you can come n see you",
            "Women do it all the time too. Not exclusive to men. And “sorting your feelings out” is a load of crap. That takes like 10 seconds. He definitely laid the cliche and bullshit lines on you. Im sorry.",
            "You were a part of his roster, and one of his other side chicks got a promotion",
            "He was seeing her and possibly even others at the same time and then picked one, would be my guess.",
            " if he did this, then he isn't a guy who is gonna be sincere to his serious new galfrnd",
            "Im saying this in an empty field. Hopefully the universe delivers me a gf soon after",
            "Works both ways. Men and women.\n\nIn this exact situation, he (or she for that matter) was dating another at the same time and you eventually lost the race. He kept you on a leash for a while still because he probably did like spending time with you, but even more so with the other girl. You gave him an ultimatum, and he couldn't ignore the situation much longer and announced the winner. Which wasn't you.\n\nIt is what it is.",
            "He was genuinely trying and the mysterious and elusive spark no one really understands was not materializing. On paper you seem a good match and he enjoyed your company . So he struggles for a rationale as to why the irrational was not gelimg and came up with reasons to make sense of it all. Then he found the spark.\n\nOr there  was a unaddressable reason that he did not want to say because he felt it would be hurtful so he made it about him , and not what his misgivings were. \n\nProbably one of those things could be something else. You will never know.",
            "you werent offering what she is just accept that and go",
            "Girl, you know 90% of the time. When a guy says he's \"not ready for a relationship,\" it does mean that they don't see themselves having a relationship with you.",
            "I just made a post about your same issue OP, Keeps happening to me and so disheartening.\n\nits unfortunate but maybe its not showing a lack of value in you but maybe they just weren't the right guy for you in that they didnt click with you fully.\n\nAlso, I talked to my older brother and he said that basically guys always have a roster of like 2-4 girls theyre seeing or talking to and will ditch the others for the one they liked the most. He said he did when he met his now wife and he knows he hurt the girl he left behind but he just liked his wife more. also, he said a main reason he chose her is that she made her interest in him very clear and was very forward. He suggested to me maybe im not forward with guys or clear when im interested in them. im shy so it does check out. But I think the right man will appreciate me even if im shy.",
            "Same thing happened to me on four separate occasions.  One time, the turn around was literally two days later.  \n\n\nSometimes people think they would be better off lying to your face, since they don't value you enough to want to keep you around as a friend.  On one hand, it feels terrible to be disrespected like that so blatantly.  But on the other hand, I'm glad I have no regrets about leaving them behind.  A dishonest partner would never have been good for me, not even as a friend.",
            "It's possible that he was already talking to her when you were seeing him, but didn't want to admit that yet. So when you asked what's up, he made up the first excuse he could think of. Because he can't say that he's seeing someone else, he doesn't have a reason why he doesn't like you, but he can't get into a relationship with you right now. \n\nI have done something similar, although I wasn't dating someone else, but we just went out with mutual friends.",
            "I’ve said I’m done with dating and not that interested in it anymore only to meet someone nearly instantly who I clicked with.  It happens…",
            "Had a lot of women like this, dont worry youre not alone, to be blunt he wasnt interested, that's how these things go, its best if you dont worry about it",
            "This is why I say kill the nice guy/girl trope be an adult and communicate these people suck ! \n\nWe give way too many excuses for people to not communicate upfront of their intentions just because you are in a talking stage & they have a”right” to not communicate their intentions of the future with you.\n\nIt is credibility disheartening to be the other person & the other person not being held accountable for it.\n\nIn most cases these people have a roster & they go down the line & choose who is good for them (aka who is giving them what they want ) every case like this turns against them imo. The other person regrets it each n everytime 😂",
            "He had you there for a good time and not a long time.",
            ">Is it because they're dating multiple girls at once, and they tell the rest of the roster they're not ready,\n\nThis. It's usually this.",
            "Same thing here except I’m not sure if he’s dating someone else. It’s like they lay the groundwork to make you think that something long term is going to come from it but then they drop you like a hot potato when it doesn’t suit them anymore. As horrible as it is, keep your guard up until someone proves themself to you. You might be the nicest person ever or have many great qualities about you, and someone will find that so desirable to a point that they’ll show you just how much they want you. Good luck and stay safe❤️",
            "No nice way to put it you were just someone to get reps with until he leveled up to what he wanted.",
            "He was definitely \"keeping his options open\" or, as I prefer to put it: hanging onto you as a backup. A lot of people, not just guys, do this. It's not nice, feels bad being on the receiving end of that. Moving forward, if that's the answer you get from someone, then date someone else who knows what they want and wants to put the effort in.",
            "placeholder 😞 ive been there and it sucks, nothing you can do except forget about them and move on",
            "What’s the issue? Better than him dating you and leading you on for years",
            "Remember anytime someone says something like this add “for me” at the end.. that’s the truth.",
            "You are a Mercedes and he only has the capacity to manage a 90s Ford Taurus. If someone feels they have to “level up” mentally or emotionally to be with you, they’ll be happier with less.",
            "Lol this has happened to me so much 🤣\n\n\"I'm too busy. I don't have time. I'm just not ready for a relationship\" a few weeks later they have a boyfriend 😂 wash, rinse, repeat. Yeah that's what happens when someone doesn't want you specifically. You'll get every excuse in the book. Just how dating goes unfortunately.",
            "I think you already know the answer. He's already told you what he thinks. He wants a girlfriend but not with you. I know it sucks because that's not what you wanted, but at least you know, and you don't have to waste any more time and energy with him. Don't take it as a loss. Take it as a learning experience for future relationships. Sadly,  you never know what a person's true intentions are when you start dating.  It would be ideal to know right away,  but that rarely happens. I think most people want to be in relationships, and some want to enjoy the journey until the right person comes along.  Unfortunately, many people get hurt along the way, but that's modern dating.  Sorry,  it happened to you!",
            "Stop being gullible with guys who don’t care about you. Next!",
            "Vetting the guy early is the best move. Sometime one can be affraid to ask but don't give your love for free. The guy must earn it not only by his attractiveness but also by the way he treats you and how it take care of the relationship",
            "Dont hate the player...",
            "This!",
            "This is exactly what happened to me with this one girl i was talking too. She came running back once it didn’t work but now she’s on my time 🥱",
            "A bit of self pity is necessary and healthy when processing loss.  Wallowing in it chronically is an entirely different thing, and it doesn’t seem like that’s what OPs doing",
            "When guys like a woman they commit quickly. If they like you they will *never* tell you “I’m not ready”. Not once. No exceptions. Yet people keep falling for it (seen it happen to guys by women too, and they too fall for it). I suppose it’s just because it’s so hard for people to accept they’re not wanted by someone, so they stick by desperate for the other person to accept them, to the point they end up letting them use them as a placeholder for future bf/gf who will never be them",
            "\"It's not you, its me.\" = \"It's not you, its that I'm not attracted to you.\"",
            "And if you're already dating that person\n\n\"I just need to be by myself to work on myself right now\" = \"I already have someone else lined up to be with and I'm not actually going to work on myself. \"",
            "Last summer you said the complete opposite. Don’t you remember?",
            "Thanks for your story. Yes it's better to vet the guy as early as possible to know his value. Compared to a woman that looks for \"the one\", a man will most likely settle with a woman \"good enouth\"",
            "Good for you. I hope he sees what a huge mistake he made.",
            "Then why don’t they just say that?",
            "Okay. So story time. Maybe you can shed some light on this. I just finished dating a guy for about 2 months. At about the month and a half mark I told him that I didn’t do casual sex and I expect monogamy from here on out if I sleep with him. He very enthusiastically said “oh, of course.” He quit texting me after I slept with him, but answers my texts. We went on one more date. For 3 weeks in a row he told me he has to go help his parents out of town. Then a few days ago I get a message saying he’s not in the headspace for anything serious. Everything was seemingly perfect. We clicked. He would talk about the future and make plans. What the hell happened?",
            "If I hadn’t been through the exact exception to your rule, I’d be inclined to agree with you. My current boyfriend and I had been in a 6 month talking-stage where at month 3 he told me he wasn’t ready for a relationship. We were texting everyday and seeing each other multiple times a week. He was also showing up often at my job with gifts and snacks. All of it pointed to genuine interest but he just wasn’t ready to take that next step. We had a lot of other factors to consider because we come from completely different religious and cultural backgrounds, and he wasn’t sure if we could work. Fast-forward and now we’ve been in a serious relationship for 9 months. While I can acknowledge it’s pretty rare that longstanding situationships blossom into something more, it can be a bit self-important to assume that someone should be ready for a relationship the moment that you are. Especially if there are external factors. I think the reason they’re saying they’re not ready matters more than the statement itself.",
            "Spot on! I forgot to add that one. But yes that’s exactly what it means",
            "Huh? Where tf did I say the opposite? You’re making stuff up out your ass\n\n“u/FaxSpitta” more like BS Spitter",
            "There was no way to vet him, no previous history to go on. He was a genuinely lovely guy, he honestly didn't realise how much he had going for him. He had awful social anxiety, at times it was painful going anywhere with him, he was just so awkward. He came from a rural area, worked away 6 months of the year with hardly any social interaction but was a really kind trustworthy guy who would have done anything for me.\n\nOnce I had encouraged him to go to the gym and a year or two down the line, with the fitness, working through his anxiety issues and him gaining confidence at times I did think to myself that I had created a monster, not in a horrible way, but probably made him become very vain and obsessed with his looks, especially as when I first met him I used to see girls staring and whispering about him to each other everywhere we went, he was absolutely oblivious to this and would get embarrassed when I told him.\n\nHis new wife must have limited his gym time though as he lost a lot of that muscle he worked so hard to gain, she changed his hairstyle and how he dressed and had him looking like a member of a boy band!  \n\nThe one thing that honestly shocked me was that he wanted to keep in contact with me even though they had a baby on the way, emails still had sexual context in a roundabout way, thinking it was OK to meet for lunch and trying to justify it by saying that we were just friends so totally innocent. I would have never ever thought of him as that type of guy. I trusted him 100% when we were together. \n\nI don't have any bad feelings towards him at all, I don't have any feelings good or bad. I can't even remember the last time he crossed my mind until I saw this post.",
            "Thanks.\n\nI honestly hope he is happy, I have no feelings for him at all anymore.  They are still together and have two kids as far as I know. I have seen the odd picture of him now and then on social media and he doesn't even look like the same guy anymore. He looks a lot older and sort of worn out. \n\nShe was more interested in his money than anything else, he wanted to stop working offshore when his baby was born so he would see her growing, my replacement wouldn't allow it, she thought the money he earned was more important. Surely most first time mothers would rather have their partner at home than leaving them on their own with a baby for months at a time?\n\nIn those four years I was with him I never took a single penny ever, I still took my turn paying for dinner, buying drinks etc. I had no interest in what he had. I had no idea he was well off for months after I met him, I did know he worked away but didn't ask all the details \n\nIm pretty sure he missed me for a long time, not that it matters now anyway 😊",
            "Cuz you’re not likely to keep fucking them if they say “with you”.  If they say “work is crazy and I’m not ready for a relationship but I’ve really enjoyed the time we’ve spent together and love hanging out” they still have a chance to get their dick wet while they look for the girl they ARE ready for a relationship with",
            "He just wasn’t that into you.\n\nHe wanted to have sex with you, so he told you what your wanted to hear to get it. \n\nOnce he had it, he decided he didn’t want to be monogamous with you.\n\nThe why’s and motives behind those decisions aren’t that important, atleast they likely aren’t a reflection on you, they are a reflection on him.\n\nLearn what you can from the experience and move on.",
            "Maybe it wasn’t ever going that great though? If he tricked you into sleeping with him the first time by acting like he was down to be monogamous only to never initiate a text convo with you again following said first sexual encounter and also gave you the same lame excuse to not hang out for 3 straight weeks, I don’t see where he’s done anything positive? He responds to your texts, sure but what’s the tone? Is he enthusiastic? If he’s making excuses AND not hitting you up, that’s a dealbreaker. Forget his ass and find someone who’s as excited to talk to you as you are to them. I say this with love because very similar experience🙋🏼‍♀️",
            "I’ll just focus on the still answering your texts because others addressed the rest well.  He’s trying to keep the door open so that you might hook up with him down the road",
            "If he wasn’t ready for a relationship why was he dating you then?? Your time and emotions didn’t matter to him. He wasn’t into you. That is the only reason he wasn’t “”ready”” to commit to you. If a guy wanted to, he would. This is *always* true. \n\nApparently your particular guy later wanted to (but definitely wasn’t wanting you in the time he told you “I’m not ready”) but I really question the reasons and whether it was genuine or simply not finding someone else whom he deems “better” and settling so he won’t be alone.",
            "Thanks for your response. Yes I heard about guys who weren't that popular even though they have so much potential. But when it's revealed, they start to notice all the attention they get and sometimes that can be intoxicating. It's a great feeling to know as a guy that you can fuck any girl tbh",
            "I think the red flag there was at 32 and no previous relationship- no woman wanted him.",
            "See my reply to the other poster and see if you still think he was just a skeeze. I’m not sure what I could learn from this other than maybe wait even longer to have sex? 🥴🙁. And why bread crumb me for 4 weeks. Why not just ghost like a not a f boy. Sorry. This is just the first time this has ever happened to me. Guys usually like me to much and get to clingy to fast.",
            "He was very enthusiastic in his texts back. He took me to nice places. When I came over for the weekend he told Me to stay as long as I wanted. He blew his friends off to see me. The first time we talked, we talked until almost 6 in the morning. He kept saying we click so well. We have such great chemistry. You have the perfect body. You are so sweet. We are both atheist in a country where 98% of the people are very religious. I actually prefer to date men that let me have my space and freedom and don’t need to hang out or text constantly. I don’t know if this is important, but I wasn’t able to cum either time we had sex and he took it personally. Thank you for your response though. You made very good points for me to think about.",
            "It seems that you view the world through a very black and white lens with no room for any gray area. I can understand why someone with little-to-no information would be quick to assume that lack of immediate commitment = disinterest in my situation. All of his actions led me to believe he had an interest in me, and at the time I also hadn’t planned on entering something super serious, so him not wanting to commit right away wasn’t a problem for me. I also had serious concerns before I was ready to be in something long term with him, again, due to external factors. I am not someone who has struggled to get the attention of men, nor were my own options limited, so the idea that either of us settled is an assumption based on your own biased perception. But even if someone’s interest grows over time, there is nothing inherently wrong with this. Unfortunately, not everyone has those “love at first sight” feelings and there’s nothing wrong with something that builds up over time. There’s no need to villainize it.",
            "I didn’t say he was a skeeze.\n\nJust that he wasn’t as into you as you were him.\n\nOr maybe he was into you, then he met someone he decided he was more into.\n\nOr maybe something really did come up in his personal life and his priorities changed.\n\nThe lesson to learn is to believe what people’s actions are telling you, rather than just their words. Words can often be correct for their intentions, but their actions will show you their true priorities.\n\nFor example; \n\nhis words were that he wanted a relationship with you, and that may have genuinely been his intention at the time he said them.\n\nBut his actions were that he told you what you wanted to hear so that you would sleep with him, and then once he got what he wanted, his priorities shifted.\n\nIf/when he comes back, you have (hopefully) learnt to not believe what he says. Because he has already shown you that his word means little.\n\nEdit; after reading your other comments, words vs actions are 100% the correct lesson to take from this. Old mate love bombed you and told you exactly what you were looking to hear to get into your pants.",
            "Pay attention to “future faking” too. When someone talks about things you’ll do as a couple or talk about future plans or activities or places you can go. That’s painting a picture in your head and getting you hooked on the idea of a future that most likely will never be. \n\nMake sure anyone you are talking to or getting to know stays firmly in reality. And, if they make claims like “We should go to this restaurant (or whatever) I love sometime. Their milkshakes are great. We’d have fun.” Pay close attention. If that restaurant visit never seems to happen…. You’re being future faked. \n\nPay close attention to people who stay in the present, plan activities with you (and actually show up) in the present, and don’t paint imagery about things with you you can’t guarantee will even happen.",
            "lol wow, same here about hitting it off/atheism/preferring space/not being smothered/and that very last part 🙄😂 weird! In my personal experience, dude was major avoidant attachment style, we also both have intimacy issues (emotionally), he’s probably still in love with his ex, he loses interest after every time we sleep together but once we go long enough he’s right back into putting all the original effort in (I guess because it’s a novelty at that point)? But I 100% did this to myself by never setting strict boundaries and also allowing it to go on for hmmm…5+ years now 😳😖 Whatever the reason is that your dude is going cold on you, just know it’s not you. I know people on here want to be direct and honest so they tell women “he’s just not that into you” and sure, that’s probably true but they’re also just shitty people if they can do that to someone. Oddly enough, I’ve never known a woman who leads men on sexually the way men do to women. 🤔 I find that a bit telling! In fact, if I don’t like someone a lot, sex is the last thing I want to do with them! But men are wired differently and actually really enjoy sex with people to whom they feel little to no emotional attachment and I will never fully understand how or why 🥲",
            "Thank you so much for your insight and kind words. This is literally the 4th avoidant I have dated. I just can’t figure out a way to weed them out yet. I’m seriously thinking about being happy just being me. As much as I want what my parents and grandparents have, it’s not worth the abuse. I’m seriously considering dating women. No joke. Men just don’t have the amount of empathy that I need. I’m going to screen shot your answer and read it again when I’m sad."
        ]
    },
    "Should I pretend that I’m not a virgin? ": {
        "title": "Should I pretend that I’m not a virgin? ",
        "score": 116,
        "url": "https://www.reddit.com/r/dating_advice/comments/1dlicwl/should_i_pretend_that_im_not_a_virgin/",
        "content": "Im 21 years old(f) and a virgin.\nI don’t know if I’m still at the right age where it’s normal to be a virgin, but no one in my circle is. All my suitors have already had girlfriends, hookups, etc. I’m embarrassed that if it ever happens, I’ll have to confess to them that I’m a virgin. They’ve been with so many girls that telling them at 21 that I have zero experience feels like it ruins the fantasy, it’s like taking them back to when they were teenagers and the encounter was more awkward than pleasurable. I think that maybe the right thing would be not to tell them, but at the same time, I’d have a hard time and couldn’t show discomfort. What should I do?",
        "num_comments": 121,
        "comments": [
            "Welcome to /r/dating_advice!\n\nPlease keep the [rules](https://www.reddit.com/r/dating_advice/about/rules/) of /r/dating_advice in mind while participating here. Try your best to be kind.\n\nReport any rule-breaking behavior to the moderators using the report button. If it's urgent, [send us a message.](https://www.reddit.com/message/compose?to=%2Fr%2Fdating_advice) We rely on user reports to find rule-breaking behavior quickly.\n\nThanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating_advice) if you have any questions or concerns.*",
            "No ones going to care. You’re only 21",
            "Only immature people will laugh at \"you are a virgin!\"\n\nWhy do you care? Who cares?",
            "You didn't explicitly state this, but it sounds like you're a girl right? If you are, then guys mostly either won't care, or they will see it as a positive. People can argue all day over whether that's wrong or not, but ask most guys, and that is what they will tell you. So I wouldn't worry about it at all",
            "No. You should not pretend that you're not a virgin.",
            "You can truthfully say \"I don't have very much experience.\"   If you're uncomfortable saying you're a virgin.  That said, no one really cares.  No one who's a mature adult anyway.",
            "Well I didn't lose my virginity until I was 27 and the day it finally happened, I lied through my teeth about me being a virigin and claimed i was rusty. Oddly enough \"studying\" porn videos an hour before it happened kind of helped so as to not look like a complete newb. Did she suspect something? Maybe, but she didn't ask nor did I provide any more info than what was necessary",
            "I lost mine at 26. It's not the end of the world. Just do your research, get on birth control/IUD, talk to your doctor about STIs, don't sleep with abusive/rude men, and never do the deed without a condom. Don't ever sleep with a guy who doesn't bring condoms to the bedroom or complains, walk out and leave. It'll protect you from stealthing.\n\nYou think there aren't male virgins out there? Young men are more single than young women. Find a virgin dude",
            "It might seem like everyone loses their virginity in their teens but the reality is no one is posting as often about not being a virgin vs the people posting that they had sex. Lots of people don't have sex til their 20s or 30s, personally I think in many ways it's better that way. You will be more matured and handling the vast amount of emotions and feelings that comes along with sex can be challenging when you are younger. You're not missing out on anything, sex is only fun when you are with someone you actually want to be with and that is reciprocated. It's not worth chasing it out just to fulfill it, although there is nothing wrong with that if you really want to one day. That said I wouldn't lie about it, it will only further complicate things if you end up progressing into a relationship and have to tell someone the truth at some point. Also a lot of people actually enjoy being with a virgin compared to someone who's slept around a lot. For all you know, the first person you ever sleep with could be a virgin as well, and you telling them that could make them more comfortable.",
            "Save your V card. Don’t lie about it.",
            "You don’t have to tell anyone. It’s not as abnormal as you think for gen z to be virgins. Your Definitely in the minority, but it seems gen z has a higher percentage of virgins than other gens and overall are less interested in having sex than other gens from what I read.",
            "Honesty is always the best policy 👍🏼",
            "Boy, you've sure missed out. On a ton of teen drama, bad sex and bullshit.\n\nI wouldn't be volunteering the info because it's no one's damn business, but I'd not fake that I've had sex either.\n\nAgain none of their fucking business.",
            "No.  Don’t worry, it will be fine!",
            "If they really care that you're a virgin so much, are you sure you that they're the right person for you ? Cause that sounds shallow as hell to be hung up on something like that if they really like you. \n\nWe all were/are virgins at some point, it really doesn't matter when you lose that \"title\".",
            "Was 21 when I lost my virginity, at your age no one cares lol",
            "Really up to you if you want to tell someone you’re not a virgin but if you do they may be able to tell you’re inexperienced the night or day of. It’s okay that you want to have sex and that be your  motivation in pursing someone. Be yourself and someone may gravitate towards you. Eventually tell them. Some girls really don’t mind if they’re into your personality. She may like that you’re clean & wanting to explore with her. Don’t be to hard on yourself. Get on an app or just causally strike a conversation.",
            "I was 29 when I lost my virginity to my now husband. I felt weird in the dating world because I didn’t have the experiences it seemed everyone else did. But to my husband, he didn’t care. He only wanted to know if it was a waiting until marriage thing or something else. When I told him I wanted to wait until I was in an exclusive relationship and it seemed like it could go somewhere, he was very accepting and moved things along at my pace.",
            "There is no reason why you should pretend not to be a virgin. Instead BE PROUD OF IT. You’re avoiding heartaches, std’s and soul ties with people who do not deserve to have your body. Do not feel peer pressure just because your friends are not virgin anymore. I know you see hooking up & having sex as cool right now but trust me once you start getting older you wished to have kept your body to yourself & not give it away to just anyone. Disclaimer: I’m not judging anyone who thinks the opposite but this is my point of view!",
            "Dear, I’m 27 and still haven’t done anything. It’s alright, don’t be self conscious. If you have developed a relationship with someone to the level that this conversation needs to be had, they won’t care. They’ll probably think it’s cute and make it special for you. I was super in my head about it, as I am a male and have 0 experience. But think of it this way, if you were going deep sea diving with someone, and you’ve never done it before would you tell them that you have and just wing it? or would you be honest with them and get some tips and pointers from them to make it more safe and enjoyable? I for one, would pick #2 everytime.",
            "Absolutely not. It seems like pretending might be the thing that you would do in a comedy style movie scene, but in real life, whether you are genuinely interested in this person or not, and I only has an impact on their psychological well-being, but also their physical well-being. For example, in all due respect, it is completely possible that you may have exposed yourself to some type of harmful, transmittable disease. Why not disclosing your activity to the person that you plan on being sexually intimate with, you may give him a false sense of his sexual well-being. He may proceeded to be intimate with other women I have potentially put them at risk. This is a dark, grim example, but it is a possibility. Also, if you plan on me being a serious relationship with this person, it may cause problems to you down the line if you decide to tell them the truth. They may not take it as lightly as you think.",
            "Virgins on Reddit need to stop thinking that this is an issue. It’s a non issue. You just haven’t done it yet. Of course it’s normal to not have done something yet. You’re only 21.\n\nVirgin means child. You are not a child. You will lose it eventually but don’t get in your head about it. Also, you don’t need to announce it to the world and make it a huge thing. Everyone has their own time. Don’t compare yourself to others. Some people wish they had waited a little longer. You never know how everyone’s first times were just because they did it first. It’s not a competition. In the grand scheme of things it doesn’t matter. Once you have sex you will see what a non issue is.",
            "Why lie?",
            "Just be honest being dishonest about things like that to a potential partner of any kind is a bad start to any relationship.",
            "People lie about not being virgins lol",
            "being a virgin is not a bad thing. anyone who thinks it is, isnt worth your time.\n\nbut there is another, more important reason you should tell them. if youve never had sex before, the person youre with needs to be more careful than he normally would. if i slept with someone for the first time, i would absolutely want to know if she was a virgin. wanna make sure she has a good time.\n\nyou deserve a good first experience with someone who treats you right, and you cant do that by lying.\n\nedit: side note, but i was my girlfriends first. the thought of that, the fact that i am quite literally the only man who ever made her feel that way, is insanely hot.",
            "No. The people that don't experience any type of akwardness and pain dyring their first time are few. You need to acknowledge (and not be ashamed at all!) that you are a virgin so the other person can be respectful and patient with you.\nI lost mine at 24 with someone \"experienced\" who was glad I told him so he can take it slow at first, my boyfriend lost it at 26 and had a couple mishaps during the first time. None of it is embarrassing.",
            "You're at the age where it's normal.\n\nIt's only been increasing with gen z too.",
            "absolutely not. it's best to let them know as otherwise it'll just be uncomfortable and likely painful. any decent guy will understand and ensure you're as comfortable as possible.",
            "Don't ask, don't tell.",
            "No one cares, what people do care about is lying. Don’t lie. It just puts both you and whoever you sleep with in an uncomfortable position because the truth will come out. If u lie then they’ll probably just think you’re really bad at sex lol, also like it’s your first time you want that to go a lil more chill. Communication is always super Important. If someone makes fun of you for it… then why tf would u wanna sleep with them anyways??? Pick someone who likes who you are and isn’t gonna judge u over something that is normal.",
            "Sell it",
            "Dude chill. We all gotta start somewhere…you just gonna never have sex because you’re a virgin and you think that means you won’t be good?",
            "Seems like you are a woman. If that is the case  its probably a bonus that you are. Even more so if it is your partner rather than a random guy.",
            "Your only 21 I’ve known plenty of women much older that I’ve ended up finding out they are a virgin I wouldn’t worry… just be up front and honest often the first time with a partner isn’t great regardless if your a virgin or not",
            "The ones that gaslight you for being a virgin are typically the ones that wish they could say they are a virgin.\n\nDon’t be a pushover and let others belittle you. You’re better off being on your own if you’re in a circle where you’re being ridiculed and being put down by others.",
            "No, but you should look for someone who has more in common with you. Guys that had many partners at 21 sound like the total opposite of a virgin woman, in terms of how they live their life. You should consider that before starting a relationship.",
            "I honestly wouldn’t care and I don’t think anyone else would either, although I’m a woman so that might change things. But I doubt they would mind, just tell them that you wanna kinda take things slow your first time so that you can get used to it",
            "I was 24 when I lost mine you’ll find someone I promise. Just make sure it’s meaningful and not some random hookup.",
            "So am I. It is lame. Get it together soon!!! And quick. Or you’ll rope yourself.",
            "No just be yourself. I promise you that no one cares.",
            "🤦‍♀️🫢😆 Oh...he'll know. Seriously. Guys aren't as stupid as you obviously think they are. And why lie? It's perfectly okay to be your age and a virgin. It's a good thing actually.",
            "I feel like lying about it would only come back to hurt you. Let’s say the person had a bigger 🍆, with them not knowing it’s your first time they might rush in, not knowing to take their time and end up making your first time a bad experience. It’s also a turn on to some men, if they believe you it shows that you’re not very promiscuous, and might make them trust you more in a relationship, if they know you’re the only man they’ve been with.",
            "Don't lie, and be honest. No one likes a liar.",
            "I guess my question would be how would you feel about a suitor your age telling you they were a virgin? How would you expect someone to respond to you telling them you’re a virgin? \n\nAnd like even in the worst case scenario where you get a negative reaction, it’ll fish out the people who aren’t for you. That’s still a positive outcome.",
            "I’m a virgin at 21, usually when I tell women that (I’m a guy) they are surprised but have no issues with it. Usually they like it actually lol",
            "Your lack of experience will show, just be honest",
            "If you’re not a man, it doesn’t matter. If you’re a man, avoid the question as best as we can. Don’t outright lie but come up with a smart way to evade it.\n\nIdk why but as we approach late 20s, virgin men are really looked down upon (usually by women. Not all women, but those who look down upon virgin men are mostly women).",
            "Keep your sexual history to yourself if you want to. No one should make you disclose it, no matter if high or low.\n\nBut also, 21 is really young. My GF was a virgin at 24. I didn’t mind at all.",
            "I wouldn’t be so worried about it. I’m a 23M and I had my first time when I was 21 and I agree with a few others saying that only immature people make such a big deal of it. Honestly being one for so long is a lot better than being the neighborhood bicycle",
            "Lmao you are a woman, so being a virgin at 21 is nothing but a plus for you at the eyes of most men.\n\nIt will make you more desired to a lot of men.",
            "Trust me, it’s wonderful you’re still a virgin! You’re a shining diamond among other girls.\nYou’re 21 and have never had sex? That’s completely normal. It means you are not a slut and just wanted to wait for a good man. (It’s a good thing)",
            "No.",
            "No way",
            "You really need to start thinking more about how YOU would feel in this situation - you’re spending too much time worrying about this label and what he will think of you. Your experience is equally important.\n\nIf you don’t feel comfortable sharing this with the first guy then maybe he’s not the right one.\n\nYou shouldn’t have to lie about it either though",
            "Don’t lie, but also don’t tell people that you are as a general rule because then guys will be interested in you for the wrong reason",
            "Coming from someone who dated a girl in college who was 21 and a virgin. It puts incredible stress on the guy. If for some reason your relationship doesn’t work out, you don’t want to be the guy that stole her v card then bounced. At the same time, you also don’t want to be the guy who goes 6 months without sex. My advice is to stop putting so much “I want it to be special” into it. Get it out of the way with someone and move on.",
            "I did and honestly was glad I did with the person I lost it to. He ended up having a huge ego and I knew him knowing he was my first would have made it even bigger. It's ultimately up to you. No one needs to know it unless you feel like you would like to tell them. To me it was a big deal but more in what it meant to me as becoming a real adult who was sexual. My partner didn't need to know about it. It was about me.",
            "No. Taking a virginity is a huge deal. It would be incredibly unfair if you told a guy after the fact “you took my virginity”. Any decent man feels an obligation to a woman whose virginity he takes. Springing that on someone is wrong.",
            "They would only be disappointed that you are a virgin because it means it will be harder to pump and dump you. So it would probably just filter out all the men who want to use you.",
            "I can't speak about other women but it is best to hide it among men.\n\nThere are some guys out there that fetishize virginity or will see you as a challenge to be conquered. The only exception here would be with the guy you're ready to have your first time with. By then it shouldn't matter to either of you.",
            "U will end up with someone who is similar to your persona. Which means it could be someone who is virgin or someone who would be completely fine with it, and not acting like a douchebag if they found out u are virgin.  I’m\n22 turning 23 and a virgin male and I never thought about “ohh I’m gonna make out with this girl tonight “ like a thirsty dog I’m genuinely waiting for the right person and by that I mean someone I’m gonna be with   For life.",
            "H-h-h HE** naw",
            "No don't lie about it. It's important that if someone knows it is your first time that they are gentle and ease into it. I've met plenty of people that were virgins until 23-25.",
            "Nah baby own it. When you find someone whose really into you (not casual relationship) then they gonna love that they are your first experience.",
            "Honestly don’t even hide it! There is some girls out there that’ll die to be your first! Also if you meet someone let’s say your girlfriend or just a random hookup and your honest not only will they love that but they wouldn’t stress or talk down on you if you didn’t know how to hit the “right” places. The way I look at it is if they know what there getting themselves into and they still hook up with you! That’s an automatic win for both of you. I wish you the best of luck man and don’t stress bro you got this I believe in you!!",
            "No",
            "I am 30+ and still a virgin. Don't focus on this type of shit. Many of those who have lost their virginity may not even be happy. In this world many of them are still in this superior and inferior race. They think making someone feel low or make themselves above someone will make them happy. Try to find happiness within you and be the real you.",
            "27f virgin here. I don't think anything is wrong with that. My whole life I was in survival mode earning money for food for my family, working on 5-6 jobs at the same time. I didn't have time for dating. There are different reasons for different people but you don't owe anyone to have any experience. Be honest, don't lie. If they're okay with that, try what you want to try, if they are not, move on",
            "Virginity is cool in this era.Because you can lose your virginity for some dollars",
            "No",
            "It's best you tell the truth about this. Otherwise, you risk blaming the guy for something he didn't do",
            "No",
            "Trust me, even if you do it will be obvious. If it makes you more comfortable, touch the fact when he does, if he doesn’t just act normal and say nothing about it",
            "Only women would laugh at you. Most men get off on it or don’t care…. As a 24 year old i lost my virginity a few months before i turned 24, he was so overjoyed and turned on by it (like the other ones i dated before him we’re also very turned on but only wanted sex) it was creeping me out. We’re still together cause he’s sweet and cares for me nonetheless but if youre gonna pretend youre not a virgin then do it to avoid men who want to pop your cherry for the sake of it and not because it’s “embarrassing”",
            "I won’t tell you the answer to this but you’ll easily come up with it on your own if you follow these two principles:\n\n1. “If you can’t fix it, feature it.”\n2. I’m [alarmingly] direct. \n\n1. If you can’t fix it feature it is to say if there’s something about you which you fundamentally can’t or won’t alter… is incentive for you to let people know it’s a thing about you! This particular thing will make you YOU and you’ll be surprised how many people will be endeared and even appreciative of that thing about you. \n\nRemember: there are three themes of personal abandonment most people don’t realize they live by: fitting in, settling down, and growing up. \n\n2. Direct and forthright communication is an awesome policy. Although it often takes lots of experience to realize this. So keep this in the back of your mind. Be completely direct with people. Be truthful. It doesn’t mean be harsh. There’s lots of ways to tell people in ways they can appreciate that’s true. Those who don’t like it, will at least appreciate you for who YOU are whether or not they want you around. It doesn’t matter to you because you won’t want to be around those people!",
            "No, you should be yourself.",
            "Forget your age 21, 31, 41 it does not matter in the slightest what age you loose your virginity in my view, 23M. I would not be disappointed, laugh or act weird learning this. And it certainly wouldn't ruin anything for me. Don't be embarrassed and don't pretend just to fit in.\n\nYou should grab yourself by the neck and stop being ashamed of being innocent. Every decent man worth spending your love and time with will treat you and your body the same virgin or not. With passion and care, you telling them you are a virgin I would assume is only a good thing. A man will better be able to pleasure you knowing what you have done before.\n\nI personally like to take it 4-5 times gentler and spend 2-3 times longer on foreplay if my partner is inexperienced. What I'm trying to say is a decent man will treat your body like that of a woman they are deeply in love in an effort to protect you and guide the experience.\n\nIf I dated a woman I knew was a virgin. When we had sex for the first time I would treat her like my wife of 5 years. As opposed to if I dated a woman I knew had 15 bodies and over 1000hours of sexual experience, when it came time to have sex for the first time with her I would be far rougher and much more bold with what I do.\n\nTLDR \n\nAt the end of the day it's not that deep. If a man loves you he will take care of you in your own preferred way. Make sure to communicate atlot and not to be afraid of the unknown. Also fuck your friends are assholes if they genuenly bully you and make you feel bad for being a virgin.",
            "No.. i didn't lose my virginity till I was 25 there is no age on this. Don't succumb to peer pressure; Be yourself and when the time is right with the right person you'll know. The biggest thing is to find somebody who you're comfortable with and then let them know that this is your first time and if it's not the first time they're a good person, they'll take their time with you.",
            "Listen, no. You'll be fine, and honestly, you may not have to tell them. You don't have to volunteer the information, but don't lie",
            "I think you should because of all the predators out there. Just my opinion though",
            "Religion is still a huge part of many peoples lives, many of those religions do call for celibacy so no one who is mature in that part of their lives will not care. One of my favorite comedians (Akaash Singh) and his wife were celibate until their marriage. Many people are that way. It’s up to you on when you want to do so. Ohh and also, don’t lie about it. If a guy treats you differently because of it, either way, good (to a point) or bad, it should be a red flag….",
            "I have that same thought at 25 , but there’s no need to lie. I wouldn’t straight up tell every guy that I’m dating on the first date this. I am open about it with guys I’ve actually been seeing for a bit. They honestly don’t mind some find it admirable. There’s other things that can be done without inter course (when you’re ready of course .) not to sound cliche but the right guy will go at your speed!",
            "My friend pretended *he wasn't a virgin*. I've never heard someone brag about having sex more than him, so we all knew he hadn't actually had sex.",
            "Dont tell them if you are or are not. No shame in being one. You have to chill. You are one in your whole friends circle who stands out from the rest which is a good thing. You dont have to sleep around. Common in this socienty isn't always the best or healthiest. By standing out from the crowd you are making yourself rarity. You should be proud ur not like everyone else. I always thought being like everyone else will make me feel normal but no.",
            "You’re too young for this to be a problem. Anyone that acts like that at your age is an absolute weirdo. Just gather your things and leave. It’s perfectly fine to be a virgin at 21.",
            "It's more good to be a virgin until you are married. That way you can dedicate yourself to your future spouse.",
            "Virginity is a social construct anyway. If someone’s really cares that much about it you shouldn’t hang with them, it’s just immature.",
            "If you're a guy, always lie about this, no way she can really find out.",
            "I was a virgin until 20, and I told the first guy I was with that. It made the experience a lot better since he knew. Don’t be afraid to tell people you are a virgin, if they get weird about it then they aren’t worth it anyway.",
            "Yes pretend",
            "Unless you're going to date Walmart-brand Christian Grey, it's not going to be a problem. Hell, it's even a fetish for some guys (not me though, I lost my V to another V and while it was amazing at the time, it's not even close to how good it is now I know myself and the female body better, and have been with partners that also know that).\n\nThe most important factor (IMO) is communication, so you should not only pick a person that you're comfortable talking freely to, but you must also cast aside any shame/fear while in the act. The best sex is had when both parties can say what they are/aren't enjoying, and/or giving directions to the other.\n\nBeing a virgin just means you are inexperienced, which means you don't know what you like and how you like it (+what/how he likes it either, but that's for him to say). Be clear in communicating what's going well and what isn't, and whenever you don't know what to do, follow his lead.",
            "if you were a guy then yes but your a girl so no it wont effect anything.",
            "I would say if your a girl and you able to stay a virgin up until 21-22 you did pretty good. I’d say it’s acceptable until like 25 then it’s kinda like a red flag 🚩. Unless there’s a valid reason like say you have cancer and where doing treatment for like 5-6 years",
            "No it's ok to be a virgin. Hey you want to go out sometime lol",
            "after reading this I can see why no one wants to lay with u 🤡wtf r u complaining about..",
            "Yeah you don’t need to do that at 21 at least I don’t think you do lol",
            "You can't assume OP isn't surrounded by immature people",
            "Exactly most guys prefer Virgin girls more ",
            "This is the way",
            "Porn videos did help me during my first time. I mean they knew I was a virgin but at least I got feedback that I wasn’t terrible",
            "also, as fucked up as it is, a lot of guys seem to like when a girl has little/no experience. coming from a woman who lacks experience herself lol.",
            "It's not that he's too old to be a virgin. It's toxic masculinity. He probably hangs out with guys who make fun of virgins, so he feels insecure about it when, in reality, he's fine the way he is.",
            "It’s disgusting that men put value in a woman’s virginity. OP don’t date a guy like that, but don’t lie either. No one sane or worth your time will care either way",
            "It’s a girl",
            "The cornerstone of masculinity is self-improvement. Always be learning. What is toxic about that? It's only toxic to women because they think they're perfect just the way they are.",
            "Lmao you’re a 304 confirmed if you say that. It’s good to be a virgin",
            "Yup and still young enough where it’s not a big red flag.",
            "Not sure what that means. Being a virgin is neither good nor bad, it simply just is neutral. Anyone who views it as good or bad and cares that much about it should have their opinions disregarded",
            "Its researched and proven, pair bonding",
            "Humans have a lot of flexibility when it comes to their sexuality. We’re not swans who mate for life, we’re all much more complex than that and to deny that would be willful ignorance",
            "I prefer to trust scientist with peer reviewed studies over some feelings you have",
            "Humans can and do pair bond in the sense that we often choose life partners, but virginity has nothing to do with how humans specifically pair bond. Plus, not everyone is monogamous, chooses to have long term relationships or chooses to have relationships at all. If biologically we pair bonded and virginity mattered that much, you would not see polyamory, open relationships, cheating, or casual sex like you do everyday amongst every culture in the world.",
            "Okay then send me your “peer reviewed studies” 🙄 you can observe with your own two eyes that humans don’t mate for life. I’m monogamous btw"
        ]
    },
    "Girlfriend shared a room in a hotel with her male best friend without telling me": {
        "title": "Girlfriend shared a room in a hotel with her male best friend without telling me",
        "score": 79,
        "url": "https://www.reddit.com/r/dating_advice/comments/1dlfc1n/girlfriend_shared_a_room_in_a_hotel_with_her_male/",
        "content": "OK so to confess she's an ex girlfriend. But at the time was a girlfriend. I'm reflecting on a lot of things. One thing she did only 3 months into the relationship was she went to a gig in another country with her best friend who's a guy and apparently has a girlfriend. \n\nShe got a hotel with him and they shared a room to save money. Fine, fair enough, that's reasonable. \n\nThis is where things get shady for me. She never told me they'd be doing that or asked if I'd be comfortable with it. I find out because she posted a instagram story with her in bed and he's asleep in what appears to be the same bed.\n\nWhen I confronted her, she firstly started gaslighting me. Saying it's not a big deal, I'm insecure, I don't trust her etc etc. She then said that they pushed the beds apart before but it really didn't look like it from the instagram story. She then lied and said his girlfriend doesn't see it as a problem but then said she's never spoken to her.\n\nAnyway, afterwards, I gave her the benefit of the doubt and understood that we make mistakes and felt like she probably hasn't cheated but poorly communicated and tried to claw herself out of a hole. \n\nAfter though, which is not related to the breakup, I spent quite a few months being paranoid that she was cheating and had a lot of anxiety about it. There were small little things that happened that made me instantly jump to conclusions that she's cheating even if she might have not been.\n\n1 being she worked as a stage hand at a music venue. She brought home some flowers one night and said it was from the venue cos they were going to throw them. 2nd time was she found a random guys shirt in her room and didn't understand where ir came from, but she actually showed it to me. Would a guilty person show it to someone deliberately? She said the next day she brought it into work and asked a colleague who said it was from the lost property section and she must have taken it from there.\n\nIt took me a while to trust her, but I was deeply convinced she was cheating until so many months had passed and nothing weird like that ever happened again.\n\nWe eventually split up 9 months after this for completely different reasons. \n\nUpon reflection, she's showing signs she wants to get back together but I'm not currently taking the bait. \n\nHave I dodged a bullet here? Do you think it's likely she cheated or am I being paranoid / insecure? ",
        "num_comments": 93,
        "comments": [
            "Welcome to /r/dating_advice!\n\nPlease keep the [rules](https://www.reddit.com/r/dating_advice/about/rules/) of /r/dating_advice in mind while participating here. Try your best to be kind.\n\nReport any rule-breaking behavior to the moderators using the report button. If it's urgent, [send us a message.](https://www.reddit.com/message/compose?to=%2Fr%2Fdating_advice) We rely on user reports to find rule-breaking behavior quickly.\n\nThanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating_advice) if you have any questions or concerns.*",
            "I think you dodged a bullet here. It's obvious that she's lying and trying to spin a story since she can't keep her story straight. She also manipulated you and deceived you. Even if she didn't cheat, I'd consider that complete lack of communication to be a red flag. ",
            "Once she caught an attitude about you catching her omitting a detail like sleeping in the same bed as another hetero dude and gaslighting the absolute fuck out of you...it was over. She didn't respect you and was playing in your face. You absolutely dodged a bullet. Ain't nothing insecure about wanting your partner to not sleep in the same bed as someone of the opposite sex. Nahhhhhh...she tried the fuck out of you with that shit lol",
            "As a female who has had several male besties in the past - I have never, ever dreamed of sharing a bed with them. I also would tell my boyfriend about sharing a room with my bestie. She cheated.\n\nShe also habitually lied. why do you want to go back to this?",
            "How many times do we have to hear about women f*cking thier best male friend, but when a guy sets up some boundaries, then they get gas lighted as insecure.\n\nThe guys who are totally happy to be a best friend with a women with a hope of getting sex is a 100% certified loser, because deep down they know they are being used and are OK with it, because they don’t value themselves.",
            "Your first point of her sharing a hotel room with a guy best friend in a foreign country to save money would be enough for me.\n\nIt is not reasonable at all, and it is all downhill from there.\n\nI don't know her. Maybe she is a bit of a free spirit, and she is a faithful person.  BUT, the doubt she will continually bring into any relationship through her actions will be exhausting and upsetting.",
            "Sounds fishy man, it's in the past, don't lose anymore sleep over it. I would have drawn the line at staying the night with another man without any form of prior communication, it's a breach of trust if you're in an exclusive relationship. Finding a shirt, unless you believe it materialized there, she either brought it home at some point or had someone there. Saving money on a room is one thing, does she not work with any other women she could have roomed with?",
            "Sorry mate but they fucked that night. You followed your gut and didn't accept the rebound, please stick to it",
            "She’s an ex for a reason (sleeping in a bed with another guy and of course not telling you).\nBlock her. Burn that bridge to the ground. Move on.",
            "She definitely cheated… thats why she gaslit you.",
            "Idk, honestly. She should’ve been upfront with you about the room. The other stuff doesn’t seem like a problem to me. So why did you guys actually break up?",
            "[deleted]",
            "yeah no  its not ok.  \n\nshe was giving him platonic blow jobs.\n\nhere is how u judge of something is ok.\n\nunless ur there just to fk, if she shows unwifey material behaviour, bounce.\n\nwoiuld ur mom go on a trip with her male bff and sleep in the same bed as him?  no??  then she aint wifey material.",
            "Any sane woman who cared about her relationship would tell you she was going to sleep in bed with another man. I wouldn’t let her back into your life again.",
            "This is my personal view, but I really used to hate women or rather girls that have best male buddies as their friend. How annoying to deal with all that by being constantly compared and them talking secretly to each other..\n\nI couldn't think of anything more annoying than that. I'm surprised some young boys are willing to keep up with this bs.\n\nYou have dodged a bullet, but not because she might have hooked up with him, no.\n\nYou dodged it because she seems to have an awful personality, especially trying to gaslight instead of reflecting the issues that you have concerns as her boyfriend.",
            "sounds like youre better off. Take it as a lesson not to date girls like that and move on",
            "No, no, no!  Not a good person 😕!",
            "Lying about it is the first red flag. The rest of it is just the cherry on top. Been with too many dishonest woman and it isn’t worth it, don’t go back!!!",
            "Purposely posting a social media picture of her in bed with another dude is insane. She's provoking you to break up with her and you completely whiffed on it, crazy to be so naive, and even crazier to be so utterly naive that you'd consider getting back together with her even after this \"reflecting\" you're doing",
            "I'm coming from a different perspective from everyone else. People saying she 100% cheated either have limited life experience or have been hurt before.\n\nDo I think she cheated, no. She hasn't hid anything.\n\nDo I think she has done wrong. No\n\nShould she not do it? Probably.\n\nI have a group of friends that are pretty much family at this point. We have all known each other for around 16 years, we all grew up together. It consists of men and women and most of them are now married with kids with a few engaged. \n\nWe are all super close and I have shared beds with some of the women many many times in a totally platonic way. We know it's platonic, we don't see It as \"I'm a man, you woman, sharing bed bad\" we are adults and totally capable of laying next to the opposite gender without our ape brains taking over.\n\nThat being said, just because we are comfortable with it doesn't mean others should be. From my experience our group has a super unique experience and are bonded through good times, bad times, trauma, death, time and understanding. But I see most people do not have anything like this. So even though we know and care for eachother deeply that sleeping in the same bed is a null issue and never crosses our mind as a weird thing. I am fully aware I come from a pretty unique perspective and if I'm in a relationship, try to avoid this happening for my partner's sanity.\n\nThat being said if I had to fork out say $300 for an extra hotel room. You can for sure bet I'll be sleeping in the same with a friend from opposite gender.\n\nPeople are saying you Dodge a bullet, I disagree. It seems like she's open and tells you and shows you everything. Just bad judgment every now and then.",
            "Come on dude. She slept with him. Nobody is going to stay in the same hotel room with an opposite sex best friend, without telling their partner and engage in non-sexual behavior. ",
            "At 3 months if you were commited, she should have told you in advance.  All u have is her word and the only response you know is because you saw it on social media. She said the beds were apart, but the picture didn't show it.  I'm sorry, but I would have ended the relationship right there.  Open and honest communication, as well as taking your partners feelings/emotions into account before doing something are essential to a successful LTR.  Yes, your partner sharing a hotel room as a person of the opposite sex without mentioning it is definitely not being open and honest in communication and not trustworthy. How many other things has she done that u haven't stumbled across that she hasn't told you about?",
            "Bro, yo’ girl was a ho",
            "Thats a hard no from me dawg.",
            "They fuck, 4 times easily",
            "who cares, she is a \"OK so to confess she's an ex girlfriend.\" move on and stop worrying about sht like this.",
            "She belong to the streets bro",
            "Instinctively, you know it was a shady deed. \nYou are right. You have dodged a bullet , to quote your words",
            "She didn't cheat. All these things are tests to see how you'd react. Maybe she had problems with a controlling boyfriend in the past and wants now wants to 'claim more freedom'. If someone is cheating, they try to hide it. Nevertheless, it's hard to deal with all this stuff thrown at you, but I do believe it can be worked out.",
            "Listen from personal experiences from 3 very suspicious relationships in my life. There isn't really a thing called being directly insecure brother. For me and at the end of the day you just want to make sure the relationship you are in is safe and secure, bc that is what men need. A long story short, don't trust your girls male best friend until you two have met alone and spent a day together. Highly reccomend btw, you can tell alot about your girl by how their friends act when they're not there, also you might get a friend for life something i was fortunate to do in one of the instances in my life. Other than that, don't ignore your gut feelings in a relationship, doing that often gets you bit hard",
            "Get in touch with the Don Juana aka The mail friend and ask him upfront. Also become his and his GF follower to see what gigs they up to.",
            "Always trust your gut.  She was cheating.  \n\nTo be somewhat fair.  If a person is not putting up reasonable guardrails to protect their relationship they will eventually cheat.  Human sexual desire is innate.  No one is above reproach!\n\nSo if monotony is very important to you.  (It’s not for everyone). Talk with your partner about what guardrails you expect of each other.  Especially if one or both of you travel for work.  Probably the most common time people cheat.",
            "Men are not paranoid and insecure. Men do not engage with weird people. Sure some men must defend their family, their city, their country and themselves from weird toxic people.\n\nLove yourself and defend yourself like a soldier would defend his country from an enemy.\n\nDo not get in relationships with toxic evil unless you’re in the CIA trying to get intel on the enemy.",
            "Women don’t really have straight guy friends. They have guys they’re not attracted to who are hoping they change their mind or guys they’ve slept with who didn’t want to commit.",
            "I have male friends that I shared a room with in similar situations while having a boyfriend so I don’t think it has to mean anything. These are friends that I know since a very young age and there have never been any romantic feelings from either side ever.  However I do think these things should have to be discussed in a relationship. My boyfriend knew my friends well and did not have a problem with it. Honesty is important to me in a relationship. I would be more concerned about the lying if I were you.\n\nThat being said. Stop winding yourself up about possible cheating. First of all the relationship is over. Second of all if someone does cheat it does not say anything about you (but everything about the cheating person). And lastly you cannot ever controle someone. If someone wants to cheat they will do it anyway.",
            "If someone's not gay, and their best friend is not gay, but their \"best friend\" is of the opposite sex, always run.",
            "It's funny how grown adults don't ask permission to do shit when they know they're trustworthy. Then when their partner freaks out they backpedal and lie just like kids do when they know their parents won't approve or didn't grant permission for something. Work on your trust issues before you get involved with anyone whether it's this ex or a new person. You seem to spend a lot of time imagining worst case scenarios and that's not a healthy way to live.",
            "I think you sound paranoid but maybe there’s more to this than what you’ve written. Should she have told you about the shared room? Definitely, but it doesn’t sound like they shared a bed (you’re just speculating). If they did, that’s suspicious but I have male friends where we could do that platonically just like with my girlfriends.\n\nThe flowers thing makes sense for throwing them at the venue. Crew always leaves with something in those cases, and someone taking flowers home is better than throwing them out. For the shirt, if it was someone she was seeing who left the shirt she’d be the dumbest cheater in the world to be asking you about it knowing where it came from.\n\nThe fact you’re thinking about this after you’ve broken up tells me…it was all in your head. Imo it sounds like SHE dodged a bullet cause jealous bfs are the absolute woooorst.",
            "I don’t think it’s a big deal",
            "Yeah I did think it was a red flag but I sort of let it slide that once. She then went onto to gaslight me more in the future as well as show signs of a lack of empathy towards people that then lead to her doing that to me. Probably have dodged a bullet.",
            "Agree, why put up with that shit, she didn’t respect you enough to tell you and you had to find out with her posting. That is some manipulative bullshit. Lying can be positive or negative in action, she didn’t tell you, when she KNEW she should, that’s lying to me bro.",
            "Maybe you're right there. Well we moved past all of this 9 months later but then broke up for different reasons. A part of me just thought she sucked at communicating and made a mistake. I'm not definitively sure if I do want to go back. I just constantly wonder if she ever did or not.",
            "I share a bed with my female bestie on the reg. In fact I’ve shared beds with many female besties over the years. Nothing ever happened.",
            "The fact that “insecure” gets thrown at guys like some kind of slur (especially on Reddit) is just appalling. There is nothing wrong with being concerned when your boundaries are violated.",
            "I very nearly did end it there. I just thought maybe she made a mistake in not communicating well. Well that's the thing, most of her friends are guys...",
            "This. She even took the post-sex selfie to prove it.",
            "That's good to hear, to be honest.\n\n Ah it's a long story. But to summarise. Long distance. Was meant to live in Germany with her. Had to go back home due to personal reasons. Funeral for a close friend, health scare to name a few. Which led to a serious burnout I was suffering from. I was due to fly back to Germany for her family's wedding. I told her idk if I can fly anymore and am mentally struggling with it, and she basically replied with a snide remark saying it was my own fault and then went to bed. I immediately tried to call her and she ignored me for the rest of the night. \n\nSo the next day, I in anger said I'm not going to the wedding. So she told her family to un invite me, and by the time I calmed down, it was too late I was un invited. That was ultimately the beginning of the end. A few more things happened after that but again it's a long story.",
            "Busted! Hope dumped the scum bucket.",
            "It's a difficult one because they were friends long before I was around. She did actually end up not talking to him anymore after that cos she knew it made me uncomfortable. However, here's another slight red flag. When we first got together, he told her he's concerned that she's rushing into something with me.\n\nAnd yeah I think you could be right about that. The funny thing is I haven't even told you the half of it. Though I'm far from perfect and could have handled things better,  how it ended basically proved that she has no empathy towards anyone. The gaslighting got worse. The thing that haunts me, though, is wondering if she ever did cheat on me.",
            "My thought process was maybe she posted it because she was innocent and genuinely didn't think she was doing anything wrong. It did make me look like a fool though for sure. I very very nearly broke up with her then and there. But I gave her a chance. 9 months later we broke up for something unrelated to that. We had some really good times, I don't think I will get back together, but I'm still always wondering if she did cheat.",
            "Thanks for the perspective. I can understand this. The only bit I don't agree with is the last part. The problem I had was that she didn't tell me. I had to find out from her posting a story on IG which I still find weird to this day. Which she then started lying and gaslighting rather than listening to my pov and acknowledged. It was an early sign that she has a lack of empathy. As I mentioned before she is a bit of a jekel and Hyde character. She can be open but not always. It would put my mind at ease for sure though if I knew that nothing happened.\n\nAs for the other things that happened 9 months later that led to the breakup, I'm unsure there's any way back anywhere or if I should even entertain getting back together.",
            "I nearly did tbh, I really nearly did. She said to me when we first got together, pinky promise we tell each other everything. She didn't uphold her end of the bargain.  And yeah that's my thinking. And if we was together in the future, would this happen again?",
            "Hmm possibly. I was her first serious relationship as guys in the past have basically just used her. So I did sort of give her the benefit of the doubt that it might just be lack of experience with these sorts of things. She's 28 and I'm 31 btw.",
            "Sounds like you have done kind of army fetish! Lol!",
            "Understandable. It requires a lot of trust in someone to be comfortable with your partner sharing a bed with someone else. I would have been OK with it if she was upfront about it early on. For sure the lying was a huge concern. \n\nI think I just wanted to hear different opinions on this because there's a few things that have happened in the past where I'm questioning my own judgement and if I can't see clearly, then I shouldn't dare entertain the possibility of getting back together. I think it's a bad idea anyway to go back.",
            "A part of me feels like this comment is gaslighting. If she would have asked, I would have been OK with it. It's the fact that she didn't ask or even just tell me. Then on top of that, rather than listening to my feelings and saying, OK fair enough, my bad, I will make sure to ask next time. She tried to lie and call me insecure. That's the things I couldn't shake. It took me a while to trust her after that. The actual breakup was 9 months later and had nothing to do with this. I was with her for 1 year. My relationship before that I was in it for 8 years with someone and I never once didn't trust her or was paranoid about her.",
            "Yeah sorry but there’s no scenario where I’d be comfortable with my partner sharing a bed with the “guy best friend” and NOT telling me about it, changing the story, and then calling me insecure. OP was 100% justified being worried the way he was and there’s no paranoia there lol. Would you be comfortable with your *male* partner sleeping with the “strictly platonic female friend”?",
            "The reason why I am thinking this is because I'm rewinding back to things and using that logic to see if it's even worth exploring the possibility of getting back together. But this particular thing is something I still think is a mystery, so I wanted second opinions without bias. \n\nWe broke up 9 months after this. We was together for a year and we broke up because of something completely unrelated to this. \n\nBasically long story short. I was supposed to live with her in Germany but some personal stuff happened to me like the death of someone close and a health scare that I had to go home. I was supposed to go to her family's wedding a few weeks later. It took it's toll on me and I suggested to her idk if I can do anymore flying. I had flown so much in a 6 weeks. She gave me a snide reply saying it's my fault 😅 and then went to bed. And I tried to immediately call her and she ignored the calls. \n\nNext day in anger I told her I'm not going to the wedding. She told her family to un invite me. I calmed down and by that point it was too late I was un invited. That was the beginning of the end. More happened but I won't go into it. \n\nIn summary though. I made mistakes like a human being with feelings would. But she had zero empathy for anything I was going through.\n\nFair points about the paranoia. Personally I think for me to have the view points I have are reasonable and judging by the responses on here, many agree. It's a grey area where it could be completely explainable or it's cheating. That's why I asked it on here. Also, I'm not \"just speculating\". I saw the video on her IG story. The beds didn't look apart at all. It looked like the same bed. No it wasn't 100% conclusive, but it appeared that way and didn't add up with her narrative that they \"pushed the beds apart\".",
            "That lack of empathy is huge. There is no working with someone who lacks empathy. And if they do they might also lack remorse which is a perfect recipe for a cheater and abuser.",
            "Imagine you go back together after this whole thought process. It's not gonna be easy for sure. Just move on and learn what you can from this.",
            "What does your gut tell you?",
            ">A part of me just thought she sucked at communicating and made a mistake.\n\nbecause ur an idiot. lol",
            "You did the right thing in breaking up then. Best things to move on and do your best to get her out of your mind. It will be easier in time",
            "I do not understand the psychology of why she (and people in general) do this",
            "Curious what reasons you would have for getting back together with her? She doesn’t seem very nice.",
            "Stop wondering. She cheated 200%. Even if she didn’t cheat, just sleeping in the same bed with another man is a non starter for me. I don’t care if they are long time friends, school mates from 1962 or even family members! An adult male and female should not be sleeping in the same bed unless they are “together”. Get rid of her man. She is trouble. And then gas lighting you??? Seriously? You don’t need that! Get rid of her pronto. There is no future with a person like that. None.",
            "Ah yea I see. I guess the thing is to her it may be a null issue. So she didn't think to tell you. If she did something sinister she wouldn't have posted it on IG. Again though even though it may be a null issue to her, she does need to understand that not everyone is comfortable with scenarios like that and that she should have maybe thought about your perspective and should have told you first. But this (at the time) was a new relationship so you can't know each others perspective on everything. These sort of things can be fixed with a conversation on understanding each other's perspective and respecting it. Then at that point, if she didn't/ Dosent understand yours and respect it. Then it's a red flag. The ideal outcome is you guys talked about it. You said it's fine to do that but tell me first next time. Then if she said \"that's fine I will\" then the problem is solved. \n\nAt the end of the day life is unpredictable and so are relationships. It just comes down to do you like this girl enough and can you have open conversations and get through rough patches together. I know people that have been married for like a decade and misunderstandings and lack of awareness of eachothers perspective still happen. One of my best mates (female, not part of my group) has a husband who I now know well. From the outside IV always seen their 14 year relationship as perfect. He always treated her perfectly, super nice guy always spoke highly of her. Long story short, They had their first child, 6 months after i get a phone call at 4am. He cheated on her. All unraveld that he was super depressed, was a secret alcoholic and was contemplating suicide. He went to theropy, they went couples theropy and now they good.\n\nMoral of that story is life is unpredictable, people are unpredictable, understanding people is hard, you can't control anyone, you can't be inside someone else's head. Relationships are work, not just at the start but the whole time. You just have to do the best with what's in front of you now. If you don't realise relationships are work and expect them to be all flowers and rainbows, your not ready for a relationship and you need to work on you. \n\nDo you think you guys can be open with each other with eachother? Do you think you'll be able to curb your paranoia? If the answer is no to one of these then move on. If it is yes to both give it a shot.\n\nI lost an amazing relationship because of my own paranoia (was a druggy at the time to be fair) and I was wrong about all of it. I hands down would still be with her now if I was older and wiser at that point.\n\nIV been where you've been. Don't end up like me and alone in your mid to late 30's because you're scared about getting hurt or worried about things that may never happen. IV pushed away a lot of women that loved me because iv always assumed they would inevitably hurt me. Taking the risk with the potential of getting hurt (which may never happen) is way better than nearing 40, living with another man and wanking yourself to sleep every night.\n\nGood luck, whatever you do I hope it works out.",
            "Find yourself a good woman that is open, honest, communicates well and doesn't fight. One that thinks about you, your needs/emotional/mental and does everything she can to meet those and make you happy.  I put my partner 1st(well, behind my kids so 2nd) and me last. My partner being happy is more important than me saying or doing anything that would upset them. It's very hard to find someone like that though and I won't get into a relationship where that isn't present and will end one if it changes.",
            "Say no to ganja.",
            "For the love of cheese stop overusing and misuing the word gaslighting. \n\nGaslighting is an extreme form of emotional abuse that occurs over time and involves making the victim think they're crazy AND making everyone else in the victim's life believe they're crazy while isolating them from their support system. I'm not doing that to you. You're not being emotionally abused by my reddit comment. There ARE people who have been through gaslighting and their experience doesn't deserved to be belttled by people who have no concept of the experience or who feel like maybe someone has a different view than them and is trying to get them to consider another perspective. \n\nI no longer have any desire to help you.",
            "If I trust him then I would not have a problem with it. I've slept in the same bed as a half dozen close male friends and managed not to ever fuck any of them so I'm well aware it's not difficult.",
            "German women are a bit fucked up. \n\nThey’re all kinda weird tbh. But the women are something special.",
            "I think you're right. I do wonder if she is a narcissist tbh. But the warning signs are there. I did sometimes get a gut feeling too. I think I definitely need to walk away.",
            "Nothing at the moment. It's hard to say. But previously before I had several moments where I had a bad gut feeling. So maybe there's my answer.",
            "I think she's a bit of a Jekyll and Hyde character. I did have some great memories with her. I do wonder if it was all a lie. But it's hard to shake it and it's exhausting to have to start again getting to know someone all again. So maybe a part of me thinks it's worth being open minded. But there are some big things she's shown that she isn't a nice person, absolutely. I just hoped that she's made mistakes, just like I also make mistakes and that she didn't mean to be like that. Idk.",
            "Yeah you're spot on. I think the issue before was the lying and gaslighting. But it doesn't mean she cheated no. It's a grey area I think. Relationships are hard work, ours really was. People are complicated and our relationship was complicated at many times. \n\nThere is a lot more to this than just what I posted but this was the incident that I still wonder about. But isn't the reason we split up 9 months later. That's a whole different issue which I might end up doing another post about tbh.\n\nThanks for the advice mate, really appreciate it. And I hope that it does work out for you. Keep bettering yourself and building up the confidence, be out as much as possible or try a different approach to life and I'm sure everything will work out for you. Seems like you're from the UK, I know how hard the dating scene is in the UK atm.",
            "Good for you man. That sounds very healthy. Empathy and openess is definitely the traits to look for absolutely.",
            "For a lack of a better word I should have added. Well tbf, your original comment wasn't that helpful anyway.",
            "Dude my last ex was like that. Her being the most attractive I ever had also played into the rollercoaster of emotions she put me through. Having a stupid \"I can save/fix her\" complex didn't help. Combine it with her subtly implying that I'd never get better didn't help. \n\nAll I can say is a cold hard no contact is the best solution because otherwise she's going to drain what she can out of you until she finds something else. Doing it on your terms is the best option because if you wait until she does like I did it likely will lead to costly therapy.",
            "I don’t know how old you guys are, but I can say from experience and with absolute confidence - don’t settle cause you’re afraid to start over. Good things take work, but it shouldn’t be too much work. And it’s never too late to pursue finding someone who sees you, respects you and appreciates you. Dating is exhausting, I get it. But don’t settle. Life is so short. The world is too big.",
            "I agree lying is not great, but if you find me someone that is never lied to a partner, especially at early stages where it's just been months, I'll give you £1,000,000. We all got baggage, see things different and lie for different reasons (usually to come across as the person you want to be, but not quite there yet).The important thing is to talk about it and find out why she lied.\n\nAt the end of the day, you're on here asking for advice so clearly you're considering the idea. No one on here including me, knows anything about you or her or the situation. People just assuming stuff and screaming red flag, you dodged a bullet. Such a narrow view based on so much lack of context. But from where I'm standing, I'd give it another shot. Worst case, she turns out to be a piece of work and you waste a few months. Best case you end up marrying the best woman for you and you live happily ever after. In heinsight, I know the risk id rather take.\n\nYea I'm from the UK. 100% dating scene sucks right now. Thanks for the kind words. Did a bunch of therapy a year back (life's not been kind to me 😅).  I'm in a good place, got the confidence, learnt from my mistakes. Finally understand the dynamics of relationships and understand where IV gone wrong on my end. Not bummed out about being single or alone anymore and when it happens it happens. Super optimistic. Although I do wish I understood what I do now just under a year ago when my girlfriend of 7 years broke up with me 🤣 but that's life. Is what it is.\n\nHope it works out for you man. You seem like a decent bloke.",
            "It's not what to look for, it's what is necessary.",
            "Oh I'm so sorry my free advice wasn't up to your standards. No wonder you felt it was fine to call me a gaslighter.\n\nWork on yourself. You need it.",
            "Yeah agreed fully. It should be a requirement in any future partner.",
            "I am continuously working on myself thanks. Quite happy with how I'm developing in my creative ventures. I just don't really appreciate your stance.",
            "You: Am I being paranoid?\n\nMe: Have you considered...\n\nYou: GASLIGHTER\n\nYou only want to hear from people who will spout identical stuff that you want to hear. That's not how one works on oneself but you sure picked the right sub to post on as everyone else here, who has zero experience of being a woman with male friends or being  a male with close female friends, will tell you EXACTLY what you want to hear.\n\nBye.",
            "No I'm totally open to being called paranoid etc. Hence why I asked the question. I'm actually hoping I am being paranoid. It's your general attitude. Your original comment had a shitty attitude to it and dismissed how I was feeling. You can say I should work on my trust issues without being a dick about it and without the attitude. Your comment had attitude that wasn't needed.",
            "Dude, you’re not paranoid, the person you are responding to is delusional. Look at their comment history for 5 mins and trust your gut on this one.",
            "Free critique of how I choose to express my opinion! It's my lucky day! Thanks so much. \n\nNow you've called me a gaslighter and a dick all because you didn't care for my opinion, which you asked for.\n\nAgain---bye.",
            "Thanks dude yeah I think you're right there."
        ]
    }
}