{
    "DggWare: The Destiny community WarioWare game - DEMO OUT NOW!": {
        "title": "DggWare: The Destiny community WarioWare game - DEMO OUT NOW!",
        "score": 974,
        "url": "https://store.steampowered.com/app/2891600/DGGWare/",
        "content": "",
        "num_comments": 124,
        "comments": [
            "Oh my god, a punch the couch minigame",
            "Wishlist plz! Me and Gemzar are workin on this!",
            "Got Rhythm? minigame request",
            "I swear I read that as \"DogWarts\" at first glance and nearly had a heart attack.",
            ">Leaderboard for healthy competition\n\nlol that's not gonna last long. I look forward to Destiny grinding for the #1 spot and never quite reaching it.\n\nGreat job! I added to my wishlist.",
            "> blackstiny\n\n> say it",
            "I hope Brochiko is in it [Every Day Brochiko Waits.](https://www.reddit.com/r/Destiny/comments/13di5y/every_day_brochikō_waits_by_the_infestation_pit/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)....[But Steben never came](https://www.reddit.com/r/Destiny/comments/13f7uh/rip_in_peace_brochikō_rofl_sorry_i_had_to_3_xd/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button).... [Memories Forgotten](https://www.reddit.com/r/Destiny/comments/1akigi/now_i_remember/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) ...[Brochiko Returns](https://www.reddit.com/r/Destiny/comments/1a6srv/brochiko_the_return/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
            "Kind of feel like this is the type of game that would benefit if it was open source so we could get community add-ons.",
            "This game has a lot of potential. Maybe we need a separate subreddit just for this game discussion? I'm thinking r/ DestinytheGame might be a good sub name?",
            "hahaha the amount of references. \n\nlooking neat!",
            "AMAZIN, Wishlisted dggL",
            "Please add meme point shop \"stickers\" and achievents to steam",
            "Holy shit! We need a K9/11 dlc drop asap!!",
            "SO many cool stream moments and memes that can be added. \n\nLauren flair gunning a boat\n\nDestiny walking in on denims fucking in his bed, maybe a door opening mini game or something \n\nXqc saying something incoherent and you having 4 options with 1 correct answer. An incorrect answer would have destiny do the classic “IDK WHAT THE FUCK YOU’RE SAYING, X”\n\nSneeko changing his ideology, religion, dad. Could be similar to the changing outfit game\n\nDestiny trying to get Nathan to fall of the building in Dying Light, a button combination game\n\nLily trying to hit a Lux ult in League, Destiny giving the appropriate response to whatever happens\n\nMaybe a Botez/Destiny Chess or Poker meme? Yoda subs sounds are still available out there\n\nA “Still drunk” breathalyzer mini game? PepeLaugh\n\nA crowning the princess Ana game if she’s cool with it\n\nFor the black Ana, maybe a Blav game where you try to make Lav black as she gives her arguments? Not sure if that would be against steam TOS though. If she fails then have Ana call her a dumb fuck if something like that is available. \n\nAbas squeaky floors\n\nVegan gains mini game, lots of ideas depending on what you want to go with\n\nMaybe a Dan mini where he tries to not look at banned memes at the beach, but he might not approve\n\nA xqc mini game about [the call-in during rust gameplay](https://youtu.be/bTSR6-DhK2g?si=_Dzk_8o4APq-v-8v) where he says he needs advice because he’s too successful and good looking. Happens at 1:35. Could be him swatting women away at the club, involve some type of safety hazard. \n\nDestiny twitter mini game where you pick what Destiny would tweet regarding the situation \n\nUkraine Ana meme of dgg funding her to fuck Russia\n\nMini game of Hasan paving it on his own\n\nMaybe Hasan plucking worms from the ground or something, idk what the sound bites would be\n\nThis one’s tough but maybe a change my minds game because that video almost has 2 million views for him\n\nA CSGO or CS2 where you snipe targets with the “allauh akbar” meme, the most viewed video on the channel\n\nThe scammer guy NFT meme is an obvious one\n\n30/40/50% of college girls being flown out mini game \n\nBXB taking both destiny and hunter on and letting them both come at the same time [36:30](https://youtu.be/bTSR6-DhK2g?si=_Dzk_8o4APq-v-8v)\n\nThe Asian is white presenting meme, idk what a game could be for that but I’m just throwing shit at the wall. 40:15 https://youtu.be/bTSR6-DhK2g?si=_Dzk_8o4APq-v-8v\n\nDestiny making a manifesto, could be type racer where he has to type wild shit. \n\nA type racer game for dm’ing back women who spam message him\n\nDan, Jade, Destiny cat ceiling meme would be great \n\nI’m sure there are way more but yea. Going through destiny highlights from 2019 onward has tons of stuff. I look forward to playing the final product, the demo is very cute and fun.",
            "I'm undefeated btw. Eat shit losers",
            "This is so cool! I hope there will be a minigame where you have to desbelieve a troll. One D&D reference would be nice.",
            "Please incorporate a StarCraft mini game.\n\nPLEASE 😭",
            "Will there be a dogwarts minigame?",
            "This game made me realize I don't actually know all of Destiny's food takes, just that he didn't like sushi, or waffle cones. I keep losing lives on that mini game lel.",
            "Yee vs Pepe minigame suggestion",
            "Will there be a NFT creation game (from the command line naturally)?",
            "Wishlisted",
            "Looks amazing! Holy- \n\nI don't play pc, but if you ever made a mobile version I'd be the first to buy",
            "I'll play it after doing some more Fortnite and if it impresses me and doesn't cost more than $10 I'll buy it instead of the usual shenanigans",
            "only windows :'(",
            "This is peak autism and I love it. Already a 10/10.",
            "The game is a bit too - something for me. Too hyper? Is that a word? It's made with love though, I'm sure plenty of Dggas will enjoy it.",
            "Only feedback I'll give about the game is that the food take minigame probably should be removed, or fundamentally redesigned.\n\nIt simply is a game of rote memorization that you learn from only by failing in the game. Since Destiny's food takes are kind of erratic (Waffles are a yes, eggs are a no, so someone trying to intuit putting breakfast food on the plate may fail) it just serves to frustrate anyone playing casually. \n\nWhile the idea is that ideally players will learn over successive attempts at that mini game, anyone not playing it for a few hours will only ever interface with it as being a coin toss at best (and have the entertainment value of a coin ross). Add in once we are out of demo territory and that minigame shows up way less often, and there are way less opportunities to learn? It'll just be not that great any time it shows up. \n\nEvery other minigame is pretty obvious, and a learning experience will only ever go one or two games deep (Realizing you can SAY IT now that Destiny is no longer white might not make sense on your first game, but it'll make sense on the second), but the food takes game kind of works against that. \n\nEverything else is pretty great so far, but if you don't find a way to redesign the food take game it's probably better to be taken out. On a game like that, it's probably better to lean more on it being an easy pass (ie, as long as you get one food take right, it's a W) than it being an easy L.",
            "**Add the fucking cheeseball catch minigame**",
            "most possible dopamine concentration in a game",
            "Hey, Love the game so far. I only have one nitpick however. Please use a lower frequency sound effect for the menu sounds. When I first started it up it was destroying my ears. Menu sounds akin to Holocure's are probably the best recent example i can think of as a default.   \nMaybe down the line add in some cute achievements style unlockables for skins, backgrounds, sound effects and the like if thats something you guys wanted to do. Something like destiny's love for arpeggio's would be cute, or ff7's menu sound effects or something akin to it, add in a gallery of some meme art if you can get into contact with some of the artists. There's a ton of things to pull from and im excited to see more of the game!",
            "I can't get the rest of the minigames. How do you unlock them?",
            "August should release a video in the second channel of tiny playing the demo.\n\nIt would better advertise the game (+more wishlists), and it's great content.\n\nI'd tag him if I knew his reddit handle",
            "This is truly the best community ever. ",
            "This needs to be on speedrun.com",
            "I'm *so* **hard** rn.",
            "I thought micro-games were a lame idea, but this game is fun. Maybe I should check out the Wario games.",
            "Vowshs voice, I can't\n\nHe truly sounds like the manchild he embodies now",
            "Are there a lot of unwinnable situations for microing infestors? it seems like i'll get marines on both sides of me and there's no point to even trying to get away.",
            "[deleted]",
            "I don't really understand the starcraft one .. do I have to run away and get behind a stone?",
            "I didn't think I'd care for this game, but I've sunk some time into it, and I'm sold. Good shit right here",
            "I seriously don't understand what you're supposed to do in that food game. Can somebody help?",
            "In the orbit minigame, there were two occasions when I had a complete orbit and it was labelled an \"L\"\n\nMiscalculation?",
            "Too difficult for a pleb like me, but great job",
            "This is fucking amazing.  The punch the couch minigame wins the Internets.  Absolutely amazing.",
            "If you guys want, I'd love to help out in the coming months when I get more free time from my other projects and responsibilities. I'm not sure if you guys are taking any newcomers. Because WarioWare is one of my absolute favourite games of all time. I'm actually shocked seeing this game, it looks amazing. I'd love to help out in any way possible.",
            "Could have one where you have to !nuke an emote in chat. Not sure if it'd be funnier to try and nuke as many chatters as possible, or a tactical nuke to hit only one.",
            "I'd be interested to know how many copies this sells. \n\nAs a dev, collaborating with a streamer to make a tidy profit is an interesting idea.\n\nCool.",
            "lol",
            "God this gives me both ADHD and autism more than \"grid 16\" if I haven't had yet.",
            "pretty fun, the worst part for me was the Starcraft one, I don't really have any idea how that works, and then the food takes... I guess you just have to know 😂  \notherwise some of the games need extra skins, like the r / place dggL having different pics and stuff... overall really fun! I hope for more minigames, the audio clips are great but they get repetitive after the 5th try",
            "imagine being that much of a loser that you would buy a game with a groyper nazi (jstlk) as a character",
            "UH IRON MINING?! no thanks BRO",
            "why is vaush a baby now did he not want his voice to be in the game?",
            "Both Vaush and Mike no longer have their voice clips in the game. Which fair enough but it does end up meaning those particular mini games aren't as fun.\n\nAlso suggesting a Disarm Immediately! and also a Moot smash mini games as well to add to DGGware",
            "im good",
            "I'd play this",
            "!check",
            "Who else always says it?",
            "Whatadogshitgame",
            "Not a mobile game. Sorry won't play",
            "That is the only meme I don't get, could someone explain?",
            "Thats sick man, enjoyed the slug fun!",
            "Good luck, it looks awesome!",
            "What the fuck am I looking at?\n\nYes, sure, wishlisted. Godspeed you crazy bastards.",
            "Done! This is awesome, Warioware was my favorite Nintendo game way back.",
            "This is excellent!\n\nIf you want any more inspiration, i made some 'flash' games based on the dgg community back in 2016 ,and posted on my itch here:\n\nThis could be a fun one that I didn't see on your demo: https://hephaestus_rg.itch.io/meme-defense-nightly-game-13\n\nYou've got my full permission to rip/copy/steal whatever you like, this is awesome!",
            "first post in 2 years Aware... glad to see you back, and can't wait to try out the game once I'm home 😎🤙",
            "love warioware this looks totally sick!\n\nsidenote: is this legally in the clear? with likeness and audio and stuff? I don't really know how copyright works",
            "This looks sick man",
            "Anything under 900 is an L though",
            "This needs to be a minigame.",
            "I feel like leaderboards in modern games are just tests for the best scripts.",
            "Holy shit you're THE guy! You own!",
            "Long time no see Brochiko <3",
            "This should be higher",
            "If there's no K9/11 minigame I'm gonna riot... Wait, is there a game about mowing?",
            "DLC? This is still in beta my guy\n\nI'm hoping for some Aba&Preach love when the game releases fully!",
            "Thanks for the suggestions! I've seen a lot of suggestions in the thread of games that have already been made. There sure are endless memes to pick from.",
            "> Lauren flair gunning a boat\n\nJesus fucking christ...\n\n*make it*",
            "lots of these sound really funny lmao do it",
            "[pepelaugh](https://imgur.com/5wYWWpk)",
            "There is one",
            "Can't you use Proton or Wine for Linux or Wineskin for Mac? Or are you referring to no mobile app?",
            "Good feedback! I think an easy fix is just allowing more mistakes so if you at least know or learn a couple food takes it's a bit more lenient.",
            "I can change the menu sounds! I'll probably look over all sounds at some point. For the other stuff, we'll see. For now I'm just focusing on making the game.",
            "There is just the demo for now. Full game is still being worked on.",
            "There will be balancing changes of course, but at higher levels things will eventually become kinda impossible. The game is not supposed to be played indefinitely.",
            "In those situations, you need to charge the marines on one side and wipe them out. There've been situations which I would've thought were impossible but which I was nevertheless able to survive this way",
            "[https://www.youtube.com/watch?v=CAEz4LzGf90](https://www.youtube.com/watch?v=CAEz4LzGf90)",
            "You can run, but you can also attack when they get close.",
            "I am aware, this happens because of the way the game checks the orbit. I can probably find a way to make it more precise.",
            "https://preview.redd.it/scilzil7qvwc1.png?width=1434&format=png&auto=webp&s=4a0c2824b3051c08b623ff970fca8e9be5a34310\n\nHere's a screenshot of a recent example, if it helps.",
            "https://preview.redd.it/rws6cbbju8xc1.png?width=1257&format=png&auto=webp&s=850566c5248f3272f67f5a8415225c6a52b80f47\n\nAnother example. The planet started where the cursor is and made a full loop around the sun and only crashed into the sun like two seconds later.",
            "https://preview.redd.it/1ll2cvwr0ixc1.png?width=1188&format=png&auto=webp&s=f7c88a4384333a4bbf4ea15ec53fb6da3bccc06b",
            "4 festor minigame is ez. when in range click on the marines to cast fungal growth by clicking. in stuns and deal dot in aoe. kite back, repeat.  \nMinigame is somewhat deceiving, you don't have to kill the marines, it's enough if you survive for the given time.",
            "tuotuolily has 5 Biden Blasts remaining. They have not chosen a side in the eternal YEE v PEPE war.",
            "wrong opinion",
            "[Clip](https://youtu.be/y_UST4RlBzM?t=3979)\n\nContext: Mike from \\[redacted\\] is getting bullied by his friends, and being emotionally immature, he does not put his foot down and defend himself. He instead punches a couch a single time to release his rage.",
            "Search MikeFromPa punchin Couch and ull find it ^^",
            "The only one I don't understand is the \"Aprils, go! Mays, go! Junes junes junes. Haha! That's what I like to see!\" thing as you're clicking random spots on Destiny's face while some red-eyed wraith looms over him. What the fuck is the context lmao",
            "Its a tale as old as time.\nMale insecurity.\n\nThat said, Mike will always inspire me to follow my dreams. If that fucking loser can somehow \"make it\" in this world, maybe even the lowliest worm has a shot at true greatness. \n\nYa know?",
            "I wanna say I've been touching grass, but...",
            "We'll see. Destiny didn't really voice any concern when I brought it up to him but I might decide to remove some stuff anyway. It would suck if it became an issue down the line.",
            "I could see that being a memory game where a dog and some [cats](https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2Fcywzhncfimp31.jpg&rdt=63984) go in and out of some doors, and you have to memorize which one the dog ends up in at the end.",
            "<3",
            "You guys are awesome, keep it up",
            "Why even live",
            "🤯🤯🤯🤯🤯",
            "I would also say the food minigame needs some work, maybe add some mechanic so you get a hint whether the given currently held item belongs in the trash or not after some time (this way it'd be less about luck and memorization while still punishing not being familiar with the food takes)\n\nOther than that, I feel like it just needs some more minigame variety, which you seem to already be working on\n\nHope this feedback is of some use, it's a fun game!",
            "Sure you're being asked this a ton but are you open to anyone helping out with the game? I've been making Twitch interactive games for streamers and I'd love to help out with this.",
            "Any rough idea on when the full game will be released?",
            "<3",
            "yeah usually when I click on them I'm too close and it just leads me into the fire, killing the festors. but alright, so I'm casting a spell, thanks for the tip! 😂 it's just hard kiting when they're nearly the same speed as me. I'll have to try again",
            "I think he wanted to communicate that he was being a tough guy alpha male in the stupidest way ",
            "It's from last years (r / place) battle.",
            "Nobody is expecting an animator to touch grass",
            "there is endless content possibilities for a game like this, great job to the dev(s)",
            "or have a dog breed pop up and a price and you have to choose whether that price is higher or lower than what itd take for you. get some dogwarts data",
            "When you get the correct door, dans head pops out from behind said door, winks and says \"100pathent\"",
            "yeah, for example while holding one of the food items I was expecting the voice clip to give me a hint, and the fail is if I don't know all of them and need to listen to every single one",
            "I've been asked by others too but no, I'm not looking for anyone else at the moment. There is a set scope for the game and I don't want to expand it yet, manage a bunch of people or have people do work for free.\n\nThanks for the offer though, Twitch interactive games sounds cool! If you have an idea for something like that you can always throw a pitch to Destiny.",
            "Just sent an email. :\\^)\n\nReally appreciate the reply and looking forward to the game."
        ]
    },
    "Destiny is currently offline": {
        "title": "Destiny is currently offline",
        "score": 2,
        "url": "https://www.reddit.com/r/Destiny/comments/1dlk1dp/destiny_is_currently_offline/",
        "content": "Destiny is currently offline:\n \nSee what's coming up on [the schedule.](https://calendar.google.com/calendar/u/0/embed?src=i54j4cu9pl4270asok3mqgdrhk@group.calendar.google.com)\n \nFollow guest appearances, podcasts, and live events with [Omniversus.](https://www.omniversus.io/)\n \nCatch up on previous streams with the [YouTube VODs playlist.](https://www.youtube.com/playlist?list=PLFs19LVskfNzQLZkGG_zf6yfYTp_3v_e6)\n \nCheck out previous videos and debates on [the YouTube channel.](https://www.youtube.com/user/destiny/videos)\n \nBecome a loremaster with [Last Week on Destiny.](https://vyneer.me/tools/lastlwod/)\n \nReturn to the cult through the [unban request](https://docs.google.com/forms/d/e/1FAIpQLScTIawligY4g3bjfo9fkxVs2grJkMdotPIgoxccHLXaUS_Q3g/viewform)",
        "num_comments": 0,
        "comments": []
    },
    "We should really stop posting Nathan shit in here, dgg and twitter": {
        "title": "We should really stop posting Nathan shit in here, dgg and twitter",
        "score": 164,
        "url": "https://www.reddit.com/r/Destiny/comments/1dlsuoj/we_should_really_stop_posting_nathan_shit_in_here/",
        "content": "Bottom Text",
        "num_comments": 17,
        "comments": [
            "ok, you first",
            "I guess 4THOT should arm you then ",
            "Yes, but morons continue to do it, and the moderators don’t ban them. Perhaps they will start taking action against it the day there are photo edits involving Nat on a sofa surrounded by four or five black dudes   finally address the issue. It might be amusing when it involves Dman or Mel, but there are lines that should not be crossed.",
            "explain what you mean nathan shit\n\nbc i dont think kelly talking to him is something not worth knowing",
            "Don’t worry, the great mods of this sub will handle the posts soon bingchilling",
            "I don‘t think there is a need for that. As long as it is kept to a certain level of standard it should be fine.  \n1. absolute banger, like the comments about Steven‘s Israel trip.  \n2. if there is concerning or questionable stuff going on. For example Kelly going to him to rant about Steven.      \n   \n\nOther than that I‘d agree that it should be kept down and there certainly shouldn‘t be a „what has Nathan to say to this“ type of mentality around. The parasocial aspect or rather weirdness of some dggers going out of their way to hang around Nathan is more questionable than sharing some of his statements here IMO.",
            "SOYYYYY",
            "https://preview.redd.it/4b65tqav548d1.png?width=1536&format=png&auto=webp&s=ae22f71f2d8fa0c6d02e04a02c115cc91b9d4673",
            "I guess you are right",
            "Feels like people are being weird about it being weird for no reason, the guy made a discord and is promoting it in dgg and such, is everyone just supposed to ignore him or is it nice that people help him/sub to him? You can't have the cake and eat it too, either he should be isolated or embraced in the community and it feels like destiny is okay with him being a public figure going forward.\n\nAs long as people are heavily moderating his channels and chats Idk what's so terrible about this, we've all been 13 on the internet before you can't protect a kid forever.",
            ">MrGirl memes   \n>discord logs",
            "We have been 13 and on the internet but being 13 with a instant fan base waiting for you is far different. Also Kelly talking to him while being unhinged with a mental illness is just added shit that he shouldn't have to deal with.",
            "It is different, it's a very unique situation he's in so there aren't a lot of examples to go by in terms of how to parent this. Idk enough about how they are moderating shit but kelly said she joined there (invited by nathan) to keep weirdos away, so it seems she's trying to moderate there or something? Idk. She can be unhinged for drama but when it involves kids I think most people act more mature especially if they're public figures.\n\nIf it's inevitable he's gonna start streaming it's better its being done under the supervision of destiny and his mods rather than him being on his own. Forcibly keeping him away from streaming is like an actor keeping their kid away from acting. These are not normal lives like yours or mine they start with a level of fame we can't really comprehend.",
            "I think we shouldn't exploit a 13 year old for funny content and spread the regarded shit he says on discord only because he's streamer mans son\n\nhttps://preview.redd.it/4kzdz2ox648d1.png?width=470&format=png&auto=webp&s=735bdffeb7624feb29890c321a6f694e44d28498",
            "Call me an empath but this just doesn't feels right. We can intellectualize it all we want about him being a celebrity's son or whatever, but that's up to D-Man and his mother, a 13 year old is not ready for this kind of shit specially when it comes to dggers telling him to do silly shit on stream, or watch Hasan or making mrgirl memes or whatever, it just feels weird. I am willing to bet that Nathan-posting will be off limits in a couple days anyway",
            "Just send him into cod lobbies for a few years then he can take on the world. He will have thicker skin than Hasan. That's what I did when I was 13.",
            "I agree it feels weird, but this entire situation is weird is my point, at no point is being a child to a famous political e-celeb a normal life. If he wants to follow in his fathers footsteps he has a golden opportunity to jumpstart a career through his dad just like a child actor would do.\n\nYou say its up to his parents but clearly his parents seem to be ok with him trying it out no? But yeah I did say that they should heavily moderate away the weird behavior of chatters trying to be smart like using mrgirl names etc, but it seems like nathan has already watched a bunch of destiny videos at this point and is up to date with meme drama from dgg, Idk how destiny can protect him from that unless he removes his internet.\n\nWe all knew this day would come sooner or later, chatters have been asking for years when nathan will start streaming and mog his father. I think most kids would dream of becoming famous streamers as a career and when you have this opportunity it seems like a viable option unlike for 99% of them."
        ]
    },
    "Hold on! Hold on, guys. You have to give me this one.": {
        "title": "Hold on! Hold on, guys. You have to give me this one.",
        "score": 148,
        "url": "https://i.redd.it/tun0xj0os38d1.png",
        "content": "",
        "num_comments": 10,
        "comments": [
            "just won bigly",
            "Yee neva lose",
            "The prophecy has foretold victory.",
            "There’s always that one chatter who’ll say they see it",
            "Yeeden",
            "But Yee neva eva wins. Pepe always wins.",
            "Based Yee Neva Eva Lose",
            "Frogs down horrendously",
            "Only if pepetards claim voter fraud",
            "The Yees need to stop sending over illegal voters. Everyone knows that Pepe always wins. #stopthecount"
        ]
    },
    "Former twitch staff claims that dr. disrespect was banned for sexting minors": {
        "title": "Former twitch staff claims that dr. disrespect was banned for sexting minors",
        "score": 721,
        "url": "https://www.reddit.com/r/Destiny/comments/1dlk656/former_twitch_staff_claims_that_dr_disrespect_was/",
        "content": "[https://x.com/FearedBuck/status/1804324178851443012](https://x.com/FearedBuck/status/1804324178851443012)",
        "num_comments": 247,
        "comments": [
            "[Dan was first LUL](https://kick.com/destiny?clip=clip_01HW9D4VND98AK3PSXTR7PPYSF)",
            "The doc responds https://x.com/drdisrespect/status/1804337822415097955?s=46",
            "To any bitch that talk to him and they in love\n\nJust make sure you hide your lil’ sister from him",
            "I'm gonna need more evidence than some former employee's word for the simple fact that it's hard to believe that Twitch would essentially cover for a pedo and let him keep streaming on other platforms. It's an insanely stupid thing to do, even for a company as shitty as Twitch.",
            "Big if true, but hearsay of an ex twitch staffer is not really hard evidence.",
            "Twitch let someone they apparently knew to be a sexual predator run off the platform and have a career elsewhere (where he's in touch with more minors?) Why?\n\nThe obvious implication is that they didn't want news of one of their biggest stars sexting minors making waves - hopefully for their sake they have a better explanation than that.",
            "https://preview.redd.it/a590qlnt438d1.jpeg?width=1242&format=pjpg&auto=webp&s=9fc06ffc6dc88d0fc46411c51f90338ee7497aae",
            "[clip](https://kick.com/destiny?clip=clip_01J0YSZQNPJJY1KQM2TDAF2X18) of d-man talking about it on stream",
            "So DGG thinks Twitch paid him out 25 million and made him sign an NDA that he couldn't talk about being fired for sexting a child.\n\nSo we think lawyers were involved in this and none of  Twitch ones reported it to authorities and that Dr.Disrspect somehow managed to keep everything quiet like he was Jeff Epstein.",
            "Slasher seems to confirm it (without actually confirming it)  \nhttps://x.com/Slasher/status/1804321712219013293?t=HVi6FS85ziSp4x2s5LCRLQ&s=19",
            "can anyone tell me if this is fake does doc have a good defamation case? And if it isn't fake and for some reason twitch can't produce evidence does doc still have a good defamation case?",
            "Certified short-stack goblin moment",
            "How minor we talking? Like 13 or 17?",
            "Final comment here today. If doc did do it he should convert to islam. Dickrider online islamic fanbases will protect him and he can go to dubai.",
            "I had no idea he specialized in pediatrics.",
            "Slasher [tweeted](https://x.com/Slasher/status/1804321712219013293?t=uLQ2tRDlV14ivLViZPLcpQ&s=19) rn as well. Probably in reference to his old statements that he had info and a strong suspicion regarding why Doc was banned, but wouldn't say it because he was worried about getting sued. He at the time, 2020, also tweeted his \"favourite part\" of an [interview](https://x.com/Slasher/status/1283980866927104001?t=Or6lZs-dZ0KT5eKxy3Uo8A&s=19) followed by [this tweet](https://x.com/Slasher/status/1284018456963289088?t=jBsHSDmgPgq-Jm14Td-Tyg&s=19) where it mentions the interviewer asking about sexual assault, abuse or harassment allegations.",
            "Twitch whispers? Isn't that a third party thing or something? No? Must be safe then... 💿",
            "Here comes the \"i knew it\" comments...",
            "This is probably fake but replying with \"no wrongdoing was acknowledged\" just adds fuel to the fire.\n\nhttps://x.com/DrDisrespect/status/1804337822415097955",
            "69god",
            "Honestly we need concrete proof of what happened because what if he was sexting someone who claimed they were 20 and ended up being 13 and their parents found out and twitched banned him but doc couldn't reveal why because his wife would find out he was cheating again. Many scenarios. Another scenario is that this is just a straight up lie.  Another is the chick was 17 turning 18, still fucking weird as fuck but not no edp shit. We need context rather than bunch of people jumping the gun, if he is a back to back two time pedo after proof then yes he should be more than permabanned. He should be given the edp treatment",
            "[Destiny has been on podcasts with Evoli before. Bring him on Anything Else podcast.](https://www.youtube.com/results?search_query=chanmanv+cody+conners)",
            "dr disrespecting the laws of consent",
            "“On Rust” is the equivalent of “in a video game” for all the autists btw",
            "The fact dan said this first, completely unrelated to now; I believe it. Now, whether or not this was a girl lying about her age or catfish all together; that is to be determined. If proven, I don't see how his wife stays with him. Poor lady.\n\nEDIT: just read his tweet lol. Sus af is all im gonna say.",
            "So they covered it up?",
            "How many different rumors have we heard? If this isn't true, Doc should sue.",
            "https://preview.redd.it/r7xpjviyj18d1.png?width=864&format=pjpg&auto=webp&s=fdf9d956cd5b92f9942b090576c6acfdf03dcf0e",
            "Why are people just taking this as the absolute truth? I hate the internet.",
            "Fun fact: that same former twich staff member was actually \"laid off\" for not sexting minors. It's a requirement for the job. You have to be a practicing furry pedophile otherwise you'll be vibed out of the workplace culture and let go.",
            "Don’t believe it for a second. They have Zero moral ground to ban him for that with the crap they allow even if it were true",
            "Wrote this elsewhere but this doesn't make sense to me. Doc sued and got paid out by Twitch allegedly. I know the world is fucked up but I don't think that in this world you end up getting paid to sext a minor and not have charges brought against you in a criminal case.\n\nThe ONLY thing that would make sense is Doc was DMing someone that Twitch THOUGHT was a minor, turns out they weren't a minor but banned him before knowing that. Doc gets his contract paid out but Twitch doesn't unban because they don't want to admit they messed up. The rumor circulates that he was sexting a minor on their platform before they found out they weren't a minor and never corrected the rumors due to the lawsuit.\n\nThis is the only thing I can think of where the reason for the ban would be sexting a minor where the person is banned, paid out, and no criminal case. I would imagine if he was engaged in criminal activity, Twitch would have zero reason to pay out the contract and Doc would have faced criminal charges.",
            "Is planning to meet a minor at twitchcon a crime (which is what the tweet author wrote)? I am not a lawyer but I 100% think it obviously is. If it is why isn't doc arrested? Is this solicitation or not? If I have the law wrong then we don't learn anything about the case but if I have the law right then twitch didn't inform the police for some reason (Did they not inform the minors parents? They 100% banned the minors account since writing \"I am X age\" with X lower than 13 or something gets you insta banned in twitch chat. Erobb has made people write that in twitch chat to bait them into getting twitch banned). If I do have the law right then there is a lie in the tweet. Because Doc would be arrested by the police if he was soliciting a minor and planning on meeting them. Unless if twitch didn't get the law involved...",
            "How minor was this minor. Imagine if all of this is about some 17 year old 🤣",
            "All these guys Doc, NickMercs are all brain fucked 'alt right' fuckin chuds man. Zero surprise here, it's like a package deal.",
            "I uncritically believe this 100%.\n\nWhat a monster",
            "[deleted]",
            "Makes sense why Twitch wanted all of this",
            "[deleted]",
            "If true I wasn't far off, I always thought that for twitch to throw away such a big talent it had to be like he fucked an underage fan or something.",
            "This explains why twitch wanted this whole situation under wraps. Don't want the fact that they are reading PMs to go public.",
            "I've always thought this could be one of the reasons and so did many others. I assume twitch was unable to leak this because of his status and maybe partly because the person outing him didn't want to deal with a case. Worse case scenario Doc uses his money to do so scummy legal shit to get no time and minimal to no punishment.",
            "Does no one here remember Cody? Would hop on the chanman podcast with destiny",
            "If true, freaky ass streamers need to stay their ass inside",
            "Dan - “it’s been a long time”\nDestiny laughing - “it’s been so long the person involved is probably ok now” \n\nDestiny was hinting before Dan even said his theory.",
            "Just remember, Dan is always right",
            "The funny thing is that I actually believe him that he legitimately heard it from some guy he was friends with on his rust server.\n\nIf Destiny actually told him what the rumors were there’s no way that he would have said that live. He stumbled into the truth",
            "Dude that clip, RL and Destiny not convincing.",
            "Mossad on the case",
            "dan is never wrong",
            "Katt Williams was first first...",
            "Incoming countersue.",
            "Who is Dan? Seriouse question. Is he a former staff?",
            "Jewlumni once again with superior intel gathering 😤😂",
            "Link doesn't work",
            "so did destiny know about it?",
            "I'd go as far to say, that this was an open secret among those in the industry. \n\nThose who knew, didn't want to be the one to leak, because either you'll take the wrath of Docs fanbase or you'll probably take the heat from exposing that Twitch can read your PM's in their client. \n\nAnd nobody was wanting the smoke. Dan doesn't give a fuck tho, so he's obviously willing to leak",
            "DrDisrespectHisPrDepartment",
            "My \"no wrongdoing was acknowledged\" tweet has people asking a lot of questions already answered by the tweet.",
            "I can't actually think of a more guilty sounding combination of words for this situation",
            "Oh hell nah this is the worst response ",
            "Why phrase it like that? Wtf",
            "The Heart Part 6",
            "Nah that sounds guilty as hell",
            "\"this has been settled\", \"no wrongdoing was acknowledged\" ... *yo, uh oh!*",
            "\"I did it, so what (gigachad)\" would have been a better response than this shit. Like bro, log off, get your lawyers together and try again tomorrow. Why are these streamers always so fucking dumb?",
            "Stupid fuckin mistakes man",
            "> I get it, its a hot topic \n\nWhich part of the topic do you find hot, Doc? FeelsWeirdMan",
            "Confirmed doc's favourite type of female\n\nhttps://preview.redd.it/kcjlpdnh948d1.png?width=361&format=png&auto=webp&s=b281e96691fe442229b3ff3237995eaafcb2510e",
            "that's an odd way of confirming it",
            "Super sketchy that he didn't deny that it happened at all. Or even just that the people he was doing it with were minors. There's still nothing really concrete, but this is a point against him for sure.",
            "&#x200B;\n\nhttps://preview.redd.it/rc8zb9qdf18d1.png?width=613&format=png&auto=webp&s=24c090f200381112b3775277ab2390dcf518e16c",
            "WAP WAP WAP WAP",
            "doc tryna strike a chord",
            "My assumption: At the same time, having one of your biggest Twitch contracted stars contact minors at a twitch event is an extremely bad look which 100% would have received a lot of media coverage. But they probably don't feel safe continuing their business with Doc as if nothing happened, because if it does get leaked, the repercussions would be extremely big.",
            "> it's hard to believe that Twitch would essentially cover for a pedo\n\nActually, it would make a lot of sense if the reason why Twitch knew was because they could read everyone's messages (i.e. no encryption). It would expose a massive lack of security/privacy in their system, possibly opening themselves up to legal liability.",
            "I cover my pedos all the time. Don't you? What do you do if you're on a date? Can't hold it in for hours.",
            "Idk if Twitch has ever publicly announced why they've banned anyone. That's entirely standard for them, and Twitch isn't going to care about the brand risk to other platforms.",
            "From what we know Twitch isn't covering anything up if it's true, it's not their obligation to make all of this public. Social media companies collaborate with the police all the time but when's the last time you saw one of them publicly post the chat logs of some pedo they caught? It's more than likely that wherever this happened it was on the Twitch platform which is why he was banned, they were willing to turn over the logs (or did) and that the state for whatever reason decided not to prosecute.",
            "Unfortunately they can't just come out and say it due to Doc potentially suing the shit out of them for defamation.\n\nWith Doc suing them for his contract and finally settling it goes to show there isn't enough concrete evidence to outright allege grooming and pedophilia but it probably allows them to never let him back on their platform",
            "THANK YOU. LSF is salivating that they somehow knew something was wrong and all these X accounts are coming out the woodwork saying they knew what was going on. I have no side here but come on. \n\nTo your point about twitch, it’s a good counterpoint, so y’all telling me instead of Twitch outing a pedo and getting him arrested. They brushed it under the rug and legally settled so Doc doesn’t stream on your platform…",
            "I don't believe it because I think Twitch would've destroyed him to deprive their competition of talent if they actually knew he was a pedo\n\n\nI still think he got in legal trouble for lying about Mixer offering him a deal to get Twitch to sweeten the deal ",
            "Really? Because twitch is somehow morally superior to say… Hollywood?",
            "Twitch would have had two choice though\n\n1) leave doc on the platform until they had golden proof that he had actually slept with an underage kid\n\n2) kick him off, tell him in private why and hope that he doesn’t do shit. They save themselves the “drdisrespect groomed minors in twitch messaging system” headlines.\n\nDoesn’t matter if twitch thinks or even knows he’s a pedo if they can’t prove it. To go to YouTube or other platforms and try to have him kicked off without that proof would open them up to even more lawsuits. That they have no guarantee of winning. While embroiling their entire business in controversy.\n\nIf they screamed it from the rooftops and then it couldn’t be proven I’d imagine there’d be a pretty sweet defamation lawsuit coming their way.",
            "Why should Twitch be in the business of airing dirty laundry? Just get him off the platform.\n\nTwitch for all its faults doesn't care to EXPOSE streamers. They deal with the problem and move on.",
            "Because he didn’t actually get to the point of doing it, and I’m sure his claim was that they were just going to meet up in a friendly plutonic way, which I realize sounds ridiculous, but we don’t live in minority report, you can’t find someone guilty for a crime that they haven’t committed yet just because you think they will. If he had actually done it it would have been way worse for him and I doubt they would have paid out his contract. My guess is that this was the reason he came out of it so well.",
            "To be fair, he technically didn’t even say who “he” is. It is certainly heavily implied though.",
            ">The obvious implication is that they didn't want news of one of their biggest stars sexting minors making waves\n\nWorst part is is that he was doing it in their on platform (Twitch whispers), which could implicate them at least optically if not legally.",
            "Why not just announce the reason at the same time they banned the guy then?\n\nIt doesnt reflect badly on twitch at all if they nuke him from orbit and at the same time say they are handing everything relevant over to the police.",
            "And apparently doc claimed in the lawsuit that twitch paid his remaining contract. Why?",
            "> Twitch let someone they apparently knew to be a sexual predator run off the platform and have a career elsewhere (where he's in touch with more minors?) Why?\n\nIt's not Amazon's job to act as a private police force and judicial system. At least not yet.",
            "What benefit is there to twitch to air a streamers dirty laundry after you already banned them?",
            "I don't think twitch should really be in the business of releasing info like that at all, but if true they are more than justified in banning him permanently",
            "Money > Justice \n\nWell said and something LSF will eventually come to after the initial reactions.",
            "They can’t control what he does on other platforms, and as disturbing as the accusation is, he didn’t actually get to the point of doing anything illegal. They discovered it and took action before it got to that point, but once they fire him, what more can they do.",
            ">The obvious implication is that they didn't want news of one of their biggest stars sexting minors making waves\n\nIt is probably more to do with how ostensibly private messages could be read by Twitch on the back end. Twitch admitting this could potentially open themselves up to legal liability – in the US, there are wiretapping laws that make it illegal to intercept the private communications of others. Assuming this tweet is real, if Twitch had come out publicly with the reason for the Doc ban, they would essentially be admitting to being able to this massive breach in privacy.",
            "Yeh it literally makes no sense. If Doc is guilty, twitch are never accepting a settlement agreement that clearly is for Docs benefit (paying out his contract and keeping all allegations silent).\n\nAlso if Doc is guilty he is never going to be the person making a claim against twitch. He doesn't seem the brightest but he isn't so dumb that he'd open himself up to discovery and letting twitch present evidence of him soliciting and sexting a minor to a judge. If he was guilty he is a crazy gambling man for hoping that twitch wouldn't defend themselves in court resulting in no damages and hig likelihood of the judge giving the evidence in the case to whoever the nearest prosecutor is.\n\nIt'd be like murdering someone on livestream, then somehow twitch deleted all traces of that from the internet and that footage is only kept on Twitch internal drives, they then fire you and you decide to sue them for wrongful termination. No guilty person is ever doing that.",
            "Slasher for years has been jumping around reasons to why he was banned. Everytime something happens he always say \"i know what it is, but cant say it\". Dude's an attention seeker",
            "Confirm what? If any tidbit of information came out he could have just came out with the same exact statement. It means nothing.",
            "Slasher is a lying, attention seeking loser. Even here he's jumping on a drama train while saying nothing of substance.",
            "I don't trust him at all. Gives me real grifter vibes. \n\nWhy can't any of these journalists provide any evidence? Why would Twitch settle with him out of court? Why are all of them vagueposting? \n\nDoc wouldn't be the first grooming streamer, but this sounds like a rumor that spread more than anything concrete...\n\n\nEDIT:\n\n[nevermind lol fucker probably did something shady at the least with this response](https://twitter.com/DrDisrespect/status/1804337822415097955)",
            "Doubtful, Doc is never actually mentioned at all.\n\nIt could also have been about the D man for all the information it contains.",
            "The tweet seems real. For defamation, it would probably be tough: (1) He needs to prove that he is the “he” in the tweet (presumably by clear and convincing evidence because he is a public figure), but it is definitely heavily implied and (2) **If** this is true, truth is an absolute defense to defamation. \n\nIf he can **prove** it is about him AND it is false, then he would have a strong case, because it doesn’t look like the tweet included anything that could be construed as opinion and the level of detail would likely mean a jury would find that it was either knowingly false or a reckless disregard for the truth. \n\nTwitch probably doesn’t have anything to do with it since it is an ex-employee doing it other than complying with a subpoena which would be turning over records, if they have any, or having someone come into to testify what they know.",
            "How would anyone possibly know based on the publicly available knowledge if he has a good defamation lawsuit?",
            "17 years 11 months and 30 days 🤮",
            "Never too young to be a Champion, so why not lower than 13",
            "I’m more interested in how much he knew, this was around the time he got caught cheating on his wife so was he just a horndog recklessly tryna fuck and sext anyone? Or was he made aware of their age and still proceeded?\n\nCuz one of those makes him a sexual predator and shit human, the other makes him a shit human but not necessarily a predator",
            "bruh\n\nIt doesn't really matter. In one scenario he's a creep, a moron, and a PoS and in the other he's simply a bigger creep, moron, and PoS.",
            "Bro how many comments do you have in this thread I see like 5 rn 😭\n\nThis is Kendrick level hating",
            "This isn't really any concrete proof, only strong suspicions. I personally have no idea how credible slasher is. I just love the juicy drama which just came out of nowhere.",
            "Lmao Slasher isnt credible hes been baiting for years that he knows but cant say it very convinient now to come out and say it.",
            "Run for your laaaifff",
            "I am a human female male humanoid minor he texted me. What say now??",
            "How many 13 year olds do you know that look and speak like 20 year olds? Such an extremely rare scenario but people love to say \"okay but what if she was just a devious scheming slutty 13 year old??\" like cmon man. \n\nAlso, more importantly, literally no one has said anything about her being 13 lmfao you just made up an absolutely bonkers scenario for what reason? \n\n\"17 turning 18\"?? Okay what if she just turned 17? Again, zero info about her age has leaked but sure let's just make shit up to smooth this over for this man known to serially cheat on the mother of his child w/ young women. What if she was 152 days from turning 18? 61 days? What's the cut off where it becomes totally kosher for this man to be planning to meet up with underage fans for sex?\n\neta: gosh, didn't know the point that not many 13 year olds look or act SEVEN YEARS OLDER like fully grown women would be so controversial. Or was it the point that it doesn't fucking matter if she's \"17 turning 18\", she's still 17 and that's the fucking point. Obviously 17.9 years old and 18 years old is an arbitrary difference, but it FUCKING SHOULDN'T BE to a ~40 year old man, especially when he's a famous streamer communicating on a twitch chat platform because it's incredibly reckless and depraved. Being THAT reckless and stupid is indicative of him having a SERIOUS problem. morons.",
            "https://preview.redd.it/16tf5513k18d1.png?width=864&format=pjpg&auto=webp&s=2410d3558c065e65f7cb37a5ea3524379b547744",
            "it makes perfect sense.\n\nhe wasn't \"sexting\" a minor, he was arranging a \"meetup\" to occur at twitchcon. these messages don't need to be explicit or rise to a legal standard for a corporation to get nervous.\n\nthe largest streamer on the platform, at the platform's first party convention. even if nothing explicit was communicated in the whispers, they couldn't have a guy in his 30s hooking up with a minor at their convention. degeneracy, too much PR risk, displays a dangerous pattern of behavior. so they quietly terminate his contract (probably a morality clause), he sues alleging no wrongdoing (i didn't fuck her yet!), and they settle out of court under NDA since its in everyone's interests (twitch arguably overstretching on the contract term but doc not wanting to go to court because he knows what he did and how it looks).\n\na to b to c. and no one in the industry is acting surprised about it? this all adds up. you are way overthinking it.",
            "Think harder dingus",
            "… why would you even think this?",
            "I struggle to believe it, if these two chuckfucks knew then they probably heard it from randos in the industry.  If randos in the industry know then how in the hell has it been kept quiet for so long?",
            "Destiny saying \"probably,\" when this went down 3 years ago, hurts my soul.",
            "Someone has to put Dan on top of this shit\n\nhttps://preview.redd.it/kpkpy7cg318d1.jpeg?width=640&format=pjpg&auto=webp&s=162e2527012e913b0bf7df333ca4b2b286318061",
            "Until today, I merely trusted him, but now I believe in him🙏🙏",
            "Since he technically didn’t say who “he” is, Doc would have to prove that he is the one he is talking about. It is certainly heavily implied, but I’m not sure if he would have to prove it with clear and convincing evidence (since he is a public figure), but I’m not a lawyer",
            "He’s destiny mossad handler",
            "He is a guy that got rich by starting and selling tech companies like tinychat. Then he invested that money into tech stocks and real estate.\n\nEventually became gaming friends with Destiny. I wouldn’t be surprised if he was actually significantly more wealthy. He is the owner of redact.dev (unless he recently sold it)",
            "Don't worry about Dan. Dan is no one.",
            "Kick clips are sooo bad [https://streamable.com/rwzjt1](https://streamable.com/rwzjt1)",
            "*\"I did it\"*",
            "Could it just be how his lawyer advised him to answer or something?",
            "Literally the guiltiest response someone can make without just outright admitting you did it 💀💀",
            "Literally made me go from \"there is really no evidence that this is true, it could just be some false rumor that spread around during the speculation\" to \"yeah he did that shit\".",
            "Probably because that was likely the phrasing his lawyers must have used in official legal communications with Twitch, and he's totally oblivious to the fact that saying it that way in this context is one of the worst possible things he could do.",
            "lol, cause it’s the best way of framing it. It’s close to the classic non-denial denial. “No wrongdoing was acknowledged” might sound good if you know the other side is a business that can’t talk about it or else you can sue their pants off, but it’s not “I was cleared of all wrongdoing” or found not guilty. Hes framing it as best as he can knowing the other side can’t talk about it, so only his narrative will ever come out.",
            "\"If I was fucking young girls, I promise I'd have been arrested\nI'm way too famous for this shit you just suggested\"",
            "Unironically would've been better if he'd just shut the fuck up, at least until his lawyers can come up with a better sounding legally sound statement 💀",
            "DOC fuck’em up😈😈😂",
            "Certified boy lover",
            "I feel like it would have been so easy and obvious for them to just fire him, state the reason, and announce that they've handed everything they have over to the police so that proper procedure can take place.\n\nIt seems so much less likely that they decided to cover it up by firing him but not announcing why. And then you're telling me Dr. D had the balls to sue Twitch knowing that's why they fired him? Wouldn't that be the easiest slam-dunk court win for Twitch ever? But for some reason Twitch decided to settle out of court instead?\n\nDoesn't make sense to me.",
            "How would that make twitch look bad when its a crime???",
            "Why are you assuming they didn't contact the police?",
            "Doc tweeted about it himself and he definitely didn't paint it in the light that he didn't do it.",
            "i’ve seen this theory so much and maybe i’m\nnaive but how is this different than lying on a resume. and sure ok twitch bans cause they mad but why would he hide this lol, it’s like who cares. so much superior than any me too related thing",
            "Well if they paid out his contract then he didn’t get into legal trouble for any deal.\n\nThere’s no way that twitch would want the headlines that one of their biggest stars was trying to hook up with minors using their platform and they only know because they seemingly have some access to those messages for some reason.\n\nBoth of those things look hella bad for twitch and its ability to claim safety for its largely young audience.\n\nLetting one of the other platform have a ticking time bomb and seeing if it blows up there is way more pragmatic a stance.\n\nEspecially because if they can’t prove that he’s been banging underage kids, or receiving explicit media from them(or child porn) then they are essentially playing minority report pre-crimes division. But the act of banning him may have been enough to rectify the negative pathways he was going down and ensure he never pursued anything like this.",
            "he's talking about tiny 😱😱",
            "I think doc responded",
            "It would also mean twitch was reading streamers pms",
            ">It doesnt reflect badly on twitch at all if they nuke him from orbit and at the same time say they are handing everything relevant over to the police.\n\nThat sounds reasonable but 1) we don't know the whole story and they may have mishandled it or other related incidents and 2) you can't actually predict 100% how the media and public will respond to something like that. It could set off investigations and stories about broader sexual misconduct at twitch. Or it could have caused Dr. Disrespect to retaliate and leak harmful info about Twitch. At the end of the day, even if they did everything right (doubtful lol), it's still another stain on their reputation.",
            "My guess, they probably didn’t have a morality clause or something in the contract and probably had to pay a bunch of money to terminate the contract and they probably signed an NDA. Not that I have seen Twitch contracts, but there might be an NDA related to discipline or something too.",
            "Yeah. Imagine the blowback if this is real and twitch protected him and it would inevitably leak. Way, way worse than handing him to the police lol. \n\nAll these people that knew and said nothing are real cunts if the police didn't get involved. \n\nActually, even if the police did know. Doc could be grooming kids right now because of them.",
            "Damn that's so annoying. Why would anyone watch a streamer that baits like that but doesn't spill?",
            "It's probably good that Slasher reminds people that he is capable of keeping a secret. His job relies on people talking to him and giving him inside information. If this dude can keep quiet about Dr.Disrespect, the can keep quiet about anything.",
            "Doesn’t docs response kinda validate the jumping around though?",
            "I guess he doesnt want to get sued. If it was wrong he would probably have tweeted sth like yeah thats not what I heard",
            "Some of you take \"innocent until proven guilty\" to mean \"throw all common sense out the window to defend probable sex offenders to hell and back\". \n\nYou really can't imagine any reasons why Twitch would settle out of court? Something companies do ALL THE TIME to avoid costly trials and discovery information becoming public and so on? \n\n Why aren't you asking \"why did Dr. Disrespect agree to settle?\"\n\nCan you not think of reasons why Twitch would want to avoid this alleged incident becoming public?",
            "No idea on what the truth is but I can think of a couple of reasons why twitch might settle:\n\n1. They might be able to explain why they banned him and win. But There might not be enough evidence to prove intent of his actions and could lead to a defamation lawsuit maybe if everyone starts talking about it. \n\n2. Twitch employees in that chat have also said and done stuff in that channel that they would not like made public via discovery.\n\n3. Just quicker and easier.",
            "Our defamation laws need to change to accommodate this new media landscape. People can assert basically anything and if it gets enough traction it can become a tool for continued harassment. i.e. calling Destiny a 'cuck'.",
            "That is why I conditioned it on being fake. If this is 100% fake would doc have a good defamation case based on these comments?",
            "Do we have legal punishments worth than the death penalty?",
            "I'm making comments mostly doubting this because there is no evidence but I'm also making jokes about it. Lol not kendrick level hating just a memer",
            "He's not credible at all",
            ">What if she was 152 days from turning 18? 61 days? What's the cut off where it becomes totally kosher for this man to be planning to meet up with underage fans for sex?\n\nWell I mean, for one she wouldn't be underage anymore if she was 18\n\nIt's fucking weird and all, but we draw a line in the sand for a reason. California drawing that line at 18 is way, way better for protecting young women from sexual predators than pretty much most of the world which is like, 14-16.",
            "This was over a whisper so how would he know the age (unless if the person straight up said their age which means doc is a pedo)? Why are you bringing up the fact that my scenario is far fetched... precisely because I am thinking of various scenarios to show that we know nothing about this case so far? Thirdly, people are making it seem like it is pedo shit That's why I brought up what if she was 17? You completely misread my comment. Seems like you deliberately misread it.",
            "Looking into this!",
            "Doc is one of the most powerful guys in an industry that is already clique-like. And given any evidence would only be in the hands of very few people I don’t think anybody would want to just throw it out there unless they have a bone to pick ",
            "No one wants to fuck with CAA lawyers.",
            "Dan said someone in his rust clan told him LOL",
            "The \"jews\" at it again, god dammit Dan.",
            "Right after Destiny gets back from Israel, his close friend is revealed to have behind the scenes information in the entertainment industry? Do you really think that’s a coincidence?\n\nWe know I can’t say it… \n\n\n\nIt was a Jewish Rust server.",
            "I'm here only to see Rekieta do the commentary.",
            "Lmao is that why doc responded? To bait a response acknowledging it’s him?",
            "Ah ok so if his claim was real how would he have heard it?",
            "https://preview.redd.it/r98coupta28d1.jpeg?width=200&format=pjpg&auto=webp&s=7cfe60ddb5c080195735db90e9407afe3605fb99",
            "\"I'd do it again\"",
            "I doubt he was oblivious that it sounds horrible. It was probably the phrase that they agreed in the settlement. Twitch probably agreed to pay out the contract to avoid some breach of contract (I’m guessing they didn’t have a morality clause) or early termination penalty, they both agree to keep the information quiet (because one of the largest streamers doing the alleged activity on twitch looks really bad), and he agrees not to deny any wrongdoing (which is the non-denial/denial) or disparage Twitch over the ban.",
            "Well he probably felt he needed to say something, and this is likely better than having the entire thing litigated in the court of public opinion.\n\nThe claim of no wrongdoing neither confirms nor denies the accusation. Just says that whatever he supposedly did twitch couldn’t prove a justifiable wrong doing.\n\nA lot of the details could make this far worse or better depending on the context. But depending on the restrictions he nor twitch, nor the underage person in question may be in the place to publish the logs.\n\nSexting has a far range of possible avenues in itself, it could be straight up nudes, instagram lewds, or just some weird off color dirty talk.\n\nUnderage similarly could be anything from 10 - almost 18. And while a person in his position messaging someone under 18 is sussy as fuck. Even meeting the person could result in zero breaking of laws if nothing is acted on.\n\nAnd the reality is that twitch wouldn’t give a shit if she was “freshly 18” even if it would realistically have the same sussy grooming etc feel to it. \n\nWe’re probably never getting the actual context on this.\n\nIronically if we assume the worst case scenario? Twitch might have saved disrespect some jail time.",
            "No one is ever clearee of all wrongdoing, and thats a way harsher standard than our courts",
            "Freaky ass doctor he a 69 doc \nrun for your liiifeee",
            "NOOOO DONT LET DOC FUCK THEM",
            "This is also not considering the fact that if this info did get leaked it’ll essentially be viewed as a coverup by twitch to protect Dr. D which looks 10x worse",
            "I'm purely speculating about possibilities as I don't have strong feelings on it, just find the conversation fun. \n\nCould it be that Doc didn't actually do anything illegal, so twitch couldn't just terminate the contract? So doc sued them for terminating the contract and settled a deal for them to cancel the contract in return for twitch to keep quiet about it. I'm genuinely wondering whether this is actually possible.",
            "Maybe they fired him but couldn't actually proof that he knowingly sexted a minor, so they settled and no wrongdoing was \"acknowledged\"?",
            "Not sure of stats, but there's a lot of 13-17 year Olds  active on twitch. If the regular media ran with it you could say goodbye to advertising,  not to mention parents would be blocking the site by the millions. I'm sure Dr disrespect got paid due to a shitty written contract (twitch fired him for it, but because it wasn't covered by the contract, they still had to pay him. ) going all the way to court with no real standing is a quick way to get a judgment against you.",
            "Might be a bad look for them to acknowledge monitoring and reading everyone’s “private” DMs maybe?",
            "Because it was done by the biggest Twitch star, through a Twitch whispering tool, to meet up at a twitch event. \n\nBut the act itself may not have been illegal, but still weird enough for twitch to cut their ties with doc. Since we know that doc sued twitch for the termination and have come to a settlement. My guess would be that Doc agreed to terminate the contract, if twitch agrees to not reveal the reason for the termination to the public.",
            "That’s the only reason I can see something like this being kept quiet, because they invaded the privacy of users.",
            "wrote out a long thing about how im pretty sure this leak is bullshit and Doc drops a tweet on the subject denying exactly nothing and with some very sussy wording\n\nWell now I dont know what to believe.",
            "It's worse, he wasn't acting as a streamer, but as a journalist lol.",
            "What response was that?",
            ">Some of you take \"innocent until proven guilty\" to mean \"throw all common sense out the window to defend probable sex offenders to hell and back\". \n\nAs far as I know, the only information we have about him being a possible sex offender is\n\n1. An employee who left Twitch a year ago vagueposting that someone was banned for sexting a minor and trying to meet up with her\n2. A \"journalist\" similarly vagueposting about it\n\nIf we're to believe them, then this employee (and likely multiple other Twitch employees?) and journalist have known about a groomer having a huge platform for years and have done nothing to expose it. \n\nIt may in fact be true, but there isn't nearly enough evidence to say it's \"probable\".",
            "I'm confused about why they wouldn't want this to be public. One of their biggest streamers was caught sexting a minor, something not unheard of in the streaming world, and they... fired him? Where's the bad press? Isn't that exactly what you'd expect and want them to do?\n\nAnd if that really was the cause of him being kicked off twitch, would he really sue them over it? Wouldn't that be a slam dunk victory for twitch to terminate his contract if that's really what happened? How would twitch not easily win that in court?\n\nIsn't covering it up a way worse look for twitch in every way?",
            ">Some of you take \"innocent until proven guilty\" to mean \"throw all common sense out the window to defend probable sex offenders to hell and back\". \n\nThat's crazy you'd call this probable. Possible, sure. But probable? \n\n>Can you not think of reasons why Twitch would want to avoid this alleged incident becoming public?\n\nI can, it would paint them in a bad light. But protecting a pedo and his reputation and settling is way worse. Instead of excising people like that twitch will now be known for protecting pedo's reputation.\n\nSurely they didn't think they could keep this under wraps forever?\n\nCrazy to me you don't it's equally probably this is just a rumor that started spiraling out of twitch HQ. \n\n>Why aren't you asking \"why did Dr. Disrespect agree to settle?\"\n\nBecause money. You'd have to be a real psycho to sue your employer for wrongful termination if you were sexting a minor.\n\nThese \"journalists\" sound like fucking schoolgirls tweeting about rumors. If this is true they kept quiet about it for years so doc can go around grooming other kids, and they can all go fuck themselves.",
            "> Why aren't you asking \"why did Dr. Disrespect agree to settle?\"\n\nNot to flex being a wrestling nerd, but WCW went through a phase where they would just settle everything and it was super beneficial to the wrestlers to just take it out of court and get their money. I wouldn't necessarily judge the wrestlers in this case just because they didn't take a company to court over racial discrimination.\n\nOn the other hand, the WWE and Vince McMahon absolutely had no problem dragging lawsuits out for years. It really just depends on the company and their stance on lawsuits.",
            "Because a defamation lawsuit involving a public person does not hinge on whether or not the statement is true or false - the defendant being sued would have had to have known that it was a false statement and acting with malice, not just negligence or ignorance. We have no idea all of the details so we can't say.",
            "Has to be part of JStlk inner circle",
            "Are you?",
            ">Well I mean, for one she wouldn't be underage anymore if she was 18\n\nobviously? this isn't the claim being made though, the claim is the girl was under 18.",
            "Because you are showing a clear bias by conjuring up situations where he is less culpable. It's fine to speculate or think about different scenarios but your intent is clearly to defend him and uhh it annoyed me",
            "Doc strikes me as a tyler1 type sticks to his own things, how do you mean he is one of the most powerful guys?",
            "True, but plenty of streamers are pure, unthinking clout sharks.\n\nDo you really think that if a few 100 streamers knew about this that none of them would be talking?",
            "\"Mein-Craft??\"",
            "Every. Single. Time.",
            "I just looked it up and if that was what he was trying to do, he [responded](https://x.com/drdisrespect/status/1804337822415097955?s=46&t=VBdm-AuAEduZMoeC7sc9ZA) to the wrong person. The person who was quote tweeting (who specified doc) almost certainly had the **opinion** (I think a court would probably agree) that the “he” the original tweet was referring to was the Doc. **Opinions** aren’t defamatory in the US. Also, even if it was considered fact, he would probably be able to just say that he believed the ex-Twitch staff and unless he coordinated with the guy to make up the false, then he almost certainly was not acting with actual malice (making a knowingly false or with reckless disregard for the truth — relying on an ex staff with pretty detailed allegations). Also if the guy knew it was about the doc, he says the “alleged” reason he was banned, which is what the ex Twitch staff guy is alleging, ie it is true that the guy is alleging this and truth is an absolute defense to immunity. \n\nPlus saying “no wrongdoing was acknowledged” does not feel like the response you would give to say this guy is lying about it or is showing a reckless disregard for the truth.",
            "One thing I forgot to mention. He is a furry with extremely powerful connections in the subculture. He may have heard whispers through the grapevines because of that as well\n\nhttps://preview.redd.it/eqg7x5ufg28d1.jpeg?width=640&format=pjpg&auto=webp&s=cf089786962dc0d2f8cb069d77d940439ce8e085\n\nIf you are watching Anything Else live absolutely DO NOT ask about the kitty litter incident. Instaban. The only reason I can mention it now is because we’re under 4thot’s protection",
            "It's in the clip, he heard it on Rust",
            "“I’ve actually done it since”",
            "And not just a cover up of scummy or embarrassing behavior, but actual criminal stuff. Dr. D is on other platforms where he has access to the same kinds of people he had before. He could be continuing to prey on minors to this day all thanks to Twitch covering his ass.\n\nMakes no sense that they'd take such a huge fall for him.",
            "This. Messaging a minor like that isn’t illegal, and he didn’t get to the point of meeting up with them, so they were firing him preemptively before it got to that point.",
            "i feel like\n\n1. it's explicitly allowed in TOS\n2. the victim is the one that tipped them off and they werent just peeking around for the sake of it",
            "Obviously this is vibes based and not based on any evidence, but he seems like a fucking piece of shit lmao so I don't even care either way but it SEEMS completely plausible.\n\nOh...well and the evidence that he cheated on his wife numerous times. Obviously being a serial cheater doesn't mean you're a groomer/want to sleep with underage people, but it certainly increases the odds. Having a minimum of four affairs during your marriage probably means you're a sex addict and sex addiction will make you do deplorable things.",
            "Literally leaving out the best source of information,  ie the rust server, but that’s ok.",
            "I think literally every person saying that they’ve heard this story behind the scene for years and then other journalists kinda conforming it like Jacob Wolf, lends more credence.\n\nNot to mention Doc’s latest tweet is uh… he ain’t exactly beating the allegations.",
            "You're right and I didn't mean to say Dr. Disrespect is a probable sex offender, just that this happens in general.",
            "dunno about the other arguments but the press is a casino, will they report it as \n\"twitch uncovers streamers sexual misconduct and bans him from platform\" \nor\n\"top twitch streamer using platform to message underage fans\"",
            "He was like the premier Twitch streamer at the time.  The news of it breaking would not have been favorable to twitch, even if they did everything right.",
            ">You'd have to be a real psycho to sue your employer for wrongful termination if you were sexting a minor. \n\nYeah, a psycho or a clinical Narcissist w/ delusions of grandeur. Or just someone who knew they would settle.",
            "What kind of a stupid response is that?",
            ">the claim is the girl was under 18.\n\nYeah and the person you replied called into a very reasonable question about just how \"under 18\" was she when the sexting occurred, or if she even was a minor when they planned to meet up (either during the planning, or that she'd be 18 when they do meet up)\n\nObviously it's fucked up if he's out there sexting a 15 year old, but that cultural trope of \"barely legal\" does exist. You can say it's still fucked up he'd want to bang an 18 year old, and that is fine to argue for, but the point is these are serious allegations that deserve someone wanting to ask a question. Lot of people are taking this to mean he tried to bang some 10th grade highschooler.",
            "Baby just learned about bias and is excited to try it out!",
            "You mean I showed potential examples for how this can not be true or is some partial truth without the full context of what people make it out to be? I can also come up with examples based on the current evidence to show how he is guilty. We need evidence. Everyone is immediately conclooooding right now like idiots. He could have straight up done it, we don't know. We have one person saying so and other people saying \"I knew it\".",
            "Wasn't doc the face of twitch before the ban?",
            "Oh my God...",
            "💀💀",
            "Under Penal Code 288.2 PC, simply sending explicit texts to a minor with the intent to seduce is illegal in california. Harmful matter from\nthe statue would include “anything that offensively depicts sexual conduct”, again, with the intent to seduce implied. See my comment to deltaboiz reply to yours",
            ">Messaging a minor like that isn’t illegal, and he didn’t get to the point of meeting up with them\n\nTo be clear here, depending on the age and the states involved, none of that might be illegal. He could meet up and bang a 16 year old fan in like, what, half the US?\n\nSexting (but not sending nudes) a 16 year old is pretty fucked up by almost any measure, but legally might be fine. Meeting up with someone under 18 you had previously sexted with but not explicitly planning a sexual rendezvous with them in California (Age of Consent is 18 there) is also, not itself, illegal.\n\nWhat makes this tricky is the word minor might be doing a lot of heavy lifting here. That could be a 17 year old, or a 13 year old, and we'll probably never know the exact age.",
            "Could be a parent or guardian was involved as well",
            "Well, your vibes seem overly horny for someone posting under a history meme about bono, so im off.\n\ncya.",
            "The journalists don't add any credence because their information is ultimately still sourced from the same place: the Twitch rumor mill. The way Cody's tweet reads is \"somebody told me this is why he was banned\" not \"I saw the evidence\".\n\nThey also have the same issue of reliability that I mentioned before: If we're to believe them, then they have known about a groomer/pedophile/sex pest having a huge platform for years and have done nothing to expose it. \n\nIf true, which it could be, it makes these people look like massive pieces of shit.\n\n>Not to mention Doc’s latest tweet is uh… he ain’t exactly beating the allegations.\n\nYeah, it was a pretty dumb thing to say.\n\nIf I put my \"good faith\" hat on, I'd read it as \"Twitch agreed to pay out my contract but the price was I have to stay banned and not say why, because it makes them (or both of us) look bad\". \n\nThe thing that gets me about the settlement is if I was twitch and some pedophile/sexual harasser/whatever other sex pest shit he may have done sued me, I'd say \"go for it\" and let everybody know exactly why I banned him.  I get settlements are often cheaper, but it's still weird.",
            "But when the coverup eventually leaks, like it always does, it gets covered as \"Twitch covers up sexual misconduct involving minors\" which has zero positive spin.",
            "How would the news of their coverup of sexual misconduct involving minors go over?",
            "Fantastic question",
            "But I didn't say anything about her being 18, all of my scenarios were about her being under 18, which is the claim. \n\nObviously it's worse if she was 13 instead of 17.999 years old, but it's bad either way. If he knew she was under 18, it shows a complete lack of care and willpower. Combined with his (minimum) 4 affairs during his marriage, it indicates some level of sex addiction and desire to do \"wrong\" things just to get off.\n\nIf he's okay with convincing a 17 year old to meet up and have sex, despite it being incredibly stupid and risky and wrong, what's to stop him from doing it with a 16 year old? A mature looking 15 year old? This \"arbitrary\" line in the sand goes both ways. \n\nAnd of course, the truth is we have literally no idea how old she was.",
            "I don’t know if he was THE face, but he was certainly one of the most recognized/popular streamers in the FPS/Battle Royale genre. Pals with all those guys: Ninja, Tim, Shroud, etc. Had a lot of brand deals. Was supposed to be in line for a Nike deal before being banned.",
            "That’s not what I’m seeing at all for law in California. I don’t think sexting a minor is legal at all, my friend. I am surprised people in this thread are even saying this.\n\nAdults should not be having explicit conversations with minors.\n\nCalifornia Penal Code §288.3(a)",
            "Could you show where you found “meeting up with someone under 18 your previously sexted with” (without meetup) isn’t illegal? According to PENAL CODE 288.2 PC, it \n\n“makes it a crime to send, distribute, or offer to, using electronic communication any harmful matter to a minor with the intent to both sexually gratify or appeal to them or minor and seduce or arouse them” which includes \n\n“Sending text messages to a minor with suggestive or sexual content with the hopes of arousing them or having sex with them”.\n\nThis is all assuming he knew or should have reasonably know the person he was messaging was a minor. This makes it seem more likely his defense was that he did not know, and had no reason to suspectthey were minor, or they falsely presented themselves as not a minor .",
            "wat",
            "i mean... the only place i've seen people even directly talk about twitch's actions during this is here. \n\nnot on twitter trending, checked dexterto and the headline there is \"Dr Disrespect responds to new Twitch ban allegations from ex-employee\"\n\nso it seems like no-one cares.",
            "Maybe better now that he hasn’t been there 4 years and isn’t the face of twitch.  But probably not great if that is what comes out.",
            "> But I didn't say anything about her being 18, all of my scenarios were about her being under 18, which is the claim.\n\nWell heres a better question, what if it was like that multi episode plot on House where the girls like \"I'm 17 but I'm turning 18 and I'll fuck you then Dr House\" and that was the plan. She's underage but they'll hook up at TwitchCon after her birthday when she's legal. \n\nWould you say thats just as bad if she was 17, nearly as bad, not as bad but still kinda bad, or just not bad at all? Thats the true litmus test here. \n\n>And of course, the truth is we have literally no idea how old she was.\n\nAgain, which is why I think it's fine to speculate. \n\nWe're lucky this discussion happens in a state where the age of consent is 18 as well tho, because this public discussion would be really annoying if this were going down in a place where it's legal to rail a 16 year old, full stop.",
            "Hey ,I might be wrong because I'm relying solely on memory here and didn't really use to watch doc back in the day but I remember a big part of his brand being \"the face\" of twitch",
            "shit.\n\nResponded to utterly the wrong person in utterly the wrong sub somehow.\n\nIll let it stand because its funny now.",
            "I'm not debating the ethics of planning to have sex with a 17.9 year old vs an 18 year old, I'm saying it's extremely careless and reckless for any person, but ESPECIALLY a public figure doing it in an online chat, to do the previous and indicates some level of inability to regulate one's desires and actions.\n\nWas Dr. Disrespect trying to make a point about how arbitrary a hard cut off for age of consent is when he was planning on meeting up with a minor for sex? No lmao, he was trying to fuck a very young fan and didn't care if it was illegal or creepy or depraved or wrong or compromised his career or ruined his family. That's the whole fucking point.",
            "LMAO I wasn't even offended because I was so confused. I have a newfound empathy for men falsely accused of sex crimes ty",
            "> I'm not debating the ethics of planning to have sex with a 17.9 year old vs an 18 year old\n\n>No lmao, he was trying to fuck a very young fan\n\nOkay so you do think it's wrong even if she was 18, got ya.",
            "Exactly how I felt when I thought your comment was in response to a discussion that was being had under a history meme about bono.",
            "I actually have no idea what your point is and you're really giving the destiny simp debate bro theory some credence here"
        ]
    }
}