{
    "Spoiler Policy Reminder & Other Reminders": {
        "title": "Spoiler Policy Reminder & Other Reminders",
        "score": 52,
        "url": "https://www.reddit.com/r/destiny2/comments/1d7fzan/spoiler_policy_reminder_other_reminders/",
        "content": "Hey Guardians, with Final Shape coming out tomorrow we would like to remind you of our spoiler policy. **Please keep all Final Shape campaign content spoiler tagged for one week**, or until next Tuesday's reset. This will apply to the Episode Echoes content next Tuesday, which should be spoiled until the following week, along with the raid content.\n\nLoot content is considered a spoiler as well, but we will be more loose about that, so instead keep **loot posts spoiled for 48 hours from their release**, including raid loot, Episode Echoes, etc. \n\nWe've also added several new moderators to help us out during this busy time, so welcome u/switchmod, u/dfreeezzz, u/Mastershroom, and u/iblaise, u/Tapelessbus2122! \n\n We'll be posting a Spoiler discussion thread shortly after launch to keep basic questions and discussions focused to one thread. We hope you all enjoy The Final Shape!",
        "num_comments": 7,
        "comments": [
            "Out of curiosity, is it possible to make sure titles are spoiler free too? In the past, both in this sub and others, I've seen people tag their post as a spoiler, but title the post in a way that spoils information anyway.  \n\nDon't know if this is possible or even if you care that it needs it, just wanted to bring it up to see where you stand on it. Thanks!",
            "Are old dlcs free? What can a ftp player expect",
            "If people would do this properly instead of the last days I didn't have to unsub for now on this sub. Already got too much spoilers or story progression through titles the last week....",
            "guys I have a problem since the final shape got added they keep kicking me from the tower and competitive Crucible and Osiris games and Banned Me and an error text popping off saying cappage error I tried all the problems solving method and Bungie and still didn't work what can I do",
            "whoever made this community need 10 karma to be able to post really does not give a single fuck about helping people",
            "lightfall, witch queen, and beyond light was free for a few weeks before The Final Shape launched iirc. if the psplus monthly games havent changed yet then i think lightfall is free with psplus at the moment.",
            "The Legacy pack on Steam is currently 25€ and has almost all the content up to The Final Shape (Except Witch Queen and Lightfall dungeons)\n\nBeyond Light and Shadowkeep campaigns became f2p with the release of TFS"
        ]
    },
    "New and returning player guides, and FAQ! The Final Shape has arrived!": {
        "title": "New and returning player guides, and FAQ! The Final Shape has arrived!",
        "score": 58,
        "url": "https://www.reddit.com/r/destiny2/comments/1d87agq/new_and_returning_player_guides_and_faq_the_final/",
        "content": "#[Click here for our highly detailed, very in depth new player guide!](https://docs.google.com/document/d/1Q07M8zBUj1yMab4YJjv6aV5QO7hNRuALvxR7xwLXIVs/edit)\n\n[**My very brief new player advice**](https://steamcommunity.com/sharedfiles/filedetails/?id=1878973112)\n\n[Bungie's official new player guide](https://www.bungie.net/7/en/News/article/official-destiny-2-guide-new)\n\n[**Summary of major gameplay changes over the years, for returning players**](https://steamcommunity.com/sharedfiles/filedetails/?id=2639645014)\n\n[Guide summarizing every monetization option with a \"what should I buy\" FAQ at the bottom.](https://steamcommunity.com/sharedfiles/filedetails/?id=1991994652) The monetization just gets more convoluted with time! Read this if you are confused on what to buy, or what each purchase would get you. \n\n(Disclaimer: I cannot play for the time being. My guides, the ones on Steam, are not yet up to date for The Final Shape but I will try to get those done by the end of the week. I made this post to replace the [earlier pinned post](https://www.reddit.com/r/destiny2/comments/185v2pj/new_and_returning_player_guides_and_faq_season_of/) now that The Final Shape is out.)\n\n---\n\nIf you have any questions not addressed here, feel free to ask in the comments!",
        "num_comments": 208,
        "comments": [
            "I got the old Legacy bundle with the Epic store giveaway in December and started playing the tutorial on Sunday. Is it no longer relevant and kind of pointless? I see it is now $60 for the 2024.\n\nI want to do almost exclusively PVE. Do I just follow the guide and buy The Final Shape since it's the current expansion as my way to get into Destiny and just get additional stuff from there? The 30th anniversary is on sale for a few bucks.\n\nEdit:, I could switch to Steam and get the legacy collection 2024 there.\n\nI think that the Legacy 2024 vs Prior Legacy has 30th anniversary, Foresaken, and Lightfall added to it.",
            "Does the Arc Soul you get from Getaway Artist deal grenade damage?",
            "So destiny 2 offers season of the wish free for all players leading up to the final shape and then makes players unable to craft items post final shape release. Bungie moment.... I hope you guys realize your mistake and make those weapons craftable. As you offered the content free to all players.",
            "Without buying TFS how many missions can I do before I get stopped and asked to buy it?",
            "I really want Monte Carlo.  \n\nI was in the middle of the quest when final shape dropped.\n\n\nI no longer have the timeline remembrance quest.\n\nCan I not get an easy Monte Carlo this way anymore?",
            "I haven't not played since 2018. Is the game worth getting back into at this point? What would the monetary investment look like? I like all the content.",
            "[deleted]",
            "playing this game is like studying for a midterm lmao what a fucking mess. you shouldn't have to read pages of FAQs to learn how to simply purchase expansions and play them. I'd like to jump back in but I am not going through all of this.",
            "Two questions:  \n1.\tI beat legendary campaign on a completely random build, and my friend does miles more damage than me. What’s the go to recommendation for learning to build properly? I’d like to get into raids.  \n2.\tAfter Icol…? The fight where you kill two subjugators while the witness attacks you, how much more content would I need to complete before the raid, in terms of a continuous story? Don’t want to spoil anything for myself.  \n\n\nThanks!",
            "This was useful, thanks 🙏🏽",
            "Is there a place where I can go look at builds? Or builds used by top players?",
            "As someone who is coming back to D2 who left after getting burned by Lightfall... what should I prioritize \"unlocking\" when it comes to crafted weapons, exotics, subclasses, etc?",
            "So, as a returning player, what is the purpose of the 'Triumph Score'? Is the crucibal still full of sweaty try-hards?   \nWhat is a good way to build up my power level.. again?   \nIs there a way to play the full story for Cayde and Savathuuun?",
            "Should I get new gear (specifically armor) to upgrade, or is my fully upgraded lightfall gear ok to power up?",
            "Do we instantly launch into a story mission at login or can we wait in orbit for our fireteam and not miss anything?",
            "Is the story without spoiling it with the money?",
            "I played a little bit of Lightfall but never completed it so I never unlocked Strand outside the missions that let you use it. I have everything else unlocked though. Do I need to go through Lightfall to unlock it? Or is there some quest or something I can do to get access to it without doing that?",
            "can't rank up at the tree, same issue like [https://www.reddit.com/r/destiny2/comments/16tdy4e/ironwood\\_tree\\_broken\\_and\\_i\\_cant\\_level\\_up/](https://www.reddit.com/r/destiny2/comments/16tdy4e/ironwood_tree_broken_and_i_cant_level_up/)",
            "I have not played since Beyond Light, do I need to buy witch queen and lightfall as well as final shape or can I just get final shape?",
            "Hello I need help how to play the content. I have now bought the legacy collection 2024. Can I use it to catch up on the old content and get the final shape later? I know a lot of content is no longer available and can't be replayed, but I don't know where to start at the moment. \n\n\n\nI have read that there is still something like dungeons or raid keys. Do I have to buy them separately or can I unlock them?\n\n\n\nI'm thinking about watching the 10 hour lore video in the next few days to understand everything",
            "Hey, \n\nI have finished the campaign on Legendary and completed the two exotic missions...What do I do now? \n\nI also have a bunch of exotic and prime engrams..when should I unlock those? Sitting around 1970 light level.",
            "Can i farm dungeons for their exotics? i starter recently and dont have good enough loadouts for the harder raid. I wanted to do a world tour and i dont know how the loot rules works. \n\nAny help and info is appreciated thank you",
            "Anyone know how to unlock twilight arsenal for a regular void build? Don’t want to use prismatic. It says it can be found in the travelers pale heart",
            "I wanted to check to see what I should buy for my PC, since I just finished my new build not long ago, but figured I would wait for a sale to get what I was missing. Currently on Steam I am missing Beyond Light and Lightfall, and was planning to get The Final Shape. Which items in the store do I have to buy to get access to the Exotics and Dungeons for that older content?\n\nI looked in the store and saw the Legacy bundle for about $25, but people in the comments said that doesn't come with the Dungeon Keys.",
            "How does the exotic class item work exactly if I want to use the liars handshake exotic for my melee build",
            "Returning player from PS coming to PC, is the legacy 2024 pack going to give me everything except FS and dungeon keys?",
            "Is Prismatic progress shared across characters? I doubt it but I gotta ask.",
            "I havent played destiny 2 since shadowkeep, if I return now what do I do with all my vaulted gear? Is it better to simply clear it out?",
            "Why is the forum on the app filled with whinging players? It's so accessible too but I just don't want to be a part of it",
            "I'm playing on pc right now for final shape after switching from ps5. I have a problem in that I can only use prismatic supers. When i try to change to the old light and dark supers it's asking me to buy lightfall again. I'm guessing even if I buy its then going to lock me out still and make me buy stasis. I can't select any other supers. Is this normal?",
            "I'm kinda lost with all this. I began D2 back in 2018 starting with The Red War and played all the way thru most of the Forsaken missions. Specifically I think I stopped after Nothing Left to Say.\n\nIs it worth returning to my original character or should I just start a new one? I know a lot of the original missions are no longer playable, is there any way I can refresh my memory on the story without watching a super long lore video? Do I even need to?",
            "I need some help with the mechanics on how to activate the relic's super on the final shape, got thru the first couple of mission's of the campaign. But unfortunately forgot how I activated it to remove shields from bosses. ps4 console/destiny 2 All help greatly appreciated",
            "How many missions are in TFS campaign before I buy it?",
            "Is it worth to do the story on legendary on all characters? or just one is good enough?",
            "Just bought final shape and all the other DLC’s. Been out of D2 for a while, looking on how to get the 2 subclasses I missed? Do I have to go back and play old campaign’s or is there an easier way?",
            "Just started playing 4 days ago again. Haven’t played D2 since it released.. so I bought the add-ons I’m playing the final shape. But have a few questions. Is there a way to get spirit of riven without playing shadow keep? Do I have to run through all the dlc to unlock the npc’s to upgrade my gear?",
            "Also, if anyone has any good dps weapons or ideas for a returning player please lmk im actually running the other add ons and in between im doing exotic quests and trying to solo lost sectors but im not doing enough damage and am losing while fighting the named bosses",
            "How do the classes stack up against each other currently? Is hunter prismatic really weaker than warlock and titan?",
            "Hello new here.  \n\n  Can anyone help me?  How do you destroy white shields?  Exact buttons for ps5",
            "I bought the Final Shape + season pass this morning. I played everything up to lightfall I think, maybe one or two season before that I missed.\n\nBut what's the story going on? Mechanically, where am I at? I haven't had time to dive in yet.",
            "So, is this it for Destiny? Or will there be more expansions in the future? I'd like to get back into the game, but not if this is the last piece of content/expansion that will be released for it.",
            "So I've been away awhile. I bought The game starting when the expansion with darkness powers and that ice area launched. At that time they sunsetted weapons and certain older expansions.\n\nI stopped playing after finishing the main quest partially because, while I had the gist of what was going on, not being able to play the older stories confused me.\n\nHowever I just read they got rid of sunsetting. Is that just weapons or did they bring back the old campaign missions too?\n\nThe new expansion looks good, especially because Caydes back, but I don't want to run into the same issue as last time.",
            "I want to play the game again, I **WANT** to play the game, but just opening up the menu is enough to make me want to uninstall again.   \nI love the gameplay, I love the FPS aspect of it, but I stopped playing (multiple times) because trying to return to the game is nearly impossible. I have no idea what's going on, and being unable to play older stories sucks. I wasn't able to be there for the Cade story and I wanted to know what all happened with that story and him going away.   \nI want to get caught up, story wise, and find some way to not be overwhelmed by the new menu layout and all the flashing icons.",
            "Hey all, I looked at the returning player guide and still had a few questions.\n\nI was a D1 player and in D2 I only played the base game + The Witch Queen. I’m thinking about getting this new expansion, but I’m unsure how the levels/power creep from other expansions, if they will be needed to get me to the gear needed?\n\nAlso, I used to do some PVP, is that still relatively active or is it mostly PVE?",
            "I feel a bit crazy. Is the game supposed to be this solo-sided? I am a casual solo player but I've seen they're pushing this new fireteam finder thing. I did the campaign missions that way and now I'm wandering the Pale Heart, doing the campaign adventure things. I don't know what these are but I imagine they're necessary to advance the Prismatic Sublass skills. I'm finding these exceptionally difficult as a casual player. The adventures don't offer me a chance to find or create a fireteam like the normal campaign missions did. Is this on purpose? I'm dying at least 20-25 times in each adventure, just left and right, nowhere to hide from enemies and they just overwhelm me until I fail my way through the mission's end. It doesn't feel very good, and I'm getting extremely frustrated.\n\nAlso when I go to the Pale Heart, there isn't a single soul around. Where the hell is everyone? Why does the game feel like it's not even online? Is there something I have to unlock to find random people around? I feel like I'm missing something massive and I'm just not savvy enough with D2 to realize it.",
            "I used to play years ago on PS5; my son would play under another PSN that was under my main account on a PS4. Anything i bought on my main account (dlc expansions) he was able to download on his account as well. Does this still work? \n\nHe nvr quit playing the game but id like to get back playing with him without having to buy Final Shape twice.",
            "I did all the final shape campain but still have some granades, supers and aspects locked  \ndoes anyone had the same problem?  \ndo i need to do all de missions again?",
            "any recommendations on returning? I tried downloading the game again recently (got all the free dlcs through playstation) and felt instantly overwhelmed and didnt know what to do or where to go. Id like to play through all the dlc missions i havent done etc before the next big dlc and want to see if ill like enough to buy the new chapter etc. Any tips for feeling less overwhelmed? i think ive only done the first dlc shadowkeep, not 100% sure lol",
            "Hey, I'm looking for a source of item drops, what activities give what item lvl. In the OP's guide, he linked https://www.blueberries.gg/leveling/destiny-2-max-power-level/ but unfortunately it is not up to date. Do you know this type of good summary for the latest expansion?",
            "Returning player here (I left before stasis and strand were released). Is it just me or did they nerf the striker shoulder charge in crucible cause I remember being able to OHKO with it.",
            "Looking to group with someone for help with Watdens on Requiem act 1",
            "So, free to play players can't roam inside the traveler like they did on other maps on early expansions?",
            "Does anyone have pictures of the Overthrown Bosses so I know which ones I'm missing?  The Triumph is still bugged.",
            "I haven't played since the Saint 14 stuff and goddamn I am so lost with how many things are going and have changed.",
            "[removed]",
            "Hey guys, I've read the guide and some others but I'm still confused on the story aspect.\n\nWhat's the farthest back I can go in the story currently if I want to play all campaigns in order? I understand some campaigns were removed, others are free or something, and the most recent ones I still need to buy, not just Final Shape. But in the store there's a lot of collections and packs and whatever and I'm confused as to what should I buy for the campaigns.\n\nI looked into the Legacy collection 2024 and it appears to be mostly weapons, nothing story related, so I just bought specifically the Witch Queen and Lightfall, as well as the Final Shape + Annual Pass, would I be able to play everything story-related available right now? I can't remember if I finished Forsaken and Shadowkeep, I'm sure I didn't finish Beyond Light because I only did like one or two missions before it was removed from game pass, but I don't know if they're still available and if they are, if they are free or I need to buy those as well.",
            "Anyone having troubles with the quest alone in the dark? Specifically part 5 for false idols?\n\nThe marker is in refraction & the bird of light is sitting there but when I go up to it, it doesn't move or fly off to tell me where to go next..so I can't really progress it & get false idols to drop",
            "I need some advice regarding catalyst farming. Back in the day, when strikes were faster to clear, it was a steady way of farming for catalyst drops but nowadays it sucks. I tried doing regular crucible but after 6 hours of Control, nothing dropped. So when I hovered over Competitive it said on the bottom \"Rewards: Exotic Catalyst (rare)\". So with my newfound discovery I started playing that mode from 1pm till 2am last night, without even knowing I hit Adept 3 rank but NOT A SINGLE CATALYST DROPPED.\n\nSo please, someone help me, what is the actual best way to farm catalysts?",
            "I haven't finished The Final Shape (taking my time with the campaign), is there any spoilers in Episode Echoes other than, like, the Witness getting got?",
            "Quick question in regards to alone in the dark and an exotic.\n\n>!So if I've already done all of them but didn't collect all their scraps or whatever, is there a way to check which ones I've missed? Or do I just have to run them all again to get the Khvostov?!<",
            "After the addition of final shape, anyone knows whats the size of the game on a fresh installation with steam? I really wanna get both lightfall and tfs but I'm kinda worried that I won't have enough space on my laptop.",
            "Not sure if this is the place for weapon recommendations, but I've been really enjoying running Double Golden Gun with the Still Hunt, but am not sure what Kinetic/Strand/Stasis weapon to run in the top slot. Not sure I'm a fan of running double special weapons, since the mechanic that provides ammo seems inconsistent at best. What could be a good primary ammo weapon for that slot? I guess I could also consider a special and just try it out for a bit, but not sure.",
            "I'm a bit confused on dungeons.  Are dungeons just paid? What kind of items am i missing out on by not having access?",
            "Returning player here. Two questions. What the fuck is the new guardian… rank? System? At what point should I start worrying about it? The game decided that I should be rank 5 for some reason now that I’m back after a college-length hiatus during which basically nothing I paid for is still in the game. \n\nSecond. At what Light Level can I comfortably start dropping into groupfinders and doing raids? What’s the bare minimum exotic or DPS item I’d need to bring in, especially as a warlock post well Nerf? Should I bring *strand* in? ",
            "I heard from a Video that Shinobu's Vow was getting a buff, is this true? I haven't seen anything anywhere else supporting this, or is it an indirect buff from a  Skip Grenade buff? Trying to make an Arc Hunter build and want to consider my options besides just Liar's or Assassins.\n\nEdit: I would like to preface that I do not have The Final Shape yet, I plan on getting it, but don't have it. So Prismatic is off the table.",
            "I'm trying to get to Guardian Rank 6 and only need to complete 2 weekly vendor challenges. Where do I go to complete those?",
            "something is odd the guide mentions the \"darkness doorstep \"mission  which i cant find  \n\n  \nlast time i played it i completed the beyond the light with antoher class without any issues ........",
            "Not exactly the new player question everyones thinking but, i have a friend who has refused to do the campaign dont ask why, but owns all the dlc. Is he getting barred from acquiring the new class exotic mission by not doing the campaign. We just did Savathuns puzzle and he says it kicked him to the main menu coincidentally at the end.",
            "Since Final Shape released, the legacy 2024 edition went on sale and it's pretty cheap right now, I am a completely new player who wants to pick up this game, I was wondering should I go for the legacy edition 2024 edition or should I get final shape? Keep in mind I am a completely brand new player (I currently have enough money to buy only one of either options)",
            "How can I obtain crafted weapons from past seasons?",
            "So I redownloaded the game. Dont have the newest expansion. all my old gear from ages ago is at 1900\n\nBut im overwhelmed with what to do. What should I be focusing on? do I just pick random questions and slowly gear up? or is there something else\n\nThanks",
            "as someone who skipped lightfall what's the best/fastest way to go about getting abeyant leaps on my titan now? lost sectors?",
            "Hello, new player here, if I buy the final shape I have access to past content too? Or I should buy past expansion to have access to full game?",
            "How early on do the DLCs start to feel required? Can I get a few weeks of free play in without feeling like I’m barred from content before deciding to buy them? And does buying Silver for extra cash shop items ever feel required? Looking for a MMO to start grinding.",
            "Do I have to beat the campaign again to do the raid on a different character? I already beat both the campaign and raid on my main(hunter) and now I'm looking to do the raid on my warlock but I've yet to do the campaign and don't want to do it again. I'm just hoping I would be able to do the raid via joining a team leader that can boot it up.",
            "I just finished the Shadow Keep campaign with my Hunter. I was hoping to get the Assassin's Cowl. However, Ikora didn't give it as a reward. All I got was an exotic engram which gave a random one. Is there any other way to get it? Thanks!",
            "I started playing about a week ago and Im currently rank 4. One of the quests to become rank 5 is to play some vaguard strikes with other ppl and honor them after.\n\nOn my first one i got into a group with 2 other random ppl and we cleared the strike pretty quickly, however when i tried to play more I never managed to get into a group with others again. I tried to solo but its pretty much impossible, there are way too many mobs to handle. My gear score is 1947 and 1945 is recommended.\n\nSo I was wondering how I got into a group the first time but never again during my dozen other attemps? Am I missing something?\n\nI noticed that after pressing the start button its searching for other players but after a while it just starts. Is there a way to only start once you got a full group?\n\nBecause rn its very frustrating since Im cant solo but also cant find ppl which pretty much locks me out of that content.\n\nAny help is highly appreciated",
            "Can anyone help. \n\nThe threaded spectre aspect on my hunter is still locked and ive already completed the side quests after the campaign and also re-done the adventures to get other aspects. \n\nThen realised i had to go back to lightfall and do the veil quest after completing that quest and unlocking threaded spectre for strand. \n\nIt is still says that the threaded spectre is a locked aspect on Prismatic and I have no idea how to unlock it now",
            "Can I get the song of flame super for my solar warlock without buying the new expansion?",
            "I've read all your guides (thank you!) but am still confused. \n\nI bought the original in 2017, and haven't purchased anything since. \n\nI just want to play the campaigns, as free as possible.",
            "finished legendary TFS but didn't get exotic, whats going on?",
            "[deleted]",
            "Just saw the post where someone logged in a couple days after release and was about to start The Final Shape campaign but was greeted with the typical forced cutscene but it was about how the game is over and the big bad is donezo. He mentioned he was very put off by that and I feel put off just reading it. \n\nI used to love Destiny and played since the Red War. Stopped around Lightfall because my friends and girlfriend couldn’t get into it (they were interested in the story after I explained it to them). \n\nHas Bungie ever talked about whether or not they’ll bring back old campaigns just for new players? Destiny 2 seems like a game of “you had to be there” but I really want to experience the campaign with friends and catch them up.",
            "I have two Riskrunners is there a good reason to keep both of them or can I get rid of one for the stuff you get by deleting it? If every Riskrunner has the same stats is there any reason why I would need to keep one of them?",
            "Guys does indomitability (onslaught weapons perk) work on prismatic? Does it use your equipped super?",
            "So I came back at the very end of season 23. I see tons of people riding around on the skimmer. Sounds like it was part of a past event. Is there any way to get one currently? If not has Bungie mentioned it/ the event that gives it returning?",
            "As part of the guardian rank objectives, I need to complete 2 vendor challenges in order to reach guardian rank 6.\n\nI cannot figure out where to find these or how I can engage with them. Am I missing something obvious or do I need to wait for a timed objective?",
            "Any recommendations on Titan loadout(s) for Salvation's Edge? Especially for the 2nd encounter. Or does it depend a lot on the surge? I'm wondering if Sunbreaker with Path of Burning Steppes is a good move, since the Stasis enemy attacks really get in the way of doing mechanics when I've tried the raid",
            "Is shiro chi still the fastest way to level weapons and do catalyst progress?",
            "I heard the two DLC subclasses before this were free, how do we actually get them? I’ve done all the timeline quests and still only have solar, void, and arc",
            "Can I still get the Scarlet Semblance shader?",
            "I just returned to the game with a fresh account. Can anyone help me grasp how the actual weapon meta is, as in what weapon types are more \"OP\" in PvE mainly but also PvP if possible.",
            "I bought the legacy collection recently, does that give me access to the root of nightmares raid? Also how do i know what content i just bought? This is super convoluted.",
            "Anybody else getting booted to orbit while playing the campaign?",
            "What you should buy comes down to what you want. What would you want from The Final Shape that you do not get from the earlier expansions? Like for example, do you want it for Prismatic? Are you into raiding, because you need The Final Shape for the newest raid which is a big deal among hardcore pve players. Do not feel like you need to get it just because it's new. This isn't WoW, being new doesn't inherently mean you need it for some kind of barrier to entry. It's just that it has all the latest pve activities which pve-focused players are typically interested in. \n\nContent ownership is per platform, but if you have already played enough of what you have on Epic, you don't necessarily need to re-buy it all on Steam. For instance, I got the free 30th anniversary pack on Epic, and I got all the items that I wanted from it and then uninstalled the Epic version of Destiny 2 because I don't feel the need to play Grasp of Avarice any more. But if you still like to do all the older paid raids you would need to either keep the Epic installation of D2 or you would need to re-buy everything on Steam.",
            "I'm not Bungie, I'm just a player. That sucks, though.",
            "I believe it was only free for that single month if im understanding you right and technically savathuns throne world where the enclave resides is unlocked thru campaign and therefore not free to others. Might help answer your question",
            "1",
            "Pick it up from the quest archive in the tower",
            "You can just start up the game without paying any money. It isn't like it used to be, where you had to buy the game in order to play it. You can just download and start playing without having to buy anything. \n\nIf you are looking for something specific, it may require a purchase, such as each DLC having a raid that you need to buy the DLC in order to play, and all storylines being paid but you can play the beginning for free. \n\nIf you want a more detailed answer, see the monetization guide linked in the post. I just updated it, but if you have additional questions, please let me know.",
            "How do you focus engrams on a slot?",
            "if you finished the legendary campaign you only should do the destined heroes exotic quest and the Wild card exotic quest (which you unlock after step 4 of destined heroes)\n\nbest way to learn is to watch youtube content. We are now in a phase when a lot of new stuff was added with prismatic so new builds are being discovered. Ehroar, Llama, and Aztecross are good for beginners.",
            "r/destiny2builds",
            ">what is the purpose of the 'Triumph Score'?\n\nIt's just for fun. \n\n>What is a good way to build up my power level.. again?\n\nI don't know when you last played, but power level works similar to how it did back in 2018. The way power level works has been unchanged for about three years now. [This page explains it](https://www.blueberries.gg/leveling/destiny-2-max-power-level/), but the numbers are all higher now because of The Final Shape. Ignore any seasonal content listed on this page, since that has all been removed. Scroll down to the section \"How to reach Max Power Level in Destiny 2\" for an explanation. \n\n>Is there a way to play the full story for Cayde and Savathuuun?\n\nNo, The Red War and Forsaken which both have Cayde have been removed from the game. Season pass storylines have been removed from the game. Witch Queen introduced Savathun as a character we actually meet and is a permanent part of the game so you can play that story in its entirety.",
            "I don't have any idea what items you have, so here's a vague and general answer:\n\n* You should have a variety of weapons available. I typically recommend at a bare minimum people have a set of weapons for boss DPS and a set of weapons for crowd clearing, and if you want, a set of pvp weapons. Mix and match these depending on what you're going to do at any given time. \n\n* Power level doesn't matter as much as you may think. Individual activities have their own power levels, which it will say if you hover over an activity. Being vastly overpowered doesn't have much benefit, but being underpowered makes this MUCH harder. \n\n* Having a variety of weapons is useful for fulfilling certain objectives, like if you have a bounty or something to kill enemies using a specific item. It's not necessary to upgrade weapons to a higher power if this is all you use them for.\n\n* When it comes to armor pieces, what people look for are the stats. If you like the stats on your armor, feel free to stick with it long term. I like to switch up the exotic armor I use, so I have a few sets of armor to make sure I have items that go with every combination I commonly use.",
            "Yes, ever since 2019 this game automatically launches you into the latest mission. You have to leave to orbit but then you can go back and play that mission later. There's no one-time-only timed activities here so you can't lock yourself out of any missions, don't worry!",
            "You can’t wait for your team. It sorta forces you but my friend was able to force join me before I chose a difficulty",
            "I know sever issues and all but only talking story length of the story.",
            "I don't have The Final Shape so I can't be 100% certain, but I'm 99% sure you have to do Lightfall to unlock Strand.",
            "Besides what was suggested in the comments of that post, here's some more things you can try:\n\n1. You might need to claim a completed but unclaimed triumph under the Journey tab. \n\n2. This might be a new bug introduced in the update. If that is the case, the only solution is to wait for Bungie to fix it. \n\n3. You could try restarting the game to see if that fixes the issue.",
            "You can buy any combination of things and barring a few mistakes on bungie's part, it will all work. So if you don't specifically want anything in Witch Queen or Lightfall, you don't need to buy them in order to buy The Final Shape. You can just by The Final Shape and everything will work fine.",
            "It doesn't really matter where you start, but if you wish to go in chronological order, there's a timeline in the upper right corner of the solar system map. Each unit of content, such as each of the DLCs you have bought, has an icon associated with it and the game expects you to recognize it. The timeline shows you the icon and the name of the DLC in order. \n\nElsewhere on the solar system map, or in your quests, you should see the matching icons. Follow these in order to do the DLC main story quests. \n\nYou can play through the entirety of Shadowkeep, Beyond Light, Witch Queen, and the 30th anniversary pack. \n\nRaid keys aren't a thing, those don't exist. Dungeon keys can be purchased for silver (the real money microtransaction currency) from Eververse and they give access to two dungeons each. I am honestly not that into dungeons and hardly play the ones included in the base game and Shadowkeep (Prophecy, Pit of Heresy), so I haven't bought these. There is no way to unlock them through gameplay. There is no way to get paid content without paying real money in this game.",
            "I haven't bought The Final Shape yet, so I can't say a whole lot. This is assuming you are referring to The Final Shape and not Witch Queen or Lightfall which both also have Legendary campaigns and exotic missions. I have those so I could say more. \n\nTypically each DLC adds some pve activities, and an open world area you can explore. Have you done this? The Final Shape adds the Prismatic subclass. Have you gotten this? \n\nThen you have access to the same core activities and quests that everybody else has. Coming soon is The Final Shape raid, if you're a hardcore pve player who might be interested in attempting the raid day 1 or week 1. \n\nAs for when to open engrams, they don't grow in power level after you pick them up. It does not matter when you open them. You don't need to overthink things this much, do not worry!",
            "I'm currently working on my [exotic item guide](https://steamcommunity.com/sharedfiles/filedetails/?id=1881576082) so it's not up to date with how to get The Final Shape exotics yet, but everything else should be good. I don't know if Bungie changed the way dungeon loot drops worked, but as of last week how it worked is there was a weekly dungeon rotation and each week, one dungeon was the weekly dungeon you could get one pinnacle engram from completing, and you could farm it for the exotic. Besides that, the other dungeons have a chance of dropping the exotic once per week per class. Do note that some dungeons' exotics are from quests, like Wish Ender, not random drops.",
            "Hello, the monetization guide linked in the post explains this in more detail, but if you truly feel you want every exotic and every dungeon, you will need to buy everything. This means you would need to buy Beyond Light, Lightfall, The Final Shape, and all the dungeon keys in the Eververse store. The DLCs go on sale so definitely wait for that. The dungeon keys never go on sale.",
            "Looks like it to me.",
            "You should dismantle all legendary armor. If there's an exotic you really love, feel free to use it until you have a new one drop, but the Shadowkeep-era armor is all worse than modern armor because it doesn't use the same stat or mod system. \n\nAs for weapons, I'm unsure. I haven't had a chance to play since The Final Shape came out.",
            "Every community turns to complete garbage if it reaches a certain size but does not have active moderation. Or at least that's my take on it. I don't use the official forums either, but they are one of the only two ways to contact bungie so you might need to use them if you have some kind of significant problem in the game.",
            ">I'm playing on pc right now for final shape after switching from ps5.\n\nThis is because DLC ownership does not transfer between platforms. The page where you activated cross save explains this, but most people miss it. Only the light supers are free to play. You can't use stasis unless you buy Beyond Light on the current platform you play on, and you can't use strand unless you buy Lightfall on the current platform you play on. \n\nI used to have beyond light through xbox game pass (this was years ago, the DLCs aren't on xbox game pass any more), but I just live with not using stasis because I didn't really like it that much and I normally play on PC so that's where all my other DLCs purchased are.",
            ">Is it worth returning to my original character or should I just start a new one?\n\nI personally like to just keep using the same character, but if you want you could make a new character without deleting your first one, just to see the current tutorial system. Older characters have things that newly created characters need to take time and glimmer to unlock. \n\n>is there any way I can refresh my memory on the story without watching a super long lore video? Do I even need to?\n\nWhat I do is I go to youtube and type \"destiny 2 (name of DLC/season pass) cutscene movie\" and there's lots of people who make short videos that are just cutscenes and relevant dialogue. You don't *need* to do this. Since you started with The Red War, if you didn't play Destiny 1 a lot of things were not explained but for me at least, The Red War still made sense. So that's what it will feel like going forward. Lots of characters the game expects you to know, but you can just follow whatever the quest says to do and you will be fine.",
            "I haven't yet bought The Final Shape, but how it worked for Witch Queen and Lightfall legendary campaigns was that it was not worth it. What you got from doing the campaign on legendary was a set of high power level armor (not maximum, but I don't remember the number off the top of my head). Numerically, it isn't worth doing legendary 3x to get it for all your characters because of how the power level of item drops works. If you really want I can write a more detailed explanation of how/why it works this way. You'd also get an exotic armor piece, but these had very disappointing stats so a lot of people preferred to get them through other means. \n\nThe only thing *exclusive* to Legendary for Witch Queen and Lightfall is an emblem. I'd guess this is going to be the same for The Final Shape, but like I said I can't know firsthand.",
            "Yes, you have to play the old campaigns. Being old doesn't make them inferior, do not worry. I mean, in general many people don't like Beyond Light's or Lightfall's stories as much, but it's not because they're old.",
            ">what's the story going on?\n\nThere are a lot of summary videos on youtube, but what I prefer to do is type into youtube search, \"destiny 2 (name of season or DLC) cutscene movie\" and there's a lot of videos that combine all the relevant bits of dialogue, gameplay, and cutscenes to show you the story you have missed. If you need a refresher on the names, see the timeline in the upper right of the destinations tab. \n\n>Mechanically, where am I at?\n\nWhen you start up the game, you will automatically be loaded into the first mission of The Final Shape. This happens to everyone, regardless of whether they bought it, but since you bought it you can continue beyond just the first mission. \n\nIf you wish you can take out your ghost and leave to orbit, and you can come back and do that mission later.",
            "They haven't announced anything, but I hear there is going to be a vidoc (video with the developers where they talk about stuff) soon.",
            ">Is that just weapons or did they bring back the old campaign missions too?\n\nIt was just weapons.",
            "I go to youtube and type in \"destiny 2 (name of DLC/season pass) cutscene movie,\" and there's a lot of people who gathered all the cutscenes and relevant segments of gameplay to show you the whole story. On the destinations tab (the solar system map), there's a timeline in the upper right hand corner. This is where you can get the names of things to search for cutscene movies with. \n\nLearning how to cope with a busy user interface is kind of a skill you need to practice. You need to learn how to tune things out and focus on it one part at a time.",
            ">I’m unsure how the levels/power creep from other expansions, if they will be needed to get me to the gear needed?\n\nThey are not needed. \n\n>Also, I used to do some PVP, is that still relatively active or is it mostly PVE?\n\nMostly pve, but pvp is active.",
            "Starting with Lightfall, they decided to up the difficulty of open world areas going forward, so that's why Neomuna and the Pale Heart are harder. \n\nI haven't bought The Final Shape so I cannot comment on anything specifically. \n\nAs for open worlds being deserted, this is almost always due to some sort of connectivity issue.",
            "I haven't bought The Final Shape and am trying to avoid spoilers, but if you type into google \"destiny 2 how to unlock prismatic\" there are many results.",
            "Just take a deep breath and know that no matter what you do, there's no way to mess up. Lots of people worry about locking themselves out of parts of the game, or missing some one-time-only activity, but that doesn't exist here. That isn't a thing. \n\nIf you want to play through the DLC stories, each DLC has an icon associated with it and this is how the game expects you to recognize them. To see what the icons look like, see the timeline in the upper right of the destinations tab.",
            "I don't know of anything up to date. It has been a little less than a week. It's too soon to expect every guide to be up to date. \n\nThat said, if you understand the user interface, you will not need to rely on a guide. Do you know how to tell if an activity gives higher power level items?",
            "Your submission has been removed in violation of:\n\nRule 3: No Spam/Low Effort Content/Rant Posts\n\nFrequently (re)posted questions/content that serve to karma farm, mislead, troll or inspire rage, are spam. Constructive criticism is thought out, not directional, and provides avenues of approach to problem-solving. Low Effort is any/all content that contains no creativity or thought.\n\nIf your post was removed for being a repost or spam, it may be because while you haven't spammed it yourself, it may be something that many others before you already have posted.\n\n---\n\n*Please refer to our detailed rules in the sidebar, or [message us](https://www.reddit.com/message/compose?to=%2Fr%2Fdestiny2) with any questions or concerns.*",
            "Hello! The oldest story chronologically is Shadowkeep, which is free to play. After that is Beyond Light, which was also made free to play last week. The rest of Beyond Light besides the story still costs money, though. There's a timeline in game in the upper right of the destinations tab that shows you the order. \n\n>Witch Queen and Lightfall, as well as the Final Shape + Annual Pass, would I be able to play everything story-related available right now?\n\nYes.",
            "Hello, these are all the dungeons currently: \n\n* Shattered Throne. Part of the Forsaken Pack\n\n* Prophecy. Free to play. \n\n* Pit of Heresy. Part of the Shadowkeep pack. \n\n* Grasp of Avarice. Part of the 30th anniversary pack. \n\n* Duality and Spire of the Watcher, part of the Witch Queen dungeon key. This is a completely independent purchase, it doesn't come with Witch Queen, it doesn't require Witch Queen. \n\n* Ghosts of the Deep and Warlord's Ruin, in the Lightfall dungeon key. \n\nYou can type into google \"destiny 2 (name of dungeon) loot table\" and there are many charts and web pages showing all the items that come from each one. I'm not a huge dungeon person so I didn't buy most of these. I can't really get into specifics of their loot.",
            ">What the fuck is the new guardian… rank? System? At what point should I start worrying about it? The game decided that I should be rank 5 for some reason\n\nThe ranks 1 through 5 are a tutorial system. Everything above that is just achievements, and your guardian rank is a way of showing off your achievement score to others. \n\n>At what Light Level can I comfortably start dropping into groupfinders and doing raids?\n\nOnly the latest raid has a high power level requirement. That doesn't mean all the other raids are easy, they still require things like a thorough understanding of the game and the ability to communicate with your team. I haven't played in quite a while so I am out of the loop regarding the DPS meta, but at a minimum you should have a loadout for add clear and a loadout for boss DPS. Mix and match them as the encounter demands. There is an actual Loadout feature, but I don't actually use it, I just manually switch weapons, armor, and abilities before each encounter. I have raided with warlocks who used Strand in raids, but I don't really use it there.",
            "These are the NPCs in the Tower who have weekly challenges when you hover over them, such as Zavala.",
            "If you already completed Beyond Light, you already did that mission so it won't show up on the map or anything. It's the very first mission where Variks calls the guardian for help. \n\nIf it isn't appearing for a new character that has not done Beyond Light, perhaps this character is not yet finished with some sort of tutorial thing. Do you have a list of milestone objectives in the upper left of the destinations tab?",
            "If you are unsure, it's ok not to buy. There will be more sales later on. I don't believe either one is objectively a right or wrong choice. I haven't yet bought The Final Shape, but I hear good things about it. \n\nIf you are instead asking for details of what exactly each thing includes, see the monetization guide linked in the post above, and the store descriptions. I have had others tell me they can't see store descriptions, but Steam has them and you can just view Steam as a web page even if you do not play on PC.",
            "Depends on the season. Some, you can't, some you can. In the Legends node on the destinations tab, there's a former season pass mission rotator, but you only have access to the missions that came out during the time of a DLC you own. So for instance, you can only do Presage if you own Beyond Light. These can drop red border weapons from earlier seasons. It's pretty complicated, to be honest.",
            "In the end, it doesn't make a huge deal what order you do things in. Lots of people get decision paralysis or feel overwhelmed, but just know that no matter what you do, there's nothing that will actually hurt in the sense that it has bad consequences later on. This isn't that kind of game, where choices of what you do matter. There's no diverging storylines, there's no way to lock yourself out of any content by doing something wrong.",
            "You can't get this item if you did not buy Lightfall. The ways of getting it are exactly the same as they have been since Lightfall released.",
            "Just to be clear, most people who ask this question are assuming you need to own past content in order to do current content. That is not how this game works. If you can buy it separately, it functions separately without needing you to buy anything else. \n\nBut if you do want everything, you have to buy everything. For details see the monetization guide linked in the post.",
            "This is going to vary based on opinion. I couldn't tell you. Some people are content for months to not buy anything. Some people see the first \"buy this thing\" popup and feel they have to. \n\nBuying silver never felt required to me, but a lot of people feel they do have to. I don't know why, it isn't a literal requirement. For example, there are some dungeons that can only be purchased with silver, but you only need to buy them if you actually want to play them. Lots of people assume that you need to buy everything or it won't \"work,\" but that isn't the way this game is designed. Everything you can buy separately functions separately. So it's not like you will buy a DLC and not be able to play it because you didn't buy a dungeon, for example. \n\nFor details about how monetization works, see the steam guide linked in the post itself.",
            "Did you buy the Shadowkeep pack?",
            "Not matching with other people in strikes is some sort of connectivity error. I am not tech savvy enough to know the ways of troubleshooting internet connections, unfortunately.",
            "Hello, the Shadowkeep and Beyond Light campaigns are free. If you wish to see the order each campaign goes in, there's a timeline in the upper right. \n\nAll other campaigns are paid, but you can play the first 1 or 2 missions for free. If it's something I don't want to buy, I go to youtube and look up a video of the campaign (use the search key words \"destiny 2 (name of campaign) cutscene movie\"). If you are willing to wait, the DLCs all go on sale every now and then.",
            "Yes, barring a few specific items, all exotic weapons are the same.\n\nYou can use database websites like Light.gg to view more about an item, such as if it has random rolls.",
            ">Has Bungie ever talked about whether or not they’ll bring back old campaigns just for new players?\n\nNo, they've never talked about it. People read into this whatever they want to see, but to me it sounds like they have specifically not committed to it one way or another just to leave options open for the future. \n\nRealistically speaking, the overwhelming majority of things removed from the game have never come back, ever.",
            "Every Riskrunner is the same. The only reason to keep both is if you want to have a Riskrunner on two different characters without having to move it from one to the other all the time.",
            "Kill count, maybe. There are a few exotic weapons with random perk rolls, but RR isn't one of them.",
            "These should appear on NPCs in the Tower once you reach a certain power level. You can do each one once per week, and you view them by hovering over the NPC icon on the map. There's a specific circular icon for weekly challenges.",
            "I'm pretty sure to have over a vendor (e.g. Zavala) and then hold a key (for pc the default is E) to see the challenge",
            "There should have been a store description that explains what you are buying. At least, on the Steam Store there is a description. [Scroll down on this page and you will see a bullet point list.](https://store.steampowered.com/app/2648100/Destiny_2_Legacy_Collection_2024/) Root of Nightmares is part of Lightfall, and Lightfall is in the Legacy Collection. \n\nI would strongly recommend not buying things unless you know what you're buying, but I guess it's a bit late for that.",
            "Yes. Every single time there's a new content release in this game, there are a lot of server issues. It has been this way for every DLC and every season pass since the beginning.",
            "I guess I was under the impression that all the old stuff I would have access to would be too easy due to the power creep. Probably just too much research trying to make sense of all the DLC options pre-final format and after as a new player.",
            "My bad, if you could point me in the right direction to get bungie to notice and fix this issue I'd appreciate it. Already posted on X/twitter to bungie help and made my own seperate post on reddit that gained no traction.",
            "I own all the expansions simply didnt purchase season of the wish. which was later offered as free prior to final shape. Currently am unable to craft weapons of which I've full unlocked. No other weapons have this restriction. It simply states that I cannot craft because I do not the content. Just seems like and oversight on bungies part. But its whatever.",
            "It only gives a taste of the new class and requires buying to go further or use it",
            "The game is essentially unplayable right now for returning players(new players at least get to experience the new light quests for whatever that's worth)if you don't pay for the new expansion. Everything is 30-45 levels higher than me and tells me to upgrade my power first. Every guide says just do the legendary campaign to skip these early levels. If you don't own the campaign then you're stuck spending what seems like weeks of time per character grinding public events just to be able to play the actual game.\n\nEven the old content I paid for, dungeons I used to solo, raids I've done dozens of times etc, are all locked behind this level requirement now.",
            "See id want to do the raids and such. Do the raids have matchmaking now?",
            "Thanks!",
            "Thanks. We were all waiting till today to jump in together.",
            "I haven't bought it yet, because I always try to play through the freely available stuff first. But if you are at all unsure, wait for a sale. It is brand new now so it'll be a while, but eventually every DLC goes on sale.",
            "Haven't been playing d2 so couldn't tell you about previous expansions, but compared to witchqueen, this campaign beats it in every way, in terms of story, in terms of destination and prismatic also has its uses. All in all a really good dlc and worth spending money on.",
            "wrong. I have lightfall, never unlocked strand though. finished final shape, do have strand on the prismatic class there.",
            "none of the suggested ways work. But thanks anyway",
            "thanks for the answer. Now I think I have understood it",
            "So I should just get the packs for the things I am missing, then buy the dungeon keys from in-game? Oof.",
            "I see, and I guess doing it for the exotic isn't worth it because we can just get them from lost sectors",
            "Where do you find the old campaigns?",
            "My post was very not clear. What I was thinking was how do I interact with...threads? Whatever the Lightfall release stuff was.\n\nWhen the cold-themed builds were released, you had to go and unlock them one at a time even years after they came out. I don't think I ever bothered getting all the damn fragments. Will 'green' be the same way?\n\nSorry, it's been a long time since I played, I forget all the names.",
            "Thats a good to hear. I guess the DLC stories are a good place to start then expand from there. I figured i could learnt he new abilities and weapons by going through each",
            "I know its hard to say but is it best to just create a new character? or just continue with whatever i have?",
            "Thank you! Game is downloading while I'm at work, hopefully I can start playing in the evening",
            "None of the NPCs in the tower have any weekly challenges or bounties.",
            "I didn't when I completed it. I just purchased it and it now shows the reward. Tyvm!",
            "That last point is kinda stupid lol, what do you think people did for buying music before the internet? They liked the artist or had it recommended, but they usually hadnt heard most of the music yet, especially for new albums. I already liked the free content in Destiny, so I bought the collection, I just didnt know what was what.",
            "There is power creep, but not as much as you'd expect. This isn't obvious but behind the scenes if you are vastly overpowered, your power level is \"capped\" a certain distance above the enemies, so things that are supposed to be difficult have lower power caps that put you closer to the enemies in power level. As a result, players of vastly different levels can play together without issue, and difficult content always remains at least kind of difficult no matter how overleveled you are.",
            "There's only two ways to contact Bungie. Twitter, and their [official forums](https://www.bungie.net/en/Forums/Topics). \n\nRealistically speaking, no one is going to see what you say. Lots of janky combinations of not owning paid content leading to people not being able to do things they are supposed to do have popped up before, and if they ever get fixed, it's a long ways after. A couple examples from years past: there used to be a season pass collectible that was embedded in terrain or something if you didn't own Beyond Light, and you couldn't equip a free to play title if you didn't own any DLC.",
            "Bungie acknowledged this and said it's not intentional and would be fixed",
            "Ahh thank you for clarification fair enough. I see this was a while ago just saw it kinda died. Wanted to make sure it wasnt another thing. Have you heard a response yet?",
            "You don't have to play any paid content to level up. Power level hasn't been paywalled for years. I don't remember how many years, but at least 2. \n\nThe way power level works is roughly similar to when you last played. There's a soft cap where everything you do drops higher power level items up until the soft cap. This goes at the same speed for everyone regardless of what content they play, whether it's paid or free. \n\nThen once you reach the soft cap, you will see weekly challenges appearing on the director. Many of these are paywalled, but not all of them. You can do them once a week and this is how you raise your power level higher above the soft cap.",
            "There is some sort of fireteam finder, but I've actually never used it for raids. Communication is important enough that I'm worried I'd match up with people who have too many technical issues, are not willing to use voice chat even if just to listen, or may not speak the same languages I do. \n\nIf you want to do raids, you would need to buy each DLC for access to all of the raids. There's a couple of free to play raids, but most are paid.",
            "I tried playing yesterday, we had to do the 1st mission a second time cause we got booted mid boss, and then again before the cutscene. And then it never let us move onto the next mission.\n\nMeanwhile there’s people on my friend’s list who already beat it :/",
            "Yes. If you feel you truly must have all of these things, then you need to buy them all. I personally don't love dungeons all that much and I played Beyond Light back when it was part of Xbox Gamepass so I have not bought those things. If you buy everything it's a lot.",
            "Each campaign has an icon, and the game expects you to recognize this. See the timeline in the upper right corner of the destinations tab for a list of each icon in order. \n\nIf you have not done the first mission of a campaign, it shows up in your list of milestone objectives on the left side of the destinations tab. If you have already done it, you will see the icon for the next quest on the planet where the mission is.",
            "I didn't buy Beyond Light but I have heard they simplified that system. You pay glimmer at the Exo Stranger to unlock the different stasis abilities now. \n\nFor Lightfall, you do activities on Neomuna and get this intermediate currency. It goes in your inventory tab and you spend it at a vendor on Neomuna called the Pouka Pond to unlock strand abilities. Do note that it is possible to play on one character and spend the currency on other characters, but the game will stop giving you the currency once you have enough to unlock it on one character. So what I did was I played the campaign on my three characters, and then only used my favourite class to do activities on Neomuna *without* fully unlocking strand on that character, but I had to frequently switch characters to spend the strand currency unlocking abilities on my other characters because I kept hitting the cap on my favourite class.",
            "You have three character slots. As long as you don't make two of the same class, you can just try it both ways. \n\nI personally prefer sticking with the same character, but ultimately you need to make your own decisions.",
            "In that case, you are not at a high enough power level yet. Keep playing, and they will appear.",
            "For video games, I feel like there are a lot of predatory and unfair monetization decisions. The Legacy Collection is not that, I think it's a good deal, but there are a lot of purchases for this game that are considered a ripoff. Some aren't available any more, like a starter pack that was so hated they removed it from stores after a couple of days. But other examples would be event cards, a type of purchase only available during holiday events, and the 30th anniversary pack upon its initial release (when part of a bundle I think it's a good deal, but not on its own).",
            "Thank you, I own all he expansions minus the final shape (waiting on payday), I purchased defiance, witch, and deep, I simply skipped on the wish out of burn out, I'd gladly just fork over the 10 bucks if it meant getting my weapons, but thats not really a possibility either. So I'm currently shit out of luck on them.",
            "We are aware of an issue where players who completed crafting patterns from Seasons 20 through 23 while they were available to are no longer able to craft these weapons. This is not intentional and will be resolved in a future update. Seems they acknoledged the issue.",
            "Nope, but I'll likely scan through the twab and see if any updates to the issue was provided. I've checked the enclave 4 times and still cannot craft. I'm over it just wish I didnt delete my godrolls to make space for crafted guns. Atleast the new expansion is more than enough fun to offset the frustration.",
            "I didn't mean that the level itself is paywalled.\n\nThe legendary campaign gives you a set of armor that is 1960 light level. If you don't own the expansion and do the legendary campaign then you are forced to grind public events to level up from 1900 to 1940, which is the level that every actual activity says you need to be. After that you can level like normal by doing strikes, nightfalls, the pathfinder etc.\n\nWhen I plug my account into the website that tells you what to do next it just says \"world drops.\"\n\nI'm not going to, and nobody should want to, grind public events for weeks in order to be able to play strikes or dungeons/raids that I paid for years ago, just to see if the game is in a decent state right now. It's not for me, and it's not something I'd recommend to returning players unless they jump fully in and pay up.",
            "Since im not near a console, how much are the dlcs?",
            "So the regular Destiny expansion experience then. LOL.",
            "I think some stuff is free now. Maybe everything before Witch Queen? Not sure, need to do more research, but I am at work right now. Lol",
            "No I had to go in to the abandoned quests thingie\n\nBut thanks",
            "Yeah, I played through a bit this morning and you just buy the fragments at Ikora.\n\nStrand is just all sorts of messed up because I guess I got some strand abilities just by buying Final Shape - given what happens in the first mission.",
            "I'm over soft cap (1957)",
            "Nah I gotchu, I figured the collection with the stuff that i had seen sold for way more in the past would be a good deal. Thanks for the help, tryna get the Conditional Finality",
            "I have been trying to explain but I seem to have misunderstood what you're trying to ask. \n\nYou don't have to grind public events. You can do absolutely anything you have access to. \"World drops\" is the catchall term for the pool of items that come from any activity. I am sorry that you saw that and assumed it had to be public events. If you don't want to play that is perfectly fine.",
            "There's a sale on Steam right now, but I don't know about other platforms because sale schedules aren't synchronized. The monetization guide linked in the original post has the regular price in USD for everything. I just updated it yesterday!",
            "Pretty much",
            "Oh, I haven't been keeping up to date with Bungie news for a while. The info about changes is all on the Bungie News page.",
            "Is 1957 accounting only your items? And not bonus power level from the seasonal artifact?",
            "You are really annoying to converse with. You don't read what people actually say and just make assumptions that only seem to serve to try to make them look bad. I was happy to give you the benefit of the doubt the first time but now it's obviously on purpose so I'm not going to waste more of my time dealing with you.\n\nI literally said that every activity is locked behind a 1945 level requirement besides public events and you say \"oh I'm sorry you assumed that you can only do public events.\" because you ignored literally everything else I said and took one thing I said completely out of context.\n\nEven if I continued to give you every benefit of the doubt.. Instead of trying to make me feel bad for misunderstanding something perhaps you could actually tell me what activities I can do at 1900 light level. But you would have just done that if you could have.",
            "I looked and it was just that all the expansions up to Lightfall were free until this past Tuesday when The Final Shape released. I guess that means I just actually bought what I have and forgot about it.\n\nIn my defense, it has been a long time, I WAS trying to play this game on a laptop for a while. Anyway, got it figured out now, I think. Thanks.",
            "My season artifact gives +6.",
            "I'm sorry, I can't think of why weekly challenges aren't appearing for you."
        ]
    },
    "Question: Why did we choose to immediately protect Luzaku and not nimbus? ": {
        "title": "Question: Why did we choose to immediately protect Luzaku and not nimbus? ",
        "score": 3216,
        "url": "https://i.redd.it/tbo32ku3hz7d1.png",
        "content": "Don't get me wrong I am very much in the same camp as protecting our little hive friend and with in the lore we see way Savathun is doing what is doing but technically speaking we should care more for nimbus. \n\nIn honesty I don't very care for the silver surfer we have at home, but I just found it so funny when the community immediately rallies behind a character that bungie is like \"looks they are cool\". ",
        "num_comments": 618,
        "comments": [
            "I think it might just be that a Lucent Hive siding with us is more impactful to most players than gaining a random ally protecting a bunch of people that more or less left the rest of us to our fate to live in VR Chat. \n\nIn all honesty I don't think a lot of people really care much about Neomuna or its cyborg protectors. We kind of just showed up there, they were vaguely racist toward us, then we ended up with a common goal and most of everything we know about Nimbus is that they're fairly agreeable and largely incompetent. You know, given that bungie set them up as a quest giver even though half the jobs they have us doing are ostensibly what they exist for. \n\nConversely guardians, and players, have had a long and confusing relationship with the hive and especially the Lucent Hive specifically since we share a kind of kinship with them that basically nothing else in the universe can really understand. It probably stirred up a lot of emotions for people to have a lucent wizard basically tell us that at least some of the Brood has our backs. I'm still waiting for a Hive Knight buddy to play ultimate frisbee for our side.",
            "Because: \n\n\n1. Lucent hive \"seeing the light\" and rejecting the sword logic is great to see and I think could be another allied faction in the future.\n2. Understands the gravity of the situation we're in. \n3. Not annoying and tone deaf as fuck.",
            "Because rohan was cooler than nimbus.",
            "Luzaku didn't try and fist bump a grieving daughter...",
            "Nimbus is the worst parts of Cayde with none of the good bits",
            "Nimbus straight-up said the Shadow Legion siege was exciting….\n\nWell gee wizz Nimbus nice to know you were bored in your Golden Age city while the rest of humanity had to scratch and claw to survive for centuries.",
            "Mingus is jarring\n\nEdit - Nimbus *",
            "I think the easiest and most obvious reason is the Hive have been our enemies for 10 years. Having one be friendly and aid us is wildly new and opens up a lot of potential doors.\n\nNimbus was introduced, we'd never seen or heard of people being there before, let alone silver surfers, and then one of the two of them almost immediately dies. It's not exciting or novel that Nimbus doesn't try and kill us, that's kind of what I'd expect from two new species meeting, and it turns out they're just a genetically and mechanically modified human, so yeah I really hope their first reaction isn't to kill us.",
            "Nimbus is gonna die in like what, 10 years or something? Hive are functionally immortal and, ya know, one of the most devastating enemies we possibly have that have caused the death of tens of trillions of lives across billions of years, so to gain our first real ally out this faction is absolutely massive.",
            "Nimbus has bad dialogue and an awful voice filter, Luzaku does not.\n\nNimbus sits around doing nothing, making us do their job, while Luzaku fights alongside us every time she shows up.\n\nNimbus popped up out of nowhere with no affiliation to any prior lore (connection between Neomuna and Lakshmi/Sundaresh aside), and Luzaku is both the first fully allied Hive character, and has existed as a character since Witch Queen.\n\nLuzaku is basically the Hive's Mithrax, and most people at least like old crawdaddy. Nimbus is just sorta... there. And painful to listen to. And ultimately useless.",
            "because luzaku is interesting and Nimbus is annoying",
            "Nimbus is annoying. \n\nLuzaku is chill af.",
            "Luzaku is best girl and Nimbus is freaky and annoying",
            "Because Luzaku has manners",
            "Nimbus played out like the ultimate himbo for me and it kind of rubbed me the wrong way - especially when it came to Rohan sacrificing himself. I get that in terms of lore they were probably raised to have something of a more lax attitude to cloudstriders dying, but I feel like they could have given the actor a lot more opportunity to show range and connect with the playerbase in that instance in particular.\n\nLuzaku grabbed my attention because I read the lore tabs and knew the name wasn't a random event.",
            "She's hot?",
            "I cannot stand Nimbus’ voice it’s really jarring especially when compared to Rohan’s",
            "One is an annoying, poorly written, immature little twat.\n\nThe other is best girl.",
            "Because how long have we been fighting the Hive? And after all these years, we find one who isn't just passive, but ACTIVELY helps us in combat. Gave me pause that's for damn sure.",
            "Well personally because Nimbus is the spokesperson of a group of allies, while Luzaku is one single friend out of a group of enemies. She has quite a weak position compared to Nimbus.",
            "Nimbus is a fucking dumbass",
            "Luzaku is:\n\n- not annoying (doesn't have dialogue that suffers from millenial writing and marvel humor but Bad)  \n- directly influencing the plot in a positive way for both the player (most importantly to you, helping you fight enemies and doing a good job of it) and the other characters  \n- someone that takes you by complete surprise because we've never(?) truly seen or played with allied Hive, let alone Lucent Hive and her existence is justified/explained in the same mission   \n- memorable, for the right reasons",
            "Because nimbus is a massive loser",
            "They are 2 completely different characters, Nimbus is annoying, luzaku is chill, idk why even make this comparison they have nothing to do with each other imo",
            "Luzaku isn't annoying",
            "Nimbus is a douche.",
            "Nimbus is super annoying and even in cutscenes other characters don’t seem to like him.",
            "One is a cool and charming character.\n\nThe other is an obnoxious, tone-deaf, idiot.",
            "Nimbus is an idiot who can't stop making jokes, thinks they're in a fucking comedy and has a shit attitude for \"Avengers Infinity War\" style of story. \n\nLuzaku has none of these problems. \n\n\nNimbus was written like garbage and deserved all the hate they got.\n\nBest description of Nimbus is Wal-Mart Cayde.",
            "Idk, I like Nimbus. Biggest difference might be that Luzaku fights alongside you - i remember that people were gungho about \"protecting\" the friendly cabal units during seasonal missions, too. This time they're a named npc.",
            "Because luzaku was written to be liked\nNimbus was written to make you like him even if you didn't. \n\nWe must protect Luzaku at all costs",
            "I think it’s a multiple amount of reasons: \n\n\nNimbus as a character just felt like D2Y1 Cayde, always cracking jokes in the worst times. \n\n\nLuzaku was something fans were hoping for, a friendly Hive Guardian since the launch of Witchqueen. \n\n\nNeomuna itself was just dropped on us and never really allowed to marinate on and explored. Like Neomuna for the most part was just introduced to us, we’re supposed to just chug on through without much time to think or ask questions. Whereas the Lucent Hives introduction felt more sinister and a mockery at the time for guardians in lore. Like it was a shocking turn of events and even had a small seasonal story focused on us gradually killing/hunting down lucent hive for draining guardians of their light to prevent a ritual from being enacted. Neomuna didn’t allow for that to be explored, just dropping it on us that “there’s a hidden city on Neptune” and nothing else to explore with it. I mean there was lore entries talking about civilians from the last city wanting to meet civis from Neomuna but that’s just it. Nothing else to really go off of.",
            "hive waifu",
            "Probably bc luzaku didn’t show up at the very end of the campaign, call the final boss ugly in front of his daughter, and then ask for a fist bump",
            "Nimbus is a terribly written character. Luzaku isn’t",
            "I first met her like 30 minutes ago, and i have to say, because she doesn’t break the tone of the story and her voice is pleasant in a weird way, still need to finish the story and what the pale hearth has to give but she has a good head start",
            "Nimbus is a poorly written cringe factory. Luzaku is a very basic character that offends basically nobody (and I'm not saying \n'offend' because Nimbus is nonbinary, but more that Nimbus existing offends the senses) and is a cool lore development, plus we got to hear a pretty cool conversation between Luzaku and Mara (which, fun fact, was actually Kirsten Potter talking to herself!)",
            "She's not a surfer bro Thembo.  Nimbus could have been called Nimrod and no one would have batted an eye.",
            "Because dingus is not an easy character to love.",
            "Nimbus looks ugly, sounds so annoying and contributed nothing other than being a tone deaf comic relief character during the campaign that is meant to be where the story is meant to be a defeat.",
            "Nimbus came literally out of nowhere without any buildup or past lore/expectations of them becoming our allies. The hive as a whole and the newish lucent brood on the other hand have had a good chunk of lorebooks and actual story missions beforehand to give weight to us joining forces or having a truce.",
            "Nimbus wasn't a well written character and it was all over our faces.\n\nLuzaku is just chill.",
            "She done more for us than Ken doll has ever done. That she doesn’t destroy public property as far as I know. And did not try to fist bump us after killing someone’s parent",
            "Because nimbus is annoying…I’m not a fan of the happy go lucky puppy dog vibe nimbus gives off during a serious story line. Neither of them I was particularly invested in but Rohan was much better but we lost him plus friendly hive is interesting",
            "Luzaku’s just cool and it was a surprise to see her helping us in what was a pretty dull part of the campaign. \n\nNimbus on the other hand has a really ugly design with that grotesque flesh sack. Is extremely cringey and annoying.",
            "A hive deciding to be on our side is more meaningful than a character we’ve never met",
            "Luzaku actually helps you in game and not just in cutscenes. Also Nimrod is just plain annoying",
            "-previously existing lore about this individual\n-Breaking away from the Witchqueen\n-Interesting future implications\n-Is nice and provides intresting discussions between characters about the state of the world\n\nOr \n\n-Discount marvel dialogue character \n-From worst received campaign since Shadowkeep\n-Sorta abandoned after bad reception\n-Not given much to do due to being in filler expansion",
            "Because fuck nimbus",
            "Wife",
            "This one is parcasual, that one is silver surfer wannabe.",
            "Well for one, luzaku didn’t try fist bumping a grieving daughter right after her dad died… also I just HATE the way cloudstriders look, I’m sorry.",
            "Because her voice sounds cozy😊",
            "We all know its because nimbus is annoying af and should get vaporized or something",
            "She had a blue health bar.",
            "One is an annoying character that can't read a room and is in general disrespectful and offers very little to the story. The other is a cool lucent hive wizard with interesting lore that is also the first hive to not immediately want us dead.\n\nI'll be honest Nimbus should've died rather than Rohan it would've made for a more interesting story. The senior now has even less time to train the new cloud strider or they abandon the idea altogether in favor of allowing the gaurdians to protect the city.",
            "It's quite simple, I've prepared a graph:\n\nhttps://preview.redd.it/vqtcigg7218d1.jpeg?width=1080&format=pjpg&auto=webp&s=68048cc20c4366857eee0e6cea5d799b81edcc71",
            "Nimbus came in and tried to be \"new cayde\" with the half serious but mostly jokes character type. But honestly a lot of Nimbus' dialogue was quite cringe. Most of their jokes weren't funny. \n\nLuzaku came in and just felt more natural and original.",
            "Nimbus sucks ass",
            "1. She's cute\n\n2. She's friendly\n\n3. She's not Nimbus",
            "She reminded me of the Hanar with the way she spoke and gave me instant happy memories from the Mass Effect series, so she was cool in my book from the start. I was about to search that lost sector to see if the Enkindlers were hanging around somewhere.",
            "Because nimbus was annoying as shit and nobody likes him.",
            "I just always found Nimbus annoying in every situation. Never cared for them.",
            "Because I am sure Luzaku made most TFS players say \"Hear me out.\"\n\nAnd yes I am one of them, no I am not ashamed.",
            "Fuck Nimbus. Why side with the galactic Baywatch when we can side with a hive wizard?",
            "Because nimbus is insufferable. I wish we got the “mentor dies too soon and leaves the student to fill the gap unprepared” flipped on its head and the student died instead but aw well.",
            "Nimbus the type of guy to hear zavala say \"this is where my family died\" and go \"cowabummer dude\"",
            "https://preview.redd.it/1u40jsljyz7d1.jpeg?width=567&format=pjpg&auto=webp&s=586ceb3cdd547e7b45356fe662116a659b04898d\n\nCuz",
            "not annoying, cool side character that doesnt talk much, actually helps",
            "All I know is I would die for Luzaku. And I would murder Nimbus on a lark.",
            "Luzaku didn't try and fist bump the daughter of the father we just killed. Calus was still Caiatal's father. That meant something to her. AND HERE COME NIMBUS LIKE: FiStBuMp? \\*makes fist bumping gesture to Caiatal\\* nO? \\*fist bumps the guardian\\* YeAh! >:D\n\nLIKE DUDE, WE JUST KILLED HER FATHER! WHAT THE HELL?\n\nLuzaku just sorta showed up like: I'm here to help! :D",
            "Nimbus was alright to begin with but after a while they get annoying",
            "IMHO, I don’t think nimbus is that bad of a character \n\nThey are more a victim of a poorly written if anything \n\nI do agree that them trying to fist bump caiatl in front of her dead father was cringe though \n\nI do hope we get to see more of them in the future so they can be redeemed in the eyes of the community \n\nCloudstriders are a cool concept. They’re sort of the opposite of guardians. Their created from darkness rather then light and they have their lives shortened rather then extended. Their the “dark guardians” but not in the way you think",
            "Luzaku does the one thing I wish Rohan and Nimbus, and that’s fight battles with us. Sure flew around a bit(dropping weapons) and they were in cut scenes but they were never interactable with the player other than when Nimbus became a vendor. And that always bothered me. Think of it as the marines in Halo. They’re cool because they fight alongside you not just that they’re marines. Plus the burden of story and character is so much lower on a side character.",
            "We've seen Hive before, so we know their normal behaviour and we're pretty good at killing them by now.\n\nWe've never seen 12 ft tall Vex/human hybrids flying around on hoverboards before though so I think we were more on edge on Neptune.\n\nAlso our guardian had just boarded a spaceship at lightspeed then drop-podded straight into a previously unbeknownst futuristic city-turned battlefield. Possibly may have been a little overloaded lol",
            "Heh Dimbus",
            "Nimbus annoying asf but they can probably make a killer fucking latte",
            "Nimbus is corny as hell",
            "Maybe because when you search up \"nimbus\" on Google the top searches are nimbus voice actor and fart fetish",
            "Cinnamon Roll is precious\n\nNimbo, the himbo is for the streets",
            "Because Luzaku is a sentient being of the light and also the first seemingly genuinely good Hive and Nimbus is a genetically engineered clown",
            "Because they killed cayde and tried replacing him with nimbus but ended up tone deaf instead",
            "The writers did Nimbus dirty. Nimbus does fit the sort of rookie thrust into a leader position fine. The writing and timing just ruined it for most people. \n\nThe voice acting is great for the character, but you can polish a turd all you want. It's still a turd. I feel if Nimbus had actually sort of fell into a sort of spiral after Rohan's death. \n\nSort of how they handled Zavala in Final shape. Trying to cope with what to do and how to move on. \n\nThey just mishandled Nimbus so badly.",
            "Theres a war going on, and Nimbus took everything as a joke. Lazaku sounds serious.",
            "Nimbus tried to fist bump Catal right after we offed her dad. I always think about that lol",
            "Several reasons.\n\n-lucent hive are generally cooler than cloud-striders and have broader impacts on the setting\n\n-Nimbus' visual design is like an unholy amalgamation of S.B.I. and Tumblr fetishist art, and looks even worse animated.\n\n-Luzaku is significantly less cringe than Nimbus.\n\n-Mommy factor.",
            "Because luzaku isnt cringe and annoying.",
            "Because Dingus is a poorly written character. Also, when did Dingus ever help us in a fight? Exactly. Rohan did more for us than Dingus did. \n\nI await your lawsuits in the morning.",
            "She's not annoying and Nimbus reeks of 90's/early 2000's cheese. It's that simple, really.  \nShe's played straight and Nimbus is played up as \"Yo dude you gotta go with the flow man you gotta understand the river of souls bro dude trust me it's the river of souls.\"",
            "Maybe it's because she's not some ego centric annoying dude yelling in our ear about some bullshit every mission.",
            "Nimbus is annoying as fuck",
            "Setting of LF is seemed very comedic, especially after what’s his name died while Nimbus was being goofy before trying  to  prevent the witness connecting to the veil. Plus we haven’t gotten a friendly hive guardian too",
            "Personally, I've wanted a friendly Hive character for years. Nimbus has nothing to offer me.",
            "Cuz Nimbus was cringe as fuck",
            "Because nimbus is annoying as hell and Luzaku was not. That’s as deep as it gets for me.",
            "Because luzaku is cool and nimbus is a terrible character, next question",
            "Cool Hive Warlock with cool and interesting druid vibes vs. cringe bootleg annoying silver surfer.\n\nI fuckin' wonder.",
            "Nimbus is a tool, and he's an incredibly boring, one-note character. Having a hive wizard on our side, however, is incredibly resonant, plus the voice actress and dialogue are really enjoyable. On top of all that, there's the angle of the role that the Lucent Hive play in our future, with some on our side and some not, and some playing both (Savathun). Nimbus is just not a good character, and he is quite grating on the ears.",
            "Because Luzaku fits the tone of the narrative and isn't annoying.",
            "Only one of them has good dialouge",
            "We've known about the Licent brood for a couple of years, the hive for even longer. Having an ally of a long standing enemy race is waaaay more impactful to all of us than some random who appears and is hailed as better than us with no prior buildup. \n\nIt's like in comics when they try to replace a hero with a \"new, better\" hero who didn't earn it. Like sure they can *eventually* surpass the previous person, but being better right off the bat is so ass.",
            "She's not a poorly-written NB character who's annoying as fuck.",
            "I mean, Luzaku showed up and immediately started helping us clap ass. That immediately gets her my support.",
            "Luzaku: \n\nLucent hive that pretty much betrayed savathun and she is praised for it by her. Not because of the betrayal but because she is a child that didnt blindly follow her and chose her own path as the light now allows all of the lucent hive to do.\n\nShe is what i wanted to see during Witch Queen instead of Fynch.\n\n\nNimbus:\n\nDressed like a male stripper and says \"cowabunga\".",
            "Because Nimbus is annoying and Luzaku isn't.",
            "Because, with Luzaku, I can say \"Would\" and some people would agree.",
            "Luzaku has a cute voice, Nimbus is fucking annoying.",
            "Luzaku is our best friend. Rohan was my best friend. Nimbus is not my best friend.",
            "Because Nimbus was fucking annoying and his design looks like shit. It looks like someone typed “slutty warframe cosplay” into an AI art generator, it looks so out of place.\n\nRohan is so much cooler.",
            "bc nimbus is an airhead",
            "Nimbus is like that one annoying friend who won't stop yapping. Luzuku is an innocent character who isn't annoying, kinda like Eido",
            "Personally I just like enemies that become allies",
            "Because Nimbus is annoying and can’t read a room, and Luzaku is sexy",
            "Because would",
            "First impressions are important.  Luzaku's first interaction with us was very humble, especially coming from a Hive.  It was a welcome change.  \n\nNimbus came off as someone who would spout off Ninja Turtles quotes at all times.  Maybe funny the first few times but by the end you end up stuffing him in a box and firing said box into the sun.",
            "Because she's hot. Luzaku is canonically \"caked up\" while Nimbus is... well Nimbus is Nimbus.",
            "Bungie did Nimbus dirty. His mentor dies, we get a phyrric victory, situation is dire, dude flies down and want's to high five... But that's generally Lightfall in a nutshell, Witness is here, shit is going down, and Bungie tried to make an 80's movie out of the campaign. I don't know if Bungie was testing waters if they can put a comedic character to replace Cade 6, but whatever they were doing, they made Nimbus not really likeable. To me he is indifferent, I found Rohan much more likeable and interesting lol \n\nLuzuaku is just a friendly hive, not obnoxious, seems like a potentially interesting character.",
            "Honestly? No idea. And I don't get the hype behind her. Yeah I know she had like one or two lore entries before, but...cool? Ingame she's not got much besides \"Me good, me help:",
            "Yeah well I've always had a strong dislike for Hive. I kinda like Luzaku it has a cool way of talking.",
            "Despite accepting the reasons it’s necessary, I always feel a bit of regret when I have to squish a hive ghost. Luzaku offering to help is something I’ve been waiting to hear said since the Lucent hive were introduced. \n\nThere’s also always just something different about when we get to go through a fight with the AI allies alongside, like a reminder with you that the fight is bigger than humanity. So, I always thought it would be cool to be able to add them as something like an AI fireteam member, and running that lost sector feels like getting that for a moment",
            "Nimbus was poorly written and the voice is grating.",
            "I'm low key crushing on Luzaku",
            "She is hot",
            "While I don’t hate them Nimbus has the unfortunate fate of being a poorly written character. Luzaku has better writing",
            "Wife",
            "im gonna say it\n\ni honestly dont understand whats wrong with nimbus man\n\ni dont recall him ever doing anything cringe so idk i must be out the loop",
            "Hive fren",
            "I think she's written better as a character tbh. But Nimbus is a big dumb goof and I love them.",
            "Less talk more shoot imo",
            "Cause Luzaku is badass, and Nimbus was written unbelievably poorly (not to mention annoying as hell)",
            "Cause fren",
            "Nimbus is the epitome of bad Marvel dialogue, along with the emotional sensitivity of a rock \"your father just died? Cowabummer. Up top!\".",
            "Neomuna should’ve been an after FS plot, and Nimbus should’ve died rather than Rohan. The implication alone is a better premise than what we got, it’s honestly a disservice to both characters. Rohan was at the end of his time as a cloudstrider, and the pressure that Nimbus dying put on him wouldve been almost palpable. \n\nAn episode exploring what an Echo could do for a strider, either buy one time or make more, would be a good way to further our research into the Echoes themselves and their application. Rohan would undergo massive character development and the lore for both he and Nimbus would be exceptional, not to mention those who came before. \n\nNeptune holds untapped potential for the Destiny franchise, but I feel it was introduced at such an awkward time and caused such turbulence in the story that despite its importance only now that the dust has settled can we expect to see more in depth lore from the blue giant.",
            "This is going to sound shallow but Luzaku has a seductive voice that draws you in",
            "Because we know the lucent brood and their switching sides is impactful to us.\n\nNimbus was just a person who came out of nowhere and had epic \"Avengers dialogue\" energy",
            "Because fuck nimbus and neomina. If Bungie brought back the dcv just for them and the boring destination I wouldnt mind",
            "Because Nimbus is horrible character design and Luzaku is great in every aspect.",
            "I don’t know much about the Nimbus stuff. However, with Luzaku we can see a glimpse of the potential the Traveler intended for the Hive. But as we all know, back in The Witch Queen, the Witness got to them first.",
            "Others have said it better, but what turned me off Nimbus was the infamous fistbump. I'd liekd them up to that point, I get that they're not meant to be perfect, or even arguably \"good\" at their job given all the responsibility they'd suddenly had to shoulder, but... Well. It's not the act of fistbumping itself, or celebrating a victory, but rather who they chose to turn their cheer to.\n\nSure, Caitl and Calus' relationship was anything but good nor healthy, but you simply do not walk up to a woman who just witnessed her father die in devotion to something that could not give a singular ounce of a fuck about him in the slightest, and then go \"The bigger they are, the harder they fall!\" And offer a fistbump.\n\nIt adds some nuance, since sure they had no idea who Calus was, nor Caitl for that matter (even if she'd made it very clear who Calus was). But still, the writers really failed Nimbus in that regard.",
            "i remember the curse of osiris story more than nimbus,\n\n luzaku is the one of the reasons we were able to stop the final shape\n\nnimbus is just some guy they failed to make interesting or tolerable",
            "Because Nimbus is that kid in HS that was just f*cking annoying!",
            "https://preview.redd.it/kjncapzpw08d1.jpeg?width=1080&format=pjpg&auto=webp&s=8bce0b5c1af3cba8c38f95fdfde21dff0b058680\n\nBecause Nimbus reads the room as well as Ralph on this comic, except Nimbus doesn't put any nostalgia glasses on my face when doing it.",
            "Because this one is your friend",
            "I think it’s a fact they tried to make nimbus a cayde like character funny non serious. We only needed one in a game like this plus who didn’t want a hive friend during season of the witch or even during witch queen .",
            "Cause everyone likes a wizard in streets and a freak in the bed.",
            "It is interesting that a lot in this thread hate a secret third option, not sure who he is in this context.  \nThey are a victim of the writing not clicking. Lightfall was too drastic of a change to really buy into the setting. We know wizards though, having a friendly one is neat, hearing different npcs ask random questions is neat.",
            "it's because luzaku is nice and doesn't act like she's pretending to be a fucking mcu character",
            "Well, the fact that the lucent hive were not entirely against us was a shocker. We could use connections with the lucent hive Luzaku, to form a military connection with savathūn with trust, which did actually happen in that one scene for final shape.",
            "Luzaku is part of a piece of the expansion and not the crucial plot catalyst on which the story telling rests.",
            "Cause Luzaku didn’t make shitty puns and sound like a big dork like my cousin Phil?",
            "Listening to Nimbus talk is the reason I stopped playing Lightfall at launch and finished it during the into the light event 2 months before Final Shape released. He’s a horrible character. Voice. Voice lines and even his design.",
            "Because luzaku doesnt speak or act like a 9year old",
            "Cause Luzaku is precious and Nimbus is a rip of Michelangelo",
            "I’m not gonna lie, I may or may not have attempted putting a round into her head the first time I finished that lost sector >->",
            "What Lukaku doing in destiny?",
            "Because Nimbus was just stupid when they were introduced. They were supposed to be the ultimate defending force of Neomuna but the way they acted literally caused the other Cloudstrider to die. Luzaku on the other hand actually shows the competence that should come with her position. Also, for a part of the player base this is a dream come true, because there is a group of people  that wanted Hivt allies for quite a while",
            "I think the way both characters were introduced mattered. Nimbus, and Cloud Striders, were teased even before Lightfall launched. And when we did see Nimbus, he was.. just a \"trying-to-be-fun\" guy, who failed at almost everything he did. Plus all the \"heeeey Caiatl, I know that he's your pa, but give me a fist-bump, celebrating his demise!\"\n\nLuzaku, on the other hand, was a complete surprise in TFS. Yes, there is a lore entry in Lucent Tales about her, but it was in Witch Queen, two years ago. None of the promotional material, or the campaign prior the The Message quest-line, have shown or teased her. And there is no cringe or stupid dialogue involving her. In addition to that, she's basically the first truly friendly Hive Lightbearer - that fact, at least imo, peaked everyone's interest in her.\n\nEdit: minor spelling mistake![img](emote|t5_2we4j|5657)",
            "Luzaku: Introspective, quiet, understanding, symbolizes hope for a species consumed by conflict and self interest to become more interdependent and social. Meanwhile Bimbus: loud, annoying, arrogant, just doesn't compare to Chad Daddy Rohan. Disclaimer: i actually quite liked Nimbus's storyline in coming to terms with Rohan's loss. I just find all of their voice lines quite irritating. Also they kind of feel like a bargain basement cayde, being equally annoying but less wise and mentor-ish",
            "Because Luzaku is not Marvel character",
            "because nimbus is quippy marvel goyslop and every time it opens its mouth its irritating, the voice actor does not help",
            "Nimbus is just flatout annoying, Luzaku is not.",
            "Nimbus is an idiot, the guy tries to fist bump Caitl after her father's death lol.\n\nLuzakue is a cool hive wizard part of the only faction that has the light of the traveler, lucent hive are way more interesting than cloudstriders/neomuna and having another friendly (besides fynch and Savathûn) character from that faction is great.",
            "Because Nimbus is cringey and annoying. He is straight out of the MCU",
            "Hive are weird aliens and that makes them interesting (to me) while Nimbus is basically just a big guy.",
            "She's my wife",
            "I like how they straight-up didn't even hire nimbus's VA for excision",
            "Nimbus came off as being annoying to the Nth degree. Luzaku comes across as innocent and curious after being reborn in the Light, especially since she would've previously been considered an enemy.\n\nNimbus could've been a predecessor to Luzaku in that we would want to form a bond with him, but he suffered from being a poorly written character in a poorly written narrative.",
            "Poor character design. What kinda question is that? Why wouldn't we dislike the obnoxious random guy who did nothing to help save his people?",
            "[removed]",
            "She's actually an interesting character. All of the cloudstriders interest flew out the window when Rohan died immediately and Nimbus didn't stop cracking jokes despite disciple Calus knocking on Neomunas doorstep to genocide everyone there and take their macguffin. Comic relief is a really good thing to have when you can execute it properly. But nimbus isn't comic relief, he's just comedy (and not good comedy) and it's just preposterous given the circumstances. He's also associated with Osiris. And if you played lightfall, you most likely don't have a positive opinion about Osiris either lmao",
            "Idk who Luzaku is but she isn't annoying so I automatically like her more.",
            "Cause he’s lowkey kinda annoying",
            "Nimbus just isn't a well put together character imo. I feel like the only reason Nimbus is \"non binary\" is solely just so Bungie can say they have a non binary character in their game.",
            "Because nimbus is annoying. They act like a teenager in an adult body and never knows how to read the room.",
            "She's a better character",
            "Nimbus is annoying, unfunny, irritating and I hate them with all my heart.",
            "Because there’s literally nothing likeable about Nimbus",
            "Because they are an annoying and unfunny character even though they are supposed to be comedic relief? They are horribly written and I cared more about Rohan in the short time we knew him. \n\nAlso cmon… the joke he made about calus right in front of the empress after we just fucking killed him 💀",
            "I actually like Nimbus and blame the rough plot of lightfall vs the character themselves, that exotic machine gun mission was very well done and Nimbus shined strongly in that one as well as the other exotic missions, I think what happened was the player base just hated the lightfall campaign so much that we collectively put our hatred into just Nimbus, it’s easier to hate a single face, they’re far from perfect but definitely overhated",
            "I didn’t truly dislike Nimbus until he started narrating the Neomuna event like a sport or something that shit was too much",
            "I don't like nimbus because of a combination of his voice and his personality.  After rewding some of the lore, his personality is at least understandable. But the voice effect is grating.",
            "Because Nimbus has horrifically cringe dialogue and a sense of self importance that is really off-putting.",
            "Nimbus is annoying",
            "Be Luz isnt a lame and overbearing, and way to cliché nod to the 80s action movie trope where the younge, cocky, and brash rookie has to should all the responsibility and grief at the lose of a beloved mentor that isn't really used in the plot outside some smart ass remarks and way out of place humor. Props to Bungo to making them the first non-binary character, I love the inclusion there, but dear God, Bungu really needs to utilize their plot characters in more than just dialog. Get them out on the field with us or something.",
            "Nimbus is the reason I turn dialogue all the way down to 0 whenever I have to go to Neomuna. Even in the Vanguard playlist. They are possibly the worst written side character I've ever seen, they ruin every scene they're a part of, and they're a massive reason I didn't like Lightfall. If Nimbus has a million haters, I am one of them. If Nimbus has one hater, it's me. If Nimbus has 0 haters, then I am dead.\n\n  \nIt should be Rohan, not Nimbus.",
            "Desperate for allies?",
            "I just wish her empowering rift work for us too. That would’ve been dope",
            "Because Nimrod is a bad character",
            "Oh we **know** why..",
            "Because Nimbus is like an annoying gen z kid who doesn't know when to shut up.",
            "my buddy couldn't get over how insanely high Nimbus' pecker was...",
            "it's because Nimbus has the room literacy of a brick. granted they were trying to avoid their own grief of Rohan, but it was kinda tone-def. \n\nLuzaku is a novelty. \n\nalso, and I'm putting you all on blast here. \n\n*woman.*",
            "Nimbus who?",
            "Because I fucking despise Nimbus. He's annoying and I want him to die, in pain and terror.",
            "Nimbus is annoying as hell, that's why.",
            "Wdym? We fought along side Lazaku because she is in the same room as us in the lost sector and she is friendly. Wouldn't say we really protected her tho since she didn't appear to be in any danger. We don't fight along side nimbus because the only time they fight enemies is on top of the roof in front of osiris' droppod and by the time we got up there all the shadow legion where dead. Same thing, no need to protect someone who can clearly take care of themselves.",
            "cause fuck him thats why",
            "Speak for yourself bro. I had my Izanagi on Luzaku the entire time she spoke. Still don't trust her.",
            "Cus even out guardian knew that nimbus was an annoying loser",
            "I'd pay $100 in silver to kill Nimbus myself.",
            "She is basically mute and no arrogant aura comes from her.",
            "Is it better to be born good, or to overcome your evil nature through great effort.",
            "[removed]",
            "Seeing Luzaku really made me wanna get The Final Shape but I haven’t played since Witch Queen so I’m so far out of the loop.",
            "What happened to nimbus?",
            "https://preview.redd.it/du8xf2nq028d1.jpeg?width=403&format=pjpg&auto=webp&s=6514b7d0b6aae3ceda585cba4f6fde75bc2a520b",
            "Idk why not",
            "Idk why not",
            "Don’t worry:\n\nI hate them both :)",
            "Luzaku does not feel like a big man child trying so hard to be cool that they want us to get behind and have sympathy for especially after the way to fast death of their mentor.\n\nIn fact nimbus feels like some of the story team saw Ava from BL3 and tried to go with the kind of character forced to step up due to loss but it just felt wrong. Even the side stuff about nimbus still couldn't get me to like nimbus or even feel much sympathy.\n\nNimbus is the kind of character where something was there in the making but not enough effort and meaning was there to care. Plus the the whole cocky and brash go get em character has been done in destiny with Cayde and Ana and to an extent crow so we don't need yet another one. And those were all done way better than nimbus.",
            "Cause nimbus was a dumb addition imo, his whole character was just off for what was meant to be happening, like how he tried to fist bump ciatal after her dad died, or how he’s all grumpy for the black garden mission but at no other point. For what was meant to be a big loss for us, he just didn’t fit at all. Like how Osiris was a whiny bitch for like 90% of lightfall even tho he didn’t do anything.\n\nTo sum up, nimbus is a forced comedy character that didn’t fit the theme of what was occurring, while Luzaka isn’t trying to be funny, she’s literally just helping us because she sees it as the right thing to do",
            "Because Luzaku wasn’t voiced by a person who has a pass/smash tier list of anime characters that are kids, and who also has a fart fetish. \n\nThat, and Nimbus is a literal joke of a character with zero continuity with the story. Lightfall was disjointed as all get-out, but Nimbus made it 10x worse with their stupid dialogue every 10 seconds.",
            "Because Luzaku is not cringe",
            "Because Luzaku didn’t try to fist bump caitl while she mourned the death of her father whomst they also called ugly",
            "Well, NImbus fist-bumped Caital after her dad died, like an asshole, and Luzaku helped me kill some Taken and was chill about it.\n\nHard to say why people prefer her.",
            "Because nimbus isn't waifu material",
            "For me and I'm sure a lot of others Nimbus was annoying. And felt like Bungie was just forcing a non Binary character on us. Nimbus' dialogue sucks and is cringey to the point that I pull out my headphones if they talk. They could have killed Nimbus and kept Rohan and nothing good would have been lost",
            "Imma be straight with ya, i just wanted to bang her",
            "Because all our guardians saw records of the Star Wars movies and remember jar jar binks. We knew nimbus was an immediate extension of that and we had to put him down immediately.",
            "Prolly cause nimbus sucks?",
            "If Nimbus has a million haters, then I am one of them. If Nimbus has ten haters, then I am one of them. If Nimbus has only one hater then that is me. If Nimbus has no haters, then that means I am dead. If the world is with Nimbus, then I am against the world.",
            "Nimbus is a horribly annoying character. My distaste for him had nothing to do with Bungie shoving a character in my face and being saying “like him!”",
            "She’s nice",
            "Why would we as a community care more about a character that was - objectively speaking - poorly written (Nimbus), versus a character that has only a small part to play and plays it well in Luzaku?",
            "Because Nimbus tried hard to replace Cayde which everyone hated, i personally don’t mind. Luzaku is the first ever Allied Hive Guardian since they got the Light. That’s why.",
            "Nimbus just seems like that overly happy annoying person who wants to sell you on amway, then try get you to start cycling and adopt a vegan lifestyle.",
            "Because she is cute and not annoying af",
            "There's actually a pretty credible pastebin talking about the behind the scenes and apparently Bungie are \"uncomfortable with how the community dislikes Nimbus\"",
            "Cause Nimbus is the most annoying Bastich in the damn game. Hate listening to that idiot make terrible marvel level jokes with no charisma behind it. Luzaku is actually interesting since Huve are basically born and raised to hate the Traveller. But she is among the first (or is the first) Hive to make their own purpose in life.",
            "Easy one. Luzaku best girl. Nimbus is a bitch.",
            "okay so, the main reason (we all know just avoid talking about it) is the pol side of it, the gender and blah blah blah, thats the main reason a good part of the community slated them. in my eyes, they were annoying, pandering, trying wayyyyyy to hard to be the \"comic relief\" in bad situations, they are still technically a kid, but cmon, when i was younger, i didnt basically show up at an open casket funeral (calus and caiatal) and say \"hey good job killing big ugly, fist bump!\" it wasnt the time nor place, regardless of who it wouldve came from, even cayde wouldve made that scene look bad if he did the same thing. \n\nin my eyes, they tried to replace cayde in a way cause the game was getting too grim dark, but they failed by a long shot.",
            "Cause Nimbus is annoying and cringe",
            "Who's nimbus?",
            "Because I hate the gimp cyborg",
            "I wasn’t a fan of nimbus and their character design. Bungie gave me no reason to love them, and their sense of humor was sorely misplaced and felt wrong given the circumstances. Luzaku is  a unique addition, and also the player base tends to like out of the ordinary things. This is just my opinion",
            "Nimbus isn't particularly likable. Luzaku is.\n\nNimbus is not female. Luzaku is.\n\nLuzaku has been in lore for 2 expansions by the time we met her. She's the first hive we've seen show mercy without an ulterior motive. \n\nNimbus was trying too hard to be cool.",
            "Because nimbus absolutely sucks, Rohan was better.",
            "The way my friend sees it is because Nimbus was thrown at us immediately, and he didn't establish a connection like he did with the Hive. He's known the Hive since Destiny 1, had them as his enemies for so long, and now they become his ally against a common big bad. \n\nThe way he sees it, it's like \"The enemy of my enemy is my friend\". He didn't have that with Nimbus because he only got to see him for one expansion that he didn't even like because the story was really bad for him. Bungie established the Hive early on, gave the faction bits and pieces of personality, and it all formed into a sort of alliance with Savathun's group of Hive. \n\nAnd also to be fair, none of my other friends and I think too much of Neomuna. We didn't like the Lightfall expansion at all.",
            "Because Luzaku isn’t annoying",
            "Because Nimbus is an insufferable twat, and Luzaku isn’t. 🤷‍♂️\n\nHarsh, I admit. Nimbus is young and brash, and will mature. But that day can’t come fast enough…",
            "P-p-pretty g-g-girl...\n\nhttps://preview.redd.it/05qyx3zra48d1.jpeg?width=360&format=pjpg&auto=webp&s=c27a5e262c8539071b3fe36d5d23f475143fe713",
            "Gotta get back to d2 no money no d2!",
            "Luzaku is honestly one of the best characters ever. Very cute way of speaking as well hahs",
            "Why would you protect nimbus? Sassy space internet surfer silverhawk wanabee with the worst timming.",
            "Cloudstriders were an entirely new concept protecting people we literally never saw in-person \n\nLuzaku is a preexisting character who fits in an existing concept who is trying to create a better life for her people\n\nAlso Nimbus literally has a time-clock. My headcanon just to make the Rohan stuff work for me is that \"10 years\" is a bit longer on the CloudArk for whatever reason - they track it differently somehow",
            "Nimbus was an annoying fuck while Lu is just nice. Hope we get a season where we can befriend her fireteam (the acolyte and Knight)",
            "She does a cute hand tent and is friend. What more do I need to put her on the \"Protect\" list?",
            "1. I don’t give a shit about Neomuna or anyone living in it, Hive have always been cool and lightbearers especially \n2. Luzaku doesn’t have a fart fetish",
            "Because he is written terribly",
            "Luzaku is cool, the other is not.",
            "You mean people aren’t drawn to giant fetish gear wearing weirdos? Crazy",
            "We've known the hive alot longer then we've known the Neomunan humans. Plus Nimbus was trying way to hard to be the new Cayde-6",
            "Luzaku talk funny that’s why",
            "Dude same ever since witch queen I had hope we would get a hive buddy but all we got was a sassy Savathun...which is welcomed...I want more frienemies in this game",
            "You have that buddy in the 12 man. He there throwing his Frisbee.",
            "There was a friendly hive knight in the Excision mission, at least there was the one time I played it",
            "Credit goes to My Name is Byf for this one: \n\nThe Neomunites were not thrilled about us because their last known encounter with us was during the Dark Age after the Collapse. The early Cloudstriders came to check on us and saw the savagery taking place. Granted, humanity was at it's lowest and it was \"kill or be killed\". That's when they removed all knowledge about Neomuna to protect themselves from a potential attack by the Earth humans.\n\nPersonally they could've done better with the Cloudstriders and their shape-shifting liquid metal weapons. Lost opportunity I guess. Anyway, Lucent Hive realizing their whole history was built on a lie is substantially more interesting.",
            "Shame, because Neomuna lore, lore around Cloudstriders, etc. is all really cool. I think it honestly would've been wayyy better as a not-dlc so we could've focused on the people there and learn about them.",
            "The fact that we never actually meet another Neomuni human really turns me off of Neomuna\n\nI like the THEORY of it. All of these humans are under the Veil’s guidance, not the Traveler’s, so linking their consciences to a digital world kinda fits with Darkness being about the Psyche, Strand being about connection and Neomuna being futuristic and neon\n\nThat being said, it sucks in PRACTICE. How am I meant to connect with, and ergo, CARE about these people when all I see of them is yellow flashy lights? And the only person that is actually (partially) flesh and blood that I can interact with is just sorta cringe (but still good company)?\n\nMeanwhile, the Hive are our personal main bad guy, and have been for the past 10 years (while a case can be made for the Eliksni with stuff like Twilight Gap and Six Fronts, I feel like they’re more for humanity as a collective. The Hive are more often than not EXCLUSIVE to Guardians. The Great Disaster, Eriana’s Fireteam, Oryx’s death, etc). We know the Hive intimately, and have had enough time with the Lucent Lot to get their vibe. So, a soft spoken Hive Warlock helping us out, healing the Traveler, and getting praise from Savathūn for defying the norm is gonna leave me WAY more connected with Luzaku than Nimbus 🤷‍♂️",
            "Summed it up perfectly, kudos",
            "Listen, as a nerd who hasn't played since season of the splicer dropped- which was practically made for me, lore wise- this idea is absolute *catnip.*  I've always wondered if the hive could be freed from the worms, so this development sparks joy.",
            "Honestly: Not gonna lie, Neomuna was the best way for us to feel like we are actively protecting civilians. It would have been really cool to feel like we are making an effort protecting a civilization that was never broken. That didn't just survive, but thrive as well. \n\nAll of the stakes in Lightfall felt so intangible, its why the story flopped so hard: we didn't know who or what we were fighting for.",
            "VR CHAT BRO IM DEAD💀💀",
            "I also blame Nimbus for the final shape happening as the whole time Ghost was floating up to make the connection he could have jumped on his hoverboard and grabbed Ghost out of the air. He waited until the connection was made like the dumbass he is.",
            "Wait till you play Excision. I don’t remember if there’s Knights, although I don’t see why there wouldn’t be Lucent Knights when there’s the Acolytes and Wizards there too.",
            "We need fynch to resurrect Ken once and for all 😂",
            "Pretty sure I saw a hive knight spawn in the narrative version of the mission to merc the witness",
            "Yeah we were refitnelt waiting for the plot to reveal that Savathun could play nice and this is a nice touch. \n\nNow we just have to wait on Fisk reviving his knight and convincing him to play it cool",
            "To live in vr chat 😂",
            "LETS GO ALICIA!!! Best destiny comment",
            "I think what really turned me off towards Nexus, and Nimbus, is how arrogant they all are. Here we guardians are struggling to survive and protect humanity from the darkness for centuries, then out of nowhere we hear Neomuna exists and they’re just chilling thinking about how much better they are than us.",
            "Heck, as unlikely it is, I want to roll a frisbee buddy Guardian. Would go up the walls if I could make a Hive Guardian.",
            "We need the court of oryx with lucent hive",
            "YES KINSHIP \nI totally agree, I feel a certain kinship with Hive Lightbearer Knights. I sometimes let them resurrect a few times to keep having fun with them (and to show them that I’m by far the better Titan). This kinship has extended to most Hive Knights out there and is part of the reason I’m very fond of the Hive in general.",
            "I’ve never felt such apathy as I did towards nimbus and the Saturn populace. \n\nLike we never even see them. Just bad holograms. SMH",
            "Vexborg,don’t you forget that",
            "That and people want to put their worm in her",
            "4. WAIFU MATERIAL",
            "ngl Luzaku’s speech cadence annoys me. but it’s a charming kind of annoying, i can’t help but love it",
            "I still cringe thinking about Nimbus trying to fist bump the Guardian (and us doing it) while Caiatl is standing beside her father's corpse.",
            "The \"The uglier they are the harder they fall\" scene really just cemented how the writing of lightfall sucked. Like personally I could tolerate all stuff before, they're still the \"rookie\" and relatively young in the view on the world... But for fuck sake, you just few in, cracked a joke at the expense of a man who just died towards his daughter, then signaled for a fist bump with said daughter. Sure they were estranged and all, but they're still father and daughter.",
            "Killing Nimbus and having Rohan be the survivor would've hit so much harder, because Rohan dying was so, so obvious",
            "Rohan is so cool that he is named after an awesome fictional country.",
            "If Bungie wants to stay consistent with their lore, Nimbus should be \"retiring\" within the next few years, and they've gotta train up a fresh cloudstrider before that happens (especially since there are supposed to be 2 at all times anyways, and they've had only Nimbus for over a year now). So it's not out of the question that we see a new cloudstrider soon.\n\nMaybe they'll be cooler than Nimbus, or maybe they'll have even more gen Z skibidi gyatt energy. (that physically hurt me to type)",
            "And way hotter.",
            "My guy hadn’t even gone cold yet…",
            "Yep. The lack of self-awareness felt...insulting?",
            "\"Haha look at that ugly guy, he sure is ugly... and dead. I'd say the only thing he is more than ugly is dead... rip to your dead ugly dad, Fist Bump!\"",
            "Look, I'm not on Nimbo's side, but Caiatl said her father was dead in Season of the Haunted when he gave himself to the Witness. Also, Calus was incredibly mentally and verbally abusive to her. He killed her dog because she loved it more than him. She would NOT be grieving him.",
            "Ngl after the bitch of a fight solo legendary was, I would have taken the fistbump",
            "Like sure, their relationship was pretty fucked at that point but still, christ read the room man...",
            "He’s a knock-off Cayde it was just a disrespectful attempt to bring players back",
            "I think They have a chance to blossom into a good and interesting character, they weren’t that bad in some of the post campaign content for lightfall or hearing them during patrol. But bungie clearly seems to consider them a friend and an ally with the post TFS cutscenes instead of ditching them like the other patrol vendors so clearly they got plans for there character or something.",
            "God, I wish Bungie would add in a brutally honest character that would say this kinda shit to everyone else",
            "Nimbus to me felt like such a blatant attempt to make a character “for the kids”. \n\nAnd it was the worst time for bungie to test something out like that. If they had introduced nimbus post-witness during a season, they probably would’ve been accepted into the overall story more.",
            "I'm calling him mingus from now on xD",
            "I've always called him Bimbus myself",
            "![gif](giphy|8vRpC1Bug1l0Lo0PBZ)",
            "His planet is invaded and he’s all like “cowabunga dude”. I mean I get the over eager rookie trope but Nimbus was that dialled up to obnoxious.",
            "https://preview.redd.it/tnaadqjfp18d1.jpeg?width=1241&format=pjpg&auto=webp&s=d9801e7106126be4d80b98f134ea5c99b554d4d9",
            "New nickname just dropped",
            "I’m calling g him Mingus from here on out",
            "I call him Dingus",
            "And they die in ten years no matter what. The coolest thing to come out of lightfall were skimmers.",
            "Nope it’s more like 5 or so years since he’s a few years old",
            "Hive are functionally immortal with the tithing system. Luzaku is immortal because she has a ghost.",
            "Where was Luzaku in Witch Queen?",
            "Nimbus is more of a thrill-seeking jock than a himbo.",
            "It would have been refreshing to see Nimbus sober up and take responsibility. Instead there is only a bit of sadness then a return to being insufferable.\n\nInstead we only hear Nimbus take things seriously when accessing Chioma Esi’s logs and discovering Neomuna’s dirty laundry.\n\nLike, really? Your close friend, mentor, hell, the only person you’ve been able to speak with in the flesh for some time and you’re not even shaken up a bit when he dies? Honestly made it difficult to empathize with Nimbus as a character.",
            "Maybe having that idea be planted in our minds early, and then subverting that with Nimbus screaming about how it wasn’t his time to go, how he should have earned a proper cloudstrider death, etc. Some kind of writing like that rather than “oh he’s dead? Oh well, let’s go surf boarding!”",
            "[This artist](https://x.com/Monty_Smug) may be of some interest to you...",
            "I’ll admit I did try to look up Luzakus  skirt.",
            "Voices are so important to the tone. Luzaku sounds like a kind gentle friend while nimbus sounds like a middle school boy who hasn’t finished puberty that forces his voice into the lowest register he can manage.",
            "It's a woman's voice ran through a pitch lowering filter because the VA is NB. It sounds awful.",
            "::*sad cowabunga sounds*:::",
            "The cabal buddies will not die on my watch.",
            "Exploding Shank... we saved the universe but couldn't save them...\n\nhttps://preview.redd.it/2f5mbvh7uz7d1.jpeg?width=1170&format=pjpg&auto=webp&s=633a650a27e152b4468a929f3f24b0ac938fbb00",
            "So if we like it we should put a ring on it?\n\nSorry not sorry.",
            "Love to learn VA trivia! Thanks for adding that fun fact!",
            "I'm gonna say it, Nimbus outdid Brother Vance.",
            "Same VA as Mara.",
            "Why did you have to call us out like that?",
            "Cawabummer is crazy! XD",
            "Where is that canon, and where do I find it",
            "“iTs LiNkinG wItH the ViEl”\n\n**proceeds to just stand there**",
            "Talked shit about Calus and then tried to fist bump Caiatl about it in front of his corpse moments after she discovered him and was in the process of mourning. Also, their dialogue could be considered by some to be cringe. To me, it felt like they (or the writers) were trying way too hard to be funny in situations that didn’t call for it.",
            "She sounds like she's voiced by the same VA as Savathun, just doing a different voice.",
            "You do *not* get a cookie today guardian.",
            "Yyyyeah, don't know if I would call savathun friendly",
            "Your submission has been removed in violation of:\n\nRule 1: Be Kind, Civil, and Respectful\n\nOur subreddit is a safe space for people of all races, genders and walks of life. It is important for us all to be civil to one another, and maintain a degree of respect for each other. Racism and bigotry will not be tolerated, and depending on the severity of the infraction, may result in a permanent ban.\n\n---\n\n*Please refer to our detailed rules in the sidebar, or [message us](https://www.reddit.com/message/compose?to=%2Fr%2Fdestiny2) with any questions or concerns.*",
            "High key",
            "Yeah, Nimbus is fine. They are an unfortunate victim of terrible writing.",
            "Your submission has been removed in violation of:\n\nRule 1: Be Kind, Civil, and Respectful\n\nOur subreddit is a safe space for people of all races, genders and walks of life. It is important for us all to be civil to one another, and maintain a degree of respect for each other. Racism and bigotry will not be tolerated, and depending on the severity of the infraction, may result in a permanent ban.\n\n---\n\n*Please refer to our detailed rules in the sidebar, or [message us](https://www.reddit.com/message/compose?to=%2Fr%2Fdestiny2) with any questions or concerns.*",
            "Shoot, I’m just looking forward to when Bungie makes them a playable race in a few years at this point.",
            "I am ever your friend, O Guardian Mine.",
            "I agree, but I highly doubt we'll ever see any friendly Vex. We don't even know who or what are giving them orders yet",
            "Meanwhile Finch over here be like 🥲",
            "we did get a hive buddy, his name is finch",
            "There's a friendly lightbearer knight and acolyte in the Excision mission, so that's at least progress towards the dream.",
            "Excuse me, we have the parasite exotic.  I didn't work my ass off as a solo player to get that gun and not have that damn worm as my bestie for nothing lol. Also got a tattoo of the worm as well 😁",
            "Sassy savathic is always welcome",
            "Same. Honestly I hope during the hive episode we get to run an activity or story mission with a hive fire team.",
            "Savathun isn’t our ally",
            "Bro he is in excision, the regular one not the GM! \n\nThere's a Hive Night that comes to help",
            "Fairly certain there's a Hive Hunter doing their normal Blade Barrage spam as well, or it's random.",
            "Yeah. Savathun's brood. I had a friendly Lucent Wizard (not Luz) and Hunter in mine.",
            "They were also terrified of Lightbearers.\n\nThey had enough of an idea about us to know that we're the dead risen with super powers. Didn't help that, a lot of Lightbearers turned into Warlords and abused their powers.",
            "It's a neat concept, but to me, Neomuna needed to be on an exoplanet way outside of the system for it to land.\n\nWith Neomuna being on Neptune, it feels really shoehorned in that they've just happened to remain hidden from us for centuries, and it makes them look bad for just letting Earth take care of all the Solar system level problems we've faced. It also doesn't help that they have hyper-advanced tech that could genuinely help improve the quality of life on earth, but they've chosen to keep to themselves.\n\nAs a result, people tend to approach Neomuna with a sense of disdain rather than wonder. If they were outside of the system, then they'd be far enough removed for it to be reasonable that they couldn't help and could remain sufficiently hidden. The sense of awe wouldn't be competing over questions of \"what the fuck have you been doing this whole time?\", \"How did you manage to hide in our own backyard\", etc that cause the player to disengage with the narrative",
            "Genuinely, honest to god, I think Lightfall would have been significantly better received if,\n\n1. They flipped the script and had Nimbus die. This subverts expectations in a non-asinine way, while also removing the more... extremely fucking annoying of the two Cloudstriders, and gives Rohan the wrinkle of 'my apprentice died.'\n\n2. They just explained what the fuck the Veil and the Radial Mast were in the campaign\n\n3. Acquiring Strand worked more like acquiring Prismatic.\n\nThose three points were EXTREMELY detrimental to the campaign as a whole IMO",
            "Cloudstriders are basically Destiny's spartan program, from using kids, all the augments, the only difference was the reduced lifespan. \n\nIt's been a bit of a waste honestly, Neomuna is an empty zone and seems even the stuff about the Veil has been largely forgotten/left alone by Bungie.",
            "Cloudstriders are basically Destiny's spartan program, from using kids, all the augments, the only difference was the reduced lifespan. \n\nIt's been a bit of a waste honestly, Neomuna is an empty zone and seems even the stuff about the Veil has been largely forgotten/left alone by Bungie.",
            "Lmao how could I forget?",
            "specifically this",
            "This is true.",
            "Luzaku R34 art spotted on long range scanners",
            "That one reminded this one of the talking lettuce people in ffxiv getting kicked to death.  This one was almost sad, but laughed instead.",
            "I can see Luzaku's being annoying, but kinda in an alien sorta way. Nimbus is annoying because they're written like \"Hello, fellow kids.\"",
            "Immediately made me think of the Hanar from Mass Effect.",
            "Seriously, the guy had a death flag so blatantly obvious, he might as well have just stared directly into the camera and said \"Im finally gonna retire in a few days, sure hope nothing crazy happens before then\" for all the difference it would have made.",
            "Not only would it have been a subversion of the trope, but Rohan having to cope with the fact that he might not be able to train a successor in time before he dies of natural causes (cloudstriders live a much much shorter life than normal humans, and Rohan was nearing the end of his) would have been so much better than what we got.",
            "It was so obvious, I was almost convinced there was no way they would kill him off- and then they did. And it was just.... \"Oh.\"",
            "Seriously, though. Having the newbie that can't be serious about anything finally realize the severity of the situation and sacrifice himself to finally do something right, thus leaving Rohan and our Guardian to find a new Strider to replace them for when Rohan's time comes.\n\n\n\nCould've been a cool little quest line similar to repairing the Strider monuments or the Veil missions for the Strand aspects. A quest line to find the next Strider and help train them or find the things they need to become a Strider. Could've dug into how the Striders are made with Siva and >!apparently Vex tech!< a little more than the Veil missions did.",
            "It'd also be a cool subversion of the trope. Rohan is the \"this is gonna be my last gig before retirement\" mfer in the buddy cop drama that is Rohan and Nimbus. Having to deal w/ the aftermath of the ROOKIE dying instead of the Veteran sounds way more interesting than leaning into the trope and rehashing the same tired story, except now the character that survived is annoying.",
            "Oof that would had make lightfall a bit better. Rohan having more screen time and nimbus fucking dying lmao.",
            "That's such a good idea. It would've been worse for Neomuna too, nimbus was training to take Rohan's place in the likely near future anyway. Having him die would lead to Neomuna panic to find a replacement for nimbus and training would have to expedite. They would have to figure out a way to kill Rohan off eventually though or kill both, a little dark for destiny but it would increase the stakes, there would've been time too if it wasn't strand tutorial: the DLC. Make the post game stuff about helping the new cloudstrider(s) as they have no mentor. You could even keep nimbus as one of these brand new cloud striders, the childish playful attitude would actually fit, and have the original nimbus that died be a throwaway character that doesn't have many lines",
            "It really would have hit harder, especially since the Cloud Striders only live for 10 years after augmentation and he's the senior, he probably didn't have many years left",
            "He took the death chant from Return Of The King a bit too seriously...",
            "NImbus was a fresh cloudstrider when lightfall launched: he's no more than 2.5 years into his supposedly 10 year lifecycle as a cloudstrider with the launch of final shape. he shouldn't be seeing a replacement model for another 6-7 years at the soonest.",
            "Nimbus is the type of guy who would laugh out loud at a funeral gathering",
            "He was turned into a tree. So maybe?",
            "Insulting? I’d say straight up disrespectful.",
            "Yeah no, she still loved her father though. We see evidence of this in the lore for heart shadow and how the midnight coup went down. In short, he was meant to be murdered but she convinced the round to exile him instead and spare his life to \"dishonor him\". Plus the main reason she hates the guy is because he was trying to move the Cabal away from a conquering power and that was seen as weakness to everyone she was close to. Calus also loved his daughter deeply. That's part of the reason he chose to change the empire and joined the Witness.\nSide note: you have to keep in mind that Cabal love comes in a very different form to human love and is often very violent lol",
            "Calus was still her father though. She still likely had to grieve him\n\n+ Since he went down arguably in an honourable fashion she likely gained some respect for him for keeping the traditions of the Cabal - as he died fighting",
            "Man shoulda just hidden in the stairs lol Calus' worst enemy is stairs",
            "What exactly makes nimbus a knock off cayde? Just because destiny has only had one flippant and jovial character doesn't mean that every other character with those traits is just an attempt to remake them.",
            "They/Them. They're Non-binary",
            "Ninbus uses they/them, in case you didn't know.",
            "I call him nimrod",
            "I call him dingus",
            "Them*",
            "The Black Heart and the Single Heavy",
            "I have a good wine bottle save up for that occasion",
            "I mean, whichever works, immortals immortal.",
            "Luzaku first appeared in one of the lore books in The Witch Queen. Luzaku's Ghost tries to get her to adhere to the Sword Logic and tells her to crush a Guardian's Ghost. Luzaku refused to crush the Ghost.",
            "I would’ve actually bought Nimbus’ younger cockier personality if there weren’t just TWO Cloudstriders at any given time \n\nReally weird decision to have them follow the rule of two when having the Cloudstriders be an actual organization, albeit smaller than the guardians, would’ve been so much cooler.",
            "Maybe. All I know is that it kind of grated and as a consequence he didn't resonate with me.",
            "See the Chioma Esi logs were a different matter entirely to the point that I found myself hitting the space bar, or going away to make a cup of tea so I didn't have to listen to them and could just read the lore entry later simply because they on the other end were so depressing. Important in terms of build up certainly, but...Far too melodramatic for my tastes.",
            "I *hated* that. I felt like if you were going to go with a hang 10 kind of vibe you could have written some pathos and emotion into the character simply by watching *point break* and watching Patrick Swayze, because there's a good example of how you take someone who lives easily and for the moment but feels genuine *pain* when a friend is lost.",
            "I question why you just had that ready to go.",
            "Definitely not saving this for later-",
            "🤝\n\nTo be fair. I don't care who has the skirt on. Zavala could have one, and I'm looking up it.",
            "Like they tried to apply a surfer slang to him, because skimmers are basically the final evolution of surf boards, and it just doesn't work with the effect they use on his voice.",
            "Bro look at the voice actor and tell me that’s a woman 😂",
            "It feels wrong to shoot those exploding shank buddies in TFS quest with Mithrax :(",
            "Huohuo! Peak.\n\nBut the memories of the Exploder Shank(s) will live on in our hearts and minds...",
            "no problem! I kinda adore Mara so I tend to find my way into a lot of trivia about her and Kirsten as a result lol",
            "Brother Vance still has his D1 clout imo\n\nIt’s not his fault Bungie went ‘ya know let’s change everything that was cool about you’",
            "I stole it from batman ninja turtle cross over",
            "It’s the same VA as Mara.",
            "I know ,_,",
            "Hey she likes us in her hive way lol",
            ">I’m just looking forward to when Bungie makes them a playable race in a few years at this point.\n\nPlus the Eliksni please! \n\nThey deserve the light!",
            "I thought the Eliksni would've been the playable elites of Destiny. Lmao",
            "ELIKSNI GUARDIANS WHEN",
            "Ah yes, Destiny 4 where they abandon the Hunter/Warlock/Titan archetypes and instead you choose between Tower Guardian, Hive Guardian, or Elinski Guardian. I don't know what they'll do with the first two but the Elinski should definitely be a Gunzerker a la Salvator.",
            "I would love this. I don’t think they’ll ever do it though because they would have to make additional armor models every time they released a new armor set.",
            "I know that there’s at least one lore entry that has a friendly vex, it waved at a Hunter, who waved back, got excited and waved even harder, then got blasted by a Titan riding by on a sparrow. So it’s definitely possible, just rare, and unlikely.",
            "The blue light harpy looking for the Captain was friendly.",
            "Wasn’t there a vex mind in neomuna who just wanted to chill and sleep?  Maybe during the exotic glaive mission?  Am i imagining this?",
            "There’s lore of a waving vex who go excited before it was destroyed by a passing guardian.",
            "Inmean Asher Mir could roll up with his Vez army",
            "Maya Sus-daresh defo, she has extensive vex research, she surely has found a way to split vex forces into 2 factions, and that she can control [REDACTED] to a point, if looking by the trailer talking to [REDACTED]",
            "NGL, I've accidentally shot at this guy so many times just from all the PTSD of being one clipped by their supers in Witch Queen, lol.",
            "Their thinking was that the next time they encountered Lightbearers, it would be because the Warlords were invading Neomuna, Rohan says as much during some of his dialogue.\n\nNone of them expected one to accidentally stumble upon their city, and do so as a protector.",
            "I think people approaching Neomuna with a sense of disdain is intended. They literally think lesser of us, think we are Warlords and not disciplined Guardians. I mean, Jesus Colorado (I don't know how to spell his name it's like Jisu Colorondo or something?) IIRC literally asks Ghosts questions at times to specifically make us look bad while informing the Neomuni of the situation happening.\n\nNot to mention, the people in charge at Neomuna *forcibly* made everyone enter the CloudNet, even if they didn't want to. So they aren't exactly the best leaders.\n\n  \nIt's explained pretty quickly in lore as well about how they were hidden. The Veil was hidden there, and the Vex wanted it. So they basically \"sectioned\" off the area from the Universe. Outside couldn't look in, but inside couldn't communicate with outside. I feel like this is somewhat similar to when the Vex put a simulation over the Last City, albeit this wasn't a simulation but more of a firewall.\n\n  \nThe disdain is entirely intended, and I think deserved to have been *fleshed out more*. Again, these people abandoned us and AFAIK never made any attempts to contact or help humanity. Hell, they went as far as to *hide* us by having that 1 Cloudstrider go to Earth and cover up their existence. They clearly didn't want to associate with us for whatever reason, so the wonder isn't meant to be this long-lasting feeling. You are supposed to be mad they wanted to hide from you while also concealing something as important as the Veil. They are entirely meant to look bad. I mean, if theories are true Maya Sundaresh *who is literally one of the founders of Neomuna* is literally going to be the villain this Episode.",
            "So what you’re saying is that Neomuna is the Wakanda of Destiny?",
            "I see where you're coming from, but I kind of like that from a narrative standpoint.  Fuck those guys!\n\n\nI hope there's a sparrow called The Bird, and it describes Nimbus chilling somewhere when a guardian speeds up, stops, flips them the general surroundings the bird, then leaves without explanation.\n\n\nEmbrace iiiiiit...",
            "Well, that's the thing. As I understand it, they didn't happen to remain hidden so mush as intentionally remained as hidden as they possibly could once The Collapse happened. And for good reasons. \nFirst off, almost everywhere died. Every other extraterrestrial colony went completely silent.   \nThen the dead started rising from the grave, taking control of every available resource, and continually murdering each other and everyone else with heretofore unheard of space magic. \nThen the aliens invaded.  \nIn the International Relations playbook, these are commonly referred to as \"red flags.\"   \n\nNot to mention, Neomuna's military strength seems to consist of a few orbital cannons and 1-2 dudes (and/or dude-adjacent individuals). All the while their own leadership went around the bend, got a bunch of itself killed while trying to cyber with a giant space ocular nerve, before finally buggering off to cyberspace.\nI would have hidden too.",
            "I am surprised they went for the cliche tbh of mentor dying.\n\nI feel like Bungie usually does what people least expect, i.e. Green Powers not being Soulfire and instead Strand, Final Shape reveals and story beats, the *technically a retcon but it was a really good one that didn't contradict lore* moment in WQ & the fact that Savathún was actually chosen instead of the community theory of nechromancy ghosts, etc. etc.\n\nThen again, LF story was bad for a reason. Nimbus dying (while I would've been sad to see perhaps our 1 honestly happy and upbeat character die) sets up a unique situation of Rohan being the last Cloudstrider *who is almost timed out* having to find someone new to mentor. But then we would need to shoehorn a new Cloudstrider in with no room to fit them for the campaign, and they wouldn't've really had any way of fitting in the overall plot. *Unless* if the launch season was about having a detachment of guardians establish themselves as Neomuna's new protectors while fitting off the threat of the Witness? Idk.",
            "that one is sick and twisted. this one finds that sick and twisted nature enjoyable.",
            "I got into ff14 a few months ago and the Sylphs were the first beasttribe I leveled (I didn't find the others for awhile 😅) but yeah Luzaku immediately reminded me of them and if destiny and ff14 ever have a collab i imagine Luzaku would fit pretty well with the Sylphs",
            "exactly. Luzaku is an endearing alien, Nimbus is an out-of-touch failed meme page",
            "i mean for all we know her speech could be a direct translation from hive to english too and is technically correct, it just sounds weird. you know like how Yoda's is correct grammar from when he was a kid and language just shifted in the last 500 years",
            "Yeah, I thought so too.",
            "Oh that's why it felt familiar",
            "![gif](giphy|vMmnJti6wQPDy)",
            "Exactly. It was so painfully obvious that your second run you go “Yep should’ve known.”",
            "MENDOZAAAAAAA!!",
            "It's would be really cool if he still waved all of those red flags but nimbus died outta nowhere",
            "But… cloud striders have a 10 year expiration don’t they?. Like, if he didn’t die blowing up the radial mast, he still would have unavoidably died not much later.\n\nSo, yeah, anti-climactic all around.",
            "It would be converting red flags into red herrings and that would've been leagues better",
            "THIS!!! 100% THIS! Nimbus finally being serious for a moment and inadvertently sacrificing themselves would've made a much more compelling story, upped the stakes with Rohan's limited time.\n\nWe were robbed.",
            "![gif](giphy|O1OWsUR3ebdqo)",
            "True, but they'll still need to pick a trainee sooner rather than later.",
            "100% the type to say \"skill issue\" during a service",
            "He was literally made to try and replace him and it fell on its arse big time",
            "Bro's literally failsafe without the funny",
            "Sorry I forget about that lol",
            "So is it Nimbus, Ninbus, or Mingus?",
            "Oh thats right....I apologize for that",
            "You shouldn't be getting downvoted. The Destiny community is so unbelievably toxic about trans and nonbinary characters. Like, why even play the game at this point?",
            "[removed]",
            "I don't think that's applicable, I see very little resembling a mighty hunter and king of men in Nimbus.",
            "Whats the name of the lorebook? Sounds like a nice bit of reading",
            "I found out about them from another meme on this sub recently so it's still pretty fresh in my mind.",
            "I wish there were an interaction where we could wait long enough that Mithrax calls it off and throws charges at the door instead.",
            "That would be a dream come true. I'd completely restart my 1.5k hour account just to play as an eliksini guardian.",
            "Honestly if they’re wanting to go the MMO route, then having cabal, elisksni, hive, human and awoken as playable characters would be pretty fun.",
            "Id reroll for an eliksni hunter and a titan hive anyday",
            "I think having Hive, Eliksni and Cabal (surely there's a lore justification for some of them to be gifted the Light) Guardians with new abilities and supers would be rad. You'd have Warlock/Hunter/Titan replacements essentially.\n\nCould be a Traveler response to a new threat... the Winnower itself, perhaps.",
            "I would fucking die. I would immolate. Every single atom in my body would split in sheer excitement.",
            "The Ergo Sum lore entry actually has me doubting this 'idea' quite a bit.\n\nThe Traveler actively sees being a Lightbearer as a burden. It said, of Ghaul, that it was horrified that *any* being would ask for the Light willingly, let alone demand it and wage war for it.\n\nUnless something significantly changes with the Traveler's attitude - which very well may happen now that darkness has begun to warp it - I don't see any way for Eliksni/Cabal/Hive/etc. to be playable, lore-wise.\n\nAnd, on a developmental side, cosmetics would be a MASSIVE pain in the ass if we weren't all using the same frames/models. TFS is doing fantastically, yes, but does Bungie really have the budget to be adding in an entire new playable race that will require a ton of new animations and custom-fitted armor not only for every single armor, but across three different classes?\n\nI just don't see how it's viable unless something significant changes.",
            "Ideas worthy of a destiny 3",
            "Wish granted; you HAVE to play co-op, with the second person controlling the lower arms. Or maybe the lower left and upper right arms.",
            "What if in the next episode (the one that has fikrul) Mithrax dies froms the curse that he has from meddling with Nezarec juice, but suddenly a ghost appears and deems him *worthy* ?",
            "Considering the rumors of ditching classes in d3 amount of work wouldn't actually increase, because there still will be 3 models to make armor sets for (if only eliksni and hive were added)",
            "Asher Mir is, technically, a Vex, who was friendly to us for a time. Shame he's probably dead now.",
            "Do you remember the name of the entry?",
            "Yeah, that was a fragment of soteria, who we first learned about in the Spire of the Watcher dungeon (they’re the “watcher”). They were made using vex technology, and were an AI that could see the future. They were responsible for launching the echo colony pods early, much to the dismay of Clovis Bray. \n[https://www.ishtar-collective.net/entries/long-arm](https://www.ishtar-collective.net/entries/long-arm)\n\n\nThey escaped from their prison during our guardians encounter in the dungeon, and uploaded themselves into a nearby bow, which was the Hierarchy of Needs. \n[https://www.ishtar-collective.net/entries/hierarchy-of-needs]\n\nThe other part was on the Exodus Indigo, and went to Neomuna. \n[https://www.ishtar-collective.net/entries/into-the-sunset](https://www.ishtar-collective.net/entries/into-the-sunset)\n\n\nThe exotic mission you’re thinking of was the \n//node.ovrd.AVALON// exotic mission, which had us explore a part of the vex network that had been taken over by Asher Mir, who had become part of the vex network after he brought the lake in the pyramidion of Io down, to prevent the pyramid from gaining any knowledge from it.\n[https://www.ishtar-collective.net/entries/asher-conclusion#book-duress-and-egress]",
            "The augermind, don't remember her name. I don't think she's entirely vex. But we saved her during spire of the watcher, where she escaped the vex and eventually became the basis for neomunas network.\n\nEdit: [Soteria, the Augurmind](https://www.destinypedia.com/Soteria)",
            "Helping my brother play catch-up (Shadowkeep to now, just finished LF last night) I can tell he’s having a hard time adjusting to having fallen/cabal allies. I feel he’s going to have a similar problem when we get to excision.",
            "They didn't go far enough then, or they wanted their cake and to eat it too\n\nWhile the lore presents Neomuna as a kinda shady place, the campaign and story missions seem to want us to like the place, and give a damn about it\n\nIf they wanted it to be a totalitarian isolationist dystopia, that's fine, but go hard with it.\n\nIf they wanted it to be a perfect city of the future with automated gay space communism, then go hard with it.\n\nAs is, it doesn't work",
            "I finally realized why Jisu Colorando is such a good reporter name. Because it sounds like Joan Callamezzo from Parks and Rec",
            "Not to mention Maya was literally trying to do what the Precursors did in creating the Witness, just with a different method.",
            "Actually.....\n\nKeep cooking, I wanna see what gets made.",
            "I think Rohan having to put his faith in us to protect the city would have been a fitting end to the Cloudstriders, personally, especially given that they kinda really just don't fit in with the rest of Destiny. Nimbus showing up in Excision was genuinely immersion breaking lmao",
            "I'm not one to do much theorizing while playing the campaign, but even I knew \"oh he so gonna die\" on my first run",
            "As soon as he started spouting about life and pain I knew he was doomed",
            "They either die in glory or live on with life support. One of the retired cloudstrider was bed bound ever since she stepped down",
            "Nah. They’re not actually funny. Just cringe.",
            "Just, one of the worst characters Bungie has written",
            "We put Rasputin in an exo. If we could have put failsafe in an exo and had her talk to rasputin that would have been fun",
            "it sucks that Nimbus is one of the only nonbinary characters in gaming and also has the misfortune of being written so poorly. I was hoping the latter part of the campaign or even the post campaign would have more focus on them stepping up to lead where Rohan once did.",
            "I just don't get why people would want to use the pronoun they know is wrong.",
            "Your submission has been removed in violation of:\n\nRule 1: Be Kind, Civil, and Respectful\n\nOur subreddit is a safe space for people of all races, genders and walks of life. It is important for us all to be civil to one another, and maintain a degree of respect for each other. Racism and bigotry will not be tolerated, and depending on the severity of the infraction, may result in a permanent ban.\n\n---\n\n*Please refer to our detailed rules in the sidebar, or [message us](https://www.reddit.com/message/compose?to=%2Fr%2Fdestiny2) with any questions or concerns.*",
            "Plus isn't Nimrod a scary Marvel villain name?",
            "I believe the name of the book is Ghost Stories.",
            "During my playthrough mithrax slapped the shit out of a subjugator and killed him",
            "I would buy extra character slots for an Eliksni character.  \n\n\nCloaks okay, but how would the shoulder pauldrons work?  Is the trenchcoat just got two extra arm holes?  Does sunbracers get another pair or do they just stick the two on the dominant arms?  Can they melee while firing a gun since they have 4 arms?  \n\n\nNo I don't want space turtle guardian character, but okay if others do.  Maybe Witness-race guardians from the dissenters, that could be cool.  Start out all darkness and you have to unlock the light subclasses.  (Anything to avoid grinding another fucking stasis class)",
            "exo mechanic where every death has you reset",
            "Along the ‘true MMO’ lines, the Cabal/Eliksni wouldn’t even necessarily need to be guardians. Have us play as Splicers and Siegedancers baby!",
            "!-! I meant playable but that…could technically work",
            "here's the post they're talking ab!\n\nhttps://www.reddit.com/r/destiny2/comments/1dj6n09/vex_are_innocent/",
            "No, I saw it somewhere here on Reddit, so I don’t know the name of it.",
            "I think it makes sense *why* he would want to go there. It's our Endgame, the literal end of the universe is at stake so we should get all the help we can.\n\nAt the same time, Cloudstriders are meant to defend Neomuna, it's their purpose. I can get an exception being made for helping to fight The Witness, but my worry is they drop the Cloudstrider plotline of \"we only live for 10 years\". Like, shouldn't a new Cloudstrider be picked soon???\n\nThough... I think I'd like it if we weren't informed if a new Cloudstrider were made. I mean, what reason would we need to know that for? I could maybe get Nimbus telling Osiris, but I feel like we only really have a working relationship with Nimbus, and not enough of one to stay informed on things.",
            "I think someone said something about only a third of the Destiny team was tasked with working on Lightfall, while the rest worked on The Final Shape, which is why the two expansions are like night and day. So it was probably inevitable that they would miss the mark on Nimbus. If they hadn't taken resources away from Destiny for the massive failure that is Marathon, things might have been different. But it truly is a tragedy that Nimbus was such a letdown. They have so much potential. \n\nBut the Destiny community being bigoted towards Nimbus and Micah-10 is infuriating. I don't understand why they insist on playing a game if it's \"too woke\" for them. Like, I don't hear these hypocrites dead-naming or misgendering Oryx, but Nimbus and Micah are fair game for their hatred, apparently.",
            "The new overwatch character is a fairly well written and likeable non binary. Their name is Venture!",
            "Oh Lord. I'd be Flecco-28765 within a year or two.",
            "Your Exo guardians name has an affixed death counter, get enough and all dialogue lines are replaced with Error effects and static to a comical degree.",
            "Cause if you point out that Oryx is actually trans, they'll yell at you for \"bringing politics into the identity of an ultimate eldritch being for whom gender does not matter\" (an actual response I got from an actual person)",
            "Cypher-7thousand bro",
            "\"guardian, how was the vanguard op?\" \"PEANUT BUTTERRRRR !!!!!!\"",
            "I've heard the \"nuanced\" explanation about why Oryx isn't *technically* trans, but I personally like the idea of labeling him as such anyways just because it would get the bigots in this community frothing at the mouth.",
            "I'm probably in the ballpark already"
        ]
    },
    "I genuinely don't understand people who would rather play Crucible ": {
        "title": "I genuinely don't understand people who would rather play Crucible ",
        "score": 1018,
        "url": "https://i.redd.it/lm23fmiky08d1.jpeg",
        "content": "",
        "num_comments": 183,
        "comments": [
            "I didn't even realize they brought back the dreaming city mapn",
            "Gambit has definitely gotten better with the Lucent hive additions, but new maps are desperately needed",
            "because the average player hates gambit, so they decide to hop in as a 4 stack with friends on the hopes it'll be more fun, only to get strung out and wiped by the opposite 4 stack of gambit mains because gambit is CBMM",
            "Counter argument \"Lucent hive one the Field\"",
            "Same, quicker than strikes, less painful than crucible.\n\nGambit!\n\n“I don’t care who wins, just give me my engram!”",
            "unironically gambit is more fun because the majority of players who do are new lights, there's very few who take gambit as serious as mfs playing control like it's trials",
            "You're my kinda player.  People act like it's so bad but you got add clear, simply mechanics, boss battles and pvp.",
            "I think I’m gonna throw up",
            "Fire that transmat i ball",
            "I agree, except for the damn lucent hive on Legions Folley. That many shriekers is a war crime",
            "Mad lad",
            "it's because gambit has been all but abandoned by bungie, i never got to see when it was good but from what i hear it used to be an actually great game mode and while i still enjoy it i wish i could have seen what it was like",
            "If only there are good guns. Herod-C and Servant Leader was the last guns I farmed in gambit.\n\nBut yeah I enjoy Gambit. The armors, the lore, the gameplay, the hype boost Drifter shouts when you get Army of One like a fucking lore-accurate Dredgen.",
            "i like gambit but the heavy machine gun meta is horrid.",
            "I used to play Gambit Prime so much. I miss it.",
            "Small advice for non gambit mains. Powerful attraction grabs motes",
            "Big facts fuck crucible",
            "as a crucible main (I'm sorta out of now) I actually prefer gambit, it really makes me realize how BAD crucible can get if gambit makes me feel some joy again. When I started I played gambit so was almost made for the mode",
            "12x dredgen here",
            "Same bro. Same.",
            "with the new pathfinder stuff I find it kinda easier to complete it in gambit unless its an objective thats is specific",
            "Gambit was so goated before they locked the boss behind a damage gate.",
            "honestly I did a buncha gambit for the Pathfinder and got to rank 9. Not the worst even tho I don't play it a lot. fun trying to be as fast as possible with kills and the such. Even got most invader kills of a few matches with a load out not designed for invading lmao. I get the appeal but I also get the hate; it's a very \"I'll play it every now and then\" type of game mode for me",
            "Awesome gamemode on paper but it seriously needs a total revamp at this point imo, builds and weapons trivialize the PvE and PvP elements of it, and the dwindling population of the mode leads to matches where you will die the second you invade because the enemy team is literally camping every spawn.\n\nI think the maps, the PvE encounters, and the way invasions work need a serious revamp for it to be fun for me (and a wider audience) again.",
            "I feel like the only bad thing about gambit is the lack of updates it gets. I find it to be a really fun game mode but it does get stale playing the same maps over and over sometimes. I think a 6v6 gambit with bigger maps and vehicles would be pretty cool.",
            "As much as I hate crucible, as frustrating as it is, I'd rather play it all day than do one goddamn playlist strike ever again. Running normal difficulty strikes is the most absolute mind numbing shit.\n\n\nBetween gambit and onslaught I can get all my pathfinders done, and I'm happy with that",
            "I love gambit and I wish more people would love it too.\n\nShould it be more like trials or iron banner or guardian games? \n\nNo.\n\nI would accept it as alternating between one week per month or only available on the weekends but NOT if it's a segue to phase it out.\n\nIt's a fun game mode. It sucks to lose. It sucks to get owned by the invader just as you're about to bank 15 motes. It sucks to be defeated as an invader with zero downs. There are a lot of misfortunes but it's really fun, nonetheless.\n\nYou have to constantly think about destiny in terms of Damage Reserves vs peak executable DPS.\n\nThe first is about the total damage available in your ammo reserves, the second is more about Damage per fired round plus the time to reload. \n\nOr Volume vs Time/speed.\n\nYou really need both. \n\nWhat good is high DPS if you have low reserves? Inversely, what good is High Reserves if the reload takes too long and the fire rate is slow, and magazine size is small.\n\nMany people (including experts) just sell the point of DPS, some admittedly think it's obvious that the audience thinks about both, or that DPS necessarily implies both, or that DPS also includes accuracy. However, as someone who has had to explain to people that reload speed and fire rate generally affects DPS - I'm constantly convinced that DPS requires a more comprehensive discussion.\n\nAnyways, all that is to say that Gambit is an avenue by which you internalize how you rank on executable DPS with others.\n\nIt's hard to live life constantly avoiding comparing yourself to others, and there's definitely a need for that but Destiny is a competitive game.\n\nLosing doesn't mean to punish yourself, but rather should be taken as an indicator that further refinement may be necessary. For some people that means improving accuracy, for some, that means different weapons or different super.",
            "The problem with Gambit, for most, is that it puts pve with PvP, and pve players dont like the PvP elements, and vice versa.\n\nI, personally, find it the right amount for PvP per PvE, and love that mode (reminds me a LOT of battleborn, that had a mode like that but with both teams on the same map, and only one bank at center, with limited windows to deposit the enemy drops)",
            "Honestly for me most it is because it got stale and bot enough people play to the mode vs just killing shit. Gambit Prime was a cool change that due to how the majority of randoms play (I.E the majority of the player base it feels) was pretty much dead on arrival. Outside of being heavily encouraged that's why most of the activities have died. \n\nA mixture of the playerbase just doesn't enjoy ritual activities and some of that is due to bungie neglecting every single one of the rituals as well. (Yes including strikes)",
            "Good chance if you’re team plays well in gambit you can win the match. Gambit is a cointoss, regardless.",
            "I don’t get why some people like viscerally hate PvP in this game lol. I get it’s not for everybody but I feel like some people would literally rather die than play a control match",
            "This is my 3rd reset in gambit this season(yes going for 4th). As long as i dont have obscure pathfinder missions i will gladly continue finishing my pathfinders in gambit.",
            "If i had to choose between Playing gambit or the crucible i would rather play gambit",
            "Because after 4000 hours invested gambit is beyond irritating. I can clear out the map. Provide about 79-87 motes. Drop invaders to protect my teammates. Just for us to still lose. Now I get it. I always help with content where I can. But dear lord gambit is just bad when it comes to matchmaking. When I invade I at least grab 2 with me. When I see randoms invade they just flat die or they grab a kill but not motes from the enemy cause you can tell from the grey progress bar. Another infuriating thing is watching randoms hold onto x15 motes to just die because they're not being careful. Or when the enemy team spawns knights you hear an alarm blaring on your audio you turn to look an literally no one is killing them. An drifter in the meantime is literally begging you to kill them because they're bleeding motes yet majority of the time no one is killing the knights. Do I expect a perfect game every match up no. That's not realistic. But I get tired of trying my best to perform well just to either lose horribly or have a strong lead to just lose it at the end for no reason. I used to LOVE gambit but unfortunately it just has too many inconsistencies.",
            "same.",
            "FINALLY SOMEONE UNDERSTANDS\n\nits the ONLY one that doesnt genuinely make me want to blow my fucking brains out. strike playlists are fucking boring, crucible is only fun when youre winning, but skating back and forth between spawns in gambit and erasing adds? sniping the invader who portal camps woth a xeno and emoting? getting rapid OMA medals??? the dopamine hits are incredible",
            "I still play both, maybe I’m crazy",
            "Same",
            "Gambit promise was so good with a full stack. Blueberries, not so much.",
            "Lmao, average r/evilautism post",
            "Well…I don’t just play gambit, ever since curs update I play a lot more dares",
            "I liked both equally but my favorite gambit was gambit prime and when that got changed it got boring to me so now I just crucible main. I can’t stand strikes that’s actually just brain dead.",
            "I personally prefer the more structured/repetitive nature of strikes/nightfalls but gambit is still great fun whenever the mood strikes me. I especially love using AOE weapons like Ergo Sum with Arc Conductor to blast my way through basic mobs and LMGs or power swords to take on the Primeval.",
            "Different strokes for different folks. \nI prefer crucible over gambit and I still don't like pvp in destiny so I don't experience much of either game modes.",
            "Me and my wife legitimately love Gambit.",
            "Getting a couple \"army of one\" emblems in a match makes me feel like a god among men.",
            "Yes gambit on top",
            "Gambit's rad. I'm still sad it got abandoned.",
            "To be fair I’d rather not play either of them 😅",
            "I actually genuinely enjoy it, too.",
            "If you're someone who enjoys direct human versus human competition, then you aren't going to get quite the same experience from anything else.",
            "Vanguard>gambit>crucible",
            "I'm a gambit player it's far more entertaining to me than crucible. I don't have to be good at pvp to do my part for us to win.",
            "i genuinely only log onto the game to play gambit its by far the most fun activity to me",
            "And given the picture you look perfectly normal and sane doing it",
            "I love gambit so much",
            "I love Gambit because I almost always at the top of the leaderboard in kills.",
            "By the nine",
            "The ONLY time I touch crucible is for best boy wolf armor during iron banner",
            "Some days feel like the only woman holding gambit up",
            "I noticed the new gambit map today, that’s kind of cool",
            "It's faster and I could stand gambit after that last rework, waaayyy too much heavy now",
            "Dregen Gildedx10 and my clan is legion \n\nCome at us Crucible Bros. We dare you.",
            "I feel like the people who say they hate Gambit are also the people who exclusively play Crucible and say how much they hate that too.",
            "Gambit imo is really fun. Crucible is sweaty on top of not having the time to make a viable gambit build. I still play it a little here and there and the good games feel really good",
            "The name’s Gambit. Remember it",
            "I only play crucible and gambit. The only reason I play any other part of the game is to get new gear to use in crucible and gambit. This isn't satire, it's just what I enjoy.",
            "Gambit is garbage. Praying it gets vaulted everyday🙏",
            "I hate gambit so much. Playing a single game could give me full artifice armour in the exact roll I want, down to the last point and I still wouldn't play it.",
            "Because Rekoning was 1000% better than the stack stomp that is currently Gambit. \n\nWhy it was removed is still a mystery.",
            "Honestly, the only one I don't enjoy are strikes 😔",
            "You crazy (I also like gambit)",
            "I also prefer gambit",
            "I love gambit too, until i join a team from one clan and they just stood there trolling",
            "Last season crucible was fun, less stressful. This season i dont want to touch crucible, even if i want a godroll rose",
            "I do wonder since i haven’t touched gambit for a while, did still hunt become the new best sniper for invading?",
            "Us gambit players eating well with our new map and shadow legion and lucent hive knights",
            "D2 is the only game I won't play pvp. It's awful.",
            "Gambit is my fucking jam, let's me cut loose with the Winterbite glaive!",
            "My Threadrunner build with Lucky Pants, Malfeasance, and Powerful Attraction can melt the Primeval on primary ammunition, fill every role at once, and move around the battlefield fast enough to do so.\n\nI love carrying teams.",
            "AGREED",
            "I choose crucible because I’m trying to get better at it. Making progress!",
            "Gambit is chill, it’s definitely the more engaging than vanguard, and less stressful than crucible",
            "One of one",
            "Hot take if the destiny player base took 15 minutes to understand the basics of the mode, do a little bit of theorycrafting strategy, and just equipped a good ranged primary/sniper/machine gun to kill invaders or go invade them gambit would be really fun",
            "I lovem both..",
            "If you've got at least one buddy, Private Crucible matches will count for Pathfinder (unless they've fixed it this week). In my case, that's why.",
            "I'd soon rather have a lobotomy then play crucible. It honestly gets me so mad to the point I do the stereotype and punch a hole through my wall.",
            "Gambit is so much fun, and it's my absolute favorite.",
            "The amount of Gambit I've played to complete Pathfinder rewards so I *DON'T* touch PvP would make PvP mains vomit.",
            "I think my main issue with Gambit is mode variety and loot incentive \n\nI mean, you have countless strikes to choose from with their own difficulties and enemy types and encounter variations (double Barrier Knights in Europa BG and Tormentor room in Lake) and damage surges to encourage different playstyles and builds from silly to optimal \n\nIn Crucible, the variety in mode is obvious, from the base 6v6 to comp to the rotating fun mode to rumble and then trials every weekend. You then get your varied maps, and the biggest variation - your teammates and enemies. Every game, what your opponents and allies are using is bound to be different, from the Conditional Igneous trials basement dweller, to the Revision Zero Athrys trickshotter, to the 6 stack rat king memers. Variety limited by weaponry and buildcraft\n\nThen, there’s gambit. Which has one mode at all times, with one repetitive playstyle, with its variety being trivialised PVE enemies, the same 4 maps and whatever heavy the invader is gonna done you with (Xenophage or Levvy’s? Pick your poison, modern Reckoner). It’s the same gameplay loop over and over with major annoyances thrown in too. Kill ads, grab heavy, bank motes, invade, damage boss, kill shielders, kill boss, with the variables of “die to invader” “get invasion stolen” “get fucked by blockers” “die immediately after entering invasion portal” being added in at your leisure, and some of the variables being constantly repeated. It becomes mind numbing and not worth it\n\nI mean, there’s that, and the lack of higher loot incentive, which is really ironic. Drifter’s all about “Guardians need their pay every now and then”, but Zavala’s here giving me Ascendant Shards, Nightfall Ciphers and Adept weapons, Shaxx is there giving me Artifice armour and high tier comp loot, and Saint is giving out Trials gear, which needs no introduction. Meanwhile Drifter has **fuck all nothing**. Shit armour and free glimmer from dismantling ANOTHER GODDAMN SPRAY PAINT. Maybe a shader from his reputation track. Why would I play Gambit over a GM?",
            "Do you even get rewards for just playing gambit or crucible? Other than the rank shit",
            "I miss the old ol days when we had special armor sets for gambit, I'd just murder invaders the second they dropped in.",
            "I tried Crucible one time, the other team wouldn't let my team leave the spawn, I haven't played it since then.\nIm happy playing Gambit, Crucible players can suck my gun",
            "Gambit prime and gambit armor again. Please bungo",
            "There is nothing I love more than picking ip my Malfeasance, and mindlessly popping some taken and banking those motes brother.",
            "If they wanted me to like gambit, they wouldnt have done what they did to me with the malfeasance quest all those years ago.",
            "Gambit > Crucybye",
            "if the gambit nodes werent 'bank a million motes and win for autocomplete, OR bank 1000 and good luck getting those' id be fine",
            "I been force myself play crucible and gambit during first guardian game. My mind telling me “MUST…GET…THAT…GATLING GUN”",
            "A good Gambit match is very satisfying.",
            "Crucible can fuck all the way off.",
            "I refuse to touch pvp just cause it’s sooo boring and annoying but gambit and PVe is actually fun",
            "YEAAAH BROTHER TRANSMAT FIRING GAMBIT ALL DAY",
            "i hate both gambit and cruciclbe. id rather play onslaught",
            "I love both.\n\nInvading actually gets my blood up more than crucible.",
            "only issue i really have with gambit is the way they handle invasions.  \na while back they were testing out a revised version of the invasions so that the opposite side would get them when you banked motes. it honestly felt so much better and made so much more sense but they just never actually did anything with that beyond the original test mode, and now we're forever stuck with the possibility of one side completely stomping another because of invasions.",
            "'Shax wants to know your location.'",
            "'Shax wants to know your location.'",
            "With the old map back I might go back to gambit sometimes",
            "“BRING A SWORD!!!!!” 🦅🇺🇸🦅🇺🇸🦅 big dik wiggas play GAMBIT",
            "Fuck yes",
            "Hell yeah brother",
            "Yeah, if it's not Vanguard, it's Gambit for me. I like working in a team. I like PvE. I don't like 'every man for himself.' I'm a support/heavy DPS. I don't build well for PvP. I like sniping and I like making sure me and my fireteam are gonna get through to the end without all of us dead, or at least most of us, even if it means I'm the one running around res'ing everybody.\n\nI don't like Crucible.",
            "Tbf I dont understand people who prefer strikes or gambit to PvP.",
            "Because the gunplay is incredibly fun, it's so annoying when people make posts like this.\n\"I don't like this certain playlist, so why does everyone else not like it too\" is so dumb.",
            "Same",
            "I follow Drifter *wherever* he goes. Fortunately for me, I happen to find Gambit really crazy, and fun and silly - so it’s a win all around for me",
            "\nI don’t know why, but I find crucible insanely fun even though I’m handicapping myself by using a bow",
            "Yeah truly gambit supremacy crucible sweats can suck my gjallarCock",
            "I genuinely don't understand how people dislike crucible. It's one of the most fun arena shooters I've ever played. The only ritual I play is crucible.",
            "Hey we found the guy!!",
            "I fall asleep in strikes. Crucible gets the blood going.",
            "Well, crucible is actually fun",
            "We don’t have anxiety confronting people in irl either\n-Crucible enjoyer",
            "I mean, gambit is just crucible but with more annoyance \n\nYou get sniped in crucible and die? Respawn and get back to the fight.\n\nYou get sniped in gambit by an invader while having 15 motes? You're gonna have a harder time recovering",
            "It’s a meme and people on the internet can’t form their own opinions so they go with the majority on opinions.",
            "Cause they suck ass at cod",
            "I ~~suck~~ hate PvP so I'd rather play PvPvE. At least there I can stay alive (and play the game I paid for) for more than 10 seconds",
            "I did. Fell into them bottomless pits about 3x today alone",
            "yea, but not the tangle shore one :(",
            "Thankfully, they didn't bring back the tangled shore map. That one blows",
            "New maps and rotate in Gambit Prime again.",
            "average player hasn't touched gambit since before wq.",
            "What does CBMM mean? And is it why I normally run into average-low skilled people (as I am too), because I just hop in alone?",
            "It can't be CBMM, I'm on the winning team too often for it to be. Are you sure?",
            "Nah man, I went in with three other buddies and we went on a 9 game win streak. Unless we are all secretly gambit mains and we all just never caught each other playing gambit I think you might be over exaggerating the difficulty. Get in there and have fun people it truly is a fun gamemode.",
            "Counter counter argument: Finally, a challenge that isn't just bullshit shriekers or disappearing scorn",
            "Yeah. I’ve never got the major issue. The PvP aspect of it is so infrequent that it’s mostly PVE and if you lose… I dunno? So what?",
            "A lot of people seem to go into Gambit with certain expectations of how it's going to play out. If you just go in without expectations and smack some enemies around with Prismatic, the match is over in no time flat.",
            "the only bad part about loosing in Gambit is that it doesn't count to Xenology and I think other quests that require playlist completions, not sure on that last bit.\n\nBut besides, yeah basically it's just playing to play. 🥰",
            "Amen!",
            "You've never lived until you've gone into Gambit with the battle rifle and killed every Invader who tries to mess with your team",
            "![gif](giphy|ED1nge1yi8cGoSYvlb|downsized)",
            "I like the void machine gun, it's a high impact and decent for gms.",
            "Wtf I'm a gambit main and I never knew this",
            "Gambit is the only mode you can find PVP that has any stakes or oomph behind it.",
            "I'm never taking my Reckoner off lmao",
            "Is there a cap to how much damage you can do to the boss when you bring the shields down?",
            "https://preview.redd.it/ixsb1bonc28d1.jpeg?width=1170&format=pjpg&auto=webp&s=8a39be371edebc9f90483ecafc294920f37ab16a",
            "Ok ok genuinely need to know, why? It’s like 10 minutes of mindless easy killing.",
            "Gambit Strikes needed to be a thing.",
            "The pvp in this game is not fun (unless it's in Gambit)",
            "Easy. I've played Titanfall, Halo, CS and CoD. In their own way, all are much better. Why would I play D2 PvP then? \n\nWhere to start with this... You need luck to get decent weapons (you are probably fucked otherwise), matchmaking is ass, flinch causes nausea and sea-sickness if you ever wanna snipe, shotguns need you to be breathing range, bullets curve around walls, you always have like 8 effects applied to you, there's no real \"kiddie pool\" so you are always getting stomped in the beginning, I had to block 9 people just last week for talking shit, and half the time there's some weird meta that kills all remaining joy (classy restoration, immortal, tripmine, overshield titans, threadling hunters, etc.) \n\nI've had fun in pvp before, but it's mediocre at best, kinda shitty at worst. Meanwhile, pve is pretty unique as far as shooters go. I get actual effects instead of \"your gun can now kill slightly faster\", I don't get a seizure the moment I enter combat, and I have a much wider range of builds to use. And the Taken don't call me slurs if I fuck up.",
            "Thank you, I grow tired of all the PVP slander on here.",
            "It's peaceful. I don't need tk think how xXpu55y5layerXx could see me from behind the corner use his meta weapons to kill me while I'm trying to enjoy game after work. Gambit and strikes are just about having fun (with Gambit is 50/50)",
            "Have you heard of the term \"Humor\" before?",
            "Then if you get invaded while holding 15 motes try hiding",
            "exactly, so average player goes in with buddies without realizing that even running a two stack means you're gonna come across gambit mains and get mopped by the same guy both in and out of the portal",
            "I play enough to get the shader and do some seasonals lol",
            "Connection Based MatchMaking. essentially it makes sure you connect to players with good internet, the game doesn't care if you and your friends rarely play, while the other team is on their 4th reset and everyone is a dredgen",
            "Connection-Based Matchmaking. So it doesn't matter if you got a really good group or a really bad group, you'll be linked to the people with the least amount of ping between your groups.\n\nBasically it means that low-skill groups can get wiped by high-skill groups, high-skill groups can get matched with high-skill groups, and low-skill groups can get match with low-skill groups.\n\nIt means less ping and completely random \"fairness\" in the probability of you winning. You can have a 1% chance to win this round and 94% the next round.",
            "Wdym bullshit shriekers? Lucent hive is peak bullshit shriekers. You get like 4 orange and yellow bars immediately",
            "It does get really frustrating when your bank starts losing motes instead of gaining them. (How do you even trigger that?) Otherwise idc much anymore.",
            "Iron banner strand wave launcher + battle rifle + rain of fire + dragons breath in gambit feels better than an orgasm while high",
            "cool experience irdc😐",
            "Happens to the best of us, i use it with thruster alot\nhttps://www.reddit.com/r/DestinyTheGame/comments/14cqava/as_some_others_have_shared_powerful_attraction/\nThread with proof",
            "AFAIK no",
            "isn't it like every 1/3 of their health? that's how it usually ends up for me when i play.",
            "Thanks but I wasnt actually asking for an explaination. I understand how fun works.",
            "PvP is the real endgame. Humans are the ultimate prey.",
            "Ah yes, because your post exudes humor.",
            "still wish the solo queue was a thing, but I will die on the hill that gambit is a way better time then crucible.  \n\n\nI still cannot believe the amount of friends I have around that will casually ask me to smash my head into a wall and play trials every single weekend.",
            "It’s me, I’m the dredgen",
            "Good. Then that’s 4 orange bars to charge my Still Hunt on!",
            "When more than one blocker is present your motes get drained. So nuke the blockers asap if you’re trying to win. Or just ignore it so you can lose faster and focus on PVE kills for your bounties hah",
            "This is something someone who solo match makes for both would say",
            "The Most Dangerous Game.",
            "https://preview.redd.it/2nwmh561718d1.jpeg?width=214&format=pjpg&auto=webp&s=276898bbe097d49b1e066d4da7a40ce386ec9627",
            "My friend asked if I wanted to play trials.\n\nI simply replied \"Ew Trials\", put on Polaris and went to town invading.",
            "It's frustrating how many players don't know this.",
            "Nah i use payed carry services for the latter",
            "https://preview.redd.it/swd14wkdh18d1.jpeg?width=1179&format=pjpg&auto=webp&s=ee57dde2f0b4c1489804a3cba982fb6b36356cec"
        ]
    },
    "Just played ZK in comp…": {
        "title": "Just played ZK in comp…",
        "score": 743,
        "url": "https://v.redd.it/vjybjpig518d1",
        "content": "",
        "num_comments": 61,
        "comments": [
            "I must say, out of all the pvp streamers I ran into, CammyCakes was the most insane. Dude was killing me in ways I didn’t think were possible, whereas the other ones were just really good. Haven’t played Zk though",
            "mfs getting downvoted for congratulating bro is crazy reddit is such a close minded place lmao",
            "Good job man. Don't know why you're getting downvoted, people are assholes.",
            "Yesterday I got matched against aztecross and ifrostbolt lol now",
            "Dude, my first ever trials weekend (beyond light-ish) we ran into this guy and frostbolt, I had no idea what was going on but my two friends were freaking out",
            " I'm always in try hard mode when I play streamers. The hardest one so far for me was defintely Wallah. Dude hits nearly every head shot and his movement is insane.",
            "That’s wild man, nice moves.",
            "![gif](giphy|rI9O6UXkCjvTG)",
            "he's insane on dawnblade i run into him a lot in rumble",
            "Good shit he’s goated",
            "He probably complained and yelled at his teammates after you killed him. Can’t stand the guy. Good stuff though OP! lol.",
            "Leave some dick for the rest of us Jesus",
            "Who?",
            "I’ve killed sweatcicle in trials before. I was getting carried in d1 trials and killed him.",
            "Thats cool, Id be a little nervous haha.",
            "I fought True vanguard a few days ago and I couldnt win a duel against him no matter how hard I tried. It was funny because once I realized he was on the other team I was like, setting up mouse-hunt style ambushes and waiting for his name to come up so I could get the drop on him.",
            "Thank God it never happened to me lmao \n\n...not that it'd have made any difference but, still..\n\nGood job OP 😉 your moves fuck",
            "[removed]",
            "Nobody cares",
            "Yeah most top players I’ve ran into just out shoot you cause of how much time they put into it + good movement and understanding the meta\n\n\n\nBut when I verse cammy bro just sees the game differently than how we see it",
            "The funny thing with Cammy is if he killed you, you just know he could have killed you quicker and easier than whatever weird and wonderful method he cooked up",
            "Cammy is probably the best pvp player I’ve seen, man’s been consistently goated with his weird builds since d2 y1",
            "I would say the same about Hynra. That stuff is insane.",
            "Same with wallah",
            "Wallah is also insane with it",
            "Yeah ZK is def not one of those “holy shit this kid got something special” kinda deals. He’s good , but it’s just in the sense that he’s simply clocked in 10x more hours than 99.9% of the PVP player base.",
            "This!  I love CammyCakes, he’s just on another level and it’s literally mind blowing.\n\nHowever, I did see a video where Frostbolt matched up against CammyCakes twice in the same Trials run and Frost beat him both times.  That was one of the most insane Trials run I’ve watched.  You could feel the “oh shit” in the air by just watching the video.",
            "They are jealous that they will never be skilled enough to face him.",
            "cheers man, yeah people are weird",
            "did you get the w?",
            "I would be both honored and upset lol ",
            "ZK Mushroom",
            "he did indeed 😂",
            "😳",
            "A famous destiny streamer that focuses on pvp, trials carry etc. Usually playes with frosty another streamer",
            "one of my favourite streamers, need that redeem comeback asap",
            "Your submission has been removed in violation of:\n\nRule 1: Be Kind, Civil, and Respectful\n\nOur subreddit is a safe space for people of all races, genders and walks of life. It is important for us all to be civil to one another, and maintain a degree of respect for each other. Racism and bigotry will not be tolerated, and depending on the severity of the infraction, may result in a permanent ban.\n\n---\n\n*Please refer to our detailed rules in the sidebar, or [message us](https://www.reddit.com/message/compose?to=%2Fr%2Fdestiny2) with any questions or concerns.*",
            "Aren't you lovely.",
            "You must be popular",
            "Very accurate. Whereas all the other pro players are clearly talented, cammy is a literal genius. Give him the worst weapon, the most useless build in the world and he’ll still kill the best with it. Dude plays the game as if it were a moba",
            "I love cammycakes vids sometimes cause he does so many things I just never even consider, his perspective of pvp is definitely interesting",
            "Cammy for me is the GOAT!",
            "yeah that dude is always cooking with the weirdest stuff",
            "He's been cooking since D1, he was sword hilting with blink back before it was even considered in D2.",
            "Once in a while he posts the pov of his enemies and you literally don't fucking see what hit them it's hilarious.\n\nThe round will start, 4 seconds later 2 of your teammates are dead and you turn around to see him rapidly approaching your face with a grapple from your own spawn",
            "Not to take away from either of them, but Cammy definitely often plays in a way that is antithetical to playing competitively. As Cammy sort of explains in one of his videos, sorry I forgot which one exactly, what he looks for in PVP builds is the \"Sunlight Hurts My Eyes\" moment, a sick impressive trick shot. He likely doesn't kill you in the most efficient way, even though he probably can, but he will certainly try to cook up a kill that is so impressive (and probably convoluted) that even if Destiny introduces kill cams, you might still be confused by what just happened. That isn't to say that Cammy doesn't play \"the meta\" ever, like back when Void 3.0 first released, you'd sometimes see him play void over-shield titan in comp or trials.",
            "They’re both amazing players, but I just don’t think cammycakes is much of a competitive player. His playstyle is so nonorthodox I’d be shocked if it worked well in a team.",
            "Honored? Matched both ZK and Frost in Trials way back when, some time after Beyond Light. Around the whole Shatterdive part of nonsense. \n\nWas just me and a buddy and some random. Random wasn't good, my buddy neither. I can hold my own to an extend but obviously not against those guys. Still, managed to clutch a singular round. Which in turn caused Zk to start bagging me the rest of the match. As well as some less then flattering stuff on his stream.\n\nHe good? Yeah. But he's also quite the toxic arsehat",
            "![gif](giphy|3CCm5EtEccYmxnGvwv)",
            "More like yugioh he describe his way of thought to see the game as a deck of cards and combine them into good combos",
            "Absolutely.  I think CammyCakes style of play is more appreciative, the way he thinks and the builds he uses are just insane.  Extremely creative.  Frost is a beast and plays at a high IQ level.  They’re two of my favorite streamers and when they matched up not once, but twice in the same trials run, I was ecstatic.  When Frost was like “that’s CammyCakes “, I was thinking “well, time to reset your ticket”.  Those two matchups gave me a new level of respect for Frost, if that makes sense.",
            "We get it you don’t follow the d2 pvp scene.",
            "pretty big pvp twitch streamer",
            "\"my grandpa's deck has no pathetic cards, Aztecross\"",
            "Jesus fucking christ. The people in this sub are insufferable as fuck. Sorry for all the downvotes my guy. Take my upvote.",
            "Who?",
            ">pvp  \nSo that's why I haven't heard of him",
            "Must not be that big",
            "thank you sure",
            "![gif](giphy|cRNbYm7jLOjm9H8wcP)",
            "What is a pvp snitch Beamer?"
        ]
    }
}