{
    "Hi, I'm Sathyajith Bhat - Staff Software Engineer. AMA.": {
        "title": "Hi, I'm Sathyajith Bhat - Staff Software Engineer. AMA.",
        "score": 134,
        "url": "https://www.reddit.com/r/developersIndia/comments/1dlpooi/hi_im_sathyajith_bhat_staff_software_engineer_ama/",
        "content": "Hi r/developersIndia,\n\nI'm Sathyajith Bhat, but most call me Sathya (or SathyaBhat).\n\nI currently work as a Staff Software Engineer at The Trade Desk in Sydney, Australia. I was born and completed my education from the small city of Mangalore, Karnataka. I started tinkering with computers back in 1997 when my dad purchased my first computer featuring a blazing-fast Pentium 100 MHz Processor, a whopping 16MB of RAM and a 1GB hard disk.\n\nAs with most folks, I completed my grudation as an Electronics Engineer (because it had more \"scope\") and got my first job at 3i Infotech Ltd, a former subsidiary of ICICI Bank via off-campus interview (because my overall GPA low enough that I couldn't sit in placements). In my first job, I worked as a release engineer, preparing release/patch notes (back then CI/CD etc weren't a thing). I picked up a knack for finding out the root cause of problems and weird bugs, a challenge that I enjoyed very much leading to my eventual transition to DevOps with StyleTag back in 2015 and then to SRE at Adobe in 2017. Over my 17 years of experience, I've worked in a variety of roles from development, manual testing, client liaison, and of late SRE.\n\nIn my free time, I used to spend a lot of time working with different communities, organizing events and meetups such as AWS Community Day, CDK Day, and Barcamp Bangalore. I was one of the early private beta user of Stack Overflow, and eventually became a Community Moderator at [Super User](https://superuser.com). For my contributions to the AWS Community, I'm recognized as an [AWS Container Hero](https://aws.amazon.com/developer/community/heroes/sathyajith-bhat/).\n\nI'm also an author, having written two editions of Practical Docker with Python and a co-author of The CDK Book. In my free time, I play a lot of games (usually ARPGs) and have some [minor sideprojects](https://github.com/sathyabhat). I used to blog quite a bit but has reduced a lot but you can follow my blogs:\n\n* Tech blog at https://sathyasays.com\n* Personal blog at https://sathyabh.at\n\nFor a detailed  write up of my career you can read this you can read this interview transcript on SRE Stories - https://www.srestories.dev/p/sre-story-with-sathya-bhat.\n\nHere's [my post on LinkedIn](https://www.linkedin.com/posts/sathyabhat_devops-sre-cloud-activity-7209924423817076737-bw-6?utm_source=share&utm_medium=member_desktop) to verify my handle.\n\n💬 Ask me about AWS, Cloud Computing, Containers, DevOps, Technical Writing or anything else - I will try my best to answer.\n\n----\n\nOk I'm going to take a break for the day as it's getting late and dinner time. Thanks for having me, and if there's some questions I haven't answered, I will reply tomorrow. You can reach me on Twitter, LinkedIn, Discord or email - I will try my best to answer. Contact details are at https://sathyabh.at/about/\n\nThank you everyone!\n\n",
        "num_comments": 128,
        "comments": [
            "you've worked in bengaluru, romania, and are now in australia. how easy or difficult have you found settling into different regional cultures.",
            "Hi Sathyajith! With your extensive experience in technology and writing, what do you think are the most critical skills aspiring developers should focus on to stay relevant in the rapidly evolving tech industry? Also, how do you balance the technical depth needed for development with the creative aspects of writing and content creation?",
            "do you keep any hobbies outside of tech for times when tech, if ever, becomes mundane for you",
            "It has only been 3 years since I started my career journey currently I am backend dev. Tech stack - .NET, Kafka, elastic. I have also worked on Azure integrations and some bits of devops.\nI am interested in k8, dockers containers CI/CD\nCan you advice where should I start from",
            "Any suggestion on how can I quickly start a blog and set it up so that I can focus on writing(I do write alot) and avoid the procastination(lol) of buying a domain, which static website generator to use, where to host, how much would it cost a year, what are some good writing habbits\n\nand I acutally like to know what are some devops tool you use day to day outside your job\n\nalso would like to know some tech discord groups where you are active, where you talks about devops stuff",
            "Hi Sathya, what do you think is going to be the  average shelf life of a dev(like core coding none of that management crap) with GenAI and coding assistents getting so much better, what should be the ideal career trajectory for consistent growth with minimal stagnation  (I.e job switches every year or stay for extended time in 1 company) ,  is it better for someone to stick at a less paying dev job in or be in non tech but relatively  high paying job and then eventually switch to Dev (have you worked with people like these?if yes what was your experience)\n\nThanks for hosting this AMA, may you have a nice day",
            "Thanks for this AMA!\nHaving spent some time knowing you and talking to you on the discord server and asking you many questions in the #devops channel, I don't really have a lot to ask you right now.\n\nI do want to know how to get started with writing blogs and writeups. I work daily on so many amazing technologies (thanks to you for the referral btw xP), I have so many things to write about but I can't find the energy or time to start writing. Can you give me some pointers on how to get started with all this, amidst all the daily work. How did you get started with writing too?",
            "\"What emerging technologies or trends do you believe will be most critical for software engineers to focus on in the next decade, and how can current professionals best prepare themselves to stay relevant and secure in this rapidly evolving field?\"",
            "With a 2 yr gap is it possible to get a job? Will this affect my chances of getting into it? Do certifications matter?",
            "Thanks dude for AMA, since you are in sydney any idea how is  embedded market there? \nIs it wise to shift to Australia?",
            "Have you ever had episode of back pain working in IT for all those years",
            "Can you tell about your journey on how you reached Sydney, did you apparently apply for companies there or were reached out by them",
            "as you mentioned you are an electronics engineer and you are quite senior and experienced, can you let me know what is the scope of Electronics and semiconductor industry as I am willing to pursue some sort of electrical degree ,I am currently actually pursuing one but can you let me know what is the scope of it as I am willing to make a career in the semiconductor industry",
            "Please elaborate on \"network actively\". How exactly should I? Like should I help them with their family matter and all? What will I achieve irl if I know many people and many people know me?",
            "Hello Sathyajith. I am a fresh graduate and will be joining a fintech as a Junior Devops Engineer. I have mixed feelings going into this role as I think I might enjoy being an SDE more. How are the career prospects for Devops compared to SDE? \n\nCan the work be overwhelming for a junior and how to differentiate myself in this field?",
            "Hi Sathya,\n\nI'm interested in the impact of cloud computing on IT careers, particularly DevOps. While DevOps remains strong, the emergence of \"cloud platform engineer\" roles sparks a question:\n\nWill DevOps focus primarily on existing infrastructure maintenance, potentially hindering innovation?\n\nTo navigate the next decade DevOps or operational roles , what skillsets do you consider essential?",
            "Hey I want to know about a trade desk job. Does it involve software engineering knowledge or mathematical/statistics knowledge? What do you find more exciting software engineering or data science?",
            "there is roadmap for 1-3yrs devs, there is not roadmap for 5yrs to 15yrs. whats with that. its like andere mei tir marna career roadmap. any pointers?",
            "yencha ulleru!",
            "Which is in more demand in Australia devops or data analyst / scientist",
            "Hey,\nHave interacted with you on discord from time to time and reading this just blew my mind!\n\n\nJust wanted to say Hi and all the best for the future!",
            "What would be your advise for freshers ?",
            "Apologies for asking a very bad question. I finished my graduation in 2023 Jun and it has been 1 year and I have done nothing but hop from one interest to another like Animation, Video Editing, Game development and now settled down on DevOps. I am preparing for certifications. My CV is as empty as white paper. I don't even know what to answer if an interviewer asks me to introduce myself. So I request you to not sugarcoat and tell me about my situation and how to move forward to get a job. Thank you so much.",
            "Hi! Hope you're doing great :)  \n\n\nYet another dev here, I completed my integrated 5 years Masters in Software Engineering and I now have 1 YoE. Current tech stack is C++, Python, AWS, Docker and a little of ReactJS. \n\nI keep seeing many posts /  online articles stating that semiconductor industry is going to boom in India. I would love your insights as to how core SWEs can benefit from this, as hardware engineering requires a lot of low level software as well. \n\nThank you for taking time to do this AMA. Have a great weekend sir :)",
            "Nice to see you here. We went to Melukote together back in the day!",
            "Ok I'm going to take a break for the day as it's getting late and dinner time. Thanks for having me, and if there's some questions I haven't answered, I will reply tomorrow. You can reach me on Twitter, LinkedIn, Discord or email - I will try my best to answer. Contact details are at https://sathyabh.at/about/\n\nThank you everyone!",
            "When will you give me the CDK book?",
            "I'm a final year student. Doing (Integrated Btech+Mtech CSE). In the last year we needed to write a research paper. From what I know after discussing with some of my teachers is that they mostly suggest doing something in the field of AI/ML. \nI am looking for some field other than AI where I can write my research paper also while turning it into a full time career. \nYou have experience in cloud computing, devops and containers. Is there any topic in those fields worth researching, so that I can have an awesome research paper.",
            "Hi Sathyajith! \nA 3rd year college student here. I've generally heard people on the internet saying that there is saturation in the market nowadays and how there is lack of good software engineers. Taking this into account here, I want to ask that what are the qualitites or things I can develop that will eventually make me the \"good software engineer\" that the companies are looking for? \nI'm willing to put in the work to achieve that...\n\nThank you for taking out your precious time to hold this AMA, grateful!",
            "Hi Dude, how's life going on. Why did you chose to spend your Saturday here on reddit AMA not on your other hobby, personal time etc.",
            "As someone who wants to switch from .NET Developer/ Application Developer role with 8 yrs of experience, into the world of DevOps and Cloud Development, what is the pathway I should take ? Certifications? Course ? Bootcamps ? How can I change my career path ? Thanks",
            "Is there hope left for us freshers?",
            "Do you think we should be jack of all trades or master in one? i.e Progress in the same tech stack(with upskilling) or get our hands dirty on different things?\n\nThank you.",
            "What level of coding is required for SRE and devops, do I have to be pro at DSA? or just the basic for loops and collection will do?\nAlso how stressful and demanding is this job?",
            "Hey, how do you stay motivated with all the smart people working in your team. How do you manage job and constant learning",
            "Do you think transfers to abroad will still happen? I feel earlier companies would transfer senior devs to other countries but now it's not happening at all. How does one get a job abroad?",
            "How do you switch stacks as someone early (2YOE) in their career? In my case, I've been assigned a project in WebMethods which is an Integration Software since I work in a Big4. But I'd want to switch into something more non-specific like Python/Java if that makes sense?",
            "Hi! Do you have any advice for recent graduates who are about to start working soon? Perhaps something you would tell your younger self as he begins his first job?",
            "I have 10 yrs of experience, started as a ERP consultant and 6 yrs back moved to cloud. I got a chance to work at migration projects in the first 3 years. Then migration became obsolete. I am stuck in the same company with low salary .\n\n\n I have upskilled myself in devops, terraform, kubernetes. I am able to answer interviews with topics related to all these, but most of the time they rejected me because of lack of coding. My question is let's say I have learned k8s, I have an idea what questions I should expect (k8s storage, networking ,fundamentals , use case ), but how should I prepare for coding round with respect to devops . I have learnt coding but I am not a developer , so every time a company asks me to write any logic related to python and I fail.  If you are still answering pls let me know how I can close this gap.",
            "I am nlt getting job from anywhere due to my cgpa being lower than 7 is there anywhere i can do i am rejected everywhere completely",
            "I carry 7 years of experience working in full stack (.NET/AWS/Vue). Recently my company offered me to move to SRE role. I being a tech avid, never had my dislikes towards any specific stack. I make and break things, that's how I learn. I'm confused or in two minds as what should be my next step. I'm unsure about the future of SRE or maybe I'm unaware. I see that you are working as an SRE, could you just brief me about the pros and cons in your role and why should someone move from SDE to SRE (If they don't have any inclination towards any specific stack).",
            "Hello I am currently doing Mtech and want to work on the security aspects of containers like docker , any advice or direction you can provide? Thank you.",
            "1) How to climb the corporate ladder (a high paying job with good WLB) as someone with an average academic background? Tier-3 university with a 7 scale CGPA? \n\n2) How to stand out amongst the crowd? Since the herd is full of people like me? A tier -1 student already stands out just because of his college tag, but how do I stand out as a tier-3 guy?\n\n3) What's the best approach towards learning a new technical skill?",
            "WIll the job market get better in future or will it get worse",
            "If i cannot get placed since my cgpa is lower shall i prepare for gate exam",
            "Can you please give me advice on this:\n\nhttps://www.reddit.com/r/developersIndia/s/dBwdKnrFPf\n\n\n\nOr anyone else here pls",
            "Remind Me! 5 days!",
            "> you've worked in bengaluru, romania, and are now in australia. how easy or difficult have you found settling into different regional cultures.\n\nIt takes a while to get used to regional cultures but it's a learning experience. Australia is pretty easy going as there are people from many different countries and is quite multi-cultural. \n\nRomania is far more mono-cultural and people are a lot more blunt - that can be misconstrued as them being rude, esepcially if you're listening to them just on audio.",
            "> the most critical skills aspiring developers should focus on to stay relevant in the rapidly evolving tech industry?\n\nI think having a really good grasp on fundamentals goes a long way in understanding and adapting to new technology. With that you also need to keep up with what's up and coming  being part of meetups, conferences, reading blogs, Reddit/Hacker News goes a long way in helping bridge this gap\n\n> Also, how do you balance the technical depth needed for development with the creative aspects of writing and content creation?\n\nYou need to understand your audience - are you doing for beginners, or intermediate/advanced folks? Quite so happens that a lot of content is targetted at beginners because they're the ones who're searching for it the most. The more intermediate/advanced your content goes, the smaller is the target audience. And if you can make peace with that, then you try to go for what you like the most - teach new folks, or go into incredibly deep dives that you will not get much of a response :)",
            "> do you keep any hobbies outside of tech for times when tech, if ever, becomes mundane for you\n\nEvent Management, Community Management is things I can do (and I have done on freelance) previously. I am far too engrained in tech however.",
            "I posted this in the the discord, reposting again: https://discord.com/channels/669880381649977354/670198758343966740/1075047326445469828\n\nLook at https://roadmap.sh/devops and start reading up. From this, here's what I think you should do: \n* learn a programming language. Any will do, python is good to start. You need to know enough to write small scripts, not just hello world\n* learn to live in terminal: practice how to create files/directories, understand unix permission model (if I ask what does 644 or rwx-w--w- means you should be able to tell me)\n* shell scripting is good to have\n* learn about managing servers: how to install an OS, how to install software (pick any distro, I would recommend Ubuntu. Others the commands will differ, the principles will be the same)\n* learn about how build, run software. Pick any open source software, or build your own, and learn how to package it to deploy. Write small shell scripts to make the 5 things you have to do always in to a script executable script\n* learn about containers (\"docker\" is a tool, containers is the principle). Learn how to package this app you built into a container\n* learn about CI/CD principles. Understand the principles. Tools like Jenkins/Gitlab/Github actions will come naturally. Practice how to build your app using CI principles. Then practice how to deploy them using CD.\n* Understand how networking works. You don't have to go deep into the kernel level. At the minimum, you need to know about Subnets, routing, interfaces, ports\n* Understand OS concepts: understand the Linux folder hierarchy. if someone asks you where the logs are, or how to get a app to run on startup, you should be able to explain these \n* If you're going to pick up Cloud Skills: pick a Cloud,  any cloud. Principle matters, implementation will come from reading the docs\n* Understand fundamental pillars of cloud: IAM, Virtual networking\n* build something in the cloud. Maybe a manually deploy that app you built onto a cloud VM\n* learn some infra as code to automatically do these.",
            "> Any suggestion on how can I quickly start a blog and set it up so that I can focus on writing(I do write alot) and avoid the procastination(lol) of buying a domain, which static website generator to use, where to host, how much would it cost a year, what are some good writing habbits\n\n\nI mentioned above - Dev.To, HashNode, WordPress, Substack - any of these is a good start. Don't get entangled into the which tool/software is the best, just pick one.\n\n> and I acutally like to know what are some devops tool you use day to day outside your job\n\nI have a [NAS](https://sathyabh.at/nas) where I self host a bunch of apps - I use Docker Compose to manage them, use NetData to monitor them.\n\nI've also written a prometheus exporter to export my finance/budget data as metrics because I wanted to learn about how to write prometheus exporters https://github.com/SathyaBhat/ynab-exporter\n\nMy website uses a CloudFront CDN that is created using AWS CDK https://github.com/sathyabhat/cdk-cdn\n\nI have couple of EC2 instances that are configured using AWS CDK, and some older stuff done using Terraform. \n\nAnd at the moment, I am writing a Discord bot using Lambda :)",
            "No OP, but use Hugo/Jekyll for SSGs, there are a lot of Hugo templates for bloggers. Cloudflare Pages does not have a limit on the number of sites deployed, unlimited bandwidth, and CF workers integration and sits well with your site and dns configuration. The only limit is 100k worker requests per day, which you'll not likely even use with SSGs. CF Pages even work with SSR in nextjs, but the workerd has some issues with suspense cache.",
            "Also to answer your question that I missed:\n\n> also would like to know some tech discord groups where you are active, where you talks about devops stuff\n\nI'm around at Developers India Discord, as well as The Engineering Org",
            "> what do you think is going to be the average shelf life of a dev(like core coding none of that management crap) with GenAI and coding assistents getting so much better\n\nStill quite long, I hope :) Coding assitants are getting better but they still need human input for now. We can only wait and adapt as things change.\n\n> what should be the ideal career trajectory for consistent growth with minimal stagnation (I.e job switches every year or stay for extended time in 1 company) is it better for someone to stick at a less paying dev job in or be in non tech but relatively high paying job and then eventually switch to Dev (have you worked with people like these?if yes what was your experience)\n\nI don't think there's a generic answer to this. Career trajectories depend on a lot of factors - whether you like the job, whether you're supported by your managers, what kind of work you get etc. \n\nYou can have all the plans in the world for the most ideal career and have them messed up due to something you can't control.\n\nHaving said that, I think its fair to say - try to stay in for atleast couple of years to get a good hold on what the role entitles, and then switch later, staying for longer as you get more experienced",
            "> I do want to know how to get started with writing blogs and writeups. I work daily on so many amazing technologies (thanks to you for the referral btw xP)\n\nhaha, glad to hear that. \n\n> I have so many things to write about but I can't find the energy or time to start writing. Can you give me some pointers on how to get started with all this, amidst all the daily work. How did you get started with writing too?\n\nI have been there, it can be really hard to write something after a long day at work. My suggestion would be to try to \n\n1. Keep writing a rough outline of what you want to write. \n2. Keep updating the post with the notes whenever you can, of whatever you did.\n3. Try to keep a dedicated time to go through these, refine it and publish it. \n\nI have been publishing my weekly notes on my personal blog since about a year and half now, and I usually write the posts on Sunday afternoon and now it's become a habit.",
            "Can you tell the name of that discord channel",
            "It's hard to know what's changing in the next 3 years, a decade is far too long. A decade ago CI/CD, DevOps was in its infancy, containers were still research material, Cloud wasn't that common. In the past 3 years, ChatGPT came along and made quite a breakthrough. \n\nSo yeah, it's hard to figure out what new thngs will come. Best is to have your fundamentals strong and be prepared to keep up with the new things coming your way",
            "> With a 2 yr gap is it possible to get a job?\n\nPossible, but you're going against people who've been working during that tiem, so will be hard. \n\n> Will this affect my chances of getting into it? Do certifications matter?\n\nIt depends - Certificates are good for a guided approach to learn something. I don't believe they will get the job just by certs alone.",
            "Australia's not very high on software engineering - and not sure about the embedded market. Is it wise to shift - that depends on what your goals are. Know that Australia doesn't consider IT to be a priority/focus role at this point (this might change in the future) so expect moving here to be quite difficult.",
            "I actually had a disc bulge due to bad posture and a bad fall. Take care of your health - breaks help!",
            "In my case it was neither - a friend reached out to me asking if I'd be interested in joining the Trade Desk. Since I was already in Europe at that point, and The Trade Desk was quite flexible, I decided to move to Sydney.",
            "[deleted]",
            "I'll be honest, I am a fake electronics engineer and haven't done any work in eletroncis and as such I can't really answer on what the scope of electronics industry is. That said, I know a few folks who do design & validation so maybe that can help get you in the right path.",
            "> Please elaborate on \"network actively\". How exactly should I?\n\nThere's different ways of networking - the more common would be to start showing up at meetups. As you attend more, some people will become more familiar as they are repeat folks. Talk to them, find out what they are doing. \n\nFor online communities, hanging around in telegram/slack groups interact with people, answer their questions, ask questions and become familiar among people.\n\n> Like should I help them with their family matter and all?\n\nNot at all. \n\n> What will I achieve irl if I know many people and many people know me?\n\nit opens up connections - my move to DevOps was possible because a friend who I met at a conference told his friend that I'm looking for a change. My current job is via another firend who I met online, and asked me if I am interested in the job. \n\nThe world is small and knowing people IRL can be the difference between \"I have seen the person online\" vs \"I've seen the person at x, y, z meetups and they are interested in x technology and seems like an interesting person\".",
            "> How are the career prospects for Devops compared to SDE?\n\nDevOps is still quite a broad and nascent field, so you can expect it have lots opportunites. My take is that DevOps is still a specialized field/role and you should focus on building your career as an SDE, especially given that you like it more. Folks with SDE backgrounds are quite in demand, especially in platform engineering and in SRE, and prior dev knowledge in SRE/DevOps can be invaluable.",
            "> Will DevOps focus primarily on existing infrastructure maintenance, potentially hindering innovation?\n\nIdeally, DevOps should be a philosophy, but that ship has sailed so far long now, it's kinda sad. There's no need that DevOps should focus on existing infra maintenance - the focus should be about breaking barriers and improving performance of teams by removing bottlenecks. \n\n> To navigate the next decade DevOps or operational roles , what skillsets do you consider essential?\n\nAs mentioned earlier, a decade is a long time in tech. I'd consider debugging/problem solving and trying to understand the business problem that a tech solution aims to fix as some of the essential skillsets for good DevOps/SRE",
            "> Hey I want to know about a trade desk job. Does it involve software engineering knowledge or mathematical/statistics knowledge? What do you find more exciting software engineering or data science?\n\nThe Trade Desk is a platform for media buying and real-time advertisements, and I help maintain the cloud infrastructure. I've never tried data science, and my interest always has been SRE",
            "I don't think you can have a roadmap for that long. When I started working, roadmaps were not a thing :) neither were DevOps, Cloud, LLM etc. Technology changes way too fast and you'll need to be on your toes to keep up with the changes and adapt accordingly.",
            "namaskaara dhani, yedde ulleru! Eerna visesha?",
            "Australia is pretty heavy into data engineering. That said, Australia doesn't value/consider IT as a priority occupation at the moment.",
            "Hi there, thank you for your kind words. Best wishes to you too!",
            "Oh man, I don't know if I have any. Today's fresh grads are so much smarter and have more opportunties than what we had. \n\nMy suggestion would be try to make the best of the possibilities and opportunities you have. Talk to people, make the best of different meetups, clubs, hackathons etc that are available. Try to get to know more people - as mentioned earlier, a lot of my openings were via connections, so don't burn bridges, you never know when they will help you out.",
            "> but hop from one interest to another \n\nMy suggest is to find a niche and stick to it. Keep building stuff. [Cloud Resume Challenge](https://cloudresumechallenge.dev/docs/the-challenge/) is an excellent project to build up your CV. Ignore the part about certification, do everything end to end. \n\n> I don't even know what to answer if an interviewer asks me to introduce myself.\n\nWell, you can say what you said - you were trying out different things and finally stuck to x because of y reasons. You should look at convincing the interviewer why they must remember you and what you can do instead of the other candidates. It's not easy, I know. \n\n>  So I request you to not sugarcoat and tell me about my situation and how to move forward to get a job.\n\nThe situation's not good but it's not the end of the world. It'll be hard but you can imrpove it.",
            "I think we're far from a semiconductor industry boom. There's too much going against us in terms of available resources, power etc. Given your tech stack, keep learning and improving - courses like [NAND 2 Tetris](https://www.nand2tetris.org/) might be a good thing to dip into, to see if you'd like it.",
            "Good to see you! Was a good ride!",
            "It is available for anyone to purchase - https://taimos.gumroad.com/l/cdkbook",
            "> Is there any topic in those fields worth researching, so that I can have an awesome research paper.\n\nSecurity, Bin Packing, Resource optimization, Cost Optimization might be good areas to look at. My work involves a lot of these broad fields",
            "> I want to ask that what are the qualitites or things I can develop that will eventually make me the \"good software engineer\" that the companies are looking for? I'm willing to put in the work to achieve that...\n\nI see a lot of software engineers with a lack of attention to detail. Any time I get a resume to review, I see so many that have been put together haphazardly - spelling mistakes, inconsistencies (for example - JavaScript, JS, javascript, Javascript all in a one-pager). What's the big deal about these? The thought process goes - if they can't get these things right, how will they build and maintain a complicated piece of software? \n\nSo yeah - good software engineers will have good attention to detail - repos with decent docs, if you're sending a repo over, ensure there's steps so that I can get it running in less than few minutes. This one aside curiosity, humbleness, eager to learn stuff all goes a long way in being a good software engineer. And a lot of these traits will appear during interviews.",
            "Not my AMA so sorry for butting in.\nYou should read the \"Why learn computer science\" section here https://teachyourselfcs.com/.",
            "Life's good, thanks for asking. What makes you believe I'm not on personal time :) Went out, picked up some books from the library, currently playing codenames with friends as I type this :)\n\nAs for why spend time on Saturday - I cleared out time for this as I wasn't occupied with anything else and the mods asked if I could do it, so I was happy to",
            "Try to get an internal transfer to the relevant teams. If that is not an option, take a look at [Cloud Resume Challenge](https://cloudresumechallenge.dev/docs/the-challenge/), or look at building an app in the Cloud, complete with automated build/releases. Bootcamps might be superficial. Certifications and courses might be a good guided path if it's difficult to forge your own.",
            "I see freshers being hired all the time - so I'd say definitely.",
            "Should be a good mix of both - look up T- or V-shaped skills - essentially a broad knowledge of many skills and deep focus on one or a few of them. Makes it easier to jump across roles as well",
            "Not sure how companies would do the SRE interviews to be honest - I expect a lot more emphasis on system design and debugging than pro DSA> You'll be expected to have decent skills in a scripting language at least. \n\n> Also how stressful and demanding is this job?\n\ndepends on what actually the role demands. I've seen SRE/DevOps to be the kitchen sink role, helpdesk role where you do everything, and i've also seen the roles to be similar to how Google considers the SRE role. \n\nDepending on these factors, as well as the expected SLAs, it can be quite challenging or fairly easy going.",
            "Depends on the company - I think we'd see lesser of it on the services side. For large product companies, it depends on how much your management and leadership intends to retain you - if you've proven your worth and they want to retain you, they should be able to make it happen. But yes, it's not happening as much as it used to. And one of the reasons is that there's a pretty heavy anti-immigration bias happening now in other countries.\n\nThere's no silver bullet to find a job abroad - either ask for an internal transfer, or search for roles which suggest visa sponsorship, and apply there.",
            "> I have learnt coding but I am not a developer , so every time a company asks me to write any logic related to python and I fail. If you are still answering pls let me know how I can close this gap.\n\nThere's no substitute for experience, or practice. Since you're not getting much experience, I would recommend building some projects so that you're aware of the problems that might occur. It's still not quite equivalent to real world experience, but helps show that you're working towards it.",
            "I don't think I can answer this in any way.",
            "I will be messaging you in 5 days on [**2024-06-27 08:54:43 UTC**](http://www.wolframalpha.com/input/?i=2024-06-27%2008:54:43%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/developersIndia/comments/1dlpooi/hi_im_sathyajith_bhat_staff_software_engineer_ama/l9qms07/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FdevelopersIndia%2Fcomments%2F1dlpooi%2Fhi_im_sathyajith_bhat_staff_software_engineer_ama%2Fl9qms07%2F%5D%0A%0ARemindMe%21%202024-06-27%2008%3A54%3A43%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201dlpooi)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
            "Thanks for the reply.",
            "Yes I think the rough outline thing could be a great idea, since I always seem to focus on writing something good in the first itself which obviously isn't feasible. \n\nI got a domain and built a static site with Astro to get started, I guess starting off with a rough outline would be a pretty good idea, thank you!!",
            "What I find hard is to get started, getting a static website up where we can write, so that we can focus on writing tbh",
            "Thank you for ur response . \nIam upskilling myself and hoping to get an entry- level job 😅",
            "During your 20s?",
            "The op prolly meant to ask how did you move out of India(to Europe and then Australia)",
            "Oh great, what about Europe, generally asking how did you manage to get outside india offers, does this comes after a particular experience, or network or by  simply applying.i am really interested to know about this",
            "Was that buddy shantanu unkill?",
            "[removed]",
            "Can you please let me connect with them?",
            "Thanks! Also please share your views on can I compete monetarily with MBA folks if I stay in tech without doing an MBA? Are MBA folks more valuable after years of experience and tech people loose their lustre as they progress? \n\nPlease share from your personal experiences. Thanks!",
            "Ah ok, understood. I am interested in the C++ and Python languages and AWS as a whole.  I have done a bit of NAND 2 Tetris as part of a college project for Computer Architecture subject ... brought back some fond memories :,)\n\nI'll continue to upskill and make more personal projects in those...thanks much for taking time to reply !",
            "I know, but it's way too expensive and the creators don't respond on Twitter for PPP. I tried asking it to you on Discord but you never sent it to me...",
            "Thank you so much for your response! I'll take this point into consideration from now onwards.",
            "no worries mate, not my exclusive space here :) open for eeveryone and thanks for adding the link",
            "Thanks regardless!",
            "So if I'm currently in big data technology, can you tell me what should I know?",
            "Thank you for the answer.",
            "You’re welcome",
            "I would still say stick to the premade ready to blog sites like hashnode. Very easy to get into choice paralysis (which theme, which CSS framework, what should the tag structure be like etc)",
            "> getting a static website up where we can write\n\nHashNode, Dev.To, WordPress, Substack - all good places to get started. Just write. Destinations can be changed later. Make the habit.",
            "I wish you the best!",
            "Late 20's.",
            "My bad. I have commented below - essentially it was an internal transfer, and the move to Australia was a referral from a friend.",
            "My bad. India to Europe was an internal transfer. I made a case with my manager on why they should move me to Europe, and what they will get from that (citations on why my productivity would be better etc). That helped.\n\n> generally asking how did you manage to get outside india offers, does this comes after a particular experience, or network or by simply applying.i am really interested to know about this\n\nIn general - experience helps. People are very reluctant to get a person who's hardly got any experience as they aren't sure how the person would cope up with not just the technical requirements, but also the mental and psychological aspects of a relocation. \n\nNetworking also helps - as I mentioned, it was my network that helped with the lead.",
            "The one and only",
            "[deleted]",
            "Sadly they're not on Reddit or social media in general.",
            "I haven't done a MBA, can't comment on whether it's good or not. FWIW, in good product companies, good engineers can get pretty good salaries and startups are more likely to favour hands on engineers for engineering.\n\nIf it's product , strategy or people management then MBA might be a good idea.",
            "Nice! Sorry I couldn't help much and best wishes!",
            "Why ask your personal query here ...AMAs are to entice responses that help everyone",
            "You're welcome.",
            "I have no idea about big data",
            "Thanks a lot for this insight, it was actually very helpful.",
            "thanks :)",
            "You're welcome"
        ]
    },
    "Entry level job interview became a Nightmare for a fresher": {
        "title": "Entry level job interview became a Nightmare for a fresher",
        "score": 220,
        "url": "https://www.reddit.com/r/developersIndia/comments/1dlkvfd/entry_level_job_interview_became_a_nightmare_for/",
        "content": "So I had a really bad interview experience... it was a walk-in interview and other candidates were there too. They were coming out in like 10 minutes and said they got asked easy stuff about their core skills and tech stack or whatever was on their resume. So I thought, 'Cool, this will be easy.'\n\nBut when it was my turn, there were two guys, and one asked for my resume. I accidentally handed him two because I panicked, and he said, 'Did I ask for two?' It was so rude, and from then on he seemed annoyed. I could tell from his face that I was in trouble.\n\nThis guy asked me WAY TOO MUCH in detail... too many niche topics. I'd say out of 30 questions I knew like 22. Then he made me solve three LeetCode medium questions on paper. I solved them because I knew those as I had already solved them before. But then he told me to write a whole machine learning code from preprocessing, to make a model and plot a graph - really deep stuff, ALL ON PAPER. I messed up there because he only gave me like 5-10 minutes for something that would've taken at least 20 or more.\n\nHe asked so much that I was like, 'Is this Google?' It didn't feel like an entry-level interview. While I was writing code, these guys were saying stuff to each other like, 'He doesn't know what he's doing' and 'It's wrong.' I admit I'm new to machine learning and I messed up a few syntaxes because Python is not great, and it was hard to focus on writing code when they were constantly criticizing. I don't know why they were only upset with me.\n\nAfter 40 minutes, they told me to wait for the HR round. In the HR round, the HR person was just talking and asking others questions, but in mine, the annoyed guy came and teamed up with HR to lecture me about small stuff that doesn't even matter.\n\nThis was my first ever tech interview and I'm really discouraged. They also asked a lot of stuff like 'How is this your first interview? Your college doesn't have placements?' I'm from a tier 3 college and you know how bad the market is. The only companies that came to my college were some digital marketing and no tech-related ones, so I never got a chance to interview before. Off-campus, it's really hard to stand out from the crowd.\n\nWhatever it was, it showed me I need to work on myself a lot, but I'm kind of sad because this company was my top priority and I messed up. It will be hard to get an opportunity like this because as a fresher it's hard to even get shortlisted. But at least now I know how much I fumble under stress and panic and have to work on that a lot",
        "num_comments": 66,
        "comments": [
            ">Namaste!\nThanks for submitting to r/developersIndia. Make sure to follow the Community [Code of Conduct](https://developersindia.in/code-of-conduct/) and [rules](https://www.reddit.com/r/developersIndia/about/rules) while participating in this thread.\n    \n## Recent Announcements\n\n- **[Call for Wiki Proposals: Share your learnings with the developersIndia Community!](https://www.reddit.com/r/developersIndia/comments/1dbrmc2/call_for_volunteers_help_us_build_rdevelopersindia/)**\n- **[Call For Volunteers: Help us build r/developersIndia](https://www.reddit.com/r/developersIndia/comments/1dbrmc2/call_for_volunteers_help_us_build_rdevelopersindia/)**\n\n### [Join Sathyajith Bhat, Author, AWS Container Hero & Staff Engineer at The Trade Desk for an AMA on Cloud, SRE, DevOps, Technical Writing & much more! - June 22nd, 12:00 PM IST!](https://www.reddit.com/r/developersIndia/comments/1dgchur/join_sathyajith_bhat_author_aws_container_hero/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/developersIndia) if you have any questions or concerns.*",
            "Name and Shame.\n\nAlso you did realllly good bro, solving 3 medium on paper and under pressure is not easy even for experienced folks, go checkout r/leetcode.\n\nI also had a interview yesterday, two technical rounds, beforehand the recruiter told me that it will be a HR round so I just went there as is, first guy asked questions about mongoDB (a lot, couldn't answer), clustering in nodeJS, async code, priority of queues in event loop, implement a simple sort algo, SQL join queries etc. \n\nSecond one asked me to build a fully functional todo list (without styling) in under 10 min, using react. Fetch data from api and display on screen. Ended up accepting the offer but it's brutal, 30k with a 9-7 and 2 and a half hour commute both ways.\n\nBut as a 24 grad, with over 200 unresponsive applies, it's still better then sitting at home all day.\n\nKeep at it man, freshers are getting fucked in the ass right now.",
            "Lmao, I never faced such interviews. (2YOE)\nIt sounds really bad dude.\n\nI would hope you find a job quickly and don’t get discouraged, it is not a standard interview thing.\n\nAlso, can you please name the company?",
            "bruh, bad luck\n\nI've given 4-5 interviews, and it was never this bad, the interviewer was always very supportive, and you answered a lot of questions, seems like the company is sh\\*t.",
            "Nope,this is not how fresher interviews are conducted in most companies IMO.",
            "> But then he told me to write a whole machine learning code from preprocessing, to make a model and plot a graph - really deep stuff, ALL ON PAPER.\n\nNow I'm really interested about what happened here. \n\nI ain't doing shit without intellisense. They can fuck right off.",
            "Never carrying more than a single sheet of paper for interviews from now on",
            "Is your resume really over the top? Maybe they didn't like that",
            "from what i went through in some interviews, they usually already have a candidate in mind and would do stuff like this to reject everyone else. tbh you should consider yourself pretty good if they had to go all this extra mile to reject you. (same happened to me in a well known refinancing company)",
            "Everyday, when I search for jobs, I thank god that I graduated in 2021 with a job. Because, the level of persistence you guys are showing is something which I couldn't have. You guys are really on another level. Good luck with your journey!",
            "If you would have got selected how much CTC were they offering???",
            "Name and Shame.\n\nOr just DM me the name of the company",
            "I think this might helps. \n\nRemember, the person interviewing you was once in your shoes, possibly failing many times before landing their job. The key is to keep improving yourself. Success will come; you only need to succeed in one interview. \n\nAll the best mate.",
            "Ok thats super messed up man",
            "Lol you're lucky you didn't get to work there. That Lil bro(interviewer) is having validation issues and trying to take it out on freshers. Btw you did very good though.",
            "College Campus Interviews suck , luck factor matters there. I remember I gave an interview where I had the highest score in coding and aptitude but I got disqualified in the Group Discussion round even though I gave it really well.\n\nDon't take it seriously, the outcome doesn't reflect your worth. It's somewhat a gamble you hope things work in your favour.",
            "What were they offering??\nCTC?",
            "Seeking advice : Please help\n\nI have a BCA degree and am currently working at an early-stage startup with very low pay. I primarily work as a Node.js engineer and also have some experience with Android development (Kotlin and KMP). However, I am concerned about whether I am on the right career path because it seems like Node.js is losing popularity. Should I start learning additional skills? If so, which ones would you recommend? I am also working on improving my data structures and algorithms (DSA) skills, but I'm not yet an expert",
            "you just got handed bad cards buddy, don't get discouraged such shit happens all the time. it's not common at all. you'll get a good job soon don't fret too much about it",
            "Name and shams bro",
            "Terrible people",
            "Remember this, always kisten to chad songs before interview, stay in tune like if you dont offer me a job no worries thwre are tons of other companies out, the worst they can do is blscklist you from joining in future",
            "What position did you give the interview for?",
            "I haven't had to face such a terrible experience, considering, I could not even answer the questions correctly. \n\nI think, the person interviewing is just an asshole who was probably jealous of you, since you were answering almost 75% questions correctly.",
            "This shows how they'll be treating their employees when they join. Ignore these types of companies at all levels.",
            "!remind me 1hour",
            "Did they reject you directly on face??. What all did you explain on your resume??",
            "Take this as an experience from your 1st interview it's common .don't be discouraged and learn from the failure.",
            "bruh, 30k? which city?",
            "Damn dude nice! Same here but bca grad having hard times in finding jobs where do u applied for that tho?!",
            "Was it on campus or off campus?",
            "Firsy off kudos to you for taking this experience in a positive way and thinking about getting better. Trust, me this attitude will take you places\n\nSecondly whoever took your interview was super unprofessional and its good you didnt get through because it speaks volumes about a company's culture if employees think it is ok to get pissed at a fresher. I personally have haf very tough interviews but never had to face them getting pissed/taunting. So id say good riddance .",
            "[deleted]",
            "One of my friend asked to write a linear regression model using python on paper from importing data to prediction",
            "Such a common mistake among freshers man, I was giving interviews myself until quite recently and I saw so many people with 2 page resumes. Like bro I know you don't know shit about half the things you've listed on there.",
            "node job are only in startup",
            "I will be messaging you in 1 hour on [**2024-06-22 14:31:31 UTC**](http://www.wolframalpha.com/input/?i=2024-06-22%2014:31:31%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/developersIndia/comments/1dlkvfd/entry_level_job_interview_became_a_nightmare_for/l9re3uh/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FdevelopersIndia%2Fcomments%2F1dlkvfd%2Fentry_level_job_interview_became_a_nightmare_for%2Fl9re3uh%2F%5D%0A%0ARemindMe%21%202024-06-22%2014%3A31%3A31%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201dlkvfd)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
            "My guess is that they rejected OP well before that, just tried to release there stress from previous candidate on him.",
            "I think they rejected him at  \"did i ask you for two?\"",
            "In what world is this common, I've heard about sales interviews that weren't this brutal.",
            "Gurugram",
            "Dude. 10k in Noida. 1.5 hours of Commute on both ways. Trainee. Life is hell here",
            "Nowhere, a recruiter reached out to me, I thought it was a scam so I even made a post on this sub and asked my brother as he is more experienced than me, and he suggested to go and if money is involved then just walk out, so I went there and surprisingly it wasn't.",
            "Off campus",
            "It's sarcasm.... \"What the fuck is this... Google?\"",
            "What the fuck are yoo talking about G?",
            "They just wanted to reject other candidates that's all",
            "But its not actually very hard if u put ML projects or experience in resume.\n\nAll these things can be done like sklearn.linear_model.LinearRegression etc. Its very basic especially in ML side.",
            "Wasn't  2 pages , he handed 2 .",
            "Which framework should i learn? Spring Boot, go? I'm really confused please help me out.",
            "Which is also a weird thing to say, most people would just smile and give one back and then there this jackass acting like a dicktator. I asked the interviewer \"Should I take this back\" while I was interviewing, cause they were switching rooms, and he just smiled and said \"No, I will be needing that for now\".",
            "Panic and tension is common in the first interview .most of them faced it and you saying it's not ?? Becoz you didn't faced it doesn't mean no one will face .",
            "damn, 2025 grad here, left my previous internship cause it was very monotonous work. they were paying 25k. you can do better. keep searching and upskilling.",
            "Add heat of the summer in that as well",
            "That's nice, applied through naukari or indeed?",
            "Can i dm you?",
            "Oh! I miss understood. But ismai itne downvote dene wali konsi baat thi. 😅",
            "What happened bro. Aisa kya boldiya mene jo tum sab itna bhadak gaye ?",
            "I know, and my comment was not related to the post itself. What I meant is that many times these \"over the top\" resumes consist of people listing all sorts of things in their resume, even those they haven't worked with.\nAnd listing too many things ends up making their resumes longer.",
            "I didn't mean the tension, everyone has that, but I haven't heard of any interviewer being this level of ass hat who is so sad with his life. It can happen and I am not denying it but it's definitely not common.",
            "I am upskilling, thankfully my parents are not asking for any money from me , so I will be able to save a lot and study on side, I checked the PG cost there and it's above 9k every month, which kind of defeats the purposes, cause I can commute in 5K per month from home to office and will get healthy food.\n\nAlso like, what's your tech stack and college, cause I am from a tier 3-4 which played a big role.",
            "Did apply atleast 200 applications, but I guess the recruiter found me through LinkedIn, I didn't apply to that company",
            "Tbh i know logically that makes sense,  but when I look at job descriptions of these companies,  I feel even to increase their chances of getting interview call they don't have much option other than throwing all in.\n\nInclude all this ATS fiasco in it too.\n\nI COULD BE COMPLETELY WORNG.\n\nEdit: not talking about longer resumes rather about inflated skills mentioned .",
            "it's tier 3 only, I started there at 8k p.m then 12k then 25k. I worked there for 9 months.\n\nalso, what's the reason for the downvotes?\n\nedit: tech stack was mainly NextJs, Few CSS libraries, RTK, etc (FrontEnd mostly)",
            "Which company did you intern in, I've never heard of salary hike in intern position, 2 times at that.",
            "it was a startup, the second hike was already mentioned in the offer letter. 3rd was When they wanted me to extend the internship, I told them that I had a better offer with a better stipend (there was no offer). \n\ndidn't get the full-time offer though."
        ]
    },
    "Focus on system design devs, learnt it the hard way.": {
        "title": "Focus on system design devs, learnt it the hard way.",
        "score": 122,
        "url": "https://www.reddit.com/r/developersIndia/comments/1dln8n7/focus_on_system_design_devs_learnt_it_the_hard_way/",
        "content": "I would suggest to allocate an hour of your time every day to learn design patterns and OOPs concepts in any object oriented language of your choice.\nI interviewed with a startup they wanted a senior MTS position, aced the DSA round, they wanted a LLD and HLD round. HLD was able to clear since I have experience in my past. \nBut LLD is a different ball game. I knew the approach to get to the solution but was not able to handle edge cases, adding new features without changing the base class etc. you need to know design patterns, SOLID principles etc.",
        "num_comments": 49,
        "comments": [
            ">Namaste!\nThanks for submitting to r/developersIndia. Make sure to follow the Community [Code of Conduct](https://developersindia.in/code-of-conduct/) and [rules](https://www.reddit.com/r/developersIndia/about/rules) while participating in this thread.\n    \n## Recent Announcements\n\n- **[Call for Wiki Proposals: Share your learnings with the developersIndia Community!](https://www.reddit.com/r/developersIndia/comments/1dbrmc2/call_for_volunteers_help_us_build_rdevelopersindia/)**\n- **[Call For Volunteers: Help us build r/developersIndia](https://www.reddit.com/r/developersIndia/comments/1dbrmc2/call_for_volunteers_help_us_build_rdevelopersindia/)**\n\n### [Join Sathyajith Bhat, Author, AWS Container Hero & Staff Engineer at The Trade Desk for an AMA on Cloud, SRE, DevOps, Technical Writing & much more! - June 22nd, 12:00 PM IST!](https://www.reddit.com/r/developersIndia/comments/1dgchur/join_sathyajith_bhat_author_aws_container_hero/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/developersIndia) if you have any questions or concerns.*",
            "As someone who has conducted like 10 system design rounds in the last 2 weeks, I can say that most candidates won't even get past the HLD gateway. And those who do, seem to have passed because they mugged up a lot of system design interviews from YouTube. \n\nI literally interviewed someone last week who didn't know the basics of auth or the difference between http and https, but somehow started talking about reverse proxies, load balancers and db sharding during the HLD. Tech interviews are such a scam. All that seems to matter is whether you practiced for the questions that appeared in the interview.\n\nAny non standard question I used to ask generally lead to awkward loops for the candidates and a waste of my time. So now even I have started asking standard questions with minor twists and evaluating approaches rather than output.",
            "Well am I fucked if I don't know what LLD and HLD is?",
            "What were the problems given to you in LLD and HLD?",
            "how design patterns involved in LLD HLD , isn't SOLID all about how to write code ?",
            "Any good book or YouTube channel recommendations?",
            "I'm learning LLD  because I heard they have LLD round for freshers also. I have 4 months of experience. Am I doing right?",
            "Where to learn all these design patterns?",
            "Not just Dev. I think system design common in Ops jobs as well.",
            "I will be joining as a software developer soon in a company. This will be my first job so do I need to know lld/hld? Do they expect a fresher to know and work on all these things? if yes can you provide some good resources. Currently doing webd which will most probably be the tech stack on which I will be working on.",
            "Is it important for the freshies too ...iam going in fourth year , from where I learn this?",
            "they've started asking hld, lld and dsa to freshers too now... There were reports of dsa hard getting asked in infosys and other service based companies\n\nTech roles interviews are just a game of elimination with a pinch of interviewers making sure that interviewee questions his whole career choice (4 year degree sometimes a master too)\n\nI mean why even allow freshers to enter the interview if you want such depth, freshers doing projects in any domain will take you soo far and if domain is ml/ai the theory of that is like a ocean\n\nThis will bite companies in the back... This shit makes sure those who want to get into tech ignore the basics and mug up high level code patterns and theory... Lot of coding can be done using chat gpt... Where it fails is in combining different stuff together like docker, scripts, database and deploying them somewhere and making sure it scales on swarm etc\n\nI'm pretty sure those who work at a senior position in tech will notice bad coders getting hired due to this.... Bad as in don't know very basic stuff like bash scripts but has aced every interview anyway",
            "Everyone says \nBasics and foundation should be strong.\nWhat actually means this?\n\nWhat concepts and things I must know",
            "Any book or YouTube recommendations fo learning whole concept.",
            "Could you recommend how we can remove this flaw from our learning? Should we change our approach? Learning the concepts by actually implementing them ?",
            "Low level Design and High Level Design.",
            "Depends on experience, if <2 years then it should be fine",
            "No because you can start learning today lmao.",
            "LLD: design parking lot\nHLD: scaling to a million customers on AWS, this was a data engineer role so",
            "You write code to deal with a certain use-case in the most optimal way. SOLID helps with that.  \n\nWhen the use-case is very common, there is a well established way to write it which is considered optimal for that use case. These become patterns.\n\nSo both are not orthogonal.",
            "Nope but if you are free enough start learning",
            "Not entirely necessary. Depends on the role of the job. But you can learn out of your own interest.\n\nDon't get stressed if you don't know any particular concept. You are just starting out, you will see a lot of terms get thrown around. Don't get scared if you don't know them. There's always time to learn them.",
            "Not a good approach to be in tech, fresher is a tag, no one is stopping you from learning things, internet is mainstream now. Gone are those days when you say, I'll join first and then figure out. Companies don't want to spend time and resources for someone to take 3-4 months to start working, they have hundreds of people waiting in line to replace you. Indian market is competitive and there is no other way around. The sooner you accept it, the better.",
            "Google/youtube your questions , you’ll find your answers at the top",
            "\"Designing data intensive application\" book covers all the basics/fundamentals of system design.",
            "Prepare for working better, than preparing for interviews. If you could read a book, blog or learn something new that will make you 10% better at what you do already, just keep doing that.",
            "> Low level Design and High Level Design\n\n\nChad🗿",
            "2.5?",
            "Could you also emphasis on the edge cases if possible?",
            "Does Data engineers need to prepare system design the same way as backend roles or is it different. I just want to know how to prepare for system design rounds as a data engineer",
            "Is LLD asked from freshers with zero years of experience as well ?",
            "Hello Bhaiya! I'm also aiming for an entry-level Data Engineer role. Currently I am interning as a developer. And have 3 months of API building experience in Flask.\n\nMy skills => Python, Flask, Django, Celery, JavaScript, Vue.js, Java, SQL, NoSQL, Bash, Pandas, Scikit-learn, PyTorch, TensorFlow, 200 LeetCode Qs and a bronze in a Kaggle competition.\n\nI've 3-4 months left before I become unemployed . What should I learn now? A good Data Engineering project? I've done basic analysis project using Kafka & AWS. Also, are Azure or AWS Data Engineering certificates a must?\n\nPlz reply 🙏",
            "So is it something that can be known by experience only , any other means ?... Or is it relevant to known without any much experience",
            "I want a comprehensive list of things which every sde should know.",
            "DDIA is a very good book. However if you are new to system design or distributed systems, it could be a little overwhelming",
            "2.5 > 2 ?  \"It should be fine\" : \"It shouldn't be fine\" ;",
            "Idts",
            "extremely rare. and infact should not been asked to freshers at all. how can you expect noobs be able to build scalable stuff? ",
            "Market is tough for data specific roles, I would suggest get into an analyst role, get some experience, during that time, build projects, develop your skills and then shift to a DE role. Unless you are going to a consulting firm, nobody gives a fuck about these certs, waste of money and time according to me.",
            "Not like that. One should not expect a fresher to be quite proficient in system design. You can learn that with experience.\n\nBut there's so many resources out there where you can learn it and have some idea of it. Cannot be an expert with just watching videos and reading blogs. So companies expecting freshers to be good at it is simply stupid.",
            "Go to roadmap.sh and look at the 3 roadmaps that i mentioned below.\n\n1. System Design\n2. Computer Science\n3. Design and architecture \n\nYou can also look at other ones on that website.",
            ">2.5 > 2 ? \"It should be fine\" : \"It shouldn't be fine\" ;\n\nwait, how does this equation works?  \nif we replace 2.5 with 3 , then 3>2 ?  means true,  \ntrue means \"It should be fine\" ????",
            "Is this the Elven language?",
            "Mujhe kya pata, mai to Developer hu, vo  Testing waale ko bolo usne ye bug pe dhyaan nahi diya",
            "Idts",
            "It means \"I don't think so\"",
            "Abhi manager ko bolke usko fire karwata hu 😤"
        ]
    },
    "Recent graduate starting out as a software engineer. ": {
        "title": "Recent graduate starting out as a software engineer. ",
        "score": 122,
        "url": "https://www.reddit.com/r/developersIndia/comments/1dln3pq/recent_graduate_starting_out_as_a_software/",
        "content": "I am a recent graduate from a tier 2 college (one of the Top NITs) recently I joined an Organization as a software engineer. The job is good and the company is legit as well but the salary is quite low (<=35k) I can manage my expenses however my savings aren't much. I am currently 23 and half. I was just wondering what are my options in the future moving forward. I know future is quite unpredictable but still I just want to know what are the possibilities so I don't end up wandering after maybe 1.5 - 2 yrs. I am in a doubt that should I continue grinding myself in the software field or look for other options maybe 2yrs down the line. Had given 15+ interviews more than 25 technical rounds majority of the interviews went decent and I was rejected in the hr round 6-7 times. Also once a really good offer was revoked (not Atlassian). First I thought I wasn't good enough or I had some serious flaws but being honest I am not someone arrogant or mean a person and I try my best to be in a professional behavior whenever I give any interview. Just seems like the job market in this industry is so fucking unpredictable and unstable not sure about what should I do as I am the only earning member in my family, though my family is self sufficient and as of now I don't have a financial burden but sooner or later I have to look after my parents. If you guys have any advice then please comment it will help me make a sound decision. \n\nEdit: Sorry guys it's a tier 2 college however that's not important as it's in the past. Looking forward I just want some advice regarding mycareer thanks.",
        "num_comments": 52,
        "comments": [
            ">Namaste!\nThanks for submitting to r/developersIndia. Make sure to follow the Community [Code of Conduct](https://developersindia.in/code-of-conduct/) and [rules](https://www.reddit.com/r/developersIndia/about/rules) while participating in this thread.\n    \n## Recent Announcements\n\n- **[Call for Wiki Proposals: Share your learnings with the developersIndia Community!](https://www.reddit.com/r/developersIndia/comments/1dbrmc2/call_for_volunteers_help_us_build_rdevelopersindia/)**\n- **[Call For Volunteers: Help us build r/developersIndia](https://www.reddit.com/r/developersIndia/comments/1dbrmc2/call_for_volunteers_help_us_build_rdevelopersindia/)**\n\n### [Join Sathyajith Bhat, Author, AWS Container Hero & Staff Engineer at The Trade Desk for an AMA on Cloud, SRE, DevOps, Technical Writing & much more! - June 22nd, 12:00 PM IST!](https://www.reddit.com/r/developersIndia/comments/1dgchur/join_sathyajith_bhat_author_aws_container_hero/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/developersIndia) if you have any questions or concerns.*",
            "I am amazed at how abruptly, randomly and frequently college tiers have started popping up. We need like a standard definition for college tiers.\n\nThe other day I read someone mentioning about a tier-7 college! WTF is that supposed to mean???\n\nAnd since when NITs started being categorised as tier-1.5???",
            "tier 1.5 🫡",
            "Keep at it man. You are in a job and gaining experience everyday. You are already in a better position than many.\n\nJust remember to dedicate some time to strengthening your knowledge and skills. Salary will increase when you make your first switch a couple of years down the line.",
            "Top nit is tier 2 wtf?!",
            "Well congrats getting a job itself is tough for freshers. So try to gain some experience from your work do not shy away from responsibility and keep up scaling hopefully market will gain pace once usa elections are over. Try to make switch around 1 year or so. Prompt engineering is something you can learn. Don't dwell 8n machine learning and AI. I have seen many claiming they know but they are shit because it is still difficult and needs some time to gain expertise.",
            "Which branch are you from? Because idt colleges matter after a certain pt. of time… but even if they do, then the branch matters as well",
            "What is your tech stack?",
            "Hi, I'm also a fresher and am struggling in switching roles. But I'd suggest that you keep on trying. And honing your skills. You might get an increment as well a year later. In the mean time, keep applying. \n\nAsk for referral if you can. It will help you land another job more easily, I've heard.",
            "market is brutal bro, optimise your naukri profile first",
            "[deleted]",
            "Do not move away from Tech. That would be my first advice.\n\nWhat is your tech stack?\n\nAs you spend time in your job, focus on building non technical skills like communication (spoken and written, including presentation skills), stakeholder management. People should feel good working with you, appreciate you beyond your technical skills as well. Build connections with people working in other teams in your company, not just your project or team. \n\nKeep in touch with people from your company who switch to another company with a good hike (wink wink!). Referrals can be really helpful when you try to switch.\n\nIf you think of higher studies, DO NOT go for an MBA, it will be sub-optimal for you, unless you stop liking coding and software altogether, and want to get away from it. For higher studies, you can think of Computer Science, Data Science/Machine Learning, Operations Research.\n\nIn your current job, try to get an understanding of product management, user experience, how business value is created using tech.",
            "Nowadays, many people are pursuing software jobs, which makes the field highly competitive. To set yourself apart, it's crucial to focus on solving significant problems rather than blending in as another engineer. Assuming your passion for software development, I believe three key factors are essential: marketing yourself effectively, networking to build relationships, and developing a unique skillset.\n\n1. **Marketing**: Create and maintain a strong portfolio showcasing your projects and contributions to open-source initiatives.\n2. **Networking**: Cultivate strong communication skills to establish connections within the industry.\n3. **Skillset**: Consider pursuing an MS degree abroad, focusing on research and gaining specialized knowledge.\n\nI strongly recommend pursuing an MS abroad as it can open doors to advanced learning opportunities and potentially improve your quality of life. This path will equip you with the expertise needed to tackle complex challenges and stand out in the competitive job market.",
            "Need advice : please help\nI have a BCA degree and am currently working at an early-stage startup with very low pay. I primarily work as a Node.js engineer and also have some experience with Android development (Kotlin and KMP). However, I am concerned about whether I am on the right career path because it seems like Node.js is losing popularity. Should I start learning additional skills? If so, which ones would you recommend? I am also working on improving my data structures and algorithms (DSA) skills, but I'm not yet an expert",
            "Whats this bs about tier 2? I am from tier3 started with amazon.\n\nWhat are your dsa ratings?",
            ">quite low (<=35k)\n\nLmao",
            "Coping mechanism at this point, nothing else. Also, not all NITs are tier-1",
            "Brainwashing by coachings since iits don’t have enough seats anymore and whenever people think if Jee advanced half the kids give up as it isn’t everyone cup of tea to endlessly study for high competition and difficult exam.\n\nSince there won’t be enough admissions in the coaching they kinda even marketing all NITS are good as they require only JEE Mains. \n\nBut the sht has become so hard that even 96 98 people don’t get good colleges so most don’t gaf and waste parents money for no reason.\n\nEven clgs which ain’t that great are kinda of Marketed really well. \n\nInformation chaos all over web and reddit.\n\nGood industry making lot of money. \n\nI think probability of success through education is going really down in India since everyone is trying and preparing for exams.\n\n\nMost of the youth population is just endlessly preparing exams one after one and most failing.\nThere is NO Big reason why S@cide rates are high in India.",
            "Imho anything except for the top 3 institutions (IIT NIT BITS) in India are pretty much the same.",
            "scenario where your college does not fit in to tier 1 bucket and you are unwilling to accept tier 2 classification.",
            "Well not tier 1 but not tier 2 either so 🤷",
            "Yeah I will keep the job exps matters a lot.",
            "As what I have seen college does matters because my friends and colleagues from other pvt colleges have very limited opportunities this year like they had given only 3-4 interview that to some of them are for non tech roles. My branch is ECE so I am figuring out that experience in the industry has much more value for me.",
            "Market is brutal, indian population is also brutal 😁",
            "Kinda discriminatory no? Maybe college holds value when looking for jobs directly after graduation but after someone is already working a job having this kind of condition seems like pretty limited thinking/old school.",
            "Sde2 for 15 lpa is quite low and tier 1 college on top of that.",
            "Thank you for your advice! My tech stack is primarily backend dev (Node js and Django) my company uses django so that's going to be an area I will be working on also you mentioned about MBA so if like after 3-4 yrs in the industry will an MBA help because few of my seniors have chosen that path and they have got good placements afterwards.",
            "why are you not suggesting for an MBA ? I did engineering from NIT/IIT/BITS and then MBA from IIM ( one of BLACKISM). Worked in tech for 3 years. It isn't that bad. Ofcourse MBA should be done from top 15-20 colleges only. Yes one issue is GEMs have it difficult to get into IIM.",
            "Most NIT's are either tier 2 or 3.",
            "IISc , IISERs, NISER, CEBS, CSIR, ISI, CMI , AIIMS\n\nThese are all tier 1 , you don't calculate tier 1 or tier 2 just based on placements x)",
            "unrelated to OP's question but how does post nut clarity affect tier rating? does tier 2 become acceptable or is there a compromise at 1.75?",
            "Probably colleges like DTU NSUT Jadavpur",
            "So it's tier 2",
            "A top NIT would be tier 1.",
            "Let’s drop them down🥸🙋‍♂️🫳",
            "You're right. If you can get into a good MBA college like IIMs, ISB,XLRI... then it is totally worth it. And also nowadays it is not that difficult to get an IIM like it was before.",
            "I studied in a NIT long back. I was in core engineering. I can give you my perspective.\n\nAmong my ECE/CSE batchmates, the ones who have stuck with Tech have achieved better outcomes than the ones who did MBA. Some of the ECE/CSE folk did MS from US universities and I see them working in similar roles in similar companies (FAANG) vis-a-vis the ones who stayed in India, difference obviously is that one set earns in USD while other set earns in INR.\n\nI did MBA from a college that you would know as an IIM and as I look back, it still looks sense for me to have done that - because I was in a low growth, low salary paying core job in a well known company prior to that.\n\nPeople who did CSE/IT from Tier 2/3 colleges and upskilled well while being in Tech have managed to reach similar monetary outcomes as folks from IIMs - I know such cases personally.\n\nSimple way to look at things - Geography+Industry>>Individual. There's nothing much you can do as an individual to overcome the impact of being in a high growth industry or high growth company. So, do not only work hard, also optimise that hard work to be in the right companies. Industry wise, you are already in the right place being in Tech. The job market is increasingly becoming like the stock market I guess!\n\nI would advise you to do some learning around Data Science and Machine Learning as well if you find interest in that field. And it is not only about Python - it is also about understanding the Maths and Stats that work under the hood. Else, DS could have been as easy as importing a package and using it. \n\nIn the overall Data and Analytics space, demand for Data Engineers will be higher in number than Data Analyst/Scientist simply because of the reason that Data Engineers help in building the foundation of a building in which Data Science and Analytics work can be done thereafter.",
            "Btw do you need maths for software engineering or development how much do u need maths I am very bad at maths it will be helpful if you give me your honest suggestion 🤔",
            "Looks like you haven’t seen one in your life.",
            "I think Jadavpur is tier 1 for sure",
            "Top NITs are definitely not Tier 2 lol",
            "Yes sorry, no such thing as 1.5 it's 2 .",
            "Nits with avg package above 18 LPA are tier one as that’s at level of IITS.",
            "It is more difficult to get into old IIMs than before, especially for GEMs.\n\nBaby IIMs are a different story.",
            "Many people might not agree but having a good background in maths helps as maths doesn't teach you only to solve equations but to actually think of a way of figuring things out same with data structures and algorithms. A Software Engineering job  may not have much mathematics implementations (not considering ML roles) but it helps as for OAs aptitude plays a major part.",
            "There are 31 NIT's in India.\n\nTier 1 engineering colleges are top 7 IIT's, IISC, BITS, IIIT-H and top 2 NIT's.\n\nMost NIT's are tier 3 that's just a fact from plain statistics.",
            "Depends on what he considers top lol",
            "I mean we are literally talking about branch then,not college,cuz in top NITS(Trichy, Surathkal, Warangal),only Circuital branches average goes above 18LPA, rest stay below 15LPA,even in Tier 2 and 3 IITs,it's only the Circuital branches that go above 19/20 LPA, talking about tiers is useless if you are talking a lower branch in a supposedly \"Tier 1\" college(exception:Old IITs) just cause people give it a tier for fearmongering amongst candidates",
            "It will always be difficult for GEM but it is better than before with all the new IIMs coming up.",
            "It doesn't matter da i am talking of overall placements.\n\nOther Branches suffer forever because their ain't need of freshers. There is need of a Experienced guy. And with AI coming up freshers ain't much needed but a valuable and experienced guy is needed to manage AI. So freshers kinda of continue to suffer from now even in CS.\n\nSame was in Mechanical Industries people where needed to Build so not only engineers even ITIs and those people did good at time.\n\nNow in this industry also there is turbulent shift in use of AI while face to automate few basic tasks and a manager is all needed to watch over them.\n\nPeople say AI ain't replacing anything it is gonna replace within time. Automation of Manufacturing of cars didn't happen in One day. But it's gonna be fast in case of software there ain't really physical work but alot of Computational Power is needed for these models. So creative jobs are gonna be fked in next 5 to 10 years completely.\n\nNew jobs for making and training AI are going to come-Making them more efficient.\n\nSo freshers will slowly become unfavorable candidates for job and those with actual knowledges and management skills will be Hired.   \n\n\nEven people with research level will earn good at this. Talented people and Skilled people to stay and bootcamp people and sake of doing people will slowing be left behind.",
            "New IIMs and baby IIMs do not give the outcomes that old IIMs do. \n\nNon IIM top tier b schools give better outcomes from placement perspective.",
            "Obviously you can't compare Old IIMs to New IIMs. If you can get a good B-School then MBA is totally worth it.",
            "Depends on the person and the context of his/her situation.\n\nI already replied to the original comment with details observed.\n\nThere are any number of people who have come out with less than expected outcome after MBA, even from IIMs and other top b schools. Unlike a BTech degree from a top college, the outcome in a b school has strong linkage with the profile and CV a person has before joining the IIM."
        ]
    },
    "CS concepts are real deal, not DSA. How do you refresh CS concept fellows?": {
        "title": "CS concepts are real deal, not DSA. How do you refresh CS concept fellows?",
        "score": 89,
        "url": "https://www.reddit.com/r/developersIndia/comments/1dlokt1/cs_concepts_are_real_deal_not_dsa_how_do_you/",
        "content": "I started career as a developer a year ago, and I feel CS concepts like OS, memory leak and networking, etc are more important for daily use than complex and cool DSA we think. Anyone who is good at maths I feel can do DSA.\nOn that note, let's discuss how did you refresh CS concepts?",
        "num_comments": 56,
        "comments": [
            ">Namaste!\nThanks for submitting to r/developersIndia. Make sure to follow the Community [Code of Conduct](https://developersindia.in/code-of-conduct/) and [rules](https://www.reddit.com/r/developersIndia/about/rules) while participating in this thread.\n    \n## Recent Announcements\n\n- **[Call for Wiki Proposals: Share your learnings with the developersIndia Community!](https://www.reddit.com/r/developersIndia/comments/1dbrmc2/call_for_volunteers_help_us_build_rdevelopersindia/)**\n- **[Call For Volunteers: Help us build r/developersIndia](https://www.reddit.com/r/developersIndia/comments/1dbrmc2/call_for_volunteers_help_us_build_rdevelopersindia/)**\n\n### [Join Sathyajith Bhat, Author, AWS Container Hero & Staff Engineer at The Trade Desk for an AMA on Cloud, SRE, DevOps, Technical Writing & much more! - June 22nd, 12:00 PM IST!](https://www.reddit.com/r/developersIndia/comments/1dgchur/join_sathyajith_bhat_author_aws_container_hero/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/developersIndia) if you have any questions or concerns.*",
            "Interview != Job.\n\n\nIf you're competent at learning you can learn in depth stuff on the job and get it done. \n\n\nYou can't invent complex algorithms rooted in math on spot in an interview hence the emphasis on DSA.\n\n\nDSA is essentially JEE for jobs now, it doesn't guarantee you'll do well but without it you're not getting a job imo!",
            "Pickup a textbook and start reading. Or find lecture slides of some really good universities online. I agree DSA knowledge is significantly overrated but that is what companies want",
            "companies can't hire someone who has knowledge but who can't implement . DSA validates the candidate's problem solving and application skills. \nSo DSA is always important for freshers to experienced candidates just as Dev and System design",
            "I thought too, but the Indian job market only knows dsa.\nI have been to a few companies and most of them are not able to grasp the CS concepts (even though this is the exact necessary thing for their software to work properly) and they try to avoid it. \n\nMy team lead / boss etc many haven't even been able to understand these essential concepts, and I have also been rejected from interviews with similar situation.",
            "Gate lectures are best till an certain extent",
            "Someone here said dsa validates a person's problem solving abiity and I've never read anything funnier here 😂",
            "Do you work in Saturday and sunday if yes then just tell hr that you will not be able to continue work as you are sick",
            "Someone graduating from a low tier college, would definitely be applying to startups. And startups doesnt asks for dsa.",
            "I have some really good sources based on CS topics from my college courses along with System Design and DSA. Lemme know if you need em.",
            "importance should be given to  Dsa=dev (web ml/ai with eye upon latest tech tools,sd,os,dbms,networking) and with above real time/world application_ projects ",
            "CS 160 lectures on youtube. Should give you a refresher or even more.",
            "DSA is literally a CS concept",
            "Studying for GATE helped a lot. Once the basics were clear the next thing is how curious you are.\nReading books also helps a lot.\nEngineering blogs are gold mine. Reading them and dissecting every concept and relating it with the core concepts.\nTo get started, watching videos from good youtubers also helps.\nMIT and CMU videos for surface level knowledge.\nAnd nptel videos for indepth knowledge.\n\nThat's pretty much it.",
            "DSA applies for web developers too?",
            "Bruhh DSA is also a real stuff bro.",
            "Building stuff and reading books and articles along the way. That's how I do it. Not a whole lot and I do like learning.\n\n>more important for daily use than complex and cool DSA\n\nTwo years ago I ran into a problem. Coincidentally I was also doing some Leetcode. One of those DSA problems helped. Sure it won't help daily life. Give enough time and you'll run into these.",
            "OS concepts also have DS involved in it?\nSo it's still overlap?",
            ">. Anyone who is good at maths I feel can do DSA\n\nWhat if he isn't? :)",
            "RemindMe! 5 Day",
            "DSA = JEE , Development= College, depending upon your JEE score you will get a good college.. I hope you'll get my analogy",
            "[teachyourselfcs.com](https://teachyourselfcs.com/)",
            "You forgot LLD and HLD.",
            "If I take interviews then I ask basic DSA questions only and then ask some questions from OS and networking etc, not very hard questions but medium ones. Easy way to filter out the imposters and DSA crammers !!\n\nI usually used to take round 1 or 2 only !",
            "Any textbook suggestions for learning core CS concepts mentioned by OP?",
            "Yes please suggest some good books",
            "[deleted]",
            "True u cant hire someone who cant implement only knows pure dsa and fails in dev",
            "No it doesn't lmfao",
            "Wondering how did this come up 😂",
            "Yup share pls",
            "Needed here too , thank you",
            "Yes, please share",
            "I will be messaging you in 5 days on [**2024-06-27 13:01:18 UTC**](http://www.wolframalpha.com/input/?i=2024-06-27%2013:01:18%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/developersIndia/comments/1dlokt1/cs_concepts_are_real_deal_not_dsa_how_do_you/l9ra7a6/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FdevelopersIndia%2Fcomments%2F1dlokt1%2Fcs_concepts_are_real_deal_not_dsa_how_do_you%2Fl9ra7a6%2F%5D%0A%0ARemindMe%21%202024-06-27%2013%3A01%3A18%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201dlokt1)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
            "Nice",
            "True my bad!",
            "what are these?",
            "6 yoe here working in a well known PBC as backend dev. I have never used anything from OS and networking in my career so far.\n\nIf you're interviewing backend devs and the reason for not asking DSA is because it is not used frequently, you shouldn't ask OS / networking as well.\n\nAsk questions like multi threading, internals of SQL and nosql db, give them a scenario which involves using a design pattern and see if they can figure it out, if they're experienced ask them how will they handle the same at large scale, if they can figure out which part of the flow can be done in async fashion using MQs etc.\n\nAsking OS and networking is utterly useless for a backend dev. I'd rather stick to DSA than ask these concepts.",
            "Let's say someone answered all the questions correctly which are required for his/her day to to day tasks but fail in answering some of the ds, networking or os questions, what do you do in this situation?",
            "One way or another they will eventually get into the industry and they make it harder for the folks who are actually good at things",
            "For Computer Networks, Jim Kurose's book is a really good read if you're into it, else just google or follows some slides.\n\nFor OS my professor has really good slides [here](https://github.com/ktk53x/Course_Material/tree/master/CS343%20Lectures)",
            "Not OP but currently reading Computer Systems: A Programmer's Perspective (ISBN: 9780134092669) and it's one hell of a book. Mind to get the US edition tho, with the ISBN I mentioned, not global edition as it's riddled with many errors. It's costly so yeah you should get it by other means.",
            "Here you are again talking about DSA.... ",
            "Low level and High level designing. Basically deciding what becomes public, what becomes private, what should be interface, abstract class, static class etc etc. deciding load balancing, network algos etc",
            "Just to clarify I have 8 yoe and lead a team of 10 in a product based company. Have been working in the current company for last 4 years.\n\n>If you're interviewing backend devs and the reason for not asking DSA is because it is not used frequently, you shouldn't ask OS / networking as well\n\nI did mention I ask DSA but not the extreme hard kind.\n\n>Ask questions like multi threading, internals of SQL and nosql db, give them a scenario which involves using a design pattern and see if they can figure it out, if they're experienced ask them how will they handle the same at large scale, if they can figure out which part of the flow can be done in async fashion using MQs etc.\n\nI generally do this but a bit more easier questions. Here is the full pattern:\n\n1. Simple/Medium DSA\n2. Some theory(OS, Network, DB etc)  from core which is used in daily life or has relation to what we use, Like i will ask whats a mutex then if they have coded in python ask GIL next and see if they correlate the two.\n3. Some LLD - Ask them to design me an abstract car/house etc  api  and walk through the components.\n4. Some questions to check their daily utility skills if they aware of basic skills like using linux command line , database skills on the ones they have listed or we have asked in job profile,  git command etc.\n5. I rarely ask HLD because i am not going to allow any freshers hands on them, when i think they are ready I will start preparing them by giving some tasks related. If they have mentioned it explicitly in resume then I will ask some question to check if it is true or not.\n6. If they are little experience I will ask them some debugging scenario and ask them to walk me through the process they follow in their current work place.\n\nThe company I work generally pays 5-10 L for freshers and the guys I have recruited are very productive and I have low attrition rate in my team. Few guys who have jumped ships have easily made 50-200%  easily when they wanted to after couple of years with my team. I see that my process is working and I am able to filter and select effectively !!",
            "I ask simple/medium ones and I tell them its ok if they don't remember but make them walk through what they are thinking and try to reach there using foundation principles.",
            "Thanks a lot!",
            "Ah okay, thank you!",
            "These questions are fine as they are relevant to the job, I specifically called out for OS and networking. I don't see why a backend dev should be rejected on these questions.\n\n>Few guys who have jumper have easily made 50-200% jump easily when they wanted to after couple of years with my team. I see that my process is working and I am able to filter and select effectively !!\n\nThis is not a relevant metric lol. Once you join a company, what was asked in an interview is not at all relevant. If an employee works hard and grows his skills, he will realise that he can earn more and if he doesn't get a hike that meets his expectations, he'll switch.",
            "what was the compensation offered for those roles?",
            "These metrics were to show that these folks who get selected go out and do well else where also thus the selection process we currently employ is effective and are getting talented folks.",
            ">I specifically called out for OS and networking. I don't see why a backend dev should be rejected on these questions.\n\nI disagree, even though I do not reject on answering just one question wrong but I do value the importance of core computer science knowledge at least on the surface level.",
            "5-10 L I guess , ASE and SE roles",
            "Every class has a topper, they will do well in (almost) any exam.\n\nIf you're looking to hire talented folks, DSA is a very good proxy for that. Have you ever seen anyone who's good at DSA but is a bad dev? I haven't.",
            "Asking something that's not relevant to the job wastes candidates' time for preparation. They already spend so much time preparing for DSA, now you want them to spend time on OS and networking too??",
            "Dude its already taught in college and it is more relevant to job than you think(at least that is what my experience tells me),  other wise we would have just asked people to read DSA and not go through four years of engineering.    \n  \nI think you have very very strong opinion on this and it is pointless to continue further , best wishes !!"
        ]
    }
}