{
    "I feel seen.": {
        "title": "I feel seen.",
        "score": 1235,
        "url": "https://i.redd.it/eah0nlpap08d1.jpeg",
        "content": "",
        "num_comments": 18,
        "comments": [
            "It's fitting to see that it says they're open when they're clearly closed.",
            "I really wanted to see what they have/had for sale...\n\nThey have an Instagram page: https://www.instagram.com/diwhy_store/reel/C8PIXwIv4CP/?hl=en",
            "I'd love a DIY type store near me, just full of random cool shit you can use to make or repair things",
            "High-viz green seems appropriate",
            "Probably sell lots of resin and toliets.",
            "Damnit you got me! That location and shape looks very similar to an old building currently under reconstruction downtown. Haven't been by there in a few weeks, I initially thought it had been finished and painted green 🤣",
            "They're emotionally open.",
            "With the right tool no store is closed!",
            "Damn it, not a bad concept of a store idea… i cannot be sarcastic",
            "That's actually pretty cool, I'd love to have a place like that close to me haha.",
            "Looks like a solid concept to me.",
            "That guy is so cute.",
            "Try thrift shops, scrap, salvage, or 'reuse' shops, if you're looking for 'random cool shit'. \n\nBut like... a modern maker focused hobby shop with new stuff would be tight.",
            "And instant ramen.",
            "My type of business hours.",
            "I'll definitely go when they're *really* open.",
            "I could see myself spending time making things in a place like that."
        ]
    },
    "Someone built a house that looks like the inside of an IKEA store": {
        "title": "Someone built a house that looks like the inside of an IKEA store",
        "score": 8,
        "url": "https://www.reddit.com/gallery/1dlp807",
        "content": "",
        "num_comments": 16,
        "comments": [
            "The ikea where I live have far nicer looking rooms than this. They actually make the rooms look cozy and lived in.",
            "Ikea decor doesn't look anything like that.",
            "Only looks that way because of black shit on the ceiling. Really stupid too, I used to work setting up those exposition, furniture are made to show all accessories, often no room is left to actually use them, witch you wouldn't do in persons home. Furniture on the picture doesn't even look like IKEA, but I might be wrong, different part of the world and been a while since I fitted flat packs.",
            "An $85k home that they built themself? Looks a little weird but it's safe, dry, and what they wanted. Not going to get mad about that.",
            "This is designed like an assets flip PC game lmao",
            "It's like a mobile home built inside a warehouse",
            "You could have linked to the post where it [clearly says](https://www.reddit.com/r/homestead/comments/1dlh5az/the_1500_sqft_3_bedroom_2_bathroom_barndo_thats/) why. \n\nThey built themselves a 2 bedroom 1,500 sq. ft. house for $87,000. They weren't trying to build a mansion. They were building somewhere economical to live in that fits their needs. It may not be your aesthetic or the design of a traditional house, but a completely new place to live for $87,000 and the satisfaction of knowing your built the place you live has to be pretty nice.",
            "It is more convenient to have a TV at eye level rather than hanging it on the ceiling.",
            "My IKEA does not look like this.",
            "Everything needs a big price tag.\n\nSpaghhn. 178 G17.",
            "looks like a off brand attempt at a barndominium.",
            "Wtf is wrong with that ceiling? Also tv too high.",
            "Just fucking burn it down, it’ll match anyway",
            "That’s just a foam insulated metal barndominium sprayed black. It’s actually very common. Far better insulation than fiberglass. \n\nPolished concrete slab. If you want an example of a nicer one - https://www.homenization.com/barndominiums/barndominium-w-high-ceilings-28-hq-pictures/\n\nA lot of people building on their own land are doing barndos.",
            "[deleted]",
            "What about them? Theres nothing wrong with having concrete floors.",
            "Yeah I saw they built a bardominuim as a house at 1500 square feet for 85k seems like they did well. Like they said in their post it’s not everyone style. But hey, houses are expensive as fuck nowadays, good on them."
        ]
    },
    "Used dishwasher + supply line…s?": {
        "title": "Used dishwasher + supply line…s?",
        "score": 129,
        "url": "https://i.redd.it/3w5rpdmtnr7d1.jpeg",
        "content": "I just don’t know.\n",
        "num_comments": 26,
        "comments": [
            "Biblically accurate dishwasher hose...\n\nBe not afraid...",
            "The dishwasher may have been far from the water source so there was multiple hoses fied together to get to it. Or it could have been fed from the same line as a refrigerator and they took everything apart and just stuffed all of the lines together.",
            "Hey, remind me when you post the other pic. Some people huh, that’s why I got the the solution architect job just to solve their problems that they created themselves in the first place.",
            "Is your dishwasher a kegerator?",
            "I cant really tell from the picture, but was he somehow feeding the dirty water back into the inlet to save water but only partially? \nDepending on the setup maybe even seperating the actual dirt chunks by using gravity?\n\nI'm overthinking this way too much aren't I ...",
            "Is this a plumber's/appliance installer's version of /r/Ididnthaveeggs ?",
            "Someone help me out here how do I post an additional picture?",
            "The lack of charge on this person’s phone is giving me anxiety.",
            "r/chargeyourphone",
            "I’m not at the house right now but when I get back, I’ll lay it out and post another pic",
            "Not sure how to post this additional photo",
            "No, but I definitely think it should be",
            "The discharge hoses is actually not in this picture… my guess is he actually had two dishwashers side-by-side? It’s a small countertop dishwasher anyways there’s a hot and cold input one line with a valve on it and then they junction together to two outputs I just don’t know man lol",
            "\n\nhttps://imgur.com/a/5Nxa4c8",
            "Welcome to my world lol",
            "How do I add an additional photo here?",
            "Try imgur",
            "Yo just a heads up, your name is visible in that icloud link",
            "OK, so right after the shut off valve on the end of the first line is a quick disconnect. But at the start of both waterlines is a T to splice into the existing hot and cold supply lines. So I can understand wanting to shut off the line that you’re going to disconnect at the quick disconnect but then you also have to shut off the other line but there is no shut off valve for that side unless you go all the way back to the existing stop valve.  I just don’t know lol \nI should just ask the guy what the fuck is up…settle my nerves lol",
            "Upload to imgur and post the link",
            "https://imgur.com/a/5Nxa4c8 thank you",
            "Thx",
            "That definitely looks like hoses for 2 appliances, and the small double hose was probably a fix for low water pressure to one of them thanks to this shitty hose run.",
            "That looks so much like Fallopian tubes that its already been vanned in Texas and Florida."
        ]
    },
    "Wall mounted aquarium ": {
        "title": "Wall mounted aquarium ",
        "score": 655,
        "url": "https://i.redd.it/22dfuxc3nl7d1.jpeg",
        "content": "",
        "num_comments": 85,
        "comments": [
            "This gives me anxiety 😬",
            "Beautiful tank. Will be tragic when it's all over the floor.",
            "Not only is that risky but what’s worse is just how bad it looks.",
            "Looks like around 1ft x 6inches x 4 foot, around 170lbs full, not including tank etc",
            "I bet they used dry wall anchors too 😂",
            "OP probably drives a jeep without doors, skinny dips in public pools, and eats hotdogs with ketchup",
            "Ur scaring me lol",
            "What's the point of this when they have those ugly tubing leading to the sump below all exposed?",
            "I would have trouble sleeping at night",
            "The wine rack is now structural.",
            "I like how it’s mounted on the wall to save space and the cabinet directly underneath it is completely empty",
            "I'm guessing not many of you are familiar with floating shelves and the construction? Typically there is a very big piece of steel and rods protruding out and those get mounted to studs or whatever wall material you have that's sturdy. Just have to buy strong enough brackets for the weight and it's completely possible and not very hard to achieve something like this. Bolted properly to three or four studs and there should be no issues holding up around 200 lb of water. Hopefully they over engineered it for the weight though just in case. The wood on top of the steel reinforcements is mostly cosmetic it does provide some support but the steel structure underneath is what really holds it up.",
            "This will end poorly",
            "This is why I have trust issues.",
            "I applaud your bravery. That shelf should be called Atlas.",
            "Diwhy not? If its deeply mounted with metal bars it should work?",
            "Empty wine rack, liquor bottles … someone is trying to feel less aware of what they’ve done. Coping/creating under the influence?",
            "r/AquariumTooHigh",
            "Conveniently, if you run out of water, you can just pour in some tequila. Same colour, nobody will ever know. Genius.",
            "Yep, anxiety. Floating shelves aren’t the strongest imo, this is pushing your luck.",
            "I think it's cool as hell, but it shouldn't be on a walllll",
            "I mean if it's a brick wall like it's common in Europe there are methods to attach very very heavy  objects on those. No problem then.",
            "I'm not sure what the problem is here.",
            "You just know that one day you're coming home to it on the floor.",
            "Shouldn't this be In r/sweatypalms?\n\nThis stuff literally gives me utter dread and anxiety.",
            "I work in architectural fab. some of the mounts for these are amazingly robust. Most definitely are not, and id suspect they didnt spend the 300 bucks to get the 500lb rated ones..",
            "Had an aquarium a few years ago, I can honestly see the draw to putting it on the wall they take up a lot of room and are a nightmare to clean around but that thing is going to weigh a metric fuck ton so that is a dicey place to put it.",
            "Till the shit hits the Fan ...",
            "Ikea LACK?\n\nnot",
            "Oh no\nOh no",
            "Cleanup in aisle 1",
            "I literally just did the shocked Joey meme when I saw this... this... *abomination*...",
            "That’s a nope from me.",
            "I'm not sure I could be in the same room with this for any amount of time.",
            "Why would that person post this on reddit, a site full of people with anxiety?!",
            "I mean, mine is too. Its not as big as this one. I made the planks to be able to carry 150 kg and the aquarium comes to about 75 kg at max so it should be fine",
            "The cracks in the wood are very concerning….",
            "Don't worry, it's a load bearing aquarium.",
            "That poor wall 😟",
            "If it's on studs it should be perfectly safe. But the fact that it's right against the edge of the doorway and there's a table with barely any clearance below it are what's killing me",
            "I mean, if they have done it properly with stud reinforcement it should be alright. Some heaters are heavier than that",
            "Which is less than the weight a single construction screw into a stud can bear (250lbs approx.) and vastly less tensile force a 2x4 can bear. It's probably fine tbh.",
            "Wth is wrong with ketchup on hotdogs?!",
            "Jeep with no doors, foot sticking out onto the side rails, and a toddler in a car seat in the back.",
            "Everything else, yes. But ketchup on hotdogs is lowkey good.",
            "You can use the table below it.",
            "My exact thought",
            "It might even make the tank LEVEL if you put that bottle of Moonshine on the left on the top part of the wine rack…",
            "Lol bless your heart",
            "\"Someone is trying to feel less aware of what they've done' !! 🤣🤣🤣🤣🤣🤣🤣🤣👏🏻👏🏻👏🏻 oh I'm keeping this",
            "The weight. The weight of a filled aquarium is huge and probably far beyond what the shelf fixings are rated for.",
            "I can’t tell if this is a joke or not",
            "Why suffer more ?",
            "I can't even be in the same room as this thread 🤣",
            "Is it even level?",
            "How these are mounted too...I assume a backer plate with rods sticking out that the wood slides on to.\n\nI got one that appeared of reasonable quality and it broke at about 1/4 that weight under test.\n\nDid find a different local brand that was far beefier, solid steel, and with heavy welding.  I could hang on each rod with no problem.  \n\nHope they tested it...  And have a good backing/mounting.",
            "What did that wall ever do to anyone?!!",
            "The stud can take the weight but what’s attaching the shelf to the studs?? Yeesh",
            "Why use a car seat?, just strap the kid in... it's a Jeep thang!",
            "Why not use *the table* for the big heavy water tank and the *floating shelf* for the cocktail shaker and odds and ends??",
            "Not to mention the wood is separating, the shelf is not level, you can see the water level is ~ an inch higher to the left, and the one brace is not square with the center of the tank.",
            "How do you know what the shelves are rated for?",
            "I'm surprised you have the power to see how it's mounted.",
            "Nope, I’m guessing it’s already in pieces on the floor",
            "The person who set this up claims that the reason it appears to not be level is due to water flow: https://reddit.com/comments/1djnrub/comment/l9eknys",
            "No. You can clearly see that the left side of the tank is at the top, while the right side is not.",
            "The stuff on the shelf might fall into the tank and the fish are underage",
            "We know they’re not rated for 800 pounds.",
            "Good! Then it can be on r/facepalm 🤣",
            "It is level enough...holy shit guys....  And it seems well anchored and the little crack in the wood doesn't matter. And look how established the tank is. Seems to stand quite some time there.",
            "Lol",
            "I have an aquarium that size. It's less than 200 pounds",
            "> Seems to stand quite some time there.\n\nWhat are you, a pro shelf age estimating engineer?",
            "Yea but do you have it on a floating shelf?",
            "Given the consequences of failure for this project, I wouldn’t trust the shelf with 200 pounds, either.",
            "How many gallons is your tank?",
            "I'm going to have to call bullshit on that. Unless you didn't put water in it, any tank over 30 gallons is going to weigh more than 200 lb, and that looks like a 40 or larger unless the depth is like 10 inches or something.",
            "I don't think they moved the aquarium filled and already established.\n\nBut everybody else seems to be the safety expert. Ahhh reddit...",
            "Oh no whay. Are you crazy?",
            "That is a slim profile tank, yes.",
            "Well I’m glad we finally found our safety expert to confirm that it’s perfectly safe."
        ]
    },
    "Premium Broom Closet, you know, the one for your broom.": {
        "title": "Premium Broom Closet, you know, the one for your broom.",
        "score": 8721,
        "url": "https://v.redd.it/ppqafn1m277d1",
        "content": "",
        "num_comments": 365,
        "comments": [
            "My landlord wants to know why there are now 12 broom closets in my apartment",
            "Is this the same guy who spray painted Tom and Jerry on his kitchen counter? I swear this guy is ruining his house and his wife hates it.",
            "To be fair, before it was just useless wall space. Now it’s useless wall space.. with a door!",
            "Some may say he took this way too literally, but we all know he just wanted to play with fireworks indoors.",
            "Is the dust pan in a different, smaller closet?",
            "More like boom closet amirite",
            "Would work 100x better for a fire extinguisher \n\nDunno how many times I’ve knocked mine off the wall and onto my foot\n\nThe pain. The agony. The dread.\n\nI refuse to move it because then I’ll forget where it is when a fire does happen",
            "I don't hate it",
            "The one time I can actually agree with this guy's method. It increase space storage.",
            "Honestly, I don't hate it. A meme with at least *some* utility.",
            "Someone plz sweep this under the rug.",
            "Throw some shelves in there and it's actually useful",
            "That's far from the dumbest thing I've seen here, end result looks clean, and I can see people getting use out of it. \n\nAlso I kind of love that fuse drywall cutting trick if it actually works.",
            "Why not?",
            "Nice job",
            "Like if work went into adding some power outlets, and finishing out that now closet with like. sheet rock, and painted. Then you might have something actually worth while in there.",
            "He removed the fire blocks. Not recommended.",
            "Those jump cuts, you can tell he had to go back to it with a saw, no way in hell that ignition cord did anything other than spread soot around.",
            "\"MOVE CHILD\"",
            "Still needs another built-in cabinet for the dustpan",
            "Oh, did you get the broom closet ending? The broom closet ending was my favourite!\n\n(If you don't get the reference, play or watch a playthrough of the stanley parable. It is great.)",
            "The dry wall was cut before he burned the thing",
            "What was the point of the fuse it was already cut out",
            "what the fuck is with these people using spray paint indoors? that shit is toxic!",
            "Idk, I think this sub should be for projects from people who think they're doing a good job but really aren't. This clearly is a deliberate real life shitpost.",
            "Does that work with German walls too?",
            "Temu Mark Wahlberg",
            "I fucking hate this dude",
            "He's just got one of those faces, y'kno",
            "I actually don't hate the idea but the fireworks is stupid lol",
            "The second I light a match in my house it would be over before it began",
            "Spent more on cannon fuse than the broom.",
            "That freaking clown",
            "big fucking hole coming right up",
            "it's his first unironically funny video",
            "This guy has \"But this one goes to. 11\" energy",
            "Posting Justin Flom's bullshit is like cheating. Everything that guy does these days is clickbaity stupid crafts that any reasonable person would file for divorce over.",
            "The door didn’t close properly, and it bugs me deeply.",
            "The limited advantages of building houses with reinforced cardboard.",
            "Its always the same guy who does the stupidest shit and make reaction videos with the dumbest reaction faces. And fake pranks.",
            "This man doesn’t have a solid piece of drywall in his entire house.",
            "I really dislike this guys content",
            "I would put a minimum of 6 locks of different types on that door and refuse to talk about it.",
            "What’s that weird outline in the wall?\n\nOh, that’s just where I keep the children. I let them put every once in a while but it’s expensive to replace the drywall",
            "We have a *slightly* larger closet in I've hallway that was part of he original design for our house; it has a few shelves and has been perfect for small items like batteries, medicine, duct tape and razor blades and handcuffs, light bulbs, other normal things.",
            "I can’t believe that child was still alive when he found her. She must have been in there since the previous owners left",
            "You want to know why...... Because it gets views that's why......",
            "it's funny and does seem useless, but that's exactly what happened in my apartment where a new thin wall arrived right in the middle of an old doorway in a thick brick wall. Floor area is expensive to just close the doorway off, so now we have two broom closets on both sides of the thin wall where the doorway used to be. One holds the mops and the other became a general cleaning chemicals shelf.",
            "A whole lot of time and effort for a stupid joke.",
            "![gif](giphy|7OW9uiyfeTRxdSOBYN|downsized)",
            "I'm starting to think they bought an unfurnished house to destroy just for these videos. No way they would be doing all these kinds of things to their own home and in all the videos I've seen so far, the house is fucking empty.",
            "0:36 is the worst camera cut i’ve ever seen",
            "you can clearly see it's already been cut, he didn't even clean up the dust from the floor.",
            "Did this man force his daughter to come out of the closet? 😨",
            "These rage bait videos should end with the wife serving this dude divorce papers.",
            "\"You should see his toothpick cubbies.\"  \n\"Tooth*picks*?\"  \n\"Nope.\"",
            "r/DiWHYNOT",
            "The next homeowner is going to be so confused and pissed off.",
            "\"See? We're using it already.\"\n\nLMAO",
            "Imagine if i did this (we have actual houses and not everything is made out of paper)",
            "Why are people hating him?? Did he do something?? Feels like quite an extreme reaction",
            "I will now be installing a \"broom\" closet in every room of my house, for all of my semi automatic \"brooms\"",
            "American House....... Sticks and glue. Bricks are forbidden.",
            "Meh, I don't hate it, it's not the worst idea in the world, plus he seems to be having fun with his daughter, so",
            "I hate this guy from the bottom of my heart",
            "He is a menace to society and the worst shape of evil in this world",
            "This guy is 100% rage bait and I hate him",
            "The drywall was clearly already scored",
            "I hate this guy",
            "And all this time I've been using a saw to cut drywall, like a chump.",
            "Haven't we seen him before? Didn't he do something wild to counter tops?",
            "Well we can clearly the Why. Broom has to go somewhere. ",
            "Fuk. The stencil guy",
            "This guy reminds me of Brad Pitt’s character in Burn After Reading.  Does he also work at Hardbodies as a fitness instructor?",
            "Why there’s almost never any acoustic insulation in the walls in the Americans houses!? \nOnly one Sheetrock on each side and nothing in the middle!? \nI bet you can hear everything in that house! The worst is that it probably cost a couple of millions !!",
            "Sweet, a garage for my wife's preferred mode of transportation!",
            "I don’t hate this",
            "Honestly, if this was done professionally to eke out a bit more space, i would be all for it.",
            "This title is even worse",
            "1k/month rent at NYC be like:",
            "I hate this guy. I feel bad for how his daughter will turn out.",
            "Could you imagine living with this person who just does constant crazy projects. He has so many of these videos and they are all lame.",
            "Wile E. Coyote gave him the idea to get the drywall knocked out.",
            "Rage bait",
            "Knew it was gonna be this guy before he even walked in frame. Not for nothing this is the least offensive thing I’ve seen him do by far.",
            "He cut the part where he had to open it without handle 😂",
            "Where do you even find det cord anymore? Asking for a friend.",
            "I just wanted to point out that his tank top goes for around $100 with tax. \n\nI know because the Lululemon in my area had a clearance and I got the same shirt 75% off a few years ago. Decent tank, but laughably expensive.",
            "\\*hums Mission Impossible theme\\*",
            "Nothing really wrong with this one. It's practical, I myself got a vacume that space would be perfect for",
            "The fuse was totally unnecessary, the wall broke like that because of the supporting wood behind it. Lol",
            "I 100% agree with this person.",
            "I like the cut of his jib",
            "This guy sucks hugely, but this project is like the least objectionable thing I've seen on here in ages. I wouldn't mind a hideaway broom.  Its fine.",
            "I like that. OOOOOO someone make a mini room for their robot vacuum that would be so cute.",
            "Man I want to slap that guy everytime I see one of his videos",
            "This guy makes rage bait videos",
            "Why was there a little girl in his wall? And how was she still alive?!",
            "People that spray paint indoors are a special breed.",
            "DOTY",
            "My hatred for this man is irrational. I can’t explain it but every time I see him I just wanna punch him.",
            "This is the best. I don't care. Peak dad.",
            "I don't hate the idea, could be useful for a lot of things in a small area like trash bags, a mop and broom/dust pan.  I just hang that stuff on my wall leading down to my basement.  I don't hate it but I don't like it either.",
            "No one wants this.",
            "Ya know, of all the dumbass shit I often see on this sub...this is one of the least objectionable ones. \n\nI'm not above defacing my home for fun and pun.",
            "Now try this in a real house",
            "I hate seeing both of their faces",
            "That was just an excuse to use that cool wall cutting wire.",
            "I like this guy👍🏻",
            "The process was stupid but the end result could be fun and whimsical in the right setting.",
            "Finally a place for my nimbus 2000",
            "Inspired by Sicario 2 opening scene.",
            "I'd say Dyson closet but otherwise solid job",
            "Man, where am I supposed to get a kid for this?",
            "![gif](giphy|3oEjHCWdU7F4hkcudy)",
            "Isn't this how Darth Vader entered Princess Leia's ship?",
            "To be fair, this isn’t completely useless. It can store a few cleaning products and doesn’t really ruin the look of the house.",
            "He likes to boom boom -- I can tell",
            "You can tell this was probably done in the USA 😭 because like my solid ass walls would not allow for this even if wanted",
            "So THAT'S how babies are made",
            "For Her, single car garage.",
            "I like the idea but not the execution.",
            "there is no skin on that door. at all.",
            "Boys the wife didn’t like her new garage",
            "An entire broom!? Holy shit!",
            "maybe i wouldnt have put a door on it but niches for shit thats otherwise occupying space isn#t exactly a bad thing?",
            "I’m honestly surprised this guys house hasn’t fallen apart yet with all the crap he does to it.",
            "Was she in there all along?",
            "Well, to get the kid out of there.  It's lucky he looked 👀",
            "At least I know 'why', to give life to a bad joke",
            "I dig it.",
            "Pure anarchy!",
            "So dumb.",
            "Even if this is complete s*** and now I've learned to the power of fuse",
            "Dude should have told her it was her new personal garage while hanging the broom. And then, ran for his life.",
            "Mines leaning behind a door having its bristles smashed to one side. That’s why",
            "I always wanted to build tiny built in bookcases like this.",
            "This is probably one of the more reasonable things I've seen on this sub, just how he does his cutout is a little redic.",
            "Ok that's kinda cute",
            "Kind of like it. But I would put book shelves in it.",
            "Word?",
            "I mean, this is FAR from the worst thing on this sub.",
            "wish my country used drywall instead of bricks, we can't make changes to our houses without having a lot of expenses with a mason or making a huge mess",
            "He can store a bunch of cleaning stuff in there w some small shelves and hooks to hang cleaning supplies. Good idea.",
            "He just needs some galvanised square steel, eco friendly wood veneer and some screws borrowed from his aunt to make this a fully functioning apartment.",
            "I wonder how proud they were for acting this script out.",
            "A little unfinished but there’s nothing really wrong with this it’d make a decent cleaning closet",
            "Did this guy just… mission impossible a closet?",
            "Little John has been learning some new skills I see.",
            "\"I even got wood flooring.\" Hurrrr hurrrr",
            "Skeleton closet",
            "Okay, but why do I kinda love it. I'd have one 😆 if for nothing else but for my skinny vacuum!",
            "I think its cool",
            "I have a robot vac.",
            "\"Really big fucking hole, coming right up.\"",
            "I would use this every day.",
            "Ok I just wanna know if the fuse trick actually works or was this just for funs lol",
            "Handy for wizards I suppose",
            "Is it still a broom closet if I store my shotguns in it?",
            "He is a douche 😆😂",
            "More like a...Boom... closet",
            "Does American law allow this to be done legally?",
            "What's with the mini broom?",
            "The only thing is him using the fuze as a cutter is a thing that I dont think many people would think off.",
            "You should see how he removed the sleeves from his top!",
            "I like it, it’s charming!",
            "The broom closet ending is my favourite!",
            "Breaching charge deploy",
            "I love the idea of the tiny niche closet",
            "Okay, even the wife is like: \"This is completely fucking stupid\"",
            "This dude is low key one of the original YouTube peeps. The stuff he does is ridiculous and to an extent for views and likes, but it's also for his kids so I'll always let it slide. He used to do magic and that too.",
            "The hell is that wall made from to break so easily? It definitely doesn't look safe",
            "i hate this guy sm",
            "This belongs on r/TechniclytheTruth",
            "Was very confused for a minute, then I remembered American homes are made out of wood.",
            "That maniac is also a pyro.",
            "This guy is creepy",
            "What is that string fuse stuff he lights up?",
            "Looks like crap",
            "This is odd, whenever I see this guy he normally strings the video out to about 3 hours and 45 minutes long.",
            "Idc that was cute!",
            "I hate this guy so much",
            "I read BOOM closet. It made sense because you used fuse line too 😂 I kept watching, waiting to find out what a BOOM closet was used for.",
            "Even his wife is like “D-I-Why, Steven? Why?!!”",
            "wtf was with the fuse ? is that a thing?",
            "Do this in the bathroom so you can hang your poop knife.",
            "Hate this guy and his magician friends. They always do super long videos of something that can be explained in 30 seconds and it's never worth the wait. They do lots of rage bait and I swear every time I block one of their accounts 2 more pop up in it's place. Wish they would all just go away lol",
            "I like it!",
            "I can’t put my finger right on it, but the people in this ‘content circle’ have passively irritated me for *years* but damn if they’re not living the life they want to live.",
            "that actually is not that bad of a idea for a very small home thats trying to min max their space.",
            "i feel like the staples did more than tha fuse",
            "**GET OUTTA THERE!!!** 😡",
            "What's the wire he's used to light up and cut the wall ?",
            "Doesn't even fit a proper broom",
            "I knew it was gonna be that asshole before he even walked into frame.",
            "This man should be flogged in a public square.",
            "He should get a torch for controlled burns",
            " That tiny broom???  what if a witch comes over, she will laugh at you!",
            "I don't see anything wrong with this.",
            "I know it's stupid, but I kinda dig it lol",
            "Of all the wtf things I’ve seen on here… this is actually okay to me. Handy, dedicated spot for your broom or mop, keeps it out of the way and off the floor. I like it",
            "He gets way too much hate, much of his content is about making his kids happy.",
            "I feel like the whole purpose of this video was for a guy to play with a fuse that cuts through drywall (of course, now I want that).\n\nBut what a massive missed opportunity to play the *Mission: Impossible* theme.",
            "Stay-at-home dad is having fun, apparently.",
            "You could lock it and put sexual torture devices inside instead.",
            "Fkn Americams with thier cardboard walls",
            "This actually looks legit and useful",
            "okay i must say that this is actually a pretty good idea",
            "This guy love his wife, he put in a parking spot for his mother in-law.",
            "I'll allow it",
            "Reinforce that baby and you got a gun box on every corner never be caught unprepared again lol",
            "Could be useful for other stuff honestly, fire extinguishers, limbs, walking sticks, umbrellas you name it. This isn’t the worst thing on here imo",
            "This seems like a great way for a curious child to get stuck in it and cry for hours.",
            "Only works for American cardboard houses tho",
            "For 12 brooms  OBVIOUSLY,  but how many Mop closets do you have???",
            "My landlord wants to know why I burnt down the apartment complex to install a broom closet.",
            "“Well, you see sir, I just had 178$ worth of brooms lying around, what else was I supposed to do with them?! Donate them to some nonprofit organization that actually needs them or something?!?!”",
            "Rent each one $800 a month with no pets allowed.",
            "It’s obviously a quidditch locker room now",
            "5 Front doors",
            "Also why their tenant is now on a terrorist watchlist",
            "His name is Justin Flom, he's (or at least he *used* to be) a magician/illusionist. Now he just posts stupid shitty videos like this on social media, bc whether people believe it's real, or whether it's rage bait, it gets engagement. It's a bit disappointing tbh. He was actually a super talented magician, and I enjoyed watching his sets.",
            "This video isn’t quite as bad as his other ones though in my opinion, since this one is clearly made to be satirical; sadly, most aren’t. 😔",
            "I would hold your swearing until someone posts what he makes off of stupid rage bait diy videos.",
            "His wife actually left him. The brunette is new. Also, he used to do magic instead of this rage bait.",
            "His wife is in on it. She also makes soft kink/fetish videos to put on YouTube.",
            "Probably a dummy house he bought just to do this.",
            "I'm annoyed I liked it because I hate this guy",
            "I forget his name.. he's been on the internet a long time doing this stupid shit. And got popular for awhile. From pranks to this dumb shit and anything dumb.",
            "He's flipping these houses.",
            "When tiktok/YouTube pay people money... They do more and more ridiculous things for attention money.",
            " Time for a modest proposal from a handy guy.  Not me, Im a lady.  oh i guess a handy lady could also make her an offer.  She should go for it . smh this guy XD",
            "His wife is the one filming it and is in on it.",
            "His wife hates it so much she is filming the entire thing!",
            "If anything, the useless wall space just became a tad bit convenient",
            "Time to turn all that useless empty wall space into SMALL-FORM STORAGE.\n\nKey cabinet by the front door? Check!\n\nCondom holder next to the bed? Checkerino on that one!\n\nReplica Halberd holder? That small but tall door past the bathroom door!\n\nA small closet INSIDE another small closet? That's so silly! And surprise, look behind the microwave!",
            "Don’t worry it’s a very useful space, in a couple of days he will punch a hole through the wall and draw Garfield there.",
            "“Do not try this at home kids— I mean *in* home!”",
            "the firework just burned the wall, theres already a score through the drywall..",
            "Or.... He has a sense of humour and... Wanted to make... A funny... Oh nevermind. Fuck.",
            "Yes, to access you just have to jump down through the trapdoor he installed in the house",
            "oooooh and even smaller one NEXT to the broom closet hell yeah",
            "This was my thought exactly. He has never swept or he'd have thought about that too.",
            "Thank you for your service.",
            "A boom closet for a Boom Stick!",
            "So you made me get up from the comfy couch after a long day of working and measure my fire extinguisher, kudos to you first of all.\n\nThe one have protrudes almost 3 1/2 inches from the wall it's mounted on, so it could be recessed between the studs. So wall mounting hardware will be visible on the other side of that wall. If it's not visible, cool. Alternatively, adding a 1/2 inch thick piece of plywood will make the mounting stronger and  no need for dry wall anchors but there may be a small bump out from the extinguisher. Or better yet, just add a board to put the extinguisher on, just like those recessed shelves in bathrooms. Then decide if adding those \"break in case of emergency\" doors would worth it or just keep it open.\n\nBut if you got a full sized one then obviously all this aint worth diddly squat.",
            "The irony of removing the firebreak in a house to put in a fire extinguisher is extra fun.",
            "I watch a lot of vintage kitchen design videos, and I can see this being incorporated into one. I think the designers in the 50’s were genius!",
            "I don't either, I just hate that he used a fire to cut the fuckin hole. Perfectly fine to get a little extra closet space between studs here and there.",
            "Yea, as someone who is struggling to figure out where to leave my broom and mop in a new apartment, this would function quite well.",
            "I have an even smaller cabinet in my kitchen next to my stove. It is both shorter and thinner than that (though much deeper). I still store stuff in it.",
            "Until the next owner of the house pulls up the trimming and finds burn marks…",
            "Yeah I really don’t get the hate.",
            "Like instead of cutting out the structural 2x4’s?",
            "If you look you'll see he had already cut the drywall then attached the fuse over the cuts.",
            "You're really gullible enough to believe that a firework fuse cut drywall...?",
            "This guy frames",
            "You can clearly see it was scored prior and the drywall dust all over the place is kinda a giveaway too",
            "Nein. \n\nMoment, ich gucke nach…. _Klopf, Klopf_ …. NEIN.",
            "Why :(",
            "and a severe disadvantage of building houses from Steel reinforced concrete \n\nwanna hang a picture up? go get the construction workers because you ain't putting a hole in that wall with your pathetic makita drill",
            "Idk I’ve seen him on YouTube he hangs out with these weird girls who look like drug addicted prostitutes",
            "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^thecraftsman21:\n\n*Man I want to slap*\n\n*That guy everytime I see*\n\n*One of his videos*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
            "It's not about size. It's about how you use it.",
            "The fuse didn't cut the drywall, it was already cut before the fuse was placed. He just wanted to look \"cool\".",
            "As many as mop bucket closets, of course!",
            "Take it easy there, moneybags. Not everyone can afford to have a broom AND mop closet, let alone multiples of each.",
            "Woah woah woah, mop closets? Look at Daddy Warbuvks over here",
            "Huge buttplugs can fit in there too. They can be hidden behind brooms. No one looks behind the brooms. Ever. \n\nEveryone looks for them under the bed. The cupboard also hides the smell somewhat. \n\nYou can put the oranges in there too. Yes, those oranges.",
            "I try to put them everywhere so I can save whenever I want.",
            "Huge buttplugs can fit in there too. They can be hidden behind brooms. No one looks behind the brooms. Ever. \n\nEveryone looks for them under the bed. The cupboard also hides the smell somewhat. \n\nYou can put the oranges in there too. Yes, those oranges.",
            "Huge buttplugs can fit in there too. They can be hidden behind brooms. No one looks behind the brooms. Ever. \n\nEveryone looks for them under the bed. The cupboard also hides the smell somewhat. \n\nYou can put the oranges in there too. Yes, those oranges.",
            "DC Intern Season pricing. ",
            "Nah most landlords are already on that list",
            "Even if we're throwing all normal logic out the window: Based on the fact that the drywall was obviously scored and the fuse was literally just for show. I'm going to *safely* assume that it's fake/ragebait. \n\nWith normal logic re-engaged: It is 100% extremely obviously fake. And the fact that anyone can even remotely think he's actually giving advice or trying to be helpful, is scary.",
            "It’s Gordon Joseph Levits older brother",
            "Isn't he and Rick Lax the original inventors of the ragebait videos?",
            "I think it is rage bait, because I am sure the original video lasted ~10 minutes and had 9:30 of completely unnecessary shit added to it. \n\nIt’s frustrating to watch his shit.",
            "I really want a teeny tiny broom closet now though. I feel like it might be the thing that turns my life around.",
            "I havent seen one that was not satirical.",
            "I did a google Search apparently the first wife was with him from 2009 to 2021, while his second wife he married on 2023",
            "My curiosity will prob. regret this but go on...",
            "Oh?",
            "I mean you can’t just mention that and not link it you know?",
            "Some of his rage bait is playing with stuff he's about to remodel.",
            "I would absolutely utilize this lol.",
            "That bit of useless bullshit just got upgraded to bullshit. Now that's how you flip a house.",
            "Yesss fill my house with worthless holes 🤣",
            "I like your style",
            "So basically we just invented medicine cabinets.",
            "Halberd in the house you say? Go on...",
            "That shits needlessly misleading AF. \n\n\nVery shady behaviour.",
            "Old houses do have a lot of cool features. I had a tiny door almost exactly like this right outside my bathroom.  When you opened it it was access to the pipes in my shower from behind without ripping out tiles.",
            "Google rev-a-shelf. They have all kinds of fancy shelf compartments and things. We got some with our cabinets and I show them to everyone who will look",
            "Please tell me more about these vintage kitchen design videos.",
            "See all that dust on the floor at the beginning? It was already cut out before the fireworks fuse was lit",
            "yeah, I don't even think it's ragebait, not overly long, just a silly video, made me chuckle",
            "I saw it on the internet so it must be true",
            "Probably votes, too",
            "If anyone is dumb enough to try, they deserve the consequences....but also it looks fun and very looney toons-esque, so try it in a house when you're doing renovations and get a bucket of water nearby",
            "Long ago and far away, I was. Retired building inspector now though.\n\nBut I still find people doing dumb stuff interesting…",
            "Schade, ich hab sogar schon die Schnur angebracht, mich nur nicht getraut zu zünden.",
            "That's not how concrete wall works. Reinforced concrete is only used for pillars and beams. Then it's concrete and bricks. And ultimately plaster and paint. To hang a picture you would put a hole through the plaster. For bigger stuff you would drill a hole into the bricks and concrete. But you're never, ever touching the reinforced concrete pillars and beams. Also because you couldn't.",
            "Still weird to hate",
            "Well I'd LIKE TO use it for storing my broom, but I can't",
            "Better do a few swiffer closets, too, for those in between times.",
            "OH,  the peasents are here as well, how quaint!",
            "Look at this fat cat who can afford an entire broom!",
            "What do you mean by it's fake? It's obviously not trying to be advice, it's clearly a joke, but he definitely really made that broom closet.\n\nAre you saying it's not his real house? Or just that the technique is fake? Which, who cares, that's not the joke.",
            "Lordan Goseph Jevit",
            "You and me both",
            "lmao i don’t know how she lasted so long, he seems exhausting to be around, let alone married to for years",
            "Yeah, like I wouldn’t choose to build this myself, but I would certainly find use if it was already there.",
            "I'd love to get my brooms and mops out of the coat closet. This is super convenient",
            "The thought of how much my hoarder ex-husband would overfill this gave me anxiety lmao",
            "That's what... she said?",
            "My house was built in 1952 and I have a closet, the back of the closet is the access panel to the back of the shower.\n\nSadly the faucet is starting to fail and I don’t think I’ll be able to replace it without damaging the tile anyway…",
            "Thats just common sense",
            "I'm a kitchen designer and I absolutely love rev-a-shelf. They have something for everything, good quality and affordable.",
            "yeah my main concern with this was the sparks from the cord lighting the dust on fire.",
            "There is drywall dust on the floor before he even lights the fuse…",
            "And one more thing…if your insurance adjuster finds out you did this and that this helped a fire spread…you just might not get paid..",
            "Ich würd mir Gedanken machen, wenn meine Wände schon durch den Einfluss von Knallerbsen nachgeben würden 😂\n\nDEUTSCHLAAAAND! 🇩🇪🇩🇪",
            "do you not know that Cast plate houses are a thing?\n\n\nthey're not build with bricks, there are no pillars\n\nthe walls are premade and the house is only assembled on site, most, or usually all walls are reinforced concrete\n\nit's essentially like building a Gingerbread house \n\nit's very common in 70s houses and apartment blocks in europe",
            "idk his YouTube name but I wish I could show you how weird and cringe his videos were lmao\n\nMaybe he’s making normal videos now that he has a daughter but people still hate him for his older videos",
            "Have you considered broom reduction? I heard there are a few procedures for it nowadays.",
            "Not with that attitude you won't",
            "Cleaning classist!!",
            "The part about the fuse/burn was the fake part. And maybe the conversation afterward between spouses",
            "Jaseph Gardan Lavitt",
            "I’m not sure I can live my life going forward without one. ",
            "no, that's just extra powder he snorted before he shot this video",
            "The first frame of the video shows the fuse actually jammed into the drywall cut",
            "Yeah I know those exist, or at least I'm fairly sure I do lol. I'm not an expert of English language pertaining to construction work, but weren't those called something like \"prefabricated\"? They should come like a bunch of pre-made walls and roof you just have to assemble into a house on place. I honestly think even those are way sturdier and way more reliable than the wood and cardboard houses Americans keep making for whatever reason I honestly can't explain to myself . Is it just because it's cheaper? I honestly can't see the advantage of having walls you can demolish by punch and kick and main house doors any adult could kick open with ease.",
            "Hate is an extreme thing, quite the reaction to someone being cringe",
            "But it was a real fuse that burned and he had a real conversation. \n\nThe fuse was unnecessary and the conversation was staged but neither was fake.",
            "Jarr Garrr Larrr",
            "And a suspicious dust on the floor",
            "I don’t think anyone actually hates him in a literal sense",
            "For many “staged” and “fake” are intended to be interpreted as synonymous.",
            "Jesop Groudan Levitate",
            "That's good :)",
            "But the whole point of the video is to be funny. Thats like going to a magic show and complaining that everything was fake because magic isn’t real.",
            "I suppose. I actually have an aunt that has that exact opinion toward magic shows and it’s kind of a fun-killer. :(",
            "More accurately it's like going to a comedy show and complaining that it's fake because the comedian scripted their set. Magicians at least present their stuff as real, so there's an argument to say that fake is accurate.",
            "no, you said the same thing /u/Noopy9 said:\n\n“That’s like going to a magic show and complaining that it’s fake because magic isn’t real.” = “it’s like going to a comedy show and complaining that it’s fake because the comedian scripted their set.”\n\nThe magician scripted their set too mate"
        ]
    }
}