{
    "Is this a Load bearing 32 inch wall?": {
        "title": "Is this a Load bearing 32 inch wall?",
        "score": 603,
        "url": "https://www.reddit.com/gallery/1dleas7",
        "content": "It’s a single story on raised slab. Only attic space above it. Door that you see is to the outside of the house. The top of the wall in question has the three wires coming out ",
        "num_comments": 211,
        "comments": [
            "God I hope not",
            "If the sawsall blade get stuck, it's load bearing.",
            "Generally, if wall runs parallel to joists it is not load bearing.  Should go without saying, but you need to be 110% sure before removing any walls",
            "I dont really care about the wall. just came here to give you props on using a pair of newbalance 990's as a work shoe...",
            "You’re standing on a truss in that picture that is not bearing on the header of that wall in the picture, so no it does not appear to the load bearing. Note that I am not an engineer and I’m only going off the pictures that you sent I could be totally wrong, but I’m pretty sure I’m not. Keep in mind that there is a 1x that is being nailed into right by it, so if you do remove it you’ll probably want to secure that to prevent a sag.",
            "You showed us a picture of there not being a load on top of it…",
            "If it was load bearing there would be a header over the passageway beyond the wall, or at least one would hope so. ",
            "Looks like a wall just made for that power line lol",
            "It is if you are standing on it!",
            "Load bearing = perpendicular to joists. \n\nThat wall is not load bearing.",
            "One would hope not!",
            "If nothing is spanning over top of it, it's not structural but the double header plate and double studs is very odd and I would really verify nothing is somehow utilizing it to transfer load.",
            "Thanks everyone for all of the comments, I understand that this wall is NOT load bearing and can be removed. I was pretty sure it wasn’t but just wanted to double check. \n\nAs some of you pointed out, I’ll be moving the switches to external wall.",
            "It's easy. If rafters are running same direction as the wall the it's not load bearing",
            "Your foot was stepping on a joist in the attic. The joist ends on top of the double wall studs. This makes me think the wall is load bearing. You can pay a couple of hundred bucks to get a structural engineer to tell you. This is the kind of thing you need to be 200% sure.",
            "No. Load bearing will run perpendicular to the joist",
            "does anyone else see the wood bending already? Not load bearing!!",
            "If your house collapses if you remove it then it was",
            "It may not be load bearing, but these nib walls are often put on place as bracing for the wall behind it if it runs quite a span (say 6m roughly) without contact with another perpendicular wall. They are built for a purpose not just decoration. Removing it may affect the structural integrity of the long wall it is bracing.",
            "My concern would be the piece OP.is standing on, looks like a 2x6 or 2x8 resting on the plate of the stub wall, appears to.be sistered to the truss.  Where is the other end of that?",
            "no",
            "Remove it, if the house falls down , then yes",
            "No but your scrambled eggs look terrible and also who keeps scrambled eggs that way, gross",
            "Impossible to know without pulling back more insulation and looking at the roof rafters.",
            "I don't know",
            "Generally, where I am, load bearing walls are built with double headers, so my first guess is yes. I am also somewhat of the opinion that the truss you are standing on in the attic photo may have a minimal perch on said wall.",
            "Oftentimes a double top plate signifies load bearing.",
            "Most likely not. It is always good to get an actual expert as some walls aren’t load bearing but do offer lateral stability. This small it is probably not an issue",
            "Assuming the ceiling joist you are standing on are running parallel to that wall (which it looks like they are), it’s not load bearing and can be removed.",
            "nope",
            "Yes but can only handle 1/4 of the weight lol. Jk!",
            "Whoever ran your wires should’ve put them all into the holes furthest from the 2X4, you’re lucky the close one wasn’t hit with dry wall nails",
            "Update me!",
            "Sure, as long as....oh",
            "No just a partition wall",
            "Not those twig supports, but on the right, maybe.",
            "No. The long wall in the first pic tells me the trusses run parallel to this little wall. Look at your roof line and it will give you a basic idea of what’s load bearing and what is not.",
            "This is not a load bearing wall, the opening would have a header if this was a load bearing wall. No header in opening means the short wall is non-load bearing. Assuming the trusses/rafters in this area are all running the same direction.",
            "No. Not at all. It's job is to hold up the drywall.",
            "NO",
            "Load bearing walls run perpendicular to the rafters. Make sure are above the right spot too and that no roof supports are coming off of it",
            "I would put a load bearing poster on that to make sure.",
            "🤣 no",
            "Doesn't look like it, assuming the second photos are above the first couple. You can tell if you look to the same space and identify what loads are being transferred upward and or downward. In this instance, you're standing on a joist that is running parallel to the wall you're taking away, and there is no direct load being applied to it",
            "If you have manufactured trusses it is not.",
            "No",
            "I thoought i was on r/trees and was verry confused what you wanted.",
            "if you remove that wall, you should add something  \nto keep the outside door from swinging wide open.",
            "It could be",
            "General rule of thumb is if it has joists perpendicular to it, assume it's load bearing unless a qualified engineer says otherwise",
            "Load Bearing means there is a load above it. So, while you’re up there in the attic, is there anything on it? No ? Then not load bearing!\nIt’s literally named after what it does. If there isn’t a beam on top or something sitting directly on top apart of it you’re golden.",
            "is there a stem wall below in the crawl space?",
            "Another view from the interwebs, from a weekend DIYer with no qualifications. \n\nAfter looking at it and reading all the comments, it would seem it's not load bearing. There's nothing above it, it's parallel to the ceiling joists, and has a 2x4 on each side. It should be easy to shore that up in the attic to avoid sag before you get the saws-all blade stuck taking out the wall. \n\nIf you're really worried about it you could put 2x4s or 4x4s on each side of the opening with a 4x6 on top as a sort of archway, visual break between the living room and the next room. Then sheetrock over it. Structurally sound, a small visual break between rooms, and you can put a little bookshelf above the opening there for added space, or a place for cats to knock stuff off of.  Win-win.",
            "Spend the money on an engineer. Get THEIR opinion…",
            "[removed]",
            "I don’t know if it is load bearing but it does have electric wires running thru it so you need an electrician to move those if you intend to take it down.",
            "No. It can come out.",
            "Let’s pull it out and see !!",
            "You could look in the crawl space and see if there are supports under it, but it seems unlikely to be load bearing.",
            "It is if you stand on it",
            "Sure as heck looks like it to me - but best bet would to be have someone inspect it that knows what they're doing. If it is, you could put up cross-beam under the ceiling supported by both sides, then sheetrock the beam in so it looks good. I did this in my house with 2ea 2X16 x 10' sandwiched together with plywood in the middle for padding to beef it out to normal wall width - this was when I removed the wall between the kitchen and the dinning room. Put king studs on either side of the beam for support.",
            "There’s one way to find out",
            "Usually see metal in load bearing walls in modern times",
            "I am just here to make fun of American paper walls. Good luck tho",
            "Maybe ask a contractor, not reddit? We can't see all that goes into this structure.",
            "yup",
            "Load bearing walls should be able to carry load, like tons worth. That is a \"fake\" wall with gypsum sheets for architecture arrangements. \nLoad bearing walls are made with reinforcement and concrete.",
            "These comments are why I am in this subreddit. I know nothing about construction and have never DIYed anything but seeing the abject horror from those who are knowledgeable is so funny",
            "Same. I know enough contractors to know there is probably about a 20% chance it is though",
            "I could change that",
            "Blade go brrrrrrr-squeek",
            "\"guess that's stuck there forever now...\"",
            "That's a structural shim now!",
            "*saws-most",
            "I remember that happening once with a hydraulic demolition saw. It was binding up, so they stopped to reevaluate. Turns out it was supporting the 30 odd floors above it..",
            "Or it means the house compressed onto something that wasn't meant to be load bearing.",
            "That’s a good one imma use it",
            "Did you work on the Hyatt catwalk?",
            "Is there a stuck blade in the photo? Am I being blind?",
            "Underrated comment right here ",
            "Looks like a pair of ceiling joists meet on top there and aren’t continuous",
            "It's like playing Jenga, just jiggle it a bit before pulling it out.",
            "The easy way to tell is to knock the wall down and wait. If the ceiling falls on your head, it was load bearing.",
            "Go big, or go home. And OP is already home, so...",
            "Haha thanks, best work shoe around",
            "Is that just the rafter to the right of it being the “load”. I was confused about the board to the left",
            "Technically there is a load on top in the picture, about the size of one dude in New Balances",
            "Also, and hear me out, but if you're gonna knock out a wall.  You’d hire someone or research if the wall you want to knock out is load bearing before you gut it to the frame and ask Reddit if it’s load bearing\n\nEdit - words missing",
            "C'mon. This is an honest question and an opportunity to help someone!",
            "How can you tell by those pictures? \n\nDid Op measure? Did he just base it on the visible wire?",
            "Good on you for checking when not sure, and happy demo and rebuilding!",
            "Long (interior) walls don't need lateral bracing, they're attached at the floor and the ceiling.",
            "I feel like this is honestly there to prevent the door from opening too wide and messing up the hinges/framing, but idk. I'm not a lawyer",
            "Same",
            "Not in this case",
            "No crawl space, on slab",
            "That’s a really good idea, thankyou",
            "Lol no, I’m amateur",
            "Don’t need an electrician for that. That’s an easy move.",
            "I’m going to move them to the left",
            "Do you represent the electricians union?",
            "Why? Ive never heard this before when its comes to just moving something simple like a switch. Removing, or moving a great distance, sure, but a foot or so away is barely a move.",
            "**Me when seeing the post:**  *”Hmm, I’m not sure.”*  \n\n**Me 12 second later, after reading the comments:**  *”Of course it’s not you moron.  Why would you think that?”*",
            "At times, I miss ignorance.",
            "do take a healthy dose of scepticism. The most truthful answer used to be top comment, now it's 3 or 4 down. Not necessarily in this case, but in general it holds true.",
            "How do you know the person is knowledgeable?",
            "Yup, had one like this. Joists spread the entire length of the room but they decided to make this one stupid little wall load bearing for one single joist that was shorter.",
            "I don't know why this made me lol but thank you",
            "I actually heard the noise in my head.  🤣",
            "I once got two chainsaws stuck trying to get a third unstuck.....man was I dumb back then",
            "Load bearing sawzall blade",
            "The wall takes what the wall wants.",
            "It’s now a load bearing sawzall blade.",
            "That’s an accent saw blade by Diablo",
            "Now it’s time for the wired hammer sawsall",
            "Not a defect but a feature",
            "Reciprocating that saw right back at you",
            "Someone removed the actual load bearing wall, so now every wall is load bearing.",
            "Right, it's load bearing",
            "but its STILL bearing load, see!",
            "It's unclear to me what is structural wood in the attic, and what is nailers for the ceiling drywall. Certainly a possibility that that wall is load bearing.",
            "If she's loose, you can remove it.",
            "Last words: \"Jenga!\".",
            "Relevant: https://images.app.goo.gl/V8AoYkjKAcakgYej7",
            "The little nub on the left is a board they nailed to the top of the wall to support the edge of the sheet rock on the ceiling. They just needed something to screw to.",
            "The plate is just to stiffen up a half wall like that.  The load should be out on the exterior wall.",
            "I did try but Reddit told me to take the drywall down in a previous post. Can’t win with y’all",
            "Tbf, that 32” wall is comically overbuilt for not being load-bearing.",
            "Top comment 😆",
            "Double checking makes you a better craftsman than 72.6% of people who do it for a living. Good on ya",
            "I was the foundation principal at a newly constructed school (2010) in Queensland. Steel framed, brick veneer  walls attached to floor and ceiling. A typical building was lowset comprised of three connected classrooms with operable walls (50%) adjoining each room.  In every building bracing nib walls were installed. I objected because they were a practical nuisance and we got some reduced in length (nothing less than 600mm,) but not removed because they were required under the code.",
            "A lot of people see \"electrical\" and that's that, electrician time.",
            "You're left or my left?",
            "Nope, just the lollipop guild.",
            "There was one maybe a month ago, a concrete pylon that had some erosion or something and the OP was asking if it could be patched up in any way to make it more stable/secure. I would estimate that it was maybe 18\" in diameter and I would have estimated that the piece missing was maybe 3\" thick. Now I don't know jack shit about the integrity of structural concrete, but from what I saw it seemed like it should have been easy enough to reinforce it. \n\nI quickly scroll down to the comments and see panicked comments telling OP to stop fucking around and act immediately to replace the pylon or their shit was about to get fucked up. I thought to myself, \"Wow, either these commenters are quick to panic or concrete pylons aren't able to take much wear and tear. I *almost* made a comment about it. \n\nCouple hours later I'm back on Reddit (surprise, surprise) and come across the same post, only this time I scroll just a little bit farther. You see, the first time I looked at the picture, I hadn't scrolled all the way to the bottom. Right below where the 3\"thick chunk was missing from the pylon was another chunk that was missing, except it was massive. The whole thing was resting on a bit of concrete that couldn't have been more than 5\" in diameter.\n\nI'm glad that I kept quiet.",
            "Comments had me thinking the same thing about myself lol",
            "Reddit is basically just a bunch of LLMs that learned from each other and keep the cycle going so nobody actually knows if it's true or not.",
            "I've heard it's bliss.",
            "Just go outside or turn on the tv... its everywhere",
            "Did you know soil bacteria can call for lightning strikes",
            "\"I mean, I'm still dumb now but I was dumb back then too\". \n\nMe. I'm the dumb guy too.",
            "I have seen that more than once from professional forestry workers. The solution is to get another chainsaw.",
            "that sounds like three chainsaws unless someone else got the first one stuck.",
            "I mean, who hasn't gotten themself two chainsaws and a bottle check deep into a tree before.",
            "Should of used an axe to get them un stuck",
            "Just get a wedge and hit it with a 30lb hammer - millwright here",
            "So you freed them with a fourth chainsaw right?",
            "I got a segment of fish tape stuck in a corrugated tube the previous owners had installed as a a conduit for AV lines. This is after I got an HDMI cable stuck. They are still both there.",
            "*Feed me*",
            "I would assume the one on the right is the joist, flat board on the left is drywall catch.",
            "We call it deadwood.",
            "But it kind of looks like that \"nub\" is being supported by that 32\" wall. If you take that out, that 2x4 and the drywall attached to it isn't being supported. Or the weight is being held by the 2x4 cantilevering, which isn't strong. So they might need to make sure that 2x4 is supported elsewhere.",
            "Previous post is correct. There is absolutely nothing wrong with stripping down to framing to figure out what is what.",
            "Given how the wall was built with the double top plate, I don’t fault you in the slightest for thinking that it could be load-bearing. \n\nBroadly speaking, rafters and joists will run along the shortest axis of the house with load-bearing walls  running along the longer axis, holding the ends of the joists up in the middle. \n\nUnless the architect and builder were sadists.",
            "You should take it down!\n\nDisclaimer: I am not a doctor, lawyer, accountant, or registered as any profession in any known city, country, or legal authority. The comment above is purely for entertainment purposes and does not represent my personal thoughts. It should not be considered as advice, recommendation, or even a mildly reliable suggestion. Any actions taken based on this comment are done at your own risk. Always consult a professional, or at least someone who sounds like they know what they're talking about on Reddit.",
            "Why is Reddit full of overly confident, yet clueless people like you? 32” of wall, one stud on each end and one in the middle, double stud on the “floating” end to stiffen it because it’s not connected to anything else. This isn’t overbuilt, it’s built exactly how any wing wall should be done, and how most are done.\n\n It’s ridiculous how often people complain about everything being done too cheaply and not built well, and then when you have an example of something that’s completely commonplace, it’s “overbuilt” and dozens of people are upvoting in agreement.",
            "I've never seen this in the US, and certainly not in residential timber construction.",
            "I remember that post, still not sure wtf that guy did to that thing for it to end up that bad…. I’ve never seen a footing that screwed up in my life lmao",
            "[this is the post you're talking about](https://www.reddit.com/r/DIY/comments/1cwv2ju/how_best_to_fix_this_badly_eroded_footing_ideally/), you did a very accurate job describing it. \n\nI was able to find it from the beaver comment below.",
            "Don’t you love the community? All this is free unsolicited advice and it’s usually awesome how the good stuff rises to the top. People are passionate about doing this shit right.",
            "At least you knew better than to put your weight on drywall and fall through the ceiling.  You’re doing better than some.",
            "There's always something else to be ignorant of, have no worry, the world is filled with shit you don't want to know.",
            "Please elaborate?",
            "Tangent : \n  \nThat's my go to [phrase] when people as [if] i smoke cannabis.   \nI used to. I mean I still do but I used to too.",
            "The Charlie Kelly approach. It is most known for retrieving cats that are stuck in walls, but I'm sure it could apply to chainsaws as well.",
            "Using an axe as a shim usually works for me",
            "1 x 1 = 2",
            "That was all the chainsaws, so out came the axe",
            "If you’re not swaying along with the tree, are you really doing timber?",
            "That's exactly what happened when we got the last saw stuck",
            "Since you're here, what's a good milling machine for infrequent, light duty use? Everyone I ask just says Bridgeport but that's a bit too big for what I need it for",
            "Yes we do, but he doesn’t.",
            "Hey only my wife can call me that",
            "So does my wife",
            ">Unless the architect and builder were sadists.\n\n\\*cries in inlaws designed a wannabe McMansion\\*\n\nThis roof's got more lines than Tony Montana",
            "My dad did every single wall with double top plates in his extension on his house. Haha.",
            "It’s because most people on this sub absolutely do not know anything yet love to think and act like they do. All because they follow this sub full of other people who know absolutely nothing",
            "Would you really need 3 2x4s on the left side if it wasn’t load bearing? (Real question)",
            "In our case it had something also to do with wind rating. We do get the occasional cyclone (hurricane). When I was in North Queensland where cyclones are severe, everything used to connect a roof to a house had to be doubled.",
            "Braced wall panels are in the code. It begins in section R602.10\n\n\nhttps://codes.iccsafe.org/content/IRC2021P2/chapter-6-wall-construction\n\nIn prescriptive design, where an engineer isn't required, wall lengths generally are limited to around 30 feet of uninterrupted length. This length varies based on seismic and windspeed and numerous other site specific conditions.  But that 32\" wall could be a braced wall, although it is unlikely. The year of the build would help to know what code cycle was in effect at the time of construction. It is not a load-bearing wall.",
            "There was one comment that raised the possibility of it being concrete eating beavers, and that was the only answer that made sense to me.",
            "I am now very intrigued and want to see it.",
            "Unsolicited? Posting on this Reddit would be solicitation, wouldn't it?",
            "Guessing you’ve already arrived in that lounge?",
            "I miss Mitch",
            "Thank you, Terrance.",
            "Took me a minute, than I re-read my comment and realzied I missed the \"jack\" part of bottle jack.\n\nThe other bottle comes AFTER the shit wetting terror of knocking a tree down with a bottle jack after wedging your chainsaw.",
            "Millwrights do industrial equipment repair, maintenance and install.  Got a 6ft bearing that needs to be replaced?  A millwright is your guy.",
            "I'm going to add this to my \"sage advice\" file. That was well said.",
            "It’s the bear loading walls you really have to watch out for.",
            "I love when those things have 5,000 sqft. of roof footprint that feeds through 17 valleys to about 10 linear feet of corner gutter with a standard down-spout and all the design professionals are scratching their heads about how the foundation got water damage.....",
            "It’s a double 2x4 on the end, still has drywall and corner bead on the 4” side\n\nDo you need more than a single 2x4? No, but you’d have a less durable house. In the same way that a hollow core door is less durable than a solid core door.  The double stud adds a lot of rigidity to the end. Anywhere that a wall doesn’t have a dead end, it’s instead connected to the adjacent wall somehow, and that’s where the rigidity usually comes from.",
            "It wouldn't shock me to see a triple 2x4 on the end. Much more common to see a double, but depending on the decade the house was built in, it was at one time very common to do a solid [4-stud corner](https://diy.stackexchange.com/questions/115157/is-a-california-corner-as-strong-as-3-or-4-stud-corner). That could very easily lead to someone putting a triple at the end of a wing wall, either out of habit from framing corners or because they already had a triple knocked together and just threw it in.\n\nBut double or triple, the point is still just to stiffen up that outside edge that has no lateral support. The only time I know of where multiple full-length studs are required for structural support is when you have concentrated/point loads like a column or girder beam above them. In that case, you have to provide an equally beefy load path all the way to the ground, so you usually get 1 stud per ply of the girder, or the whole footprint of the column being filled with studs.",
            "My read ons that is that it's mostly for wind sheer on exterior walls, or bracing in seismic areas. And there are still alternatives. No way that's the case here.",
            "Reminds me of how I mentioned to our battery guy about how I had seen a post on plastic eating worms. Like what would happen if they decided to eat the plastic 50 gallon jugs he keeps his sulfuric acid stored in?",
            "Maybe that's the spot where he dumps the lead acid batteries out before he puts them in the compost",
            "Inconceivable!",
            "Yeah clearly I was high as giraffe balls. I didn't catch that. \n  \nThanks",
            "Same! That guy had such a great delivery of the punch line for such short and, most of the time, absolutely dumb and hilarious jokes.",
            "Underrated comment",
            "Tag line tied to the tow hook of the truck my dude.",
            "It really depends. Machining is more common in the Canada chapters",
            "Gotcha. Yeah, I thought that was a white painted 2x4 there…",
            "I mostly agree, but without knowing the code cycle and seeing the whole floor plan, there's no way to be certain. Braced walls can extend to the interior or be on the exterior. Typically, they will be braced with sheathing, diagonal bracing, or hardware. I would be comfortable saying the wall pictured is not of any structural importance.",
            "The worms will stop eating the plastic, or at least at most will. Then, all of a sudden, we have super worms that can live in acid AND eat plastic.",
            "I raise those worms, zophobos morio. They are definitely attracted to polystyrene but their natural tendency to literally consume it is greatly exaggerated if they have other food sources. However, they burrow through it like mad which I'm guessing is what you're interested in. \n\nThough polystyrene is not typically used to make bottles for holding strong acids, it is stable enough to be used and the worms would not likely be averse to chewing through. The first hole through the bottle would let out a small amount of acid and take out victim #1, but then atmospheric pressure would hold it the rest of the acid in. Once there were two holes at different heights, the acid would begin flowing freely and create a steaming smoking pile of worm goo. \n\nCashApp me $50 and I'll do a YouTube video for you. If you leave a decent tip I'll even use highly carbonated nitric acid for extra excitement. /s\n\nI said /S!!!",
            "Boom tsss?",
            "Fair."
        ]
    },
    "Got this on marketplace. Paint job is a mess and I want to strip it to the original plastic. How without causing damage?": {
        "title": "Got this on marketplace. Paint job is a mess and I want to strip it to the original plastic. How without causing damage?",
        "score": 367,
        "url": "https://www.reddit.com/gallery/1dlhdb8",
        "content": "The paints already coming off and I don’t want my kid to eat or pick at the chips. Any suggestions to safely remove the paint job would be awesome. ",
        "num_comments": 141,
        "comments": [
            "These sorts of toys are usually made of blow molded high density polyethylene. One of the neat things about HDPE is that it is incredibly resistant to most solvents. Something like citristrip should work, but even acetone has trouble hurting HDPE. This is also why the paint is flaking off; nothing sticks to HDPE.\n\nOf course, test on a non visible area first.\n\nIf you want a non chemical option, try a soda blaster. It might give the plastic a matte finish, but you can bring back the gloss with careful application of a heat gun.",
            "Tell your kids not to peel the paint off.  2 days later and all the paint will be gone.",
            "[removed]",
            "Try a powerful pressure washer, first.  It might just rip all that paint right off.",
            "Sorry but you shouldn't be coming to Reddit for these answers, you need to contact your local little tikes structural engineer.",
            "Bro... Is it really worth it?",
            "You want the one in my backyard instead of wasting your time?? These things are crap. \n\n\nMine is like red and beige and mostly home to earwigs and standing water. I flip it over and shake it around when I mow the lawn to keep it in good shape 😂",
            "Thank you all for the comments, they were very insightful and also hilarious 💕",
            "Redfin wants you to list it for 179k in your area now.",
            "Off topic... is that kids \"bathroom\" playset complete with fake toilet?  Anyone else find that strange?",
            "Others gave you suggestions for stripping the pain but considering what this is I might suggest just spray painting over it and patching it up as needed. Paint stripping can take a lot of work, especially worse the more complicated and intricate the painted item is.",
            "Not worth all the hassle. Just repaint it.",
            "I almost thought this was a post on a renting sub.",
            "actually dont worry about casuing damage because once you are done stripping the paint you just blast the whole thing with a torch and it will look like new again.\n\nthey probably painted it to cover up oxidation which is much more easily solved with a simple torch",
            "That’s so weird. My wife picked this exact same little house up off the curb from our neighbors the other day, and it too has a terrible paint job.",
            "awesome thing to DIY, honestly. always wanted one of these as a kid. hope it goes well!",
            "Power wash it. It'll come right off.",
            "It's blow molded polypropylene. PP isn't attacked by most solvents. Suggest buying a new blow molded house for your princess.",
            "are any of those walls load bearing?",
            "I bought one like this! Painted too. Paint started to peel and I just used one of those shitty electric pressure washers Ryobi makes. Didn’t need chemicals. Water blew that stuff off without a fuss",
            "Tell them you'll fix it then leave it as it is once they move in. Good life lesson for them not to trust landlords if it's not written in the lease.",
            "Are you planning to flip it as an investment? The rental market is really reaching new lows...",
            "Try a power washer and a scrubbing brush? You can't use chemicals.",
            "Always check your lease but a light power washing will get under any exposed flakes and blow them right off.",
            "Not joking, go over it lightly with a big blowtorch, like the one used for roasting chiles in a barrel. It will look brand new. ",
            "what even is this? is that a toilet?",
            "soda blasting or walnut blasting, basically the gentile forms of sand blasting, would do the trick.\n\nif you have a compressor all you really need is the gun.\n\nOn that line of thought a good pressure washer may be able to get the paint off as well.",
            "How much is rent?",
            "Just give it a good sanding, prime it and paint it",
            "I'm thinking it was painted over for a reason... Those things fade terribly in just a couple years (we had the exact same one). A solvent wash and pressure washer might strip a lot of it, but trust me that paint is in every tiny nook and cranny and its going to take forever and you'll be stuck with a faded out toy... I think it would be easiest to just give it another touchup coat of paint to cover the mess.",
            "lol okay but why does it look like this is a play outhouse hahahah. Is that a play toilet??",
            "How much costs one of this new? Be careful not to spend too much time and money on that. I would just leave it’s just for the kids right? They probably won’t be playing anymore after few months 😞",
            "Sad grey play house. Criminal.",
            "Leave it alone and let the kid play house in it.",
            "Throw it out and buy a new one.",
            "It looks like there is a bidet in there.",
            "Congratulations on becoming a homeowner",
            "That's not a paint job. That's solid plastic. If you cut any part of that, it's going to be that color all the way through. I did a Google image search for it and that's the standard color.\n\nYou'll have to get a paint that's designed for plastic and then test several areas and see what works.",
            "What is your time worth? Just purchase a new one. Or whatever the current equivalent of this item is. It will likely cost less if you put a value on your time.",
            "Why do you want to put that much effort into stripping it.   How much is a new one?    Stripping is not easy.  Seem like it would just be easier to spray paint it.   By the time it starts to peel your kids would have out grown it and you will be putting it on market place.",
            "Hotsy or a Landa heated pressure washer will strip it clean",
            "Just soak it in hand sanitizer long enough",
            "It looks very cute. My bro got one for Xmas for his kids, but it was wood in dozens and dozens of pieces. Guess who assembled it on Christmas Eve after hours, on his knees in the garage?",
            "Haha I have that same one but man it was so hard to clean the dirt out of the bottom.",
            "Point a heat gun at it and watch the color come back up. It might dribble the paint down so you can wipe it off.",
            "Paint over the top and call it good for two years.",
            "someone painted this?",
            "[https://youtu.be/BONhk-hbiXk?si=WYyVTSrkmTNcR_Xt](this looks like some sort of well for sensitive boys)",
            "If the paint doesn’t come off with 5 minutes of power washing then just live with it or chuck the POS.  Could also drive around a neighborhood on bulk trash day and find 10 of these to choose from on the curb.  These are usually “Please get this out of my fucking yard and you can have it for free” type postings. It will be for you in 2-180 days.\n\nETA: Is that a fake shitter in there???\n\nETA 2: TIL a lot more people have blowtorches at home than I would have guessed.",
            "For a moment I thought it was a little house for a toilet",
            "Can you mod it?",
            "This is the house I got my little girls 😭",
            "Repaint it and it will appraise for $20k over ask 😉 just listen to any realtor lol",
            "Is that safe for kids to have like stripped plastic and the chemicals and stuff microplastics idk",
            "Personally, I've learned my lesson of putting too much time into a kid's toy.\n\nMy plan would be:  \n  \n1. Pressure wash.\n\n2. Paint the roof: mask pillars, spray with a universal bonding primer, then a paint that is textured.\n\n3. Paint door opening: mask entryway sides, up to that spot halfway up the side at the railing height. Looks like a U. Paint that as close of a share of white as you can find.\n\n4. Touch up other white areas: Spray the aerosol paint into a container, or pay some touch-up white in the same color, if they have it.\n\nMaybe do the table inside with the roof color?",
            "That’s modern farmhouse. Does the interior come with luxury vinyl floors?",
            "Have you managed to get a mortgage?",
            "I believe those plastic parts are dyed that color before injection molding so the color isn’t going to come off. I’d say just clean it all off really well and spray paint your chosen color(s) instead.",
            "Try a blow torch like they recondition the stadium seats.",
            "You might want to reach out to the manufacturer and ask them how to cure this.  I think this material has the color as part of the forming process.\n\nIs it possible the original owner painted it?\n\nIn which case, the manufacturer might be able to provide guidance as to what you should not use.\n\nPersonally, all the elbow grease suggestions are most likely the safest way to proceed.",
            "i dont think you can most paint strippers will melt plastic. use some  scotchbrite pads and sand the whole thing and prime and paint.",
            "Dude your kids will outgrow that in a hot second.  It's fine. They can't even see the roof.  Spend your efforts getting the clover out of your lawn! (jk but not really)'\n\nAnd put some sealant on that deck, what kinda animal are you?\n\n(realistically) make sure your kids don't eat paintchips/plasticexcreta.",
            "Blowtorch. Melts the oxidized layer, dries, and looks like new. Just barely hit it.",
            "Go to your local Dollar tree and get some LA's totally awesome. It's fantastic paint stripper and it's really cheap. I believe it should work on exterior grade paint but I'm not totally sure. Again though, it's really cheap so if it doesn't work you're not out much money.",
            "That's not paint. That's colored plastic. The top layer is flaking.\n\nTry a quick pass with a propane torch to remove the outer layer and bring out the brighter inner layer.",
            "I painted my kids garbage picked house with some leftover Sherwin William woodscape solid stain and it’s covered great and hasn’t flaked off in 3 years since.",
            "And just stick to a heat gun, my mom used a propane torch because of tik tok and melted her patio furniture.",
            "There’s a reason Walt demanded Jesse get hdpe bins!",
            "I suspect a normal pressure washer will take almost all this paint off. Problem is now you have a billion chips of paint on the grass or driveway.....",
            "This. I put 99% isopropyl alcohol in hdpe containers.",
            "Your comments are spot on as a Solvent strip will be extremely hard. Acetone evaporates too quick.  Only an epoxy primer has a chance of sticking and if the surface prep is uneven that is not a sure thing.  Epoxy needs a top coat too…. It does not weather too well on its own.",
            "the matte finish is good for repainting at least",
            "What a great comment, wish I had made it!\n\nI have exhaustive soda blasting experience... DONT! Lol Just from a mess standpoint but you're right.",
            "Not worth the effort.",
            "Lacquer thinner?",
            "Citrustrip was also my first thought.\n\nBut also, it at least in these pictures doesn't look like a mess at all tbh.\n\nOP, you sure you want to do this? Not just the removal, but dealing with what's left afterwards, before even thinking about what kind of primer and paint to use after. This is gonna be a lot of time and cleanup and hard work.",
            "Will look better matte",
            "\"landlord special\" more like it",
            "Probably covered up some restorable hardwoods.",
            "My guess is mom (or kid themselves) wanted to match the main home",
            "Fuck, that's so funny",
            "Spray with 99% alcohol, let sit a bit, then power wash.",
            "They're gonna need the proper little permits first.",
            "*step2",
            "How much is rent?",
            "That's fantastic! 🤣",
            "it is not",
            "I was think the same thing.  Your kids are going to use it for, what, three or four years?",
            "That’s the truest description of the one in the backyard during my own childhood/teenage years. Wild.",
            "It’s a sink lol.",
            "I haven’t seen any suggestions for stripping the pain 😭\nAny tips?",
            "I’m looking for something to strip away my pain too…",
            "probably a middle ground of high pressure water to deflake it as much as possible and maybe some scraping/brushing in often handled areas could work. but leaving it like this the new paint would flake off immediately anyway, its only as strong as the weakest layer.",
            "Yeah I’m not really understanding why you would go any other route. It’s a plastic play set",
            "It was kind of a trend for a while to buy them secondhand and DIY them. this paint job is the exact same one I’ve seen on Pinterest about a hundred times lol.",
            "I think it's the UV rays.",
            "I'm surprised this isn't at the top because it's the best answer. 15 minutes with a 2500+ psi power washer and it will look like new.",
            "You certainly can use paint stripper on this kinda plastic...",
            "Simple green would be as harsh as I'd go.",
            "Also you might want to check with your local council for building modification approval above a certain cost. And that toilet looks like it needs replacing too so you night as well replace that as well",
            "Yeah dude. Just grab your blowtorch and have at it.",
            "Yes. Step 2 Adorable Outhouse",
            "I agree.",
            "I am considering spray painting as well. I guess I just wanted to gauge the best approach and I have no clue what the hell I’m doing",
            "Might want to do that a little further  away from the house lol",
            "Bestie I rent and my landlord will be doing none of that I assure you",
            "Is this fr? I can believe it but damn. You mean the las totally awesome degreaser yeah? \n\nI’ve painted furniture professionally and love me a good dollar tree hack",
            "Stain can be surprisingly effective on plastic. It's neat.",
            "So the torch worked, just too well.",
            "Patty O'Furniture was one of my favorite contributors to MPR.",
            "Man this is straight where my mind went too",
            "Wait until your neighbor's at church and drag it into their yard, then wash it.",
            "Perfect snacks for the kids when playing out in their new house.",
            "I have HDPE wash bottles for acetone and anhydrous ethanol at work. It's great.",
            "![gif](giphy|3oriePFZ78wzILNkFq|downsized)",
            "With a proper power washer, no chemical will be necessary.",
            "Thats step3",
            "Nothing that a little bribe or a little mob can't straighten out.",
            "3 or 4 times.",
            "Probably not even that. My kids get tired of their toys so damn fast.",
            "OK, that makes more sense I guess.  I saw the faucet but it looked like it was to the side of the big blue bowl.",
            "I have gotten some farlie good results  with 80% ethanol..",
            "Yep.",
            "Paint job on mine is different, but now I’m wondering if it would be worth redoing.",
            "Simple green and scrub is surprisingly effective. Too bad this piece is too big for an economical simple green long soak to really loosen up that paint.",
            "Go to Lowe’s and get Krylon Fusion Spray.   Works well on plastic and drys quickly",
            "Next you're going to tell me to move the turkey fryer off the covered porch!",
            "I'm gonna guess the staining worked well because it's not so much *applying something to* the HDPE, but rather changing the visible structure of the HDPE itself? Is that how that works or am I way off?",
            "If you're going for a Salvador Dali vibe, torch is the move.",
            "Same! That lesson left an impact!",
            "Mmmm... gasohol....",
            "I can see what you mean. I would have definitely left it there if it had a toilet in it though!! Haha",
            "I mean, I got mine for $40 and I also got a table and chair. Retail on this set is $160-$180 so I think it would be worth it for me to fix it up.",
            "Just say it like you know what you are talking about, and most of us wouldn’t know any better. I figure that’s how most of the expert reddit comments are anyway!",
            "Instructions unclear, my watch is now on fire. :(",
            "Exactly! Just apply [Cunningham's Law](https://en.wikipedia.org/wiki/Ward_Cunningham#%22Cunningham's_Law%22)",
            "Time is an illusion.",
            "Lunchtime doubly so."
        ]
    },
    "Does this kitchen flooring sample match our living room floor? Or should we just do something completely different?": {
        "title": "Does this kitchen flooring sample match our living room floor? Or should we just do something completely different?",
        "score": 837,
        "url": "https://www.reddit.com/gallery/1dlaorm",
        "content": "",
        "num_comments": 441,
        "comments": [
            "Looks close enough, but if you’re like me, you’ll be the only one that notices and it’ll always bug you. Then when people compliment how nice it looks, you’ll be compelled to point out the imperfection. The other person will shrug their shoulders, say they can’t tell, and walk off. Then you’ll stand there staring a moment longer and let out a sigh. ",
            "Not perfect but very close. Whatever you pick is going to change a bit as it ages so don’t stress about getting a PERFECT match.",
            "definitely close enough. especially if it's transitioning right there in a doorway/transition, nobody will notice unless you point it out.",
            "Unless you are changing cabinets I’d go completely different. My opinion (which doesn’t count for shit) is that would be too much wood with the existing cabinets",
            "EDIT: meant to ask whether the sample is \"close enough\" or would you just find something completely different. Also, we plan on replacing all cabinets and countertops to all-white !",
            "Do something different. The kitchen is already in a different room separated by some walls so it’s not like it’s advantageous to keep the flooring uniform.\n\nDo some vinyl tile or different flooring. It won’t be any more expensive than the LVP you were planning on now. \n\nAt least then you won’t ADD yourself to death over comparisons and the room divide is maintained but with a quality look. \n\nPlus something about kitchens doesn’t lend itself to the wood look when it’s segregated like that idk probably personal preference. Open concept should match for sure but there’s an opportunity here to make it a little different, I’d take it.",
            "In the kitchen I would go tile.",
            "They seem to be wider, the sample. I wonder how much less you would have had to use by it being just 1/4\" difference.",
            "Personally, I’d go with something else. It will never be a perfect match, and imo having a complementary design would be better than trying to be matchy-matchy.",
            "There's a reason why wood flooring isn't traditionally put in kitchens and bathrooms.",
            "Personally I would go for tile in a kitchen. Mine are wood now and I freak out at every splash or spill. My old house had tile and I didn’t have a care in the world.",
            "At first glance, it looks great.  I would urge you to look beyond that (and the difference in width which would be a deal breaker for me unless you’re changing the orientation by 90 degrees which brings its own issues).\n\nYou also should consider thickness, sound transmission, scratch resistance, warranty and wear/yellowing/aging from UV etc.  then make a decision.  If you’re going to live with this decision for a while, you should consider the long term implications (other flooring will also change over time but ANY difference with an attempted perfect match will be very noticeable).",
            "Sorry, I can't get past this, but is that big ass tv mounted so that it's partially blocking the archway to dining room?",
            "I did something similar. It looks fine, and with a transition strip its less \"in your face\"",
            "Something completely different will always look better than looking like you've tried, and failed, to get an exact match.",
            "I’d say it’s close enough.",
            "The rule of thumb in general is if you can’t get the same stuff go completely different. Otherwise it just looks like you tried to match and couldn’t. That being said it looks close",
            "It's damn close. However, my wife an dI had a similar decision. We had wood in the dining room and had our kitchen redone. We went with a tile look instead. We figured that different is ok, but close enough may bother us.\n\n\n\nHowever, your match is much closer than we could find for our floors.",
            "I don’t think the brown floor matches your baseboards or cabinets at all to begin with. I would go with the completely different different color.",
            "You may end up missing a little bit of contrast in the flooring from one room to the other. We had a similar decision to make at my house and went with something completely different and have no regrets. \n\nI did put a photo of my kitchen into some app to give it the look of my living room floor, and I think I’m glad I chose to keep the contrast between living room and kitchen.\n\nHowever, it will look nice either way!",
            "Looks pretty close. Try changing the threshold between the rooms to a different material so the two woods are not touching.",
            "It’s close but even if you find the exact brand and model they won’t be 100. The die is always most off a bit per lot.",
            "Looks like a good match to me.\nI think as long as you maintain a transition piece of some sort, it will look fine.",
            "It looks just slightly off in the photos, if you are going to use it I would suggest looking to flip it 90 degrees to the other floor. You won't notice the tone difference nearly as much. ",
            "Close enough.  As the lighting changes through the day you won’t even notice the difference. Go with it",
            "I suspect it will be a situation where no one knows except you, but to that note if you have a perfectionist mindset or can’t look past stuff like this then for your own mental health don’t do it, but truly every single guest won’t know anything.  Damn close match",
            "Its close enough it you make a transition break of some kind like a threshold.",
            "Looks close enough, place it 90 degrees rotated to the original floor so light bounces off of it differently but it will be attributed to the rotation and not the wood color.",
            "Not sure if this has been said or not, but you could also run the planks perpendicular to your current floor as well, which I think would further hide any slight difference in color. Ultimately I think it’s so close you should go for it.",
            "Looks close.   But a transition piece of a different material or color would help to diminish any difference in appearance.",
            "Close enough",
            "I’m usually of the opinion that completely different is better than close but not exact.\n\nThis is so damn close that I’d just go with it.",
            "I’m an ultra perfectionist, but I’ve learned that if you have to squint and tilt your head to tell if something is off or not, you are generally overthinking it.",
            "It doesn’t match, but it’s close. You can tell by the grooves/joints on your existing floor",
            "Can stick to the color but change the pattern",
            "That would look terrible with the existing wood cabinets currently",
            "That flooring is close enough that it would look fine if you want the continuous look. Really just gotta decide if you want continuous or for the kitchen to feel completely like entering a different space.",
            "Looks flawless to me. I'd never notice any difference as a guest",
            "If you read all the disclaimers, none of the options even guarantee a colour match if you have different batches of the same pattern.  \n\n\nI'd go for something completely different personally. Matching sets of everything is very English.",
            "It's a real close match, but do you really want a color that dark on the kitchen floor? I would not want to be responsible for a spill that becomes hard to see and therefore clean.",
            "If you're going white for counters/cabinets, I'd put Grey slate tile in.\n\nI'd also call your sample close enough if your heart is set on wood.",
            "Am I crazy? I always tell clients not too bother trying to match because you won’t. Do something different.",
            "Goodernuf!",
            "If I came over and you managed not to tell me that you thought it didn’t match, I would not know. \n\n\nThat said, it doesn’t matter what I and a BUNCH of other people in your comments think. What do you think? With a transition strip between these two, will you be annoyed by the minute differences? Will you say “yeah, that looks so much better than before?\n\n\nThat’s honestly the important part.",
            "Do tile. Wood doesn't belong in the kitchen. Thank me later when your fridge/dishwasher/sink leaks",
            "Nope. It's only 99.99% similar.",
            "Looks close but… If I can’t find the exact match, I go different. Trying to match with something “close” can look much worse",
            "Looks great. Only you will know it doesn’t match perfectly. I agree with previous about doing the other room flipped 90 degrees. Then line difference won’t be noticeable.",
            "Do tile instead. You’ll never match the flooring and it will always look odd.",
            "Is that laminate ? I wouldn't put laminate flooring in a kitchen personally only cause kids constantly get water all the floor and that kills laminate.  tile , sheet lino or vinyl would be my recommendation",
            "Close enough for me!",
            "No.  The seams of the existing floor are noticeably deeper.",
            "Fits enoungh👌 Imagine explaining this problem to aftican kids…",
            "Check at night as well as daytime. To me - and I’m picky - it looks close enough and I’d use it rather than something completely different. The transition piece that sits across the doorway will help break them up.",
            "Close enough, you could give the floor a good polish and it will match better.\n\n\nMake sure to get the flooring all from the same batch \"request it\" because the color can change a bit between separate batches.",
            "I would do something completely different.  I would never notice the difference in someone else's home, but I would see it everyday and it would drive me nuts.  I would go with a tile-look product.",
            "Looks pretty damn close to me. By the time you get it all laid out and installed, you won't even notice the difference unless you're really looking for it.",
            "You should rarely try to match unless you have the original manufacturer and specs. You should usually use a complimentary product",
            "The widths are slightly bigger. Which would annoy me since it would be a large amount covered on the ground compared to a sample, that I would likely notice it forever. \n\nI’d probably go with something different maybe a [brighter color like pine](https://www.google.com/search?sca_esv=a2302d5a134243eb&rlz=1CDGOYI_enUS974US974&hl=en-US&sxsrf=ADLYWILWFe0pvhAwBmba8PiR-3Zi7nvFQg:1718996871819&q=pine+flooring+kitchen&udm=2&fbs=AEQNm0DvD4UMlvdpwktgGj2ZHhIXbAWLwb3isP1TOYwOuAlv_Q7vGexpJyOFDsW9fl-QwXtHiRMPUdsXxOT7b4zXoNIkuwAVCiSIVlZnLXOH8W1UutFFeiw172n6pWG6desq3zMzBLA5y7iNfFArsfpBPYF7zNN8YW58U25TjXxd0U8_hVwuHSmA5Ds78HO-RMIP8HdioxUzmO3T0d9Eq7M4GBRdYKmpQg&sa=X&ved=2ahUKEwjouKivsu2GAxWIFmIAHUoDDMwQtKgLegQIBxAB&biw=428&bih=751&dpr=3) optionally would maybe stain it to be a bit darker to rustic style. This would go well with your future all-white cabinets you mentioned in another comment imo",
            "It definitely matched well enough. Although, I would prefer having a tile in the kitchen.",
            "Looks very similar. You could also go with a totally different style tile which would also look nice. But this will look nice and I would not notice the difference.",
            "Yeah, that's pretty good. Put a 4\" transition strip along the \"threshold\" in a darker color between them and rip it.\n\nColor is not absolute. You can change the color of your floor by swapping brand of light bulb. Get close and live your life.",
            "Personally, a contrasting color in the kitchen looks better than attempting to match in my opinion. You're more likely to notice the difference also if you don't have seams between them.",
            "The only difference is the old one is more dull, and the new one is more glossy. But it is anticipated because the old one is older hence it’s more dull.",
            "Close enough for me",
            "If you put a wide threshold piece it won't butt into each other and I think you won't notice if there is a slight difference.",
            "As an architect, it’s not an exact match.  I would opt for a contrasting floor.  Too much wood grain thats unmatched, in the same plane, will not look good.  There are plenty of attractive sheet vinyl and lvp products that mimic ceramic tile out there.\n\nRegarding practicality, the less seams you have in a kitchen floor the better.  You want a floor that you can quickly wet mop and will stand up to spills that may sit for period of time.",
            "Very close. Try different lights, fluorescent, battery, flashlight, natural lights",
            "It’s not 100% and would bother me. IMO, I’d go with something that doesn’t look like you tried (and almost) to match the other stuff.",
            "A good contrast looks better than a bad match.",
            "It looked like an iPad cover on the thumbnail lmao.",
            "Can you do something different like a herringbone pattern so it \"matches\" but is also obviously different so the fact that it's not a perfect match is less jarring then if you try for an unnoticeable match?",
            "It's not close enough to patch the existing flooring, but it is close enough to put in another room with a transition between the rooms to break it up.",
            "Close enough!",
            "This is laminate plank right? If it were me, I would go with a laminate tile instead so you don’t have to live with an imperfect match.",
            "Find something totally different. It’s very close but if it’s going to be lined up right to the living room floor, the difference will be visible.",
            "If it’s anything like my 1999 built home, that kitchen flooring is linoleum glued to 1/4’ plywood which is stapled to the subfloor with approximately 1 million staples per sq foot.  Still worth it to rip out the linoleum and plywood, hammer down or pry out any staples and install the new floor directly on the subfloor to make that transition as flat as possible.  I used a circular saw with the blade set to a little over 1/4” deep to trim through the plywood and barely touch the subfloor, then used a pry bar to pull it up in sections.",
            "I remember those cabinets from the 80s.",
            "They look soooo close, and the plank sizes look identical, so tempting; how is the texture?",
            "Close definitely but can't tell 100 percent from a pic",
            "looks like your existing has a beveled edge and the sample doesn't...",
            "Close enough. Maybe try a transition that's metal or something (if you like that look) to break it up more and make the contrast less obvious.",
            "Old floor could be slightly darker from dirt and use, may take time to match up better?",
            "Would it break too many brains if you ran it 90-degrees from the existing floor? Would that just turn a tiny difference into a bigger, unforgivable difference?",
            "Instead of placing it next to the original floor, place it on top of the original floor.  That would give you a better idea.  s it is now, there is the meta strip and the vinyl floor distracting your eyes",
            "Yeah sorry that would drive me crazy. I’d rather have something completely different.",
            "I'm on the team \"if it doesn't match exactly then do something completely different\".  \n\nMy wife is on the exact opposite team.  \n\nI would do tile or something or golden... my wife would do that sample.  I would also be wary of wood in a kitchen.  It just gets so much water.",
            "In my old house, the prior owners laid down hardwood in both the living room and the kitchen. They did the living room first, but when they went to extend into the kitchen they realized that they had the exact same wood, but with a matte finish instead of glossy. It would have been pretty noticeable where the floors met. They did an inlay to separate the floors and you could only tell the difference when the light would hit it at just the right angle.",
            "Looks pretty close. Maybe put a wider threshold between rooms to mask any comparisons.",
            "You might look at adding a contrasting transition between them if that fits your design. It might make any color difference less obvious since the two installations won't directly abut.",
            "it is close enough that most people will never notice.  The existing is knotty, the other doesn't appear to be.  If it will bug you that it isn't an exact match, just go all-in on contrasting the floors, like really make it obvious.  Perhaps a stone pattern to compliment the colors of the counters/backsplash.",
            "Does not match, although close. I would opt for something different. Is it the kitchen, wood is not the best fit",
            "![gif](giphy|oWWfwpLj5l0XK|downsized)",
            "Do something different for sure",
            "Sounds like I’m the odd one out but I think it has to be an exact match or something completely different. If it’s noticeable, then it would just bother the heck out of me that it’s not the same. I couldn’t have like a carbon grey and a slate grey used for the same paint job. Sure they’re both grey but it’s still not right lol",
            "Looks really close! You could maybe add some type of thin decorative tile as a transition strip to separate them a bit.",
            "Works for me. But you should really ask the wife (boss).",
            "Stain color is a match - wood type is not. If you use a 5\" threshold piece (or 6\" - because it'looks like you're using 5\" planks and you look to have a 1/2\" gap on the floor side - it should work. AND.... you could even change the direction of the grain/wood board if you use a threshold!",
            "Can you keep the sample?  Cut the edges off and lay it on top of the floor, then take a good look.",
            "Use tile or something more durable in the kitchen. Especially something that can handle water, wear and tear, cleaning, etc. I personally don’t understand the wood/wood print vinyl in kitchens.",
            "More contrast in the sample.",
            "Looks like a close match.\n\nOne thing to consider (although it's probably more of a skills issue for myself)... Wooden floor near the kitchen sink can be troublesome to maintain in my experience. You gotta be hyper diligent about keeping it dry.",
            "Colorwise yes, it looks to be an exact match.  Put the sample on the floor itself to confirm.  Also, measure the width of the boards.  Lastly, is there a beveled edge on your floorboards, or just the lighting?  Again, put the sample on your existing floor so you can examine it under the same lighting conditions.\n\nGood luck!",
            "I personally would do something different",
            "No! The kitchen flooring sample has lager planks and a slightly lighter color.",
            "I think go with something different. Something that looks good against the wood of course, but something that is mostly to match the rest of the updated kitchen. Let the kitchen be its own space with its own floor!",
            "It matches but your floor is older for some reason.",
            "Keep the metal or use a dark threshold and the slight difference will go unnoticed by everyone but you.\n\nThe fact that the light direction/source changes so close to the threshold is an advantage.",
            "Never try and match you will notice. Go obvious contrast and then ull always be happy.😊",
            "Almost, it's just a tad lighter",
            "Really close but the similarities personally would drive me crazy. I'm a person of contrast in my own mind.",
            "Never mind, I don’t think it matches exactly. The grain is different",
            "The original is beveled between the planks the new one is not. This is the biggest difference. I would bet that the manufacturer has one in this exact color and pattern with a beveled edge. Then it would look pretty much indistinguishable to most people. Just put a 6” wide wooden threshold/transition between them instead of the normal t molding and you’ll be good to go.",
            "No, it doesn't. Both in size and color.",
            "Kitchens really shouldn’t be wood floored in my opinion.\nI’m fully about tile in the bathrooms, kitchen, laundry room, and maybe some other unique hi risk areas.\nWood everywhere else, nothing is a perfect match I’d highly recommend considering different options rather than try to get a perfect match.",
            "I would put a 6\" tile or stone transition between the rooms",
            "Pretty close.  The trick is to use a wide transition strip or threshold so the two floors are not viewed very close together.  Personally, I'd do porcelain tile in the kitchen though.",
            "I vote make it completely different! I’ve always liked rooms that have different themes. Makes it feel more…separate? Like you’re walking into a new space",
            "Looks good but test it under your living room lighting as well.",
            "Nope not a good match. \n\nLove looking at those ancient mosaic and ceramic floors still beautiful about 3 thousand years later. To change the look? Throw rugs. \nYou know some ancient liked to change the kitchen and living areas look, a time or two in thousands of years.\n\nPicking a color in the wood paneling, have the color experts give you the exact blend. The paint guys usually can do it for you for free. I believe there is an app for matching too.\nLook for and you will find an almost perfect match. \nThen to the tile section and stores. Yes, you will find a tone blend with the help of the paint guys.\nIt will be the correct tone, not too gray, not too orange, or too yellow. \nYou will be happy for years.\n\nIs that your house and planning to stay? Ceramic flooring holding back a box for chips or breakage over the years. History proves normally lasts looking awesome past your grandchildren's time.\n\nYou'll be $$ for the latest look and doing the whole floor, your labor is worth money. Those stick on tiles, and those sheets of plastic, vinyl wear quickly with heavy traffic. \nDo you really want to be 73 and on your hands and needing replacement knees putting down planned obsolescence products?\n\nDump the wood not matching.",
            "Just position a light perfectly so you don't see the difference.",
            "If you have to ask... It probably doesnt.\n\nGet something contrasting",
            "Completely different is the safest solution. \nI wouldn't risk having 2 similar-but-not-identical flooring next to each other, it would really be a mess!",
            "Once its fully installed, you’ll see the difference alot more clearly and it will always bother you. I’d personally go with a different style",
            "Enough. But I vote for different. It’s a diff room used differently. The change will call that out.",
            "As long as you're okay with transition pieces joining the two sections of floor, then you're fine.",
            "Pick a contrasting and wide transition strip, jovory will ever know",
            "Close enough to me. If you have any left over from before, mix them in",
            "Put it on the floor not next to the floor in order to compare.",
            "It is damn close.  If you remove the metal strip, lay one plank across the threshold of the door, effectively replacing the metal strip. It will further serve as a visual break that will make the colours & patterns look like an exact match.",
            "It kinda matches but doesn’t. Go with something else because it’s always going to bother you.",
            "Will YOU notice a difference? Yes. Will anyone else notice? Probably not. That’s a pretty darn close match.",
            "I would put the sample on top of the floor you're trying to match to see how close it is.",
            "Yeah the new sample is a half a shade lighter but otherwise the tone and wood pattern is very similar.\n\nI'd say this is good and it's unlikely you can find better. I've manufactured stains for floors and you will see batch to batch differences so make sure you order a single batch and make sure the colour is the same before you start.",
            "What do you think op?",
            "I would either get a really good match so it doesnt bother you forever or do something totally different.",
            "Nobody will notice but you. Probably.. I have a similar issue in my place, but the 2 parts that don’t match are separated by carpet, so you can’t tell if you don’t know and look for it.",
            "Since the sample looks VERY close to the original, I'm wondering if a creative threshold transition between the two rooms might be enough to camouflage any differences.  Maybe a strip of interesting tiles, or something like that?  Done right, it could add a little flair to your flooring, and might make it harder for your brain to recognize any differences.",
            "Personally I would go with a vinyl that looks like stone. I’m not a big fan of wood looks in a kitchen",
            "I think it's a fantastic match.",
            "Slight color difference. But that’s likely cause of usage and age of the existing floor. Like u/FattyMcNabus said, you’ll be able to notice that it’s brand new/different.",
            "the sample is oak, the living room looks more like pine. color match is good, but for the kitchen you could always go with a lighter color to show spills better(making it easier to clean up.",
            "Completely different and tile",
            "I personally hate when people go with completely different woods. Different materials like tile to wood, fine. But I’d say that’s close enough. Different woods to me look like you are renoing one room at a time and buying bargain bin flooring, whatever is available.\n\nEdit if you are worried, add a runner or a rug close to the change of floor and that will help your eye be distracted by any differences.",
            "Reasonably close if you change the board direction in the new kitchen, probably won’t notice. So this is what I used to tell clients, most people walk looking at eye level. Even room lighting will affect the shade. Go for it",
            "Architect here. Matches pretty well. Go ahead.",
            "If you kept the metal threshold you should be fine, looks extremely close you usually don’t get that lucky to find such a close match",
            "i matched pretty well ngl. and the lighting for the floor in the kitchen would make it adorable",
            "Just go with that and put a runner thru the doorway to bridge the space and cover the edge where they meet. Nobody would notice, I guarantee it.",
            "I think it’s fine, I’m more bothered by the back to back patterned pieces already in the floor.   \n\nI’ve only don’t flooring a few times but made sure to open multiple boxes and staggered the install with cutoffs to avoid brick or stairs layout.  Also made sure to get a type that had 5 or 6 separate patterns.\n\nIf you do find your supply requires this to occur though, try to plan to put them in places that would be harder to see…. Not an entryway to a room.",
            "Something completely different, not a wood product in the kitchen. There'll be a day when you have a dishwasher leak and you'll go into the kitchen to find your nice wood floor pup-tented from the water. Consider this advice to only purchase a dishwasher with a stainless tub, as well. Plastic tubs can warp, causing it to leak all over said wood floor.",
            "best way to check is to put it on top of the existing one for a few days and if it \"disappears\" into the existing floor, you're good. Look super close to me, but not a perfect match.",
            "Close but one is wider wood",
            "It’s close in color but not in pattern. The sample is like a stained red oak and the one on the floor is a walnut pattern to me. Wether that’s enough for someone to notice or care is up to you.",
            "I thinks its pretty spot on, after you add a transition strip separating the rooms I feel like it will look very good.",
            "Might be an argument there that displaying the sample behind a light background in a room that shows more lighting will make the sample appear to look lighter. Also there can be slight differences from production batches, maybe the sample batch may have had a tinge more lightness to it.",
            "Definitely close enough especially since the light always changes from room to room. Nobody will notice anything.",
            "Classic example of overthinking shit",
            "The color and texture is as close as I think you're going to get. I'd turn the orientation of the boards 90 degrees to minimize the visual impact of the difference in width.",
            "Hardwood in a kitchen. No thanks. Get tile. You will thank me if you ever have a water leak in your kitchen.",
            "The only differences I can tell could be explained by the new shine off the flooring sample. It looks brighter but that will wear off quickly. Run over it a bunch with roller skates or drive over it with a car tire and turn the tires a bit to wear it. See if it looks more like your old floor.",
            "In small scale it looks very simular but over an bigger area it gets a lot easier to spot the difference. Id personally go with something completely different just to not mix them up.",
            "I think it's totally acceptable, but it might bug the crap out of you looking at it every day. If you use a threshold of a slightly different tone, I think it will mask the transition better.",
            "Close enough to scrap it and do the kitchen instead!",
            "It’s noticeably different. I vote tile!! No wood grain floors.",
            "I think that’s a trick of the lighting, it’s probably a close enough match.",
            "Not close enough for us.",
            "WTF is that TV placement??",
            "No. Yes.",
            "I would consider choosing a different color that will match your kitchen renovation and compliment the existing wood. \n\nI have no idea what that would be but it’s an alternative to trying to match the existing wood.",
            "it doesn’t not match, but it’s slightly different enough that i would drive me bonkers personally",
            "Get a CG mockup of the spaces with various different options for the floor.\n\nI do not think a 'close enough' wood floor is a good option personally. Kitchens rarely have wood floors for good reason, so it would likely always seem out of place to most people.\n\nEven in a wood cabin most people would probably put down some kind of stone or tile in a kitchen (or linoleum that looked like stone or tile).",
            "It is noticeable that they aren't the same.  As stated, this would bother me the most. I would have to go with something different but complimenting personally.",
            "I’d go with it. And post the finished product so we all can critique it.",
            "is the OG floor glued down? I was wondering if you can scatter/mix in with the old, atleast close to the seam",
            "It’s a darn close match if not the same. \n\nSend it.",
            "My wife and I were afraid of the same thing, we decided to do a color contrast so it didn't seem like we were trying to match them.",
            "If it's not exactly the same choose something different. Samples are not the same as butting them up against each other.",
            "Make a feature out of it, as long as the two different floor boards aren’t side by side, you won’t notice. Get a really cool, funky, out there tile and just have a strip or two across the transition point to seperate them",
            "They're not identical but you could do it. Maybe add a marble threshold to divide them.",
            "No way to tell from a photo.  Digital cameras are terrible for Color comparison unless you can get a shot of the exact same light level in the same location.  \n\nPattern looks close enough, but to me it looks like vinyl plank while you have hardwood in the other room.  That will be very very noticeable due to different levels of refraction.",
            "I mean, it's close enough to be the same style but it isn't a direct match. It would bother me forever if I meant for it to match and it didn't, but I would just look at this as different but still totally fine.",
            "The stain looks really close, but the big difference to the eye is the type of wood or the wood grain they are mimicking. New stuff looks like oak while old stuff looks like hickory or ash. Not sure if it is but the grain seems different.",
            "Ask the floor guy to match it up for you.",
            "All wood is so nice, we extended the same flooring best we could into our kitchen and it looks beautiful. The continuity is really nice and lets the eye rest on other things like nice cabinets or counters",
            "What if you put a real dark contrasting piece of wood at the transition?\n\nThe contrast would make it much harder to notice the color difference because they are pretty close.\n\nPlus a nice room transition looks high end.\n\nMoving the outlet for the tv up to be hidden is pretty easy too.\n\nPut a mid-century modern console table underneath the TV. Wayfair has some nice stuff just search for the hardwood versions.",
            "Close enough. If you have floor return to separate the two, it shouldn't be too jarring.",
            "If the floors are getting refinished rather than a prefab, the floorer should be able to make a perfect match. I say this as someone whose father has specialized in hardwood flooring for 40+ years.",
            "If you are asking, you know that it’s not good enough. Go with a grayscale tile instead. It’s worth taking some time to decide what you want. Do some research into different options, there’s so much information out there.",
            "It’s a great match",
            "i wud intentionally put a random\npiece of darker or lighter hardwood in the opposing direction at the seam ( where they wud meet) to add some uniqueness and soften the transition from the two floors.",
            "Does not match.",
            "It would bother me personally since it isn’t exact. I would go complementary instead.",
            "For me, close but not quite is a greater contrast than different. \n\nIt is close.\n\nI would choose something complementary though.",
            "I had a similar problem when matching 2 red tiles in a bathroom after they were smashed during repairs. The replacement was close but I could still tell. I just filled it in with the other tile that was in the bathroom (still in production) and it looks like no work had been done.\n\nSame thing with the laminate in the kitchen. Oxidation did it's thing and it's a pain to look at. A light patina varnish helped but I can still tell that it's lighter and the texture isn't the same. Next time I would just contrast it or match it with the floor or replace all the laminate from the bottom cupboards.",
            "Put a strip of something the width of the stuff wall for the transition so it isn't literally side by side. Your kitchen looks brighter anyways which will make anything look different. The kitchen looks like florescent lights",
            "It's very close. I'm a color snob, and it's a about 1 to 2 shade more red (orange) than your other floor, but that is literally the difference between an extra coat of poly, so it's a miniscule difference that a few years of ware may fix",
            "It’s so close legit not one person would know and if they do they are asshats, don’t ever invite them for dinner again!!",
            "I think you’re messing with us, because it looks the same to me. That, or I need new glasses. \n\nPS, there’s a hair on the floor.",
            "Wow, that looks really close, actually.   Not perfect, maybe, but you're doing well to get that close in my experience.",
            "I wouldn’t try to match. It will change with exposure to sun/UV and may end up looking worse. I’d do a tile to compliment the floor.",
            "Use a tile laminate in the kitchen.  When I sold flooring my motto was “close but not quite is always the worst option”\n\nIt’s not a bad match at all but the different board widths will be what stands out the most",
            "Little more orange in the new material.",
            "And now to something completely different.",
            "I'd just not ever put LVP down, especially not in a kitchen",
            "Looks the same, or very close",
            "Looks fine to me",
            "We spent years trying to find a match for the existing floors. Got close a few times but then we'd see the samples at an angle with the sun coming into both rooms and they looked so far off that we'd always scrap it. \n\nEventually we went for a total contrast and got a dark espresso floor to offset the amber flooring in the other room. Did the job a couple summers ago and am still loving the look of it. \n\nGood luck!",
            "I don't know about the floor, but what's up with that TV mount...",
            "I can NOT tell a difference",
            "Do something different.",
            "I would go with contrasting color, something lighter to break up the visual.  We have wood floors and put ceramic rustic slate blue tiles in our small kitchen (white cabinets with lighter blue walls). We like it.",
            "Good enough but wouldn’t want that in the kitchen.",
            "Don't do it. It will never be perfect and you will notice it. Completely different looks fine, slightly different looks offputting",
            "You did a great job matching, but the dark floor is a serious downer in a kitchen.  You want bright, and also to be able to find crumbs on the floor.\n\nIf you put the floor in, not only will commenter Fatty's prediction here come true, but the next owner will post photos of how they converted their dark kitchen into a bright oasis.\n\nMight as well cut all that short.",
            "Close enough",
            "Don’t do it. It will drive you mad. Tell Tale Heart style. You will hear it squeaking in the night.",
            "Flip the wood going the other direction, so even if its not perfect it will be less noticable.",
            "I think it is perfectly fine.  I did something similar with lighter wood and LVP.  No-one notices.",
            "Pine vs oak",
            "Why not just put the sample on TOp of the wood floor to see if it matches….",
            "Why would you want the entire house to have the same brown flooring? The white kitchen floor is a nice contrast. Why change it?",
            "Either match exactly, or contrast. Just close enough will always look off",
            "it looks close enough",
            "I would put it on top of the piece you’re trying to match, not next to it.",
            "It's certainly closer than the blue floor.",
            "Doesn't match at all, the one on the left is more yellow toned and the one on the right is more orange. You might be able to get away with it if you are doing some sort of room separator but the color will not be seamless.",
            "Put a different colored accent piece and switch directions to really mask any difference in color",
            "Just tile the kitchen",
            "Im living in a house where there was water damage under the hardwood and they tried every manufacturer in ATL to find a match.  They never found a match bc of the 5yrs that had passed.  So it was either live with 2 different patterns or redo ALL of the floors throughout.",
            "Looks purty good to me",
            "It’s very close",
            "Definitely a contrast, like a bleached wood, or something lighter",
            "Design wise, a near match will stick out way more than a clear contrast",
            "I assume you want to use the sample in the kitchen.\n\nWhile the two are very similar, there is a difference.\n\nConsider running the kitchen flooring perpendicular to the living room. And if you are very brave and a talented, and the flooring is loose lay, make it a herringbone pattern.",
            "I'd put that test portion in the middle of the room. Check at night with typical lights on and in full sun. Having it in the middle will tell you how close it matches.\n\nPerfect = you can replace part that flooring with it. \nGood = you can use in adjacent room\nOther might mean keep looking",
            "It doesn’t have the repeating knot over and over and over, but otherwise yes?",
            "I would suggest using it but maybe put down a threshold between.",
            "To me, it would be too close but not close enough, if that makes sense. \n\nIt's like putting something intentionally at an angle, you have to have  that angle at a high enough degree so it appears intentional and not just wrong.\n\nPersonally I would go for completely different.",
            "I was concerned about this so we went with a totally different yet complementary tile in the kitchen. I didn't want it to look like a failed match.",
            "The fact you asked  tells me you know it is not an exact match.",
            "If it's gonna bother you, save for a while longer and do the whole floor on that level",
            "Close enough. Even if you put the same flooring down, the lighting in each room will be different. The floor will end up looking different anyway.",
            "I think it’s close enough.  We had to do the same thing and it turned out fine",
            "Tiles in wet areas.",
            "Just my two cents, do tile in the kitchen. Worked in restoration for 8 years, if you have engineered or hardwood floors they usually have to be replaced, but tile does not. Cuts the amount of time down to get back into the house.",
            "it's slightly lighter and would cause my OCD to act up but depends on where youre puttin it\n\nEDIT: realized that you would put it over the linoleum in the kitchen....maybe it's the lighting but if it's lighter it would make me crazy TBH I would just put tile over it",
            "That's astonishingly close. Idk if it's really wider or it's just set higher/closer to the camera.",
            "Kooks good enough to me.",
            "I think it’s really close. And I think if it’s really close but not perfect, you will notice the difference and that would bother me. I’d go with something completely different.",
            "No",
            "It does not match. Ive never understood this: if its unmatchable, go with a different style. Itll stand out that it doesnt fit in.",
            "I'll go with a completely different color because it's a completely different space. Or just go with this sample so that I can convince myself it's different because it's a different space",
            "It’s a wee bit lighter than the flooring you’re trying to match. But by all means a good fit.",
            "Personally, it's never going to be 100% match, so you might as well do something different.",
            "Can you weave the boards together?",
            "Too yellow. But I do this stuff for a living . I'd say as long as it won't drive you crazy .",
            "I’ve always wanted to take a contrasting color against the hardwood in the living room floor like white tile, or ashwood and speckle the kitchen floor with the living room flooring. The pattern you is up to you, but I’ve always thought that would be a fun and professional look with some personality.",
            "It's really close, honestly probably the closest you'll get to matching it. It will be different though, and you'll be able to tell. \n\nI'd go completely different in the kitchen anyways. Creating two separate spaces using the flooring helps the flow better. If it was more open then I'd consider trying to match it more but since there's the wall already creating a separate space different floors will feel better IMO. \n\nPlus I trust tile more for longevity and waterproofness. I'm awful at washing dishes and always get the floor wet. I'm much prefer the tile even if the vinyl is waterproof.",
            "You could do a threshold piece that is completely different from either of the floors, so it's harder to compare them. Or you could run the new kitchen flooring the opposite direction so that, again, it's a bit harder to compare them.",
            "It doesn't match, but only you can decide if it is close enough.",
            "What I did was buy an ugly strip of transition, a shade up, and then feather in the close match. This sounds insane, but it looks like the flooring didn't take in the stain in the same way for that section, or at some point replacement boards had to be put in of a similar type. So then the rest of the floor looks original and they replaced a spot with a leak or there were a few off color boards in a batch.",
            "\"Close enough for government work.\"",
            "They look the same to me, and I usually see every imperfection.\n\nI think it's just a different light, tbqh.",
            "The first picture I can see the difference ... the second picture I can't.  Funny I came across this post.. I am currently considering adding new flooring to my bedroom and am concerned about getting a matching wood",
            "No!",
            "The only person who will notice is you.. I’d go with the close match and replace that metal with almost the same color as your floor to give it an update.. sis has a kitchen like that and it looks great!",
            "I can't tell the difference. You would have very obsessive to notice even the slightest difference between the two.",
            "The biggest difference I noticed was the look of the wear on old flooring vs the new one. Maybe a fresh coat of wax, or a good polishing or some kind of treatment to put on both would smooth it out. I think that otherwise it's probably close enough that most wouldn't notice.",
            "Looks extremely close. I couldn't tell if I wasn't told",
            "I prefer a tile kitchen myself.",
            "The new planks seem a little wider, but the texture and color are the same, I think you should go with it.",
            "different",
            "If you will change the kitchen floor, just do something different to divide places.",
            "I'd go for tiles in the kitchen. That floor would make everything way too dark for my taste.",
            "I think it’s a very close match. But if you’re going to notice it, then do something different. Unless you could maybe blend it in somehow rather than having that threshold marker.",
            "weird spot for a TV, but you do you. at least you did not r/tvtoohigh",
            "Can you tile? Kitchens need waterproof surfaces if at all possible.",
            "It looks like a match to me, but then again, I have more matching outfits than anyone else thinks I have.",
            "I added a kitchen island. My philosophy was if I couldn’t match the existing counters EXACTLY, then I’d rather have total contrast. I had white counters. I made the new island black. It worked out perfectly.",
            "To me it's different, the lighting in each room will show a different kind light spectrum which can affect what colors you see. The floor sample has more texture and grain pattern. The original floor is a bit more flat and smooth looking.\n\nI think kitchen floors don't have to match, but definitely not that. Also look into changing out threshold. I personally like separation between the kitchen and adjacent room floors.",
            "It looks like a great match. I'd go with it.",
            "If you put that in your kitchen, I'd assume it's a lighting difference. It's amazingly close.",
            "Partially color blind guy here. Go for it. Looks great!",
            "Does not match",
            "i think you should burn it down and rebuild anything",
            "First, your living room floor is hideous.  I would guess you have gorgeous hardwood under it.  Your kitchen floor looks perfectly fine, I would spend a lot of time deciding what to do with the kitchen floor if anything.  The floors can make a huge difference.  I suggest tile.",
            "Probably as close as you can get without literally finding the same materials.\n\nHowever, I'd lean into separating the spaces and pick a floor that contrasts rather than matches. That may be a matter of taste.",
            "I’d do something different, wood like flooring bulges and warps when it gets wet, even just repeatedly or for a short amount of time (say a couple of hours). Think a leak or splashing while doing dishes, dropping a lot of liquid on the floor accidentally, etc\n\nIt’s annoying once it dries, gets uneven and makes the floor creek. \n\nBesides that, it’s hard to clean, stains easily, and some wood you have to carefully only use certain kinds of cleaning products. \n\nIt’s not easy to just replace with new in that spot, most likely have to redo entire panel expanse which normally means a 1/3 section of flooring at least.\n\nNot an ideal kitchen flooring product",
            "To be repeated until you move or fix it right!",
            "Terrifyingly accurate\n\n![gif](giphy|F3BeiZNq6VbDwyxzxF)",
            "Your comment gives me comfort. In this vast earth of humans, to know others feel this helps me feel connected. Thank you!",
            "This guy mismatches floors.",
            "Or just set a floor mat inside the doorway so it's that much harder to spot.",
            "Are you there every time I do project or something?\n\nI felt this.",
            "Nailed it",
            "Ha! Well said",
            "Too real.",
            "This is the most oddly specific thing I have ever seen",
            "My trick for that part of my brain is to go the other way - and instead of trying to \"mask\" the difference, I go for something somehow contrasting.\n\n\nThat will show my brain! :)",
            "This hits so close to home for me.",
            "Spot on",
            "I felt this",
            "I am the exact same way, and had the same conundrum as OP. We decided to do a \"marble\" style in the kitchen, because there was no wood grain style LVP that matched the rest of the house's real hard wood well enough for me not to notice and fixate on it. I'm really happy with our new floors though, so we made the right choice.",
            "I’ve never felt more heard in my life.",
            "I have the same thing about my yard. There is 1 imperfection that nobody else can see, then I point it out and they go \"nope don't see it\" then I get on my hands and knees and point it out and they have to turn their head sideways and say \"oh umm sure I guess?\". Repeat forever",
            "Nice observation. Are you a psychologist?",
            "End thread. \n\nSolution is gut the whole house.",
            "I have never heard this phenominon described better.   \n  \nI feel you have been sent to lead us.   \n  \nDo you have the secret to eternal life?!?",
            "This is exacrky how it goes any time anyone compliments my floor where I got a near match to the existing flooring.",
            "This resonates with me",
            "Are you ... me? Damn that was creepy accurate...",
            "lol 100%!!!!!",
            "Get out of my head!",
            "I feel seen",
            "Holy shit get out of my head",
            "This hits too close to home.",
            "Get out of my head.",
            "This is so very accurate.",
            "Yeah, the slight difference might be enough to trigger my dislike. I never know for sure, but I have learned to avoid things like that.",
            "I have two different long black counter tops in my kitchen.  Put one in week later went back to the store when I was ready to put the other one in.  No more in stock might be weeks.  Need to finish my kitchen.  Go to a different store that has a similar counter top but a very different molding router.  I thought I would hate it forever.   Even when I point it out all anyone ever says is wow your kitchen is amazing ! I did a lot of work. My kitchen even has a chandelier.   \nI have since done so many other improvements including currently putting in my heated floor in my master bath.  \nUntil this post I had completely forgotten about the different counters in my kitchen and I am one of those people”who notice things” \nTake what you will form this but my TLDR is once the floor is finished and looks nice even you will have moved on in your mind to something else. If you like it do it. It’s very close to a match.",
            "This is correct answer",
            "I feel personally attacked",
            "Man that was pretty spot on…",
            "I feel personally attacked lol.",
            "I cried at this.",
            "I was gonna leave a comment on this thread, but it looks like I already did....",
            "I helped my cousin pick out a sample of grey fake wood flooring from 5 samples of nearly identical grey fake wood flooring to replace her 4 year old fake wood flooring, that was also grey.",
            "You’re killing me softly with your song.",
            "the not needed explanation is too real",
            "Unless the person you’re talking to is in my family, then after calling you crazy they’ll point out 3 other nitpicky problems you didn’t notice before walking off.",
            "Did you have to attack me so hard and so personally?",
            "Me when I took a literal CHUNK out of my bedroom wall to re-paint holes I had filled in from the previous owners' artwork, to then realize it's just a *touch* off.",
            "Guess that's why I replaced the power receptacle and skim coated the wall after some drywall work behind my fridge. I did it because I would know it wasn't done right and it would haunt me for the remaining time I have on this rock.",
            "Stop attacking all of us.",
            "After 8 to 10 years, he won't notice anymore.",
            "Oh hello there, me",
            "I felt this so much to my core lol",
            "You my man, understand the diy'ers dilemma",
            "This. Plus I think it looks nice to break up wood with tile or faux tile-look. Easy way to add different texture and much easier to replace if water issues then trying to find a match again.",
            "Agreed. I would Pick a different Colored floor I wouldn’t try that match. You came as close as you’re ever going to though.",
            "This.",
            "Wow that me 10000% me lol",
            "Any difference is minimal, you can simply attribute it to the difference in lighting of the rooms.",
            "that’s a good point too, considering how old the original flooring is, it could have looked exactly like the new flooring brand new. Gotta give it that foot oil patina 😩",
            "Personally I’d go for intentional contrast instead of very close.",
            "I was worried that having close but not identical flooring with a transition between my living room and hallway would bug me to no end. Turns out I don’t notice it at all.",
            "I think they are more worried about the thickness of the actual pieces, like those look like 2 inch and the other one is like 2.5 inch or soemthing. The lines on the wood, but I think it’ll look good either way, even better is the put a middle piece to separate them so they’re not up next to each other like in the pic.",
            "I disagree. Yes, they are very close. But once you put down a large section of the new flooring, the line between the two is going to be impossible not to see and could drive you crazy. If we are talking about a 2 - 4 square foot replacement in the corner of a room, this could be doable. If you are trying to match half a room with the other half of a room, for me, it would drive me nuts, and I would rather just redo the whole thing. But that’s just me. I know flooring is expensive, so do what you have to do.… If you go that route and it does bug you, just make a decision to let it go so it doesn’t.",
            "Looks great.  If it concerns you, you can get a small rug to put over the seam, that way the close intersection is not seen as often.",
            "Unlike that dangling TV cord that is screaming for cable management and everyone will notice and judge you for ignoring its anguish.",
            "You may want to consider running the kitchen planks at a 90 angle from the living room flooring.  Try laying a couple down in that direction and see how it looks.  you would need a transition strip between the rooms.",
            "Yes also changing cabinets and countertops to all white!",
            "100%. I’ve never been a fan of wood flooring in kitchens",
            "Yep I'd say tile in the kitchen.  I have wood floors in mine and whoever lived here before me warped them, probably from spilling water and continuing to walk on them.",
            "I think it’s good enough. Something not mentioned here yet is that you can hide minor differences buy installing a transition strip (probably have to anyway) and run the new flooring perpendicular. I’ve done this before with worse match and the eyes are way more forgiving with the break and the change in direction.",
            "If you want it to look \"close enough\" to fool people into thinking it's the same flooring, you're probably always going to be dissatisfied with it.  I personally have no problem with it being apparent that two adjacent floors are different as long as they don't clash.  The color tone match is great.  One thing you may want to double check before committing and kicking yourself forever is to stand back at a distance and make sure they have a similar shine from a glare, because that could make it stand out.  If that's important to you.  Some of those types of flooring have a real \"wood grain texture\" to their shine and that would be distracting if the old floor was sanded super smooth.",
            "I think it is extremely close.  Throw it on top of the current floor for a few days so you can judge it in different light during the day.  Don't rush.",
            "Something to think about...putting laminate or real wood in the kitchen means you have to worry about water (liquids) on the floor. Even just a little bit of water on laminate will start to bubble it if you don't clean it up fairly quickly. Lots of stuff spills on the floor, so you have to worry about staining too. I'd go with tiles in the kitchen. Easy to take care of and won't turn into a disaster. ALSO, you may find you need to roll out your fridge or oven, and you have to be EXTRA EXTRA carefull with wood or laminate flooring to not scratch it. \n\ntldr: Go with tile instead. WAY easier to maintain.",
            "All-white does not age well.",
            "If you decide to go with this similar flooring, try comparing it under different lighting conditions. It might look similar under all conditions, but it wouldn't hurt to pay attention if there are times of day where you get more sunlight, or if you have lightbulbs with different color temperatures.\n\nMaybe you won't mind, but you don't want to later decide to use different lightbulbs and learn the hard way it reveals a mismatch in your floor that bothers you.",
            "I have been around design for 42 years and I can confidently tell you that when you try to get close but aren’t an exact match it looks worse and it’s more noticeably an error then if you do something intentionally slightly different. Or greatly different. It doesn’t matter as long as you don’t try to get really close but can’t quite get there.",
            "You could also do a darker threshold strip or something, then start with this on the far side.  Since it isn't touching anymore, would be even harder to tell any difference",
            "I would honestly not be able to tell you the difference between those two, so it definitely looks close enough to me",
            "I'd go completely different. If you match it right it will look great. Otherwise you will always notice the 1% difference.",
            "I think it's too bright. I'd go with an earth tone.",
            " Much easier to clean the dropped spaghetti sauce on tile!  My vote is tile!",
            "+1, but I don't think they can go 90 degrees.  I think the dining room has the same floor and orientation as the living room looking through the pictures a few times.  I also think that's why OP went perpendicular on one view and parallel with the other.\n\nI'd probably go tile in the kitchen and go opposite of your cabinets and countertops for some contrast.  But I also don't think I'd want white cabinets again so I'd caution that too.  Maybe like a light wood cabinet with a darker tile.",
            "haha dont worry, it's on a movable tv mount. We move it out like that when we are watching something. Otherwise it is normally pushed right against the wall and not blocking any pathways :)",
            "My sister did something similar, and it's way less of a match than this one, and it still looks fine. They sanded and stained it all at once, though (get a professional if you do that. The staining part did not go well).",
            "I should have mentioned that we are installing all-white new cabinets and white quartz countertop!",
            "I agree. The contrast is nice. Plus, in a kitchen, tile can be nice and low maintenance and a nice contrast to wood.",
            "I did this with bathroom floor  both tceramic tiles. MB had tile and i wanted to come from the hallway. It was soooo close. I chose a threshold piece that brought both together.",
            "With this method you can also locate and neutralize any squeaks in the subfloor before laying your new flooring on top.\n\nBonus points in that your dishwasher won’t get trapped into the counter by the new higher flooring as it might if you just layered your new flooring over the old.",
            "haha yeah can't wait to get rid of them",
            "Name checks out",
            "there are enough of these in my house that some have cycled out.\n\ni can remember there was something wrong with my ceiling, but at this point i have forgotten what it was.",
            "Is fixing it right just reflooring the entire house?",
            "Definitely never gonna do the latter",
            "I too feel called out.",
            "This is the sort of thing I love about Reddit! And people in general, I guess \n\nYou may also enjoy r/doesanybodyelse",
            "May I recommend the Dictionary of Obscure Sorrows? Very much in this same vein. https://www.thedictionaryofobscuresorrows.com/words",
            "But he developed a really beautiful gradient, the walkthrough tells such a story! /s",
            "Yeah if you can visually separate the two floors it will make a huge difference. Our brains are really good at comparing tiny details when they're right next to each other and way worse at it the more you separate them visually. Even that metal divider on its own will help.",
            "Also I’d add a wooden threshold—don’t try to blend the floors together at all.",
            "I did too. \n\n*Stares at slightly misaligned cabinet door handle*",
            "foot oil patina ew lol",
            "Forget the TV cord, why is the TV sticking out halfway through the threshold lol\n\nActually, forget why - *how* is the TV sticking out like that? I half expect to see a mount on the wall centered somewhat above the plug but there's nothing there.",
            "Don't put it next to, to compare, put it on top and compare.  If on top it should feel seamless.  \n\nOn the side it looks a slight shade lighter, but this could be due to light shift.  Woodgrain pattern feels like it matches.",
            "If I can add something about changing, I'm a big fan of tiles on kitchen floor. When well done (with the right protection/vapor barrier under the tiles), it's something that might save you some money in case of water damage. Tiles won't get damaged by water the way many wood-based flooring would. Imo, it's also easier to clean.",
            "Good choice. Ahhh every house I've lived in had ugly brown contractor grade cabinets that were covered in ugly wood veneer lol. I'd love some nice white cabinets. \n\nMy recommendation that wouldn't match is bamboo floors. They won't screw up with water. And they will get wet lol. Or really, tile. IDK why tile would be less popular. Tile in a kitchen just makes sense.",
            "As someone who had wood floors in our kitchen - they got beat up pretty bad. We constantly had warping issues because we’d drip water around the sink while washing dishes and prepping food. We switched to tile and maintenance is so much easier/it looks so much better.\n\nIf you’re more meticulous about stuff like that, then good, you may be fine. But I’ll never choose wood flooring in my kitchen again.",
            "Thank god, those current cabinets are… dated… to be nice about it.",
            "In that case I would go with an almost black kitchen floor, and choose linoleum click squares. Looks great with a white kitchen and less prone to water damage than wood, and also easy to change a tile when you inevitably drop a knife on it.",
            "Doesn’t the flooring need to run perpendicular to the floor joists?",
            "It looks like the board width is slightly different, so definitely run it perpendicular. Otherwise the difference will be more obvious as the board seams get further apart.",
            "If you are not obsessed about looks then I would go for a softish vinyl. Much more comfy to walk/stand on, less shattered stuff after you drop them(and less marks), waterproof. All nice things to have in a kitchen.",
            "If you're prone to dropping spaghetti sauce you should choose a dark grout.",
            "I don't know - \"WetProtect® lifetime surface and subfloor waterproof warranty.\" makes it seem easy to clean. But it is a high-density fiberboard product - so regardless of warranty i wouldn't want it near water.",
            "Ooh okay, paint the baseboards, too, though!",
            "You could do a threshold in the floor with the same material as the counters that same width as that wall with one of the scrap pieces and then the two sections aren’t directly touching which would help separate the two so it’s harder to pick up the slight difference",
            "Sure......cause I'm 12, can't see well and usernames are real. lol",
            "Reminds me of a convo I had with my cousin. As a  recent homeowner in an old house, I told him how overwhelmed we were at all the projects that still needed doing, and asked if they ever feel like they've \"caught up\" and gotten the house to where they wanted it, to which he replied \"Not really. By the time we got through everything, the projects we half-assed in the beginning were falling apart and needed to be redone. It kind of just keeps going.\"\n\nAh homeownership!",
            "Thank you, I will check it! Sounds like something I would enjoy! Have a great weekend!",
            "Yeah, from these pictures it looks like the metal divider will be enough to not notice the difference. OP got lucky because I've never had this much luck matching new to old flooring.",
            "If you can find a way to do some kind of decorative threshold it will make it impossible to tell the difference. \n\nI’d do something the whole width of that wall. That 5” gap will space it out so you can’t tell and make laying the new floor easier at the same time.",
            "Literally the story of my work life ;.;",
            "Gross but true",
            "Hahaha. It’s probably on a swivel mount of some sort.",
            "Blowing my mind. Thank you. Most certainly not in a stud.",
            "It's floating.",
            "I've been staring at that arrangement for 10 minutes. That would completely distract me from whether the wood flooring matched.",
            "Swivel mount that is almost perfectly hidden behind the TV.  Its likely setup that way so an L shaped couch works when viewing.\n\nWhen its not being watched,  you simply move it back to the middle of the wall,  its out of the way,  and can still play music or whatever.",
            "Am I nuts or are the plank widths different, though?",
            "I'm with you on the tile (but go with a dark grout!).  I have so many dings in my wood floor in the kitchen.",
            "I get what you're saying, but I think modern kitchen flooring design is over-kill.  How much of a mess are any of us really making?  I think the real damage just comes from cleaning it with excess moisture.",
            "Like you stepped off the set for Alf, maybe?",
            "People seem to disagree with you and I do too. But, my mom would love that plan, so you aren’t completely alone.",
            "I get the logic behind it, but I believe the subfloor is doing all the heavy lifting.",
            "Only in very old construction. All modern construction, both new and remodel, in the US uses an engineered wood subfloor of some sort. Usually this is plywood (or OSB, if you're cheap).\n\nNobody uses direct plank flooring any more. Besides the cost of the wood (thicker hardwood is more expensive), the cost to install (more complicated install, you definitely can't do anything prefinished because of height imperfections), there's also the issue of wood movement. Wood shrinks and expands naturally with changes in the seasons, and planks/boards are not dimensionally stable. So you will end up with gaps, which is more of an issue when those gaps open directly into the floor void.\n\nAlmost all hardwood flooring these days is an engineered product as well, basically high quality plywood with a finished/different top. And they're all installed over a subfloor. Even when doing remodel it is common to install a plywood subfloor over any existing boards, before installing the finish floor.\n\nSo direction basically doesn't matter. Plus there are a lot of slab foundation houses in US, where there aren't even any joists it's just concrete.",
            "I forget the brand name of the flooring we purchased for the upstairs in our woodworking shop, it is also water resistant, lifetime warranty, easy as heck to install.  Our dogs are getting older and we wanted something that could withstand accidents.",
            "Can confirm, even when a repair is done correctly, in the process you'll discover three other things that need attention, some of which can be put off for another day and some that immefiately go to the top of the list",
            "Thank you, you too! :)",
            "Exactly my thoughts",
            "Or worse, it is on a stud. Aka the door frame...",
            "Yeah I think pic two shows a quarter inch difference.  \n\nI grew up with laminate.  It was very durable and easy to manage.  But now that I am older I would save for some form of hardwood or really nice bamboo (some bamboo does not \"hide\" things very well).  You might even be able to source it off of craigslist from one of the wood dealers in the area.",
            "Second the tile idea! As a young man, I helped my grandfather rip out the wood floor their kitchen and replace it with tile... the wood all around the sink area was soft and spongy from years and years of slow water damage. Tile is the way to go: water proof, and classy as heck! But yeah, dark grout; no one wants to see the dirt that accumulates in the cracks.",
            "I'd rather dings than a cracked tile from a dropped pan",
            "The \"easier to clean\" is not the selling point; it's a detail. The \"you've got a major leak on the fridge water tubing\" or \"the plumbing under the sink is failing\" will cause much more damage to wood-based flooring than mopping the floor with a lot of water and thus require more money to repair.",
            "With mainly Americans here I guess you have to suggest dark wood floors, dark wood cabinets, dark wood furniture, everything to achieve that vampire home look.",
            "Agreed 10,000%’",
            "And there's nothing more permanent than a temporary fix that works.",
            "https://youtu.be/AbSehcT19u0?si=FiG_nQAO9ZKU2Duj",
            "That's true, but I get dents from everything, including dropped forks. If installed right I think tile would still be my personal preference.",
            "Or a thousand broken bowls, plates, and cups over the years! My kitchen has granite counter tops and granite tiles... I've broken so many things, it's relentless 😭\n\nTiles still look great though, lol.",
            "Wood is a big part of our architecture for sure. Plentiful timber and lots of miles to travel across meant wood was a often a better choice than stone or other materials. Made a big impact on what we expect to see in a home.",
            "This makes me feel slightly better.",
            "Holy shit, truer words have never been said."
        ]
    },
    "What can I do to prevent this water pooling in my backyard?": {
        "title": "What can I do to prevent this water pooling in my backyard?",
        "score": 352,
        "url": "https://i.redd.it/mz917xyt208d1.jpeg",
        "content": "Hi, we bought this house last year and are looking to get the interlocking tiles pressure washed, resanded and sealer to improve the aesthetic and prevent weed regrowth. This seems like a cheaper option rather than replacing the whole tiles. Before I do that, I'm worried about the water pooling in the backyard. The yard slopes down to the flowerbed at the back and there is nowhere for the water to get other than slowing seeping into ground through gaps in tiles and flowerbed wall. Is there an inexpensive or DIY way to rectify this issue? ",
        "num_comments": 288,
        "comments": [
            "You need to put a drain in",
            "Unfortunately you'll have to\n\nA. Take some pavers out to dig and install a drain. The drain needs to be connected to a pipe to let the water out to the public storm drain/street, or\n\nB. Rebuild the patio with the correct slope to direct water away.\n\nNeither is a small project.",
            "Whoever installed it should have planned out drainage from the start, particularly if the surface is not porous and has been grouted with cement or mortar. A fall should have been built into the patio area based on it's layout, to channel surface water to available storm drainage or a soakaway. This looks like a basic design failure from the off.\n\nIn the words of a famous 80s song, 'rip it up and start again'.",
            "Lean into it. Build a gazebo and bridge, and add native frogs and vegetation!",
            "Hear me out:  water beads",
            "Do you have access to add a drain from the backyard down the side yard and out to the front? \n\nRules vary by area but generally as long as you don’t dump it directly into the sidewalk or street you’ll be ok.",
            "![gif](giphy|Czbn9E2vQBeppm7RD7)",
            "Why do you have patio furniture in your pond?",
            "Put in a pool.",
            "The reason it's collecting there is because it's a low spot.  Your options for mitigating it are really only making a drain, or redoing it so it's graded to drain away from the house and remove the low area.\n\nInstalling a drain is going to be the least labor for you.  You'll need to lift up pavers, and then setup a drain to run to either a pipe, or to some kind of drywell.  Considering you'll need to place it where you'll have people walking/sitting. Definitely should have it running to a drain pipe that runs towards the street or connects to the one your gutters drain into.",
            "A \"drain\" perhaps?",
            "I would put in a sump pit… likely the easiest thing to do.",
            "Look into installing a drywell (or multiple drywell's) under the pavers... you'll have to lift them up and use an auger to dig the well before rebuilding the paver base over the drywell but afterwards everything would look the same. The water would still drain out between the tiles but now there would be somewhere for it to go.",
            "Kind of hard to tell without seeing the rest of the yard but a french drain might help.\n\n\\*edit\\*\n\nLooking at this again you could create a gap on the retaining wall (maybe 2) and put the French drain underneath of the flower bed (level with the patio).\n\nReally this is a cheap and relatively easy fix and mostly cost some elbow grease.",
            "French drain—have it move the water away from your foundation.",
            "Im gonna start calling every patio i do \"interlocking tiles\" from now on.",
            "Drink it",
            "If a drain is illogical right now, and you have power nearby, you could pull up a few pavers, sink a sump  basin with a grate on top, and run a sump pump when it rains heavy. It should have a way to connect a garden hose so you can send the water somewhere more receptive. Just not a household drain for gods sake",
            "My first thought is, surely the builder had a notion of where water would go.  So try to figure out the lowest point and why water isn’t still going that way.  Maybe it just needs to be dug out again from accumulated sediment.  \n\nOther than that, only some drain system as other have said.  I just mean:  assume this was solved and find why it isn’t working still.  If that doesn’t pan out, go “OMG, that hardscape dude was an idiot” and then you’ll have to remedy it the way it should have been done.  Great hardscape artists are also fantastic with assuaging water retention in my experience.  They truly care about their work and don’t want water issue to make you hate it!",
            "Hire the right guy for the job next time. It is  very expensive to do the job twice! \nNow the patio needs to be lifted up and a proper French drain or weeping tile needs to be installed with a perforated sock covered big 'o' put in place covered in gravel. Then the patio can be re-layed. \nOR pull up the patio and slope it away from the house and add a trench drain at the far end with a grate on top.",
            "Add fish",
            "I think you gotta give the water someplace else to go. I’m no plumber though.. 🤷",
            "It might be pricy but redoing the slope of the backyard with concrete underneath the patio portion and a drain in the yard is the way to go.  We did it and we live in a very rainy area with frequent floods and our backyard drains amazingly well.  It has a slight slope to direct the water away from the seating area but you can level your table and it’s not noticeable and well worth it.  You may want to talk to a concrete contractor that does driveways to just do that part and you really can DIY the rest.",
            "French drain",
            "Build a raised deck over the patio",
            "Put some koi fish in it",
            "I'd run a linear drain (with perforated walls) right thru the middle of the patio (it will just look like a long plastic grate) and fall it towards whichever side of yer yard is downgrade. This way you won't hafta dig nearly as deep as you would to run the round drain tile under it.",
            "If normal drainage seems prohibitive try this [vertical drain](https://youtu.be/jaRAXSO4f8g?si=m0yxUgr6RknFUPPJ)",
            "How deep does the water get? If it’s just a inch or so I would say the easiest solution would be to pull up pavers in the deepest spot and put in a French drain. Or you could put in a water vault with a small sump pump that redirects the water to a yard for watering when it isn’t raining.",
            "This is a French drain kinda situation in my book.",
            "![gif](giphy|iqkUhBIdNOetJWXtNx)",
            "Drainage, why was that not put it before laying all that down 🤦",
            "Depending on your soil you may dig a big hole and fill it with rocks and gravel and then drain to this so it can then filter out the water and drain to below ground if you don't have anyway to drain directly to somewhere proper.",
            "Core drill n install pvc pipe w rocks as deep as you can",
            "I do not know what I'm talking about but hear me out: take out a few pavers in the deepest part (maybe 4?) and drill a deep deep hole, think well.  Fill with course gravel and maybe drainage fabric and top with a drain.  A sort of vertical French drain.",
            "You could do a \"dry well\" if that's the low end of the yard.",
            "install drain",
            "Install a drain",
            "This is a bad idea… but could you get a couple marine pumps and put them on the patio with houses that route a good distance away? I know it’s not permanent but should work until you are ready to excavate, install drains and rebuild",
            "Build a pool?",
            "Get some flippers and enjoy your free pool.",
            "If you don't want to run a drain, you could take several small PVC and drain it at an angle to the planters. Not sure how much planter space there is as this would need a ton to sponge out correctly.",
            "I'd recommend draining the water",
            "Buy a giant umbrella",
            "Get a pool",
            "Install a heated filter pump and some of those floaties with the cup holders built into them.",
            "buy a pack of very thirsty dogs, or perhaps a drain.",
            "I'd get this fixed reasonably quick though.. that much water has gotta be doing damage somewhere",
            "This is a drainage issue.",
            "Def here for the comments   had a patio put in. First big rainstorm flooded like this. Called, emailed the installation company right away and they never responded. They knew they shouldn't have put the pavers level with my back room foundation and didn't slope in the least. Except back to my back room. So it floods every time.   Just don't understand how a known company could do someone like this.    I was wondering if it would be possible to somehow cut a channel in the pavers to direct the water away?",
            "If there is already a drain clean it out.  If there is not, you may need to put one in.",
            "You just need floaties.",
            "Just raise the whole lot by 6\"",
            "Make it a pool",
            "If you want it to stop puddling, then you need to put some gravel beneath the tiles with some agpipes.\n\nEither that, or put in a drain and possibly relevel the ground so all the water leads to it.\n\nJust make sure the drain isn't level with the surface and has some depth to it so water can still enter it below the tile level.",
            "Drainage for $500 please, Alex",
            "Rather than your other suggestions look at what a French drain is \n\nBasically you dig a hole five feet across and 20 ft down and put a bunch of drainage rock in there \n\nLike for a septic system \n\nDepending on how much water you're talking about you may have to make it bigger than that unless you can just make a trench and fill it with Rock and let it just run down someplace",
            "![gif](giphy|FNHMSbm9QYpGM|downsized)",
            "Slope it in to drainage......",
            "Suck it up buttercup. Literally and figuratively.",
            "Have drainage",
            "A 3\" squeegee broom, [sweep it under a rug].",
            "I’d drain it, maybe with a pump.",
            "The best option would be to customize that flower bed. Im thinking a 2 level flower bed with the bottom being a “reservoir” with a pump that irrigates the the soil and what ever other plants are near by. Just have the pump be accessible for maintenance.",
            "Add Koi fish to scare the water away",
            "Sell the house and move",
            "A french drain would help, but if you have an extraordinary heavy rain, they can get too full, and take a while to empty out. They can also attract a lot of mosquitos.  A trench drain would work better.",
            "Le French drain",
            "I was gonna tell you call a pool guy and tell him you have the bottom done",
            "I’m amazed someone built that. Outside. Where it rains.",
            "2% slope to shed water.",
            "I’d say a drain would work",
            "Move it to Arizona",
            "out of curiosity, how deep does it get?  All the way up the wall?",
            "Dirt",
            "Global warming will solve it for you",
            "Move",
            "One word…drainage.",
            "Drain it maybe?",
            "So, to be clever like the other answers here-it floods because you made what was supposed to be open/vegetated/pervious space impervious and now you have flooding.  This is what happens when you do that.  You need to remove the impervious properly installed very nice pavers and replace with pervious pavers or grass or a bee garden.",
            "Gumboots?",
            "Build the sides a bit higher and you will get a swimming pool!",
            "mop",
            "sponge",
            "Ask for less rain",
            "Bilge pump",
            "Obviously hasn't been graded properly, not sure if a drain would make any difference as water would only drain next to drain.",
            "Redneck engineering solution: \n\n1. Find a place where the water is deepest around the perimeter.\n2. Remove a tile(s)\n3. Dig a hole under it\n4. Line the hole with tile or plastic\n5. Insert sump-pump into hole\n6. Run hose from pump to discharge point\n6. Plug in pump\n7. Cover hole with grate",
            "Insufficient drainage when the patio was installed. You will need to install a drain.",
            "Try not to let it get wet.",
            "You just need a big squeegee /Jk.\n\nIt's time to Dig some drain tiles  maybe even a dry well if the problem is that bad.",
            "Since the design gotten rid of much of the grass, there isn't much to soak up the water.  Only choice is to slope it towards city drainage, or drain pipe to drainage.",
            "Seed microclover in all the cracks, it blooms maybe once a year if at all, it’s a great grass alternative that out competes most weeds and it would soak that water right up in a few hours under the right conditions. That’s my 2 cents",
            "Yeah, you really should do it right and put in some sort of drainage. The list of issues that can cause is plentiful.",
            "I would suggest removing your furniture from the pool.",
            "Insert \"drain\" here.",
            "jokes on you thats a koi pond",
            "Did you install the pavers over clay?",
            "make a pool when you are given standing water",
            "Sump pump",
            "Tiling off the back side and dump it into your neighbors property.",
            "Move",
            "Don’t have such an immaculately level and sealed patio.",
            "This is a big job my friend.",
            "Sponges. Sponges everywhere",
            "Just add chlorine and use as a swimming pool :)",
            "Drink it. A straw may help!",
            "Dig a pool.",
            "Turn off the water",
            "Provide it a way to drain and slope it to there.",
            "No",
            "Check out Apple Drains and Gate City on YouTube. \nIt’s not complicated but it’s not easy.",
            "Did they not install a drain system!?",
            "I'm thoroughly impressed, never having done pavers or anything, with how much water pooled without any drainage. Holy shit!",
            "I would just relocate those chairs / table and you have yourself a free swimming pool!",
            "Nestle sign,",
            "Enjoy your new swimming pool. ",
            "how long is your rain season ? maybe just get a pump and a hose, turn it on when needed",
            "No easy way to do it. The water needs a downward path away from your yard. You need to remove some pavers and install a proper drainage system. Or reslope but not sure what's to the left or right of the photo.",
            "It's hard to say what the solution is without seeing the whole yard and possible outlets for water drainage. Earth drains to a lower area may be enough. It may need to drain to storm drains. But in any event there's some digging to be done and pipe and or earth drains installed. \n\nIt may not be a huge deal, but it needs to be done since water is building up around that retaining wall and close to the house, aside from the whole patio being flooded. And all those pavers and brick can be reused where ever they're taken out. So it might not be that bad, it's just not fun DIY. \n\nThe other unknown is what's under the patio. Is there a proper layer of gravel and sand? Are there any buried earth drains around the edges? Or are those pavers basically sitting on dirt?",
            "Big shammy",
            "Install a diving board?",
            "It needs a shrubbery\n\n![gif](giphy|zfrS4JMOihJD2)",
            "Pump if a drain is too much work. Bilge pump over the fence into neighbours garden",
            "Be patient and wait for it to seep and evaporate. We all deal with some of these issues. It's a lovely patio.",
            "Throw rocks at the rain until it goes away.",
            "Maybe a French drain. That’s what we had installed and it solved the issue.",
            "If you somehow successfully seal it, you are going to make a boat.\n\nWater flows downhill, for the most part.  It's heavy, and gravity pulls on it.  Well, ok, not gravity specifically, but gravity describes whatever is pulling on it.",
            "Move",
            "Make it a pool and you won't have a flooded yard anymore <3",
            "Some soil and plants",
            "Try to stop the rain from happening",
            "Where is the closest low ground.",
            "Here comes the french drain brigade. What have you done man, you have doomed us all.",
            "A competent landscape architect would have installed a drain. Mine wasn’t competent. When I requested/suggested a drain he said, “That’s a great idea.”",
            "Yes there's an easy solution, but it will cause you problems later.\n\n\nBetter solution, pull up the pavers and install a French drain underneath then put em back on with an easy drain path into the underlying French drain.",
            "Look at the drainage in the wall. Normally every other brick shouldn't have mortar to allow to drain into soil.\n\nEdit: of the retaining wall. You might be able to carve it drainage holes into the soil below or in the flower bed. Either way they didn't know what they were doing.",
            "Swim",
            "Get rid of the tiles and turn your yard in an actual yard instead of a parking lot for outdoor furniture",
            "Build a giant microwave around your backyard to boil it away",
            "Stop the rain from falling",
            "[My pal Daniel Plainview knows](https://www.youtube.com/watch?v=8bqlaZ55lJQ)",
            "I have a similar situation in my backyard. In time I will put down a drain and pipes. For now, I went to building market and bought a pump.\n\nDug a hole, lined the edges with bricks and put a the pump down there. When it rains a lot, I just pump the water to the nearest drain, which is through the hedge in the street.",
            "Remove those chairs from children's pool.",
            "We have a similar set up. Previous owners installed a sump pump. I'm glad they did. The water is quickly removed to a pipe in the front yard. That's what I would recommend for this area.",
            "Sump pump",
            "I would come up with something like this: \n\n3D print a plastic spiral and some scoop type of things, just a tiny bit narrower then the width of a pipe. Sink a pipe into the ground a little way, next to the flower bed. \n\nAttach a wind powered spinner thing (looks like cups on sticks) to the scoopy spiral. Put holes in appropriate places in the pipe.\n\nImprove as necessary.\n\nBasically what I've just tried to describe is a wind-powered elevator for water. When it rains, water pools around the bottom, where there's a hole to let it fill a scoop. When the wind blows the plastic spiral pushes the scoops full of water upwards, where they then empty the water into your flower bed. Following from the basic idea, there's a lot of room to improve it, probably a number of flaws too. I basically thought it up on a train. But harnessing the power of wind for this should be a breeze\n\nEDIT:\n\nMaybe instead of a scoop elevator, you could make a variant of the duck slide children's toy. Have little buckets of water slowly climb 'stairs' before emptying into your flowerbed and rolling back down to the bottom for a refill",
            "Prevent it??You need to throw some Koi in there,and you'll be all set.",
            "Put in a drainage system?",
            "Need some holes for the water to escape to.",
            "2 gulleys will drain that area sufficient",
            "🤣🤣",
            "Get a different backyard. Man people ask weird questions on here.",
            "Add Koi fish",
            "Sump/soak away drain is your easiest solution.\n4ft deep, at least 1ft diameter in the lowest part of the patio and (hopefully) as far away from your house as possible. Filter at the top then drain grill.\n\nIf it overfills that, then you've got a long term issue to fix which will need to linked in to mains. Big, messy and expensive.",
            "Why did you put your dining set in your pool?",
            "Get some ducks.",
            "make some drainage, really simple.",
            "You’re going to need a pool liner and some duck tape…hear me out",
            "So can you create a notch in the back by the fence?   Will it drain out there?\n\nYou should bury a french drain under the flower bed and take the water you see coming away.",
            "Maybe a drain? Just my simple observation.",
            "Drain it. It is tough to see from the single photo but you should be able to do assuming the property has the minimal amount of grade aka some PVC, elbow grease and an afternoon can get this solved.",
            "This is what I did and people are going to say it's wrong probably but it works.\n\nI bought a dry well and installed it under where the most water pooled with drain that lead strait into it \n\nThen I realized that while that got the large majority of the water there were 3 small puddles that pooled since the ground wasn't sloped to the drain so instead of tearing everything up ans shopping it a little which I guess is tbe correct thing to do, I ran 3 pipes of 2 inch pvc from those puddles to the dry well with decorative drains on top. I still had to take up some stone but not nearly as much. \n\nIt's fine now",
            "That's not a yard.",
            "Ask it nicely to not pool there",
            "Rice and socks filled with rice.",
            "First, you get a straw. Then─\n\nNo but seriously, the only thing you really can do is pull up some pavers and dig a French drain, but you're going to have to go through the flower bed and fence, too. You *could* try an automatic straw, ie a pump, I guess.",
            "Turn off the water?",
            "Turn it into a Koi pond.",
            "Why not just make it into a pool. \n\nBut yeah, a drain is going to help lots",
            "Look up \"water bug pump\".",
            "Just build a wood deck over the pavers. Out of sight out mind.",
            "Lol pour bags of rice 🍚 jk",
            "Water has to go somewhere. If you don’t give it a path it’ll find its own way.",
            "This is the only answer",
            "Or buy a sump pump.",
            "[deleted]",
            "But why did he need this answer?  Trench and insert a drain.  What? You worried about the tile?  If so, enjoy the swim! WT%",
            "C. Tear out the patio, install geotextile, 4\" of #57 stone, 2\" of #8 stone, and permeable pavers.\n\nIf you really want to make it bigger project. This might be your only option if you can't daylight a drain anywhere.",
            "Thank you. I'm gonna explore the option A.",
            "2 other options:\n\n1: put a slanted roof over it\n\n2: scoop it out with a tiny cup",
            "Needs to check municipal/ HOA standards to see if this option is allowed. If in an HOA, the green belt may be a retention basin for this purpose.",
            "C combine A B and do itjon top of the current pavers. Saves on a lot of work and hauling out stuff. \n\nDon't ask me to do anything at your home lol.",
            "Could always remove 6 bricks and put in a small sump pump",
            "C. Get rubber ducks 😆😆😆",
            "> The drain needs to be connected to a pipe to let the water out to the public storm drain/street, or\n\nHow about a drywell?",
            "You need a nice day for a light digging.\n\nA nice day to…",
            "Lol that song rules",
            "a causeway!",
            "More like dive into it",
            "This is the most economical solution",
            "[Oh no, not again.](https://youtu.be/kKKg5fzIKeE)",
            "Hmm. I got a buck of packs of silica gel. Will that work?",
            "Tks for the response. Draining to the front would be difficult, the only way I can think of is draining behind the flowerbed and into the backyard behind the fence and then hope their backyard is graded right.",
            "Already got a head start!",
            "Pool sellers HATE this one trick",
            "To be clear even though this is the least amount of labor it’s still ALOT of labor.  I would consider paying someone to come in and do it.",
            "Noted. Thank you",
            "Thank you!",
            "Unless you drained it to system with the capacity for the increase all you are going to do with this solution is make the water flood someone's Else's backyard, and if there is a public system in this neighborhood it may not be big enough for the increase runoff, so then you flood that system and potentially a whole street...  (one backyard paving won't do this alone but enough backyards together...)",
            "Genius!",
            "But rice is cheaper",
            "More like $5000",
            "Thanks much. This may be most feasible as draining this water elsewhere seems difficult.",
            "Equal parts rice to water!",
            "Checkmate atheists",
            "Plant rice, start a rice field, free rice!",
            "Nice rice paddy field",
            "Put it in the microwave",
            "Then you grow rice to replace the rice, flawless system",
            "Rice boiled in backyard water 1/10.",
            "Clean out the gunk in the mouse.",
            "Typo - you mean ice- skate!!",
            "I agree the retaining wall doesn’t have weep or drain slots",
            "…and it’s almost always toward the house foundation.",
            "Nope.\n\nRaise the floor. \n\nThat's what they did in Chicago.\nhttps://en.m.wikipedia.org/wiki/Raising_of_Chicago",
            "This has little to do with climate change and more to do with the fact that the backyard was turned into an actual bowl. It needs to be redesigned but a drain will probably do.",
            "some people have no idea about this stuff bro that’s the reason there’s a forum for them to seek help",
            "D. buy some fish and adapt to your surroundings",
            "Or…  stay with me on this. A sump pump.",
            "That only has a finite amount of space. Wouldn't it still flood? I would think that you'd want more stone... no? You've probably only got capacity for two inches of rain there.",
            "I like this approach best.  If the levels match up ok, you could put the new aggregate and pavers on top of the existing, if you can easily see that the water won't come that high.",
            "What’s so special about these stones? Do they absorb water?",
            "Make sure you drain from the lowest point.\n\nShould be obvious...but whoever put this patio in... Doesn't do obvious.",
            "Check out the Apple Drains channel on YouTube. The guy has tons of videos about this stuff and he even offers zoom consultations for your issues. Good dude. It looks like at least one person has already linked you to his video on vertical drainage.",
            "There are some interesting pumps that utilize a drip, but a small sump pump would definitely work",
            "Depending on the elevation and slope of ground around this area, it might not be that big of a deal. For example, if the ground were lower beyond the fence, then the drain could outlet there. Then the whole job is a drain, and a few feet of pipe. Or you might need to pipe it dozens of feet away. Or, if the ground slopes up away on this side of the house, regrading the whole thing may be necessary.",
            "Thimbles work best.",
            "Ok, I’ll bite\n\n… start again.",
            "Depending on how often it floods, they will remain moist all the time",
            "I've never seen this! 😲",
            "Exactly who I thought of. Who knew you could ruin your life with a big enough jar of those things?",
            "Probably what is happening is the neighbor already did this to you-this is what happens in dense urban areas, especially as lots get smaller.  You made what was supposed to be a pervious area and impervious area and when enough people in a small area do this someone gets flooded.  The drainage system in your development is probably already maxed out-you can contact the city public works department and find out but they don't make those systems any bigger than they have to and that means it is designed for the amount of pavement/concrete/pavers the neighborhood started with when new and everytime someone fills in a yard area that results in increased stormwater runoff and eventually you get your backyard situation. The only way to fix it is give the water somewhere to go-either to make someone elses problem (and in all likelihood this water was someone elses and is now your problem) or give it a place to go in your yard.  Pervious pavement system is probably the most realistic long lasting solution.",
            "That’s not legal my guy.",
            "In most countries you’re not allowed to use your neighbor’s property to deal with problems such as drainage which should have been solved on your own property. In other words: you can’t use the backyard behind the fence as drainage.",
            "Be sure to wash the rice first.",
            "Well is it sushi rice or basmati tho because it matters!!!!!",
            "With a pinch of salt.",
            "Just be sure to load up on ducks, too!",
            "This guy is wicked smaat!",
            "Negative",
            "They regraded Seattle too!\n\nhttps://en.wikipedia.org/wiki/Regrading_in_Seattle",
            "They still have drainage",
            "Now that’s the patio half full attitude I love to see",
            "Throw some goldfish in there and you got yourself unlimited wishes right in your backyard.",
            "I vote for this one",
            "E. Move.",
            "E. Install outdoor sump pump with outflow pipe over your fence into your neighbor’s yard.",
            "E. Tear out pavers and use 6 inches of item 4. Small enough to compact well yet still drain water away to the soil.",
            "E. Leave it alone and buy a pontoon boat.",
            "Yep. Find the low spot, dig a hole for a 5 gallon bucket. Run the tube to a lower spot",
            "Sometimes an extra two inches is all you need. At least that's what you wife said.\n\nBut, that's true. I typically assume you get about 3/8\" of storage per inch of stone. But, it all depends on what's under the stone. If it's good-draining soil, 2\" of storage should be okay. If it's clay soil, 6\" of #2 stone underneath the other stones would be better.\n\nObviously, a drain in the low point is ideal. But, if you can't daylight it to anywhere, this is the next best thing. It will just cost 1,000x more.",
            "They allow the water to flow through. If course, if they're sitting on top of clay, it's not going to do much. ",
            "A good contractor would use fork",
            "Hey little builder what have you done?",
            "Moist ugh that word",
            "Stupid sexy impervious hardscaping, always flooding something somewhere.",
            "Thank you, I agree!",
            "Rookie mistake! You only wash the rice first for indoor applications. Outdoor you need the *sticky* rice. [Like the great wall of China](https://en.wikipedia.org/wiki/Sticky_rice_mortar#:~:text=The%20bricks%20of%20the%20Great,water%20resistance%20than%20lime%20mortar)!",
            "So true! Rinse until the water runs clear. \n\nI have seen people go from the bag in to the rice cooker.... grossed me out man!",
            "Unless it's enriched rice.",
            "Uncle Roger does NOT approve.",
            "Omg - now craving basmati rice",
            "And give them plenty of ice water from Dunkin Donuts",
            "Why is there people sized furniture in your fishpond?",
            "Or run it to a high spot and transform the pool into a waterfall!",
            "I've made a patio that's all plumb.",
            "✨️mmmmmmoooooiiiissssstttttt✨️ and just warmer than body temp for extra ick hahahah",
            "![gif](giphy|LmCYGjPpr1SDS6FqZX|downsized)\n\n[https://youtu.be/LAKFv8AK8Oc?si=8UW5DrTJDeSC\\_9cA](https://youtu.be/LAKFv8AK8Oc?si=8UW5DrTJDeSC_9cA)",
            "Feels like it does nothing at all, nothing at all, nothing at all.",
            "Chortle.",
            "Bring it back!!",
            "Use the knuckle method!",
            "Enrice.",
            "So fragrant the basmati.",
            "Oh I love Munchkin!\n\nOh Motherfucker... Loved I guess",
            "Koi will keep growing if they're taken care of and I'm an optimist.",
            "Fish grow to their container, so they’re expecting people-sized fish",
            "I like the way you think.",
            "Imagine a grundle on a hot day",
            "You monster",
            "![gif](giphy|12U2rLJsNV0mIg)",
            "I liked this comment highly.",
            "This is how I was taught haha for those who don't know, fill pot with rice, fill with water until it reaches the first knuckle of you index finger with your finger just touching the surface of the rice",
            "I had to Google that word and now I hate you",
            "But if that isn't an accurate thought 😷🥴",
            "![gif](giphy|r49zgiCebaE0yd6UNn)\n\nRawr!",
            "Moister than an oyster."
        ]
    },
    "Can’t identify metal pipe/rebar coming from found in front of gas meters": {
        "title": "Can’t identify metal pipe/rebar coming from found in front of gas meters",
        "score": 169,
        "url": "https://www.reddit.com/gallery/1dlh2el",
        "content": "I was told it was safe to remove by a utility worker but I wanted another ops once he hardly looked at it. Metal piece seems solid all the way through and it’s in front of gas meter, it’s a tripping hazard \nBuilding is from 50’s 60’s multi unit San Diego \nThank you all for reading ! ",
        "num_comments": 54,
        "comments": [
            "I have three guesses: (1) it’s a guard to keep someone or something from running into the gas meters, or (2) it’s a guide for that hose back there - run that hose through it when watering things on the adjacent side of the house so the hose doesn’t kink on something else probably out of view to the right; or, (3) it was to chain a pet",
            "That’s a tripping pipe. People use to trip all over them, they still do, just not that common anymore. Nice find.",
            "this is where one of the attachment sites used to attach the chains that were used when san diego was stolen by carmen san diego by helicopter. youll find em all over the city. its probably safe to remove because its unlikely anyone is going to bother to steal san diego again since carmen san diego could be anywhere in the world",
            "For skateboarding 🛹",
            "Practical advise. If its hollow the pipe should flex a little given its length. If you cant flex it at all its probably solid.\n\nLess practical. If you're still unsure then hit it with a hammer. If it dents its hollow and you should be carful. What were you thinking?",
            "Badly placed bollard",
            "Do you see any black droppings the size of a grain of rice or tiny dumbbells/exercise bikes? Could be a pull up bar for mice.",
            "Back before automobiles, people would ride their horses to come check the meters. It's a tie-off for their horse so it didn't wander off",
            "Looks like a handle to lift that cover.   Are you on septic?  \n\nI'm just not sure why they put the gas through the cover... Hmmm....",
            "Take some sandpaper and sand off some of the oxidation.  Reason being, that white oxide looks suspiciously like what you sometimes see on battery terminals.  It could be some sort of copper grounding rod.    I'm not sure why it was installed like that but I also see holes around its diameter in the brick next to it",
            "OP try posting this on r/whatisthisthing\n\nVery large pool of people there, so hopefully you’ll have more luck (if not as much fun) there. 😁",
            "Yep!  You got a “big-ass pipe” expertly installed at foot level. \nBetter leave it: it’s connected to something.",
            "Haven’t any of you seen Twister? It’s to strep to when the tornado rips the structure away. The remake Twisters will bring you  up to speed.",
            "I'd pop the mortar on the side to see just how far down the pipe goes. Does it extend past the brick? Shouldn't do too much to it cosmetically since it's already patchy AF.",
            "That’s a custom 9x9 steel paver mold. The guy laying the bricks forgot to take it out and it all dried together. Wasn’t worth retrieving.",
            "Get some grind shoes and call it a day!",
            "It’s a protection system designed to protect against vehicular damage. Very old and out of regulation one but that is what it is. 8 years of natural gas inspection experience.",
            "Boot scraper. Used to have one by the back door.  Surprisingly pronounced tripping hazard even though it was only about a foot away from the wall.",
            "Looks like for cleaning off muddy boots",
            "Probably #1",
            "You got the gas meter, the water meter, the electrical meter, and the trip meter. ",
            "Lol I’m tired of tripping over it !",
            "> People use to trip all over them, they still do, ~~just not that common anymore~~ but they used to, too.",
            "Ah, I see. Thank you so much kind sir.",
            "What the actual fuck",
            "“We have Tony hawk at home”",
            "I got it with a hammer ! Didn’t budge !",
            "And poorly designed",
            "Am I in /r/shittyguesses?",
            "I want to belive you but I don't because it seems sus.\n\nGot any proof?",
            "It does look like a cover could be under there. It might help to know what city because some construction is regional and may the age of the house. \n\nAnother idea is something to lock a bike to.",
            "Had to scroll far to find an answer that makes sense",
            "A giant grounding rod. Ok, sure.",
            "Maybe there used to be a backup generator that was mounted and grounded there?",
            "The plans said 4\" guard instead of 4' guard and the installer never questioned it.\n\n\"What is this, a guard for ants?\"",
            "Who's coming out from the trip company to check my trip meter? Also what's the dollars/trip rate looking like these days",
            "That thing makes no damn sense and I hate it by just seeing it on Reddit. I’m tripping just thinking about it. Whoever installed that thing was straight up trippin. lol.",
            "I mean, you could just throw a rug over it. No one‘s gonna notice. 😂",
            "No problem, gumshoes",
            "Oh my god. I have no idea what it is, thought I’d check the comments to see and…your a gorgeous human with all these bs reply’s. Hope someone gives ya the answer.",
            "Regular or sledge?",
            "They’re just horsing around",
            "doesn't look like copper either, probably a bumper/bollard to keep cars from rolling into the meters",
            "I want to have stone henge lower down, here's a drawing",
            "It rounded, so that's a round trip! Twice the distance!",
            "Yeah even the dogs trip on it my best guess it’s a gas pipe marker but ????",
            "To keep cars from rolling into the meters, perhaps ?",
            "Good ol' Persuader",
            "They couldn't foal me",
            "\"...there was a Stonehenge monument on the stage that was in danger of being crushed by a dwarf.\"",
            "Big Moe or Little Moe?",
            "Horseshit!"
        ]
    }
}