{
    "When your community starts migrating to another site. (Also, a goblin)": {
        "title": "When your community starts migrating to another site. (Also, a goblin)",
        "score": 3456,
        "url": "https://i.redd.it/rde7kpu21qbb1.jpg",
        "content": "",
        "num_comments": 120,
        "comments": [
            "Dalimey and I currently mod over at https://ttrpg.network/c/rpgmemes",
            "Current problem I'm facing is that I have no clue where to go next. I almost exclusively use reddit mobile as my wind down before bed so while it's great to see new websites popping up I can't exactly follow them well",
            "Link: https://ttrpg.network/",
            "Problem is the website is formatted very different. In particular you have to click on something to actually view the image which defeats the purpose to me.",
            "Remember to unsubscribe on your way out of here folks. Kick spez where it hurts. Right in the active user numbers",
            "I don't get it. Why is this community in particular still being so weird about this? Your protest failed, as many said it would, and reddit is collectively shrugging its shoulders and moving on. Stop making this so weird. Stop holding the community hostage.",
            "I would like a dnd community app pls. \nWe could even have sections like “rpg help” or “Goblin mode”",
            "Just a reminder, if you're new to the fediverse, that you can access any community on any fediverse server, from any other! (subject to some federation magic you probably don't need to know)\n\nFor example, the RPGMemes community on TTRPG.network is https://ttrpg.network/c/rpgmemes\n\nHowever, if you're on lemmy.world, you can see that same community at https://lemmy.world/c/rpgmemes@ttrpg.network - and subscribe to it from there as well.\n\nGood luck and see you there!",
            "I wouldn’t call 1 new meme a day a „migration“, so ya‘all shouldn’t worry",
            "This isn't our subreddit anymore\n\nThey have replaced our elected moderators, changed our laws, punish us for things we have voted for like fascists they are\n\nEveryone, now it's time to leave.",
            "Guys, where are we moving to?",
            "i thought the ban was lifted. why is everyone leaving???",
            "The memes are just as trash there as they are here\n\n![gif](giphy|2p15M2c5lmc7u|downsized)",
            "All of you mods that are advertising this new site are still active Reddit users and moderators and have been since the protest. I don't see why.",
            "Well guys we did it, we really showed Spez, mods. Showed him that you’re a bunch of worthless twats",
            "I’m fine with this site, but for some reason my posts started getting auto-removed with no warning, so moving sites seems pretty tempting ngl",
            "I've checked out TTRPG.network but the UI really turns me off it",
            "Is there a reason why nothing new gets posted?",
            "Well, this post feels like it aged like milk",
            "is there an android app for this site?",
            "I hope more people go there and create communities for less popular rpgs",
            "Special day for this post…",
            "So, does this mean the mods are abandoning this sub, or is this comic referring to a userbase-driven initiative? Because the other pinned post is the poll on the future of the sub, and the overwhelming winner of that poll so far is \"return to normal but also allow NSFW content\", with the 2nd highest option being \"return to normal\". If the mods are ignoring that poll, that's not right.",
            "What about lemmy?",
            "I wish it looked better but its worth it.\n\nI just have a real hard time navigating around",
            "It seems like reddit's still trying to kill this group as I never get content from this in my feed and have to go specifically to it to see it ever.\n\nThe new place [https://ttrpg.network/c/rpgmemes](https://ttrpg.network/c/rpgmemes) has a much worse UI.  \n\nThere's r/nsfwdndmemes but have to click on everything to see it too.",
            "Did something happen to [https://ttrpg.network](https://ttrpg.network) ?\n\nI was logged out and can't login, main page shows me an error.\n\nIs this site dead?",
            "Too bad it's blocked at work.",
            "Will we get old meme formats cleared for use after “all of the creatives” are gone?",
            "Ok but what about the people who want to stay here?",
            "Guys you’re delusional if you think the casual redditor is going to go anywhere else to browse the content. This has happened before and the relocated sub always dies because this is just some random thing you scroll through when you’re distracted not your life",
            "what if we just all leave reddit? it might do something, but who knows, just a thought...",
            "Ah remember when dndmemes was in full rebellion and we'd just come here expressly hoping to find hot goblins, thank god that's o- oh who am I kidding I still do that.",
            "Well if that's the new meme site and this is gonna be mostly porn just change the name of the subreddit to stop misleading others",
            "Is there an app for mobile users?",
            "where do people find help with onboarding for the lemmy? (I use mastodon and the crossover is somehow not working)",
            "do they allow nsfw",
            "Issue I have is the new site is blocked by my work and this one isnt.",
            "I cant use the catcha",
            "reads like a psa not a complaint.......\n\ni think you convinced me.",
            "Yo same I’m happy alternatives are popping up but I just use the app at work",
            "And thats the problem with apps that are websites, they lure you in with a dedicated app, you need to make extra moves to navigate elsewhere. The only difference between reddit the app and reddit the website is that you get constant popups to use the app. Unless you know of a function on the app that really is worth the switch. Try the website and see if you can still wind down",
            "I'm enjoying the Fediverse through the use of Lemmy, but it's a better comparison to Reddit from about ten years ago than it is to Reddit today because of the relatively small userbase and the fact that it's not currently as diverse as Reddit came to be.\n\nMuch like when Reddit got big following the fall of Digg, the Threadiverse (Reddit-like Fediverse sites) is currently a little obsessed with how its predecessor is doing in an unhealthy way. It's not exclusively tech-heads using it, but they're overrepresented. A lot of the communities there right now are simply trying to replace ones that are already here and will fall apart because they're not being used or moderated well. (Right as I was joining, I saw someone create about thirty clone communities of Reddit subs that they were obviously not actually interested in running well, just so they would own all of them.) But I'm finding it useful and in some ways a lot better than Reddit is at the moment. But then, I've been on Reddit a long time and watched it go from something I liked to something I didn't gradually, so it being more like it was ten years ago (but hopefully with less racism and sexism this time...) is a good thing for me.\n\nHopefully, it will grow and improve the same way that Reddit did, but I understand why some people looking for the same experience they're getting here right now somewhere else. You're just not going to find that.",
            "you can browse the site there on mobile and it works great",
            "A whole bunch of people are working on mobile app clients that will work with any lemmy instance: https://lemmy.world/post/465785 (most of these are still heavily WIP)",
            "https://ttrpg.network is Lemmy. There's about half a dozen different Lemmy apps available. \n\n[Here's a thread of (Android) recommendations.](https://lemdro.id/post/11973) My personal favorite is Liftoff.\n\nSorry I'm not familiar with iPhone apps though I've heard they exist too.",
            "The site from the mods here is just another Lemmy server that can accessed from every other Lemmy server. It's all connected.\n\nApps for Android: \n\n* [Jerboa (\"official\" android app)](https://play.google.com/store/apps/details?id=com.jerboa)\n* [Connect](https://play.google.com/store/apps/details?id=com.kuroneko.lemmy_connect)\n* [Liftoff](https://play.google.com/store/apps/details?id=com.liftoffapp.liftoff)\n\nSync for Lemmy + Boost for Lemmy are worked on right now too.",
            "Why does nobody mention tumblr? I’ve notice I’ve been using that app more and more lately",
            "It's in the post: [http://ttrpg.network](http://ttrpg.network).\n\nIt's a reddit-like website. It's running on Lemmy, so if you make an account you can subscribe to communities on all the other sites that run the same system. And there's a bunch of apps for it.",
            "Yes you can. Put some damn effort into it.",
            "You can go to the new nsfw dndmemes on reddit. If we just migrate there, it should fix the problem.",
            "With all due respect? You shouldn’t be looking at a screen immediately before sleeping.",
            "There is a little expandable button in the top right corner of the thumbnails that you can click to expand an image https://i.imgur.com/C3YhRAm.png\n\nAdmittedly it's too small and strangely positioned, but it's there. Maybe someone can come up with a userstyle to change it. Or lemmy itself changes it.",
            "Ah yes, why would people be upset about Reddit banning the moderators, deleting half the content of the sub, changing the rules without the consent of the community, and destroying 3rd party tools that make it possible for disabled people to use the site?\n\nWhy would tabletop roleplayers in particular be sensitive to the treatment of minorities?\n\nWe may never know.",
            "Pretty funny to rant against a post expressing the views of this community, that was very popular with the community at large, then accuse the post of \"holding the community hostage\"\n\nIf you don't like this community, you could just ignore it.",
            "That's more or less what the website listed in the comic gives you! It's like a less pushy version of Reddit that's focused tightly on D&D/TTRPG content, and there are \\~55 TTRPG-related posts in the past 24 hours. The total active users this past month was 70k, up from just 1k on May 31st. The platform is growing rapidly and now has enough active content creators to keep the feed interesting.\n\nAlso, keep in mind that the first users on any platform are disproportionately engaged with it. Early adopters are power users who believe in a service. The community is relatively small, but vibrant.\n\nI recommend sorting by top, either past day or past 6-12 hours. Start with local to see what your preferred community is up to, then you can expand to all once you've caught up on your local group.\n\n\\---\n\nAlso, websites these days can work just about as well as an app when done right. Give the website a try and see what you think.",
            "Is there a discord?",
            "Your *elected* moderators? You voted for the mods?\n\nEdit: downvotes for asking a simple question. very anti fascist",
            "https://ttrpg.network\n\nhttps://kbin.social\n\nhttps://lemmy.world\n\nThey're all the same thing, so just pick the UI that you like the best, search for some subreddits you like, and start browsing.",
            "Reddit admins forcibly changed the policy of this sub, against the will of the community, permanently banned the three most active mods from all of reddit, and deleted a huge number of posts.\n\nMany of the more active members of the community have migrated to the site mentioned in the comic, where the community has control over its moderation and content.\n\nReddit still hasn't addressed the underlying issue that caused these protests in the first place, and doesn't plan to.",
            "The pinned FAQ probably helps explain that.",
            "Given that the mods are choosing to stay radio silent I can only assume their reason is \"because fuck you, that's why\"",
            "I assume the answer is in the comic itself - because everyone migrated to another site.",
            "It's about as useful as it was when it was posted - it tells people where they can go to and post memes while this sub is locked down. People might want to check it out, as it's more active than this place and pretty friendly.",
            "There are a number of links in the comments to this thread (but they're hidden, so you need to expand comments to see them).",
            "My post is 2 months old, The poll is current and not complete yet.",
            "the link in the comic is on lemmy.",
            "I imagine if \"all of the creatives\" are gone then \"old memes\" would be all that's left.",
            "well the answer to that turned out to be: Tough shit, enjoy this sub becoming one dude's karma farm",
            "thats fine, they're welcome to, but they arent owed content, so if the people making and posting content are going elsewhere, they can either make their own content, or go where the content is.",
            "Depends on why you want to stay here. There might be something out there that does what you want even better, you might have to work up the energy to get this place back on track, or you might just need someone to answer your questions about why people are leaving. The most important bit is though: even without this whole protest thing, this place would have changed anyway. Corporate were the ones who wanted to turn it into something else.",
            "The site linked is in a remarkably similar format, so it's literally just a matter of using a different bookmark or a different app for the same style of experience.\n\nRight now the \"relocated sub\" has about 50% of the post activity of this sub, with a greater proportion of original or new posts there. \n\n-----\n\nThe idea that any service on the internet is an unsinkable monolith is, historically, patently false. Myspace and Livejournal used to have huge amounts of traffic, Skype used to be the defacto voice app.\n\nThe web is transitory, and it's the users who determine which sites and services have traffic. The question is whether or not people are bothered enough by reddit's change of direction to make a change themselves.\n\n-----\n\nBut even if only a small proportion of the users here decide to move... they'll be forming a closer and more tight-knit community - and the people who *are* moving are significantly more likely to be proactive people who care more about their ecosystem - those users also tend to be the ones who create original content rather than rehashing old posts. If the \"casual redditor\" doesn't wanna go read them, they don't have to.",
            ">this is just some random thing you scroll through when you’re distracted not your life\n\nNo, it isn't. Not for the people that make content, not for those that spend a good amount of time here to interact with the **community**, and not for the mods either.\n\nI think way too many of you \"casual redditors\" forget you're browsing communities that were small and tight knit and full of interaction before you showed up in droves just for the content while ignoring the community.",
            "Bit late?",
            "I'm not 100% sure, I just use the web client. There's a lemmy subreddit, but I haven't found the help there to be very helpful so far.",
            "yes",
            "Try searching \"lemmy\" in the app store.\n\nPersonally I only browse on PC, but I've heard good things about Jerboa.",
            "I view pretty much everything as a website. I'm OK with that, and I don't trust Apps to not over-share.",
            "The website works fine.  Except you do not get spammed and block the more aggressive nonsense.  Do not use website apps more then needed.",
            "Agreed. It's the day's news, though. Hopefully, it'll subside when a new game drops or someone gets arrested or something.",
            "Now that I didn't know, thanks for the tip kind stranger",
            "because tumblr works closer to twitter or facebook than reddit (grouped by person rather than topic). the lemmy framework sorts things closer to how reddit does",
            "I'm not mentioning tumblr in this comic, because a large part of this community is specifically migrating to the site I mentioned, and I wanted to talk about that.\n\nPersonally, I post comics and art on tumblr weekly, and the handle to find them is included in the image :D",
            "Ironically I came to reddit from tumblr so I'm not too keen to head back anytime soon XD",
            "Because everyone on Tumblr moved to Twitter after they banned nsfw.",
            "because Tumblr is one of the few sites with a worse user interface and readability than Twitter. I have spent time on tumblr, if you put the effort in there is good content. theres also a lot of garbage and its a lot more work to filter the garbage out. plus everytime a half decent post gets popular you start seeing it in your feed 500 times a day because everyone that you follow is re-blogging it.",
            "You can just click the thumbnail itself too, I think the symbol is just to let you know you CAN expand it.",
            "Great summary of the situation, thank you.",
            "Good.",
            "I may be stupid",
            "They're assmad that their stupid protest didn't work at all. It was never going to work, everyone told them it was a dumb idea, they still decided to hold the whole subreddit hostage despite that.",
            "I actually check the other site regularly. It is actually not that active. Instead, it seems that the mods are (again!) Not approving any posts. They really, really want to kill the community here.",
            "This is not the case. It's because the mods are holding this subreddit hostage and only allowing a tiny handful of users. They refuse to return the subreddit to normal despite maintaining an active userbase. Unironically, reddit should just de-mod everyone in the mod list at the moment and install their own mods. They would run this place better than these knuckle draggers. They're unironically just endlessly assmad that their dumb little protest didn't work and babyraging about it to this day.",
            "It's only more active because the mods here are actively trying to kill the sub but okay.",
            "Okay, thanks for the info.",
            "So basically normal again?",
            "This is a lie. No one left the subreddit, it still has a high daily userbase, posts are only slow because the dipshit mods only gave posting privileges to a tiny handful of users.",
            "I just joined this subreddit a couple months ago and have grown to like it, NSFW or not. I think migrating is just too much of a drastic change, especially for users who use Reddit on mobile which includes me. Hopefully the remnants of this great community can pick up the pieces and move on without the help of everyone who left. \n\nI'm just tired man. Tired of seeing some of my favorite communities deciding to abandon all that made it great and going dark. \n\nNot trying to be selfish. Just venting and making my peace while waiting for the end.",
            "But it has only 10% of the porn! \n\nThat said, I'm definitely moving. Again. I moved from Digg to Reddit, now off to ttrpg.network at Lemmy.",
            "How is it doing now?",
            "I use Jerboa, and I like it. It's a bit basic, but even in its early form its better than the Reddit app.",
            "Same, besides discord because the screen doesn't work on mobile correctly.",
            "If that's what you're into, hey I won't yuck your yum.",
            "okay firstly, replying to a comment from 6 months ago, most of the way down a equally old thread, is a fucking sad look, do they not teach kids not to necro anymore? \n\nsecondly, if there are really enough people about with content that they want to post, there is literally nothing at all stopping them from starting up a new subreddit and posting their content there.\n\nfinally, your comment basically a non-sequitur. where is the lie in what i said? i never claimed the the sub would die, just that there would be fewer people that want to post here. you make some claims about the mods that i have no clue about, i literally unsubscribed the day that i made that comment and haven't thought about this particular sub since, but if the mods really are the issue, once again, make a new sub yourself, or get over it and move on with your life? Either way, touch some fucking grass, its a really deranged look to be still replying to this old of a comment, especially if you're just going to rant about shit i couldn't care less about.",
            "[deleted]",
            "Reddit has blocked all the applications that make it possible to use reddit if you're blind. For many people they're not \"deciding to abandon\" reddit, they've been forced out.\n\n...\n\nThree of the most active members of this community, moderators who gave up hours of their time every day to build this community to what it was, have been permanently banned from all of reddit, with extremely flaky justification. Those people are a major part of this community and a big part of why you like it. They didn't \"decide to abandon\" reddit, they were removed from the site.\n\n...\n\nIf you have energy to direct your venting at, you should direct it at reddit administration, not at the people who didn't get a choice in this.",
            "well, there's a lemmy nsfw . com for that ;)",
            "well, right now, this sub has 0% of the porn... so that's an upgrade for you. :p",
            "You, like every other redditor on the planet, are so full of shit your eyes are pouring brown liquid. You still use reddit each and every single day, including very regularly making posts. All of this shit was just a gigantic fucking virtue signal over bullshit that none of you understood from a technical standpoint.",
            "The problem is that it is somewhere else. I have no plans to jump ship when other communities I like are still here.",
            "I never really wanted to be involved in this protest which is why I didn't direct my venting at the Admins.\n\nI have now already made my peace though. No need for any hard feelings. \n\n I am however thankful though that I and a few others can still stay unlike that sub that tried to forcefully migrate their community to their own site by sabotaging their sub a year or so ago.",
            "I do miss the joyful, playful insurrection though.",
            "And here you are, aggressively being part of the problem. How's that shit feel, pouring out of your eyes?\n\nDo ***you*** understand the technical issues? Care to enlighten us, oh shit-eyes?",
            "You don't need to have everything you do on a single platform. I can see trusting a new platform as a hurdle, but if both are trustworthy there is no difference between having two reddit tabs one the one hand, and a reddit tab plus a mastodon tab (or whatever it is) on the other.",
            "An API is a website or software's backend that allows third parties to pull information about the site or program for the purpose of data collection or third party application development. Reddit, for a long time, allowed free and unlimited access to their API, leading to the creation of many highly unoptomized bots and apps that overuse the reddit API for no reason other than amateurish development.\n\nSee, almost every other company on the planet charges for access to their API. The charge almost always comes down to how many times you access their API, charing some amount of money per 1000 access queries for instance. This is because it costs money to give people access to your API, it causes strain on their servers and has a real, tangible cost in energy to provide access to this information.\n\nReddit decided after a long time of providing API access for free to begin charging for it. This is something that they have ever right to do, it doesn't make them a bad guy in any way for doing so, even if it means some bots and apps no longer become feasible.\n\nAnother technical detail that many people missed in all the morally righteous \"protests\" against the change is that reddit included a provision in the changes that allows a certain amount of free queries. The vast majority of bots fall within the threshold of free API access. This is why automoderator and all the thousands of random bots like haiku detector or whatever still work. A big part of why the protests happened was because mods were complaining that moderating would become too difficult without moderation tools, but they literally didn't lose their moderation tools, they still have access to them.\n\nAt the end of the day, the API protest bullshit was just a bunch of people who had no idea what they were talking about hyping eachother up on some populist anti-corporatist bullshit, then becoming eternally asspained when they didn't get their way like literal children. Reddit is still totally fine, they literally did absolutely nothing wrong with the API changes, and until I explained what an API is just now you didn't even know what one is or that everyone else already charged for access to theirs.",
            "Heh. You assume a staggering amount about my background, clearly. I know full what what an application programming interface is. I've written them. I've used them. I've helped define company policy about their management.\n\nYou went on at great length about pricing and policy, with sweet fuckall about actual technical issues. Because, as you said, you're so full of shit your eyes leak brown liquid.\n\nWhat reddit did was make an unpopular price & policy change, and failed to adequately inform their customers (the users) why it was \"totally fine\". \n\nMy gradual ejection from reddit is due more to policy. Same reason I ejected (completely at this point) from Twitter. Same reason I bailed on Digg. There are alternatives that give me, the consumer, what I want, with policies I accept."
        ]
    },
    "Not Safe For Wednesdays": {
        "title": "Not Safe For Wednesdays",
        "score": 154,
        "url": "https://www.reddit.com/r/dndmemes/comments/174wwh3/not_safe_for_wednesdays/",
        "content": "Salutations my fellow memers and gamers. Tomorrow is the day some are dreading or anticipating. Not Safe For Wednesdays will commence Midnight PST for 24 Hours and happen every week as long as things go well. The rules for NSFW’s will be more or less the same with some differences:\n\n1) NSFW posts must be marked with the Not Safe For Wednesdays and NSFW Flairs. \n\n2) Must be a Meme/Comic, not just a pic with no text and a headline. There’s other subreddits to show your Team Scales or Team Goblin love. \n\n3) Posting outside the time window will result in it being declined. \n\n4) Posters who habitually break the TOS and rules for NSFW’s will be banned. \n\nIf there are any suggestions or feedback, leave a comment. We will be opening a new round of Mod Applications in the coming weeks. More to follow. Thank you all for your patience. Hope the rest of your week is full of NAT 20’s.",
        "num_comments": 21,
        "comments": [
            "\nInterested in joining DnD/TTRPG community that's doesn't rely on Reddit and it's constant ads/data mining? We've teamed up with a bunch of other DnD subs to start https://ttrpg.network as a not-for-profit place to chat and meme about all your favorite games.  Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dndmemes) if you have any questions or concerns.*",
            "I'm sure I'm not the only one who thinks this: NSFW memes are fucking cringe.\n\nThere's already /r/nsfwdndmemes and it has a userbase over there. Why are they needed here, exactly? Being that the subreddit **can** contain nsfw content, flaired or not, means that some people will no longer be able to view it at work or in certain settings, as there's always a risk something slips through or it gets added to a filter, despite the nsfw warnings.\n\nThe poll you're using to justify this **I didn't even see** and I literally post here almost every day. Replace the automod response to a new poll to get a more representative sample, please. \n\nNSFW memes are cringe and allowing them is stupid. Please reconsider.",
            "Oh shit, is dndmemes open to actual people again?",
            "I think the idea is neat but the name is confusing, because it's kind of the opposite...the memes posted will only be safe for Wednesdays. \n\nMaybe just call it OSFW.",
            "Nvm. The issue fixed itself",
            "you have your own setup as people that aren't online are horny bards and people online are seducing goblins you kind of have some encouragement there also boulders gate 3 has nudity and S3X unfortunately NSFW is part of DnD",
            "Honestly, I don't think any poll on reddit even means anything with the amount of bots on this site these days. It was very weird how the vast majority of the comments on the poll post were against NSFW days, while the poll showed otherwise.",
            "From this Wednesday and last Wednesday, it appears people aren't posting NSFW memes really. Which is nice.",
            "The whole point is to make the subreddit harder to monetize for reddit.",
            "I also didn't see the poll, but favor this. When the sub did it's porn protest, it was the funniest it had ever been.",
            "Yes",
            "People who see that the poll is going against their opinion are more likely to comment. Not weird.",
            ">it was very weird\n\nThere were 176 comments and nearly 8000 votes. It's not that weird they don't necessarily match.",
            "The nsfw people just don't feel the need to defend their position.",
            "I agree! :)",
            "Damn that sucks, did the mods get replaced by scabs?",
            "Wait, there’s a Union?",
            "It's fallen apart in the months since the r/place event but back at r/modcord and r/savethirdpartyapps they were trying to keep up the fight.\n\nEdit: Oh I see why I haven't seen anything from either in a long time, both got wiped and one was banned.\n\nEdit 2: Nope I'm just an idiot. The reply to this had the actual ones.\n\nr/modcoord is the correct sub, which is still around. It's also r/Save3rdPartyApps",
            "Well, right now I’m the only MOD doing anything and I’m trying to organize a recruitment effort for fresh mods soon. Everyone either left or got banned.",
            "r/modcoord is the correct sub, which is still around.\n\nEdit: It's also r/Save3rdPartyApps",
            "Ah thanks. Been a hot minute since I looked at either one so I forgot lol."
        ]
    },
    "Based on a discussion under one of the posts here. As can be seen, nobody can force you to abide by the official lore": {
        "title": "Based on a discussion under one of the posts here. As can be seen, nobody can force you to abide by the official lore",
        "score": 627,
        "url": "https://i.redd.it/vld0tgb1q28d1.jpeg",
        "content": "",
        "num_comments": 42,
        "comments": [
            "The enchantment wizard is far more sinister than any necromancer. \n\nModify memory, dominate person, feeble mind. Shit are all a horror show on their own, but combined create someone who can completely userp peoples very minds at every level.",
            "The stat block for necromancers also say \"A few use their powers for good, becoming hunters of the undead and risking their lives to save others.\" So even in official lore, not all necromancy is considered bad.",
            "As a DM I go intent to determine good/evil. One’s intent and how they use a spell is more of a indication of alignment than their spell list itself.",
            "I feel like the argument you are listing isn't valid.\n\nPHB says \"Necromancy frequently makes you evil\" okay.\nDMG says \"You do not have to abide by the the PHB\" okay.\n\nThe PHB is meant for Players, the DMG is meant for DM's. The argument made with your meme basically just says \"You as a DM can homebrew that Necromancers aren't evil, or ask your DM to homebrew it if you're a player\". \nYou also said \"no one can force you to abide the official lore\" yes - fun fact people run games they call \"homebrew\".\n\nSpeaking of homebrew, couldn't that be said to literally every argument posted on DnD? Just apply homebrew!\n\nThe argument tends to pertain to \"Is it [blank] while pertaining to the rules\". Everyone knows you can homebrew things via DM. That's never been what the argument has been. The argument is always pertaining to official lore.\n\nIt's like if there is an argument of \"Is Bowser always the bad guy?\" and you reply \"No I just played this third party game where he isn't that's heavily modded! So he isn't always the bad guy:)\".\n\nYou should have listed in Yugi's side something actually countering, for example what another commenter said that retains to the Necromancer stat block.\"A few use their powers for good, becoming hunters of the undead and risking their lives to save others.\" As that actually pertains to the argument people have, that even in official lore, not all Necromancers are considered evil.",
            "*shrugs in Circle of Spores druid* 🤷🏼‍♂️ 🍄",
            "I like guild wars lore in that there is both good necromancers and bad necromancers and on the better side they maintain the balance sending off souls while using the flesh as a construct",
            "Dude who runs the game: Dungeon Master  \nDude who plays the game: Dungeon Mastern't",
            "DM: actually necromancers dont HAVE to be evi-\n\nPlayer: That contradicts the PHB! What’s your source?\n\nDM: My source is I made it the fuck up!",
            "My necromancer build is a family doctor. He's genuinely nice and kind, and tries to reunite family members when his other arcane powers fail. Dad died in a freak farm accident? He can help!",
            "The act itself might be evil but the character itself can still be good. Both the necromancer and the dead they animate.\n\nBut because the act itself is evil, it usually takes an individual of great willpower to not be tempted by the evil.\n\nMost important of all though: Good and Evil in D&D are **not** just moral concepts, they are *tangible forces* in the universe. Like law and chaos, they hold power over multiverse.\n\nSo the way I see it is this: Good characters can use necromancy, but doing so is far more taxing than an evil character doing so, because the act itself is evil. Same with evil characters casting good-aligned spells. Furthermore, using such spells in places steeped in the energies of good/evil ease/tax the process even more. Why do necromancers always appear in haunted places and graveyards? Because the places are steeped in evil energies and make it easier to raise the dead. Same with rituals - infusion of an area with the desired energies.\n\nThe moral side comes when the character has to make a decision: Some spells might be impossible for them to cast if they are too far down that path they are on until they either grow stronger or steer from the path. Do they change their moral outlook and thus their alignment to make things easier for themselves or do they keep going?",
            "Barbosa: The players handbook is more like guidelines than actual rules.",
            "What if I create zombies to build homes for poor people, or give food to poor people. What if I use an army of zombies to liberate slaves, or defend the innocent from genocide?",
            "The idea that you need a rule to tell you you can break the rules is how Lawful gets you. The GM is omnipotent, meaning there is no rule to govern their power. Of course, with great power comes great responsability.",
            "That's cool and all but usually this comes up in threads of \"how to make a good aligned necromancer\" and the RAW answer is you can't while making undead. The more complicated answer and non RAW answer is just talk to your DM.",
            "Fun fact, in my DnD game, one of the players works at the Neverwinter Academy, and I have flavoured in certain classes, that I think people would be able to take, and she helps teach the \"Ethics of Enchantment\" class.",
            "Would be hella fun to make a campaign where one NPC is an outcast necromancer and (secret) bbeg is an enchantment wizard and manipulating everything, is pretty much the king.\n\nEveryone thinks necromancer is evil and ruining the land, pc party is sent after him and they slowly realize as they chase him he is not in fact the bad guy.",
            "Let's NOT forget Psychic Scream",
            "In world we should treat enchantment wizards like dangerous perverts. Someone saying \"I'm an enchantment wizard\" gives the same vibe as a guy buying rope, condoms and a case of mikes hard lemonade all at once from the same store.",
            "But even in that quote, the good ones are -hunting- undead.",
            "Abhorsen-style necromancers are really neat and I wish they showed up more often in various settings.",
            "Mind control the bandits who are trying to rob/murder you? Not that bad\n\nMind control the guard to make him let you inside the castle? Pretty fucked up",
            "I think this meme is specifically aimed at rules lawyer-adjacent lore nerds who clutch pearls whenever anyone does anything in their games that deviates even a single inch from official D&D lore.\n\nIt is not arguing that Necromancers in official D&D lore aren't always evil (Even though this is indeed correct), it is arguing that it doesn't *matter* if they are always evil or not in official lore because you are not required to use official lore if you don't want to and acting like the official lore is the only allowed way to run D&D is stupid.\n\nAt least that's my interpretation.",
            "This isn't just any Good Alignment: this necromancer is Wholesome Good and I love it.",
            "Yeah it can end up depending on what your DM rules necromancy to be. Typically it's interpreted as making the corpse move with magic, essentially leaving the soul free to do whatever it wants in afterlife, making it fairly neutral in terms of morality. But some might say it is different, like if the soul is forcibly put back in the body and controlled to move how the wizard wants.",
            "Animate dead says \"Choose a pile of bones or a corpse of a Medium or Small humanoid within range.\". Warforged are humanoids made of steel, wood and stone.\n\nSo yeah. Pick some stuff up, and animate a pile of junk.",
            "on the flip side in my current setting the oldest mortal wizard is a paranoid enchantment specialist who uses said power with such reckless indifference its a horror. Like if he doesnt like how a conversation goes he will just make you forget it, like even over tiny things.",
            "“I took a class. I can tell right from wrong.”\n\n“You mind controlled this entire village into slaves worshipping you as a god!”\n\nProudly:  “and that’s wrong!  See. I can tell”",
            "Fight fire with fire, as some might say",
            "What about putting a permanent command on a chromatic dragon that has an affinity for magic to never speak again?",
            "Okay but even the latter one you could make the argument about intent, like what if you need to speak to the King ASAP and this dickhead guard just won’t let you through even though you have clearance and everything? It all depends on context. \n\nPlus you’re also not like, forcing him to kill hin self or anything, so…",
            "Animating the dead is not a neutral thing, even if you leave the soul alone. It is basically the most vile and humiliating form of grave robbery. Imagine having burried your loved one only to see them empty chamberpots for a wizard who controls them like a marionette.",
            "Yeah it's definitely up to the DM, but the OP like, using that as some kind of gotcha against people quoting the RAW when the RAW is pretty much all we have as common ground for discussion is just silly.",
            "It seems RAW you can't do that unless said pile of junk used to be a warforged.",
            "Modify Memory was such a staple of our \"Out of the Abyss\" campaign my character ended up with permanent amnesia, lol. \n\nIt was a PvP-friendly campaign by design, and two of the spellcasters were trying to \"subtlely\" convince my Assassin rogue to kill the other one. I think that poor confused half elf had his memory modified a few dozen times before his memory finally broke, lol.",
            "Soooo... Zombie Pokémon battles?",
            "Who says youre digging up bodies, theres plenty from people you kill",
            "As apposed by Enchantment being literal mind control and evocation burning people alive. 2nd hand emotional turmoil is in fact quite cultural, and better then 90% of the stuff wizards usually do.",
            "So a warforged factory should be full of the stuff. Like, from the junk of \"deactivated\" ones. You could stash it in a bag of holding.",
            "That's a neat backstory for his next half elf barbarian. :p",
            "Yes, if only Animate Dead could target something else than a humanoid corpse.",
            "Well and the magically puppeteered corpse still is just 1 unfortunate day for the caster away from becoming a danger to everything living...",
            "Eh... raw material in the factory that was never a living warforged isn't the same thing as bones.\n\nAnimate Dead doesn't make golems, there are already mechanics and items for creating and controlling those."
        ]
    },
    "Rope Trick": {
        "title": "Rope Trick",
        "score": 267,
        "url": "https://i.redd.it/9u6to9tb148d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "\nInterested in joining DnD/TTRPG community that's doesn't rely on Reddit and it's constant ads/data mining? We've teamed up with a bunch of other DnD subs to start https://ttrpg.network as a not-for-profit place to chat and meme about all your favorite games.  Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dndmemes) if you have any questions or concerns.*",
            "https://hard-drive.net/hd/tabletop-games/woman-only-buys-ancient-wizard-robe-of-infinite-power-because-it-has-pocket-dimensions/",
            "what's up with her mouth in the last picture?",
            "I wouldn't mind extradimentional pockets irl too\n\n[LinkTree](https://linktr.ee/TheImmortalThinkTank) | [Instagram](https://www.instagram.com/theimmortalthinktank/) | [Patreon](https://www.patreon.com/TheImmortalThinkTank) | [Twitter](https://twitter.com/CrawfordChe) | [Facebook](https://www.facebook.com/TheImmortalThinkTank/) | [WebToon](https://www.webtoons.com/en/challenge/table-tip/list?title_no=842302) | [Threads](https://www.threads.net/@theimmortalthinktank) | [Tumblr](https://checrawford.tumblr.com/)",
            "You haven't lived until you turn your Rope Trick space into a  hotbox... or an enhanced interrogation room",
            "Why is her nose drooping down her mouth?",
            "Girls got pockets for the first time ever, let her be happy",
            "She is that happy, I guess"
        ]
    },
    "But God forbid you do anything other than waste all your spell slots on Smite, and actually get to play a diverse class for once right?": {
        "title": "But God forbid you do anything other than waste all your spell slots on Smite, and actually get to play a diverse class for once right?",
        "score": 521,
        "url": "https://i.redd.it/2tz3ocmjt18d1.jpeg",
        "content": "",
        "num_comments": 95,
        "comments": [
            "These changes sound quite good. Having summon steed earlier is a really cool change because it's thematic but not really over powered.",
            "At this rate people might even realize that paladins are half casters instead of martials",
            "There's going to be parts of the relaunch that people dislike. Once everyone remembers to not be arseholes about the bits you like and dislike, it'll be grand.",
            "Steaming take: Smites aren't all that good in 5e either. \n\nSure, they're good when you, but just spamming them is almost never worth it for the damage. Not when you have spells to cast. They seem a lot stronger than they are because of their nova potential, the damage isn't really all that great.\n\nBy making it a bonus action thing, you've actually given a clear incentive for Paladin players to explore their other options. And the improvements we've seen to this options meam Paladin is now stronger and more balanced than ever.",
            "Did they keep that you can smite on unarmed strikes and ranged weapons from the UA?",
            "Where is everyone reading this, anyway?",
            "One of the biggest problems of this change is that at higher levels this new version of smite becomes useless since bbeg's like Tiamat have inmunity to spells of 5th level and below.",
            "These charges will ironically make the average paladin much better, because they'll be smiting less and casting spells more.",
            "It isn't so much that smites are now a bonus action, its that divine smite became a spell and is now able to be counterspelled that ruins it. Paladins were good for fighting liches, now the lich can just counterspell a crit smite and laugh, as well as rakshasas being immune to smites now, that is what ruined divine smite.",
            "Sure, there’s a lot of good that’s come out of it, but for what they’ve given you, they’ve now made Smite vulnerable to Counterspell, Mage Slayer, likely Silence, any creature with Spell Turning  or Magic Immunity effects and the like, and it inherently makes one of the fan favorite multiclasses (that being Paladin/Barbarian) a shadow of its former self. \n\nIf Treantmonk is to be believed from his analysis of the new Paladin they’ve also nerfed the duration of the Paladin’s subclass capstone. Jeremy mentioned it an hour while Chris corrects him and says his preview book has a different duration, and I highly doubt they’d have increased the duration. \n\nTo pretend the changes are all positive is a disingenuous argument. You need to take the good with the bad, and it’s okay if not everyone is happy with it.",
            "I dont care. I want my Pally to demolish your hp with two 5lv Smites in one turn if he feels like it. It is not the best use of your spell slots, sure, but it makes my brain release funny chemiclas. \n\nBasides, I don't understand why the martials (and half casters) are not allowed to have broken things when a wizard or a Cleric can bend reality. Just let me have fun.",
            "Can you still call the smite after the hit? Or do you have to announce it before? Or do the smites have to hit separately?",
            "Vow of Emnity being a free action is the least they could do when they changed Smite to Bonus Action. It's not upgrading, it's making it viable in the new ecosystem.\n\nMore Channel Divinity sounds nice until you learn that Divine Sense now also uses that resource.\n\nEverything is in context. It's easy to package some of those changes as upgrades until you realize how they interact with the rest of the class.",
            "Honestly I'm not gonna lie, the nova potential of dumping three smites a turn on an enemy as a paladin was always outshone by the fact that doing so invariably ran you out of gas and was just straight up damage inefficient compared to critfishing. I think the actual problem is this just cuts a lot of build diversity for the paladin by subsuming their bonus action into smite",
            "In general I think the changes are fine and some of it is even pretty good, honestly im fine with them making Smite once per turn to reduce nova damage I just disliked that it was made BA tbh since it felt like they really clogged up Paladin’s BA.",
            "I will say a few things about this.\n\n1.) Sacred weapon and Vow of Emnity becoming free actions most likely came from the fact that there is decent bonus action bloat on the paladin class now. It's a buff that is a tad inelegant.\n\n2.) I personally feel that all the other features added to paladin are absolutely great and will make the class feel fun!\n\n3.) The problem to me about smite being bonus action is that it takes away one specific kind of choice you had back in the day and replaces it with a new choice. As any paladin you could start a combat with bonus action spell follow up into smite empowered attacks. \n\n4.) Standard divine smite should just be a class feature that can cut through magic resistance/immunity since it is an ability meant to kill fiends or undead. Turning it into a spell just introduces scenarios where suddenly the anti-unholy countermeasure doesn't work. \n\n5.) If all WOTC wanted to do was limit the number of smites a paladin could do in a turn they could have simply just put a line of text into divine smite stating that you can only smite once per turn. I feel like you lose fun combos overall by tying it to your bonus action.\n\n6.) Despite all my rambling here I love the meme format and people not giving the new design a chance. I personally wanna get my hands on it before I wallow in salt myself.",
            "Pally is just a Bard wirh more beef in the swing.",
            "No if I can't nova down big enemies on Turn 1 while having heavy armor, face skills and amazing auras then I won't be the main character anymore!!!",
            "There’s a lot about the paladin rework I dislike and all of it boils down to how clogged the action economy for the class is now. Paladins we’re in a rare sweet spot of good dps and great survivability. And half of that was being able to smite after landing the hit, the other half was lay on hands being a free action for yourself. I get that they’re trying really hard to make paladin not a smite machine like how warlock is an eldritch blast machine, but I feel they forced the class to juggle too many different skills that all eat your bonus action. Similar to the rogue problem where they have a 100 options to use their reaction but are stuck with only a single reaction a round. I think the paladin class seriously needs some more fine tuning with its action economy. Even something akin to cunning action but for bog standard paladin stuff may help with the action bloat.",
            "This changes are good, but I don’t like Smite being a spell instead of feature. Spell makes it subject to magic resistance, magic immunity and shit like counterspell. I’m simple person and like my good mighty critical megabonk sometimes.",
            "Well, from a balance stand point I see it as an ok. Now, this takes away something that was really cool and that I would wish they dobleled down on instead of removing. I think that Clases feactures that modify common resorces like spellslots into something of their own is the way. Eldritch Blast(Modify to cantrip), Bardic inspirations(Modify), Hunters Mark(experts UA) could be candidates.",
            "Yeah, I was beginning to notice that the BA smites (plus it just being a spell) were the only things that people were complaining about class-wise. That and one thing I saw about a lot of subclasses not being carried over. Everything actually seems, at the very least, fine, and I'm actually pretty excited to migrate to the new edition ( is it a new edition? Are we calling it a new addition?), despite still being kind of new.",
            "Nah, just homebrew stuff to make it super OP. Thats how my player like to play",
            "Would have preferred divine smite not being tied to spell slots.\n\nAltho honestly, the largest issue of the new Paladin for me isn't the Divine Smite overall nerf (it wasn't stellar damage). The largest issue is that you still don't have a solid reason to keep being a Paladin after 6th level or 7th level with a good subclass aura. Outside of rare exceptional campaign scenarios, there is no true mechanical incentive to not multiclass out of Paladin after that in the 2014 rules or the 2024 rules.",
            "My issue is the identity of Paladin was critseeking. The resource management of waiting for a crit or spending it as you go, or preparing for a double smite through using the spell smites with the normal smite, was already a interesting little resource management game while not requiring too much to remember from you. Alongside that, Lay on Hands as a Standard Action always gave you that extra layer of decision making, and was overall engaging even if full casters were objectively better.\n\nSeveral of the features you mention add unneeded complexity when taking into account players who want to try magic but don't necessarily want to rely on it as much as something like Ranger or Artificer to be strong. Paladin was a goto tutorial class on spells, and even if there are buffs that identity is now gone as a result of Smites no longer being stackable and Lay on Hands being a Bonus Action. \n\nWhat I think generally is yeah sure buff Find Steed, but giving them Portent from Divination Wizard as a general class feature or something similar would be really nice for a half caster that would want to be able to use it to potentially ensure failed saves with the special smites, or potentially ensure crits off of smites if they get lucky every so often. It fits very well with the mechanical identity as well as the narrative identity, given divining their perfect strike through their belief in not just their god but themselves being rewarded.",
            "OP certainly believes strongly in the new paladin",
            "*Find steed* isn't made available earlier (level 5 in both cases), but the free casting is new, and now it scales at every upcast, gaining *find greater steed*'s flight at 4th-level.",
            "Right ?! I genuinely can’t wait to play the new Paladin. The steed scaling with spell slot level also means it’ll die way less which is great",
            "No joke, DM’d a 1-20 game with a vengeance paladin and I can count on two hands the amount of times he used actual spells over four years.\n\nNever even used Destructive Wave. :/",
            "Paladins not being smite fighters?! Preposterous /s",
            "Yeah I personally can’t wait for ONE D&D all the content looks so fucking great. I really want to play a dancing bard. Though same Can be said for all classes, I love what they did to the fighter rogue and monk",
            "In my paladin experience, I use Divine Smites so often because between Channel Divinity setup (Watcher's Will in my case) and taking the Attack action so often, I don't really have the actions to spare on my other spells. Usually I'll cast one concentration spell per combat (maybe *bless*, *spirit shroud*, or *shield of faith*), but after that, it's either Divine Smite or die with spell slots remaining.",
            "I'm curious what spells you think are consistently better to cast than dealing damage. A lot of the spells Paladins have in 5E are concentration based, which is a tough sell for a melee combatant - even if it is constitution based. And most paladins aren't even going to get access to much 3rd level and above casting, with most campaigns ending before level 10. \n\nNote, I think the changes are for the better in 5.5, but don't really think spells are better than smite in 5e",
            "Yeah I personally adore the new Paladin. Playing in 5e I only really smited under two circumstances\n\n- Getting a critical hit\n- I know an enemy is very low.\n\nFor example if I hit a goblin and deal poor damage on my weapon swing, I know a smite will take them out of the initiative for sure. Controlling action economy is always great.\n\nPaladins who can burn 4 smites per turn on their tables really have it good on the long rest department honestly",
            "You can smite with unarmed attacks, but not ranged ones.",
            "You could always smite punch by RaW, just not by Crawford tweet.",
            "On D&D beyond or on the D&D YouTube channel.",
            "That is a very uncommon ability only on beings that are the equivalent of gods. I’m fairly certain you can count on one hand, if not two, the number of creatures that have that ability. \n\nPlus this is a new edition of DnD, monster stat blocks might change.",
            "If the biggest problem with the new paladin only kicks in when fighting two kinds of enemies, one of whom is Tiamat, then it’s probably not a major issue.",
            "this is contentious even in RAW regarding existing smite spells like blinding smite- there's no obvious definition of what 'immune to spells' means. it's not the same as being immune to the EFFECT of spells. if that were the case, surely Tiamat would also ignore shield/mirror image spells?",
            "Smite is a self target spell that increases your weapon damage for one attack. There's a strong case that it bypasses magic immunity, but they need to be really clear about this in the PHB if it's the case.",
            "Maybe we shouldn’t judge based on monsters when the entire MM is getting redesigned?",
            "They aren't the target of the spell, you are.",
            "Counterspelling a Smite is such a niche scenario I honestly see no problem with it, I genuinely feel like people complaining about that are making an issue about something that might happen at most once a campaign and be thematically interesting. Even then, counterspell has gotten very nerfed, it can now be saved with a concentration save against the caster's DC, so a Paladin with decent con can definitely just say no thanks to a Lich's counterspell. PLUS, now when someone counterspells you successfully, you do get your spell back, so even if the paladin gets counterspelled they get to keep their magic.\n\nAs a paladin, I'd be HONORED if a lich decides to waste their reaction on the /possibility/ to counter my low level bonus action spell, while the wizard and cleric are readying up forcecage, banishment, etc. My job is to take aggro. Also, paladin aura now helps you save against counterspells as well.\n\nIf a single monster in the monster manual is what ruined divine smite for you, I really hope you don't see all the creatures that have immunity to radiant damage by default already lol. Rakshasas are nonrelevant to this discussion.",
            "Actually no, liches and tigerdemons are both edge-cases. (they suck dont get me wrong, but those types of fights are *relatively* rare)\n\nBonus Action effects *every* combat against *any* mobile or ranged enemies.  \nPaladins famously suck compared to enemies with even the *teensiest* bit of range or movement advantage, because of their lacklustre ranged or baked-in movement options.  \nWhich is why the subclasses that gain access to Misty Step or similar movement abilities are so iconic.\n\nthe change into being a spell sucks for a bunch of reasons, but its the action economy cost that'll affect every combat in the game.",
            "Yeah, Raksashas are truly known for their tankiness, with their amazing AC of 16 and insane 110hp.\n\nTheir harmfull spells against a paladin would be suggestion, charm person and dominate person, all wisdom based saving throws, which the Paladin are proficient in. The Paladin would have NO chance against that, with their aura of protection + proficiency bonus to a minimum of +8 to WIS saving throws at lvl 10, if their WIS modifier is 0.\n\nThe Raksashas amazing +7 to hit will leave a fucking paladin with AC 20, with a plate and shield with no chance of survival.\n\nYou are absolutely correct. There's nothing a paladin could do about a Raksasha without smites.\n\n*sigh*",
            "Bro. Counterspelling a Smite is such a niche scenario. Trying to claim that \"ruins\" the feature is ridiculous.",
            "we don't know how spells have been changed yet.",
            "That’s why I hate modern day “balancing”, nothing a martial will ever be can compete against a post 3rd level spell and a smart (or even reads the damn spells) player",
            "Smites are now bonus action on hit, given that's probably in all smites you get to use your concentration on something else and the choice of max damage or using a different smite for the effect",
            "You call the smite after the hit yeah. This is now true for all smites like branding/thundering/blinding smites. Them not requiring concentration anymore means you can finally use them with other spells\n\nAnd !! It also means you can add whichever smite flavor you want on a Crit and it’ll double guaranteed",
            "Smite is still on hit, it just consumes the bonus action to use (meaning only one smite rather than nova smite spam). Lay on hands has also ALWAYS been a full action, it has never been a free action in any way. While I don't love onednd (though it may grow on me) the paladin adjustments are completely fair.",
            "The Lay On Hands change to a bonus action is a buff - it's always been a full action in 5e. I believe you're referencing an extremely lenient house rule on that point.",
            "Lay on hands being a free action for yourself ??? Either I’ve been playing Paladins wrong my whole life or your dm has one of the most lenient house rules ever. Lay on hands has always been an action, even on yourself, right?!\n\nPaladins now have smites, lay, and some spells as a bonus. They have major spells and attack as their main action. And the steed and all the buffing abilities (like vow of enmity and holy weapon) don’t clog your action economy at all now. Vow and Holy are part of your attack action and the steed as always has a turn of its own, only now as a Paladin you get free castings of it to make sure all Paladins are taking advantage of it though.\n\nPaladin is so much better action economy wise now than before. The only negative being the fact that they now can’t spend 4 spell slots in a single round, thing no caster was able to do before.",
            "Hard disagree. What you call a clogged action economy; I call having meaningful options.",
            "And you can still get them sometimes",
            "To each their own!",
            "Just to make sure it's on the record, free castings of spells are always done at the spell's lowest level, so as the Paladin levels up, the free casting of Find Steed quickly loses value because it will only ever summon the weakest possible steed. If they need it to have more HP or be able to fly, they need to use the higher level slot.",
            "It's totally broken. \n\nA class that has guaranteed flight at the 4th level? \n\nJust give me a bow and I'll laugh at any monster.",
            "Is destructive wave good?\n\nI'm currently building a hexblade 2 / swords bard 10 goblin with a focus on melee (I know it's not optimal but it fits for the character and seems fun with flourishes) and I'm thinking of taking destructive wave as a magical secret",
            "I think weapon mastery seems cool, the rest of it is whatever to be honest. It's grand like.",
            "Bless, wrathful smite, aid, command, prayer of healing, locate object, and find steed Id consider all better than divine smite, in terms of 1st and 2nd level spells.",
            "Ranged Smites were the one part I was looking forward to most, so of course they had to get rid of those.",
            "Thanks.  \n\nMy Watcher paladin hates extraplanar beings. I specifically avoided the Find Steed spell because of this. Now it's mandatory? Fuck that.",
            "Yeah Bonus action casting is by far more impactful than edge cases like specific enemy typing honestly. As far as closing gaps goes, I'm very glad paladins now get a free find steed cast once per day and the spell is always known without counting towards the number of spells you need to remember. Having that sweet sweet 80ft of movement without spending your own action economy at the very least during the first turn of combat is always a lifesaver. That and the horses can teleport with you on top now so it's a W all around.",
            "Paladins have *find steed* and then *find greater steed*, frequently giving them better mobility than any melee martial except the monk.",
            "You also make many assumptions there, the main one being that you are assuming the paladin having access to magic weapons when they go to fight this Raksasha, which situation depending they might have.\n\nNow, with divine smite being a spell, the paladin might not have anything with which to hurt this Raksasha. It's immune to spells it doesn't want to be affected by of 6th level and lower and can not be hurt at all by nonmagical weapons. That 16 ac might not seem like a lot, but if your immune to the damage type it literally doesn't matter what the die rolls. A +7 to hit will still hit your hypothetical 20 ac paladin 40 percent of the time, infinitely more often than hurting the Raksasha with a nonmagical weapon.",
            "Right ?! They mention Rakshashas being a problem for smites when a non irrelevant chunk of the high tier monsters monsters have Radiant immunity anyway",
            "Even more so now that you can save against a Counterspell.",
            "That sounds even more op...",
            "Thank you, that has alayed my main concern. I tend to smite only on crits and the thought of 'wasting' the smite on the first attack only for the second to crit was a bit grating.",
            "Unless they changed the spell find steed doesn't have upcasting. Find greater steeds is just a completely diff spell. In both you pick a statblock of a creature.",
            "I think they meant after using a 4th-level spell slot",
            " .....4th level spell slots. Which, at least in 5e, Paladins don't receive until 13th level.",
            "Wizards get flight at 5th, Aasimar get it at 3rd, aarakocra start with it.",
            "It is pretty good.\n\nIt is just an AOE around you that damages the enemies and avoids your allies, so you can use in any situation when there are a few enemies near you.",
            "Before I get into this, please note this is all based on the fact that I said \"consistently better.\"😅\n\nBless is solid but has the concentration issue.\n\nWrathful smite is ok, 1d6 damage isn't as good as 2d8 even if it is psychic the majority of the time, and the will save always has the potential to fail. \n\nI disagree with Aid - damage is almost always the more optimal option to healing, and you get access to it only after 2nd attack. So you're giving up 2 potential attacks and a potential smite to give everyone 5 bonus hp - which just isn't that much. If you're one of the last ones standing, sure. But that's fairly situational, and I'd think dealing 3d8 damage earlier in the round might have downed the enemy downing your teammates. \n\nCommand is going to be the power level that the DM lets it be. At most you should be able to have an enemy skip their turn, but if you want it to be reliable, you need to invest more points into wisdom, which is probably the 3rd stat investment for the majority of paladins (str and con coming first.) \n\nPrayer of healing takes 10 minutes to cast, for one slot it isn't bad - but most of the time if you have 10 minutes you can take an hour for a short rest. There's times it'll be the right call, but again that's pretty situational. \n\nLocate object is definitely situational. I wouldn't hold back a smite on the potential that I might need to locate an object later - but if I have it and need to find something I'm not going to not use it for the potential smite. \n\nFind steed is solid, but it's an investment that shouldn't require too much recasting - and if it does need to keep getting recast the value of the steed falls off quickly.",
            "I think they wanted to keep paladins as close combat specialists.",
            "I've always made Paladin and Barbarian features work with melee and *thrown* weapon attacks specifically. \n\nAfter *Dark Souls*, the ability for faithful warriors to hurl holy spears is an absolute staple in my mind.",
            "Not all Celestials and Fey are extraplanar beings. Unicorns and Pegasi are native to the material plane, for instance. Besides, no one’s forcing you to use it.",
            "Oh you mean the 10 minute cast-time spells that create entites that struggle to fit into tiny dungeon corridors?  \nSure love playing everyone's favourite game of \"Wide Open Fields &  Wyrmling's Obliging Forever\"",
            "If the DM pits the party against a Raksasha without first granting them reasonable access to magic weapons, something has gone seriously wrong.",
            "Magic weapon spell affects the Raksasha.",
            "I'm not a fan of the Smite change, but assuming a Paladin has a magic weapon by the time they're fighting a Raksasha is a pretty safe assumption. Paladins even get the Magic Weapon spell which would affect a Raksasha because it enchants a weapon.",
            "Rakshasa are cr 13. If the party is fighting a cr 13 monster and has no magic weapons they are either underleveled idiots who got in over their heads or the dm is an arse whose starving their players of loot or ways to spend gold.",
            "A rules change in regards to the dynamic of a fight between a class and monster does not ruin the character class. Are you really that bummed that the DM will not be able to send you into battle against a Raksasha unprepared anymore? Paladins are half-casters, not martials that get a free magic attack. If a paladin was fighting a Raksasha and the only way to damage it is with smites then that already feels like it would be a clunky combat encounter that could've been run better. DND rules don't exist within a vacuum, they exist within a campaign, and you won't just randomly run into an enemy unless your DM decides to put it there, and they SHOULD have you prepared for fights that are coming. It's not unreasonable to assume a paladin would be given a magic sword at some point in a campaign at this level.",
            "That’s why it’s a bonus action now luckily. In 5E Paladins could just Attack, Multiattack, Polearm master bonus attack, and Opportunity attack, then put a hefty smite on every single hit.\n\nNow you can do it just once a turn, which makes it way less swingy and more balanced. Smites are still fucking great mind you, but now they aren’t a massive DM headache",
            "They did indeed change the spell in Playtest 6 to scale with spell slot level. Iirc the free cast is always at the lowest level though.",
            "As of UA6, the last Paladin playtest, Find Steed and Find Greater Steed were merged into a single spell. It summons a set template, the appearance of the steed basically being free flavor. The Paladin chooses Celestial, Fey, or Fiend, and the steed gains a different bonus action ability depending on the choice (1/LR heal for Celestial, 1/LR teleport for Fey, and 1/LR fear effect for Fiend). Its AC is 10+spell level, 5+10 per spell level HP, a 60 foot move speed, and gains a 60 foot fly speed if the spell is cast as a spell of 4th or higher level.\n\nSo, while Paladins get a free casting of Find Steed, that free casting will only ever summon a non-flying steed with 12 AC and 25 HP, even up to 20th level. Unless they specifically added a clause that says the free casting is automatically done at the highest level the Paladin can cast, but that's extremely unlikely because then a Paladin/Sorcerer or Paladin/Bard could summon a free flying mount at level 9 (Paladin 5 to gain the spell, Sorcerer/Bard 4 for the faster spell slot progression - per JC you now round up Paladin/Ranger level when determining spell slots in multiclassing), 4 levels earlier than a single-class Paladin would be able to.",
            "Yeah but counterpoint:\n\n*insert gif of the firing mechanism of a revolver going off*",
            "With they at least made a feat or something for it, so you have to invest into it",
            "I said it was better than other melee martials, not perfect. How's a similarly Str-based fighter going to compare?",
            "But you don't have to spend spell slots anymore?",
            "A bow",
            "You do still use spell slots."
        ]
    }
}