{
    "[Weekly Vent]June 17-21, 2024": {
        "title": "[Weekly Vent]June 17-21, 2024",
        "score": 6,
        "url": "https://www.reddit.com/r/dogs/comments/1dhwbwc/weekly_ventjune_1721_2024/",
        "content": "Is someone not picking up poop in front of your house? Is there an off leash dog in your neighborhood with a clueless owner? Did someone bring an out of control dog to the off-leash park? Is your neighbor walking uncomfortably close to you with an untrained dog? Here is where you can dump out your feelings and frustrations about these or whatever other topics you wish!\n\nJust as a friendly reminder, the same rules regarding conduct in the general sub apply here as well.",
        "num_comments": 12,
        "comments": [
            "Less of a vent, but unsure if it needs its own thread either: \n\nAny suggestions for puppy boredom? I adopted a rescue from a friend about a month ago, upcoming vet visit next week for spay and a DNA test since we have no clue about her breed, and the friend who found her already took care of shots and puppy vaccinations. \n\nBut also she seems to want to chew on just about anything BUT her toys. she will gnaw on soft toys for a few minutes, I step into my office for a zoom call and come back out to find she’s move on to something not a toy (shoes, couch pillows, the tv remote).  Shes doing great with crate training, sleeps through the night without any fuss, and I’ve even seen her go in there on her own and just chill while I’m doing whatever random house chore is happening. \n\nI work from home and have the ability to take walks throughout the day. Our schedule basically is \n\n- morning wake up, breakfast\n- walk to nearby park (1 mile)\n- morning game of fetch or rope tug of war until she gets tired\n- walk home (another mile)\n- lunch, shorter walk through the neighborhood\n- after work repeat morning park and play walk\n- get home, an hour or two of back yard play with neighbor’s dogs while he and I decompress from our work days on the back porch, dinner, short pee and poop walk\n\nAll in all she gets lots of daily activity on a very consistent schedule since I wfh and have flexibility during the day, I also got some toys that claim to give doggies some mental stimulation, a maze food dish (to also help with her tendency to eat too fast and then puke) and one of those motorized weasel balls she can chase around while I’m working. \n\nThey work for a few minutes, she’ll get plenty of praise for playing with her toys, I step away for a 30 minute zoom call, come out and see she’s somehow stealthily found something I tried to put out of reach and scattered it all about the apartment. \n\nOther than working our way through the puppy years, how else can I provide some positive reinforcement and mental stimulation so she’s not so bored to ignore doggy toys and not tear up other things?",
            "Had to give up my new dog, having a hard time.\n\nMy family adopted a dog about a week ago. She was a stray rescue from the local humane society. She was a 1 year old German shepherd/husky mix.\n\nShe seemed to really attach to my dad and I, whenever one of us would leave she would whine. This got better after a few days having her, however she was still always slightly anxious.\n\nNow the problem, my family also has 4 cats living in the house. We set up a kennel and a fence to give the dog her own area. However, whenever the cats came near she would growl. We call local trainers and they said to put a curtain up so they can’t see each other. We did this and it seemed to be working. We were setting up training classes and started clicker training her at home. But then we had a few close calls with the dog jumping over the fence and lunging at the cats. We had a couple close calls but there was one call that came too close for comfort. We decided we were going to try and put her in my room. However she wouldn’t calm down, it seemed as if she was having panic attacks. All of the cats were terrified, the dog was stressed, my family was fighting over what to do with her.\n\nWe talked to another trainer and said that her breeds have very high prey drives and that while training could help control it, there’s always a risk and that the cats may end up being hurt.\n\nIn the end we decided it would be best for all the animals if we gave her back and that she go to a home with no cats.\n\nWe talked with the humane society and they completely understood and agreed that she was not a good fit for our house. We made sure that she would not be getting put down and they even said now that they know this they can find a better match. \n\nI guess the part that bothers me the most is that I feel like I failed her, she trusted me and she doesn’t understand what’s happening. I keep getting sick thinking about it. I just really hope we did the right thing for her because she is an incredible dog and deserves to live in a house stress free.\n\nAnyways, sorry for practically writing an essay but I just needed to get it out. \n\nTLDR: I had to give away my new dog because she was aggressive toward our cats and I’m just having a hard time.",
            "[removed]",
            "Gosh I hate it when the other people blame my cute little dog just because they find cat poop in front of their doorsteps every single morning. I mean, my dog is scared going outside and wanna stay inside our room all day because of the aircon. And for some reason I find it so dumb that they can't even tell that it is Cat poop not dog.",
            "Sometimes I feel guilty when I have to do errands or go to work.  When I want to spend every second with my dog. \n \n[2016](https://i.imgur.com/jlDExDy.jpeg)\n\n[2024](https://i.imgur.com/OlD46Pc.jpeg)",
            "Trying to adopt a new puppy... OMG when did this become so hard. The rescues are all crazy. I have spent 1-2 hours filling our adoption forms for rescue and they say \"we will not contact you if you are not accepted\". If you are interested in multiple dogs you have to fill out MULTIPLE applications. Some of them want an application fee PER puppy you are interested in. Like what? 1 1/2 hours to fill your form out, pay you money and you won't even call me to tell me if I am chosen or not. \n\nI have EVERYTHING they want: Own my home, fully fenced yard on .66 acres, not one but 2 people work from home, experienced dog owner, former foster mom with a rescue, complete vet history... I am a complete package and I can't get the time of day from rescue. Who ARE they adopting to?\n\nThis is a huge issue: \n\n1. The lack of response from these rescues creates a situation where you have to use a shotgun approach to hope to get a dog. Apply to many dog rescue in hopes they will adopt one to you. \n\n2. Creates a sense of urgency leading to FOMO when you see a dog you like... Oh I better get an app in now... Leading to a less thoughtful approach. You are less likely to turn down a dog you might not be vibing with because you feel like you can't get anything else... \n\n3. It means that people who have the money may move to a \"Sure thing\" like purchasing rather than jump hoops without any feedback.\n\nI have adopted from and been a foster for a stringent rescue. I don't mind the hoops... but this process bothers me. In the past the rescues I worked with would contact you. It was \"you get approved, we help find you a dog\" When did we go to this \"our dogs are rock stars and only one lucky person will get a back stage pass\". You need to get past our security staff attitude? I am willing to wait if I know they will adopt to me when the right dogs comes... but doesn't this whole thing make it take longer? EACH dog they have to start the adopter pool at zero with home visits etc? \n\nAnyway... I now am going to a shelter adoption event tomorrow, where I better be in line early, in the hopes I can get a puppy from them.",
            "My dog is the same, she only tears into soft toys because they're easy to gnaw through and take the guts out of. She can tear through a soft toy in the length of a zoom call. I am looking for the answer to this question also... and I don't even work.",
            "This totally sucks, there is no getting around that. But kudos for recognizing and taking action to find a home that suits her better. I had a foster that I fully intended to keep but after a few months I realized he was too much for me to handle alone at that point in my life. I found the most amazing couple who gave him a life I could never had provided. We stayed in touch over the years and it was so heartwarming to see how he was meant to be their dog. I don't know if this is possible, but maybe see if your info can be given to the dog's new adopters, or have a letter that is passed along. It may not help in this particular moment but can help you be confident in your choice later on.",
            "This submission has been automatically removed.  Please post to a more appropriate subreddit such as /r/assistance or /r/charity.  [Here are some tips on affording veterinary care](http://www.humanesociety.org/animals/resources/tips/trouble_affording_veterinary_care.html).  Google \"affordable vet care\" or \"low cost vet care\" in your area.  Apply for Care Credit, a credit line specifically for medical needs.  Check if your local humane society offers a low-cost clinic.  Please consider setting aside a small amount of money every month for future veterinary expenses. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dogs) if you have any questions or concerns.*"
        ]
    },
    "Megathread: Aging, Illness, and Euthanasia Support Group": {
        "title": "Megathread: Aging, Illness, and Euthanasia Support Group",
        "score": 4,
        "url": "https://www.reddit.com/r/dogs/comments/1dl632s/megathread_aging_illness_and_euthanasia_support/",
        "content": "This thread is where to get emotional support with all things related to death and illness with your dog. This is also a thread where you can seek assistance with deciding whether it is indeed time.\n\nThis is not a thread to seek anecdotes with medical care. All rules involving medical questions and anecdotes remains the same for this thread.\n\nIf your dog has passed, you can still post here for emotional support or you can create your own thread tagged with one of the RIP flairs. Be sure to review the rules of our flair guide. It is up to you how you choose to grieve.",
        "num_comments": 2,
        "comments": [
            "Not sure how a megathread works, but here we go:\n\nFor context, my Dad and I went to a nearby shelter to adopt a puppy. We saw her picture on the website and thought she’d be a good fit for the family. I was 15 years old when we brought her home. She was a black and white mixed breed and was with us for 14 years. Yesterday, we had to say goodbye. It happened so suddenly. She was her normal self and then by the evening, became extremely lethargic. I monitored her into the early mornings hours until she violently vomited and fell over. I woke my dad and told him we needed to take her to an emergency vet. After being checked over, turns out she had a spleen tumor that ruptured. She had internal bleeding (hemoabdomen) and either needed emergency surgery or had to be put down. The third temporary option was to give her a Chinese herbal supplement known to slow/stop internal bleeding. We decided to go that route because we needed time to process this heavy news. As the hours went by, she was bedridden, could not get up, and was breathing/panting extremely hard. We were hoping for a miraculous turn around, but at this point, we knew she was suffering. We believed she was too old and weak for surgery.\n\nI’m 28 years old now and I moved back in with my parents because I lost my job. They are divorced and have been for most of my life. My dad never remarried, so this dog was everything to him. He soon retired after getting her, and spent most of his retirement with her by his side. They moved to three different states and she’s been there through many phases of life. I loved her too and while I wasn’t with her as much, I’m grateful I had this past year to be with her under the same roof.\n\nMy heart hurts not only because I miss her, but for my dad. He struggles with depression and I’m worried for his wellbeing after this tough loss. I guess the purpose of this winded post is for words of encouragement and positive vibes. We’ve lost pets before, but he had such a strong connection to this one. It’s the day after and the house feels so empty. It’s the little reminders everywhere😪"
        ]
    },
    "My female is so serious all the time": {
        "title": "My female is so serious all the time",
        "score": 117,
        "url": "https://www.reddit.com/r/dogs/comments/1dl47b6/my_female_is_so_serious_all_the_time/",
        "content": "We have 2 dogs both young F is 11 months and M is 6 months. Our female is definitely a happy dog, but I can't get over the differences. If you are petting the male, playing, talking, anything involving him he's \"smiling\" tongue out having fun. With the female we will do the same and she will often just look at you with this serious face lol. Both are retrievers. Amazing dogs and spoiled beyond belief. The funny thing is we will be doing the above eith our girl and she just sits there almost annoyed and then when we get out to the car, to the trails for a hike, etc she instantly starts \"smiling\" wagging her tail etc. Does anyone else have experience with this. We always say she is a brat. If we aren't doing what she wants to do she's very serious lol",
        "num_comments": 59,
        "comments": [
            "My brother had two huskies. One chased sticks and tennis balls and wanted all sorts of attention. The other one liked to pull the sled. \n\nOne visit the less joyfull one came over to me and put her paw on my arm so I started to pet her. Then I told my brother ”see… she like me”. She wouldn’t let me stop either and put the paw on my arm again and again. \n\nThen the dog crapped on the carpet. She was desperately trying to tell me she needed to go out.",
            "Dogs express contempt/ happiness in different ways. My female has a resting bitch face when when she enjoys the cuddles. I take it as she’s relaxed instead of hyped by my attention. My male is more tongue out hyped up when given attention",
            "One is that she's 11 months old.  I've found that some teenage dogs have a \"Mooommmm, stop it!\" attitude about cuddles.  \n\nI had a smooth collie girl, Zeffie, and one of her nicknames was  \"Spock Collie\".  She was a serious dog but she showed her love very subtle ways.  Such as laying close to, but not touching, me.  If she didn't love me, she would have gone down into the basement where it was cooler. I was deeply moved by this show of affection.   \n\nZeffie also showed her tight bond with me by being incredibly reliable.  I showed her in obedience/agility/herding and she made me look good.   I also showed Dino and Pablo with less success.  They needed my clear headed, calm handling or they would mess up. Unfortunately they had me.  \n\nI'm a crappy handler and I would often get ring nerves.  Tension runs down the leash and if I was nervous, Dino or Pablo would fall aapart.  \n\nIf I my brain glitched and not likely to get back online, Zeffie would, figurative, look up, realize that \"Pablois4 has gone bye-bye\" and proceed to get the job done.  I called Zeffie my obedience guide dog.  I recall two judges - one said \"fantastic working dog, too bad about the hander\" and one looked at me directly and stated \"that dog saved your bacon.\"\n\nMy friends said that it was Zeffie was the one who needed to look at the agility course map.  I'm a worse handler in agility than obedience and that's saying something.  So in the agility ring, I'd  run in circles, waving my arms like a demented windmill and yell \"tunnel! I meant teeter! Left! The other left!\".   After one run, my instructor asked me what I was thinking.  That's the trouble, I wasn't.  \n\nZeffie, somehow,  was able to decipher my bug eyed babbling and a remarkable number of times, did the course correctly.  She even got placements. \n\nMy boy collies have been lovey, dovey sweethearts and never cared if I don't know what I'm doing half the time.  My girls looked at me with clear eyes, and even with all my faults and foibles, still loved me.  Or maybe they just accept that this was their lot in life and had to make the best of it.",
            "When you’re scrolling your Reddit feed, don’t quite catch the subreddit first but see in bold font: My female is so serious all the time 😂😂",
            "Same with ours. We have a male and female around the same-ish ages of 2-ish. The female is much more “complicated” than our male. The male just wants couch, love and cuddles. The female has terms and conditions… funny to see ",
            "I’ve had multiple GSDs through the years. My females have always been more serious. Whole\nmy males have always been goofy, sweet, and cuddle bugs.",
            "I had a dog thats always serious and would walk away if stranger try to pet him. Some would smile at kids across the street until they start screaming like they saw elvis.",
            "As some people say, dogs have their own personalities, just like humans. If you're certain she's not sick and this change isn't sudden, I'd say you have yourself a little brat 😉",
            "Don't mistake smiling/wagging tail for unaffectionate!! I find spending time with you or sitting on the couch together is just as nice as being pet/cuddling.\n\nI love snuggling my girl but I am happy at night she likes her space, so much less heat in the summer!!",
            "You also have an older female and a younger male.  You could have triggered a maternal instinct.  My girl was a puppy until we got her a puppy",
            "I’ve had all male dogs until my current female duo. One of my girls is very sweet and cuddly. My other female is super playful, happy go lucky, and also enjoys a cuddle. Not all female dogs are serious.",
            "I have a female lab/Catahoula mix and she is sooo independent. I sometimes wonder if she even likes me lol. She comes for scratches on her terms and only for a little bit and then she hops off. She has never slept in my bed (not because I won’t let her but because she doesn’t want to). She prefers to sleep on the couch in the living room. She would love to live outside if she could, she likes to just sit and monitor the yard. She has even dug herself a hole out there for her to lay in and the other dogs can’t lay in it. It’s hers ha ha. She’s also very demanding and regimented. She keeps us all on schedule. My boys are Velcro dogs and so sweet. My female is sweet too, just very independent.",
            "I have two Berners.  The male is 9 and very laid back.  The female is 5 and is always on patrol around the house, in our yard, needs to go in and out all day to make sure the property is ok.  She is the one that barks at everything from the mailman to passing bikers.    \n  \nHe is the muscle and only gets involved when her bark changes (I have no idea what his criteria is) and then he adds his big bark that shakes the house.",
            "I’m not sure how true it is, but people tend to think female dogs are more serious and male dogs are more playful and goofy.",
            "One of my mum's huskies is like this, very serious. I call her aloof and my mum gets offended 😅 but she is aloof!",
            "Our females have always been \"in charge\" of their male siblings, especially if we had the female first.  Our current female (Aussie cross) sees her job as managing the antics of her husky brother as well as managing whatever chaos pops up when our friends visit with their dogs.  Years ago we had a female malamute who was quite territorial but always gave leeway to the males.  If another female dared to come into the yard, for example, she would've gone ballistic.  Not the general nature of malamutes, BTW, but dogs have their own personality and quirks like we do.",
            "We have two male dogs and one female dog in my house and the female dog is by far the most serious of them all. She likes her space and is incredibly serious about following rules, to the point where she will make up her *own* rules about things and refuse to not follow them. I absolutely adore her personality and find the friendly goofy males in the home to be too much for me a lot of the time.",
            "My female is the same - she literally just sits and stares at me, hardly any tail wagging. But if we are on a walk or at the beach she is happy as can be. My male is the most happy go lucky dog - I chalk him up to being grateful bc he was a rescue with a bad start. I think my female is spoiled and has too much energy so she is constantly looking at me to entertain her. Hence the reason I got the male but she could care less about him 🙄",
            "Literally a resting bitch face.",
            "My 2 year old  Chocolate Lab only has his tongue out for two reasons, he's playing fetch with his ball or he's really hot.",
            "I’ve only had three female dogs in my life. Two of them were definitely more serious. The third is a super affectionate, playful goofball who loves everyone and everything",
            "My male dog is the serious one and my female dog is the crackhead",
            "The way I thought this was about a human woman before I saw the sub. Jesus.",
            "I was thinking this between my dogs as well. Different breed, but the personalities and age are about the same. My female is a year while my boy is 8 months. He's the biggest goof ball, tongue ALWAYS hanging out the side of his mouth, playful and gets the zoomies....the female, hardly ever. Always seems serious....idk.",
            "Some dogs don’t really care for physical affection. They love attention and interaction with the handler or owner, but when it comes to pets they can take it or leave it. They show their love in other ways.",
            "I have 2 Cardigan Corgis  - Cooper (F 2.5 years) and Oscar (M almost 2 years). It seems our dogs’ personalities seem to be very similar. Cooper is serious, will chase her ball  and go on walks all day! Oscar is a laid back boy. He would rather sit on a park bench watching the world go by than go on a walk! Oscar is always happy and Cooper is various serious.",
            "Seems like ur dog just likes hiking a lot and gets enjoyment out of that",
            "Of my 2 dogs (Male Shepherd and Female Rottsky), the female is very serious.",
            "My 1-1/2 yo girl is a mountain cur mix with about 18% retriever. She has a very quiet dismissive mood about her when she’s not actively playing. A happy girl but when she’s quiet like that I call her “my brooding goth teenager.”",
            "My lil ”brother” had a huge smile and was a jokester who could make me scream with glee, the little girl who I am now fostering (after her Nana died) doesn’t do that at all. I wish she would, but that’s not who she is. I just make sure she has her needs fulfilled and hope someday she’ll warm up.",
            "I saw something about how female dogs are more likely to judge us.  Although,  11 months seems too young for her to have lost that goofy puppy expression.  \n\nMy adult male dog puts on a show for other people, where he seems like the happiest dog in the world, and as soon as they leave, he goes back to his usual pouty, brooding, grumpy version that no one but me gets to see.  It’s hard to convince people he’s not the happiest dog ever.",
            "I have a female Rottweiler that’s like this",
            "I think female dogs, at least in my experience are a bit more serious that doofus male dogs. Though personalities vary greatly my dog is a goofy goober but he also doesn't like cuddling. He enjoys pets and comes for kisses but when we go to bed if you try and cuddle him he will move. \n\nOr maybe being around a 6 month old little brother has her in her teenage angst phase lol.",
            "Dog: Why I'm surrounded by idiots.",
            ">She was desperately trying to tell me she needed to go out.\n\nOh geeze, thanks for the cautionary tale. Our broken husky mix would just sit and STARE at us. She's had a rough start in life and has taken a long time and a lot of work to get to the trust point. So now she will come and rest her head on a thigh and STARE HARD at us. Sometimes she will put a paw on a thigh, again and again. It could mean scritchies, or it could mean she needs to go outside. Or just WANTS to go outside. I haven't seen any connection between her urgency and need to pee/poop, but I'll keep working on it.",
            "thanks for making me laugh out loud, the ending was so unexpected",
            "Hilarious",
            "My alsation x staffy girl crosses her back legs and just leans against the back door to signal she wants to go out. lol totally silent, and if you don't see her, there's no way to know",
            "Favorite thing I've read on this sub, thanks for sharing!",
            "You accidentally stroked the poop chute button",
            "You just described my dogs. Honestly, the only time my girl \"looks happy\" is while playing with my boy.",
            "Such a lovely comment",
            "I love this!",
            "Beautiful ❤️ my f JRT is 10 now and is in old age serious no play mode!\n\nI’d love some tips if anyone has any!",
            "Lmfao! Her too!",
            "Kinda funny, but rats are similar. Males are lazy and cuddly, but females are more into exploring and are a bit more serious.",
            "This is my guy\n\nHe will go up to smell them, but doesn't want to be pet what so ever.\n\nEarly in to having him he would make a hard b line away from pets. Now he will accept 1-2 head pats and then leave.",
            "I think in general we think that of human children too",
            "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^kimmortal03:\n\n*Seems like ur dog just*\n\n*Likes hiking a lot and gets*\n\n*Enjoyment out of that*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
            "I don’t know if you’ve tried it, but you might want to consider bells on a string?  \n\nWhenever my boy wants to go out he walks up to the door and paws at it or hits it with his nose to let me know he wants to go out.",
            "Yes it was Indeed unexpected 😀",
            "😆🙊",
            "I like the idea, just never got around to getting one with this silent doggo. I'll have to figure out how to hang them, since they don't work well on our thin lever-handle locksets. One day, she'll run up to me with the string of her bells in her mouth!\n\n*Edit* okay, u/Bercom_55 it's on order! We'll see how the muttsky handles it!",
            "They sell ones that are more like a door bell. You can just attach it anywhere on a door/wall, and the dog hits it with their nose. \n\nNever got much of a chance to test this out with my pup, because after a day, cat figured out that he could set off the doorbell at 5 am, which meant the dog expects to go outside, and then the whole family was awake. Happened 2 days in a row. And that was the end of the doorbell.",
            "Could you get a suction hook? Depending on the material of your door that could work!",
            "Fair enough.  My dog is silent too.  Almost never barks, so it’s hard to know what he wants.  \n\nThe only other thing I can think of is that I taught him the word for outside and always ask if he wants to go out if he’s by the door (the answer is always yes).",
            "Those are brilliant! Without the evil cat, of course! Too bad our muttsky has two braincells and would probably set it off, then start barking because that's what the doorbell means, right?",
            "It's a metal door (I think aluminum) with a huge glass insert. I have an ikea suction cup I will try!"
        ]
    },
    "What random little thing are you obsessed with? ": {
        "title": "What random little thing are you obsessed with? ",
        "score": 40,
        "url": "https://www.reddit.com/r/dogs/comments/1dlbh19/what_random_little_thing_are_you_obsessed_with/",
        "content": "For me it’s her whiskers. They’re so long and cute. She’s a border collie.",
        "num_comments": 83,
        "comments": [
            "His ears, they're so soft and kissable 😘😘😘 bonus: at least one is almost always turned inside out",
            "When my dog is laying on his side, he'll often use one of his paws as a little pillow",
            "Her eye makeup! She has the most beautiful black markings right around her eyes...it's very exotic! She's brown so it stands out.",
            "His snoring.",
            "His eyelashes. They are so long and full.",
            "The little noises she makes when she stretches",
            "My dogs have longer tails that stick up when they walk and I’m obsessed with moments where I can see nothing of them except their tails just bobbing along. I think the little wobbles their tails do when they walk are so cute.",
            "Her little dance at dinnertime",
            "His toe beans",
            "Soft, velvety lips or a bottom “bumper” lip. My ACD/pittie had a slight under bite so his bottom lip was more visible and it was just very cute. \n\nI also love that little spot on their foreheads between and just a tiny bit below their eyes that is extremely kissable :)",
            "She gets her lip stuck to her side teeth all the time which looks hilarious. \n\nThank you burp when she finishes eating. She comes and finds me and burps at me.",
            "The way his nose scrunches when it’s pushed against stuff",
            "those six front teefies ❤️",
            "My dog's tail. He's a poodle mix with salt and pepper hair that makes him look old when he just turned 2. His tail looks like a skunk's. Always curled into the air behind him, black and white fluff swishing side to side. It's why his nickname is Stinky.",
            "How cute his hind legs look when lying down … can’t explain it but it’s cutest thing ever",
            "My dog's ears are fully erect and I absolutely love them.",
            "When my dog is asleep with his legs fully extended against the wall. We joke that he's holding up the house.",
            "Their smell",
            "The smell of my dogs feet (smell like popcorn).",
            "Our 3yo lab has a super stretchy melty face and tons of neck wrinkles. He enjoys getting them massaged as much as I enjoy rubbing and manhandling them. It's's like silly putty but better. For our new girl (ACD mix), her ears are super expressive and bounce when she trots and she LOVES having them rubbed to the point her eyes roll and she zonks out.",
            "Every day I have to inspect which paw is the cutest paw of the day",
            "A certain moment in our morning routine: When we get up, she gets breakfast. Then we go for a short walk. She knows that she'll get a little snack after the walk, so when we come home, she sits in a peculiar, expectant way on a certain spot. Her facial expression and body posture while she waits for her snack always melts my heart <3",
            "beautiful",
            "My bulldog snores like a freight train. I always said I hate it, but if I spend one night away from her can't sleep. I have become used to having to hear her snore to be able to sleep. I also am obsessed with her tongue. It sticks out all the time and becomes dryer than sandpaper.",
            "her belly button 😂 whenever i can see it im like “omg!!! your bellly buttttoonnnnn!!!” and give her so many belly button kisses",
            "She has floppy ears that are way too big for her and look so silly but adorable. She can hold then up for a bit but they always flop back down. She likes to have one up one down.",
            "When my girl wakes up and stretches and rubs her little nose with her paws",
            "My dogs noses. Can't get enough. Love to boop the snoot",
            "i love my saint bernard's giant nose! it's so huge like a bear's!",
            "How my doggo's abnormally long tongue hangs out of his mouth. It just doesn't fit and it's so cute.",
            "The way my Havi runs up stairs looking like a rabbit hopping.",
            "One of my huskies has a floppy ear. Let's her get away with absolute murder. She also has one black whisker. \n\nMy pomsky is all kinds of built wrong so her tongue is too big for her head. When she's sleeping, it's always poking out. When she's exercising, it gets so long she could lick her own eyeballs. \n\nMy boy husky was malnourished in his first year so his skeleton hasn't grown big enough to accommodate the muscle mass. It also means his jaw isn't wide enough for all his little teefers and they're a little squished and I love them.\n\nThe last husky - everything. Hairy little feet, white eyelashes, snow nose. All of it.",
            "Directly behind her ears smells SO GOOD. Bottle it and make a perfume because omg. It’s not her bath products. Idk.",
            "Toe beans and the fleshy paw pads.  Also, the super soft fur on their chest.",
            "Right now I’m obsessed with this post 🥰",
            "My heart dog had a snaggletooth and it was the best thing ever. He was just perfection. I have him tattooed on my shoulder.",
            "Older girl’s dream activities. She twitches, she sniffs, she runs, she wuffs, she wags her tail. Adorable.\n\nYounger girl’s eyes. She has such deep, galaxy eyes, and will just stare into my soul. Love.\n\nOlder boy’s poise. He *knows* he’s the Goodest of Boys, and it’s evident in his posture. Especially when he comes to parade your stolen socks over you first thing in the morning, grunting satisfactorily to himself. Hilarious. \n\nYounger boy’s gentleness. He’s got big dog in a small package energy when he’s out and about, but at home he gives such tender little kisses and snuggles right up to your neck. Sweetie. \n\nPlus they all smell like corn chips when their feet get toasty from being in your lap. Delicious!",
            "Just his fur in general. I always brush and pull burs out of his coat so I’ve gotten to use to just messing with it that it’s become almost like a fidget toy to me.",
            "His legs. He's a corgi, everything his legs do and every way he holds them melts my heart",
            "His hair. He has the wildest bedhead 24/7 and looks like a lil’ electrocuted pickpocket. ",
            "Is fur color 🥰🥰 he’s such a gorgeous Supermutt with a red-silver coat 🥰🥹",
            "He’s a chihuahua and jack russell mix. He’s got the body of a chihuahua but the coloring of a jack. He’s got big pointy ears on this little body and it’s the first thing people comment on.",
            "Her nose and her floppy ears.",
            "The way his little legs look when he’s running directly towards me.",
            "I have a shar pei so he has sort of a puffy nose and I just love to put my hands under his mouth, then take my thumbs and just rub his puffy nose and lips. If I could just sit there and rub that spot and kiss his cute little face all day, I would!\n\nEdit: dog tax on my page if anyone wants to see his smushy face ❤️",
            "Her curly tail!",
            "Dog noses and the cutaneous marginal pouch.",
            "Hear me out—her cranium. So round. So sloped. Full of concepts and dog thoughts. She has kind of long ish face fur there and it isn’t soft but it sticks out as if it were and it’s the perfect shape to pet.",
            "It’s the cold wet nose for me.",
            "The way his legs end in his sturdy big feet.",
            "For my one corgi, his snoot and face. He loves getting his cheeks pet and I love doing it.  He gets so happy and there's just so much trust there.  \n\nFor my terrier girl, her belly lol.  When she's on her back I like to pet it bc it has very little hair and it feels like suede almost.  \n\nFor another corgi, her booty. She's a butt wiggler and she's got a heart spot on it too.  \n\nFor my border collie girl, her eyes. They're so human like. \n\nFor my other other corgi, his hugs. He only does it with me. \n\nYes, I have 5 pups, yes I'm crazy lol.",
            "The way she chewed a carrot. Or the way her paw violently whipped through the air and slapped my hand when I asked for it.",
            "The way she runs in circles for joy.",
            "I have a new rescue puppy. Puppy feet smell like corn chips. 😂",
            "When she runs in her sleep!",
            "her soft ears or when her lips get stuck and her teeth stick out lol",
            "Toe-tufts. My daughter lets her Springer Spaniel’s toe-tufts grow too long and whenever I see him, I want to grab some safe scissors and prune them!",
            "It’s a chihuahua and when I put her out side, she observes with her ears erect and then heads away with the radio antenna tail twitching from side to side.",
            "\nI love smelling my dogs feet and kissing them between the eyes. I have a bigger dog and a smaller dog, and my smaller dog will walk up to me, put her head in my hand and look me in the eyes until I kiss her on the forehead 🥰🥰",
            "My girls  eye lashes, they are absolutely stunning, and I am so envious of them!",
            "The barking while sleeping.  Any time I hear it, I stop what I’m doing and listen to it.  It melts my heart.",
            "The speckled cow print belly skin 😍",
            "We have a whippet and she does what people call \"woo woos\". She doesn't really bark at anything, but she will woo woo when she's happy or playing. \n\nSo when we get home, she woo woos at us. Also if we're playing \"keepaway\" outside and we have her toy, she'll woo woo at us in a sort of \"gimme my toy back\" way which is hilarious.",
            "His chin when he lays upside down 🙃",
            "His wrinkle face!",
            "I second this, and also, this might sound gross, but I love to sniff the ears, too. I wouldn't say they're stinky, but they just smell like my baby boy.",
            "Ooohh yes!  Those soft sweet ears.",
            "My boyfriend calls this an ear kaboom 😂",
            "My dog has blank “guy-liner” as my husband puts it. 🤣😍",
            "Our boys winged eyeliner is beaut",
            "My dog snores louder than I do.",
            "My dog is smaller and has a naturally docked tail, so it is like half the size of a normal tail. It sticks straight up and I call it her antennae, because that's often all I can see of her. It's so cute!",
            "Omg that little spot on the forehead!!! I love to rub it and kiss it-it’s just so soft and smooth",
            "THIS!!! When my dog is licking out her food bowl her nose gets all scrunched up and I squeal out of abundance of adorable everytime",
            "I came there to say this!!! I always get a sniff before bed 😂",
            "Or corn chips!",
            "Dogs don't have belly buttons...?",
            "Same !! I just LOVE her ears, so soft and cute, and they smell so good ! Sure, I guess technically it stinks a bit, but it doesn't, because it's her smell ❤️",
            "Frito feet. Haha"
        ]
    },
    "hair resistant bed sheet set for hairy dogs and cats": {
        "title": "hair resistant bed sheet set for hairy dogs and cats",
        "score": 3,
        "url": "https://www.reddit.com/r/dogs/comments/1dlq7e9/hair_resistant_bed_sheet_set_for_hairy_dogs_and/",
        "content": "I am looking to get your opinions on a product I am about to launch \n\nHAIR RESISTANT NATURAL BEDSHEETS ( sheet + duvet cover + pillow cover )\n\n1. 80% less hair clinging to the bedsheet, compared to standard cotton \n\n2. 100% natural yarn and colours. OEKO TECH approved \n\n3. Anti microbial and anti dust makes it better for allergic dogs and humans \n\n4. Cooling and moisture absorbing \n\n5. Satin finish stripe weave \n\n$135 for a queen sized bedsheet set \n\nWould you buy assuming website and images and product are high quality? If not what’s stopping you? \n\n\nThankyou, I appreciate your res-paw-nce \n",
        "num_comments": 4,
        "comments": [
            "The price would stop me full stop 🛑 I'm assuming that's usd, that would be $180ish cdn right now",
            "Does it come in yellow",
            "Pale yellow perhaps"
        ]
    }
}