{
    "Picked up my own order": {
        "title": "Picked up my own order",
        "score": 201,
        "url": "https://www.reddit.com/r/doordash/comments/1dlheex/picked_up_my_own_order/",
        "content": "Last night at 1am I ordered some Jack and the Box to my house. I was at a friends house finishing up a game of madden and wanted the food to meet me at home before bed. After ordering I waited 20 minutes and nobody had gone to get it. Once they finally assigned somebody he began sitting at his house on GPS for 15 min. On my way home I said fuck it and I drove to Jack in the Box, beat him there, picked up the order for my own name and canceled it while they handed over the bag. I know everyone still got paid but I thought it was funny lol ",
        "num_comments": 87,
        "comments": [
            "Thanks for making a r/doordash submission, please remember to follow our community guidelines, let's be kind and respectful to one another.\n\nLastly check out the [Wiki FAQ](https://www.reddit.com/r/doordash/wiki/index/) before submitting a question. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/doordash) if you have any questions or concerns.*",
            "I once logged in as a dasher after ordering some McDonald’s from like two miles away and no dashers taking the order ($6 tip and very low traffic main roads between where I was and the store.) so I was like fuck it and logged in to dash. My order was the first thing it pushed at me. Got my 6 dollars back plus $4 because my order was sitting so long.",
            "I had a customer who picked up his own pizza once.  It was a small town middle of nowhere with no tip on a Friday night.  But I had just dropped of an order, and was gonna make 2 50 for my drive back so I accepted.  Owner told me what happened,  no signal couldn't get thru to support.  So I just hit complete as I drove by his house without even slowing down.",
            "So did you tell Jack in the Box what the deal was or did they just let you walk in and believed you were the dasher for said order? lol",
            "You canceled the order but everyone got paid? How does that work exactly?",
            "There was one time I saw the dasher sitting at a park for 30 minutes and I had gone on my lunch break  10 minutes into that 30 minute wait cause if they picked it up in 20 they should of been there with time for me to eat.  Well I clocked back in and they're still at the park.  I called support and told them about the wait and what I see and they're are all no they are at the restaurant.   I was like that's not what I see I'm already back from my lunch with nor eating I'd like too just get cancel and get my money back.  They said I can cancel but I won't get a refund.  I was like why,  they said policy they are there.  I said they aren't they never went to the location they drove  and went the opposite direction and parked at a local park.   They said no,  so I said well when am I supposed to get this I'm already back on the clock.  They said soon.   20 minutes later, so 1 hour 20 minutes all together they texted saying my driver is now so and so and is on his way to the restaurant.  I just laughed and was able to eat on the clock because I showed my boss everything and he was like fuck that app.  I haven't ordered since but that's the one weird order I've had,  usually it's 35 minutes.",
            "update there was no refund forgot to add that",
            "So you are flexing about stealing your own order? Part of the reason these stores act like Nazis about us hitting confirm. SMH!",
            "I live about 28miles country roads/15miles toll highway away from the nearest shopping center and I asked my wife to order some tacobell as soon as I was ready to go home, I told that I was going to be the one taking the order. And she was skeptical. \n\nI drove to the tacobell this was 10PM I probably waited 20min after she had ordered it then I get the offer on my screen. The order came in at $10.50+ for 18mi on toll I took it. It ended up being $24.75 when I delivered it. My wife then told me she tipped $20 because she didn’t want to have another driver drop it off and not have a tip. \n\nSo the order ended up being $24.75 for 16.5mi, I got “paid” and got a trip home so no dead miles 🤣\n\ninb4 pics or it didn’t happen: I recently deleted a bunch of screenshots from DD and I deleted those screenshots so no pics 😫",
            "I’ve noticed as a driver that if the tip isn’t high enough people will not take it.\nI went to Papa Johns before, it was $6 for 2 miles late at night so I said why not, get there to find out the pizza was sitting for over an hour, customer got tired of waiting so picked it up himself. \nThe restaurant never remade the pizza or even offered. 🤢🤢",
            "They won’t let customer’s pick up their own door dash orders in Austin, tried that once with a late order",
            "lol I did the same thing once with papa John’s , it’s was late like 11:40 and papa John’s closed at 12 I had been waiting for a dasher for almost an hour . Restaurant 1.5 miles away and I tipped $2.50 nobody was picking it up so I finally just said fuck it . And drove to papa John’s , acted like a dasher reading my phone and said “order for (my name) and they just handed it to me no questions asked , I went home and eventually doordash canceled my order and gave me a refund lol",
            "I don't understand why you ordered through door dash in the first place. You were already out and needed to drive home. Obviously it wasn't far out of your way. I feel lazy enough when I'm home and don't feel like going out I can't imagine being out and being like I can't drive a couple minutes out of my way I better get it delivered. 😂",
            "Wow . How terrible",
            "Sounds like you just took extra steps to overpay for some cold food.",
            "-98% sure this dude was on EBT, so he was milking the clock for your order. EBT is wiiiiild.",
            "Should have kept it open to waste every drivers time that went to go pick it up",
            "Pathetic Thief",
            "wait that’s so awesome I used to do ubereats but I would never order during that time hahaha",
            "I did this when my mom was visiting from Florida. No dasher were taking my order. So I signed on to dd driver app and it popped up as an offer. My delivery fee was covered plus some 🤣",
            "So you made money?  Unless I’m forgetting something. Oh yea that service fee and delivery fee that you pays to DD. You showed them…",
            "😂😂😂",
            "I came thru the drive thru and pulled the page to a favorable screen where it showed my receipt",
            "My very first thought, Jack in the box and the driver (deserved it) got got",
            "there was no refund",
            "Dumbass was probably on another app doing a delivery",
            "I’d put this at the top of your post. As an edit. It’s way too far down at the bottom for anyone to notice.",
            "So it’s such a problem hitting the confirm button. Stop riding so hard.",
            "Personally, I think this is fine if what he said is true. Fk that driver who did nothing for 15 mins.",
            "[removed]",
            "if he's rich, why not?\n\nthe thing i object to is ordering *jack in the box*... exactly what can you order there that will be worth eating 30 minutes after it's prepared? \n\nburger? fries? what are you gonna do, nuke them? no thanks!",
            "on dd the first driver to attempt to pick it up would get the order cancelled with half pay. plus, the customer would get a full refund.",
            "all I stole was that dudes confidence",
            "Better than nothing",
            "And the fake menu prices that are 30% higher than at the store.",
            "You cancelled the order…the refund takes 5-7 business days. You are a shit person.",
            "Sounds about right,  someone i work with said the same thing,  probably what it was",
            "I have no issue showing them I’m hitting “confirm” but when you ask me to confirm and then spend 3 more minutes putting stickers on the bag or filling a drink I’m a little pissed, I’ve started to refuse until I physically have all the items and the order is ready to go, “I’ll hit confirm when the order is ready for me to take….” \n\nI also had an owner ask me to show him I hit confirm, I held the phone out and pressed the button and showed him. He took his time tying the bag up and reviewing the order and I was pretty perturbed as again, “confirm” means I have the shit in my hand not watching you do shit that should have been done before you made me hit the button. I go to leave and he came flying out to my car as I was getting in it yelling I didn’t hit confirm— I told him I had, right in front of him, and then he demanded I do it again. I said I can’t confirm it again, my phone is now in navigation mode as I’m now supposed to be delivering this order. His system was showing it like I hadn’t confirmed anything and he was pretty upset about it. I hate picking up orders from there because the dude is Russian or something and just screams “CONFIRM! CONFIRM! You CONFIRM!” at me now.",
            "It’s not a problem hitting confirm. It’s the insinuation. It’s a polite way of calling us a bunch of thieves. Now I tell them I already did. Just to watch the confusion. lol. I don’t tell them how to do their job, I don’t need them micromanaging mine. I do DD, because I don’t want a boss. I’ll be damned if I’m let them dictate to me how and when I do mine. But that’s just me.",
            "mf was straight chilling like damn bruh my foods dying in the window",
            "You wouldn't say that if you were the owner of Jack in the Box.",
            "“yOu StOlE fOoD” cry me a pond to swim in bro",
            "Lmao I tip $1 a mile usually , the place was 1.5 miles away.   Tipping culture is disgusting. 2.50 was more than enough",
            "Not really cus at that point he could have just drove to the store without ordering through DD and not paid the extra money lol",
            "Dude it’s a multi million dollar business and the dasher didn’t complete any work anyways? Who exactly is getting hurt in this situation???",
            "no u r aren’t that smart. after a certain time it doesnt allow refunds without contacting them so he didnt get one",
            "Yep, he stole the food.",
            "I don't mind them wondering if people pickup up random food thieves...I mind that it takes 3 steps and is so awkward.  \n\nThat transition from talking to \"here look at my phone\" is jolting for them for some reason. Wish I could just swipe my phone and it would show up on their display or something.",
            "As someone on the other side (restaurant), I can say that the issue is not about Dashers stealing. It is not about giving you “orders”. \n\nIt is that if a Dasher picks up an order and leaves without hitting that “Confirm” button, Doordash sends another Dasher to that restaurant to pick up that order. This becomes a big headache if the restaurant is busy. That Dasher gets mad at you because time is money for the Dasher. One time, a Dasher was mad at me and said “Can you just re-make the order?” Well. Remaking an order takes time. It gets stressful when the restaurant is busy and I have to put this order in front of all other orders. The restaurant can’t just cancel the order. It has to call Doordash support. Doordash will tell you to re-make the order and will give money for the order picked up by the previous Dasher and the order you are told to re-make. But, while the restaurant is busy, you also have to spend a few minutes calling and talking to Doordash on the phone to explain the situation so that you can get compensated for the previous Dasher’s mistake. \n\nDoordash knows that the previous Dasher was at the restaurant because that Dasher was assigned initially. Doordash support can see both Dashers assigned to this order. I do not know if there is any penalty. But, as someone on the other side of the situation, I see a lot of Dashers that are distracted (talking to someone on the phone or watching videos). Some of them forget to hit that confirm button (or maybe hitting a wrong button) and leave, causing this cascade of events for the restaurant and the next Dasher. That is why some restaurants are demanding like that. They will get the money, but they also waste time and get stressed.",
            "So? Just cause they asked u to press a button on your phone. You’re worried about the wrong stuff.",
            "Indeed, but I am not the owner.",
            "lol, I get where you’re coming from but that’s why your order wasn’t picked up in the first place. I’m curious, what that 2.5 dollars is in terms of % of your total order? I’m assuming it was pretty fkn low, and I can guarantee if your tip was around 15-20% your order would’ve gotten there in a timely manner. also here’s some advice, if your tip is going to be shit in the first place it’s better you just go pick it up yourself and save some money/time.",
            "plus they up charge you each item",
            "I was scared to even bring that stance up with redditors 💀💀💀",
            "Somehow it’s ok to steal from multi million dollar businesses? Where do you draw the line? At what market cap/net worth exactly?",
            "I mean refunds do take that long so nothing I said was false but thanks for your input it added a lot to the discussion.",
            "Come on, I’m a sucker for following rules too but he stole his own food??",
            "That’s a lot of words. And we cannot get to the map and continue with the order, if we don’t hit confirm. We know how to do our jobs. It’s annoying and insulting. I know the ones who are rude and demanding. I just tell them I already did. And watch them mentally squirm! lol. I know how to do my job. I don’t need them to tell me how to do it. It is easier to just say to each their own, and move on. I have fun with it now. If they insist on me showing them I hit confirm, I simply state I already did. Or if they are being super rude about it, I’ll say no habla English! Lmao!!",
            "Yeah well, I’m not the type to take orders from anyone. And some of them are friggin rude about it. You worry about you and I’ll do me. Bet?",
            "Touche",
            "My order was $19 so 2.5 is about 13% which is ridiculous for tipping for drop off before a service is done. So no it was not a shit tip for the order amount , dashers are just tip baiters and it’s hilarious 😂 I’ll stay tipping $1 a mile cause that’s all they deserve. But I do always add tips for good service and timely drop offs",
            "$40 exactly 👍",
            "I’d say it’s a service to steal from million/billion dollar industries because they constantly steal from society but as it is it’s the peasants that feel the pinch, because the people who deserve to feel it will just steal more from their workforce.\n\nThe world it’s going to hell",
            "The downvotes are because you are wrong, in case you are wondering.",
            "no one is talking about refunds taking tht long dummy. we talking about if the order is already prepared u don’t get a refund",
            "Well. I had to explain the restaurant side of the story. I do not know the Dasher side of the story because I’ve never done it. If you mean most Dashers by “we know how to do our jobs”, yes. But, there are some who make this mistake and cause trouble for everyone else. Like in everything in life, there are rude people. There are a lot of rude Dashers just like those rude restaurant workers or owners. I’ve seen both.",
            "you take orders all day and deliver them. It’s called dashing. You are following someone’s orders constantly. \nThey’re rude but dashers are even more rude and entitled. An example you.",
            "jack in the box didn’t lose anything it was too late for refunds",
            "Dashers aren’t tip baiters. DOORDASH the company is tip baiting. They should call it what it is, a bid. You should place a bid for good service. And if the service is good, the tip is added. \n\nDashers aren’t your enemy, we just deliver. That billion dollar mega corporation is your enemy.",
            "That’s fine, and you’ll stay waiting for longer periods of time for your order or like in this situation not even get it in the first place esp late at night, gl.",
            "Make sure you never go above that to avoid self sabotaging",
            "Steal.\n\ntake (another person's property) without permission or legal right and without intending to return it.\n\nWhich multi million dollar company steals and how? Have you reported it to police?",
            "😂😂 thank u for explaining tht to tht idiot",
            "And I’m giving you the last word. Ok feel better now! Lmao!",
            "Only times I have problems is late at night , which I rarely order, so I think I’ll be good",
            "🤣🤣🤣🤣 you obviously missed my lower comment lmfaooooo thanks for the dopamine hit BAHAHA",
            "After DoorDash is paid premiums by all clients, they then tack on bullshit amounts of hidden fees to customers and afterward attempt to gaslight the already overcharged customer to tip dashers more so they can pay dashers less. \n\nMost of these companies take advantage of workers and consumers like this, if you don’t think that that’s stealing, I can’t help you.",
            "Yeah idk what comment you are talking about.. maybe the comment i was responding to was sarcasm and i missed it",
            "It’s not, i have never ordered from doordash, i dont think i can afford it tbh, and I have never delivered for doordash.  I am not sure why this sub shows on my feed and I did not help that with this interaction.\n\nI do agree that they overprice items and they gaslight both, the customer into tipping and the driver into the idea that a customer must pay a significant tip on top of a delivery charge and a premium on items.  This is a voluntary exchange on all sides though.  I can opt out of the scam."
        ]
    },
    "Saw this today!": {
        "title": "Saw this today!",
        "score": 86,
        "url": "https://i.redd.it/or14e5tqp08d1.jpeg",
        "content": "",
        "num_comments": 30,
        "comments": [
            "Thanks for making a r/doordash submission, please remember to follow our community guidelines, let's be kind and respectful to one another.\n\nLastly check out the [Wiki FAQ](https://www.reddit.com/r/doordash/wiki/index/) before submitting a question. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/doordash) if you have any questions or concerns.*",
            "\"oh *meet* at curb? I thought the app said leave at curb, sorry!\"",
            "I've had directions say leave in driveway. Maybe this person really doesn't want them driving on their driveway? Or no tip possibly...",
            "That’s wild. ",
            "i placed an order at my retail workplace once.  the directions were to leave it at the door, so my dasher followed the directions\n\n  \nthere was a homeless person sleeping there, and he ate my order instead",
            "Prolly an abusive no-tip customer. There have been times where I’ve accepted the order and received 5 page demeaning and degrading “instructions” and it’s a no tip order— I’ve daydreamed about drop kicking their food onto their porch. Shit like “Failure to follow my instructions will result in a 1 star review let’s see if you can follow them.” \n\nDropping their shit out the window onto the curb would have been more than generous.",
            "Who would do that??",
            "“contactless delivery”",
            "I literally lol’d",
            "I wonder if he or she were following directions",
            "Just drive there, open up the door, set it on curb, and drive away. This is faster. Good idea.",
            "Literally any driver who knows they aren't getting tipped. That's who. Also 5$ or less isn't a tip cheapskate it barely covers gas and ware.",
            "Curbdash 😂😂😂",
            "Leave at end of driveway. “End” flips based on perspective / which end your on.",
            "Clearly it was supposed to be delivered at 1045 and the dasher couldn’t find it between 1044 and 1046 so thats about middle ground",
            "I once had a person ask me to leave it halfway up their driveway. In doing so, their big dog ran up from the porch and bit me. If I ever do a delivery to a house with a dog sitting on the porch like that again, I’m leaving the food on the curb just like this picture.",
            "Looks like someone didn't tip or they have a dog that likes to attack",
            "Must not have tipped and they got their money's worth",
            "There was a dog in the yard, and the customer didn’t answer the phone. I figured their invisible fence didn’t go past the grass so fido couldn’t chew it up.\n\nI don’t deal with ANY dogs. Bring them in or walk to wherever I could manage to drop the food off.",
            "That's a different level of laziness 😂",
            "Can’t read directions.,illegal I had a customer tell me her order was left in middle of driveway by one",
            "Leave meat at curb",
            "If the customer instructions were for me to put it on the curb, I’m gonna put it on the curb",
            "Me after my dumbass waits ten minutes for someone to give me their pin number.",
            "Tip me $1 and don’t leave any porch light on? It’s going under the street light in front of the house.",
            "Your onto something. Dash for rats.",
            "Had a customer today that had ‘leave at door’ but there was a huge dog in the yard!!?? Hell no. It’s going on the curb!",
            "Huh?"
        ]
    },
    "unsafe mcdonald’s pick up ": {
        "title": "unsafe mcdonald’s pick up ",
        "score": 7,
        "url": "https://www.reddit.com/r/doordash/comments/1dlsf0y/unsafe_mcdonalds_pick_up/",
        "content": "hi! i am a dasher in florida who picked up an order for a customer at mcdonald’s. they would not allow me to pick up the order through the drive thru and made me ring a door bell on the side of the building to stand and wait outside for the order. i rang it and they said they would be right out. it was 4:45 in the morning and i am a 5 foot 100 pound female. while waiting i had multiple homeless people approach me. it took over 15 minutes for an employee to come out with the order and i rang the bell several times with no answer. i called doordash safety to let them know my concerns of this location but is there anything else i could do? i called the store to tell management the unsafe situation there system put me in and they hung up while i was speaking. i have never felt this unsafe while dashing and this experience makes me unsure if i can continue doing this job. any advice or comments will be greatly appreciated \n",
        "num_comments": 20,
        "comments": [
            "Thanks for making a r/doordash submission, please remember to follow our community guidelines, let's be kind and respectful to one another.\n\nLastly check out the [Wiki FAQ](https://www.reddit.com/r/doordash/wiki/index/) before submitting a question. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/doordash) if you have any questions or concerns.*",
            "i’m so sorry you went through this. that is completely unsafe and any of those people could’ve hurt you (whether they’re homeless or not). the most you can do is just avoid any mcdonald’s orders that early in the morning or late at night, or bring someone with you when you’re dashing that early or late. good idea to bring someone with you anyways since you’re stopping at random houses and dropping off food, DD doesn’t background check their customers so you could easily just deliver food to someone who just wanted a victim not a meal.",
            "I don't understand how they wouldn't allow you to use the drive through. That makes zero sense. ... Like, absolutely zero sense.",
            "Most mcdonalds do this now. Its a mcdonalds policy i believe",
            "I am a 6’ male and I still carry mace while doing deliveries. Besides not ever going to this restaurant (and probably this entire part of town) again, I’d suggest that.",
            "Call Mc D’s Corporate",
            "I get it. It’s a societal issue. When I doordashed I didnt feel safe a lot of times either. Only way is to vote in local districts for people that will take real steps to make things safer.",
            "I would go up a level in contact corporate because odds are the person you talk to is the one who implemented this policy in the first place.",
            "you are so right, any part of that situation could have put me in danger. my mention on people approaching me was less on the type of people but speaking more on the safety issues of this location. i wanted to get the breakfast crowd and got an early start but this being my second order i immediately ended my dash and went home. i wish i had someone who could come with me to make deliveries for my safety. i am fully reconsidering being a dasher because no money is worth the feeling i feel right now",
            "Anyone can hurt you. You could go to a gas station and get robbed. Or some people started putting razor blades on pumps to cut people.\n\nThese days its never really safe in public",
            "i feel the same way. i originally went through the drive thru and they told me they cannot hand me order that way and to go outside on other side of building. no other mcdonald’s i delivered for has had this policy. i regret not cancelling order in that moment because no amount of money was worth me feeling this unsafe",
            "Most McDonalds I have seen do this now. They want the drive thru clear and rather make dashers wait then drive thru lines… but most have windows now at least in the states i have been to",
            "Everyone is a law maker these days.   People like to make up laws and then enforce them.\n\nNot just McDonald workers.   Most people just like to boss other people around, given half a chance.",
            "it very much is a society issue from people lack of care for others. i generally feel very safe dashing even in very unsafe neighborhoods but this situation made me sick to my stomach and i felt an urge to run. did you quit dashing due to the unsafe feelings you got?",
            "I have yet to see a politician keep their promises of safety",
            "Also a lot of dasher do bring other people. I mean who going to really care the restaurant doesnt care if you have ppl with you they just want the food gone. And as long as you deliver the food the customer wont care",
            "are you serious??? wtf is wrong with people these days man. RAZOR BLADES ON GAS PUMPS?? luckily i don’t drive yet but thanks for that information so i can warn my family😬",
            "Idk i deal with a lot of homeless and low income people while doing rideshare and door dash. Its part of the job sadly. Its not always their fault they are homeless and if they dont talk to you just ignore them or buy mace/pepper spray",
            "I will say the 3 McDonald’s closest to me all make me go inside to get the order",
            "Yeah people put razors on gas pumps not sure the motive though unless it was to make them defenseless to be roved idek. I have no clue why just that it was bad for awhile"
        ]
    },
    "I deleted my doordash account and they are still attempting to charge me... ": {
        "title": "I deleted my doordash account and they are still attempting to charge me... ",
        "score": 134,
        "url": "https://i.redd.it/tp6jjx16cy7d1.jpeg",
        "content": "What do I do?",
        "num_comments": 81,
        "comments": [
            "Thanks for making a r/doordash submission, please remember to follow our community guidelines, let's be kind and respectful to one another.\n\nLastly check out the [Wiki FAQ](https://www.reddit.com/r/doordash/wiki/index/) before submitting a question. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/doordash) if you have any questions or concerns.*",
            "They will keep trying. Deleting the account doesn't cancel the pass.",
            "You mean you un-installed the app right?",
            "Did you cancel doordash pass? Or just delete account?",
            "Did you at least finish your tasks?",
            "Deleting the app doesn’t cancel the service. You have to actually cancel the service. 🤦‍♀️",
            "So u didn’t cancel your dash pass first? Wow gg. Of course they’re still gonna charge you. You need to cancel it.",
            "So you didnt cancel?  Just deleted account?  LOL",
            "The fact that they're trying to pull from every payment method on file 😆... you should contact them.",
            "Nice",
            "Im going through the same thing. i GENUINELY deleted my account yesterday and they took $10 from my account today🤦🏿‍♂️ I need to contact them.",
            "Did you delete the account or just the app?\n\nIf you just deleted the app it doesn’t do anything to your account so yeah they’re going to keep charging you. You have to cancel dash pass or genuinely delete your account or else they’re going to keep charging you since you haven’t done anything to stop payments.",
            "Boomer moment",
            "Were you a driver or customer?",
            "Happened to me too, and I never had an acct they could find. Call them and get a rep on the phone. Have you changed Credit card numbers since then? If so, for some reason they have to cancel it on the original CC number, and not a new CC#. Either way, luckily they refunded everything, even retroactively. Good luck!",
            "Deleting your account doesn't cancel your DashPass subscription 🤦‍♂️",
            "It’s impossible to cancel that damn thing. It doesn’t give you the option to",
            "Lmao dummy. Who thinks deleting the app deletes your card from your account",
            "Damn. As a driver when I got my account deactivated I had 80 dollars earned that I did not get back. Gotta call them about that",
            "I have the same problem I’m gonna call the bank tmrw",
            "Sometimes deleting the account doesn’t stop the automatic draft if you are signed up for it. You may have to cancel the automatic draft separately.",
            "Mine took forever to even allow to cancel the dash pass. I ended up jisy getting a new card.",
            "Call DD and use the F word when speaking to one of their very nice reps.  It's not hard, just ask them to speak clearly so you can understand them. Then they accuse you of being a racist and threaten you, so you can curse them out    When you use the F bomb they have their reason and excuse to delete your membership for you.  That's what they are after when anyone calls.  They hate Americans and love to find ways to punish us.  \n\nI have tried this technique with great success.  Guaranteed to get them off your cash app.",
            "were you born yesterday",
            "Not trying to be rude, but ur acting like its some actual person out there trying to charge you…your info is in the system and they see you’re due to be billed today",
            "Lol I wanna know why whenever I order the person delivering name will be like Angela, Mary, or I've seen Tasha.... Then the driver is some black guy... Wtf?  They think I'm gonna tip more because I think it's a girl?",
            "DoorDash is vacuous blood sucking cancer to the human race, what do you expect?  .-.",
            "New card",
            "Happened to me. Just report fraud with you’re bank and get a new card. The only solution that worked for me, and by doing so the deactivated my DD and Dasher accounts, had to make a new Dasher account with a different phone number.",
            "![gif](giphy|KBPiqIcV2QzGcdHAfX|downsized)\n\nDoor Dash just chillin rn like :",
            "Doordash support stole my identity today so i feel you bro",
            "Doordash is a pretty small company they really need the money. ☹️",
            "They tried to Double Tap lol, that only works for zombies",
            "Lmao. I un-installed my banking app I don't understand why I'm still being charged a fee for my checking account.",
            "Getting them to delete the account to punish us works much better.\n\nA few F Bombs to customer support will do the trick.  That's their superpower that we grant them by cussing them out.    \n\nMuch more fun than blocking them from all credit cards and cash apps.",
            "Gotem",
            "They just deleted the app… I guarantee it",
            "I think this may have been one of them 🤭 guess that would me a no if so 😆",
            "I wrote the word account in the title, not app",
            "DoorDash’s terms of service actually state they will attempt to collect payment from the primary method linked. If that fails, they will attempt to collect from every payment method currently linked OR previously linked, including those you have removed from your app.",
            "It's the same payment method, just multiple times. Door Dash does this to me if I don't have the money on my card at the time. It's really annoying.",
            "You should have canceled your subscription before deleting anything.",
            "Even if they genuinely delete the account that agreement is still in place they have to cancel the agreement. Before they delete the account or it’s going to be a pain in the ass to cancel the subscription.",
            "Absolutely not. We have way more sense than this! Definitely gen Z.",
            "The reason is so they can locate the card number getting charged.. it’s somewhere in their system. How are they going to find your new card number in their system if the old one is getting charged?",
            "No they’re idiots who have been banned from the app and deliver under someone else’s account.",
            "It’s not fraud and he’ll lose his case. And to top it off he’ll have notations on the account for customer fraud which will be the beginning path to the end of his relationship with the bank. I’ve seen plenty of accounts get closed by the bank; from customers trying to abuse the system that is there to protect them from actual fraud … it’s not there to protect them from the stupid choices they make.",
            "How did DoorDash steal your identity?",
            "Right you gotta cancel and then delete. They still got your info of you just delete the app\n Lol silly",
            "I’ve been having the same issue. Every 10 days they charge me 9.99 I canceled my dash pass 3 months ago…I bitch to support and I get it back 2-3 days later",
            "No I cancelled the trial then I deleted the actual account",
            "I know you did… but the gen masses thinks deleting the app is like deleting an account. So I glomed you up with them.",
            "Okay, gotcha. Reading is fundamental, but I've never cared to read their terms. That's my bad, lol.",
            "They hit 1 card 2 times and then they hit their cash app account as well.",
            "That surely can't be right, if you accidentally delete the account, that means that doordash cannot hold up its part of the contract. It is specifically not providing the contracted service, so it cannot charge the contracted price. \n\nIf they are doing that California lawyers will be having a field day as they don't fuck around with subscriptions. You legally have to have the option to cancel the subscription in the same location and method you used to sign up. And that is even ignoring the obvious contractual issue I stated before.\n\nIf that is just a technical oversight, it is egregious.",
            "21 days ago they posted something from a highschool project so yeah….",
            "I know one thing for sure… it wasn’t Gen X.",
            "I get that but it was charging my new card as well. ",
            "Literally this. I know someone in a situation like this right now with their girlfriend",
            "How is it not fraud? If you cancel the service and they continue to charge you repeatedly month after month after cancelling that is fraud. That is the reason why the ability to perform chargebacks exist.",
            "Somebody hacked their system to get to me. They cancelled orders in my phone, texted me from the doordash support line, and then changed my password and emptied the wallet",
            "Probably didn’t cancel in time.",
            "Amazon is the same way.",
            "They could even be Gen Alpha at that point. Soon there will be no more Gen Z in HS.",
            "No, it was hitting your old card and carried over to the new card. \n\nSource: I used to work for a bank.\n\nEdit: customers would call all the time and claim “I lost my card” when in fact what they were trying to do was cancel a subscription without actually cancelling it. So, the merchant would proceed to charge the old card since the subscription wasn’t stopped. It was already an authorized purchase, so it hits the old card first… then a few days later will post on the new card. Every subscription service you ever have you must make sure it is cancelled. The banks don’t have a lot of ways to stop the merchant from running the charge, if it’s marked as reoccurring.",
            "Deleting the app or a profile does NOT cancel a subscribed service. The agreement is still in place until they cancel the service through the merchant.\n\nEdit: \n\nFraud, according to banks; is anything you do not have any knowledge of. If it’s something you’ve subscribed to then tried to cancel. Most banks will ask you to reach out to the merchant first. It costs the bank money with manpower to do your legwork. The merchant also gets charged for every charge back they endure even if they win. And that is why most banks will ask you to work with the merchant first.",
            "That sounds like you didn’t have a secure account… and it sounds like you gave them your information to be taken for… that’s not DoorDash my guy. Thats a scammer. Sounds like you are/were a driver?",
            "I don’t think alpha is old enough to be in high school.. they would only be 13/14 years old. Thats what…? 7th/8th grade, middle school.",
            "It doesn’t matter anymore. My point was to suggest to OP to call and see if they can find either their current or former CC card on file to get the refund if that was the case.",
            "My pnc account has a service that let's me decline any charge if it will overdraft me for free. So there is something they can do even if not all do.\n\nEven so, predatory subscription practices are not universally allowed and are varied by state, states with the fewest consumer protections are where what you described can happen.\n\nEthically it is repugnant to use practices to get extra profit from people who you know are not utilizing your service or to trick people into paying for your service. I really don't like when people normalize it with \"well it's in the contract, you agreed to it\". Consumer protections are just understanding that if it is allowed, and every company does it, it makes it nearly impossible not to agree to that. At the very least point out that it is a shitty business practice and should not be shrugged off as normal capitalism.\n\nEdit: most likely doordash like many other sites will give you different functionality if you access it from an California IP (I always use a CA VPN for this reason, it is amazingly effective at making subscriptions easy to cancel so that might be something to try in situations like this, sometimes that unsubscribe button will just magically appear in plain view.)",
            "You are close, for most cases this would be true for like a gym or something, but without going too much I to the contract theory, they have to provide something in the contract in exchange for the payment, providing access to a gym or service usually fulfills this even if the customer didn't utilize the service. But if you delete the account then doordash isn't allowing access to a service so the consideration is no longer valid and most parts of the contract binding the customer are nullified.",
            "Sounds like youre playing weird semantics and you get the point",
            "I was in HS at 13 and graduated at 17 so its possible. So at 14 they could be a freshmen or sophomore.",
            "I know but you said “for some reason” like it’s unheard of that they would need the card number that you had on file … to locate the card and stop the charges. Especially with you saying that they could not locate your account.",
            "I used to work for a bank, we dealt with this a lot.  I did not work the dispute side of things but when I first started, I would warm transfer to inquire about the customers inquiries, the dispute department always pushed back stating the customer must make a good faith effort in reaching to the merchant to cancel their subscription. The subscription still stands. When the customer would call to claim their card was “lost” anything that is marked as “reoccurring”, allows the old account to still be charged from that merchant and will carry over to the new account. This is the same for accounts that are closed due to Fraud.  There isn’t anything stopping the merchant from continuing their BAU aside from closing the bank/card account in whole. \n\nYou can disagree with me. That’s fine, but I can only tell you what I have personally witnessed over the years. And you can even see that as complaints here on Reddit on credit card subs. 🤷🏻‍♀️",
            "You said “DoorDash stole your identity” … DoorDash didn’t do shit. You fell for a common scam from a scammer and are blaming DoorDash.",
            "I’m going to go out on a limb and say OP isn’t in that category.",
            "Do you know what semantics means?",
            "I'm just point out it's possiblity not that it is or isn't. In a few more years it will be the case since all gen Z would have graduated",
            "I do. But what I am doing, is separating fact from fiction.\n\nEdit: because why not?\n\nAnnnnnd I’ve been blocked.\n\n![gif](giphy|13A7YlLvYVDnmU)"
        ]
    },
    "Did my DoorDasher try to rip me off?": {
        "title": "Did my DoorDasher try to rip me off?",
        "score": 3,
        "url": "https://www.reddit.com/r/doordash/comments/1dlqmea/did_my_doordasher_try_to_rip_me_off/",
        "content": "I think I might have caught my DoorDasher trying to rip me off, but I’m afraid to report her in case I’ve misunderstood the situation. I got a text message saying that my order had been delivered, along with a link to a picture of the delivery. I didn’t open the link and went straight to the door, but when I opened the door the food wasn’t there and the DoorDasher was nowhere in sight. \n\nA few seconds after I opened the door, she came around the corner holding my food. I figured that since she had sent a photo of the delivery (which I hadn’t seen) she had maybe brought it to the wrong address and took a picture there, and realized her mistake when she heard me open the door.  She handed my order to me and I thanked her, and didn’t think anything else of it until I went back inside and actually opened the picture of the supposed delivery. \n\nShe hadn’t delivered it to the wrong address. She had definitely taken a picture of the food on my doorstep, but was nowhere near my doorstep with the food when I opened the door. I’m pretty sure I caught her walking away with my order, and if I hadn’t opened the door when I did she would have left with it. \n\nAm I overreacting? Is there some other way to read this situation that I’m missing? If there’s a chance that this was an innocent miscommunication I don’t want to get her in trouble, but if she was doing what I think she was doing then I don’t want her to try it on anyone else.",
        "num_comments": 11,
        "comments": [
            "Thanks for making a r/doordash submission, please remember to follow our community guidelines, let's be kind and respectful to one another.\n\nLastly check out the [Wiki FAQ](https://www.reddit.com/r/doordash/wiki/index/) before submitting a question. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/doordash) if you have any questions or concerns.*",
            "That sounds pretty fishy. I think it would be ok to report if you want.",
            "She probably left it at a neighbors house or apartment my mistake and had realized it by the time you opened the door. It happens.",
            "there are doorbell cameras of this happening. sometimes they make it on the local tv news lol",
            "I've taken a picture then pick the bag up and move it to a secure location where the neighbors doesn't steal them. This happen more when customer's are in a bad area.",
            "Why do people assume dashers are so broke and hungry they have to steal?",
            "It's happened to me before as a dasher.  Yeah, she probably thought that it was the wrong address.  Just my experience though.  I've also had it happen to me before where the guy took a picture of my upstairs door, but took it down to the garage door once he realized it was my direction",
            "I’m trying to give her the benefit of the doubt (hence coming here to ask for a second opinion), because the optics of “took a picture of the food on my doorstep then picked the food back up and continued walking down the hall” aren’t great.",
            "This is not really assuming. She’s asking for a second opinion because she doesn’t want to assume.",
            "[deleted]",
            "It happens. We have to be sure we are leaving it in the right place. And there are customers that play games. Sometimes it’s hard to make out addresses. There are literally hundreds of different scenarios that can screw up a dash.",
            "I have realized I had put it in the wrong place, after taking a picture and moved it to the right spot. And retaken the picture. And then explained the situation. I usually get great feedback after doing so."
        ]
    }
}