{
    "General Questions and Purchasing Advice Thread — Week of June 17, 2024": {
        "title": "General Questions and Purchasing Advice Thread — Week of June 17, 2024",
        "score": 9,
        "url": "https://www.reddit.com/r/electricvehicles/comments/1dhwbvp/general_questions_and_purchasing_advice_thread/",
        "content": "**Need help choosing an EV, finding a home charger, or understanding whether you're eligible for a tax credit? Vehicle and product recommendation requests, buying experiences, and questions on credits/financing are all fair game here.** \n\n# Is an EV right for me? \n\nGenerally speaking, electric vehicles imply a larger upfront cost than a traditional vehicle, but will pay off over time as your consumables cost (electricity instead of fuel) can be anywhere from 1/4 to 1/2 the cost. Calculators are available to help you estimate cost — here are some we recommend: \n\n* [https://www.chargevc.org/ev-calculator/](https://www.chargevc.org/ev-calculator/)\n* [https://chooseev.com/savings-calculator/](https://chooseev.com/savings-calculator/)\n* [https://electricvehicles.bchydro.com/learn/fuel-savings-calculator](https://electricvehicles.bchydro.com/learn/fuel-savings-calculator)\n* [https://chargehub.com/en/calculator.html](https://chargehub.com/en/calculator.html)\n\n# Are you looking for advice on which EV to buy or lease? \n\nTell us a bit more about you and your situation, and make sure your comment includes the following information:        \n\n>\\[1\\] Your general location  \n>  \n>\\[2\\] Your budget in $, €, or £  \n>  \n>\\[3\\] The type of vehicle you'd prefer  \n>  \n>\\[4\\] Which cars have you been looking at already?   \n>  \n>\\[5\\] Estimated timeframe of your purchase  \n>  \n>\\[6\\] Your daily commute, or average weekly mileage  \n>  \n>\\[7\\] Your living situation — are you in an apartment, townhouse, or single-family home?  \n>  \n>\\[8\\] Do you plan on installing charging at your home?  \n>  \n>\\[9\\] Other cargo/passenger needs — do you have children/pets?\n\n*If you are more than a year off from a purchase, please refrain from posting, as we currently cannot predict with accuracy what your best choices will be at that time.* \n\n# Need tax credit/incentives help? \n\n* 🇨🇦 CAN — [Transport Canada iZEV Program](https://tc.canada.ca/en/road-transportation/innovative-technologies/zero-emission-vehicles)\n* 🇺🇸 USA — [Clean Vehicle Provisions of Inflation Reduction Act](https://home.treasury.gov/news/press-releases/jy1179)\n\n# Check the Wiki first. \n\nDon't forget, our Wiki contains a wealth of information for owners and potential owners, including:\n\n* [EV Databases](https://www.reddit.com/r/electricvehicles/wiki/index/evreleases)\n* [Dealer Markup Tracking](https://www.reddit.com/r/electricvehicles/wiki/index/dealermarkuptracker)\n* [General Resources](https://www.reddit.com/r/electricvehicles/wiki/index/resources)\n\n*Want to help us flesh out the Wiki? Have something you'd like to add? Contact the mod team with your suggestion on how to improve things, we can discuss approach and get you direct editing access.*",
        "num_comments": 120,
        "comments": [
            "Maryland\n\n< 45,000 USD\n\nSedan or small crossover\n\nIoniq 6, EV6, ID.4 Pro, EX30\n\nDecember 2024 (lease ends)\n\nI commute every other week, 5 days a week. 35 mi one way\n\nTownhouse with assigned parking in front of home\n\nJuicebox 32 already installed\n\nNo special passenger/cargo needs\n\n\nMy 2022 NIRO EV lease is up in December. I know I will be well over miles (>10K). Fortunately, I’m in a financial position where that isn’t an issue.\n\nI am interested in the IONIQ 6, EV6, ID.4 Pro, and EX30.\n\nFrom a value perspective, does it make the most sense to just wait until the end of my lease and then turn it in with penalty, or buy it out, in order to maximize incentives from Kia for repeat buyer, all else equal?\n\nWith typical Kia residuals, should I enter into another lease or do it an outright purchase (depending on APR) to minimize monthly cost and total cost? Would I be better off just outright purchasing assuming APRs are crap?",
            "Would love some advices / choices for my need.  Thanks in advance\n\n1. We live in Los Angeles surburbs.\n\n2. Our budget is about $25000 USD out the door after after any qualifying tax/manufacture rebates\n\n3.  We're primarily interested in a small sized sedan, suv/hatchback, used is okay, with a length shorter than 175 inches\n\n4. We've been looking at used car listings online for 2022/2023 Chevy Bolt, 2021-2023 Hyundai Kona, \n\n5. We plan to purchase within the next 2 months\n\n6. We foresee to drive this car about 26miles a day, 5 days a week.\n\n7. We live in a single family home, the garage is a bit small, hence the preferred length of < 175 inches\n\n8. Yes, we plan on installing charging in our garage.\n\n9. We have a family of four with two kids under 3 years old. \n\nThanks in advance for all your inputs.",
            "2023 Bolt EUV LT, 23k miles, $21998 (no sales tax). \nGood or bad deal?",
            "1. Minnesota\n2. $20k-25k\n3. SUV, full EV\n4. Jaguar I-Pace and Tesla Model X\n5. In a month or two. During this summer\n6. 8-9k mile per year\n7. Condo\n8. Already charger installed by my parking space by HOA\n9. No. Just driving in town and to trails and outdoor over the weekend\n\nSaw many I-Pace in low 20s and it’ll be around 19 or 20 with 50k miles or so. I know there’s traction battery warranty but how risky is it to own these cars without warranty? I’m not too anal about inconveniences (like touchscreen being slow etc), but more to do with is it gonna get me stranded middle of nowhere reliability. \n\nAlso, would I be able to claim 4k off at the point of sale??",
            "Has anyone used NACS to CCS ~~CCS to NACS~~ adapters?  I needed to fast charge Saturday night out-of-town.  Closest charging station was a Tesla which is not compatible (afaik - I didn't check).  I found an Electrify America station that got me to 80% in 10 min.  There are LOTS of Tesla charging stations around here and on routes I'd like to use.  Anyone have experience with the adapters?",
            "Hello everyone,\n\nWe currently own a Tesla Model 3.\n\nWe’ve hit a bit of a dilemma. Our family is about to grow from four to five! When our newest member arrives, our children will be 5, 2, and a newborn. Our two oldest are quite small for their ages.\n\nCurrently, our eldest is sitting rear-facing in a huge Britax Max-Way Plus, but it's time to transition to a forward-facing seat. My wife strongly believes our 2-year-old should stay rear-facing for another year, which complicates things. I might be able to convince her that it’s okay for our 2-year-old to face forward now.\n\nI've been searching for the most narrow car seats on the market, but haven't had much luck. The ones I’ve found so far don’t fit well with the rear-facing baby seat.\n\nI also looked into the Multimac solution. It seems very well-made, but it would cost us around €3,800 after import taxes. That’s a lot for car seats, but still cheaper than getting a new car.\n\nSpeaking of new cars, I've checked out some electric options. Unfortunately, there aren't many that solve our problem without being significantly more expensive than our current Model 3. For example, I could trade in our Model 3 for about €26,000, but the cheapest ID Buzz I’ve found is €44,000. Do you have any suggestions for EV-options that solve our problem without breaking the bank?\n\nI’d love to hear your advice and viewpoints on this!",
            "Has anyone in Arizona been able to find a dealer who: 1) is educated on how the Used EV Credit works, 2) is registered to participate, and 3) is willing to honor it?\nI’ve been to 5 different dealers in Phoenix looking at EVs who check all the boxes for the used EV credit but it’s frustrating the lack of knowledge from both sales people and finance managers.\nIs it really that difficult to find a place that will do it?",
            "I am planning on buying a used EV, I found a used 2021 Chevy Bolt with about 40,000 miles. Is there anything I should be cognizant of when I go to look at the car? This is my first time getting an EV and I am particularly concerned about its range since my commute will be about 65 miles each way. Besides checking what the car says the range is, is there anything I can do to check the quality of the battery?",
            "So I am new to electric vehicles. I’ve owned only gas cars so far. My wife leases a Corolla and I own a Jetta. Her lease is up in February and we are looking to get an SUV to replace the Corolla. I have wanted to go with a 1 electric - 1 gas car strategy for a while but I don’t know much about the EV market. We are looking for a small to medium sized SUV. Something like the Nissan Rogue for size. What are ya’lls recommendations for suvs in that size? For budget we’d like to stay under 40k USD if possible. We live in North Carolina. \n\nNo children and none planned for years. Single family home. we both commute three days a week. Hers is ~10 miles and 30min. Mine is about 35 miles and 40min. The idea would be this car would be shared and could be used for all the commute time if the schedules line up right. For charging we’d at minimum get a ‘slow’ charger (is that the right term?) it would depend on cost if we splurge for one of those very fast charging systems.",
            "We are shopping for our first EV and want something small, so we're likely looking at either a Kona or Bolt in the $20k range. \n\nSince we live in New England and it gets cold in the winter I want to make sure we can pre-condition the cabin (and battery?) while the car is still plugged in each morning. \n\nThe Bolt trim levels and options are easier to find info on because they are all EVs, but I'm having trouble figuring out which trim/options I need to look for on the Kona to make sure we get heated seats and the ability to remotely heat the cabin while the car is still plugged in. Do they all have that ability, or is it only on certain trim levels?",
            "I’ve been playing around with the idea of trading in both my vehicles toward a new or used EV. My father is concerned that during winter, it might not start during the coldest parts. I live and work in north east Ohio. I work 7pm-7am and have no way to charge it while I’m there. Are his concerns legitimate? If so, are there EV’s out there that handle winter well?\n\nEdit: It’s 80 miles round trip for the commute and needs to have AWD because our driveway sucks in winter.",
            "I've been driving a PHEV for the last 11 years and I'm ready to buy a real EV. I  don't want to spend a ton of money on a new car and would love to take advantage of the EV tax credit. I've also got two teens in my house and am mindful of what my insurance will cost when they start driving. Any advice to offer about cars I should be looking at? The Tesla Model Y LR and Model 3 LR are both compelling, particularly now that both qualify for the tax credit.  I've heard the ID.7 may also apply later. And I know Hyundai is also offering discounts. What other EVs will soon be eligible?  \n  \nMy situation:  \n  \n\\[1\\] I live in the Washington DC region  \n\\[2\\] Hoping to spend < $40k-$45k  \n\\[3\\] Looking for an EV built on a car chassis, currently happy with the size of my Prius PHEV  \n\\[4\\] I've been looking at the Telsa Model Y / Model 3, Hyundai Ioniq 5 / Ioniq 6, and Volkswagen ID.7  \n\\[5\\] I'm not in a huge hurry to buy, but want to take advantage of the EX tax credit before a potentially hostile Republican administration gets rid of it.  \n\\[6\\] I work from home and put maybe 8,000-10,000 miles on my car annually... mostly on short trips, but also on much longer road trips. I would appreciate a vehicle with a decent range and ability to charge quickly.  \n\\[7\\] I'm in a single-family home and am currently using a normal wall outlet for my PHEV.   \n\\[8\\] I will install a proper charger once I switch to an EV.  \n\\[9\\] I have two teens and a 55lb dog, which some would think is too much to cram into a sedan. But we've taken my Prius on all sorts of road trips rather than my wife's ICE SUV just because... why waste gas?\n\nI should also mention my wife isn't ready to go full EV, so our household will also have a hybrid to use if needed. Thanks!",
            "1. California \n2. $35-45k\n3. SUV, hybrid or electric \n4. Solterra, Tesla Y, rav 4\n5. 2024\n6. 12k miles / year\n7. Single family home \n8. Yes, plan to install a charger\n9. Kids, outdoor lifestyle \n\nI’d also like to know what is better cost used or new? I currently have a Subaru Forester and love it.\n\nThanks!!",
            "I have a 2017 Ford Focus Electric with 60,000 miles on it. I still get around 100 miles per full charge. In spite of having constant air conditioning problems during our Texas summers, I otherwise love the stupid vehicle and have had no other problems with it.\n\nI am the second owner and it has been paid off four about 3 months.\n\nThe battery is still under warranty for another year, and Carvana is offering me $8,000 to sell it to them.\n\nWould I be smart to sell it before that warranty runs out and purchase another vehicle?\n\nI'm looking at a 2017 Chevy Bolt. That car's battery was replaced under recall in Dec. 2001, so it's under warranty for another 85,000 miles or until Dec. 2029.\n\nIt would have more than twice the range of my Focus. It does have more miles on it (close to 100,000).\n\nIt's going for $11,000., but it's eligible for the $4000 EV tax credit. That plus the added $8000 from the sale of my Focus would put me a little head, dollars-wise.\n\nWould I be stupid to do this, or stupid to pass on it?",
            "\\[1\\] Denver Colorado\n\n\\[2\\] approx $35,000\n\n\\[3\\] EV SUV (seeking AWD, good range, and ability to fit 4 adults on a roadtrip)\n\n\\[4\\] (a) New 2024 VW Id.4 Pro S, (b) used Ford Mach-E Premium AWD, (c) used Ioniq 5 SEL\n\n\\[5\\] 2-4 weeks\n\n\\[6\\] weekly avg 20-50 miles (I work from home and my main runabout is an EV Mini Cooper SE)\n\n\\[7\\] Single family home with 240V outlet in a 2 car garage\n\n\\[8\\] Maybe? I already have a Mini level 2 charger, but would install a more appropriate charger if necessary\n\n\\[9\\] Have 2 college-age boys, we road trip about 2 times a year to see family, each trip approx. 1,000 miles roundtrip\n\nI'm seeing some incredibly good deals on a AWD 2024 Id.4 Pro S ($34K with VW discounts, dealer discounts, and fed and state rebates), but the reliability frightens me.",
            "have a 2020 Hyundai ioniq PHEV leased in 2021-Feb. Now, the lease has ended and only I can buy out this lease from Hyundai Motor Finance.  \nMy plan is to buy this vehicle and sell in the private market for a small profit.\n\nFor the 3rd party buyer to receive the ev tax credit, I need to sell it through an IRS registered dealer, I thought of using key-savvy, However key-savvy denied giving ev credit to the 3rd party buyer quoting this IRS rule,  \nfrom [https://www.irs.gov/credits-deductions/used-clean-vehicle-credit](https://www.irs.gov/credits-deductions/used-clean-vehicle-credit)\n\n* Not have already been transferred after August 16, 2022 to a qualified buyer.\n\nBut, I am not a qualified buyer bcoz I don't meet the income limit. \n\nI tried to call IRS and they are not savvy enough to even understand this scenario",
            "I am shopping for a used Chevy Volt that qualifies for the $4,000 clean vehicle credit. However, in January of 2023 I bought a Chevy Bolt EUV and claimed the $7,500 credit on my taxes that filed a few months ago.\n\nReading the rules for the used clean vehicle credit, it says that you must \"Not have claimed another used clean vehicle credit in the three years before the purchase date\". Similarly, the checklist (IRS publication 5866-A) says \"Taxpayer must not have claimed this credit in the 3-year period prior to the sale of the qualifying vehicle. Unsure if you qualify? Consult your tax advisor. Note: 2023 is the first year that this credit can be claimed.\"\n\nI haven't claimed another **used** clean vehicle credit, but I did claim the **new** clean vehicle credit. I just want to make sure I am eligible, because that $4,000 will change my decision on which car to buy.\n\nI don't have a tax advisor to consult, since I filed using an online tax preparer. Therefore I am turning to Reddit for advice.",
            "Need recs! First time EV buyer \n\n  \n\\[1\\] Your general location: NorCal Bay Area\n\n\\[2\\] Your budget in $, €, or £ $38-$42K Range\n\n\\[3\\] The type of vehicle you'd prefer: EV SUV \n\n\\[4\\] Which cars have you been looking at already? Kia, Hyundai Mostly (Ioniq5, Kona, Niro EV, EV6) \n\n\\[5\\] Estimated timeframe of your purchase: End of July\n\n\\[6\\] Your daily commute, or average weekly mileage: \\~12 miles daily, 100 miles weekly\n\n\\[7\\] Your living situation — are you in an apartment, townhouse, or single-family home? Townhouse\n\n\\[8\\] Do you plan on installing charging at your home? Yes\n\n\\[9\\] Other cargo/passenger needs — do you have children/pets? 2 adults, 3 kids, only 1 carseat needed",
            "Should we lease an id4 for 36 months or purchase across 72 months?\n\nIdentical payments.  We would receive a $7500 tax credit if we purchase.  \n\n15k miles/year \n\nThanks.",
            "lynk & Co electric engine lifespan\n\nToying with the idea of getting a 2022 Lynk Co with 17.000km.\nHow many years till the electric battery/engine dies or stops working properly?\nCheers!",
            "Which models are the best deals *without* tax incentives? \n\nEverything I run across, from articles to discussions to new/used listings factor incentives in which make them basically useless for those who don’t qualify.",
            "Hi! Due to a new commute of 60miles in and 60 miles out I'll start doing next month, I'm thinking in moving to an EV... Only in gas savings, it would be a roughly 600usd (if charging at home, based on an average Tesla model 3). A few years ago, it was a no brainer, I would choose Tesla... nowadays, while Im still more inclined to Tesla, mostly because of their software (and future fsd capability) it got me thinking if theres anything else out there that's worth consideration... and there are many options! Having in mind, software UI, maintenance, range, efficiency (equivalent to mpg in gas cars) and around a 40k price point, what would you guys consider in my position? Thanks in advance for your insightful answers!\n\n\\[1\\] Your general location: California\n\n\\[2\\] Your budget in $, €, or £: USD $40\n\n\\[3\\] The type of vehicle you'd prefer: Any (sedan or suv)\n\n\\[4\\] Which cars have you been looking at already?: Tesla Model 3\n\n\\[5\\] Estimated timeframe of your purchase: 1 month\n\n\\[6\\] Your daily commute, or average weekly mileage: 120 in and out daily\n\n\\[7\\] Your living situation — are you in an apartment, townhouse, or single-family home?: Home\n\n\\[8\\] Do you plan on installing charging at your home?: Yes\n\n\\[9\\] Other cargo/passenger needs — do you have children/pets?: Baby and Dog",
            "\\[1\\] Chicago area\n\n\\[2\\] $54k - $72k\n\n\\[3\\] Audi Q4 Etron or Tesla S or Y\n\n\\[4\\] The above. Open to other suggestions\n\n\\[5\\] Next 6 mo - 1 yr\n\n\\[6\\] 500 miles/ week  - \n\n\\[7\\] Own a home\n\n\\[8\\] Yes\n\n\\[9\\] I do have pets and younger children. Most usage will be for outdoor activities.\n\nI drive longer drives for work (approx 300 miles ) every 3-4 months. I have heard that cold weather can have a severe impact on driving and battery. Major use of the car is commute which about 100 miles x2-3 times a week. We have a gas car as well. \n\nThings that matter to me are range and comfort.",
            "How do you handle charging on spontaneous trips to places without phone service?",
            "Hi! Very interested in an EV, but having some anxiety about choices, and welcome any / all feedback from others. \n\n  \n(1) We live in Western Massachusetts -- not super hilly, and climate change is definitely taking a bite out of the cold weather, but we do still get cold weather. \n\n(2) Budget -- We're not looking at luxury vehicles but can make whatever we need to make work. \n\n(3) Regular car ideally; small SUV okay. We currently have a Subaru Forester (2015) and a Toyota Prius (2007)\n\n(4) We like Subarus for their safety, but the Solterra is a relatively new EV, and doesn't have great ratings from Consumer Reports. \n\n(5) Timeframe -- now to the next few months. \n\n(6) These past couple of years we have been having to drive 200 mile round trips to Boston about 4x / week; otherwise we just drive locally. \n\n(7) We have a single-family home with a carport. \n\n(8) We would install charging at home. \n\n(9) We have two adults, one teenager, and one small dog.",
            "Used EV tax credit question (US)\n\nI just purchased a used EV (2020 Kia Niro EV) through a dealer; the car and I both qualify for the used EV tax credit. The dealer did the transfer of the credit and took the $4,000 off the purchase price. What, if any,  documentation do we need from them for filing our taxes? They didn’t give us anything (and they used every scammy car dealer technique in the book so now I’m worried they’re going to screw this up for us too and I’m going to discover we owe $4,000 come tax time). Would appreciate any insight!",
            "I've been driving a 2019 Kia Niro PHEV and absolutely love it. It almost gets me to work and back on a single charge. Love the EV aspect so much that when the gas engine turns on, it feels something is wrong with the car - the engine sound, vibrations and sluggish feel. Plus hate having to fill in gas (every 2 months) and do oil changes. So I know for sure that my next car will be an EV. Looking at used EVs and two stood out:\n\n- 2021 Model Y, AWD, 130,000 km\n- 2023 Kia Niro Wave EV, 12,000 km\n\nBoth have the same price. I know what to expect from the Niro EV. I'd like to check if I can use my existing snow tires with that one, so it'll save me another $1000+ of not buying new wheels + tires for winter. And sunroof can open. Plus cooling seats in summer is a big win! \n\nBut the Model Y also looks like a great option. I use Waze a lot, so I know I will have to get used to their own apps. But that's a nominal issue. Sunroof can't open, but is panoramic. Also, not sure if this comes with cooling seats, as that's been a great feature in the Niro. \n\nI often drive with my bikes in the back, so I know for sure that both of these will have no issue with that. I will still install a hitch, but I feel safer with the bikes in the car. \n\nAny suggestions?",
            "Lemon Title Ioniq 5 Gamble?\n\nIoniq 5 owners, what are your thoughts on a BuyBack Title (Lemon) on a 2023 SEL with 800 miles on it at $31K? The reported and resolved issue was a faulty air conditioning unit. The compromise to the title is that comes with a 5 year/60K mile drivetrain warranty instead of the 8 year/100K warranty. Battery warranty stays in tact at 10 year/100K miles. \n\nIs the gamble worth the reward at almost $15K off retail sticker?",
            "Is the used tax credit as good as it sounds on paper? Seems like all you have to do is pick a car under 25k that’s over 3 years old and it’s all taken care of at the dealer. I’m looking at either a Model 3 or a Leaf, and am curious about any hidden things I should know. If there even ARE hidden things.",
            "How does the math on financials work out for you?\n\nHow do you feel about the car? Do you like this car enough to keep it, or would you rather have something else?\n\nHave you tried the other cars? Also curious why only these in particular? There are a lot of EV sedans and small crossovers now.",
            "Brands tend to want to keep lease customers so if you lease another Kia they might waive or reduce some of the mileage fees and make you a better deal on a new lease than if you just turned it in and went to another brand. Not sure if buying out makes sense with lower trade in values.",
            "Sounds like a good plan, any specific questions?",
            "If you qualify, look at only <2022 model years so you can take advantage of the used EV tax credit",
            "depends on trim and teh state its in and such but looks like reasonable and . . . does it meet your needs?  can you find a better deal?  sometimes you gotta stop trying to find teh perfect deal and just buy a car [https://www.carvana.com/cars/filters?cvnaid=eyJmaWx0ZXJzIjp7Im1ha2VzIjpbeyJuYW1lIjoiQ2hldnJvbGV0IiwicGFyZW50TW9kZWxzIjpbeyJuYW1lIjoiQm9sdCJ9XX1dLCJ5ZWFyIjp7Im1pbiI6MjAyMywibWF4IjoyMDIzfX19](https://www.carvana.com/cars/filters?cvnaid=eyJmaWx0ZXJzIjp7Im1ha2VzIjpbeyJuYW1lIjoiQ2hldnJvbGV0IiwicGFyZW50TW9kZWxzIjpbeyJuYW1lIjoiQm9sdCJ9XX1dLCJ5ZWFyIjp7Im1pbiI6MjAyMywibWF4IjoyMDIzfX19)",
            "Is this in the states? There’s a $4k rebate on used EV vehicles under $25k I believe. If I’m correct about the rebate that’s a steal.",
            "The only non-Teslas that can use Superchargers are Fords at the moment.\n\n*Yes I know there are a handful of Magicdoc Superchargers that work, but they are mostly irrelevant.*\n\nThird party adapters prominently pushed on YouTube will not work until Support is added by Tesla and the car's software is updated with Tesla CERTS.",
            "TransportEvolved just did an episode on the adaptors.\n\nhttps://youtu.be/US7PZOiaiLc\n\n\nCould search the /r/F150Lightning and /r/MachE subreddits for A2Z or adaptor.",
            "I have. I used the Tesla OEM adapter, it works fine.\n\nAre you asking about a NACS to CCS adapter instead? I hear TeslaTaps are very good.",
            "* Congrats at the new little one! Yeah its a tough spot for families right now. 3 row EVs are just coming to market. But not at that price range you're looking for. Kia EV9, Hyundai Ioniq9, VW ID Buzz are the only options I can think of for 3 row. Now you know why trucks and SUVs are popular on America. The room for family is there.\n\n* Since you're in Europe, you might have access to asian cars that we don't in the US that may fit your situation.\n\n* Plug-in hybrid options are your next bet. I'm not familiar enough with that space to advise.",
            "Go to Tesla?",
            "Head on over to the r/boltev forum, read up on the faq. You’ll want to check if it’s got a new battery, 80% software cap, or passed the software test without needing a new battery. I think 2021 come with standard DCFC capability, but doublecheck that too.\n\nFrom what I’ve read, as long as you have L2 home charging you’ll be able to cover your commute easily. If you live somewhere that gets very cold might want to avoid Bolts with a software cap if you can’t get through it before winter.\n\nYou can check your commute using ABRP (a better route planner) using winter settings and your typical speed. I wouldn’t trust the cars guess o meter on range, since it varies with the type of driving you do. High speed and cabin heat will drain your battery faster, so getting one with heated seats will be best especially if it gets cold.",
            "* Do you need AWD? \n\n* How often do you do road trips?\n\n*\n* Do you qualify for the EV tax credit? Basically the decision is, do you want to buy new and \n\n\n\n* EVs the size of a Nissan Rogue are a bit rare right now. Mostly EVs are in the crossover body type right now. \n\n\n* I would use Car and Driver or AutoBuyersGuide reviews to look at the AWD options: Nissan Ariya, Chevy Equinox EV, Hyundai Ioniq5, VW iD4, Ford Mach-E, used Audi e-Tron. The Ariya might be a good option because it was designed for a more comfortable ride. Equinox EV might be cheaper with the tax credit, the drive feeling was designed with a gas car drive feeling, but it's in its first year, so far it's reputation is good. Ioniq5 has faster (level 3) charging speed than the rest, Hyundai/Kia are on their 2nd EV system, so their tech is more advanced. Mach-E has access to the Tesla Supercharger network with an adaptor on a limited number of charger stations, solid reliable EV and company putting their strongest brand reputation on the line.\n\n\nFor the RWD/FWD: Niro EV, Kona EV. Sisters cars to each other.  The others I listed also have RWD/FWD options that lower the price a bit.\n\n*\n* Here's some basics:\n\n\n* Technology Connections Beginners EV guide. Over half the video is devoted to understanding charging.\nhttps://youtu.be/Iyp_X3mwE1w\n\n\n* Charging and plug types\nhttps://arstechnica.com/cars/2022/07/the-ars-technica-guide-to-electric-vehicle-charging/\nhttps://afdc.energy.gov/fuels/electricity_stations.html\nHyundaiUSA YouTube: EV charging Basics\nhttps://youtu.be/4cVWy4yrB3E\n\n* AAA EV articles\nhttps://newsroom.aaa.com/?aaa_asset_type=&s=electric+vehicles",
            "The \"very fast\" charging systems aren't things people put in their homes -- they're the roadside fast chargers you use on road trips, called either \"Level 3\" or \"DC fast charging\".\n\nThe options for your garage are either a \"Level 1\" charger that runs on 110 volt power and restores 4 miles of range per hour or a \"Level 2\" charger that runs on 220 volt power and restores 20-40 miles of range per hour. A Level 1 charger probably comes with the car.\n\nSome options for a small to medium sized SUV: \n\n* Chevy Bolt EUV (lower end of your price range, available gently used)\n* Hyundai Ioniq 5 (generally very well loved and reviewed)\n* Kia EV6 \n* Volkswagen id.4 (gets tax credit)\n* Tesla Model Y\n* Chevy Equinox (new, not much known about them yet)",
            "Just go to a Tesla dealer and do a test drive.",
            "the new konas come with a lifetime of the subscription which is required for remote start (bluelink) but you'd probably have to pay for it with an older Kona.  but you also should ask on r/KonaEV to find some owners of older Konas",
            "People own EVs in Canada and Norway.  They can start in the cold.  80 miles round trip, if you get a level 2 charger installed and buy a car with over 150 mile range, should be fine.  Most cars these days have over 200 mile range.",
            "EV's are absolutely fine in the winter -- see the Norwegian experience.",
            "I would start by asking your insurance company for quotes - tho sometimes they need a vin?  i've heard tesla insurance can be more expensive.  Curious if you've looked at my little Kona!  Smaller/cheaper than Ioniq 5 but of course no tax incentives.",
            "Currently, access to Tesla Superchargers is a huge advantage for long trips.\n\nTwo teens and a dog says Model Y LR at that price range.\n\nGo test drive. Tesla test drives are easy, free, and there is no sales pressure because they can't sell you a car. All sales are strictly online.\n\nI will caution you that after my wife started driving my model Y it took about a year for her to dump her CR-V for a model 3.",
            "If you are not in a hurry to buy just wait. Tax credit is not going away. \n\nFast charging and home charging don't go hand in hand. Best is to daily charge at home(which will be slow) and use it. Fast charger s are for road trips. \n\nDon't buy in the hype for model y. It will be refreshed. Every 3 months or so they have deep discounts to dump inventory, I am guessing it will be an even deeper fire sale towards the end of summer or winter. It is a cheap utility vehicle and depreciates a lot, buy it at the lowest possible price from inventory to minimize that effect. If you rush to keep tax credit which shouldn't go away you will probably eat way more depreciation and miss the inventory discounts etc. \n\nFor long trips supercharger network is still second to none. That being said I would still prefer to do long trips on a hybrid rather than an ev. Given the high fast charger costs there is barely any difference between a hybrid or Y. Hybrid maybe cheaper for those trips and it is definitely more convenient. I did quite a few long road trips with model Y so I know this well. Also Model y and most of the suv ev's are not efficient at highway speeds. Expect to recharge every 180 miles or so to keep it safe. This is not bad since you may want to give a break but in winter time, in cold climates, when temperatures are low that interval goes down drastically! That becomes inconvenient.\n\nI agree with you that using the center screen for opening glovebox is dumb. Coming back from a y to a vehicle that has a latch to open the glovebox made me appreciate the convenience of buttons. I don't need many but definitely need some.",
            "used seems to have some great values these days.  Have you looked at Kona?  small and low price.",
            "If you’re planning on using it for road trips I’d look into the fast charging limitations on the solterra. It’s a rebadged BZ4X and they have relatively slow fast charging and may have a limit to 2 fast charges in 24 hrs. ",
            "Idk sounds too good to be true. definitely a better car.",
            "Make sure the 2017 Bolt is a 1 owner car for credit sake, but that's a banger of a deal",
            ">But, I am not a qualified buyer bcoz I don't meet the income limit.\n\nUh, I'm sorry to tell you this, but you are wrong. You **ARE** a qualified buyer. [26 USC Section 25E(c)(3)](https://uscode.house.gov/view.xhtml?req=(title:26%20section:25E%20edition:prelim)) says:\n\n>(3) Qualified buyer\n\n>The term \"qualified buyer\" means, with respect to a sale of a motor vehicle, a taxpayer-\n\n>(A) who is an individual,\n\n>(B) who purchases such vehicle for use and not for resale,\n\n>(C) with respect to whom no deduction is allowable with respect to another taxpayer under section 151, and\n\n>(D) who has not been allowed a credit under this section for any sale during the 3-year period ending on the date of the sale of such vehicle.\n\nNotice that being under the income cap isn't an element of a \"qualified buyer.\"  To be clear, not every \"qualified buyer\" can get the tax credit.\n\n[26 CFR Section 1.25E-1(e)(1) (page 44 of the pdf)](https://www.govinfo.gov/content/pkg/FR-2024-05-06/pdf/2024-09094.pdf#page=44) explains that if the second owner doesn't get the tax credit, the third owner cannot qualify for the tax credit:\n\n>(2) Example 2: Multiple transfers since enactment of section 25E. On July 1, 2023, a dealer sells a previously-owned vehicle that satisfies the requirements of section 25E(c)(1)(A), (B), and (D) to an individual, X, for a sale price of $30,000. X places the vehicle in service the same day. This is the first transfer of the vehicle since the enactment of section 25E. On May 7, 2024, a dealer sells the vehicle to an individual, Y, for a sale price of $24,500. The July 1, 2023, sale of the vehicle to X is not a qualified sale because the sale price exceeds the $25,000 limitation described in section 25E(c)(2)(B) and paragraph (b)(14) of this section. The May 7, 2024, sale to Y is not a qualified sale because it is not the first transfer since the enactment of section 25E.\n\nIf you want to argue that you bought the car for resale, you might be able to argue that you aren't a qualified buyer, but make sure you read the whole 89 FR 37706, all 70 pages, because that's going to be an uphill battle. [https://www.govinfo.gov/content/pkg/FR-2024-05-06/pdf/2024-09094.pdf](https://www.govinfo.gov/content/pkg/FR-2024-05-06/pdf/2024-09094.pdf)",
            "Really depends if you can see keeping the car, I think.  I always buy and drive it to the ground because thats how i get the most driving out of the least money.  Other people dont want to stay in a car thats 3 years old. \n\nOh, also if you are going to drive more miles than the lease allows that will increase the cost",
            "A modern electric drivetrain like that will outlive the rest of the car",
            "The problem with 'deals' is it depends what matters to you.  \n\nSome people just dont want to spend more than they have to.  The 5 cheapest new EVs are probably the Fiat (which is tiny and sorta meh, apparently), the Mini - which is, you know, a mini; the Leaf which has questionable battery management, the Kona . . . not sure if i'm missing any?  Model 3 and Niro  I guess?\n\nbut for some people, the best deal is going to be the most efficient, or the longest range for the lowest price, or the most storage space for the lowest price.",
            "Other cars in that price range include the new Volvo EX30, and maybe the equinox? dont know much about the equinox. and check out the sales on Ioniq5s",
            "You mentioned the Model 3. Keep in mind that the model 3 and model Y are essentially the same price. Baby & Dog would seem to recommend the Y over the 3.",
            "With those criteria and that price range, you may want to look at a Model X. Longer range, better suspension, and a 6-seat option.",
            "i guess you'd have to look at charging before you start the trip.  Honestly depending on how remote, it might be feasible to charge before and after the deadzone.",
            "I'm guessing you're referring to the App thing?\n\nI say guessing because Teslas and Tesla Superchargers don't use an App to charge, you just plugin.",
            "For road trip charging, Tesla is still probably the best, but now a few others can charge at Tesla chargers - possibly the Ford Mach-e?  But Hyundai Ioniq 5 is one of the most efficient small SUVs and a fast charger.  While i dont think they have the rollover rating of a subaru (I rolled over in one at highway speed once!), the new safety features are pretty great.  and they have a great warranty.",
            "The safety ratings of the Tesla Model Y are #1 in the world, even better than Subaru.\n\nTesla Superchargers offer the best fast charging network in the U.S.\n\nIt's easy, free, and fun to test drive a Tesla. No sales pressure because they can't sell you a car, it's all online.\n\nWhatever you choose, definitely test drive it first.",
            "I have flexibility to handle the financials provided I stay within my budget. My goal is mostly to minimize cost to operate with a side goal of having reasonable value in my vehicle over the next five year period.\n\nStated another way, I think the EV world is still evolving quickly enough that a few years’ difference appreciably changes the quality of vehicle you can have and its value for resale.\n\nI realize that these are “soft goals”, but there would be a point at which the negative equity was too much for me to stomach in terms of trading in for a new purchase or paying the penalty at turn-in. I am also somewhat optimistic that we’ll be in a buyer’s market.\n\nI do like the car enough to keep it, but also admit I do like having something new provided it’s not egregious financially.\n\nMy friend has an Ioniq 6 which I really like. The cars I’ve identified strike a nice balance of looks, cost and performance to me. Also, I have a personal opposite to Tesla vehicles.",
            "Does leasing make sense even if I know I’ll blow through the mileage again? I’d put myself in the same situation I find myself in now, which is fine I suppose if I were to lease Kias in perpetuity.",
            "Man I wish our household qualified but unfortunately we’re just over (even though we’re essentially a median household by Washington state standards)",
            "2023 models don't qualify for this credit",
            "Thanks. Yes to your 2nd point.  I have a J1772/CCS plug on my car and would want to attach to a Tesla charger which is NACS?\n\n\nI feel this is like USB.  Universal in name, but 10 plugs later, we're finally all agreeing on USB-C.",
            "Thanks alot!\nIn my country EV’s have large tax benefits, so fossile vehicles doesn’t make sense anymore. That leaves very few options.\nThe ioniq9 is not here yet, but we tried the EV9, a truly awesome car for sure. However, it’s almost 3 times the price of our model 3 and there is no used market for it yet…\nThe buzz looks very nice and I will try it. It is not yet available as a 7 seater here, but I think 3 child seats will fit easily because it has iso fix in all seats.\n\nI think the most efficient solution is to get the multimac in our model 3, but it leaves is with a small boot for such a big family.\n\nHaving that third child sure is expensive car wise!",
            "Unfortunately they don’t have cars that would meet the requirements.",
            "Amazing - thank you!",
            "Cool thanks for the resources. No need for AWD where we live. We don’t see ourselves roadtripping a ton and we always have the gas car if we don’t want to stop for charging. That’s disappointing that there’s nothing that size class for EVs atm. We just want the extra space so we don’t have to ask family when we need to move more stuff than a sedan can reasonably fit. We do qualify for the ev credit.",
            "Thanks! I definitely won't buy a car without asking for insurance quotes, as I personally know people that pay an absurd amount of money to insure their Teslas. It will be curious to see how costs compare across the board. Regarding your Kona, I think that might be a bit small for me. I've got a family of four and a dog and still want to use my car for road trips. I can make it work in a hatchback like my Prius, but I don't think the Kona has enough cargo space. But I should take a look just to make sure.",
            "Yeah, I agree on the advantage of the supercharging network and the Model Y LR seems like a good value. I took one for a test drive when at the end of last quarter when they were dumping inventory and discounting them by $5k, but they changed their pricing the very next morning. I'll honestly probably end up in a Model Y or Model 3, but wanted to see what else was out there. Also my daughter thought having to use a touchscreen to open the glove compartment was the dumbest thing ever... and I have to agree.",
            "Thanks for your thoughts. But I wouldn't be so sure the tax credit won't go away, as there have already been attempts to repeal it... such as this https://www.google.com/amp/s/thehill.com/policy/energy-environment/4228180-vance-unveils-legislation-eliminating-ev-tax-credits/amp/. Of course that won't pass under the current administration, but it could very well under a Trump administration. \n\nI don't think I'd buy a Model Y at full price, but I might during the next quarterly fire sale if the price is low enough. Or look to the Model 3 LR now that it qualifies.",
            "Thanks! I do plan on using it for the occasional road trip. Comfort, safety, design and price are all higher priorities for me though.  I love the look (and brand) of the Volvo XC60, but the price point is too high.",
            "Okay, makes sense.   \nNow, what are my options to get my 3rd party buyer used car ev tax credit?",
            "Interesting. Thank you",
            "I guess I’d say I’m looking for bang for buck and versatility. On the gas side of things, that’d be something like a Toyota Matrix or Honda Fit with their hatches and lay-flat seats making them almost as good at hauling things as a small truck while also being great town cars, decent trip cars, and not huge and unwieldy.\n\nI know there’s no direct EV equivalent to those (at least until the Rivian R3 is available, which seems like an 80s-themed electric reincarnation of the Matrix) but that should give an idea. Basically the more it can do for its footprint the more its price can be justified, to an extent (not looking for Mercedes or anything high end like that). Sedans score terribly on this metric regardless of cost due to the restrictions that come with a trunk.",
            "Any thoughts on the Kia EV9 ?",
            "I'm mostly thinking of non-Tesla charging, but in general, I don't want to have to rely on a phone or car data connection.",
            "Well, I guess the question to ask yourself is whether you feel like the cost to jump is worth the upgrade of the Ioniq 6 or similar cars. That's really a personal decision, based on values and personal financial math, even if you can afford it.\n\nAs a car, I do think Ioniq is better as an EV-first car rather than a converted gas platform. It's highly efficient even among EVs.\n\nIt's fine if you don't want Teslas, I understand, but I'm also thinking you should check out others as well. There's a lot of options now. Here's [sorted by efficiency](https://ev-database.org/cheatsheet/energy-consumption-electric-car) and a [list with pictures](https://www.caranddriver.com/features/g32463239/new-ev-models-us/). We recently sat in a lot of EVs and cars in general touring local dealerships for a potential second car, and it was very informative to preferences. I think now there really is an EV calling to everyone and you may find one you like more than the Ioniq 6, depending on what you value. There's dozens of these things, and if the Ioniq still remains your top choice at the end then at least you can be sure it's the best thing available to your wants right now :) Just bringing this up because the list of candidates you have right now seems odd.",
            "You can always raise the mileage on the lease. See how much it increaes the payment compared to what you expect to pay in overage for this car.\n\nFor me I will always lease because I like having the new tech and I don't put a lot of miles on my vehicles.\n\nI'm glad I didn't buy my current EV back when everyone was paying over MSRP only to find the value has tanked now. I can just hand it in at the end and get something new without worrying about negative equity.",
            "What matters is \"adjusted gross income\", which doesn't count voluntary contributions to an IRA. So you can throw some extra money to your retirement account and get under the line.",
            "Yes, you’re correct, forgot about that.",
            "It does feel like that :)\n\nYes, if your manufacturer doesn't have a specific one (like Ford is doing) I would go with a TeslaTap. I know the Mini versions work great on Energica bikes, and they have some sort of handshake chip inside that makes them work better than cheaper versions. Seen a video of someone trying out different adapters with the TeslaTap the only one to actually succeed charging.\n\nTo initiate charge on the Supercharger, you'll need the Tesla app and an account. Then there should be an option to charge a non-Tesla EV and initiate charging from within the app. I have a Tesla so I can upload app screenshots after work if you get stuck.",
            "Which requirements?",
            "Especially if you qualify for the used EV credit a used bolt is way under budget and is a great commuter car. You can fit a lot more in a hatchback than a sedan, but not as much as an SUV. Depending on how often you need to move things it might be worth it to rent something bigger only when you need it. ",
            "I forgot about the Mercedes Benz EQB. Not normally a brand and EV I see or think about. I just happened to see it in-person at a charging stop. It actually looks the right small SUV size you're looking for. \n\nhttps://www.caranddriver.com/mercedes-benz/eqb-2023\n\n\nI'm looking at MSN Auto and seeing used 2023 models going for your price range. It wouldn't be eligible for the used EV tax credit, but meets the size requirements.",
            "* Keep your ears open for the Kia EV3 and Rivian R2. Those should be out in the 2026-2027 timeframe. \n\n* If you want to see a bunch of EV models to compare all at once. You could check for your local Drive Electric Week events in Sept or April. It's an event for owners to show off their EVs and talk to people curious about EVs. Great place to ask questions.",
            "i have the 2024 which is bigger than the older ones",
            "Maybe your daughter would like the voice command. Press the right scroll wheel and say \"**Open Glove Box**\". It can also be PIN Locked.",
            "The touch screen makes it easy to lock the glove compartment. For example you can put it behind a pin of you give your car to a valet or someone borrows it.",
            "You can set the glovebox to open when you long press the left scroll wheel.\n\nTrouble is this means you can't set anything else to happen when you long-press it. (I have it set to \"adjust fan speed\").",
            "Comfort and design is more important than you being able to charge your car when traveling?\n\nThese are electric vehicles. You need to completely reset what you think you need vs want. Who was good at gasoline cars doesn't mean they are building good EVs.",
            "I don't think you have any.  \n\nMore specifically, I don't think you have options that don't involve arguing that the IRS is interpreting the law wrong or going through another big headache, like starting a dealership.\n\nI might be wrong, but the only way to find out is to read the law and the regulations.",
            "I mean I think the back of the 2024 Kona is as good as the Honda Fit for space, and its only a little bigger.  I bought a manual Mazda5 17 years ago and just finally replaced it in January.  I wanted to 'downsize' now that I dont have kids, but the mini seemed too small.  I liked the Kona.  and it was when they had a 7,500 incentive on it so I got the mid trim (bigger battery, which my husband wanted) for 33k including all taxes and stuff. The 2024 model is significantly larger than previous years, but the previous years are more energy efficient. \n\nanyways, the 2nd week I had my Kona, we brought home an electric lawnmower in it.  So it seemed reasonable. \n\nThe Leaf actually is also good space-wise, being smaller with a bigger rear space. I havent seen one w the back down but it really looks a bit like an old small station wagon to me, but with updated styling",
            "I read a review, it looks very promising.\n\n[https://www.tomsguide.com/vehicle-tech/evs/i-drove-a-kia-ev9-for-a-week-heres-my-pros-and-cons](https://www.tomsguide.com/vehicle-tech/evs/i-drove-a-kia-ev9-for-a-week-heres-my-pros-and-cons)\n\n>*Obviously, there are valid reasons why the Kia EV9 costs so much. However, its range is much less than the comparable Tesla Model X that gets an estimated 335 mile range — versus the EV9’s shorter 270 miles.*\n\nApparently the EV9 is an 800v charging system. This is nice in theory but there are very few 800v chargers so the EV9 will charge much slower on the more common 400v chargers.",
            "I'm having trouble imagining someplace putting in a charger that requires a phone but there is no phone service?",
            "Thank you for the efficiency list resource. Very helpful!",
            "Rationale makes sense. Thank you for the perspective.",
            "Teslatap doesn’t work on superchargers, it’s only for L2 charging. Anyway you can’t charge a non approved car even if you have a functioning adapter, and it’s only Fords and Rivians right now. General Motors was supposed to be allowed by April, but that was before Musk dumped the whole supercharger team, so the timelines up in the air. Volvo and polestar are supposed to be supported soon too. I’ve heard the adapters are backordered for months though, at least for Ford.",
            "Saturday night in a panic, I got the app and an account.  Doesn't help if the plug don't fit!  After say, an hour of searching Google Maps, and a frustrating Father's Day Eve, I found the EA spot.  There are just a lot more Tesla stations, and that seems to be what is being added to new gas stations going up here.\n\n\nLinks to the videos would be great.  \n\n\nI think Genesis might be sending us one, but I have gotten ZERO info from them on it.",
            "Mainly below $25k",
            "Meh, that still seems overkill. However making the turn signal into a fart machine... that was a feature I didn't know I needed. But in all seriousness, my favorite feature was the chime that goes off when you sit too long at a green light. That should be mandatory on every car. I can't imagine how much wasted time and fuel that would save.",
            "I want it all! For the most part, I use my car for commuting. \n\nDo you have any suggestions for me? I’m just beginning my research, clearly. Thank you!",
            "I mean if I have a different route. If a dealer can help me like a mediator. I make a deal 17k with a 3rd party and take him to a dealer. Dealer will get him 4k tax credit, dealer pays leasing company 15k. I make 2k and also pay the dealer for this transaction \nThis sounds legit but possible?",
            "Thank you !!",
            "Np and as for vehicles, I've driven the Ioniq 6 and the ID.4. I wasn't a fan of how large the I6 felt and I was coming from an XC40 Recharge. That might be a plus if you're looking for more passenger space, but I rarely have more than 1 other person in the car. The ID.4 wasn't a contender for me because it lacks full one pedal driving. Haven't driven the Kia or Volvo yet.",
            "Oh interesting. u/baseball_mickey\n\nI've been seen energicas (electric ccs bikes) charging at US superchargers, but maybe that was magic dock rather than a TeslaTap.\n\nIn any case if it works with L2, here is the Tesla page on L2 locations. https://www.tesla.com/destination-charging",
            "You are maybe a year or so away from your car being able to charge at a supercharger using a NACS adapter. It simply isn't possible now. If you look at the map of Tesla chargers, you can ONLY currently use ones marked as \"open to other EVs\", and you do not need any adapter to use them. An adapter will do nothing for you until Hyundai/Kia/Genesis and Tesla complete the process of adding the former's vehicles to the latter's network. Which I would expect to be in another year or so, given the current adoption rate. Eventually, once that's all set up, you'll be able to use superchargers listed as \"open to NACS\".",
            "Can't find exactly what I found before but I have better.\n\n* Here's a vid with the lectron not working and teslatap working: https://youtu.be/RgmzmX4cA_0\n\n* and even better, State of Charge going over adapters. They're great and very knowledgeable about charge tech: https://youtu.be/51JTXo8r0Xc though this is pre-NACS standardization",
            "https://www.tesla.com/inventory/used/m3?arrangeby=plh&zip=85001",
            "I guess so.\n\nAs long as the person claiming the tax credit is the second owner according to the vehicle history report, then the IRS should be ok. \n\nI guess your next step is figuring out if the leasing company is ok with your plan.  I don't know if  the lease buyout price is only available to you.",
            "Thanks u/86697954321 L2 doesn't really do what I want.   It's still hours to get 60-80% charge.  It'll be my hodgepodge and scrambling for the time being then.",
            "Thanks for sharing!",
            "They say any Hyundai dealer can buy out, now I need to crack a deal with a Hyundai dealer about it."
        ]
    },
    "So I had a weird interaction!": {
        "title": "So I had a weird interaction!",
        "score": 175,
        "url": "https://www.reddit.com/r/electricvehicles/comments/1dltaq0/so_i_had_a_weird_interaction/",
        "content": "Went to 7-11 to pick up some, ahem, \"German sodas\" lol, and while being rung up engaged in some small talk about gas prices. I glibly stated I no longer worry about those and pointed to my EV parked out front. The cashier's jovial demeanor immediately darkened and she loudly proclaimed that me owning that car \"made me a slave to the government\" whatever that means. I gave her a puzzled look and said \"that's a weird perspective\". At this point (not making it up) another lady who was behind me in line looked at me the same way you would look at the bottom of your shoe after stepping on a roach said \"Yeah, and what about all those people with dead Teslas in Minnesota this winter!\".\n\nWhat the actual heck lol? Man I just came for some beers and now I'm being accosted verbally over revealing I own an EV lol. The misinformation campaign against EV really is working on the salt of the earth morons of this nation isn't it?",
        "num_comments": 131,
        "comments": [
            "Believe me, EVs aren't the only thing that the cashier will be able to rant against.",
            "I've never heard of a gas-powered car running out of fuel and being stranded.  Never.",
            "People with horses hated and mocked people with cars. Change is scary for some people.",
            "The culture war is in full swing, and these people have positioned themselves firmly on the wrong of history.",
            "You should hear what they have to say about solar.",
            "I'd bet the cashier had specifically heard that the government can shut EVs down remotely, which is a common EV myth. What drives me nuts is they think they can shut EVs down because they are \"full of computers\" as if every modern car with any energy source isn't also full of computers and has been for 20 years.",
            "Those “dead Teslas in Minnesota” were actually just a charging station failure and could have been avoided by charging at home like most people…. And it was in Chicago. 😮‍💨",
            "Is anyone old enough to remember when they phased out leaded gas? I was young, but I don’t think people were as moronic. Government: here are the facts. People: grumble grumble okay.",
            "Slave to the Govt? As if Oil companies don’t get massive subsidies too? At least the EV subsidies go back into our pockets instead of to the bottom line of some faceless corporations.\n\nAnd as someone else pointed out, despite the cold, gas pumps and ICE vehicles also stop working when they… check notes… run out of fuel.\n\nIdiots",
            "Pretty typical American anti change behavior. If it's different they don't like it, to an irrational degree. It's pure baseless emotion.",
            "The media is much more powerful than any of us realize. It has the power to shape and cement ideas in people minds that are nearly impossible to eradicate with facts and logic. \n\nIf it feeels like my govt is screwing me and someone told me that I’m a corporate slave and showed me a few images to stir my emotion, that’s it my mind is hooked. \n\nIf only we educated our kids to think instead of just being mindless consumers and borrowers, we might stand a chance.\n\nChina is  the new super power.",
            "You interacted with the bottom 10% of humanity. Congrats.  It's not pleasant.",
            "Those people will be voting in November. Keep that in mind if you’re thinking about sitting this one out.",
            "First rule of EV Club, you don’t TALK about EV Club…",
            "The FOX factor is real and it’s ruining this country. Shameful.",
            "Trump voters.",
            "There's a crazy cult in the US that rails against anything that runs on batteries, but also: vaccines, queer people, college, doing anything about climate change, immigrants, tofu, sharks, the age of the earth, wind power...\n\n\n\nIt's a cult. And like a lot of cults, it's not based on reality. You know that you are less dependent on the government for power than they are for gas, and that your car works just fine in cold weather. But that doesn't matter to the cult. ",
            "I would have told them if it is better to be slave to Saudi Arabia.",
            "I would find it hard not to burst out laughing in response.",
            "Remember regardless of them knowing the facts that they have the same voting power as you. So misinformation has a goal.",
            "Ironically, with gasoline, you are more dependent on government. You cannot make your own gasoline. There’s no rooftop oil refinery. You’re stuck being dependent on government subsidized fuel. With an EV, you can charge from the grid, or even make your own electricity via rooftop solar.",
            "I'm an electrician in the UK. I'm the only electrician I know who'd love to own an EV. Every sparky I know hates the idea of an electric vehicle. Weird as fuck if you ask me.",
            "I am (gasp) a pretty conservative person. 40’s. White. Male. Mormon. Registered Republican… I can’t handle the brainwashing I see around me. And it changes over time. EV’s are the new target for some reason. I’ve watched “otherwise reasonable” (not crazy conspiracy theory peddlers) people post the strangest things on Facebook about how bad EV’s are. It’s propaganda and brainwashing and it’s stunning (and scary) to see. Like… the election was STILL stolen somehow. \n\nAnd FWIW I think it happens in the left too. \n\nAnd finally FWIW I don’t think I could go back to driving an ICE. I love my EV so much… probably more than a guy that doesn’t “worship idols” should. Leaving now to go wash it up on a Saturday morning so it stays beautiful.",
            "After buying my EV 2 months ago I’m starting to realize buying gas is a total scam.",
            "\"Hmm.. sounds exactly like what a government slave would say\"",
            "The trump effect, lol.",
            "You should have had some real fun and mentioned that you were on your way to get a Covid vaccine next.",
            "Welcome to America!",
            "Follow the money.  Are you old enough to remember 9 out of 10 doctors prefer menthol?  Big Tobacco pushed back hard against the idea that their product caused cancer in some smokers with  billions of dollars of profit on the line.  There are trillions of dollars in profit for Oil and gas at stake.  Not to mention $7 trillion yearly in tax payer subsidies.  Think how hard Oil and Gas will push back against the clear proof their products are killing the entire planet.",
            "Because ICE car never die in cold weather either?",
            "Slave to the government?\nId say it's the other way around.\nYou could install any means of generating your own electricity, go off grid and still be able to charge your car..\nCan't do that with gas... Plus you're at the mercy of the government when it comes to gas prices.. tax, subsidies etc..\nThe tech and efficiency in EV's is constantly getting better and will continue to do so and I can't see any revolutionary changes coming from the gas sector.\nIf they can get the charging times of EV's down it will be a game changer, but at the same time, stopping off, relaxing and taking a break from the go, go, go, pace of life isn't a bad thing either.\nBottom line, EV is the way forward and that's coming from someone who currently owns and drives a gas car. If I didn't have other life expenses that need to take priority I'd have treated myself to an EV but maybe sometime in the future",
            "I’m in Minnesota, I drive a seven year Chevy Bolt, and I had zero issues this winter. Just for the record.",
            "People get really wacky about electric cars, but I’m done being a slave to oil companies so I’m celebrating! \n\nMy friend told me I’m draining the electrical grid & showed me pics of how firefighters won’t help EV car crashes or something (which *could* possibly be true, but would they want to approach a gasoline car fire more? Doubtful).\n\nPeople are so  brainwashed into thinking these EV are bad in some way. \n\nAbsolutely *LOVE* mine, and am so happy I’m never paying for gas again!!  Let the weirdos keep paying & then listen to them complain about gas prices. I won’t",
            "EV opinions come in 2 flavors:\n\n1.  The future is here!\n\n2.  It's a commie plot \n\nThe reality is that the EV is a legitimate efficiency gain over the gasoline engine.  But it's not a magical conveyance.  We are bound by the limitations of nature.\n\nRegarding the surveillance, it's not \"the gummint\" but private industry that takes every opportunity to collect the most minute data from you.  \n\nBut this is every manufacturer now, not just EVs.",
            "In reality, you met two FOX News viewers.",
            "I feel like the response should be: “And the moon landing was faked.” Maybe add something about 5G too. Fight crazy with crazy.",
            "What I find funniest about the whole interaction is that it started with complaints about gas pricing. But they hate the alternative that would help them solve that complaint.\n\nThese are people that want to be angry. They don't want solutions. Just people that validate their anger.",
            "Imagine getting emotional over the propulsion system of a fucking car. Is this real life?",
            "Just remember that half the people in the world are of below average intelligence.",
            "Well EVs and gas alternative solutions have been hyper politicized and this is what happens when both sides aren't honest about the hidden costs about the final product.",
            "Are you in Minnesota?\n\nEver you run into such a punchy debater, just ask them if they’ve heard of an electric stove, induction plates or even light bulbs.\n\nAll reasonably good changes from what I hear.",
            "How is it that they think an EV would make you a slave to the government when owning an EV gives you more of the ability to be self sufficient & not rely on the grid, provided you have solar panels & battery banks at home?  \n& how do they think gasoline stations operate? lol",
            "What can’t you say you’re buying beer? Are you Mormon?",
            "Hard to imagine people like that in a 7/11",
            "German here. What are \"german sodas\"? Mezzo Mix? Fanta? Vita-Cola?\n\nAlso sorry for your experience. Seems annoying.",
            "Have you noticed the heat, floods, winds/tornadoes…, do I need to keep going?",
            "I’m in Kentucky and tell people I am paying the coal miner’s wages with my EV. Everybody loves coal miners here. Mostly goes over their heads though. I also hate that my EV runs off coal here :-(",
            "Ok I’m still laughing at the term German Sodas. \n\nI would have told her “does the make you my master?”  Or something off the wall like that”does grass make you horny?”",
            "OP - “I don’t have to worry about gas cause I have an EV!” could come across like a humble brag.",
            "I tell ya... That laptop!",
            "\"Hey I drive an EV and I'm vegan.\"",
            "That damn 5g",
            "How does the cashier think everyone gets to her store?  I bet the vast majority are by car ![gif](emote|free_emotes_pack|facepalm)",
            "I’ve never heard of a gas-powered car catching fire and burning up - except for the dozen or so I’ve seen personally",
            "I’ve never heard of a gas-powered car having a dead battery and being stranded.",
            "They could probably step over one aisle in the store and pick up the small gas can that they sell in every store and just point at it.",
            "But but but EV’s pollute the environment by all the micro pieces of rubber from their tires lol",
            "All people struggle with change, just not every change.",
            "The wrong side of history sometimes gets some wins for a while. So folks might want to register people to vote.",
            "Let me guess:\n\n\n\"what are you going to do if sun disappears suddenly?\"",
            "Some of my family are convinced through Facebook posts that solar farms cause tornados.",
            "Smashing calculators since grade school, no doubt.",
            "Hit them with the double whammy of EV + solar. Then order a coffee and when they ask if you want cream tell them you can't have any because you're vegan. They will be incandescent with rage. ",
            "And wind turbines! My god, the weird shit they say about wind turbines...",
            "My boss claims that he used to install solar and those homeowners are just stupid because, mathematically, they're never going to save more money than the installation cost.\n\nKnowing him, it's very possible he was just saying shit to get a reaction, but he's also from one of the most conservative areas of my state. I didn't engage to find out.",
            "That's an actual myth going around? I'm used to hearing how EVs are fire bombs, or there's nowhere to charge, or they're unreliable, etc., but not about government control. Definitely a new one to me.",
            "Well technically any new vehicle has this same vulnerability. I wouldn't put it past the NSA/Intel community to hack and listen to people via their own vehicles.  This is a valid concern",
            "> as if every modern car with any energy source isn't also full of computers and has been for 20 years.\n\nRight? It's not like someone ever [hacked a Jeep remotely and shut it off on the highway](https://www.youtube.com/watch?v=MK0SrxBC1xs) or anything funny like that.",
            "You can track any car made after around 2012 or so.  Possibly also remote disable.",
            "I’m a giant fan of EVs, but this is honestly a myth that I wish more people would complain about. Tesla specifically has a cell connection that can’t be disabled on the car. It’s constant reporting your exact speed/location, and has the ability to remotely set a valet speed limit and much more while the car is driving. Those are just the features available to every in the public APIs!\n\nI’m 100% sure the government can compel Tesla to produce your full location history in a sealed court order and probably disable your car.\n\nIn the US at least there’s a history of the FBI and local law enforcement getting up to some weird stuff and it’s not immediately obvious whether you have “nothing to hide” as a law abiding citizen. Benign social movements or showing up to a protest once have resulted in countless people stalked and harassed by law enforcement.\n\nAnd don’t even get me started on GM silently reporting your driving telemetry to insurance companies 😡",
            "Isn't Minnesota in Chicago? That's where Q lives. In Minnesota, Chicago, New York. Chicago is obviously in New York because it has a lot of crime.",
            "And they were mostly Uber driver that could just go home.",
            "Yes! We lived there at the time and it was wild. Mostly Uber drivers who couldn’t charge at home. There were lines and huge backups and the National news came to the Tesla charging station near our house. I knew it was going to just fuel people who already had a negative opinion, and too stupid to understand or learn more.",
            "Wasn't there an electrical outage? So not even Tesla's fault that the station was dead?\n\nIn one of the news reports I saw, most of the people were there to charge their cars because the app said it was online. So the real issue was that the station status hadn't updated in the app.\n\nThose issues are all minor and very common with technology; even your local gas station will be unable to dispense fuel during a power outage. \n\nAll of those things just happened to occur around the same time during a cold snap, leading to people to assume the cause was the EV batteries dying in the cold.",
            "I wasn't but I've watched some documentaries. \n\nIt wouldn't surprise me if the government tried to phase out leaded gas today it would be a huge culture war between right and left.",
            "[People reacting to changes to DUI law] (https://youtu.be/2xcQIoh3FQQ?si=7u71AwQ43_9yY26C)",
            "My dad was annoyed that unleaded cost more than leaded.  He thought it should cost less without the valuable TEL additive.",
            "I had someone tell me I was \"tied to my house\"...  When the fact that he too was \"tied to his house\", to you know sleep and stuff, he replied that he was not in fact \"tied to his house\" and could go any where he wanted...\n\n\nI was so confused by this interaction.  I'm still confused by it...",
            "Seriously. We likely have hundreds of hundreds of modern roundabouts in my region now and every time they announce or construct a new one there are hundreds of comments saying the same recycled talking points like, “trucks can’t navigate these!!!”.\n\nWe currently have a bunch of “superloads” for a new Intel plant which, shockingly, make it through just fine.",
            "It ain’t baseless. It is an emotion that has been formed by an intentional misinformation campaign. So baseless in terms of facts. But those people are constantly being fed misinformation on EVs. So they have a basis.",
            "I am no elitist but she is a cashier and thinking as if she is living the American dream.",
            "Ahh yes The Chinese government, famous for promoting independent thinking.... /S",
            "whats scary is running into people who are apparently high functioning, have a good job, and still seem to believe this crap",
            "30% I'm afraid. And that number is only growing.",
            "It might be bottom 51% unfortunately.",
            "You might as well just say MSM because CNN/MSNBCs of the world are just as guilty of gaslighting and brainwashing the other side.",
            "I wonder how they feel about their non gasoline powered mobile phones",
            "*in* Saudi Arabia. I’d like these people to leave the country.",
            "And you can profit off of it, too.  Buy oil and gas stocks with good dividend yields.  Driving an EV and getting quarterly checks at the expense of ICE drivers feels amazing.",
            "And so inconvenient and smelly....",
            "I'm involved with training first responders on how to deal with electric vehicle fires. Bottom line, they are way less likely (11 times less likely per million miles driven) than an ICE vehicle to have a fire. But if they are on fire, and that fire involves the battery, the current thinking is to just let it go to completion.\n\nAt the end of the day, if the high voltage battery pack is involved in the fire, there's nothing anyone is going to do to put that fire out. The fire is self sustaining, creates its own oxygen during the exothermic breakdown of the catalyst, and you can't cool the thing down. You can literally submerge the car in a tank of water for a week, pull it out, and it'll start back up again. You can put a fire blanket over the car, but when it's removed at some point in the future, the car will reignite. There's just no stopping that train, so the best thing to do really is sit back, protect exposures, and let it go. It'll be over in about 30 minutes when all of the available fuel is consumed. Otherwise, spend a few days putting 30,000 gallons of water on the fire and you'll end up with the same result.\n\nThat's a hard thing for a firefighter to do -- to just sit back and do nothing. We are trained to aggressively attack fires, and this is a complete shift in mindset. So yeah, your friend is correct in some ways -- currently firefighting techniques don't address battery pack fires. But we still respond to crashes, still render patient care, and will put our lives on the line if there's a person's life involved. But if it's just property, it's best to just let it happen.",
            "What are the hidden costs of ev's? If anything more of the cost is up front in my experience",
            "Or Baptist",
            "It's just slang for imported German beer.",
            "If you own your home consider solar and a home battery.",
            "Bet you do CrossFit to, you heathen",
            "One shut down the highway yesterday and it was a mess.",
            "If you aren't a little bit afraid of gas tank explosions, you haven't seen one.\n\nI saw two cars with I think oil fires (huge amounts of smoke coming out of engine compartment) 30 minutes apart a few days after getting my EV. Think it's an omen.",
            "I struggle with change.\n\nI rarely use cash anymore, and it's just not convenient to carry all of those coins around.",
            "Dude, the sun like *went away* last night. What if it does that again and never comes back?",
            "I know you are joking, but we do plan for solar eclipses.",
            "Well we didn’t use to have so many tornadoes back before all these solar farms started going up everywhere!",
            "Same crowd that would not buy A&Ws 1/3 pound burger because they were convinced it was smaller than the Quarter Pounder.",
            "Not really a myth and not restricted to electric vehicles. Just a general complaint some people have about new vehicles. Here’s a wired article from 2015 of a remote exploit being demoed on a cell connected Jeep to kill the engine while it was driving down the highway: https://www.wired.com/2015/07/hackers-remotely-kill-jeep-highway/",
            "Not in every country so. I believe in Germany the car would need a Fax telephone number the police can send the order to shut off to xD",
            "Your timing is a bit off. Honda, for instance didn't put a cell radio into the Civic until 2018.",
            "GM's onstar in the early 2000's can do it.",
            "Cops usually find it easier to just get your cell phone location history",
            "That a weird statement. What makes you think they could just go home to charge? If their batteries were dying while idling, they probably didn’t have the range to make it home. I have a home charger, but if I’m at a paid charger, it is for sure out of necessity.",
            "Good news! You can still watch the arguments against banning the still-not-phased-out leaded AV gas (leaded aviation fuel).\n\nhttps://www.avweb.com/aviation-news/california-pilots-urged-to-contact-senators-over-leaded-fuel-ban/\n\nCan't say exactly what the political leanings are of those commentors, but from the railing against \"DEI\" and Kalifornia (sic), I can hazard a guess.",
            "How are you going to suddenly leave your wife and kids to head out on the open road in an EV?",
            "Maybe he thought you had to leave the cord plugged in while driving, like one of those 90s era plug in lawnmowers.",
            "Lol what? Trucks can't navigate them? \nI think it's more truck drivers can't navigate them. \nThat's hilarious. \nPeople will fight literally anything.",
            "She still gets a vote",
            "Well they are now famous for science technology engineering and math. So yeah, laugh all you want while we get lapped on the world stage.",
            "Of course not. They are a dictatorship. But they dictate policies supportive of the welfare of their citizens. That's why they are successful. America has the moral high ground but is completely incompetent at governing. Pick your poison.",
            "/r/enlightenedcentrism",
            "Obligatory TV commercial from Renault suggesting that gasoline-powered-everything would be far from ideal:\nhttps://youtu.be/Il8ATz16pyM",
            "My phone runs on 350cu mm V8. No battery phone could come close to this computing power.",
            "They're powered by covfefe.",
            "I don’t know where you live, but the exact same thing happened yesterday in Austin 183 South bound during the afternoon rush hour.\n\nBut yeah…. EVs are the problem…",
            "WHAAAAT???  We lost the sun last night????  Why is the government covering this up???",
            "Now that you mention it…. We didn’t have so many tornadoes before Taylor Swift got real popular.  \n\nTaylor Causes Tornadoes!!!!",
            "I can't agree enough. I've only ever seen a truck take the inside lane and use the apron appropriately ONCE.",
            "Thx for sharing!",
            "That's a frickin' great ad.",
            "How would you hear it ringing?",
            "Taylor Swift causes tornadoes so that her boyfriend Travis can catch even crazier passes from Patrick MaHomes, and they can literally destroy any city that refuses to bend the knee to the Red Kingdom. Why is the NFL letting them get away with this? \n\n/s for obvious reasons.",
            "This is known.",
            "Keep it on silent",
            "> destroy any city that refuses to bend the knee to the Red Kingdom\n\nDamn you, Jake from State Farm!"
        ]
    },
    "New EV battery goes 1 million miles, handles extreme -22°F to 149°F": {
        "title": "New EV battery goes 1 million miles, handles extreme -22°F to 149°F",
        "score": 88,
        "url": "https://interestingengineering.com/transportation/farasis-energy-ev-battery-handles-22f-to-149f",
        "content": "",
        "num_comments": 38,
        "comments": [
            "For those of us living without freedom units:\n\n-22°F = -30°C\n\n149°F = 65°C",
            "as I said last time this was posted - not a million mile range, its a million miles lifetime.",
            "On paper…..",
            "I wish people would not use this source. It’s worse than a press release website for seo. Zero credibility no matter which topic",
            "What's the catch?  Low gravimetric or volumetric energy density?  High cost?  Fire prone?",
            "Can it be mass-produced and at what cost?",
            "Eh, big deal. I just invented a battery with a jillion miles of range that doesn't have to be charged ever. Also it materializes free Taco Bell in your glove box.",
            "Yawn.  Post this again when it is in production and has been demonstrated to be as good as claimed.",
            "149 seems a bit low for the upper limit given how quickly things are heating up. Still nice to see progress on temperature ranges.\n  \nInterestingly, the site first mentions 5000 cycles (which would make a 300mi pack a 1.5 million) but later \n\n> In a 45°C environment, a single battery cell can undergo 1500 cycles with a SOH greater than 70%. \n  \n450,000 theoretical miles is still great but that’s quite a drop.",
            "-22F is considered extreme? Where I live, it's colder than that like a month out of the year.",
            "If it's used to power a heater, it will go zero miles.",
            "Please, please, please let this be true...\n\nSomething I could charge overnight and drive for a week \n\nThen I could forget all about getting a hybrid.",
            "They're not even out yet and they're already fudging the numbers. Battery service life is almost always measured until it degrades to 80% capacity. These fine fellows decided to estimate it until the battery degrades to 70% capacity.\n\nBattery doesn't exist yet and they're already massaging the numbers.",
            "ICE is dead.",
            "I wish the yanks and the Brits just go metric and be done with it. Such stupid units.... The Brits are the worst to be honest they use both metric and imperial, smart stuff right there",
            "Nice, an EV who can handle post-apocalyptic temperatures.",
            "I thought F was for Fascist   \n/s",
            "I wonder how long you'd need to charge a million mile range battery with a granny charger.",
            "Remember when Fisker promised a solid state battery 400 miles of range and 9 minutes of charging...",
            "It isn’t out yet.",
            "Vaporware...",
            "This is the EV nobody asked for but everyone needs.",
            "149 seems a bit low? That's 15 degrees hotter than the hottest ambient outdoor temperature ever recorded on Earth, in Death Valley in 1913. It doesn't seem like 149 is likely to be reached in the next 500 years.\n\n-22F is extremely problematic for a lower limit. It gets colder than that in almost all of Canada and some of America on a yearly basis.",
            "Ice ice baby…. Dung tung di di dun dung",
            "Canada isn't far behind the Brits.  We don't use miles but we've got some pretty messed up mixtures of measurement systems.",
            "As I understand it, Fahrenheit and Celsius/centigrade are not relevant to the argument of imperial vs metric.\n\nFurthermore, Fahrenheit is arguably better at describing temperature in a meaningful way to human sensitivities. I’m afraid in this isolated case, it’s you that needs to get on.",
            "Just found my answer they got lazy... Sounds about right https://www.britannica.com/story/why-doesnt-the-us-use-the-metric-system",
            "As an American, I also wish we'd go metric, we technically tried to in the 70's.\n\n>Congress passed the [Metric Conversion Act of 1975](https://en.wikipedia.org/wiki/Metric_Conversion_Act) \"to coordinate and plan the increasing use of the metric system in the United States\". Voluntary conversion was initiated, and the [United States Metric Board](https://en.wikipedia.org/wiki/United_States_Metric_Board) (USMB) was established for planning, coordination, and public education. The public education component led to public awareness of the metric system, but the public response included resistance, apathy, and confusion.[^(\\[23\\])](https://en.wikipedia.org/wiki/Metrication_in_the_United_States#cite_note-23) In 1981, the USMB reported to Congress that it lacked the clear Congressional mandate necessary to bring about national conversion. Because of this ineffectiveness and an effort of the [Reagan](https://en.wikipedia.org/wiki/Ronald_Reagan) administration—particularly from [Lyn Nofziger](https://en.wikipedia.org/wiki/Lyn_Nofziger)'s efforts[^(\\[24\\])](https://en.wikipedia.org/wiki/Metrication_in_the_United_States#cite_note-24) as a White House advisor to the Reagan administration, to reduce federal spending—the USMB was disbanded in the autumn of 1982.\n\n  \nSauce: [https://en.wikipedia.org/wiki/Metrication\\_in\\_the\\_United\\_States](https://en.wikipedia.org/wiki/Metrication_in_the_United_States)",
            "C was for communists. Regan was against that.",
            "About 18 Years.\n\nThats assuming 1.5kW charge rate, 150Wh/km efficiency for a 241MWh capacity.",
            "When I was was a much younger man working in the building trades before college, the metric system was just being implemented here in Canada. What a shit show that was. Some material came metric, some in feet and inches. We worked it out but . . .",
            "Give those Canadians an inch and they'll take a kilometer!",
            "That doesn't mention the most recent effort when Congress passed the Metric Conversion Act of 1975 that was subsequently killed off by the Reagan administration (not the act, but the board overseeing implementation).",
            "It wasn’t laziness, it was conservatism.",
            "And for fast charging, you'd need a power of small nuclear plant dedicated for your vehicle for an hour or so. \n\nWould be interesting to see a charging cable capable of that.",
            "Our plant was planned as a metric plant. That meant that we bought our 3/8\" tubing in 10 meter lengths.",
            "Probably as thick as my dick.",
            "So not really that thick?"
        ]
    },
    "2024 Chevy Silverado EV Is the New Champ of Our Fast-Charging Test, Second in Range [Car and Driver]": {
        "title": "2024 Chevy Silverado EV Is the New Champ of Our Fast-Charging Test, Second in Range [Car and Driver]",
        "score": 192,
        "url": "https://www.caranddriver.com/news/a61207618/2024-chevy-silverado-ev-charging-range-acceleration-test/",
        "content": "",
        "num_comments": 104,
        "comments": [
            "Calling 0-60 in 5.8 seconds \"pedestrian\" still blows my mind. It wasn't that long ago that that was a respectable performance car figure.",
            "Sounds like it could be a great workhorse rig, charge power tools, tow and enough range to get to the worksite and back. Definitely spendy, but a step in the right direction.",
            "> 8800-pound curb weight\n\nJFC.",
            "This has everything I wanted the cybertruck to have",
            "Fastest charging in kilowatts, but likely not the fastest charging in range added per minute.  What would that be, maybe an ioniq 6?",
            "Big reason we got our Ioniq 5 80%; charge in 15 minutes... As long as it's not winter.",
            ">Charge rates quickly rose above 200 kilowatts, peaking at **315 kW**—the highest we've seen in an official test\n\nI don't think they have tested too many vehicles.",
            "I have to ask: isn’t this technically more expensive than a Rivian yet tows 1,000 lbs less? What’s the real advantage for the average consumer?",
            "Awesome! Now build one people can actually afford!",
            "If it was priced 20k less, GM made a profit on them,  all of this would be so impressive.",
            "Man, if I didn’t think this thing was ugly as hell it would be my choice. It’s a monster",
            "This thing looks more like an Avalanche than a Silverado",
            "GM is really changing the game with charging. The have a really bright future ahead of them",
            "Does it have CarPlay?",
            "Rented one a WT variant of one a few weeks ago and put a couple hundred miles on it over the course of a week. Overall was pretty good. Pricing will detract some but my biggest pain point is the massive battery pack, it has its purpose but if you push the range daily don’t plan on charging it with a level 2 home charger….it almost feels like trickle charging. DC fast charging ends up being a required supplement if you regularly do long distance.",
            "I feel the Silverado is the EV truck designed by people that are really into trucks, but have never owned or lived with an EV.\n\nWhich is a great contrast to the Cybertruck, which is a vehicle designed by people that are really into EV's, but have no idea what goes into a good truck.",
            "I've seen people claim that this truck is ugly and that nobody is going to buy it - Yet I've already seen several around-town. I honestly think that this truck is the EV truck that people have been waiting for. Relatively quick charging for a vehicle w/ such a large battery pack, massive range, and a respectable towing range of about 240 miles.\n\nAnd anybody that says \"240 miles, that's nothing\" is clearly not familiar with towing. If you drive a F-150 and start towing, your fuel economy drops drastically, which means your range drops drastically. You could realistically only expect to go maybe 250 miles on a full tank in an F-150 or Dodge/Chevrolet/GMC 1500.\n\nI mean seriously - 240 miles of towing range means I could drive to just about any large city surrounding where I live and still arrive w/ plenty of range to find a charging station. You're talking driving near Bolt EV distances while pulling 10,000 pounds.",
            "$50k before tax credit and I’m in. \n\nSo.. looks like I’ll never own one",
            "More than 200KWh battery pack, that is just criminal!",
            "Impressive, but obviously inefficient.",
            "In a behemoth that weighs 8,800 pounds",
            "For comparison, a 3,600lb 2010 Mustang GT did a 5.0 second 0-60 and a 2,800lb 2024 Subaru BRZ does it in 5.5, although that's not really known for its straight line speed.",
            "It’s totally acceptable. Sub 6 seconds? That’s fast.",
            "The first gen Ford F150 Raptor was doing 0-60 in 6.6s, and that was with a 6.2L V8. That was up until 2016, before the faster second gen was released.",
            "Sounds like a great pavement princess. We do a lot of road trips and this thing would be amazing for us.",
            "Article states $107 for a full charge at a retail charge station and close to one (edit - not two as per the Hummer EV article but also doesn’t include time to unhitch a trailer if you’re towing)hour to charge it. If you’re towing expect range cut in half per other towing tests with Hummer/Rivian/Ford EV trucks. It’s appealing as a local grocery getter and recreational tower but nothing long haul\n\nEdit - wow people be hating for pointing out details from the article. Just read the headline folks. Details don’t matter. Psh. 🤷",
            "It's a rail gun",
            "and you have alllllll the Newton-Meters so you can dig yourself deeper into that mud hole....",
            "Imagine getting T-boned by one of those.",
            "Hard to say, but Taycan or Lucid Air would be up there, I think.",
            "Probably Ioniq 6 is the fastest among the things most folks can afford. Great efficiency and 800V.",
            "Nothing beats lucid as this charges at the same rate that does with a battery hf the size and more than double the efficiency",
            "It depends on how long you stop, but according to https://outofspecstudios.com/charging you get more highway range with this in 20 minutes than an Ioniq 6 AWD. He doesn't have the 2wd or Lucid. Over 30 minutes this beats everything on there and under that only a few things beat it.\n\nIt really is quite good for range added over time even though people on here don't seem to want to see that.",
            "Aptera",
            "Honestly the Ioniq 5 is the best looking ev on the market right now in my opinion",
            "I think part of this is that they haven't had the best luck getting maximum charge speeds out of some cars, probably charger-related. The Silverado EV should be able to max out a 350kW charger & pull like 360kW.",
            "Range and charging speed are really big ones. It's also much more usable for hauling things in the truck because the bed is longer, and it has the midgate. Extremely few people are basing their buying decisions on the cost per pound of towing capacity. Most people aren't even basing it on a small subset of specs in general. It does seem to be a bizarrely common line of thinking here that I've never begun to understand, though.",
            "Firstly it's a size class up, fullsize vs midsize like the R1T. It also has a much larger battery which is important for inherently energy-intensive towing.",
            "The more affordable the more people will buy.\n\nThe more people that have one the more people out there to make the point that you probably won't care all that much which car charges faster.\n\nIt's not *un*important, we should always push for faster, but it's also the kind of thing non ev owners over value the importance of.\n\nThe right owner could go years at a time before being in a rapid charging situation at all, and even then the overhead of those road trip stops where you're peeing and grabbing a drink and whatnot really becomes clear when you have an ev.\n\nThe car beats us a lot of the time.",
            "Best they can do is ask uncle Sam to double the price of the competition.",
            "Honestly I'm genuinely impressed it's only $75k base model. For a 200kwh pack that's pretty bonkers.",
            "There will be significant incentives via leasing to move these after they are on the dealer lots for a while. The pricing is just too high for today’s market IMO.",
            "Curious what the used price will be after 3 or 4 years",
            "There will be a GMC version with different styling\n\nhttps://www.caranddriver.com/gmc/sierra-ev",
            "You don't want an EV Avalanche with the hood of a minivan!?",
            "Used?",
            "Yes, ALL pickup trucks are inefficient and make up for that with a larger-capacity tank or battery pack.",
            "GM says the Silverado EV charges at up to 100 miles in 10 minutes.\n\nTesla says its slightly more efficient Cybertruck will receive a software update so it can charge at up to 154 miles in 15 minutes. Which would put it on par with the Silverado EV at roughly 50 miles every 5 minutes.\n\nhttps://www.notateslaapp.com/news/2086/tesla-cybertruck-to-receive-charging-improvements-in-upcoming-update\n\nThe Rivian R1T with dual motors is probably [the most efficient electric truck currently on the market at 84mpge](https://fueleconomy.gov/feg/Find.do?action=sbs&id=47870&id=46946&id=47821) but it's charging tops out at 210kW. It will be interesting to see if that is improved by the recent mid-cycle update.\n\nThe Ford Lightning doesn't have great efficiency and it's charging is considerably slower than the other electric trucks but the top trim spec does have 11 outlets which could make it a better work/fleet/farm use.",
            "Does it matter? I don’t really care how the sausage gets made, just that it does",
            "It's probably about a factor of 3 more efficient than a similar ice truck. Why are you complaining about that?",
            "What a dumb amount of mass",
            "Why would you want such a large and expensive vehicle just for highway trips?",
            "> close to two hours to charge it\n\nI'm pretty sure it says 10-90 in 38 minutes. The two hours was an early Hummer and I believe they have since tweaked the charging curve of those to be more inline with what the Silverado showed here.\n\nAlso for the towing range: while it certainly doesn't cover all use cases, there are plenty where towing range over 200 miles (450 cut in half) is more than sufficient",
            "Yeah, I’m talking work truck. Hauling equipment to a worksite, not a 5th wheel or whatever on a road-trip. You can drive a shitass bolt to get groceries. Why would you spend 100k on a truck to drive around town?",
            "Nobody is going to buy this thing.",
            "Coming to pulverize a family near you!",
            "2,000 miles in Ioniq 5 - 6 mins stop to charge, 10 mins stop and the longest stop A Better Route Planner suggested 18 mins. That was all on Electrifiy America which ain't the greatest.........but worked effortlessly.\n\n350 kW and 800 V........303 miles per charge, 225 miles added in 17.75 mins. Charging beast and no issue at all on road trip.\n\nAll is good when the wife doesn't complain about too many and too long stops..........She went to Home Goods on 1 stop and a drug store on another stop. We got sandwiches at a deli on one stop.\n\nThis architechture is 2021 tech? 2020 tech?    Things are getting better and better and faster and faster.",
            "That is in fact impressive performance for the Silverado, and it's great data to have available. Thanks for linking that.  Unfortunately, it's not conclusive, because some of the top contenders aren't there. I suppose one could assume that the ioniq 6 charge speeds are the same for all-wheel drive or two-wheel drive, and adjust based on some other data on highway range.",
            "I have one, hard agree.",
            "Trucks are probably the one area where fast charging makes the most amount of sense. Trailering is incredibly inefficient, even for ICE, so stops to gas up, or in this case charge, are far more frequent compared to a road trip in a typical passenger vehicle.",
            "The benefits of having your own battery plants.",
            "Is this the cheapest home battery per kWh on the market?",
            "It won't shock me if it takes over a year to get to that point though. I would really love to trade in my lightning for one (or preferrably the Sierra as I think it looks better).",
            "I prefer the Chevrolet interior but the Sierra looks amazing outside",
            "Yea that looks great. If only it weren’t 100k and years away",
            "Apparently I’m crazy if I don’t based on the downvotes I’m getting for my own opinion",
            "Spending that much on a used vehicle just doesn’t feel right. Not sure what I’ll do when my 17 year old pickup truck finally calls it quits ",
            "A battery-powered brick on wheels is better than a gas powered brick on wheels, but I bet a Prius does less CO2 per mile than a Silverado EV on most grids.",
            "No shit, that's my point.",
            "The Silverado EV and the Cybertruck were already pretty close on the out of spec cross country race, though the Silverado did win.\n\nThe biggest benefit for to he Silverado isn't the charge speed, but rather the ability to skip stops.\n\nFor a lot of my trips it would shift me from 15-20 minutes of charging (MYLR) down to 0 minutes!",
            "Yes, the fact that you can almost build two Lucid Airs with the same battery materials and associated CO2 emissions.",
            "Because America.",
            "“But the Silverado largely sustained rates above 200 kW for the first 38 minutes, holding a triple-digit rate for all but the final eight of its 58-minute charge time to reach the 90 percent goal line.”\n\nWe’re both wrong. It took 58 min if you don’t have to wait and not counting unhooking the trailer so you can access most public charging stations. Still a long lunch break if you’re going cross country. If not then it’s a good $100k toy hauler\n\nEdit - with link 👉🏼\n[4th photo down](https://motorillustrated.com/tesla-icing-by-pickup-trucks/16753/) - don’t be a “redneck” with that EV rig",
            "This is a question for the 100,000,000+ truck owners out there.",
            "you must not be an american truck buyer LOL",
            "You ever gone grocery shopping for BSA Troop 14!?!? (/s for those who don’t get it)",
            "So you can try to run bicycles, Priuses, and anything your beer-addled brain recognizes as an EV off the road.\n\nAt least this is what folks with gas trucks do.\n\nCampus police has a Lightning that I have never seen unplug from its spot at the L2.",
            "I thought that about the F-150 Lightning with its horrible range - yet they exist in the wild…",
            "... And that's the Ioniq 5. The 6 is even better (since it is more efficient).\n\n\nHyundai is knocking it out of the park.",
            "It will also take a redesign of charging stations to be pull through. I can’t think of any along my usual route with a car trailer that would be easy to charge at. Having to drop the trailer to charge would become old fast. \n\nI think a PHEV truck would be the best until things improve.",
            "The overwhelming majority of trucks are luxury pavement princesses, most owners do not tow.",
            "It's not just that, but the new long-blade NCMA cells GM is using.",
            "No, but for a HE (High Energy density) battery pack, it is very competitive.\n\nFor 75000$, you could get an insane home battery system with considerably more capacity.",
            "Yea it’s possible. I got $30k total off my Lightning Lariat including the $7500 POS tax credit.",
            "GMC is saying “this Fall”",
            "The Ford F150 Lightning looks great to me. This looks terrible and like it’d require after market shit to fix. :(",
            "Downvotes just mean that people disagree, stop being a baby.",
            "The Silverado was driven by people not as good as optimizing charging as Kyle. Kyle’s a bit of a psychopath.",
            "No",
            "👆🏼this. IYKYK",
            "Cheap lease. Pavement princess.",
            "It's why I'm interested in seeing the performance of the Ram 1500 REV for towing, large battery but with an engine that mostly exists as a generator.",
            "That may be the case, but it's irrelevant to this point. You don't see any sedans pulling horse trailers on the highway, do you?",
            "They give a discount for being a POS?",
            "Yes, but that is 2 years after launch.",
            "Agree. I love how the lightning looks",
            "I’m good, are you?",
            "True, but they were the second best team and the Silverado EV has a flatter curve than CT. I don't think optimisation is as critical. \n\nTbh, the Silverado C rate isn't spectacular, it just makes up for it with spectacular capacity.",
            "Small stature?",
            "So like most trucks sold to end consumers.",
            "Yes. Who else buys Fords?",
            "This was for the 2023 MY.",
            "Or small something else.",
            "Did you buy it within the last 6 months though? That's the only time I've seen discounts that big on the lariat."
        ]
    },
    "Arizona toddler rescued after getting trapped in a Tesla with a dead battery": {
        "title": "Arizona toddler rescued after getting trapped in a Tesla with a dead battery",
        "score": 30,
        "url": "https://www.theverge.com/2024/6/21/24183439/tesla-model-y-arizona-toddler-trapped-rescued",
        "content": "",
        "num_comments": 61,
        "comments": [
            "Doors have worked without electricity for thousands of years - for good reason. Someone is always looking for a solution to a problem that doesn't exist.",
            "It's sad to say that door handles are now one of the things we pay attention to as we consider different EVs.  It's not just Tesla, obviously; lots of other brands have electrically operated handles that could fail in an emergency, or for that matter in a non-emergency.\n\nNot that mechanical handles are perfect; I had to replace one in my 500e.  But they're less imperfect.",
            "probably happens with ICE cars every day, when people don't know how to use their manual overrides.\n\nonly makes the news when its an EV",
            "Maybe doors should have fucking handles and a slot for a key",
            "With double block some cars will not open without battery. The ones that you can’t open from the inside to avoid theft. You need to go in from the trunk or brake the glass.",
            "Industry disrupter",
            "So do the tesla doors. They have a manual overide for a reason. However this is a likely flaw for a lot of new cars with electric locks when their 12 volt runs out. \n\nIn situations like this a old fashioned manual lock or carrying a glass breaking in your wallet can be. A life saver.",
            "To be honest I think you're actually wrong, as at least on ICE cars the manual override is a fully mechanical one that only extremely excessive rust could possibly cause it to not function anymore.",
            "Right? I don't mind whether the handle is jutting out, or recessed in a concave 'hole', or is a upward-actuated flip-handle as long as its there.  But this 'anti-handle'(relatively speaking) idea is a little too backward indeed.  As for keys I have to agree, many people use fobs daily but at least the few times its somehow needed there is still slots on the front door(s) - aside to of course powered hatches/trunks being keyed too since many of them at least can be physically manpowered reopen even if the electrical side long stopped working.",
            "What modern car still has a slot for a key? All modern cars will keep you locked out if the 12 volt dies.",
            "no, that's pointless. not many people carry the physical key anymore (ie: a keyfob that has an actual metal key hidden in it), and therefore it's not helpful if the car has an actual key slot.\n\nie: i drive my car using only my phone as a key. or sometimes i take the key fob (no, it doesn't have a key in it). therefore i have no metal key.",
            "Agreed, and although not related to this topic I still wanted to mention that I only got a Tesla taxi once and not surprisingly the driver had to handle the rear door both times due to the lack of any 'normal cues' on how to use it .. and hmm now to also think that theres literally no physical non-battery backup for the doors just makes it sound a much more nutty design thats for sure.",
            "https://www.tesla.com/sites/default/files/downloads/Model_Y_Emergency_Response_Guide_en.pdf\n\nWhere are the „Opening doors from the outside with NO power“ instructions?",
            "Traditional glass break tools don’t work in Tesla windows - they use laminated glass. There was a story a few months ago about a woman who drowned in like a 5 ft pond in her Model X. She was conscious and using her phone to ask people to help but they couldn’t get into her vehicle in time because the glass was reinforced.\n\nLook up the death of Angela Chao.",
            "Teslas also have manual overrides",
            "the problem is not the mechanism failing, its the useless meat sack that drives it not knowing how it works or if it even exists.",
            "That’s blatantly not true. Ioniq 5 and 6s have a hidden key slot in the driver’s door handle to open the door when the 12v is dead.",
            "My car's keyfob has a little physical key inside of it and you can use it to unlock the car if either the cars or the keyfob's battery dies. I thought it was pretty standard on most cars.",
            "They all have a spare key hidden in the fob and the drivers door has keyed entry under a little cover.",
            "Mine does. I have a spare key in my fob",
            "My 2024 Volvo has a metal key in the fob and a hidden keyhole behind the door handle. If the battery (either the car’s or the fob’s) dies, I can still gain entry.",
            "Wrong. Most of them do; even the ones with an electronic door release. The BMW iX has a slot hidden under the exterior handle. The Corvette’s slot is in the intake right behind the door. \n\nTesla is the exception, and you’re being a fanboy making assumptions about the rest of the industry based on your tiny little bubble. Get outside.",
            "The ID.4 has a keyhole under the drivers side handle, and the key is inside the fob.",
            "You're talking about yourself. Phone as a key is just beyond dumb. But you do you",
            "You shouldn't have to partially disassemble your bumper, jump it to open the front trunk, and charge the 12V battery to be able to get in your car.",
            "Have you seen the little stick on bumpers from Ace Hardware they have to put on their steering wheels to find the blinker “buttons”? \n\nHomie made cars LESS car and that’s absolutely not what anyone wanted.",
            "There is a physical backup from the inside. Also getting in after powerloss just requires a 12V battery.\n\n\nhttps://www.tesla.com/ownersmanual/modely/en_us/GUID-34181E3A-B4A7-4658-906A-38C6647B5664.html",
            "https://www.tesla.com/ownersmanual/modely/en_us/GUID-34181E3A-B4A7-4658-906A-38C6647B5664.html\n\n\nYou open the hood with the above instructions, then boost the battery.",
            "They assume emergency responders have ways of opening stuff.\n\nAnyway you apply 12v to the leads that are tucked behind a little hatch on the bumper and it pops the frunk, then you can charge the 12v battery. Not something you would do if there's a baby in danger, you'd break a fucking window like right away, like before someone with tools and shit even has time to get there.\n\nIt is worth mentioning that Teslas have cabin overheat protection that has probably saved tens of babies lives at this point.",
            "Right next to your ability to read. This is a problem with modern luxury cars. It's a trade off between security with not letting people in and this far less common situation.\n\nEdit. If you lose your 12v in the wrong situation and you are inside a unlocked car. What do you think happens?",
            "People break the glass to steal stuff out of Teslas all the time...",
            "On the Model 3 and Y, they're only on the front doors.",
            "Oh I’m surprised the ID.3 still has that, a lot of manufacturers don’t make them like that anymore. That was a popular design 10-15 years ago but now many are just doing fobs with no back up key and push to start.",
            "This is how Priuses have worked since forever and it's very well done. ",
            "Those folks will defend anything dumb if it's done by a certain company",
            "Lol \"partially disassemble\"... It's just a cap bro. ",
            "An RTFM issue.",
            "And that is precisely the problem: A safety-critical process that has been solved mechanically without error for ages is made more complicated. Instead of simply opening the door mechanically from the outside, you first have to get to the battery and jump-start it.\n\n„Just wait in your burning car until i get my 12v battery from my garage to open your door.“",
            "You think thousands of babies die of car heat annually ?",
            "Help me out and name the page 😞",
            ">This is a problem with modern luxury cars\n\nSince when has Tesla been a luxury car?",
            "That is irrelevant to the point I made - I didn’t say their glass was unbreakable, I said traditional glass break safety tools do not work on Teslas.",
            "Does that matter",
            "The key is only useful to open the door (singular, only the driver's), the car doesn't have a keyslot for the \"ignition\". On the other hand there's an inductive reader in the cupholder so you can start the car even if the fob has a dead battery.",
            "It's just a \"solution\" looking for a problem, bro. There are plenty of cars with flush door handles that also have keyholes underneath.",
            "There is a mechanical way to get *out* of a Tesla without power -- a mechanical door latch on the inside. Nobody (other than an infant) should be stuck inside.\n\nGetting *in* without power is the thing that's hard.",
            "Idk the statistics. Just looked and it is 40 per year in the US alone.\n\nSo possibly tens (cumulatively, not annually)",
            "Ii agree with you Taylsch, I can't even find one single mention of \"without power\" on it either.",
            "This. I see them classified as luxury often, and, sorry, it just doesn’t apply.",
            "Not arguing against that, but exaggerating the description doesn't help your point.\n\n\nIt's like saying removing a fuel cap is partially disassembling a car to fill gas. Technically correct but pretty dumb.",
            "I never said it had a manual overide freely avaliable from the outside. That would be a great way to be carjacking victum.",
            "No..... that's not how this works.\n\nYou see, normal cars have a physical key. Even inside those electric \"keyless\" fobs. When the car loses power (both hv and 12v), you can always use this physical key to override and get in.\n\nI own a Tesla and an Ioniq 5. Our Ioniq 5 had the notorious 12v failure. Car is sitting dead and I still got in with the physical key.\n\nMy third car is a gas car. I'm rebuilding the engine, have the 12V disconnected and can still lock/unlock it with the fob's physical key.",
            "My BEV would be opened from the outside without 12V power by prying a cover off on the driver's side door handle and using the physical key stored inside the key fob. \n\nThat's NOT going to help any carjacker access my car. \n\nTesla fanbois always have an answer as to why Teslas are perfect.:rolleyes:",
            "You can open a Tesla without power by prying a cover off the front bumper and applying power to pop the frunk, then attaching jumper cables to the 12v battery.",
            "With the 12V battery I carry around with me all the time, just like my car's key fob.  Right"
        ]
    }
}