{
    "Feedback: How are the mods and the subreddit doing?": {
        "title": "Feedback: How are the mods and the subreddit doing?",
        "score": 3,
        "url": "https://www.reddit.com/r/EngineeringStudents/comments/1dl2bp2/feedback_how_are_the_mods_and_the_subreddit_doing/",
        "content": "Put your feedback here! Please remember, mods are human and our changes are a response to community feedback!\n\nLet us know of some things you've noticed, or things you might want addressed!",
        "num_comments": 0,
        "comments": []
    },
    "Friday Check-In": {
        "title": "Friday Check-In",
        "score": 1,
        "url": "https://www.reddit.com/r/EngineeringStudents/comments/1dl2bot/friday_checkin/",
        "content": "How are you doing? Had a rough week? Did you murder that exam in Fluids? Need a pick me up? Post here and commiserate together!",
        "num_comments": 1,
        "comments": [
            "Took 2 summer courses. Dropped one and I just flunked an exam 3 minutes ago for the other one. It's really soul crushing when it happens."
        ]
    },
    "My professor said hard pass on a 30k robot": {
        "title": "My professor said hard pass on a 30k robot",
        "score": 30,
        "url": "https://www.reddit.com/r/EngineeringStudents/comments/1dlrzu2/my_professor_said_hard_pass_on_a_30k_robot/",
        "content": "Hello,\n\nI am a 2nd year student in romania studying industrial engineering and robotics. Sorry for my bad english I am very angry. \n\nI am the student „leader“ at my professor laboratory of industry 4.0 stuff. So we do plc programming, cfd/fem simulations, 3d printing, iiot, you know the usual. \n\nI am a programmer at heart. I love my python, my react, c++, c#, openCV, Unity and I am really really bad at mechanical engineering. Such is life. \n\nFor the last 6 months I have been begging my professor to get an industrial robot. Since you know, I love programming and a cobot is peak mechanical engineer that can be programmed to do ANYTHING. Also we are a robotics university, at the department of „robotics and production systems“. \n\nYesterday I got a phone call from *insert big robot company here* saying yes we will give a real industrial robot because you are a lab in a univerisity. And my professor was like no thanks. After I begged every company to give us one 4 free.\n\nHere is why I am furious. I have done a lot for that lab. Most of the projects there are even funded by me to some extent because election year and public money from the uni is impossible to get. I bought 14kg of 3d filament in total, vibrations sensors, microcontrollers, my old pc were all used for projects in the lab\n\nAnd he can‘t even say yes to the single thing I have been asking for??????\n\nI will probably remain at his lab and forget this all happened because I am gold fish but I am personally hurt even tho I shouldn‘t be.  \n\nAlso most of the projects he wanted to start have gone terrible wrong and usually only my projects go smoothly for some reason. I would like to detail in the comments later what projects he wanted to do. \n\nSuggestions on what should I do? \nIf I leave the lab, the team will literally not exist anymore. And next year I have a class with him sooo yeah",
        "num_comments": 17,
        "comments": [
            "Don't spend your own money in a business that you don't control. You have the right to be upset and I would be too.",
            "Free robot arms aren't actually free. Who is going to maintain and repair it? Does the city your university is in have any licensed specialists who could maintain it or will the university need to hire and train someone whose sole responsibility is to maintain it? If so, how much will that training cost? And what is the expected salary range of the employee hired for the job? Where does the funding for this come from?\n\nFurthermore, what is the university going to do with such a device? An argument could be made if you were a Ph.D student who literally needed one to further their research, but typically universities don't go for big, shiny, and expensive to maintain toys just because some random fuck off undergrad thinks they'd be cool and fun, especially when that toy requires specialized (and costly!) installation and maintenance.\n\nFinally, it doesn't matter if your professors' projects go well or not, what matters is that they continue to get funding (grants); the university can ignore a LOT of bad behavior as long as the money keeps coming in. _Especially_ if they're tenure. You, on the other hand, appear to be a particularly entitled undergraduate who doesn't understand how universities are run.",
            "He might be also worried about safety. It’s not that simple with robots (well it is, until something bad happens)",
            "read the book never split the difference by chris voss and ask him again with your newfound knowledge",
            "Why was 6 months of him saying no before not enough warning that he would also say no this time? \n\nAre you seriously considering leaving your lab because they won't buy you a big robot arm to play with? \n\n>Also most of the projects he wanted to start have gone terrible wrong and usually only my projects go smoothly for some reason. I would like to detail in the comments later what projects he wanted to do. \n\nThis comes off as very arrogant. Your professor presumably has years of research experience as he runs a lab. Does he have publications? Sometimes research goes wrong. I know I've wasted months chasing dead ends in the lab. You are a 2nd year undergraduate student, do you think it's possible your projects go smoothly because they are generally a little simpler and less novel, and not that you're simply better than everyone else?\n\nIf you really want an arm your best bet is to write a research proposal for a project that would require it and that you stand a chance of achieving. You'll need to determine required space, safety precautions, maintenance and upkeep costs, etc. because if you want to convince your professor to make a significant investment in equipment you need to actually have a use for it and already know everything that is involved in the ask. As others have said, for a master's student maybe. For an undergrad no way.",
            "He has a right to be upset with himself for spending that money and expecting others to give a fuck",
            "Amen. A lesson I learned trying to get money back from an organization with established reimbursement forms and processes. \n\nIf you aren't the one with the budget and the credit card the only things you buy are gifts-in-kind.",
            "As someone who just helped my school surplus 3 large machines that were acquired for \"free\", this is correct. Unless you are faculty you can't be making decisions on large equipment for the school. Students only stay for the time they are there for the degree, they can't accommodate everyone's desires. Faculty stays for the long haul and knows what's best in terms of educational value.",
            "well… he said he is in the robotics department. even if it just sits there it could be a good recruiting tool",
            "Good point. But don’t you think he should’ve said that to the OP while he was going ahead and trying to get one from all of these companies?",
            "I am from romania, maintainence and repair are not a thing here :)))). No joke. We have 5 robots (one Kawasaki, two ABBs, one Fanuc and a broken Kuka) LOCKED behind fences that are only used by the two Olympiades or for one semester in the entire 4 year course :)). Yes we are an industrial Engineering faculty and there are 400 students currently enrolled in industrial robots course and we get a total of one semester where we can touch a robot. And in that semester we only teach the tcp for the tool, not even for the frame/user/local. \n\nWe have two semesters about mechanical components and I shit you not our professor didn‘t have more then 3 types of bearings to show us for the whole two semesters. We saw linear guides, gearboxes, ball screws etc only in pictures. Like I get it, maybe they are expensive, and seeing them might not make a difference. But it is this attitude of not caring that literally makes me sad choosing engineering at my uni even tho it is the biggest one in the country",
            "100% agree robots are not safe. But solutions like fences and cobots and speed limits are there for a reason. We even have a course on safety",
            "Maybe, but that's a decision for the faculty and Dean, not the undergrad who didn't ask before talking with vendors.",
            "This only makes your argument worse. If you already have 5 and they aren’t be utilized, why add a 6th? I would tell you that I would consider a 6th when you begin to utilize the others.",
            "Our Dean, amazing person. Made our faculty quite literally the best one in the whole university and an amazing place to be as a normal student. He somehow always finds money for projects and digitalised very well every single document and legal process",
            "Did you talk with him about finding a robot arm, before you talked with vendors?"
        ]
    },
    "I just failed in 3 subjects...I feel devastated...my parents are ashamed of me..what should I do?": {
        "title": "I just failed in 3 subjects...I feel devastated...my parents are ashamed of me..what should I do?",
        "score": 269,
        "url": "https://www.reddit.com/r/EngineeringStudents/comments/1dl39zv/i_just_failed_in_3_subjectsi_feel_devastatedmy/",
        "content": "Pls help me. I'm an extc student.\n\nEdit: thank you so much everyone for your support and encouragement...I will surely give the exams and get good grades...thanks for reaching out guys.!!",
        "num_comments": 203,
        "comments": [
            "Hello /u/Key_Tumbleweed7328! Thank you for posting in r/EngineeringStudents. This is a custom Automoderator message based on your flair, \"Academic Advice\". While our wiki is under construction, please be mindful of the users you are asking advice from, and make sure your question is phrased neatly and describes your problem. ***Please be sure that your post is short and succinct.*** Long-winded posts generally do not get responded to. \n\nPlease remember to;\n\nRead our [Rules](https://www.reddit.com/r/EngineeringStudents/wiki/rules)\n\nRead our [Wiki](https://www.reddit.com/r/EngineeringStudents/wiki/index)\n\nRead our [F.A.Q](https://www.reddit.com/r/EngineeringStudents/wiki/index/faq)\n\nCheck our [Resources Landing Page](https://reddit.com/r/EngineeringStudents/wiki/resources)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EngineeringStudents) if you have any questions or concerns.*",
            "Welcome to engineering, where many fail subjects, try again, and still make it.\n\nYou can focus at the subjects you failed. But did you look at the ones you passed?\n\nAre you sure your parents are ashamed of you? Most parents wouldn't be.",
            "Just in: Engineering student who has no identity outside of grades fails classes and is now depressed",
            "Do you still want to be an engineer? Learn from your mistakes and don't repeat them.\n\nI've known people who have failed classes before and had to repeat an entire year. They still graduated. Hell, when I was doing my undergrad there was a class known for its high failure rate. The school had to arrange for a special summer class for all the students because there were just too many to repeat it next year with the incoming students.\n\nIt's school. People fail. The smart one will learn why and do better.\n\nSeriously though, sit down and really thing about what happened here. Don't just say you'll \"work harder\" like that will solve everything. Here are some questions you should ask yourself:\n\n* What were you having difficulty with? Projects, assignments, exams?\n\n* Did you understand the material? If not what could you do to learn better? Can you talk to your profs/TAs for help?\n\n* How well did you manage your time? Did you stretch yourself too thin doing extracurriculars? Too many pubnights?\n\n* Do you study/work by yourself? Can you arrange study groups?\n\n* Is you major a good fit for you? (I knew a guy who switched majors in his third year. He said it was the best decision he could have made.)\n\nAlso, talk to a counsellor if you need to.",
            "I had this happen to a Japanese classmate, who just got news that he failed an exam. He got hysteric, shouting things like \"I've dishonored my family!\" and then committed Sudoku right in the front of the classroom by solving random 5th order differential equations until his brain exploded.\n\nIt was very sad.",
            "The only way you really fail is if you don’t grow from the experience by gaining a new perspective and the motivation to improve as both a student and an engineer",
            "It's not the end of the world, take a deep breath and retake the subjects with a fresh perspective.",
            "Reflecting on your short comings and keep trucking along. Don’t beat yourself up too much. \n\nI failed 3 courses in my first sem, took 6 years to graduate EE. \n\nFast forward, 16 months internship experience, 6 months full time experience.\n\nAt my second job in embedded systems sector doing pcb design and embedded Linux making close to 6 figures full comp in the US. \n\nPreparing application for grad school (sub 3 undergrad gpa)\n\nAnything is possible, life is a journey where the learning never stops. Don’t give up",
            "Stop whining, and don't do the same thing twice.  Take some time to consider why you failed, and come up with strategies to make sure you don't do that in the future.",
            "You’ve indicated in some comments that you’re struggling with mental health. Mental health is no joke! You’re an adult, so your medical decisions are for you to make, not your parents. Please please please see a doctor about this! Lots of universities have a clinic on campus, maybe it’s something you could look into.",
            "Get new parents",
            "Hey man I did the same shit in mech eng and I’m going on year 6, we got this! together 👊",
            "Don't give up and keep going. Avoid distractions and focus on your studies",
            "I failed 4 classes in total. Retake, do summer classes, whatever it takes. Don’t worry about GPA. You’re going to get a good job, I just did 😀",
            "You need to chill out. Not the end of the World, actually totally normal. Just do them again",
            "I failed Calc 3 three times, dude. Fluid mechanics once, C++. I have a lot of F's.\n\nI'm currently attending an internship up in Vermont for a powerhouse in electric aviation tech. \n\nYou fucking got this.",
            "I'm going to be honest to help you out. Yes, you failed, and don't listen to people in this thread saying that you didn't fail and blah blah. You can't change the past, but you can definitely shape what comes next.\n\nA little about what happened to me:  \nI did Electrical Engineering and managed to graduate with honors after nearly failing in my first semester. In fact, during that first semester, I got a C+ in a math course. It wasn't technically a fail, but it felt like one to me. My GPA for that semester was below 3.4. This really got me down for a few days, but then I took it as a wake-up call. I recalculated the best possible GPA I could achieve if I got straight As for the rest of my degree—it was 3.93. Motivated by this, I completely changed my approach.\n\nHow did I turn things around? It wasn't easy, but I pushed myself to extremes. I reconsidered my study habits, breaking down everything into hourly tasks and daily to-do lists. I planned each week meticulously and stuck to my schedule rigorously. Using Google Calendar to manage my tasks was incredibly helpful. I made sure to focus in class, although initially, I could only digest about 50% of what was taught and retain just 20% when I reviewed my notes. To improve this, I used a technique called spaced repetition, which helped immensely.\n\nI made it a habit to spend all my hours after class in the library; this became my new normal after a month of practice. I started assignments early instead of waiting until the deadline. Collaborative problem-solving sessions with friends proved invaluable—never underestimate the power of studying with peers. When it came to exam preparation, I practiced explaining concepts on a whiteboard, a technique known as 'learning by teaching,' which is an effective way to solidify your understanding.\n\nI didn’t pull all-nighters during exams; instead, I made sure to get more sleep than usual. Remember, these changes won't show immediate results—it might take a month or more to see progress, but gradually, if you genuinely enjoy engineering, you'll start to appreciate this routine.\n\nMaybe try exploring same sub-space of habit changes that I did. They worked for me, and while everyone's different, they might just work for you too.\n\nBtw, I graduated with 3.97, as apparently they don't count my first year grade in official transcript. Your failure will be a lil bump in the road down the line, but to make it so, you must change your current approach.\n\nYou got this ;)",
            "Keep your head up. When I know that I can’t pass the class, I drop it for a W grade.",
            "Keep going",
            "yolo",
            "prepare for retaking it on summer",
            "My biggest mistake in engineering school was not developing good study habits. Like other clever people, I expected to read something once or twice and understand it; this approach will only get you so far. \nWhat worked for me were:\n1. Practice—homework is just the start. Find a Schaum’s outline, an online class, or something like Khan Academy that will give you more problems to solve.\n2. Study groups—engineering is a team sport, and studying with other students lets you clarify the hazy parts of your understanding. \n3. Office hours—professors are there to explain their subject, so make use of their expertise.",
            "Pick yourself up, make a good plan for the next semester and how you're going to catch up, including changes to your habits, present it to your parents. \n\nAnd then do it. \n\nAlternatively if you're early on, reevaluate and think about why this happened.",
            "Op. I have read a few of your comments about mental health struggles. Have you reached out to your campus resources for that? Many universities have some sort of counselor that could help you. You may also qualify for some academic accommodations depending on the your circumstances. I highly recommend looking into that. I did so recently and it has helped immensely. It just took that first step of finding out where to go and asking for help",
            "See why you failed, didn’t study enough? Poor study techniques? Didn’t understand the contents, once you breakdown why you failed, start thinking how to improve that, then build a REALISTIC plan that YOU can follow to not do the same mistakes next term.\n\nI also read that you are depressed, from experience it’s extremely hard to study with depression, i spent a few years studying like that, i had to study 4x more and barely understood shit, now that I’m better ( not depression-free ) studying is much easier, like some fog has been lifted from my brain. If possible, take a term or two to take care of your mental health; it doesnt mean you will ferment in your home 24/7, but look for a chill job, maybe volunteer somewhere, heal yourself while experiencing another side of life.",
            "That blows that you’re a legal adult (I’m assuming), and you’re letting your parents shame you. Are they paying your way through school? If yes, then I guess you gotta eat their shit… if no, then just carry on and persevere. If that’s what you even want to do. Are you studying to be an engineer because it’s your dream to pursue, or to please them? If the latter, you might want to have an internal dialogue to figure out your next move. Most likely, your parents will be gone from this world before you are. When they are gone, will you want to live the life they chose for you?",
            "Yooooo 5 times physics lab failure right here!!!!! Failing sucks and it hurts but I graduated. It's going to hurt and sting but I would really put others opinions in a small jar and write fuck off all on it. They don't know half of what it's like going to school in the world as it, they don't know what it takes. But you do and you got this Dude. Depending on your engineering type I may have my old coursework to help if you want I can google drive share it. But you are amazing and don't let this dull your spark:)",
            "Study more next semester. \n\nSeriously, crying over spilled milk isn’t going to magically make your grades better. Try working a little harder.",
            "Try again. Your parents aren’t the ones taking the shit— you are. Be proud of yourself first, then they can be proud of you alongside the masses when you finish your degree.\n\nIn the meantime, go handle business. Welcome to adulthood.",
            "Go to business school",
            "My department head had a sign outside his door that had a giant “4.62” and under it said “ask me about it sometime”. When I asked him, he said it’s the average number of years it takes someone to graduate in our program (Marine Engineering Technology). It’s a 4 year program. Personally I failed 3 classes, and dropped a few others to retake later and not tank my GPA lower more than it already was. I graduated I think with a 2.6 something gpa. I worked part time at a local bar, and parties/played videos quite a bit more than I should have, but you know what my job title is now? Chief Engineer. I get paid high 5-low 6 figures, and only work 6 months out of the year (week on, week off).\n\nKeep at it and you’ll get through it. Learn from your mistakes, and keep your course work for when you retake it, lots of professors re-use assignments and exams, so you’d be able to use what you already have to help you when you retake those courses. \n\nAlso Chegg was a saving grace for me, not to blindly copy answers, but to see how the problems were solved if I got stuck, and applied that to other practice questions",
            "Accept that you are a failure and cry about it. You don’t fail overnight and without having more context about your situation, I will just assume you did not have any extenuating circumstances that prevented you from studying or succeeding and you just fucked up. You will have to deal with the outcome, reap what you sowed.",
            "Here are some suggestions:\n\n* Take it as a learning experience. Everyone will make mistakes.\n* What should you do? Figure out what went wrong, and try to improve (study habits, being on top of assignments, how to take exams). Retake those classes as needed.\n\nHere are some specific things that worked for me: \n\n* Prioritize sleep. Staying up to study is not worth it.\n* Space out your work. Procrastination is your worst enemy.\n* Plan! Block out chunks of time for assignments/study sessions.",
            "Study for the next time",
            "They’re ashamed and they know so tbh it’s no longer than deep… go harder next them and be intentional about it",
            "3 subjects? And how many subjects have you applied? Maybe you are oversaturated. Try with 2 or 1..\n\nIf you fail again try again. And remember, the moment that you CAN'T fail is in the real world.",
            "Keep going.. you’ve only failed once you switch majors",
            "Everything passes. Just get back to it next semester, and life will carry on. Change your habits, or amount you are studying, or studying style. Talk to uni to get some help, apologise to your parents genuinely, and cope it on the chin. Because you did fail 3 subjects. But what of it? Just go back next semester with a new plan and carry on. Most people fail subjects throughout their studies, so don’t kick yourself too much over it. \n\nLearn from the experience, and don’t do the same thing next semester.",
            "Shit happens try again lmaoo",
            "Everyone fails assignments/test and some fail classes. Grow up decide if this is what you want and then redo the classes.",
            "Shit I failed Material Science & Thermodynamics but I know for sure i’m not gonna quit because of it.",
            "Don't beat yourself up dude. I always say, \"the only time you fail is if you don't learn something.\" \n\nKnow you know what you need to work on in order to pass next time! \n\nNo one does everything perfectly the first time. It's totally ok to need to try a few times before you get it.",
            "Pick your chin up bro. Engineering takes all of us for a shitty ride. You just gotta try and try again. I failed four subjects in one year. Had to add a year to my studies to catch up, but now I am almost done and thriving at my intership. You might feel dumb now but you aren't. You got this bro\n\nThe most important is to try again and learn from mistakes",
            "Study..\nYou may have gotten away with not studying in school. But it doesn't work for a degree.\nIf you did study and ask your teachers and peers for help and still failed. Well, I would suggest maybe looking at another degree or career.\nYou won't find a quick fix here on reddit. Put the work in or be realistic and look for a different degree.",
            "Get new parents? \n\nYou failed. Learn from the mistake and fix it. It’s not the end of the world and if your family doesn’t support you I’m sorry. \n\nI know you’ll do great things and you won’t even remember failing.",
            "“What did they call the last Dr. to Graduate?”\n\n“Doctor”\n\nKeep at it.",
            "You keep going. Learn and adapt but never give up. Ignore the external noise. You got this!",
            "I'll give some bad advice that nonetheless seemed to work for some people I know. If stress and self doubt and self criticism seems to be what's holding you back, you're not finding the right distractions. Party more. Smoke some pot if it's offered to you. Go on some dates and maybe even have some casual sex. Go to campus events. Sneak off with friends for a weekend to see a show. Change your hair color and dress weird. \n\nA full course load is designed to require about 40 hours of \"effective\" work per week to get mostly A's. Self doubt and depression has a tendency to make your study time less effective for some people. You can spend 10 hours studying and not learn anything. Don't bother studying if you're not prepared to put everything else out of your mind and work efficiently. That's why I say you might have other things you need to get out of your system in order to reduce anxiety. Engineering classes are stressful and not always enjoyable for most students. You need to find time for other interests to help give you something to look forward to. Maybe you end up finding something you're more interested in and switch majors even. \n\n\nYou should probably ignore everything I said unless it really resonates with you.",
            "Easy. Don’t give up. ",
            "Brother, I failed so many exams throughout my degree. During covid I had a year were I passed a single subject. I got my personal situation fixed and ended up graduating with an above average grade and landing a job with above average pay. You can do this. If it wasn't tough ever I would be an engineer. I believe in you.",
            "Can I take a wild guess and assume that you are an Indian? If not Indian, then most likely East Asian",
            "Why would your parents be ashamed for their student to fail three SUPER HARD classes!?!?\n\nI failed Calc 1 my sophmore year, and now this past semester I passed with a C in Differential Equations/Linear Algebra.\n\nDon't give up!",
            "I'm a parent and I'm 100% certain they aren't ashamed of you, they are ashamed of themselves.  if your parents aren't proud of you then I am. \n\nEngineering is not the easiest.  And not all teachers are the same. Engineering 101 at school A could be the same as engineering 101 at school b, except the teachers are not as helpful.\n\nDon't blame yourself, unless, of course, you are to blame. if you try your hardest every parent will be proud of that.",
            "Know that you are not alone! I also failed three classes before getting my degree. However, I still managed to graduate in 4 years and get a great job straight out of college! Don't lose hope! \n\nYou have a few options right now:\n\nTough it out: Stick with your current degree and current university. Keep studying and retake the classes you need. You are already familiar with the material, so it will be easier the second time around. Make study groups and do your homework with other students if you can. That's the only way I got through some of my toughest classes.\n\nChange your major: What are you studying right now? A lot of degrees have overlapping courses. Is there a major that does not require the courses you just failed? I.e. At my school, we would have a lot of students that switched from CS to software engineering to avoid taking discrete math. Similarly, I decided not to major in ME after failing statics.\n\nTransfer universities: This is what I did. If you are worried about your GPA taking a hit, this might be a good option for you. When my transfer credits came in from my old university, they just showed up as pass/fail and didn't influence my GPA at the new university! The GPA I graduated with was only from the classes I took at my new university, so I didn't have the failed classes wrecking my GPA. I graduated with a 3.8/4 GPA despite failing 3 classes at my old university!\n\nIf you are worried about taking an extra year from failing classes, you can take summer classes to make up for the lost time.\n\nYou got this!!",
            "You have similar situation to mine. Chem Eng graduate here. Though I only failed 2 courses in my undergrad. My dad was furious when I told him I failed English course in the first year and pressured me more than a year. He doesn't know the second one. In 3rd year, I failed \"intro to thermodynamics\" but I didn't tell this to them and somehow kept it as a secret. Now everything is perfect, I just graduated and have a job in local research company.\n\nWhat I suggest for you is to try to learn stuff everyday, even it is not related to your courses. It will create a habit of learning for sure. If you give yourself sometime with courses, I am sure you will pass them at least with B score.\n\nP.S.: I am in Caucasian region so some stuff might be different but my uni was not a joke and has kind of the hardest degree program in the country.",
            "Some great suggestions of studying more and working harder. Don't forget to play and have fun that's how we learn and retain information as well.\nMaybe build some balance to your schedule some gen Ed's or club that excites you. Improv Comedy classes, scuba diving, 3d sculpture, maybe a hiking or outing club. \n\nIf you can stick with engineering go for it but there is a huge world out there if you have good people skills and can do what you say you will how up on time and you'll always be able to find work.",
            "It's okay to feel disappointed, but remember that failure is a part of learning and growth. Focus on understanding where you went wrong and seek help from teachers or tutors to improve. Break your goals into smaller, manageable tasks and stay consistent. Communicate openly with your parents about your plans to do better, showing them your commitment to improvement. Most importantly, believe in your ability to overcome this setback—your current situation doesn't define your future success.\nContact me for more guidance. Check bio.",
            "Carefully analyze what went wrong and why you approached the semester the way you did.  Then look for a solution, what can you do to improve?  Are your studying methods working?  Failing a class sucks but it’s also a learning experience.",
            "Yeah dude, I hope you aren’t feeling alone because I got kicked out of school cause of it. Tried to take my life, but I’m continuing to push through and try again because I know I can make it and so can you. I’ll pray for you and your journey with engineering! 🙏",
            "Either change your major or just get back to it in engineering up to you",
            "ive been in this kind of situation before. what ive learned is that its okay to be depressed and ashamed for a little bit after exams. although im hating myself, at the same time im relieved to be done with exams so i can put some time to myself for healing, like watching anime, playing some games, practice an instrument, eating comfort food, or anything to make me feel better bit by bit.\n\nafterwards, i backtrack and identify what i did wrong and where i can improve, so next time i beat it into myself to not repeat the same problem.\n\npart of success is failure, as well as getting over your failures. ive failed 5 courses in total, not just for my major but for my minors. now, things are looking good, im at a competitive GPA, and if i keep stable I graduate with my major and 2 minors this December in only 4 years of studying. \n\nEveryone has their own journey man, just stay determined🔥",
            "Just curious, hasn't school let out?",
            "Time for new parents",
            "Doesn’t matter how long it takes, just finish man. My biggest piece of advice is to make friends in class you can study with. I had a 2.7 gpa and made straight a’s last semester solely because I made friends and didn’t go at it by myself",
            "Try again. Some parents think anger and shame are the way to go - they are really not.",
            "People on the outside probably won’t understand, but I bet your professors and classmates would have a lot more respect for you pushing ahead and passing next semester than if you just gave up",
            "Study something you like.",
            "You only failed if you don’t try again",
            "honestly it’s fine. it’s okay to fail sometimes and people forget engineering is hard. i’m also asian so i get the parent thing😭😭but keep on working hard. it’s gonna pay off at one point. just don’t give up especially if you don’t have another plan. my advice is go for consistency instead of motivation. even if you don’t want to study try reading one sentence or one task at a time. don’t get overwhelmed by the amount of work. it’s better to at least do 5% of the work than none.",
            "Your parents are ashamed because you failed 3 subjects??? Consider going to therapy or even no contact. They sound insanely toxic. \n\nThis is not an engineering or studying problem. This is a huge parent problem.",
            "I was in a similar boat. I'm answering as a former engineering student and current engineer who has had this subreddit appear on my fyp. \n\nI was incredibly depressed and lost my freshman and sophomore years of schooling, what got me out of it was finding a subject that I genuinely understood and I think that will play a role for you too! Has anything been interesting with your studies? Any time where you've used the math and been like \"wow if I know this, I can always know these aspects of the system!\" My advise is to find something where the math to find some kind of part of a system feels interesting and like magic where youre interested and you want to learn more! For me it was structural analysis and dynamics but I'm sure you'll have something and the beauty of engineering is it's so versatile that it could be anything your mind thinks of!\n\nI hope I didn't prattle on too long and I wish you the best of luck in your engineering career if that's where you want to go! The most important part will be the drive to learn more, not just for studies but for professional aspect too",
            "Lock in next semester",
            "Consider sewer side",
            "I failed in 4",
            "What classes were they?\n\nUse this time to reevaluate what you could do better when you take these classes again. Read the textbook more. Practice more problems. Review your lecture notes, and make sure they have enough details to help you solve problems and understand key concepts. Try homework problems yourself using only your brain and your notes, BUT if you use something like Chegg, make sure the solution is CORRECT and that you actually know what you’re doing instead of just copying. Understand the formulas and *when* they are used.\n\nAlso, you are not alone in your struggles. Find opportunities to work with your classmates (without violating academic dishonesty policies). Studying in a group is way more enjoyable, especially before exams. Take advantage of the professor’s office hours too; he/she will hopefully walk you through things you don’t understand fully.",
            "Try again, plenty have deal with the same. Dont let it break you and overcome. Maybe take less classes to help lessen the load",
            "Hope you’re able to overcome it",
            "!remindme 4 years",
            "lock in",
            "They say cheaters never prosper…id beg to differ",
            "Drop out",
            "What is an extc student?\n\nAnyway, if you are truly interested in engg then retake the courses and do well, if not change your major to something else you like and will do well in.",
            "Admit your fault and do better next time. Don't bullshit, don't lie, don't beat around the bush, face it. \n\n-the bottom is advice \n\nFirst of all...3 subjects failing.\nIf it was 1, it's understandable. If 2, then something big must of happened but 3 or 4, something major must of had a effect on you.\n\nIf you have had nothing happen (no grief, medical or other issues) and your semester was going fine. I will be disappointed too. What happened bro?\n\nYou shouldn't be posting \"I'm incompetent in what I do and now I'm facing the consequences\". Instead be posting, how you could learn from it and get better grades.",
            "If you want to be an engineer do some problem solving.  Why did you fail?  What would have to be different for you to succeed?  Start with that.",
            "You most likely failed not because you are stupid or incapable, but because you didn't study enough or in the right way.\n\nMost universities have side classes to help struggling students learn how to study, schedule their time, and take tests. You probably think you already know how to do those things, and you do to some extent, but just go to a class like this anyway.\n\nFind this type of resource at your university, go to the weekly seminars about how to study, and **do what they tell you to do.** If you do this, I promise, it will get better.",
            "Keep trying and try harder, happens to everyone bro",
            "You have 3 options:\n\n1. Drop out\n\n2. Go back and try again\n\n3. Suck the profs dick (results may vary)",
            "Honestly, it depends on what you failed.\n\nIf it’s the prerequisite courses like electricity and magnetism, calculus 2, linear algebra then we have a problem.\n\nIf it’s more advanced courses like dynamics, statics, control systems, signals and systems, electronics then you should not feel bad, it’s more valuable to genuinely understand those courses than the number of times you fail them.",
            "Maybe OP is Asian who knows",
            "Yeah.\n\nI failed every single subject on the first semester of my master's degree. It wasn't even because I was bad at the material; I simply sucked at studying. It was right on the tail end of corona, and my study ethic was absolutely devastated.\n\n5 courses. 25 ECTS points total. Didn't get a single point. (Though I did get the 5 points from the summer course, which is technically part of the same semester).\n\nI then proceeded to only earn 15 points in the following fall, putting me 40 points behind where I was supposed to be at the time, and losing my state-funded study support (you can't be more than 30 points/one semester behind). But in the next semester, I took a few extra courses and passed a bunch of re-exams, putting me back at only being 30 points behind, and I managed to keep it like that for the rest of my master's programme. I'm handing my thesis in in two weeks, and then defending it a week later. Half a year late, yes, but I'm making it through and actually got pretty good grades on many of my courses.",
            "They are ...I feel sorry...I tried my best but now ihave to work harder",
            "Most parents wouldn't 🤣🤣🤣🤣",
            "Yup , I failed plenty of times but I kept at it. Now I graduated and start work at a great company soon. Just keep being persistent and it will pay off regardless of what people think.",
            "In most places I'm aware of failing three times means you are out of the program...",
            "HAHAHAHAHAHAH\n\nsame",
            "I am feeling attacked lol",
            "Na mate..ihave been depressed for like 4 years now...but parents don't get it",
            "My kin my brethren",
            "It's like I am not interested but I have to do it",
            "Sudoku 😂😂😂",
            "Many such cases",
            "Sudoku but instead of just numbers it's variable ls",
            "Can confirm this did happen.",
            "Yes I will work harder now ..thanks",
            "let him whine a bit please , then work",
            "Yess I am going to see psychologist soon...thanks mate.",
            "Aah I wish I could 😭",
            "This is the perfect response...thank u so much mate 😄",
            "Can you send me your schedule ?",
            "Thanks mate",
            "Thanks mate..",
            "I'm an indian 😅",
            "Yes thanks mate",
            "I worked very hard but I still l failed...maybe coz my method of studying wasn't efficient..but I will work more efficiently now.",
            "Thanks for the suggestions mate ☺️",
            "Idk what I will do...but I will be better hopefully ..my mental health has been shut from past 4 years",
            "Thanks mate...this actually gives me hope",
            "I wish",
            "Yes I have some good frnds...but I feel a little ashamed",
            "Yes thanks mate",
            "I'm not giving up...also the professors and classmates don't care",
            "Idk what I like tbh",
            "True that",
            "I agree...they are supportive sometimes...but I don't feel loved enough from them...they just keep being angry",
            "Nothing seems interesting in my degree tbh",
            "How did u cope?",
            "Thanks mate\nMath \nChem(I was certain I would pass...but idk how I failed...my exam was good)\nEngineering drawing",
            "Yes gonna bounce back",
            "Yes I will fs",
            "Electronic and telecommunications",
            "Thanks mate",
            "Yes I ain't giving up",
            "2 is the best 😭😭😭",
            "Stupid ass take. Tons of people fail prerequisite classes like that and go on to be good engineers.\n\nIf you’re studying 40 hours a week and are still failing but that’s probably an indication you’ll do bad, but a lot of people are not able to no life school for 4 years",
            "Most people have a harder time with the prerequisite classes because it's completely new. The latter classes you say are harder have actually been easier for me because it's building on a foundation. They might not be easy in general but easier to use what I've learned than learn something totally new.",
            "Yes I am",
            "Us asians are always pressured 😿 \nI recently got my second B that lowered my gpa and that was a result of not working harder than I did",
            "Don’t work harder. You’re an engineer, work more efficiently.\n\nTake notes of what you understood well in those subjects.\n\nThat way, once you try again, you can focus on what’s missing.",
            "Me too🫡",
            "Dude focus on your mental health first",
            "Me too darg \nMe too \nYou aren't alone. There are so many of us failures loitering the engineering sector you'll be fine",
            "Then I have to ask: why are you in engineering? It's not going to get any easier. And when you graduate, you'll be looking for jobs in the same field.\n\nYou don't have to major in something that doesn't interest you, or that you don't see yourself having a career in. I know that family pressure can be immense, but this is your life, not someone else's.\n\nTalk to your school's mental health program. See what support they can offer you. I had problems of my own when I was in grad school, and talking to a professional really helped.",
            "Take my advice, I was in the same position as you, didn’t want to continue but forced myself to graduate. It is one of the biggest regrets of my life, I hate engineering as a practice but the career and the pay is even worse.",
            "If you’re able to, I’d recommend switching even if it means you have to drop out. Easier said than done since it seems like your parents aren’t the most understanding or reasonable types, but maybe you can consult with a career advisor at your school to help you explore paths that may be better for you.\n\nEngineering isn’t going to be easier despite what people say. You definitely need to have some interest in it especially as you go higher up cause you’ll need to spend a lot of time doing engineering-related stuff and meetings.\n\nI wish you the best of luck no matter what you decide to do, but don’t get tied down to what your parents want you to do. I feel this, so I get where you’re coming from.",
            "Then you should do something else cause you probably wont get a job with that attitude and you wont retain any of that information youre being taught in school",
            "you don’t have to",
            "Biggest lesson I’ve learned in engineering is that working harder isn’t the golden solution. Yes working hard is a requirement, but learning how to learn more efficiently is what these classes force you to learn. Working with others and seeing how they get things done will teach you a lot and make learning easier.",
            "I have no doubt you weren't working hard last semester, but your approach didn't work.  That's ok. If your parents are shaming you, be happy they care, but it's not a productive way to get you to do better. What could you do differently next semester?  What did you struggle with? Not in an academic sense, but in more of a school sense.  Did you have low test scores? Trouble turning homework in?  Just didn't feel quite right?",
            "Try to solve this problem like an engineer. I brute forced myself through most of my Bachelors program and looking back, that wasn't the most efficient way of finishing it. Find out *why* you failed, don't just toss more work hours on it if that wasn't the issue.",
            "I just failed a subject! I’m not upset about it it just means I get the study the subject harder and maybe learn more than the people who passed! They say if you pass first time in your driving test you will be a worst driver than the people who pass the second time. Don’t put yourself down you got this far because you are not stupid don’t let it get you down. Be clam and composed find out you strengths and weaknesses and focus on studying the areas you are weaker in! You got this dude!",
            "I'm a girl😅",
            "Seriously - I was emancipated at 15 more or less and ended up working and studying, settling in to year on year off, failed some shit and eventually graduated in EE after 9 years.\n\nDue to having children I've sort of reconnected with parents (who are seperated) and just a few weeks ago was at my mother's and she made some snide comments of how I struggled thru my degree (not mentioning I got zero support). She's clueless, and I just ignored her. To be studying engineering at all, you are probably in the range of top 10% to top 1% academically, but skills of application figure heavily.\n\nBut in that near decade it took me, in years off, I worked in the mines, became a surveyor, ditched that, then did embedded design and then software development, ended up graduating with a bunch of experience in diverse areas.\n\nYou've probably unaligned your next year, if not two, to get back into full pattern, and might have some spare time, take the opportunity to get some experience.\n\nAnd remember, it's not how you fall down, it's how you get up that defines you.",
            "I think the perfect response is 42 ...",
            "Lol classic Indian parenting and EXTC jargon makes it very apparent.",
            "I failed digital logic in the spring I’m taking it this summer half way through I got a 96 this time in the spring I had a 55 I think",
            "Is there anything at all in the world that you are interested in learning through mathematical models? Like computers or how numerical models are made for gamed or buildings or chemistry? The degree is one thing but you, as an engineer, are much more than your degree or grades.\n\nI guess the question is, is there something in this world that you are curious about enough to want to learn more about it?",
            "I dropped out of chemical engineering and restarted mechanical engineering and graduated 5-6 years ago. Undergrad is a roller coaster ride for everyone, manage your time wisely and you will get it done.",
            "Me with trig and precalc and soon to be calc in the fall",
            "Damn I was joking, hope you good fam💀",
            "Are you doing it for them or for yourself? I have Asian parents too and I didn't start thriving until I stopped gaf about what they think is good or bad.",
            "That's correct ..I will work more efficiently..thanks mate",
            "I try to...but it's just getting worse",
            "Yess",
            "Yes I'm going to do something about this..I really think I need to change my major.. thanks mate",
            "I don't even know what to do...I'm just doing bcoz I have to",
            "Yes maybe my approach wasnt correct...also have been feeling mentally sick for 4 years now..but my parents don't get it",
            "oh sorry! anyways by all means whine girl!  It's useful to be tough in engineering however a good cry never hurts nobody.\n\nThen hit them books again!",
            "42?",
            "Sadly",
            "I am interested in finance but not sure if I'm smart enough to do it",
            "Not really...but I will be fine .. parents are super angry",
            "Idk...it's like I just did what they said..bcoz I'm still not sure what to do in life or what career I should pursue",
            "Form study groups, engineering is not something you should be doing alone. That is the best way to make friends and learn from one another.",
            "[removed]",
            "Switch to comp sci it’s easier",
            "you don’t have to do engineering lmfao",
            "Douglas Adam Hitchikers Guide to the Galaxy lovely book series.",
            "Okay, like what aspects of it? Like financial analysis or economic engineering? I remember how much fun it was to learn all cash flows can be brought back to a single time instance using interest. There is a lot of conceptually interesting things in it and you're certainly smart enough, it just takes some drive to learn it! \n\nAs I remember, at least in my Alma mater, all engineers had to take engineering economics and some had to take more business classes. If that's the route you think is for you, maybe that's the way for you to go!",
            "Who cares?",
            "Us bro us 🥲",
            "Keep your head up and try harder the next time you retake. Asian parents will be angry at anything. I graduated but my parents still bring up the fact that I got a B in calc lol",
            "Different subjects or you’ve failed the same subject? Failing different subjects is gonna happen, but the same subject should eventually come down to your study habits or if you’re studying correctly",
            "Well that's a question you need to ask yourself. If you're just doing engineering because they think it's a good career you're going to be miserable. If you genuinely like it, it might still be hard but there's more intrinsic motivation to do well and learn.\n\n\n My parents wanted me to he a doctor so much so that after I finished my masters in aerospace engineering they kept asking me to sign up for med school and mcat.\n\n\nBut I knew that shit wasn't for me. I did 7 years of undergrad because I spent my first 2. 5 years banging my head against classes I just couldn't stand. Microbiology, ochem, biochem etc. Boring af to me. Through sheer will power I got through the classes with decent grades but I was miserable.\n\n\nYour still young take the time to find what you want to do in life and don't let your parents run it. With that being said don't be disrespectful to them most parents are probably not aaasss bad as mine where I had to cut them off. Asian parents feel like their doing everything in your best interest even if you don't think so and will see your defiance as a betrayal. Communicate to them that you appreciate everything they've done for you and to achieve your potential you need to decide for yourself.",
            "The real engineering was the friends we made along the way. \n\nBut seriously, Bill Nye once said “everyone knows something you don’t.” Which can apply to this context. Maybe one of OP’s classmates knows the answer to a problem and can explain it in a way that makes more sense to them than what the professor or textbook says. \n\nAlso seconding on it’s the best way to make friends, some of my favorite college memories were midnight snack runs during a long study session before a big exam.",
            "dude wtf",
            "corny ass",
            "Ur such a loser lol",
            "Please review the rules of the sub. No trolling or personal attacks allowed.  No racism, sexism, or discrimination or similarly denigrating comments.",
            "Naa it's too oversaturated",
            "Atp idk what else to do..I'm afriad",
            "Financial analysis mostly..",
            "This, they are not the ones putting the effort and struggling to get a degree, they do not know, to me their oppinion is moot",
            "This right here.\n\nOP needs to do this for himself.  NOT because of or for their parents.",
            "Different",
            "Come to Data Science",
            "dude grow up lmao",
            "It seems like you have a good starting point then! I would talk to your advisors to see if there is anyway they can help you to take finance related tech electives then if you want to stay within engineering. You'll still have to do the other engineering classes but I would imagine it's more enjoyable for you then if you have some classes you like then",
            "They probably pay but ye fair point. It's honestly the main reason I don't tell my mom my grades even if I'm doing well, unnecessary stress and expectations. She'll know when I'm finished or least she'll see the final results.",
            "Do u think I should change my major? And quit engineering",
            "Exactly. My mom doesn’t pay for my school and my freshman year she tried to get on my ass about bad grades. Shut that down very quickly and now we have a very chill telationship in regards to school and I’m just truthful about how things are going. She doesn’t care because it is not her business",
            "Truly, it's more a question for you than for me. \n\nFinancial analysis is absolutely something you can do with engineering and a background in engineering can only ever help you is my POV, especially if maybe financial analysis doesnt pan out as you desire. However, it's a lot to ask of someone. That's why my view is to stay if you can but try to tailor your course load into the financial areas if possible.",
            "This is the way. Dealt with this early on when I first went to college out of high school. Life happened, some relationships no longer exist, eventually went back on my own accord and finished my bio degree, and am now finishing my engineering degree. Never felt more free. College should be experienced with as much freedom as possible imo"
        ]
    },
    "i hate chemistry but need to pass my tests, what can i do?": {
        "title": "i hate chemistry but need to pass my tests, what can i do?",
        "score": 37,
        "url": "https://www.reddit.com/r/EngineeringStudents/comments/1dlcdrt/i_hate_chemistry_but_need_to_pass_my_tests_what/",
        "content": "as said in the title, i absolutely despise chemistry and just sitting all day studying for my retake exam makes me so mad. any tip to study a subject you hate? ",
        "num_comments": 29,
        "comments": [
            "Hello /u/nebelposer! Thank you for posting in r/EngineeringStudents. This is a custom Automoderator message based on your flair, \"Academic Advice\". While our wiki is under construction, please be mindful of the users you are asking advice from, and make sure your question is phrased neatly and describes your problem. ***Please be sure that your post is short and succinct.*** Long-winded posts generally do not get responded to. \n\nPlease remember to;\n\nRead our [Rules](https://www.reddit.com/r/EngineeringStudents/wiki/rules)\n\nRead our [Wiki](https://www.reddit.com/r/EngineeringStudents/wiki/index)\n\nRead our [F.A.Q](https://www.reddit.com/r/EngineeringStudents/wiki/index/faq)\n\nCheck our [Resources Landing Page](https://reddit.com/r/EngineeringStudents/wiki/resources)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EngineeringStudents) if you have any questions or concerns.*",
            "Take your anger out on it. Get petty and study that prick so much chemistry doesn’t like you either",
            "Study unless you want to retake it again lol",
            "Specifically for chemistry, try online videos like The Organic Chemistry Tutor who does a great job at explaining things.  Generally speaking for classes you hate, put some nice studying music that you enjoy that might help.  For studying do problems and try and understand the concepts (DON’T MEMORIZE).  My fluids professor once said that one way to study is by trying and explain the concepts to a rubber duck.  Literally do that, get an object and explain the concept as if you’re the professor.  I do this all the time and it helps a lot",
            "Honestly if you haven’t really, look for really good lecture/courses online, also better textbooks, I found that if you have good teachers most subjects are not that bad and are kinda enjoyable",
            "I failed the first time because my prof was trash. I found out after like 30% of the class failed... The ones who didn't took chem before. So what I did was made sure I was in the best profs class.",
            "cheat",
            "What do you dislike about it? I always thought it was cool because it involves math and physics.",
            "Find a way to make it more fun.",
            "Convert the hate energy to study energy.",
            "Remind yourself that if you pass the chemistry exam, you will never have to do chemistry again",
            "Chads prep YouTube and he has a website",
            "khan academy",
            "General Chemistry was the biggest weeder class at BYU for science/engineering.\n\nMost failed class at BYU. It stops freshman dead in their tracks.",
            "Get used to having to study/do stuff that you don’t like. If you don’t, good luck with the rest of your life.",
            "Cheat!",
            "Cheat?",
            "Find something adjacent that you enjoy the has ties to chemistry. For those electrical engineers learning how silicon is turned into transistors by doping with phosphate and boron.\n\nFor those mechanically inclined, the crystalline structure of a clean sheer being full of ridges and valleys or the amount of carbon mixed with iron to create steel. \n\nInstead of looking at numbers look at situations.",
            "study?",
            "As one brilliant woman put it \"Apple bottom jeans, boots with the fur.\"",
            "Try taking it online at a different university then transfer it to your university (if your university allows that). Look around and compare different syllabi from different schools. \nI struggled with General Chemistry 1, when I took it under UND online. Later I enrolled for it under MCPHS online and aced it. \nIt's surprising how the same course can feel easier when taken elsewhere. The content was the same, just different grading styles (at MCPHS the final exam contributed less to the final grade, making the course easier to pass).",
            "You know what's worse than a subject you hate? Having to take it twice.",
            "this might work! thank you",
            "This is a pro of having ADHD combined with the knowledge/experience on disciplining yourself properly.\n\nOnce you get that fucking shit going you will not stop, because you realize that once you stop you lose momentum. \n\nI personally really hated building physics (architecture/building engineering), where I had to calculate heat / moisture / acoustics / light / air quality etc etc. The subject itself wasn't too bad (I loved studying/designing for acoustics and sun light for example) but man, ESPECIALLY certain thermodynamics and fluid dynamics broke my brain. It was so awful because it was boring to me. Long ass equations that I had to study just to calculate if some damn moisture would end up on the interior of a certain house in certain conditions.\n\nAnyway, what ended up happening is that I managed to lock myself into the work that I had to do. It can become really stimulating at some point, at least for me. This only happens if I'm able to narrow down my attention to only do the stuff that I gotta do.\n\nFew things I want to share with OP:\n- (if you have ADHD) Sip on something like an AA / sportsdrink while you're studying. Supply your brain slightly with some glucose, it helps focus (don't over do it, you don't want to spike your insulin too much)\n- Take noörtropics. Here are a few you could look into: piracetam / alpha-GPC / noopept / rhodiola rosea / L-Theanine (basically tea) / L-Tyrosine (basically protein shake)\n- between every hour of studying (or whatever interval you prefer), stop what you do and just stare at a single point in your room for a few minutes. This will feel like you're being unproductive, but you're actually being WAY more productive than you could possibly be. Your brain will start to re-activate the neurons that you forced to activate when you were learning. (This also happens when you sleep!! If you're capable of studying late into the night, going to bed right after helps with retaining info! Same as taking a nap)\n- contrary to sleeping, getting yourself in a situation where your adrenaline spikes also makes you better at retaining information that you learned right before this adrenaline spike. So going for a workout / consciously placing yourself in a stressfull situation (like a cold shower) right after studying could help aswel.\n- (if you have ADHD) test your knowledge on the subject you're studying over and over. I personally cant study if I cant test myself. Testing myself is where my motivation comes from, because it tells me Im on the right track or it tells me I need to change things up drastically. Without the ability to test myself i tend to get very lost",
            "lol that might do it. Pretty risky though. Getting caught cheating on a Chemistry exam is a sure fire way to hate the subject forever",
            "I’m confused as hell about this, I’m about 2/3 through gen chem 1 rn (summer class) and so far it has been incredibly easy, although I have a pretty good professor\n\nI’ve always heard calc 2 was the biggest weeding out class",
            "He has nothing to lose, like asking a girls number",
            "Yeah lmao. My biggest achievements in my life have been acing calc 1/2/3 after failing terribly at it.\n\nI went to a very low-education-level highschool and never had actual mathematics before I went to study building engineering at age 21. That has been probably the most humbling experience in my entire plife. Students 3-4 years younger than me thinking it's easy calculate multivariable equations using partial derivatives and multiple integrals etc etc. Meanwhile I've actually never properly understood how to fucking divide something by itself lmao. I had no concept of rules in the mathematical language. This was a pain beyond words to describe.\n\nI managed to get it done tho. If I can, OP definitely can"
        ]
    }
}