{
    "Sean ‘Diddy’ Combs erases all posts on Instagram — including Cassie assault apology video": {
        "title": "Sean ‘Diddy’ Combs erases all posts on Instagram — including Cassie assault apology video",
        "score": 184,
        "url": "https://pagesix.com/2024/06/21/entertainment/sean-diddy-combs-erases-all-posts-on-instagram-including-cassie-assault-apology-video/",
        "content": "",
        "num_comments": 20,
        "comments": [
            "Seems a little late for that",
            "Feds about come for him",
            "Ohhh boy...he knows the internet never forgets, right?",
            "Diddy is probably on a plane to Switzerland",
            "and so it begins...",
            "That’s okay. First has a backup.",
            "The feds raided his house to collect and cover up evidence of any documented crimes from the higher elites, not to gather evidence for his incrimination…he will go down but is definitely low on this rings totem pole",
            "My guess is he wants to erase anything he’s said that was more damning or would potentially make him look like a hypocrite.\n\nDude has more than enough Fuck You money to just disappear into the sunset and live very comfortably.  But he also has a legacy he wants to keep alive.  \n\nEgo is a powerful drug, especially for a celebrity who has gotten away with all the shit he has for so long.  He’s not going to back down.  He will claim innocence regarding the major accusations and give backhanded apologies for the others.  \n\nArdent fans will back him up no matter what so it’s just a question of how many of them are out there.  He may have enough that he keeps his career alive à la Chris Brown.",
            "Hopefully he got it all down before anyone saw it. /s",
            "They forgot that talentless shmuck Travis scatt.",
            "Waybacktimemachine never forgets",
            "Oh you mean like the videos of politicians doing drugs at his house?",
            "Disappear and live comfortably? The guy’s getting indicted any day now. I highly doubt he’ll be able to ride off into the sunset.",
            "Bet he wishes he could erase the Act Bad video… yeesh",
            "Also Chris Brown. Fuck Chris Brown.",
            "The internet didn’t forget what Chris brown did, the music industry did."
        ]
    },
    "Man who bought Kurt Cobain’s Mustang for $4.5m says it “doesn’t make any sense” that the Nirvana frontman’s Martin sold for $6m": {
        "title": "Man who bought Kurt Cobain’s Mustang for $4.5m says it “doesn’t make any sense” that the Nirvana frontman’s Martin sold for $6m",
        "score": 2235,
        "url": "https://guitar.com/news/music-news/man-who-bought-cobains-mustang-cant-understand-cobains-martin-sold-for-6m/",
        "content": "",
        "num_comments": 261,
        "comments": [
            "that guy obviously didn't make his millions by being smart.",
            "That Martin is a classic with very few available. As Kurt added controls to the guitar this made it unique. The fact he played it on unplugged - priceless",
            "Did he have a “main” Mustang? He was known to bust them up.  The Martin is unique, and used in a performance that is likely listened to/watched the most today.",
            "It's not like it was Jon Voight's Lebaron.",
            "Millionaires discuss price differences on items that should be in a museum or with his daughter. Who cares?",
            "Cobain would be absolutely mortified his belongings sell for millions of dollars to billionaires.",
            ">The $6 million Cobain acoustic was once in the custody of Cobain’s daughter, Frances Bean Cobain, but her ex-husband received it as part of her divorce settlement.\n\nWell, that's pretty fucked up for him to go after that guitar and a judge to grant it. It should absolutely belong to Frances",
            "His Martin is more unique. It’s a 1959 and the fact that he did an acoustic set with it is legendary. It makes a lot of sense.",
            "anyone else think Ford Mustang, and Aston Martin? 🤦‍♂️",
            "Irsay has spent more on pills than both these guitars combined.",
            "I thought we were talking about cars",
            "someone call the whambulance",
            "Something is worth what others are willing to pay.",
            "Kurt played a 1959 D18 Martin guitar on unplugged",
            "Y’all know they’re talking about the Fender Mustang electric guitar yes?\n\nNot the Ford Mustang car",
            "Rich man's problems.....which guitar is worth more millions...",
            "Literally stuff like this is why he killed himself.",
            "Handmade Martin vs. machine made Mustang.",
            "I mean the unplugged set was so iconic though",
            "Play me a song on your car",
            "Fender, if you’re listening, others want easier access to left handed mustangs",
            "Imagine complaining that you didn’t get to overpay for a guitar because you already overpaid for another guitar. Rich people problems.",
            "Glad they included a pic of the car",
            "Ahh yes. Kurt Cobain. Famous for driving Mustangs.",
            "I don’t think he understands guitar people.",
            "So weird because everybody knows Kurt as a famous Mustang driver.",
            "Hey my buddy got to play that mustang.",
            "Jim Irsay hasn't been told to fuck off enough.",
            "Imagine being this out-of-touch nepo baby and having the time to complain, much less think about the difference in price of two famous guitars. \n\nMust be nice.",
            "Makes a lot of sense actually",
            "Do we really care what some wealthy guy’s opinion is on anything?",
            "Jim Irsay who owns the Indianapolis Colts Jim Irsay? In that case, this checks out.",
            "🎶I find it hard, just hard to find the will whatever neverrrr mind🎶",
            "Cobain once talked about being offered a deal for one of Elvis's guitars, but he turned down cause it was too much money.",
            "Kurt would be ashamed of you",
            "Going to hell, but maybe it has blood on it.",
            "It's kinda funny, because in the Unplugged concert he made a joke about Leadbelly's guitar selling for $500,000",
            "Thoughts and prayers to these brave billionaires. They’re doing the lord’s work.",
            "Thought Martin meant Aston Martin and was like, well yeah??",
            "Uuhh, because it’s a celebrity’s friggin Martin, for starters…?",
            "Who's got Steve Albini's Veleno, which was already rare and was used to record a lot of In Utero and how much will Irsay pay for it?",
            "Sure it does. Look the performance. It was jaw dropping. No one no one expected that kind of talent.  Was a legendary performance.",
            "He didn’t write any songs with the Mustang",
            "If the Mustang is worth 4.5 by my math the Martin is worth at least 9 and probably more like 18.",
            "Why would the guitar used in the performers iconic final performance sell for so much? It not like it’s a beloved performers final show.",
            "I was played a Martin while sitting in a Ford Explorer. On Lincoln’s Birthday. In Detroit. On Aston Street. In front of a Ford dealership. With my friend Martin.\n\nIts all very confusing.",
            "Pricing is based on what people will pay for it but there is context here between the guitars. A brand new Fender Mustang today costs like what 2k euro ish, a brand new Martin costs 3k but it not only was on one of the most iconic live performances of all time also had some customisation that Kurt probably asked for. That guitar is 1 of 1 really. The Mustang that he bought is basically the equivalent of \"Steve Jobs used to get his coffee here\" vs the Martin \"This is Steve Jobs' belt from the time he announced the iPhone and it was made for him by Dior\". In a way the Martin is priceless but the Mustang is definitely a great collectors item but nothing more, the fact it went for 4.5m was overpriced IMO, that's more expensive than Clapton's favourite Strat that he toured with constantly and recorded his albums with.",
            "[deleted]",
            "It’s Jim Irsay, owner of the Indianapolis Colts. And no, he’s not the brightest star in the sky.",
            "Nope. He made his millions the old fashion way. By being the fast sperm.",
            "It's been made clear that intelligence isn't a prerequisite for extreme wealth.",
            "Crazy thing is he played it through a twin reverb silver-face but it was covered to look like a monitor.",
            "Not to mention, I’ve never seen Cobain drive a car but I’ve seen him play that guitar in some of the most famous footage ever.",
            "Not sure why I thought they were talking about cars, but I was super confused why Kurt of all people would own either of those. I'm just dumb.\n\n\nFor context, Irsay owns the Colts. It sounds like he's just peeved the guitar went for more than he wanted to pay, or he's trying to influence the price of a future sale.",
            "All you had to say was it was played on unplugged.  I’m surprised it only went for $6m.",
            "Yup.  I’d totally be down at $6M if I had these guys money.  It is such an incredible performance.",
            "“Priceless” - actually seems like it might be priced around $6m",
            "Can you explain what you mean when you say he played it on unplugged? What’s the significance of it",
            "Its the mustang from the teen spirit vidio iirc",
            "I think he used to bust up a squire like almost every show",
            "They’re his teeth marks.",
            "This car is registered under John Voight!",
            "Sometimes I spell my name with a G...and an I!! Ahahahaha!!",
            "The periodontist?!",
            "Actually, it was John Voight’s car",
            "Mustang is a guitar not a car.",
            "*John Voight’s.",
            "Irsay is a billionaire. He owns the Colts via his daddy. EDIT: and a chronic complainer to anyone who will listen. Doesn’t surprise me, pretty on brand.",
            "Daughter would rather have the money I'd assume",
            "Who cares?\n\nThat's a weird way to follow up your comment. You clearly care.",
            "Why do museums have priority?",
            "Maybe 10-20 years ago, by now he would be numb to this shit",
            "I think if John Lennon we’re alive he’d have a theater in Branson, be pretty right wing and Yoko would be five ex-wives ago and fondly remembered as the one that kept the Beatles together as long as they were once people got a better taste of John.",
            "It’s complicated. He claims she gave it as a gift, but she denies it. She didn’t want him to get a single thing in the divorce, so she ended up agreeing to give him the guitar and basically nothing else. He got pretty much zero outside of the guitar, so she made out pretty good in the end.",
            "I was very very confused with this thread for a long time before I figured it out. Especially since someone said he was known to bust up mustangs. I thought he was just in a lot of wrecks.",
            "Wait, they're not talking about cars??",
            "I've actually played a Mustang before and first thought they were talking about Kurt's car and his acoustic guitar.",
            "I would have believed it either way from how weird new gen millionaire’s spend their money. I was more surprised that not given the context, kurt had an Aston Martin in his collection.",
            "I did not, thank you",
            "*fender* mustang",
            "uhh, Fender Mustang?",
            "This made me audibly chuckle, thank you.",
            "But more famous for driving his Aston Martin apparently",
            "And one of Ledbetter’s guitars. During  Unplugged he jokes that he asked David Geffen to buy it for him because it was so expensive.",
            "*In Utero* begs to differ \n\n*Heart-Shaped Box*, in particular",
            "Not a car, my dude. It is a Fender Mustang. It’s a make and model of a guitar. Not a vehicle my man.",
            "Aw fuck I can’t believe there is a Jim Irsay sighting in r/entertainment of all places. Let me enjoy cheering for blue team in peace Jim, quit saying weird shit!",
            "That sperm was only half of him...",
            "lets just say i made my money by “jorkin it” and by jorkin it i mean inheriting it",
            "I don't know much about music, could you explain what that means? Apologies if a dumb question!",
            "The mustang is a Fender Mustang, a guitar.",
            "Totally agree. It’s about an iconic performance. And Nirvana unplugged was a televised iconic performance. The guitar Kurt played during that session is priceless.",
            "He didn’t buy the whole car. He only bought the fender.",
            "lol I definitely thought car. I don’t know anything about guitars",
            "This comment transcends stupidity and becomes avant-garde art David Lynch could only dream to come up with. It belongs in the Smithsonian next to the Cofeve tweet.",
            "That’s adorable",
            "lol\n\nJesus.",
            "Oh you :)",
            "Lol what? please let this be an attempt at a joke",
            "He drive a Volvo",
            "Don’t comment on things when you have no clue what it is you’re talking about",
            "So MTV did a “series” where they got famous musicians to play without any “electric guitar” and just use acoustic guitars. So one of the other famous  guitarists was Eric Clapton who payed on Unplugged. https://youtu.be/8mhbCa2RGRs?si=PysheMxveb3ZljqI",
            "Well that’s the difference… was it a mustang from a one-off performance? Or was it a Mustang that lasted the majority of his shows?",
            "Is that his pencil too?",
            "Everybody's talkin' at me, but I can't hear a word they're saying, just driving 'round in Jon Voight's car.",
            "It's justifiable. He thought I was going for his wallet",
            "He hung an AFC ~~Championship~~ Finalist participation banner up in the Colts stadium. That should tell you everything you need to know about his ego.",
            "His daughter is loaded… she might want it for sentimental reasons but I doubt she’s losing sleep over the money",
            "She’d probably rather have her dad.",
            "Well to be fair he is pretty numb to it by now already",
            "Lmao that's so embarrassing for him tbh. Worshipping the dead dad of your ex. Unless it was a money reason he kept the guitar ",
            "Yeah, it’s got fenders. Driver’s side. Passenger’s side. Don’t you know about cars?",
            "Either or",
            "Like the fender of a Mustang?",
            "Thats the joke",
            "Yes, I couldn't  quite remember where I heard it, but it was that unplugged concert. Their cover of Bowie's The Man Who Sold the World was great.",
            "you are a really kind person thank you ❤️",
            "It could be worse. At least he’s just talking about an instrument and not playing one.",
            "Texans fan here. If he sells, I will be very sad.\nHe's an Atlantic City version of Jerry Jones.",
            "The egg wasn't competing.",
            "It’s a classic Fender guitar amplifier, but usually used for electric guitar. Since this was “unplugged” they hid it away. That’s how I read the OP at least, never heard this story before.",
            "I’m leaving this comment up as evidence of being the dumbest man alive. Nobody ever seems to believe me.",
            "Correct. Later guita he played weren’t even truly a Mustang. It was a combination of a Jaguar and a Mustang hence why his signature line of guitars from Fender is called a Jag-Stang.\n\nTo be clear, the 4.5m auction guitar was actually a Mustang - this was the one he played on Smells Like Teen Spirit before he would have had the clout to have Fender make him his own line of guitars.\n\nIt also amuses me that this would have also confused people who thought these were cars being mentioned.",
            "So much confidence too. \n\nTo be fair though, wasn’t it a Jazz-Stang?",
            "And next you're going to tell me an astin martin isn't a car either",
            "I thought they were both cars",
            "But have you seen him driving a Fender Mustang?",
            "Lmao please tell me you actually thought it was his car?",
            "The comments were painful for me too man.",
            "Slow down, egghead.",
            "I always thought it was a jagstang",
            "…..but the price was $6m",
            "I thought a Mustang car too.",
            "::takes a bow::",
            "Dashboard Confessional unplugged was huge for me as a teenager.",
            "I'm sure he used it for more than that but its significance lies in the fact that its the first guitar people saw him with for the most part.",
            "His argument is actually that the *Martin* was only used in a one-off performance, and that the Mustang was one of his main guitars.\n\n>He chalks his reasoning up to the fact the acoustic only made an appearance during Nirvana’s MTV Unplugged – whereas the electric Mustang was a live staple.\n\n>“[It was] Kurt’s main guitar, and the electric guitar that survived the stage and survived many a jump – versus a one-night show – I felt [the electric guitar] was worth more,” he explains.",
            "Scratch the conference championship part, the banner reads “AFC Finalist”",
            "His daughter already had the Martin guitar; she gave it up in a divorce; looks like her ex sold it for 6 million. ",
            "Well, out of the available options..",
            "You know what's funny? Jokes like this hurt even after all these years. So weird to be honest. But it was a teenage hero and I guess those wounds sometimes never go away. It's good, because it gives me empathy for when someone I don't know or care about dies.",
            "He sold it pretty quickly afterwards, so I think it was just a money thing.",
            "> Worshipping the dead dad of your ex.\n\n[It's like he was cosplaying](https://static0.babygagaimages.com/wordpress/wp-content/uploads/2019/04/feature-frances.png).",
            "Yep. Kurt’s Mustang’s fender. The left one, since he was left handed and all.",
            "Actually it was:\n\nA woman is born with 2 million eggs. During the initial period, many eggs, as many as 1000, begin to develop and mature. However, even though hundreds of eggs have begun to mature, most often only one egg will become dominant during each menstrual cycle, and reach its' fully mature state, capable of ovulation and fertilization. The remaining eggs/follicles will wither and die. If another egg wins the ovulation= different person",
            "Oh wow I am dumb I totally missed how it was connected to the unplugged bit, thank you!",
            "From the headline I also assumed they meant a Ford Mustang and an Aston Martin lmao. I know nothing about guitar brands.",
            "I actually assumed you were joking lol",
            "Nah you’re good, that was a reasonable assumption. I was thinking the same thing. “Never realized Kurt drive a Mustang.”\n\nShame me, rock gods.",
            "I got a solid laugh out of this. Thank you very much for leaving it up.",
            "You are not alone. Lol",
            "I assumed it was a mustang and an Aston Martin myself.  So I’m right there with you.",
            "Respect",
            "You are not alone in the dumbness. I first thought they were both cars then that they were comparing cars and guitars.",
            "We believe you, relax.  It's just that many of us are just as stupid as you and almost said the same thing about the Mustang.  \"Car cost more than guitar! Cost more!  No make cents.\"",
            "Lol. The self awareness",
            "I love you dude",
            "You’re hilarious, and it’s awesome you’re doing this. Cheers, homie. The world needs more people who can laugh at themselves.",
            "Are you a guitar player? If so, shame on you. \n\nNo? Then I would never expect you to know what a Fender Mustang is.",
            "I thought the headline referred to cars as well.",
            "Bro, I just said the same thing in a comment before reading yours. Also concluding I'm dumb.",
            "Bless your heart! But to be fair— even in guitar world, Fenders are very popular but mustangs aren’t usually the model people play.",
            "I honestly thought you were doing a satire bit haha",
            "The blue mustang is the guitar from the video for smells like teen spirit. Fender also made broncos. Go figure.",
            "I don't believe you. Spell coffee.",
            "I also thought the headline was about cars. I didn’t bother to read the article. We might have a tie for dumbest man alive.",
            "A friend of mine plays a Martin acoustic, but I really thought they were talking about a Mustang vroom vroom.",
            "Me dumb too. You like meat? Me like meat. Sometimes me eat chicken egg, bacon, and sausage. Me also wonder if anyone ate Kurt’s wild horse. Horse tasty.",
            "I assumed it was a joke. Most of my guitarist friends would have said the same thing.",
            "> I’m leaving this comment up as evidence of being the dumbest man alive. Nobody ever seems to believe me.\n\nNah, you ain't the only one.  I didn't look at the sub name and at first thought \"I'll be damned, I didn't know Cobain owned a Mustang or any car at all.  I bet it was pretty sweet.\"",
            "Being a dude who knows not much of anything about guitars but being a dude who is still a Nirvana fan and who drives cars regularly I too thought we were talking about an old Ford.",
            "It's funny because I thought you were making a top tier dad joke",
            "That cracked me up thanks hahaha",
            "Dude honestly, I think thinking this makes you the dumbest man alive is dumber than your initial misunderstanding.",
            "Fair mistake, fair response. You aren't any dumber than the rest of us.",
            "Forfucks sake mate",
            "Thank you for being a good sport — and I was also confused by the headline.",
            "I thought vehicle as well.",
            "I’ve been playing guitar for almost 5 years and I also thought they meant a car…",
            "Aww this is cute",
            "The one played in the Smells Like video is a mustang and the one bought at auction.  His signature design by Fender was a Jag-Stang",
            "It’s only worth what someone is willing to pay…",
            "theres something more intimate with an acoustic too tbh. like the feel and even the smell of the guit are totally different. to know kurt snuggled up to that guitar with his baggy sweater over it for even one performance makes it a cozy keepsake enshrined in a moment of time; just like kurdt himself.",
            "Fuck, that's right. It's even worse than I remembered lol!",
            "I cannot imagine taking someone's dead dad's guitar in a divorce. ",
            "food for thought everyone under 30 only learned about him once his death was already part of his story",
            "What color were Kurt Cobain’s eyes? Blue. One blue this way, the other blue that way.",
            "Wow $6m for only the left fender. Ouch",
            "This guy eggs",
            "He's a withered follicle",
            "Hey the headline doesn't mention guitars and the sub is about entertainment. \nI play guitar and also assumed they were talking about cars...",
            "The thought of Cobain driving either is hilarious.",
            "I knew about Martin guitars. I knew nothing about Mustang Fenders, so news for me as well.",
            "Its more difficult to tune an aston martin.",
            "I'm right there with you, buddy.",
            "And I was like no wonder the guitar sold for more than the car. He played guitar. I guess he probably also drove the car but he's famous for the guitar!",
            "Makes us two of a kind",
            "The ONLY reason I know it’s not a car is because of Izombie. One of the characters is talking about Cobains “Jaguar” and “taking it for a spin” he then brings out a guitar. Threw me for a loop the first time.",
            "Kurt Cobain's Lexus found in garage in Indianapolis with his Paul Reed Smith in the backseat.",
            "Guicars",
            "You know what they say….\n\nIf you can’t laugh at yourself….plenty of other people will do it for you.",
            "I love you too man.",
            "But to think Kurt would ever drive a Mustang is hilarious.",
            "I know whats a Mustang fender is.",
            "If only",
            "Covfefe",
            "Me like meat. Me never had horse. That me know of anyway. Me like chicken egg. Me like bacon and sausage. Great, now me hungry.",
            "Funny thing is I knew it was a Martin guitar. I just never paid much attention to what he played, and most guitarists who play Fenders are playing Strats or Teles, so it didn’t even click.",
            "Jag stang, yeah thanks that’s what I meant. Been playing bass too much.",
            "Which, ironically, probably makes the guy's mustang worth more.",
            "Same with Sublime, but pretty much anyone of any age. They didn't really get big until after Brad already overdosed.",
            "Kurt had a dark sense of humor and wrote with levity about his suicide genes people. Go read his journals and lighten up",
            "I tried playing the guitar years ago, so I know about brands etc. With that being said, I honestly thought the buyer was shocked Kurt’s vehicle went for more than his guitar since he was known for playing the guitar.",
            "he is famous for playing a mustang! i learned that in high school. its why mustangs became expensive",
            "He famously played mustangs tho, but I get it.",
            "But it was reported by “guitar”.com and had a picture of him playing a Martin guitar….",
            "Everyone “plays” guitar, but I would seriously not consider you a guitarist if you read that headline, saw that image, and still thought of cars before guitars. \n\nAlso, this is more Nirvana fan knowledge I wouldn’t expect non-fans to know, but Kurt hated driving. He would drive the tour van like a granny, so the band revoked his driving privileges. I’ve never heard any mentions to any cars that he owned, and I doubt they were sports cars or that he ever drove them.",
            "It’s even harder to tuna fish, badum tsh",
            "I have zero idea what kind of car he would drive. He would have loved Uber",
            "Layne Staley bought a Pontiac Firebird not long before he died so there’s that.",
            "How about a Mustang muffler bearing?",
            "As a guitarist, the mustang is a more valuable instrument, there’s no doubt….. but because the Martin is so recognizable, because of the unplugged performance, I can see why the Martin sold for as much as it did. Kurt died just 6 months after the recording, and it was released after his death.  So all of pop-culture factors increased the martins value.",
            "I was going to argue but you’re right. Santeria (album) was released in July 1996 and Brad died May 1996. Damn, that kind of hits hard realizing that.",
            "Mustang is a more well known name for a car than for a guitar.",
            "I know it's about quick perception...\nSaw Mustang and thought Ford...\nThen Martin and well...  lol",
            ">I’ve never heard any mentions to any cars that he owned\n\nCourtney Love bought a Lexus and Kurt made her take it back.\n\n[Also, Kurt drove a 1965 Dodge Dart, which is kind of a shitty muscle car.](https://www.dodgegarage.com/news/article/showcase/2024/04/of-course-kurt-cobain-drove-a-dodge.html)",
            "I was curious so I googled it. I had pictured him in an old vw bus or ghia. \n\n> After his death in 1994, his Dodge Dart was sold to his sister, who maintained it for nearly three decades before selling it in 2022 for $375,000 at an auction. Despite rumors of owning other cars, the Dodge Dart remains the sole known vehicle associated with Cobain.",
            "There was a Volvo 240 parked in the garage under the room where he died\n\nhttps://www.reddit.com/r/Volvo/s/Bdsso1N5N0",
            "But, did Layne play a Firebird?",
            "Fender also made a Bronco.",
            "The words “Kurt” and “mustang” together are synonymous with guitars",
            "I thought the headline was referring to an Aston Martin... that grungiest of car brands.",
            "A ‘65 Dodge Dart does not even qualify as a shitty muscle car, lmao \n\nYou saying he returned the Lexus further proves my point, along with your link, which quotes basically what I said. I think he sometimes puttered around in a 240 Volvo because he thought it was the safest option, but the man rarely drove was my point, and did not drive sports cars. I’m not sure what you are trying to argue here",
            "and a Jaguar",
            "I wonder how much OJ Simpson’s Bronco would sell for.",
            "I’m a guitar nut and Cobain nut so it was obvious to me as well.",
            "I wasn’t arguing with you."
        ]
    },
    "Actress Shay Mitchell seemingly denies Filipino roots by claiming she's 'half Spanish,' gets blasted": {
        "title": "Actress Shay Mitchell seemingly denies Filipino roots by claiming she's 'half Spanish,' gets blasted",
        "score": 454,
        "url": "https://pop.inquirer.net/364009/actress-shay-mitchell-faces-criticism-after-seemingly-denying-filipino-descent-by-claiming-shes-half-spanish/",
        "content": "",
        "num_comments": 155,
        "comments": [
            "It's crazy because she got a job as a voice actress in a Filipino Netflix cartoon called Trese because of her Filipino heritage (along with Dante Basco, Jon Jon Briones, Manny Jacinto, etc). I guess she's only Filipino when it benefits her.",
            "Her aunt is THE Lea Salonga, too. If I were Shay, I'd be proud of my heritage and being connected to such talent. For those who may not know Lea, she provided the singing voice for Mulan and Jasmine in the animated Disney films and has been a successful singer for decades now, also performing on Broadway.",
            "I no Filipino, I Spanish.",
            "That’s wild if true",
            "I would sometimes see this in high school growing up in Texas. Latinos would deny being from whatever Latin country their parents were from and say they’re Spanish or Italian. It was obviously a lie but Anglo Americans would believe them because to them Spanish is all the same to them. \n\nI just didn’t think people still did this when they’re older. I figured they grew out of it.",
            "That’s fucking sad. Cause real talk I’ve always been proud of my Filipino roots because I always thought I was a little different from others. I’m proud af of being Filipino 🇵🇭",
            "She looks pinay af too",
            "Hilaria Baldwin would like a word.",
            "That is fucking pathetic.",
            "Why would you hide the fact you're Filipino? Most of my friends are Filipino and they are the best fucking people in the world.",
            "She got bullied for being Filipina and started saying Spanish as a defense. This is one comment dropped in a conversation about spicy food in a reality TV segment. Not an in depth discussion about her heritage.",
            "Seems more like a damnation of a society that's so racist she felt a need to lie to avoid bullying than something we should condemn her for.",
            "Isn’t Baldwin wife another one of these people that claim to be of a certain heritage but is American? Uses fake accent and everything?",
            "Awwwww that's disappointing. Another one of delulu clowns who thinks they're white.",
            "I had to look up who this was…",
            "Not the first Spainiard to deny their Filipono roots",
            "My takeaway from this is that if Shay Mitchell can get bullied for her appearance, it’s definitely not how the victim looks that’s causing the bullying.",
            "Pi-yay? More like Pi-nay",
            "She is so obnoxious",
            "Spain colonized the Philippines, so she could be of spanish descent",
            "I’m Filipino.  Relax, we are not offended. This ain’t our first rodeo. ( well, technically we don’t do rodeos)",
            "As a former Latino, I’d like to announce that I am half Filipino.",
            "I have seen this from black people that wanna distance themselves from being black but Asian do this shit too?",
            "Not to defend this, but when I was growing up a lot of people called any Spanish speaking brown people 'Spanish'. It's possible that since she grew up in Canada this was common there as well. \n\nOr it could just be really stupid, but I don't know why she'd lie about something like that.",
            "she was def denying her heritage, although Filipinos are basically Spanish Asians",
            "Well, as someone who kinda hates her own heritage cause the country my dad came from is so disgusting and corrupted and has ruined my family, you never know what happened to someone.",
            "Internal racism is real. And it really sucks. \n\nThere’s so much judgment of Asians that goes unnoticed and untalked about.",
            "Wait. I don't know who this is, skimmed over the first sentence in the article, and don't plan on giving a shit about this ever, and it says she's Canadian. I'm so confused.",
            "This reminds me of that post decrying others for getting one sentence and then creating a completely new one. Shay saying that she’s part Spanish isn’t at all her denying her Filipina side. She is one of the producers of The Cleaning Lady, which aimed to bring a mostly Filipina cast to network tv.",
            "What's wrong with being Filipino? They're gorgeous and their food is amazing - I'd have loved to be able to call myself that.",
            "White Supremacy and self hatred wins again 😢",
            "Weird Face. Katt Williams…run from her.",
            "I wonder what ethnicity people here think african americans are... your parents don't have to be spanish for you to have spanish ancestry. Some places in the Philippines have a high degree of spanish ancestry. Also \"filipino\" isn't a single race, there's many different ethnicities that make up the country.",
            "This conversation thread has the most interesting and thoughtful, articulate comments and observations I’ve ever had the privilege to be in, in Reddit. It proves that Reddit rabbit holes are wondrous; or at least they can be.",
            "What an embarrassment",
            "Who gives AF, most Filipinos don’t consider you a Filipino if you don’t speak Tagalog. Been told that all my life. Fuck everyone for shaming her when culturally they do it to each other.",
            "Is this the same chick that’s married to Macauly Culkin?",
            "She got finger blasted?",
            "Well, does she have Filipino roots or not?",
            "Your story about Filipinos checks out",
            "Lea is probably one of the most famous Filipinos alive, lol. I'd say it goes Pacquiao and then Lea. Shoutout to the 🐐 of pool too, Efren Reyes",
            "I did not know these two were related. That’s cool",
            "What???? I had no idea 😮. How could you not want to embrace that family tree??",
            "Wow, I didn't know this. Lea voice was incredibly robust and inspiring.\n\nSomething her niece isn't.",
            "wooooooow",
            "Can’t tell you how many times I’ve her a Filipina say this in Japan. And I’m actually Spanish.",
            "We knew a couple years ago; his parents were Mexican and hers Filipino. Before they had children she claimed to be Spanish or Polynesian and after kids they all became Hawaiian.",
            "You peaki pani too?",
            "Right? Like, what did Phillip Pino do to her anyway?",
            "Her Wikipedia article states her mother is Filipino  and left the country when she was 19. her father has Scottish and Irish heritage",
            "My first ever apartment I had a Mexican neighbor in his 40's named David who told everyone he was an Italian named Gio.   Dude was a straight up grifter though, so maybe that was a part of it.",
            "Ya we had a kid whose last name Vazquez in my school swear he was Italian and that the name changed when they immigrated. Just like umm ok",
            "I was born in the us, my dad was born in Cuba, but his parents came from Spain. I don’t think it’s fair to people actually from Cuba for me to say I’m “Cuban”; I say I’m Spanish ethnically on my dads side as that’s where my roots (which is what I’m being judged on anyway) come from.",
            "Filipinos always throw me off. “Hi, my name is Bengie Fernandes” me: hola. Them: I don’t speak Spanish.",
            "I wonder why she did this?\n\nWhat could she possibly gain lol",
            "Seriously - nicest people I know and the best coworker I’ve ever had",
            "Mitchell is from Toronto. Half the city is Asian, so I highly doubt she was relentlessly bullied for being Filipina.",
            "She’s from Toronto where Filipinos have a huge population and are very proud of their Filipino heritage.",
            "No one was treating this as a \"in depth discussion about her heritage.\"\n\nThey're treating it like a blatant denial of her heritage. Which it is.",
            "Bullied?? Ain’t she from Toronto? Mississauga?? There’s like a million of us here, what bum ass neighborhood did she grow up in?? I dunno, I call bullshit on that",
            "But we all already know she’s Filipina lol. She literally got roles because of her heritage and she’s family members with another famous Filipina actress. Like why lie about it now?",
            "Ya apparently she gave the accent up for their new reality show",
            "I did as well. Also, how she wants to relate to her heritage and identify herself doesn't seem like any of my business. Not sure why everyone is so up arms over it.",
            "I dont think there are many spaniards with filipino roots. Probably filipinos pretending to be spaniards.",
            "i've encountered south americans who pretend to be from spain.",
            "I have Filiporno roots",
            "That's so dumb. That would be the same as if a latino claimed to be \"half spanish\" just bc Spain colonized latinamerica hundreds of years ago. The only way someone can claim that is if one of the parents is from Spain.",
            "The Spanish didn't intermarry or have kids with Filipinos the way they did natives in the Americas. They just christened the population and left their last names and the catholic religion. She's not even Spanish she's just Wasian.",
            "Pack it up guys, this one rando Pilipino guy on Reddit speaks for all of us. Lmao FOH",
            "I went to grad school with a black woman who identified as everything except black. She was as dark as the inside of a cow. Apparently, she didn’t think the rest of us had working eyes.\n\nShe slept with every white guy who’d have her, but none of them would take her out in public because she was overweight and unattractive. I’d feel sorry for her if she hadn’t been such a raging bitch to everyone who wasn’t white.",
            "I never gave Filipino's a thought until several years back, an online buddy started expressing his hatred for Filipinos to me....then he told me that he was Filipino. He said his views were common among countrymen. I let it be and still do not understand.",
            "If you had skimmed just one more sentence, you would not have been so confused. Here is the second sentence of the piece:\n\n\n\n“However, her statement sparked backlash from numerous social media users and viewers of the show, who accused her of lying, as it is widely known that her mother, Precious Garcia, hails from Pampanga, Philippines, making Shay Mitchell half-Filipina.”",
            "No in the video she literally says “My dad is Irish. My mom is Spanish.” Her mom is not Spanish. She’s Filipina. Furthermore her dad is not Irish but that’s not as significant.",
            "Her aunt is Lea Salonga… She is FILIPINA",
            "Hey now",
            "You make it sound like they don’t tell us right there in the second sentence of the article. Did you click on the story?",
            "Kirk Hammet from Metallica, at one point the biggest band in the world, is half Filipino.",
            "You forgot Batista",
            "Bata, the Magician!",
            "To be fair, in Japan it's just easier to not be a different kind of Asian. Xenophobia is real haha.",
            "Most Filipinos, Spanish , and Portuguese are born in Hawaii.",
            "Probably hot into some hot mess woth Jale Pino. Those two have always been inseparable.",
            "You're just american actually",
            "Tbf like 30-50% of Tagalog is Spanish words depending on which province you’re in..",
            "Spanish speaker and same!!",
            "Seriously - I’m from Toronto and I’m her age. There is a very large  Filipino population here and they were not the ones getting bullied. The kids that got bullied were from every country but where “fresh off the boat” so they didn’t know what was cool in our country yet",
            "And? Like… I don’t know… I feel like there are probably a million other more important things than some actress denying her heritage. If she wants to deny her heritage, so be it. Being all up in arms about is a tad bit strange. A part of me feels like if someone wants to deny their heritage, they should be allowed to.\n\nIt’s not a war crime.",
            "No, she hasn’t quite given it up. She speaks to her Hispanic help in English using her bad Hispanic “English-is-my-second-language” accent.",
            "I read it as:\n\nNot the first “Spaniard”….",
            "Most Filipino immigrants I’ve met have Spanish names",
            "Americans claim to be irish if their great great grandparents were from Ireland",
            "There are Mexicans and Mexican-Americans who claim this lineage and they tend to be really prejudiced against Mexicans with darker skin & native roots. \n\nBut yes, I agree it’s dumb.",
            "That man’s name: Phil O’peno.",
            "The Filipino has spoken",
            "I sometimes have to remind myself that people like this are severely damaged. It’s no excuse but I don’t wanna dehumanise a person who does it to themselves. Its saddening.",
            "No, I prefer someone to tell me.",
            "Well, TIL then.",
            "Filipinos are Pacific Islanders, not Asians",
            "Most of them are born in the Philippines, Spain, or Portugal.  WTF are you on about? They all run to Hawaii to give birth?",
            "That’s what I tell people but I often have to justify my Spanish sounding name",
            "Do you somehow think you are in a war crimes subreddit?",
            "It’s really hurtful to other Filipinos. If you can’t see the widespread damage it can do vs. the selfishness of one person denying their heritage, think about it a bit more.",
            "This \\*\\*\\*\\* brought up \"it's not a war crime\" as some type of defense???\n\nWtf???",
            "Lol, you are doing the same thing. You are over dramatizing basic statements. I said that she is denying her heritage, which she is, and you act like that means I genuinely give a fuck about her life and career, which I don't.",
            "Yes because of colonization but less than like 3% even have Spanish blood",
            "Thats because the Philippines are a former spanish colony. The name come from Prince Philip of Spain who later became King Philip II. The population converted to catholicism also. Would you call an afroamerican anglosaxon because they have an english name?",
            "American and English Italians do the same shit, super cringe",
            "Yeah, but Americans are something else …",
            "That's also dumb.",
            "If you bothered to read the article you’d see the first sentence that says she’s Canadian",
            "okay no problem - well here you go. The big reveal. This lady is half Filipina \n\n\nHowever, her statement sparked backlash from numerous social media users and viewers of the show, who accused her of lying, as it is widely known that her mother, Precious Garcia, hails from Pampanga, Philippines, making Shay Mitchell half-Filipina.",
            "As a Filipino, we are definitely *Asian*\n\nNo one in the Philippines identifies as Pacific Islander. No offense to our pasifika brothers and sisters but Filipinos are *south east fucking Asian*",
            "[Filipinos are Asians, not Pacific Islanders.](https://medium.com/ce-writ150/can-we-consider-filipinos-to-be-pacific-islanders-388db499cbec)",
            "Sure buddy, sure.",
            "Kind of splitting hairs, aren’t ya?",
            "So I haven't been to Asia!?",
            "Not according to US universities they are t",
            "Hahaha. 🤣",
            "If you go to Hawaii most Hawaiians have Filipino, Spanish, Portuguese, and Asian backgrounds. It’s the melting pot of the Far East dumbass.",
            "I live here in the Philippines and any Filipino with a brain cell can tell you about the culture of crab and crowd mentality and the negative impact it has on the society as a whole. The people bullying her for being Filipino are likely Filipino themselves because not many foreigners/westerners give two craps. She doesn’t want to claim it and I can’t blame her. What causes widespread damage is the built in inferiority complex that causes all the gossip, judgement and backstabbing that is so prevalent here. The identity crisis that makes people act as if Jollibee is a part of their religion and take up arms if someone shit talks it. You’d never see an American die on a McDonald’s hill or become deeply and personally offended if a person says it’s shit. Claiming comes with just as much if not more toxicity than not.\n\nBayanihan and Kapwa are toxic in practice.\n\nI’ve practically written dissertations on the stuff.\n\nWhile Filipinos are a strong and resilient people, they do more damage to each other than anyone else over the pettiest things.",
            "I think the issue is that I don’t see it as “selfishness.”\n\nWhat an odd way of describing this.\n\nI see it as someone who’s been victimised by society for their ethnic background who has a lot of issues we can’t ascertain or judge. I don’t see why we should hold one person responsible for making an entire country feel good about itself.",
            "\"Person commenting on reddit comments about another person commenting on reddit to let the other person know how much they dont care about their comments - we'll stay with this story all night if we have to!\"",
            "According to a 2014 study in The American Journal of Human Genetics, the average African American genome is 24% European, 73.2% African, and 0.8% Native American\n\nSo yes, some of them may have significant angelosaxon heritage. For various reasons.",
            "Yes but when they do it no one bats an eye (and they do it all the time 😅)",
            "People with some Asian ancestors raised on Pacific Islands.",
            "In the States, or UK heck even Malaysia, you see Pinoy girls get into ugly tussles.\n\nThe ones married to foreigners almost 100% call the newbie a ''backwater bitch\" or pill-ip-pin-noy or something, as a slur.\n\nThe *actually* village-origin Filipino people pretty much LOVE to lord over their expat status over other Filipinos\n\nThen again, happens to some Malaysians, too\n\nThis is what hundreds of years of western colonization has done",
            "my thoughts exactly. she can say she doesn’t claim her filipino side at all and only claims her irish heritage or something and that’s her prerogative. why you would feel personally attacked by someone else’s SELF description is beyond me. is it kind of sad/pathetic? sure but really none of your business.",
            "Not really. All you're doing is describing the discourse without acknowledging what's being said. I can be that reductive too, I just choose not to because I can also manage nuance.\n\n\"She is self hating\"\n\n\"Why do you care so much?!\" \n\n\"I just said she was self hating\"\n\n\"What are you so obsessed?!\"",
            "Would you call an afroamerican anglosaxon?",
            "A lot of people bat an eye, just not other Americans. A lot of Irish people make fun of it.",
            "Well, you are the one that’s repeatedly replying to comments.",
            "I would say the average has a quarter European ancestry and some have significant Anglo Saxon heritage. Like the studies indicate.",
            "Ok. You answered. You wouldnt.",
            "So what do you call someone who has 50% Anglo Saxon dna and 50% African dna ?",
            "If i.remember correctly that would be a mulatto."
        ]
    },
    "Jennifer Hudson reveals her father had 27 children, and she still hasn't met all of her half-siblings": {
        "title": "Jennifer Hudson reveals her father had 27 children, and she still hasn't met all of her half-siblings",
        "score": 4207,
        "url": "https://ew.com/jennifer-hudson-reveals-her-father-has-27-children-8667047",
        "content": "",
        "num_comments": 277,
        "comments": [
            "Is her father nick cannon",
            "Papa was a rolling stone",
            "Wow. That’s. A lot of kids.",
            "I am all for a national vasectomy program making it free for all men that want one.",
            "That's one hell of a carbon footprint!",
            "This is why men need to be responsible for birth control as well.",
            "Damn! My wife’s biological Dad has 16 kids with a variety of women, I thought he was putting up insane numbers but I stand corrected.",
            "I mean does she really have to?",
            "Fucking deadbeats are scum, no way this dude fathered 27 children, he may have planted seeds but that doesn’t make you a father.",
            "I honestly don’t think this should be legal. Like that doctor who replaced the sperm donors’ samples with his own — and he fathered some 100 children. He didn’t get in any criminal trouble either. I don’t get how that’s allowed.",
            "Goddamn. Wrap that shit up.",
            "Sounds like an abusive dad",
            "People talk a lot about the fatherless crisis but maybe it’s more like a “keep yo dick ya pants” crisis.",
            "I feel like at that point, you really shouldn’t feel obligated to find them all lol",
            "I feel like this is a set up for one of the joke swaps on SNL",
            "And then there’s me — a guy who made a conscious decision to not have children because I cannot afford them.",
            "She’s gotta be careful who’s she dates.",
            "I’m someone who found out after both parents died that my father wasn’t my real father. I found the papers. My step father molested me growing up. I found out that my real father tried to kill me by kicking my mother in the stomach before I was born. \n\nMen like this are fucking scum. Nick Cannon and the like should bury themselves. They just care about what they want. They don’t give a seconds thought to their impacts on the children.\n\nAs a grown man, I have a lot of hate in me and all of it gets focused to things I find wrong and evil. And I don’t compromise on lying, stealing or cheating. So I’ve turned that into positives that have worked in my life. \n\nBut at no fucking thanks to the main male role models in my life that weren’t there even when they were.",
            "Paging r/Antinatalism",
            "One thing I never understood. People always blame the deadbeat dads (rightfully so, they're scumbags). But what level of narcissism do the women have to see a guy who already has multiple baby mama's and *still* decides to have kids by him, thinking \"I'll be the one to change him\". Both parties do their part in bringing a kid into a broken house.",
            "what she went through was devastating. her family was murdered by her ex-brother in law years ago. a painful scar. i want to hug her. i understand why she wants to reconnect with her dad and other siblings.",
            "Poor Jennifer, what an embarrassing thing. I am sure he paid child support for all. Not",
            "[removed]",
            "He’s catching up on NIck Cannon",
            "And here I was worried about the Duggers.",
            "Iyanla had a 42 y.o. man on who had more than that.",
            "My father had a lot of children, which in his defence he was only made aware of when I was in my 20s, after their moms either married again or sadly died. It is so weird having these older siblings suddenly appear year after year. It felt so unnatural and I just wasn’t able to bond, my other siblings could. Now they have all taken my Dads surname and my parents want us to be a big happy family. \n\nAnyway I moved to the other-side of the world and like the peace.",
            "You can father a child but not be a real father to that child.",
            "That explains a lot. I feel bad for her.",
            "26 baby mudda, REAAAAAL bad man",
            "Reaaaaaaaaaal bad man",
            "Someone needs to track that mad man down and give him the snip snip",
            "I feel like 27 might be a \"best guess\" kinda number",
            "So he’s either a billionaire or a total deadbeat",
            "Have as many as you want, but PAY for them.  Loser",
            "TIL her dad is nick cannon",
            "Same here but my bio dad was a sperm donor, I’ve only met 4 of the 20 something siblings, it’s hard when travel is expensive and everyone’s already adults with lives and busy. And that’s taking for granted even tracking down and meeting for the first time. I feel like she’s probably working with less of a paper trail.",
            "Don’t let Nick Canon see this or he’ll try to break her dad’s record.",
            "> The talk show host says it was once \"her dream\" to \"have all of us at this grand Thanksgiving or Christmas table.\"\n\nAnd then she thought about it for another 20 seconds and realized that a at least 3 of them would probably rob her.",
            "Right up front, \"the father she was raised without.\"",
            "Some people come from some poor dysfunctional families and I'm glad Jennifer Hudson was lucky to experience wealth and success despite the circumstances. She's been through so much. ",
            "Nick Cannon vibes",
            "“ 23….. 22 Baby Mada…. **weealll Bad Man** “",
            "Dude was a smashaholic.",
            "Reallllll bad mahn",
            "Oof that’s going to be a bigass BBQ once they start bringing the kids and grandkids. Industrial BBQing",
            "Hey it’s me ur half sibling",
            "How hard is it to arrange a family reunion? Somewhere cheap like vegas if she doesn’t want to cover it.",
            "I know a girl who was adopted and has 17 siblings FROM ONE MOM. Apperantly, her mom had mental health issues and just kept getting knocked up every year and giving the kid up. \n\nShe has 5 siblings from the same dad.",
            "Just submit a DNA test to get invited to Thanksgiving.",
            "This is yikes for her father. But considering what she went through and how she lost her mother, brother and nephew, I understand the desire to connect with family. I just hope she doesn’t get sucked into anything unsavory. These types of dynamics can be difficult.",
            "Damn.\n\nHer daddy was a travelin' man.",
            "Those poor siblings.",
            "That’s an easy way to tell people They could potentially be on your will",
            "Here is the kicker , he ain’t done",
            "That is A LOT of people coming at you after your money.",
            "i am one of 9 children from 4 women!! i hear you jennifer!! i want a relationship with my half-siblings sooo bad🥹🥹",
            "There should be a limit of 10 biological children with no more than 3 different partners. That’s more than fair and covers a variety of real world situations. Anything more than that should be sterilization.",
            "Fall of the House of Husher",
            "Man he was unleashing ropes\n\nOh boy im pregnant",
            "And the chance of unintentional inbreeding went up a tiny little bit. ",
            "As an h1b Indian we take pride in knowing our kids",
            "Damn!!!! Damn!!!! Damn!!!",
            "Cannot  think of this as bragging rights!  Bb King had a bunch too",
            "They called him the plumber.",
            "Thread locked in 3... 2... 1...",
            "https://media.tenor.com/ERimvalRHQkAAAAM/nuts-thats-a-lot-of-nuts.gif",
            "Most guys can't get laid at all, and this guy had a rotation of nookie and an absolute terrible pull out game.",
            "27 kids is wild!",
            "Pipe Laying man",
            "I have a friend whose story is worthy of a talkshow. She has 19 brothers and sisters.\n\nDuring the 40s 50s and 60s, (all from the same mother and father)..her bio parents had 20 kids. \n\n...all of them taken almost asa she'd have them...at first, the older ones were taken by the state due to neglect.  Later, she'd just willingly give them up. Some have passed away now for various reasons. \n\nIt took years,  this started pre-internet, then once it became a thing, it REALLY took off..and 2 of them have the best story. \n\nOne, we'll call her Sue, who was still oblivious to all the rest, was spotted in a big chain department store by another one, we'll call her Anne. Anne knew she had siblings, but she also didn't know how many there were, or their names. \n\nAnne noticed Sue, and realized OMG!--WE LOOK EXACTLY ALIKE, (she is a literal mirror of Anne even now, yearss after the fact)..So Anne bides her time, waits til Sue comes out, and boldly approached her on the parking lot. When  Sue actually sees her face to face,, she too, was aghast. Anne goes, I'm sorry I know you don't know me..! But were you adopted? Sue cries YESSS!! And grabbed her and hugged her--and the rest is history! Over the yrs they've all been accounted for and most of them found.",
            "I was about to say fuck her dad, but that would produce even more children",
            "is her dad john stamos from that one episode of law and order svu where he was poking holes in condoms to have as many kids as possible?",
            "This seems reckless? My man does not miss",
            "All I can think of rn is Claim to Fame",
            "He was hedging his bets. With all those kids, at least one is bound to be a huge success. Smart move.",
            "Do Jennifer Hudson and my mom have the same father?",
            "damn he has more kids than nick cannon…. do men really have a breeding kink? gross",
            "Ew.com is right",
            "Papa was a rolling stone",
            "Reeeeeeeal badman",
            "I didn’t realize Nick Cannon was her father.",
            "Dennis Rodman’s father had somewhere between 27 and 47 children, no one is really sure how many. The father gave the lower number and Dennis gave the higher one. Rodman’s father left his mother when Dennis was young and settled in the Philippines, where most of his half siblings were born.",
            "Who's Jennifer Hudson?",
            "papa was a rollin’ stone..",
            "Maybe I’m just different, but this is not something I would’ve advertised",
            "Is it Nick Cannon?",
            "Reeeeaalllll badman",
            "Holy shit, her Dad is Bob Marley?!!",
            "That picture is horrifying… plastic lady",
            "Paying attention nick cannon?",
            "Genghis Hudson over here.",
            "So her father is Nick Cannon?",
            "Jennifer Hudson discovers, finds and meets her half siblings is a reality show waiting to happen",
            "He must have had like 3 jobs!",
            "Papa was a rolling stone.",
            "Contributing to the welfare epidemic",
            "Makes me think of a Family Guy joke. Peter is giving very clearly terrible advice to people and says “have as many kids as you can in case one of them makes it in Hollywood. Then who’s paying the bills?! ✨Hollywood Kid✨”\n\nHope she gets to connect with them and build meaningful relationships",
            "That guy fucked",
            "Papa was a rolling stone",
            "Papa was a rollin’ stone….",
            "I guess Mr Hudson wanted to improve the odds that one of his kids was an EGOT winner",
            "Man is a living legend",
            "Who gives a hoot",
            "Nick Cannon is her father????",
            "He fucks. A lot.",
            "I hate to say it, but only one culture and race does this and disrespects their offspring. \n\nThe British.",
            "With luck, maybe he’ll stay absent!",
            "Elon Musk has his work cut out for him",
            "This is the fault of the American slave trade.",
            "Color me shocked. White fools out here doing the same shit.",
            "Are they all different baby mamas?.. mans got some game. Damn",
            "Ohh slay daddy get it boy 💅🏻",
            "More like Dick Cannon",
            "He still has 30 more to tie with “Screamin' Jay\" Hawkins",
            "\nNo one thinks Nick Cannon's done. He's merely having a couple years intermission until his next batch starts. Him & his women are all sleeping together raw, who knows who the women are sleeping with (although I'm sure they promise you to only screw Nick). They're all disgusting & trashy together like Jennifer's father.",
            "Dude *has* to keep having kids to help him pull his car out of the driveway.",
            "Beat me to it!",
            "Came here to write this and was pipped at the post 🤪",
            "Wherever he left his hat was home",
            "Papa was a rolling bone",
            "Mama developed a habit",
            "Rolling nut",
            "unexpected tempts",
            "Papa had an active bone.",
            "A complete unknown (for his kids)",
            "That’s a lot of nuts!",
            "Some dudes DGAF and also like the idea they are spreading little copies of themselves without taking care of them. It's  a form of narcissism.",
            "While I agree with you at large, if he had 27 kids then this may go farther than being irresponsible and be a full blown breeding fetish. In which case you might as well chop it off",
            "Not just that, have the guy actually take care of the kids, not just provide for them financially (if he's even doing that). \n\nMothers are often the one stuck with the child.",
            "What if having kids is a psychological component for someone like this? Probably won’t go for it",
            "She’s had one hell of a life too. Very strong woman after what happened to her mother / brother",
            "*genetic footprint",
            "are they…not?",
            "They are, though.... Condoms.",
            "[deleted]",
            "Why though?, men don't get pregnant and can disappear any day leaving the mother and the kids behind. Women should stop having children with the kind of man that has 28 known kids with who knows how many women. He must have had something going on for him for that to happen, women are not throwing themselves at some nobody.",
            "Yeah, my father fathered 13 that we know of. I'm the youngest we can identify so we think he may have had a vasectomy after me, but he would entertain no questions when he was alive. He only ever acknowledged three (my two older half-siblings and me) because we were the only ones born to women he married. My older half-brother B was the only one he also had to pay child support for, but he refused to acknowledge him even after DNA testing in the 90s.\n\nThe others have found my siblings and I via social media (we have a very, very uncommon last name) or more recently, me through sites like 23 and Me. I often consider not responding because it sucks telling them about who he was as a person, but they deserve to know *something* about where they come from.\n\nIt's been about six months since the latest one found me, so I'm hoping it's just the 13, but obviously I strongly doubt it. The man was Johnny Spermseed throughout the south in the late 60s through mid 80s, so I'm sure there are others.",
            "I know someone who had 17 never married so they all from different mothers and he died in his late 30s.",
            "my dad has 9 children! i thought i was putting up with a lot lol 😅",
            "Can you imagine being famous with a decent amount of money and having strangers that you have never met, but are actually related to you start coming out of the woodwork all of the sudden? Looking to “connect”.\n\nEven if the intentions of all 26 of her siblings are genuine, I would be skeptical as hell.\n\nThanks a lot Dad",
            "Yes, that way you know the Hot guy at the bar is not your brother.",
            "My thought as well.",
            "Yeah, it’s not like you’re literally bound to them",
            "Naw I think knowing your siblings is great tho if you value family",
            "And I'll bet he brags about how many kids he has.",
            "Planting some seeds. This dude was plowing entire fuckin fields.",
            "I doubt he has 27 biologic children.\n\nI work a lot with a lot dirtbag guys.  They *all* claim to have 8-10 children.\n\nWhat it actually means is that the women are telling *multiple men* this is your baby.  That is what *those* sorts of women do.  You know, the kind of woman who gets with a guy who claims to have 8-10 children.",
            "My maternal grandfather have over 20 children, that he knew of. Due to him having so many children, i have over 50+ first cousin on his side. I make a conscious effort not to date from certain areas due to the chance that we are closely related.",
            "It's not as bad as the sperm donor kids.  It's coming out that sibling groups of 50+ often in the same area.  Kids have siblings going to their high schools and don't know.",
            "I was not molested and I don't share your hate, but I can relate.  I grew up like that, and one of my half brothers went on to live a life like that.  He was always so proud to say he was a father again.  We (other siblings) told him he was not a father, just a sperm donor.  He could not understand why we were not happy for him.",
            "The part that makes me sick is the people who imply because Cannon has money, it’s ok. Apparently, it doesn’t matter if a child has their father in their life as long as they have their basic needs met, and even less so if they are “spoiled”. \n\nNo material goods replace a good set of parents. Sometimes shit happens and the relationship falls apart and coparenting is necessary or god forbid a tragedy occurs, but good parents do their best even in trying circumstances. ",
            "I hate that all of that happened to you, I’m sorry and I hope you heal.\n\nBut Nick Cannon isn’t abusive and just because someone has lots of kids doesn’t mean they are abusive.\n\nYou kinda jumped there, when you grouped Nick into a category with your abusive family.",
            "Your trauma is irrelevant to this situation. You have no idea what Nick Cannon is like as a father and to compare him to a child rapist and woman abuser is disgusting.",
            "I work with a lot of dirtbag guys.  They **all** claim to have 6, 8, 12, whatever children.  I also work with a lot of dirtbag women.  Let me just say that determining who is the father is an inexact science in that social scene.\n\nThe kind of woman who gets with a dirtbag guy is the exact type of woman who will tell multiple men “you are the father”",
            "Unfortunately people prey on the mentally ill and vulnerable, and mentally ill people are prime targets for sexual offenses.",
            "10 is still a lot! How does any one child get the support, attention, and love they need from their parents with 10 kids. Everyone I know from a large family ended up parentified early and had 0-2 kids themselves. lol",
            "A lot of people fuck a lot and use birth control. This is a sign of irresponsibility not sexual prowess.",
            "27 times minimum.",
            "6-8+ kids that don’t want nothing to do with the man, still just upholding themselves as upstanding pillars of society.",
            "Oh man, it was right there too, low hanging “fruit” as it were",
            "Nope, you have it backwards!",
            "If that isn’t someone’s porn name, I’d be stunned.",
            "Big cock cannon\nAnd her mom was just big cock cannon fodder",
            "For damnit I was gonna say that. Take my upvote!",
            "I actually know a “Dick Canon” check out Richard Canon Uplift Testing",
            "I can hear, in my head, the sound of a t-shirt cannon going \"Phooom!\" when he cums.",
            "Greatest comment of the year",
            "I just looked it up and lmfao Jesus Christ man, why would anyone want 50 kids haha",
            "He put a spell on me!",
            "And when he died",
            "Sounds like he left his Jimmy hats at home.",
            "eRRRRRR",
            "THAT'LL BE FOUR BUCKS BABY, YOU WANT FRIES WITH THAT?",
            "Deez nutz",
            "Reproductive offenders. Learned the term from svu.",
            "Yeah, guy had a breeding kink",
            "It’s a completely natural, innate biological desire to want to do that… to allow yourself to do that, on the other hand, is mental illness.",
            "and also the primary driver of genetic fitness.\n\nedit: it seems that few people know what genetic fitness is. genetic fitness is the number of gene copies that an organism sends into the next generation.",
            "You can have a breeding fetish that doesn't lead to any children",
            "Splurt",
            "Hypothetically, a single man can get numerous women pregnant in the span of a year, months, or even day, such as JH’s father.\n\nA single woman can only be pregnant the majority of one year, and even then, “Irish twins” are a rarity. Yet the burden of birth control is largely placed on women.\n\nI’m not saying men don’t have birth control, but collectively don’t show the same level of responsibility for it in their actions despite their likelier potential to create pregnancies.",
            "Have you never met a man? Shit, I’m one and I know how fucked some of us can be.",
            "Yeah but you’ve gotta wear them for condoms to work and I don’t think a lot of people with a bunch of kids choose to do so. Or maybe they weren’t taught to wear them correctly. Who knows.",
            "Holy fuck shut up ignorant ass. Who said anyone was dating? Use that one braincell better son.",
            "At least you’re wrong about everything",
            "What if he wasn’t forthcoming about his children and life. People put on masks hey, not all women who get pregnant by a guy like that know what they putting themselves into. I probably guess he was a smooth talker and a good listener. The deadly combo😅. If a guy told me, he has 20 kids I would rather shower with lava and disappear thn to bear him ANOTHER child.",
            "^ This comment can’t be real",
            "Dude. Hot take.",
            "Yea, my wife’s bio-Dad was actually murdered after he was deported from the US back to his home country. He became Rastafarian and I think he specifically honed in on the “spread your seed” aspect of it.",
            "Good thing he died young, really…..",
            "Yeah, I don't sympathise a lot with the ultra rich but one thing I do sympathise with them on is the extreme lack of trust they must have for stuff like this. I'm solid lower-middle class and I have motherfuckers trying to get me for the bit of cash I do have, I imagine that's a hundred times worse if you're rich and famous. I don't envy them always having to second guess the motivations of those around them, even those closest to them.",
            "She's never met them. Just being blood doesn't make them family in a real sense. I don't consider my own half siblings I've never met to even be my siblings like the ones I grew up with.",
            "He never said they were abusive. Just narcissistic and self-centred. Which happens to be true regarding Cannon.",
            "I couldn’t tell you if my real dad was abusive, no one told me anything until after everyone died and I was sorting through papers in house and came upon my original birth certificate with my moms maiden name as my last, and a set of adoption papers that changed my last name. I’d definitely say he was a psychopath if the story is true about how he wanted me dealt with. \n\nI also realize I should have been aborted. \n\nBut I can say the fucker got his rocks off and took off and obviously never once tried to know me. Now Nicky is different as I’m sure he wouldn’t ghost his kids but ask me what I would have done for a father growing up. One who was there, one who would show interest in the things I was about, one who was in the house making me feel safe and loved and made plans with me tomorrow. Guarantee you can’t do those things when you’re not in the house. \n\nI had a partial dad. Was t really interested but paid the bills at the end of the day. Not much of compromise as a kid trying to place yourself in a world where you have a cold indifference at you daily, not even realizing this isn’t normal. It’s a mind fuck when you look back at it as an adult and wonder how you wound up successful and almost happy. \n\n\nI’m not knocking divorcées either but I will say that not having a father in the house growing up as a kid, was damaging and it took me 56 years to understand it and come to grips with it. \n\nI’m a survivor. I do well in life. I make no excuses for anything. I failed as a husband and father myself, although that was long ago now and before I understand what I do now. Just for context.\n\nOne thing: he used to call me a master manipulator when I was a kid. And now i agree, I was. I had no choice. I was 9 when he molested me for a period of time. I lived with it. Said nothing to anyone. I was old enough to know that what my little brother and I had as a family would get torn apart. So I did become a liar. I lived there trying to act like nothing happened so that I would have a roof over my head and my little brother. I did become a master manipulator.",
            "https://sg.news.yahoo.com/nick-cannon-offers-11-kids-190019702.html",
            "Someone who has a lot of kids they can’t be there for *is* a form of abuse - neglect. Anyone who’s had a wonderful dad who was there every day knows what a boon it is. Someone who just pays the bills, comes to your birthday and sees you one weekend a month isn’t much of a dad. ",
            "Their trauma explains the severity of the response. We have some idea of his parenting given how his most recent birthday was a meet and greet for his children. \n\nhttps://sg.news.yahoo.com/nick-cannon-offers-11-kids-190019702.html",
            "Just by getting woman after woman pregnant in a short amount of time pretty much shows he isn't a good father.",
            "Yes 10 is too many for any normal person to have. I still think you are insane to have anything more than 5 regardless of your monetary situation. I was just giving 10 cause people have the right to have stupid large families and you factor in divorces or whatever, I think 10 is still a very generous amount that doesn’t limit people’s freedom too much.",
            "I’d say sexual “effectiveness” cannot be disputed and, assuming at least 6-7 baba mamas and more than one had to go back for multiple loads, I’d say he’s got some game, low standards, is irresponsible and shameless. Now let’s address the ladies. How fucking STUPID And IRRESPONSIBLE do you have to BE to let this man within 50ft of your vagina? I understand him, he got to get it off and leave. Irresponsible but not stupid. However those ladies literally SIGNED UP for 9 months of misery, a flesh ripping birth, and a completely uninvolved partner. Holy fuck!!",
            "Nice pun",
            "Cick Dannon?",
            "The mother was a fodder?",
            "This sounds like a trap",
            "He had 28 kids…..",
            "All he left us was alone",
            "All he left us was alone.",
            "Na-nananana. *Neo*. Nanananananana. *Sporin.* *Blinininining*",
            "Oh….Taco Bell, Taco Bell, product placement with Taco Bell! Enchirito, nacho burrito…",
            "Wasn’t this one the episode with John Stamos?",
            "[CLASSIC REPRODUCTIVE ABUSER!](https://i.pinimg.com/originals/77/68/5b/77685bba9f52afd6e1b45f18acb33b8a.gif)\n\nMy sister and I yell that at anything that annoys us.",
            "🤮 wish I hadn’t learned that term",
            "You and me, baby, ain't nothin' but mammals  \nSo let's do it like they do on the Discovery Channel  \n(Do it again now)  \nYou and me, baby, ain't nothin' but mammals  \nSo let's do it like they do on the Discovery Channel  \n(Gettin' horny now)",
            "What is genetic fitness?",
            "And clearly this man’s fetish **did** lead to many children and that’s just not okay. Have whatever fetish you want, but the second it starts hurting other people who didn’t consent to be a part of a breeding fetish, it’s fucked up.",
            "After the 15th or 16th kid you'd think they'd figure it out",
            "Fair. But doesn't negate the point. Men are responsible for birth control. So are women.",
            "no that’s a fucking shit take",
            "I know what your alluding to especially with the saying “the blood of the covenant is thicker then the water of the womb” however with your half siblings I’m sure if there was a effort on both sides y’all would grow closer then if you met a random stranger and started from no similarities.",
            "https://www.latimes.com/entertainment-arts/story/2023-06-22/nick-cannon-jessica-white-emotional-abuse-allegations-interview",
            "I mean this with all respect but please seek help, no one should feel the way you do about yourself.",
            "Sorry, PrestigiousOnion…. I can’t imagine the sense of betrayal and the loneliness you must have experienced. I hope you’re alright now.",
            "That’s fucked",
            "Did they pay for a signature as well? Jfc that’s insane",
            "Daddy, chill!",
            "Rolling stoooone",
            "All he left us was a LOAN!",
            "Sure was!! Exactly what popped in my head lol. He was really good at being the creep in that episode.",
            "the number of gene copies that an organism sends into the next generation.",
            "But what difference did it make to him? One kid or 15, he was clearly busy else where.",
            "Maybe he just wasn’t specific enough.  It’s a hot steaming shit of a take.  Thats still hot right?",
            "That’s what I meant. A steaming hot shit take.",
            "Hes disgusting",
            "All he left us was some scones.....3 day old scones. Sorry ass mf.",
            "A small loan of 3 million dollars",
            "Went to get cigarettes and now we only talk on the phone.",
            "Probably because he's a creep in real life. He admitted to taking a drunk woman who was interested in him back to a hotel room, where he turned off the lights, and let his friend assault her.",
            "Aborting mission.",
            "OH SHIT THAT’S RIGHT!  \n  \nFuck him. No wonder it was an easy part. Fucker."
        ]
    },
    "Justin Timberlake's pre-arrest concert footage with ‘bloodshot eyes’ surfaces, fans worried; ‘he had something..’": {
        "title": "Justin Timberlake's pre-arrest concert footage with ‘bloodshot eyes’ surfaces, fans worried; ‘he had something..’",
        "score": 273,
        "url": "https://www.hindustantimes.com/entertainment/music/justin-timberlakes-pre-arrest-concert-footage-with-bloodshot-eyes-surfaces-fans-worried-he-had-something-101719025180491-amp.html",
        "content": "",
        "num_comments": 53,
        "comments": [
            "You mean a celebrity musician was on some substance?! OMG! How unexpected and rare!",
            "Nothing wrong with having something just don't fucking drive after",
            "Rich and powerful people get bored all the same as we do. Most of us just don’t have access/free drugs/social events they do. \n\nA drinking problem in Hollywood isn’t a problem. Driving your drunk self as a public figure who has every other option is the issue.\n\n5 years without my booze head and my heart goes out to the guy. You don’t hide this type of self medication unless you’re in real pain. And no, money doesn’t magically solve our nature and biology.",
            "Pretty much every single child star has had some kind of mental breakdown in middle age. JT is no different.",
            "I'm sure a lot of performers do drugs before performing. This isn't exactly news. Wouldn't surprise me one bit",
            "4 years off the sauce come Canada Day. Never felt better in my life. Rehab 2019, 35 guys facility by Toronto for 45 days,  you see some things and choose to make the change in your life or you don’t. Life’s not easy, but being sober I have a lot less issues financially, emotionally, physically and mentally. Life’s better off the sauce and drugs for me.",
            "Money doesn’t equal happiness. How many incredibly talented and wealthy stars have died horrible deaths too early? I am not a big JT fan, but this sucks for his family. I hope he gets help.",
            "Oh he had something alright:  COCAINE!",
            "Never heard of Visine?",
            "Ah yes, wild speculation and blurry celebrity pictures, a tale as old as time",
            "Those lights looked bright as shit. Makes you wonder if journalism like this would be irrelevant if every single person was blasted on the news. Then it wouldn't be news.",
            "Come onnnn South Park!",
            "And water is wet. Apparently he's a raging alcoholic.",
            "Can they just stop? That footage was from weeks prior to the DUI arrest. Drug speculation is ridiculous rn. But we see how they’re used against celebrities.",
            "Was he just tired or is he under some kind of substance in this video?🤔 I don’t understand, don’t have experiences with drugs.",
            "Newsflash- singer drinks beers before concert.",
            "*Britney…* Everywhere, any time, he looks around and sees *Britney.*",
            "This is going to ruin my world tour.",
            "Maybe Jessica farted on his pillow.",
            "Fucking move on, it's old news. 📰",
            "Wow. Yeah. Rich guy who lives in the spotlight and doesn’t have to work 9-5 likes the sauce? Crazy.",
            "[deleted]",
            "I appreciate the compassion in this comment. Driving under the influence is absolutely inexcusable, but that doesn’t mean I can’t sympathise with a human who’s going through it. I wouldn’t wish addiction on my worst enemy",
            "Almost 4 months without my booze head and this guy can absolutely suck it. He is a grown ass man responsible for his own actions and his own healing. He doesn’t get to cry his way out of trouble just because, surprise, he’s a human with feelings and stuff 🥴",
            "So which is it, boredom or pain? Make up your damn mind. ",
            "That’s just dumb. If you have money you can get help. \n\nIf you don’t wanna get help despite the means- that makes you an asshole.",
            "A drinking problem isn’t a problem 🥴😵‍💫",
            "He's also getting older and probably doing the maths on how much time he has been alive and how much time he has left alive. Very tempting to start guzzling down the drugs and liquor or take up extreme sports when you realise that the decades you have been alive did not seem that long at all in retrospect.",
            "Regular people have mental breakdowns at any age.",
            "Their entire self worth since children has been based on fame. Once they inevitably fall in popularity, the transition alone can be devastating. Who knows what else he is dealing with on top of that... I do feel for the dude.",
            "Getting blasted and arrested isn't a mental breakdown. Let's not just be throwing words around. ",
            "Yeah I tried listening to his last album",
            "I’d wager he’s starting to feel less relevant as well, and that’s gotta take its toll. He’s always been the young, cool pop star, and now the kids, who have always been his audience, think he’s old - and many don’t even know who he his.  I wouldn’t want to go through that.",
            "4 years just passed for me too. *high five*",
            "Some people just like drugs. It's extremely common for performers. I mean, *I* can't function with my (prescribed) stimulants so I cannot throw stones about someone doing a bump or two before they gotta perform \n\n\nI think people should stop leaping to project narratives that are coming from secondhand gossip tbh",
            "Who gives a fuck if he drinks himself to death? Cry me a fuckin river",
            "Paul is dead.",
            "What tour?",
            "Karma says it isn't.",
            "lmao Jesus",
            "Obviously you’ve never dealt with addiction or mental health",
            "Guess there are no alcoholics in Hollywood lol",
            "LOL you must be very young for talking like this.",
            "This is probably the most foolish thing I’ve read on this site in a long time.",
            "Had my 4th one a few weeks ago.",
            "Justins career is flat lining. His ex girlfriend had a Renaissance and her fanbase hates him. Allegedly he and wife are on rocks. Yeah, I think he could very easily be having a *slightly* early midlife crisis "
        ]
    }
}