{
    "ELi5 is looking for new moderators to join our team!": {
        "title": "ELi5 is looking for new moderators to join our team!",
        "score": 13,
        "url": "https://www.reddit.com/r/explainlikeimfive/comments/1d2s3tt/eli5_is_looking_for_new_moderators_to_join_our/",
        "content": "Hi Everyone,    \n\n\nELI5 is looking for new moderators to join our team.    \n\n\nIt is an excellent opportunity to help this community be better for everyone.    \n\n\nFill out this form: [https://docs.google.com/forms/d/e/1FAIpQLSdj2Uj1JJg3cDuP7suqdzn-DeCeKZX3M1NJ\\_gCGsE-m\\_HNoLA/viewform](https://docs.google.com/forms/d/e/1FAIpQLSdj2Uj1JJg3cDuP7suqdzn-DeCeKZX3M1NJ_gCGsE-m_HNoLA/viewform)  \n\n\nIf you have any questions before you apply, please put them in this thread.  (We'll only be enforcing Rule 1 for this thread, automod be damned)    \n\n\nWe don't know what kind of demand we'll have, so we can't promise an individual response for every applicant.   \n\n\nThank you ",
        "num_comments": 20,
        "comments": [
            "A few words of advice: watch out for those power-hungry mods on a power trip. This ain't my first Reddit rodeo. Good luck to whoever jumps into this!",
            "I love what you guys do! Hope whoever is the new mod continues the legacy! Kudos to this beautiful sub!",
            ">Hi Everyone,\n\n>ELI5 is looking for new moderators to join our team.\n\n>It is an excellent opportunity to help this community be better for everyone.\n\n>Fill out this form: https://docs.google.com/forms/d/e/1FAIpQLSdj2Uj1JJg3cDuP7suqdzn-DeCeKZX3M1NJ_gCGsE-m_HNoLA/viewform\n\n>If you have any questions before you apply, please put them in this thread. (We'll only be enforcing Rule 1 for this thread, automod be damned)\n\n>We don't know what kind of demand we'll have, so we can't promise an individual response for every applicant.\n\n>Thank you\n  \n  \nThis might be as good a moment as ever to ask: As a frequent user of this subreddit I've always wondered why threads/posts are always **deleted** instead of **locked**? It's not really a policy I support so that would definitely be something to discourage me from getting involved.  \nIs this just some kind of limitation of Reddit's moderation tools or is there a specific policy reason for it? All traditional forums I've ever moderated would only ever mandate to delete posts or threads if the presence of the content itself was objectionable or offensive, not if the post was merely misplaced.",
            "I know it read it once years ago, but a refresher of the expectations of a mod would be helpful. I have general interest in helping mod a sub like this....but I'm worried I won't have the time to commit to the task.",
            "Hello,\n\nI can moderate, speak UK English, am slightly left wing but it is not obvious. Am generally OK.\n\n Oh, I am good at explaining stuff to idiots, forgot to say!",
            "[deleted]",
            "I hope that I will succeed with this. I am a little bit worried that I will be judged too much for past actions on this sub. I just want to let you know that I no longer wish to come across that way on this Subreddit again. I will be working hard to try and avoid any issues from now on. Thank you for your consideration.",
            "We pass over a few of those sort of applications every time. Every application gets carefully reviewed by multiple people. We then have a trial period after accepting them where new mods are watched closely (both to help them and for oversight).",
            "Thank you, we appreciate it",
            "Hi, we delete posts that break our rules rather than locking them so they don't \"clutter\" the sub and detract from posts that *are* appropriate for ELi5. We try to direct rule-breaking posts to subs that are better suited like r/answers, r/nostupidquestions, r/outoftheloop, or r/AskHistorians. \n\nOne example is the commonly broken \"search first\" rule. If we weren't deleting rule-breaking posts, there would be an overwhelming number of questions about, for example, stocks, the stock market, investing, etc. \n\nAlso, we try not to lock posts. A question may already have good explanations, but we try to leave threads open for other discussion and further explanation. We only delete posts that break rules.",
            "Volume context might also help, about 50~% (roughly 10k a month) of submissions break the rules and a far larger percent of comments. If the sub was half uninteractable content with no answers I think that would be a worse experience for most people",
            "Any time is helpful. We don't keep track of how active mods are as long as they're active at all, more or less. Otherwise, just be communicative with the mod team.",
            "Great, good luck with the form then and we will take a look.",
            "I mean we all can but that removal is there for a reason.\n\nWe require questions to be complex, its part of rule 2. So its assumed that the question asked is a complex multifaceted topic that requires thorough explanation. Generally speaking an explanation has 3 parts: a context, a mechanism, and an impact. Short answers give 1-2 parts and leave the rest to be inferred by the OP.\n\nIf you can give a full explanation in less space than the bot allows then the question breaks rule 2, and if the question doesn’t then your explanation is very likely lacking.\n\nIt is one of our most accurate filters.\n\nAlso please do take a look at rule 4 just in case.",
            "Good luck. \n\nRecruitment has been really hard this last 18 months or so.",
            ">Volume context might also help, about 50~% (roughly 10k a month) of submissions break the rules and a far larger percent of comments. \n  \nThanks for the context.  \n  \n>If the sub was half uninteractable content with no answers I think that would be a worse experience for most people  \n  \nEdit: I will tentatively agree with that. But my main concern is not with unanswered threads but with threads that are in violation but remain visible for long enough to gain hundreds of answers. Those *also* get deleted eventually, and that's just so much wasted effort.",
            "Understood.\n\nWe get 1000's to 10's of 1000's of posts and comments a day and as a limited volunteer mod group we rely on our users to assist with reporting any threads that may violate the rules. \n\nSometimes it can take a little time for us to see and review them thus the build up of comments. It is unfortunate and we hate to do so but if they break the rules then for the reasons already mentioned we have to remove them.",
            "They do, we need more mods to help catch those earlier, hence the recruitment to address exactly that.\n\nOtherwise we don’t want to rule by popularity rather than the actual rules",
            "We also struggle with coverage for all time zones."
        ]
    },
    "ELI5: What is “Russ”, and why is it such a big deal/so expensive in Norway?": {
        "title": "ELI5: What is “Russ”, and why is it such a big deal/so expensive in Norway?",
        "score": 908,
        "url": "https://www.reddit.com/r/explainlikeimfive/comments/1dlexpz/eli5_what_is_russ_and_why_is_it_such_a_big_dealso/",
        "content": "A friend lives in Norway and told me that these parties can go on for an entire month straight, and cost upwards of $100k to do including everything. What exactly is it, and why do people do this?",
        "num_comments": 204,
        "comments": [
            "Yknow how you have like, individual high school graduation parties?  Imagine if instead of individual parties, all of the highschool seniors in a whole town (and their families) threw one giant continuous party starting around final exams and then going on after school ends for a while.\n\nso its not necessarily each individual person partying for weeks straight, but more just none stop parties going on broadly. Plus unlike the USA they can legally buy their own alcohol, so there isn't anything stopping them.\n\nSo its not one single family dropping 100k on a single party, its 1,000 18-19 year olds all spendng 100 bucks each, sometimes more.",
            "To celebrate being done with high school and be ready for the adult life.\n\nTradition went apeshit after entrance of \"russ\"-merchandise private companies selling shit at outrageous prices: special russ-uniform, \"business cards\" with funny personal quote, etc.\n\nThere is also some competition about having the best russ buss, which is often sprayed with crew specific concept art all over. The buss is modified to have a lounge like long seats, disco lights and absurd sound system.\n\nPrep for this month starts a year prior, these days, and carefully planned. With up to several pre-releases and a release of concept.\n\nThe whole tradition got messed up all sideways lately. Buss crews asking underage girls for sexual favours to be able to \"roll\" with the crew on the buss. Hard drugs being used by 18 year olds and often underage youth as well. Most of them are basically functioning alcoholics for the time period, with rational exceptions of course. There are often cases of rape, with it being filmed and spread on sosial media.\n\nIts fucked up, imho. It wasnt like this. There was alcohol and doing inocent weird pranks on each other, but not like what it is today.",
            "It really depends on where in the country you are and if you are part of a bus or not.\n\nI used to know someone that rented out sound systems to busses from the Bærum area around 20 years ago.\n\nHe charged something like 200 000 dollars for renting the equipment to one bus for 1.5 months. It came with a security guard that made sure the equipment was fine.\n\nOutside of the russ season he rented the equipment out to big concert arenas for bands like Ironmaiden and Rammstein, for a much cheaper price.\n\nMe on the other hand got the outfit, the business cards and some trips, probably spent about 600 dollarish on non alcohol related stuff.",
            "Imagine it is the last 3 months of 13 years of school and THE most important exams of your life to date is comming up rapidly. These exams determine if you get the grades to get into pre med or law or any other higher educations. Most would buckle down and study day and night. Norwegians though.... PARTY TIME!!! You then join a team usually red or blue and get into your chosen color jumpsuit and hat and you do challenges. Some of them innocent like wear a pyjamas to school. Others are more sinister like be drunk for 3 days, have sex with X partners, to the more problematic kidnap a russ on the opposing \"team\" (most times with concent, sometimes not...) or perform a stunt like \"hide and sleepover\" at IKEA. For completing these challenges you get an object in your hat like achievements for all to see. This though is not the main issue and is fairly cheap and traditionally a group of 4 or 5 Russ would buy a wreck of a old van and pimp it up. Team colors, art, group name and a few speakers to blast music all night long. This was usually not a huge cost, vans bought from the scrapyard and some paint was 2 grand at most but in the last 10 years or so there is a trend to forgo the shitty van and instead 15-20 Russ will buy a party buss (still from the scrap heap) with heavy metal concert level sound systems, dance floor and roofdecks and what not. Oh and a driver because you all are obviously to young to get a bus license and besides you all are drunk anyway. This can quickly add cost up into the 200-300k $ area and as the busses are leased from specialised firms at very sketchy leasing contracts, many Russ are stuck neck deep in debt after graduation. Because of laws, only one person can sign the leasing contract and is then finansially responsible. This makes them the chief of the group collecting money from the members. But every year there are examples of a group exployting or pressure someone into signing the leasing contract and then to bail on them leaving them stuck with the entire loan and this happens fast, 200k divided by 20 might be doable but if that goes down to 17 the cost is rising and it is a rat race to leave the group and the poor sod who signed the lease cant leave! And believe me he will not get a new group...",
            "Regarding expensive:\n\n\nNorwegians grow up in schools, being told that everyone is equal. And then breaking it all to pieces by dividing into society classes and groups at the end of their graduation. ",
            "I happened to be in Norway at the right time a few years back and asked what was going on with the teenagers in certain clothes etc and Russ was explained to me.  \n\nOne point I didn't understand - I was told that it was generally *before* final exams.  Is that right?  It would seem weird.",
            "The lavish and expensive nature of it is mostly contained within the south, mostly area around Oslo. They get party buses with massive sound systems and customs songs for their buses, spending a million kr + in the process. \n\nUp north some people buy a junky van, give it a paint job and that's it. Most people don't buy anything apart from the uniform and cards. More modest, but still plenty of partying",
            "Here’s a music video filmed during one 10ish years ago. It shows what many people have already described: [Big Day - Torgny](https://youtu.be/9IgXCBKIf7A)",
            "Wait, why didn’t you just ask your friend?",
            "Are you asking what all the Russ is about?",
            "In Australia, we call it \"schoolies\".",
            "Slightly incorrect: adjustments and additions.\n\n\nThe period is oficially somewhere between 20. April and 17. May, it varies from county to county. Final exams are from 19. may to sometime late june. (Atleast they were this year, trust me i would know)\n\nThe partying often starts a year earlier. Typing this from an afterparty where a group of \"Russ\" of 2026 launched their celebration. They mark the start by getting custom clothing and logos. \n\nPlanning of the russ-time can start as early as middle school in oslo. Thats 12-13 year-olds planning.\n\nA big thing the past 20 years is Russemusikk = Music made for the groups. Big name artists will make a generic song with dirty lyrics, sell it the group for anywhere between a couple of hundered, to tens of thousands of dollars. No, the group doesnt get any royalties, at all.\n\nVery very few groups spend less than 1000$ per person. Its common in Oslo for the big groups to spend tens of thousands each to pool together for a bus.\n\nRuss is not a new concept, its been around since 1905, but the traditions have changed slightly. This isnt some new flashy things the kids are doing. Pretty much every single norwegian alive has been Russ at some point. But there are discussions these days about how some of the norms have been taken to an extreme. There are a lot of drugs, hard partying, violence and sexual assault.\n\nIts too big to stop now, there is only room for regulation",
            "Some save for years for a bus too, don't forget that",
            "This person has not been on a «satsebuss» in Oslo. Minimum spend pr. Person on a high end party bus is easily 10K$. With 30 people on a bus, you get a sound system approaching a Metallica concert. Another bus may specialize in light system and lazers that lights up the entire night sky.",
            "Why the FUCK don't we have this in America? That sounds right up our alley.",
            "I thought that was a bus",
            "> Yknow how you have like, individual high school graduation parties? Imagine if instead of individual parties, all of the highschool seniors in a whole town (and their families) threw one giant continuous party starting around final exams and then going on after school ends for a while.\n\nWait, is this not common?  The high school I went to in New York (~25 years ago) wasn't an entire month, but it was a weekend.  Do people really just have a bunch of separate parties now?  I mean, we did usually have a separate \"family\" party for a few hours on Saturday afternoon, but the rest of the time there was a just a communal party going around the clock for a few days.",
            "Story my uncle told me from being a russ in Oslo in the 70s.. Talking about the atrocities of the russ recently..\n\"oh we never did anything wrong like that. We just got drunk. Smashed bottles and pushed a fire engine into the Oslo fjord.\"..",
            "And the expenses are insane these days. Each buss also has to come with professionally designed logos, shirts, and a theme song commissioned from professional artists, based on the name of their buss. And as you said, they have multiple \"pre-release events\" where they'll hire a venue to host a party to announce their new name (or their \"cover name\", which is the name they'll use before they release their real name??? honestly I don't know what that's about), their logo or their song, which they also have to pay for.\n\nIn addition they have to hire bus drivers for the entire period. These expenses quickly rack up, and I've heard groups spending between 1 million and 3 million NOK ($100K-$300K) on the entire period, divided between the group, and that doesn't include expenses for alcohol... which is famously expensive in Norway as well.",
            "So like Rumspringa but a couple of years later..",
            "Are you from Norway? Sounds like you know a lot about this.\n\nThe first and last time I heard about it was on the series \"Beforeigners\".",
            "Damn, we just saw lots of kids drunk in the park and an outdoor rave with a Viking ship for a stage",
            "Stupid question, but what happens to the Russ bus at end after they've put in so much effort customising it? They just sell it again?",
            "The Nordic countries have this pretty sterling perfect reputation internationally.  They always top lists of best places to live / happiest countries.\n\nSo...uh....wow",
            "Back when I was young, we just drank beer and smoked hash and slept in various parks.",
            "I think  you mean 200k NOK and not 200k dollars which is way crazier lol",
            "100%",
            "Are you saying there's classism in Norway?",
            "It's stupid, but I suspect it's before the exams because after, well, you're done. People are out of school and start doing other things, so they disperse a lot more than when still in school, so you start losing that communal feeling.\n\nAnd at least when I was young, people wore the Russedress (red or blue jumpsuit personalized with art/stickers/graffiti/pins whatever you want) wore them to school for several months the last semester. The really hard partying didn't start till nearer the end, but we still did stupid stuff together as Russ well before that.",
            "Its because it originally wasn't, then it just hasnt changed because it matches up with our constitution day may 17th. Previously this would have been after exams, but today its before, but seems most people dont want to get rid of the parties leading up the big day.",
            "Yes. Most sensible people party after exams, but this is Norway. They border Russia so some of the stupid has rubbed off onto them",
            "You would, Australian people add \"ies\" or \"ie\" to everything. Schoolies, brekkie, mozzie, tossie, brissie, sickie...etc if a sentence can have a word ending with ie or ies the aussies will find a way to incorporate it. ",
            "It’s a bit different from schoolies. We party for a week, the Norwegians party for 5 weeks. I also think the intensity of schoolies partying (at least the conventional Gold Coast one that I attended) is a lot higher than the intensity of Norwegian russefeiring. I was listening to a Norwegian person discuss it recently, and it sounds like much of the celebration involves silly dares and stuff, not necessarily sinking piss and doing fucktons of drugs for 5 days straight. Of course, many schoolies celebrations are much more lowkey than that.",
            "Thats one of the most Austrialian things I've ever heard. Very cool 😎",
            "In Ireland it’s the Debs (debutantes ball)",
            "TISM taught me that, in Hell, it's always Schoolies Week.",
            "There's schoolies, but i also had the week after final exam where anyone who had 18th birthday during the exam block threw a party, plus the textbook burning party, plus the rich kids having graduation brunches thrown by wanker parents/grandparents. Turning up to those still half cut from the night before and cracking open a longneck ruffled some feathers.",
            "Bloody yanks thinking theyr the free-est in the world. Meanwhile it's just generally accepted that once year 12 is finished all year 12s spend a week getting blackout drunk and fucking shit up. And thers not a godamn thing the cops can do about it because half of em can buy booze legaly and the otherhalf are allowed access to it as long as they are not in line of sight when it's bought.\n\nGod bless ausie.",
            "Aussies were the only humans I knew whose parents intentionally sent them money for coke in college, like very routinely. \n\nI am not saying that's an across the board custom but when you guys throw down for the party, you throw down real hard.",
            "> The period is oficially somewhere between 20. April and 17. May, it varies from county to county. Final exams are from 19. may to sometime late june. (Atleast they were this year, trust me i would know)\n\nOk now in English",
            "That would require a sense of community and collectivism. So i don't see it happening.",
            "Imagine giant neighborhood sized parties that go for weeks.\n\nNow add guns.\n\n'Merica",
            "Groups of Russ will get together on buying a worn out bus, or smaller groups typically a van, fix it up, outfit it with insane loudspeakers and decorate it, and use it for partying. There are nationwide \"Russetreff\" where Russ from all over the country gather for massive parties, so having transportation you can sleep in is a bonus. They hire a driver to drive them as they will be too young (and too drunk to drive it themselves), so that adds to the cost. Then they (hopefully) sell it to the next years Russ when the partying is over.",
            "That's a pretty common thing, even if it's just a 1-2 day event. The Danish one would be easiest found with studenterkørsel. Where they drive to family's houses for mini house parties, to top up the drinks, use the bathroom and grab some party food, and then move on to the next, until they eventually get on to the final stop, either a pooled cost event or put on by the most well-off family with fireworks and a real proper house party. Often of the American teen movie style, then followed by a slightly shorter reverse drive dropping all the kids back off, with some staying together either for comradery, friendship, or to not wake their families.\n\nThe more hardcore ones end up being multi-day events, or whittle down into some of the more hardcore members doing smaller scale (but still easily 20-30 kids), partying till their bodies can't take anymore. That said though, it's not uncommon in Denmark to party hard literally till 7am, and then just keep going throughout the day with a bangin' garden party, or bodega (day bars) crawl, till everyone starts again.",
            "Yeah 70s/80s were entirely different. 90s was toying with boundaries (as youth usually does). 2010+ has really rolled down hill.",
            "The vast majority of russ don't really do this. It's mostly an Oslo snob thing. At least not to this level. My school just had one song for everyone and it was half homemade with lyrics roasting other schools. No one had busses at all in my city. ",
            "Extremely similar yes.",
            "I am from Norway indeed.\n\nTo mellow out my previous post: I only hear the sick shit from these celebrations, from parents whos kids partake, their friends, and what norwegian press writes about it. There has to be good stories with people celebrating i civilized, moderate ways.\n\nThere is also something new this year with youth refusing this tradition and not celebrating (in that way), so there is hope this train switches lanes in the future.",
            "You can tell by how he is butchering *written* english that he has a thick scandinavian english accent as well.\n\nAs for on topic: people complaining in this thread are just detached. It was equally wild and kids were equally stupid 15 and 20 years ago. The main difference is that now is that inflation and wealth inequality have made it more expensive and *all of it* ends up on social media for *everyone* to see. \n\nAll the degenerate stuff people are complaining about has been happening since the dawn of time, it is just more visible through social media.\n\nThe cow forget it was a calf.",
            "Yes, sell it for next year's russ. ",
            "I spent a few weeks in Norway a couple of decades ago. Their attitude to alcohol seemed to be the opposite of Southern Europe. They are sober all week but once they start partying they don’t stop till they drop, literally.",
            "*Most* behave, just to be clear. But the outliers seem to have gotten a lot more extreme than when I was russ (1998).",
            "This the one fun moment in their lives",
            "Really? Like in the US? I don’t think in Europe there is any place that still sees them like that… too many tourists and internet for it. They come across as having massive drug problems ",
            "He rented this out for 2 000 000 nok.\n\n\nBest of the best equipment, plus 24/7 guard service, plus overpricing it as mad since the people renting it was 18 year old boys desperate to one up each other's, and used to having daddy paying for everything.",
            "Where isnt?",
            "And \"o\", so bottle shop == bottlo. My mate Dave, Davo.",
            "Electricians are sparkies, firefighters are fireys. I like those.",
            "What the fucks a tossie? That's one I've never heard",
            "Heard a U-turn being described as “you-ie”. Have claimed it as my own.",
            "Orgie",
            "It sounds stupid when I say it in my American cornbread accent, but a lot cooler in an Aussie accent",
            "The more civilised parts of Australia call it \"leavers\".",
            "We apologise for selfie though.",
            "TIL I’m actually Australian.",
            "Cozzie: Swimming costume",
            "Scousers also do this.",
            "Can confirm.",
            "I see you've played knifey-spooney before",
            "Yeah, I've seen that in the *movies*",
            "Rexy.",
            "Barbie. Never knew if it was the puppet or roasting over hot coals.\n\nor roasting a puppet over hot coals.",
            "The same thing happens in Dutch with ‘je’ or ‘tje’ at the end of words.",
            "Yea, it's fucking stupid.",
            "Deb Balls in Australia. Still done in some country areas.\n\nThey also have B&S (Batchelor & Spinster) Balls.\n\nhttps://www.independent.co.uk/news/world/australasia/bachelor-spinster-ball-dating-app-modern-romance-australia-a9217251.html\n\nFor some of them people travel hundreds or thousands of miles across remote Australia.",
            "At $300 a bag over here and also when the quality we get is a bit how ya going, it can get expensive real quick.",
            "We don't typically go to Colleges in Australia, and cocaine is not that prevalent in Universities. \n\nStudents can't afford that shit.",
            "\"20. April\" is read as \"20th of April\"",
            "This makes sense to me as a Brit?\n\nWhat's difficult about it goes from 20 April to 17 May, varies from county to county and final exams are from 19 May to late June?",
            "And also legal drinking at 18.",
            "Too young to drive but old enough to drink?",
            "You couldn't get an audience back in the '90s and before. Now you can do something edgy and millions of people from all over the world can not only signal their approval but copy you.",
            "Every older generation has complained about the next generation going to shit for as long as I’ve been alive. But over time all the youthful indiscretions of those prior generations are forgotten and it’s always only the latest one that is out of control.\n\nIn reality it’s an old vs young thing not a generational thing. People just forget their own recklessness as they get older.\n\n(Also, statistically youth these days are actually engaging in *significantly lesss* risky behaviors such as drugs, alcohol, parties, and sex. It’s getting better.)",
            "I'm too young to be saying this.. But the world's going to shit.",
            "*downhill*",
            "Oh a person with hope for the future at all... I want to have a little bit of that\n\nCan I borrow some from you?",
            "I'm not a native speaker, I can't tell. I don't mind either 😄",
            "When alcohol is so expensive you have to make drinking really worthwhile",
            "I realized 2 years ago that I had an alcohol problem, similar to the nordics:D\n\nI never drank during normal days, no craving at all. But as soon as I went to a party - I started to drink and only stopped in the morning when the party was over. Full blackout binge drinking. Then no alcohol for a month or so, but I never partied without being wasted as fuck in the end.\n\nDid a year completely without alcohol, celebrated my first sober new year in 17 years.\n\nNow I drink a bit again, but wasn’t once really drunk in the last year. Not a single hangover or blackout :)",
            "Statistically Scandinavia are still the best countries to be born in. No idea where you're getting the drugs thing from. ",
            "Yes, US.",
            "Oh my... As a Sunnmøring this is madness",
            "Smoko! (so leave me alone)",
            "Servo",
            "There's a bunch of Davoies waiting outside, should I let them in?",
            "We save two O's every time we say G'day. We have to use them somewhere or they'll just keep piling up.",
            "Oreo",
            "[Veebees - drive thru bottlo](https://youtu.be/d23wF54Z9vE?si=TGXrOvLRGflRjPHS)",
            "Carpenters are Chippies, and Mechanics are Clankies.",
            "Not sure if this is really all that related but the game \"Still Wakes the Deep\" taught me that Scottish people sometimes call electricity \"elecc-y\" (as in an electrician saying he's \"good with elecc-y\")",
            "Postie delivers the mail.",
            "Builders are brickies.",
            "Well a real dickhead is a Tosser?",
            "Dunno but I think I had one earlier.",
            "When you toss someone’s salad. ",
            "And the only way to do a uey is to chuck it. You always chuck a uey.",
            "Minnesota has entered the chat.\n\nDon't steal \"whipping shitties\" for doing donuts. THAT'S OURS!",
            "This is for sure a thing in the part of Illinois I’m from. We usually pull them.",
            "A U-ie seems to be pretty universal across the English speaking world, with the only variation being the spelling and the verb (in Massachusetts we use \"bang\" and \"pull\" a U-ie).",
            "bang a u-ie in the UK",
            "That's one we use in Canada, at least where I am (easterners might be different).",
            "This one is also common where I am in Canada, always called them that growing up",
            "Everybody whips uies, hopefully most of them ain't got duis.",
            "Mate you can't just claim a uey.\n\nJust chuck one like the rest of us after fangin it down the wrong cul-de-sac.",
            "You chuck a uey.",
            "In Canada we say this too, or alternatively, pulling a shitty.",
            "What like you're leaving the country? 😂",
            "Fuck off we do.",
            "Boardies.",
            "Isn't $300 like pre-covid pricing?",
            "[removed]",
            "It's the periods.\n\n\"20. April and 17. May\"\n\nIt's crazy to me that this simple grouping of words is somehow the norm for most of the world.\n\nWe all know what a period means. This use of periods is literally the exact opposite of what a period is. (ending a sentence)",
            "Too young to get a commercial license for a full size bus (which is 24 iirc). But old enough to buy beer and wine, or drive a regular car/van(18)",
            "> millions of people from all over the world can not only signal their approval but copy you.\n\nWorse. Not just copy you, but try to upstage you. That's when it starts spiraling.",
            "Honestly, might be true for alot of places. But the nordic countries have never been as infested with hard drugs and sexual violence/assault as they are now and it is just rising. \n\nHell when I was a teenager we drank alot, some smoked cigarettes and there where a group of around 15-20 people who smoked weed in my age group (around 450 persons) and small town of 15000 inhabitants. (so everyone knew what everyone did in the same age group).\n\nNow there is a rampant problem already in what we call high school (13-15 year olds) where drugs like weed and amphetamine is only 2-3 telegram connections away and almost 1/3rd of the kids have come into contact with drugs before the age of 15(!). It is insane.",
            "> But over time all the youthful indiscretions of those prior generations are forgotten and it’s always only the latest one that is out of control.\n\nI wonder how that changes with this generation where the youthful indiscretions were recorded on video, could have been seen by millions of people instead of just whoever was there, and have the potential to resurface at any point in your life.",
            "Tbh its always been going to shit in its own unique way, the information age just makes it REALLY in your face.",
            "I am including alcohol in that, if it helps to understand ",
            "👍 We also idealise Texas and California, I guess it’s normal ",
            "Ja, fra Vestlanded. Me festa ein go del, men russebussen var ein gammel varebil som me kjøpte fra folk fra året før, og dekka til med lokale sponsorer.\n\nYeah, watch the NRk documentary Russejentene for an insight into how \nbad it is.\n\nIt followed an all girl bus from Bærum that spends months working on their bus, and a large amount of cash per girl.\n\nThey meet up with them the year after to see if it was worth it, and I think 90% of them answered the question \"What have you done since you were russ\" with \"Backpacking in USA/Australia/Asia\".\n\nThe people with busses that cost them millions of KR are not living in the same world as the rest of us.",
            "The Chats go incredibly hard",
            "Sat atop his milk crate throne?",
            "Opera Man! BYE-BYE!",
            "The Chats! Good choice!",
            "Crow",
            "TomServo?",
            "That hurt to read it was so terrible\n\nTheres a coupla daves outside, someones gotta lettem in",
            "Oh-oh",
            "Australians have a lot in common with my three year old apparently.",
            "All under the big banner of tradies.",
            "A lot of these are British too. Brickies for bricklayers is another.",
            "I love it.",
            "you sure it wasn't 'leccy? I've never heard \"eleccy\" before",
            "Tosser is common yep (it's the same as wanker), just never heard Tossie.",
            "From the US South and I \"cut\" a u-ie",
            "Bangin' a uey is also acceptable vernacular.",
            "Drinking from a shoe, the shoe-ie",
            "We flip ueys round these parts.",
            "I've always flipped a uey",
            "Or if you're feeling really fancy, you \"yuck a chuey\".",
            "They can also be banged.",
            "There's a surprising amount of chucking. You can also chuck a Sickie.",
            "No that's a doughie",
            "Also, IL and the term is to pull a Uey.",
            "Boardies are my cozzies.",
            "It's still $300 a bag but the size of the \"bag\" keeps getting smaller and the gear keeps getting more cut. Back 10 years ago a \"bag\" used to actually be a gram and it was half decent (by Australia's shitty coke standards anyway). \n\nThese days you're lucky to get more than 0.7 and it's usually cut out heaps with benzocaine so your gums go all numb and your teeth tingle but the gear itself is shit and doesn't have that strong gasoline smell the good stuff has.",
            "[removed]",
            "[removed]",
            "[In norwegian periods are used on dates.](https://sprakradet.no/godt-og-korrekt-sprak/rettskriving-og-grammatikk/tall-tid-dato/)\n\nImagine getting hung up on english grammar in a comment by a norwegian giving context about norwegian behavior.",
            "Hm, we'd also use to indicate something had been shortened (Mrs. Blah, No. 4, etc), and I guess I am used to European notation so my mind just recognises the full stop as \"th\" even though we wouldn't necessarily write it that way. \n\nI get it though, guess it's what you're used to, like I have to remind myself if I'm reading something in American English because I'd assume \"April 20\" would be April 2020 (as opposed to 20th April) or that e.g. 6/1 would be 6th January.",
            "It's not the normal in England, but it's also pretty easy to derive the meaning via context. Periods have a variety of uses even in English, such as in Mr. Jones it's not an end of sentance, it's a mark of abbreviation. That's effectively how it's being used in the date format.",
            "The period in this context denotes an ordinal. 20. april basically means 20th April, which is the order dates are said in Norway.",
            "Putting periods isn’t the norm. But hardly worthy of asking for it again in English. It’s a big varied world and not being able to cope with something so trivial seems very provincial.",
            "The world is better than its ever been, all good metrics are up and bad metrics down.\n\nMedia may make you think otherwise, but by far its the best time to be alive.",
            "The world is just fine. It’s humanity that’s going to shit. It only takes a couple super volcanoes and another good asteroid hit to erase any evidence of our existence. Maybe radio waves will be captured. And there’s always the voyager disc.",
            "Where are you from?",
            "I’m L.A. bred and spread and I’ve scene a lot of the world, but I mostly love it here. The crime and homelessness is not as bad as portrayed, but yeah, it’s a big city. Big city problems. I love that you can, for the most part, be openly gay, trans, Orthodox Jew, Muslim, black, Latino, body modified, or upside down, and not be harassed. (I’m not naive. Of course all of those groups have suffered discrimination and harassment in Los Angeles. But compared to other cities…)",
            "Can’t forget the Cosmic Psychos",
            "CrOwO",
            ">daves\n\nDazzas",
            "Yeah it was leccy lol, just watched a play through",
            "Also from the us south, we pull uies",
            "west coast, we \"flip a u-ey\" or \"flip a bitch\".",
            "Midwest, I typically \"bust\" a uey",
            "correct, you gotta bang then",
            "Love this song: https://youtu.be/Ul_krInglTw",
            "Fkn Kev is a sicko",
            "Lmao, glad I never got into that shit here.",
            "[removed]",
            "[removed]",
            ">\"In norwegian periods are used on dates.\"\n\nOkay, but we're not speaking norwegian.",
            "On average, yes. Longer life expectancy, higher average/median happiness, much better technology available to 90% of the earners and not just the top 1%. But that doesn't mean that some specific details don't get consistently worse: you see all Norwegians here complain about teenagers doing hard drugs more every year, which I totally believe, and I can point at my home country of Russia going to shit in a myriad of ways. Even if you don't get shot on the street anymore like it was in the '90s Russia. Almost every Russian will tell you that the country is now much better than it was in the '90s, and yet in the same breath we will add that it has been going to shit for almost two decades at this point. This is not a cognitive dissonance, this is different metrics.",
            "Darren = Dazza\n\nDave = Davo",
            "Southern Ontario — ditto!",
            "From Jersey/NY, also pull ueys",
            "PNW raised, I pop a u-ie.",
            "I've heard this one too. It's like an alternative one I pull out sometimes",
            "This. We flip u-ey's",
            "Kev fucken banged out like 5 fuckin doughies in his falcon outside the servo before the pigs came mate\n\nDurry in one hand vb in the other you shoulda seen this shit he's a sick cunt",
            "He's not writing an assignment for an american english class either.",
            "Also Southern Ontario. I’ve never heard of “pop” or “cut” but I have definitely heard “pull” a U-ie. However, my family usually said “make” a U-ie.",
            "In New England we pull them, too.",
            "Same here and occasionally throw in \"hang a u-ie\"",
            "Canadian; also flip u-eys.",
            "Hang a lap\n\nChuck a uey\n\nBum a durry\n\nDrink a shoey\n\nScull a longy\n                                                     \nPull a sickie",
            "We make 'em in my part of Canada.\n\nMake a youie."
        ]
    },
    "ELI5: Explain to me how QR codes work": {
        "title": "ELI5: Explain to me how QR codes work",
        "score": 396,
        "url": "https://www.reddit.com/r/explainlikeimfive/comments/1dljuil/eli5_explain_to_me_how_qr_codes_work/",
        "content": "I understand the code itself is a different make up of black/white grids to get your phone to recognize a linked site. But at some point won’t we completely run out of possible image combinations making them obsolete or is it something that regenerates a new site to QR connection? (On mushrooms so I might not have asked this very well lmao)\n\nBasically will we run out of QR codes and if not how is there an endless supply? ",
        "num_comments": 120,
        "comments": [
            "The thing about QR codes is they aren't just a short code that links to the URL, they are the entire URL. It's the equivalent of converting the URL into binary and then drawing the resulting 1s and 0s as black and white squares.\n\n\nTherefore as long as we don't \"run out\" of URLs we won't run out of QR codes.",
            "Think about a UPC code, those stripes you see on packages at the store.  How those work is the thickness of the stripe encodes information, black lines are 1 and white lines are 0, so the computer scans it and sees something like 0001010100010101010110111010100101.  That's just a number, and computers are good at taking numbers and looking on a list to see what the number is for.\n\nThe QR code is like a two-dimensional version of that same thing.  Because it's 2D, they can pack more 1s and 0s into the same space, so it can include letters and other stuff instead of just numbers, which is why it's used instead of a really long bar code.",
            "QR code is more of an font than anything else. It doesn't link to anything. It's just a text written out in this specific \"font\". \n\nYou can use QR codes for many different things than just urls. You can have ones with text, image, game,....\n\nYou can fit in them about 4296 alphanumeric characters, so that should give you a lot of combinations.",
            "So one thing to keep in mind: QR codes are just a way of writing something (such as a url to a website) in a way a computer can easily make sense of it reliably. That is to say, QR codes are not \"linked\" to anything, they're just a different way to write. You can use a QR code generator yourself to try it out and note same input always gives same QR code.\n\nNow to answer your question, QR code combinations, that is to say, all the ways we can arrange the black and white squares to make unique messages, depending on standard, amount to more than there are atoms in the universe, so, in theory yes, in practice no.",
            "The most primitive QR code standard has 10^132 possible combinations, which is 10^52 times as many atoms in the observable universe. Since then, we have upgraded the standards to hold much more data. We will never run out of combinations.",
            "QR can store arbitrary information. Small black squares represent 1, white squares 0. This way you can directly construct binary numbers from it. These binary numbers can be a text (see ASCII table that converts 2 digit hex number - which is 2x8 binary digits - to a single character like 'a' or 'X'). That's how you can encode an URL or any other text into QR code.\n\nHowever, you and me, we can create our own system, e.g.:\n\n0000 ...hello  \n0001 ...something bad happen  \n0010 ...I will come to you  \n0011 ...do nothing  \n0100 ...how are you?  \n0101 ...good  \n0110 ...bad  \n0111 ...afraid  \n...etc.,\n\nand then we can encode a message (one or more of these) into one QR code. So - we can create an app for us that will take that text, convert it to those numbers & those numbers it will put into QR code. On other phone, the same app could scan the QR, get those number from it and then convert those back to the original text.\n\nQR codes can be big and store a lot of information. See  \n[https://en.wikipedia.org/wiki/QR\\_code#Design](https://en.wikipedia.org/wiki/QR_code#Design)\n\nInteresting thing is also that QR codes are immune to damage or imprecise reading by the camera. Simple idea behind error correction codes is that you put there some additional information that helps in guessing what was the original, i.e. let's encode just two words: \"yes\" and \"no\" like this:\n\n00000 ...yes  \n11111 ...no\n\n...then the message:\n\n00100 00001 00111 11110 01001 10111\n\nwas probably \"yes yes no no yes no\". If you receive e.g. \"00111\" it is more likely that it was \"11111\" than \"00000\".",
            "QR codes are just zeroes and ones, black and white that can be converted from binary to text. You can cover up some of the code because some of the bits in the image are for redundancy and you can use some fancy math to fix the code. There are different sizes of QR codes so you can fit more content in them.\n\nIt is basically just the link or any other piece of text as ones and zeroes plus some extra to repair the text.",
            "Answering the \"can we run out of qr codes\" part.\n\nCould we? Yes. How many combinations are there? Yes.\n\nThere are bigger qr grids, different encoding methods, different ways to do error correction... So you can create different qr codes that contain the same data after coversion.\n\nThere are also useless qr codes: like creating a code for the text AAAAAAAAAAAAAAAAAA. So there are millions of qr codes that are already wasted.\n\nOr unreadable codes, imagine a checkerboard pattern. You can't read that (even if it had eyes and the 010101010 connecting lines between the eyes. Yes all qr have, by definition, lines of alternating black and white dots between the \"eyes\" of the code). A checkerboard pattern wouldn't have a header to tell the size, encoding and error correction used. There a million of patterns that would not result in a complaining qr code.\n\nYet, there's still millions of ways to create different URL addresses, presentation cards, mail addresses, WiFi info and all the other stuff a qr can contain like, even a game... https://youtu.be/ExwqNreocpg",
            "Alphabet only has 26 characters, we're yet to run out of \"combinations of letters\" that are useful to us.\n\nA QR code can store kilobytes of data.",
            "Can we ELI5 what happens inside your phone when you open your camera app and it suggests the url? It’s a computer vision problem essentially. But it’s presumably looking for the corners and then determining the “bits” within that frame. Is there more to it?\nDoes every phone use the same CV algorithm?",
            "QR code is simply a \"pixelised\" version of a string of characters.\n\nBasically you start with the string you want to put: HTTP://REDDIT.COM then convert that into binary. To do so, you use the [ASCII table](https://www.asciitable.com/). This is a standard dating from the early computers that map each characters to a number. The result would be: 01001000 01010100 01010100 01010000 00111010 00101111 00101111 01010010 01000101 01000100 01000100 01001001 01010100 00101110 01000011 01001111 01001101.\n\nYou then add some more zero to fill up the space for the desired QR code size. You can't have unused space, so you fill it up.\n\nThen you take that, and encapsulate it into the QR stuff, which add some more informations and length and also some error detection and recovery data. The error recovery and detection stuff add more bits that allow to detect and fix some of the errors. It do so by adding some redundant data and some cleaver stuff.\n\nNow, you pass those 1 and 0 into some encoding scheme. Basically what it do is prevent too many of the same value to be in a row, for example (not sure of the exact encoding), it can say that if there is more than 3 of the same values in a row then you invert the next bit. So if you have 1111000 you get like 11100010. This prevent a long space that is all black or all white and help to figure out the bits.\n\nAnd finally you generate the white and black dots, with the QR decoration stuff in the corners and center. The decorations in the corners are to identify the orientation of the QR code, so it read it the right way. Also, the decoration in the center actually destroy some of the data in the QR code, but that data is recovered via the error detection and recovery mechanism. It therefore reduce the reliability of the QR code, but since it work many do use it. It just mean that damage to some other places in the code will probably make it fail to decode, while it may have been able to be recovered if that center part was not there, as it would have more recovery data present.\n\nSo will you run out of QR code? No, because the code contain the information itself and is generated based on that, and is not an ID of some sort. And this is also why there is different QR code size, some contain little information, so can be small, others is huge because it contain alot of informations.",
            "People are saying it’s just binary but if you’ve got a QR code which has a resolution of 25 x 25 (I.e 25 bits in a row that can be either black or white (1 or 0) that results in 500 bits, 62.5 bytes of data does it not? \n\nDoes the QR code architecture have some kind of built in data compression as well?",
            "Humans can communicate in different ways. For example, if we want to talk about a bird, we can write the word \"Bird,\" use an emoji 🐦, or show a drawing or picture of a bird. All these things mean the same: Bird.\n\nQR codes work in a similar way. They are like a special kind of writing that machines can read and understand.",
            "[deleted]",
            "This is partially correct. QR codes are a standard formated way to represent some data as an image of black and white squares. There is a data limit for what can be stored as a QR code so not all urls in existence are possible to be stored but most base routes are. Additionally you can store more than just a url. You can store various types of data. It just so happens that if you store the data for a string that is in a url format your phone is smart enough to recognize the URL format and redirect you to that url",
            "Ok well that answered that! \n\nSide quest question: is it possible to run out of URL’s? 😂",
            "Also, QR codes aren't necessarily a URL.\n\nThey can encode WiFi credentials (SSID and encryption settings)\n\nThey can encode vCards (name, phone number, email address, etc) or even just a standalone phone number or email address.\n\nOr they can just be freeform text/data.",
            "Where's the guy that embedded the game Snake into a QR code? We need him now.\n\nEdit: got 'em! [Snake QR](https://www.reddit.com/r/programming/s/RiPtsfwptG)",
            "in fact, QR codes do not represent URLs, they represent text. that text can be a URL like \"https://.....\" or a text like \"hello world\".\n\nyou can try it yourself with some online websites like https://www.qr.io",
            "That is incorrect. QR's aren't urls, they are just a string of data.",
            "Theoretically then will the QR codes just get bigger?",
            "What about those codes having information only and not URL etc?",
            "What if the URL is very short, like x.com ? there won't be enough ones and zeroes to fill and entire QR box.",
            "Further stupid question. If it converts a full address to binary what about the inverse of coding a ipv6 address or strait hex? Also its really going to cook your noodle later if we can generate QR codes for sites on the Darkweb where urls there are sometimes 30 or more characters thst are completely bananas to try to read or memorize.",
            "> so it can include letters and other stuff instead of just numbers\n\nCorrect. I want to emphasize that \"letters and other stuff\" **are** also just numbers that were assigned to represent a symbol. With larger numbers you can represent more symbols. For example, you can chunk your bits into 8bit units (=1byte) and interpret those numbers (0-255) using the ASCII table, which contains 256 symbols including the digits 0-9, a-z, A-Z and the most common symbols like all the other characters on your keyboard.",
            "That's awesome i've never thought of barcodes as being 1 dimensional before but I guess they are in a way.",
            "I'm sure I saw a guy that encoded game code into a QR code itself, not just a link to the game. Pretty crazy what people can manage.",
            "interesting that you mentioned images. obviously an image coded in binary would take up a lot of space, my phone actually has an app that uses a 24-bit version of QR codes for encoding image data as a 2d data array. much more space efficient but is a little less precise than the traditional 1bit codes.",
            "3072, not 4296.",
            "So what is the advantage of a QR code vs. just having the URL printed out (and able to scan from a phone)?",
            "Truly explained that so my 5 year old shroom curiosity is now at rest. Thanks!",
            "My five year old kid wants to know what 10 132 is. Is it more than she has toys?",
            "There is no \"big database\" of QR codes, the code itself contains the URL.",
            "> There is a data limit for what can be stored as a QR code so not all urls in existence are possible to be stored but most base routes are\n\nWell, the maximum length of URLs is \"defined\" as 2048 characters which is less than the maximum size of a QR code (around 3000 characters). So according to the specs QR codes can contain all \"valid\" urls. \n\nHowever only MS Internet Explorer and Edge actually enforce that max length, other browsers and web servers have longer max lengths (anything from 4000 to 64000+). But because of Edge you'd probably still want to stick to less than 2048 for compatibility.",
            "Here's a very cool expansion, with multiple frames of animation, and multiple symbols per square, with multiple colors, allowing for pretty high information density.\n\nhttps://github.com/sz3/libcimbar\n\nNot made by me.",
            "Not really - like numbers, they just get longer. There are estimated to be about 10 to the power of 80 atoms in the universe - so an 80 digit decimal number would be enough to give *every single atom in the whole universe* its own unique number. That should be enough for... a while.",
            "Certainly, but really not likely. That's like running out of addresses for houses. We just build more streets.",
            "Let's say URLs can be made of 64 allowed characters (a-z, A-Z, 0-9, %, / ). By the time you get to 45 characters long (64^45 ) you have more URLs than atoms in the visible universe, so it would be impossible to store them all.\n\n\nSo we would run out of universe long before we run out of URLs!",
            "The thing about URLs and QR codes is : we can make them as large as we want. So we may eventually run out of 2-letter, 3-letter, 4-letter URLs and so on, but we can move on to 5 letter, 6 letter, 10-letter, 25-letter URLs. \n\nSimilarly, QR codes don't have a fixed size. They can expand to increase the amount of information written in them. If you need to put a bigger URL in a QR code, you can just increase the size of the QR code. So it's possible we may eventually use every single 10x10 block QR code, every 11x11 block QR code, every 12x12 block QR code and so on, but we can just move on to 15x15 blocks, or 20x20 blocks and so on.\n\nThis is different from IP addresses, which are limited because they have to be a fixed length. Every IPv4 address is a combination of exactly 4 numbers between 0 to 255, so there are exactly 2^32 IPv4 addresses available ever, so it's easily possible to run out of IPv4 addresses. In fact we've already reached the point where there really aren't enough of them and we've had to start using different hacks and workarounds to get things to work. It's also for this reason that IPv6 was added, which increases the number of possible addresses by several orders of magnitude, so that even though it's still limited, it appears unlikely that we'll ever get there. However, adoption of IPv6 is still very slow.",
            "I like how you worded the follow up as a \"side quest\" question. Thanks for making my day a bit better.",
            "You’ll run out of IPv4 and IPv6 addresses long before you run out of URLs, not that they’re exactly the same",
            "nah, we won't run out of URLs. it's like saying we'll run out of phone numbers but with the internet's equivalent of area codes and extensions. besides, if elon musk can keep coming up with new ways to tank twitter (or x or whatever), tech will always find a way around limits!",
            "Let's see:\n\nCharacters valid for URL's: 0-9, a-z and A-Z, , so 26 +26 + 10 = 62.\n\nURL Character Limit: 75 characters.\n\nPossible combinations, 62!75 = **1.53\\*\\*\\*\\*****^(111)**, that is, 1.53 followed by 111 zeroes.\n\nNumber of atoms in the universe:  **10\\*\\*\\*\\*****^(78)** **to 10\\*\\*\\*\\*****^(82)**\n\nSo if we wanted we could give each atom in the universe more than a million unique URLs.",
            "QR supports something like 3500 characters. That’s a long-ass URL (and it doesn’t have to be a URL, it can be any plain text).",
            "QR codes just encode strings of text, and for longer strings more black and white squares are used (meaning either the QR code gets bigger or the squares get smaller). The maximum amount of data that can be encoded allows for a few thousand characters. That would cover pretty much any URL you’d want to put on a QR code.",
            "A domain can be up to 253 characters, made of letters, numbers, and hyphens. So, 253 to the 37th power.  Then the total URL (domain  + path) can be up to 2,048 total characters. \n\nSo, while _possible,_ it's not likely to happen in anyone's lifetime.",
            "Is it possible to run out of words/sentences/numbers?",
            "No, but we may run out of the URLs we want.\n\nhttps://www.youtube.com/watch?v=NWIlScfHwOU",
            "So the issue isn't really URLs but IP addresses.  A URL turns into a IP address. So when I type in a URL it's actually in the background getting turned into something like 12.14.254.245.  Right now we are running out of IPv4s which are in that format.  IPv6 is a lot larger, so big it's highly unlikely we will ever run out.\n\nURLs we'll likely never run out because I'm not even sure if there's a limit to the length of a URL, so you can always add more characters.  [youmightnotlikethatthisistheurlyouhavetotypein.com](http://youmightnotlikethatthisistheurlyouhavetotypein.com) but it could be turned into a valid url.\n\nActually I will note I just looked it up.  The limit to the length according to documentation is 2048 characters.",
            "Is it possible to run out of words?",
            "Will we ever run out of words?  More or less the same question :)",
            "Qr codes get bigger. I've put qr codes of entire essays in college. There's probably a limit but it's large",
            "If you set the maximum that a url can be at...let's say, 10 characters? You can extrapolate that as 36^(10), or thirty six to the tenth power--which equals 78,364,164,096 x 46,656. I've written it that way because the calculator tries to simplify the actual number. When you consider that most URLs have more than 10 characters, I think we're probably fine.",
            "We would run out of IP-Adresses first. Every URL is just a key to get an IP adress from a special server, the DNS. When you tell your browser to get data from cornhub.com to get the latest news on your favorite crop, the Browser asks your router for the data from cornhub.com. your router then asks a DNS what IP Adress it has to ask for data from cornhub.com and if it gets an ip adress it can ask for the data, gets the hottest corn infos and sends it to your pc that shows it in the browser.\n\nThe shortage of IP Adresses is the reason why IPv6 exists. It can have more different adresses than IPv4.",
            "That's what she said!",
            "In theory the maximum allowed URL length is smaller (2048 letters) than the maximum QR code size (3000 letters). MS Edge is the only browser that enforced that URL limit, but you'd probably want to stick to it for compatibility.\n\n\nAlso even with just 45 character long URLs there are a lot more possible URLs than there are atoms in the visible universe, so you'd run out of universe before you ran out of URLs!",
            "Yep they can contain any data - anything from just numbers to full binary data. It just happens that their most common use these days is for automatic URL opening on smartphones.",
            "QR codes are variable length, that's why sometimes they seem a lot \"denser\" and have more of those little alignment squares.",
            "The QR code represent the URL string. If the URL string is short then that's what the QR code represents. Now, if the QR code has more capacity than the information it stores, then the empty space is itself encoded.",
            "It's not a 1 to 1 mapping, if data is shorter then smallest qr  code it'll just add padding to make it fit exact space.\n\nIf you want this website goes through all the steps to encode example text https://www.thonky.com/qr-code-tutorial/data-encoding",
            "Because a QR code can contain anything QR scanners will probably need it to be in URL format (starts with http:// or https://) to actually launch a link from a QR code. Otherwise it'll just display it as text\n\n\nOf course you can put ip4 or ip6 addresses instead of the domain. No reason onion address wouldn't work either, though maybe you'd have to copy and paste them if Tor isn't your default browser.",
            "Think of it as reading in 1-dimension/direction, left to right versus left to right & up to down.",
            "[MattKC](https://youtu.be/ExwqNreocpg?si=_nTvoh-7cAz1wpzW)\n\nAlso known for reverse engineering Lego Island, and ported apps to Windows 95 (back ported .NET Framework 3.5)",
            "Given an alphanumeric is pretty much ascii 8 bit you get ~4296 bytes - actually 2953 bytes per the format. That is ~3kb\n\nTo note: the Qr codes you typically see aren't as large as they can get since they don't need to be and work with worse cameras. QR codes can start to looks messy at QR40",
            "While it may be much easier for you to read something written out in letters, it’s much much easier for your phone to read a QR code.\n\nIt’s the same reason we invented the original (one dimensional) barcode for supermarket scanners, rather than just having them try to “read” a numeric code.",
            "QR codes are easier for your phone to read and include damage corrections. \n\nAbout 30% of the code could be destroyed and you would still get the full correct data.",
            "Text is hard to read at an angle, if using wrong fonts and as soon as you cannot see one letter you cant access that url. Qr codes are built so that they don't have any such issue. They have built in corrections and dont need to be bigger to encode longer messages either",
            "Error correction. As a scannable binary pattern the phone can check it got exactly the right URL. As regular text... \"Wait, is that Google or Goog1e?\" It's doable, but less robust, more error prone.\n\nYou *can* actually scan, copy and paste text including URLs now on iPhones - probably Android phones too, though I haven't tried - it works fairly well, but it's harder work for the phone and less reliable. If you want to put a \"link\" on your poster, truck or soda can, a QR code works better.",
            "Reliably scanning text is fairly recent and still decently error prone. Scanning a QR code is basically the same tech as scanning a barcode and has been around for *a lot* longer. QR codes also have built in error correction, your phone is able to a) detect if it misread the code and b) potentially even correct any read errors on the fly.",
            "I’d imagine you can capture a image from a further distance than a url, just a high guess lmao",
            "10^132 is \n1000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000.\n\nIt is approximately 10^132 more toys than she has.\n\nEdit: Missing a few 0's",
            "Huh, good to know",
            "64000??? Are there any actual URLs that even get close to this length?",
            "> around 3000\n\nIt’s 3072.",
            "So what you’re saying is by the year 6000 we may be out of QR codes 🥲😔",
            "But eventually we run out of places to put streets *big brain reply*",
            "This guy greps",
            "IPv6 is many orders of magnitude larger than IPv4. Something like septillions of available v6 numbers for every v4 number. \n\nIf every star in the observable universe had a thousand life bearing planets orbiting it, and each of those planets had a trillion people living on it, there'd still be more than enough IPv6 addresses available for everyone to connect their computers and phones and tablets and washing machines and whatever. \n\nLatency would be pretty bad overall though unless we can solve that pesky speed of light limitation.",
            "It’s the least I could do my good sir",
            "According to my 5 seconds of googling, the Oxford English Dictionary full version contains over 170,000 words. \n\nSo just to make the math easier, let's say 170k is the number of available words. Now let's just pretend that we're going to limit ourselves to three word groups. That's 170^3 options, which is the same as 4.913 x 10^15. \n\nThere's currently about 8 billion people on earth, which is 8 x 10^9. So our three word group rule leaves us with about 6 orders of magnitude more, so around a million combinations per person. \n\nNow obviously, from a subjective standpoint, not every combination would be equally as desirable for various reasons, but there's still plenty to go around. And there's no real reason why you have to limit yourself to a group of three words either.",
            "Just an FYI you don't need a unique IP address for every domain name (the first part of the URL), multiple domains can point to the same IP address then the server at that IP works out which website it should display.",
            "And qrcodes are extendable; bar codes are too.",
            "3072, not 3000",
            "If fast, accurate, cheap OCR scanners existed  back in the day we *might* not have ever invented  UPC/QR. \n\nEven if we did there’s still some advantages to using upc/qr vs just OCR’ing human-readable info.",
            "the percentage is configurable\n\nand that's exactly how people make qr codes with logos/art in them. that's not an inherent feature of qr codes. they're just using the error correction to make up for destroying part of the code with their picture",
            "Can you provide more detail on the error correction?",
            "The querystring counts as part of the URL so if you wanted to upload a JPEG by base64 encoding the entire file into the querystring you could easily hit that ;)",
            "Google Amp links. ",
            "MS Exchange has this \"helpful\" safelinks feature where every link in an email is replaced by another one, which sends the original link and some meta-information to Microsoft for espionage, eh, safety.\n\nTake two sites using that feature. Send email from one to the other. Send email back. Repeat. (Not quite uncommon in a mail conversation, right?)\n\nIt doesn't take long until the links become too long for any browser to handle.",
            "I don't think that's right, are you sure you're not thinking of the RSA 3072 encryption standard, which uses 3072 bit keys?",
            "If a million people generated unique urls every millisecond, it would take over 10^3567 years to use them all up. (Urls can right now be limited to about 2000 characters)\n\nBy then I think we won’t need them anymore.",
            "Man let me tell you that will be the least of our worries then.  Damn chihuahuas!",
            "Maybe in a technical sense, but I dont think reusing a QR codes from a few thousand years in the past will be a problem",
            "Ah, but we just make the streets really tiny. *Taps forehead*",
            "URLs are also like addresses in that over time you can change what you put in them. It might mean the link/QR code/address book eventually doesn't work as intended, but they can be repurposed.",
            "Then we just build vertically into the sky",
            "No since you can make the world bigger so you can have bigger streets, which is the same as having a longer URL",
            "I suppose this is roughly what the issue with running out of IPv4 addresses is, which is why there’s the very slow move to IPv6.",
            "Also 20+ years web developing and having to deal with base64 :)",
            "But you do need a unique IP address for every publicly accessible computer/NIC, which is close enough to every domain name to be functionally equivalent. Coke and Pepsi, for example, would never want to host their proprietary websites on the same server, and they both have many subdomains, most likely with separate IP addresses. \n\nFor ELI5 it’s reasonable to say that we will run out of domain names when we run out of IP addresses. It’s close enough to being true that it’s not worth getting into the weeds about DNS, web server domain lookup, etc.",
            "Error correction in QR Codes works by adding redundant information to the encoded data using a Reed-Solomon error correction algorithm. This redundant information allows the QR Code reader to reconstruct the original data even if parts of the code are damaged or unreadable.",
            "Yes. The QR code max size is 3KiB, which is 3072 bytes.",
            "Oh great, as if Y2K and Y2K38 weren't bad enough, now I have to worry about the Y10^3567 problem?\n\nEdit: fixed superscript",
            "Or, hear me out, we just shrink humans so we need smaller calls for super tiny roads making up more room for houses *also we will be shrinking the houses*",
            "Ha! And there’s subnetting lol.",
            "I'm at 16 years! Had an early mentor push me toward linux and bash, which I'm forever grateful.",
            "Yes, but one IP address can cover basically unlimited (obviously, computing power is an issue there) URLs thanks to [SNI](https://en.wikipedia.org/wiki/Server_Name_Indication). So you can have an incredibly huge amount of URLs available with just two IP addresses (one for the server, and one for the client). Three, if you need a DNS server, too.",
            "I think that's been approximated because if you look it up the maximum capacity of a v40 QR code is 2953 binary characters with low error correction. \n\n\nAlthough possibly you can use \"alphanumeric\" encoding (not clear if that supports all the characters you'll find in a URL) giving 4296 characters with low error correction or 3391 with medium error correction.\n\n\n[Source](https://www.thonky.com/qr-code-tutorial/character-capacities)",
            "Only if a million people generate unique URLs every millisecond for the next 10^3567 years. If one of them slacks of the job then we are fine.",
            "You just invented Downsizing, which was a terrible movie and you should feel terrible.",
            "“Get Them Out by Friday” by Genesis",
            "So once again humanity is saved by its most reliable trait: laziness.",
            "Downsizing had some good parts. It just didn't know where it was going for the 2nd half of the movie.",
            "What kind of fuck you give me?",
            "I'm doing my part!",
            "I give you Love Fuck"
        ]
    },
    "ELI5: why do car prices not benefit from technological advances the way that home electronics or other technologies do?": {
        "title": "ELI5: why do car prices not benefit from technological advances the way that home electronics or other technologies do?",
        "score": 178,
        "url": "https://www.reddit.com/r/explainlikeimfive/comments/1dlm3rv/eli5_why_do_car_prices_not_benefit_from/",
        "content": "Car prices seem to rise non-stop despite advances in manufacturing technology. But a TV, or smart home devices, or some other similar piece of home tech continually becomes cheaper from the time it is released. Why?",
        "num_comments": 68,
        "comments": [
            "They already did that. \nBut it happened a century ago.\n\nThe first automobiles were introduced in the 1880s and cost $30,000 in today's currency. No roof, no doors, no lights, crank start, no brakes, steered with a tiller and went slower than a horse.\n\nBy 1925 the Ford model T cost $4,500 in today's currency. It had an enclosed cab, lights, brakes, steering wheel, battery, starter switch, pneumatic rubber tires, and reached 45 mph.\n\nYou were just born too late.",
            "Because they keep adding stuff to cars.\n\nNewer safety and reliability and fuel efficiency tech.\n\nA lot of that stuff isn't visible, but are both much less likely to get you injured or killed in a crash, and much less likely to have one in a newer car than an old one.  Ideally they are also better integrated with tech and have more reliability monitoring etc.  \n\nSome markets (usually the developing world) have very cheap cars that might share a model name with a western car, but a lot of them have fewer crash protections or mitigations, slower tech etc.\n\nYou can make cheaper cars, but remember they need to exist in the whole markets. So the EU you need to do everything from the dense slow miserable streets of a big city, to 130km/h highways in France or the autobahns in Germany.  In the US you have NYC and Los angles, and Texas highways that are like 135km/h speed limits. \n\nMy 2020 model year car has twice the engine displacement (and twice the horsepower) of my model year 2015 car, yet used about 60% the fuel/km as the old one. And that's not even a full change in generation (granted, different cars, a bmw 328i to an m850i but same manufacturer).\n\nSome of it is also just customer choice.  People want more space, more speed, less maintenance headaches (my new car has laser headlights that should last more than 10 years, my 1993 dodge had headlights that lasted 2, but were 1/10th the price or less). \n\nI don't have time to look for a source, but years ago Tata made a car in India for 1500 bucks. It was... A car.  That occasionally caught fire, but was cheap.  To make it safe enough to sell in North America would have increased the price to something like 15k. You can have cheap, or you can have safe. Regulators have generally settled on safe.  The EU values pedestrian safety more than the US, but since the big manufacturers want to make the same car for all markets those benefits tend to be spread out pretty well.",
            "A lot of technology has become cheaper because mechanical parts have been replaced by computers.\n\n\n\nFor example washing machines used to have this long complex system of cams and switches to control the program (it was attached directly to the control dial which is why it would turn as the program ran). Carefully tuned electromechanical parts = expensive.\n\n\nNow you just throw a 5 cent microcontroller and some relays in there and you're done.\n\n\nCars with internal combustion engines are full of dumped mechanical parts that you just can't get rid of, so they will always have a price floor because of that. Add to this increasing safety and emission standards and the price stays high.\n\n\nWith far fewer moving parts electric cars have the potential to be cheaper, but the material that the giant batteries are made of is expensive keeping the price up.",
            "They do, but they also have to appeal to what consumers demand. The initial tooling costs are high on a new model, depending on how many things are designed specifically for it vs being shared among sister models and brands. They have to hire whole engineering teams, have to do testing, have to throw thousands of pounds of materials from plastics to aluminum to steel to cloth together, and have to generate a profit after the manufacture and assembly of thousands of parts, with some respectable percentage of these parts mandating precision and plenty of machine time which drives costs up.\n\nOne of the cheapest new cars right now is the 2024 Mitsubishi Mirage ES, at about $17K MSRP. And even then, on one of the cheapest brand spanking new cars on the market, the demand for creature comforts means including power windows, running ducts to the back for HVAC, steering wheel buttons, keyless entry, a radio complete with 4 speakers and Bluetooth, 12V outlet, USB outlet, a 6-way adjustable driver seat, and a split rear seat that folds down.\n\nThis is in addition to things that are required by law, or to meet standards, or as part of the sales pitch regarding safety. A bunch of air bags, ABS, rear door child locks, a LATCH system, TPMS, 3-point seatbelts. It also has to hit certain MPGs both as part of the sales pitch and to help the manufacturer meet CAFE standards, and this means a more advanced engine design. More valves per cylinder, VVT, advanced electronic engine/powertrain control, an electronic throttle body to allow governing and simplified software-based cruise control, on and on.\n\nAnd this is just the base model, and while these features often have software involved in them these days, there is a physical component to every single one as well, and is not purely a software feature. The software itself also costs money to develop, of course, though I'm disregarding that as a one time cost we can include with the above-mentioned engineering team.\n\nThey could be cheaper without all this stuff in terms of upfront cost, but the law and the market demands most of it which counters a lot of potential savings.",
            "Imagine if we artificially inflated the prices of TVs coming from China / India / South Korea (using tariffs) until it was actually cheaper to buy ones made here. And then we legislated the role of special TV dealerships, which operated independently and (by design) needed to be taking their own cut on every TV sale. Then we built up 80+ years of well-meaning regulations for how TVs must be built, effectively making it borderline impossible for new TV manufacturers to get off the ground.\n\nIf we did that, the prices of TVs would rise faster than inflation, too.",
            "Car *standards* have risen considerably over the years. For example, backup cameras weren't required in new cars ten years ago. Airbags weren't mandatory in the early 1990's. Lane departure warnings and similar are even newer requirements (google says 2022). All of those features require new systems to be added, and it all adds to the cost. Many of these features *used to* be add-ons that you could get with higher trim packages, but are now in all cars, raising the base price.\n\nAdditionally, some of the materials in cars can be quite expensive. You may have heard about catalytic converter theft becoming a bigger issue - it's because that particular car part contains platinum, palladium and/or rhodium.",
            "Those of us who grew up in the 1970s witnessed technology creep firsthand. In 1975 only fancy cars had automatic windows and power steering. Most cars only had AM/FM radios, trucks only had AM.  Airbags weren’t in any passenger cars, crumple zones hadn’t been invented, etc. \n\nIgnoring everything other than safety features and in-vehicle entertainment (Bluetooth, satellite radio, etc), you’re still talking about thousands of dollars of technology. Having totaled both a 1981 pre-airbag car and a 2005 post-airbag, post-antilock brakes, post-crumple zones car, trust me, be happy the more expensive safety features are installed.  Cars are much easier to total now because they intentionally disintegrate on impact to absorb energy, but they’re much easier on our bodies.",
            "Cars are “cheaper”, you probably just aren’t comparing like cars. There are tons of cars that have the zero to 60 time of super cars 20 years ago. Regular full size trucks have significantly more towing capacity than duallies from 20. Modern family vehicles have more safety features than the high end luxury cars from 20 years ago. \n\nThe price of cars has gone down relative to what you car getting. But the issue is that everyone wants a lot more than they used to.",
            "A 1995 Honda Civic LX adjusted for inflation cost close to $30,000. A new base LX model is around $25,000. Car prices do benefit from technological advances.\n\nThe 2024 Civic also has a lot more tech in it, and has been designed to be safer. The price reductions for TVs and smart home devices is reflected in the new Civic having touchscreens and other digital displays, plus tech for automatic braking all standard. It also certainly has more airbags and safety features than the 1995 model.\n\n\"Cars\" in general have gotten more expensive because people are opting to drive larger vehicles (SUVs/trucks) than in the past, and those are inherently more expensive. Many people are also choosing higher trim models (EX vs LX, Premium vs Standard, etc) which drives up price.",
            "The best TVs are always about the same price but that’s because they’re always making even better TVs. It’s the older style TVs that get cheaper.",
            "Because people buy them at that price.\n\n\nThe supply and demand that is often mentioned when it comes to things like housing and wages.",
            "Cause over time cars have generally gotten more complicated. The modern car isn’t anything like a Ford Model T, they have vastly more amenities and apparently consumers were willing to pay for these instead of a cheaper car.",
            "Car prices increase when the price of resources needed to make a car increases as well.\n\n\nAs for cars being cheaper, prices drop before the launch of the next generation vehicle",
            "I'm addition to what everyone else said: there are some technological improvements that can lead to making things cheaper, but other technologies can only be made better.  It depends on where the key bottleneck is.\n\nOn a TV, what used to cost a lot is the printing of the LCD screen without defects.  In recent years, manufacturing technology for LCDs have gotten higher yields and lower cost.  In addition, the other thing that makes a TV work, transistors, have continuously gotten cheaper due to Moore's law.  Even the assembly of TV have gotten robotized.\n\nOn a car, what you are paying for is a big hunk of metal plus other materials like lithium batteries, the expensive machining of said materials, and unionized workers.  You can design things better but you can't make them cost less.\n\nSome areas of the world get rid of the unions and go for cheaper labor, mainly china and Tesla, and their stuff is $10k or $20K cheaper vs something comparable vehicles, but you still have a bottom line driven by materials and machining costs.",
            "A lot of electronics become cheaper because the components get combined and simplified, even as new features are added. Cars are the opposite. As we add more features we literally have to add more stuff. Stuff costs money.",
            "I don't really know. It is kind of like with houses. They only build giant houses now because it would not be cost effective\\\\less profit to build smaller cheaper houses. They only build cars full of bullshit because it would not be cost effective to build cheaper cars with nothing. They really like selling trucks full of bullshit so they can slap that 100k plus sticker on those.",
            "I would argue that one of the major reasons cars arent getting cheaper is that there is a massive demand for expensive new cars. people are willing to go into long term debt just to drive a cool new car.",
            "Everyone is forgetting to mention anti-competitive laws that dealerships lobby for which prevent online retailers from being able to undersell them. \n\nEli5: cars are pretty pricey, but there guys selling them make sure not a lot of people can sell them in the same area.",
            "They absolutely do. But cars also suffer severe feature creep. There is so much more stuff that people want and need out of a modern car that it pretty much balances out costs savings from advanced manufacturing. You are simply buying significantly more car per car than your grandfather did. It isn't even legal to make and sell a deathtrap from 60ies anymore, not in western world at least.",
            "It's really weird to see so many answers where people try to make up actual reasons all the way to \"metal is expensive\", while the truth is that the automakers have made sure, through decades of lobbying, that cheap cars are simply legislated out of the western world. Have a look at India, they do have massively cheap basic cars.",
            "Because companies have to make more in a three month period than they did in the last three month period",
            "Mainly because cars keep getting more complex.  Though in the future Electric Vehicles are going to reduce cost of cars again due to being less complex.  \n\nIn the early 1970s cars had no air bags, automatic braking systems, emissions controls, and many other safety systems were non existent.  In addition the cars had no fuel economy requirements, so the engines in the cars were very simple and easy to make.\n\nOver time as cars became safer, faster, and more efficient - more parts and higher tech parts were required and added.  This added a lot of cost per car.  Cars also last a lot longer today than before, which is achieved with higher engineering costs.\n\n(Not exactly ELI5) - There are a lot of other reasons besides these, including the slowing pace of innovation due to the outsourcing of engineering by the big automakers.  Small suppliers can innovate, but they only work at the ‘part level’, and not across entire systems in a car.  To get bigger innovation and cost savings the automakers need to get competing suppliers to cooperate, and that is challenging.  A good example of long term stagnation in this area is cars still operating on 12V electricity instead of 48V.  (Can explain more here if anyone cares). \n\nLooking forward, EVs will reduce costs again as EVs have about 40% as many parts as a gasoline car.  EVs are a bit expensive today due to relatively low production numbers compared to gasoline cars.  EVs have improved greatly in just the last 5-10 years in terms of cost and range.",
            "If cars had stayed exactly the same, then the cost of production would come down and cars would be cheaper\n\nBut cars have not stayed exactly the same. Cars have improved *enormously*\n\nThey are faster, quieter, more fuel efficient, far safer, have much more technology, are more reliable, have lower tailpipe emissions, rust a lot less (if at all), and have many more improvements.\n\n[And yet adjusted for inflation, the price of a 1983 Toyota Camry is very similar to the price of a 2025 Toyota Camry](https://www.theautopian.com/the-2025-toyota-camry-is-barely-more-expensive-than-a-1983-camry-how-much-better-is-it/)\n\nBut look at how much better the 2025 Camry is compared to the 1983 Camry.\n\nThat's where the technical advances have come : making you a MUCH better car but keeping the price (adjusted for inflation) approximately the same.\n\nAnd if tariffs were not added to cars that are built in certain overseas countries, cars could be cheaper still.",
            "There is a lot of really good info here already and all of it is right, but one thing I’m not seeing called out is the difference of scale between electronics and car manufacturing which is a major reason why electronics see big decreases in costs. \n\n2023 US vehicle sales were estimated to be [15 million units](https://www.statista.com/statistics/199983/us-vehicle-sales-since-1951/). Conversely TV sales were estimated to be [47 million units in 2020](https://www.cta.tech/Resources/i3-Magazine/i3-Issues/2021/May-June/Record-Television-Shipments-in-2020-TVs-remain-the) (I couldn’t find a more recent number). So TVs are doing 3x the volumes of cars just in the US. Now consider that the best selling model in the US in 2023, was the F150 with roughly 750,000 units sold. It’s available in 5 or 6 different trim levels with different interior options and features. So ford may only end up with 100,000 of those being spec’d with something that cost them millions and millions to develop (think self parking features and “smart” cruise control). As a result to get the necessary ROI on that R&D they have to charge for it and a bean counter has to decide how many they think they will sell with that feature and how much the feature will cost to support the required return.",
            "We made cars vastly more reliable, packed with features that occasionally get used, cars are larger and that consumes more raw materials, and regulatory requirements pack on bill of material cost. It is estimated that up to 25% of the cost of a new car is driven by mandated features and design requirements.",
            "Part of it is because the \"savings\" are plowed back into features and improvements: cars have touch screens and amazing sound systems where they didn't before. Those are cheaper than they would've been, but the sound system before was a simple 4 speakers. Cars are safer than they used to be, etc. etc. They price has gone up, but so have the features and 'value' for that money \n\nAnother part of it is that not 100% of the car is getting those cost decreases. There's still just a lot of steel and rubber and human labor, and on THOSE component costs are going up not down",
            "Cars are really big chunks of metal. There's only so much you can do to make large chunks of metal cheaper to produce.\n\nWe already went through all the rapid growth and development in mass production steel. It's basically a fixed cost at this point based on the cost of materials.\n\nAs for electronics, they are going to put as many in the car as they think people will pay for. So even if these things get cheaper, they'll just put in more because they can afford it.",
            "Cars benefit from technological advances because they use new and better technology. The value keeps increasing. \nCompared to twenty years ago consider some examples 1) cars have cameras for blind spots 2) cars have AI safety features 3) cars have better gas mileage.",
            "Aren’t TV prices effectively subsidized by the ads and apps that are built in? \n\nI certainly don’t want ads in the car even if that means saving a couple hundred/thousand.",
            "I am curious about tariffs honestly. There is a lot of protectionism surrounding cars and car prices (plus dealerships...) that must inflate the price a non trivial amount.",
            "Simple they're not made in China where your home tech is. \n\n\nCars even assembled in Mexico still have a lot of American and Japanese parts, and are designed in very high labor cost America.",
            "Because regulators are making the requirements stricter at a way faster pace than at which actual technological improvements can happen and are as a result artificially making cars more expensive.  \nDont want a start-stop system and shitty lane-assist? Tough shit, rules say you have to have them and you are paying for them being there.  \nMost customers and manufacturers would probably like to be able to make a 1990s car just with newer materials, 5 NCAP stars and more automated manufacturing and that car would be very cheap and would have all the shit people actually care about (AC and electric windows), but rules say you cant make that car.",
            "just to add to this answer:  \nwe could make something similar to Model T for much cheaper than $4500. Actually, you can order such from China even cheaper.  \n  \nWhy cars are more expensive then? Because we want so much more from cars now.  \n  \nFirst, let’s start with engine - back then, 45mph was top speed, but usually cars did travel about 20mph. Engines did break often. And they had terrible fuel efficiency, terrible exhaust. Cars had few hundred kilograms and even that was a challenge uphill for a cars. Now we don’t want just an engine that can do 80mph. We want engine that can do 80mph uphill, with 0-60 not in 15 seconds, but in 6, in a car that weights 2,5 tons and to have comparable fuel consumption to original Model T. That kind of engine is much much more expensive. Oh, and reliability - we want our engine to last 100k miles with almost no maintenance and to last at least 300k miles before it completely breaks down. Back then, 100k miles would mean motor is completely rebuilt.\n  \nSecond, continue with safety. Back then, few hundred kilos of car traveling at 20mph wouldn’t cause some massive crash. Now, cars are several times bigger and traveling at 4x speeds - 4 times speed equal to 16x more energy, combined with higher weight that is 30-60x more energy in crash back then. And preferably, we would like to survive. A ton of engineering and added weight goes to this. And also to bigger and better tires and steering, as you want to be able to maneuver such massive car in such high speeds.  \n  \nAnd we want our cars to be more spacious. Cars are bigger than ever on average. A lot more cargo, a lot more legroom. Not just added weight, but every component has to be bigger and sturdier to hold such weight.  \n  \nAnd lastly, we want comfort. Quiet, smooth ride, so massive suspension is needed, climate control which also adds weight and ton of sensors everywhere, either to increase reliability, fuel consumption or comfort.  \n  \nSo you want maybe 5x more materials per car, much higher quality materials, hundreds times of more engineering, much much more complex parts - if you wanted to build such thing back then not only would it be impossible (due to lack of computers and material science), but even what was possible would probably costs millions of dollars per car.  \n  \nSo the prices does go down. But we add new features, or better performance/confort for the same price, instead of lowering price.  \n  \nCar from 1900s and car from today is as far as if you asked in a hundred years, why personal spacecraft is more expensive than car is today.",
            "Unironically kids don't know how good they have it today, compared to '25.\n\n\nI know because I'm a kid in this context. ",
            "4500 in today’s currency but the inflation adjusted gdp per capita was also a fraction of today’s. the amount of tech you can get today in a 30k car that’s likely only half your salary or less is a pretty good deal compared to the past",
            "Best answer here",
            "And now it's the time for electric vehicles production costs to come down.\n\n\nGenerally They are already coming down every year. Although it also depends on your local situations. \n\n\nAnd the price drops are still too slow for more adoption ",
            "The short version of this is that the car makers are masters of incremental improvement.",
            ">I don't have time to look for a source, but years ago Tata made a car in India for 1500 bucks. It was... A car. That occasionally caught fire, but was cheap. To make it safe enough to sell in North America would have increased the price to something like 15k. You can have cheap, or you can have safe. \n\nI grew up in a developing country in Africa where the market was entirely Japanese and European brands. At some point in the late 80s or early 90s when I was still a kid, a new car called Skoda appeared out of nowhere. It must have been cheap because it exploded into the market overnight and soon it seemed like every other taxi was a Skoda (the make was written in big letters on the sides). Then soon after, the car developed a reputation for spontaneous combustion. And then just as quickly, it effectively vanished from the market. \n\nAs an adult looking back, it's clear that Skoda, a Czech car maker, probably expanded to developing markets like mine following the end of the cold war. I have no idea which models came.to my country but I was surprised to see that Skoda was a venerable brand, and that today it thrives in Europe and elsewhere.",
            "\n>Newer safety and reliability and fuel efficiency tech.\n\nYou can clearly notice this in modern SUV. They have good accident safety record (for the driver and passengers, not for other people who use the road, but who cares about others)\n\nThey install modern expensive lights this days that cost like 2000€/light. They're great for safety because now you can see everything and so much further away (at the expense of blinding everyone else, but who cares about others)\n\nAnd the fuel efficiency it's so much better than if you took and old engine and put it in a new car which is amazing, granted new cars are absolutely huge for no reason and if we places this engine tech in older cars they will probably get even better fuel efficiency but that's not as exciting as the new Ford F150 which you can easily use to carry groceries once a week.\n\nNice time to be alive.\n/s",
            "That ugly gas dryer from 1985 that i got from a repair guy was so good i would have shipped it to my new house if it wasent across hundreds of miles of water.",
            "Glad someone said it. \n\nThe price of car manufacturing hasn't increased all that much and yet it's the only thing that the other top comments are talking about.",
            "In addition to this, profit margins are much higher on luxury cars than they are on more economical cars. It is more profitable to sell an SUV than a small sedan.",
            "they're already moving to the subscription model for car features.\n\nAnd with BMW drivers, turn signals always were optional.",
            "It’s almost like asking why a Mac Pro costs so much when you can buy a pocket calculator for $10",
            "One thing to note is that the crashes in those cars at 20 or 30 mph were still brutal and deadly. Given the lack of seatbelts, the sharp metal edges everywhere, and the plate glass in front of you, the first collision will see you violently butchered as you’re thrown from the front, whereby you’ll promptly break your neck on a cobblestone street still covered in horse crap.",
            "To your list of comfort items, I'd add all the motors (seats, rearview mirrors, etc.) and cameras, and other convenience devices that add cost and weight.",
            "Hey, what’s your profession?",
            "I'd argue that 80-90% of what adults do, they do it to give their kids a better future. It just so happens that a lot of those things got adopted widespread.\n\nThe goal of an advanced civilized society is to make the world a better place than they inherited it. But idk.. I'm just an idealist at times.",
            "Just want to point out that next year will be '25 again. I wonder if kids will know how good they have it then.",
            "Skoda has been around since 1895. It was state-owned from 1948, then gradually privatised to the Volkswagen group after the end of the Cold War in 1991, becoming a wholly owned subsidiary of VW in 2000.",
            "I drive a 2005 Skoda Octavia with 60000 miles on it - it's a great car.\n\nWas free to me, and then got written off (insurance paid me value of car) due to cosmetic storm damage. Meets ULEZ emissions, can use high octane fuel. Will drive till it drops.",
            "I remember Skodas from the 60s and 70s in the UK. Pieces of rusty communist-era junk. Now they are part of VAG and make great cars that often share platforms with VW and SEAT models.",
            "I think BMW had a lot of backlash for putting features behind subscriptions and later decided it wasn't the way to go?",
            "Better question is why those Texas Instruments calculators still cost as much as a low end smart phone.",
            "I have a small IT startup, so I have to know how to convince people newer is better",
            "Just wait till you hear that we might be hitting peak lifespans in some first world nations. No more gains after a certain point 🪓",
            "Ever since they were acquired by Volkswagen, they pretty much sell the same cars for a lower price.\n\nA Skoda Octavia is basically the exact same car as a Volkswagen Golf.",
            "Because they \\*are\\* a low-end smart phone. Just without the calling part.",
            "I still think there's room for growth. Maybe not at the top end but most people are not living anywhere near optimally to maximize longevity so if our society can clean stuff up there are still real gains to be had in life expectancy.",
            "The top-end Nspire ones are as powerful as low-end smartphones from 12 years ago, and cost more than a smartphone nowadays.\n\nThe Ti-84 Plus CE though... holy shit, it is using a 48MHz eZ80 chip. That's not \"low-end smartphone\", that is half a Nintendo DS minus a proper GPU levels of unperformance."
        ]
    },
    "ELI5: why can’t the UN have a completely unified currency?": {
        "title": "ELI5: why can’t the UN have a completely unified currency?",
        "score": 330,
        "url": "https://www.reddit.com/r/explainlikeimfive/comments/1dlhsab/eli5_why_cant_the_un_have_a_completely_unified/",
        "content": "This came up in conversation between my mom and I talking about Euros and how cool that is to me (Canadian). I then wondered why we can’t just have that everywhere and all she could say was “it wouldn’t work, what about less profitable countries” and I said “they’d just make/have less?” She did not like that answer and I really wanna know the real reason on why that wouldn’t work bc in my mind since we made up money why can’t we just make up how new money works??? \nPlease explain like a teacher explaining why a kid can’t share 3 m&ms with 28 people ",
        "num_comments": 109,
        "comments": [
            "You see some of the pain points with a unified currency looking at the Eurozone. By ceding control of their monetary policy, countries who have an economic downturn have significantly fewer tools available to them to address it. Why would Germany and France weaken their currency because Greece is having an economic downturn.",
            "In general sharing a currency is beneficial if those places/people have certain freedoms of movement, exchange of goods and services, and investment.\n\nThere's a concept called \"[optimal currency area](https://en.wikipedia.org/wiki/Optimum_currency_area)\". It says that any currency has an optimal coverage that, if met, then the benefit of having the same currency is the maximum possible. If the actual area is smaller, then the places outside could benefit by having the same currency as the one you defined, and if the actual area is bigger, it would be beneficial for those places that share a currency to have different ones, maybe because there are certain limits on how people, goods and/or capital could move from one place to the other.",
            "Why would the US want to tie its economic policy and currency with, say, Venezuela?",
            "You would need to have uniform rules and management of it, and that'd be a tough thing to get diverse countries like the US, Canada, China, Iran, Russia, and North Korea to agree to.",
            "Effective monetary/currency policy is heavily dependent on economic factors which vary from nation to nation.",
            "1.  Firstly, it'd require all countries (and their politicians/leaders/kings) to agree to one currency.  Then the question arises: what currency will they use?  Why should the Chinese use USD?  Why should North Korea think all this is nothing but an American plot?  Why shouldn't Islamic countries say that Christian currency doesn't adhere to Islamic values?  You get the point. \n\n2.  How will a country convert to the common currency?  Will you base it on prevailing exchange rate?  If so, countries that are poor now, but growing fast will suffer.  If it's based on purchase power parity, large populous countries like India and China will suffer.  Basically, nobody will agree to a meaningful conversation rate (because it's complicated) \n\n3.  Trade between countries today affects the relative exchange rates between their currencies.  Moving to a common currency will significantly hit export oriented countries like China, India and USA.  So they won't agree to a common currency.\n\n4.  Money as a behavior modifier:  Powerful countries like USA use their dollar value to impose sanctions on misbehaving countries (like Russia right now).  Using a common currency removes this incredibly powerful lever, or makes it vastly complex.\n\n5.  There's no value to a common currency.  Whatever you can do with a common currency, you can already do with individual currencies.\n\nEurope was an incredible rare case where you had group of countries that were all small, politically stable, financially stable and rich (through slave trade and colonization, but let's not go there now).  They also have common political values and common enemies.  They've been cooperating on mutual defense for hundreds of years (individual countries, although not collectively).  They've been cooperating on mutual defense recently as NATO for the entire continent.  So merging the currency was relatively simpler.",
            "Monetary policy is generally best determined at the country level, and a large group currency like the euro comes with some huge downsides that are not always apparent right away. \n\n  \nWe saw the big downside of a single currency when Greece had financial issues years ago. If Greece had its own currency, the financial crisis would have weakened the it's currency relative to that of its neighbors. While this isn't great, it acts as a sort of cushion. A weaker currency means that exports are cheaper. This means that as a country gets in a worse financial position, other countries want to buy more of it's goods, helping to raise the economy.\n\nWhen you have single currency, the whole eurozone changes as one. This means if one eurozone country has issues, there is no way cushion, and downturns will be worse. \n\nOn the opposite side, a single country gives huge benefits to stronger economies like Germany. Normally, if your economy is very strong, your currency will strengthen and decrease your exports. But again, even though Germany has been doing well, that natural swing in relative currency values does not happen.\n\nThus, you can kind of think of a single group currency as almost a wealth transfer from the poorest countries to the richest countries in a way that makes crises worse.",
            "Control. Nations exert control over their economy by deciding how much of their money to print. Once you have a unified currency, nations no longer have that control. Europe managed to get it done because it's relatively compact, mostly similar, and they have broad agreement on other things, such as the European Union itself. But that isn't at all possible on a global scale.",
            "UN: let's use a single currency \n\nCountries: make me\n\nThat's it. UN can't make any country (especially when the country isn't a failed state) to do anything.",
            "To have unified currency you need to have unified monetary policy.... that is a lot of independence for an country to give away. Tax policy and all sorts of very critical things depend on it. Eurozone is very unusual in how tightly different independent countries are allied and how much the laws and policies are aligned. Without such a deep alliance, you can't really share a currency. Well, you can have dollarization, but that's not quite the same thing, its a very raw deal for the country using a currency it doesn't control.",
            "There are many answers here which address the monetary/economic aspects of your question - and why a shared currency doesn’t always make sense for either weaker or stronger economies. \n\nHowever, the fundamental premise of your question is flawed in its assumption of what the UN does. The United Nations is not a government. They do not govern, nor do they set binding policy. The UN is a forum - a problem-solving arena. It’s a place where nations can express their grievances and explore if other nations want to engage/support them. \n\nThey would have no mechanisms to back a standard currency. The UN has no reserves; no powers of taxation; and no global/sovereign authority. \n\nIn short, it’s impossible given the structure and mandate of the UN.",
            "There’s no technical reason we couldn’t do that, but there’s a ton of political reasons why we can’t. The world is not unified enough to accept such a thing. Controlling currency confers a large amount of power to the group doing so. Look at the US sanctions on Russia, for example. Cutting off Russia from the international banking system is only possible because the US controls the dollar, which is used as the de-facto currency of trade in much of the international community. China is trying to position itself as an alternative to the dominance of the US dollar. Do you think that either country would accept giving up that (potential) power?",
            "Even within the EU and within Schengen zone not all countries are on euro (looking at you forint at least). It takes a massive level of cooperation and.m consideration to work and really countries need to have compatible goals and levels of economic development to make it work. A bunch of the tricks of economic control go out the window if you give up control of currency. This might add stability and de facto it happens when countries move to something pegged to the US Dollar often as a long shot at recovery after years of mis management and huge foreign debts.",
            "Not an answer to your question… but check out Ecuador! They use the US dollar, to mixed results (depending on who you ask).",
            "The UN isn’t a world government. Every member nation is a sovereign nation free to write its own laws and policies. The UN works by consensus and try getting 192 random people to agree on anything much less people from vastly different cultures and governments. \n\nThe UN still has plenty of value and should get support but expecting it to exert its will over the world is a misunderstanding of how the UN is meant to operate.",
            "The eurozone is better for the wealthier countries of Europe than it is for the poorer countries in Europe. Much of southern Europe essentially has overvalued currency relative to their economy, while Germany in essance has an undervalued currency relative to what the deutschemark would be on its own. In an export based economy it's advantageous to have a weaker currency, in an import based economy it's advantageous to have a strong currency. This is why China devalues it's currency, it's economy and political stability depend on maximizing employment and exports. Germany has a disproportionately large industrial sector relative to other western economies and it's very much bolstered by the euro. If poorer countries in southern europe had direct control over their monetary policy they'd likely be better positioned to compete in global markets for exported goods.",
            "If you had one global currency, then whoever controlled printing that currency could buy anything they wanted from anyone in the world, just by printing that money and then using it to buy things.   \nIt would be too much power concentrated in one place.",
            "They can, there are just downsides to it and it would require some geopolitical maneuvering to secure in votes in the United Nations.\n\nRealistically though the world pretty much already operates on US dollars or a US dollar equivalency it is easy to figure out for pretty much any currency or goods, which means that there's really not any good reason to even think about a United Nations unified currency because it wouldn't drastically change the status quo for the vast majority of countries and would just introduce new difficult to solve problems for the remaining few",
            "Countries wouldn't want to give up their control over their own monetary policy. How would policy even be decided between 200 different countries with different economies with different needs?",
            "The UN is amazing at opening discourse and providing the framework for groups to deal with major issues, but it has basically no executive power to actually do anything (largely by design and because it was forged in the early cold war and looked to attract the major powers by giving them carte blanche, effectively ceding any sort of actual binding power, but that is a seperate issue).",
            "The UN doesn't collect taxes (more like dues) and doesn't have the ability to issue their own bonds or currency backed by bonds.  Even if they had the means to issue a currency and financially back it, they don't have the authority to make anyone else use it except out of convenience.  (For example, many countries use US dollars for transactions for the convenience).",
            "It can. But the member countries choose not to, for many of the reasons described by other commenters.",
            "The Euro works because the european union is a governing body that can impose its trade and commerce rules on all of its members, and can choose to exclude countries that aren’t economically stable from joining.  The UN is not a governing body.  And not all of its current member states are economically stable.  they would lower the value of the currency for everone else,  and certain members shouldn’t be trusted with the means to manipulate the strength of a unified currency (I’m thinking of Russia, but I’m sure there are others.)",
            "Unified currencies are kinda shit for everyone involved unless your economies are deeply interconnected with everyone involved. \n\nOtherwise, the economically prosperous are suddenly being pulled down by the economically weak, and the economically weak are unable to take action because they can't control their own currency.",
            "Imagine you have the same currency as Argentina or Venezuela, countries with inflation in triple digits at some point, a country like Japan would have a collective heart attack with the idea. \n\nIn ELI5 terms, you and I have 100 USD in Monopoly money. My mom got me more Monopoly money but just for me, so now I have 200 and you 100. Again, she gives me more so now I have 500 and you 100. Your economy slowly suffers because of me and you don't like that, so you stop using monopoly money and get your own money. :D",
            "It's a bit long but I think helpful.\n\nI grow watermelons, my neighbor grows apples. A watermelon feeds more people so comparable to so many apples. \n\nIf I have a bad season and my watermelons are smaller they are worth less apples. If my neighbor has a good season and his apples are larger my watermelons are worth less apples. If my watermelons get bigger or apples get smaller, a watermelon become worth more apples. \n\nCurrency works similar to this. The size of my neighbor's apples doesn't affect how many people my watermelon can feed. It affects how many people can be fed by apples. Hunger is the commonality behind the scenes driving the value of each fruit (currency)\n\nYes money is \"made up\" and yes we can decide which rules to make up but money as it works now started as an equalizer & a universal bartering object. How many glasses of oranges juice does a software engineer get paid a day? Converting each of those to a currency value gives a place of commonality to compare unrelated things. Money isn't completely made up.\n\nCulture, geography, politics, supply and demand all affect currencies. Going back to watermelons and apples. On each of our farms we have workers that we pay in the fruit in we produce. I pay my workers a watermelon a day. My neighbor pays 10 apples a day. If his apples get smaller, that wage stays the same and there is more hunger on his farm, or he starts paying more apples a day to keep hunger at the same value. This is a situation only affecting his farm and his currency.\n\nNow say we both grow apples and both pay 10 apples a day. If he has a bad season my apples are will feed more than his apples. So he ups his wage to 15 apples a day to keep hunger the same. \n\nHis workers are now \"richer\" than mine. They have more apples. My employees are now upset that I'm underpaying them compared to my neighbor. A glass of water is half an apple at my place but is a whole apple at my neighbor's now. Now his people are going to buy water at my place. Which is inflating the apples on my farm and now we can't get rid of enough apples.\n\nThe guy we buy oranges from feels like he's getting ripped off cause apples trade 1 to 1 with oranges, but the bad season apples should be 2 apples per orange. So now orange guy adjusts to 2 to 1 and I'm getting screwed cause my neighbor had a bad season.\n\nNow say I live in the US and my neighbor lives in Australia, and replay all that. Everyone in the US gets screwed cause Australia has a bad season.\n\nBut with watermelons vs apples. My farm's (country) internal workings aren't affected by my neighbor's farm or changes to it's internal workings. The adjustment is his currency drops in value compared to my currency.",
            "Country 1: has plentiful natural resources. Especially food and water. People with salt want apples. They exchange goods. Now everyone has both. Continue until everyone has everything they need to just live. Then they do things for fun. Like discover metallurgy. And magnets. And fire and lightning. And then start inventing things. And learning things. And develop physics and chemistry and biology and medicine. And one day transistors and then iPads.\n\nCountry 2: has nothing except fish and apples and sticks and mud and leaves. Completely land-locked and ringed by high mountains. Everyone eats fish, but is getting all kinds of diseases from malnutrition. Two people have apple trees. They guard them ferociously. Everyone gives them piles of fish and sticks and mud and promises to build them magnificent mud huts, so they don’t die of rickets and scurvy. \n\nOne day, Country 1 bores a tunnel through a mountain for their high speed train. Meets Country 2. One day, decide to form a union, and adopt a single currency. Country 1: well, we both have apples. Let’s figure out how much an apple will be. Country 2: great—an apple costs 1,000 sticks, 200 buckets of mud, and a wheelbarrow of fish. Country 1: “WTF, bruh, an apple costs 25 cents, or about the price of a song download or a slice of bread. WTF are we gonna do with 1,000 sticks??” Country 2: what’s a “cent”, what’s a “song”, and you make houses with sticks and mud! Country 1: “Nah, bruh, we make houses out of 3-D printed aerated autoclaved concrete. Your apples cost too much fish, but your houses are worthless, and we already have enough apples. You have no use for our songs, b/c you don’t have MP3 players, and can’t make them from sticks and fish.”\n\nModern equivalent: in Bulgaria, maybe a computer programmer can make $30k a year and own a home and live well. In Silicon Valley, you can make $175k and be homeless and homes are worth 1.5 million. \n\nChallenge: describe a system where these two countries share a currency.",
            "Oooh, this is pretty tough to do ELI5.  But I'll try.\n\n# Money is a store of value\n\nMoney is simply a store of value.  For many people it's just a way to say \"I worked this much, creating X value.  I don't need to use it right this second, but maybe later.\"  Or perhaps you took a risk on something and it worked out creating Y value for the rest of the world, but again: you don't need it right that moment.  So you need a way to store it.\n\nIn this way, no organization can \"create\" money, because it comes down to what everybody just accepts as having value.  Rare metals were pretty good, because -- you know -- they were rare.  Governments were able to tie into this to offer their own currency by promising you could get that much gold for this coin or that flappy piece of paper.  Once people accepted a currency as having value, then the connection to gold was eventually dropped (making a certain kind of person very upset).  Now countries will use an established currency, like the Dollar or Euro to establish value for their own currency until it is accepted as its own value store.\n\nIt's sort of like a chain of trust.  I trust gold.  You linked your currency to gold?  Great, I trust your currency.  Oh this other person linked \\*their\\* currency to the one I already trust?  Great, I now trust their currency too.  And as long as that trust is not violated, eventually each link can stand on its own.\n\nSo the UN cannot just declare it has a currency.  Somehow, it needs to tie into something that has accepted value until the UNBucks^((tm)) are accepted on their own.  The Euro had to do this too.  We had a lot of years where people were using the Euro without even knowing it.  And then we had a good number of years where people used the Euro, because they were still tying it into a fixed value in their own currency (It took well over 10 years here in Germany to stop saying \"100 Euros?  That's 200 Marks!\"  20+ years later, some people still do it).\n\nSo all this leads to the following problem: what exactly should UNBucks be tied to?  The Dollar?  That would make the most sense.  Good luck getting China and Russia to go along, and that's 2/5ths of the Permanent Council right there.  And if you tried to tie in the Ruble or the Yuan right now, the Americans (and probably the British and the French) would immediately strike it down.\n\n*So Answer One:* The UN would never be able to agree on how to link UNBucks to an accepted store of value.  It fails politically.\n\n(continued below, as my answer seems to be a bit too long :) )",
            "Imagine kids playing in a playground. They see different kind of rocks that are cool. These kids trade with each other the rocks for either food or first to play a game. Now a someone comes and says “how about we use the red rocks as our only currency”. Some kids will agree since they already use the red rocks. Some kids will say that the red rocks are not as good because they are already using the blue rocks. Some kids will have to give up all the rocks they saved up and use this new currency. \n\nAn adult sees this and tells the kids to stop using rocks and using bottle caps and start over. The adult will trade the each of their rocks for bottle caps however not all rocks are valued the same.\n\nIt’s a political nightmare. \n\nHere are some things that countries can’t agree on. \n\nWho is allowed to print the currency?\n\nWhat body is responsible to make sure other countries are following the rules?\n\nHow will the rules be enforced?\n\nWhat about their old currency?",
            "The previous attempt, called the gold standard, led to the Great Depression and then the Second World War.\n\nThe Euro crisis caused the European Union to transform dramatically.\n\nBe careful what you wish for.",
            "It is insane how people keep regurgitating the same thing with \"countries need to be able to devalue their currencies to have more competitive exports\". First of all, there is an international treaty signed by most developed countries to NOT manipulate the market like this. Second of all, \"devaluation of currency\" is just a more convoluted way to reduce your prices, which you can also do to be more competitive to the same extent. Third of all, this supposedly miracle solution has a quite big negative effect on import prices, which in the global economy make up a significant amount of goods in most countries. This is also why poor states choose to peg their exchange rate to the USD/Euro/etc. and keep price stability instead of undervaluing their currency. \n\nHaving that cleared out, the real reason countries haven't done it is the fact that it requires a kind of political cooperation and harmonisation which is just unthinkable on global scale.",
            "The Euro zone only works because there is a very large degree of political and economic integration between the member countries. There are certain requirements and directives all must live up to and that also requires a certain level of political commitment and cooperation.\n\nDoing that for the entire world is simply not possible. How do you think it would go when China, Russia and USA would have to agree of monetary and economic policies? It wouldn’t work.",
            "Unified currency would be useful but it's far less interesting. It also screws poorer countries overall. \n\nI, personally, like that countries have their own currency, sure, I need to convert mine and sometimes things end up costing more or less because of it but ultimately it makes places feel more unique which I think is important.",
            "Creating a single, unified global currency is a complex issue with many challenges. \n\nUsing your M&Ms analogy, imagine you have a classroom where some kids have lots of M&Ms, and others have very few. If you try to give everyone the same number of M&Ms, the kids who had a lot might feel like they’re losing out, while the kids who had few might feel like they’re finally getting a fair share. But the problem is, not everyone agrees on what’s fair. Similarly, countries have different economic strengths and weaknesses. A single currency would mean that all countries have to follow the same economic rules, which might not suit everyone’s needs.\n\nEach country likes to control its own M&Ms. This means they can decide how many to give out, how many to save, and how to use them to make trades. If there was one big jar of M&Ms for the whole world, who would decide how many M&Ms each country gets? This would mean countries would lose control over their own economic policies, like setting interest rates or printing money, which are crucial for managing their economies.\n\nDifferent kids have different ways of playing with their M&Ms. Some might trade them, some might save them, and some might eat them right away. Similarly, countries have different cultures, political systems, and economic philosophies. A single currency would require all these different systems to work together smoothly, which is very difficult to achieve.\n\nSwitching to a single currency would be like trying to get all the kids to agree on one way to share and use their M&Ms. This would involve changing a lot of rules and systems, which can be very complicated and might not work well for everyone. Some countries might struggle more than others during this transition, leading to economic instability.\n\nIf one kid in the class eats all their M&Ms and has none left, it might not affect the others. But if everyone shares from the same jar and one kid takes too many, it could mean there aren’t enough M&Ms for everyone else. Similarly, if one country faces an economic crisis, it could destabilize the entire global economy if there’s only one currency.\n\nSo, while the idea of a single global currency sounds simple and fair, the reality is that it’s incredibly complex due to economic diversity, the need for sovereignty, cultural differences, and the risks involved in transitioning and managing such a system.\n\nBut what about the EU, you ask?\n\nRemeber: The EU is a unique political and economic union with a high degree of integration among its member states. The Maastricht Treaty, from 1991, laid the groundwork for the euro by creating both an economic and monetary union. This treaty established strict financial and economic standards that countries must meet to adopt the euro.\n\nThe centralized control offered by the ECB helps maintain economic stability and manage inflation across the member states. For a global currency, establishing a similar central authority would be extremely challenging due to differing national interests and governance structures.\n\nThe euro has facilitated trade and travel within Europe by eliminating currency exchange costs and reducing exchange rate risks. This has boosted economic integration and made it easier for businesses to operate across borders. But the benefits of a single currency are more pronounced in a region like the EU, where countries are geographically close and have strong economic ties.\n\nWhile the EU has managed to unify many of its member states under a single currency, not all EU countries use the euro. Countries like Denmark, Sweden, and the UK (before Brexit) have chosen to retain their own currencies to maintain control over their monetary policies and economic strategies.  Achieving consensus even within a relatively homogeneous group of countries is challenging, let alone on a global scale.\n\nThe EU's has mechanisms to support member states with weaker economies, such as structural funds and financial assistance programs. However, these mechanisms are not foolproof and have faced criticism, especially during economic crises. Extending such support globally would be even more complex and contentious.\n\nThe transition to the euro was a monumental task that required significant coordination and planning. It involved phasing out national currencies, updating financial systems, and educating the public. Implementing a global currency would be exponentially more difficult due to the sheer number of countries and the diversity of their economic systems\n\nThe euro works for the EU due to its high level of economic and political integration, shared governance, and regional economic benefits, but these factors are not easily replicable on a global scale. The challenges of economic diversity, cultural differences, and the complexity of implementation make a single global currency impractical.",
            "You should have started with the question: What actually is the UN, and what do they do?\n\nBecause they have literally nothing to do with controlling anything, or deciding anything, at all, for any country. It's an organization founded with the singular goal of preventing WW3 through dialogue. That's it. They make suggestions that countries are free to follow, or not. \n\nThey can't force everyone to share a currency, and it would be impossible to get everyone to agree. So they have no reason to even try.",
            "The $US is probably closest thing we have to a global currency right now, and that’s fairly tenuous at best.",
            "Completely subjectively, this is a problem crypto aims to solve. BTC is just that and not tied to any one country. It has its other issues, but it's essentially a global currency. Now as others have described, countries are acting in their own best interest to control their economy. Kind of a situation where you'll never get rid of either",
            "To expand on this:\n\nWhen a country is going through economic difficulty, weakening the currency is often the least-bad option.  If your currency gets cheaper, then your exporting industries (including things that we don't think of as exports like tourism)  become more competitive. The part thats bad is that everything that you buy from outside the country becomes more expensive.\n\nBut why does this work? Mostly because people in your country are getting paid less (in terms of other currencies). Weakening a currency is a quick way for a country to say \"we are poorer than we used to, we might as well act like it.\" It applies to haircut to every contract / price within the nation's economy instantaneously. \n\nIts not perfect, but \"everybody's money is worth 20% less than it used to be\" spreads the pain around, and can allow a country to focus more on rebuilding and less on the political fights about who has to absorb the pain.\n\n(If this wasn't ELI5, we would talk about \"Downward Nominal Wage Rigidity\")",
            "Adding onto this, the reason the Eurozone muddles by as well as it does is because, relative to the entire world, countries are relatively economically similar. A very large part of the EU accession roadmap is aimed at promoting economic convergence. Try to apply one currency to the entire world, where some countries are basket cases and others manufacturing powerhouses and still others mostly agrarian societies, is going to be suboptimal for almost everyone.\n\nThere is an area of academic scholarship around optimal currency area theory (https://en.wikipedia.org/wiki/Optimum_currency_area) and if you’d like to learn more about this this is what I would look into.",
            "Well, Germany has benefitted enormously from an undervalued currency. While the euro is valued too highly for the Greek economy, it’s way too undervalued for the German. Meaning the German productivity is sold at a discount.",
            "**Radical and possibly crazy view** - just as Greece might have an economic downturn in comparison to France, so might the various towns and cities in France have economic downturns in comparison to each other. The economy of Paris is different to Bordeaux, and each is different from other cities and towns in France.\n\nEach *city* (or large-ish town) has a discrete economy that would benefit from having its own currency. Prior to computers this would have been a nightmare of thousands of exchange rates but that's no problem now that everybody carries a powerful handheld computer with them everywhere they go.",
            "Yes the Euro is a massive economic risk/achievement that can only be done through a trade union of countries that have established a central bank amongst them. If you had lived in Europe during the Global Financial Crisis you would know that many economists were predicting it as the end of the Euro as different countries couldn’t respond effectively without control of their monetary policy. Its a brilliant/terrible idea that can’t be extended globally at all.",
            "Relatively simpler *and still incredibly difficult and unpopular*, people are quick to forget that several important countries only joined the EU on the condition they could opt out of the Euro, and dissatisfaction with how the Euro is being managed by larger countries in the EU is still a major point of tension between many EU members.",
            "Just like the Euro we should make a currency called the Uno",
            ">(through slave trade and colonization, but let's not go there now).\n\nHuh? \n\nWhat a bunch of reductionist horseshit.",
            "So I realize that is not very ELI5...so let me try to make it a bit more simple.\n\nLets say you have three construction workers, Aaron, Betty, and Carl. Now, they all compete with each other for jobs. In normal times, they all end up charging clients $100/hr to work, and let's say there are enough jobs that each of them works 40 hours per week (or $4000 per week).\n\nThen let's say that Carl breaks his leg. He can still work, but he isn't as fast. Now instead of charging $100/hr, Carl really needs the work (for his medical bills) and is less efficient. So he starts charging people only $90/hr. This allows Carl to continue to be competitive with Aaron and Betty who are both better, but charging more. Now, Carl makes less overall (maybe $3600 per week) but he is still able to get jobs because his price is competitive.\n\nThis is how it works when countries have their own currency and price levels can adjust independently.\n\n  \nNow, let's assume Aaron, Betty and Carl all agree to charge the same price (i.e. have a single currency).\n\nNow when Carl gets hurt, he still becomes less efficient. However, since they have all agreed to charge the same price, a customer has the choice of paying Carl $100 for slower work, or paying the same price to Aaron or Betty the same price for better work. Obviously, customers will keep picking Aaron and Betty, and Carl will only get the work that they cannot do. In this situation, Aaron and Betty may each make $5000 per week while Carl only gets they jobs they cannot do, and so makes only $2000 per week. No one hires Carl unless they have to.\n\n  \nWhen Carl is hurt, he can't adjust his price to remain competitive with Aaron and Betty. Thus the single price (currency) ultimately makes the cost of his injury a lot worse.\n\nThis is how it works when there is a single currency.",
            "Would the same problems apply to a large country with diverse regions?",
            "I would argue that there are also religious reasons. There's a lot of Christians out there, and even the ones who don't act Christ-like but like to thump the Bible anyway would probably see it as some shit from Revelations and flip their shit about it and push the politicians in their country not to run with it.",
            "I was waiting for someone to bring up Ecuador!",
            "# Economies are not the same\n\nEconomies are all different.  Some depend on imports.  Some on exports.  Some on neither.  Some on both.  Some are expanding.  Some are contracting.  Some have oversold real estate.  Some don't have enough land.  Some are agricultural.  Some are industrial.  Some are financial.  And so on.  You get the idea.\n\nNow take Covid and the response to it.  This caused different countries to have unique problems depending on all those factors above.  One set of problems boiled down to either having too much liquidity (because they printed too much money to try to keep people from rioting) or not enough liquidity (because everyone got scared and sat on their money).  This is one type of problem that you can use monetary policy to try to fix, or at least make less bad.  Liquidity is too low?  You make money printer go \"brrrrr\" (for the over-5s here, yes: this is generally by increasing debt to increase money supply).  Too much liquidity causing inflation?  You tighten the money supply by any number of means.\n\nThat is great, but it means \\*someone\\* has to be making these decisions.  The more centralized this decision is, the harder it becomes to handle individual problems in individual countries.  Some countries are going to benefit a lot; some are going to hurt.  Someone else already mentioned that the Euro has had no end of problems with this, and they are right.  Oh, and by the way: who exactly is going to be calling the shots?  (The U.S. will, in case you really were wondering.  It would be the only way to get them in.)\n\n*So Answers Two and Three:*  \nHaving a central money authority means that some areas get preferential treatment and some just have to suffer.  \nTrying to figure out who gets to make these decisions is yet another political no-go.\n\n# Just one more thing\n\nWhile everyone is always quite clear on the advantages of a single system, many people are not quite as clear on the major disadvantage.  For instance, if some country...let's say Turkey for no particular reason...decides to go down a really murky and dubious economic path, they screw things up for Turkey.  Ok.  That's bad for Turkey, but at least everyone else has a little bit of a buffer.  Even if the U.S. screws things up, most of the world will take a hit but not completely collapse.  With our current system, we have some firewalls in place that keep one bad decision from bringing everything down all at once.  (Major simplification, but also mostly true)\n\nIf there was a single currency being run by a single organization, we are one bad hangover away from the entire world economy from falling apart, completely, all at once.  As far as I can tell, there is no solution for this, because the entire \\*purpose\\* of having a single world currency is to eliminate all redundancy.  That is the sales pitch.  But the big benefit contains the seeds of its own demise, and I have no clear idea how to mitigate that inherent risk.\n\n*So Bonus Answer 4:*\n\nA single world currency is risky as hell, and puts all our eggs into one giant basket.",
            "Care to do a ELI18 on downward nominal wage rigidity??",
            "I really think this is where the US is headed. Every politician in Washington knows a deficit that's increasing by $1 Trilliion dollars every quarter is *completely* untenable. But almost NONE would dare cut Medicare or Social Security, which are the lion's share of the budget. Senior Citizens would destroy the politicians that did that, and they're the biggest voters. And nearly ALL voters would also retaliate if taxes were raised substantially enough to make a dent in the deficit. No politician would have the balls to raise taxes back to 30 - 70% like it was pre-Reagan.\n\nSo, devaluing the currency becomes the least-bad, bad option. Pay off the debt with cheaper dollars. The US's position as an economic and military power would be weakened, but not broken.",
            "A really good example of what happens when dissimilar economies use the same currency is Ecuador and the US dollar.",
            "The thing about that is though that many developing countries peg their currencies to more stable ones like the USD or Euro, thus essentially using thosebcurrencies.which provides them with price stability.\n\nNow unless we want to argue they're stupid, economically illiterate and don't know what's best for them, I think we should be pretty sceptical of \"optimum currency area\" literature.\n\nIt's also fair to note that most societies historically did not use fiat currency with free floating exchange rates, so we're talking about a relatively recent trend to begin with and using that as our \"default\" normal expectation. Even if there is a tradeoff, it's not at all obvious that this is somehow the very best system and is certainly not just some sort of \"natural\" system.\n\nBy recent I mean for instance in Europe free floating national currencies existed as the main method of exchange from the end of the Bretton Woods system in 1973 to the creation of the European Exchange Rate Mechanism in 1979. That's a whole 6 years Europeans could tolerate free floating national currencies.\n\nSo again we must ask the question, are Europeans just economically illiterate and stupid, or does their experience tell us something, are their reasons they wouldn't want free floating currencies?\n\nNow as far as Europe goes, we could of course use the \"optimum currency area\" theory. Certainly Europe is quite fragmented into mostly quite small states so we can argue they're quite far from optimal markets in general and trade barriers, including currency risks are thus far more significant. In principle it has been proposed that having two separate \"eurozones\" could be \"optimal\" and balance the EU economy, but at the very least few people would _seriously_ advocate 27 national currencies.\n\nBut then we oddly seem to privilege political state borders in these analyses? Why is Germany one unit in such an analysis, might we not consider whether East Germany should use the same currency or not? What makes the United States an optimum currency area?\n\nFinally, currency is in a sense \"just\" currency. The economy is ultimately about actual production, competitiveness, etc. currencies do not magically solve underlying problems of countries. Changes in relative values if currencies as a result of capital movements can be helpful at alleviating issues in the short term (though they can also be dreadful and the cause of currency crises), but all this is kind of speculative nonsense on top of the \"real\" economy. All this means is that without a state currency, a state has to actually address the root causes of problems, which while it may be politically uncomfortable is certainly not the worst of incentives for politicians to have.",
            "Just out of curiosity, how is that any different than the us? We have the financial sector and tech dragging along Alabama and Mississippi.  How is Europe different?",
            "Interesting idea but still seems like it would be a nightmare to manage even with computers.",
            "[Local currencies](https://en.wikipedia.org/wiki/Local_currency) are a thing.",
            "I don't agree because there's still some friction with currency exchange and prices would become much less stable -- e.g. the Bordeaux franc appreciated and Bordeaux wines are now 25% more expensive this month. But, while radical, it's not a crazy view. Look at https://en.wikipedia.org/wiki/Optimum_currency_area and some conclusions that existing large diverse countries might not make optimum currency areas.",
            "People aren’t quite to forget that, because it’s not the case. Only Denmark has and the UK had an opt-out from the euro, not ‘several’ important countries, and they were already in the EU before joining the eurozone became a condition of accession.\n\nNo country has joined the EU with an opt out of adopting the euro. \n\nAll other EU member states are obliged at some point to adopt the euro, but whether they work to fulfil the conditions is a different matter.",
            "How is it horseshit? Britain looted 45 trillion from india during their entire period of colonising it, france still took 500 billion a year from africa.",
            "Great ELI5, thanks.",
            "You say “now let’s assume Aaron Betty and Carl all agree to charge the same price (ie have the same currency)”. This confuses price and currency. There’s no reason why any of them can charge different amounts in a single currency just like in the case when on has injury. In fact it happens in the EU too where costs for same products differ from country to country",
            "No, because the key factor is that the *fiscal unit* and *monetary unit* must match.\n\n\nSo long as the richest and poorest US state share the same *fiscal* controller (the Federal government), they can tax richer areas to give to poorer areas. \n\n\nThis is why Greece demanded German money, while Germany balked. German taxpayers propping up Greece when times are bad is a *requirement* for the proper functioning of a monetary union.",
            "They do.  They just have federal taxes and other ways of mitigating the inequalities.",
            "Yes, but they're much smaller.\n\n1) You have an economic crisis in Louisiana which causes a lot of people to move to Texas. This tends to reduce the issue (Louisiana unemployment drops, unemployed people get jobs in Texas). But, although it's legal, that is much harder with, like, Greece and Germany. How many Greeks speak German? How many Portuguese people speak Swedish?\n\n2) European welfare spending and taxing is by country, but much of US taxing and welfare spending is federal. So high unemployment in a country lowers the tax revenue but increases spending needed. \n\nThe euro crisis in Greece (and other countries) meant that Greece has to fund much higher support for the unemployed, at the same time their tax income plunged, which made their finances look even worse, which increased their borrowing costs, which meant they looked more likely to default. Which increased their borrowing costs. This forced spending cuts and tax increases, which shrank the economy, which made them more likely to default, which increased their borrowing costs, and this cycle kept going.\n\nIn the US, a state or group of states having an crisis doesn't have to fund much of its aid, it comes from DC. In poorer states, the federal government just spends a lot more than it collects in taxes every year.",
            "Correct me if I'm wrong but the ELI5 version is just that people really hate making less than they made in the past, like really hate it, hate it badly enough that they might just quit or stay unemployed to avoid it, but sometimes things happen in the economy that mean wages \"should\" go down. Devaluing a currency is one way for wages to decrease without actually cutting anyone's paper wages. This is also incidentally a big reason why small amounts of inflation are good for the economy",
            "People don't like taking pay cuts. So wages don't tend to drop in raw number terms. Instead, if wages do drop, they tend to do so in \"real\" terms by not increasing as fast as inflation. \n\n\"Real\" being actual buying power, how much stuff you can buy. \"Adjusted for inflation.\"\n\n\"Nominal\" is the raw number, which doesn't really tell you much about what you can buy with it. Not adjusted for inflation.",
            "The borrowing would be devaluing the currency if this was problematic. However, the rest of the world is in an even more precarious position, so the US borrowing money simply attracts more investment into the US (paradoxically, strengthening the US economy further).",
            "Social security I'll grant you, that's a whopping 20% of the budget, but medicare is about on par with military, interest, and national defense (each, not combined). It's only the biggest expenditure if you lump it in with the entire category of health spending, which includes many things that are not medicare (or health insurance at all). I don't mind if you do wanna lump those things together, mind, you just gotta say health spending and not medicare. \n\n(I don't have qualm with the meat of what you said btw I just needed to nitpick that detail.)",
            "The military is a huge expenditure",
            "Optimal currency area analysis has been applied to sub-national areas. One such study is referenced in the Wikipedia article I linked.\n\nI don’t want to take a position for or against any specific theory in this study area, as I’m certainly no expert. But it seems obvious that there are some key factors that would drive whether a collection of territories should share a currency or not, given the pros and cons of such an arrangement, and that’s what this area of scholarship aims to study. \n\nCurrency pegs also have their own pros and cons and are a related area of scholarship.",
            "There’s three major differences, two of degree and one that is unique to the US.\n\nThe unique one is fiscal transfer. The federal government will physically transfer money to states that are lagging behind, in the form of disaster relief, economic development/recovery programs, and federally funded economic and social programs. The EU formally prohibits this kind of transfer (richer states don’t want to bail out troubled ones) though this rule has been broken in the past, but only in times of extreme economic crisis (e.g. Greece). In the US this kind of transfer happens constantly and as a matter of course.\n\nThe two differences of degree are labor mobility and trade. While Schengen citizens have the right to move and work anywhere in the Schengen zone, in practice language and cultural barriers make this difficult, so labor mobility is much lower than in the US. And while there are no tariffs for companies trading within the Eurozone, trade among US states is still much higher.",
            "Well, Britain never even used the Euro, so I'm not sure I would describe merging currency with them as easy.",
            "I try to make it clear to my boss that I know an annual increase less than inflation is a pay cut. So when I hear next week that I’m getting a 3% raise I will say, again, that it is not a raise, it is decrease in my pay.",
            "Yep. The fact that investors are willing to continue buying T-bills indicates that they believe the US is *not* going to default on its debt, that the currency is *not* going to collapse, and so on.\n\nThe principal source of uncertainty about the US government's ability to pay off its debt is political brinksmanship, where far-right members of Congress use the legislated debt ceiling as a cudgel to extract policy concessions.\n\nOnly one other country in the whole world has a legislated debt ceiling, and there's no particular reason that the US should follow the example of Denmark here.",
            "Yankoids be like \"it's social security ruining our country!\" meanwhile....",
            "It's a huge expenditure but you could completely stop all military spending and it would be less than half of the deficit.   That's how much the US spends in general. The US has been spending way above its means and social security is the favorite target because it's the single biggest easily cognizable category.",
            "Being an empire is expensive.",
            "Note that there are transfers from the richer states to the poorest ones in the EU, but more based on directly funding projects. The poorest states \"get more funds\" to build highways,...",
            "It is common for people living to complain about money going to poor areas. It can be argued that such transfers are mostly to cover the cost of the poor areas being stuck with a currency which is valued for the rich areas, not the poor ones.",
            "Wrong comment buddy",
            "It technically is a raise though. If they were to not increase your pay at all, or even just 1-2%, you'd be getting even less than with a small raise. This is also why it tends to be beneficial to change companies every 3-4 years. Changing companies is by far the best way to get a competitive raise.",
            "I’m pretty sure Denmark got it from the US, and not the other way around. Nobody else would be dumb enough to legislate themselves into this sort of corner for the first time",
            "If im not mistaken, isn't Germany's Schuldenbremse essentially the same thing?",
            ">If they were to not increase your pay at all, or even just 1-2%, you'd be getting even less than with a small raise. \n\nIf they didn't increase pay at all then it is just a bigger pay cut.\n\nYou aren't getting a real raise unless it beats inflation.",
            "Isn't that tied to a fraction of GDP? The US debt ceiling is a dollar figure and doesn't automatically go up when the GDP increases. It's had to be raised and re-raised in Congress many, many times.\n\nPerhaps \"legislated debt ceiling\" was too vague. The US is weird in having a *statically configured* debt ceiling that must be regularly re-legislated under ordinary conditions. It doesn't express a policy decision about debt-to-GDP ratio; rather, it is a regularly recurring artificial crisis used as a crude weapon for fighting over other policy issues.",
            "A raise is an increase in salary. It doesn't matter if it beats inflation or not. Otherwise, we agree on the other points.",
            "I just checked it, and you are correct. \n\nWhile Germany, Switzerland and Malaysia all do have a debt ceiling of sorts only the USA and Denmark have one that is a fixed value that doesn't increase automatically",
            "That perspective is naive. When it comes to the actual value of a dollar, your employer is functionally paying less value if take-home wages do not rise at a rate equal to or higher than inflation.",
            "It's not naive, he's just being pedantic I think",
            "You're arguing the same points, you're just disagreeing about technicalities \n\nIf your salary goes up, that is a raise as you are earning more money than before\n\nBut if it doesn't go up more than inflation, then in real terms you aren't any more wealthy than before (despite getting a raise on paper)\n\nIf you flip it, and suddenly the economy tanked (e.g 2008) then you would be more wealthy than you were before, but you wouldn't have had a raise in salary."
        ]
    }
}