{
    "Weekly Question Thread": {
        "title": "Weekly Question Thread",
        "score": 9,
        "url": "https://www.reddit.com/r/factorio/comments/1dhxhtj/weekly_question_thread/",
        "content": "Ask any questions you might have.\n\nPost your bug reports on the [Official Forums](https://forums.factorio.com/viewforum.php?f=7)\n\nPrevious Threads\n\n* [Weekly Questions](https://www.reddit.com/r/factorio/search?q=flair%3AWeekly%3AThread&sort=new&restrict_sr=on)\n* [Friday Facts](https://www.reddit.com/r/factorio/search?q=flair%3AFFF&sort=new&restrict_sr=on) (weekly updates from the devs)\n* [Update Notes](https://www.reddit.com/r/factorio/search?q=flair%3AUpdate&sort=new&restrict_sr=on)\n* [Monthly Map](https://www.reddit.com/r/factorio/search?q=flair%3AMonthly+Map&sort=new&restrict_sr=on)\n\n[Subreddit rules](https://en.reddit.com/r/factorio/about/rules)\n\n[Discord server](https://discord.gg/factorio) (and [IRC](https://webchat.esper.net/?channels=#Factorio))\n\nFind more in the sidebar ---->",
        "num_comments": 114,
        "comments": [
            "can you name circuit signals, like variables in code? so you don't have to remember 'Y' means 'Yes this inserter should be active'",
            "Longtime player but been away for a while and seeing a lot of excitement building for v2.0. Do we have even a rough ballpark estimate of when that may release?",
            "Asked this in the last thread and got no response.\n\nI'm using Space Exploration and LTN, with the mod to allow space elevator LTN deliveries. Every now and then I get a 'train out of fuel' warning which lasts only a second or two. It disappears before I can click it and find out where the train is, and I can never see any stopped trains in the network. All my depots refuel trains with nuclear fuel and the network isn't very large - they should never run out of fuel in normal circumstances.\n\nWhat's causing these alerts?",
            "I’m not exactly sure how to word this question, but it’s something I’ve wondered about with Factorio but also other games like Transport Fever 2, Big Pharma, Kerbal Space Program, etc. I really love games about engineering and system-building, but I feel like I’m lacking in some kind of basic mindset or skills that make people good at these games.\n\nIt’s exciting and fun in the early game, but I often hit a wall as things get more complex. Tutorials tend to ruin the fun, but without them it feels like trying to play a really complicated board game without the rule book.\n\nI guess I’m wondering if I should take a basic class in engineering or problem solving or something, just to develop the brain skills that make these games “click” for others. Are many players here engineers or have STEM backgrounds? Did you enjoy math in school and end up taking advanced stuff like calculus? What about coding? Any other things you have learned or done that gave you skills that translate to Factorio?\n\nTL;DR - Have you found that any math or engineering classes you’ve taken irl helped you in Factorio? Would you recommend anything like that for someone who loves the game but struggles with the figuring out the more complex parts?",
            "Is there a way to use spidertrons as artillery deployers? Walk them out behind enemy lines, stamp a blueprint, and run away kind of thing? I'm guessing no but not sure if I'm missing something obvious.",
            "If I offload my game to a beefy headless server, will I be able to play the game on lesser hardware as a client or does my local client need to do a load of processing too?\n\nI realise there's a trainload of \"it depends\" regarding the specs, network, etc - the essence of my question is: am I actually offloading any heavy lifting to the server or am I just running the game in two places instead of one?",
            "In a vanilla base where all resources are transported through train in city blocks, is there a way I could have a module build that doesn't drain my chips from science? Ie. A priority system.\n\nI am open to solutions with or without circuit networks.",
            "so, I started 2nd world, launched 2 rockets with satellites and still do not understand how I can finish this world. I am playing with peaceful mode on. Am I supposed to play with biters?  \nI am a new player. I have some modes but space exploration is off. I don't think I have something like changing anything related to finishing the game",
            "I'm looking for a new modded experience. \n\n\nI have previously played through Nullius and Industrial Revolution 3.\n\n\nI recently attempted SE+KR2 but bounced off, removed KR2 and bounced off SE alone shortly after reaching space science in Nauvis orbit.\n\n\nI'm looking for similar overhauls. Does anyone have any recommendations?",
            "In unmodded. \nI feel like when I look at a machine's stats/recipie it only shows a cycle. Not more important stats like how many gears/min is needed.\n\nIs there some tooltip I'm missing that shows per/min or per/second cost machine will use/make?",
            "I'm currently playing K2SE Is my steel setup any good? It seems a bit... large. I have this same pattern repeated in quite a long line. \n\n!blueprint [[0eNq1md1uozAQhd/F11AZ/wF5lVW1IqnbtZYYZEy1VZV3X5OoSpqFZGbYXCVpw/mGwTPHnnyybTvaPjgf2eaTuV3nB7b58ckG9+abdvpb/Ogt2zAX7Z5lzDf76ZNt7S4Gt8tfx+CbnWWHjDn/Yv+wTXHI7l7+2gwxj6HxQ9+FmG9tGy8UxOE5Y9ZHF509RXP88PHTj/utDQlxUyhjfTekazs/8ZNeXT7pjH2wTV6U4kkn0IsLKf7jN8QU7pW+QOobpL5E6tdIfYXUr5D6Gqdf8AIJMFgARwJKLEAiARUWIJCAGgvQSEDBsQSFJRTL/eTWIjX1UT1pu1NvCZ3P+7aJ02VToxmma/rQvYyJ/p6Q+T69b20upkDmIjlX/BCb3e/c+cGGmP51s1jSsp5Vk2C1b6WxJKcQaboUfECeNCoU9chQDCLJ6n6SS7KnGANa7BW5KQMBNdlVYADBKUViyvmEi4Le44HxCrpNAQm0Ql9MiaKbBjBgTfc9IMHQXQNIKEmFv5j0c10O4zYpHq+fWdFfOlOI3rq3X9tuDNP2VPPnOd2a2irl91Y5RGvbdb1SclrK9HzK5FXpjmnbHt5Cl14h64hfP+W0ZL5OCb4fp5PAv0iBuIPzTscU1yw1Jy5p6VmwEqnw6VE30iMA6bmq66FvXbyfHQ44qhjyWUjXoLMQ3XiBALrxAgF044UBFKdbJZBQ0K0SSBB0bwMSJLwG5IU2QJlQ0Ocq0xWhoJVe00NuIbsxLjFXWDfwEWGs++IZLVi3qogWq/V/t1hVkzzkeGt3DUpz3B5Fq+s9iqjm9ii6oDd32KBI0Js7DCDpzR0GUPTmDgPoFc0dRjArmjuMUK5o7jBCRT+4AAnEApaQAjYrZmmw8A1xlqb++2DGkGZpGrRTN7QDN1CcOmd7QA6pc7YHhEKbswFTTt/8K9CwwFRkhwMCaspqVyDbLznZe2DBlwXZPYEAQapXYHok3deA4Su6NwMJKwZyQIKhezOQQBvIAR9yRf+dCxh+TffmOcLzqdEmufNP6xl7t2E4faFKd16LsjI1l1wdDn8BgNY6Jw==]]\n\nTech wise, I've finished all the rocket tech card stuff (the gold ones), but have yet to get into space to start the space science.",
            "I'm fairly new (used blueprints for the first time today lol) and I'm trying to figure out how to figure out ratios between assemblers. For example, i need Circuits, so I need to make 3:1 Copper Wire to Iron but I don't understand how to implement that when considering stuff like crafting time, belt speed, etc",
            "Hello, I am wondering if anyone can point me to a good tutorial for logical functions using the circuit network. For example, I would like to make a circuit condition that reads \n> \"Inserter enabled when (logisitics robots OR construction robots) < 50\".\n\nI have been able to find posts where users can create \"AND\" statements but I have not been able to figure the \"OR\" statement by myself. \n\nAny help would be appreciated, thank you!",
            "I didn't want to post a separate thread for now cos I just want to get some inputs. I recently started playing the game and but havent finished the last tutorial yet. I skipped it and tried playing the game as is.\n\nI'm a bit stumped right now as it seems like I'm currently stuck at blue science. I did a couple of restarts already but whenever I reach the part where in I need blue science I always get the issue of having limited petroleum to continuously generate sulfur and plastic.\n\nWhen I see crude oil patches do I put pumpjacks in all of them and route all their output to a single pipe then convert them all to petroleum? I'm sure I'm missing something cos it seems like I barely have enough only to research a couple of blue science stuff before I can barely produce sulfur and petroleum.",
            "Suppose a player spawn point is completely covered by solar panels (or anything else) and someone dies. Does their respawning delete the structure that overlaps the spawn point, or are they placed in the nearest open space instead? Does something else entirely happen?\n\nIs there a way to move the spawn point in vanilla Factorio without disabling achievements?\n\nThanks in advance!",
            "Quick Space Exploration mod question (from a noob):\n\nMy question is what type of module to use where. A quick google gives me some answers, but they're all from 1+ years ago so I'm unsure if the situation has changed.\n\nThe best post I found is from 2 years ago [here](https://old.reddit.com/r/factorio/comments/ohc5y2/when_to_use_which_modules_space_exploration/), which says on ground, use production modules on everything except pumpjacks (which use speed), but when it come to beacons it's more a question of personal playstyle.\n\nSo ya, just wondering if this info is still ok to follow or if things have changed in SE since then.",
            "I’ve always been a bus base player and now trying to mess with rail based city blocks 100x100 for my first SE play through. I’m struggling to figure out a good way to do the stations and have some kind of “stacker”, even if it’s just 1 train worth waiting as next up to unload. Some builds just need too many resources it seems. How do you handle rail blocks with too many resources coming in?",
            "[Is there a mod like this for entity GUIs in general?](https://mods.factorio.com/mod/circuit-control-guis)",
            "Do you guys use beacons and T3 modules in your starter base? They take a lot of resources, more than (my) starter base is meant to process. Maybe beacons with T2 modules? What are your approaches here?",
            "I'd like to play a save game with two buddies online, what is the best way to do this? I see that there's an option for 'host a saved game'. Should I limit the players to 3 players, then set up the password etc? Or is it better to just provide my IP address and have them connect over here? Not sure. Thank you.",
            "With 2.0 coming, I don't know anymore if it was actually announced or if it was just a wet fever dream: Will we get flippable Refineries and Chem plants? And are optional stops in the train schedule coming?",
            "My factorio takes awfully long time to load, is there a fix",
            "I bought the game at 6pm and looked up and it’s 11:30pm, what have I done. I was only messing around with the tutorial and what not I haven’t even actually played the game yet.",
            "No, but 2.0 will have freeform text fields in the combinator GUI.",
            "The only correct schedule is [Matthew 24:36](https://www.biblegateway.com/passage/?search=matthew+24%3A36&version=KJV), but the current expectation is somewhere in October.",
            "You might have a better chance getting answers if you ask on Earendal's discord linked on the space exploration mod page.\n\nhttps://mods.factorio.com/mod/space-exploration\n\nhttps://discord.gg/ymjUVMv",
            "Probably best to contact the mod developers.\nMaybe some other mods are affecting this. Its probably when the trains are deployed on the different layer.",
            "This is my own personal experience but I don't think those classes helped per-se. I think whatever it is in my head that enjoyed those classes is also what enjoys Factorio. That said, the way to not get overwhelmed I've found is to break stuff down into easily digestable sections which is similar to using functions or methods in programming so familiarity with one definitely helps with the other. \n\nFor example, when designing yellow science (a rather complicated recipe once you start trying to think about all the intermediates) instead of trying to figure out how to do all of it all at once you break it down into discrete chunks (in programming terms this would be a function) that can be thought about independently. That way, when looking at the bigger picture of how to make processing units you don't need to worry about the red circuit details other than knowing which belt and lane red circuits will be available on. \n\nAnother way to think of this is like how you'd create an outline for a paper before actually sitting down and writing the details. You don't need to know the contents of every paragraph when making your thesis or conclusion, you just need to know the structure and the overall intent of each section. This analogy breaks down somewhat more quickly than the programming one but it comes from a similar place of composability and modularity, where the contents of each paragraph serve to support their section and the sections support the overall work.",
            "I wouldn't be so scared of looking up how other people do x, y, or z. \"Self-taught\" doesn't mean \"learning without any teachers,\" it means \"learning to find teachers.\" Engineers, programmers and autodidacts don't learn in a vacuum.",
            "Engineering clearly helps, but I feel like the main way to get over the wall is something more general - learning how to break a huge problem into large problems and large problems into small problems.\n\nSome like using a notepad, and others just hold it in their head.\n\nYou know how to solve small problems. Try to work out how to break the big problems into small ones.\n\nIf you're stressed from the locals, just disable them or set them to peaceful.\n\nFor example, the game at the start tells you \"launch a rocket to win\". What the hell is that? So you look and see it's a tech that needs 5 science packs. You don't have those so lets start by making the red science pack. For that you need? A gear and a copper plate. How do I make a gear? From an iron plate. How do I make the plates? From ores in a furnace. How do I get ores? With a miner.\n\nEach one of these problems is easy, but the big picture is large.",
            "The most important problem solving skill is breaking problems into smaller pieces. Don't try to build a whole base from scratch. Break up the base into pieces: mining, smelting, production, bus, science, mall, etc. Solve the problem of making the individual pieces and then put them together. \n\nA lot of players have math heavy backgrounds like engineering, coding, and science because problem solving is cultivated in these fields. There is no one class that is specifically there to teach you problem solving, but introductory physics and proof based math classes require it most.",
            "> for someone who loves the game but struggles with the figuring out the more complex parts?\n\nThat's the trick, there are no complex parts.\n\nThe thing that people find the most complex is circuit logic and trains.  But both of those are optional and the \"minimum viable product\" is pretty simple.\n\nMy first few times through the game the entire extent of my circuit logic was running a wire from the heavy (and light) oil tank to a pump heading off to cracking.  That's it.  A wire and a simple comparison to enable a pump.  I didn't really start messing with circuit logic until I started messing with the LTN mod.  There's some crazy stuff you can do, but for the most part it's a solution in search of a problem, unless there are specific mod demands that make it a requirement.\n\nTrains are also not terribly complicated to be functional, just a train with an engine pointed in both directions doing a simple back and forth to pick up materials from a remote mine and drop it off at your base.  And the tutorial is pretty good, more than up to the task of teaching you how to do that even of those individual lines cross each other.\n\nEven more complicated networks aren't even that difficult once you get the hang of signaling.  *Getting* the hang of signaling can be tricky, but once you get it you get it, it's less a learning curve and more a single big step.  The hardest part about designing a big rail network is just getting everything lined up and looking nice.  A functional system is pretty quick, a rotationally symmetrical chunk aligned system is less so... but also not necessary, just nice to have.\n\nThe rest?  Every individual part is simple, the trickiest part is linking them together. And the important thing to remember about that is... you can tear stuff down and movie it if it's in the way.\n\nThere's a few patterns that you'll learn that will help alleviate your mental load when laying out a factory, but you'll pick those up by dong, like how to set up stone/steel furnace smelting stacks.",
            "Not remotely, because there is no way to make logistic bots work with personal roboports, which is what spidertrons use.\n\nBest you can do is be physically present with the spidertron so you can manually transfer artillery shells from the spidertron to your inventory, then from your inventory to the artillery blueprint.\n\nThe game kind-of discourages this since artillery shells only stack inside artillery turrets and artillery wagons. Their stack size is only 1 item in a spidertron or in your inventory. The game seems to encourage having the spidertron build _rails_, and then have trains bring in the ammo.",
            "Unfortunately not easily in vanilla.\n\nThe normal way for spiders to drop items is to have logistic bots on a network. You can build the roboport, artillery, and other things, but you can't put the robots inside the roboport.\n\nHowever, if you use an externally edited blueprint, you can make the artillery request shells as it's built, and then the construction bots will build the artillery and fill it with ammo. There are sites that work fine for this.\n\nHere is a BP for an artillery with 10 shells:\n\n>!0eNqVkNFqwzAMRf/lPnsj8Rqa+W3fMcZIWtEIHCfYytYQ/O+zHQql0Ic9Cck6Ohdv6O1Cs2cnMBv4NLkA87kh8MV1Ns9knQkGLDRCwXVj7jovbC359UUW70kQFdid6QpTR/UPPAxk7R2t45cCOWFh2pOUZv12y9iTT+efZ1CYp5DAyWVxOla9NgprqdmQIoT88mg3dRWztmQ0dz+iYLue0gI+bsiu+mUZChvSzg/5UJy6rQ/Hd31s9VvdNDrGP12ldtc=!<\n\nEDIT: reddit doesn't like the site I linked so I had to remove it from here.",
            "Yeah, that would be possible. I'm not sure it's a good idea, since artillery turrets are not that disposable, but it could be done.\n\nA slightly better option I've seen was to use artillery with a car for shoot-and-scoot tactics. Drive somewhere nice, plop down a turret or two pulling shells out of the car, then tear it all down and leave before the biters reach your position.",
            "Not really no.\n\nBut you can just build a spider death army and run them around.  A simple build of a single solar panel, single radar, and single power pole can give you coverage during daylight and show expansions on the map.\n\nThe way artillery is designed is via trains.  Which you can run a single rail out and have a train either resupply ground artillery, or use the artillery wagons.",
            "The way the game works in multiplayer relies on each machine performing *all* the computations and only sending player actions.\n\nUsing a beefy server will not make the game on your computer any faster.\n\nThe only reason to get a beefy server is if you want to play in multiplayer, and even then it's almost entirely about bandwidth to download the save when a player joins the session.",
            "No circuits: Make your chip block have two outputs: a priority one for science / other stuff, and a low priority for modules.\n\nThe module station only gets supplied from an overflow splitter, or some other way of restricting it so the other side gets filled first.\n\nThen two separate trains, one for normal priority and one for low.",
            "Well, \\*some\\* modules are needed for science.\n\nBut for the ones you just want to use in assemblers/beacons, I personally would just let it run and chew into science resources until it has the amount of modules I want buffered.\n\nOtherwise you could use circuits on your train network and set train limits to your module blocks to 0 if your science production is getting starved.",
            "Setting aside \"just let it happen until you have enough modules buffered\", the way I did it was a circuit network. Have a global-ish circuit network connect your science production to your modules, have your station unloading chips for science production raise a signal if it needs chips, and have your module production enable (or set its train limit to 1, or whatever) if that signal is 0.\n\nIf necessary I can provide the blueprints I'm using for my (modded, but not in a way that affects the circuits) playthrough. It's a more involved version of that, since it has to handle low-priority supply and demand, as well as calculating based on the amount of stuff available.",
            "I used what I called a zone system. My mall was a separate zone starting from mining ore to building circuits to feed modules. That way nothing I did to grow the factory was allowed to impact science. I also had separate zones for making satellites and for the rocket silo so rocket parts didn't steal from other science production.",
            "Are you looking at in-game achievements or steam achievements? \n\nAny mod that was active at any point in a particular save will disable Steam achievements from then on. And in-game achievements are tracked separately for modded vs. not modded.\n\nYou cannot earn the speedrun achievements with biters turned off or set to peaceful. Speedrunners get around it by setting their starting area huge and reducing pollution spread to the minimum.",
            "Once you have launched a rocket, the vanilla game is \"finished\". Did you notice the screen that gave you an opportunity to exit or continue? From that point, many people choose to just continue making their Factory bigger and bigger and bigger.  There are various challenges available without downloading any mods. You could try an island world, a ribbon world, or a death world.",
            "[Lunar landings](https://mods.factorio.com/mod/LunarLandings) would probably be worth a look. It's more of a vanilla approach to SE. Just one extra surface, mostly vanilla recipes on nauvis.",
            "Exotic industries.\n\nFreight Forwarding\n\nLunar landings\n\nThese are all \"Mini overhauls\" of approx 80-140 hours. (lunar landings might be smaller? I haven't done it yet, but I like the dev's usual approach)",
            "Try the \"everything from Tiberium\" challenge in [https://mods.factorio.com/mod/Factorio-Tiberium](https://mods.factorio.com/mod/Factorio-Tiberium)  this mod. I'd also add the drones mod because of how the tiberium \"breathes\" [https://mods.factorio.com/mod/Mining-Drones-Tiberium](https://mods.factorio.com/mod/Mining-Drones-Tiberium) . Aesthetically, it doesn't matter but there is a mod out there on top of that that also makes the drones little tiberium harvesters, which are more lore accurate but also hilariously tiny compared to your character",
            "SeaBlocks!\nIt’s like Skyblock, but all sea!",
            "No, you'll have to calculate that yourself based on crafting speeds or install a mod like Rate Calculator.",
            "[Blueprint Image](https://cdn.discordapp.com/attachments/334735604342325249/1252725362920526006/blueprint.png?ex=667342e9&is=6671f169&hm=58e9bd799d3e14198b5ff348ce750961d19638c54ae4256181e1ea6a80eb0ba1&)",
            "Beacons. And you should be able to do this without so many splitters.",
            "I would go with 1 speed, 1 prod for smelting straight to plates. And instead go for the better furnaces and ingots for more productivity asap.",
            "Step one is to get the ratios, step two is to consider belt and assembler speed.\n\nStep 1: You get two wires per copper plate, and the recipe takes 0.5 seconds. (Assembler speed makes this slower or faster, but as long as all your assemblers are the same tier then it'll keep the same ratio between them.) A circuit needs three wires and also takes 0.5 seconds, so you need 1.5 wire assemblers per circuit assembler or 3 wire for 2 circuit assemblers.\n\nStep 2: Tier 1 assemblers have a crafting speed of 0.5, so the 3 wire assemblers will use 1 copper per second each, so you can feed 15 of them from one full belt of copper. The ratio in step 1 says this corresponds to 10 circuit assemblers, which use a total of 10 iron per second, 2/3 of a yellow belt.\n\nIf you use T2 assemblers with a crafting speed of 0.75 the numbers become more complicated but the ratio stays the same.",
            "Wire is usually not placed on a belt but directly inserted from assembler to another. You can try [this calculator](https://kirkmcdonald.github.io/) to start with. Mod users go for Factory Planner or Helmod generally. The math especially with modules gets too complicated to do on paper.",
            "Assuming saturated input belts and unconstrained output:\n\n(Item crafting time / factory speed) = crafts per second\n\n(Crafts per second * input materials needed) = input materials needed per second\n\n(Crafts per second * productivity * items per craft) = output items per second\n\nYellow belts move 15 items past a point per second, red moves 30, blue 45. (AFAIK.)\n\nSo if you had one yellow belt of copper plates that could feed 15 plates per second, and your factories had zero productivity modules installed, you could build 30 copper wire per second from it - enough to feed 10 green circuit crafts per second. Since a yellow belt can feed 15 plates per second, you'll be able to feed that side with one yellow belt of iron with 5 per second left over. If you're crafting with gray assemblers that have 0.5 crafting speed, and you're crafting something that takes 0.5 seconds to craft, your crafting speed would be (0.5 / 0.5) = 1 craft per second per assembler, or two wires per second per assembler, assuming fully fed.",
            "Honestly I feel like I'm in way over my head in general but i'm having a ton o ffun",
            "I like the Rate Calculator mod https://mods.factorio.com/mod/RateCalculator\n\nYou just put down the machines and select them with the shortcut and it'll tell you if you're producing too much or too little of something (green and red numbers) and you just adjust as needed",
            "Decider 1 set to [logistics bots] <50, output A(1)\n\nDecider 2 set to [construction bots] < 50, output A(1)\n\nwire input of the deciders to the source of the signal and outputs to the inserter.\n\nFor AND, set the inserter to A=2   \nFor OR, set the inserter to A>0   \nFor XOR, set the inserter to A=1   \nFor NOR, set the inserter to A=0   \nFor NAND, set the inserter to A<2   \nFor XNOR, set the inserter to A≠1\n\nYou can do more than two signals on the same step for: AND, OR, NOR and NAND. Some will need you to adjust the the number to match the amount of things you want to have.",
            "the other solution seems overcomplicated considering the arithmetic combinators literally have AND and OR statements in their dropdowns",
            "Oil works like all other resources, you get more iron by having more drills, and you get more oil by having more pumpjacks, with the distinction being that each individual pumpjack has its own speed, and oil never runs out. It slows down though, down to 2/s or 20% of the original yield per pumpjack, whichever is higher. If you're not getting enough crude oil build more pumpjacks, and if you're using all of your oil patches and still not getting enough explore to find more oil. The farther the oil patches are from your spawn the richer they get, i.e. each pumpjack produces more oil.\n\nFor a typical scenario you can have all your pumpjacks merge into a single pipe, but it depends. See if your pumpjacks back up while your refineries starve - if yes, add intermittent pumps to your pipeline.",
            "You get shifted to the nearest open space.\n\nThere's no way to change the player spawn without disabling achievements. If you want to do it anyway, paste the following in your console:  \n\n    /c game.player.force.set_spawn_position(game.player.position, game.player.surface)",
            "Granted, I haven't actually played SE so I might be wrong, but I was under the impression that you couldn't use productivity modules in space (except in labs).  So your only real choice is speed or efficiency and the answer would basically be \"in space, speed unless your power can't support it, on land productivity + speed beacons unless your power can't support it\"",
            "I would say mining drills don't really benefit from prod either.\n\nWith SE it can be *more* beneficial to use an alternate recipe instead of prod modules. For example steel. You're better off using pyroflux smelting without prod modules than prodding the standard smelting. That said prodded pyroflux would be even better.\n\nAlso the space lab is a prime place to plop in found t9 prod modules as you're probably not going to need more than one lab.",
            "I guess the train limit is the key. The number needs to be as much as you have trains on station + waiting slots. Limit of 1 would not allow any train to even approach it if 1 other train is already going there or already stationed, but that would defeat the purpose of queue or stackers so you want limit higher than 1.",
            "Bigger blocks, or merge two blocks, or steal some stations from a neighboring block.",
            "make the station long enough to hold 2 trains (seperated with a signal) and set train limit to 1? idk i think most people doing rail city blocks use mods",
            "I assume you use belt to box to train setup at your loading stations.  Make a simple circuit that reads the amount of resources in the boxes.  send a signal to the train station that only enables it when there are enough resources to fill the train.  You can do this using only decider combinaters. \n\nIf you are smart, you can figure out how to use arithmatic combinaters to adjust your train limit based on the amount of resources, with a max amount of trains that will fit in the que.  \n\nThe bigger your base gets the harder it is going to be to keep track of how many trains you need to meet production.  Distance becomes a problem in block bases the long you play.   \n\nOh yeah, reduce the amount of trains you have running around by smelting on site, dont train ore except when needed, (concrete, railroad production, ect)",
            "It will be vanilla behaviour in few months.",
            "beacons, yes. Though usually with t1 speed. t1 prod gets use as well. t1 eff goes to miners.\n\nThe only t3 modules I use is 4x t3 prod modules in the silo.\n\nOf course that goes out the window post rocket launch.",
            "Only very strategically, mostly to increase blue chips production without significantly increasing raw plate demand with the occasional speed modules for things like increasing gear production for blue belts without increasing the footprint of said gear production.  What works fine for red belts really struggles when you add blue belts into the mix.  On my most recent run I'm at like 1 t3 module every 10-15 minutes.  Not great, but still nice to have chugging along in the background while I'm filling out megabase chip production and can bump that up to like every minute.  Plus it's competing for blue chips with spidertron production and I've almost got #4 built and equipped (those microfusion generators are rough!)\n\nThe first production line I build for the megabase is chip production to modules.",
            "What do you define as \"starter base\"? Obviously T3 modules in the rocket silo, that instantly pays for itself. On the whole, not really. That's almost a defining characteristic which separates the starter base from the final base for me.\n\nHere's a handy little chart talking about how long a machine needs to run to make T3 modules pay for themselves. How long do you think that portion of the base will run for before being replaced?\n\nhttps://factoriocheatsheet.com/#productivity-module-payoffs",
            "Beacons for days. As for t2 vs t3 modules, there is no use (imo) for t2 modules other than as an ingredient for t3's so use t3 in the places that it immediately helps (silo, rocket ingredients, purple and yellow science). Everything else can wait until you upgrade your throughput to manage it at scale.",
            "You can do the host, then tell them to join you from Steam. Usually it's unlikely your other friends would join you unannounced right? It's not listed in any public server list, unless that's what you are specifically doing. I recall only dedicated servers did that.",
            "You can just host your game. Others can connect through steam friend list or the multiplayer browser. Use a Password if you dont want random people to join.",
            "Yes, the refineries and chem plants will be flippable.\n\nhttps://www.factorio.com/blog/post/fff-394",
            "I can say yes on the optional train stops; they're called interrupts, you can read all about them here: [https://factorio.com/blog/post/fff-389](https://factorio.com/blog/post/fff-389)",
            "Is this with mods or vanilla?\n\nPut it on an SSD. Upgrade your computer.",
            "You fucked up is what you did. Now you're stuck in here with the rest of us",
            "close enough! nice",
            "Amazing, thanks - I'll try to finish all my important work projects by then.",
            "Im not aware of any way to unload the shells in vanilla.\nIt would be possible with the spidertron patrols mod though.",
            "By the time you're running around with multiple spidertrons I think artillery turrets are pretty disposable. Heck, artillery turrets don't even use bluechips, and that makes the fairly disposable by the time you research them.",
            "Ah darn, that's a shame. I guess I'll have to use the upgrade planner on my laptop if I get to the point where things start lagging out :) \n\nOoh or maybe I'll try installing a desktop VM on the server and connect to *that* as a client (via Steam link or something)\n\nThe factory must grow - regardless of real-world limitations - ta for the answer!",
            "Thats the best solution for now.\nWith 2.0 there will be priority settings for train stops i think.",
            "I looked at steam achievements. I noticed that I can not get them with mods, but I could when I loaded worlds I started with mods without them",
            "You could try collecting achievements.",
            "There was no such screen and I did not get the achievement. I later removed all the mods and loaded the world, but I got achievements for iron plates and advanced circuts production",
            "I'm doing it. I did a test run and now started again and turned off every other resource.",
            "Or [Assembler Production Rates](https://mods.factorio.com/mod/assembler-craft-rates).\n\nHopefully something like this comes in 2.0.",
            "https://factoriolab.github.io/list?v=9 is better",
            "This is perfect! Thank you",
            "My original approach involved the arithmetic combinator but I was not able to compare different signal values this way, only signal types. \n\nThe arithmetic combinator computes\n >\"if A or B then output C\" \n\nBut  I need \n>\"if (available c.Bots) < 50 output c.Bot, OR (available l.Bots) < 20, then output l.Bots ”\n\nThe example given by u/craidie was a perfect solution for my problem, and seeing how to construct the different logic gates also gave me a deeper understanding of how logical conditions are calculated mathematically. \n\nMy end solution involved setting the parameters given in my second example on decider combinators, with input from Roboport, and output to a single filter inserter grabbing from a requester chest. Filter inserter circuit parameter = set filters. This allowed me to balance the quantity of each type of robot in outpost artillery stations. 👍",
            "When you say if my pumpjacks back up, does it mean if they stop moving? Cos I noticed that sometimes my pumpjacks aren't moving and yet my storage tanks aren't getting enough crude oil. Also, if my pumpjacks stop moving but my storage tanks are filled am I losing something or it's technically fine?",
            "Thats mostly it. Prod where possible starting from the most complex recipes.\nLabs definitely should have prods.\nMiners and pumpjacks as vanilla with efficiency or speed.",
            "There was no FFF talking about this. Where did you see it'll be in 2.0?",
            "it's vanilla, ig my pc's just too slow",
            "There are ready services for that like GeforceNow or something, unsure if that specific one supports Factorio or what others are there. But they are built for playing demanding games remotely.",
            "Yup, there will. Pretty keen. Would have helped in my vanilla trains py run I'm in lol.",
            "Some mods have different victory conditions. Read their descriptions in the mod portal.  It's generally recommended to complete one game in vanilla before starting on mods.",
            "You do get the achievements in game but they are tracked in a seperate list when playing with mods and arent counted with steam.",
            "[Or use an online calculator](https://factoriolab.github.io/list?v=9)",
            "Maybe it is but it looks way way more confusing. I use kirk for vanilla and Factory Planner for mods.",
            "In this case just wiring the roboport directly to the inserter and setting enabled condition to ANYTHING < 50 works too.",
            "use a decider combinator that outputs D=1 if A<50, and another that outputs E=1 if B<20. Then OR the outputs E,D in an arithmetic combinator",
            "Pumpjacks have an internal fluid buffer, if it can't be emptied for whatever reason they stop working similar to a drill that has nowhere to output. They stop consuming power, the patch no longer depletes and they restart as soon as the buffer is emptied.\n\nFluid flows from higher proportional capacity to lower proportional capacity, and the larger the difference the faster the flow. A pipe with 100 flow will fill a pipe with 0 fluid much faster than a pipe with 51 fluid will fill a pipe with 49 fluid. For this reason it's usually fairly difficult or slow to completely fill pipes or storage tanks - as they start nearing 100% capacity there isn't much room for flow anymore. You can circumvent this by using pumps. A pump crams everything from its input entity to its output entity regardless of difference in fluid level. If you want to completely fill and empty your storage tanks consider using pumps at the input and output.\n\nFlow is determined by how much the entity is filled proportionally - a pipe with 50 fluid is at an equilibrium with a storage tank with 12.5k fluid. Both are at 50% so there's no flow.",
            "You should see if and why pumpjacks arent working in their tooltip.\nIf the pumpjacks are full but the tanks arent filling you probably have throughput issues with pipes. You shouldnt have long runs (>20 pipes, undergrounds only count as 2) without pumps in between.",
            "It seems I understood stuff wrong/misremembered, sorry",
            "Aye I'll have a look at those if things don't work out well - the focus on a beefy server is because I've already got a beefy server for other things.\n\nPlus of course setting up dodgy spaghetti server setups is kinda like playing Factorio to be able to play Factorio which is just fun squared",
            "I play with everything that space exploration has but I turned space exploration off. I don't think AAI industry has different game completion conditions. There is nothing about it in mods.factorio",
            "I noticed last time I was playing. Thank You",
            "You can turn off the box-tree and wagon columns to make it look identical to kirk's layout. ¯\\\\\\_(ツ)_/¯\n\nThe way kirk does beacons is confusing. Kirk's doesn't handle looping recipes like coal liquefaction correctly. And Lab has a whole lot more features.",
            "While this functions as an OR gate, it does not end in the desired effect for my use case. This also uses more components and is therefore less efficient than the solution offered by /u/craidie . \n\nI realized half-way through implementation that I also wanted the inserter to grab a specific item depending on the signal values, rather than simply enable/disable - hence using the filter inserter with 'set filters' selected for the circuit parameter. The arithmetic combinator outputs only a single signal type, so it will not change the filters based off the input signal values when used with the filter-inserter. \n\nI also realized that it wasn't an OR gate that I needed afterall, but I am still happy to add that trick to my book of tricks.\n\nI will keep your solution in mind as well! Thank you for the help :)",
            "thank you so much for your response! maybe I'll try to setup a new area for my oil as it seems like my current one is can't fill my storage tanks anymore.",
            "Someone correct me if I’m wrong, but I’m guessing this game gets bottlenecked by single core performance.  I’ve notice this with my own game where I’ve finally hit the performance limit with my mega base, but only one core is pegged.  So my point is, the single core performance of your beefy server is going to matter more than the number of cores, otherwise I’d be looking to do the same as you.",
            "You can get an idea of your yield by hovering over the oil fields in map view. An oil refinery consumes 20 crude oil per second, and every % is 0.1 oil per second, so a 200% field can support one refinery full time, 400% can support two and so on.\n\nMining producticity is basically free oil on top of that, so with two levels a 1000% oil field could support 6 refineries."
        ]
    },
    "Friday Facts #416 - Fluids 2.0": {
        "title": "Friday Facts #416 - Fluids 2.0",
        "score": 1884,
        "url": "https://factorio.com/blog/post/fff-416",
        "content": "",
        "num_comments": 955,
        "comments": [
            "Didn’t expect a fluid rework and also didn’t expect to see a Minecraft mod being used as inspiration",
            "\\*sees the headline\\*  \nI felt a great disturbance in the Force. Like the millions of voices suddenly cried out in joy and then shut up to read.",
            "Would this also benefit UPS? I suppose so but im only guessing",
            "If you can now cram any amount of fluid into a pipe network (within the 100 fluid per tick per pipe restrictions) nuclear plants in particular should now be much easier to design. You should be able to cram all or at least most of your intake water into a single pipe network, and all or most of your steam into a single pipe network.\n\nIt simplifies the fluid puzzle quite a bit, but I'll happily take this over the old opaque weirdness.",
            "After years of tears and anguish, God heard the cries of his people",
            "Am I the only one who ran out of lube halfway through this FFF?",
            "Hiring skilled and motivated members from the community proves to be a good choice, again. Thanks raiguard!\n\nWhen players have to look up a wiki to play well, that's a sign that something with the game design is off. (And I like stardew valley, but my point stands). The new system has a bit less realism, but also a lot less of the unrealistic surprises, and I'm looking forward to it. Pull rate could be scaled down relative to the length or size of the segment to bring a bit of realism back, but I doubt that's necessary.\n\nBut this left me wondering: if segments can no longer contain different fluids, what happens in 2.0 when bots connect segments with different fluids? Does the bot keep hovering as if waiting for someone to clear a cliff or tree?\n\n/edit: and will this system be used for heat pipes as well, or does the old system live on?\n\n/edit: and how do boiler-chains and other passthrough-machines work? Do they become part of the segment? Do they use the old logic?",
            "The entire Factorio subreddit community have genuinely been crying out for this FFF for so long.",
            "No more tough pump circuitry at train stations! Praise Wube!",
            "This should make sushi pipes less of a headache, right? I remember trying it before and getting stuck with a tiny bit of fluid left in one section blocking everything else.",
            "On the one hand, this is a huge performance increase and a much needed un-jankification of fluids... but I am gonna miss shunting them around like an actual liquid. Definitely for the best though",
            "Will direction of flow be visible in the pipe windows? How will they calculate that?",
            ">The new system is a fairly large step back in terms of the \"realism\" of the fluid simulation in Factorio.\n\nI doubt that this is\"less realistic\" as before in piping system there was a no \"pressure\", only \"quantity\" of liquid or gas.",
            "I consider turning \"broken and unpredictable\" into \"it just works\" an improvement. I expected some new mechanics related to fluid pressure or throughput. I'm a bit sad they were thrown out entirely, but having the solid base for more complex fluid mods is more important IMO.",
            "Its sad to see the realism go, but i had enough \"WTF why does fluid like to do right turns only at T-junktions?!?!\" moments to be glad to have it abstracted away.",
            "one of the most awaited changes - Fluids",
            "Wow, it is Raiguard the modder",
            "I remember reading the old fluid FF and thinking to myself:\nWhy it needs to be so complicated? Just make every single connected \"entity\" share the same pool of resources and be done with it.\n\nWhich was already discussed in that article as \"too simple and unrealistic\".\n\nSo I'm kinda happy for them to have followed this aproach at the end.",
            "Lube acquired!",
            "You may find the post contents here, in case the Factorio website is blocked for you: u/fffbot/comments/1dl1b2w\n\n\n**NOTE:** fffbot is a community-driven effort and is not associated with Wube Software. For any questions or remarks, please reply to this comment or send a private message to u/fffbot.",
            "Will heat pipes function in the same way?",
            "So, after 2.0 release and seablock update I won’t run out of mineral sludge (and bad split of fluid between crystallisers)",
            "Nice. Always happy with when devs decide to take the route of gameplay > realism. Should make fluids much less frustrating!",
            "/u/kinglemming Thermal Expansion has now inspired Factorio improvements.",
            "> We can't wait for you to get your hands on it!\n\nThat's a lie! Apparently you *can* wait! 😜\n\nBut in all seriousness, I am very willing to wait a few more months for all the ~~heaps~~ mountains of great features and content that are coming our way. And a fluid rework was one of the big ones I was really really *really* hoping to see, so this FFF makes me utterly ecstatic.",
            "Unfortunately this will break the way [Fluidic Power](https://mods.factorio.com/mod/FluidicPower) works. Or will it be possible to access the old algorithm through mods?",
            "Although i’m delighted by the practical application, there is a part of me that will miss the old propagation system. Seeing your pipes flicker to life with fluid was immensely satisfying",
            "Merging pipes into segments is a good thing, that probably should have happened a while ago. However, I think it's far too unrealistic that more pipes yield more throughput. The number of pipes that get fused into a single segment should probably be treated like an electrical resistance, dividing the maximum throughput of the segment.\n\n  \nThis still isn't really realistic, but it would solve the problem by making the behaviour of pipes much more predictable, while still discouraging long pipes.",
            "It's probably overall an improvement, but I think it does really simplify fluids a bit too much. I liked the significant water infrastructure that nuclear reactors required. Now it's just a single pipe to run as large a reactor as you like. Seems a bit too straightforward.",
            "So with the current system, one big pipe network in your world would trivialize piping in general? Since distance is irrelevant you can substitute all fluid trains for pipes and if at one spot of your base you input liquids, the output can immidiatly draw from the segment.\n\nWould it therefore perhpas not be better to have a maximum size to a segment? This was you do introduce the problem again which was present, but only on a perhaps much larger scale. Furthermore, it is always possible to put multiple pumps between the same segments to increase the flow.",
            "Awesome news! And I had a feeling they wouldn't let the complaints about fluid go unaddressed.\n\n> There are many interesting possibilities with this system that we did not predict, and we will share some of our stories in future FFFs. ... There are a few details that remain work-in-progress\n\nI'm starting to doubt we see a release by October.",
            "another big W from Wube",
            "It's beautiful. I've looked at it for 5 hours now.\n\nThank you devs!",
            "I wonder what the impact on nuclear power design and ups impacts will end up being. Hopefully it will improve both!",
            "So having pumps in between pipe segments (or anywhere other than after a tank) is now only useful for setting circuit conditions, and to ensure the direction of flow?\n\nAnd what about underground pipes? Do they still act as essentially only two pipes (or was it one?), or is their volume now dependent on their actual length?",
            "I'll admit, before reading this I was fairly against simplifying the fluid system; the old system certainly had charm and worked intuitively enough at low flow rates. After seeing the new system visualised and demonstrated, though, I am a solid convert. \"Better to ask forgiveness\" indeed, players included 😉",
            "I was going to write a very well-articulated response to this article explaining why fun is much better than realism, but who better to explain it than god Gabe?  \n[https://www.youtube.com/watch?v=MGpFEv1-mAo](https://www.youtube.com/watch?v=MGpFEv1-mAo)\n\nFluids have always been a nightmare, and I put pumps everywhere to get a consistent rate. Trial and error is only fun for the first time, when it's part of the mechanic, it becomes a problem. It's very hard to predict if a setup will have enough fluid throughput or not when designing, you always have to test and adjust and it's still not clear why it's not flowing. This is a godsend, thank you devs!!!",
            "I love how the current system is considered \"more realistic\" when the flow is apparently arbitrarily based on build order...   \nand how the new system is actually allowing for more realistic flow due to the build order no longer making a difference.  \nsure we are now getting some sort of \"instant fluid teleport\" but I kinda feel like that could be mitigated by tweaking the machine input from a segment based on it's length and fullness, would be my guess.\n\nregardless this new system should have been in 1.0/1.1 I am looking forward to enjoy the fluid part of factorio again. (because just putting everything in barrels and working with that was starting to become really appealing with a lot of the mods I'd been playing recently...)",
            "I love how \"Fluid no longer flows\" is presented as an upgrade.",
            "Awesome! It looks quite similar to the solution i discussed with /u/DominikCZ 6 years ago:\n\nhttps://www.reddit.com/r/factorio/comments/8ddhg9/pipe_system_feedback/dxo97x6/?context=10000",
            "somehow, for factorio it really makes sense for the guy who made the mods \"Fluid Must Flow\" and \"Pipe Visualizer\" to be the one to finally update the fluid mechanics xD",
            "Speaking as someone who has been seriously bitten by the junction build order dependency issue [fucking up a high-throughput nuclear reactor design and causing literal days of anguish,](https://www.reddit.com/r/factorio/comments/1blu2tb/why_do_so_many_hate_the_fluid_mechanics/kwb3n1d/?context=3) may I just say ***THANK FUCKING GOD***",
            "Maybe I'm just a masochist, but I honestly kinda like the challenge around moving large amounts of fluids. So while I agree that the current system could definitely use a rework, this feels a little too simple. All those beacon and max-quality machines and modules, and the whole thing is being adequately supplied with just one pipeline per input and output, it just feels a bit anticlimactic.\n\nIf my math isn't completely wrong, 8 legendary beacons with 2 legendary speed 3 modules affecting a legendary chemical plant should add up to about 80 times the crafting speed (14.14\\*2.25\\*2.5), so the whole setup uses around 9600 water and light oil per second, all easily being handled by just one pipe. In 1.1 you'd probably need between 3 and 8 pipelines per fluid depending on pump placement.\n\nAgain, I'm not saying the current system is better, but IMO it shouldn't be simplified so far that moving large quantities of fluid is completely trivial",
            "Will Nuclear now be better than Solar in terms of UPS?\n\nPlayer will be incentivized to connect all steam and water pipes in the nuclear build to further optimize for UPS.\n\nWill we see underground heat pipes!?",
            "This is the best change yet in my opinion, such a great decision to balance fun vs realism.\n\nThanks u/Raiguard!",
            "I would love if some kind of mechanism (probably arbitrary) could be added in order to discourage extremely long pipelines. So that it's worth building fluid trains over pipes that now effectively teleport liquid. I fully agree that the new system seems overall better than the old one and that fun gameplay is better than realistic systems, but it would be nice to add some restrictions to the new \"arcade\" fluid system to re-enable certain incentives that made for interesting designs.",
            "Am I... dreaming? Quick, someone please wake me up!",
            "RIP [Fluidic Power](https://mods.factorio.com/mod/FluidicPower)",
            "Finally fixed the most aggravating system in the game to interact with by far.\n\nThe fact that every solution viable before was just adding more pumps and massive buffers was so annoying.",
            "Aw, that’s too bad. I was hoping for a more realistic fluid simulation, with a P/Q curve on the pump, a pressure property in pipe segments, a max pressure limit for pipes, and pipe geometry and fluid viscosity determining pressure drop along each segment of flow. It would lead to a lot of interesting emergent gameplay, like experimenting with pumps in series vs parallel, and significantly different piping designs for water vs heavy oil. But I suppose that could be quite computationally intensive.\n\nNow it’s basically like the electric network but with fluid item buffering. Of course, I’ve never found myself wishing the electric network incorporated realistic volts/amps/resistance, step up and step down transformers, voltage and current limits on transmission lines, etc.\n\nBut! A great improvement over the last system, which was neither realistic or intuitive.",
            "I WAS PRAYING FOR THIS! Thank FUCK! I was literally talking to a friend yesterday about how fluids are so fucky and unintuitive and how the one last thing I hoped for 2.0/SA is a fluid rework. WUBE HAS HEARD MY PLEAS! (also reading through the article I didn't know fluids were THIS fucked. order of things placed MATTERS!? !?!?!?!?!? wtf!? how did we get here? qwq)",
            "Will heat pipes use this behavior?  \nIf so we might see some funky nuclear reactor designs.  \n\nEdit: they do not, and apparently they never used the same system as fluids. RIP my dreams of kilometers of heat pipes.",
            "*standing ovation*",
            "I've only read the title and I can already say \"oh my god YES\". I think we've all been hoping for fluid revamps.",
            "Jeff Goldblum crazy sobs did it dot gif",
            "I wonder if this means that Underground Pipes won't really be that necessary anymore (except for getting around obstacles like they're intended). They were useful when you're being lazy and want to move a fluid a long way without trains because each underground functioned like one unit of pipe, so the distance and effect on throughput could be minimized.",
            "This is such a welcome change. No more needing 3 billion pumps everywhere!",
            "Ooh, [fully dynamic connectivity](https://en.wikipedia.org/wiki/Dynamic_connectivity). Are you using a fancy polylogarithmic-time structure, or is (literal) flood fill fast enough for a megabase? (Or something else? Maximum segment size?)",
            "> This is the \"nuclear electric-network type solution\"\n\nI've been saying I wished the fluid system worked like the electrical system, even if it's unrealistic, for *years*.  \n\nI am one happy engineer.",
            "Looking forward to seeing this. The old system made no sense and I always end up with buffer tanks all over the place just to make the system make sense.",
            "Yep. This sounds a lot more fun  than the \"realistic\" version.",
            ">Sometimes it is easier to ask for forgiveness than to ask for permission, so I took a risk and began to rewrite the fluid system.\n\nAll hail /u/raiguard The Forgiven!",
            "Did we already know these recipes?\n\nhttps://i.ibb.co/D54hsKd/image.png\n\nMiddle one looks like you crush ice, then melt the crushed ice into water.\n\nThe other two are crushing something, then adding water to make a fluid? The colors make me think of refined fuel and cryogel, but I guess it could be anything, since we can't tell what's being crushed.",
            "Under the new system, will underground pipes add length-equivalent volume to their segment or do they still only count as a single pipe entity in volume?",
            ":( not the solution I wanted, but the consensus is my opinion is wrong this time, so that's a shame",
            "I have to admit, I'm dissapointed with the implementation. Turning the pipe network into the electric network feels too much like giving up. If there were a choice, I'd at least rather copy the Belt implementation where pipes simply pass their contents to the next pipe regardless of pressure.  \nI have more thoughts on this, its just difficult to word it all. All I know for now is [this](https://ibb.co/nLYZWRP) feels like it shouldn't work.  \nEdit: Okay it should have been 10 water pumps, and that SHOULD work by the numbers, I just don't want it to work in this way.",
            "Wow, this sounds great. Had been beginning to doubt this would get looked at. Two items I've either misunderstood, or I'm struggling to make sense of:\n\n\n\n\n>Longer pipelines have higher throughput\n\nwhy is this the case? I don't follow why 2 pipes should have higher throughput than 1 pipe. How high can throughput be pushed by building longer pipes?\n\n\n>As a special case, pumps can pull at a faster rate if they are connected directly to a storage tank.\n\n\nI'm not really sure there should be any special cases - won't this be more confusing than less? Why can this not always be true for pumps?",
            "Thank GOD for this! Less UPS strain, straightforward design without second guessing, more effective pumping fluids to all places and huge spaghetti pipes will work like clockwork!",
            "I don't understand how throughput is limited in this system. Can I push unlimited amount of fluid through a single pipe, as long as it's full (more input than output)?",
            "Ok 12 videos running at once in one FFF was to much to handle for my laptop had to stop all of them and play them one by one to enjoy the good news of the overhaul. :D",
            "I would guess this would make fluids much easier on overall UPS as well.",
            "A welcome change that is more than worth the loss in realism.\n\n  \nWe've already seen a lot of new fluids in molten metals and the pink juice from fulgora. I'm willing to bet there are even more fluids yet to be revealed, especially on gleba. Hoping for a new use for steam on the final planet.",
            "I wasn't sure so I was wondering if this will address two issues that I see with fluids now:\n\n1. Having fractional fluids left behind, specifically having 0 < Fluid < 1.  This leads to an issue where you can't truly empty the fluid network and have to flush it if you want to then use a different fluid in the network.\n2. The same issue #1 leads to issues with circuits because it technically has fluid but circuits only deal in integer math it can't properly detect it.",
            "They say they're prioritizing gameplay over realism. But akshually, I think the new implementation isn't further from realism.\n\nThey've effectively set the resistance to flow in pipes to 0. Although not a perfect representation of reality, I think it's closer to realism than the old system. It's especially an improvement around pipe junctions.\n\nI like it.\n\nA player's goal would be trying to get all the machines in line supplied with fluid equally. Now you can go tinker around with more complex algorithms and systems, or you can go with the new system they're implementing.",
            "I'm sorry did I miss an FFF from before? Did they already say that they were gonna let you change the input and output side of fluids in chemical plants? We used to have to install a mod to change that, but in the example given in this FFF, they have set it so that adjacent chemical plants need similar fluids (light oil and water). \n\nThat looks awesome.",
            "&#x200B;\n\nhttps://preview.redd.it/19c8n4zvny7d1.png?width=2000&format=png&auto=webp&s=d8a07cb4a65be62c93bd78255f24ea6855834bd9",
            "This reminds me of Space Station 13 of all things. People might be disappointed that the depth is gone but that's not true, what's happening is that we traded working around annoying problems with being able to exploit the logic in more fun ways. There's a lot of interesting things you can do with this sort of system.",
            "This sounds like a significant UPS optimization as well. I wonder what the implications are for massive nuclear power plants.\n\nSemi-related, it'd be rather funny if it is worth it to ship interplanetary steam for quality turbines on certain planets.",
            "Shapez 2 also did this.  \nThey had pressure difference propagation in devlog 006.  \nAnd they simplified it almost the same way in devlog 022.",
            "At long last. [I shall be free from the horror.](https://imgur.com/tgANoXa)\n\nI will miss the actual flow in the pipes, but it is a sacrifice I am willing to make.",
            "Glad to see this, and not very surprised. Defending a problematic system on realism is wrong when the system's problems are unrealistic.\n\nI do think a throughput limit would be nice but I can imagine the implementation getting quite complex so I don't miss it much.",
            "i dunno about old pipe enjoyers, but belts with no req on power is always a big step back in realism, but an infinitely bigger step forward in playability",
            "I wish there was a better solution than this. I want to have to put pumps over long distances. I want to have to manage pipe bottlenecks. This is what I enjoyed about pipes. I did not like that fluid would not flow in all directions at intersections correctly. I also didn't like that pipe networks could not figure out the pressure critical path correctly. I would much rather have those fixed instead of reducing realism.",
            "With news this good lube is entirely optional!",
            ">Fun over realism\n\nThank you so so much. Each and everytime a game forces upon me tedious mechanics that are only there because they are realistic, i feel annoyed. \n\nI play games to enjoy them in my freetime. I have so much realism everytime i do anything in real life. I want to have fun and not think about how much something in a game doesn’t make sense in the real world.\n\nThanks for respecting our time, our freetime and most of all our enjoyment in playing this wonderful game!",
            "I'm confused, does this mean that pipes now have infinite reach?\n\nI mean, why use a fluid train if you can just build a pipeline across the entire map connecting the sources of liquids to the users?\n\nThis setup used to require many pumps and became increasingly unreliable as you added more and more branches.",
            "Let me guess before reading it, they made connected pipes merge so they act like a single entity?",
            "oh finally i can be done with balancing fluid train outputs, great change",
            "These updates are always so informative.",
            "These changes (which will most likely turn fluid UPS into non issue) might make the foundry OP in megabases. And I’m all for it!",
            "Is there a reasonable way to add a throughput limit on pipes?  Testing a few different values may be worthwhile, but just as an example it feels off to me to have a massive reactor being fed by a dozen offshore pumps and having it all run through one single pipe.",
            "you can squeeze the universe thru these new pipes!",
            "Thank god. Trying to learn fluid movement in this game was one of my least favorite parts. It all but forces you to figure out a way to get your pipes straight as possible or risk messed up throughputs. Amazing QOL update.",
            "Are heat exchangers, uranium miners, and boilers going to break up segments or would they be part of the segments?",
            "I wonder if it's possible for the new segment system to be tweaked to have something like a \"filling up\" and \"emptying up\" delay similar to the old one, instead of the fluid just instantly teleporting across miles of pipe, but otherwise still function exactly as it's been redesigned to do, after the initial delay, with all it's pros?\n\nFor example, calculate the delay based on pipe length, and play the expanding animation. Then once that's done, just go on normally.",
            "You should make a spinoff game \"Factorio: Inside the Assembler\" that is essentially like a puzzle game to assemble the components inside the assembler.",
            "This is a great change but I'm really going to miss the Ducts mod. They look great and I love the extra design space they add to high throughput builds.\n\nI wonder if the mod could find a new niche? I don't really have an idea though, the new fluid system seems pretty complete without it.",
            "As an Angel Bob player this change is so goated. My beautiful designs always failed because fuck pipe throughput",
            "Oh, hell ya! In every factory game ever, i have never said wow these fluid mechanics are so fun. Fluids are just not that interesting to me personally. These changes are soooo welcome.",
            "I think for me this is the best friday update I've read aside from new stuff. I loathe the current fluid setup and I wasnt smart enough to figure it out myself leading  to bases full of pumps trying to get just enough fluid to where I needed it.",
            "So this means that a 100 pipe segments act as a what we currently as a single pipe?",
            "Any other Space Station 13 engineers who recognize this fluids system?",
            "I kinda hoped \"better pipes\" would get their own setups and mechanics. Maybe make them take some extra space, have an energy cost etc. instead of a straight-up replacement. Will the legacy pipes be available for mods to re-add?",
            "This is it, my favorite 2.0 change. I hate the current fluid system with passion, its the worst part of Factorio by far. Screw realism, this is so much better.",
            "There's a part of me that will miss the challenge of keeping high fluid throughput in complicated systems, but it will be worth it not to have to deal with build-order directional biases and bad UPS performance.\n\nThe new pressure mechanic makes it seem like you might sometimes/often want a pump pushing into the assembler to make sure it has enough flow.  That could be interesting.",
            "I love that they ended with \"fun over realism\". Because at the end of the day, this is still a game and I want it to be fun! And if you want realism, just play pyanodons",
            "finally! btw never thought the old system is realistic. if u have a pipe full of water as long it going uphill or downhill is the problem not length.",
            "Oh my god, as a more casual player who has always disliked fluids, this is incredible. I genuinely cannot wait. Having pipes that are easy to understand is godsend.",
            "Every Friday we get closer to the release",
            "My smooth brain can’t process most of the information but you had me at „it just works™️“",
            "I was just discussing with a friend how factory building games (such as this and Satisfactory) try too hard when stimulating fluids, and it just ends up being annoying, and then this was posted. Thank you for simplifying fluids for 2.0!",
            "Praise Wube! Annoying fluid dynamics are finally a thing from the past! Tbh they rarely bothered me in the base game, but they quickly became a pain in modded playthroughs. I spent hours designing a steel smeltery and it never reached more than 80% efficiency, because the fluids acted weird. Fun over realism is the right choice here since the mechanics were never an interesting challenge to overcome. They were just annoying and impossible to debug.",
            "I’m so glad for this rework. Fluids have always been the most annoying part of the game for me. No matter what I do, it feels like it just isn’t doing nearly as much as I expect it to do. And it seems like no matter how many pumps I used, I could never get the fluid where I needed it as fast as I needed it. \n\nThis is a very welcome change and will make fluids work way more like I would expect them too.",
            "Well, now my nuclear mega base that pumps steam all over the place through 564567 pumps seems pretty silly",
            "How does the new system interact with mods that add control valves such as underflow and overflow? As i understand it those valves are implemented as special pipe segments which prevent flow in one direction unless one side is above or below a threshold. These valves allow creating priority consumption which is critical for some mods especially when there is a byproduct loop.",
            "Please include underground pipe connectors into the base game, it is the best mod ever!  \n[https://mods.factorio.com/mod/automatic-underground-pipe-connectors](https://mods.factorio.com/mod/automatic-underground-pipe-connectors)",
            "If I understand it correctly, it means pipes have essentially\\*) infinite transfer. 2x500 reactor feed by one 10km pipe, as long as on the other end of the pipe I put enough water pumps. \n\n\\*) the only limiting factor is the volume of the whole system, so it can buffer all consumption for one tick. But if this is a problem, we can just add tanks.",
            "A few Questions:\n\n   -If I connect pipes to a tank, are the pipes and the tank treated as two separate segment, or are they one segment, meaning only pumps (and machines) separate segments?\n\n   -What happens when I build a empty tank next to a full tank? Are they then instantaneously both half full, meaning the level of fluid in storages of equal capacities in one segment, being it tanks or pipes, are always equal?\n\n   -Do I understand that right, that pumps are included when you talk about machines?",
            "Yes!!! Thank you.\n\nFunny that when I described these fluid issues in a post 2 months ago, I was burried in downvotes.",
            "Nice, they [did it!](https://old.reddit.com/r/factorio/comments/1blu2tb/why_do_so_many_hate_the_fluid_mechanics/kw8pw4v/) 😌",
            "patch this in today",
            "Yes, finally we have the fluid rework dev diary! I have waited for this since i saw molten iron and molten copper in the dev diaries. \n\nFinally i can have trains transport around oil and water and can build nice reservoirs without having to fear that everything falls apart because oil cant get fast enough from the tanks in which the train unloads and the tanks which are connected to the pumps.",
            "So the old system was obviously suboptimal to put it very mildly but the new system seems a bit too easy for my taste too. Let's see if they'll limit the flow rate somewhat or perhaps the size of segments. \n\nWhen i started playing, i thought the fluid system worked exactly as it does now and only upon reading about it i realized my mistake, because in most scenarios, even long pipes don't limit flow enough for it to really matter. I never reached the point at which fluid handling became unbearable and if i did, i just used trains. So i'd rather have had transportation pipes, similar to the fixed-length pipes from space exploration for long distances. \n\nBut then again, let's see how they balance this (if at all) and if i will actually miss it when there's so much other stuff to manage in 2.0.",
            "Someone, please give raiguard a salary raise!",
            "Approved. The fluid system is, at best, an accessory to core gameplay, which is automating everything. Factorio does not require realistic fluid simulation, only an approximation of it that can be passed as a fluid system. \n\nI wish I could see the code!",
            "On the one hand, I will miss the realistic feeling fluid giggling that happened all through my x100 nullius base, it was kinda fun.\n\nOn the other hand, I may now be able to restart my x100 Space Exploration base, being able to delete nearly 20,000 pumps, responsible for 3.9ms total...",
            "Balancing fluids on train stations broke me. Words cannot describe how happy I am to see this FFF.",
            "I like how you can use long pipes quickly but only if you're willing to spare enough fluid to keep them filled. Some people are going to find out the bad way that things can grind to a complete halt if supply can't keep up, and can take ages to start up again.",
            "Personally, I didn’t think it was broken. I don’t like the idea of removing throughput. This is the first change to the game I disagree with, go back to the drawing board please.",
            "Omg train loading stations just got infinitely less ridiculous. Trying to balance 4 tanks was stupid, let alone 8 for the big bases.",
            "That opening line was too juicy. Also love the mention of a Minecraft mod. All in the same blog!",
            "I would still like to see some realism put back in.\n\nI think of the case of long pipelines. This new system means early game you can just run giant pipelines from oil fields often, oil is the first reason for me to get trains. Personally I think this eliminates the need for fluid trains.\n\nCould there be a limit placed on the size of a continuous pipe segment? Or the size of a pipe \"block\"? That way long pipelines would require a pump every x number of pipes or undergrounds?",
            "Somehow understand that was a must, even more - how to expect old system to work in gravitless asteroids :wink: :wink:, but damn, old system was so good puzzle how to deal with! to build storage buffers at start and end of the line between productions. To design production segments close enough to each other. Like big difficulty steop, after big-distance belts - that made only delay between starting productions to deliver, and whatever the distance after reaching stable supply source... but pipes, transporting fluids were also much fun aside to placing assemblers. RIP classic pipes and im waiting for mods.",
            "I think this is a bit oversimplified, but my assumption on making it a bit more realistic whould be to add new value of \"pressure\". Similarly to IRL it whould be the same throughout the whole segment and whould drop with additional pipes being added. This whould encourage pump usage while being completely predictable and customizable.",
            "https://preview.redd.it/4k0h9vns9x7d1.jpeg?width=474&format=pjpg&auto=webp&s=ae7edc00e0e735bb52204660ba91fe814bac6e78",
            "In a way it kinda got more realistic.\nIn reality pipes are most of the time full and flow results from pressure difference.\nStarting a pump or open a valve.\nIf you see the green bar not as level but as pressure it looks realistic.\nThe whole medium starts flowing nearly instantly(~speed of sound under water).\n\nPersonally i found the old system more fun. Now it’s more or less like a wire.",
            "I can't help but feel like this is still a janky hack solution, not a real one. I don't want to be a negative nelly... But this feels more like a mod than a solution on first read. It feels like we're going backwards here TBH. To a more abstracted game which might work better from a gameplay sense, but this doesn't feel like a \"real solution\" to me to the issues of fluid flow we were facing. Am I alone in this? I actually really liked the visuals of fluids flowing, I liked the *reality* that fluids move from one end of a pipe to the other.\n\nDon't get me wrong. I agree with all the issues the old system had, and no, I don't have any better solutions in my back pocket, but I am certainly not super happy with this solution either :(",
            "Lame decision. Basically removes fluids as a thing.\n\nWhy even have fluids if they dont have their own unique problems.",
            "I don't really understand why people would play a game that, to me, is about problem solving when they are removing some of the problem solving. liquids could have been reworked but this is just overly simplified in my opinion. I like to play the game to work on new challenges and feel satisfied when I finally overcome them and have a better understanding. Even as weird as fluids are currently in the game it still gave me something to do and gave me more game time. I don't expect the average gamer to agree with this sentiment, but I don't consider Factorio players to be \"average\" gamers. I thought we played this game precisely for logistic puzzles. I don't know, I can't help but to feel disappointed. I know most people just want things to be easier though.",
            "I really don't like the change, it trivializes too much. You had a much better prototype solution in FFF-260, which looked perfectly fine to me.\n\nAlso, I'm not convinced that problem needed fixing altogether (except for performance reasons) - if one pipe does not give enough throughput, just build another one in parallel. If you feel like it's too many pipes for balance reasons, reduce fluid values in recipes.",
            "Next up, a belt update that turns belts into a single chest of arbitrary shape. Would improve performance as well!",
            "I might be in minority that thinks old sytem had it's own charm.\n\nIt was bad, especially part \"build order\". But it was interesting to pay attention how and why you build pipes. It was different from belts. Not it feels same",
            "This isn't fluids 2.0, it's fluids 0.5. They just completely got rid of the unique flow mechanic.",
            "This sounds great, I'll take fun over realism any time of the day! I'm just wondering what is the max segment size, how does this work if I just create a very very long pipeline? Is there any point at which it just stops the flow? (edit: ah I read below that the drain is based on % of volume filled, so a very long segment would have massive volume and slow transfer. neat way of solving this tbh)\n\nAlso, think they'll do something like this for heat transfer in nuclear setups? Those always seemed hard to read or understand and I feel like people just copy an optimal blueprint instead of improvising on their own (at least I do). Then we should be good with UPS and intuitiveness of these setups compared to solar",
            "Just like to take yet another #FF moment to remind everyone how absolutely UGLY and dumb having all those beacons like that is, and why they should not exist in their current state whatsoever.",
            "I’m a little sad that we’re losing some realism, but it makes sense that the old system was inadequate for the high-quality late game builds. \n\nThat said, I think it’s great that it’ll be much easier to see if your build is working correctly. If the pipes are full then the machines are getting enough fluid, if they’re not full you’re not supplying enough fluid.",
            "As long as this comes to vanilla factorio as well as the new \"Space Age\" dlc, i might just stick to vanilla. I'm not really interested in the dlc itself. Fluid handling as it is, is currently the number one headache in all my saves.",
            "Curious if the heat pipes have been adjusted similarly, given they're essentially using the fluid mechanics too.",
            "Am I the only one who doesn't actually like this change? Of course that train design wouldn't equally unload, it's terribly structured. I never really understood the liquid flow complaints and even after reading this I still don't.",
            "Man, I wish we had symmetrical storage tanks.\n\nThough I guess this change will make it so we can connect tanks with a pipe without drawback?\n\nThinking about fluid wagon loading and unloading.",
            "So... Can I abandon oil trains and instead lay a ridiculously long pipeline from an oil outpost to the base?",
            "Niiiiiice. I think it actually more realistic then 1.0 pipes. Cuz in real life water is incompressible and the pressure is almost the same along all (horizontal) pipe, which is not the case for old pipes. If I know physics correct :P",
            "This might be the most excited I've been about any of the new changes. The old fluids were interesting, but difficult to understand and as a result you usually just ignored them and dealt with them not working properly. This is simple, but I'm already thinking about many complicated effects it can have and ways to optimize. Can't wait to play with it!",
            "Now that we're here, can't we also get a fix for fluid wagons on curved rails? Or is that already fixed?",
            "Q: In the vid that shows the train being filled up with fluid it changes colors from black to yellow/green. Is this a mod? why did it change? \n\n[https://cdn.factorio.com/assets/blog-sync/fff-416-pumps-after.mp4](https://cdn.factorio.com/assets/blog-sync/fff-416-pumps-after.mp4)",
            "Does this effect how nuclear heat pipes work as well?",
            "Suppose it's appropriate given Factorio's origins",
            ">Didn’t expect a fluid rework\n\nI did. I thought it would be exactly the kind of thing to put into 2.0. It's very similar to rail s-bends and bot pathing improvements - a long standing problem that needed to be solved, but could only be fixed by uprooting some of the older deeper systems.",
            "I was definitely expecting fluid to get reworked before the expansion. The current system is probably the single largest source of WTF in the game.",
            "Nah.  This was entirely predictable.  One look at the math for how much fluid individual buildings can now output under a complete quality 5 scenario says the 1.2k/s standard is just woefully inadequate for the job.\n\nI'm going a step further and saying trains are getting capacity improvements, too.  A wagon of ore can currently unload onto a belt in 44.4s, but in space age, it's gonna be 8.3s, which is so short that the time to swap trains out is going to be a problem if you want to avoid throughput interruptions.",
            "it's interesting that they mentioned Thermal Expansion when Thermal Dynamics is the one that adds all the pipes and transportation stuff (atleast in 1.7.10, i know they were 1 single mod before then).\n\nalso [Viaducts](https://teamcofh.com/docs/1.12/thermal-dynamics/viaduct/) in factorio when?",
            "I absolutely did tbh. Fluid mechanics was probably the most jank shit in the game, which isn’t saying much since factorio isn’t remotely janky, but still.",
            "Possibly the first FFF that hit my inbox and was met with an audible “ooh” since SA was announced!",
            "I usually save FFF to read during lunch. But I saw the headline while scrolling and said \"I guess I'll have to read something else today...\"",
            "Yepp, I suddenly had to rework my schedule to read this instead",
            "Honestly, this is a top 10 of all time FFF for me. I think the chosen fluid system is a great example of going with \"least imperfect\". While they might have done so under the hood, the one remaining thing I would change is moving to \"fixed point math\" or making it all whole numbers under the hood (for example the actual units become \"mili-units\" and all values are displayed as 1/1000th of the real value) this completely drops the floating point math for fluid which is a source of slow code, errors, and potential non-determinism if there are uncaught hardware dependent FP math issues. But given how many fewer operations/places there will be it is largely minimized.\n\nIf Factorio had an actual defined \"end\", if it had a limited map size, if it wasn't so obsessively and amazingly crafted and optimized; then the existing fluid system would be FINE. The existing (legacy now I guess?) system has a lot of artistic intent and lets say 80% of the time for the majority of players works \"well enough\". I can understand and 100% support the drive to have artistic intent in the system; and I believe there was a way to maintain more of that artistic intent while delivering a performant system HOWEVER I totally recognize that the effort required is likely MUCH higher than the redesign discussed in this FFF. \n\nI think this sentence from the closing of the FFF sums it up perfectly: \"But as a game designer, you always have to make trade-offs between what would make sense in the real world and what is fun for a game.\"",
            "This is a live tweet:\n\n*sees the headline* \n\n“Mo my GOD!”\n\nEdit after reading:\n\n“YES! Take that ‘but fluid was realistic’ copium-ers, this is going to get rid of so many headaches having fluids just work”",
            "Should, by a lot, similar to the belt optimization. There is no longer any need for each pipe segment to check the ones before and after to see how liquid needs to flow each tick.",
            "if it does i can't wait to build an enormous nuclear plant producing tens of gigawatts of power",
            "That seems very likely.",
            "It definitely will be easier to run fast. Before the flow for each pipe segment was calculated separately. Now it's clumped together and connected pipes are handled as one fluid box.",
            "It definitely should - at very least by virtue of polling pipes together into fewer fluid boxes and reducing numbers of pumps needed.\n\nThough that's obviously just part of the story and how much better it is for any given base will be very strongly tied to how efficient you were in using pipes within current systems. And how much the fluid calculations where contributing to your overall update time to begin with. Currently the \"state of art\" of fluid optimization is mostly just avoiding large systems and instead running multiple independent ones in parallel.\n\nLast but not least - with entire science and lots of game play reworked, a ton of UPS assumptions will have to be thrown out anyway.",
            "Nuclear Power was immediately my next question indeed. So we can have 10 offshore pumps at the lake, and bring all that 12k water/sec through a single pipe to the plant and distribute it wherever it's needed? And take the same amount of steam away through a single pipe? Reactor designs will be extremely simplified with this change, making the max distance between reactors and heat exchangers the only constraint.\n\nWill pumps still have a throughput limit?",
            "> It simplifies the fluid puzzle quite a bit\n\nBecause the puzzle was mostly bashing your head against unintuitive and unrealistic mechanics.  If fluids had worked the way they really would in real life, then the puzzle would have been solvable.  As it is, \"solvable\" means \"unrealistic designs and massively over-supplying.\"  This simplification is a significant improvement.",
            "Yeah and its opaque unpredictable weirdness that goes against the core of the game. Predictable automation. Sure you could automate it but it would fight with you",
            "> simplifies the fluid puzzle\n\nI would strongly argue that fluid was not a puzzle, it was a labyrinth of mistakes that couldn't be solved so much as it could be mitigated, and it was bad.",
            "I'd like different pipe sizes with different throughputs",
            "Makes sense, really. You no longer get all of it for being the first one to read - now it's split evenly among all readers instead. Much fairer for everyone. ",
            "I, like some bases, was sucked dry.",
            "You took cheap lube, you need the Wube™ Lube.",
            "Yeah you’re still on the old fluid system need to add more pumps.",
            "They did start with the double entendres",
            "Paraphrasing a relevant comment I read somewhere else: \"I wish Oxygen Not Included were developed by Wube.\"\n\nFluid mechanics are such an important part of that game but the systems in place are both unintuitive and unrealistic. The performance of ONI is also trash compared to Factorio. \n\nI'm excited for Wube to wrap up Space Age and move on to their next project. We're very fortunate to have such a talented and earnest team writing software for us.",
            "> And I like stardew valley, but my point stands\n\nThe first time I made an entire planting plan for a season I ended up unable to do my last harvest because I didn't realize that for a plant that grows for X days you need an X+1th day to harvest them. An ingame ability to set up a \"planting plan\" or similar would be very helpful there imo",
            "Segments can contain different fluids today?",
            "It's wonderful. I could not support this change more.",
            "You posted in the wrong sub, you're looking for this one: /r/Factoriohno/",
            "Yeah, I wonder if that's one of the interesting possibilities they hint at.",
            "They are saying an entire segment can only hold one fluid, so doesn't that make sushi pipes completely impossible?",
            "They specifically mention it'll take longer to empty pipes, so this probably hurts more than it helps.",
            "Is it still sushi when you make it into a soup?",
            "From what I understand, we'll still be doing some of that.  Possibly more, actually, as we now have filters on pumps and fluid behaves consistently and predictably.",
            "“Yes”, there is no flow direction anymore. Just “is flowing”. The direction is “to what ever wants it”",
            "This doesn't have to be considered a loss of realism. In real life if you put a section of glass over a pipe to see what's inside, you can't actually see the direction of flow. Unless the liquid is full of debris or bubbles.",
            "It's more that now you can fit infinite fluid through a pipe. Nuclear reactors can push all of their water and steam through a single pipe, for example.",
            "Pressure is just a product of fluid quantity though.\n\nNot that they ended up with a particularly good model of pressure.",
            "Putting different fluids at different times in the same pipe is the only use for pumps now.",
            "Real pipes are pressurized and the pressure travel at the speed of sound. So no it was not more realistic.",
            "I think the old system, while trying to be more realistic, was, in fact, unrealistic in many more ways than the new one is.\n\n'Realistic' model that does not work is not realistic in the end.",
            "> Its sad to see the realism go\n\n> right turns only at T-junktions\n\nI think it's safe to say nobody will miss the \"realism\" of a system where fluids make right turns only in T junctions.",
            "Yeah, definitely appreciate the initial attempt to make it realistic but after thousands of hours, it's gonna be great to not have to deal with the headache that is the current fluid dynamics any more. Spamming pumps everywhere and learning the arcane ways just was not fun.",
            "It's Raiguard the Wube employee now :)",
            "I’m just glad they don’t have the ego and can go back on what they said in the past. Some people just pick an answer, dig their heels in and refuse to see the other side",
            "I feel the opposite. This new scheme is kinda disappointing honestly because it's dull and sterile. Referencing Minecraft the early days of the technic pack had an item pipes mod. And you could see the items moving through the pipes - so cool!\n\nLater versions (and FTB) changed this to something less interesting. Likely simpler, better on resources, and had less nuance... but so boring. I found it a lot less fun as a result.\n\nNow you can have a ten mile long fluid pipeline and \\*poof\\* suddenly the entire thing's fluid contents change instantly and across the entire thing?\n\nIt's a new way to send analog signals I guess. But it's so much less interesting and unique.",
            "Wube Lube™",
            "The link to the comment works in old reddit, but doesn't work in new reddit. The username u/fffbot still works as a link, and you will find the correct post very quickly from there.\n\nAnyway, I like the change of having only a small comment with a link in the main FFF post.",
            "No, heat pipes are similar to pipes only in they share the same last 5 letters in their names. Internally they are completely different sets of logic.",
            "Finaly we won’t have to do tank pump tank pump~",
            "Yeah I know. I remember getting the email from Rseding - it was almost 8 years ago, actually.",
            "I'm not 100% sure, but I \\_think\\_ they meant that longer pipes have more throughput \\_in 2.0 compared to 1.1\\_, not compared to shorter pipes.",
            "I might agree on nuclear reactors but overall this makes fluids so much easier to work with, so I'm all for it. The only thing I disliked about factorio to any degree was working with fluids and to me the game will literally be perfect in 2.0 so far lol.",
            "It's not trivial, building a whole-base pipe network is actually a massive pain in the ass once it gets large enough. Not to mention the incredibly massive buffer size.\n\nFluid trains are still the best way IMO.",
            "Not quite, distance increases volume, and since machines pull depending on how filled is the segment, longer pipes will mean slower pull from machines. Something to take into account.",
            "I think the \"long time to drain\" would cause you some problems with having a giant \"fluid bus\" for non-over-supplied fluids.\n\nIf every consumer can only consume whatever percentage of the pipe is currently filled, you'll get stuck pretty hard.\n\nThat said, it does raise some long distance possibilities if set up correctly.",
            "You have to take into account that the new system bases the speed how machines can drain the connected pipe. If you have 10 pipes and 1000 fluid, each connected machine can pull with 100% speed. But if you have 100 pipes with 1000 fluids each machine will only be able to drain the pipe with 10% of speed. So smaller networks still make sense.",
            "> Since distance is irrelevant you can substitute all fluid trains for pipes and if at one spot of your base you input liquids, the output can immidiatly draw from the segment.\n\nIn theory yes, but the cost would be substantially higher than using trains (because you'd need a pipe per-fluid). The trade-offs are different in the new system vs. the old system but there's still plenty of reasons to choose trains over one super long pipe, namely:\n\n- Material cost\n    - One long pipe per fluid rather than a single train per fluid\n- Routing challenges\n    - One long pipe would need to be spaghetti-routed around your rails/machines/etc.\n- Could easily look ugly\n- Space\n    - One long pipe would - in theory - take up less space than a rail line, but two different fluids would already need to be bigger than your rails\n    - Your pipe(s) would be an \"as well as\" rather than \"instead of\" rails, since you will likely still be using a rail network for items\n- Throughput\n    - Generally at scale throughput is more important than latency, you might be getting your fluid instantaneously, but over time the throughput for pipes is likely going to be lower than the throughput for trains",
            "Hmmm, imagine having all your flamers connected to one giant oil pipe network.\n\nA lot like the lasers and the electricity.",
            "I don’t know. A huge segment would have some capacity. And while it’s not filled also the output is limited as far as I understand it. For me it still make sense to have segments.",
            "Could have been a L from Lube.",
            "Wow, all in 30 minutes? Impressive!",
            "Which is quite a feat, considering it's been up since 1 hour!",
            "I haven't done a vanilla nuclear station for a while but I remember keeping water going at high throughput was the most annoying challenge when making a large reactor.\n\nIn SE there is a condenser turbine which takes in steam and spits out water, and it shuts off if the water line is full. It has severely hampered by reactors because of fluid flow issues, and a full redesign is a huge pain.",
            "Since \"available output\" scales with \"percent filled\" with tanks being (somewhat) special cased, I'd imagine you want a pump between your \"input pipe\" and whatever distribution manifold you have, likely (the pump) pulling from a tank as well.",
            "I'm convinced the majority of people being negative about the change are simply stuck in the \"I'm used to it, and it's familiar\" level of Stockholm syndrome (kinda like I was about the decaying items, which I've mellowed on).",
            "Don't remind me of that... There was a branch with a fluid system that was already tested and seemed to work perfectly, even through all Twinsen's trick setups. It fixed all the issues while still being realistic while costing pretty much the same... But nobody cared cos I fell out of favor. Company politics.  \nThe benefit of this system sure is that it saves on compute. But I do not like the lost realism.",
            "Solar should always be better for UPS, because the work required should be effectively constant (e.g, 10 solar panels should have a similar UPS to 10000 solar panels).\n\nAccumulators might skew this a bit, since each accumulator has it's own buffer. I'm unsure of how much black magic Wube does around this.\n\nThat said, I imagine nuclear will be way faster and a lot more competitive.",
            "Solar will ALWAYS be best for UPS because it's effectively O(1). You can scale it infinitely. And that O(1) calculation is also incredibly cheap.",
            "Don't think so, as solar basically only counts the amount of solar panels and acts like one big entity per network, while a nuclear reactor still consists out of multiple entities.",
            "I don't think Nuclear can ever be better than solar in terms of UPS, as all solar panels and accumulators connected to the same electric network will act as one entity. The threshold at which nuclear UPS becomes an issue though will probably much higher, so you might want to switch to nuclear for convenience.",
            "one  huge drawback of really long pipes is still the buffersize. imagine needing millions of heavy oil just sitting in your pipes in order to have that one lube-maker run without pause. sounds like a really long buildup time before it is useable. also almost all of the fluid would be wasted, if you had to deconstruct it all for some reason",
            "With the 2.0 DLC rumored to come in october, we'll only wake you up when september ends ;)",
            "You should look at the simulations somebody did a while back :) A pipeline build left to right will have much better left-to-right throughput compared to the same pipeline that is build right to left.",
            "https://www.dropbox.com/scl/fi/ybmzubec6f9ae4hqbqdwr/Factorio-1.1.72-2022-11-24-16-40-28.mp4?rlkey=yhugna9xwle36nfn71jzn4lj7&dl=0\n\n(Lamps light up as soon as a tank is full. Left and right builds are identical but pipes are placed in a different order, and all three tanks are equidistant from the junction in number of pipes.)\n\nYeah, not gonna miss this.",
            "Maybe they have some other new system for heat considering there is lava planet.",
            "/r/factorio/comments/1dl197h/friday_facts_416_fluids_20/l9lpane/",
            "https://www.reddit.com/r/factorio/s/MjpnLruedw",
            "No, please don't make heat transfer instantaneous. Thatd be going too far in the other direction of 'realism vs fun.' Maybe faster heat transfer will be the perk of higher quality heat pipes?",
            "Presumably they still have the same fluid box size, so they're useful if you want to minimise the buffer in your pipe network.",
            "Flood fill is insanely fast and only has to happen when disconnecting a pipe that theoretically could be keeping 2 sets of pipes connected.",
            "The text of the post indicates that the left-most recipe is for \"fuel\", and the right-most one is \"oxidiser\", presumably to run the platform thrusters. The middle one is outputting water with no fluid input, so given the icon I assume it's \"melt ice into water\". If these recipes have been discussed before then I don't remember it. If they were, presumably it was while they were going over the platform mechanics.\n\nGiven the ingredient only appears to be water, I'm also assuming the fuel is meant to be liquid hydrogen with liquid oxygen for an oxidiser, which is a fuel sometimes used for spacecraft. Its thrust properties are great, its main problem being that it's volatile and hard to store long-term.",
            "There's plenty of us that agree with you.",
            "I think realistically they simply don't have the time/dev effort to fix this in many other ways, and given what is stated in the FFF with the new systems it turned into a \"thing that MUST be fixed\" from a \"thing that is annoying for many and an issue for megabases\".\n\nI will further argue that the current/legacy fluid mechanics are neither good nor interesting. I would have welcomed some level of interesting and realistic mechanics such as adding pressure (needing pumps to maintain pressure or something for longer runs for example). But I think between \"leave the current not good and now game breaking system\" and \"replace with something like in the FFF\", the second one wins 100% of the time. \n\nI feel like they could have made some changes to the current system and *maybe* eked out enough performance, but the weird \"pipe order matters\" stuff might be a bridge too far to fix. Personally I wonder if moving to whole numbers from floats (and say everything is simply 1000x the current units, and displays to the player as \"real number/1000\") combined with overhauling how flow is calculated and possible something with treating a run of \"just pipes\" as a single unit for calculating flow and then just setting the values on each segment.",
            "I almost want an implementation that uses different pipe pieces, like dedicated juntion pipes and ones that are dedicated for adding to a flow in one direction etc... But other than splitters and rail signals theres been no need for such a thing with other networks.",
            "Your screenshot will depend on what the change to pumps is.  Because pumps separate segments, your screenshot will ultimately be limited by the one outflow pump.  It would actually work better without the pump.",
            "Longer pipelines have higher max throughput because you can remove more fluid from them for the same drop in fullness percentage (which is what limits pulling rate). But they also take MUCH longer to fully empty.",
            "> why is this the case?\n\nI don't think it is... I think they meant \"higher throughput as compared to before\"\n\n> I'm not really sure there should be any special cases - won't this be more confusing than less?\n\nIt won't be more confusing. I think by special case they mean that pumps are different to pipes - which they are. It is just an explanation of how the code works.",
            "The throughput of pushing fluids into the network is higher, because there is more capacity to push to. The throughput of pulling fluids out of the network will be slower if the network is relatively empty, but for a full network it will also be faster.",
            "> > Longer pipelines have higher throughput\n>\n> why is this the case? I don't follow why 2 pipes should have higher throughput than 1 pipe. How high can throughput be pushed by building longer pipes?\n\nMy impression is that this is just a technical side effect of the algorithm. That is, it wasn't intentionally designed this way, but the behavior was considered acceptable, given that the algorithm is generally easier to comprehend and is probably much simpler in terms of code complexity and computational cost. Trying to alter the algorithm or find a different algorithm to avoid this behavior wasn't considered worth it.\n\n> > As a special case, pumps can pull at a faster rate if they are connected directly to a storage tank.\n>\n> I'm not really sure there should be any special cases - won't this be more confusing than less? Why can this not always be true for pumps?\n\nI just think of it as if the tank provides a special arrangement with the pump, mostly by being elevated, so that the pump's input is always fully saturated as long as the tank has any fluid. Whereas with a half-full pipe, the fluid is just sitting at the bottom and the pump's input is not fully saturated, so it struggles by pumping air with the liquid for example.",
            "> I'm not really sure there should be any special cases - won't this be more confusing than less? Why can this not always be true for pumps?\n\nI think they mean that the system is set up so it represents something like \"a pump can take as much fluid from the segment as (a set fraction of) what would be in the attached fluid container if fluid was stored per container rather than per segment\", which means for a half full segment a pump could pump say 50 from a pipe, but 12500 from a tank. This closely mirrors current behaviour and I think it makes sense a pump attached to a big tank is more effective than a pump attached to a small pipe",
            "Why sould we thank God when Raiguard did all the work?😋",
            "Push rate is unlimited. Pull rate is proportional to how full the pulled segment is. Machine outputs push, pumps do pulling.\n\nSo if you have 10000 lube factories connected to a tank with a single pipe, it would fill up instantaneously from what I understand.",
            "For me it looks like throughput is essentially unlimited, at least if you don't use pumps",
            "I assume this is fixed.  The old system needed the granularity of fractional values (floats) to have smooth flow.  The new system has no such need, and with all the known issues it's a pretty obvious thing to change.\n\nAdditionally, [Friday Facts #405](https://www.factorio.com/blog/post/fff-405) mentioned pump filters and sushi pipes at the bottom, which only make sense if they fix this",
            "https://factorio.com/blog/post/fff-394",
            "Yes and no. If my understanding is right, then the speed at which a building can take fluid from the pipe is based on how full the pipe is, and the longer the pipe the more fluid is needed to full it. Or in otherwords, if you had a pipe of infinite length, you would need infinite fluid to maintain a throughput above effectively zero. But also yes, if you did have an infinite length pipe that was full, you could transport fluid over an infinite distance instantly.",
            "> I'm confused, does this mean that pipes now have infinite reach?\n\nYeah they basically just entirely removed the fluids mechanics. Really sad. Fluids teleport from one end to the other instantaneously.",
            "infinite capacity and teleports fluids from one side to every other side instantly.\n\nwe dont even have fluids anymore; pipes are functionaly identical to a single long chest.",
            "Your guess is correct.",
            "That's sorta what factorio already is.  If you blueprint a module that makes red circuits you've effectively created a large assembler that makes red circuits and you have designed \"inside that assembler\"",
            "Assemblerterrisimo mod",
            "Something like Spacechem?",
            "This is straight up how atmos works in SS13 which is so hilarious to me indeed!\n\nAdmittedly it should make things a lot less headache inducing in general too so I approve of it.",
            "Yep. I guess the problem really is unsolvable though. All Minecraft mods start out with simulating flow through a network and end up eventually just adopting this solution.",
            "I suppose it is close to impossible to design a realistic fluid system without the current one’s shortcomings that would also not cost significant UPS. However the new mechanics do seem op compared to train and belt transportation.",
            "Fluid mechanics were neither realistic, nor predictable. In this case, nothing is actually better than a poor implementation.",
            "The system as it existed was both unrealistic and unpredictable. The problems it caused weren't logical and were heavily dependant on the order of construction, which means it wasn't a logic puzzle to solve, just a nuisance that got in the way unpredictably. Also, the solution was often \"there is no solution, this is the limit for this system\".",
            "It's one thing for a problem to be defined and solvable, but fluid behavior made no sense to me even after playing for hundreds of hours. It isn't predictable, it isn't intuitive.\n\nAs long as they keep some kind of mechanics around max capacity and throughput, I'm fine if they smooth out the complexity.\n\nI'm sure someone can make a mod to do that if the developers don't :) Like mods that add max capacity to power lines.",
            "Unique sure is nice way to sugarcoat that mess.",
            "There's devs here commenting; they said that this rework doesn't affect heat pipes, which are coded differently.",
            "Yes, the train unloading was not optimal in the example. The new implementation trivializes some challenges that were fun to work around, but it doesn't completely remove it: If your fluid system has too much capacity, machines won't drain fluid from it at the maximum speed.\n\nThe fluid system was and still is a compromise. One of the main reasons for this change is that a manifold doesn't work anymore at the higher fluid rate introduced by the new machines and legendary machines/beacons/modules.\n\nSo while I miss some of the challenges, I still think the change is an improvement overall.",
            "I run into these issues a lot in cases where high throughput and lots of producers/consumers are used.\n\nMy example comes from SE but the concept is:\n\n               |---steam----v       [R] - Reactor\n    [R]-heat->[B]          [T]      [B] - Block of boilers\n               ^---water----|       [T] - Block of condenser\n               |                          turbines\n              [W]                   [W] - Water top-up\n\nThis is the general setup for a reactor on a waterless planet, the turbines only produce power if there is demand _and_ if there is enough space to output water.\n\nSteam needs to be pumped through with a high throughput to keep the turbines fed, so you need to pull in water fast (like a regular reactor so far). The problem is you're mostly getting that water from the turbines, so you need really high throughput _out_ as well. Because of how the fluid system currently works, turbines closer to the reactor empty first, and always take priority over turbines further back.\n\nThis leads to a reduced number of turbines actually able to function, which leads to less water coming back overall, which is identical to the \"running out of water\" case, so your water top-up kicks in and pushes more water into the system. This slowly over-fills the system until you no longer have anywhere for the water to go and your reactor deadlocks.\n\nBasically this problem is sort of always there because you need a bunch of both boilers and turbines, but having a bunch of boilers and turbines is exactly what causes this fluid priority issue.\n\nThis change would completely eliminate this class of problem.",
            "What part don't you understand? Fluid junctions should work better than they do now.",
            "In one of the train FFFs, they explained that trains now have the option to take on the color of the next train station they're going to. \n\nSource:  \n[https://factorio.com/blog/post/fff-389](https://factorio.com/blog/post/fff-389)\n\n# Auto color based on destination\n\nThis is another thing teased and noticed in previous FFFs. We like to color our trains based on what they deliver, but with the generic system, any train can carry anything and static coloring just won't do the trick.\n\nInitially we wanted to somehow add coloring to the schedule GUI, but it would be a hassle, where every station entry needs to have yet another UI element (in a GUI which is already not that simple). But we realized that a much more natural approach is available.\n\nSo we added a simple checkbox (on by default) to the locomotive color widget, to change its color based on the destination.",
            "exprain",
            "*Sometimes it is easier to ask for forgiveness than to ask for permission, so I took a risk and began to rewrite the fluid system.*\n\nI feel like this 'approach' only works for a dedication team with people understanding each other. Pulling this move in another environment and you may get reprimanded.",
            "When they announced SA, I expected it to be a DLC. Now with all the changes to core systems, I feel it really is 2.0, not just a DLC.",
            "Yeah and the people who are “upset” about this are huffing copium man, this is a massive improvement that will save so many so many headaches. The unpredictability goes against the core of the game honestly, predictable, reproducable automation, and fluids just werent that.",
            "Yeah. When they showed the molten iron and molten copper, it was already a big hint that they would do something with fluids, otherwise introducing these new fluids made no sense.",
            "Yep. Maybe not something quite this drastic, but I would've been extremely surprised had they not addressed it at all. I'm happy with this even if it makes fluid handling easier. Also makes me all the more convinced [the last unreleased entity in this picture](https://i.redd.it/a0asyp77yg9a1.png) involves fluid processing. It looks like an underwater thingy, or it could be an advanced chem plant.",
            "Trains already got one thanks to molten metal processing. 1 molten metal makes 1 plate (plus productivity). So a single fluid wagon represents at least 37,500 plates.\n\nThe main issue is with other intermediates like green and red circuits. But those were pretty dense already.",
            "The mod had many splits at some point, I just lump it all into one for ease of reference.",
            "the pipes used to be in the same mod Thermal Expansion, up to 1.6.4, until they split off into multiple mods. The devs still remember that time lol.",
            "Thermal Expansion used to be the whole thing. The mod split up into individual pieces somewhere around the 1.7.10 days.",
            "This is nice, but is this multi-level railway crossing nice?",
            "Like, rescheduling work?",
            "Me when Update drops:\nBehold, my 500gw nuclear Reaktor",
            "I think fluids were more optimized than that. It used to be that way, but they optimized. I believe it was right around 1.0.\n\nFFF 260 talks about it in detail, but the current system is not calculating each pipe. \n\n> To put it more simply, updates will only be run on junctions and segments.\n\nIn this case the segment they’re talking about is the entire length of the pipe. \n\nIt was a massive ups improvement at the time.",
            "Solar might still be the norm for megabases but nuclear now is a much much more worthwhile investment as you can now easily reach several K's of SPM without worrying about the fluid system eating ups.\n\nI'm not sure if this would make nuclear O(1), I doubt it but it definitely improves it by a lot compared to the current system complexity.",
            "This should benefit mods like Py and seablock enormously as they have such huge fluid libraries and those fluid operations eat quite a substantial amount of performance.",
            "I don't know if the main UPS cost for nuclear setups come from heat pipes or water pipes. if the latter, solar panels have been made useless except for use in outposts",
            "If there's a pipe segment with a water pump on each end, and things consuming from the pipe along the route, will there still be the potential to \"double\" the capacity of the pipe because it's being supplied from each side?\n\nOr will it not matter that the pipe is supplied from both sides and essentially the pipe's capacity is cut in half?\n\nI'm not too clear on that.",
            ">So we can have 10 offshore pumps at the lake, and bring all that 12k water/sec through a single pipe to the plant and distribute it wherever it's needed?\n\nNo, because the rate at which machines can pull from pipes is limited, that is your maximum throughput.",
            "> If fluids had worked the way they really would in real life, then the puzzle would have been solvable\n\nReally? You should let the [Clay Mathematics Institute](https://en.wikipedia.org/wiki/Millennium_Prize_Problems#Navier%E2%80%93Stokes_existence_and_smoothness) know and collect your $1milllion prize 🙂",
            "ROFL, you win.",
            "this is a great joke",
            "oh no. our pipes got the socialism update!",
            "You don’t think they were trying for an innurendo, do you!?!?",
            "ONI to me seems to be the perfect example of how to NOT do \"optimize for fun, not realism\"\n\nSeriously, I was really enjoying the game until I had to mess with the heat mechanics and completely reverse entropy. I understand how that would be a real issue living in an asteroid, but the fact that the best way to deal with heat management is to build player-made \"hacks\" that use oversights in the heat system to reverse entropy really irked me. I don't think I ever dropped a game this fast",
            "I agree on the performance, but ONI’s fluid mechanics are internally consistent.  What do you consider unintuitive?  I don’t think realism is a valid point for either game.",
            "ONI's perf is the sole reason I've never beaten the game, and I have more hours in it than I do in factorio.  It's honestly just sad.",
            "> Paraphrasing a relevant comment I read somewhere else: \"I wish Oxygen Not Included were developed by Wube.\"\n\nThis breaks my heart to think about. ONI was a game I wanted to love, but, man, what a mess.",
            "I hope that Wube's next project will be another Factorio DLC further expanding the game in yet another direction. Be it water world, galaxy exploration, going underground, or just making existing systems depeer, anything is welcome.",
            "But with sushi pipes, you can build 1 long pipe and some logic, instead of 5 long pipes. And it will work well. Sushi pipes will probably become a standard solution.",
            "[Friday Facts #405](https://www.factorio.com/blog/post/fff-405) called it out, it just didn't make sense without the rewrite.\n\nThroughput will still be limited due to repeated swappings, but that's always the fundamental problem of sushi belts/pipes.\n\nOnly thing I don't see mentioned anywhere is switching to integers exclusively, ditching floats.  Old system needed the granularity of floats for smooth flow, but recipes were always integers, floats caused rounding errors that sometimes deleted content, rounding broke the circuit network, rounding broke train conditions.. fixing that is a pretty big unstated benefit.",
            "just need to drain it before the next fluid goes in. there's a reason we have filters on pumps in 2.0",
            "You can't have two different fluids in the same segment (which consists of only pipes and storage tanks), but pumps separate segments. So you can absolutely make a monstrosity that treats pumps as train signals and have different fluids act like trains moving down the same pipeline.\n\nActually now that I think about it, such a system might work quite well with these changes...",
            "*with the exception of pumps directly into storage tanks",
            "could pumps be used to determine the direction the fluid moving animation should be going.",
            "I like that you downgraded the visuals to get the gameplay system improvement in, that was a good tradeoff.\n\nBut: It would still be super nice to have those flow direction visuals again :) Maybe we can at least have directional visuals for the easy / manageable cases, and any ambiguous pipe segments still keep this new turbulent/sideways animation? Would still be an improvement, I think",
            "\"fit infinite fluid through a pipe.\" that actually is somewhat more realistic, yes, because you get more throughput the higher the flow rate is, in real life that just means the fluid travels faster and scours away the inner walls of the pipeline faster, so they make the pipes massive in diameter to reduce the flow rate and increase the operational lifespan of the pipe sections. I welcome this change wholeheartedly. The previous system, to me, felt like the machines were half-broken spitting water-hammer packets of fluid into the pipe network sporadically, I could work around it, but having to work around a game mechanic is never really the right solution, working with the game mechanic is infinitely better than fighting against it.",
            "> The exact throughput numbers are subject to change based on further playtesting.\n\nThe system theoretically allows infinite throughput.  In practice, it sounds like they'll be applying limits to keep it sane.",
            "i could've read wrong but i think its still limited to one fluid per pipe",
            "\"fit infinite fluid through a pipe\" hmm\n\n>Each segment inherits its volume from the fluid boxes that comprise it and can hold one fluid.\n\n>Machines can push fluid into a segment at an unlimited rate, and can pull from a segment at a rate proportional to how full the segment is. In other words, if a segment is half full, then the pulling rate is half of the maximum.\n\nMy understanding of this is that you can instantly fill a pipe, but it has a finite volume. Then you can extract fluid from the pipe at a finite rate just based on how full the pipe is. I didn't see anything about multiple machines pulling from the same pipe leading to a lower extraction flow rate, so I guess if there are two output pumps, it sucks at the same rate for each, making it twice as fast.\n\nI guess if you had infinite pumps filling the pipe and infinite pumps extracting from the other end of the pipe, then the middle pipe sections would have infinite flow rate. Interesting.",
            "current \"pressure\" in factorio look more like sand in pipe then pressured gas",
            "And loading/unloading trains",
            "Turning inputs and outputs on and off",
            "Also spliting pipe sections. If you would have pipe of 1000 segments, but have only 200 oil input you will have 0.1% speed of transfering oil. So unles your pipes are full its bettter to segment 1000 pipe segments into 10 of 100",
            "Yeah, real pipes also aren't shorter when they're underground, and pipelines don't need pumps every hundred meters to maintain a high flow rate. The old fluid system was the worst of both worlds. A system that was unintuitive *and* wasn't particularly realistic.",
            "That's my problem too! In a lot of the shown pre-rework examples, the fluid literally has a mind of its own and went wherever it pleased.\n\nI for one am glad to shoot dead this sentient goop.",
            "Yeah, the lightspeed delivery of oil from a long pipeline isn't realistic, but needing dozens of pumps on a long pipeline also wasn't realistic.\n\nI kinda liked how quirky the fluid system was, and that specific opportunity for system mastery being removed makes me a tiny bit nervous, but I think this really will be for the best, especially if I want to build legendary mega factories.",
            "Actually the old system always made me wonder how real pipelines are even supposed to work with any kind of throughput, but that makes way more sense",
            "MechE, I specialize in CFD. The old system had about zero basis in reality lol. It was completely counter intuitive.",
            "Right, I see this a lot with electrical systems in other games/mods that try to be 'realistic'. You either start getting close to right (but usually still quite wrong) and realize the math overhead is generally too much to ask for a game to do and remain performant; or  you pick some level of \"faking it\" that usually doesn't align with reality at all. I have seen few games/mods where something like \"voltage drop\" exists, is actually calculated by some resistance and current AND the loads respond to changes in voltage other than \"I have less total power available\" and even then its always over simplified. A simple motor or resistive load is going to change behavior based on the source voltage, impacting how much current it draws, which impacts the voltage drop, which.... Well I think you get the idea :D And that ignores power factor, generators actually needing to react, frequency changes based on load, and any sort of smart/switching power supply and how it acts.",
            "Not sure I understand your annoyance with the changes. Super long pipes are also super high-capacity. That translates into a much longer \"fill up\" period. Given that sinking from a segment is proportional to how full the segment is, that means that it will take a long time for that super long segment to have full throughput. Using pumps to split up the segments into smaller volumes will make it easier to keep full throughput for downstream sinks. \n\nMy only concern is really about how, as described, I can have an unlimited number of water pumps on a pipe and essentially have an unlimited number of sinks down stream. If my reading of the FFF is correct, then I see that as a mistake. Each segment should still have a segment defined max throughput or flow rate based on the pipes being used. Then the throughput for all sinks is that 'segment throughput' times the fullness of the segment. Each component connected to a segment would also have a throughput and it's flow to/from the segment would be limited to the lower of the component or segment throughput. That one adjustment seems like it would greatly improve the fluids update and leave room for things like larger pipes as they would have a higher max throughput.",
            "I'd buy that >.<",
            "A Wube Lube Tube!",
            "Works in the \"normal\" reddit app. Did they mess up links in reddit ui v3 this bad?",
            "I thought heat was basically a fluid in 1.1 :O\n\nThanks",
            "That's great, I think nuclear reactors would be trivial if you didn't have the issues of shunting heat around",
            "Wonder if i can convince the other GTNH devs to rework our pipes as well",
            "The text is not super clear, but look at https://cdn.factorio.com/assets/blog-sync/fff-416-snake-after.mp4\n\nThe lower tank gets emptied much faster.",
            "Fair enough. I didn't think of the fact that the massive buffer size would indeed create an implicit 'maximum' size for the segments due to the decrease in output out of the segment.",
            "Can we attach circuits to the segments similar how will it work with belts?",
            "If oil fields is still infinite, it seems trivial to just connect it with pipe instead of rails and forget. \n\nAnd connecting multiple consumers also seems trivial with pipes along rails even in worst case.",
            "After initial startup, this buffer would simply fill up to meet or exceed its demands given enough time. Thus this problem isn't actually a problem after a few minutes. The pipe buffer and the machines will reach a sort of equilibrium",
            "Either you just don't care and do it the factorio way by just pushing more fluid into the network or you can put a storage tank + pump before the consumers to circumvent the flow limit.",
            "It'll be great for builds where each input is slightly overbuilt for its output, so the system after a bit is filled with fluid and instantly fills machines as needed. Of course there is a big danger of doing this with oil, since pumpjacks slowly decrease in output over time",
            "You'd just need to isolate the pipes feeding the machines from the bus with a pump. The bus would have a lower % of a huge buffer, then feeding section would be at 100% of a small buffer, then machines won't get starved.",
            "Solved by putting a tank before a pump",
            "Doesn't matter outside of initial startup times; as long as production of a fluid exceeds consumption, the pipe will eventually reach steady state at whatever flow rate is needed.",
            "With the new system, a pipe segment should be able to have unlimited throughput, right?\nYou can have, for example, 20 pumps putting a liquid in and 20 pumps taking out. Nothing would limit the number of pumps",
            "The trick is to open it on 10 separate windows and watch them all equally.",
            "Post quality is legendary, x5 to reading speed",
            "Sorry to hear that! \n\nI would argue that neither the old nor the new system are particularly realistic though. Would have loved to see your implementation.",
            "I think accumulators are evaluated together once their charge levels line up, so they're damn near free.",
            "True, but solar still requires space, and thus active chunks and roboports, radars etc. Nuclear is probably still worse, but I doubt its a big difference as long as you play with biters enabled",
            "Solar requires lots of space, and I believe space has a ups cost.",
            "eh, if you slot a pipe -> tank -> pipe at both ends it should teleport the liquid just fine, only that the throughput will build up over time, but then should stay steady at max until the source is depleted.\n\n\nI think it's that for belts/bots/trains, trains always win on long distances. With the new liquid algorithm, it doesn't seem to hold true for pipes. And I feel that it should. Overall it's a rather minor nitpick, but it should be possible to add some kind of limitation that is only relevant over really long distances.",
            "that's despicable lmao so so so looking forward to 2.0's changes :\\^",
            "I mostly want using reactors as giant heat pipes to not be as encouraged as it is.",
            "Important question/note for expensive fluids (modded or not): When you remove a pipe in the new system, can you please just \"push\" the fluid into the existing segment that's on the map? I really hated loosing fluid when I was deconstructing a pipe segment. Thanks!",
            "Ah, I see, thanks for explaining, that makes sense and seems fairly intuitive (which was my biggest complaint about the previous implementation)\n\n\nThank you!",
            "Because they're one and the same",
            "I thought you were wrong, but going back and watching the animations I see what you're saying.\n\nTo others who didn't notice: with the longer pipe the green bars take longer to come up to max and longer to go down to min compared to the shorter pipe.",
            "Not exactly.\n\nIf you empty a storage tank into a a pipe, the storage tank at the other end does not fill immediately. See the video.",
            "No - I went straight to this solution because I understood it to be better. :P\n\nHaving said that, there are some differences in this implementation and mine, like a maximum fluid rate on a given output, based on the viscosity of the fluid as well as the fullness (pressure) in the pipe.\n\nBut compared to doing things one pipe at a time, this is an enormous improvement.",
            "Not Gregtech, it's pipes still have have directional flow.",
            "ohhhhh thats cool!",
            "Factorio was originally inspired by modded Minecraft",
            "Factorio was initially inspired by Minecraft mods like Buildcraft and Industrial Revolution.",
            "How is this typo possible? The L and the R are so far away from each other?",
            "In the software world it's a pretty good tactic. A LOT of things honestly take less time to do than to discuss, especially if you are just doing an initial pass/proof of concept.\n\nIt's also pretty common. The scout rule is a common one people follow, where you try and leave the code in a better state than you found it, which means making improvements that were not asked for",
            "I have been fortunate so others miles may vary but it seems that asking for permission is kind of permission to fail in this context.\n\n\"You said I could try and we agreed it might fail\" vs \"no one agreed to it but it didn't work\" which is you wasting effort without verifying it would succeed before starting.\n\nBut if you succeed then it is water under the bridge.",
            "As a mechanical engineer, I've often been rewarded for spending a small number of hours exploring and fleshing out ideas, even after the group as a whole decided they were not worth exploring.\n\nKeep delivering high quality work, slightly ahead of schedule, and they'll let you go play in the lab or just doodle in your CAD environment one afternoon a week.",
            "It's very common in mechanical engineering. It's a huge hassle to get buy-in before a proof of concept, it's much easier to just do it and sell it afterward.",
            "It's common in a lot of engineering disciplines also. The getting reprimanded part is generally always there, but the extent depends on how successful the person was, and what ramifications their actions had.",
            "It is DLC though. It will simply be released in conjunction with Factorio v2.0",
            "Those are 2 different things. Every user will have Factorio updated to 2.0, with many changes including fluids, bots, trains etc; and then you can buy the SA DLC on top of that, with post-rocket experience, new planets, new science, etc.",
            "I'm hoping it's an unreleased building, but it could also be old concept art for the biochamber from FFF414",
            "Shipping molten metal didn't even occur to me. Probably because of how cursed it is.\n\nThe most efficient setup is going to be smelting the ore directly from the mines and then transporting it as a fluid. Not realistic, but efficient.",
            "I think at the time you initially contacted me (2016, wtf where'd time go?), it was nominally multiple mods but still often referred to as just Thermal Expansion.",
            "ye, i do as well.\n\ni remember when the only storage cube required 1000mB of destabilized redstone so you needed to make power and the crucible smelter thingy before having energy storage.\n\nthat was back in 1.4.7 i think, when the energy was Blue and called MJ",
            "I'd say so, finagling with pumps and pipes for oil processing is a big reason why automating blue science is such a mental hurdle. Now I'll be able to build nuclear reactors and refineries without having to use complex pipe layouts and an array of circuits to run effectively.",
            "I wonder if they’ll change heat flow to work the same way. Using nuclear reactors as giant heat pipes is kind of silly.",
            "I still want a vanilla way of making reactors more than a 2 by X configuration. So stupid high GW reactors can happen without making a giant line.",
            "The ups impact of nuclear is currently quite exaggerated. \n\nA long time ago it was kind of slow, but that’s not really true anymore. The stigma persist though.",
            "Solar still has a UPS cost of ~0 and so will still be the power solution of choice for the serious UPS maxxers, but this will definitely make nuclear significantly more palatable for normal megabases.",
            "Either way, for casual playthroughs, water was one of the biggest challenges of nuclear (and the reason why most of them were on landfill on water), and now it's trivial and you can supply huge reactors with a single pipe.\n\nAlso, heat pipes deal with some of the same problems that normal pipes do. It is unclear how much throughput the pipe has and how long can it be to not waste heat. Changing them in the same way as pipes would definitely be an overkill, as it would make nuclear super simple and kind of stupid looking, but together with what I described above it makes me think that there is a chance for a nuclear rework\n\nEdit: one way to still force sensible designs while changing heatpipes to share temperature like pipes do contents, would be to add heat dissipation for heatpipes, so you would still want to minimise them. The only disadvantage I can think of is that it would be kind of awkward to have heat loss for heatpipes but not for fluids",
            "I imagine heat pipes are very similar in code to fluid pipes",
            "Pretty sure it's the water/steam fluids.",
            "UPS optimized nuclear plants already use close to zero water pipes, and are more UPS efficient than solar if you don't just ignore the infrastructure to create the solar fields (unless you play creative mode obviously). This update shouldn't change much, because the remaining fluid entities are machines, so will still be simulated individually.\n\nBut of course, it should make non-optimized designs much better.",
            "~~Heat pipes use the same fluid system as normal pipes moving water, this should benefit them too~~\n\nEdit: or not, rip",
            "You could have both pumps on one end or as you described, it won't matter. The only thing to consider now is if your consumers are attempting to pull more than 12k/sec/pump. If they are, the pipe segment won't stay completely full. As it drops, the consumers rate of pull also drops until they reach an equilibrium.",
            "No, because the entire segment is now considered as a single unit.",
            "limited *per machine* not overall draw from a single network, no?",
            "I mean in a simplified manner.  I do *not* mean a full fluid dynamics simulation.  As in, splitting predictably at a junction, or being pressurised along a length provided there's enough fluid actually there.  Especially if it's a gas.  The puzzle I'm referring to is laying out in-game pipework, not calculating laminar flow or turbulence.  I studied theoretical physics, I'm well aware of how unsolved that is!",
            "Navier-Stokes might not have a solution, but we don't need to fully solve it to get *realistic enough* fluid mechanics in Factorio. But the system would be horribly inefficient and would result in horrible UPS.",
            "First of all, I think we both know \"the puzzle\" here is \"the fluid logistics puzzle in the game.\"\n\nMy biggest issue with the current/previous/legacy is the whole \"we want realistic fluids (to some degree) but it's JUST volume with \"flow from high to low\" (with a slightly incorrect logic to the amount of resulting flow). The might be how sewers and such work, but isn't remotely how pressurized pipelines with pumps work. Now I know for gameplay reasons you need to be able to empty pipes during normal gameplay and that we similarly want pipes to store a bit of fluid so that also doesn't line up with \"realistic fluid\". That being said IF we were trying to keep a flow based system we would need at least a 2nd value like pressure or flowrate or something that sources and pumps impart on the fluid.",
            "*our* pipes, yes.",
            "ONI even has “magic” Anti-Entropy Thermonullifiers, but they remove so little heat that it’s basically impossible to play without abusing steam engines to delete heat.\n\nThe non-intuitive yet essential mechanics really drag ONI down for me.",
            "The way fluid decides which direction to go when multiple inputs and outputs are involved is not very intuitive and not really realistic either. Gas and fluid both do the \"packets traveling in blobs along the pipe\" thing, and often will deadlock or get stuck if the network is poorly designed. Overall I did not like the mechanic very much and it took me a while to understand what to expect and what designs will \"deadlock\". I do love ONI though, I just kinda wish that aspect of the game was better :)",
            "I very highly doubt they'll become a \"standard\" solution, unless you're trying to build a hyper-compact, fixed-production build. In any \"normal\" playthrough, expandability is paramount, and it will always be easier to simply build another endpoint to a single-fluid pipe system than it is to deal with circuit timings.",
            "Nice, if I were doing software at Wube I'd be thrilled about that, it's one of those \"yippee, lets delete some things I never liked\" moments",
            "Which isn't sushi, it's batching.",
            "Can't wait to flow hypergolic oxidizer and fuel through the same run line!",
            "Fluid city blocks incoming. Add a mod that liquefies all items/materials and you'll have a very cursed megabase",
            "That's my thinking, there's nothing (currently) that (ideally) allows a given pipe segment to reverse its direction. Every endpoint is either input or output, exclusively, so at the very least, the segment between the endpoint and the next junction is a fixed direction.",
            "The developer did say \"Yes\" in quotes. The pipe network has no direction of flow, so what the windows show is where the demand is. So in the end is does visually simulate a direction of flow.",
            "They mean instead of needing multiple separate water/steam pipes in a reactor. You now use just 1 pipe going into all the heat exchanges and 1 pipe taking all the steam away.",
            "True but I rarely use fluid tankers. It's much easier to build a pipeline once and be done with it. Even more with this update.",
            ">real pipes also aren't shorter when they're underground\n\nThis is one of the few subreddits that I'd go to this level of pedantry, but the distance travelled across the surface of a sphere increases based on radius. The further underground you put a pipe, the shorter distance that pipe would need to travel, since it's closer to the centre of the Earth.\n\nIn the real world, we're talking distances too small to measure (so you are correct for all intents and purposes), but I thought it was amusing that actually, in the real world, you can use a shorter pipe underground.\n\nAs to how much shorter, the way to calculate the circumference of the Earth is 2 * radius * Pi. If the pipe is 1 meter further down and covers 1/400,000th  of the circumference (we will round this to a neat 100m, but the actual figure would be around 100.088m), the difference in length required would be somewhere around 0.0001 of a meter (e.g. around 0.1mm shorter). Of course, you'd spend more pipe getting the pipe underground and back up again and wouldn't actually save that much over a short distance. You need to be talking multiple kilometers of pipe (or kilometers underground) before you have to start factoring the curvature of the Earth into your calculations.",
            "I might be worried if the expansion wasn’t clearly bringing waaay more optimization tasks. Setting up a new recycling loop on a trash planet is way more interesting than trying to remember what order you placed those pipes 30 hours ago.",
            "I don't think this is the good kind of system mastery. It's not really mastering an intended, well designed system, more like mastering - and often dealing with unexpected behavior of - quirks of a hopefully good enough system maybe.",
            "If the oil is the same in the whole pipe it don't matter how long it takes to travel. If you push in one end it will quickly push in the other to. So it will anyway react fast.",
            "Rest in peace legendary pumps.",
            "> lightspeed delivery of oil from a long pipeline\n\nMy understanding is that with long pipes/segments having a much larger volume, getting the pipe/segment full (maybe we equate it to pressurized?) will take a lot longer. And given that output throughput is proportional to how full the segment is, having an ultra long pipe/segment doesn't seem like any kind of exploit.",
            "Heat is not implemented as a fluid, however steam is. Steam is very hot (especially nuclear steam), so this may have been the source of your confusion.",
            "Same. Swear it was specifically referred to that way",
            "Shame it kills UPS though",
            "Yeah, but the lower target tank is full a bit later. I think it's empty faster cause the longer pipe can hold more fluid, but getting that into the target also takes longer. So throughput, as in \"how much fluid moves how fast from A to B\" is higher in the smaller pipe. Not \\_much\\_ higher, but higher.",
            "If you bored, you can always try out the idea with old versions :D\n\nIIRC, there was no fluid wagon yet in v0.14.x so you had to make more or less big network just like you suggest. And yes, it was awful, fluid wagon was welcomed like a hero we _really_ needed.",
            "The way I read the FFF, you can arbitrarily increase the output speed by spamming pumps that output into a smaller segment. The large segment stays low, the small segment stays full, the consumers on the small segment run at full speed.\n\nOr just wait for the pipes to fill, if the fluid is cheap (water, oil, maybe others).\n\nFor players who aren't going for a rail base, pipes will continue to work just fine - in fact, they should work better than before. Remember when we needed to stamp nuclear reactors into the middle of a lake? It appears that those days are gone.",
            "we can already connect circuits to tanks, and with how balanced the network will be, those will be even more accurate readings",
            "Unless your input vastly outweighs use I'd imagine a \"mega base spanning single pipe network\" would take more like *hours* to fully buffer unless you also shut down demand. Then even once it is up and going you'd have the risk the any problems result in the massive buffer draining until you finally notice and then fix and wait for it to fill enough again to hit steady state.\n\nit's *possible*, it just sounds like a bad idea :)",
            "I don't think so? I'm not sure whether they've changed fluid transfer under the hood in the same way that item transfer has.\n\nIf the \"move more than 1 stack per tick\" fix has also been applied to fluids then I think the throughput probably is unbounded, if not then it'll be limited to `min(input_size, output_size)` per tick.\n\nFor example, if you have 4 pipes, then a pump, then a tank, you would expect the max throughput of the old system to be `100*60=6000` fluid per second, the max throughput of the new system should be `400*60=24,000` fluid per second.\n\nEdit: I don't know if the FFF made it clear, but this does imply that max throughput can be increased significantly by adding a tank anywhere along the section.",
            "Automate and optimize ~~time wasting~~ adoration!",
            "Spiffing Brit, is that you?",
            "Correct. Which in reality with a large unchanging solar setup, means they very quickly fall in to being just as cheap as the solar panels.",
            "Correct. In the usual megabases, power production is just a fraction of the update time, and solar with additional roboports, radars or even biters isn't much more ups efficient than nuclear. One can spend hours covering a continent with solar panels and gain very little.\n\nBut this community likes to advocate \"0 ups\" solar power, and people keep making bad decisions because of it.",
            "It has a memory cost but afaik there are no UPS costs; in a chunk with only accumulators and solar the only calculations that are happening is pollution (but unexplored chunks with pollution are generated anyway so that doesn't matter),.",
            "That's how it works in 1.1 already and continues to work with the new system.",
            "I tried the first working version of the game from a FFF and the files were actually called \"Energycraft\". You had a wooden axe, and the controls were like Minecraft: left click to break, right click to interact, which was really weird to adapt to.",
            "Is there a Minecraft mod that plays like what factorio turned into? \n\nResource harvesting (not the same as vanilla Minecraft), shipping items by train, and so on? Translated into 3D I guess it'd also be similar to Satisfactory, but in a voxel world you can manipulate.\n\nI already know there's been mods to craft items automatically.",
            "> Industrial Revolution.\n\n\\*IndustrialCraft",
            "L and R are next to each other on a Dvorak layout.",
            ">scout rule\n\n..which means breaking stuff where no one is expecting that\n\n\n\n\n/s",
            "There are some things that will be available for everyone, like the bot AI rework. I assume this will be in vanilla 2.0 as well",
            "Yes, I SA and 2.0 are different things. But my emotion applies for both. I initially expexted SA to be an expansion - for many games it would be adding more of similar content that you already have - a red and blue planet, black biters, 2 new levels of weapons and science packs, new faster machines, etc and maybe a few new mechanics - now you have ships or religion or whatever. And yes, there would be changes to base game from that but minor ones like some of the recepy changes would apply to base game and maybe some of the new machines or so.\n\nBut not for Factorio. They are actually making 2.0 as making a new version of the game. It's a logisgics game and they are changing many of the core mechanics - trains (not just bends but conditional orders), bots (not just pathing but smart prioritization), now fluids. And it's really cool.",
            "Oh this makes me so much happier. I have 1k+ hrs in factorio but with each new FFF I just do not have time for all this Space Age shenanigans.\n\n\nThe more I read about shipping asbestos from planet xebulon to planet smegma so you can increase your shimsham production the less interested I became. I want new trains and fluids etc but I don't need or have the time to earn a PhD in factorio... My masters is taking long enough! ",
            "Everyone keeps saying this, but do we have any confirmation that it's true? I think people are assuming that 1 ore will equal 1 unit of smelt, which feels like a big assumption to me.\n\nIf the standard recipe chain is something like 1 ore -> 100 smelt and 80 smelt -> 1 plate, a fluid tanker would only equal out to 312 plates. You'd still be incentivized to haul solid ore home to smelt and forge.\n\nI use those numbers specifically because of Factorio's connection to Minecraft mods, where the base fluid metal recipes usually work out to 1 ore = 100mb = 1 ingot.",
            "Still is.",
            "I shouldn’t be surprised to see u/KingLemming in this sub.  Thanks for all your work on modded MC, can’t wait to see new Thaumcraft!",
            "More fun facts: MJ (Minecraft Joules) is even older than that and was the energy system of BuildCraft, which Thermal Expansion extended upon, but eventually they split it off entirely into Redstone Flux, which later evolved into the basis for Forge Energy, if I recall correctly.",
            "At least in 1.1 pipes and heat pipes use the same algorithm for propagation, I think. So yeah, seems likely.",
            "In that case, my Renai Transportation senses are tingling, methinks a drone-compatibility module for machines might come about at some point through science from another planet and allow direct fueling and waste retrieval from reactors that aren't at the edge of the block, like how Renai, I think, lets you throw fuel cells into the reactor hatch and the ejector hatch throw spent cells onto a distant belt.",
            "Solar and accumulators are O(1), which is hard to beat. They're also way simpler and easier to work with. Granted, you need a lot of space.",
            "Oh I agree, you can reach 1000 SPM or more without nuclear ups being a big issue but for very big SPM numbers nuclear is more expensive than O(1), people do tend to exaggerate thinking nuclear is not worth it if you plan on a base bigger than a few GW big which is just not true.",
            "Eh, it's mixed. A lot of the \"popular\" stamp down BP designs for nuclear are some flavor of bad to terrible. Especially most/all of the \"infinitely tillable\" ones. If you build decently designed ones and make sure the water intake isn't insane they are not TOO bad.",
            "To be fair, nuclear has been palatable for megabases that are ~2700spm and smaller, at least  since I've been playing (only since 1.0). \n\nBut I get your point. \n\nMy point is solar should be used for the \"no fuel needed\" aspect instead of always being a UPS discussion from a gameplay sense, and it seems like this is a step towards helping that.",
            "My concern is that some planets are just gonna be ass with solar.  Power generation sounds like it's going to be more varied by necessity.  Like fulgora is probably going to center around gathering it from lightning at night.",
            "They are not.",
            "Except everything required for (non-networked) solar fields is also required for space science, so it isn't additional infrastructure.",
            "Once solar is built it has a ups cost of zero, people build for that steady state. Similarly you wouldn’t say that modules are ups inefficient because if the massive infrastructure required for tier 3 modules.",
            ">and are more UPS efficient than solar if you don't just ignore the infrastructure to create the solar fields\n\nThe cost and time to create a solar field is negligible once UPS is the primary concern so there is no way nuclear beats solar in UPS. Obviously before you have the resources to do that or small enough base, nuclear is fine as UPS isn't the primary concern and is cheaper.",
            "I don't think the packet routing is any more complicated than Factorio's item routing.  I guess it may be slightly more opaque since junctions are implicitly created instead of explicitly (splitters), but I never found it too confusing.",
            "https://mods.factorio.com/mod/LiquifyRawMaterials\n\nhttps://mods.factorio.com/mod/LiquifyIntermediates\n\nhttps://mods.factorio.com/mod/LiquifyScienceandLab",
            "lol fair enough. However, you'd have to dig incredibly deep before you get the type of distance reduction you see in factorio. In fact, at the distances implied by factorio, the undergound pipes should be *longer*, as the sprite implies underground pipes go straight down, which adds distance.",
            "What makes you think that the world is round?\n\nSigned, the Flat Nauvis Society.",
            "This is neat!",
            "The best kind of correct",
            "Yeah, I think sushi pipes mastery >>>> existing fluid system mastery from a gameplay perspective.",
            "> I don't think this is the good kind of system mastery.\n\nAgreed. And it lets you trade mastery of the old jank system for being able to build functional sushi pipes, which is an awesome kind of mastery.",
            "I agree it's not important, but I thought it'd be interesting to take a look at some actual speed of sound info for reference.\n\nMost types of momentum/force travel through a medium at a speed equal to the speed of sound in a medium - think of the speed of sound as the natural speed the molecules knock together to propagate a wave.\n\nWhile the speed of sound varies by material (and so I couldn't tell you what it is for oil), a good ballpark of figures is: ([More detail](https://www.rshydro.co.uk/sound-speeds/))\n\n* Very Hard, dense solid (e.g. hard metals, most glasses) - 2,500 - 3,500 m/s\n* Less hard/dense, solid metal (e.g. Copper, Tin, Gold) - 1,500 - 2,500 m/s\n* Other solids (e.g. plastics) - 500 - 1,500 m/s\n* Most fluids (near room temp.) - 1,000 - 1,500 m/s\n* Most Gasses - 150 - 500 m/s\n* Air (Room temp, 1 atm) - ~340 m/s\n* Hydrogen (room temp, 1 atm) - ~1300 m/s\n\nI'd guess the speed of sound in crude oil to be around the 900 - 1,300 m/s mark, but the speed of sound in a fluid does vary based on pressure. It's dense and some crudes require temperature and pressure to act as a liquid. Given Factorio's scale of one tile per meter, we're talking issues of less than a second difference in all but the longest pipelines.",
            "They might still be needed for the throughput of the pump itself?",
            "for now; as long as fluids don't 'rot'/cool.",
            "It's been a while, but didn't we just use barrels back then? They came before fluid wagons if I recall correctly",
            "My nullis base was one big network. It was manageable. Of course in that mod pack has valves and pumps and higher throughput and sort of fakes pressure as well, all of which were a substantial improvement over vanilla.",
            "> it's possible, it just sounds like a bad idea :)\n\nWhich of course means it will be done within hours of release...",
            "You could just not place radars in solar fields, it's not as if there is anything you need to look at.",
            "After playing Minecraft for years, when I first started I switched my Factorio mouse buttons to match it and have played that way ever since. Not sure why they changed it around in the first place.",
            "Yeah, there are modpacks out there designed to be like factorio - feed the factory and manufactio are directly inspired by factorio, but there are a huge swath of automation-focused packs out there",
            "A combination of Mekanism and Create are my go-to for a Factorio vibe. I specifically don't let myself use any teleportation blocks, so Create becomes essential for trains to haul my ores back to base. Plus, Create factories just look so damn cool while they work.",
            "> scout rule\n\n...which means brother, I hurt people",
            "> There are some things that will be available for everyone\n\nPeople always say that like there are people that own factorio and won't buy SA.",
            "I feel somewhat the same: 2.0 features alone are enough to get me excited, and then there’s the DLC as well.  With limited time (retired so that’s 24 - sleep - eat - ablutions) I’m going to have to schedule two separate runs. First for 2.0 by itself to savour the new game engine features, and then Space Age for content savouring. I’ll buy it all up front of course.  (I’d buy now if I could…)",
            "Planet smegma, my god\n\nPass the bleach will ya",
            "Yeah, that's true.",
            "ye, back then Buildcraft and IC2 were the leaders in energy units.\n\nthen Thermal switched to RF, buildcraft followed in 1.12.2, but then split off to MJ again.\n\nand now a lot of mods just use FE (or allow conversion between units)",
            "Devs confirmed down below that the heat manager wasn’t changed. Fluids only.",
            "It’s not a matter of beating O(1) for the actual generation of power. the performance hit for nuclear is typically trivial.\n\nBut on the space front, if you have to expand into new blocks to accommodate your solar panels then you are taking an ups hit from solar.\n\nYou should pick what you prefer and forget about ups when deciding.",
            "Playing modded minecraft gave me trauma related to \"solution x is more efficient, but i'll use solution y because it's less laggy\". Glad to not have that in factorio.\n\n\n(looking at you,  AE2 crafting card)",
            "Bo womp",
            "Curse you! Do Heat Pipes receive these changes too? Or you can't say?",
            "That's not how any of that works. UPS doesn't care about how unique your machines are, but about how many of them are running.",
            "Oh totally. I just thought it was an amusing turn of phrase. After doing the maths, the distance is larger than I expected (0.1mm over a 100m pipe is not nothing - that's around 1mm per km of pipe), but it's still too tiny for most real world engineers to need to consider. Just make sure the pipe is long enough and then use some sort of flexible joint (or cut it to size) at the end. The difference in pipe length would be far less than the difference in pipe angle - no pipe over any length will be perfectly straight.",
            "Does anyone actually have proof that Nauvis is round?\n\nShadows are the same size, no matter what latitude they're located.\n\nRadar range is a square, which suggests a really weird shape for the planet.\n\nThe rocket goes straight up instead of following a hyperbolic path.",
            "Neat! Thanks for pulling some actual numbers here... So post 2.0 lightspeed fluids is actually closer to the right speed than pre 2.0 fluid box fluids...\n\nAlso, I'm in firm agreement w/ Raiguard that gameplay > realism :)",
            "I'm kinda dreaming of going for a 14.4k Megabase (stacked green belt of each science), so yeah, might need a legendary pump still 😂\n\nEdit: I guess if it's full of stacked legendary science that's 36k SPM...",
            "Barrels *existed* but I gave up on them. They sucked. World wide pipeline sucked way less.",
            "True, that was an option, but i remember pipes was often used first -just like we all start with stone furnaces. Barrels came in later, after you already dealt with oil setup and was more or less satisfied and looking for optimizations",
            "\"So we had to move to 256bit floats due to players building insanely large pipe networks\"",
            "In Minecraft you have to mine things and then place them. So it tends to have more mining and less placing. Factorio is mostly just placing stuff.",
            "omg I thought I was the only one!",
            "I'm sure there will be people like that (not me though :) )",
            "That's a shame. Makes reactor design kind of wonky.",
            "So far nothing has changed about heat pipes. They work how we want them to and don’t have the issues mentioned in the Friday Facts.",
            "You're right. We're probably on a 4D, Hyper-sphere or hyper-taurus. No other shape makes sense!",
            "Fluid dynamics is actually a bit more complicated than simple wave propagation and not something to get into in an actual Factorio post. We often throw hundreds of hours of digital modelling into understanding how fluid might flow down a river or through a large pipe,  and the speed of fluid delivery is relatively unpredictable if the load in a pipe is unknown. In real life, we try to run pipes downhill where possible and rely on gravity to take the fluids there. Factorio has no way to model this (or uphill pumping), as you might imagine, the speed the fluid is transferred varies based on the slope of the hill, the diameter of the pipe and even the friction between the pipe and the fluid.\n\nI've not looked at gas or pressure-based systems in much detail. While the speed of sound in a fluid is relevant to dictate the maximum possible speed of transmission and action, actual flow rate will always always be an order of magnitude slower.",
            "heat transfers much slower, so they have a lot more to work with before it would become and issue in the way it had for fluids. Sometimes wonkiness is to be appreciated so there is not just one design everyone uses.",
            "Heat transfer is almost easier because you don't have pumps (at least not in the way that fluid pumps worked). ",
            "The slow gradual movement of heat is much more expected than the same in a long water pipe – that is why the same (similar?) system didn't hurt as much.",
            "Good, it would kinda suck if they had the same tempeature everywhere and you didn't have those nice glow gradients anymore.",
            "> don’t have the issues mentioned in the Friday Facts.\n\nHmm, that's strange to me then. Doesn't it boil down to the same problem? Flow is dictated by the temperature difference, just like volume difference in pipes. The \"volume\" in heat pipes is the difference between lowest and highest temperature in adjacent pipes.\n\nI may just me missing it right now, but what's the key difference between the two then?",
            "> They work how we want them to\n\nPeople using reactors as giant heat pipes is the desired behavior?",
            "Heat pipes will generally be much less complicated in their arrangement, shorter in length, and fewer in number, than a given fluid pipe setup. Consider how many heat pipes are present in a typical 2x2 reactor setup vs a refinery setup that can run any decent sized factory. There will be way more pipes and junctions in the refinery setup.\n\nPresumably any performance impact of the heat pipes is small enough due to typical scale to not be worth making massive gameplay-impacting changes to.",
            "Building them directly next to each other gives bonuses, so yes.",
            "No, as in using unfueled reactors just to transfer heat. Not obtaining any sort of bonus from them, just thermal transfer."
        ]
    },
    "Accidentally left an open chest of naquium heat pipe longs, there goes 56000 naquitite plates...": {
        "title": "Accidentally left an open chest of naquium heat pipe longs, there goes 56000 naquitite plates...",
        "score": 154,
        "url": "https://i.redd.it/4uhkd7bt528d1.png",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Oh well, time to create the biggest reactor SE has ever seen",
            "You will use them in Foenestra energy setup. Like half of the for sure, so dont worry :)",
            "https://mods.factorio.com/mod/reverse-factory",
            "You’re laughing? JugglingMaster accidentally made 56000 naquitite plates and you’re laughing?!",
            "Nice",
            "There's a mod for that: https://mods.factorio.com/mod/chest-auto-limit",
            "I just use a blueprint with a blue chest and either a red or purple depending on use. With an inserter each. Slots limited in red or purple. Edit forgot to add the one with the purple chest is limited by a circuit wire between chest and inserter"
        ]
    },
    "2.0 Sushi Pipe Controller": {
        "title": "2.0 Sushi Pipe Controller",
        "score": 83,
        "url": "https://i.redd.it/2zpzd0ikr28d1.png",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Don't show this to dosh",
            "Blueprint:  \n[https://paste.ee/p/Se1zi](https://paste.ee/p/Se1zi)\n\nExplanation: With the Fluid rework for 2.0 Sushi Pipes become usable. This build emptys and fills the main base sushi Pipe (Connection to base at bottom) once a second with a new fluid.  \nEach fluid need to be connected to a storage tank farm, with these connections being at the top of this build.  \nThe emptying process is done in 2 stages, to get a greater amount of pumpes working. The first stage is the bottom half, emptying the main base sushi pipe into the 2nd stage at the top where the fluid get sorted to their individual storages. This 2 stage apporoach greatly increases the pipes with access to the main sushi pipe thus empting it faster, and can get away with few pipes for individual fluids, becasue the 2nd stage sushi pipe segment is much smaller thus the pumps can work faster.",
            "What in the seven hells is this….",
            "r/factoriohno",
            "The undergrounds dodging pipes of the same fluid are so cursed.",
            "Ah finally my refinery train loading stations will be legendary",
            "perfect XD, I'm pretty sure there will be some throughput limit, it would be weird of there wasn't one",
            "add a mod that turns all resources into liquids",
            "For when paste.ee inevitably nukes your blueprint:\nhttps://factoriobin.com/post/X5_ShnjA",
            ">paste.ee\n\nyou people continue to surprise me with random text uploading sites that i've never heard of.\n\nplease just use factorio specific sites like [factoriobin](https://factoriobin.com/), [factorioprints](https://factorioprints.com/), or similar to upload blueprints. as they are way less likely to just randomly delete data and have some nice extra features like visualizations and item counts",
            "which ones?",
            "Legendary quality, or legendary confusion?",
            "if I read the new FFF correctly: there is no more throughput in pipes when 2.0/SA launches. it hurt UPS too much, it was unintuitive, over complicated, didn't make any sense sometimes (why does fluid move faster going on direction than the other? why does the order in which you placed the pipes matter??? that sorta thing), and mot importantly it didn't keep up with the changes 2.0/SA are bringing (such as quality).\n\nso now pipes/segments of pipes act instantaneously instead of the weird fluid dynamics the game tried offering. No more pumps every 8-10x pipes, no more worrying about how one machine is somehow hogging all of the juice, despite there being enough for the others, no more worrying about throughput, etc... It's just going to go from source/tank to immediately what's pulling it, making working with fluids SO much easier.",
            "There won't be.",
            "[https://mods.factorio.com/mod/pneumatic-transport](https://mods.factorio.com/mod/pneumatic-transport)\n\nAnd if you want to see how it goes, [DocJade did a playthrough](https://www.youtube.com/watch?v=VWva65IWHcw)",
            "The whole system? The two stage pipes to let you run more pumps before running fewer pumps on a smaller pipe system... The two sushi pipes are usually the same fluid but deliberately disconnected.",
            "Why not both?",
            "I mean yeah but it would still be weird to have unlimited throughput, it definitely makes things much easier tho, and now that I think about it, it gets rid of a bunch of nuclear lag making it more viable for late stage megabasing",
            "Honestly one of the greatest changes in 2.0 yet",
            "They are disconected, because the speed at which pumps pump is dependent on how much fluid is in the pipe it's pulling from. So many pumps pump from the main sushi pipe which will always be almost empty, creating a high level in the 2nd pipe, which can then be sorted with fewer pumps.",
            "Yeah, exactly. That is cursed."
        ]
    },
    "Rail Blueprints": {
        "title": "Rail Blueprints",
        "score": 84,
        "url": "https://i.redd.it/4o588chli18d1.png",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Some prefab rail things I made for my up coming megabase.\n\nI'm having issues posting the string for the book (3426969 characters long) so if you want the book I'll have to send a text document.\n\n  \nEdit: [https://drive.google.com/file/d/12t-YIm-hdCxXl6xTOkEkBBEKTnS-CcRk/view?usp=drive\\_link](https://drive.google.com/file/d/12t-YIm-hdCxXl6xTOkEkBBEKTnS-CcRk/view?usp=drive_link)\n\nEdit 2: I realized that the link was restricted access, it’s now publicly accessible.",
            "hmm, I think I will save this blueprint and never build it.",
            "Gee this reminds me of Game of Life",
            "Awesome, thank you very much",
            "How can I bookmark this post :))))?",
            "Have you tested those stackers? When stackers are different in length, it can lead to situation where train tries to go to already occupied shortest stacker, blocking it. It's the reason why usually exit and entrance are placed diagonally, to ensure all stackers are of the same length.",
            "Now add solar to them all.",
            "Try pastebin for blueprints. I think there is also a similar site dedicated to factorio.",
            "Can you send it to me please?",
            "doesn't a chain signal solve this?",
            "only if you signal wrong.",
            "The factorio bin website I tried to used has a character limit of 2000000 and pastebin has a string limit of 512KB (the string is 3.24MB)",
            "don't use pastebin, ever.\n\nthey actively delete things like factorio blueprints",
            "Chail signal allows train to reroute. But if train occupies shortest stacker for a small amount of time, incoming train can still decide to go into occupied stacker",
            "Pastebin also auto deletes Factorio blueprint strings. It recognizes them as encoded data, but it can't figure out what kind and silently wipes it.",
            "Could you do the blueprints seperately on factorioprints?",
            "they don't if you register/login\n\nthough I've never pasted a blueprint there yet",
            "They have for me in the past"
        ]
    }
}