{
    "Daily Questions & FAQ Megathread June 22": {
        "title": "Daily Questions & FAQ Megathread June 22",
        "score": 0,
        "url": "https://www.reddit.com/r/ffxiv/comments/1dlrfzc/daily_questions_faq_megathread_june_22/",
        "content": "## Hello, all! We hope you're enjoying your time on FFXIV!\n\nThis is the post for asking ***any*** questions about FFXIV. Absolutely any FFXIV-related question: one-off questions, random detail questions, \"newbie\" advice questions, anything goes! Simply leave a comment with your question and some awesome Redditor will very likely reply to you!\n\n* Be patient: You might not get an answer immediately.\n* Be polite: Remember the human, be respectful to other Redditors.\n\n**Could your question already be answered?**\n\n* [Check the FAQ!](https://www.reddit.com/r/ffxiv/wiki/general_information/faq)\n* [FAQ: Why can't I create a new character?](https://www.reddit.com/r/ffxiv/wiki/definitive_faq#wiki_why_can.27t_new_characters_be_created_for_the_server_i.27m_trying_to_join.3F)\n* [Search the subreddit](https://www.reddit.com/r/ffxiv/search?q=&restrict_sr=1&sort=new)\n* [Browse the subreddit wiki](http://www.reddit.com/r/ffxiv/wiki/)\n* Use Google to [search the subreddit](http://www.google.com/?gws_rd=ssl#q=site:reddit.com%2Fr%2Fffxiv+Search_Terms_Here) or [perform a general search](https://www.google.com/)\n\n**Feeling helpful?**\n\nCheck this post regularly for new questions and answer them to the best of your knowledge.\n\n[Join the Discord server](https://discord.gg/ffxiv) and answer questions in the #questions-and-help channel.\n\n**Protect your account!**\n\nMinimize the risk of your account being compromised: Use a strong & unique password, enable [one-time password (OTP)](https://www.square-enix.com/na/account/otp/), don't share your account details.\n\nRead our [security wiki page](https://www.reddit.com/r/ffxiv/wiki/general_information/security) for much more information. **Free teleports**: Enabling OTP will not only help to protect your account but it'll also allow you to set a free teleport destination!\n\nFor your convenience, [all daily FAQ threads from within the past year can be found here.](https://www.reddit.com/r/ffxiv/search?q=title%3A%22Daily+Questions+%26&+FAQ+Megathread%22+author%3AAutoModerator&restrict_sr=1&t=year&sort=new)",
        "num_comments": 54,
        "comments": [
            "Are there any rings that are on the index and middle finger?",
            "I have a question regarding the side quests. I wanna speed lvl viper to 90 and have decided to try and do the 29 side quests (leaving 1 for the actual viper quest). My question is, does the lvl of the quest matter, such as can I do a lvl 90 side quest and turn it in on a lvl 80 viper?",
            "So, from my understanding it's supposed to be a better return overall to donate allagan pieces and clear demimateria for Doman Restoration, but given the donation limit is it actually worthwhile to hold onto them for that?",
            "Has anyone begun receiving their DT collectors boxes yet? Haven't gotten a shipping confirm yet on mine.",
            "is there someplace I can find like a text write up of the Ninja rotation? I KIND of understand it, but I'm definitely not playing the class efficiently enough",
            "How many poetics does it take to buy tomestone gear? Trying to figure out if I'll have enough tomes to buy the 660 gear when DT launches.\n\nI'll just need the rings and every armor piece except the boots. I won't need the weapon because I'll be using the Manderville.",
            "I've been kind of on autopilot when it comes to crafting, and I'm not completely sure what HQ% actually does. I obviously don't need it to be at 100% to get a HQ item out of it. So is it a chance for the finished item to be HQ, or is there a threshold that guarantees it?",
            "So is there a reason why ffxiv is literally the only MMO to not have servers located on the east coast or at least toward the middle of the U.S.?",
            "2 questions- When are they giving us the free Fantasia? And when do the graphic updates kick in? \n\nI’m assuming it will be when DawnTrail comes out but I wanted to double check.",
            "How long can we expect worlds to be very congested with long queue times? \n\nIs it just for a couple days at early access launch and then again for another couple days at full launch?  Or will it last like, a whole week or something?",
            "Things in the ring slot are index finger only, besides the eternal bonding one which is ring finger.\n\nThings in the *hand* slot may have a ring included on one or more fingers sometimes, including the middle finger, so combining one of those and a normal ring would get the result. But it'll be specific to that glove, and I can't off the top of my head say what piece you'd need for that as I generally avoid all rings.  \nFirst thing that comes to mind are an Aiming type glove from one of the Ivalice alliance raids, which is rings on the middle and ring fingers.",
            "I know the Ivalician Sky Pirate's Plunder are \"gloves\" that look like rings on the middle and ring finger, [here's someone's glamour where you can see it pretty well in the pics.](https://ffxiv.eorzeacollection.com/glamour/99494/blue-cherry-sunshine)\n\nAs for the index finger, I could be wrong but I thought most rings in the game were shown on the index finger.",
            "Most rings are already on the index finger. Only exception I can think of is the Eternity Ring, which fittingly goes on the ring finger. There are hand gears which have additional rings, which can be on the other fingers. Off the top of my head for middle finger, there's at least two options. [Free Spirit's Ringbands](https://na.finalfantasyxiv.com/lodestone/playguide/db/item/0a5d450f27c/?patch=) has rings on the middle and pinky fingers of both hands.  [Street Handwear](https://na.finalfantasyxiv.com/lodestone/playguide/db/item/2237c469e30/?patch=) has rings on thumb, middle, and pinky finger of the left hand only.",
            "you must be at least the level of a quest to turn it in - so a level 80 VPR can turn in up to level 80 quests.",
            "Most side quests in recent expansions have a level sync label on them, meaning that if you're anywhere within the range of the expansion then you can turn it in. So any sidequests from EW can be handed in at level 80.\n\nNote that it's also not worth holding onto them for later, because while the xp reward does scale to your level, it doesn't scale _well_, so gives a much better % of an XP bar at lower levels than higher.",
            "The sidequests that give xp scale to your level. That's every generic sidequests in the EW areas, they'll scale from 80 to 90(however the scaling isn't so great so in terms of % they're a lot bigger at 80 than at 90).\n\nThere's some sidequests that were added for various rewards such as Tataru's shop in Sharlayan and such and these just give no xp regardless, and are static 90 so you'd need 90 for them anyway.\n\nYou can tell cause they'll show xp or not as a reward, and if you have non 90 chars(such as BLU) they'll show lvl 80 values instead.",
            "It's free profit. It might not be worth it if you spend half your inventory holding on to items (since space is limited) but maintaining a single stack of eg. Clear Demi-Materia III is absolutely worth it.",
            "Worth it, since they effectively double the worth of those pieces until they hit the cap. Why sell for 20k when you can get 40k weekly?",
            "Well, if you send your retainers on 18 hour ventures when you log off for the night, you'll have more than enough allagan pieces to take out there with basically no effort on your part, assuming your retainers are max level. Takes maybe a minute or so to get yourself 40K/week for the cost of a teleport. If you pay for teleports that is. In the end, it is up to you, but I'd say that it is worth it since they are easy to get and the easiest way to get the most out of the enclave",
            "The e-mail I got from Square Enix Europe earlier this week said they aim to have them arrive around the official release date of July 2nd.\n\nSo I personally don't expect any shipping info until like Thursday.",
            "Something like these?\n\nhttps://www.thebalanceffxiv.com/jobs/melee/ninja/basic-guide/\n\nhttps://www.icy-veins.com/ffxiv/ninja-pve-dps-rotation-openers-abilities\n\nor if you aren't max level yet then try the leveling guides from both sites\n\nhttps://www.thebalanceffxiv.com/jobs/melee/ninja/leveling-guide/\n\nhttps://www.icy-veins.com/ffxiv/ninja-leveling\n\nAlways hard to tell what level someone is currently at when they ask these questions, so I figured I should link both versions.",
            "Things are gonna change a bit next week, so I'd hold off on learning the rotation until then.",
            "If you go to leveling on icy vein you can set the level to your current level and it'll give you a simple list order breakdown. Ninja is having a big change next week sounds like (Huton is becoming an always on trait instead of a timer you need to manage) so things will change, but if it's overall stuff you're not feeling good on (orders and when to use mudra/ninki/oGCDs in) should still be (mostly) good.",
            "If it's anything like the 50/60/70/80 poetics gear, come 7.0 Aug Credendum should cost:\n\n\n\n* 600 for the weapon (split 430/170 for PLD main/off hand) \n* 510/e for chest and legs \n* 345/e for the rest of the left side \n* 280/e for accessories \n\n\nTotalling 4,055 poetics to fully outfit a job \n\n\nIn your case - two rings and all the armour except the boots - it should be 510 + (3 x 345) + (2 x 280) =  2,105.",
            "I don't know off the top of my head, but the price doesn't change between expansions. Go check the combined price of all of those gear pieces of any previous expansion's poetic gear. It'll cost that much.",
            "The only guarantee is if you max out the bar, otherwise the higher the progress the higher the chances of getting an HQ craft.",
            "It's chance to get a HQ item.",
            "Not even close to the only mmo to do it like this actually. Wish it wasn't the case.",
            "The FFXIV NA servers (and for that matter the EU servers originally, which was weird) *used* to be in Montreal. But they had reliability issues, so they moved to Sacramento (and the EU ones went to somewhere in Germany). Presumably Sacramento was the cheapest deal that met their requirements. None of their announcements on the matter referred to ping at all; their motivation was purely reliability, which would explain why they didn't look for somewhere central.\n\nI suspect that, as their HQ is in Japan (a very compact country), they don't really grok the impact of ping on the game's feel. They *know of* ping, and design bosses to tolerate a certain amount of it, but that's a different matter than understanding how much ping is fun.\n\nAs you might imagine, a lot of players at the time were upset that they just swapped west coasters having bad ping for east coasters having bad ping. But at least the move was a boon to NZ/Australian players, as this was many many years before OCE was added.",
            "> When are they giving us the free Fantasia? And when do the graphic updates kick in?\n\nWith 7.0 next week.",
            "Fantasia comes out in a sidequest when 7.0 launches. I believe the quest starts in uldah but I'm not 100% on that.\n\n\nGraphic update: the big stuff changes when early access does, on the 28th. However the update is rolling, so it'll continue throughout the expansion. They've mentioned certain materials may take longer, as well as getting all gear pieces and haircuts updated may tske extra time. So while most things will look nicer, there will be some items that aren't updated and might look a bit out of place. They will be fixed as the xpac progresses.",
            "EW it was about a month, but that was a worst case scenario. It was far worse than anything we'd had before (ShB was smooth basically from the start), and there's a pretty long list of reasons why we can expect login queues to not be nearly as bad this time around.\n\nThat does, however, leave your question with no clear and confident answer. Probably a week? Maybe 2? That's my super unconfident answer based purely on vibes.",
            "Last time it lasted a little while but the servers were full and they couldn't order more(covid shit+transistor shortage). This time they both improved the data center capacities and added DC transfers with basically empty DC(dynamis/shadow and the oceanic servers) so honestly I doubt there's going to be massive issues, although you can expect long queues for the first weekend at least and medium queues for a week or so. Might be able to get decent queues by using DC transfer at the cost of not being able to use retainers and such while you do.",
            "GOD I SAW THAT DROP TODAY AND I WANT IT",
            "There was someone wearing Claws of the Beast with two small gold rings(one had a blue stone) on the index finger and it looked like a small ring was on the middle finger too. She changed gear so can't check it there.",
            "I mean it's only 1m a year over npcing them and that's with 52 weekly trips to the doman enclave. Gil per hour wise it's not astounding actually. Takes 50ish seconds for a total of 20k in a bunch of moderately tedious chunks. That's with a good computer and thus good load times gets worse if your load times suck.",
            "I'm 90 but I've basically derped my way there haha, thank you!",
            "Oh yeah that's a super valid point",
            "So I will have enough once I turn in my endgame tomes. I'm assuming the vendor to do that will be in Rahz at Han?",
            "Ok, thanks. I'm pretty sure I'll have enough once I trade in my endgame tomes, especially since I don't need to buy the weapon.\n\nBut if I need a little extra, then I'll just run Main Story roulette for some tomestones.",
            "> Not even close to the only mmo to do it like this\n\nName any?",
            "Hmm, I would guess either [Classical](https://na.finalfantasyxiv.com/lodestone/playguide/db/item/17ba12f8cf4/?patch=) or [Republican Signifer's Fingerless Gloves](https://na.finalfantasyxiv.com/lodestone/playguide/db/item/dd9956f3948/?patch=) could be what you saw? They share a model which gives claw fingernails and a ring on the pinky finger. It's not the middle finger, but I'm stumped to think of what else it couldv'e been.",
            "A minute a week isn't a particularly straining requirement though, but yeah it's also kinda whatever money, I stopped turning them in a long time ago unless I'm bored/when I checked bozja stuff for DT prep.",
            "It's really simple. You use all of your oGCDs on cooldown, but the specific order can vary based on the fight.\n\nNeed to dip out from a pointblank AOE, use Kassatsu first.\n\nNeed to deal with a lot of movement, save the ability that gives you 3 ninjutsu for last since you can't move while it's active. This way you'll minimize your damage.",
            "On the other hand, things aren't going to change *much* next week. No reason you can't start familiarising yourself if you want a head start.",
            "To be fair you can look into it now, it's just that after you under stand the standard opener and rotation as it is now, you should take a look at one or two of the many videos going over changes to NiN in 7.0 - mainly huton becoming a passive trait and us getting a new job gauge + ninjitsu to fill the gap that would create in our current rotation. The way they've done it, the rotation should barely change in practice, it's just that the reason for pressing some of those buttons when we do will changes a little.",
            "The vendor for converting old tomes into poetics is in Mor Dhona.",
            "Can always hop on a couple of hunt trains to cap all your tomes in no time.",
            "BDO until last month, Mabinogi, Maplestory. Older games yeah but xiv is hardly the only one to make this fuckup. Newer games tend to just put their shit in texas or virgina and call it good enough. You really could've used google to find this out. Not sure why you felt like being combative between this and the previous reply that you removed.",
            "Fairly sure Everquest never had any East Coast servers from my discussions with the devs.",
            "She was a DRK",
            "Oh, ok. I know which one that is.",
            "I would, but I'm working the next few days. And Crystal does all their hunt trains in the morning when I'm at work.",
            "You don't have to limit yourself to crystal, I join hunts on aether and primal all the time.\n\nBut also, no they don't lol. Just looking at the crystal train relay channel on centurio hunts has six trains between 5p-12a yesterday (central US time)."
        ]
    },
    "/r/ffxiv has reached 1 MILLION MEMBERS! Come celebrate the upcoming launch of Dawntrail with us!": {
        "title": "/r/ffxiv has reached 1 MILLION MEMBERS! Come celebrate the upcoming launch of Dawntrail with us!",
        "score": 762,
        "url": "https://www.reddit.com/r/ffxiv/comments/1di6pwk/rffxiv_has_reached_1_million_members_come/",
        "content": "Warriors of Light,\n\nWhat an incredible journey we've been on so far! As you prepare for your next great adventure across the sea, take heart in knowing that there are **more than a million brave little sparks** ready to join you when times get tough.\n\nFrom the entire mod team at /r/ffxiv, we wanted to say one thing: **Thank you!** You all are the reason this community continues to grow and thrive and we couldn't be more grateful to share it with you.\n\nIn appreciation for this milestone, the team put together a special art piece based on the Dawntrail benchmark. We not only wanted to celebrate how far this community has come but to put focus on the unending journeys still left to be painted. Although *most* members of our team are not exactly... \"artistically gifted\"... we each contributed some of our favorite minions to the piece because every adventurer needs a companion!\n\n[Special thanks to \\/u\\/elevenmile for painting the background and compositing our \"artwork\"!](https://preview.redd.it/8u5jfe3ui67d1.png?width=3840&format=png&auto=webp&s=418b31e81a187051f5d22417223c004adde85fa5)\n\n**Here's a brief timeline of our community's growth through the years:**\n\n* Jan 2010: [/r/ffxiv](https://www.reddit.com/r/ffxiv) was created\n* July 2013: 10k members\n* Oct 2014: 50k members\n* Oct 2016: 100k members\n* Dec 2018: 200k members\n* Oct 2019: 300k members\n* Aug 2020: 400k members\n* June 2021: 500k members\n* Aug 2021: 600k members\n* April 2022: 700k members\n* June 2023: 800k members\n* Dec 2023: 900k members\n* **April 2024: 1 MILLION MEMBERS!**\n\nTo commemorate such a auspicious milestone, we'll be holding a raffle! **To enter the raffle, leave a comment below that answers the question: \"What does Final Fantasy XIV mean to you?\"**\n\nWe encourage you all to get creative - regale us with stories of your in-game exploits, post screenshots or videos, share your artwork, etc. There's no wrong way to enter, so long as your entry demonstrates what this game means to you!\n\n**Additionally**, we've added a brand new user flair to make sure everybody can celebrate in style! After all, who knows how to party better than the loporrits?\n\n[Artwork courtesy of resident art elf \\/u\\/OlivinePeridot!](https://preview.redd.it/wvxe916zi67d1.png?width=128&format=png&auto=webp&s=4a12a7915f91e9484de5f952e6d509ae34745eb9)\n\n**Giveaway Rules**\n\n* One top-level comment per user, replies are excluded.\n* Account must have been created before June 10th, 2024.\n* [/r/ffxiv](https://www.reddit.com/r/ffxiv) moderators, reddit Admins, and Square Enix staff are ineligible to win.\n* Mark all spoilers using reddit's spoiler tags! [Follow the guide here](https://www.reddit.com/r/ffxiv/wiki/flairs_spoilers_filters#wiki_tagging_spoilers) if you're unfamiliar.\n* Entries will close in one week, on June 24th, 2024 at 3:30 PM EDT.\n\n**Prizes**\n\n**Three winners** will be chosen at random to receive a **copy of Dawntrail from the Square Enix store**! Due to restrictions on gifting, this prize is limited to non-Steam PC users in the NA or EU regions. If you're selected as a winner but have already pre-ordered the expansion or play on a different platform, let us know and we'll do our best to set you up with an equivalent prize.\n\nBest of luck to everybody who enters - whether you're a veteran of the game or have just recently joined us, we thank you all for being here!",
        "num_comments": 239,
        "comments": [
            "FFXIV to me represents a whole universe to explore. Loads of lore, lots of memorable characters, fragments of a world split across parallel dimensions, even the occasional sucker-punch right square in the feels to make sure you're paying attention.\n\nOne of the things I've been having an unexpected amount of fun with has been the glamor system. FFXIV players know that you can easily spend a couple hours in the character creator and any new look that catches your fancy is merely a vial of phantasia away, and being able to make your gear look like something else opens up a whole new level of creative expression when it comes to your character. Thanks to the glam system I can, with one character, be [a country girl](https://glamours.eorzeacollection.com/193504/cover-0-1667343481.png), [a combat medic](https://glamours.eorzeacollection.com/193495/cover-0-1667341815.png), [a biker chick](https://glamours.eorzeacollection.com/193448/cover-0-1667331289.png), [the devil incarnate](https://glamours.eorzeacollection.com/193509/the-devil-on-your-shoulder-1-1667344013.png), or even [a few different](https://glamours.eorzeacollection.com/257590/cover-0-1718416466.png) [flavors](https://glamours.eorzeacollection.com/192748/full-size-faerie-0-1667004919.png) of [faerie](https://glamours.eorzeacollection.com/192748/cover-0-1667004919.png).",
            "FFXIV has saved my life and that's not an exaggeration. My mental state is very bad and discovering FFXIV gave me something to live for. I started playing a little over 6 years ago, when I was in 8th grade. It has been one of the only constants in my life since then and serves as a way to keep me connected to myself as a human being. \n\nBack in December my partner started playing the game and has caught up recently. I've loved seeing their reactions to the game and I'm proud of how much they've improved. I'm so glad I get to share my favorite game with the person I love.",
            "To me it just makes me feel good to be logged in. Especially when my friends are around. It's a nice way to just escape from the real world for a while.",
            ">\"What does Final Fantasy XIV mean to you?\"\n\nBeing happier and at piece with my life.\n\nMy friend introduced me to the game in 2015 after I ran into him after years of no contact. My brother started playing not long after, and we all had good times playing together. My brother has since quit, and I'm currently unable to play the game, but FFXIV is a game I will always hold dear.\n\nLife has had its up and downs over the years, and FFXIV has always been a stable constant that I can go to, and remember that things can be better.",
            "This game basically got me through quarantine and some pretty chaotic moments around then. I'd already had some friends but getting them to play it most definitely strengthened our relationships and I don't know that we would've played anything else together as much as this. It's now become my go-to game for throwing on a podcast and just chilling.",
            "I used to play FFXIV with friends but they dropped off a while back. But even if I don’t have any solid friends in this game, I really enjoy watching people run around, sit and craft, or just seeing them hanging out. The world feels alive. My FC organizes hunts and it’s just amazing how much people love this game. \n\nI’m really glad I started playing about 3 years ago now and am super excited for DT. Hope the game continues to grow.",
            "It's been a great experience where I've been able to meet some excellent people. I started a few weeks ago and on my first day I had a guardian angel following me around a bit, she was really sweet and level 90! I'm only level 20 but I'm having a blast.",
            "Big congrats to 1 million members! The subreddit has been through a lot like the game and here's to many more!",
            "ffxiv is a place to raid and talk with my best buddies !",
            "Anytime I try another MMO, I wonder why the hell are there so many restrictions to what you can do. As someone who likes a solo character, it means a lot to me that I can just keep returning to my WoL and not fee like they are another faceless pawn.",
            "If Yoshi p won't allow lala to mount players - will he allow lala's to mount npcs and use a taco to make them run forward?",
            " **\"What does Final Fantasy XIV mean to you?\"**\n\n  \nTo answer that, i have played MANY mmorpgs in my time. all f2p, grind, fomo trash (elsword being the main one.)\n\n  \nOriginally i got turned off by the subscription, but honestly, i'd rather pay about 40 quid a month than play FOMO garbage.\n\n  \nFF14 reignited my love for mmos. and i fully enjoy this game",
            "FFXIV.  It's been a long journey.  I started in FFXI back in 2005 and then slowly opened up to give the new kid on the block, FFXIV, a chance back in HW.  I've laughed with you all, cried with you all, enjoyed every moment.   In 2020, I had about 20 clots lodge in my lungs (due to a misdiagnosis caused by the pandemonium of early covid) and I started to deal with heart failure as a result.  I especially treasured the moments in Endwalker, because I figured they might be my last ones and I've really slowed down to enjoy the little things in life and gaming.  (Thanks to open heart surgery and lung surgery in 2023, I am here and well.  My lungs are clear and my heart is spectacular).  In totality, honestly FFXIV gives me hope  that in our differences & nuances & thirst for challenges, knowledge, fun, music, laughter, and the span of the human spectrum experience that we can be whole.    \n(Don't need any prizes, just sharing.)",
            "FFXIV means to me cute cat girls. \n\nI regret nothing",
            "FFXIV means friendships and memories in my life. I've been invited to weddings (in game and out), celebrated child births, pushed through rough patches with friends, and enjoyed in game accomplishments together.\n\nI genuinely hope others can get a chance to experience the connections that online gaming can bring over time.",
            " **\"What does Final Fantasy XIV mean to you?\"**\n\n  \nTo answer that, i have played MANY mmorpgs in my time. all f2p, grind, fomo trash (elsword being the main one.)\n\n  \nOriginally i got turned off by the subscription, but honestly, i'd rather pay about 40 quid a month than play FOMO garbage.\n\n  \nFF14 reignited my love for mmos. and i fully enjoy this game",
            "FFXIV is home, connections, a lifetime of love and laughter, and tears. I’ve met best friends who have impacted my life in such profound ways. It’s insane to think how close I’ve become with people that until recently I’d never met. \n\nThe game itself is phenomenal, and I’ve laughed and cried with the scions; but for me, it’s about the other WoL I’ve met along the way.",
            "Ohh cool I've been waiting for it to reach million members for a long time haha.\n\nI'm always talking shit about the game, bitching and moaning about anything but actually, this game really changed my life. No I'm not a youtuber lmao. Yeah people always roll their eyes and meme when they hear someone say \"this game changes my life\" and I used to jokingly say \"this game cures my cancer\" but unironically, it did change my life, drastically (not cure my cancer tho I'm still cancer af).\n\nAfter a year playing it, I discovered my true self. The thing I should have known for a long time but regress it down too much I lost track of it. It's like when playing a role playing game with customisations, you have the chance to be yourself with freedom. So that really helps me to look deep into myself, see what it is and accept it. It was a rough journey and a lot of other things help me with it, but the thing start it all is this game. So I'm really grateful for that. The game just means a lot for me.",
            "FFXIV is the first proper MMORPG I've been able to play. I didn't know if they'd be the right fit for me, but this game is hitting all the right notes. I'm still pretty new to it but I'm enjoying the journey very much. FFXIV means growth and the expansion of my personal horizons.",
            "I've only been playing for a couple of months and I'm currently in Heavensward content. But to me, FFXIV means The Eighty Sins of Sasamo, \"A Fine Death\", finally learning how plus, same, and combo work in Triple Triad after 20 years, and most of all, devastation. Such devastation.",
            "I can't even think on it without crying. \n\nIt means the game that saved my life.",
            "FFXIV has been my latest hyperfixation, and will be for a while with how much content there is for me to do",
            "> What does Final Fantasy XIV mean to you?\n\nHonestly, I used to play ARR back when it released and I couldn't stick to it. Once Covid hit, I saw some videos of people praising Shadowbringers story and I was like \"how come a MMORPG has a good story?\"\n\nSo I decided to play it again, and once I got to Heavensward, it clicked. And I spent a lot of time immersing in the world. Basically, FF14 is an escapism for me. It's my comfort place. I never get angry nor sad when playing the game and my WoL is basically part of me.",
            "FFXIV kind of gave me my life back when I was sick and stuck in bed on medical leave for three months. I signed up on a whim without realizing it would keep me engaged and feeling accomplished throughout my recovery. I got to be social and feel like I was part of a society even while home. It was a huge boon to my mental health.",
            "FF is the place I can relax most. Its filled with many memories and almost every place has its story tied to it. A story not only driven by the devs and our every step with the scions, but also with friends and lots of unknown people. \n\nPeople that skip around, lounge at the ground, fly through the sky. Even love stories are tied to the eternal bond we forged with the game. \n\nIf there is anything to learn it’s about the way. Start and work your way up. Progress in skill as well as in character. Play it your way. Not once did I feel the need to compete. It’s open to us all. Take your time. And enjoy it your way. Thanks to all the devs. Thanks to Yoshi, but foremost thanks to all the members of the community and all of my friends.",
            "XIV to me is all about potential. We consistently see it build on the foundations and grow. A slow and steady expansion on the amount of content offered on a patch to patch basis and an ever growing amount of story.\n\nLike or hate an expansion, you have to admit the average amount of raw content per patch has increased consistently, and that is pretty awesome.",
            "What does Final Fantasy XIV mean to you?\n\nFFXIV felt like a new world i stepped into. i never seen such a friendly community and the story that made me moved and helped me grow as a person. I felt no matter what, I will always return to this game whether for its story or to hang out with my online friends.",
            "FFXIV is gaming for pure enjoyment. Choose your level of difficulty. Immerse yourself in the world. Fall in love with the community.",
            "First off, this game has ruined some older games I used to love. A couple months back I tried to replay Dragon Age 3 and got annoyed I couldn’t just change my class when I felt like it. And having to stop to loot stuff. \n\nFF14 has shown me that not every gaming community has to be toxic or elitist. That game developers sometimes really do care about the players and their time. That mistakes can be fixed if you really want to put the effort in. \n\nThe game and the community has taught me to be more forgiving of my own mistakes.",
            "Fantasy life",
            "To me, FFXIV is a world to sink countless hours into. A great community, great stories where even the smallest of sidequests can create unforgettable memories. The music can bring forth both emotions and memes (La-Hee, anyone?).\n\nAnyway, I have been playing for 10 years, and I hope to be playing for 10 more.",
            "FFXIV is currently carrying me through some tough times, as it has before and will again. I've only been playing since mid 2022, but its already carved a place out in my heart and life in a way I never thought an MMO could.",
            "FFXIV was where I met some of my best friends and my current partner. It continues to serve as a place for all of us to meet and talk, and it helped reignite my passion for writing and creativity. It reminds me that it's alright to be vulnerable sometimes, to let others into your heart, and that things will ultimately be better in the end if you just keep on trying.",
            "Raiding for shiny glams, memorable stories, limsa catgirls",
            "Ffxiv to me is my way of connecting with my friends. After college all of my closest friends have spread out across the country, but I know that every Saturday night, I have at least 4 hours to catch up with them, raid some savage content, and just enjoy the fact that they’re still in my life. Moving away from my friends and family was tough, but this game helps to make it feel like we’re still just down the hall from one another.",
            "FFXIV means adventure. Not only in the literal sense, where through are brought to a myriad of locations all so vastly different from each other. But emotionally as well. The story takes you on an emotional rollercoaster and is filled with beloved characters who accompany you through all of it. \n\n\nBut outside of the story, while going though my adventure with the game, I've met so many good friends. Some of whom I've met last fanfest. FFXIV has brought people from all walks of life, from across borders, together. I've even reconnected to old friends because of the game. \n\n\nTruly I believe FFXIV is an experience and adventure that has broadened my horizons and goes beyond a simple game",
            "Final Fantasy XIV has been a huge part of my life since Stormblood when I first started playing. Over time my in-game friends dwindled and I was kinda just pacing myself through the MSQ (was mid-HW at the time), but I streamed it for a friend I was hanging out with one night and he loved how it looked. He picked it up, I made a new character to run things beside him, and we've never done an MSQ quest without each other since! We both have at least half the classes at 90 and are fully ready for a brand new adventure in Dawntrail. So in short, FFXIV was a way for me to strengthen an incredibly important friendship, and we're practically inseparable now.\n\n\nWhile I'm happy to have a place to comment on what the game means to me, I'd like to ask this comment *not be included in the raffle*. My friend and I both have Dawntrail pre-ordered already, and I'd love for the prize to go to a user who doesn't have it yet so they can experience the newest part of the story as well!\nCheers to a million members, and here's to even more! 🍻",
            "I've never met such a kind community like this in a video game. People are so warm, so kind, some of them even teached me play how to play \"tank\" at the first place. Even looking how creatively have made adventure plates of players make me so happy. Days after days, everytime when i logged in FFXIV, i ve surprised different creativity. The community of FFXIV is really strong, fun and talented and this makes me play more Final Fantasy XIV. \n\nThanks for reading. ^.^",
            "I'm a new player that just started this week. But what FFXIV means to me is the possibility to help with my loneliness. I'm disabled and spend every day at home by myself. I've had so much fun so far with the free trial but I really want to be able to participate in all the community can offer.",
            "Final Fantasy XIV, to me, is connection.\n\nIt's been a way to connect with my family, a shared interest among differing tastes. I can laugh with my grandmother as we make the weirdest lalafell and hrothgar characters in character creation. I can tease my brother about poly grapes. I can gush over the music with my dad. I can show off some of the ffxiv inspired recipes to my mom. It's something fun we can all enjoy.\n\nIt's been a way to find and make new friends. I met a lot of my current online friends through FFXIV, and they showed me the ropes of not just thr game, but also the gaming community as a whole. I got to explore things outside of my comfort zone and find new things to enjoy, like music, TV shows, games, food, and so much more.\n\nIt's been a way for me to connect with myself. I've been able to explore so much of myself on ffxiv even when the world outside my door was terrifying. It's been a comfort and a joy to experience the journey as the WoL of light. I've made art, learned music, and found an interest in cooking because of this game. \n\nI recommend this game to so many people. It's ridiculous, but it comes from a place of joy and excitement. Ffxiv, as a game on its own, is amazing, but its community is just as good. You all are such a welcoming group to newcomers. It's really something special :)",
            "Personally, FFXIV has been something I've been looking for in a game in a long time, back when I first tried it out during the pandemic it was special from the beginning, even if I had played RPGs all of my life, I never had the chance to play an MMO and what an experience it has been, I've gone from being that scared sprout that wouldn't play anything but DPS and listening to all advice I could to avoid messing up and getting better at the game, to now looking forward to playing DT as a SCH and it's now me been the one helping people figure out mechs and doing all I can to save the run when things get rough, even if I still mess up things here and there.\n\nThe community has also been amazing, some folks you will probably never meet again, but that little chat or experience in a dungeon/trial or during events that made you laugh or just genuinely leave with a smile in your face, or that person that finally helped you figure how to do something you've been struggling with, it's always a great experience. Looking back when I first started my adventure as a BLM in Ul'dah, to where I am now, I don't regret it one bit.",
            "First game with a crafting and gathering mode that actually made sense. I felt accomplished from 2.0 up to now when I either gathered or crafted a HQ material/gear. Seeing the finished product is usually very satisfying and just opens up more possibilities of how I can enjoy the game.  \n  \nThe community has overall been very welcoming. You still have random bad actors but it feels like a living world. The diversity the job systems provide has always shone through. I'm excited about how FFXIV will grow. I am glad to have lived through some memorable experiences of how jobs played and on my second character the fast exp is really nice. Going through it a second time knowing what I am doing shows how well built the game is.\n\n  \nFFXIV helped me grow as a gamer.",
            "Community in a way that no other game can accomplish.",
            "FFXIV to me means family. My dad used to play FFXI with my older brother and once I was old enough to understand an mmo was around when ARR came out, so the three of us started playing together and we’ve been playing together ever since.",
            "Ffxiv means friendship. \n\nI’ve met so many people since I started playing back in arr. in fact I just got back from an irl wedding of two people I met in the game. And another friend from the game came to stay with us and travel down to the wedding as well. \n\n\nThese people aren’t just game friends, they are some of my best friends and guy can have",
            "FFXIV has a special place in my heart because it helped me connect with my sister when I was in high school still and she was in college. We weren't very close and didn't really share any hobbies, but being able to play FFXIV together and chat about the story, struggling to upgrade Zodiac weapons, etc. gave us something to bond over and something to spend time together on. Even now, when we're both out of college, hopping on together to complete duty roulettes or farm mounts together is still something we do to spend time with each other.",
            "Grass substitute in the best possible way",
            "FFXIV has always found me in a dark spot in my life and helped me cope with what's going on around me. I'm currently disabled from a bad accident, and the game has been GREAT at getting my Wanderlust out. My wife and Brother-in-Law play as well, and we have fun all across Eorzea.",
            "FFXIV drastically change my real life. I met someone special in this game back in 2015. Even tho we both lived in different country at the time, we ended up closer than most despite the long distance. In 2019 we got married in real life and I permanently moved to the other side of the world to be with this person. This year we are buying our first home together. \n\nPlaying FFXIV together is more than just a hobby, its where we both got to find each other and it means a lot to us. FFXIV changed our lives and im so glad I joined this game 9 years ago. I dont think ill ever stop playing.",
            "FFXIV means seratonin hits for maxed out jobs.",
            "Eorzea is my home away from home. It’s been an absolute blast to play through the world. Especially with the callbacks to the older final fantasies that I grew up with.",
            "I've been playing for 8 years and it's always a game I can come back to.",
            "This is a game I've played for years, it's so comfortable for me and I got my wife to get into it and now we get to share this together and get hyped for dawn trail. Even my kids love it, still young but they like running around and since we have 2 tvs next to each other they can both be in the same area chasing each other or flying around and exploring.\n\nIt's just become such a staple of our life and we all enjoy it together. I never have to worry about falling behind much when either of us stop playing for a while and it's conducive to working full time and raising 3 kids.",
            "FF14 means endgame! I grew up playing FF11 but my parent never let me stay up late to try endgame content. Now that I'm older the ppl I play with get on too late because I work early so I still can't do much when it comes to endgame. Playing 14 let's me do raids on my own time, yes I have to deal with PF but it is better than working on 4hrs of sleep lol.",
            "FFXIV for me started off as a game I wanted to play but missed my opportunity because it was PC only. Then it was reborn and available on PS3. I finally had my chance.\n\nI grew to love my character, love the story, made some lifelong friends (many are in the same FC still), and listen to the OST often.\n\nThis game means more to me than I ever thought it would. My character is married to my wife's character, and we love to play the game together. We play through the story and share the laughs and cries.\n\nI hope this game continues on forever.",
            "A place of relaxation",
            "What does FFXIV mean? Well it is alot, but I'll try.\n\nI think the biggest thing FFXIV is for me is an emotional experience. There have been more than a few mental health issues over the past decade or so of my life, and I do not mean to insinuate this game was somehow a magic solution to mental health it did help. One component that kept recurring in many of my struggles was understanding my emotions and processing and expressing them in healthy ways. So, finding a story that elicited emotional experiences while talking about why the characters are motivated to feel the way they feel. On top of that, the community's shall we say great enthusiasm for sympathizing and empathizing with others as they experienced was a great influence on me for sharing my feelings and being more aware of the feelings of those close to me.\n\nBut to say FFXIV was just emotional story telling would be selling it short. I have a particular fondness for the music. I haven't had a game that managed such a wide variety of styles so we'll from the more traditional rpg video game music with orchestras and choirs to banging rock songs to lofi dance remixes to slay evil to. I have always been a music need? So it has been a joy to hear what the game and the music team bring next.\n\nThere is more, much more; hunting down glamors, getting sucked into crystalline conflict from time to time, even dipping my toe into higher end content for the first time in any mmorpg I have played. But, I think that is enough to get across what I feel FXIV is to me.",
            "FFXIV was my covid game. It was the link to social circles I couldn't interact with and I made many, many friends who I still talk to today, several of which have had very real IRL impact on me",
            "Oh man. My dumb little hide just stepped off the boat and started playing this game. Makes it a little difficult to say what it really means, given the timeframe. I guess it could just mean a new beginning though - new, fresh start to a new game and hopefully a new hobby/pastime. Endless possibility, limitless potential, maybe all of it!?",
            "I was reflecting on this recently actually. There are memories and experiences I can't believe I would have missed if I had never started playing that fateful day two years ago. I've had so much fun, I truly love hopping on the game each evening, because FFXIV means friends, a fun night in store, and usually some rare achievement I'm vying to grab (with some antics along the way). Even if my friends aren't on, I can always queue a roulette and strike up a conversation in MSQ, or gather around my fellow fishers as we all lament not being able to catch Ruby Dragon. Never in my life have I played a multi-player game where people are so friendly and inviting\n\nI feel emotional as I write this and read everyone else's responses ;-; FFXIV is such a good arc in my life.",
            "What makes FFXIV important to me is the celebration of this amazing franchise. Ever since FFXI, my first MMORPG, to now XIV, I’ve met many wonderful friends. Kept me connected to family. \n\nBut what really takes it away, the story XIV told had helped me see life differently. Less… depressive than it usually is. Life is still hard but I cherish it under a new light.",
            "FFXIV means a lot to me. I began playing back in Shadowbringers. I started maybe a month or two before the massive influx of players. My twin brother started playing while he was in college but I just kept saying no when he asked me to play. However, I had recently broken up with my girlfriend of two years and therefore had a lot more disposable income. \n\nThat relationship was awful. Somehow, her hitting me in the head wasn’t the final straw, but that’s a story for another day. I figured that with her out of my life, my general outset toward life would improve, but it didn’t. A couple months before I started playing, I was diagnosed with depression. I just felt like I was sinking and couldn’t possibly pull myself out of the rut I was in. The doc put me on an antidepressant, but unfortunately, it didn’t really work for me. \n\nMy brother was home because of Covid and told me about all the cool mounts and how all of them could fly, even the turtles. I thought it was funny and figured I’d give the game a shot. At level 15, I beelined it for the Gold Saucer and grinded for the mount overnight. Even though I couldn’t fly yet, I liked the story of the game so I figured I’d at least play through to the end of the story. About halfway through Stormblood, I was swapped to another antidepressant.\n\nI still felt horrible about life in general, but I continued playing, just to catch up to my brother and play some with him. The antidepressant that my doc put me on was definitely working. I remember in the middle of the first fight with Ran’jit, I stopped and noticed that I genuinely felt excited about something for the first time in a long time. From then on, I started to get more involved in the other systems in the game since I genuinely could enjoy them now.\n\nMake no mistake: FFXIV didn’t cure my depression, but it gave me something to find joy in when nothing else did.",
            "FFXIV for me is much needed comfort and consistency. Whenever I return I know the player base is largely kind, that limsa will still be limsa, and that the story will always evolve. Many mmos whiplash between changes and updates that strip away what core elements define that respective game, but for better or worse, you know what to expect per each major update here. In general that you can seamlessly enjoy this game solo or alongside others in addition to the aforementioned varied and consistent standard of content means that you can enjoy the game at your leisure without being bound to a specific or forced level of engagement or playstyle.",
            "What does FFXIV mean to me? It means adventure and friendship! I've met a kind bunch of people, and even gotten closer to my circle of friends. We pushed through the story and spent countless hours learning new trials together. I may be just another traveller in the sea of WoLs, and although we might have drifted apart from others, their legacy will live on in my memories. FFXIV is truly something special.",
            "To me, ff14 means meeting so many nice people along the way, making friends with some of them, and the thrill of clearing the toughest content the game offers with those same friends. No other game I´ve played has ever beaten that feeling.",
            "To me FFXIV is like a fairy tale that I get to play for a couple of hours before going to sleep at night. Unlike Pokemon which has been my premier escapist fantasy since I was a kid, the world of XIV isn't some feel-good utopia full of sugar and rainbows and it's actually filled with horrors and social issues that hit close to home. However, I can rest easy knowing that no matter how dire things might get, XIV is an optimistic tale where good and the human spirit always triumphs over evil. I also specially appreciate that you, the player, get to be in the driver's seat of that fairy tale, and that besides being the grand world-saving hero, XIV's side quests also allow you to be at the ground level, helping the people and doing acts of community service.",
            "**What does Final Fantasy XIV mean to you?**\n\nI had tried ARR around the ps4 launch and upon beating Gaius, felt that I had enough of the game (and of course hearing stories of the coils scared me so I left that be).\n\nIn the the last few years I had a rough time as I had moved from the US to Japan and needed a bunch of surgeries. At the same time, due to the difference it was difficult to connect with my friends and family back home. Luckily, my friends are very persistent and suggested we play a game and try and spend more time together (I think we all needed it). On a whim based off the reputation and free trial, I suggested we play xiv. It then became a powerful bonding tool as I was physically recovering and honestly, quite a good story on top of it all. It also help rebuild my sense of adventure and curiosity that led me to moving in the first place. I cannot wait to take my WoL on a journey to new lands as I further improve myself out of game and explore the areas around myself.",
            "FFXIV is the ultimate form of escapism for me. It offers so many activities that allow me to spend time with friends I've had in game for over 10 years. I've formed many lasting bonds with people in this game that have stuck by me in my own FC. We've cleared all the MSQ together, tried the raids, done the islands, tried housing. We've spent ages just sitting around and chatting at the fountain near our FC Home.\n\nIt's the ultimate social MMO for me since I found a group of people that let it be so. I'm thankful for those days where I stayed home sick and while I'm miserable I was still able to have a social lifeline by interacting with all the people in game. I think i'd be a less social person in real life without the great experiences I had in XIV.",
            "FFXIV is where all my friends are.\n\nSo to me, it means friendship. It means a place where I feel welcomed.\n\nI’m still only new to the game, but it’s helped me get through some very tough times, and I’m so grateful I started playing it.",
            "I was here when it was around 30k members. Crazy to see how far it has come.",
            "To me, FFXIV proves to me that gaming doesn't have to be mean.\n\nThe members of the community in this game are consistently nice. People seem to recognize that you're a person and that sometimes you're just having a rough day.\n\nIf you're struggling in this game, people will ask you to stay and will help you get through whatever your barrier might be. In any other game, you'd be kicked without a second thought.\n\nSo it might sound a bit cheesy but the game gives me hope that people can actually be kind to one another. It's  so refreshing, and logging into the game just makes me happy because of it.",
            "FFXIV to me means a game I never expected to love as much as I do. As my first real MMO (a month of XI doesn’t count), I never expected XIV to have the staying power to keep me subscribed multiple years, nor the engrossing story that matches the mainline games plus the added bonus of being able to weave all their characters, bosses, music, and Easter eggs throughout. My biggest surprise was making online friends that expanded into real life, and people I will keep in touch with forever. The community was my safe haven during the pandemic, and for that alone I will be forever grateful. Here’s to many more expansions and story twists and turns together!",
            "FFXIV has been there with me for the past 10 years. Through many different milestones in my life. It’s comfort.",
            "FFXIV got me through covid. No family, no other people. \n\nIt kept my sanity intact.",
            "Honestly XIV for me is Escapism from this broken ass world",
            "Honestly, I started to play because my friend invited me. I really enjoy the community and how friendly everyone is. I am not perfect, but I am glad I dont have people yelling at me if I make a small mistake. I am looking forward to more great times with everyone.",
            "FFXIV means escaping reality to come to a world where I can relax, see my friends, and enjoy the scenery and the music with it.",
            "I've played so much pvp other players now have planned responses to the line \"Father, I crave violence\"\n\nI have never felt so seen.",
            "FFXIV is the game that helped me meet my current partner and now roommate. During COVID, it basically became my lifeline and the way I made and interacting with friends. I have grown a little past it, but it's still... it was an anchor that helped me get through some really dark times.",
            "FFXIV helped me enjoy MMORPGs again with its incredible story and equally incredible team.",
            "FFXIV holds such a dear place in my heart for the comfort its brought me, I’ve committed 2k hours and in that time I’ve battled off a fantasia addiction, completed the msq and spent to long levelling and farming glamour. \n\nIt’s my first and only MMO which is ironic cause I have no friends who play the game, but FFXIV has been a solid pillar for to me to destress after my days of studying and it feels so fitting that Endwalker came out at the beginning of my studies and Dawntrail has released the week of my last exam.",
            "Ffxiv is my first real Final Fantasy.\n\nBefore 14 I played an hour of FF12 (I thought it was 10hrs until I replayed it last year), and never really gave JRPGs a fair shot.\nMe and some friends on ps4 played the beta and were hooked. I continued as they fell off through ARR but I found and made new friends.\nI quit about halfway through Heavensward. I got tired of statics constantly falling apart due to Alexander woes. I eventually came back a month before Shadowbringers and fell in love again.\n\nFinal Fantasy 14 is my comfort food.",
            "To me ffxiv means friendship but also just how many wonderful experiences have been opened to me because of it. It's about making connections. \n\nAside from the briefest of moments playing in the 2.0 beta, the only reason I started playing was because my friends played. I was very apprehensive about it because I had a not so great wow addiction that I got rid of a few years prior. So I stubbornly said no at first.\n\nThen I learned that my other group of friends also played. \n\nStill I declined because I wasn't confident in myself to not get completely hooked again.\n\nI visited the Eorzea cafe in Akihabara which I was totally clueless about, but being a FF fan in general still absolutely loved it! (Wonderful experience no.1)\n\nSo I caved and got the free trial which didn't include HW yet. Didn't really like it though especially when it came to the story being locked behind dungeons. So I left it there.\n\nThen I went to Distant Worlds and they played Answers and Dragonsong. I was absolutely blown away! (Wonderful experience no.2)\n\nI knew I *had* to give it another chance and in April or May 2019 I finally started playing.\n\nI've become very close with my friends via XIV, especially during covid. I've reignited the bonds I had with that second group I mentioned because we had drifted a bit since leaving highschool. Suddenly I'm in a discord with them and meeting new people they had met over time. I have had SO MUCH FUN just being in voice with them and it's thanks to XIV that I even ended up there.\n\nI've become more active in making art because I'm so inspired by this game with its wonderful characters and incredible music. I think this is the most wonderful thing of all because I've had art block for around ten years. I'm so rusty but now I've got something I find passion in, I can work towards getting better.\n\nAlso the characters in this game are just some of the best. I never thought a villain would ever be my absolute favorite character in a video game but then in SHB >!Emet-Selch!< showed up. \n\nI've found wonderful content creators via XIV like Shenpai and Jocat. I've also met some voice actors from XIV at conventions. \n\nOh and most importantly, I don't feel the same way about this game as I did wow. I'm able to take breaks and not worry about logging on. I'm not constantly thinking about it 24/7. It's a comfy form of escapism, not one that stresses me out.\n\nThis game has made me cry more than any other, has made me laugh, made me angry and made me so excited to log on and spend time with my friends who I can't see in person very easily.\n\nI've realized that a MMO is perfect for final fantasy because to me a good FF game is one that you never want the story to end, and with xiv it keeps going with each expansion.\n\n\"Eternal winds to the land descend\nOur journey will never end.\"",
            "A place to still enjoy the social aspect of mmo’s, which I feel is lost in many other games. Also, so many ways to enjoy/play the game!",
            "**What does Final Fantasy XIV mean to you?**\n\nThat's easy, its the *universally* acclaimed 14th entry into the Final Fantasy series, an MMORPG with an expanded free trial which you can play through the entirety of A Realm Reborn and the award-winning Heavensward, and thrilling Stormblood expansions up to level 70 for free with no restrictions on playtime.\n\nAs I'm sure it means the same to most people here.",
            "Ffxiv means a lot to mean it’s gotten me through some irl hardships I’ve made some pretty amazing friends along the way , it’s an escape from reality even if only for a brief moment. A simple pleasure.",
            "I'm absolutely new here. Haven't even finished ARR yet because I'm doing side quests and leveling jobs. But this is the first time in an MMO that I really felt that I belong. I've played many MMO'S but this is the only one I don't feel the need to skip every dialogue text nor the cinematics. As I am new I don't have many stories, but I think this one is important to why I am hooked right now. \n\nI was doing a FATE, and some higher level party that was chilling near helped me complete it faster, so I expressed my gratitude using the Bow emote, the thing is I was focusing the minion of them. As I was leaving to continue doing another things they messaged me to basically tell me she was laughing about missing the focus and bowing her minion, I went back to talk to them as i am on trial and can't yet respond tells. So long story short we are now kind of friends and we spent like half an hour just talking in the wild. \n\nIt's little things like this that have increased my enjoyment of this world 100%. I love it.  \nAlso i love to take screenshots in this game. World is beautiful",
            "FFXIV to me is comfort and love and escapism. \n\nIt was my first ever MMO, and one that I immediately fell in love with. From the graphics, to the combat, to the amazing story, I was hooked instantly and flew through the ARR content to finish it just a few mere weeks before HW launched. And at the time of me starting, I hadn't even known an expansion was coming. So I was thrilled to learn I'd just finished this amazing content, and now there'd be even more to do!\n\nFF was also an escape for me,at times where I was really struggling with mental health problems. It was a way to forget them for even a few hours a day and just have fun.\n\nIt's also how I met my partner. And I am so incredibly grateful to FF because of this. He's the light in my dark days and I don't think I'd have loved this game for as long as I have if I hadn't met him and experienced the journey through Eorzea with him.",
            ">What does Final Fantasy XIV mean to you?\"\n\nIt was 10 years of a wonderful story.  I played 2.0 on a shitty laptop in the middle of Afghanistan on terrible internet (Titan. . . shudder)\n\nIt had it's ups, it's downs, but overall it was a wonderful experience.  Endwalker is the end of my character's story but I'll always have the memories.",
            "A damn fun MMO and plenty of just as fun times, ain’t nothing more to it. Met lots of good people here, mean to meet many more.",
            "This may be a corny answer but to me FFXIV represents adventure!! Interacting with a complex and changing world in new and exciting ways and the delightful cast of characters from the stoic to the downright bizarre has yet to get old.",
            "For me, FFXIV means several things,\n\nFirstly, playing with the person I love, and using almost all our leisure time to play since the start of the game.\n\nBut also playing with two of our three boys, even though they're all grown up now, was a great pleasure and made for some wonderful memories.\n\n\n\nKoko family",
            "In a land where crystals gleam bright,   \nEorzea faced perilous plight,   \nFrom A Realm gone astray,   \nTo Reborn's brilliant day,   \nWe found in its light a new might.\n\nSprouts with their green icons so cute,   \nIn the Novice Network they root,   \nWith mentors beside,   \nIn this game’s vast expanse,   \nFinding friends and a community astute.\n\nAs the Trust System opens its gate,   \nNPCs help new journeys take shape,   \nFrom disaster's first night,   \nTo a future so bright,   \nBoth game and players can truly relate.\n\nWith Dawntrail on the horizon's crest,   \nNew adventures await every quest,   \nFrom sprout days to now,   \nWe take one more vow,   \nTo continue this journey, our best.",
            "\"What does Final Fantasy XIV mean to you?\"\n\nFinal Fantasy has always meant a lot to me, but XIV has changed my life so much. I've made many friends in game, but above that I found the love of my life in XIV.\n\nI've gotten to do every expansion together with them and honestly the excitement of getting to do DT with them soon is the main thing pushing me forward right now.",
            "What does FFXIV mean to me?\n\nFriends. I started in 11 and met Bob accidentally. I needed help with a rdm coffer and he was in the zone. We've been friends ever since. Always getting into stuff we really couldn't fight, but my carby tried anyways. Chibi graduated and went off to college. But we still played with him and his dad. \n\nWe've lost friends we've met along the way. I lost my son the day after the Fenrir fight. He watched me beat Fenrir. It is a special memory to me. Jmb and Bigcheese thru suicide. \n\nBob and I decided to join Chibi in FFXIV, although he was on a different server and transfered. His dad came to play too. I set my daughter up with an account and we still play together. My husband has joined us and went from \"I have to go talk to tartersauce (tataru) and fight pokemon,\" to \"this story is actually pretty good!\" He is currently working thru stormblood while I frantically try to level my crafters. \n\nI cried my way thru Endwalker and watched as my daughter made her way but no tears from her. We help my husband in dungeons and raids and show him the fun events and shenanigans we get into. Bob dubbed me as Aggro Queen from 11 and I still have issues. I don't know why the mobs pass the people in front of me to run up and smack me! \n\nIt's just nice to be able to all gather in the living room and play together as a family. I have a lot of fond memories from 11 and 14 and friends that have stuck around for many years. I was a single mom for many years and my friends online were always there for me. Still are, and I plan to be there for them for many more years to come.",
            "It means so much to me. A place I can hang out with my friends, have fun, party, laugh, cry, be angry. It’s just a place to be for me. 3k hours and still climbing. I can’t wait for what the next ten years has in store.",
            "The friends we met along the way.",
            "Final Fantasy XIV is an MMO I wish I had played a lot sooner.\nComing from someone who played many other MMOs before like Wizard101, FFXIV has grabbed my attention with its compelling story, low grind (compared to most other MMOs), various side activities, and the fact that most of my friends are playing it.\n\nFFXIV to me is a place where I feel like I can do anything. This game is filled with various activities that cannot be found in most other MMOs. Tired of combat/dungeon runs? Crafting, gathering or the Gold Saucer are there to do something different. How about trying out a new class as well? Never have I seen an MMO where jobs are not hard-coded to a character unlike in Wizard 101, where you're stuck with a primary school type for the rest of your journey over there.\n\nAt the time of writing this, I'm still a Free Trial Sprout and I plan to one day get the full experience once I feel like I experienced everything the Free Trial has to offer - though certain Free Trial limitations did made me think about buying it sooner at times, hah!",
            "FFXIV is a game I only recently started playing. In fact, I was quite resistant to it for years. I thought the people who played it were annoying (and I wasn't exactly wrong.... but I was a bit harsh), and I was always a bit hesitant to start and commit to an MMO, it's a lot of money.\n\nBut then a few of my friends essentially peer pressured me into playing it, and here I am, weeks in with over 100 hours already. So I guess it means, to me, the ability to try something new even if you don't think you'll like it.",
            "Any xbox players here add me: GT Crusina if i can't win the contest I can win friends! (maybe)\n\nAs for my best memory. Clearing UCOB as the last person alive as warrior. 30 seconds of people screaming and watching for 30 seconds as he went from 0.2 to 0.1 to 0.",
            "What does Final Fantasy XIV mean to me?  \nWell... It is many things to me...  \nIt is friendship. I connect with friends and make new ones, within this game, through random encounters, and outside of it, by talking about it.  \nIt is relaxation. Nothing like a day after of work of just brainlessly running dungeons, gathering resources and crafting with them.  \nIt is tension. The story, what will happen next? or will I win the Jumbo Cactpot this time? Or will I win the RNG of dungeon loot for that pet or mount I've been trying to get? Or will get that house that I've been waiting to buy for hours?  \nIt is expression. There is no better way of expressing that I am edgelord and a shitposter, through my glamours and titles.  \nIt is satisfaction. The joy of finally getting what I have been trying to get for a while, only to repeat the same process somewhere else, and so on and so forth.  \nIt is irresponsibility. The realisation that it is 3 AM. Thankfully I don't work tomorrow, but goodbye to my sleep schedule lol. Or alternatively, I should really not get this item from the online shop, money is looking kinda tight right now, but I really want it... Oops I bought it lol.  \nAnd finally... It is my lust. Yeah, I admit it. I browse the spicy art for this game. It looks good. I like it. I have a weakness for freckles, and dragon-like ladies. Just turns out that artists for this game make beautiful Au'Ra ladies with freckles.",
            ">\"What does Final Fantasy XIV mean to you\" I suffer from depression so shadowbringer and endwalker hit me hard.   This said I'm hoping for big changes going forward.  The game is too easy.  Apart from the msq it's not nearly fulfilling our time consuming enough.",
            "FFXIV is the place I retreat to when I want to step away from it all. It's this huge fantasy world filled with so much possibility. A place where I can forget if something is bothering me. It becomes all about the journey and the friends we make along the way, whether they be NPC's (looking at you, Scions) or fellow players. It's my ultimate safe space and that's what FFXIV means to me.",
            "I've honestly never really considered what FFXIV means to me before, I've kinda just played it for the past 2 years and enjoyed it. Being my first Final Fantasy (excluding bravely) it's been somewhat of a gateway into the franchise and I'm hooked, I just finished 1-9 in preparation for Dawntrail. I guess if I had to put in a sentence: FFXIV is just fun, and its always given me something to look forward to, inside and outside of the game.",
            "FFXIV to me means several things, but the first that comes to mind is a change in how I see MMORPGs as an old-school MMO player who started with... MU Online lol. Having grown up with games like MU Online, Ragnarok Online and Lineage II, I never believed for a second that an MMO out there could have a good story. Story and lore were just the thinnest of excuses to go out and kill monsters in those games, and I came into FFXIV with that mentality, thinking \"Story? Nah, can't be any good. I'll just rush the MSQ\". I will mention I'm a long-time jRPG fan too, so in hindsight I can see the irony of going through the MSQ the first time not reading a single line of text, just assuming it was bad like the others. But then my FC at the time convinced me to give the story a try when NG+ came out, and boy oh boy did it make me feel dumb for ignoring it the first time. I now consider FFXIV's story to be one of the best, if not *the* best, stories ever told in a videogame. I am now impatiently waiting for DT to launch, and after I finish the MSQ and while I work on EX trials and such, I plan to do another full playthrough of the MSQ in NG+.  \n  \nFFXIV also represents my hope that the MMORPG genre isn't doomed. There are many cashgrab MMOs coming out nowadays, full of p2w mechanics or simply so bad they shut down within a couple of years. There's also been a big move away from the social aspects of MMOs and more towards single-player games that require an internet connection. At first I thought FFXIV was part of that latter problem, but seeing the communities that form, how people make incredible things such as stage plays and concerts... It's a different type of social game, but definitely a very social game. It was a big mentality change on my end in this regard as well, and it gives me hope that there are still games out there that put the MASSIVELY MULTIPLAYER part in MMO first.",
            "\nfinal fantasy xiv to me means a place to relax, have fun and enjoy the company of others!",
            "What does FFXIV mean to you? To me it is home, somewhere I can always return back to and feel like I am in the right place. It has changed my life in incredible ways from the very first few weeks I started, and three years later I still love to play everyday, if not sometimes only to afk all day while I work. It is my home, after all, and like a cozy fireplace warming up a room, my desktop and my bedroom do not feel as cozy without it, sitting on a Gridanian bench with the friends I have made. What a great game.",
            "I started playing in ARR beta phase 3, 2 years before my first kid was born. In that time, I've had 4 kids and countless other life changes, but my XIV character has always been there in parallel as a quite refuge and marker of the seasons of life. It's hard to communicate the weight that >!\"has your journey been good? has it been worthwhile?\"!< carried when it meant so much more to me than just its in-canon meaning, but it has been good, and it was worthwhile.",
            "Ff14 is the best single player mmo iv ever played. When I'm tired of other moms were groups are toxic yet I still want my fix of MMO style gameplay - ff14 is there for me!",
            "What does FFXIV mean to me?\n\nSo much! I’ve been playing it for years thanks to a friends recommendation. I’ve been able to meet and engage with so many great people through this game. It’s a game that has so much to offer inside and out, and I’m so thankful for it! And I look forward to all the adventures to come!",
            "to me ffxiv is a place i can log in and feel cozy just relaxing, enjoying the story and hanging out with friends when i want to in my own time, at my own pace, somehow it feel so different then irl social events where my \"battery\" just quickly runs out.",
            "The one defining thing about FFXIV that means the most to me is the ability to open myself up and become more confident in myself. I wouldn't have become friends with so many amazing people, exposed myself to new experiences and generally change myself for the better if I didn't take the plunge and I have FFXIV to thanks for it, I was afraid of being myself, but the game helps me to realize that I shouldn't be afraid to show who I am to the world, the lesson that I learned in the game be it from the great Story and the people I've met in it genuinely aid me in the real world. I wouldn't forget about it even when I become old, the memories will live on with me hopefully forever!",
            "I try to avoid this sub as I am still in free trial but I can't imagine the number of memes I will discover when I will go further in the game !\n\nTy all !",
            "catboy dressup simulator ft. political chicanery, shadowy machinations, and deicide",
            "FFXIV means a lot to me, not just as a game but an experience of a lifetime that i wont ever forget.\n\nPlaying through the story, beating the raids, getting mounts and relics and meeting new people has helped to keep me happy for the past few years, i personally wont stop playing this game till the very end!",
            "FFXIV is a place where I found joy in a story, a welcoming community, and appreciation for simply existing and experiencing a great game. I survived in a toxic community to escape and thrive in this community! It's been a great place where people can enjoy the game for a variety of reasons like glam, housing, leveling, raids, crafting, hanging out, or being a part of that community we all know exists but do not speak out loud. Visiting The Quicksand for the first time was an experience!",
            "It means a rollercoaster of 10 years between chilling and never-ending challenges.",
            "What does FF XIV mean to me?\n\nIt's the reminder of why I love gaming. I have fun playing it. I love working with other people, particularly sprouts. It feels like a world I inhabit more than pixels representing items and numbers. And the story moved me and impacted me.\n\nAfter I left Everquest, some community issues in other games, with some life issues, I was really struggling to enjoy gaming. It just wasn't as fun anymore and I missed that sense of belonging I had bouncing around Norrath, where I knew the world so well I could navigate from Neriak to Bastion of Thunder with my eyes closed.\n\nXIV taught me to love gaming again.",
            "FFXIV means a lot to me, I actually start playing when BLU was first introduced! Still need to work on leveling it",
            "FFXIV means friendship and the bright spot in my life when there was little else for me irl.\n\n\nI got into it right as I moved to the other side of the country, away from all my friends and family and work offices, to a small town that really doesn't offer much outside of the university that it's centered around. The winters also get very cold, and a lot of the businesses shut down until spring.\n\n\nFFXIV was my main escape and source of happiness during that time. I made a lot of friends, hung out with them, did a lot of fun things, made an FC. Things weren't always happy but I also learned a lot when shit went down.\n\n\nMy irl stuff has picked up again, but FFXIV is still my happy place and a place for me to hang out with my silly little internet friends. I see myself sticking around for quite a few years more.",
            "Final Fantasy XIV to me means a lot of things.\n\n\n\nAs technically my first dedicated MMORPG, FFXIV had a lot introduced to me that I might know now or not know before. From the references of previous FF games through story, enemy names, and entire instances, to being able to contribute to one of the largest FCs in my home server, it always makes me feel at least some kind of positivity whenever I come online.\n\n\n\n I have also been down routes even I wasn't expecting to take. For example, I take some pretty alright screenshots which I am proud of, and every time I want to take a screenshot, I always seem to find and learn something new with GPose (Group Pose) ([Example](https://media.discordapp.net/attachments/623050458247987212/1159294852656283718/ffxiv_10042023_192323_664.png?ex=667185b7&is=66703437&hm=b5e0e62bbae0867655db5e9f82236af32dffc30a8baa123eb5e3de836dd6641d&=&format=webp&quality=lossless&width=1193&height=671)). I don't do commissions though, I just do for myself, which isn't a bad thing either. \n\n\n\nThe game still has a few flaws to work on, but no game is perfect, as is no one. But it's one of the best games I have ever played. There's always something there to do, the community is mostly positive, and if I ever do become bored of it, I can always take a break for a month or three and come back as there's little FOMO (Fear of Missing Out) in this game save the events, and even then they don't happen all the time. \n\n\n\nIn summary, you think you have done everything the game has to offer, and yet there's still more you can do. Crafting and gathering, roleplaying and socializing, high-end raids and content, achievement hunting, and so much more. It is impossible to do everything it has to offer, so only do the things you like to do. And that's why I love this game, because you can be what you want to be, and do what you want to do, it's flexible like that.",
            "FFXIV is an escape to a world where strangers become friends, and communities make you feel at home. In FFXIV, I've encountered the best virtual communities of any game I've played. Thanks to everyone who has made it an enjoyable experience.",
            "For me FFXIV is the greatest RPG story that I have experienced in my life. I have been a fan of Final Fantasy games since I was in my early teens but Shadowbringers and Endwalker have just impacted me so much that it is amazing. Even after the main story is over there are side stories, trials, mini games, crafting, gathering, hunts, and much more that let me try something new or old whenever the mood strikes. The variety in the game is awesome.",
            "For my, it's a escape from the work and problems.\nThanks for the giveaway.",
            "What does Final Fantasy XIV mean to you? (By which I mean me).\n\nIt means a heck of a lot. I've been a fan of Final Fantasy games since growing up as a kid in the 90s. But for whatever reason, I didn't try Final Fantasy XIV until late 2020.\n\nWhy then? Well, the UK had gone into pandemic lockdown for a second time and I was living on my own, needed something to do and had a lot if time on mu hands. So I finally gave it a go.\n\nI still remember the feeling of happiness when hearing the classic main theme when loading it up.\n\nFinal Fantasy XIV quickly became my go to game to relax and forget about the mess in the real world. I made in game friends, I felt like I'd joined a community at a time when seeing my IRL friends wasn't possible for months at a time.\n\nThings are much better now - but Final Fantasy XIV is still my go to chill game. Difficult day at work? Just chill out in game and feel the nice vibes.\n\nI've been playing for three and a half years now and I'll be playing for many more to come*. :)\n\n*And not just because I've only just finished Stormblood in that time!",
            "Thats insane. As someone who was part of 14 since the beginning, its mindblowing that the car crash known as ffxiv 1.0 is something this massive now. Cant wait for Dawntrail! It was easier waiting before but now that its so close, the wait is agonizing.\n\nEdit:Oh, didnt see the question lol. What it means to me? Its changed so many different times throughout me playing it. But what it represents now is a form of stability. No matter how long its been or how much has changed around me, 14 stays a masterful storytelling and cozy familiar place. It gets new content but the feel of the game itself stays the same and i wouldnt trade it for anything. I like Dragon quest for similar reasons.",
            "FFXIV to me is happiness. In this game I also met people who become some of the best friends in real life!\n\nStart to play this game was a very bless for me!",
            "For me, it's a fun world to play around in, grind for cool shit in, and generally just have fun and relax in.",
            "I am pretty new to the game and I treat it as a mostly single player game. I finished ARR early this year and feeling like I reached the ending I then stopped there as if waiting for a better to continue playing the sequel to the game. I love every inch of the game, but I know I am missing out a lot by not embracing the multiplayer side oftnhe game.\n\nSo secondly but more importantly to me, playing this game is also an effort (admittedly a poor one from me) to treat my social anxiety, and to find more friends to enjoy game and life with. I have 0 irl friend here, so it was hard for me during my ARR playthrough and I obviously made 0 new friend even after joining a guild. But honestly the few random interactions i had were kind and welcoming, and there's been very few toxicity over public things like world chat or dungeons party which already is a plus to me. On the other hand I was sometime the one being rude by running away or ignored some interaction out of my anxiety. Hoping to get better following my HW playthrough!",
            "FFXIV to me isnt some life-saving, life-changing, force of nature like it is for some people. It isnt even my favourite FF game. But what it is, is hopping into a discord call, grabbing a couple beers after work and just shooting the shit with my buddies, running dungeons, arguing about whos the hottest character (Its obviously estinien). Its cozy, its home, and ive loved every second of it. 4100 hours across 8 years, heres to many more.",
            "for me, ffxiv is a way to connect with my friends and make some new ones too!",
            "XIV is my comfort place. It has been for years now. For all the criticism I may have about some aspects of the game, I still love it to death: I love how rigid and predictable the schedule of updates is, I love how it looks, the flavour and hints of \"Final Fantasy\" through the MSQ, the amazing fights throughout the expansions, but also the incredible OST. \n\nI don't even have any IG friends, in the end. I'm just a solo player that subs for savage mainly, and also subs once for other major patches. My interest lies in doing clearing the hard content the game has to offer. But, compared to other MMOs, my life doesn't have to revolve around it: I can just play or... not play. Got a busy weekday ? Meeting with friends during the weekend ? Taking holidays ? Sure ! This is not a korean grindfest. I can afford to not think about the games for months, while also knowing when I'll come back. I already know that this savage tier I'll be able to aim for a quick clear, but the next one will be tougher because that's when I'll begin my internship. I'll still be able to enjoy the game, but at a more reasonable pace. \n\nIt has set such high expectations for me when it comes to not only making a great game players would like, but also making a game ACTUAL PEOPLE THAT HAVE LIVES outside the gaming sphere would like that I don't know whether I could enjoy any other online game as much as I do XIV. I would qualify as a midcore/semi-hardcore player, and while I don't really care that much about socializing, RP, very casual content etc, I like that the game caters to everyone somehow while respecting (or at least trying to respect) their time.\n\nI might not play it forever, but I can't imagine a day where I'd stop playing. I would still be interested in following what the WoL & all the other characters would do across new areas, new expansions, and what new raids it will have.",
            "I only got into the game a couple of years ago, but I WISH I had gotten into it sooner. I’ve always been in love with MMORPGs since I was a kid, but I would only be able to play the free ones (which weren’t ever really free because of the hidden paywall you eventually hit lol) since my parents couldn’t afford subs, understandably so. \n\nWhen I finally got a job and was bringing in consistent money as an adult, I’d only ever really spend it on single-player games having lost my passion for MMOs.\n\nThat was until I found a little video on FFXIV blowing up on Youtube. Now, I couldn’t tell you what that video was anymore (yay short-term memory), but I quickly downloaded the game and it’s been the game I have the most hours in, even after taking an almost year break in between. \n\nFFXIV is a fucking great game with a great community. I literally posted a post on here recently about failing in a dungeon and instead of being toxic towards me, y’all shared your own embarrassing stories and made me not feel so alone. \n\nHappy 1M followers WOLs! 🥳",
            "FFXIV to me means inner growth and connections it started as a way to not go stir crazy during COVID lockdowns. But as my WOL grew throughout the story I also grew. The community built in this game whether it be strangers or fellow FC members helped me get better with my anxiety of socializing. It was a small step in my ongoing journey to overcome my anxiety and agoraphobia but one of the first ones I took and an important one to me. Who knew overcoming the panic of just barely managing to type, \"first time\" in a new duty would slowly get the ball rolling in being able to advocate, stand up for myself, and move halfway across the country. My WOL was there through the whole journey and changed just as much (thank you fantasias and MSQ). And I can't wait to see how me and him continue to grow during the new few years of Dawntrail.",
            "View in your timezone:  \n[June 24th, 2024 at 3:30 PM EDT][0]  \n\n[0]: https://timee.io/20240624T1930?tl=%2Fr%2Fffxiv%20has%20reached%201%20MILLION%20MEMBERS!%20Come%20celebrate%20the%20upcoming%20launch%20of%20Dawntrail%20with%20us!",
            "First MMO to get into high end content and make actual friends.  \nFor that I am really grateful.",
            "A time-sink so I don't do things a lot of people are going to regret RL.  That's, really, about it...",
            "FFXIV to me was a way to connect with my family. I joined the military at 17 and kinda left everything behind, but my brother, sister-in-law, and mom all played FFXIV together. After things settled down, they invited me to play with them, and it's been such a great way to be together even when we are far apart from each other.",
            "For me, FF14 is always gonna be about the feels. CBU3 loves to pepper in emotions with hopeful motifs, and I reciprocate that love every time I see it.",
            "FFXIV or how I write it is FF14 is such an amazing gaming experience. This is game has really brought me back to my childhood on why gaming provides such an amazing experience. \n\nI am only a free trial member and currently going to Heavensward but I’ve read every single dialogue and have truly immerse myself in the world building and stories. This game feels like an adventure and I am the main character. The music brings an atmosphere like I’m actually in a real fight and exploring a vast world. \n\nI am disappointed in myself I didn’t get to experience this at a younger age and have waited so long to experience this journey. \n\nFF14 means living life to the fullest and experiencing it. I believe the world we live in today, we look and swipe and move on instead of just appreciating what’s around us and taking it all in. This game has really allow me to reflect on life and to enjoy whatever comes my way. \n\nThank Square Enix. From Kingdom Hearts to the world of Final Fantasy, this is what gaming is. \n\nProviding an experience that is like no other.",
            "For me FFXIV is all about bonding with my partner. It's been our go to game to play together since 2014 and we've done just about all there is to do in the game together. That's why XIV is so special to me. :)",
            "This game has been a part of my life for so long.  Finishing college, getting married, having my kids.  It is just as much a part of me as the other parts of my life now.",
            "It’s how I got through covid as a high school student, and it was also where I met many kind people who treated me better than I would have ever imagined. Especially since I was only around 16 at the time and didn’t have anyone my age to play with at the time, there were so many late night memories and fun experiences that I tried with my FC mates that have still stuck with me 5 years later. When I was at my high school graduation without any friends, they were there for me too to cheer me up. In the game, without them I probably wouldn’t have tried raiding or be so enamored with screenshots/glamour. I’m sad that those days are gone since some have continued onto a new chapter of their lives, but I’ll always remember this game as having such kind people who really made up a large part of the end of my childhood",
            "Thanks for the giveaway! I think I just hit my 9 year anniversary of starting my FFXIV journey, and I think it's incredible how far both my WoL and my IRL self have come since then. Hydaelyn has become a second home for me. And I love seeing the creativity of the community! I love how people bring their WoLs to life through roleplay, stories, and art.",
            ">**What does Final Fantasy XIV mean to you?**\n\nFF14 might be my favorite FF title; I flip between this one and FFT for that spot. Not only is the story really good but there is always more of it coming. It's also the \"latest\" FF game I feel inclined to play since newer installments have gone more into the ARPG direction (which is something I dislike). It's definitely not ideal but the 2.5 cooldown alleviates my disdain for action combat, lol. In any case, I have great memories of playing the game either by myself or with friends, and I hope that it continues to be so.",
            "My general experience with online games is my brain fixating on the idea that if I'm not constantly playing, then I'm losing. Which meant I've avoided mmos in general. After years of reading that FFXIV is good, actually (specifically as a Final Fantasy game), and getting pestered by friends who were picking up the game, I picked it up.\n\n\nWhat has been amazing is I've never felt that with FFXIV. I just play it a lot because I enjoy it. I've taken breaks and I've picked up a bunch of other games in the meantime, but I keep coming back as it's my go-to game. It has plenty of options to chill out or for more intense options, which helps as well.\n\n\nAs of a few months ago, I caught up to current content and have recruited 3 people actively into the game (2 of which hit post-EW credits last night). This has become my favourite Final Fantasy and is one of the only games to ever make me feel the variety of emotions that it inspires.\n\n\nIf you're reading this and you're on the fence about this game, the free trial really does give you 90% of the experience so I would suggest trying it out",
            "I have made lifelong friends through the game. People I hang out with online even if we aren't playing ffxiv. I got reaquainted with old friends through the game, too. It is not an exaggeration to say it made my life so much brighter and better thanks to those connections and relationships, especially when we were dealing with the Covid-19 pandemic.",
            "FFXIV has brought me closer to a couple of longtime friends, including one of my closest friends. We've kept in touch for more than ten years in the same, evolving friend group, but kind of on the periphery. I started FFXIV about three weeks ago and I've been having so much fun - from flying around on my friends' ridiculous mounts, to alternatively struggling and breezing through Leap of Faith, to experiencing the kindness of the random party members when I tried out conjurer and we wiped in a dungeon, to being confused by the mechanics of arcanist. There is just so much to explore, and I look forward to the many memories I'll make with my friends in this game.",
            "FFXIV is friendship, camaraderie, and new friends. I joined a random FC invite on a whim and got friends that waited for me at the UT flowers, join me for games outside of FFXIV, throw friendly jabs at each other while doing stuff, and have helped me through some difficult times. The game itself has helped me through some bad episodes of depression and anxiety with its messages.",
            "FFXIV is where I pour my achievement hunting and game collecting tendencies. I've saved hundreds of dollars (and poured thousands of hours) by playing FFXIV instead of whatever flavor of the month game I used to play.",
            "FFXIV will always hold a special place in my heart because it has helped me get through the darkest period of my life. \n\nIt gave me something to look forward ro when the future looked bleak and terrifying. It helped me process grief and trauma with its amazingly deep storytelling. My little journey started when I asked my friends, \"Hey, I need a game recommendation to distract me from reality.\" They suggested FFXIV, which became much more than just a temporary distraction. This game feels like home now.",
            "FFXIV is a lot of things to me. Coming back proper after a few years.. Before it was everything. Friends, family, an escape. Now, it's a new beginning, or maybe just a chance to restart. \n\nI'd like to build up my little personal community again to make it what it used to be.\n\nGoing to Fanfest in 2016 was crazy. I hadn't realized just *how many* friends I had made through other friends and from server hopping and joining FCs. I'd like to have that community again and rebuild it as a new dawn arises.",
            "FFXIV is an interesting beast. After hearing about 1.0 flopping, I wasn't interested in playing for years. Eventually some work buddies were playing and that got me interested. Since I played a bunch of MMOs before, I had an idea of what to expect, but getting into the game in Stormblood blew me away. Not only was SCH the perfect job (RIP SB SCH), the story, how pretty and detailed the world is, the music - it was all fantastic. XIV continues to be my favorite MMO and I don't see that changing any time soon.",
            "Final fantasy 14 has been by my side for like 9 years now, crazy to think. For one it's my favorite FF game and my favorite mmo, the stories in this game are beautiful. I'll always remember my boy emet. And I've known my WOL for so long they're basically like a sibling xD \nReally hoping for this to go on for a few more expansions!",
            "FFXIV means a game I can lose my rime in with no worries. Good social moments!",
            "Final Fantasy XIV is how I reconnected with an old friend from high school. \n\nI met him by happenstance in a grocery store 1500 miles from where we grew up. He was vacationing, I was getting a few snacks for my upcoming days off. \n\nHe hit me with the \"Have you heard about the critically acclaimed MMORPG...\"\n\nI told him I knew FFXIV was an MMO and that's as far as my interest went. He went on (and on and on) about how XIV was different and I could try it for free if I wanted. I figured free was a good price point for a game I'd probably only play a couple hours. \n\nThe next day he came around to say goodbye before heading home and I showed him my character. I had just saved Swiftperch. He gave me a few tips on being a Maurader and tanking in general and promised to catch up with me when he got home.\n\nNow we're closer than we were in school and we spend most weekends doing old content together. It's been fun winding each other up with theories about Dawntrail.",
            "Man, how long has it been? I remember starting out with the free 30 day sub time through Twitch Prime, finishing ARR within that time frame. Back then I couldn’t afford a sub consistently, given I was still in university.\n\nFew years later I got an email about a callback campaign and then I remember what I enjoyed about the game. It was FUN. And after that it has kept me subbed ever since. There is no other gaming community I’d proudly be a part of than FF14’s.",
            "I, like many others, have found my partner on FFXIV. Now it'll always be a part of our lives even after it's shutdown X years from now.",
            "An increasing reminder that I have nobody to MMO with.",
            "Final Fantasy XIV to me means a wholesome community, a place where I made so many friends and a place that I can share with my partner!",
            "Means a lot of things, learned english with ff7 and ff tatics, learned guitar while trying out some of their more iconic songs. And hell I've been playing mmos since ultima online and ffxiv was the one I found a place to stay.",
            "> \"What does Final Fantasy XIV mean to you?\"\n\nFriends, really.\n\nI remember starting 1.0 with a friend, though we both fell out of the game for fairly obvious reasons at the time.\n\nI decided to come back later on when the game went free, just to see what it was like and what was going on. The result is multiple people, even just from 1.0, that I still talk to constantly and game with. In the transition to 2.0 a few followed to our current server, we met more people, neighbors to our FC, etc, and I easily have over a dozen people I hang out with regularly that I would have never met or known otherwise.\n\nIt's a place to goof with them, to get consistently rescued into damage and holes by healer friends. A place to mess with housing designs for others to get to hang out in and hopefully enjoy. A place for a character that's been with me, mostly unchanged, for nearly 14 years (though Hrothgals make taking one of those two decade+ old fantas tempting...).\n\nThe game itself represents a unique title in its genre for how integral the storytelling is to its experience, and how *well* that story is told to the player. There's plenty of criticisms I have for the game even to this day, but it is both unique and unmatched in that regard. No other MMO offers that same experience.\n\nHonestly would be something of a miracle to land a copy since finances suck right now, but either way I hope people find all the fun and adventure they're hoping for in DT whether they've already purchased it or win their copy here.",
            "FFXIV means so much to me. It is my safe haven from work, it is where all my friends are, it is the place to go to when the real world can be to much. It is just a great place to be.",
            "Honestly FFXIV has been a safehaven for me to just relax and play however I want. It's been so freeing to just log in, RP in a cafe, go on an adventure, play some roulettes with FC members, or anything else I can think of and not worry about IRL stuff going on. Love it and will always love it.",
            "To me it means you don't have to sacrifice a good rpg to make a great mmorpg",
            "To me, ffxiv means unity. The way the players aleays find ways to do stuff together, wether it be charity events or random shenanigans in towns. Never change, guys and gals <3",
            "Ff14 means my first mmo with to much to do, free trial gave me 1200 hours alone such a great game",
            "Eorzea has been more than a map drawn within a fictional world. Eorzea is a beautiful, safe, wonderful place where I will never regret spending so much time. They say that you always go where you were happy and Eorzea is a good example for me, since I always end up coming back and feeling happy again. Not even the language or the lack of a South American server are an impediment for me, nor will they ever be, because I can adapt to whatever difficulty is necessary in order to feel this complete once again. Final Fantasy XIV is my favorite online video game and I love every second I spend in it.",
            "Ffxiv means to me some dopamine. \nGetting a new minion: dopamine \nGetting a new mount? Dopamine\nMount still not dropping? No dopamine... \nGrind for rss... Dopamine \nPeople buy my overabundance of gathered and created stuff? Dopamine \nSaying hi to my FC: dopamine \nRunning around in a skimpy glamour? Dopamine \nFishing: depends on rngesus... I will one day catch you coral Ray and I will make sure you're always on my wall. \nShiny tool: dopamine \nAlso it means crying bc I'm sentimental AF. So many different storylines making me cry or tear up. \nAnd .... Memories of weird stuff with people.",
            "FFXIV means friendship and amazing experiences I could never trade a lifetime for.\n\nNot being able to have my wedding in real life but having all my real life family and friends come to our wedding in game was an experience I would never trade.",
            "Such a good game, I started playing a maybe 5-6 months ago and I didn't expect to end up liking it so much. Almost 3.2k hours at this point.",
            "I played WoW for a bit in the late 2000s/early 2010s and I played Destiny for a while in 2014/2015 (I know not technically a MMO but similar). I said I was done with MMO-type games after that but I decided to give FFXIV a shot in early 2021 and got hooked pretty quickly. I think it is because FFXIV is more casual than those other games and feels less like a job, which appeals to me. Also the community is much more welcoming. Now I play regularly with a group of friends and we're all eagerly waiting for Dawntrail.",
            "XIV respects my time to grind for cosmetics, and there's plenty to get to spark my little collector synapses with.\n\nI just like the token system and the ability to _eventually_ get the shinies, rather than spend actual years on a 1% drop chance. Makes me want to actually play and engage with it instead of treating it all like a checklist!",
            "FFXIV to me is an opportunity to explore a world with friends together despite how far apart in the real world you may be. It’s a way to seek accomplishment when real world endeavors may fail or weigh you down. The game brings me a way to be a master craftsman without making a mess of things around the house. It’s also a reminder of times long gone but not forgotten of playing FFXI.",
            "FFXIV was the game my husband and I chose to be something we do together. We've been playing since ARR early access and it literally means over a decade of laughs and fun with my favorite person.",
            "Glad to be part of the journey and thank you for the giveaway!",
            "wow I had no idea so many people enjoyed watching video games",
            "Gooba gabba, gooba, gabba, one of us, one of us\\~\\~\\~",
            "FFXIV is not just a game for me but a fun world where I can explore and be myself freely while making new friends! I am still relatively a new player but I've been enjoying this wonderful game and it's community. Congrats on 1m members!",
            "XIV has always been an endless source of visual, narrative and emotional inspiration to me. Been playing since Heavensward, through the highs and lows of story, content and job identities and it's so nice to have been here for so long and experiencing iconic moments firsthand. Raubahn EX, Bowmage, stance dancing...I remember it all dearly and hope to witness a lot more.",
            "Well FF14 managed to break me from circle of hate and suffering also known as playing League of Legends",
            ">What does Final Fantasy XIV mean to you?\n\nI've never got the chance to get into WoW in its prime because I was too young and my parents didn't understand why they should pay 13 €/month just for me to play a stupid game lmao. Fast forward a few years and I've read about Final Fantasy X in a video game magazine, you know I was the typical nerd in school, not manx friends, gets bullied you name it. Gaming was a form of escape for me and FFX came in a perfect time, I absolutely fell in love with the franchise.  \nFast forward a few years again, I got older, made friends irl and online, life is finally good and then I've heard of FFXIV - a Final Fantasy mmorpg?! I've got to play this! Read a lot about it and and most of it was super negative lol. Just when I was about to buy it, servers got shutdown. But then I've learned about A Realm Reborn, how FFXIV is in fact not dead but is getting a major overhaul. I followed this project over the following months but unfortunately couldn't get into it straight away in 2.0 but with 2.1 I **finally** was able to get the game and my. It was love on first sight. I was 17yr old when ARR was released and I'd found my online safe space, FFXIV immediately became to me what WoW was for others, my forever mmorpg.   \nFast forward a last time, Dawntrail is just around the corner, I'm 30yrs old, married, life is even better and FFXIV is still a part of it. I'm happy to be part of the journey and can't wait to see what lays ahead of us :)",
            "Its a place some of my friends and I have in common. Outside of XIV we don't have many shared interests.",
            "FFXIV means will to improve. Your WoL is a nobody who wants to become an adventurer, willing to help anyone with any task. In the process, you learn new skills, new things, make new friends, enemies, allies, to eventually become better than most ar anything, yet humble enough to seek people to help you. \n\nThat translates to RL. I played Ultima Online, Everquest, FFXIV, and WOW, and never tried any class or role where I had any responsibility (i. e. healing). FFXIV allowed me to try both healing and tanking, and helped me find support to help me improve on both. \nI’m now a main WHM, and will remain so until the servers die, and yet can play any job as needed by whichever party I join.",
            "FFXIV means comfort to me. Final fantasy has been in my life for 25 years. I have a chocobo and Moogle tattood on me. Playing in a Final Fantasy world with other people is just an incredible experience and now I get to enjoy it with my girlfriend too.",
            "FFXIV has been something I've played since I was in high school. I originally rejoined with friends after the trial, and then when things went unexpected, I ended up branching into a free company of complete strangers who became my really good friends at the time. Especially in HW, I found myself loving to improve my gameplay as much as I could, and it really revealed the perfectionist nature I could have for something I loved.\n\nNow, I mostly play as a solo player without a free company. I've grown away from the people who helped me enjoy the game long ago, but I'm thankful for them being there at the time. I love to see new players be as excited as I was. \n\nFFXIV is a change that never feels unfamiliar to me. No matter where the story turns, no matter how jobs are changed and altered, for good and for bad, I can always look at this game and feel like it's home no matter how long of a break I take from it. :)",
            "I don't want to enter the contest, as I already purchased the expansion, however I will answer the question.\n\n\n\n\nThe game to me means friendship. I've met some very good people in this game, and it's predecessor, FFXI. I just think the game, it's characters and story are the embodiment of friendship.",
            "What does Final Fantasy XIV mean to me? well,  as a new player it means friendship, having fun and being in good company.",
            "It’s a global and personal shared experience which draws upon all walks of life. My FC owner is a Dad in his mid 50s who lives on a rural farm. I’m a city boy in a different state less than half his age.\n\nJust one of the many ways this game connects people. I’ve met so many good folks irl due to it.",
            "I started playing FFXIV after 2 years sober from a crippling drug addiction, right when I was getting through a dark time in my personal life. Not only did it help me overcome my issues, but the community was the best and most helpful gaming community of my life. This game has made a friend for life.",
            "Its a fun way to keep in touch with friends",
            "For me final fantasy xiv is a social place that I can meet up with people from all across the world. Whether they be irl friends, or someone I just met lounging around limsa. I love how xiv gives me an amazing space to meet cool people",
            "FFXIV to me is an escape this is where I can truly be myself and Enjoy things.",
            "Time to relax and play with friends forgetting about all the stuff outside for a while.",
            "FFXIV to me means comfort. I've been playing the game for over 5 years now, and I still remember the first day I logged in. I was so amazed by the world, and had never played a game like this before. There have been countless nights where I've been in my room in the middle of the night, going through the storyline, and later dreaming about it, being excited to continue the next day. I've done role playing with my characters, and am honestly just glad to have discovered the game.",
            "XIV means to me that making friends always ends up with you getting ghosted once you stop being useful to people.",
            "FFXIV has become my go to game. It's the game that even when I'm not actively playing, I stay subscribed and installed, because I know that I'll wanna log on and do stuff. It's introduced me to a lot of new, wonderful people. Even with all its problems, FFXIV is my favourite game, and Eorzea is honestly one of my favourite places to be.",
            "What does FFXIV mean to me... Where do I start...\n\nI've been a Final Fantasy fan since FF7 was release for PC. Back in the time, my cousin had it and his video card drivers were broken so we watched the CG movies upside down.\n\nFrom there I got my version, and then started my emulator journey. Did FF5 strange translated ROM version then did FF6 which I still think overall is the best FF. Then did the modern Finals did 8 in PC, then 9 in the ps2, I bought a lot of ps1 games and played them in the ps2. Then did FF10 and finally got my first experience the the MMORPG games. When my other cousin bought FF11. Love at first sight.\n\nI played FF11 for looong time, in between I played 12 and 13. And eagerly waited for 14 which I didn't had a good PC to play it, but I was able to run it. I played until lv 20, my laptop was just screaming at me, so I pause it and continue my life at Vana diel.\n\nCircling back to ARR and the launch in PS3. Since I was a legacy PPL I had to stay in the Legacy data center. While my brother decided to start fresh in the new servers with his buddies. I kept telling him that, I get a feeling they'll let us play together eventually... Which they did! I got my char transfer to Adamantoise, and finally we were able to play together!\n\nStory not over one more story to share as one of my most treasured memories. They day of my wedding, it was the release of 3.1. My brother wanted to do the first dungeon together, so we both woke up pretty early, watch the last 4 episodes of Avatar the last Airbender (epic finally) while we did the first dungeon together. As soon as we were done, we and rush to get ready, and finally started all the wedding stuff.\n\nNow at days, he is finishing his medical degree, and me with 3 kids and moved to another country. I'm the only one that keeps playing, but the love of the game and the franchise is still there. One of most recurring topic is FF14, we discuss the patches, the stories. How did you get I experienced the game. Hopefully life will let us play together one more time.",
            "Oh wow I'm amazed at how the growth of the subreddit went from 50k per year to 100k per year, and it seems we're about to reach 200k per year!\n\nI don't care for the contest but I'll regale what FF14 means to me anyway. Note that I started playing on Q1 2021.\n\nTL;DR - FF14 lines up with my preferences, and it gives me endless opportunities for self-expression. \n\n+++++\n\nAs someone who draws anime as a hobby, and likes pretending to be an art style taxonomist of sorts, I only watch anime and play video games with art styles that specifically line up with my preferences. I grew up on Capcom and Square Enix games, so ofc the FF14 art style is right up my alley. I've also had a blast with FF14's plots over the expansions. We ended a war started by our ancestors' sins, had a lot of political drama, and pondered about memento mori!\n\nI'm obsessed with similarities and references, so I express myself through references in glamour, housing, and music.\n\nMost of my glamours are cosplays, to express my interest in the characters cosplayed. I have Simon the Digger on MCH, Ryunosuke Naruhodo on SAM, Gerudo Link on DNC, Tsubasa Syaoran on MNK, No.9 YorHa Boys on WHM, and most importantly, Cloud Strife on DRK, Clive Rosfield on PLD. Currently eyeing Let Me Solo Her on VPR. My DRG is the Odin armor but with a spear, but the reference here lies in the gearset name—Odin Spear, a pun on... Odin Sphere.\n\nMy Ingleside apartment is a room filled to the brim with magitek. I have the G-Warrior, Ultima Weapon and Sapphire Weapon figures on display to show I did Sorrow of Werlyt (FF7 x Gundam was a blast!!!) and also the Forever By Your Side painting. 🫠 I made space for the Emerald Weapon because Marida Cruz/Kshatrya. I also have stuffed 2B and 9S, and my phasmascape is a moon. At first I put it there to reference Endwalker, but I kept it because Moongazing/Tsuki wo Miteita.\n\nMy Small house is a Highland composite house, meant to allude to the medieval style houses in the Rosalith. Inside is a starlit barn, a reference to a very specific cutscene in FF16. Interestingly, the crossover gave an orchestrion roll of the song in that specific cutscene! It's called \"Who I Really Am.\" The basement is a cave filled with white glowing flowers, a recreation of... Emil's Memories.\n\nMy FC Room is a failed attempt at recreating Clive's Quarters. I swear I'll need a large for that sh.\n\nI picked ARC as my first job so I can be BRD ASAP. The first music I played? The Price of Freedom. I've since practiced many songs, 80% Hiroyuki Sawano, 10% Soken, and the rest are other stuff like Uematsu/Yosh's Hollow, Survive Said The Prophet's MUKANJYO, and... Zero's Sacrifice! No not *that* Zero. The one who wears red armor and has a bff called X... No, not Twitter. Mega Man Maverick Hunter X!",
            ">**\"What does Final Fantasy XIV mean to you?\"**\n\nWe all have a motivation, whether it be enjoying the moment, spending times with friends, seeking recognition or curiosity over the characters' journey.\n\nMine however couldn't be more different as it is very self-oriented even though I helped more than a hundred or two players and met far more, while playing with countless others. My motivation is but very simple : improving, being a better person, extrapolating any knowledge the game has to offer.\n\nFor many players, \"improving\" is a mathematical or mechanical prowess that ends up having better figures : clearing more stuff, more achievements, or having a higher DPS. That's not what I meant at all and improving, in my opinion, is tightly linked with **responsability**. If I enter an instance with other players, I make it a personal matter to clear it as soon as possible, even if it means creating macro with sound effects to indicate whether something requires to spread out or to share damage. Explaining a boss is much more important than having a high DPS (which is simpler to achieve) and using a healer's or a tank's supportive skill to save someone offer more victories than good crits. Responsability is a driving beacon ; it makes us reliable and allows everyone to... Improve as well.\n\nBeing a better person not only requires being informative, but also understanding. Most people don't want peremptory advices so I usually stick to general pieces of information (if a tank's struggling with mits while trying his best, I simply tell him/her how I'd use mine ; same for healers' CDs and DPS if they seem to want a piece of advice) to achieve my role as a mentor. What I really enjoy though is **teaching** people I'd spend more time with, seeing their progress over several dungeons, extreme then savage so they can be ready for ultimate encounters. Trust me : being able to teach is a reciprocal pleasure !\n\nLeading, teaching are the main reasons why I play FFXIV because they are *skills we use outside of the game*. And there is more : the story also, as every story does, have **insightful knowledge**. My country right now is on the verge of *yielding to the temptation of the apparent easy solution of foreigners rejection* ; FFXIV gave me thorough explanations as to why it's so important to aim at the root (which are institutions failings) just like Garlemald have its issues. I could give you DOZENS of examples. Just seek out your own ones. See in the conflicts in-game how they describe your everyday clashes : FFXIV provides many pieces of wisdom we too easily shake off. I'll simply tell you this : they are far more valuable than you'd think at first.\n\nFFXIV as an MMO has much more to offer than landscapes, numbers and thrilling experiences. It is a **reflection** of our World but we very much can become whatever we deem worth the efforts. Regardless what we achieve, it helps us grow and as such, I strongly encourage you to also rise to the challenge and let it improve your personnality, your qualities and your overall aspiration as a person.\n\nThat's what FFXIV means to me, it's a vessel that allows us to let our humanity shine. And so can you ! Let your humanity, in the best possible way, be your guiding light.",
            "Congrats everyone! And good luck to you all.",
            " **\"What does Final Fantasy XIV mean to you?\"**\n\n  \nTo answer that, i have played MANY mmorpgs in my time. all f2p, grind, fomo trash (elsword being the main one.)\n\n  \nOriginally i got turned off by the subscription, but honestly, i'd rather pay about 40 quid a month than play FOMO garbage.\n\n  \nFF14 reignited my love for mmos. and i fully enjoy this game",
            "FFXIV has, by far, the best community I have ever seen in a game. I like how almost everyone will wait for cutscenes to let others enjoy the story.",
            "I started FFXIV after TERA died. I was not sure if I would enjoy FFXIV as it would be a brand new journey, so I named my character “Dawn”, to mark a potential new beginning.\n\nAs soon as I got in, I felt so welcomed by the world, the community and the story. I quickly fell in love with the game and it became my “safe space”.\n\nNot any other game makes me feel that way, which gives FFXIV such a deep meaning to me.",
            ">**What does Final Fantasy XIV mean to you?**\n\nDespite my *many* complaints with the game and its community, I've played on and off since ARR launch and have had a relatively good time with it, enough that I don't stay away for long. So I guess to me it's just a comfortable medium to return to when I don't have much else going on in my life, or I've gotten bored of other games.\n\nI like the game and while I don't think it's *amazing,* sometimes all you need is a cozy fallback to lean on.",
            "FFXIV will always hold a special place in my heart. Back in 2013, I played it on a PS3 with my friends during our last 2 years in school. Ifrit gave us a hard/long time to complete (because we’re dummies that didn’t want to watch guides and never played MMOs). The game created unforgettable memories, I always look back at ffxiv and remember how much it actually means to me. \n\n\nCongrats to this sub for reaching 1mil! I don’t really want to be included in the raffle just happy to be part of this wonderful community.",
            "FFXIV means a place to play, a game the enjoy and a routine to habit.\n\nAll the good things of an MMO.",
            "FFXIV is where I met my besties and I am so glad to still be playing this game with them today!",
            "What does FFXIV mean to me? It means having somewhere to be no matter what my mood is. When I needed something to focus on singlemindedly rather than wallowing in a depressive slump. When I want amazing music. When I want a challenge. When I want to set myself stupid goals. When I want...friends.",
            "FFXIV means the world to me. Met so many people, some of which helped me through the hardest parts of my life.\n\n\nHave also learned many lessons from the various encounters with everyone. Learned who my real friends were. How it's best to be cautious when letting people get close. How to handle trolls 😂\n\n\nBut the story has helped me as well. Endwalker felt like the end goal was to battle depression and come out of the darkness. I cried so much at the end of 6.0 content 😅\n\n\nIt's also nice that SE has adapted with the flow of things so well, it's hard not to love the development team. They express their love for this community all the time and actually listen to everyone's input. I have never seen an mmo team so dedicated to their fans.\n\n\nThough I still have to finish up all the patch content, I highly look forward to this next chapter in the story and all the wonderful people I'll meet along the way.\n\n\nA huge thank you to everyone for being such a loving and supportive community 💜💜💜\n\n\n~Forsaken Nocturne of Faerie",
            "Final fantasy XIV means fun time for me.",
            "Community, friends, and fun!",
            "What FFXIV means to me, is a really fun epic adventure to escape the world we currently live in temporarily. Also and most importantly the music. This game has the best music soundtrack of any game I have ever played.",
            "Just recently joined, and to me it feels like nostalgia. Being 12 again hopping on just to be excited to type in the chat “hello everyone”. Seeing everyone in main cities playing music and dancing, the uniqueness of the universe is so much to grasp at first but instantly feels like home. I don’t know where I’ve been all these years, but coming to Xbox has brought me into a whole new world of possibilities I never thought I needed. I’d spend hours just chatting with others, or exploring the world. Dressing up my character, the housing, the dungeons, everything feels so brought together it’s like the missing puzzle piece I’ve been looking for when it comes to my escape from the world. I’m a father of four, I work a lot, and FF14 has never failed me to enjoy the little time I do get to “get away”. It’s a breath of fresh air everytime I log in. \n\nPlus it has catgirls. Can’t beat that. \nThank you square enix for an amazing journey I’ll remember probably forever <3",
            "To me, FFXIV is a safe place. A place filled with friends and people with kind hearts who can easily make me forget whatever I’m going through in real life. It’s a place filled with magic and inspiration to do - and be - better.",
            "Ffxiv means the world to me since I met my GF on here and things have been even more fun ever since we started playing together.",
            "Ffxiv means balmung erp sessions with my healsluts ",
            "I'm an old player. Had characters in beta WoW. I played through to Wrath and then took a break. I was suggested by my buddy to start up FFXIV when it came out, in ARR. \n\nThe game means a lot to me. Many years ago I was part of a really fun guild. We played through ARR, did some of the old raids, but as with most things the guild fell off; people left.\n\nI've played solo for a long long time. The world itself has meaning to me. My apartment has a decoration given to me by an old friend and every time I log in I remember them.\n\nTo me it's just a beautiful world that, while I don't take an active part within the community, I get to sit back and watch the joy. And tank for random teams, and just have fun. No pressure, no drama.",
            "Final Fantasy XIV helped get me through the pandemic. More than that it helped me make really good friends that mean the world to me.\n\nIt has quickly become my favorite piece of media of all time and means more to me than I'm honestly able to express with words.\n\n[Me and my friends](https://imgur.com/a/ZTiH7lH)",
            "FFXIV means a love letter from my favourite universe, romance stories that made fell in love and cry, villains who i love and hate and the same time, protagonist that i would protect with my life. As FF is my life so it is FFXIV too",
            "I've played games ever since I was 4 years old, and to this day none captivated me as much as FFXIV did in all of it's aspects. The story, the gameplay, the content, the friendships I've experienced, all of these things shaped this game into a world I made many precious memories and had incomparable amounts of fun, tears and joy no other game ever gave me. In FFXIV I didn't only level up jobs and conquered enemies, but I also leveled up myself.",
            "FFXIV has meant a lot of things over time to me.\n\nI remember hyping up my friends for 1.0 and playing the beta.  As a long time XI player, I was excited to journey into a new world.  I played through the game, despite its faults, and enjoyed it for what it was.\n\nWhen S-E announced a leadership change and this relatively \"unknown\" person named Naoki Yoshida was put in charge, I was extremely worried. But in a matter of months he earned the hope the very small community here had been feeling.\n\nBeing a part of the transformation and relaunch and seeing my name in the end credits of a Final Fantasy game as a Legacy member meant the absolute world to me.\n\nOver those next few years, with each expansion that hope and perseverance of the early days changed to excitement and dedication. Seeing this massive saga unfold in-game while having been through the very real-world game changing development is such a unique experience in an industry that sells unique experiences.\n\nThe friends and memories I have had since then have only continued to strengthen my feelings of the game.  I might take an occasional break to play other games, but I never go more than 1 or 2 months without logging in and playing, which usually leads to a full headfirst dive into the game again.\n\nCrazy to think that counting back to the announcement, it's been over 14 years of Final Fantasy 14 and looking forward to 14 more!",
            "FFXIV means adventure! I met someone in FF from the other side of the world and we fell in love, which meant I moved to Europe from Canada and even learned a new language in the process! It’s been a wild ride and it’s all because of this game. We plan to get married next year :)",
            "FFXIV was a covid lockdown pick up for me. I've greatly enjoyed the story and seeing bits of my favorite Final Fantasy games woven in parts of this one. I've greatly enjoyed meeting and playing with some amazing people that has lead to some IRL friendships, as well as reconnecting with old friends that live far way who also started playing FFXIV. This game provide a chance to build new friendship and stay connected with old ones while we were all stuck in our homes.",
            "FFXIV is emotional trauma that I keep happily returning for more of.",
            "It's where I can be myself. My trans siblings will know exactly what I mean. It's comical how fretful I get when it's maintenance day. 💜",
            "FFXIV means to me:\n\nIt means family and community. My brother and I have kept close because of this game. He introduced me to it after the reboot and we haven't looked back since.  Not only that but I love the people I meet.  Not only during the pandemic, but any time of loneliness in my life, the people online have been there for me (save a rare troll of course) and bolstered me in every way.\n\nLove this game, love this community, love that I get to share it with the people most important in my life!",
            "Its a fun game to raid with friends.",
            "FFXIV has brought back so many good childhood memories. Brings back the feeling of playing games as a kid and how excited you’d get to play the next best thing you. Feels like Christmas morning at 7 years old. I haven’t been hyped as much as I have been for Dawntrail in a very long time. Can’t wait to take the next step in this incredible journey.",
            "FFXIV means so much to me. It's an escape from the real world's hardships. It's sometimes about silly little games to win silly virtual money to buy silly little prizes but other times, it's about telling a story and teaching lessons through it. I was in a rough patch of my life when I got to Endwalker and when I reached that last zone, it filled me with hope. It showed me that bad moments are just that: moments. They aren't eternal and they are necessary. All lives have bad moments so that they can have good ones.\n\nI am also glad I got to meet so many amazing people and vibe with people that like the same things I do. It's very uncommon IRL where I live.",
            "The only MMO I had played for the longest time was Black Desert. Friends started going to FFXIV and at first, I had no interest. I didn’t know if I’d like the play style. However, my fiancé and I went together and gave it a shot. We started in February of this year and it’s the only game we play now. FFXIV has become our game that we enjoy together. We go on new adventures every day and it’s been so amazing. We recently finished all the sight seeing logs (screw you ARR ones!). We are currently working on learning all the skills for blue mage, as we hope to explore beast master in Dawntrail. We enjoy mount farming and our main goal someday is to get as many achievements as we can. We both have 70% of the Triple Triad cards. We both get so angry at NPCs that cheat with multiple five star cards. We are excited to see what awaits us in Dawntrail and I’ll have to find pictures of our adventures. Best of luck to everyone else, and I hope this expansion brings you as much joy as I hope it brings us. \n\n“Do not squander it- the legacy I leave you.”",
            "It's the game that has, so far, prevented my suicide. \n\n\nHonestly I think that says it all for what the game means to me. Good game.",
            "It's kind of crazy the amount of members has gone up by a full order of magnitude since I first arrived here. That's a lot of people.\n\nMade so many friends (and more!) over the years, the game's really quite like a second home. Whether it's killing Nael in the early morning hours of June 2015 - after sunrise, having gone the whole night - or bapping ucob after entirely too long a buildup, there's been nothiing that had me invested quite as much as this one.",
            "Its probably the closest I'll ever get to having a forever game/homebase game.",
            "After spending so much time in FF14, it means comfy to me.",
            "Lalafells",
            "It was my first MMO (except for the free trial of FFXI, which quickly frightened me away from the genre). \n\nI started playing on PS3 while I was in grad school. I have fond memories of logging on after school/work, listening to Joe Rogan Experience (back when that podcast was actually good), and leveling my monk while learning how to play. I actually dropped a class just to make more time to play, lol. \"Step aside, advanced stats...the world of Eorzea needs me,\" I said.\n\nAnd the MUSIC...fucking amazing. It's gotta be one of the best soundtracks in gaming history. The Ul'dah theme will always instantly transport me back to 2013 in my mind.",
            "To me Final Fantasy XIV is food for the soul. It's a love letter to both the games and MMORPGs I grew up with. One of the last few games where it feels like I can be part of a massive community in a genuine digital world and not just another lobby game.",
            "Can I have some friends please? Haha",
            "How much I love stories like these, I wholehearted wish that you have a wonderful life together",
            "You first need to get the achievement of: \"talking to strangers\""
        ]
    },
    "I swear to God I am a straight male but this is the hottest video game character I’ve ever seen": {
        "title": "I swear to God I am a straight male but this is the hottest video game character I’ve ever seen",
        "score": 385,
        "url": "https://i.redd.it/dh9sa85tv28d1.jpeg",
        "content": "",
        "num_comments": 120,
        "comments": [
            "Final Fantasy men have been making me question my sexuality for 12 years and counting",
            "Shadowbringers: Man Emet really missed his friends\nEndwalker: Okay he really misses at least one friend and like I'd of probably set the world on fire for Hythlodaeus too ngl",
            "\"This is my boyfriend, Emet-Selch and his boyfriend Hytholaedous\"",
            "Give us his hair, SE 😤",
            "Androgyny is a hell of a drug.",
            "Team Erenville anyone? He's gotta be the most beautiful creature I've ever seen plus, that voice 😍",
            "this your first time playing an FF game? they've got some good looking guys",
            "Just as a note: Hythlodaeus uses a male viera head. The only significant difference between his head model and a typical male viera is that he's always smiling, while male viera are always somewhere between sullen, surly, and pouting.",
            "Yeah, Hythlobaeus has that effect on a lot of us. I mean, I’m Ace, but that aesthetic attraction…",
            "Now you understand why Emet was willing to go so far to restore the ancients",
            "This is why people say that sexuality is a spectrum.",
            "I’ve got news for you, mate…",
            "Venat /topic\n\nThose eyes",
            "Hyth is pretty for sure. \n\nSince it's topical, I'm not ashamed to admit that random Zenos fanart contributed to me checking out the game during Stormblood. Learning he was batshit insane and high-key obsessed with us was icing on the cake.",
            "I'm gonna hold your hand when I tell you this...",
            "Dude has a beautiful soul.",
            "Agree, he is very handsome man",
            "REJECT Monosexuality\n\nEMBRACE Hythlodaeus",
            "If all it takes for you is a dude with long pink hair and a Brit accent you need to think *LONG* and *HARD* about this.",
            "This is how it starts.",
            "Wait until you see Themis",
            "You might not be so straight",
            "Look i am not gay but 20 bucks are 20 bucks",
            "Hyth truly is a babe. I believe there was a fandomwide boner when he appeared with that smile... that damned smile.",
            "I was expecting Aymeric, but this answer is just as valid.",
            "r/bi_irl",
            "Male version of Lightning from FF13",
            "I'm a gay man and hard disagree lmao",
            "Not strange that a straight male finds a feminine-presenting person attractive.\n\nI'm a gay dude and I don't find him hot at all. He is \"pretty\" in the same way I can find women pretty, but I am not attracted to (most) women. Cid is much hotter.",
            "There's reasons why my friends and I call him \"Hythlo-bae-us\". He's way too damn pretty.",
            "Im suprised you didnt mention innocence",
            "That's pretty gay, bro",
            "That man can go primal with me",
            "This  has always been a Square Enix staple.",
            "Hythlo best boi. No shame in admitting the hotness of a male char while being straight males ourselves, m8.",
            "I concur until he talked I thought he was a chick. DUDES HOT AF. I think this is my realization I'm not entirely straight lol.",
            "Welcome to being bi",
            "I knew who this was about before even looking.",
            "Between him and Zero, Endwalker really was the bisexual expansion.",
            "In the immortal words of Cpl. Ray Person:\n\n“It doesn’t make you gay if you think Rudy’s hot. We all think he’s hot.”",
            "After I won the Cloud hairstyle I managed to get a ridiculously accurate Cloud clone... with a fem hyur. FF heroes are just very girly.",
            "Dude looks like a giraffe. Now I dont have anything against giraffes mind you..",
            "I don't think your straight dude",
            "Dawg, me too. So this is what it feels like...",
            "welcome to the club! were happy to have you in our humble simp club",
            "Yeah I had the same exact reaction",
            "i got bad news bud",
            "Bruhhh",
            "You need to play more games for sure.",
            "[\"I swear to God I am a straight male\"](https://i.kym-cdn.com/entries/icons/original/000/023/021/e02e5ffb5f980cd8262cf7f0ae00a4a9_press-x-to-doubt-memes-memesuper-la-noire-doubt-meme_419-238.png)",
            "He doesn't even come close to Y'shtola or Lyse.",
            "Tell me about it. I’m a lesbian but Hythlo definitely does it for me.\n\nActually, a lot of Final Fantasy men do it for me. Maybe I’m not as gay as I thought I was. Maybe it’s aesthetic attraction.",
            "The bestest of friends",
            "Y'all really need to get laid.",
            "I remember thinking as a kid that estinien and ser aymeric were so much better than any of the \"waifus\" in the game... Also found out I'm a bit trans woman with a preference for men, so that might have something to do with it",
            "HYTHLODAEUS IS A GUY?!?!",
            "Wait I just started Shadowbringers that's a guy?",
            "If thats the hottest character to you..",
            "Not gonna lie, was absolutely sure they were female when they first showed up. Spent a lot of time trying to convince myself that somehow the translation was wrong.",
            "[Avery ](https://cdn.mos.cms.futurecdn.net/f6TwZUnQ9nH2aPYmnzMRAk.jpg)in Pokémon Sword and Shield: Isle of Armour. I was so mad when they said he was a guy. XD",
            "Or maybe you're quite gay.",
            "Wait.. she's a dude!?",
            "I became bi when I saw Vaan in a GameInformer magazine. That was my awakening.",
            "Ngl Snow from FfXIII would absolutely change my sexuality lol",
            "tifa was one of my earliest gay crushes. FF is just out to awaken things in people huh",
            "That beach scene in ffxvi OML. Clive 🫣🫣",
            "Emet is so valid",
            "Too be fair, he also missed Azem, even if Azem permanently lop hopped on his last nerve (I mean Hythlodaeus did too, maybe that was just Emet's thing)",
            "Lmao I want to meme this but all of 4 people will get it",
            "Venat too pls I beg 😭",
            "Yep, here. I absolutely keeled over when i saw him the first time.",
            "Viera men just grab you by the dick and rip you right out of the closet and into a tight hug with those eyes",
            "🙋🏻‍♀️",
            "Yes thank you! He is my favorite and I had a tiny scream when he showed up in the DT trailer.",
            "Love Erenville 😭💖",
            "🙋🏽‍♀️",
            "YUP.",
            "Yesss, I love his voice and can't place where is accent is from  🥺",
            "My only regret is that I cannot upvote this more than once.",
            "Zero's face is also based on a male Viera!",
            "Same!",
            "I'm ace as well, and so many FFXIV men could turn me.",
            "Damnit, you beat me to it",
            "Love Zenos  😍  I do not at all condone what he's done, but he's an absolute favorite",
            "> I'm gonna hold your hand when I tell you this...\n\n“I swear to God I am a straight male but this fabulously-charismatic twink is giving me heart palpitations”",
            "i'd really love to embr... hug him",
            "And UP you go",
            "Themis is cute, but I’m sorry, Hythlodaeus is way hotter.",
            "Themis is my Azem's little brother... \nHyth and Emet-Selch... \"they were all besties with Azem\" !",
            "I'm still waiting for that second date  🥲",
            "As a straight woman I gotta agree. This dude - and the bunny boys - are *too* pretty for my liking. They're beautiful no doubt, but they don't do it for me.",
            "As a bi girly I can appreciate many of the characters, but I just had to say, you could not be more right about Cid! Emet can have Hythlo, I'll take Cid every day and twice on Sunday thank you",
            "Yeah, as a gay dude I can say this guy has no effect to me either. He's just kinda there.",
            "Haha, I was gonna say he is quite feminine.  I'm glad it's not just me. ",
            "There's a retainer on maduin named \"Hythlodayum\" and I laugh every time I see it.",
            "Nah, the personality doesn’t change. Hard pass.",
            "Oh uhh this is critical spoiler territory. You need to exit like right now.",
            "Yes, you'll encounter him in Endwalker, you shouldn't know any more than that for now. ",
            "Playing with the voices muted, huh?",
            "Valid",
            "something something “motorcycle” something “riding” fill in the blanks",
            "it’s the magic of the series",
            "Clive’s body was sculpted by the gods themselves",
            "Emet is the Ron Swanson of ffxiv",
            "There was that one post a long while ago that said something along the lines of \"Azem is the gremlin of the group and Hythlodaeus is the gremlin enabler\" and I couldn't agree more",
            "Do it anyway!!",
            "Technically we already have their hair. It's just a slight variation of Viera hairstyles.",
            "if you look closely you will find that the face model used for hythlodaeus is the same as viera male with small modifications.",
            "Yeah, Themis has that 'innocent and a little naive' early-20s vibe going. Hythlodaeus has the 'experienced party animal' early-30s vibe going.",
            "\"Gal pals~~\"",
            "You can have Cid and I'll have his boyfriend Nero",
            "At first I was gonna say \"one night stand\" material. But then I realized he's the sort to want to change the plan and get clingy so I'm gonna agree with the pass.",
            "But he is Righteousness! And he will prevail!",
            "Card games on motorcycles?",
            "Cool foursome motorcycle friggen riding",
            "Holy fucking shit the more I think about it the more right you are.",
            "It's perfect  😆💙"
        ]
    },
    "It's 4AM, and someone is having an existential crisis in front of the Ocean Boat": {
        "title": "It's 4AM, and someone is having an existential crisis in front of the Ocean Boat",
        "score": 733,
        "url": "https://i.redd.it/haqfkg0c918d1.png",
        "content": "",
        "num_comments": 116,
        "comments": [
            "LMAO its the same person I was on a fishing boat (just now when you posted this) with and they had a lot of questions about ocean fishing and seemed passionate.",
            "Height is inversely proportional to evil. This poor man is obviously a good soul, lost among a sea of degenerates, Raiders, and the shortest and most evil of all, *streamers.*",
            "fishing was the first class i got to max level...... i understand you dickk chopp (i still love the story though and remember all of it)",
            "Critically acclaimed Fishing Fantasy XIV.",
            "Fish fear me\n\nLalafells fear me\n\nLimsa fears me\n\nFFXIV GMs fear me \n\nI fear me",
            "As a max height elezen, I'm always confused by this too. Everyone's so smol 0_0",
            "LMFAO that's crazy. XD\n\nTo be fair the two most played races—cat girls and lizard girls—are below the average midlander height. And he's a highlander, which are among the tall races. Even my bunny boy is shorter than him for gods sakes.",
            "This is why I stay clear of limsa.",
            "For them it might be a struggle, but for most of us its just another Tuesday.",
            "min height lala for life",
            "Min height au ra superiority",
            "Lotta short kings love short queens and vice versa",
            "ive noticed too. my  max height hyur female highlander palidin towers over everyone. i love it! i think people really like short characters because they are cute!",
            "Fuck it imma say it. Most female miqo'te/au'ra are at the lowest height setting because they're just weebs trying to create their ideal uwu anime waifu.",
            "He just drunk and lonely. I've been there, sorry Free Company bros.",
            "Just wait until he sees the first pair of lalafell doing weirdly specific warmups atop each other",
            "Lmao, he's not wrong though. I play a male highlander at a fairly tall height, and I tower a majority of the people I pass by.",
            "Well shit, min height Elezen, so I'm not sure where I fall.",
            "this is the kind of representation my home world deserves. dickk chopp, wherever you are now, i salute you.",
            "I want more! I instinctively started scrolling on your image hahaha",
            "Skipping story is FFXIV is like buying a book and only reading the last page lol",
            "I think they need a nap and a snack. That is a pretty big existential crisis to be have while fishing at 4am especially over how tall/short someone is. 👀 \n\nBut, yes I have noticed that a lot of people either play min height or max height. Heck, I only have two alts that I messed with the silder a lot. It was to make them my IRL height. The others are min or max.",
            "Considering his name is dick chopp, he seems like a very nice and good natured fellow.",
            "I do like my characters to be short (I'm a Miqo'te with the lowest height) and I think it's cute! Plus I'm kinda short irl so I think it fits well \\^\\^",
            "My main is a min height male Miqo and I love him. But my alt is a max height male Au Ra. The duality of man, truly.",
            "They missed the part where the mother crystal gave potatoes life.",
            "A Max height female miqote looks upscaled directly next to a small aura. I love it. And graha is also smaller than my kitty which looks odd",
            "I have wondered the same",
            "As a roe player I can say we are very jolly! And then you volunteer to be Santa at a Christmas party and a kid pisses themself in your lap",
            "\"That 95% of people are short then me\" resonates with me as a lala. Like legit most lala i meet is min height. Then there's me a default height whose the anomaly when i stand with the other lalas",
            "I mean the answer is simple, considering the demographics of the game its obvious why half of the playerbase is catgirls, and they're only taller than lalas and femras. A highlander easily towers over more than half the playerbase.",
            "One of the main reasons I used the free fantasia straight away in ARR was that my medium height elezen stuck out like a sore thumb, towering over every crowd and making me feel super self conscious.",
            "Was doing a cutscene the other day (content after ARR) and noticed my character was like two feet taller than Alphinaud, were standing on flat ground as well. Amused me as when I was making my character, generic white guy, the height slider doesn't go to my real world height. And I'm only slight above average for my country.",
            "Fringle Dingles didn’t know what they were signing up for",
            "something about ocean fishing brings out the existential crisis in people. i was on a boat a few weeks ago and towards the end someone was complaining about missing sharks for the goals and then spiraled very quickly\n\nalso, i'm tall IRL so i didn't want to give my character knee problems and a shortened lifespan. i did consider female elezen but i can't vibe with their tiny heads",
            "Lol, this guy passed me early hours this morning.",
            "The max height of many character options is just not that tall, especially for the women. And we all know Roes, Elezen and Hrothgar are endangered species in regards of who plays what. Max height Viera are the only common representatives of tall player characters here. (That said, I'm sure the average player height will tip a bit more towards the taller ones as soon as Hrothgal are out and attract a lot of \"step on me\" enthusiasts... At least in the beginning, until many of them get fed up with the absurd lack of customization and switch to Fem Roe.)",
            "Ngl it did throw me off recently when I realised male Miqos max height is 175cms (5ft 9), which is by no means short but it’s squarely average height. It threw me off that I’m the same height as the tallest cat boys. ",
            "My bunny boi is exactly my irl height because I like the immersion of knowing how big or small I would be vs all the things and people we meet. Pretty much medium height. Everyone is indeed tiny.",
            "No Lala no party.",
            "I played as mostly max height characters until a few months ago when I made a min height female aura. That day I realized just how many min height characters there were. He's not wrong lmao",
            "dont see anything weird just normal limsa stuff",
            "Mid height Au Ra and I get this. Everyone is so damn tiny in this game",
            "*laughs in max height muscle mommy fomroe*",
            "What you have encountered here, is what us old folk call \"an attention seeker\"",
            "Betas like being short ",
            "He's a bit spooked this glorious day.\n\n[Best I stroke this big Dickk 'till he calms.](https://www.youtube.com/watch?v=dqcuCpT_9hw)",
            "I'd piss him off and go \"why did you make a tall character if you wanted everyone to be your height?\" 😭",
            "You got me at streamers LOL",
            "I once heard the phrase \"short people are closer to hell\", and yep, that's lalas\n\nI play max height Fem Roe because I do enjoy towering over people",
            "Maybe that’s why I see my hroth as a big softy. Max height hroth by the way",
            "I might be a lalafell and I might be evil. He'll I have kicked more than 1 miqo but don't limp me in with streamers!\n\nEdit:words",
            "Hey! I'm short (min height ra en girl), and the worst I do is stop my cat from eating so much he throws up, and do dailies slightly tipsy occasionally. I just like being short.",
            "incorrect thesis, femroe here, massive degenerate",
            "Fishing was the first class I got to max level AND I'm a max height roe, so I double-understand dick chopp.",
            "It's the only crafting or gathering class I currently have maxed (for my current max level, anyway,; I got the starter version of the game, so none of my jobs are above Lv 70 yet).  The ocean trips are one of my favorite parts of the game.  I admire his efficiency, though, if he can spend 30 seconds on character creation and come up with what looks like a perfect grizzled old fisherman, LOL.",
            "A game can only be called an MMO if it has a fishing minigame.",
            "I play a max height Lalafell and it's fun seeing catgirls and Au Ra who are probably min height and coming juuuust up to their waist",
            "I started 1.0 and even ffxi as max height elezen/elvaan. When aura came out I was so mad there was a taller race than me. \n\nI'm not changing my character style. Been with him since ffxi 2004",
            "I wish Zalera's Limsa was this interesting. It's just full of people going AFK :/",
            "The biggest thing I'm looking forward to in dawntrail is purging Limsa with the blacklist so it can go back to how I remembered it.",
            "because... people use chat??",
            "then how tf do you fish",
            "Limsa fine",
            "RIP Raul Julia, a talent gone too soon from this world.",
            "What about my sister who plays a min height catgirl because she is actually extremely short IRL",
            "Til you see their modded appearance and they're like 6 feet tall. Or if it's an Au Ra they're usually 7-8+.\n\n  \nAnd Au Ra has no '",
            "My ideal anime waifu is a max height buff viera.",
            "I hate being tall in real life so I go the opposite extreme in game.",
            "My female miqo is max height and min height miqos come up to her chest, when you do character creation it's like a 6\" height difference or something minimal like that then you get in game and it's a biiig difference",
            "i mean shit, dude, if that's what's fun for 'em",
            "atleast for me i just wanna cut like. a foot from my irl height and be the short one for once.",
            "I mean pretty much, it's no secret knowing the game's demographics.",
            "Maybe it is the other way around? Existential crisis brings people to go (ocean) fishing.",
            "As a minimum height lala, I'm in this comment and I don't know how to feel about it.",
            "It took me a lot of effort to change my WoL to Miqo from a male Au Ra. The height was always nice, but those ears and that tail looked so alluring.",
            "In fairness all the Hroths we’ve met are big Slavic softies so it’s not exactly too far from the precedent ",
            "From one min height aura to another, Nuh uh we're evil.",
            "Because it's the only one fun *run*",
            "Min height miqo are 5'1\" and max height au ra are 5'2\" yet my au ra is taller than at least 80% of cat girls I come across lol",
            "As a min hight catgirl I can confirm im like \"Wait did I get shorter or did lalas get bigger?\", Its also funny that my friend who is also catgirl forgets im min hight and when she stands next to me shes like \"Omg why are you so small?! Or am I large?? -existential crisis-\" >.<",
            "Recently on Zalera, like a month or so ago, we had like 20 people walking - yes, walking - in a circle around the aetheryte in Limsa for like... an hour, maybe even multiple hours 😂 We may be quieter then other servers, but weird shit in Limsa is universal lol",
            "Its only purpose is to annoy me when I visit by putting my character in the default pose and being unable to access the market board until everything loads in lol",
            "Hey don’t diss my home world Zelera like that.\n\nMy experience, conversely, finds folks pretty chatty around the aetheryte, I’ve had some nice talks in between waiting for my duty finder.\n\nAnd there’s a local Rothgar group too 😭",
            "Faerie's is usually dependable for an evening concert, same as our Gridania.",
            "Ultros' Limsa gets this way sometimes, when there's Ocean Fishing times. It's not always, but it happens sometimes.",
            "I dunno about purging, but I can't wait to add dj and gamba to the new chat filter list and maybe making people that insist on standing on top of the retainer bells vanish.",
            "That's why I said most, not all.",
            "Same. Though the Lala Ladies get to be a bit shorter than the men and that makes me grumpy.",
            "EVIL!!!!-Mermaid Man",
            "Nearly all. One of the traitorous dudes in the Bozjha Line was also a Hroth. The one that got >!tempered first and then procedeed to slaughter his former coconspirators.!<",
            "You may be. Worst I do is tease Raha and snark at Estinien. Speak for yourself but don't speak for me.",
            "Wait, really? I never got to see it. I remember once there was a Lalafell train in either Limsa or Ul'Dah though.",
            "I was one of those people xD",
            "We had the same thing in Raiden twice last month I’m pretty sure",
            "This has happened on Mateus, too! We got nightly or bi-nightly parades I want to say a year ago. I always stopped to walk with them lmao I think the front of the train was a pair of lalas?",
            "I play on Zalera and I haven't really had much luck finding people to talk to q-p. It's been hard trying to find people to get to sign my FC petition so that I can try to have a friend group to play with.",
            "Man, I feel like I picked the wrong World and Datacenter at times. Don't want to pay to change it though.",
            "Just get the anima minion. He's taller than us. And you can be extra grumpy cause a minion is taller than you. :)",
            "I mean in fairness if he got tempered it’s not like he’s got much say in the matter 😂",
            "How about this, We play naughts and crosses and if I win your evil and if you win your not, Not participating will be taken as a tacit admission that your evil.\n\n0 0 0  \n0 0 0  \n0 0 0\n\nIf updating the grid is too annoying for you you can type your move and I'll change it for us.\n\nEdit: wait a minute, the 0's are too similair to O, I'll be R instead of O and you can be X, We'll play R's and crosses.",
            "I was coming in and out doing crafting stuff, and at first there was like 3 people or something. Came back awhile later to check my retainer and there was like 8... came back again... it just kept growing lol. I know it was at least an hour cause I sent my retainer on a hunting venture and then came back and they had grown even bigger and then they finally disbanded. I don't remember how long they were doing this before I started the venture lol.\n\nAnyway I guess I was just in the right place at the right time 😂",
            "You looking for an fc?",
            "Haha! I know! I LOVE that minion.",
            "You know the game has a definite solution, right? No matter what move I make, if you go first you'll win if you know the solution. Therefore you'll use the definite solution to win and 'prove' I'm evil. Which is evil. And unfair, and underhanded. And if I use the definite solution to win by going first, then I am evil, which will prove your point. I am going to cuddle my cat now.",
            "I tend to play later at night usually- so that's probably why I end up missing everything when it happens. The last weird thing I genuinely remember was Scar Sloth in Ul'Dah. Me and a few other players bonded over his corpse and started a \"religion.\" That's how I basically wound up in my first ever FC lol.",
            "I've been wanting to get into one since I left my original FC, but the few I've joined were ones I haven't had much luck with. I thought about creating my own, since it would be easier for me if I got into a smaller group at the start- given I'm mostly just looking for friends to play the game with. A lot of the already established FCs kinda feel like they're already tightly-knit friend groups and it gets harder for me to get as involved in them.",
            "Haha I just DM’d them a link to my FC too. We’ll show em how lively Zalera is!",
            "I left it open for you to go first, which was quite benevolent if your asking me. Seeing as you just acknowledged that the first mover in naughts and crosses has an extensive advantage wouldn't my willingness to give that advantage to you be, in and of itself, proof of my moral virtue?\n\nAnd if someone morally virtuous like me is accusing someone like you of being evil wouldn't the only consistent explanation be that your evil?",
            "That's the spirit! If you can't find the weird shit, become the weird shit 😂",
            "O and if you have any questions feel free to dm me",
            "Well if you're ever on behemoth there is a nice and open FC called Eternal Balance or LIBRA if your ever looking for friends hit us up we're always recruiting and doing stuff with new and old players alike.",
            "Not from zal but my fc does hang out with people from other worlds and DC's",
            "Except you said you are evil.",
            "Really? Where?",
            "[https://www.reddit.com/r/ffxiv/s/bLRlrQSzKY](https://www.reddit.com/r/ffxiv/s/bLRlrQSzKY)"
        ]
    },
    "Illustrated Countdown to Dawntrail - 10 Days left until Launch, 6 days left until EA": {
        "title": "Illustrated Countdown to Dawntrail - 10 Days left until Launch, 6 days left until EA",
        "score": 177,
        "url": "https://img.finalfantasyxiv.com/t/8c5a451e1128f1f48eb4b7a8e6b9dd62a681bd55_0.jpg?1718961923",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Previous official countdown DRKs:\n\n* HW Lalafell [[link](https://img.finalfantasyxiv.com/t/99bba788918249ee9a3a042bc3071d7072ef8c71_1.jpg)]\n* SB Male \"Probably Elezen\" [[link](https://www.finalfantasyxiv.com/fankit_40/UaaxPQM8WJ/countdown07_wLZ7NT5nKy.png)]\n* ShB Male Midlander (also the day zero \"final\" image) [[link](https://www.finalfantasyxiv.com/fankit_50/G126ai8M6c/sbcd_00d_EfuC16.png)]\n* EW Female Sea Wolf Roegadyn [[link](https://www.finalfantasyxiv.com/fankit_55/H07v3LBd9Z/ewcd_17d_qL1bGD.png)]",
            "Looks like the same character from the drk job artwork",
            "Man I really want those drawings without the number on it.\nThose are sick!!!!",
            "strong Avan Strash energy in this one... now i kinda want that stance in game.",
            "I like the metal hearts on the skirt.",
            "I dunno why but my immediate thought was THE Zollton from NEST.",
            "The little serrations of the sides of the blade really ruin that weapon imo.",
            "I like the HW one it’s mischievous little dude",
            "For a lalafel thats fucking sick the HW one",
            "Man, except the EW one, they are all so sick, especially the HW one",
            "Isn't it Sidurgu in both cases? (though I guess it's weird that only DRK is a specific npc so I could be wrong)",
            "Yeah, it's definitely channeling Sidurgu.",
            "Soul Crystal is shaped like a heart. Makes sense.",
            "Aren't those guitar picks? Jk",
            "Looks similar but I think this is some other male Au Ra Dark Knight. His hair is pink, his skin is darker and I think his eyes are blue instead of green. All of which could be put down to lighting or art style, but the main thing is the armour, which is completely different in both colour and details.",
            "Dark Knight is the magical girl job after all. ",
            "Plus they don't typically use in-game characters for the countdown arts. \n\nSometimes they will for the finale image like in SB and ShB but not in the countdown itself."
        ]
    }
}