{
    "Wöchentliche Finanzdiskussion - KW 25 - 2024": {
        "title": "Wöchentliche Finanzdiskussion - KW 25 - 2024",
        "score": 10,
        "url": "https://www.reddit.com/r/Finanzen/comments/1dhn577/wöchentliche_finanzdiskussion_kw_25_2024/",
        "content": "Womit habt ihr euch diese Woche beschäftigt? Habt ihr Fortschritte zu eurem gewählten Ziel gemacht? Sind Probleme aufgekommen? Hier könnt ihr über alles Themenverwandte diskutieren.\n\n&#x200B;\n\nUm euch über die Traderepublic Bezahlkarte auszutauschen nutzt bitte den [Megathread](https://www.reddit.com/r/Finanzen/comments/1alrvzz/megathread_traderepublic_bezahlkarte/).\n\n \n\nDie vorherigen Posts findest du über die Suche mit [diesem Link](https://www.reddit.com/r/Finanzen/search/?q=W%C3%B6chentliche+Finanzdiskussion&sort=new&restrict_sr=on&t=all).",
        "num_comments": 145,
        "comments": [
            "Der Amundi Prime All Country World hat nun auch eine [thesaurierende Variante](https://www.amundietf.de/de/privatanleger/products/equity/amundi-prime-all-country-world-ucits-etf-acc/ie0003xja0j9) aufgelegt, deren Börsenhandel nächste Woche (26.6.) startet.\n\nTER von 0,07%, ebenfalls in Irland beheimatet und damit eine Alternative zum A2PKXG mit einem Drittel der Kosten.\n\nDer Ausschütter hat ein ziemlich rasantes Wachstum hingelegt und in den ersten drei Monaten des Börsenhandels bereits fast eine Milliarde an Fondsvolumen angehäuft. Das hat Amundi wohl dazu bewegt, dass sich auch ein Thesaurierer lohnen könnte, noch im März hatten die mir auf Anfrage geantwortet, dass das nicht geplant sei.",
            "https://preview.redd.it/hchjmqr6tx7d1.png?width=1080&format=png&auto=webp&s=cf9e377665836e5024c2bd4306fac238de98c920\n\nFalls sich jemand fragt, wie verrückt sich (deutsche) NVIDIA-Mitarbeiter in letzter Zeit fühlen müssen... (das ist unvested equity, d.h. es geht erst nach und nach an den Angestellten über - also bitte weiter fröhlich hypen)",
            "Seit ich vor zwei Jahren meine neue Stelle inne habe erhalte ich bei meiner Steuererklärung in Elster die Aussage, dass es wahrscheinlich zu einer Nachzahlung kommen wird. Daher habe ich die Steuererklärung nicht abgeschickt.\n\nBei einem Gesamtbrutto von 90k für 2023 komme ich rechnerisch auf eine Nachzahlung von 229€ für Einkommenssteuer und 198€ für den Soli.\n\nMir ist unerklärlich, wie es sein kann, dass es zur Nachzahlung kommt. Ich bin ein absoluter Standardfall als nicht-selbstständiger Arbeitnehmer. Einzige kleine Besonderheit ist, dass ich jährlich im April einen Bonus für das zurückliegende Jahr erhalte. Dieser wird nach meinem Wissen ja aber auch mit Steuerklasse 1 versteuert?!",
            "Hier nochmal für diejenigen, die auf ihre rechtmäßige Bauzinssenkung warten, wo doch jetzt die EZB gesenkt hat https://www.tagesschau.de/wirtschaft/bauzinsen-102.html",
            "@Mods Finanzen ist auf Platz 6 der Finance-Communities. Was muss für Platz 1 getan werden?\n\nDie momentane 1 hat weniger Mitglieder.",
            "Hallo liebe Community,\n\nam Wochenende wurde mir ein [neues Video von extraETF](https://youtu.be/hXFEMgtMp5c?si=Z3uSkSBBzYjJjAmX) zum Thema Laufzeit-ETFs auf meine YouTube-Startseite gespült. In dem Video ging es unter anderem um den Amundi Laufzeit-ETF auf deutsche Staatsanleihen ([LU2780871823](https://www.amundietf.de/de/professionell/products/fixed-income/amundi-fixed-maturity-2027-german-bund-government-bond-ucits-etf-dist/lu2780871823)). Anfangs war ich skeptisch und auch im Video wurde nicht deutlich, warum eine Diversifikation auf deutsche Staatsanleihen überhaupt sinnvoll sein sollte. Schließlich könnte ich auch einfach eine der im ETF enthaltenen Anleihen direkt auswählen, die gleiche Rendite erzielen und mir die TER von 0,09% sparen.\n\nNachdem ich mir jedoch den Inhalt des ETFs genauer angesehen und die Renditen verglichen habe, war ich überrascht. Auf der Amundi-Seite wird eine Rendite von 2,83% angegeben, obwohl die einzelnen Anleihen im ETF eine Rendite zwischen 2,47% und 2,56% haben. Wie kommt dieser Unterschied zustande?\n\nDE0001102424   |   [2,50%](https://www.deutsche-finanzagentur.de/bundeswertpapiere/factsheet/isin/DE0001102424?cHash=f10a4f0b33847dd20a4c4525226bfa0a)  \nDE0001141869   |   2,49%  \nDE0001102416   |   2,56%  \nDE0001141851   |   2,55%  \nDE0001102523   |   2,48%  \nDE0001135044   |   2,56%  \nDE0001030740   |   2,47%",
            "Interessant, wie viele Anleihen-ETF es mittlerweile gibt, die eine Ziellaufzeit haben https://www.justetf.com/de/search.html?search=ETFS&assetClass=class-bonds&bondStrategy=Maturity%2Bbonds\n\nNur warum es ausgerechnet zu Italien auch welche gibt checke ich nicht ganz.",
            "Zusammen mit einer zweistelligen Zahl anderer Leute werden bei mir regelmäßig kleinere Ausgaben fällig. Bisher hat eine andere Person ein GbR Konto geführt, die Person ist mittlerweile verstorben und es kann laut Bank wohl nicht auf eine andere Person umgeschrieben werden.\n\n\nGibt es eine Möglichkeit für diese Konstellation möglichst Stressfrei ein Konto zu führen? Es gibt die Überlegung einen Verein zu gründen, aber so richtig Lust hat keiner drauf.\n\n\nFür die gemeinsamen Ausgaben hatte jeder immer monatlich eingezahlt, es liegt also doch ein ganz schöner Batzen Geld rum. Daher wär es ganz nett wie bisher ein vier Augen Prinzip zu haben.\n\n\nIrgendwelche möglichst simplen Ideen? Soweit ich das sehe ist ein Geschäftskonto ohne wirkliches Geschäft wohl nicht mehr so easy wie in den 60ern.\nAh ja, soll selbstredend nichts kosten der Spaß.",
            "Ich habe die TR IBAN seit gestern. In den FAQ schreibt TR: \"Es **wird** keine Obergrenze mehr geben, die bisherige Grenze von 50.000 € wird aufgehoben.\"\n\nUnter Zinsen steht bei mir in der App aber immer noch \"Füge bis zu 50k EUR hinzu, um Zinsen zu erhalten.\"\n\nKriege ich jetzt schon Zinsen über 50k oder nicht?\n\nEdit: Ich erhalte die Zinsen.",
            "Habe etwa 100k in alten (vor 2009) in sehr konservativen Investmentfonds (DWS, Union, Templeton). \n\nWenn ich diese verkaufe und neu anlege, brauche ich  eine ziemlich gute performance der Neuanlagen, um die neue Besteuerung auszugleichen, oder habe ich hier einen Denkfehler?",
            "Die neue TradeRepublic IBAN unterstützt bei mir keine eingehenden Echtzeitüberweisungen. Mit der alten IBAN bei TradeRepublic von der Deutschen Bank wurden Echtzeitüberweisungen problemlos akzeptiert. Mit so einem Rückschritt hätte ich nicht gerechnet",
            "Sorry for English - I'm thinking of opening a Junior depot. What happens if we decide to leave Germany before the child is 18? I don't have such plans but you never know so I'd like to have all the information, but I can't find this online.",
            "Scheinbar darf ich keinen eigenen Post erstellen, deshalb frage ich mal hier.\n\nIch habe darüber nachgedacht, ukrainische Staatsanleihen zu kaufen. Dabei bin ich auf Produkte mit sehr unterschiedlicher Maturity gestoßen, die aber dennoch ähnlich bepreist sind:\n\n1. [Maturity am 20.06.2028, 6,75% Festzins, und bei etwa 25% Preis](https://www.boerse-frankfurt.de/anleihe/xs2015264778-ukraine-republik-6-75-19-28)\n2. [Maturity am 01.09.2025, 7,75% Festzins, und bei etwa 30% Preis](https://www.boerse-frankfurt.de/anleihe/xs1303921487-ukraine-republik-7-75-15-25)\n\nDie Maturity von 2) liegt so viel näher, wieso ist der Preis im Verhältnis zu 1) so niedrig? Die angegebenen Renditen sind ja dementsprechend auch extrem unterschiedlich. Könnt ihr euch das erklären oder hat der Markt hier nicht geregelt?\n\nWas haltet ihr generell von der Idee, ukrainische Staatsanleihen zu kaufen?",
            "Hatte wer Probleme mit PayBack Amex Karte im Ausland? Ich wollte mit der Karte in Ländern wie Italien, Frankreich, Österreich oder auf Malta zahlen, sie wurde aber immer abgelehnt…in DE nie ein Problem gehabt",
            "Ich bin seit Anfang des Jahres bei Trade Republic. Hier im sub hört man aber viel schlechtes über den Support. \n\n\nBei welchem Broker habt ihr denn gute Erfahrungen mit dem Support gemacht?",
            "Werden bei euch bei der ING auch die vorgemerkten Umsätze sehr spät abgebucht? Es dauert manchmal bis zu vier Werktage",
            "Sorry für die vielleicht dumme Fragw aber wo sehe ich bei TR eigentlich die Dividenden? Habe auch notifications bekommen , aber nachdem man die einmal angeschaut hat kommt man da nie wieder hin? \n\nFinde im allgemeinen TR schwer nachzuvollziehen was ich eigentlich wo finden kann.. macht mich irre. \n\nSparplanausführungen, Oders, Abrechnungen, Dividenen.. es gibt m M nirgends einen klaren Weg dorthin",
            "Ich habe eine Verständnisfrage. Ich lese hier immer wieder, dass man statt Geld von einem Festgeldkonto aufs nächste zu schieben, es auch einfach in Geldmarktfonds anlegen kann, wenn man es kurzfristig nicht braucht. Angenommen ich habe 15k, die ich nicht dauerhaft anlegen möchte aber so für \\~3-5 Jahre. Warum packe ich die dann nicht in ETFs, wo ich (zumindest mit Blick auf meine Anlageübersicht) deutlich mehr Gewinne machen würde? Also warum sagt man in ETFs nur Geld reinschieben, das man da auch langfristig anlegen möchte?",
            "[deleted]",
            "Ich investiere alle 2 Monate via Sparplan in einen ETF.\nManchmal frag ich mich allerdings, ob ich jeden Monat investieren sollte, anstatt alle 2 Monate.\nWie schätzt ihr die Situation ein?\nBroker ist die DKB mit 1,5 Euro pro Ausführung.",
            "Warum ist die Hanseatic Bank so gemein?!\n\nHab die Karte zwar fast nie benutzt aber hat ein Limit von 4 oder 5k (für den Notfall oder Kautionen).\n\nHeute kam ein Schreiben ich solle mich freuen denn mein neues Limit betrüge 1k.\n\nWas soll das…",
            "Habe jetzt mal auf die Performance meines Roboadvisors Robin bei der DB geschaut. In dem von der DB herausgegebenen Performancebericht ist er in ALLEN 8 Zeiträumen schlechter als die billige Referenz. Das ist zwar eine schlechte Eigenwerbung aber wenigstens eine brutale Sebstdarstellung. Der Mist hat mich inklusive Gebühren 100k gekostet in 4 Jahren. Ich habe natürlich das meiste im heiligen Gral und Geldmarkt, hatte aber gehofft, dass ich mit Robin eine Risiko-Diversifikation hätte. Klappt wohl nicht.",
            "Hab mir heute Mainstreet Capital Aktien geholt.  Die schüttet häufig aus und dadurch habe ich zusätzlichen Cashflow um mein Portfolio zu erweitern. Es gab noch andere Aktien die häufig ausschütten aber rückblickend sind sie eher gefallen als gestiegen, ergo hab ich mich letztendlich für Mainstreet entschieden.",
            "hat jemand ein Konto bei kraken.com? bin gerade genervt, dass ich zukünftig keine 2 accounts zwecks portfoliotrennung haben kann.\n\nWerde wahrscheinlich ein weiteres bei coinbase eröffnen oder wo seid ihr so?",
            "Hat vin euch auch jemand das Problem, dass bei Trade Republic gerade keine Dividenden mehr ankommen?",
            "Hallo,\n\nich investiere jeden Monat in den ETF Amundi ETF Leveraged MSCI USA ( WKN A0X8ZS ) Besondere Strategie Hebel  wurde vor kurzem gesplittet Top Performance\n\nbei comdirect als Sparplan möglich. Mein bester ETF. Schlägt den MSCI World Index  um Längen\n\n#",
            "Thema Inflation, Indexlöhne etc. Sehr spannendes Thema. Quellen dazu:  \n[Vorbild Belgien: Sollte man Löhne an die Inflation koppeln? - ZDFheute](https://www.zdf.de/nachrichten/wirtschaft/belgien-inflationsausgleich-indexloehne-100.html)\n\n[Darum wirst DU immer ÄRMER! - YouTube](https://www.youtube.com/watch?v=6QuTOKG7llA)",
            "https://preview.redd.it/25j3i60ehw7d1.jpeg?width=1125&format=pjpg&auto=webp&s=ab2a1c29dd2ab62748fcbe657c56bb28823735a4\n\nHallo alle, denke hier ist es gut aufgehoben als „kleine“ Frage. Das wären bisher meine ganzen Aufstellungen. Der größte Anteil an % hat nvidia und der IE00B4L5Y983 Core msci World. Würde gerne die ETFs verkleinern, aber dennoch genug diversifiziert sein. Welche ETFs würdet ihr beibehalten? Welche Aktien gar nicht mehr besparen. Gewichtung ist 25% Aktien, 75% ETFs. (30k zu 90k). Der Core msci macht 35% der ETFs aus. Bei den Aktien 8% nvidia.",
            "Geil TR hat jetzt die Dividenden wohl nachgezogen aber bei mir und vielen anderen die Abrechnung in den Sand gesetzt. Bei mir wurde zum Glück nur fälschlicherweise Kirchensteuer einbehalten. \n\nFals nochmal wer hinterfragt wieso ich ein Zweitdepot bei der Codi habe hab ich jetzt ein Argument mehr.",
            "Leider nur 1x statt 4x p.a. Dividende beim dist.\n\nEdit: Finde den besser als den Vanguard All World. Sollte der neue Heilige werden. MSW hat auch nen heiligen Amumbo.\n\nEdit2: Der Ausschütter einfach nur 0,05% TER und negative TD\n\nEdit3: Mach doch einen eigenen Beitrag auf. Das sind wichtige Neuigkeiten ;)",
            "Wie unterscheidet der sich zum A2PWMK? Nur im Fondsdomizil (Irland vs Luxemburg) und TER (0.07 vs 0.05)? Mehr Unterschiede finde ich nämlich nicht.",
            "Da würde ich als Mitarbeiter langsam mal anfangen zu hedgen.",
            "Ich rate einfach mal: Du hast irgendwas falsch angegeben. Quelle: Habe selber schon Dinge falsch angegeben. Daher jetzt immer mit vorausgefüllter Steuererklärung.\n\nAnsonsten hol dir mal eine \"richtige\" Steuersoftware wie Buhl Tax oder tippe deinen Fall in Smartsteuer ein. Beide Anwendungen gibt es als Demoversion und man müsste erst bei Abgabe zahlen, kann aber sonst alles nutzen und schon mal berechnen lassen.",
            ">Mir ist unerklärlich, wie es sein kann, dass es zur Nachzahlung kommt.\n\nIch rate auch mal: der Soli, der für \"sonstige Einkünfte\" in der Milderungszone vom Arbeitgeber korrekt mit 5.5% berechnet wird, dies dem Finanzamt über die elektronische Lohnsteuerabrechnung nicht mitgeteilt werden kann und das Finanzamt dann die vollen 11.9% Soli in der Milderungszone ansetzt.\n\nScheint aber beides rechtmäßig zu sein.",
            "Wie bekomme ich Bauzinsen für mein Wertpapierdepot ist hier die Frage",
            "Aktuell wird bei mir 2,76% angezeigt: https://www.amundietf.de/de/privatanleger/products/fixed-income/amundi-fixed-maturity-2027-german-bund-government-bond-ucits-etf-dist/lu2780871823\n\nIch bin kein Experte für Anleihen, aber es gibt sehr viele Berechnungsdetails (Zinstage, Ausschüttung und so weiter), da könnte ich mir vorstellen, dass es einfach daran liegt. Also dass du mit einer anderen Methode die Rendite berechnet hast, als Amundi das macht.\n\nIn der Theorie könnte es natürlich noch sein, dass der ETF mit leichtem Abschlag zum NAV handelt, aber das scheint nicht so zu sein. Spread könnte noch sein, aber der ist auch zu gering. Wertpapierleihe oder sowas dürfte bei deutschen Staatsanleihen auch nicht so der Fall sein...",
            "Italien erhebt auf ihre eigenen Staatsanleihen für Steuer-Inländer nur eine Steuer von 12,5% anstatt 26%, was vielleicht auch auf Fonds und ETFs durchschlägt.\n\nIn Italien sind Investitionen in die eignen Staatsanleihen unter Privatanlegern sehr beliebt.\n\nEs macht irgendwie trotzdem keinen Sinn, weil man ja durch so einen ETF nichts diversifiziert und man auch direkt eine einzelne Anleihe kaufen könnte.",
            "Ich hab immer noch keine Nachricht über die neue IBAN bekommen. Nicht, dass es mich groß stören würde. Aber irgendwie hab ich sie schon länger erwartet.",
            "Kann ich fragen wie du die Zinsen erhältst? Einfach ganz normal als Zinsen für dein Geld oder über die Erträge von etwaigen Geldmarktfonds? TR hatte ja mal kommuniziert, dass sie Gelder über 50k am Geldmarkt diversifizieren wollen und zwar auf einem Depot mit deinem Namen. Du hast aber jetzt keine Geldmarktfondsanteile irgendwo liegen oder?",
            "Was hat die IBAN mit den Zinsen zu tun?\n\nSchau ins Preisverzeichnis. Da steht „Nein“. https://traderepublic.com/de-de#spend",
            "Bei den Fonds handelt es sich wahrscheinlich um relativ teure Produkte, sodass du alleine durch den Wechsel auf günstige ETFs bei gleicher Bruttorendite 1,x % oder mehr an laufenden Kosten einsparen kannst, oder? Dann sollte es es sich ziemlich schnell rentieren, die Steuerfreiheit zugunsten der höheren Nettorendite aufzugeben.\n\nWenn du als Neuanlage Aktien-ETFs ins Auge nimmst, sind die auch zu 30 % teilfreigestellt, unter Berücksichtigung von TFS und Sparerpauschbetrag würde sich ein Wechsel, der 7 % p.a. statt 6 % p.a. bringt, z. B. nach 10 Jahren lohnen (angenommen, es wird am Ende alles auf einmal verkauft und die Sparerpauschbeträge bis zum Verkauf verfallen; nutzt man sie aus, verschiebt sich die Grenze eher noch nach vorne).",
            "Kommt alles drauf an. Vereinfacht gesagt wie viel schlechter laufen die Fonds als neue ETFs und wie lange planst du anzulegen. Je länger du anlegst desto eklatanter sollte die Gap weil schlechtere Performance werden. Welche Fonds sinds denn konkret?",
            "Ich weiß nicht, ob ich dich richtig verstehe - meinst du bei der Besteuerung die Steuer, die du auf den Kursgewinn zahlen musst?  \nAuf der anderen Seite bekommst du mit einem günstigen ETF im Vergleich zu den Fonds bereits +1.X% Rendite, weil die Gebühren niedriger sind/wegfallen. Das darfst du in der Berechnung auch nicht vergessen.",
            "Zumindest kein neues Geld in die Fonds packen sondern kostengünstigere ETFs raussuchen.",
            "Es steht klar beim Akzeptieren: \"Echtzeitüberweisungen comming soon\".",
            "Bei einer Überweisungsdauer von einem halben Tag finde ich das jetzt nicht so schlimm. Dazu kommt SEPA Instant ja mal wieder.",
            "Afaik - don't quote me on it - it's just treated like its own person with its own taxes.\n\nSo it would be the same as you investing / paying taxes / moving out of germany. Just that the 1000€ is of course separate from yours.",
            "Die generelle Idee Ukrainische Staatsanleihen zukaufen ist eher was für wallstreetbets als r/Finanzen gerade bei einer Mindestanlagesumme von 100.000€ ist das für Privatanleger schon ein Brett für ein CC-Rating.\n\nSonst sind die aktuellen Kurse für die Anleihen halt auch eher guesswork ich weiß nicht wie liquide der Markt für die tatsächlich ist.",
            "Reine Spekulation, aber vielleicht hofft man dass in paar Jahren die Situation der Ukraine sich stabilisiert hat und deshalb bis dahin Schuldenschnitte unwahrscheinlicher werden.\n\nOder man vermutet sowas wie einen \"fixen\" Schuldenschnitt von ~75% und danach haben beide dann eine ähnliche Rendite?\n\nÜbrigens ist eine der Anleihen in USD und die andere in EUR notiert...\n\nWenn du eine fundierte Meinung haben möchtest, könntest du es im Wertpapierforum probieren. Da gibt es einige Anleihen Experten.\n\n> Was haltet ihr generell von der Idee, ukrainische Staatsanleihen zu kaufen?\n\nFinde ich richtig geil, aber ist eher eine Aktion für r/mauerstrassenwetten als für r/Finanzen.\n\nIch hatte das auch schonmal überlegt, aber leider ist die Mindestanlagesumme 100.000€ Nennwert. Das sind beim aktuellen Kurs immer noch 25.000€. Und man kann das als Privatperson glaube ich eh nirgendwo handeln. Oder hast du einen Weg gefunden?",
            "Na, weil bei der 25er sicher ist, dass restrukturiert wird. Bei der 28er ggfs. zu besseren Bedingungen. Würde ich auch abgesehen von der Stückelung nicht kaufen. Kan Dir meine schöne R-Logitech Anleihe günstig anbieten. Da stehen wirklich harte Assets hinter, ich schwör.",
            "Amex allgemein wird halt des öfteren verweigert (die sind wohl teurer als Visa/Mastercard), aber das Problem hat man in DE auch ab und zu. Also prinzipiell funktionieren tut sie in anderen Länder schon, wird aber nicht überall aktzeptiert.",
            "Im sub liest man grundsätzlich nichts gutes zu irgendeinem Support. Hab halt keinen Anlass zu sagen, dass ich mit scalable oder dkb keine Probleme habe.",
            "Flatex Support war gut erreichbar (Telefon und Nachricht). Probleme konnten gelöst werden und das erstaunliche war: ich habe immer wieder mit der selben Person telefoniert. Keine Ahnung, ob das Zufall war.",
            "ING.\n\nMir scheint aber unabhängig vom Broker das Niveau in den letzten Jahren allgemein nach unten zu gehen, vielleicht ein Nebeneffekt der Neo Broker. Selbst etablierte Broker die mehr Kosten haben nachgelassen, Beispiel Comdirect.",
            "Ja, das ist mir in der letzten Woche ebenfalls aufgefallen!",
            "Ist doch praktisch das man das schon so weit vorher sieht. Am Tag der Abbuchung ändert das ja erst einmal nix.",
            "unter profil, transaktionen. da auf die dividende klicken und dann rechts nach unten scrollen. da ist das pdf, wo sonst die abrechnung,... ist.\n\nstimmt schon .. ist in meinen augen der uebertriebene fokus auf app und alles. der webclient ist nicht wirklich gut. aber na ja.",
            "weil ETF's deutlich an Wert verlieren können (auch hier gepriesene Welt-ETF's) und du willst deine Anlage wahrscheinlich nicht liquidieren wenn der Preis sich gerade halbiert hat.",
            "> Warum packe ich die dann nicht in ETFs, wo ich (zumindest mit Blick auf meine Anlageübersicht) deutlich mehr Gewinne machen würde?\n\nWeil (Aktien-)ETFs in dem Zeitraum auch gerne mal bei -50 % stehen können und von Erholung weit und breit keine Spur sein kann. Benötigst du dann dein eingesetztes Kapital in voller Höhe, hast du Pech gehabt.",
            "Glaub C24 vielleicht? DKB?",
            "Commerzbank hätte den Vorteil dass du Gratis Bargeld einzahlen kannst ",
            "Generell gilt Time in the market beats market timing. Also alles so früh rein wie möglich. Das heisst monatlich > 2 monatlich",
            "Welche Variante des Robos hast du hier verglichen? Wie schaut die Referenz aus?",
            "> Der Mist hat mich inklusive Gebühren 100k gekostet in 4 Jahren. \n\nÄh… ich hoffe nicht 100 k Gebühren oder 100 k Performancedelta?\n\nRational Reminder hatte dazu grad ne Folge https://rationalreminder.ca/podcast/309\n\nWenn die Robos einerseits keine magisch besseren Anlagestrategie herbeiorakeln können, andererseits Gebühren haben, muss das eigentlich so sein, wie du es beschreibst. Wenn man jetzt noch davon ausgeht, dass manche eine schlechtere Anlagestrategie (man bedenke diesesn Value-at-Risk-Ansatz in Corona von Scalable) und/oder deutlich bei den Gebühren zulangen, kann das nur enttäuschen.",
            ">Es gab noch andere Aktien die häufig ausschütten aber rückblickend sind sie eher gefallen als gestiegen, ergo hab ich mich letztendlich für Mainstreet entschieden.\n\nBeste Grundlage für Investmententscheidungen.",
            "Für Bitcoin oder Krypto?",
            "Wird doch schon hier ausführlichst besprochen:\n\n[https://new.reddit.com/r/Finanzen/comments/1dhfarw/was\\_sagt\\_ihr\\_zur\\_aktuellen/](https://new.reddit.com/r/Finanzen/comments/1dhfarw/was_sagt_ihr_zur_aktuellen/)",
            "Ach was? Leveraged schlägt einen unleveraged etf in einem Bullenmarkt?\nColor me surprised!\n\nIn einem Bärenmarkt hast du halt extra viel Spaß mit dem Ding. Nennt sich Volatilitätszerfall.\n\nEin 2x leveraged S&P 500 war 2009 beispielsweise bei -85% ! \n\nIch glaube dir ist das nicht bewusst, so wie du schreibst.",
            "Was für ein Geschwurbel. Wo sind die Länder, die dank des tollen Bitcoin zu wirtschaftlichem Wohlstand kommen? Wer hält die zurück? Braucht es nochmal 15 Jahre?",
            "Roman hat ja mittlerweile echt lange Haare.",
            "Hilft das Zweitdepot dabei, dass TR die Sachen besser macht? Ansonsten verstehe ich den Bezug nicht",
            "Schön, bei mir dauern die Divis scheinbar noch. Bekomme nur \"corporate actions\" Benachrichtigungen, wo ich theoretisch auswählen kann, ob cash oder stock. Die Fristen sind nur auch schon abgelaufen :D",
            "Ich lass erstmal die Finger von Amundi ETF, nachdem sie da in letzter Zeit einige eingestampft und zusammengelegt haben - die Chance, dass da ein steuerliches Event ausgelöst wird, ist im Vergleich zu anderen Anbietern einfach höher.",
            "> Edit3: Mach doch einen eigenen Beitrag auf. Das sind wichtige Neuigkeiten ;)\n\nHatte ich vor, wenn der dann tatsächlich handelbar ist (und mir noch niemand zuvorgekommen ist).",
            "Der A2PWMK (Amundi Prime Global) ist das Äquivalent zum MSCI World, d.h. enthält nur die entwickelten Länder.\n\nDer Amundi Prime All Country World entspicht dem MSCI ACWI, d.h. enthält auch Emerging Markets.\n\nFondsdomizil Luxemburg ist bei >50% USA definitiv ein Nachteil gegenüber Irland.",
            "Darf man nicht. Zumindest Verleihen und direkte Derivate etc. auf NVDA sind logischerweise verboten. Evtl. könnte man mit irgendwas tricksen, was stark korreliert ist, aber selbst das sollte man wahrscheinlich lieber offiziell absegnen lassen.",
            "Traurige Enronmitarbeitergeräusche",
            "Jap. Für mich wär’s wenn halt ne Art diversifiziertes Festgeld. Das bräuchte ich wenn bei Summen über der Einlagensicherung. Und dann all in Italien? Hmm",
            "Ganz normal natürlich. Geld ist fungibel. Dein Kontostand bei TR bedeutet ausschließlich, dass du das Recht hast, dass du diesen Betrag von TR ausgezahlt bekommst. Das sind nicht genau deine Euros. \n\nWarum TR das anzeigt, dass Teile im GMF liegen weiß der Geier. Aber sicherer ist es allemal.\n\n>und zwar auf einem Depot mit deinem Namen.\n\nHab ich nirgends gelesen.",
            "Ja, was könnte sie damit zu tun haben? Zum Beispiel, dass TR damit wirbt, dass die 50k-Grenze mit neuer IBAN, bzw. dem Girokonto für das man eine neue IBAN bekommt, aufgehoben wird?\n\n>**Now unlimited** on all cash deposits, removing the previous €50,000 limit **for all Trade Republic IBAN holders**.\n\n[https://x.com/traderepublic/status/1795342185119793179?s=46](https://x.com/traderepublic/status/1795342185119793179?s=46)\n\nBei mir steht halt noch die Kappung drin. Deswegen frage ich. Andere User berichten, dass sie mit der neuen IBAN jetzt schon Zinsen auf mehr als 50k erhalten. \n\nUnd dein Link führt irgendwo auf die Startseite des FAQ, keine Ahnung, worauf genau du verweisen willst.",
            "Danke ja, ich hab mir das finanztip Video zu tfs etc angesehen. Ich muss mir die Kosten nochmal genauer ansehen. \n\nEs ist einer alter Templeton growth, ein DWS vermögensbildungsfonds, ein Uni Global und noch irgendeiner von Union Invest.",
            "Sorry, schlecht formuliert – ja genau, Besteuerung möglicher Erträge (Dividenden/Kursgewinne) der Neuanlagen. \n\nNeuanlagen wären  \"breit gestreute\" ETFs.",
            "Ja danke, das ist klar. Die liegen seit x Jahren rum wie gesagt aber Zufluss gibts keinen.",
            "Ich habe hier noch ein zweites TR Konto bei dem die TR IBAN noch nicht aktiviert wurde und da steht nichts dabei. Leider lässt dich die neue Kundenvereinbarung nicht runterladen. Wo genau soll diese Information stehen?",
            "Es ist besser als bei auf der Baader Bank basierten Brokern. Aber wenn man mit \"Upgrade für Banking Funktionen\" wirbt, dann erwarte ich kein Downgrade.",
            "Thanks. I was more thinking about whether I'd actually be able to do it. Say the new country doesn't have the concept of junior depots, I'd then have to transfer the portfolio to my account which might not be allowed, while maybe I wouldn't be allowed to keep the depot in the German broker as a non-resident non-citizen. It would also be a sort of workaround the tax system but I guess this doesn't matter as it's also the case for adults (there's no exit tax so capital gains won't be paid to Germany)",
            "Mindestanlagesumme dürfte nur für den Primärmarkt relevant sein.",
            "Bei DKB kann ich zum Support bzgl. Broker nichts schlechtes sagen.",
            "Transaktionen ist bei mir unter ‚Cash‘ zu finden. \nDie gesuchte Dividende war dann unten in der letzten Woche zu finden. \nDanke\n\nIst aber auch Kacke das dort alles ohne Filter, ohne Suche rein gerotzt wird. Ich nutz die Karte fast exclusiv und hab oft 5-10 kleine Zahlungen am Tag\n\nUnübersichtlich hoch 10",
            "Das ist eine erstaunlich einfache und sinnige Erklärung. Danke dir! :)",
            "Schlechteste Jahresperformance des MSCI World ist -20% in den letzten 10 Jahren. Durchschnittliche Rendite 10-11% über die letzten 10 Jahre. Du verschenkst also doch einiges an Rendite wegen eines 1 von 10 Risikos. ",
            "War da nicht nach Geldmarktfonds gefragt? Ihr antwortet alle mit Aktienfonds. EIn Overnight Geldmarktfonds ist natürlich eine sinnvolle Alternative zu dem Fesgeldsurfen und wird dieses wahrschinlich wegen der sehr niedrigen Gebühren sogar schlagen.",
            "15% Risiko Referenz 40%ester 60%msci",
            "Das stimmt und es sind 10k Gebühren und ungefähr 80k Performance.\n\nIst also nichts mit Risiko Diversifizierung. Suche also besser den 3 Geldmarktfonds und den 4. Msci oder FTSE tracker.",
            "Danke für den Link! Schade, dass Ben Felix Kanadier ist :-) Gebühren alleine werden es nicht gewesen sein, aber ich höre es mir gerne an.",
            "Buy High, Sell Low!",
            "Danke!",
            "Und wenn du bei -80% 50k FK rein ballerst bist du in ein paar Jahren der King. Jeder wie er mag.",
            "Ich halte selbst nicht viel von Bitcoin, lol. Mir ging es wie eingangs erwähnt um Inflation. \n\nBitcoin ist für mich nichts weiter als ein digitaler CSA-Dollar. ;) Währung ist und bleibt Währung. Es ist egal ob Krypto oder nicht. Es hat die Eigenschaften einer Währung und nur weil es endlich ist (wie der CSA-Dollar) heißt es nicht dass es wertvoll ist. \n\nMal abgesehen davon dass jede Währung ein Stück weit ihren Wert durch den Glauben der Menschen erhält und der Bitcoin durch was bitte aus der realen Welt gedeckt ist? Einen Token?",
            "Uff der sieht ja mittlerweile echt wild aus. Aber wenigstens die Message ist die selbe:\n\n1. ???\n\n2. Bitcoin ist die Lösung",
            "Nicht alles bei TR liegen haben hilft.",
            "Jo die haben meine Dividenden Einbuchung auf den 14. zurück datiert was ich auch komisch finde.",
            "Das kam aber wegen der Lyxor Übernahme?",
            "Oh wow, jetzt sehe ich es: \"Solactive GBS **Global** Markets Large & Mid Cap\" vs \"Solactive GBS **Developed** Markets Large & Mid Cap\". Hab ich komplett überlesen, danke!\n\nAlles klar, jetztbin ich noch mehr interessiert! Ich zähle auf dich und deinen \"der ETF ist jetzt handelbar\"-Post und hoffe, dass meine Bank den dann auch direkt anbietet. Wäre ja genial.",
            "Das ist eine philosophische Frage. Man kann sich auch fragen, warum es für Deutschland eins gibt. Wenn Italien bis 26 nicht Pleite geht bekommst da halt 3.75% Zinsen, fast ein % mehr als in D.",
            "Ich beschäftige mich in meinem Job mit bankaufsichtsrecht und ich habe das Gefühl die haben da etwas vor das eben nicht nur normales Wirtschaften mit deinem Geld ist. Wir werden sehen.",
            "https://preview.redd.it/nwyd9vov4b7d1.jpeg?width=1170&format=pjpg&auto=webp&s=dfaf7e081c5d47d2dd607e44e624156e6bb9ff25\n\nTwitter von Mai vs Homepage jetzt - ich würde die Homepage nehmen. Noch besser die Finger davon lassen (gemacht).",
            "DWS Vermögensbildung und uni global laufen eigentlich parallel zum all World. Da könntest du dir überlegen, ob du sie vielleicht nicht doch behältst. Der Templeton growth sieht dagegen nicht so gut aus. Aber aus der Vergangenheit kann man nicht auf die Zukunft schließen.\n\nDeshalb: Was du dir anschauen solltest: wie investieren die Fonds und passt das zu deinen Zielen.\nDer UniGlobal läuft z.B. so gut, weil er gehebelt ist. So werden die höheren Gebühren kompensiert - du hast aber keinen großen Vorteil davon. \nWas die Strategie der anderen Fonds ist, habe ich mir.nicht angeschaut.\n\nRendite Vergleich: https://www.fondsweb.com/de/vergleichen/tabelle/isins/LU0114760746,DE0008476524,DE0009750273,IE00B3RBWM25",
            "Wenn ich die Notification bekommen habe, in TR-App in Akzeptieren-Screen, oben von \"Akzeptieren\" Knopf, da stand explizit das Girokonto und Echtzeitüberweisungen \"bald kommen\". Da ich zugestimmt hat, habe ich keinen Zugang mehr zu diesem Screen.",
            "Why not sell everything in the depot and reinvest in whatever is common in your next country? I don't think tax will be a big issue unless you are planning to invest significant amounts.",
            "Bei Anleihen gilt das doch eigentlich auch für den Sekundärmarkt, kenne das nur bei Fonds anders.\n\nBei comdirect geht eine Order unter 100.000€ auch nicht mal in die Ordermaske (tradegate, L&S und gettex versucht). Hab es aber auch nicht mit über 30.000€ (100.000€ * aktueller Kurs) versucht.",
            "10 Jahre sind kein wirklich sinnvoller Zeitrahmen, über den sich belastbare Zahlen erheben lassen. Wie sah es zum Beispiel aus, wenn man im März 2006 in den MSCI World investiert hat und das Geld zwingend drei Jahre später im März 2009 brauchte?\n\nDas heißt ja nicht, dass man das Geld nicht für einen solchen Zeitraum investieren darf, man sollte sich aber schon mögliche Auswirkungen und Risiken bewusst machen und wissen, wie man im Schlechtfall damit umgeht.",
            "Ich habe die Frage so verstanden, als ob u/lightendmarch durchaus bewusst ist, dass Festgeld und Geldmarktfonds eine sicherere, aber eben überschaubarere Rendite liefern, es aber nicht ganz klar ist, warum ein (Aktien-)ETF in dem Zeitraum dagegen nicht unbedingt empfehlenswert ist.",
            "Interessant, ich habe mit Curvo gebacktestet, da kommt ne Rendite von ca. 50% raus von 12/2017-04/24. Robin gibt dafür 23.78% an. Selbst wenn man die Gebühr von 0.75% pa angibt bleibt ein großer Unterschied. Max Drawdown war auch <13%. Sieht auf den ersten Blick schlecht aus für Robin. Die Frage ist natürlich trotzdem, wie die V@R Steuerung im Härtefall funktioniert. Beck hat mal sehr gut erklärt warum alle V@R gesteuerten Fonds gerade in Krisen underperformen. Also das ist bekanntes Phänomen, aber die Garantie gibt Dir halt die Benchmark nicht, insofern ist der Vergleich nicht ganz fair. Aber guter Denkanstoß.\n\nhttps://preview.redd.it/s2tyjyprde7d1.png?width=1453&format=png&auto=webp&s=711bb380ff66ae796fea43e5db418f27ab70becb",
            "Sorry, \"ester\"? Meint das €STR, Euro-Staatsanleihen, ...?",
            "Warum denn überhaupt Geldmarkt? ",
            "Ja das kann man machen. Den Boden zu treffen ist halt auch notorisch schwierig.\n\nAber du beschreibst hier ja eine ganz andere Situation. Der Kommetar spricht von aktuellem Sparplan und wir sind an ATHs. Selbst in einem moderaten 20-30% Downturn, landest du locker mal bei -60%. Das können die wenigsten ab und finden es erst raus wenn es zu spät ist und bekommen Panik, wenn plötzlich ihre 100K Position auf 40K zusammenschrumpft.\n\nHätte wir heute März 2009, würde ich auch sagen rein in die Olga.\n\nBin selber gut tief leveraged, aber mir ist vollkommen bewusst was Sache ist.",
            "Ja, die Ausführungen über die Inflation mögen ja ihre Richtigkeit haben. Wird halt da Geschwurbel, wo man mit den Defiziten des einen Systems die Vorteile seines Systems begründet. Nur weil A schlecht ist, muss B nicht auch nur im Ansatz taugen, es zu ersetzen.",
            "Ich bin lustigerweise nicht pro Bitcoin (der Channel ist eine Empfehlung) weil es immer noch ne Währung ist. Ich kaufe ja auch nicht CSA-Dollar und hoffe auf Wertstabilität etc nur weil CSA-Dollar endlich sind etc. \n\nIn dem einen Punkt stimm ich aber zu. Tatsächlich könnte ich den Punkt mit den Reichen, die reicher werden, mehr ausführen (Steuern und wie ihr Reichtum kaum besteuert wird, ab nem bestimmten Punkt sind die Abgaben einfach kaum existent und wenn deren Produkte immer teurer werden machen sie mehr Profite, so perfide es ist).",
            "Ja. Trotzdem ärgerlich für die Anleger. Bei der Verschmelzung von Comstage auf Lyxor hatten sie darauf geachtet. Amundi scheinen solche Dinge dann weniger wichtig zu sein.",
            "Ernsthaft? Lebst du unter einem Stein? Auf der Homepage steht halt noch der Standard, der mindestens für alle gilt.",
            "https://preview.redd.it/qs47wrfilw7d1.png?width=1080&format=pjpg&auto=webp&s=d4073ba5661d481dfe5678b02f5ff780d2bc6987\n\nDas sieht bei mir etwas anders aus",
            "But that's the thing, would I be allowed to? My understanding is that junior depots are protected, it doesn't belong to me but to my kid and I'm just managing it. If I am in Germany, I can't just sell and transfer money to myself. Maybe they make an exception for people leaving the country?",
            "Tatsache, dann hatten die, die ich mir bislang angeschaut hatte lediglich ne extrem kleine Stückelung.",
            "So hab ich das auch gelesen, wobei \"ETF\" tatsächlich mittlerweile ein mehrdeutiges Wort ist... Es gibt ja auch Geldmarkt-ETFs...",
            "Korrekt! Hätte ich aber besser formulieren können merk ich auch gerade.",
            "[Wikipedia](https://de.wikipedia.org/wiki/Euro_Short-Term_Rate) sagt:\n\n> Am 12. März 2019 hat die EZB beschlossen, das ursprüngliche Akronym **„ESTER“** durch „€STR“ zu ersetzen.\n\nWusste ich tatsächlich nicht, dass es mal offiziell so hieß.",
            "Ja der Euro overnight index, es gibt Tageszins, bisher 3,96, jetzt ca. 3,7 % gibt es in mehreren etf, an der Börse mit 0,01% spread",
            "je nach anlagehorizont und risikofreudigkeit kann man msci und Geldmarkt mischen.",
            "Habe LQQ (Nasdaq 2x) mit 50€ monatlich. Nur durch die TR Aktion gestartet weil die mtl. nochmal 5-10€ on top investieren durch saveback (allein diese Rendite ist sehr gut).\n\nZusätzlich werde ich bAV von Pensionskasse auf den LQQ umstellen und nochmal 15€ \"freies Geld\" mitnehmen.",
            "100%",
            "Wobei es volkswirtschaftlich wahrscheinlich am Ende so ist, dass das Geld der \"Reichen\" ja irgendwo angelegt sein muss - entweder sind es Staatsschulden (dann ist das Geld ja in die öffentlichkeit geflossen), in die Aktien (dann sind die Unternehmen/Arbeitsplätze finanziert worden), selbst Cash ist am Ende nur eine Schuldverschreibung auf das BIP. Also das Problem sind eher die Löhne am unteren Ende der Skala, da braucht es einfach gewisse Standards beziehungsweise noch besser einfach bessere Bildung und Aufstiegschancen für alle.",
            "OK, ich bin mir sicher ich habe zwei Spalten mit \"bald Verfügbar\" gesehen, aber es könnte auch sein, dass ich mich falsch erinnere.",
            "Based on my quick research, it seems like it is possible to sell everything on the account. But the money still belongs to the child. Keeping it for yourself would be considered tax fraud.",
            "Kann das aus der Sicht von finanzschwachen oder politisch instabilen Staaten sehr gut verstehen das sie lieber etwas bessere Übersicht (wenige Große statt viele kleine) ihrer Gläubiger haben wollen. Gerade wenn in diesem Fall die Anleihe in Fremdwährung (Euro/USD) ausgegeben ist.\n\nBei einer 08/15 deutschen oder niederländischen AAA Anleihe in Euro ist das zuvernachlässigen. Bei Unternehemensanleihen das wieder häufiger der Fall.",
            "> Also das Problem sind eher die Löhne am unteren Ende der Skala\n\nAlso genau die Zielgruppe von Bitcoin-Maximalisten. \"Du wirst zwar auch mit Bitcoin nicht rein, aber mit deinem Job ja auch nicht!\"",
            "> Den Großteil ihres Vermögens investieren sie in „Alternative Investments”, also Anlagen jenseits von Aktien, Anleihen und dem Geldmarkt wie Tagesgeld oder Festgeld. Die bekanntesten Alternative Investments sind Gold und Immobilien. Die sind für Family Offices aber nicht die wichtigsten Alternativen.\n\nSchreibt The Pioneer dazu. \n\nDie Reichen stecken ihr Geld nicht unbedingt und auch nicht in großen Mengen in Anlagen die ein Stück weit Spekulation sind und von denen man hofft, dass sich das Geld vermehrt. \n\nWozu denn auch? Die Reichen brauchen sich nicht Gedanken um sowas machen. Das Geld arbeitet von selbst und für sie. Worum es den Reichen wirklich geht ist Wertsicherung. Das schaffen Gold und Grundbesitz, da es endliche Ressourcen sind.",
            "Exactly. So say I want to move countries and the new country doesn't have a concept of junior depot. What happens now - hopefully the broker lets me keep this even as a non-resident non-citizen but this is not certain, but what if not?",
            "Wie Beck es mal sagte - für die wirklichen Geringverdiener würde er keine ETFs sondern vietnamesische Spezielaktien empfehlen) Das ist von der Entscheidungstheorie aus auch genau richtig - wenn Du nichts zu verlieren hast, solltest Du halt mehr Risiken eingehen. Beim BTC ist es villeicht schon wieder vorbei, aber es ja genug andere \"assets\")",
            "Was sagt mir das jetzt? Gold nimmt niemandem was weg, bei Immobilien und Mieten ist das teilweise ein Thema, was man aber ohne Sozialismus ganz gut lösen kann. In sozialistischen Ländern ist Wohnfläche pro Kopf jedenfalls wesentlich geringer als in kapitalistischen.",
            "Geld sollte immer fließen. Das ist ein großes Problem mit den Reichen. Wenn das Geld im Umlauf immer kleiner wird (Anlegen zur Wertsicherung), muss mehr Geld gedruckt werden. Das treibt wiederum die Inflation an. \n\nUmverteilung ist ein Weg um die Verteuerung aufzuhalten. Dafür braucht man übrigens keinen Sozialismus. Auch wenn wir uns in einem sozialdemokratischen Land befinden, nicht im Kapitalismus und du von den Sozialleistungen, die es in den USA nicht gibt weil Kapitalismus schon jetzt oder in der Zukunft profitierst. \n\nIst nicht schön wenn du dir Körperteile abschneidest, krank bist weil du dir Medizin nicht leisten kannst etc. Und das betrifft nicht nur dir Armen in den USA. Da braucht nur Papa Krebs zu bekommen, Haus muss verkauft werden und man landet in der Schuldenfalle.",
            "Deswegen war die Inflation trotz niedriger Zinsen nicht so groß, weil es in nicht liquide Assets geflossen ist. Also so einfach ist die Rechnung nicht. Inflation ist an sich nicht schlecht und ist auch wieder im Rahmen, wir müssen halt insgesamt produktiver werden als Gesellschaft und die Verteilung auch effizienter gestalten.",
            "Inflation ist schlecht. Es senkt die Kaufkraft und ist ein Pi mal Daumen-Ding. Schau dir mal [laenderdaten.info](http://laenderdaten.info) an. Zwischen 1960 und 2022 hatten wir eine durchschnittliche Inflation von 2,7%, aber eine Preissteigerung von 412,87 %.\n\n412,87% / 62 = \\~6,66% p.a.\n\n6,66% - 2,7% = 3,95%\n\nDas passiert wenn man etwas sehr Komplexes versucht zu vereinfachen. Deshalb ist es wichtig sich auch anzuschauen wie sich die Inflation z.B. auf verschiedene Produkte auswirkt.\n\n(Beispiel Belgien und Kopplung der Gehälter an Inflation.)\n\n> Ein Artikel, der 1960 noch 100 Euro kostete, wurde Anfang 2023 also mit 512,87 Euro berechnet.\n\nDa draußen gibt es viele Firmen die noch nicht mal p.a. Gehaltssteigerungen von 3% vornehmen. Teilweise gibt es Nullrunden. Deshalb ist Produktivität als Gesellschaft keine wirkliche Lösung.\n\nAber ich finde es gut dass wir uns bei dem Punkt Verteilung einig sind."
        ]
    },
    "Skandalöse Zustände während der EM": {
        "title": "Skandalöse Zustände während der EM",
        "score": 2085,
        "url": "https://i.redd.it/4ntuagg45x7d1.jpeg",
        "content": "",
        "num_comments": 664,
        "comments": [
            "In der UEFA Fanzone vor dem Bundestag konnte man nur mit Bargeld zahlen. Das aber inklusive Geldautomat mit 5€ Gebühr.\n\n\nWundert mich echt, dass ein Geldautomat weniger kostet als ein Kartenlesegerät.",
            "Ganz ehrlich, ich bin Deutscher und es nervt mich auch, wie oft man nicht mit Karte zahlen kann. Im Vergleich zu anderen Ländern sind wir hier echt (mal wieder) die Sonderlinge.",
            "Ich verkaufe Wein und wir haben im Unternehmen die Sum Up Lesegeräte inkl. Simkarte angeschafft. Auf jeder Veranstaltung können wir den Besuchern und potentiellen Kunden Wein kartonweise andrehen.\n\nAmex, American Express, Visa, Mastercard, ApplePay gerne, her damit. Übrigens: ab Betrag X versandkostenfrei. Ach, noch ein Karton? Gerne. \n\nBargeld ist verkaufshindernd.",
            "Tja sobald es mal nur noch Kartenzahlung givt wundert sich das Finanzamt über die doch gut laufenden Dönerläden.\n\ninfo: Von 6 Dönerläden in meiner nähe Tippen nur 2 Konsequent die richtigen Preise ein. Das ist eine Beobachtung von nun 5 Jahren",
            "Deutschland Geldwäscheland Nr.1. Wenn wir schon sonst nixmehr können.",
            "Wenn man nicht mit Karte zahlen kann, liegt die Vermutung nahe, dass da vieles schwarz abläuft.",
            "In London wirst du nirgends Bargeld los, sogar Straßenkünstler haben Tap-Geräte, mit denen man contactlos zahlen kann.\n\nHier vor 1 Monat auf nem Straßenfest gewesen, da wird man blöd angemeckert wenn man bei 17€ Preis (Imbissbude) mit nem 50iger zahlen will (wohl gemerkt spät nachmittags und da war sehr viel los) „man ist doch keine Wechselstube!“ darauf konnte ich auch nur entgegnen: „dann bietet doch kontaktlos an“ - „ne soweit sind wir nicht“ \n\nZum kotzen",
            "Die gleiche Beschwerde wie 2006 bei der WM? Können die sich keine neue ausdenken?!",
            "Bin grad in Kopenhagen ein Festival genießen und man kann immer und überall mit Karte zahlen. Ich liebe es einfach. Wenn man mal mit Bargeld zahlen will, gibt es im Discounter gerne Münz und Scheinautomaten. Einfach alles reinwerfen, wird automatisch gezählt und Wechselgeld ausgeworfen.",
            "Insbesondere für Gäste aus Nicht-Euro Ländern ist es wirklich nervig, weil keiner Lust auf eine Bargeld einer Währung hat, die er nicht weiter verwenden kann.\nIch war dieses Jahr bereits in UK & Polen und habe nicht einmal überlegt, ob ich Bargeld brauche, weil es in den Ländern so selbstverständlich ist alles mit Karte zu zahlen.\nTraurig, dass wir so hinterher hängen.",
            "Waren heute auch im Stadion, hatten Lust auf ne Bratwurst. In weiser Voraussicht vorher 100€ abgehoben, Automat gibt zwei 50er. Dann im Stadion: „Sorry wir haben kein Wechselgeld mehr, den können wir nicht wechseln.“ \n\nDann in der Halbzeitpause Bier holen. Stehen an am Stand, es geht nur schleppend voran. Natürlich Cash only. Auf halber Strecke fällt dann die Kasse aus und muss neu gestartet werden. Alles verzögert sich. Dann sind wir fast dran, aber! Noch einer Verzögerung, erstmal neue Münzrollen aufbrechen. Dann sind wird dran, zwei Bier für 20€ 🥹 ok 6€ Pfand. Und zurück kriegen wir dann zwei nasse Scheine, die wir erstmal nicht ins Portemonnaie stecken konnten, weil das dann nach Bier reichen würde. \n\nWenn jeder Stand einen Karten Terminal haben würde, wäre alles so viel einfacher für alle. Aber nein, Cash muss ja King sein ☢️",
            "In Hamburg gibt's ne Kneipe, wo man nicht mit Karte zahlen kann, aber ein riesiger ATM-Automat mitten im Laden steht. Der Ladenbetreiber räumt damit doppelt ab: Er spart sich die Kartengebühr von 1-5% und verdient auch noch Platzmiete. Der \"Gast\" zahlt dafür die 5% Gebühr.\nDas Essen ist aber gut.",
            "Gestern beim Tischler mit kleinem Baumarkt im Ort auch gestanden und blöd geguckt, weil meine Debit Card nicht ging… und dahinter hing das Schild kartenzahlung ab 15 Euro… ich hasse Deutschland dafür",
            "Muss sagen, das war das schwierigste für mich, um mich daran zu gewöhnen als ich aus den Niederlanden hier hin gezogen bin. Dort kannst du sogar €0,90 auf der Wochenmarkt mit Karte bezahlen.",
            "Oder „Kartenzahlung ab 10€!“ 🤮 \n\nWenn ich so etwas sehe und es nicht vermeiden kann, dort einzukaufen, zahle ich gerne mit den größtmöglichen Schein, den ich habe.",
            "Wer kennt es nicht „Nur Girokarte oder Bargeld“.",
            "Das Video dazu ist äußerst unterhaltsam: https://mastodon.social/@aaronk6/112625913172321379",
            "Deutschland ist zahlungstechnisch in der Steinzeit hängenbleiben. Das ist für Leute aus normalen Ländern einfach nur total kurios, ein Freilichtmuseum.",
            "Ich konnte letztens im Backwerk nicht mit Karte bezahlen. Es hing auch kein Schild dies bezüglich aus. Man wurde erst beim Bezahlen drauf hingewiesen. :D",
            "Wo genau soll das sein? Ich kann 95% meiner Einkäufe mit (Kredit)Karte zahlen. Manche Imbissbuden nehmen keine Karte, gehe ich halt in die welche sie nehmen. In New York konnte ich an manchen Imbissbuden auch nicht mit Karte zahlen. Wenn ich hier ins Restaurant gehe und nicht bar zahlen will frage ich halt vorher nach. Wenn das genügend Leute machen wird der Wirt sich schon irgendwann ein Zahlungsterminal anschaffen.\n\nIn Japan ist teilweise noch schlimmer, dort wird vieler Orts nur Bargeld genommen, im technologisch weitentwickelsten Land der Welt.",
            "Debitkarte goes *Funktioniert nicht*",
            "Immer wenn ich in Kanada jemandem sage ich bin Deutscher kommen die folgenden drei Antworten: \n1. Ohh Autobahn \n2. Bier \n3. Cash Cash Cash. \nIst hier offenbar common knowledge nicht ohne Cash nach Deutschland zu reisen.",
            "Wo hat der Typ den eingekauft.... In allen Supermärkten in den ich bin kann man heutzutage mit fast jeder Kreditkarte zahlen...",
            "Lebe seit ein paar Jahren im Ausland und habe mich auch gut gewundert, dass ich in der Bar nicht mit Karte bezahlen konnte",
            "Ich war dieses Jahr schon 4 mal im UK und stand da schon mehrmals ratlos rum. Manche nehmen keine EU-Kreditkarte aber auch kein Bargeld oder andersrum nur Bargeld. Debitkarten gehen nur für kleine Beträge ohne Pin. Wenn man Cash bezahlt ist es normal, dass es kein Wechselgeld gibt z.B. im Bus oder an der Kaffeebude. Gerne auch mal 2-3 Pfundt",
            "Ach ja, letztens als ich in UK war hatten mehrere Läden beim Bezahlen mit Kreditkarte einen Mindestbetrag eingeführt. Warum wohl?",
            "Komme grad aus vietnam. Da wird alles per qr bezahlt. Im Prinzip ein einfacher weg der banküberweisung. Komplett gebührenfrei und innerhalb von wenigen Sekunden vollzogen. \nWir werden verarscht hier",
            "Optionen sind immer gut, aber extreme sind scheiße. \nAllgemein ist es gut, dass es beides gibt.\nDie Leute unterschätzen was für Gefahren das Nichtvorhandensein von Bargeld mit sich bringt.",
            "Wenn du ein Fax nehmen musst weil du ein Schriftstück hast, das gescannt werden muss zum Versenden, wäre eine Lösung gewesen überhaupt erst mal kein Papier zu generieren  sondern direkt eine Mail. (Ausnahmen bestätigen die Regel)\n\nDesweiteren können moderne MFPs Scan2Mail, typischerweise als PDF-Anhang. Mit DEUTLICH besserer Qualität als jedes Fax. \n\nPlot twist: Viele der Schriftstücke die du mit dmlem klassischen Beep-Boop-Chhhhhhrt-Fax heute noch wegmorsen tust werden höchstwahrscheinlich beim Empfänger ohnehin schon gar nicht mehr ausgedruckt sondern noch digital als PDF konvertiert und intern an fax@firma.de geleitet. \n\nLöse auch du dich vom Fax und werde ein besserer Mensch :)\n\nAußer du bist Arzt oder Apotheke. Irgendwas mit \"Rechtsverbindlichkeit\".",
            "Bin generell auch gegen Bargeldabschaffung aber man sollte doch mal endlich überall mit Karte zahlen können",
            "ich war letzte Woche beim Friseur und das war der erste Ort seit Jahren wo ich nicht mit VISA oder Handy bezahlen konnte",
            "Und deswegen laufe ich immer mit je einer Visa, MC und Amex Kreditkarte, einer Visa und MC Debitkarte, einer Girokarte meiner Bank und 300€ in Bar rum.\nAbgesehen davon noch Google Pay, Payback Pay und Paypal digital Debit card für die ganz harten Fälle. \n\nNur ein Vertrag zum Übertrag meiner Seele habe ich nicht dabei, das hat aber auch erst ein, maximal zwei Mal, ein Problem dargestellt. \n\nAlles easy, die sollen sich nicht so anstellen. /s",
            "Dieses ganze Karten Zeugs und das mit dem internez Firlefanz ist doch sowie so nur ein kurzlebiger Trend für Hippies und sonstige Sonderlinge. Bares ist wahres und so soll es auf ewig bleiben. ",
            "Ich verstehe diese Kommentare nicht. In UK kann man nicht mal mit Euro oder Dollar zahlen. Was für Hinterwäldler.",
            "War diese Woche ein Auto anmelden. Beim Straßenverkehrsamt. Zahlung in bar oder mit Girokarte. Diverse Leute mussten während der Termine zur Sparkasse Bargeld abholen, weil Google/Apple pay , Visa oder sonstige Zahlmöglichkeiten nicht möglich sind. War auf dem Amt wie ne Zeitreise in die Vergangenheit.",
            "Bei Lidl bezahlen Dreiviertel noch mit Bargeld",
            "Ich liebe mein Bargeld 😎",
            "Cash is freedom! No tracking, no fees!",
            "Einfach knallhart schlechte Google Bewertungen bei den entsprechenden Lokalen hinterlassen. Dann tut sich vielleicht mal was..",
            "Mein Dönermann im dörflichen Umfeld von MS akzeptiert problemlos Kartenzahlung.",
            "Nervt brutal aber wir sagen immer Wahre für wahre",
            "Das würde mich auch sehr stören, weil meine normale Bankkarte eine Visa Karte ist",
            "In China habe ich ausnahmslos alles mit WeChat-Pay oder Alipay bezahlt. Selbst beim kleinsten Straßenhändler. Weder hab ich meine Visa genutzt, und nur ein einziges Mal Bargeld in der Hand gehabt.\nDeutschland war wieder ne Umstellung, wenn man in der Eisdiele steht und das Schild „Keine Kartenzahlung“ sieht. \nWillkommen im 19. Jahrhundert 🤮",
            "Deutschland hängt gefühlt in den 90ern fest!",
            "Mittlerweile in Berlin: immer mehr Läden wo kein Bargeld mehr akzeptiert wird. Find ich genauso nervig wie nicht mit Karte zahlen zu können.",
            "Die Liebsten sind mir diese Kioskbetreiber die dir immer erzählen, dass sie Kartenzahlung ja 3000€ pro Jahr an Gebühren kosten würden und sie dann pleite gehen!!111elf...\nGenau, aber von Hand die Kassenabrechnung machen, abends um 22 Uhr mit dem Tagesumsatz nach Hause latschen und dann am nächsten Tag zur Bank bringen...ist klar, kommt bestimmt viel billiger.",
            "Es wäre ok im Jahr 1998. Heute haben wir 2024 und es sollte selbsverständlich sein überall mit der Karte zu bezahlen....",
            "Finde das mittlerweile auch ziemlich nervig. Gerade wenn man mal was mit Zoll von der Post bekommt, muss man entweder genau den Betrag in bar haben oder es hinterher aus der Filiale holen. Wieso ist das so schwer? Sogar der Teppichhändler inmitten der Wüste in fucking Ägypten hat meine Kreditkarte genommen!",
            "Es gibt hier in Deutschland einfach viel Bargeld. \n\nUnd das kann nicht einfach eingezahlt werden um dann mit Karte zu zahlen. Und das wandert von A nach B usw. \n\nHabe verschiedene Karten und Handy immer dabei. Aber immer 50 im Geldbeutel und nen Zwanni im Auto an der Sonnenblende, wenn mal was ist oder ne Karte nicht genommen wird. \n\nEin Drama find ich das jetzt nicht. Da gibt’s schlimmeres was digitalisiert gehört.",
            "Ich kann’s bestätigen. Mein Friseur akzeptiert nur Barzahlung. Fährt X6 im Wert von 120.000 €. Har ein EFH im Wert von 650.000 €. Aber er kann kein deutsch.",
            "jA dAnN eRkLäR mIr MaL wIe IcH dAnN nOcH mEiNe StEuErN hInTeRzIeHeN sOlL!!!",
            "Deutschland ist rückständig und wird es immer mehr passend zum Rechtsruck der Gesellschaft und dem Anstieg der AFD.",
            "Mein Kiosk an der Ecke will für Zahlung per Bankkarte 50ct Gebühr. Trauerspiel.",
            "Schwarzgeld goes brrrr.",
            "Es ist aber auch so ein wenig Stichelei der Briten ... da suchen die sich natürlich die 10% aus, wo man nur bar bezahlen kann ,aber unterschlagen, dass Kreditkarte in den meisten Restaurants und Geschäften ganz normal ist. Aber grundsätzlich haben wir Deutsche ein gestörtes Verhältnis zu Fortschritt und Innovationen, weil viele Menschen in ihrer Bubble immer von dem Schlimmsten ausgehen ... da ist Geldwäsche und Kriminalität vernachlässigbar (machen ja ehh nur Ausländäää !!!111), wenn man ständig \"Bargeld ist Freiheit\" und \"schützt uns vor Den da oben\"\n\nLeute, wenn es wirklich hart auf hart kommt und der Staat es richtig drauf anlegen wollen würde, kann euer geliebtes Bargeld auch sinnlos werden.",
            "Arbeite in drei dieser Stadien. Kann bestätigen, dass diese Aussage nicht stimmt.",
            "Ich verweigere jeden Laden der keine Karte nimmt und ich erkundige mich auch nicht. Wer kein Bargeld dabei hat, kann eben nicht zahlen, egal ob der Verkäufer jetzt einen \"Aufwand\" hatte. Gleiches gilt für Visa. Meine Bank hat EC eingestellt und ich kann nur noch mit Visa zahlen. \"Aber das kostet uns Gebühr\" ja, dann schlag die drauf oder ich kann nicht bezahlen und kaufe eben nicht, schönen Tag noch.",
            "Nur Bares ist Wahres 🫶",
            "Wenn das Finanzamt nicht jeden Selbstständigen in den Ruin treiben würde wäre es weiter verbreitet",
            "Wo machen Leute eigentlich noch solche Erfahrungen? Außer bei ganz kleinen Dönerläden oder so kann man doch inzwischen überall mit Karte zahlen, grade da wo man als Tourist hinkommt",
            "Also ich finde Bargeld geil, gäbe es das nicht, bekäme ich kein Trinkgeld. Jeden Tag so zwischen 10-40€. Aber ansonsten gebe ich euch Recht.",
            "Ja nervt manchmal, aber ich mag Bargeld schon - es abzuschaffen halte ich für falsch.",
            "Oh oder mit Bargeld? Ist halt blöd wenn man erst bei der EU nicht richtig mitmacht, dann austritt und dann überrascht ist, dass die in der EU anderes Geld haben.",
            "Liegt wahrscheinlich an der Besteuerung und den ganzen Auflagen in DE. Wenn du da alles offiziell versteuern würdest ( was du mit Kartenzahlung machen musst), müsstest du die Preise so stark anheben dass dir Kundschaft und damit wieder Einkommen fehlt. \nIn Berlin haben die Läden, bei denen Kartenzahlung akzeptiert wird oft durchschnittlich höhere Preise. So ist jedenfalls meine subjektive Erfahrung.",
            "Das Zauberwort ist am Ende des Satzes: Die Debitkarte (EC-Karte) wird fast überall akzeptiert. Und zwar weil das für die Geschäftsinhaber billiger ist, als Kreditkarten. Und da in Deutschland sehr viele Leute ein Girokonto haben, womit typischerweise eine Bankkarte (EC-Karte gleich wie die heutzutage jetzt auch heißen mag) einhergeht, ist das eben das Standardplastikgeld.",
            "Denke mittlerweile dass es auch daran liegt, dass die Abgabenlast und der Bürokratische auffwand hier vergleichsweise hoch sind, wenn man eben alles offiziell machen möchte. Zudem sind die Kosten für Zahlungsdienstleister, jdenfalls bei den großen Hausbanken, vergleichsweise hoch.\n\nHinzukommt natürlich die deutsche Behäbigkeit, vergleichsweise hohe Managementineffizientz und immer noch großes Misstrauen gegenüber Banken/Zahlungsdienstleistern und dem Internet...",
            "Bisschen übertrieben, aber kann schon vorkommen.",
            "Wir sind aber damit nicht allein auf der Welt.   \nIch musste die gleiche Erfahrung auch in Tokio machen.",
            "Also in Köln sowohl auf dem Public Viewing als auch dem Fanfest keinerlei Probleme.\n\nStadion sowieso nicht.",
            "Debutkarte = Visa oder MasterCard. Kann in DE auch fast überall mit Visa zahlen.",
            "Meine Amex wird in DE sooft abgelehnt da könnte ich reinschlagen",
            "Das ist aber sehr vom Ort abhängig und schon eine riesen Verbesserung zu wo wir waren",
            "(Verse 1)\n\nBarbara lebt bei den Bargeld-Barbaren,\n\nwo Münzen klirren und Scheine prahlen.\n\nDoch Barbara hat das anders im Sinn,\n\nsie liebt moderne Zahlungen, das ist ihr Gewinn.\n\n\n\n(Chorus)\n\nKein Bargeld für Barbara, das ist klar,\n\nsie zahlt mit Karten, das ist wunderbar.\n\nVisa, Mastercard und Amex, oh ja,\n\nPaypal und ApplePay, das ist, was sie sah.\n\n\n\n(Verse 2)\n\nDie Barbaren staunen, verstehen es nicht,\n\nBarbara lächelt, zeigt ihnen das Licht.\n\nMit einem Klick ist alles bezahlt,\n\ndie Zukunft des Geldes, die hat sie gemalt.\n\n\n\n(Chorus)\n\nKein Bargeld für Barbara, das ist klar,\n\nsie zahlt mit Karten, das ist wunderbar.\n\nVisa, Mastercard und Amex, oh ja,\n\nPaypal und ApplePay, das ist, was sie sah.\n\n\n\n(Bridge)\n\nIm Dorf der Barbaren, da funkeln die Augen,\n\nBarbara zeigt, dass sie nichts mehr glauben.\n\nDas Knistern der Scheine, das ist vorbei,\n\ndie Zukunft, sie kommt, und das bargeldfrei.\n\n\n\n(Chorus)\n\nKein Bargeld für Barbara, das ist klar,\n\nsie zahlt mit Karten, das ist wunderbar.\n\nVisa, Mastercard und Amex, oh ja,\n\nPaypal und ApplePay, das ist, was sie sah.\n\n\n\n(Outro)\n\nBarbara lebt in der Welt der Barbaren,\n\ndoch sie wird nie wieder Bargeld bewahren.\n\nDie Karten und Apps sind ihr liebster Schatz,\n\nBarbara tanzt im digitalen Glanz.",
            "Bitcoin fixes this.",
            "Bin ich der einzige der so ziemlich überall im Umkreis mit Karte zahlen kann? Habe wirklich nie Probleme und laufe quasi nie mit Bargeld rum",
            "Ich habe letztes Jahr ein Fahrrad gekauft, welches durchaus nicht günstig war. Ich dachte ich falle von eben diesem, als der Verkäufer meine Debit oder Kreditkarte würde nicht gehen",
            "Bester Kommentar meiner boomer Geschäftskollegin: ohne Bargeld kann die Oma den Kindern kein Geld mehr für schleckere (süßes) geben, deshalb sollte man Bargeld immer vor Karte stellen 😂😂😂",
            "Ich weiß nicht wo ihr wohnt aber hier kann man das überall  mit Karte zahlen mittlerweile?",
            "Hatten wir halt hier auch schon öfter diese Woche, das Thema",
            "\"der deutschen Händler\"",
            "2021 „Organisationsversagen“ und „archaische Verhältnisse“\n\nDigitalisierung in Deutschland - Lehren aus der Corona-Krise\nGutachten des Wissenschaftlichen Beirats beim Bundesministerium für Wirtschaft und Energie\n\nhttps://www.bmwk.de/Redaktion/DE/Publikationen/Ministerium/Veroeffentlichung-Wissenschaftlicher-Beirat/gutachten-digitalisierung-in-deutschland.html",
            "\"Just bring your Euros mate\" oh......richtig :>",
            "Das irgendwelche kleinen Läden nur Bargeld nehmen, finde ich ok. Ist ja am Ende eine Aufwandsentscheidung und wie sehr Kunden eben eine solche Zahlung Nachfragen.\n\nAber falls es in den Stadien keine Kartenzahlung gibt, obwohl man weiß, dass viele internationale Gäste kommen, dass ist schon ein kleines Armutszeugnis.\nHier hat der Betreiber ja wahrscheinlich einen kleine Monopolstellung.",
            "Wenn ich mit meinem Lambo durch eine Radarkontrolle cruise, kann ich problemlos mit meiner Amex Platinum zahlen. Weiß nicht, wo das Problem sein soll.",
            "Ich zahle grundsätzlich Alles und überall mit CC oder Apple Pay und hatte noch nie bzw. äusserst selten Probleme. Bargeld hebe ich eigentlich nur noch als Zugabe für Geschenkkarten ab wenn ich so drüber nachdenke 😅\n\nDa ich beruflich mit verschiedenen Bezahlsystemen zu tun habe, bin ich aber vielleicht auch einfach offener den Technologien über.",
            "Der Mann hat absolut recht. Es macht mich als Kartenzahler wahnsinnig! Wir waren neulich in Ostfriesland im Urlaub. Wenn Kartenzahlung, dann meist kein Visa, nur „EC“, womit man wohl die Debitkarte meint. In Dänemark kann man beim Eiswagen im Park mit Karte zahlen. Alles was man braucht ist ein Lesegerät, ein Telefon und den Willen einen großen Teil der Kunden nicht zu verprellen, weil man 0,8% des Betrages an Abgaben scheut. Stattdessen verzichtet man lieber komplett auf die Einnahmen wenn dann Kartenzahler wie ich sich wieder umdrehen und gehen.",
            "Für manche sind es kurzzeitig skandalöse Zustände, für andere ist es trauriger Alltag.",
            "Zahle alles mit Handy. Wenn ich nicht mit Handy zahlen kann, gehe ich und komme nie wieder. Das zwingt mich oftmals zu den Ketten zu gehen, aber ist mir ehrlich gesagt völlig egal. Erst heulen alle Kleingeschäfte rum, dass der Onlinehandel sie kaputt macht und dann nicht mal Kartenzahlung anbieten.",
            "Bin großer Bargeld fan, zahle wann immer möglich mit Bargeld. Trotzdem finde ich, man könnte die Möglichkeit für Kartenzahlung ausbauen. \nIch persönlich würde nicht mit Karte zahlen, aber es gibt viele die das anders sehen und alleine deshalb verschreckt man viele Kunden.",
            "ist doch Unsinn. Die Frankfurt Arena z.B. sagt klar \"kein Bargeld\". Die nehmen sogar Alipay+, was auch immer das ist.",
            "Also es nervt mich teilweise auch, aber das sind dann eher kleinere Geschäfte/Friseursalons/.., wo man als Einheimischer was bezahlt.\nVon größeren Geschäften, die eine größere Kundenzahl haben, und die insbesondere zu größeren Konzernen gehören, kenne ich sowas nicht.",
            "Ich mag es eigentlich echt gerne. Bargeld hält einige sehr wichtige Systeme am Laufen (ehem) - und es schützt ein Stück weit vor der Gefahr, dass in einer nicht allzu weit enfernten dystopischen Zukunft eine Partei den unliebsamen Bürgern einfach die Konten schließt.",
            "Nur Bares ist Wahres! Ich habe absolut nichts gegen eine alternative Zahlmethode. Habe auch Apple Pay eingerichtet usw. Aber das ist für Situationen, wo ich spontan mehr ausgebe, als ich Bargeld dabei habe. \nAbgesehen davon, muss ich mich halt mal erkundigen wenn ich in ein anderes Land reise, wie das da mit dem bezahlen aussieht.",
            "Ich kenn das von Eisdielen, Dönerläden, kleine Kneipen mit Taschenrechner, ist mir aber egal, ob der hinterzieht oder alles korrekt ist. \nIch habe weder Problem mit bar noch mit Karte. Habe auch schon eine thai Massage a 120€ in bar bezahlt, weil die laut Aussage kein Gerät haben. Musste kurz zur Bank. \nGibt's hier eigentlich keine Bedenken, daß Kartenzahlung auch Möglichkeiten für Missbrauch bietet? Klingt hier, als wäre nichts besser und sicherer als Karte.",
            "Wir haben gerade erst alle Ämter auf die neuste Technik umgestellt. Endlich haben auch wir Fax!",
            "Positiv sehen - je weniger digitalisiert desto wehrhafter gegen Cyberangriffe 😆",
            "Die Deutschen und ihre Bargeldliebe ist wenn man mal genau hinschaut immer noch der tief verankerte Antisemitismus bei den Kartoffeln. \"Den Banken kann man nicht trauen, die überwachen uns und ohne Bargeld bestimmen die über uns.\". Ich mein um da nicht die Verbindung zum Klischee des vermeintlich räuberisch jüdischen Bankenwesen zu sehen, da musste schon legal blind sein. Tätervolk bis zum Ende aller Tage.",
            "Also wo man mit einer „deutschen“ Debitkarte bezahlen kann, da kann man meist auch mit einer europäischen Debitkarte bezahlen. \n\nWo genau man nicht mit Karte zahlen kann, weiß ich nicht. Gibt natürlich manche Orte - aber ich war letzte Woche in Paris und da habe die auch…",
            "Aus meiner Sicht stimmt das in 2024 überhaupt nicht mehr und ist reine Stimmungsmache mit konstruierten Einzelfallbeispielen.\n\nIch zahle fast nur noch mit meiner Uhr und bin im Monat maximal 1-2 mal in Situationen, in denen ich tatsächlich Bargeld brauche.\n\nIst genauso wie das Argument mit schlechtem Internet, das stimmt nur noch in Hintertupfingen wo niemand wohnt. Die Großstadt in Europa mit der besten 5G-Erfahrung ist übrigens Berlin, mit München auf Platz 9 (laut MedUX)",
            "Sorry, aber die Payment Dienstleister zwacken zu viel von der Marge ab. Das wird nur teurer, wenn man so viel mit der Karte zahlt. Sicher nicht.",
            "Hallo zusammen, Bargeld ist Freiheit vor einem übergriffigen Staat . Habe einige Karten und bin weltweit unterwegs………….aber möchte auf Bargeld nicht verzichten…Letzte Bastion ????Denkt mal darüber nach. LG Ken",
            "Nur bares ist wahres",
            "Wer reist auch in ein Land ohne Bargeld. Selber schuld.",
            "Ich kanns verstehen. Kartenzahlung kostet für den Empfänger Gebühren und ist extra Aufwand.",
            "Ich zahle immer mit einer VISA Karte. Hatte nie ein Problem.",
            "Ich kann das nicht ganz nachvollziehen. Ich habe seit dem die DKB für die Girocard Geld wollte, diese abgeschafft. Ich hab so gut wie nie die Situation, dass ich nicht mit meiner TR VISA zahlen kann. Ich hab nen Notfallzwanni in meiner Smartphonehülle und der wird oft monatelang nicht gebraucht.",
            "Also ich kann fast zu 90% überall mit Karte zahlen ….selbst beim Dönermann",
            "Aber unsere Freiheit!!!!!1!1!1!! /s",
            "Ich frag mich wo die immer überall einkaufen. Ich zahle schon seit mindestens 5 Jahren überall mit Kreditkarte (bzw mittlerweile Apple Pay).\n\nZugegebenermaßen hat mich ein Laden, der keine Karten akzeptiert, dann aber auch das letzte Mal gesehen. Ist vielleicht unfair, aber ich gehe dann eigentlich immer von Steuerhinterziehung aus. \n\nJa, ich hab schon lange keinen Döner mehr gegessen ;)",
            "Ich zahle alles mit Mastercard. Bargeld habe ich nie mehr als 2-3€ dabei. Notfalls habe ich noch eine Girocard dabei.",
            "Immer wenn ich auf irgendeinem Festival bin kann ich nie mit Karte zahlen, immer nur Bargeld es ist wirklich schlimm in Deutschland",
            "Bei der Allianz Arena in München haben sie aber nur Karte genommen",
            "Dank dem Finanzamt.... Traurig, aber leider ist es wichtiger, Steuern zu sparen als Kundenservice.",
            "Also ich muss sagen ich zahle in DE alles per Google Pay und online mit PayPal. Nur mein Friseur nimmt nur Girokart und ein Asiate gar keine Karten. Das sind die einzigen Ausnahmen.",
            "Nur Bares ist Wahres",
            "Alle reden von Steuerhinterziehung,  aber in vielen Fällen (wenn der Umsatz entsprechend Hoch ist), geht es um Gebühren \n\nJa Bargeld Handhabung kostet auch Geld, aber keine Zentausende Euro pro Jahr 🤷‍♂️",
            "Willkommen in Deutschland. Angela Merkel galt ja nicht gerade als digitale Vorreiterrin",
            "Wenn die Politik mal weniger Rückständigkeit fördern würde, vor allem CDU und SPD. Aber nur so verschreckt man nicht die Menschen die 10 Jahre vor dem Tod sind und jetzt keinen Bock mehr haben sich an was neues zu gewöhnen ",
            "Der Ehrlichkeit halber - die Deutschen mögen halt keine Gebühren zahlen, daher war CC schon immer tot und EC es auch schwer. Kann man bei den Paar Prozent lächerlich finden, aber dann erinnert man sich an die TER Diskussionen hier, hehe.",
            "Das bestehen auf Bargeldbezahlung in DE ist offensichtliche kollektive Steuerhinterziehung. Das schadet dem Steuerzahler da er letztendlich für die dadurch entstehenden Lücken aufkommt. witzigerweise ist es ausgerechnet der Steuerzahler selbst, der vehement am Bargeld festhält.",
            "Bargeld ist Freiheit",
            "Soll er halt Bargeld mit sich tragen, andere länder andere sitten. Sehe das Problem nicht, zahle auch ungerne in UK mit Karte weil die Gebühren durch die Decke schießen. Dann nehme ich doch lieber paar Pfund vor ort beim exchange oder von hier aus schon mit. Letztlich bleibt sowohl karte als auch bargeld Legal Tender, die Briten sollen sich lieber über ihren schlechten fußbal in der EM beklagen",
            "Krass, wie toll sich hier alle finden, die sich komplett auf US-Unternehmen verlassen, die ihre Daten sammeln und untereinander austauschen.\nApple, Google, Amex, Visa, MasterCard. \nBei einer Europameisterschaft in Deutschland.\nPeinlich. \nUnd jetzt her mit den down votes und das Amöbenargument \"ich hab nix zu verbergen.\"",
            "Ist halt alles Steuerhinterziehung. Die geht mit digitaler Zahlung nicht so einfach",
            "Richtig so.",
            "DAS hat nichts mit \"Bargeldliebe der Deutschen\" zu tun, sondern mit Steuerhinterziehung.",
            "wieso? Schwarzgeld geht nicht gut mit Karte.. Also seid mal nicht so streng.",
            "Mit Kartenzahlung kann man keine Steuern hinterziehen.",
            "Als jemand der sich Beruflich mit Digitalisierung beschäftigt ist das schon sehr frustrierend, wir hängen echt Jahre hinterher und man bräuchte sich nur in Nachbarländern umschauen was für ein Angebot es da gibt und die erfolgreichen Konzepte übernehmen da diese dort schon seit Jahren verwendet werden. Das Problem sind oft ältere Leute in den Entscheidungspositionen die das für unnötig halten oder für zu teuer.",
            "Der Geldautomat kostet halt die Kunden Geld, das Kartenterminal kostet den Anbieter Geld.",
            "Echt? Ich hab in Stuttgart alles mit Karte zahlen können.",
            "Also am Getränkestand am Brandenburger Tor konnte man problemlos mit Debitkarte bezahlen. Kreditkarte = Fehlanzeige",
            "Währendessen kannst in Kroatien beim Strandhandtuchjohnny alles mit Apple Pay zahlen.",
            "Ich war letztens 1 Woche in UK und habe testweise kein Bargeld abgehoben. Kein einziges Mal Bargeld in die Hand nehmen müssen. Bus und Bahn in London alles kontaktlos. Selbst der Typ im Nachtclub auf der Toilette, der dir die Papiertücher reicht, hat Karten akzeptiert, damit ich ihm 2 Pfund geben konnte lmao\n\n\nEs ist schockierend, wenn man aus einer Landeshauptstadt kommt, wo man in 50% aller Transaktionen cash nutzen muss",
            "Also bei uns kann man wohl mittlerweile an Markttagen bei vielen ständen mit Karte zahlen, habe ich gelesen…meine Apotheke dagegen so: „unser Gerät kann nur EC“…aber auch nur, solang keiner irgendwo Visa sieht.",
            "Als deutscher fällt mir das lustigerweise nur dann auf, wenn ich in touristischen Regionen in Deutschland unterwegs bin. Zuhause Brauch ich Bargeld eigentlich nie",
            "Letztes Jahr war ich auf einem großen Weihnachtsmarkt und hatte nur meine Karten dabei. Ich konnte wirklich NIRGENDS etwas kaufen, weil die meisten Stände keine Kartenzahlung akzeptierten. Ich musste schließlich Leute fragen, ob sie mir für PayPal Knete, Bargeld geben konnten. In welchem Jahrhundert steckt Deutschland eigentlich teilweise noch fest? lmao",
            "Ich wunder mich, wo ihr alle wohnt. Ich wohne in einer 40.000 Einwohner Stadt und habe seit... 5 Jahren(?) kein Bargeld mehr von der Bank geholt. Ich bezahle ausnahmslos mit VISA, meiner regulären Bankkarte oder Google Pay (da auch entweder VISA oder PayPal). Ich hab tatsächlich schon so lange kein Geld mehr von der Bank holen müssen, dass ich sogar meinen selbst vergebenen Pin vergessen hatte. \n\nSogar Parkautomaten bezahle ich per App. Und meine Stadt ist weder hochmodern, noch eine \"Groß\"stadt...",
            "Geht in Deutschland leider nicht, weil uns nur Bargeld vor denen da oben schützen kann /s",
            "Keine Ahnung wo Du so verkehrst aber ich kann immer überall mit Karte zahlen.",
            "Oder \"erst ab einem Einkaufswert von 10 Euro\"\n\nNur weil die scheiss Verträge mit ihrer Bank haben.",
            "Ich kann bei der Post mit meiner POSTbank-Karte (und wahrscheinlich alle anderen) nicht kontaktlos zahlen, selbstverständlich auch nicht mit der Karte auf dem Handy.",
            "Was ich im Ausland oft spannend finde ist, wenn du z.B. in der Straßenbahn einfach bei so einem kleinen Kartenterminal Tap-In machen kannst und hier in Österreich steht da ein 1x1x0,4m großer Ticketautomat in jeder Straßenbahn nur um einen Fahrschein zu lösen.",
            "Mich persönlich wundert dieser Artikel schon, weil ich quasi alles mit dem Handy bezahle. Habe seit Monaten kein Bargeld abgehoben und verwende das nur beim Eisladen, weil das schneller geht als für 3,50 jedes Mal das Kartenlesegerät anzuwerfen. \n\nSelbst der Dönerladen hier im Ort nimmt Karten an.",
            "Bin gerade im Urlaub und kann im Fucking Stadtbus meine Kreditkarte hinhalten. Kostet leider 2ct an Gebühr.",
            "Ich hab vor 10 Jahren in Brasilien gelebt, genauer in Sao Paulo. Straßenkünstler haben dort schon ihre Kunst mit Kartenlesegeräten verkauft, damit sie nicht ausgeraubt werden. Wenn du von Brasilien 10 Jahre zuvor abgehängt wirst, läuft einiges in diesem Land falsch.",
            "Im Ausland ist die tax policy auch nicht so krass wie in Deutschland, klar möchte man dann auch schwarz kassieren, nur wie wenn nicht Bar?",
            "Dafür haben wir aber Bürokratie. Soll mal einer nachmachen!",
            "Geh mal nach Japan.",
            "Einfach nicht genug schwarzgeld 😂",
            "Und wenn, dann gibt es jetzt Läden wo man NUR mit Karte zahlen kann. Also irgendwie muss man dem Kunden ja etwas reinwürgen…",
            "This!",
            "Steuerhinterziehung ist halt deutsches Kulturgut. Komm damit klar! 😌",
            "Ich liebe Bargeld. Ich meine ich will doch nicht mein Eis oder mein Döner mit Karte zahlen",
            "Ganz ehrlich, ich bin froh, dass man hier überall mit bargeld zahlen kann. Gibt Länder da kann man in vielen Geschäften nur mit karte zahlen. Da ist cash king!",
            "Bin aktuell öfter mal in Norwegen und Bargeld wird dort anscheinend nur für kriminelle Zwecke genutzt, hab beim ersten mal Bargeld abgehoben und wurd immer blöd angeschaut, hier kannste noch aufm illegalen Waldrave das Bier mit Karte bezahlen",
            "Dies!",
            "Hab in der Türkei im Dorf ein Brot gekauft für umgerechnet 25 Cent und konnte mit Apple Pay bezahlen.",
            "das kann aber nicht vielleicht daran liegen, dass 1. wir  wieder dank Sparkasse und Co. die höchsten montalichen Grundberträge und dann Pay Kosten haben und 2. wir dann wir dadurch noch mehr Bürokratie, Regeln und Kontrollen erzeugen?",
            "Das ist aber ein hausgemachtes Problem - aka die Gebühren für Kreditkarten sind höher als für Debitkarten und darum.",
            "Müsste man dann als Dönerimbiss nicht Millionen, ach was Milliarden-Umsätze machen, wenn man als Alleinstellungsmerkmal hervorhebt, dass man mit Karte, Applepay, Paypal und allem anderen möglichen zahlen kann? Ich würde den Laden \"Kreditkartendöner\" nennen und erwarten, dass da 1km lange Schlangen vor meinem Laden entstehen.",
            "Ganz genau, Bargeld ist außerdem eine Einladung, dass gegen Feierabend Diebe oder Räuber kommen.\n\nKontaktlos? Alles Safe",
            "war SumUp nicht das Terminal das keine Girocards annimmt? Ingenico4ever!\n\nEdit: wobei Weinkartonkäufer*innen eher die Leute mit Karten-Cobranding sind",
            "Tja, ihr wisst halt wie man verkauft. Bei uns hier im Osten wird über 20ct Gebühren gejammert und ein Jahr später ist der Laden zu, weil die Grünen und so",
            "Dein Dönerladen hat eine Kasse?.Der heisst wohl Mister Füncypünts",
            "Hähnchengrillanhänger vorm Kaufland:\n\nDrei halbe Hähnchen? - 1,20 €\n\nZwei Döner? - 3 €  \nZwei Pommes Majo und zwei Cola? - 2,10 €  \n \n\nTraumpreise!",
            "Ist noch viel wilder. Google mal Dönerkartell",
            "Genau das doch auch ein Grund Betrug und Geldwäsche zu bekämpfen, welche durch unsere Bargeldliebe halt begünstigt wird.",
            "WTF. Ab jetzt werde ich wohl immer auf eine Quittung bestehen.",
            "Und der Staat verdient auch noch saftige 7 oder 19% mit am Geldwäschestandort Deutschland!\n\nAlles Verbrecher!!11!\n/s",
            "Zwischen keine Kartenzahlung und Geldwäsche besteht erstmal kein Zusammenhang",
            "Ne, Bargeld oder Alipay auf den Fanmeilen :D",
            "Und Deutsche finden‘s super.",
            "War letztens bei der deutschen Post und konnte nicht mal mit Debitkarte zahlen",
            "Ist deren gutes Recht, sich vor Raub zu schützen",
            "Scheinbar hat sich ja in den 18 Jahren nix daran geändert,.",
            "Haben schon bei der EM 88 rumgeheult. Aber für uns gilt weiter „lass die andern sich verändern…ä",
            "Damals hatte man das ja noch eher verstanden, aber 18 Jahre später ist das einfach erbärmlich",
            "Content Re-use wird das glaube ich genannt",
            "Ist auf deutschen Festivals auch so, zumindest den elektronischen. \n\nCashless Armband z.B.",
            "Meine Freundin wohnt in den Niederlanden und hier das gleiche. Oft ist es eher so das garkein Bargeld genommen wird. Karte aber so ziemlich immer",
            "Lass mich raten: \"NUR EC Karten\"?",
            "Fun fact: das dürfen sie gar nicht vorschreiben",
            "Jupp. Und der Switch von EC-Karte zu Debitcard ist kein Problem. \n\nDer Staat hat eine Deadline gegeben (2021) und dann gesagt \"Wer Hilfe braucht umzustellen bekommt sie, aber ihr müsst umstellen\". Haben alle gemacht. Kein Stress.\n\nWenn ich nach D fahre, muss ich immer bangen ob meine Debitcard genommen wird. Wenn nicht, kaufe ich dort auch nicht.",
            "\"Jede Transaktion kostet uns 5€, glaubt man gar nicht!\" Original so beim Metzger gehört...",
            "Die erzieherische Maßnahme ergreife ich auch gerne. Bei 2-3 Euro und dem bezahlen mit dem 50 Euro oder 100 Euro Schein machst Du Dir richtig Freunde, besonders am frühen Morgen.\nWenn dann ein dummer Spruch kommt sage ich immer \"Ich kann gerne alternativ mit der Karte bezahlen\".",
            "Hatte ich tatsächlich bei nem bäcker in Meckpom. Bei sowas gehe ich mitlerweile mit einem \"tja dann halt nicht\" einfach aus dem Laden.",
            "Kenn ich nicht. Kenne eher: „Nur ÄhZäääähhhh“",
            "Gelsenkörken!",
            "Das was er sagt stimmt nicht. Es gibt zB auch MasterCard + Girocard Co-Badges. \n\nManche (noch nicht alle soweit ich weiß) Spaßkassen bieten das an: https://www.sparkasse-fuerth.de/de/home/privatkunden/girokonto/sparkassen-card-mastercard-debitkarte.html\n\nhttps://www.sparkasse-fuerth.de/content/myif/spk-fuerth/work/filiale/de/home/privatkunden/girokonto/sparkassen-card-mastercard-debitkarte/_jcr_content/par/section_1278868656/section/imagetextbox3/image.img.png/1691129394382.png",
            "Naja in der USA ist es doch auch so, aber da sie so rückständig waren sind dort die ganzen Zahlungsdienstleister entstanden, selbst heute noch wird dort viel mit Checks gemacht.\n\n  \nEs liegt einfach an den Menschen, das haben wir immer schon so gemacht!\n\nDas wird Deutschland noch mal den (wirtschaftlichen) Kopf kosten ...",
            "Und hoffentlich schon mal reingebissen und dann gesagt, dass Du kein Bargeld bei hast",
            "\"Wenn das genügend Leute machen wird der Wirt sich schon irgendwann ein Zahlungsterminal anschaffen.\"\n\nSchlechte Bewertungen bei Google wegen fehlender Kartenzahlung helfen besser, da werden die \"Wirte\" nervös, wenn die Onlinebewertungen purzeln.",
            "NUR EC KARTE!!!!111ELF",
            "Die waren im Restaurant essen",
            "Am Stand aufm UEFA-Fanfest, hab ich selbst erlebt. Es ist echt unglaublich.",
            "Restaurants, Kiosks, Bars, Essensstände\n\nDa geht oftmals nur Bar. Und vor allem da werden Touris und Fußballfans ihre Zeit verbringen.",
            "Beim Bierdosenverkäufer aus dem Einkaufswagen ",
            "Oder einfach beim Italiener was essen?",
            "Denke ich mir auch, klar gibt es noch bereinzelt locations wo keine karte genommen wird aber ich zahle eig nurnoch mit amex oder visa und das ging bisher im alltag auch überall",
            "Der ALDI ist halt so ziemlich der letzte Laden, in den man als Tourist reingeht. Straßenstände, Fanmeilen, Cafes und Restaurants sind absolut noch Bargeld-dominiert. Ist ja schon scheiße, wenn einer von zehn Läden, in die man so geht, die Karte nicht nimmt, und die Quote wird hier locker überschritten.",
            "Deswegen heißt es doch auch Bar.",
            "Das Etablissement heißt doch nicht umsonst Bar.",
            "Wie läuft das ab? Wird vom deutschen Konto abgebucht? Außerhalb des SEPA Raumes kann das ja teuer werden.",
            "Es soll e ja auch keiner dass Bargeld nicht mehr angenommen wird. Klassischer Strohmann.",
            "Da gehts's um Dokumentenechtheit. Bei der Faxübertragung wird die Schriftform dadurch gewahrt das sofort ein Ausdruck erfolgt. Bis hierhin sind sich alle einig und dann geht es schon damit los, das der digitale Faxempfang, also ohne Ausdruck mal so, mal so gesehen wird und man Gefahr läuft die Frist zu verpassen weil die Schriftform nicht gewahrt ist.\n\n  \nDeshalb haben auch alle Behörden noch Fax.",
            "Mein Frisör hat wenigstens einen Special Price für Barzahlung.",
            "\"Das Internet ist eine Spielerei für Computerfreaks, wir sehen darin keine Zukunft.“ – Telekom-Chef, Ron Sommer",
            "Wie hast du den Registrierungsbutton für Reddit gefunden?",
            "Ich akzeptiere nur Goldmünzen und Goldbarren. In Ausnahmefällen auch Silber. Diese komischen bunten Papierscheine und die Blechmünzen sind mir suspekt! Dieser Firlefanz wird sich langfristig eh nicht durchsetzen!",
            "Bei meinem letzten Ausflug nach London hatte ich nur meine Visa dabei. Das war’s. Kein einziges Stück Bargeld, keine EC-Karte, nix. Ich habe mir damit völlig problemlos im Park an einem Fahrrad-Eisstand ein Eis kaufen können. Es gab nicht eine Situation, wo ich dachte jetzt evtl doch mal Bargeld zu benötigen.",
            "Ich kann in der UK mit meiner Euro-Kreditkarte von VISA oder MasterCard sehr gut bezahlen. Verstehe nicht, was du Bargeldler meinst ;)",
            "Als wir in London waren wollte nur der nette wohnungslose Ire Bargeld von uns (hatten wir gar nicht).\n\nBei ausnahmslos allen anderen – Supermarkt, Museumsshop, Eisstand, Restaurant, ÖPNV, Straßenmusiker – konnte man problemlos mit Debit- oder Kreditkarte bezahlen. Wir hatten null Bargeld dabei und das war erst wieder nervig als wir wieder in Deutschland waren und uns beim Zwischenhalt was kaufen wollten.",
            "Ich musste letztens (Differenz zwischen Leergutbon und Einkaufswert) 3 Cent mit Karte zahlen. Ich habe halt einfach NIE Bargeld dabei, dadurch auch kein Kleingeld, welches ja nur entsteht, wenn man vorher schon was mit Bargeld gezahlt hat.",
            "Dafür muss der Kunde Gebühr bezahlen zum abheben. Und das Verwalten und Verteilen von Bargeld kostet den Banken einen Haufen Geld...\n\nUnd für den Händler ist Bargeld zwar ohne VISA/MasterCard/Amex Gebühr, aber dafür hat er andere versteckte Kosten:\n\n- Raubgefahr\n- Fehler beim Kassieren\n- Falschgeld (das einem KEINER erstattet)\n- Verwaltungskosten\n- Geldtransport an und von der Bank \n\n\nCash is trash! No safety, high costs!",
            "Jau Cash ist so freedom, dass ich mit meiner Karte zu einem Automaten muss um Geld zu bekommen um dann im Laden zu zahlen, bei dem ich den selben Vorgang auch ohne Zwischenhändler (Automaten) hätte haben können.\n\nCash ist so freedom, dass ich immer nur den bei mir tragenden Wert einkaufen kann. Brauche ich spontan mehr, muss ich wieder einen Automaten suchen.\n\nEs mag sein, dass es heutzutage einfacher geworden ist Bargeld abzuheben, da manche Banken es so eingerichtet haben, dass man überall abheben kann, ohne Gebühr, aber es gibt leider immer noch mehr Banken, wo ich dann nur an bestimmte Automaten abheben kann, weil sie sonst eine Gebühr verlangen. Diese Art von freedom erspare ich mir gerne.",
            "[deleted]",
            "Und du meinst die Boomer wissen dass es Google Bewertungen über ihr Lokal gibt? Das gehört verboten, genau wie Street View!",
            "Wohnst du zufälligerweise auch in Süddeutschland? Ich wohne im letzten Dorf am arsch der Welt und ich brauche fast nie Bargeld. Nur bei zwei Bauern die einen Dorfladen haben, und bei den Buden am Weihnachtsmarkt. Ansonsten geht immer mindestens die EC Karte.",
            "ist es doch auch. Ich zahle fast nur noch mit meiner Uhr und brauche im Monat vielleicht 1-2 mal tatsächlich Bargeld",
            "Selbst schuld, wenn du ihn dabei unterstützt.",
            "In diesem Land sind Zustände als wären wir die letzten 20 Jahre von der AFD regiert worden! 🤬🤬🤬\n\nSind wir aber nicht.",
            "Wenn ich mich nicht irre, dann ist das nicht zulässig.\n\nhttps://europa.eu/youreurope/business/finance-funding/making-receiving-payments/electronic-cash-payments/indexamp_de.htm",
            "Es ist nichtmal nur in Bar. EC Karten werden praktisch überall genommen. Kreditkarten halt ab und an nicht.\n\nDas ist aber in England auch nicht anders. Da nimmt der Straßenimbiss genau so wenig die Amex.",
            "Bezieht sich diese Aussage auf die Stadien?\n\nHabe im Kopf, dass es um Gelsenkirchen ging und um das Bezahlen generell. Soll ja auch noch eine Welt außerhalb deiner 3 Stadien geben.",
            "Wie machst du es auf dem Amt? Unseres akzeptiert keine Kreditkarten.",
            "Inwiefern treibt das Finanzamt die Selbstständigen in den Ruin?",
            "Die Leute geben dir kein Trinkgeld, wenn sie mit Karte zahlen?",
            "Darum geht es doch gar nicht.",
            "Und findest du das persönlich?\n\nZahlst du dann bar und denkst dir, „ist schon OK so“?",
            "Erstmal bewegen sich die Unterschiede zwischen Kredikarten und Girokarten Zahlungen im einstelligen Cent Bereich. Und zweitens bieten immer weniger Banken Girokarten an, mittlerweile läuft fast alles über Debit wenn nicht sogar nur noch per Wallet. \n\nDie deutschen sind einfach ein schrecklich verbohrtes Volk.",
            "Joa früher halt. Und wenn du keine Touris empfangen willst. Oder Leute, die nur noch eine Kreditkarte und Apple/Google pay haben.",
            "Japan ist was das geht auch wild. Einerseits ist fast alles bar anderseits haben die Pasmo Karten die einfach endgeil sind",
            "Nicht mal Debit. Hier gibt es Läden, die - wenn überhaupt Karte (ab 50 €) - ausschließlich eine EC Karte nehmen. Keine Visa Debit, obwohl auch fett \"Debitkarte\" an der Tür steht",
            "Zu welchen Ketten? 🤔",
            "Das selbe wie AmazonPay jedoch von Alibaba.",
            "Eine Girocard ist auch eine Debitkarte",
            "Leider habe ich da schon oft andere Erfahrungen gemacht. Ich komme aus Luxemburg, bei uns gibt es bei den meisten Banken nur noch die Auswahl zwischen Visa Kredit und Visa Debit. Eine Visa Debit ist auch einfach nur eine Debitkarte und soweit ich informiert bin sogar gleichzusetzen mit V-Pay. Trotzdem wurde mir in Deutschland schon öfter die Zahlung mit dieser verwährt, da \"nur EC-Karte\" akzeptiert und keine Visa genommen wird. Cool, hab ich nicht. Da kannst du noch so lange diskutieren wie du willst und erklären, dass es keine Kreditkarte sondern eine Debitkarte ist, bin da noch nie gegen angekommen.",
            "Kommt halt darauf an wo du einkaufst. Ich Supermarkt ist klar, die nehmen alle Karte, aber wir kaufen gerne auf dem Markt oder im Hofladen, da ist Karte Fehlanzeige. Ansonsten ist es halt so 50/50 , der eine Dönermann bei uns im Dorf nimmt Karte, der andere nicht. Der Grieche bei uns nimmt auch keine Karte, obwohl das schon ein durchaus gehobeneres Restaurant ist, wo man gerne mal 40€+ pro Person auf der Quittung hat. \n\nInternet stimme ich dir aber zu, ich wohne in der niedersächsischen Pampa, in einem Dorf, das nun wirklich nicht der Nabel der Welt ist. Aber 5G haben wir hier trotzdem, auch im Wald, und wenn man das mal nicht hat dann wenigstens immer 4G+. Wir haben hier auch seit ein paar Jahren Glasfaser. Bin neulich mit dem ICE von Berlin gen Heimat gefahren, da war auch immer guter Empfang auf der Strecke. Aber das ist natürlich nur meine Erfahrung.",
            "Bargeldhandling ist auch nicht umsonst.\n\nBargeld zählen kostet Arbeitszeit und damit Geld, Bargeld zur Bank bringen kostet Sprit, Bargeld einzahlen kostet Geld (bei Geschäftskonten), Wechselgeldrollen kosten Geld, hin und wieder Falschherausgabe durch Mitarbeiter kostet Geld.",
            "Und das machen die in Deutschland stärker als woanders? Warum ist das so?",
            "Es geht doch gar nicht um die Abschaffung des Bargeldes.\n\nDie Leute möchten einfach nur die Wahl haben, welches Zahlungsmittel sie verwenden.",
            "Ich war letztens in UK und habe  meine 50£ aus dem ATM wieder nach Deutschland gebracht. War vollkommen unnötig.",
            "Komisch nur das fast im kompletten europäischen Ausland die Händler das stemmen können.",
            "Hinterziehung von Steuern und anderer Abgaben kostet uns wesentlich mehr…",
            "Aber mal im Ernst. Wie individuell Freiheit doch sein kann. Ich fühle mich in meiner Freiheit eingeschränkt, wenn ich nicht mit meiner Karte zahlen kann… Aber das juckt solche dann ja wieder nicht",
            "Bei der was-Arena? Kommerz!!",
            "Klar, Selbstständige müssen Steuern nur abführen wegen des „Finanzamts“.\n\nUnd dann? Was passiert dann mit dem Geld? Straßen und Schulen baut der liebe Gott?",
            "Kann ich nur bestätigen! 💪\n\nUnsere Minderheit hier im Forum gehört geschützt 😅",
            "Nein, er soll die Wahl haben, wie er bezahlt.\n\nWenn deine Karte Fremdwährungsgebühren erhebt, dann bist du selbst schuld. Dann zahl halt die Gebühren beim Exchange vor Ort.\n\nHab selbst noch diverses ausländisches Geld in der Schublade und hab da keinen Bock mehr drauf.",
            "Aber es wäre doch kein Problem die Kosten auf den eigentlichen Betrag draufzurechnen. Das wären doch eh nur cent Beträge. Verstehe niemanden, der sagt, das ist uns zu teuer. Oder sehe ich irgendetwas nicht?",
            "Bargeld zu handhaben kostet auch den Händler Geld.",
            "War vor 2 Wochen auf Gran Canaria, der Strandliegen-Johnny nimmt NUR Karte, kein Bargeld.",
            "Du kannst in Nigeria bei Straßenhändlern elektronisch bezahlen und dir sogar quasi wie bei einem lebenden Geldautomaten Geld auszahlen lassen. Die Rückständigkeit in Deutschland in dem Bereich ist einfach nur noch peinlich.",
            "Hab in Frankreich an nem Bootsverleih bezahlt. Der hatte das Kartengerät in ner wasserdichten Box. \nWeiß gar nicht, ob Barzahlung überhaupt gegangen wäre. \n\nDieser ewiggestrige Umgang mit Kreditkarten nervt wirklich enorm",
            "In Urlaubsgebieten ist die Kreditkarten-Akzeptanz aber sowas wie Pflicht da Tourismus. Generell in Ausland ist die Kreditkarten Akzeptanz viel fortgeschrittener als in Deutschland. Naja die Geschäfte haben wohl verschlafen dass die EM hier in Deutschland stattfindet und man eine Kreditkarten Akzeptanz einführen sollte.",
            "Habe dem letzt in Bayern an einer Tankstelle mit Payback Pay zahlen müssen, weil ich meinen Geldbeutel vergessen hatte und Google Pay nicht funktioniert hat.\n\nHinter mir stand eine Frau im Boomer alter, die sich lautstark darüber beschwert hat und meinte \"sO eIn MiSt gEhOeRt VeRbOtEn!¡11¡!\".\n\nFun Fact: Sie hat danach 5min Kleingeld zusammen gesucht um auf den Cent genau passend zu zahlen.\nHat nur noch gefehlt, dass sie jemanden gefragt hätte 5ct klein zu machen.",
            "Hab mir in Schweden einen Donut an einem Straßenstand gekauft und mit Kreditkarte bezahlt.",
            "Und hier kannst du dir nicht mal n Döner oder was beim Kiosk holen ohne Bargeld dabei zu haben. In meinem Dörfchen haben sie die Geldautomaten weggesprengt, ich bin komplett aufgeschmissen :(",
            "Ich hab in den USA Obdachlosen per Kreditkarte gespendet",
            "hab ich ganz andere erfahrung gemacht. von taxi bis restaurant.. immer nur bargeld. Außer in Supermärkten konnte man gefühlt nie mit Karte zahlen",
            "Eines meiner lustigsten Erlebnisse im Kroatien-Urlaub war ein Restaurant, in das es uns per Zufall verschlagen hat. Das hatte eigenen Wein, der sehr lecker war und auch verkauft wurde, zu einem sehr günstigen Preis. Allerdings nahm das Restaurant keine Kartenzahlung, nur Bargeld.\n\nStellte sich raus: das Restaurant wurde von einem deutschen Auswanderer betrieben. Es hätte an dem Tag eigentlich offiziell gar nicht offen, und war nur offen, weil eine Gruppe sich angekündigt hatte. Normalerweise nehmen sie Kartenzahlung, nur halt heute nicht, weil die Erträge am offiziell geschlossenen Tag nicht so richtig offiziell in die Kasse wandern. Oh, und der selbst hergestellte Wein war wohl auch eher inoffiziell und wurde in Plastik- Mineralwasser-Flaschen verkauft.\n\nEin Schelm...",
            "Ich hätte auch kein Bock abends mit einem ganzen Bündel Bargeld nach Hause zu laufen.",
            "Ging mir in Dänemark auch so. 2 Wochen Urlaub, kein einziges Mal Bargeld in der Hand gehabt. Der einzige Kontakt war der Fund einer 2-Kronenmünze durch meinen Sohn am Strand. Die hatte bestimmt ein deutscher Touri verloren.\n\nLetzteres finde ich allerdings gerade für Kinder den einzigen etwas negativen Punkt an der bargeldlosen Zahlung: Das fremde Geld verliert so etwas den exotischen Charme des Urlaubs.",
            "Was sind das für Transaktion das du da Cash brauchst?    \nBesteht 50% deines Zahlungsverkehrs aus Imbissbuden und Toilettenbesuchen?",
            "Gerade zwei Wochen USA hinter mir: habe keine Dollarscheine gebraucht.",
            "Ich bezahle momentan wieder *alles* hier in Cornwall, also quasi auf dem Land, mit Visa oder Amex",
            "Ich war eine Woche in Sydney, Australien, und habe nicht einmal Geld anfassen müssen. Vor ein paar Jahren war ich in New York, und wollte ein paar alte Dollar Scheine in der Apotheke loswerden. Der guckt mich verwirrt an und das Kommentar war, 'das ist jetzt schon einige Wochen her dass jemand mit Bargeld bezahlt halt'",
            "Das ist bei mir auch der Standard in Berlin. Ich nehme bei kleinen Wegen meist nur mein Telefon mit. Damit kommt man mittlerweile bezahltechnisch ganz gut durch. Man darf nur nicht aus Berlin herausfahren, dann erheitern dich allerorts die kleinen Pappschilder: „Keine EC-Zahlung“. Von Visa wollen wir gar nicht reden.",
            "Letztes Jahr auch in Manchester und bin komplett bargeldlos durch gekommen.",
            "Ich war neulich auf nem Flohmarkt und jeder zweite Stand hatte ein Paypal-Schild. Die Verkäufer:innen waren überwiegend Leute unter 30, mag vielleicht daran gelegen haben.",
            "EC gibts doch schon seit fast 20 Jahren nicht mehr",
            "Dito, im Alltag bezahle ich eigentlich alles per Karte oder Handy und ich wohne eher ländlich in nem 3000 Seelen Dorf.",
            "Selbst die Dönerbude neben der Arbeit nimmt Karte, und ein Café nimmt heutzutage _nur_ Karte. In Dresden Brauch ich Bargeld eigentlich nur beim Friseur.",
            "Im Jahrhundert der Schwarzarbeit",
            "Ich wohne in einer mehr als zehn Mal so großen Stadt. Jeder Dönerladen geht (entgegen dem klischee btw.)mit Google pay, debit visa der ing oder was auch immer du möchtest. Nur ein paar ganz wenige seit hundert Jahren bestehende metzger oder kleinere Bäckerei-ketten nehmen bei karte ausschließlich giro und auf so Dinge wie irgendwelche kirmes-ähnlichen Veranstaltungen muss man besser Bargeld mitnehmen.",
            "Ich war neulich mal wieder in Berlin und war an einem Tag gleich in mehreren Läden, die keine Karten genommen haben, darunter ein kleiner Supermarkt und ein Copy Shop. Dafür nahm der Hipster Eisladen dann ausschließlich Karte.",
            "Aluhut aus dem Silberstreifen bastelt? Kann teuer werden...",
            "Seit Corona halte ich das eher für unwahrscheinlich. Welche Poststelle ist das?",
            "No joke: in Bielefeld steigt man ab 2025 um. \nBarverkauf beim Fahrer wird abgeschafft. \nDafür gibts schlanke Automaten in den Bussen. Die bargeldlos sind. Man soll per giro-, Debit-, Credit- und Prepaid-Karte zahlen können. \nDie Aufschreie der „Bargeldfverfechter“ sind episch. \n\nMir als Fahrerin gefällt das. Die Kasse ist schwer, der Ticketverkauf kostet Zeit. \n\nBis wir ein System wie in London haben, werd ich in Rente sein. Oder tot.",
            "Der Herr ist ganz schön dekadent und gönnt sich den Eisdielen Besuch.",
            "Bei uns akzeptieren weder Eisläden noch Dönerläden Kartenzahlung. Ich wohne 20 Minuten außerhalb von Frankfurt.",
            "Ich bin seit der „Bargeldwende“ durch Corona 2020 quasi 95% bargeldlos, da man jedes Brötchen oder sonstigen Kleinkram mit Karte zahlen kann. Ausnahmen sind oft Döner / Eis / Kiosk. Habe eigentlich manchmal nur 10 Not-Euro dabei.",
            "In Nürnberg brauchst du nur ne App. Einchecken beim Einsteigen, auschecken beim Aussteigen.",
            "Deutschland hat im EU-Vergleich mit die niedrigste Umsatzsteuer und die Einkommensteuer ist ähnlich wie in anderen (West-) Europäischen Staaten. \n\nWas genau meinst du also? Auch wird in fast allen anderen Ländern viel mehr kontrolliert.",
            "Genau das ist auch der Grund warum viele kleine Restaurants/Eisdielen/Imbiss erst ab Betrag X eine Kartenzahlung anbieten. Dieses „die Gebühren sind so hoch“ können die sich sonst wohin schieben langsam. 5 Euro sind schnell mal am Fiskus vorbei geschleust. Niemand kann Nachweisen ob du 120 oder 100 Kugeln Eis am Tag verkauft hast wenn man Bar zahlen muss. Wenn jeder mit Karte zahlt dann hat man immer einen Nachweis.",
            "Naja, so krass ist die bei kleineren Läden auch nicht, klar irgendwann kommt die Gewerbesteuer dazu, aber das kann man künstlich gut klein rechnen. Und Umsatzsteuer ist Deutschland auch nur im europäischen Mittelfeld.",
            "So sind wir Deutschen eben. Ganz oder gar nicht. Keine halben Sachen.",
            "Gab hier letztens einen Beitrag der die Kosten für ein Restaurant aufgeschlüsselt hat. Ist so unfassbar gering, einfach vernachlässigbar.\nDas einzige contra-Argument ist, dass man dann keine Geldwäsche mehr betreiben kann..",
            "Und die Kreditkartenkonzerne ziehen nur die Deutschen über den Tisch? Überall anders sind die Gebühren niedriger? Glaube ich dir nicht.",
            "Lüge.",
            "Wenn denn wenigstens Debitkarten gehen würden, aber teilweise kann man ausschließlich bar zahlen.",
            "Bei meinem Stammdöner ist eigentlich auch immer nur Barzahlung, aber da er bei Lieferando ist bestelle ich einfach zum abholen. Zack, Kartenzahlung",
            "Ich zahle seit 6 Jahren mit Karte beim Dönnerladen meines vertrauens mit Karte bzw. NFC mit smartphone. Er hat auch Sum Up. Bester Dönner und bester service. Und dass mitten im Studentenviertel.",
            "Dönerläden sind doch meist eh nur Geldwäsche. Glaubst du, dass der Dönerladen, in dem bei einem von 20 Besuchen, jemand im Laden ist, machen groß Gewinn? Das Bargeld ist hier doch der Schlüssel. Da sollte sich niemand wundern, dass es in Dönerläden so gut wie nie Kartenzahlung gibt, vor allem in den kleinen an den Ecken der Innenstadt.",
            "Scheint den Vorteil des “Keine Steuern zahlens“ nicht aufzuwiegen, sonst würden das alle so machen.",
            "Wenn Leute Zukunft sagen denke ich an Drive-through Dönerläden mit ApplePay. Die Menge an Dönern die ich kaufen würde…",
            "Ich hab letztens in Hamburg ein Dönerladen gesehen, der mit riesen Leuchtreklame Schild beworben hat, dass er Karte nimmt. So special ist das anscheinend..",
            "Ich müsste jetzt echt überlegen welcher Döner hier bei mir keine Karte nimmt. Wäre für mich auf jeden Fall ein Grund nicht mehr hinzugehen finde Bargeld schon nervig, vor Allem Münzgeld.",
            "bei meinem lieblingsdöner kann man ab 10€ auch mit Visa und MasterCard zahlen, ist auch sehr gut besucht der Laden",
            "Das Haus des Kreditkartendöners!",
            "Mein Dönermann des Vertrauens hat Kartenzahlung. Der davor (anderer Stadteil) hatte es auch!",
            "Ich geh oft nicht zum Döner weil ich vorher noch Geld von der Bank holen müsste. Ich würde zb auch eher Getränke mitnehmen wenn ich mit Karte zahlen könnte.",
            "Aras Döner in Ansbach ist mein Stammdöner und nimmt seit ungefähr einem Jahr alle Karten auch kontaktlos ohne Mindestbetrag. Ich glaube ich habe mich einfach oft genug passiv-aggressiv darüber beschwert, dass ich extra nochmal zum Geldautomaten musste, nur für einen Döner. :D",
            "Es wird so häufig von Dönerläden geschrieben die nur Bargeld nehmen, ich hab noch nie einen gesehen. Jeder Dönerladen (und hier gibt es am jeder ecke drei) nimmt giro, Google pay, visa debit.\n\nNur ein paar hundert Jahre in Familien betrieb Deutsche metzger nehmen wenn überhaupt karte nur giro.\n\nIn welcher region ist das denn so schlimm mit nur Bargeld bei dönerläden?",
            "Solche Preise existieren oder ist das wirklich aus deinen Träumen?",
            "frech",
            "Reitschuster scheint die einzige \"Quelle\" die ich finde?",
            "Da will ich nicht so ein Allman sein. Aber ich gebe halt kein Teinkgeld mehr. Nicht mal dem Fahrer.\n\nEiner war mal unsicher und hat mich gefragt ob ich bei ner Behörde arbeite weil ich immer so kritisch auf die Kasse schaue.\n\nIch finde diesen Bestandsschutz bei Kassensystemen so dumm. \n\nSind halt alles noch „Analoge“ und müssen nicht sofort auf Elektronisch angehoben werden.\n\nhttps://www.dish.co/DE/de/blog/kassenpflicht-in-der-gastronomie/#Inhalt2\n\nAlso eine Digitale Kasse hat halt eine direkte Schnittstelle zum Finanzamt. Sobald man Kartenzahlung anbietet als Gastro braucht man das. D.h gibt es keine Kartenzahlung weil sie sonst Digitale Kassen bräuchten. In der Gastro ist es aber nicht verpflichtend. Jede gute Gaststätte bietet eigentlich Kartenzahlung an, aber so „Imbiss“ Buden haben sowas nicht so.\n\nGerne aber einen Zettel „Wir nehmen nur Barzahlung“\n\nGibt aber inzwischen einen „Hack“ das man über Mobile Daten und Paypal so ein Terminal mit dem Handy verknüpfen kann. Da müssten sie dann dennoch einen Beleg liefern, also an die Email deines Paypal Kontos. Weshalb sie da auch die richtigen Mengen und Preise erfassen müssen.\n\nDeshalb neben die Imbissbuden gerne Lieferando, weils da noch unangenehmer mit dem Aufpreis ist. \n\nLieferando, bei allen Dönerläden, kostet alles Pauschal 1€ mehr.",
            "So naiv…",
            "Nichts ist leichter als Geldwäsche mit Bargeld im Restaurantgewerbe. Da werden schon mal 100 Pizzen gekauft, obwohl nur 12 Leute da waren. Auch den \"Mafiawein\", sau Teurer Wein der nie getrunken wird, aber trotzdem viel \"geordert\" wird. Auch werden überteuerte Vorprodukte wie Mehl, Wein, oder Gemüse direkt von Mafiamitgliedern gekauft, um die Steuer und die Fahnder zu blenden.",
            "Ernsthaft? Dieses idiotische Sponsoren-Alipay, das in Europa niemand hat, hat da ein Monopol?",
            "Mein Bruder hat auf der Fanmeile mit seiner Visa gezahlt\n\nEdit: war in Düsseldorf",
            "Quelle?",
            "Ich wünschte, ich könnte mich als normaler Arbeitnehmer auch davor schützen 🙃",
            "Falls ich ein Räuber wäre würden doch ein paar tausend Euro Bargeld eine deutlich attraktivere Beute sein als ein Kartenterminal, das vielleicht bei einem Hehler noch einen zweistelligen Betrag bringt?",
            "Einfach traurig.",
            "Danke merkel…",
            "Ach was? Deutschland hat stillstand seit Jahrzehnten? Ganz was neues.",
            "Ne, Metal hauptsächlich. Stoffarmband aber halt Karte und kontaktlos is überall standard.",
            "Ja auch, aber erst kam „keine Kreditkarten“",
            "Keine Sorge, wir deutschen bangen auch immer wieder ob unsere Karten genommen werden.",
            "Manchen Geschäftsleuten ist nicht zu helfen \\^\\^\n\nhttps://preview.redd.it/6tck2ztsky7d1.png?width=1245&format=png&auto=webp&s=7a8b5dc9cc128d630b63cce103babcab252d80ff",
            "Ja okay, aber dann muss man halt Sparkassenkunde sein und wer will das schon? ",
            "Leider ging das an der Kasse schlecht, mir wurde dann angeboten das sofort essen und danach Geld zu holen um es dann zu bezahlen :D",
            "Die im Restaurant optimieren halt ihre Sparquote indem sie die Gebühren vermeiden.",
            "Weird in den meisten Großstädten wen du nicht zu Steuerhinterziehungs Bob ins Restaurant gehst kann man auch mit Karte zahlen.",
            "Naja das ist ja dann wieder UEFA und nicht Deutschland...\n\nUEFA ist eh ein sehr besonderer Verein",
            "Der nimmt die deutsche Debitkarte gern, aber nur samt Pin. Und zurück bekommst du die dann auch nicht",
            "Au contraire! Bar kommt von französischen *barre* und hat den historischen Ursprung in der Beschränkung/Schränke, die Gast und Wirt voneinander getrennt haben.",
            "Praktisch die Bar-Bar oder \"Bargeld Bar\".",
            "[removed]",
            "Was für Strohmann?",
            "Ich war jetzt letzten Winter in London und, man, war ich begeistert.\nWie du sagtest, überall kann man einfach mit Visa zahlen.\nDas hat so Spaß gemacht.\n\nKaum war ich hier, musste ich bei nächster Gelegenheit wieder zum Automaten und Geld abheben... so nervig, aber naja.",
            "Eine Bewertung löschen zu lassen kostet knapp 5€. Jedes Mal wenn eine Bewertung von mir gelöscht wird, erstelle ich eine neue. Können gerne nochmal Geld in die Hand nehmen um diese zu löschen.",
            "Na klar, gibt genügend die das kennen. Denen ist das bargeldlose Zahlen aber noch nicht so wichtig wie den Jüngeren",
            "2 mal zu viel…",
            "Es bringt einem nicht viel, wenn man sich nicht darauf verlassen kann. In Deutschland muss ich \"für den Fall\" immer Bargeld mitnehmen. Ich wohne seit Jahren in der Schweiz, ich weiß ehrlich gesagt nicht mal wie genau die bunten Monopoly-Scheine hier aussehen.",
            "Wo kein Kläger, da kein Richter.",
            "Ja, aber die „EC-Karte“ (welche schon seit 2007 nicht mehr so heißt) ist halt ein deutsches Ding und alle aktuellen Besucher haben nun mal keine.\n\nDeutschland blamiert sich gerade so hart und es geschieht ihnen einfach nur recht.",
            "Meine Werkstatt gibt mir bspw eine Rechnung mit weil dort Visa Pay mal funktioniert, mal nicht. Und unser Amt akzeptiert dieses Visa Pay. Sollte ich adhoc bezahlen müssen und meine Karte beim Amt nicht akzeptiert werden, wüsste ich ehrlich gesagt nicht wie ich darauf reagieren würde. Ich verweigere Bargeld zwar so weit wie es geht, aber dem müsste ich mich wohl beugen. Jedoch nicht ohne eine formelle Beschwerde einzureichen, in der Hoffnung es zu ändern.",
            "Das ist leider nicht ganz richtig, die Gebühren für eine Kreditkarte sind +250% Aufschlag gegenüber Debit Karte",
            "Supermarktketten. Bäckereiketten. Getränkeketten. Meistens bestelle ich es auch nur noch online, weil ich das Theater vermeiden will was mir evtl. bevorstünde.",
            "EC-Karte (Girocard) ist ein deutsches System, da hast du mit ausländischen Debitkarten keine Chance. V-Pay ist nur dafür da, dass Deutsche mit der EC-Karte im Ausland bezahlen können, da wird dann quasi eine Visa simuliert. Visa Debit ist eine ganz normale Visa Debitkarte.",
            "Absolut. Und trotzdem darf ich mich über die hohen Gebühren der Payment Anbieter beschweren.",
            "Naja, wenn man den Preis um 2% erhöht könnte man die 2% ja auch direkt behalten wenn alles bar ist 🤑🤑🤑",
            "Kann passieren das du an den Zahlungsanbieter bis zu 100$ bezahlen muss wenn jemand die Kartenzahlung wiederruft, egal ob der Widerruf genehmigt wird oder nicht",
            "So ist das in griechenland. Mit karte gezahlt und hoeflich darauf hingewiesen worden dass wir noch zusaetzlich eine kleine fee bezahlen muessen (waren paar cent). Hab gedacht warum koennen die das nicht in Deutschland so machen.",
            "Darfst du nicht, da steigt dir der Zahlungsanbieter aufs Dach.",
            "Auf Kreta auch. Die haben nicht mal die normalen Karten-Terminals, sondern irgendwelche Apps auf dem Handy, und man muss nur die Karte auf dem Handy drauflegen.",
            "In Schottland haben wir die Straßenmusiker per Applepay bezahlt",
            "Gilt auch für Griechenland. Schöne Grüße aus Kreta bin zurzeit hier",
            "Da war ich kürzlich auch. An irgendeinem kleinen Transporter, der Waren verkauft hat, im Nirgendwo an einer wenig befahrenen Straße hat da zwei Kartenlesegeräte rumliegen",
            "Das ist doch so umgekehrt auch seltsam?!",
            "Das find ich tatsächlich genau so schlimm wie nur bargeld",
            "Du kannst in Doha am türkischen gegrillten Maiskolbenstand mit Karte zahlen…",
            "Unsere Stromrechnung haben wir in Afrika mit dem Smartphone beglichen...",
            "Hm, also ob ich die \"druckfrischen\" Scheine von ihm annehmen würde, weiß ich allerdings nicht. 😅",
            "Das Beste was ich hatte war: vor knapp 20 Jahren in einer Stadt nahe den FJS Flughafen gewohnt. \n\nDauerpark-Karte für das örtliche Parkhaus gab es nur monatlich oder ein Jahr im Voraus. \n\nMonatlich gab es nur Barzahlung. \n\nBetreiber: die Stadtwerke. \n\nDa wo man bar bezahlt hat, stand ein Kartenleser, der war aber nur für Stromrechnungen. \n\nFinde Bargeld nicht schlecht, aber manchmal ist elektronisch zahlen schon praktisch.",
            "sogar die Räuber in Afrika nehmen inzwischen Kreditkarte. Hatte neulich in Somalia eine sehr angenehme Erfahrung",
            "Endlich (seit 01.01.2024) kann man ab 0,01€ Einkaufswert (passt also mit Pfandcupons auf) Geld bei Rewe abheben. Nicht wie früher ab 10€. War sehr nervig.",
            "Naja, das ist nicht rückständig, sondern Freiheit. Karten können einfach gesperrt werden, aber bargeld kann nicht wertlos werden",
            "Der Straßenhändler in Nigeria muss auf seine elektronischen Zahlungseingänge keine Steuern bezahlen. Der deutsche Döner eben schon. \nUnd DAS ist der Unterschied. Nicht die Liebe zum Bargeld.",
            "Die Kreditkarte stammt aus dem 19. Jahrhundert.",
            "Das haben wir immer schon so gemacht!\n\nWenn die was von uns wollen, dann zu unseren Bedienungen!",
            "Habe auch schon die seltsamsten Blicke bekommen, weil ich beim Discounter mein Frühstück für die Arbeit - unter 3€ - mit Karte bezahlt habe. Junge, die bieten es an ... nix Mindesteinkauf von 10 oder 20 € ! The future is now, old lady !",
            "Und die weiß wahrscheinlich noch nichtmal, dass man mittlerweile an vielen Ladesäulen bezahlen kann, ohne den Kassenbereich betreten zu müssen",
            "Funfact: die fünf Minuten hast du wahrscheinlich mit der Sonnenuhr um 23:30 gestoppt 👀",
            "In Schweden wird selbst auf Flohmärkten mit Karte/ Smartphone bezahlt. Da gibt es praktisch kein Bargeld mehr.",
            "Kiosk lecker Bierchen, Imbiss, Toiletten, ca 20% der Restaurants haben \"heute leider keine Kartenzahlung\", SB autowäsche, die Billardhalle um die Ecke, viele der kleineren Kneipen etc etc",
            "Den gleichen Gedankengang hatte ich auch. Zwingend Bargeld brauche ich hier in Deutschland im Alltag nur, wenn ich mir für 1€ Pfand den Einkaufswagen hole.",
            "Häh? In den USA? Also genau da habe ich aber andere Erfahrungen gemacht, wenn du ins Hinterland kommst. Und btw. gerade in den USA ist der elektronische Diebstahl deiner Kreditkarte gerade ein übelstes Problem. Selbst den den Tankstellen steht jetzt ganz oft, dass das Terminal durch Firma xyz.überwacht wird, dass es nicht manipuliert ist.",
            "Jemand hat mich neulich in der Fußgängerzone um ein paar Euro gebeten und ich hab ihm was via PayPal zukommen lassen.",
            "Das ist auch alles viel einfacher geworden…war schon länger nicht mehr auf einem, hier wollen die wohl mittlerweile eintritt von Besuchern haben…auf öffentlichem Gelände.",
            "Glaubst du, die lassen sich auf solche Diskussionen ein? …dafür ist deren fachlicher Teil wenigstens top.",
            "Und Geldwäsche nicht vergessen.\nIn Berlin Mitte nehmen gefühlt die wenigsten Bars Kartenzahlung. Wenn, dann ungern. Oder es heißt: \"Karte hamm wa, aber is grad kaputt 😉\"",
            "Nicht falsch verstehen. Ich meine das sarkastisch. Du musst dir nur auf X oder Instagram einen Post suchen, der sich darüber beschwert, dass man in Deutschland nur bar bezahlen kann und in den Kommentaren scharen sich die Leute, die die Abschaffung von Bargeld fürchten und somit natürlich den Untergang Deutschlands.",
            "Ist mir nach Corona bei einer Postfiliale (so einer echten von der Post, nix DHL Agentur) passiert. Bei den Zeitungsläden mit DHL Schalter ist das auch so, da deren Kasse das Postsystem ist.\n\nBerlin",
            "In Wien ist das ganze System ja ohne „honesty based“ und viele haben Jahreskarte für €365. \n\nAber statt kontaktlos im Bus gibt es einfach gar keine Tickets mehr im Bus. Entweder halt App oder man hat eine Streifenkarte oder Dauerkarte. Kein Verkauf mehr beim Fahrer.",
            "Ne App haben die hier auch und Google/Apple Pay wird auch unterstützt.",
            "Umsatzsteuer ist doch nur ein Teil der Steuern.\nAuf deinen Gewinn zahlst du je nach Unternehmensform Körperschaftsteuer, Gewerbesteuer, Einkommensteuer, ggf noch GKV. Umsatz der nicht in den Büchern auftaucht verringert den Gewinn ;)",
            "Und zack zahlt der Dönerladen 30% für nichts.",
            "Hier (Stadt Nähe Köln, nicht im Zentrum, sondern äußerer Stadtteil) sind innerhalb von 10 Minuten Fußweg 6 Dönerläden und in 4 davon sind von Mittags bis spät Abends (3 davon haben immer bis 2 Uhr geöffnet) immer um die 10 Leute drin und es stehen eig immer 2-3 Leute die vor einem dran sind, wenn man hinkommt. Ich denke das ist regional sehr unterschiedlich, wenn ich das mit meiner Heimat vergleiche, wo Dönerläden gar keine richtigen Sitzgelegenheiten haben, sondern eig nur aus einem Wagen oder aus dem Fenster verkaufen und auch eher vielleicht alle 15 Minuten ein Kunde kommt.",
            "Also ich weiß ja nicht, wie die tatsächlichen Zahlen aussehen. Aber bei den Dönerläden bei mir in der Umgebung tippen die alle brav alles in die Kasse ein. Und Bon stimmt auch immer.",
            "Wenn du einen Laden zum Geldwaschen betreibst kann dir aber herzlich egal sein, wie echte Kunden zahlen. Du nimmst ja auch ganz bewusst die unechten Geschäfte in die Bücher (und zahlst Steuern drauf), um das schmutzige Geld in den legalen Wirtschaftskreislauf zu bringen.",
            "Passt zu meiner Erfahrung. Geldwäsche oder auch Steuerhinterziehung: Wenn eine Kasse genutzt wird, gibt man immer 3,50 ein statt der 18 Euro für die Großbestellung.  Wer fragt schon nach einem Bon...",
            "Also ist das nur ein Meme oder Klischee mit dem Dönermann, bei man nicht mit Karte oder App oder dergleichen zahlen kann? Bei den meisten \"moderneren Dönerketten\" (Haus des Döners, Poldis Mangal etc.) wird man doch definitiv mit Karte zahlen können. Diese wollen ja alle irgendwie das McDonalds des Döners sein und da muss man ja bargeldloses Zahlen, Bestellterminals, Drive-In Schalter, Menüs, aufdringliche Werbung und kaputte Softeis-Maschinen haben, um mit dem Restaurant mit der goldenen Möwe konkurrieren zu können.",
            "Solche Preise werden in der Kasse eingegeben. Bezahlt wird natürlich mehr.  \nEs geht hier um Steuerbetrug.",
            "Lieferando erhebt 19% Gebühren für deine Listung",
            "Dann erklär doch mal warum ein Laden der zur Geldwäsche genutzt wird keine Kartenzahlung anbieten sollte.",
            "Funktioniert das denn mittlerweile auch für Deutsche? Bisher konnte man mit der App als Deutscher nämlich nur in China zahlen, d.h. die Terminals bei ALDI etc. waren ausschließlich chinesischen Touristen vorbehalten.",
            "Nehmen auch Visa/MasterCard und AmEx zumindest konnte ich damit Merch und essen bezahlen",
            "Ich hab es nur die Tage gelesen, war nicht vor Ort. So bekommt man halt europäische Kundendaten (:",
            "Mir hat heute noch einer erzählt, er müsste pro Girocard Transaktion 0,50€ abdrücken…",
            "Steuern, das wort heißt steuern ☝🏼",
            "Ja diese Steuern sind auch nervige Gebühren",
            "Mit EC-Karte ja, mit Kreditkarte oft nicht. International ist die Kreditkarte halt eher der Standard.\n\nDavon abgesehen hast du aber natürlich recht. Ich kann mir vorstellen, dass einige jetzt auch den EM-Hype gerne \"am Finanzamt vorbei\" abgreifen wollen und dann eben nur BAR akzeptieren.\n\nWir haben bei uns ein Griechisches Restaurant, dass komischerweise jeden Freitag das Kartenlesegerät defekt hat. An allen anderen Wochentagen funktioniert es.. Komisch sowas.",
            "Auch beim Reinigungskraft auf der Toilette?",
            "Doch, das ist nur Deutschland. Anderswo wäre so was undenkbar. Die Stände betreibt nicht die UEFA.",
            "Der witz ist, dort braucht man noch nicht einmal irgendeine karte , apple pay oder sonstigen zahlungs Anbieter. Geht direkt mit deiner lokal bank in wenigen sekunden 🤯",
            "Das Zitat kritisiert, dass Kartenzahlung in Deutschland kaum möglich ist. Es wird nicht davon gesprochen, Bargeld abzuschaffen.",
            "Ich hab im Alltag nie Bargeld dabei und auch nie Probleme damit. Sollte es mal passieren, dass ich eine neue Dönerbude ausprobieren will und die nur Bargeld nehmen, geh ich halt lachend wieder raus. Seit Corona hab ich das aber nicht mehr erlebt.",
            "Naja, Deutschland blamiert sich nicht - weil im Grunde die Läden/Stände selber bestimmen können. Ich sehe das nur wieder als typische Boulevard-Schlagzeile und Deutschland-Bashing, weil umgekehrt, wäre die EM oder WM in nem anderen Teil der Welt könnte man ja genau so daherkommen und sagen \"was für ne Shitshow, die nehmen nur ihre eigenen Zahlungsmittel\" ... wird aber im deutschen Journalismus nicht gemacht, weil zu brav und nicht frech genug.",
            "Joa und zwar 0.25% bei Giro zu 0,89% bei Debit/Master/Visa. Plus 7ct pro Transaktion egal welche Karte. \n\nSagen wir mal bei einem Döner plus Getränk sind wir bei 10€ … Macht also 0.07€ Grundgebühren plus 0.10€ (Visa gerundet) bzw. 0.025€ bei Giro. \n\nAlso entweder 9,90€ Umsatz bei Giro oder 9,83€ bei Visa. \n\nOder kein Umsatz denn wenn man kein Bargeld dabei hat, dann geht man zum nächsten Laden der Kartenzahlung anbietet bevor man einen Automaten sucht.",
            "Ah, alles klar. War mir nicht sicher was du mit Ketten meinst. Ist jetzt logisch!",
            "> EC-Karte (Girocard) ist ein deutsches System, da hast du mit ausländischen Debitkarten keine Chance.\n\nGenau das wollte ich mit meinem Kommentar aussagen. Leider wird oftmals noch auf Zahlung mit EC-Karte bestanden, und da hat man dann mit einer anderweitigen Europäischen Debitkarte eben Pech gehabt.",
            "Wenn alles bar ist, kann man sogar die 19% behalten 😊",
            "Wieso? Du erhöhst pauschal den Preis, egal ob das Bar oder per Karte bezahlt wird. Ist doch gar nicht so schwer.",
            "War letztens da, konnte oft genug mit Bargeld zahlen, aber halt überall auch mit Karte.",
            "Bin gerade da und man kann echt alles mit Karte zahlen. Es ist super entspannt.",
            "Hat mich beim Besuch in London vor zwei Wochen auch voll von den Socken gehauen. Jeder Klampfenmann in der U-Bahn-Station oder an der Straßenecke hatte so'n SumUp-Ding aufm Stativ vor sich stehen.",
            "Habe in 10 Tagen Schottlandurlaub kein Bargeld abgeholt. Ist mir auch erst nach dem Urlaub aufgefallen, dass es einfach nicht nötig war.",
            "Neulich in Hamburg einen der Verkäufer von Hinz&Kunzt (Obdachlosen-Straßenmagazin) getroffen, der hat sich jetzt ein SumUp-Terminal organisiert und kann die Zeitung nun ab sofort auch bargeldlos verkaufen. Fand ich klasse. Würde die nämlich tatsächlich selbst gerne ab und an mal kaufen, hab aber leider nie nur einen Cent Bargeld dabei.",
            "Niemand verbietet es, neben elektronischen Zahlungsmitteln auch Bargeldzahlung anzubieten.",
            "Interessant, dass bei Schwarzgeld immer gleich eine das Thema döner zum Vorschein kommt, dabei gibt es unzählige dönerläden, bei denen es möglich ist mit Karte zu zahlen (es ist mittlerweile eher die Ausnahme, wenn es nicht möglich ist), aber beim beim Asiaten sogar in größeren Restaurants es öfter mal nicht möglich ist oder die italienische mafia mit Restaurants in Deutschland über 1 Milliarde Euro Geldwäsche betreibt, weil hier Bargeld noch so gängig ist.\nAber hey ein Italiener oder Grieche klingen besser als dönerladen.",
            "Warum sollte er das nicht müssen?",
            "Das ließe sich ganz einfach regeln, in dem man, wie z.B. Belgien, gesetzlich virschreibt, dass jedes Geschäft mindestens eine elektronische Zahlungsweise anbieten muss. Da kannst du am Kiosk einen Schokoriegel für einen Euro kaufen und den mit der Karte bezahlen.",
            "Gibt es seit 1958 also 20. Jahrhundert wenn ich bitten darf",
            ">nix Mindesteinkauf von 10 oder 20 €\n\nDiese Scheißmindestbeträge sind eigentlich gegen die AGBs der meisten Payment Service Provider. Müsste sich nur mal jemand bemühen, das an die PSPs (meist am Terminal erkennbar, Ingenico ist sehr weit verbreitet) zu melden.\n\nEdit: ein Wort vergessen.",
            "An vielen Zapfsäule inzwischen auch. Ein wahrer Segen für Motorradfahrer, endlich nicht mehr meinen ganzen Scheiß ausziehen. Wobei Google Pay das schon deutlich verbessert hatte, das hat immerhin den Geldbeutel rauskramen Schritt eingespart.",
            "Nein, es war am frühen Nachmittag - an der Sonnenuhr ist aber was dran, die 5 Minuten waren etwas ausgeschmückt und nur geschätzt. :'D\n\nAuf jeden Fall war es unverhältnismäßig lange.",
            "In Schweden ist nur unpraktisch, dass die häufig eine eigene App verwenden, die man nur mit Schwedischem Konto nutzen kann. Sonst gibt's da aber faktisch wirklich kein Bargeld mehr. Find das mehr als angenehm",
            "Gut, wir waren nur in der Stadt unterwegs. In ca. 90% habe ich Apple Pay genutzt, sonst mal die Karte wenn das iwie nicht ging. Werde die Umsätze jetzt aber mal genauer noch prüfen, danke.\nHatte aber auch bei den letzten Urlauben, auch mehr im Hinterland, bisher nie Probleme mit den Karten. War aber auch noch nie in einem der fly-over states, vielleicht sieht es dort ja auch nochmal anders aus.",
            "Wie [hier](https://www.youtube.com/watch?v=OLGC9m5rjx8)?",
            "Und Steuerhinterziehung.",
            "Ich war mir nicht ganz sicher, aber danke für die Aufklärung",
            "Deswegen ja auch \"und Einkommensteuer\".\n\nDie ist schwer zu vergleichen, aber wie gesagt im europäischen Umfeld nicht außergewöhnlich hoch. KöSt ist eher niedrig. Gewerbesteuer weiß ich nicht, wie und ob es die im Ausland gibt. Hier ist die aber ja auch von Gemeinde zu Gemeinde höchst unterschiedlich, aber auch anrechenbar bei den anderen steuern.\n\nBei den Gesamten Unternehmenssteuern ist Deutschland im oberen Mittelfeld. Aber lange nicht Spitzenreiter oder so. GKV ist der Abgabetreiber. Sollte aber den normalen Selbständigen nicht so sehr interessieren.\n\nIch bleibe dabei, in anderen Ländern wird einfach viel strenger kontrolliert, weswegen da alles gebucht wird,  dadurch man immer mit Karte zahlen kann und einen bin bekommt.",
            "Geheimtipp: wenn er sich ein eigenes Terminal anschafft zahlt er deutlich weniger.\nIst er doch selbst schuld, wenn er unnötigerweise 30% abdrücken muss.",
            "30% zahlt man nur, wenn Lieferando auch den Versand übernimmt - das ist meine letzte Info. Sonst sind es 1X%.",
            "Bei mir in der Stadt kannst Du bei praktisch jedem Dönermann mit Karte zahlen. Bei der urdeutschen Wurstbude musste erst umständlich das lesegerät rausgekramt werden und dann gab es noch gratis Gejammer, dass das ja 0,50€ pro Buchung kosten würde…",
            "Ich konnte auch bisher immer in jedem Dönerladen mit Google pay, visa debit und überhaupt allem zahlen und sogar wenn ich spontan danach gesagt hab \"ach, ich bräuchte die Rechnung\" dann gab es halt einfach die Rechnung für mich. \n\nIch kann im Moment schwer einschätzen ob diese gegenteiligen Erzählungen einfach hetze gegen Ausländer ist oder ob das vielleicht in anderen regionen wirklich so komplett anders abläuft",
            "Das hat auch nichts mit Geldwäsche zu tun. Geldwäsche ist in der theorie ja sehr einfach. du nimmst Unversteuertes (dreckiges Geld) aus illegalen aktivitäten und verbuchst es als (saubere) einahmen eines legalen Geschäfts. \n\nDer Dönermann tippt also brav deine Bestellung ein, und dann tippt er sie nochmal ein und legt dafür dann das zu waschende Geld in die Kasse.",
            "Ja, das stimmt. Hätte noch die klassische Steuerhinterziehung nennen sollen. Klar ist, Finanzbetrug.",
            " Ich denke das Finanzamt weiß ziemlich gut wie das verhältniss von Bargeld zu Bargeldlos aussehen müsste. Da könnte es dir leicht passieren, dass du zu viel Bargeld wäscht und es dadurch auffällig wird. Dann lieber gleich nur Bares",
            "Hm also mein \"Stammdöner\" ist hier auf dem Dorf und alles andere als ne große Kette. Ist trotzdem kein Problem.  Generell geht es hier eigentlich überall mit Karte Bäcker, Metzger,..\n\nAm schlimmsten finde ich noch Parkuhren im öffentlichen Raum, da gibt es nach wie vor genug die nur mit Münzgeld gehen.",
            "Ja geht eher um dieses Dorfdöner die eh alle schwarzgeld einsacken",
            "Wer zu den Dönerketten geht hat eh die Kontrolle verloren.",
            "Gestern Döner geholt und mit Karte zahlen wollen „Nur EC“",
            "Ja schon, aber dafür müssen sie die Infra nicht stellen damit ich Online bestellen kann. Sie haben sozusagen mit dem Aufpreis für sich mehr reichweite gekauft und sparen sich u.a auch einen Telefondienst der die Bestellungen entgegennimmt.\n\nZumal können sie sich Flyer sparen und allgemein Onlinewerbung (die in den Preisen ja einkalkuliert sind)\n\nMeiner Meinung rechtfertigt sich ein Aufpreis nicht. Aber dadurch das ich sowieso keinen Paln habe was der Döner im Material kostet, ich selbst kam mal auf einen Preis von 2,50 (Ohne Fleisch) + 5 min Zutaten schneiden Brot Formen (sehr viel Zeit wenn man es für jeden Döner der über die Ladentheke geht ) und 1 Min zusammensetzen. Dann bin ich bei unter 4€",
            "Denk kurz 10 Sekunden nach, Du kommst da selbst drauf.",
            "Ich halte es durchaus für realistisch, dass sich einige Händler damit abziehen lassen, dass sie extrem schlechte Verträge haben, aber dann sollten sie auch mal ein wenig herumshoppen statt nur zu jammern.",
            "🤫🤫🤫",
            "\"Das Kartengerät geht heute nicht. DaS iSt Ja KoMiScH, wIe KaNn DaS dEnN sEiN... Ist wahrscheinlich Überlastung.\"",
            "In Deutschland hast du ja inzwischen auch immer mehr Kreditkarten. Ich besitze gar keine Giro mehr. Ich meide inzwischen Geschäfte, in denen ich nicht so zahlen kann.",
            "So ein Bullshit. Ich hab seit Ewigkeiten kein Restaurant mehr gesehen, dass keine Visa/Master nimmt. Also sorry. Das stimmt einfach nicht.",
            "Man kann auch Sachen ad absurdum ziehen....",
            "Die UEFA und die Stadt sind für die Umsetzung zuständig und die UEFA war hier federführend was man in einigen investigative journalisten Artikel ja sehr gut gesehen hat. \n\nUEFA hätte sagen können du musst mit Karte zahlen können. Haben sie nicht. Sie haben aber dröelf tausend andere Bedingungen gehabt und btw alles auf Steuerzahler kosten.",
            "Ha, das ist ja spannend. Und bei uns muss die EU SEPA Echtzeitüberweisung per Gesetz erzwingen… 🥴",
            "Wenn ich mir die Kommentare anschaue, die sich über Schwarzgeld beschweren, dann ist der Wunsch der Bargeldlosigkeit hier glaub durchaus naheliegend. Zumindest bei manchen.",
            "Hehe",
            "Die 19% MwSt. nicht, die hat der Händler eh schon bezahlt und wäre dumm, die nicht weiterzugeben (um sie zurückzuerhalten). Man macht aber weniger Gewinn, dadurch spart man Steuern.",
            "Dann hättest du bereits vorher den Preis erhöhen können.",
            "Ich auch & kann das bestätigen :)",
            "Und in der Kirche und Museen (kostenloser Eintritt) gibt es mehrere Kartenterminals, die zB auf 2, 5 oder 20 GBP eingestellt sind. Einfach dranhalten und gespendet. Verrückt.",
            "Wie funktioniert das genau? Tippt man da dann selber ein, wie viel man geben möchte?",
            "Aber liegt es nicht am Ende am Laden, die diese Regeln für sich aufstellen ? Ich meine, wie kann der PSP verlangen \"hey, wenn bei Euch jemand 2 € mit Karte zahlen will, dann müsst ihr !!\"",
            "Ich meinte sogar Zapfsäulen haha",
            "Ich bin auch Verfechter des Bargeldes. Alle anderen können gern mit Karte Handy, Uhr, microchip im Kopf zahlen.\nIch finde es gut weniger Daten zu hinterlassen.\nIch bin bei comdirect mit meinem Girokonto. Das Konto führt automatisch ein Haushaltsbuch für mich indem es meine Ausgaben auswertet und in Gruppen einteilt. Das ist doch schockierend. Also klar, das Verfahren dahinter ist natürlich keine Raketenwissenschaft, aber mir geht es darum, dass ich komplett Gläsern bin.\nSoo viele Infos über mich in einer Hand. Name, Alter, Gewohnheiten usw. Also Herr Müller kauft seit 20 Jahren jede Woche eine Tüte Gummibärchen, da ist doch klar, dass er jetzt drei Füllungen im Gebiss hat und 10kg Übergewicht, da wird natürlich der krankenkassenbeitrag um 5€ erhöht. Es ist ja auch kein Hirngespinst von mir. Bei privaten Krankenversicherungen und allgemein Versicherungen, bestimmt auch bei speziellen Jobs wird man untersucht und eingestuft, da ist es ja nur eine Frage der Zeit, bis die Lücke noch geschlossen wird. Das Bankgeheimnis ist doch sowieso schon dahin.\nDas bonusheft beim Zahnarzt, was ich auch gut finde, ist doch eine Vorstufe davon, wenn du das machst, musst du nicht so viel zahlen.",
            "Das \"/s\" am Ende steht für Sarkasmus. 😉",
            "18 %",
            "Ist pure hetze, ich war jahrelang im Vertrieb und überall in Deutschland unterwegs, in den letzten Jahren gab es so einen Umschwung, überall die hippen, neuen dönerläden, natürlich kannst du dann auch mit Karte zahlen, passt sonst nicht ins Konzept. Der Kollege hier, der schreibt, dass 19 von 20 dönerläden kein Bargeld nehmen, labert nur Unsinn. Ich würde gerne wissen, wo das sein soll, ich werde persönlich diese Aussage prüfen und widerlegen mit entsprechenden Beweisen.\nDass in einem kleinen Kaff irgendwo im nirgendwo der dönerladen keine Kartenzahlung akzeptiert ist eher üblich, aber versuch es mal beim Italiener dort, der nimmt sicher auch nur Bargeld.\nDie italienische mafia wäscht über 1 Milliarde Euro im Jahr in Deutschland durch Restaurants und ihre Barzahlungen, aber ja es sind immer die dönerläden.",
            "Kann Dir bestätigen hier akzeptieren von 20 Döner Läden 19 keine Kartenzahlung aus Gründen der Steuerhinterziehung. \nIn die Kasse wird natürlich auch nichts eingegeben, zum ausrechnen liegt der Taschenrechner neben der Kasse.",
            "Yep, wenn für zwei Döner und Getränk nur das Getränk eingegeben wird um die Kasse fürs Wechselgeld aufzumachen ist klar was da läuft",
            "Gibt für so ziemlich alles Statistiken.",
            "Ich denk, dass hier überraschend viele den Unterschied zwischen Steuerhinterziehung und Geldwäsche nicht kennen.",
            "Habe ich dem guten Mann gesagt, fand er irgendwie nicht so cool. Wollte wohl lieber jammern.",
            "Wo kämen wir denn da hin, wenn Geschäftsleute sich am Ende noch selbst informieren sollten, wie sie ihr Business möglichst effektiv und effizient führen können? Hab selbst ein Gewerbe, akzeptiere selbstverständlich Kartenzahlung (egal welche) und auch sonst alles (PayPal, Stripe, Überweisung, Lastschrift, wünsch dir was) und kann es echt nicht mehr hören.",
            "Ich beneide dich, wenn du das durchziehen kannst. Ich leiste mir ein zusätzliches Konto bei der 1822 nur damit ich meine Girokarte bei Apple Pay hinterlegen kann.\n\nMit Karte zahlen wollen, aber ohne Giro. Hier unmöglich. Wir reden hier von einem (kleinen) Mittelzentrum im Rhein-Ruhr-Gebiet.\n\nImmerhin gibt es hier mittlerweile 3 gute Dönerläden die Girokarte akzeptieren. Nur bei einem ist schon seit 2 Jahren das Kartenterminal defekt :((",
            "Ich wohne in einer touristischen Mittelstand mit Einwohnerstarken Einzugsgebiet und erweiterten Rhein-Main-Gebiet. Hier geht bei ausnahmslos jeden Restaurant ausschließlich Barzahlung.",
            "Nur weil du innerhalb deines Dunstkreises eine andere Erfahrung gemacht hast, heißt das nicht, dass das landesweit die Realität ist.\n\nHier bei uns kannst du bei der Hälfte der Fressbuden nicht mal mit EC-karte zahlen, an Kreditkarte gar nicht erst zu denken.\n\nDass das ganze insgesamt Bullshit ist und eher zur Geldwäsche und Steuerhinterziehung beiträgt, ist klar.",
            "Mitten in Köln, 2 Minuten vom Deutzer Bahnhof. Total krass.",
            "Naja, in anderen Ländern zahlt man das Klo halt mit Karte. Ich hab nicht mal 50 Cent dabei, weil ich alles ohne kartenzahlung meide",
            "Ja, weil sie davon ausgehen dass die Betreiber nicht geisteskrank sind, sondern Geld verdienen wollen.",
            "Die beschweren sich über Schwarzgeld. Das heißt nicht Bargeld abschaffen. Und zurecht, Deutschland ist die destination um Geld zu waschen.",
            "Bekommt er sowieso über den Vorsteuerüberhang zurück.",
            "Geil, bei uns waren an Sparkassenautomaten in der Filiale drin Schilder, dass man aufpassen muss und alles kontrollieren damit Verbrecher durch irgendwelche Aufsätze keine Kartendaten auswählen. 🫣",
            "Kannst du auf jedenfall so einstellen.",
            "Ich hab selten genau hingeschaut. Es gibt Geräte, bei denen man Auswahlmöglichkeiten hatte. Und manche hatten einen Zettel dranhängen mit dem voreingestellten Betrag (zb 2£), der dann abgebucht wird.",
            "https://musiciansunion.org.uk/news/a-guide-to-card-readers",
            "> Also Herr Müller kauft seit 20 Jahren jede Woche eine Tüte Gummibärchen, da ist doch klar, dass er jetzt drei Füllungen im Gebiss hat und 10kg Übergewicht, da wird natürlich der krankenkassenbeitrag um 5€ erhöht. Es ist ja auch kein Hirngespinst von mir.\n\nWie soll das denn funktionieren? Die Bank sieht doch \"nur\" dass Herr Müller am 12.05.2025 um 16:38 Uhr bei Aldi 46,73€ gezahlt hat. Dass man auch aus Metadaten Informationen ziehen kann ist mir klar aber woher soll die Bank wissen, dass Gummibärchen dabei waren und wieso sollte die Krankenkasse das von der Bank erfahren?",
            "Ich möchte deine Aussage gar nicht anzweifeln, es kann ja sein dass sich hier unsere regionen stark unterscheiden. Ich frage mich dann nur wie etwas so offensichtliches so lange bestehen kann. Jeder kann dem Finanzamt einen tipp geben, auch anonym. Klar ist das den meisten zu viel Aufwand, aber es reicht ja wenn mal ein Kunde sich nachhaltig genug ärgert darüber nirgends was zu essen kaufen zu können weil er halt kein Bargeld dabei hat, so was wäre ja leicht zu überprüfen fürs Finanzamt",
            "Restaurant.\n\nEs ging um Restaurants.",
            "Naja dann hat UEFA trotzdem an der Sache die Verantwortung und nicht Deutschland als Land.... \n\nUnd sind wir Mal ganz ehrlich UEFA is ja schon in der Vergangenheit für Korruption und Steuerhinterziehung aufgefallen.",
            "Kontaktlos ist halt auch einfach deutlich sicherer. Und Apple Pay zB. erstellt bei jeder Transaktion eine neue virtuelle Kreditkarte, die danach deaktiviert und gelöscht wird. Also selbst wenn die Daten abgegriffen werden sind sie komplett wertlos.",
            "Dir is schon klar das die Skimmer(so heißen die Aufsätze) in kartenlastigen Ländern nochmal deutlich verbreiteter sind als in Deutschland?",
            "Wahrscheinlich verkauft die Bank aNoNyMiSiErTe Transaktionsdaten, wenn die es nicht machen, spätestens Google/Apple Pay dann. \n\nUnd wenn Herr Müller neber dem Haribo Produktionsverkauf wohnt und da seine wöchentliche Tüte kauft? \nOder halt alle 3 Wochen mal bei McDonalds vorbeifährt?\n\nVielleicht verkauft auch Aldi einfach die Daten direkt selber 🤷‍♂️",
            "Kenne in Köln diverse echte Restaurants, die gar keine Kartenzahlung anbieten.",
            "Doch. So was gibt es nur in Deutschland, auf so eine Kacke kommen nur Deutsche.",
            "Echt, das wusste ich gar nicht. Hat das irgendwelche Nachteile?",
            "Kann ich bestätigen",
            "Klar die Verträge die die UEFA aufgesetzt hat und durchgedrückt hat und den deutschen Steuerzahler Millionen kosten absolven dann auch noch die UEFA von schlechten Ideen.... Cool story bro\n\nSo Mal zum lesen:\n\nhttps://correctiv.org/aktuelles/wirtschaft/2024/06/06/kostenexplosion-fussball-em-deutschland-2024/",
            "Nö.",
            "Das hat damit nichts zu tun.\nDieser Bargeldwahn und schlechte Service ist typisch deutsch, das gibt es nur hier."
        ]
    },
    "Darf man Rentenansprüche aus einem Umlagesystem zum Vermögen zählen?": {
        "title": "Darf man Rentenansprüche aus einem Umlagesystem zum Vermögen zählen?",
        "score": 52,
        "url": "https://www.reddit.com/r/Finanzen/comments/1dlqanc/darf_man_rentenansprüche_aus_einem_umlagesystem/",
        "content": "Ich bin über einen Beitrag gestolpert, in dem das Vermögen in europäischen Ländern verglichen wurde. Deutschland schneidet hier nicht so gut ab. Eine Erklärung in dem Beitrag ist, dass Rentenansprüche in der Statistik nicht erfasst würden. Zitat: „Daher wird das Medianeinkommen für Deutschland im Vergleich zu Ländern mit einem kapitalgedeckten Rentenversicherungssystem zu niedrig ausgewiesen“ Dan kommen die Autoren zu dem Schluss, dass :“in Deutschland ergeben sich daraus Rentenversicherungsansprüche von rund 195.000 Euro je Haushalt. Fast ein Drittel des durchschnittlichen deutschen Haushaltsvermögens fehlt also in der Rechnung der EZB“\n\nAus Sicht desjenigen, der gerade Rentenansprüche bezieht, mag das vielleicht stimmen, aber auf die Gesellschafft bezogen ist das doch grob falsch. Im Umlageverfahren gibt es das Kapital nicht, es muss erst noch von jemandem erarbeitet werden. Im Vergleich dazu ist bei der Kapitaldeckung das Kapital ja bereits vorhanden. Hier wurde die Arbeit bereits getan. \nDaher kann ich doch nicht bereits vorhandenes Kapital mit irgendwelchen Ansprüchen gleichsetzen für die erst noch jemand in der Zukunft arbeiten gehen muss.\n\nHabe ich hier einen Denkfehler?\n\nHier der Link zum Artikel:\n\nhttps://www.rwi-essen.de/presse/wissenschaftskommunikation/pressemitteilungen/detail/deutsche-sind-die-armen-schlucker-europas",
        "num_comments": 73,
        "comments": [
            "Aus Bilanzsicht sind das Forderungen, die werden bereits zu einem Schätzwert aktiviert. Geld repräsentiert sind ja auch nur den Anspruch, zukünftig Güter zu erhalten. Ob dieser Anspruch in Rentenpunkten oder Kontostand ist, ist meiner Ansicht nach erstmal zweitrangig. Ärgerlich ist, dass Rentenpunkte prinzipiell nur Forderungen ggü. Zukünftigen Arbeitnehmern sind. Bei der derzeitigen demographischen Entwicklung ist das eher weniger attraktiv.",
            "Dann sollte man vielleicht auch die Rentenverpflichtungen des Staates als indirekte Verbindlichkeiten werten. Damit sieht unsere Staatsverschuldung nämlich ziemlich bescheiden aus.",
            "Wie würdest du dann die Rentenversicherungsansprüche berücksichtigen? Bei der aktuellen Methode besteht dann eine scheinbar riesige Vermögenslücke.",
            "\"Oxfam\" behauptet ja jedes Jahr, dass die acht oder so reichsten Menschen der Welt mehr Geld besitzen als die ärmsten 50% der Welt zusammen. So kann mein eine Statistik verbiegen, indem man zukünftige Zahlungen für Kredite reinrechnet, aber nicht zukünftige Einnahmen. Dadurch haben sehr viele Menschen in der Rechnung von Oxfam ein sehr kleines oder sogar negatives Vermögen.",
            "Man kann die Rentenansprüche schon zum vermögen zählen, aber: \n\n\n1. Du kannst sie nicht vererben oder anderweitig übertragen (ein Haus z.b. schon)  \n2. Du kannst nicht auf das Vermögen zugreifen bis du ein bestimmtes alter erreicht hast  \n3. Es ist nicht sicher, wie lange das aktuelle Renteneintrittsalter gehalten werden kann. Das ist das, weshalb sich hier im Sub auch alle Sorgen machen. Momentan wird das System gerade so noch am Laufen gehalten, aber das wird in 20, 30 oder 50 Jahren vielleicht anders aussehen und wir werden alle bis 75 arbeiten müssen. Das Rentenniveau wird evtl. auch sinken.\n   4. Rentner können nicht in alle länder ohne Komplikationen auswandern. Innerhalb der EU geht das noch, außerhalb wird es schwieriger. \n\n\n Man müsste im Detail nachschauen wie genau der Wert von 200k berechnet worden ist. Natürlich ist der Wert nicht 0, wenn ich die Wahl hätte würde ich mir den Betrag aber lieber auszahlen lassen, oder sogar 30% weniger. Auf 40 Jahre sind 130k mit nur 4% immerhin 600k.",
            "Wenn man die Rentenansprüche ins Vermögen reinrechnet müsste man sie umgekehrt auch in die Staatsschulden miteinrechnen (genau wie die Pensionen). Damit würde man sehen, dass man da Ansprüche gegen einen völlig überschuldeten Staat hat,  der keinerlei signifikante Rücklagen bildet. Mit entsprechenden Abschlag sind also die Rentenansprüche also in der Vermögensaufstellung zu bewerten. \n\n\nUnd auch wenn das natürlich nicht so offen kommuniziert wird, jedes Jahr höheres Renteneintrittsalter ist schon ein gewaltiger Abschlag auf dieses Vermögen.",
            "Wie werden denn Einnahmen aus Forderungen gehandhabt? Beispiel: man exportiert etwas aber es wurde noch nicht dafür bezahlt. Garantiert dir auch keiner dass das Geld ankommt, der Käufer könnte Insolvent gehen",
            "Bei uns in der Schweiz wird das Pensionskassengeld (2. Säule) zum Vermögen dazu gezählt. Das kann ich aber auch beziehen um z.B ein Haus zu kaufen oder Auszuwandern. Zudem wenn ich sterbe, wird es vererbt. Im Alter kann ich mir (je nach Pensionskasse) es auszahlen lassen. In dem Fall macht es meiner Meinung nach schon Sinn es zum Vermögen zu zählen.",
            "Man bekommt ja nichtmal Anspruch auf Kapital X, sondern Rentenpunkte a.k.a. Shitcoins von der Deutschen Rentenversicherung 🤡",
            "Mit der Hinzurechnung von angeblichen Renten, die erstmal für Gen Z und Y wirklich gezahlt werden müssen - was noch zu beweisen ist - kann man wunderbar verschleudern, dass Deutschland im Vergleich zu anderen wohlhabenden Ländern ein Billiglohnland und Mieterland ist. \n\nEigentlich müssten wir Gehälter wie in Norwegen oder Luxemburg oder der Schweiz haben. \n\nDie Reallohnentwicklung stagniert hier allerdings politisch gewollt und die Leute haben auch kein Wohneigentum sondern sind abhängige Mieter - das ist auch politisch gewollt. \n\nMan verbucht als imaginär „die Rente“ zum Vermögen hinzu - was natürlich nichts an den Problemen ändert aber die Statistik besser aussehen lässt. \n\nPolitisch gewollt meint übrigens vom Volke gewollt, denn das Wahlvolk wählt seit 30 Jahren zuverlässig die Parteien, die uns oben beschriebene Umstände einbrocken. ",
            ">Im Vergleich dazu ist bei der Kapitaldeckung das Kapital ja bereits vorhanden.\n\nJein. Das Kapital existiert in Form eines Besitzanteils an Unternehmen usw., erst durch Verkauf wird es geldwert, und ob es jemand kauft und zu welchem Kurs ist heute nicht bestimmbar. Es hängt genauso von der wirtschaftlichen und demographischen Entwicklung ab wie ein Umlagesystem. Es ist nur in stärkerem Maße dem direkten und willkürlichen Einfluss der Politik entzogen.",
            "Habe mir die gleiche Frage für mein persönliches Portfolio gestellt und bewerte Rentenpunkte wie Wertpapiere. Der Kurs ist der Preis, zu dem 55-jährige heute Rentenpunkte aufstocken können: 8.436,59 €. Die Anzahl der Rentenpunkte kann man jederzeit mit Personalausweis bei rentenuebersicht.de (PDF) abrufen. Das ist sehr einfach und so hat man für sich persönlich ein Preisschild an der Geschichte, wenn man das möchte.\n\nAlternativ lässt sich der Wert über die durchschnittliche Rentenbezugsdauer multipliziert mit der jährlichen Rente pro Rentenpunkt ermitteln. Kommt aktuell auf ein ähnliches Ergebnis, kann sich aber künftig ändern. \n\nTheoretisch ergibt sich für dieses \"Investment\" eine Rendite aus zukünftigen Lohnerhöhungen, jedoch müssen wir alle damit rechnen dass die Rentenerhöhungen in den nächsten Jahren niedriger sein werden als die Lohnerhöhungen.",
            "Ob es jetzt kapitalgedeckt ist oder umlagefinanziert.... Am Ende kriegst du die Kohle... wenn man das nicht gleichsetzt, gibt es halt Verzerrungen",
            "Sehe ich auch so. Momentan haben die Leute ja nur Ansprüche auf Rentenpunkte. Der zukünftige monetäre Wert der Rentenpunkte ist undefiniert.",
            "Ein Vergleich:\n\nWenn man als \"Vermögen\" Aktien besitzt, gibt es das Kapital dann, in deinem Sinne? Eigentlich hat man nur die Hoffnung, daß man die Aktien später für genug Geld an jemand anderen verkaufen kann.\n\nAuch die Dividenden müssen von den Firmen jedes Jahr neu erwirtschaftet werden.",
            "Rechnet man die Rentenversicherung ins Vermögen, müsste man das auch mit allen anderen Sozialversicherungen machen.\n\nAlso Kranken- über das Arbeitslosen- bis zum Bürgergeld. Das alles wird, wie auch die Rentenversicherung, zum Teil aus Beiträgen aber auch immer mehr durch Steuern finanziert.\n\nWo würde man also hinkommen, wenn man theoretisches zukünftiges Vermögen mit in das aktuelle Vermögen einrechnet?",
            "Es haben schon andere gesagt wie man nicht nach Belieben auf die Rente zugreifen kann und sie auch nicht vererben kann.\n\nAber vor allem gibt es überhaupt keine Garantie, dass man sie überhaupt bekommt. Ich rede hier nicht Mal vom Rentensystemkollaps, sondern von frühem Tod. Stell dir vor die stirbst vor 67. Null Rente. Wird die dann wieder vom Vermögen abgezogen oder bleibt sie, obwohl man nie auf sie zugreifen konnte und nur verlorenes Geld war?",
            "Ob Forderungen die nicht noch gemäß IAS36 impairt werden müssen...",
            "Ich kann Rentenansprüche nicht liquidieren, ich kann sie nicht vererben und ich kann ohne massive Abschläge erst sehr spät überhaupt darüber verfügen. Also in meinen Augen absolut nicht als Vermögenswert qualifiziert.",
            "> Aus Bilanzsicht sind das Forderungen, die werden bereits zu einem Schätzwert aktiviert. \n\nMan kann es **vergleichen** mit ner Forderung, klar, aber Rentenansprüche sind keine Forderung. Hier wurde keine Schuld aufgenommen o.ä. \n\nBezüglich der Frage allgemein: Natürlich sind Rentenansprüche kein Teil des Vermögens. Vermögen basiert auf Eigentum und Eigentum kann man immer (theoretisch) verkaufen. Was du nicht verkaufen kannst, ist auch kein Vermögen. Rentenpunkte kann man nicht verkaufen, also sind sie kein Vermögen.",
            "Eben. Das ist ein valider Punkt. Mit Pensionsansprüchen ebenso. Das sind die facto Staatsschulden.",
            "stimme dir zu. In dem Artikel wurde das aber nicht gemacht.",
            "In dem Fall auch eine sinnlose Metrik. Dann Schuldet der Deutsche Staat, der sich über die Deutschen finanziert, einem Teil der Deutschen Geld.",
            "Ich würde sagen das sind wie Zertifikat an der Börse. Es ist ein nicht gesichertes Versprechen und kann im schlechtesten Fall wertlos verfallen.        \n          \nDamit ist die Rente in DE eigentlich eine hochrisiko Anlage, welche jedoch keinen Wertzuwachs erfährt.",
            "Man kann ermitteln wieviel Geld ich in eine private Rentenversicherung einzahlen müsste um eine vergleichbare Rentenzusage zu erzielen. Dies entspräche dann dem Wert der Rentenpunkte",
            "Man könnte die Rentenbezugsdauer schätzen und anhand der voraussichtlichen Rentenhöhe den Gesamtwert hochrechnen und auf den heutigen Tag abzinsen.\n\nMan könnte es aber auch lassen und stattdessen im Kaffeesatz lesen.",
            "Ich bilde Rentenpunkte in Portfolio Performance als Wertpapier ab, jeweils mit dem aktuellem Kaufkurs (Beitragssatz x Durchschnittseinkommen). Ist nicht perfekt aber man hat die Daten wenigstens vorliegen und muss nicht groß schätzen.",
            "klingt interessant. Hast du mehr Infos dazu wie zukünftige Einnahmen und Kredite (nicht) verrechnet werden?",
            "Und dieses winziges Detail, welches wahrscheinlich technisch gesehen korrekt umgesetzt wurde, widerlegt natürlich komplett die Kernaussage der Studie, weil es dann die 12 reichsten Menschen wären und nicht nur 8.\n\nUnd ich will gar nicht erst wissen, welches versteckte Vermögen der 8 reichsten Menschen nicht ausreichend berücksichtigt wurde, von Offshore-Firmen, über nicht bilanzierte Wertgewinne, nicht in Geld aufzuwiegende Geschäftsnetzwerke, politische Einflüsse durch \"Lobbyismus\", Stiftungen die offiziell jemanden anderen gehören, bis hin zu buchstäblich unverkäuflicher historscher Kunstgegenstände. Aber ja, die deutschen Rentenpunkte die nicht berücksichtigt wurden verschieben die Rechnung absichtlich zu Gunsten der Armen.",
            "Bewertung ist einfach: wieviel Geld muss ich in eine private Rentenversicherung stecken um eine äquivalente Rente zu erhalten. PVs haben ähnliche Beschränkungen (nicht-veerbarkeit erhöht eben auch die Zahlungen da das Geld von früh-verstorbenen auf die anderen Versicherungsnehmer verteilt werden kann)",
            "Mit einer Witwerrente und Waisenrente ist eine Vererbung mit Abschlägen möglich.\n\nDas die Auszahlung ab einem unbestimmten Zeitpunkt ist gibt es auch in der freien Wirtschaft z.B. Hedgfonds, Festanlage usw. \n\nAlles hat auch ein Ausfall Risiko z.B. Haus brennt ab, Fond geht pleite, Hyperinflation, Krieg...",
            "❤️‍🔥",
            ">2. Du kannst nicht auf das Vermögen zugreifen bis du ein bestimmtes alter erreicht hast  \n\nAuf das Vermögen kann man doch eigentlich gar nicht zugreifen, oder? Es ist doch nur eine vom Staat diktierte Summe X, die ich jeden Monat bekommen darf.",
            "Naja, dafür gibt es ja Factoring und die Zahlen durchaus Geld für Forderungen. Auch notleidende Kredite haben einen Restwert und letztendlich garantiert einem bei Aktien auch niemand, dass der Laden morgen nicht insolvent ist.\n\nIst bei Rentenpunkten am Ende genauso. Ein Rentepunkt kostet bei der RV 8.436,59€. Das wäre das obere Wertlimit. Könnte man Rentenpunkte frei handeln würde ich meinem Nachbarn seine Rentenpunkte für 1€ den Punkt sofort abkaufen. Irgendwo dazwischen wird dann der Wert liegen.",
            "man kann die Pension vererben oder sich auszahlen lassen? Wie rechnen die dann, mit der durchschnittlichen Lebenserwartung, und wenn du vorher stirbst zurueckzahlen?",
            "Tatsächlich ist das kein Problem. Man kann Rentenpunkte umrechnen, ein fairer Vergleich wäre die notwendige Menge an Bundesanleihen um durch die Zinsen ein dem Rentenanspruch vergleichbares Einkommen zu erlangen.",
            "Wenn ich Aktien besitze bin ich Miteigentümer eines Unternehmens. Rentenpunkte wären in diesem Vergleich eher Stockoptions",
            "Nur mit dem Unterschied dass die Rentenversicherung ein ähnliches Ziel verfolgt wie r/Finanzen mit dem Gral. Die anderen decken Risiken ab.",
            "Ne, Rente wird ja (irgendwann und in monatlichen Raten) zu deiner freien Verfügung ausgezahlt, ob du sie brauchst oder nicht. Bei den anderen Versicherungen ist das nicht der Fall.",
            "Ich bin nicht qualifiziert über solche Feinheiten zu diskutieren. Prinzipiell sollte man aber den erwarteten Geldwert schätzen. Nachdem Erwartungswert kleiner Maximalwert ist, wäre IAS36 eingehalten. Ob und wie man abzinst, ist auch noch eine Unklarheit.",
            "Also sollte man Rürup-Renten auch rausrechnen? Die haben auch alle diese Nachteile.",
            "kompletter Blödsinn. Rentenpunkte sind eine individuelle Forderung gegenüber der GRV, ihnen stehen staatlicherseits entsprechende Zahlungsverpflichtungen gegenüber.\n\nDa Vermögen nichts weiter ist als die monetäre Bewertung (Barwert/Diskontierung) von künftigen Cashflow-Überschüssen, zählen rentenpunkte natürlich dazu. \n\nMit Eigentum hat das nur insofern zu tun, dass der Eigentümer einer sache noch weitergehende Verfügungsrechte an dieser hat als nur monetäre.",
            "Vor ein paar Jahren im Bekanntenkreis eine gruselige Scheidung erlebt. Unter anderem musste sie (Arbeitnehmerin) die Hälfte ihrer Rentenpunkte an ihn (Selbständig) abtreten. Scheint also durchaus als Eigentum zu gelten. Es gibt bloß keinen freien Markt dafür.",
            ">Vermögen basiert auf Eigentum und Eigentum kann man immer (theoretisch) verkaufen. Was du nicht verkaufen kannst, ist auch kein Vermögen. Rentenpunkte kann man nicht verkaufen, also sind sie kein Vermögen.\n\nQutsch. Das ist ja genau der Punkt warum die GRV so schwierig zu reformieren sind: Die Ansprüche sind Eigentumsansprüche eines einzelnen ggü. der GRV.",
            "Wieso ohne Wertzuwachs. Die aktuellen Renten steigen mit den Löhnen.\n\nLöhne steigen leicht über der Inflation.",
            "Das heißt, die Rentenpunkte beeinflussen auch Deine Asset Allocation, Du legst also bewusst risikobehafteter an, als ohne Berücksichtigung der Rente?",
            "Da gibt es viele Artikel dazu wie diesem hier.  \n[https://www.cicero.de/wirtschaft/oxfam-studie-weltwirtschaftsforum-vermoegen-arm-reich](https://www.cicero.de/wirtschaft/oxfam-studie-weltwirtschaftsforum-vermoegen-arm-reich)  \nIch fand damals interessant, dass sogar die Tagesschau die Methodik von Oxfam kritisch sah. Trotzdem veröffentliche sie jeden problematische Pressemitteilung, die eigentlich nur eine PR-Aktion von Oxfam war.",
            "Ich weiß noch, dass die Zahl immer kleiner wurde. Es waren mal die reichsten 12, aber zuletzt waren es die reichsten 8. \n\nWenn ich ein Haus für 400.000 Euro kaufe, aber dafür in den nächsten 30 Jahren 450.000 für den Kredit aufbringen muss, ist das für Oxfam eine Vermögen von -50.000 Euro, obwohl ich in einem Haus im Wert von 400.000 Euro lebe.",
            "Ganz so einfach wird es nicht sein, da die gesetzliche Rentenversicherung durch den Bundestag angepasst werden kann und eine private Rentenversicherung nicht. Die private kann man außerdem kündigen und erhält Geld zurück, in dem Sinne ist sie also liquider. Außerdem wahrscheinlich unterschiedliche steuerliche Behandlung etc",
            "Die Waisenrente kriegt man mWn nur bis 27. Danach exakt 0.",
            "Ja, was ich meinte war dass du den ersten Beitrag X erst mit 67 oder sonstwann bekommst",
            "Das ist der Weg.",
            "Du kannst das geld auszahlen lassen, hast dann halt das risiko, dass dir das geld ausgeht, kannst es aber auch vererben, wenn was übrig bleibt. Wenn du stattdessen eine rente beziehst, gibt es im todesfall eine witwenrente. Hast du keine frau/berechtigen lebenspartner, verfallen die ansprüche. \n\nDa die pension persönlich ist, lässt sie sich nicht mit der deutschen rente vergleichen. Es gibt aber die alters- und hinterlassenenversicherung (AHV) die ebenfalls über ein umlageverfahren funktioniert.",
            "Ich denke, der Poster will darauf raus, dass Du Deinen Depotwert streng genommen nicht als Vermögen ansehen dürftest, wenn Du geldwerte Bewertungen nicht zulässt. Der Depotwert ist schließlich nichts anderes, als die Annahme, alle Anteile zum gleichen Preis verkaufen zu können wie beim zuletzt am Markt abgeschlossenen Handel (= Kurs). \n\nMeistens trifft das auch zu, aber eben nicht immer. Beispielsweise nimmt man den Schlusskurs vom Freitag am Wochenende automatisch als Grundlage zur Bewertung des Depots. Wenn, aber Samstagnacht ein unvorhergesehenes Ereignis eintritt, das den Kurs beeinflusst, wird man am Montag nicht zu seinem angenommenen Wert verkaufen können und hat sich am Sonntag in die eigene Tasche \"gelogen\".",
            "Mit Rentenpunkten bist du quasi Miteigentümer an der Deutschen Volkswirtschaft und kriegst wenn du alt bist anteilig Dividenden vom Volksarbeitseinkommen.",
            "Aber das tut das Steuersystem doch auch, indem es das Risiko der absoluten Armut abdeckt.\n\nFür mich eigentlich die sinnvollste Versicherung gegen Kriminalität, die eine Gesellschaft haben kann.\n\nInsofern müsste man auch vieles anderes in einem privelegierten Land zum Einkommen rechnen.\n\nWer zum Beispiel im Sudan kein Einkommen mehr erzielen kann muss eine gute Familie haben oder verhungert, egal wie viel Geld er vorher hatte.",
            "Das Asset darf nur angesetzt werden wenn zukünftige Cashflows more likely than not sind.",
            "Ja, so meinte ich das. Vielen Dank für deine Korrektur 👍",
            ">Löhne steigen leicht über der Inflation.\n\nDas ist jetzt so, aber reales Wachstumnist eigentlich nötig um einen tatsächlichen Produktivitätszuwachs zu realisieren.",
            "Habe das in verschiedenen Kategorien. Aber ja, Renten sind ein großer Teil des Portfolios (Gesetzlich, Netto-Riester-Police und Betriebsrente) und sichern hoffentlich den Basisbedarf, daher gibts in Schicht 3 eine hohe Aktienquote😊. Rentenpunkt Kurs steht bei mir seit 01.01.2024 übrigens bei 8436€. Aber sehr schwer zu vergleichen. Renten haben einen deutlich größeren Steuerabzug usw…",
            "sehr interessant. Der Artikel gibt Erklärungen über die Anreize, warum Menschen Vermögen aufbauen und warum Vermögensverteilung als Metrik für soziale Gerechtigkeit nur begrenzt zu gebrauchen ist. Nur was meintest du mit den Zahlungsströmen? Ich hatte gedacht, dass an der Zahl „Vermögensverteilung“ statistisch getrickst wurde. Vielleicht habe ich deine Aussage aber einfach nur falsch verstanden.",
            "Häh? Wie viel Vermögen sollte es denn sonst sein?\nWenn ich meine letzten 100Euro für ein EM-ticket ausgebe ist mein Vermögen auch 0€, auch wenn ich in einem 300Mio Euro Stadion stehe...\nOder geht's dir darum, dass die zu zahlenden Zinsen anscheinend in den Schulden schon berücksichtigt wurden, obwohl die faktisch noch nicht angefallen sind...das wäre tatsächlich etwas schief.",
            "ist trotzdem eine relativ gute Abschätzung. Bei Auflösung sind bei PVs erhebliche Abschläge üblich, vererbbar sind viele auch nicht. PVs haben kostentechnisch eher leichte Nachteile ggüber staatlicher RV (wg. Rückzahlbarkeit z.B.), insofern stellt ihre Kapitalbewertung eine untere Grenze zur Bewertung von Rentenpunkten dar.\n\nBeispiel HUK\n\nRentenbeginn 2035\n\nRente 1300 monatlich\n\nKapital 320000 euro\n\n  \n(Ist alles in 2035 Euro muss man inflations-adjustieren)\n\nDas heisst eine relativ mickrige Rente (1300 € in 2035 \\~ 1025 € heute bei 2% infla) entspricht 2035 \\*mindestens\\* einem Kapitalwert von 320 000 Euro (=252000 Euros heute).",
            "Ja und?? Wenn du 10.000 vererbst sind die auch irgendwann aufgebraucht.",
            "Nein, bist du nicht. Du hast einen Versicherungsanspruch, von dem du nicht weißt, in welcher Höhe er bedient wird. Niemand erwirbt Anteile an der BRD. Wär das so, wären diese Teile vererbbar.",
            "Was bei den Renten gegeben sein sollte",
            "Alles was leicht über der Inflation ist, entspricht Realrendite.\n\nWas willst du mir sagen?",
            "Hatte ich mir auch schon überlegt, daher die gezielte Nachfrage. Muss ich mal drauf rumdenken, danke :D",
            "Ja, alle Zinsen werden da schon abgezogen, jedoch nicht das zukünftige Einkommen, auch wenn man Beamter ist und somit ein sicheres Einkommen hat. Man kann also doch ganz gut Leben, obwohl man laut Oxfam kein Vermögen hat. Daher ist die Statistik irreführend.",
            "Das es noch vererbbar oder handelbar ist unterscheidet es selbstverständlich von echten Besitz.\n\n\nAber die Höhe weiß man schon Recht zuverlässig. Weil die im wesentlichen an das Volkseinkommen gekoppelt ist. Im Jahr der Auszahlung kann man also etwa mit Bruttoeinkommen aller Beitragszahler (Volkseinkommen minus Ausnahmen) mal 18,6% geteilt durch alle Anteile (Beitragspunkte aller Rentner in dem Jahr) Mal eigene Anteile (aka Beitragspunkte) rechnen.\n\n\nWie sicher das ist hängt natürlich von der Rechtssicherheit und Stabilität im Land ab. Aber das ist jetzt bei anderen Anlagen nicht anders.\n\n\nDas jetzt alle rumjammern dass das zu wenig ist und die Politik Wählergeschenke an die Rentner macht ist bisschen eine andere Debatte.",
            "Hast du eine Quelle dazu? In dem von dir verlinkten Beitrag wurde nur der Fall beschrieben, dass der Kredit höher sein kann als die Bewertung der Immobilie (z.B vor dem Platzen einer Immobilienblase gekauft)",
            "Nein, die Höhe ist nicht zuverlässig. Schau nur mal auf deine jährliche Rentenauskunft und du wirst einen Eindruck erhalten, wie unterschiedlich die Ergebnisse sind, je nachdem wie die Rentenanpassungen verlaufen. Beachtest du noch die prognostizierte Kostenexplosion im Bereich Altersversorgung, sollte dir klar werden, dass es ohne Kürzungen der Versorgungsansprüche nicht gehen wird. \n\nGlobale Anlageformen hängen nicht von einem einzelnen Land ab.\n\nUm es dir nochmal ganz klar zu sagen: Du erwirbst bei einem Anwartschaftsmodell keine Anteile an einem Unternehmen oder ähnlichem. Du erwirbst eine Zusage auf eine Leistung, deren Höhe nicht vertraglich festgesetzt ist. Sie wird lediglich prognostiziert",
            "Na ja, wenn man das zukünftige Vermögen mit einbeziehen würde, wäre das bei einem Normalverdiener schon eine Million oder mehr und dann sähe es gar nicht mehr so schlecht aus. \n\nIch habe zu dem Thema noch eine Kritik aus dem Jahr 2015 gefunden, aber ich konnte das nur überfliegen:  \n[https://www.agenda-austria.at/wp-content/uploads/2018/04/aa-oxfam-methode.pdf](https://www.agenda-austria.at/wp-content/uploads/2018/04/aa-oxfam-methode.pdf)"
        ]
    },
    "Was ist eure Meinung zur vorgeschlagenen Deutschland- Rente ?": {
        "title": "Was ist eure Meinung zur vorgeschlagenen Deutschland- Rente ?",
        "score": 47,
        "url": "https://www.reddit.com/r/Finanzen/comments/1dlpamx/was_ist_eure_meinung_zur_vorgeschlagenen/",
        "content": "https://finanzen.hessen.de/Initiativen/Deutschland-Rente\n\nWäre dies ein sinnhaftes System und wie würde man den Teil abdecken der bisher nicht vorgesorgt hätte.\n\nMich interessieren eure Meinungen.\n\nSchönen tach ",
        "num_comments": 128,
        "comments": [
            "Riester verpflichtend? Das ist ja wohl das letzte…",
            "Edit: Hab mal ins Konzeptpapier geschaut \n\n\"Der Arbeitgeber ist verpflichtet, für jeden seiner Arbeitnehmer einen gesetzlich festgelegten \r\nBeitrag vom „Nettolohn“ in ein Riesterprodukt eines privaten Anbieters oder des Deutsch-\r\nlandfonds einzuzahlen.\"\n\nSo ein Murks. \n\nOriginalbeitrag:\n\nNaja, wird das opt-out gespart indem ein Teil meiner jetzigen Rentenzahlungen verwendet wird oder kommt das oben drauf? Wenn ersteres können die das ruhig machen. \n\nAm Ende geht das ganze Geld dann nur in ESG Fonds Dax und damit wird die Performance eher meh. Und dem Staat trau ich auch zu den Fonds irgendwann mal zu plündern.\n\nLetztendlich ist die absolut einfachste Lösung Aktienverkäufe nach 10 Jahren Haltedauer steuerfrei zu stellen und das beim Michel fleißig zu bewerben.",
            "Ich verstehe nicht warum wir immer einen deutschen Sonderweg gehen müssen wenn viele andere Ländern doch bereits gerzeigt haben wie es geht:\n\n* Jeder bekommt automatisch und kostenlos ein Depot bei der deutschen Rentenversicherung.\n* Teile vom Gehalt oder Arbeitnehmeraktien können steuerfrei ins Depot überwiesen werden.\n* Dividenden oder realisierte Gewinne werden automatisch reinvestiert.\n* Es gibt ein standard Fond/ETF der bespart wird (heiliger Gral). Es dürfen aber andere zertifizierte Fonds bespart werden.\n* Geld wird erst beim Abfluss aus dem Depot versteuert.\n\nGute Rendite, geringe Kosten, keine Querfinanzierung der lokalen Versicherungsindustrie.",
            "Warum nicht einfach Roth IRA oder 401k?",
            "Dieses ganze Rententhema in DE ist einfach nur noch unverschämt. Lasst mich Betrag x (10000€/a) Brutto in einen ETF MEINER Wahl stecken und fertig. Dieser ganze Mist von dem nur wieder neue Beamtenstellen geschaffen werden sollen, ist so respektlos. Was von sozialer Gerechtigkeit und armen Rentnern erzählen aber es den Arbeitern nicht mal erlauben von ihren Bruttolohn was für das Alter zurückzulegen, Beamten aber mehr Rente lassen als viele nicht mal zu Lebzeiten haben. \n\nWir wissen doch alle was am Ende kommt: Du darfst 1000€/a steuerbegünstigt in einen All Green DE ETF stecken, der min. 50% Frauenquote braucht, keine Geschäfte mit dem Ausland macht und Du darfst ab ca. 80 Jahren dann jährlich 200€ entnehmen. ",
            "Warum machen die nicht einfach einen 401k? Fertig. \n\nDas Grundproblem ist doch, dass der Generationenvertrag idiotisch ist und keiner Vermögen, oder Rentenansprüche selbst aufbaut um den Ruhestand zu managen. Irgendwie soll alles vom Vater Staat kommen. Der sich nicht zu helfen weiß und die Banken und Versicherungen das irgendwie machen lassen möchte mit den alten Kackprodukten, wie Riester.",
            "Rechnen wir mal:\n- Rentner im Umlagesystem (war einfach nicht gut zu verkaufen, dass es erst Rente gab, nachdem eingezahlt wurde)\n- Rente im Ansparsystem 25% von 45.000 Euro über 45 Jahre 506.200 Euro Kapital ohne Zinsen mit Zinsen etwa \n€1.211.650,03 - €5.326.338,13\n=>4000-8600 Euro mtl. bei 4% ohne Kapitalabbau\n(je nach Inflation kann man davon leben etwa ÷4 heutiger Wert von 1000-2000 Euro könnte man leben)\n\n=> wie soll man aber 25% ansparen, wenn man noch die Rentner aus dem Umlagesystem finanzieren soll? Deutschland hätte genug Zeit gehabt, die Umlage aus den 60ern mit Kapital zu unterdecken und merkt es erst jetzt\n=> dann wurden noch Mindestrenten eingeführt, um die Sozialhilfe zu entlasten immer schön auf den Rücken der Beitragszahler.\n=> klar mussten die Rentner in der Nachkriegszeit irgendwie finanziert werden aber die langfristige Entwicklung war schon immer klar und die Sozialhilfe der Kommunen hätte diese Menschen nicht auffangen können ABER warum fällt dies erst jetzt auf?\n\nDie Idee ist, dass jeweils die neue Generation doppelt zahlt und privat vorsorgt, damit man die staatliche Rente, die diese auch eingezahlt haben, streichen kann. Probiert aktuell GB mit Rentnern aus, die im Ausland leben. Das geht jetzt seit 30 Jahren so und keine Generation will sich verarschen lassen und doppelt zahlen. Irgendwann muss sich eine ganze Generation finden, die sich so übern Tisch ziehen lässt.",
            "Wenn der Staat jedoch entscheidet, in welche Unternehmen der Deutschlandfonds investiert, könnte das wieder eine politische Sache werden. Da besteht die Gefahr, dass die Investitionen im Einklang mit der Politik stehen sollen. Also nicht, was schlecht für das Klima ist und keine Unternehmen in \"bösen\" Staaten.",
            "Ich bin vom Hochhaus gesprungen. Anfangs war alles super. Jetzt kommt der blöde Biden (Boden, natürlich , Autokorrektur…, fands aber lustig) total schnell näher. \n\n Was ist Eure Meinung zum Vorschlag einen Fallschirm zu häkeln und welche Farbe sollte er haben?",
            "Riester und Rürup sind selbst für Laien als absolute Subventionsmechanismen der ansonsten Nullsummenspieleneden Versicherungen erkennbar. \n\n\nDieser Vorschlag ist nichts anderes als auf die Bruttolohnumlage (die defakto einem gigantischen nie endenden Steuergeschenk an die Versicherungen entspricht) noch gesetzlichen Zwang zur Einzahlung zu packen. \n\n\nDas wären dann ja wirklich langsam Bananenrepublik Zustände. Da sind chinesische Staatskonzerne ja lupenreine freie Marktwirtschaft im Gegensatz zu deutschen Versicherungen...",
            "Das Rentenproblem ist halt sehr kompliziert. Wie bereits erwähnt wurde wäre für viele eine Steuerfreiheit von Aktien/ETF (geknüpft an Bedingungen wie zum Beispiel Rentenalter, oder mind. 20 Jahre bespart o.ä) die einfachste Lösung - neben bAV. \nKann natürlich nicht jeder aber im niedrigeren Einkommensbereich kann sich die Riester lohnen.",
            "Nein, der Staat bekommt von mir nicht noch mehr Geld, dass er mir mit schlechtem Faktor verrentet.",
            "Meine Zusammenfassung nach Querlesen des Papiers:\n\n* Riester 2.0: selbe Beitragshöhe, selbe Zulagen, selber Modus für die Steuer [reduziert nur Steuern, nicht KV-Beitrage (anders als bAV)]\n\n* muss vom AG angeboten werden im Opt-Out-Modell, zusätzlich zu eventueller bAV\n\n* wird vom Lohn einbehalten, Abrechnung und Boni vollautomatisch, d.h. kein Papierkram für den AN\n\n* Invest in \"Deutschlandfonds\" oder andere Fonds nach Wahl des AN\n\n* Wichtigster Punkt: zumindest optional Wegfall der Beitragsgarantie, dem Haupthindernis für Riester-Renditen\n\n* Vermutlich auch Wegfall der hohen Kosten von Versicherungen und deren Vertretern, da staatlich gemanaged\n\n* Risikoreichere Anlageoptionen auch in der Rentenphase, inkl. Möglichkeit der Schwankungen der Rentenzahlungen\n\n\nMeine Einschätzung: wenn das alles so kommt, kann es das erste Produkt sein, bei dem sich die Steuerstundung tatsächlich lohnt und nicht durch Kosten aufgefressen wird. Ich wäre dabei!",
            "Schön mit meinem Geld die Versicherungswirtschaft noch fetter machen. Kotzt mich jetzt schon, was ich den alles in den Rachen werfe, diesen Drecksvereinen",
            "Absolut dagegen. Zwangs-Riester wird nicht die Lösung sein, genau so wenig wie jeder Ansatz der \"mehr Staat\" enthält. Staat und Kirche können nicht mit Geld umgehen, darum brauchen sie ja immer mehr davon.\n\nDie einzige Lösung die es für das Rentendebakel geben kann, ist eine die allen weh tut. Und darum wird das auch nicht passieren. Ich predige seit Jahren, das wir aus der Nummer nur rauskommen wenn wir das Verhältnis von staatlicher zu privater Vorsorge langsam aber sicher umkehren, ähnlich wie bei einem Annuitätendarlehen, das viele ja aus ihrer Hausfinanzierung kennen: [Annuitätendarlehen erklärt](https://bwl-wissen.net/definition/annuitaetendarlehen)\n\nAls Sofortmaßnahme müssen die Boomer auf einen Teil ihrer staatlichen Rente verzichten. Sie haben die Scheisse gebaut und immer weiter die gewählt die nichts ändern wollten, sie haben keine Kinder bekommen. Dann darf man die Suppe jetzt auch mit auslöffeln. Für den Start schafft man so Spielraum, das die Jahrgänge die jetzt noch relativ weit von der Rente weg sind (>20 Jahre), anfangen können wenigstens 10-15% ihrer Altersvorsorge selber aufzubauen. Über 30 Jahre verschiebt man das Verhältnis von Privat zu Staat dann ähnlich wie bei der Annuität Zins zu Tilgung und phast dieses Schneeballsystem aus.\n\nUm das attraktiv zu gestalten, muss der Arbeitnehmer, ähnlich wie in den USA der 401k oder Roth IRA, die Möglichkeit bekommen steuerfrei einen Teil seines Lohns in eine private Vorsorge stecken zu können.",
            "habe 'opt-out' gesehen. bin raus. faellt mir nicht mal im traum ein.\n\nwenn ich schon 'zertifizierte' bla bla hoere, ist klar, dass das nur muell sein kann.\n\ngebt mir doch einfach meine rv-beitraege zurueck, nehmt diese witz-punkte zurueck, und ich kuemmere mich selbst drum. \n\ndann habe ich wenigstens eine chance.",
            "Absoluter Quark. Wo ist der Benefit? CL hat angekündigt, dass nach dem Sommer steuervergünstigt in ETFs gespart werden kann. Da brauch ich mich nicht auf einen Deutschlandfond limitieren. \n\nHier sollen wieder staatliche Stellen geschaffen werden, die dann den Deutschlandfond und das ganze Opt-out Konstrukt überwachen, welches am besten nur wirklich funktioniert, wenn man den Nachweis für Alternative Vorsorge erbringt, was wiederum kontrolliert werden muss. Arbeitsbeschaffung für Behörden.\n\nEs gibt eine ganz simple Lösung. Ab welcher Kapitalhöhe kann man mit einer armutsfesten Rente aus Kapitalerträgen hoffen? Wie viel braucht es da pro Monat Einzahlung, hochgerechnet mit Hilfe der Regelarbeitsjahre -> Dieser Betrag geht, wenn man will, auf ein Konto, über dessen Renditen man erst mit Überschreiten des Regeleintrittsalter der Rente verfügt. Monatliche Auszahlung ist auf die vorherige monatliche Einzahlung begrenzt. Das sind drei Schrauben: Steuerfreibetrag, Kontosperre und Auszahlungshöhe. Wenn man stirbt, gibts das Kapital direkt auf das Konto für die Altersvorsorge der Kinder, die dann erst mit den Rente drüber verfügen. Wenn das Konto bereits über gedeckt ist, gehts an den Staat. Ich will aber gar nicht wissen, welche 100 Gesetz genau gegen einfache Lösungen sprechen...",
            "Ich finde das Konzept echt super, ich hätte mir eine noch einfachere Lösung gewünscht. Was richtig ist, ist dass man sowas als Widerspruchslösung implementieren sollte weil die Leute einfach dumm und vor allem faul sind (das senkt die Vertriebskosten). Aber noch besser wäre es, wenn es für geringe Einkommen verpflichtend wäre weil momentan riestern ja vor allem Geringverdiener nicht weil die sich eh auf den Staat im Alter verlassen.\n\nDann ist natürlich das ganze Riester-Produkt komplett fehlkonstruiert und das sollte man vollständig beerdigen anstatt es als Wahlmöglichkeit weiterzuführen aber immerhin sieht der Entwurf ja die Wahlmöglichkeit vor. \nDer Deutschland-Fonds an sich, so wie im Papier beschrieben, klingt richtig gut zumal ja auf Wettbewerb gesetzt werden soll. Auch die Wahlmöglichkeit bei Garantien ist ein wichtiger Fortschritt, wenn auch ich mir ein komplettes Garantieverbot gewünscht hätte (es macht einfach null Sinn). \n\nWas ich mir gewünscht hätte:\n1. Jedes neue oder bestehende Depot kann, falls der Kunde es wünscht, zu einem \"gesperrten\" Altersvorsorge-Depot umgestellt werden. Alle Gewinne im Altersversorge-Depot sind in der Auszahlphase steuerfrei oder können zum Erwerb einer ersten und eigengenutzen Immobilie verwendet werden (diese Immobilie muss natürlich geeignet sein darin selbst zu leben und darf nicht alleine dazu dienen an das Geld zu kommen). Vorher auszahlen geht nicht. Dadurch, dass jedes Depot umgestellt werden kann, soll verhindert werden, dass die Depotanbieter bei Gebühren abzocken.\n2. Der Rentenbeitrag wird um bspw. 5% erhöht, wobei der Arbeitgeber dieses zusätzliche Geld für seine Angestellten in so ein gesperrtes Depot einzahlen muss. Wählt ein Arbeitnehmer (oder Selbständiger) kein solches Depot aus, gehen die 5% an die gesetzliche Rentenkasse und sind für ihn persönlich verloren weil ein bisschen Selbstverantwortung muss sein und die Leute sollen sich aktiv mit dem Thema beschäftigen, auf dem Lohnzettel würde ich das dann als \"Deppenabzug\" aufführen.\n3. Der Arbeitnehmer kann sein Geld in alles investieren was es an der Börse gibt aber er muss einen entsprechend berechneten Diversifikationswert erfüllen. Bspw. mindestens in drei Asset-Klassen oder 10 verschiedene Einzelinvestments oder entsprechende ETFs. Um Markettiming oder sonstige wilde Wetten zu verhindern, ist je Investition eine Mindesthaltedauer zu beachten.\n4. Wählt der Arbeitnehmer keine Produkte aus, wird das Geld in einen breiten staatlichen quasi-ETF, einen staatlichen aber von der Politik möglichst unabhängigen Risikokapitalfonds mit Fokus deutsche Technologie-Start-Ups sowie einen staatlichen Wohnungsbau-& Erneuerbare Energien Projektentwickler angelegt. Diese Fonds haben das Ziel möglichst geringe Verwaltungskosten zu bieten und gleichzeitig das Geld sowohl sinnvoll als auch möglichst breit gestreut in renditestarke Projekte innerhalb Deutschlands zu investieren.\n5. In der Auszahlphase kann man einen automatischen Auszahlplan erstellen lassen, wobei bspw. max(7%, Depotwert/(Lebenserwartung-Alter)) des Depotwerts jährlich ausgezahlt werden kann.\n6. Stirbt man, geht das angesparte Geld nicht direkt zu den Angehörigen, sondern stützt die gesetzliche Rente bzw. geht in das entsprechende gesperrte Depot der Angehörigen.\n7. Gutverdiener oder Vermögende, die nachweisen können, dass sie im Alter nie auf staatliche Leistungen angewiesen sein werden, können sich auf Wunsch von diesem System befreien.",
            "Hört sich sehr unflexibel an, soll das ein Riester 2.0 werden? Geschätzte Kosten von 0, 5 % Naja, \nRein von der Namensgebung müsste das ja wohl die Hofmann-Rente sein. Übernehmt doch einfach die Idee des Österreichischen Rentensystem und gut ist.",
            "Warum nicht einfach Rente als das, was man mit den eigenen Beiträgen angespart hat, Bürgergeld für alle, wo es nicht reicht. Schrittweiser Übergang. Aktienquote und worin investiert wird variabel wählbar, so dass aber immer ein sicherer Sockelbetrag von x% des Bürgergelds bleibt. Private Vorsorge über Investition in dasselbe Rentenportfolio.",
            "5 Jahre maximal dann ist der Großteil des Geldes futsch, niemand ist Haftbar und um den Schaden zu beheben buttern wir einfach neues Steuergeld in die scheiße.",
            "... hat der Staat - und bitte ich will hier nicht falsch verstaden werden, so in Richtung Neoliberalsimus etc., hat er je bewiesen, mit Geld vernünftig umgehen zu können? In den 1980er Jahren - ja auch hier, verschont mich jetzt bitte mit blöden Anmerkungen, über die Zeit ... erst bitte lesen, förderte der Staat mit Blick auf die desaströse Erwartung der Rentenentwicklung (Zahler/Empfänger) durch steuerliche Vorteile, die Bildung von Vermögen in Form von Lebensversicherungen zur Verrentung. Genau das also, was Hessen jetzt vorschlägt. Diese sollten die staatliche Rente ergänzen und die anbietenden Versicherer musten strenge Auflagen in Punkto Sicherheit des (Grund-)Kapitals nachweisen (Anteil festverzinst zu ETF etc.) Für die grossen Konzerne ist das kein Problem und das waren zum Teil richtig gute Produkte - sicher hier bitte immer auf \"Strecke\" gesehen. Dann änderte man in Berlin aber wieder die Richtung weil man sich ausrechnete, wieviel Steuern da zukünftig flöten gehen werden, denn die Erträge/Renten, waren steuerfrei. ... und schwups zurück, so dass sich diese Verträge ab Mitte 2005 neu abzuschliessen, für viele nicht lohnten. Leider sind wir auch nicht Norwegen, die einen grossen Teil ihrer Öl- und Gasgewinne in ihren Staatsfonds packen konnten ... was bleibt: eine Mischung aus einer Basisrente und eben einer geförderten (steuerlich und durch evtl Zuschüsse) eigengesteuerte Vorsorge verschiedener Modelle. Wer also am Kapitalmarkt Geld macht und das nachweisslich für sein Alter zurücklegt, soll davon keine Steuern zahlen müssen. Wer in Lebensversicherungen geht, die eindeutig zur Altersicherung dienen, ebenfalls ... einfach mal den Möglichkeiten lauf lassen.",
            "Es ist der erste Vorschlag der absolut sinnvoll werden kann. Wirkt wie das schwedische Modell. Ein Teil der Rente Beiträge ist damit nicht mehr Umlage, sondern Individual.",
            "Auch wenn es mir persönliche Vorteile bringen würde, bin ich generell dagegen, Auslandsinvestitionen in irgendeiner Weise staatlich zu fördern oder steuerlich zu begünstigen.\n\nEinen staatlichen Deutschlandfonds, der eine simple und steuerlich begünstigte Möglichkeit zur privaten Altersvorsorge darstellt, finde grundsätzlich sehr gut. Aber ob das Produkt am Ende etwas taugt, wird stark von der konkreten Ausgestaltung abhängen.",
            "Das klingt jetzt so blöd, aber die da oben denken doch wirklich man ist komplett dumm. ",
            "Steht da nicht man kann widersprechen?",
            "Warum sie das ganze noch Riester nennen wollen muss man nicht verstehen. Wahrscheinlich damit die aktuellen Zulagen bestehen bleiben.\nEffektiv ist es aber ohne Abschlusskosten und Beitragsgarantie in der Anspar- und Entnahmephase ein komplett anderes Produkt.\n\nDass der Deutschlandfonds in der Performance stark vom MSCI World abweicht kann ich mir nicht vorstellen.\n\nIch halte von den Bruttobasierten Rentenprodukten aber nicht viel.\nIch bin immer noch für ein Altersvorsorgedepot das aus dem Netto bespart wird und dann ab 65 Jahren eine steuerfrei Entnahme zulässt.\n\nWenn man das Geld vorher entnehmen muss/will, zahlt man halt regulär Abgeltungssteuer auf die Gewinne mit ggf. einer Ausnahme für den ersten Hauskauf.",
            ">\"Der Arbeitgeber ist verpflichtet, für jeden seiner Arbeitnehmer einen gesetzlich festgelegten Beitrag vom „Nettolohn“ in ein Riesterprodukt eines privaten Anbieters oder des Deutsch- landfonds einzuzahlen.\"\n\nWieso Netto? Ist Riester nicht immer Brutto? Ist das hier dann Zwangsriester in extra schlecht?",
            "\"Letztendlich ist die absolut einfachste Lösung Aktienverkäufe nach 10 Jahren Haltedauer steuerfrei zu stellen und das beim Michel fleißig zu bewerben.\"\n\nDie Politik ist überhaupt nicht daran interessiert, dass die Leute unabhängig vom Staat sind.",
            "Steuern auf Kapitalerträge sollten eh erst ab einer eher hohen Summe X anfallen, imho. Man trägt als privater kleiner Investor das komplette Risiko, wenn man was verliert ist das Pech, wenn man gewinnt hält Vater Staat die Hand auf. So geht's eigentlich nicht. Das Risiko wird nicht ausreichend berücksichtigt und es motiviert auch nicht sonderlich, wenn man für vernünftiges Vorsorgen so heftig besteuert wird.",
            "Haben in Österreich schon sowas Ähnliches mit Abfertigung neu. Die Originale wurde mit 6% Rendite beworben, ansonsten muss der Arbeitgeber nachschießen, wurde dann auf 2% gesenkt, und dann auf 0% ...\n\nDie 0% muss jetzt auch die Bank garantieren, wird also nur noch in Anleihen investiert...",
            "Wer soll dann die Rentner bezahlen, die heute schon in Rente sind => oben drauf ... bitte 37,2 Prozent für Rente abdrücken",
            "Du MUSST die Leute auf breiter Ebene zum Sparen zwingen. Finanzen ist eine Bubble, der Ottonormal wird trotzdem nicht weiter sparen, auch wenn steuerfrei. \n\nDie Schweiz macht das schon lange mit ihrer zweiten Säule",
            ">Letztendlich ist die absolut einfachste Lösung Aktienverkäufe nach 10 Jahren Haltedauer steuerfrei zu stellen und das beim Michel fleißig zu bewerben.\n\nLeg doch ein mindestalter drauf, ggf. mit Branchenbedingten härtefalllösungen Branchenbezogen anders. Die 40 jährigen Krypto-Frührentner muss man jetzt nicht unbedingt subventionieren.",
            ">Letztendlich ist die absolut einfachste Lösung Aktienverkäufe nach 10 Jahren Haltedauer steuerfrei zu stellen und das beim Michel fleißig zu bewerben.\n\nDarüber würde man sich hier im Sub zwar freuen, aber dass das irgendwas an der Rentenproblematik verbessern würde glaube ich keine Sekunde. Die Leute schreien gerne nach mehr Freiheit, wüssten aber gar nicht was sie damit anfangen sollten, wenn sie sie denn bekämen.\n\nWas tut der Michel denn mit den 10 Jahren Spekulationsfrist auf Aktien? Sinnvoll für das Alter vorsorgen, weltweit gestreut und kostengünstig? Das glaube ich nicht. Der steckt alles in seine Lieblingsautomarke, natürlich eine deutsche. Ist ja klar, denn wir vertrauen nur uns selbst.\n\nIm Zweifelsfall ist es besser, der Michel lässt seine Rücklagen für 2% Zinsen auf dem Tagesgeld verschimmeln und hat später wenigstens noch ein bisschen was, als dass er vorher alles verzockt nur weil er FOMO auf die Spekulationsfrist hat.",
            "Wie wäre es mit armutsfesten löhnen? Der boomer Knick in der Rente wird sich nach ein paar Jahren \"erledigt haben\"",
            "Wie zahlst du die rente der leute die in etfs gezahlt haben welche eingegracht sind? Wie zahlst du die rente von den leuten die grad in ner Rezension auszahlen müssen? Was mit denen die zu wenig einzahlen konnten? Alles grundsicherung über steuern?",
            "Was genau ist an diesem Vorschlag jetzt so anders?\n\n* Ok, es gibt einen Opt-Out, aber sonst kriegst du da ein Depot\n\n* Dein AG führt das ab aus deinem Gehalt\n\n* Reinvestition wird vermutlich auch durchgeführt\n\n* Standardfonds gibt es (\"Deutschlandfonds\"), andere sind wählbar\n\n* Nachgelagerte Besteuerung",
            "Deutschland braucht immer was eigenes was bestimmt viel komplizierter und am Ende weniger bei rauskommt für den Bürger.",
            "Weil da die Gebühren für die Anleger geringer sind und denk doch mal bitte an die armen Versicherungen!",
            "Unabhängigkeit von Staat und die Politiker geben der Versicherungsbranche keine Gegenleistung für deren ~~Bestechungsgelder~~ Lobbyarbeit? Unvorstellbar",
            "Eine riesige korrumpierte Landschaft ist das hier. Versicherungen sind meine Erzfeinde",
            "Nicht mit deutschen Gesetzen kompatibel. [info](https://www.bundestag.de/resource/blob/658218/b9f1b7268ab90163f5170c9b13e4704a/WD-6-102-19-pdf-data.pdf) (pdf)",
            "Weil die deutsche Seele im Schnitt vom Staat entmündigt werden möchte 🤮",
            "Ich finde das System in den USA auch nicht wirklich nachahmenswert. Das krankt doch an ähnlichen Problemen wie das deutsche Riester-System, nur ohne Garantie und selbstverwaltet. Aber im Prinzip sind die Kosten höher als sie sein müssen, die Bürokratie ebenso und dann noch das größte Problem, dass die meisten Leute zu faul sind sowas zu machen. Nur 25% der Amis haben sowas und von denen verbrennt sich dann die Hälfte nochmal die Finger durch wilde Spekulationen...",
            "Da die Altersarmut in den USA höher ist als in Deutschland scheint das nicht besonders gut zu funktionieren.",
            "Genau so wird es kommen. Bei uns kann nur so eine politisch gesteuerte Variante herauskommen, bei der zu allerletzt an die tatsächliche Alterssicherung gedacht wird.",
            "So ist es. Ich wünschte ich würde es noch wiederfinden, aber es gab vor ca. 2 Jahren oder so mal ein offizielles Papier irgendeines Bundesministeriums, in dem man die Situation zur Altersvorsorge analysiert hat. Und da stand zum Thema \"Warum machen wir es nicht wie die Amerikaner, 401K und Roth IRA?\" drin, diese Konzepte seien für die deutsche Gesellschaft aus Gründen unterschiedlicher Mentalität nicht geeignet. Ich bekomme es nicht mehr im Wortlaut zusammen, aber sinngemäß stand das da so. Das sei halt einfach nix für uns.\n\nDas kursierte damals auch hier im Sub und wurde viel diskutiert.",
            ">Du darfst ab ca. 80 Jahren dann jährlich 200€ entnehmen. \n\nAlso das mit der geringen Rendite wär mir ja egal, aber 200€ am Tag wäre mir persönlich zu wenig.",
            "Das mit green bla bla halte ich nicht für das Problem.\n\n\nProblem ist dass da sicher wieder eine garantierte lebenslange Rente dran hängt. \n\n\nDie macht JEDES Produkt unattraktiv. Der Versicherer weiß heute noch nicht wie die Lebenserwartung bei  meinem Renten Eintritt ist und das zins Umfeld. \n\n\nAlso schafft er Produkte die jeden Fall abdecken und damit untransparent werden. ",
            "Die Tatsache, dass uns der Staat nicht mal 10k€/a steuerlich für die Altersvorsorge begünstigt, sagt eigentlich alles. Beamte haben mehr Netto Pension als manche im Leben, aber der Arbeiter soll lieber zum Amt gehen und dann aufstocken, nur keine eigene begünstigte Vorsorge. Man kann mir echt nicht erzählen, dass DE wirklich will dass Rentner vorsorgen, die machen alles dafür dass es so unattraktiv wie möglich ist ",
            "Das Grundproblem ist die nicht vorhandene finanzielle Bildung der Menschen.\nAlle wollen Geld, alle brauchen Geld, aber niemand interessiert sich für Geld.",
            "> Irgendwann muss sich eine ganze Generation finden, die sich so übern Tisch ziehen lässt.<\n\nIch denke mit den Millennials und Gen-Z wurden diese Generationen gefunden. Wir haben halt nicht genug Stimmen um uns zu wehren.",
            "Genauso wird’s kommen. Ist der nächste Topf den die Regierung alle 4 Jahre für ihre Zwecke missbrauchen kann. Dann wird halt im Zweifel einmal komplett in nachhaltige Unternehmen geschichtet. Nach weiteren vier Jahren dann wieder in irgendwelche DAX Konzerne.",
            "Am Ende habe ich weniger Netto übrig, um in ein subpares Produkt einzuzahlen über dessen Anlagestrategie ich keinerlei Kontrolle habe.",
            "Steuerfrei und vorallem Pfändungs und Arbeitslosengeld Sicher.",
            ">CL hat angekündigt, dass nach dem Sommer steuervergünstigt in ETFs gespart werden kann.\n\nGibt's da schon was neues zu? Mein letzter Stand waren höchstens 2100€ pro Jahr, und das ist für unsere Bubble hier ja eher wenig...",
            ">CL hat angekündigt...\n\n[Schon immer ein Blender wie aus dem Bilderbuch](https://www.youtube.com/watch?v=w0rL6Ju9H2Q)",
            "Das, was CL angekündigt hat, glaub ich erst, wenn ich es dann wirklich sehe.\n\nIch kann mir nicht vorstellen, dass unser Staat auf soviel Geld verzichtet, nicht in unserer Lage.",
            "Bürgergeld für alle ist eine interessante Idee, wenn man bedenkt, dass wenn alle beziehen, keiner da ist, der bezahlt.",
            "Wieso soll das Geld futsch sein? Den Kenfo gibt es schon und der hat die Zeit überlebt.",
            "Wegen der Zockerei am Aktienmarkt, Telekom, Manfred Krug, Oma Erna, Casino, Ostküstenhochfinanz, blablabla",
            "Naja der Sinn von diversifikation ist ja unabhängig zu sein. Was passiert, wenn es in DE mal schlecht läuft? Nicht nur, dass dann die Wirtschaft leidet, nein dann kackt auch noch dein über 30 Jahre angesparter Fond ab. Geil. Ich würde niemals nur in einen DE Fond investieren, noch nicht mal mehr in einen EU Fond, dazu haben wir uns selbst viel zu lange vom technologischen Fortschritt abgehalten und die EU macht alles, damit es auch ja weiterhin hier keine Innovationen in dieser Richtung geben wird. Und die sollen dann mein Geld vermehren?",
            ">Dass der Deutschlandfonds in der Performance stark vom MSCI World abweicht kann ich mir nicht vorstellen.\n\nEs besteht immer die Gefahr, dass man das mit politischen Zielen verknüpft, z. B. nur deutsche Aktien kaufen um die deutsche Wirtschaft zu stützen, in Firmen investieren, die der Regierung grade gefallen, oder zig Firmen ausschließen will.",
            "Jetzt weißt du warum es überhaupt zum Thema wird: jemand anderes kann daran verdienen",
            "Frag mich nicht. Wahrscheinlich wurde irgendwas von Reichen mit 65.000 Euro Einkommen im Jahr genuschelt, die ja besser gestellt werden könnten.",
            "Nein, Riester ist natürlich auch vom netto. Allerdings kann man es bei der Steuererklärung angeben.",
            "*und die Versicherungslobby",
            ">Die Politik ist überhaupt nicht daran interessiert, dass die Leute unabhängig vom Staat sind.\n\nGenau, denn das wirkt UnSoLiDaRiScH ggü. denjenigen, die es nicht schaffen können, sich vom Staat unabhängig zu werden.",
            "Stimme dir im Kern zu, aber ganz so ist es nicht. Die Verluste werden verrechnet. Du musst nur Kapitalertragssteuer zahlen, wenn du im Jahr einschl. der Verlustverrechnung Gewinne gemacht hast. Zudem muss der Gewinn über dem Freibetrag liegen.",
            "Wegen genau dieser Argumentation gibt es in der Schweiz keine Kapitaletragssteuer auf Kursgewinne und nur auf Dividende.",
            "Der Staat zahlt mit unseren abgaben so einiges was wir Bürger sinnlos finden und dann ist das Geld weg und die Hände wieder aufgehalten… Ich hasse unsere Politik dafür denn es gibt NIE etwas zurück",
            "Die 40 jährigen Krypto Frührentner sind nach einem Jahr haltefrist schon steuerbefreit, da die Verkäufe als privates Veräußerungsgeschäft gelten und deshalb nur die Spekulationsfrist greift.",
            "Lass doch erstmal mit einer sinnvollen Basislösung anfangen, die 99% schon abdeckt, und dann über Sonderfälle reden.\n\nDiese ewige \"und da muss noch eine Sonderschleife rangemacht werde\" führt genau da dazu, dass nichts passiert.",
            "Wenn sie das Geld in ein Auto stecken wollen, dann steht ihnen das frei. Nennt sich Freiheit.\n\nHier geht es ja um eine zweite Säule der Rentenversicherung. Die Existenz soll durch die staatliche Rentenversicherung wie bisher gesichert werden.",
            "Der Knick wird derzeit eher noch schlimmer, nicht besser.\n\nDie deutsche Bevölkerung bekommt noch weniger Kinder.\n\nUnd bei der Migrtion kommt derzeit auch eher wenig der 16 jährige der sofort eine Lehre anfängt. Oder die hochbezahlte Fachkraft.\n\nDas Rentenproblem wird nach dem statistischen Bundesamt im Jahr 260-2070 erst wieder besser. (die haben eine Alterpiramide die auch in die Zukunft shcaut auf deren Webseite)",
            "Naja, wenn der genannte Bürger zufällig Vorstand bei einer der Versicherungen ist die davon profitiert, dann profitiert der Bürger schon ordentlich",
            "Und wenn sich irgendein Amtsschimmel das Altersvorsorgeverträge-Zertifizierungsgesetz (Der Name alleine schon lol) ausdenkt ist das für die nächsten 500 Jahre in Stein gemeißelt und kann unmöglich wieder geändert werden?",
            "\"Hey, wie wäre es, wenn wir das Gesetz ändern und XYZ erlauben?\"        \n\"Nein geht nicht, das aktuelle Gesetz erlaubt XYZ nicht.\"\n\nWas ist das denn bitte für ein Unsinn, den der \"wissenschaftliche Dienst\" da verzapft?",
            ">*Mit 401(k)-Programmen übereinstimmende Altersvorsorgeprodukte wären in Deutschland nicht als betriebliche Altersversorgung im Sinne des BetrAVG anzusehen, da es sich weder um einen zulässigen Durchführungsweg noch um eine mögliche Zusageart handle. Für eine steuerliche Förderung betrieblicher Altersversorgung und individueller privater Altersvorsorge enthält zum Beispiel das Altersvorsorgeverträge-Zertifizierungsgesetz (AltZertG) entsprechende Vorgaben*\n\nIch habe es leider nicht verstanden - was genau an diesem AltZertG verbietet eine Umsetzung von 401k? Oder sagt das AltZertG einfach sowas wie \"ohne die Beteiligung der Versicherungsbranche sollen die Bürger keine staatlich geförderte Wege zur privaten Altersvorsorge erhalten\"?",
            "Realsatire. GRV ist die Absicherung des Lebensstandards und das Ding aus den USA nur eine Basissicherung. Ich frage mich ja wie viele Renter (insbesondere ohne abbezahlte Immo) 48% Rente als Absicherung ihres Lebensstandards bezeichnen würden. 😂😂😂",
            ">Das krankt doch an ähnlichen Problemen wie das deutsche Riester-System, nur ohne Garantie und selbstverwaltet.\n\nDas sind keine Krankheiten, sondern das Gute daran. Der Grund warum Riester Müll ist ist die Beitragsgarantie. Die schließt jede Gewinne aus. Wer es nicht selbst verwalten will kann sich ja immer noch irgendeinen langweiligen ETF kaufen.\n\n> Aber im Prinzip sind die Kosten höher als sie sein müssen, die Bürokratie ebenso und dann noch das größte Problem, dass die meisten Leute zu faul sind sowas zu machen.\n\nKosten und Bürokratie sind geringer als bei uns. Faulheit ist das Problem der Leute.\n\n>Nur 25% der Amis haben sowas\n\nÜber 50%.\n\n>und von denen verbrennt sich dann die Hälfte nochmal die Finger durch wilde Spekulationen...\n\nWas deren gutes Recht ist. Dann müssen sie halt mit den potentiellen Konsequenzen leben.",
            "Wer in den USA mit 1500$ Rente und ohne Hauseigentum in Rente geht, gilt als arm. \n\nIn Deutschland ist das Normalität. \n\nAllein das social Security der USA schüttet bei niedrigeren Abgaben höhere Renten als in Deutschland aus (dank besserem Altersschnitt der Gesellschaft). \n\n401k etc kommt noch oben drauf.",
            "Oh doch.. die Wirkung kleiner Fraktionen kann riesig sein, wenn diese geschlossen agieren. Diese beiden Generationen sind nur nicht in sich einig.",
            "Wenn der Beitrag zur gesetzlichen Rentenversicherung entsprechend anteilig sinkt, wäre es eine tolle Sache! \n\nMan könnte den Beitragsanteil langfristig immer weiter in Richtung Fond verschieben und so innerhalb der nächsten 1-2 Generationen tatsächlich aus der Umlagefinanzierung herauskommen.",
            "Casino anyone?",
            "Heißt ja nicht, dass du es nicht wechseln kannst. World ETF statt Deutschlandfonds oder so.",
            "das ist eine Massenlösung. Nur weil Ärzte sich selbst diagnostizieren können sind die nicht von der KV befreit.",
            "Nicht das ich wüsste. Du wirst aber schon Recht haben, dass der Staat schon dafür sorgen wird, dass ihm nicht haufenweise die Leute steuervergünstigt in den FIREabend abrücken.",
            "Die 2.100 Euro wurden glaub ich nur wegen Riester benannt. Allerdings bin ich dem ganzen gegenüber sowieso skeptisch, wenn ich an dieses Rentendepot dann erst mit 67 ran darf.",
            ">Der KENFO ist eine öffentlich-rechtliche Stiftung, die durch Gesetz gegründet wurde, um die Finanzierung der Zwischen- und Endlagerung radioaktiver Abfälle aus der gewerblichen Nutzung der Kernenergie zur Erzeugung von Elektrizität in Deutschland sicherzustellen.\n\nWir haben ein Endlager?",
            "Ja, in einen MSCI World mit 60% USA und 15% US-Softwarekonzernen zu investieren ist deutlich sicherer als z.B. in die deutsche Infrastruktur.\n\nZum Glück sind die freundlichen und kompetenten Amerikaner da, um unser Geld für uns zu verwalten. Ansonsten würde es womöglich noch hierzulande, zum Wohle unserer Gesellschaft und Zukunft anstatt in den USA investiert werden. Das wäre fatal ;)",
            "Weiß nicht, aber ich fühle mich mit 60k  nicht gerade mega wohlhabend.",
            "Korrekt müsste man aber die \"Steuer\" auf Verluste zurück bekommen.",
            "Du wirst halt keine Akzeptanz bekommen. Guck dir das Bürgergeld an, da hängen sich die Neoliberalen Parteien an ca. 15000 Totalverweigerern auf und wollen mit denen als Munition das komplette System für ca 6 Mio Menschen umschmeissen.",
            "![gif](giphy|9DJtFRgk0tOla|downsized)",
            "Hey, du hast gefragt. Don't kill the messenger.",
            "Erinnert an Bubbatz illegal weil es verboten ist. Und weil verboten ist es illegal.",
            "Einen Blick in den Wiki Artikel zum wissenschaftlichen Dienst des Deutschen Bundestages hätte deinen Post überflüssig gemacht.\n\nIn aller Kürze: Der Dienst ist zur politischen Neutralität verpflichtet und ermittelt nur den IST Zustand zu einer Anfrage.\nDer wissenschaftliche Dienst gibt keine Empfehlungen.",
            "Stand jetzt vor allem eine Beitragsgarantie. Eine Riesterrente darf in keiner möglichen Konstellation Verluste machen, also sind im Prinzip jedes Investment ausgeschlossen.",
            "Genauer lesen.\n\nIm Gegensatz zur gesetzlichen Rentenversicherung in Deutschland, ***die bis zur Einführung der zusätzlichen steuergeförderten Altersvorsorge im Jahr 2002 die Sicherung des Lebensstandards zum Ziel hatte,*** waren und sind die Leistungen der OASDI \\[...\\]\n\nAuch in Deutschland musst du zwingend privat vorsorgen. Auch wir haben ein Drei-Säulen System. Unsere freiwilligen Säulen sind halt nur scheiße umgesetzt.",
            "Die GRV ist eben keine Sicherung des Lebensstandards mehr seit Gerhard Schröder, sondern ein Baustein.",
            ">Das sind keine Krankheiten, sondern das Gute daran. Der Grund warum Riester Müll ist ist die Beitragsgarantie\n\nDas ist doch offensichtlich.",
            ">potentiellen Konsequenzen\n\nWir sind hier nicht in den Usa. Hier sind wir eine Gesellschaft die auch die schwachen nicht fallen lässt. Heißt grundsicherung, heißt steuerzahler zahlt die rente.",
            "Jede möchte jeweils die andere übern Tisch ziehen. So blöd, daß jetzige System mit Grundrenten etc. beibehalten zu wollen ist niemand.\n\n\nMann kann natürlich die Kassen mit dem russischen System entlasten, da arbeiten ganz viele Bundesländer dran, wie man an den letzten Wahlen sieht. Dauert aber noch bis die Leute den langfristigen Weg erkennen.",
            "Es geht doch nur um die Altervorsorge. Du kannst doch privat mit vollen Steuern zusätzlich zurück legen was du willst. Es kann ja schlecht das ganze Land mit 39 Frührentner werden...",
            "Kannst du meine Frage zu deiner Behauptung beantworten?",
            "Deshalb wäre es halt am besten, wenn sich jeder selbst seinen ETF aussuchen kann. Wer glaubt, dass die Prozente im MSCI World gewürfelt würden, kann gerne all in DE gehen. Ich denke es gibt einen Grund für die Gewichtung und werde mir nicht von DE vorschreiben lassen, wie ich mein Geld investiere. Und leider haben die super kompetenten Amerikaner halt ein besseres Rentensystem als wir, ich würde mich also auf Deutschland eher wenig verlassen ",
            "dasistderwitz.gifv",
            "welcome to Germany",
            "Das gabs schonmal. Aber nur für die Institutionellen. Ich habe mir sagen lassen unser Kanzler hat viel Erfahrung in dem Thema.",
            "Ist das nicht eine Nebelkerze der Links-grünen?  Ärgert es die \"Neoliberalen Parteien\" nicht viel mehr, dass eine vierköpfige Familie mit ein bisschen Schwarzarbeit ein königliches Einkommen hat?",
            "Man hätte das auch anders formulieren können, ohne die Neutralität aufzugeben. Zum Beispiel als \"Zur Einführung in Deutschland wäre eine Änderung des XYZ-Gesetzes nötig, da...\". \n\n>Der wissenschaftliche Dienst gibt keine Empfehlungen.\n\nDa finde ich den letzten Satz schon grenzwertig:\n\n> Eine komplette Übertragung der auf die USA zugeschnittenen Alterssicherungsprogramme auf\nDeutschland erscheint schon aufgrund der unterschiedlich gewachsenen sozialen Sicherungssys-\nteme nicht plausibel",
            "Oh Gott...das ist so typisch Deutschland, ich kann nur lachen (ich bin Ausländer)....",
            "Na dann freu dich schon mal in regelmäßigen Abständen eine Brief zu bekommen, der dir erläutert das du leider erst mit 70...ne 75...ahh leider 80 an dein Rentendepot darfst.",
            "Irgendwie schwer eine Banane mit einer Holzlatte zu vergleichen, der KENFO kann noch nicht mal seine kompletten Aufgaben wahrnehmen weil wir kein Endlager haben.",
            "Ich verstehe dein Argument und wie gesagt würde es mir auch persönliche Vorteile bringen. \n\nWenn man es jedoch nicht aus dem Blickwinkel des unmittelbaren persönlichen Vorteils, sondern aus einer langfristigen gesamtgesellschaftlichen Perspektive betrachtet, finde ich es nicht so eindeutig.\n\nEs darf ja jeder den ETF seiner Wahl haben. Letztendlich geht es aber um steuerliche Begünstigung. Warum sollte ein effizient wirtschaftender Staat Auslandsinvestitionen steuerlich begünstigen? Aufgabe des Staates ist es doch dafür zu sorgen, dass der Standort attraktiv ist und hier investiert wird. Anreize für Kapitalabflüsse scheinen mir da nicht sinnvoll.",
            "Nene, ich bereite gerade alles fürs gehen vor. November bin ich weg, arbeite zwar weiterhin in DE aber habe dann mehr Netto vom Brutto. Das ist schonmal ein Anfang.",
            "Ne bestimmt nicht bei dem Gedächtnis......",
            "Dann sollen sie halt die Schwarzarbeit besser kontrollieren. Aber nein, das könnte ja dazu führen dass ein Unternehmer erwischt wird.",
            "Unerheblich, mir gehts drum, dass selten das \"große ganze\" das entscheidende ist. Die Details sind das, was die Akzeptanz fördert oder vernichtet.",
            "Wenn die Lebenserwartung entsprechend steigt, wäre das für mich völlig in Ordnung. Ich finde 67 heute schon zu niedrig.\nAuf jeden Fall alles besser als deine Logik: Staatlich finanzierte Frührentner. Hoffe du hast auch ein gutes Integrationskonzept für die ganzen offenen Stellen.",
            "Das ist eine Strohmann Antwort. Der Zweck ist bedeutungslos. Wenn dieses Sondervermögen für Generationen übergreifende Aufgaben 5 Jahre überlebt hat, wieso soll es das nächste nicht? Versuch es mal ohne Ausweichen.",
            "Nope. Anstatt an den Symptomen zu werkeln lieber die Ursache bekämpfen. Wenn die deutschen Wirtschaftsfreundliche politik machen dann würde ich auch wieder hier investieren. So wie die letzten 20 Jahre keinen cent",
            "Ich mache das so ähnlich;\n\nFirma in DK, leben in DE. Und alle Firmen in doppelstöckiger Holding für den Fall das es in DE einen Finanzen-Kommunismus gibt der mir zu \"Bunt\" wird. Ausschüttungen auf dem minimum des benötigten.\n\nOptionen gibt es genügend, bei denen ich nur die deutschen Tochter-Firmen und die Hütte loswerden müsste und trotzdem in Reichweite meiner Hauptunternehmung wohnen könnte. Digitalisierung regelt den Rest.\n\nMomentan ist das alles noch im ertragbaren Rahmen, aber \"die Schrift wurde schon mal an die Wand getagged\" und diese \"eat the rich\" (anm. >50k Brutto Einkommen \\*lol\\*) Phantasien gekoppelt mit finanztechnischen Dummheiten nehmen schon stetig in Gesellschaft und Politik von Jahr zu Jahr zu.",
            "Denke ist eine Anspielung darauf dass Scholzkopf sein Geld auf'm Girokonto parkt. Ist auch eine Anlagestrategie.",
            "schön tag noch",
            "Traut er wohl den Versprechen von Cum-Ex nicht?"
        ]
    },
    "Noch jemand, bei dem das DKB Depot verschwunden ist?": {
        "title": "Noch jemand, bei dem das DKB Depot verschwunden ist?",
        "score": 8,
        "url": "https://www.reddit.com/r/Finanzen/comments/1dluc77/noch_jemand_bei_dem_das_dkb_depot_verschwunden_ist/",
        "content": "Ich hab gerade festgestellt, dass sowohl in der App als auch im Browser das Depot in meinem DKB Konto verschwunden ist. Stattdessen nur eine Fehlermeldung, man solle es später noch einmal versuchen. Würde gerne einen Screenshot teilen, aber Reddit ist auch betrunken und sagt, ein Bild muss mindestens 20 Pixel hoch und breit sein. 1080x558 sind das zwar aber was weiß ich schon.",
        "num_comments": 26,
        "comments": [
            "Komisch, bei mir ist ein zusätzliches Depot aufgetaucht auf den Namen TotoMacFrame.\n\nDa war allerdings nur Mist dran, hab gleich alles verkauft und mit dem Geld einen 1st class Flug in die Karibik gebucht.",
            "Wahrscheinlich werden gerade die Sparerfreibeträge auf die jeweiligen Kundenkonten überwiesen, das kann erfahrungsgemäß dauern.       /s",
            "Wartungsarbeiten halt",
            "Jep.",
            "Jo, gerade irgend eine Fehlermeldung und es wird nicht angezeigt.",
            "ob long, ob short: das Geld ist fort.\n\nDie Bank gewinnt immer.",
            "Mist jetzt kann ich aufm Samstag nicht auf mein Depot onanieren.",
            "meine Güte wart halt einfach 🙄",
            "https://preview.redd.it/155w9ihk848d1.png?width=1080&format=pjpg&auto=webp&s=8cc5a0257d4f1f290b347eca7ad818c42a5e0af3",
            "Qualität hat seinen Preis",
            "ib.dkb.de/banking \n\nAlles da",
            "In der App nicht zu sehen, aber wenn ich in das alte Interface wechsle, ist es da.",
            "Mein Vadda hat mich gerade schon besorgt angeschrieben, habe selber kein Depot bei der DKB. Gut, dass es anscheinend ein generelles Problem ist und er nicht unbeabsichtigt alles an einen Scammer geschickt hat :D",
            "15:08 \n\nUnd es meldet „service unavailable“ \n\nAm We können die das ja gerne machen solange unter der Woche wieder alles geht.",
            "Exit-Scam von der DKB leider. Kann  man nichts machen.",
            "Hahahaha, ich hab so ne Ahnung, was du davon nicht hättest machen können 😄",
            "😄",
            "Aber werden die nicht immer vorher angekündigt?",
            "Benutzername prüft absolut nicht aus...",
            "meine Güte lass mich halt einfach fragen 🙄",
            "Mein Hash ist anders, aber sonst passt es.\n\nVielleicht tauschen wir. Du bekommst meins und ich deins.",
            "Wurde für heute angekündigt.",
            "Wo wurde das angekündigt? Kein Hinweis in der App und es gab auch keine E-Mail.",
            "Huh, really? Ich hab extra vor dem Post nochmal die Mails gecheckt und nichts gefunden. Okay...",
            "Stand die Woche mal 2-3 tage in der App als Banner. \nAber wenn man die nicht auf hatte in der Zeit bekommt man nichts von mit - dkb halt…",
            "Ahh nvm. war andere App die das für heute angekündigt hatte 😅"
        ]
    }
}