{
    "Quick rant. Fired my realtor today. ": {
        "title": "Quick rant. Fired my realtor today. ",
        "score": 5474,
        "url": "https://www.reddit.com/r/FirstTimeHomeBuyer/comments/1dl7exa/quick_rant_fired_my_realtor_today/",
        "content": "Will keep it short but just wanted to rant \n\nWe have a firm, hard line in the sand $500,000 budget and we told our realtor that. We could afford more, but we don’t want to be house poor. We sent our realtor links to 6 houses we liked within this budget (one was actually $510,000 so I guess that broke my rule by a little bit, but it was just like an idea of what we’re looking for generally). \n\nPrices of houses we were shown/sent:\n\n$700,000\n\n$715,000\n\n$799,000\n\n$645,000\n\n$699,000\n\nI re-iterated to the realtor that our budget was $500k and we only wanted to put down $100k, did not want to have to pay PMI. I again sent some houses in our price range that we liked as a guide for what we’re looking for. \n\nRealtor responded and asked if we would be willing to liquidate some of our 401(k) to get a bigger down payment. I actually laughed out loud reading the email because I couldn’t believe how stupid that idea was. Just responded “I think we’ll be using another realtor, thanks for your time”. \n\nSuddenly she was wanting to schedule tours of the homes I had sent her. Like, why am I doing the work? Why am I sending YOU houses? \n\nAnyway, that’s my small rant. Just found it so annoying. ",
        "num_comments": 630,
        "comments": [
            "Thank you u/407407407407407 for posting on r/FirstTimeHomeBuyer. \n\nPlease bear in mind our rules: (1) Be Nice (2) No Selling (3) No Self-Promotion. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FirstTimeHomeBuyer) if you have any questions or concerns.*",
            "She wants a bigger payday for herself.  That's all.",
            "You made the right choice. \n\nWho knows what else would have happened if you stayed with that realtor.",
            "We bought our dream house literally a week after firing our realtor. She was holding us back in everything.",
            "Good for you. Liquidating your 401K is terrible advice.",
            "You finding the houses for your realtor doesn’t seem like a red flag to me, both houses I have bought in my life have been ones my wife and I found. With that said, any house we sent over to the realtor was met with a quick response about a walk through and additional information, plus our agent contacting the sellers agent and what not. \n\nMain thing to keep in mind is that they are supposed to be working for you, and if they are not, it’s completely normal to move on.",
            "Yeah that agent was scummy but sending homes to your agent to tour is normal. In fact, it is probably more efficient than having the agent pick out homes that u may not even like and waste both each others time",
            "Looks like she wants a bigger commission",
            "I wish we could just get rid of realtors all together and just pay attorneys to do the paperwork and disclosures. Or, purchasing agents should be paid based on the amount saved from list price or a minimum. When they’re taking a cut of the overall selling price, it feels like they don’t have motivation to negotiate if they know the house is within your budget. Getting 3% for looking up listings, showing the house, and helping with paperwork is crazy. \n\nMaybe 6% total commission made sense when houses were $100-$250k. Now in areas that they’re averaging $400-$600k it seems pretty dumb.",
            "Ai will replace realtors soon. Most people look for their own houses on redfin, realtor, zillow etc and send them to their realtor who then schedules a showing. They are a middle man who refuses to go back to making your venti americano. 5% seller cost to have buyers find your house on a site who then tells their agent to contact your agent... both of those dipshits could be cut out.",
            "Given that everything listed is available to see online and most have open houses, I don't use a realtor to \"see\" anything unless there isn't an open house or I want to see it first. Mine does not suggest anything to me, I tell her what I want to see or if I want to see disclosures for a property.\n\nMy realtor is only there for the offer and closing paperwork/process, and occasionally to show me a place. That's all they're really needed for.",
            "Wow I can't believe she suggested the 401k loan. She's an idiot.",
            "Your realtor knew your credit rating and net worth — so, wanted to show you more expensive houses to get a bigger commission. Didn’t give a damn about *your* criteria. \n\nYa did the right thing.",
            "We were house hunting. Told our realtor that we needed at least 1 bedroom on the ground floor because my 78 year old mother in law lived with us.\n\nWe were shown:\n\nA quad level, with zero bedrooms on the same floor as a bathroom. \n\nA ranch home, with parking in the basement.\n\nA farm house, with a dining room that could become a bedroom on the main floor, but the only bathroom was upstairs. \n\nA 3 story mansion that was 125k above budget. No ground floor bedrooms, but it did have a non-functional elevator.",
            "My realtor was doing the same shit and a friend of the family. They really are the worst selfish people I’ve ever met",
            "She wanted a bigger payday and got zip zero nada.  Another useless realtor",
            "GOOD FOR YOU!!!  Liquidate your 401k?????  you loose 30-40% of the value beyond the 10K allowed for first time buying (where you only loose the taxes, not the additional 10%, so 20-30% of value!). \n\nI was same.  I \"could\" afford more, but I had a line in the sand of 400K 5 yr ago when I started looking. My realtor was AWESOME and super respectful!!!  And sent loads of good options (those existed in that range back then).  We spent 2 days looked as TONS of houses, and late on second day she says- I know this one is above your budget- but only a little bit, and I think based on your feedback, you will love it. Its had only been on the market 24 hr at that point. \n\nI DID love it.  It was 20K over my 400K limit.  But that is the deal- if you start at 5-75% of max, you end up finding something good around 75-80% at most.  But if you start at 99%...you end up going over and very house poor, well realtor role in the extra cash for their fee. \n\nFind a better partner for your journey. And again  GOOD FOR YOU!",
            "exactly, why are you doing HER work?  real estate agents are the worst and most pathetic.",
            "I recently leaned you don’t need a realtor to buy a home. There are tools out there that will help you manage the process on your own, no annoying realtors to deal with at all! I’m giving a company called Dobode a try right now after having a really hard time with our first realtor",
            "Reading this makes me feel like i would be a great realtor.",
            "You did a great job. \\*You\\* are the one in charge and she needs to deliver according to your needs and desires.",
            "I have heard of realtors who also show you crap houses so that when they finally bring you to a mediocre one with slightly a little over budget you go under contract because you are just tired and think this is as good as it gets",
            "Commissioned jobs like these attract bad or desperate people.  Especially if they are newer and less established. Being told you can make $100K+ in commissions to face the reality of only making a few $hundred makes people bend their morals to make more money.",
            "I had a bit of bumping up against my realtor a couple times wanting to add a couple thousand to my offer, but he eventually got that when I said \"this is all the money I have\" I was serious about it. It's not super hard to be qualified as a realtor. It is super hard to be a good realtor. Sorry you got a shitty one.",
            "Nope, she had her chance, then she insulted your financial literacy.",
            "You are the boss,  so yes fire her ass. You send her links and didnt get to see any of them? How stupid. Our realtor tried doing that too. But i right away told her i wanted the one ive seen",
            "Same happened to us. She even called our lender and asked what we were approved for so that she could justify showing us higher priced homes.",
            "About to fire our realtor. Found a unicorn of a good deal and got screwed out of it because of how our realtor handled it. And the way they did things looks like they are either dangerously naive (despite being a realtor for 25 years?) Or they actually wanted us to pay more. Neither is acceptable. ",
            "I fired a realtor at our first consultation.  She gave the whole spiel about pmi and our down payment budget, and I told her I was going to be financing via a VA loan. She asked me: how long have you worked for the VA? …I told her I don’t work for the VA, I am a veteran. And she looked at me with pitying eyes like I was an idiot and said “oh honey, you don’t qualify for a VA loan just by being a veteran you have to ALSO work for the VA!”",
            "I’m currently using a friend as a realtor.\n\nCrazy market, every house is a bidding war.\n\nSearching for a multi family, I accidentally searched single families and found a multi family that was listed incorrectly and because of this was sitting for MONTHS!\n\nI called my realtor and told him “hey they listed wrong so it’s not getting much attention, we could probably offer them under asking and they’d go for it, call and set up the walkthrough.”\n\nHe calls me back an hour later saying “they said they aren’t taking any offers under asking, they’re actually trying to sell it for more than asking price”\n\nMy question to him in the politest way possible was “I asked you to set up a tour, why the hell are you talking to them about price and I haven’t even seen the property yet?” 🤔\n\nIf he wasn’t my friend for over 10 years he was definitely getting canned for that. 🤷‍♂️😂",
            "We don’t engage realtors with the financial side of a house purchase - preferring to keep our privacy. By that I mean we get prequalified by a lender before shopping. Then find a realtor who is known to work well in that area. How much we pay down, sources etc., are none of their business.\n\nSo with the prequal, there’s no room for doubt on how much we have for a deal. If, as is often the case, we qualify for more than we want to share with him/her, we have the letter generated for only the maximum amount we want to spend.",
            "Realators are the most unnecessary profession there is and most nowadays are scumbags and con artists who really don’t have much knowledge and re barely capable of doing their job. \n\nThe next thing they would’ve wanted you to do is waive inspection on a home with obvious foundation and electrical issues.",
            "Same happened to us way back when. Bank approved $450K, we were looking to top out at $250K (this was 20 years ago). It is just the two of us and that $250K could buy a 4BR/3BA house in a decent neighborhood. He kept sending us houses in the $350K-$400K range. After a few days of this I told him to stop, and he did. We kept him because he really was aggressive about locating potential homes and getting us in to see them quickly. We have been in this house 20 years.",
            "You should've let those stupid games lead to stupid prizes. \n\nWhat I mean by that is that you should have called your realtor, and said \"wow, we love all these houses, set up a viewing!\". Go to each and every one of those houses with your realtor, then make an offer of 500K. If\\when they go crazy because of that, you say \"hey, we told you that's our budget, we thought you're an expert, and probably realized we could get them for 500K\".",
            "[deleted]",
            "you have weird system in USA in \"realtor buyer\" states and are way overcharged\n\nIn Aus only the seller pays commission and then at about 1-1.5%\n\nThe idea that you pay 6% and both the buyer and seller realtor get 3% each is ludicrous\n\nGiven you can simply Internet search an area with all your criteria just what does a buyer realtor do for you?",
            " You are correct.  Good job.",
            "Definitely made the right choice !",
            "Crazy story I also fired my realtor then within a week and half I went under contract at a house. My new realtor has dine a fantastic job",
            "Definitely believe a realtor shouldn't even speak about financial advice. Their job is to look for houses where you outline a budget and what you're willing to do. I think you did the right thing. Also I'm having that issue where our realtor wasn't doing the work and finding houses we may like even though she knows what we like.",
            "Some realtors will make or break the experience. I had a realtor not know what comps were, gave me zero info on the home as far as tax records and whatnot, all she did was \"we can go see the house now\" and that was it. She could write a basic contract which she also fucked up once. By the time I moved the area and got with my other realtor I had worked with before (the housing market exploded and homes in our price were being sold for $100k over... So we couldn't buy a house before my military move) I was seasoned. I wanted comps for every home I considered to ensure they wouldn't underappraise as the last 3 homes I was under contract with failed to value by 30%+, I wanted tax records, utility and records.. And they were able to provide all of that within 5 minutes. It was wonderful. Finally bought a home through the guy first try once I moved back. Nothing beats having a great realtor, and nothing will exhaust you more than a shit one.",
            "That’s good. I’ll be mindful when I pull the trigger. It’s a business transaction.",
            "Just remember that everyone out there is out to make a dime off of you. If that’s the case, make them work for it by not being a pushover. \n\nYou seem to have this under control though.",
            "Their 3 percent incentivizes them to lead buyers to more expensive homes.  I'll be happy when flat fees and contracts become the norm in the market.",
            "people like that should not be realtors, I probably wouldn't stop there",
            "Realtor probably needs a new boat and you weren't doing it the job",
            "That's nuts. We found a great realtor who stuck with us throughout a 6 month search, was never pushy but kept our heads out of the sand.\n\nBy the end we narrowed in on a bunch of criteria and we were getting notified of homes before they listed. That helped us be first through the door and get an accepted offer! Closing in July.\n\nWe did fire one realtor previous to our current, but that's mainly because we got matched with them via a website lol.",
            "Realtors are motivated by the sale price because it quite literally determines their commission. The system is all backwards it’s actually shocking. How are we supposed to trust someone that would BENEFIT from a deal less favourable to their own client. I prefer to do my own research and only use the realtor to complete the paper work. Things like Realtor or Zillow are a good start but if you like data I saw something called Investince companion on product hunt that I’m waiting for.",
            "This is not the way to go about realtors, to “send them emails to show what we generally want”.\n\nI have always done this: gone on the internet daily and found the places I wanted to see. Then told the realtor: “I want to see this and this and this house tomorrow”. \n\nEither she shows up and opens the door or not. If not, I find a realtor that does.\n\nThere is absolutely no need to have them send you anything if you already have the time to look on Redfin or Zillow. It’s not that there are hundreds of new homes popping up in your desired area and price range daily, correct? So you might as well just find the listings yourself and just inform the realtor to show up to open the doors.\n\nWhat you CAN tell them is to send you any unlisted homes that they get a lead on (in your price range), but I wouldn’t bother with them sending you publically available listings from Redfin or Zillow.",
            "She should not be asking you about pulling from your 401k, only your lender should have that conversation with you.\n\nI would have a chat instead of firing her outright to see where she is coming from and why I’m being ignored.",
            "You made the right choice. I also had to find my own houses and regret staying with the realtor because it only got worse.",
            "I ended up doing all the work in our situation as well. We also had to jump a bit above our stated budget because our realtor slept on the 6 listing I sent her in our budget that were perfect and they got snapped up. We ended up buying for around 25k over our wanted budget when we could’ve gotten something 20k under our budget. \n\nDon’t compromise in these positions because it’s your money and your purchase.",
            "You did the right thing. I wish I had went with my gut and fired the RE agent I used.",
            "I didn't even get that far with my realtor. She asked if we were open to a condo since we're in a hcol area. I said we were a long as it's it's the kind where each unit had a separate entrance since we had a senior dog and didn't want to walk her through a lobby to go outside. Guess which kind of listings she sent us...",
            "Good for you!",
            "The liquidating 401k would be an insta fire. \n\nI don’t see any issue with sending your realtor homes. You have access to all the homes on sale and you know what you want best. While I agree you should have dumped your realtor, I’d still be proactive in your search. \n\nBest of luck in finding your next agent. I had to fire mine when I sold my first house. Only regret was I didn’t do it sooner.",
            "It's a relationship business, and if they can't abide, wave them off.\n\nI'd have a conversation with their broker, too, but I am a bit of a jerk, so there's that.",
            "I was in the same boat but different situation. I asked for homes less than 400k. The area I was looking only had 3/2.5, max 2300 at that price point. Agent tried to persuade me to look at a higher budget(500k) and 4/3.5 and I said NO many times and nearly fired her, even though I could afford it.\n\nPut a contract on a 3/2.5 below 400k with $8k deposit. During the build, noticed the little subdivision filled with 3/2.5 was surrounded with homes 4/3.5s and that was the preference of the area. Also previous houses with 3/2.5 did not appreciate or sell anywhere close to the 4/3.5. The biggest issue was that the actual house felt smaller than the model home and if we had 1 more kid and in laws visiting, the house would be full.\n\nI told my realtor I should have listened to her, canceled my contract ( lost 8k deposit), and immediately purchased a pre built at $70k more that had 4/3.5, 500 more Sq ft,  bigger backyard, covered patio. It's actually appraised $60k more since we closed in november based on the latest comps in the area as I was the first on the street. Also got a 4.99% fixed rate and $10k closing, which was originally the agents bonus paid by the builder, and she graciously gave us. My house is surrounded by $600k -$700k luxury homes. I won't have a problem selling this home ever.\n\nMy point is take a look at the homes in your price point but also be open-minded and see what the realtor wants to show you as it could be worth it.",
            "you fired your realtor for communication problems. seems reasonable",
            "We had to fire our first realtor for the same thing. Luckily our second one was amazing, and it was like a night and day experience. Don’t give up hope lol",
            "Most are parasites, sorry not sorry.",
            "Had a similar thing when interviewing. I talked to a couple agents that suggested doing the most.   \n  \nOne who insisted I needed to finance to get a median house in HCOL (by myself) when I specifically said I wanted no mortgage. \n\nAnother suggested breaking up my lump sum into two down payments and renting the 2nd home out..\n\nIf I wanted a big empty million dollar home or to get another rental property I would have said so.",
            "Yeah that’s way over budget…\nMaybe they got greedy for a commission but you made right decision to fire her.",
            "Most agents are just as useless",
            "Nice. I would’ve been inclined to ask him for his client list so I could email them all and tell them not to listen to the clown giving advice to liquidate 401K’s to buy houses.",
            "You did the right thing. The realtor just wanted to collect a fat commission. It’s been a terrible spring for them and they are starving. But that’s not our problem.",
            "I mean it's clear as day what is happening here. She wanted a bigger cut and the only way to do that is to upsell you. All these realtors see these trash ass reality TV drama shows in high-cost areas with scumbag realtors and want to do the same.  At the end of the day, they want their EOY commission money to be the highest possible and don't give two shits about you. Don't just fire them, out them for who they are.",
            "This is why I will NEVER use a friend or family member as my Realtor when I buy a house. That is too big of a purchase to have a rep be subpar and you are afraid to fire them. I want to be able to fire them with zero remorse if they aren't meeting my needs.",
            "Good move, you literally had to fire her to get her to do what you needed her to do in the first place.\n\nNEXT!",
            "I have bought 2 houses in my lifetime. Never used a realitor to buy a house. I don't really know why anyone would use a realtor to purchase a house. I can call a realtor that's selling a house to set up a viewing its not rocket science.",
            "The Realtor is supposed to work FOR you, not the other way around.  Sounds like they wanted a bigger commission by upselling you.\n\n  \nBTW - I would ***NEVER*** liquidate some of my 401(k) for a bigger down-payment.  You'd be paying your normal tax rate (or up a bracket), plus a 10% penalty for early withdrawal.  So that is probably around a 35% rate to get some more money for a down payment, to avoid paying \\~1% PMI.  Any person who would suggest that does NOT belong in Real Estate.",
            "Good. For-shit realtors pollute the industry",
            "Depends on the market...can negotiate. I went above my firm price and negotiated down.\n\n$200k off...probably never happening in my lifetime so that was stupid.",
            "I would send my realtor houses bc he was constantly on the road and I got the Zillow alerts before he would even be notified. But what he did was constant the seller if it was a different agency, get reports on EVERYTHING, and if there were problems he messaged me right away. There was no sugar coating any of it. \n\nYou did the right thing here.",
            "You did the right thing. A friend of ours had to fire their realtor as she was not showing them anything and my friends had to send her links to the houses they were interested in. \nThe realtor also pushed them to put down an offer on a very bad apartment. After this they let her go and hired  another one. \nThey bought a house a few weeks back and are really happy about their purchase.",
            "Yep . In my country the process works differently but the realtors also don’t seem to understand price limits. Wasted so much time and effort while not buying a home.",
            "I am flirting with like 3 realtors and having them send stuff. One I friended on Facebook cuz she volunteered at the humane shelter and I’m shopping realtors. Well I told her I was preapproved for $180,000. She keeps sending houses in the $200,000+ range. On Facebook she’s always on vacation or doing expensive stuff and not worth it. The other realtor sends stuff and checks in but they’re not always in the location I want.",
            "This makes me angry. Such a dumb shitty realtor",
            "🤮 you did the right thing",
            "Our first realtor cost us a few places. First one we looked at with her, she said she would “fight for us” (her actual words), then the next day they had a cash offer come in while we were on the phone with people trying to figure out finances on it and she rolled right over and was no help to us.\n\nNext one we looked at and wanted to put in an offer, she drafted an offer letter but had a couple things wrong so I didn’t sign off and asked her to tweak them so I could sign it and she could submit it. It took her a week to send it back to me, I signed it and sent it back to her that night, the next morning she sent it in at 9:30 AM and apparently the seller had received another offer the night before. Then she had the gall to tell my wife to tell me to “just sign it and we can change it later”…\n\nThe next one we wanted to look at, we knew it was probably going to go quick, but she wasn’t available to tour it with us until three days later. Next morning it was pending.",
            "My realtor (buyer side) throw a last minute TC charge of 500 bucks at closing.. didn’t tell me anything about it, I thought it was part of a needed transaction. Turns out he was charging me without previously disclosing this TC charge . TC is a transaction coordinator. All through the process I felt he was more eager to close a sale more worried about his commission than anything. I should had gone with a different realtor. There some bumm realtors out there, watch out.",
            "She seems awful. Hope you find a good one!",
            "That realtor deserved to be fired. Real estate is too big of a purchase to have someone dishonest representing you. \n\nI fired one years ago, we told her what we were looking for and price range. She kept showing us houses at the bottom of our range that were uninhabitable. Like should be torn down. She kept telling us that it was all we could afford. She got big mad when I fired her because she had spent money listing our place we had for sale.   \nThe new agent found us new construction and a bunch of newer nice homes in our price range.",
            "As someone who works in Real Estate, this guy is a dipshit. Honestly some of things I’ve seen Realtors do has me seriously question how they keep getting clients.\n\nYou did the right thing.",
            "Yeah, that’s weird, your budget is your budget! They should adhere to that. \nIs it like a really expensive area or some thing? Maybe there aren’t a ton of options around? But there must be some since you found them and she didn’t! Yeah, probably best to move on with someone else.",
            "Great job at ditching her. Totally ridiculous..",
            "The bar for becoming a real estate agent is a fucking joke. These people should ideally be professionals as they work with personal information and in a very contentious field that is the housing market, but because 9.3 / 10 of people in the field are morons, it’s basically just a haven for people who don’t want to put in work and get paraprofessional training w/ licensure, which maintains dipshits like OPs former realtor in this field.",
            "I don’t blame you! She definitely didn’t seem to be taking your wants into consideration, and the comment about liquidating some of your 401K would have been the final straw for me. I had to fire mine as well, because she was not very responsive. I was doing all the searching, and then half the time I’d ask her to get an appointment to look at a house, she’d take two days to get back to me or if she responded timely manner that she’d set it up, I’d never hear back from her 🙄",
            "Wouldn't that be \"house rich, cash poor\" if you bought a $700K house?",
            "They only cared about the commission not your needs but good luck!",
            "Good. Trying to squeeze some extra commission out of you after assuming you have more money.",
            "FYI.  Hard lines are not made in sand.",
            "Yeah get house poor AND empty your 401K AND end up paying PMI. Brilliant plan by this parasite. Good move on your part. Move on.",
            "With housing prices as high as they are realtors make way to much to not do exactly what there clients ask in situations like this",
            "The sad part is that some folks actually eat the bait, and panic all the way into 'house-poorism'. Realtors are a big part of the problem with the housing market.",
            "I regret not doing the same, being first in my family to buy a house no one really knew what to expect. I was the one constantly sending listings and he never showed me any. My SIL pointed out to me that he's not doing his job. We eventually did buy house thanks to my persistence but I basically did my realtors job.",
            "Smart cookie. They work for YOU. Not you for them",
            "Liquidate your 401k for a house down payment?? You definitely made the right move…that realtor was not acting in your interest.",
            "Asking someone to dip into their retirement essentially, just to get a bigger payout for yourself, is hell worthy.",
            "Some Realtors are bad at their job and deserve to be fired. And it takes some people to get reprimanded or fired to learn a lesson, others never learn. Don’t be afraid to go to their BIC, especially if your state has any sort of Buyers Agency Agreement. You don’t want a good Realtor to miss out on their commission bc of a bad Realtor.",
            "I can’t stress enough how little and how useless realtors are. The system needs to rid themselves of them.",
            "Both times I’ve use a realtor, we found our own house. \n\nThey literally showed up and collected a check, there was nothing else they needed to do 😂 easiest $15k they ever made. \n\nThe only time a realtor was actually useful was the selling of our house to negotiate the 12 offers we got during the insanity in 2021.",
            "You know we bought our first house 9 years ago.  Back then a starter home was around 280k in our area.  At the time realtors could be and were real pricks.  They could be snobby and picky and choosy with who their clients were.  \n\nThere was over a 15 year period where prices just climbed and they could be pricks.  Now they can’t be that way.  \n\nMy guess is they know 500k is competitive so they want to get you more than you want to make their commission come quicker.",
            "When I was house hunting I literally just sent my realtor houses I wanted to see and he set up showings.  It’s so easy to search for houses I don’t know why it would be any other way.",
            "Right choice! \n\nOur loan max is 485 (by choice, we were approved for over 700 but nope… $3500 is the max payment we want to pay) but our max for a home is 520. We are paying in cash above 485. \nWe finally found someone who respects that. \n\nYou did the right thing. \n\nJust because you CAN afford it doesn’t mean you SHOULD. \n\nWe aren’t technically first time homebuyers but this will be my first house (husband bought the first in his name\nOnly). \n\nAbsolutely fire anyone who isn’t in YOUR corner, period.",
            "Your experience is very common.  Most, not all, realtors are idiots and self serving.   They will steer you to those homes that will earn them the highest commission. This is why the current system needs to be changed.",
            "It's a scuzzy realtor practice. They try to show you stuff over your budget in hopes you'll fall in love with one and pay more than you were willing so they get a bigger payday.\n\nYou even see it on shows like House Hunters....and people fall for it!",
            "Don’t use a realtor for looking at homes ! Do it at your leisure, when you find something you like then call your new realtor \nWe’ve done that twice \nHad an offer in in 2 days",
            "I sold my house myself. I lived in a very desirable neighborhood. One day a realtor stopped by and asked about the house. He was very nice and gave me a few papers I would need. He said call me if you get an offer I will help you with the negotiation and all the way through close for 1 percent commission. I got an offer about a week later, the realtor came over helped me come to agreement with the buyer and helped me and kept me informed all through the process and met me at the closing. Now that is a good realtor. He was also gorgeous. Yum!",
            "Realtor here. Run from them as fast as you can. THEY work for YOU and this is just the beginning. If they cant have your best interest at the “house hunting” stage, they sure as hell won’t have your best interest once you’re in contract. \n\nI would literally rather die than suggest my clients liquidate their retirement.",
            "Realtors come in two flavors. One just wants their commission check and will do anything to get you to buy a home. The other will actually listen to your wants and needs and will help you make the right decision. \n\nThe first one is more successful in the short term but the second gets the repeat business and longevity. \n\nFind a realtor that comes recommended by someone you trust and has been around for a while. Don’t make the same mistake I did and hit ‘show me this house’ on Zillow. They will assign you a 23 year old who has never bought a home themselves.",
            "Realtors are almost worthless. Just get a loan officer and a real estate lawyer.",
            "Lost an opportunity from a realtor like this.\nSent him houses in the 330k - 375k.\nShowed me 440k+ homes and wouldn’t tell me until after the tour.\nA house opened up that WE got wind of, he knew the selling realtor, the landlord was kicking out the renters and had no renovations in 10 years, had all the info, dates and every chance of an opportunity to give us a chance before it went to market for us to buy.\nI told him to give them a bid for 350k and he said “I’ll give a verbal and see if she goes for it”\nHouse sold a week later for 344k.\nHouses then went up a month later and that same house is somewhere in the 550k in 3 years..\nI stuck too long with that guy and he wasted so much of our time.",
            "When I purchased my home the realtor spend a lot of time trying to show me houses at the amount I was approved for financing for, not the budget I gave her. I should have fired her but she was the wife of a coworker. It got to the point where I would refuse to get out of her car when we pulled up to view houses she selected that were out of my budget.",
            "Shes probably broke and needs the paycheck. Obviously just a guess though. As realtor myself, I see this far too often. There are a lot of agents that steer their clients a certain way towards certain homes, usually because of commissions. Its unethical and of questionable legality but hard to prove. Its just one of those things I hear people complain about and deep down you know what's really going on but you cant prove it. You did the right thing firing her. Really the only option you had. And if she cant take basic direction at the beginning, what do you think she would have done if she was negotiating on your behalf. She would have ended up getting you or herself sued. Its better for both of you that you let her go. Hopefully she learns from the experience.",
            "Realtors are not necessary. You just need a lawyer",
            "Realtors are like travel insurance. You’ll constantly question why the hell you even needed them in the first place because they aren’t actually doing anything. Until you’re in trouble, then they’re a godsend. ",
            "Here in Canada I swear there is a “attractiveness” vs “inverse competency” scale.",
            "You can explore putting 10% down and pay a “up-front single” PMI payment at closing to avoid monthly PMI. I do this with clients that don’t want to apply a full 20% down but want to avoid monthly PMI payments. Helps lower the out-of-pocket cost at closing",
            "Oh goodness, realtors are some of the most annoying people on planet earth next to car salesmen",
            "Yeah good call",
            "Realtors are still trying to push the 500k house is now 700k so we were showing you what you want bullshit.",
            "Realtors are useless, other than MLS, why do they even exist?? RE lawyer charges $1000 to draft up contract. Heck, contracts are so easy , you don’t really need anybody . Realtor will use their buddies to do inspections, you might as well inspect yourself cuz their buddies are being paid to not tell you any problems or the Realtors won’t recommend them anymore. The whole Realtor association is a giant scam. I hate realtors. I closed 30 ish houses myself and will never come near one. Bunch of regards.",
            "These people are worthless and I hope their profession goes away soon.",
            "It's common for people to find their own houses, especially in the Zillow age.  Some people want their realtor really hands on finding them houses but others do prefer to control that more themselves, especially if you're in a lower inventory area where there isn't like an abundance of thousands of houses meeting your criteria to sift through each week.  You needing to send the realtor houses isn't a red flag, although you should communicate with them and tell them if you prefer to be more hands off and will not be browsing yourself online and will be primarily relying on them to search.\n\nThat said, good call firing this realtor.  They should not be sending you houses dramatically above your stated price range.  Maybe if what you're looking for was totally unrealistic in your price range, showing you one house outside it to show you how much money it would take to get those things.  But at the beginning of your search when there are houses available in your price range and you've told them it's a hard line, this is just silly.",
            "Ugh I'm sorry this happened to you. I share your frustration and give you kudos for sticking to your budget. I had a similar situation happen with a realtor where she based the convo around \"finding other opporuntities to find cash. Are you expecting any money from your parents at any point???\" \"No ma'am. No we are not, thanks for your time. Goodbye\"",
            "Our last realtor didn’t do/ have to do much work at all. I had already seen the house we ended up with at an open house. She scheduled a showing so my husband could see it otherwise she only had to schedule 2 showings for us. I even told her exactly what I wanted to offer on the house. We did a pretty low offer that I’m sure she thought would never fly. Trying to make you look at more expensive houses is a different matter. That’s not okay and is a good reason to look for someone else. Depending on what your market is like it might not be a bad idea to look at some houses just a bit over your budget. Our house was first listed for 420k, then dropped to 390 and we got it for 300k but our market has cooled a bit. We also mostly looked at houses that had been on the market for months.",
            "N",
            "I think it really depends on what you want from your realtor. We used a realtor to buy our house and we did most of the work of actually finding candidate properties because all that shit is online. Our realtors job was to get us into showings of things we liked and give us whatever information she could dig up on potential properties and then to do the negotiating on our behalf when it was time to make an offer. We didn't need her to find houses for us or tell us what we wanted, we knew that better than her. What we needed her to be is someone who has a ton of contacts in the industry and the knowledge of what makes a good offer.\n\nShe wound up getting a house for under listing price and with about $15,000 in seller credits in a pretty aggressive market because she correctly concluded that the house was overpriced and had some undesirable qualities that would limit offers and was willing to beat up the selling agent over flaws with the house. She was right, we got the place for a price that we could afford, walked into it with an emergency fund still intact and with instant equity because it appraised for close to $20K more than we paid.\n\nI guess what I am saying is that a good agent isn't necessarily someone who is better at finding likely houses than you are. No one is going to know what you want better than you do. A good agent is someone who can do the part that you DON'T know how to do. Our agent was a jerk, and that is precisely what we needed them to be.",
            "Awesome! Good for you! \n\nI was also having such a tremendous clusterfuck of a process working with a realtor early on, she literally made it harder to see a home than if I had just pinged the listing agents unrepresented (which is what I ended up doing after I fired her and it was a breeze).",
            "It is better for you to do the looking yourself on different websites and just keep the realtor's job only to unlock the door and send in your offers.",
            "I congratulate you on knowing your budget and sticking to it! It's important to do that. Your realtor won't be helping you pay off your mortgage years from now. :)",
            "Mo money. Mo commissions!",
            "Thank you so much for this very timely information",
            "They're literally incentivized to get you to buy the most expensive property possible.\n\n\nYou should be up front with the next realtor on why you're switching",
            "Good decision. I have a firm budget too and some specific criteria (good location, garage, 2B/2B, mostly turnkey, etc.), and so far my agent has obliged.",
            " Good for you!",
            "He’s got to push you or else you’ll just “love it”\n\nAnd when you go above contingency on the reno plan but won’t budge your price range, that’s just not fair",
            "Fire her.",
            "Good move. Maybe she’ll listen next time!",
            "Had a similar issue with my first realitor.  She was showing me houses 30% over what I wanted to spend ( she just looked at what I was approved for).  The next one I used was amazing, he got to deal with me on the next 9 house transactions.",
            "You have to do what's best for you. And someone working with/for you is better than someone working against you. \n\nMy first realtor (end of 2007) was AGAINST us buying a foreclosure. Almost every house for sale at the time was a foreclosure. After 3 viewings and 1 attempted offer, he wanted us to sign a contract. I told him it wasn't working. Found a realtor couple that had never worked in foreclosures and short sales, but they seemed optimistic and started working with them. It was the best decision I could have made. \n\nBought and sold first house with them. Selling the first house was a long process because of the market, and when we finally got an offer it was 30 days to close. Needing to find and close on a house was crazy in 30 days. My ex and I took a day off work a couple days later, and we looked at 10 houses in 1 day. 11 viewings because we went back to the house we wanted to put an offer on. It was like a 12-hour day by the time they drew up an offer and we signed. \n\nDuring the divorce, they sold house 2. I would have stuck with them for house 3 but my ex was using them at the same time and I thought that might be weird so I switched to a friend that's a realtor.",
            "Imagine the amount of people who take this advice and end up liquidating their 401k...this should be criminal. This is the biggest transaction most of us will make in our life time and these people don't have a fiduciary duty to their client.",
            "Great decision; clearly your realtor is just trying to make a quick buck.  \n\nHaving said that, it’s actually a good idea for first time buyers to tour homes well above *and well below* their desired price point, just to get a sense of what your money buys you and kick off the discussion of what you’re willing to compromise on vs what’s completely non-negotiable.",
            "Good choice. Your realtor works for YOU. I wouldn’t want a bad realtor to get the commission from a house sale.",
            "“Would you be willing to sell one of your kidneys to get a bigger down payment?”",
            "Slightly over like $510k I can totally understand but the numbers she gave you? Omg that’s like over $100k more. No way. Our realtor stayed right within our budget and no more than about $15k over.",
            "She pushing the higher cost houses cause she gets a bigger cut!!\n\nEspecially now that that’s changing in the USA as to how much they can fleece us for. (I’m still a bit fuzzy on the new laws cause they came about after we already bought. But I remember it wasn’t in favor of the realtors wallets.)\n\nYou made the right call dropping her. You gave her multiple chances to get it right and she didn’t stop pushing until you took away your money. \n\nDon’t take her back. She’ll hold a grudge and pull some shit that could cost you your dream house.",
            "Yup.  The advice I got was never tell a realtor your actual budget.  Calculate your limit, take 20-30% off of it, tell that to the realtor.",
            "We let go of our first realtor. She took us on despite not being local to the city we were looking to buy in. She never sent us houses. We sent her everything. She knew nothing about the neighborhoods. She was literally there to unlock doors for us. And she was kinda pushy with how serious we were about buying. We were already pre-approved and ready to go. We only went with her because she worked with our credit union. Thankfully the next guy we picked WAS local. He knew a lot about the area. He even put together a nice binder of all the houses we would be viewing. Very kind and patient. And that’s how we found our house.",
            "Our realtor kept wanting to show us houses in an area I didn't want to live in as it was further from work than I would like to drive and above my budget.  They want more money and have incentives to show you certain areas.  I also would have dropped them if they asked my to liquidate my 401k.  That's insane.\n\nI ended up finding our house that was close to work, under budget with a 4 car garage,  and walking distance to a great school district. Luckily, our realtor kicked ass in getting the price down to the point that the seller's realtor was complaining how little they were going to make.  \n\nThe upside of a sold as-is home is I had more leverage from my inspection.  The downside is in 6yrs I'll have put 70k into repair and improvements as it was the ugly house on the block with some sketchy DIWhy I have had to resolve.",
            "Good for you. Never liquidate your 401k. That's predatory. Honestly, I don't know what these real estate agents do nowadays. You find everything on redfin and all they do is open the door. It's time we cut out the middle man.",
            "What?!\n\nThat sounds like some bs that a “millionaire realtor sales trainer”\nwould suggest to “teach people to be more successful in real estate sales.”\n\nYou did the right thing. Your former realtor sounds like a desperate loser.",
            "Sound like the one I had a few years back",
            "My parent in laws have recently been buying a piece of property from someone we know, so we elected to not use a realtor, and I've been doing everything for them since I have bought a house before and they haven't. \n\nI know every time someone says realtors don't do much they catch flak from realtors saying that's not true, but I've gotta say, I've done everything in this transaction that a realtor normally does besides searching for ideal homes. This stuff is easy, I could do it in my sleep, give me a week or two to brush up on real-estate laws and local rules and I could do this in my sleep. It's hard to believe that if my in laws used a realtor they would have payed them thousands of dollars for doing so little work.",
            "Greed.  It’s not good.",
            "People take loans from their 401k’s to buy houses all the time. It’s a good idea for some and a bad idea for others. Doing it because your realtor doesn’t respect you is a bad one. \n\nYou made the right decision. I almost fired our realtor at one point for similar reasons. We had a budget of 350k, had 100k cash to put toward a down payment. She kept showing us houses that maxed out our budget and needed another 30k-70k of immediate work before even moving in. It was an interesting come to Jesus phone call. \n\nMy wife and I ended up buying a house that we found by ourselves and toured by ourselves. All our realtor did for this purchase was send in our offer and draft the paperwork for us. \n\nWe keep in touch with her. She is a friend of ours. Not using her services ever again, though. Find an agent who is on the same page as you and willing to respect your convictions. They are good at explaining how that extra $50k loan is peanuts over 30 years, but forget that people aren’t made of money.",
            "When I watch home shows it drives me crazy when they show them over budget. I’d instantly just get back in the car and leave.",
            "I was looking for houses during the 04/05 bubble and our income was like 50k a year.\n\nI wanted 100-130 tops. Realtor kept arguing we could afford 300k+\n\nNeedless to say, even 24yr old me was smarter than 90% of my income on mortgage.",
            "Genuinely curious as to why liquidating 401 was even an idea for the realtor lol.",
            "So how did you find this person?",
            "PMI is not that big of a deal. But I do agree with your decision to find a realtor who will listen to you",
            "I basically ghosted my realtor when she kept showing houses outside of my price range, and the last house had three Persian cats - and I told her that I am very allergic to cats and would not be interested in a house that had cats.  My mother ran into a realtor friend of hers and he mentioned a house he just signed to represent - I looked at it, brought the future ex-wife to look as well, and we bought it several days later.  The cherry on top?  This realtor was not part of the multi listing service so my original realtor did not get a cut of the commission.  When she called me to set up an appointment to view another house and I told her I had purchased a home, and from whom, she cursed and hung up the phone.  Listen to the client!",
            "Had that happen with my first realtor too.",
            "Realtors are generally on the same level as greasy used car salesman. Always be on your guard, and always get it in writing.",
            "Oh man that was sleazy realtor.  Mine was great she put up with my shit lol",
            "I laughed out loud when reading that too. “Would you be willing to give me a bigger paycheck?” gtfo",
            "I’ve had some realtors I tried to work with in the past do similar things. Had to fire a few to find the right one. Just like any occupation, there’s some bad ones out there.",
            "Real Estate is the second oldest profession. Selling something you don't own - but everybody thinks they can do it.",
            "I know it was a different time,  I bought my house in 2017 but I had the same problem. had to fire my first for trying to bully me in buying more expensive properties than I wanted..  the second one I found even tried to sell me a house that belong to her ex husband.. which I think is a crime .. 3rd person was referred to me by a coworker he was super cool and listened to my wants and needs , I ended up buying the 2nd house I looked at.. 7yrs  later here I am  .. the right realtor makes a big difference..",
            "Good move, OP. Find someone that listens to you and respects your wants and needs, not someone that judges and thinks they can upsell you or show you what you ‘actually’ want. \n\nIt’s totally fine to have a ‘hard’ budget that you don’t want to exceed. Being able to afford more or put down more is entirely irrelevant. Someone that tries to talk you into spending more should be met with one question: how much will you be contributing to the mortgage?\n\nBuy the house that you NEED, not the house your broker/realtor/family/friends want you to buy.",
            "Realtors are a scam ever since Zillow came about. $15k for showing you a few houses? Another 15k for selling a house when they use lockboxes are barely even show up?\n\nJust do it all yourself and hire a real estate attorney for a few hours to help with paperwork. Much easier, much less expensive, and an attorney is much more knowledgeable than someone who took a weekend course at the airport Marriott.",
            "Last time I looked, mine could never get back to me in any hurry and they all “sold” before I could see them.  I’ve given up on buying a house for awhile.",
            "Realtors are garbage. They’re yes people who mostly don’t actually know anything about houses. They may know areas in the city and they may have an idea about where growth is going to happen. But at the end of the day, all they do is help you do paperwork. And they make a shit ton of money for each one they do. It’s one of the worse professions that exist and sadly has become super popular where I live (Denver). \n\nI’m glad the rules recently changed on their commission rates. Something you should keep in mind as the buyer is negotiating the rate you will pay your new realtor.",
            "Realtors are the worst",
            "The first selling realtor who was a former client and sold mostly really high end homes and properties. Ours was not. She wanted us to do 15k worth of upgrades (we had already done quite a bit already).\nWe didn’t use her.\nNext people wanted up to keep lowering our price in a very hot market. They didn’t want to work. \nNothing wrong with dumping shoddy service when YOU ARE PAYING THEM A HUGE COMMISSION!",
            "You learned a good lesson here. Agents are not the experts anymore. There are enough tools available that you will soon become the subject matter expert in the cities and neighborhoods you are looking into.  You will send them the properties you want to see in person and they either go themselves or send a junior agent. Once you’re in contract then they pass you onto a TC and/or lawyer who take the lead from there.  You may use inspectors they recommend but you can easily find your own.  Hard to find agents that provide real value.",
            "Way to go. This realtor was thinking that they could just impress you enough with a more expensive house so that you’d forget your boundaries.",
            "I had to fire my realtor too. I told her straight up I am not looking for a project house. I did not want to live through a remodel of kitchens or bathrooms. What did she repeatedly show me? Houses that needed gut jobs on kitchens and bathrooms. It was so frustrating. I had a healthy budget for the area, there was inventory (early 00's). I met her at an open house with fully renovated kitchen and bathrooms. I still don't know how she chose the houses she showed me...",
            "I would have put in offers on all of them for 490. I fired my last one too",
            "$510k wouldn’t be considered out of budget for a $500k max limit because the normal accepted practice is the buyer will offer some amount less then asking. An offer of $500k is not insulting for a $510k asking. \n\nAt least all that was true when I bought my first home some 10 years ago…… when I sold it and bought a new one, you were expected to offer 3-5% over asking if you wanted a chance to compete with mega corporations paying cash sight unseen.\n\nEdit because i forgot to add: The rest is bullshit. The realtor wanted a bigger sales commission and was hoping you would fall in love with something you didn’t want to pay for.",
            "We avoided a real estate agent when we purchased our house (closed this month). We found the houses ourselves. We scheduled our own tours. We made our offer through our real estate attorney.\n\nIt saved a lot of headaches.",
            "Is hiring a realtor to buy a house a thing in the US? I’ve never even heard of this. We just hire them here to sell, not to buy. Perfectly capable of browsing houses online and going to look at them myself.",
            "Yes dump them. I had two bad realtors. The second, did ok, but we ended up doing all the work for him.\n\nIt is much more stress, and I felt like he didn't deserve a commission.\n\nFirst one wouldn't take use to houses we wanted to see, was taking us the the literal ghetto. Where there were gangs on the corner, and trash cans where people were burning shit in the front yard. Shopping carts in front of most of the houses. They were way over priced. They kept telling us buy anything, it is only going to go up.\n\nWe refused, and he was trying to hold us to an agreement we made that we wouldn't use another realtor for 6 months. We decided to rent for a bit and let the bubble pop. It did, and we bought one later.\n\nThat guy. Would take us all over looking at houses we didn't want. We would give him listings, tell him to schedule tours, and come back the next day. It was like starting fresh when we did. Where did you want to look ? At the listings we gave you yesterday. We eventually found a house in the neighborhood we liked, and then after missing out on it, we found another that was similar down the street. He didn't do emails. So he missed a problem in the closing contract. We had to get it redone last minute because we caught it before signing. Part of our bid was the bank would pay closing, and we would pay more in total price. They agreed, but didn't put it in the contract. Wanting about 8k more at signing.\n\nFind someone that isn't lazy, that pays attention. And ffs uses email. If they are bragging about the calculator they bought back in the 70's run. That was an actual thing that happened.",
            "I would have done the same, we went with someone else because all the first dude did was send automated MLS emails and the realtor we went with texted us specific properties and was quick to book showings.",
            "My first realtor went into hiding and terminated our contract after my first place fell through, but I had to deal with the constant high water mark listings with him. The second realtor was a much better realtor, but I also re-did my pre-approval letter with my bank for the maximum amount I was willing to borrow not the maximum amount I could borrow.",
            "Soooooo my wife and I went through USAA for purchasing our first house. The person we spoke to at USAA made it VERY clear that if we didn’t like our realtor to call him and he’d assign somebody else to us. The first realtor only communicated via text or email and never met up with us to see houses. We dropped his ass and explained to USAA why. The second realtor was the FIRE!  She would come to our house with tons of listings and would drive us to all the houses. We explained what our budget was, ~450k, and she rolled with it. She never showed us a house that was way above our budget. We had absolute wiggle room but we stood firm. +50 houses later we got it and I’m glad we changed realtors.\n\nPS: She and her husband would come around every year after we purchased the house to plant tomatoes, hang out and drink beers. Best people ever!",
            "Ugh. I had a realtor like this when I was downsizing after my divorce. Kept showing me houses that were bigger and more expensive than what I was already in. Smh.",
            "Did she accept that she'd been fired?",
            "I know some people who sort of miraculously did the same thing. I mean, they were working with a realtor but somehow not through their intentions but sort of naturally got hooked up with someone who listened to the criteria they wanted and was extremely prepared with printouts on everything and detailed knowledge of every possibility.\n\nI was told that their feeling about the first realtor, who kept sending them places that needed a lot of work, etc., was, \"She hates us.\"",
            "I didn’t use a realtor, but I did ask a bank that my family banks with for a pre-approval, I knew my budget and was planning on putting down ~15%. \n\nWell.. this bank said, oh no, we don’t work with anyone putting less than 20% down, you’d have to pay PMI 😱 - just get $25k from your mom. Ummmm, look at you offering up my mom’s money to me! It was just so condescending and presumptuous, there was a definite tone in the response. \n\nI also knocked out any other bank that made a big deal about PMI. Based on my numbers it was only $40/month for 2 years and so many were so rude about it.",
            "Yeah, these price fixing shit bags need to be flat fee.  Showing a 100k house is the same effort as a 900k house, open the door and let people figure it out.",
            "Asking you to liquidate your  401k is absurd, and frankly unethical. \n\nAs I realtor, I’ve cringed at a lot of these comments. There are bad realtors out there for sure. I don’t think many people realize the effort that we ( good and ethical realtors ) put in.  It’s a thankless job. Most of our work is done for free. We are up all night negotiating, (for free) unless sale goes through. Thep paperwork takes time. And no matter what, we are trained and know how to negotiate. Know little ins and outs the gen pop is not aware of. We are constantly spoken down to , treated with disrespect, and expected to perform miracles. \n\nWhy do I do it? For the good clients. The clients who have become like family. I’ve gotten people in homes they never thought they could get into. Again, unlike the layperson , I am up to date on local grants, subsidies, etc. \n\nIf AI renders us useless , so be it. People might think they might be saving money, but they’ll be missing out on what only a human being can do. \n\nAlso, I can think of many transactions where buyer and seller would have killed each other - not have been able to make an agreement had there not not been an intermediary. A lot of our job is akin to being a psychologist. \n\n\nI understand the frustration with realtors but we’re not all as bad as you think. And we work so hard .",
            "Realtors don't work, they take from people.",
            "We fired the first realtor we found. He kept sending us really small houses that were well over budget. I found my realtor on Reddit actually in our cities subreddit. He listened, sent us houses that were already on our list and we closed on a lovely house.",
            "You may still have to pay even if you get another depends on the contract. Some hold you for 9  months regardless.",
            "Just so everyone knows this story’s impact can change drastically into the realtors favor if their budget was not market appropriate. I’m going to assume that this was an area that  had a decent inventory around that price point?",
            "78% of home buyers find the home they eventually purchase themselves. You’re not alone.",
            "You just wanted to rant but you were buying?  Why not just rant a home instead of buying?  Confused...!?!?!?!",
            "The realtor needed to wait until you saw all the homes in your budget and complaining about how shitty they were.",
            "Sorry about the hijacking of this post for my own question! I ended up not buying a house, but 2 years ago I found a realtor and I had to sign a contract that I’d use him for the next 12 months. Is this normal? I see posts about people firing realtors but I didn’t know if that was possible with the contact I had signed. Just wanna know for future reference.",
            "Your realtors are sending you houses?! I must have had the most useless realtor ever lol. The one house she sent us was her own listing. Didn’t tell us a thing about it but the address. Didn’t even send us pictures. She wanted to do private showing and then an off market sale. \n\nWe looked at the map. Railroad in the backyard lmao",
            "get her outta there!",
            "This post pretty much confirms my plan… use a realtor to sell a home, but purchase a house unattached to an agent. If agents are motivated by money, I’ll go with the seller’s agent. They make more, and I get the house I want.",
            "Good call. I had a buddy who's realtor was like that and it took him forever to find a place because they kept showing him stuff over his budget. Same kind of nonsense \"oh but you got approved for so much more, you can swing it!\". Wasted a ton of his time. \n\n\nSome people get into it thinking it will be easy money and it's usually pretty obvious pretty quick. \n\n\nThey didn't want to find you the home you wanted, they wanted you to get them as much commission as possible. ",
            "I’ve been a Realtor for almost 20yrs… I would have fired her/him for you. When someone tells me their budget and I confirm it with their lender, I will only show them properties within those parameters.  Only once have I shown someone above their hard number and thats because everything on the low end was not in the types of neighborhoods she wanted to live in. Oh and she fell in love with the house as soon as she walked in the door, we went under contract and closed 3 weeks later.",
            "She is showing you her own listings.",
            "I swear, when my (now-ex) and I were house shopping for the first time in my life, we'd talk with an agent and say \"our budget is x, and we need to live here (inside the county we live in)\" and literally the next words out of their mouth would be to suggest a house that is at least 15% more than our budget, and \"only\" a couple of miles outside the county. The majority of them exist only make used car salesmen seem honorable, I'm sure of it.\n\nOne or two, I assumed, were trying to push houses where they were the selling agent. But every single damned one?\n\nEdit: has ANYONE ended up buying a house that your agent found for you, that you hadn't already known about from Redfin or someplace?",
            "We stopped working with a realtor during our first home buy after she rolled up to a home showing that was scheduled days in advance basically in pajamas and high as a kite. She couldn’t even finish a sentence without forgetting what she was talking about.",
            "Agent here- you did the right thing. Please know we are not all like this. It’s the worst of us that give us the tarnish reputation that realtors carry. I’m sorry, please do some “realtor shopping” and find someone who you can trust and understands you. Happy Home buying 💖🏡",
            "When I first bought my house I got rid of my first realtor. Didn’t show us anything that we wanted, didn’t stay within budget and didn’t even try to stay in same area I was looking. Our second one was night and day difference.",
            "Absolutely right move.  Good for you.",
            "Good for you.",
            "Based",
            "Trust your gut. If your realtor sucks and isn’t listening to you, move on. Same thing with lawyers, appraisers, construction, etc. Get second opinions and trust your gut.",
            "About 6 months ago I had to part ways with a realtor.  I gave a ball park figure on how much I wanted to spend and one thing that I absolutely did not want, a house with a HOA.  She showed me three, all of them with an HOA.",
            "Fire her by certified mail.",
            "Right choice. Most places the market is just horrible right now... 28% of homes being bought/sold are cash sales. To a seller or seller's agent, that's a low-risk transaction and a fast close.",
            "I had so many issues with realtors. I just don’t get the issue. We would say we were looking for these things….and all of the houses we were being shown had zero of the things we were asking for….and usually not even in the price range. It really made no sense. And when I would mention, this isn’t what we are looking for, she would say something like, but this buyer is really motivated to sell, etc… Yea, I don’t really care, it meets zero of our needs. She would get confused like she didn’t understand what our issue was.",
            "I think realtors are a racket! I went through 4 while selling my house several years ago. They're a lot of talk and very little action in my experience. Most do not deserve the massive commission.",
            "She has no idea what your assets are. She isn’t the lender.  Absolutely smart idea to drop this person.",
            "In the same boat (looking to buy a home), and we’ve been blessed with the two finest realtors (for us)! Why two? Because we’re in NorCal, and we have to look from the coast and Bay Area all the mf way to the Sierra foothills. But I digress— once you find the right realtor it becomes a LOT easier. Best of luck to you!!!",
            "Would you liquidate your 401k and give it to me?",
            "You not need to pay PMI with less than 20%. You do not need to liquidate a 401k for a home downpayment.",
            "lol",
            "I have never read an explanation on why realtors are actually necessary. They just seem like an unnecessary middle person in the process who financially benefits by making things complicated.",
            "No- I would fire too",
            "Good on you. You don’t have to use a realtor that doesn’t have your best interest in mind. She’ll make more money following the buyer’s budget than trying to strong arm her buyers into homes. And since the closest home asking price was over $100K more than what you want to pay, there’s almost no chance at all that any house she showed you would come in anywhere close to your budget.",
            "You're doing the work because the houses for sale are no longer in a black book in a real estate office in a strip mall like they were in the 1980s.\n\nYou have access to effectively the same homes they do.  You need them to unlock doors and act as the appointment setter.  You also need them to fill out some paperwork and answer some questions.\n\nRealtors are in for a rather rude awakening...  it happened to travel agents, it happened to stock brokers, it will happen to them.",
            "Feel need to point out realtors are probably a big reason that corporations buying houses is going so well. Deal with scam artists you pay to screw you or deal with scam artists whose check will clear? Becomes no contest.",
            "How did your initial consultation go with her?",
            "Good!! Serves her right.",
            "While I hear you that you feel you are getting pushed higher is it possible that your area dictates you spend about $650k+ to get what you are looking for?\n\nI get a lot of those people they started looking 10 years ago and just now get serious and float me their desire for a 3 bed 2.5 bath with garage for a 2015 price… then they get caught up in every gotcha listing like an occupied foreclosure or an auction or a house with mold just constantly asking to see properties they have no business dealing with and me having to explain why the price appears so good.\n\nPersonally I don’t push people higher often but sometimes I do a little for their own good or just out of necessity if they were being unreasonable for what they think they are getting in todays market.  I just sold a house for $700k to 2 very high income folks ($500k+ / year) who I had suggested keeping the budget so low seemed a little counter productive bc they have 1 child and plan on more and everything at that range is small, or in an area with schools they wouldn’t use and instead move again or pay for private.  I didn’t push them too hard for fear of getting fired.  They ended up buying a dated 2 bed with no sunlight in an area where they wouldn’t let their kids go to public school.  Now they have something that will be hard as hell to sell, they’ll need to move again in < 5 years, but appeared to be a good “value” when for $900k-$1M or so they could have gotten a much nicer area and house with 3 beds they likely could of kept for 15+ years and would be easy to sell when they need to and certainly not be stretched thin by the payment.",
            "No one needs a realtor this day and age with the internet, they’re just greedy leaches anyways.",
            "How do you guys afford houses 500k+ anyway. I'm so jelly",
            "Unpopular opinion- realtors will not be employed in today’s roll within 5 years.  Realtors in modern day really do know more than zillow because NAR sold them out",
            "You were the perfect, easy, client and your realtor thought \"$15k commission is nice, but $20k would be nicer!\"\n\nDon't pay this exorbitant fee.  Find a real estate lawyer for the contract review and an agent who'll schedule showings for a flat fee.  You will save thousands of dollars. \n\nThe industry has conditioned buyers to pay a $10k tacky blazer fee to people with almost no training or expertise.  There is a reason the realtor subreddits read like MLM support groups.",
            "I had a realtor once that bought every house I mentioned I liked that was in my budget that her office didn't have listed and then started renting them out while she showed me shit I couldn't afford",
            "I bought my house ages ago but went through 5 agents bc no one listened to us. First guy, we gave the town we wanted. He took us to 4 houses in a town we definitely didn't want. No idea why. 3 others did the same thing as OPs with the cost. At the time, my husband was commuting on the railroad and the monthy ticket was pricey. We knew our budget. One agent actually said \" well do you have another $ 10,000?\"  My husband said \" oh, yeah. I forgot it was in my back pocket\". Another kept pushing houses with rental apartments bc \" it pays your mortgage.\" The final agent called us the day after we spoke to her, had 5 houses lined up, at or under our price, in the town we wanted. We made an offer immediately.  I never understood the first guy with the wrong town, but I assumed the other 3 were just interested in a higher commission. It made no sense otherwise.",
            "Realtors/Brokers split 6% of the sales price of the house.  Meanwhile you all complain about a bank charging a 1/2% loan fee.\n\nWho did more work?   The realtor who looked up nmls and got combinations to go into homes or the 5 people getting your mortgage done?    Well, I can tell you that the realtor definitely didn’t do 12x the work.",
            "She’s not working for you, she’s looking after her commission. Good move to move on. Had a realtor do this to me two times until I finally told them this is my price range don’t move out of it for any reason. She showed us another few homes way out of my price range, fired her three days later",
            "Just like a car salesman",
            "Our last house purchase - I just saw it online and contacted the listing agent.  Never had a buyers agent.",
            "They are all greedy af. I will walk away from someone at a party if they say they are a realtor 🤣",
            "Suggesting you liquidate your 401(K) to buy a house is just financially stupid.  Clearly she was out of touch with what you guys wanted and you made the right choice.",
            "Showing me houses beyond budget is just encouraging me to put a bid in at budget/way below asking.  Don’t even start with the “but you’ll offend the seller” BS…",
            "Real estate licenses pretty much come falling out of the sky onto random people. They are not going to do much more than you are doing already",
            "My realtor showed us a home $100k over our budget. We live in it now. Lol. We had looked next door, and it didn't fit our needs, and while there she got a call the next door was going on the market the next day. She offered to just look, and we fell in love. \n\n$200k iver is crazy, though.",
            "Good call. There are other realtors out there. We had a hard line at 350k. We just bought a house for that much and we’re very glad we stuck to our limit as closing costs really do compound. You’ll find a good realtor, it may just take patience.",
            "You did the smart thing. She just wanted a bigger payoff. She had no real interest in helping you. Best of luck!",
            "With this market realtors at the devil.  They served a purpose before the internet.  Now they just inflate the price of homes.  They make you sign all this crap telling you everything they can't do, and are just bonded agents to open a door.  My job I used to have to relocate often every 2-3 years.  Ditch agents I have saved enough to by a house.  Find a real estate lawyer where you want to buy, you can close for $2-3k in fees.  Not $30,000.  For sale by owner, or call the listing agent yourself.  But then have to deal with them trying to represent both of you.  My rant complete.",
            "49% of realtors process 1 or fewer transactions per year. This means many are not serious agents or they suck. I have fired two. Everyone understands and it’s not a big deal.",
            "I've bought a few too many houses over my lifetime (Another story).\n\nRealtors (in my opinion) run the gammat. People that do a great job, listening to your needs and concerns. Our daughter recently found a wonderful woman that helped her find the right place.\n\nAt the other end of the spectrum. They struggle to find their way home each night.\nZero input, zero knowledge, zero effort.\n\nThe trick is to figure out where they fit in that range ASAP.\n\nWe sold my Grandma's house. Since the house was in the country, testing the well for contamination was a huge deal.\n\nFor some reason the results from the test went to the realtor, not us.\nShe couldn't figure out what the results meant. \n\nWhat it meant was, we had to drill a new well. She didn't understand why I was disappointed...\n\nIt was $9,000 in 1986 dollars...",
            "Definitely did the right thing.  When we bought our house back in 2016 kinda the same thing but back then you could actually negotiate people down.  She would never send us houses and then act surprised and say she didn’t see the house we sent her.  This happened so many times.  Then when we’d negotiate the price down on these houses that were vacant for over a year but wanted to see if we could get them down some more someone would always swoop in and take the house.  I think either she or a coworker were giving information to other buyers as to what we had negotiated the house down and they’d buy the house at that price.  Happened many a times.  When we finally dumped her we bought a house almost right away and we did negotiate it down substantially.  Good for you there are bad ones out there that don’t have your best interest in mind",
            "The more she can get you to spend, the more she makes in commission.  When my grandson bought his first house, I actually found it online and pointed it out to his realtor, who was great.  The location was great, and the house was adequate for his immediate needs.  She walked him through every step of the way in getting it, financing it, and gave him a Lowe's card for $100 for minor stuff.  Thanks, Renee!",
            "We fired our first for the same thing. The guy we ended up using said she's known for that. They make commission on the higher sale cost and couldn't give less of a shit if you get foreclosed on later on. \n\nWe were in the same boat. Pre approved for way more than our budget we wanted to spend.",
            "90% of all realtors suck. The barrier to entry is fairly low and when the market is hot, they can earn insane amounts of money for very little effort and a little bit of pushiness. \n\nThe entire system badly needs disruption by improved transparency and self serve shopping, with a pro to help near the end of the process for a flat fee.",
            "I mean realtors, doctors, lawyers…they all work for you. If they aren’t meeting your expectation you are absolutely entitled to “fire” them. Not all of them will meet your expectations and that’s ok. Move on to one who will. \n\nWe loved our realtors (team of 2) and they loved us. We did TONS of research, even driving through neighborhoods that had houses we were interested in to see if we liked the neighborhood. We sent them houses we liked. They sent us some they thought we might like. Everything they sent us was generally what we were looking for. \n\nThey even got us a mortgage company that shaved us from 3.6 to 2.6. They setup the inspection and were able to recommend people who could do some minor repairs as well as a roofing company. Then at the closing they got us a bottle of Veuve and some Tiffany champagne glasses which was a really nice touch. \n\nKeep in mind, your realtor is likely going to make about $15,000 off you. Think about that number then ask yourself if you’re getting $15k worth of service. We certainly did.",
            "I’m more intrigued that you’re a first time homebuyer with 100k to put down, good for you!",
            "Same thing happened to us. I finally said enough and did my own research. Bought from owner with no realtor involved.",
            "I really despise these kind of realtors. Greed, greed, greed.",
            "Don't know why I was showed this sub reddit and post but I hate greedy salespeople like that. Had to buy a new mattress and went to GardenerWhite and told them my budget was $1000, the fucker starts showing me mattresses that cost $5000 to $3500 and I just got pissed and left. Never again am I going there. These fuckers just want a bigger cut.",
            "Agents are the worst, hence why they’re being phased out of the process. Not needed anymore with internet",
            "Always remember,  the realtor works for you!",
            "I’ve only bought one house thus far.  And I had a very similar experience where I had to find the house.  When we asked if we could go check it out he was like it’s not in the realtor website.  I was like there is a sale sign at the door!\n\nOnly reason we stuck with ours was we got a deal through the bank if we used him.  \n\nThe laziness of some realtors is beyond ridiculous.",
            "And let me guess - that realtor is probably one of the top in her marketplace with hundreds of good reviews?",
            "I've not really worked with a good realtor. The ones I have worked with have been adequate. The best was a family friend and we did most of the shopping, he just used his MLS to get access and then handled the paperwork, communication, etc. So honestly he may have been great but  we knew exactly what we were looking for and my wife was unemployed and on Zillow 4 hours a day at that point in the move.\n\nA lot of them are quite thirsty. On standard commissions every extra $100K on the transaction is another $3K for them. Since the median income for agents is like $65K a year that's significant. I'm sure they also go through the delisons of grandeur a lot, with potential clients wants actually costing 20% or more than their initial budget. And of course, for future referrals, if you end up being unhappy with your home you're not going to refer your agent to someone else. \n\nHowever, most clients probably are not extraordinarily financially astute but a good agent knows how to read their client and listens. Thus, you did the right thing. Agents are numerous, as everyone seems to think it's a side hustle.",
            "That the one part I didn't understand with having a realtor \nIs like why am I the one have to look for houses all the time and send you the information why are you not doing anything. \nI was stressing out over finding a house so bad lately I ended up in hospital be of stress of trying to find a house and in 3 years of looking I lost almost 200k on trying to find a house",
            "She sounds pretty useless",
            "Realtors (not all) do this a lot. They'll show you in your price range then show you above so you can \"see what's out there and what you can get if you raised your budget.\"  It's all about that commission. You see something super nice send they hope you fall in love enough to go into debt you can't afford. If they're not showing you listings you send run don't walk to another realtor.",
            "She showed you the internet replaced her. Don’t use a realtor people.",
            "Realtors are a scam job",
            "Wow what a fool he is. And so disrespectful.",
            "Tip: don’t get your own realtor. Use the listing agent. You’ll have a way better chance of buying.",
            "Heck, my realtor wouldn’t even show me houses that were above what I was approved for. We got our approval raised when we negotiated a lower interest rate and he confirmed with the lender before showing us more expensive houses.",
            "I work in real estate as a marketing director for a firm. You are absolutely in the right. We actually just fired an agent because he didn’t want to take leads that were under like $800k. He was also a new realtor, so that probably won’t pan out for a while for him. \nSadly, some realtors are only in it for the money and not to actually help people find their perfect home. It’s ridiculous, but true. Those aren’t the kind of realtors you want. I would’ve done the same thing!",
            "I listed my home with a realtor came up with a firm sale price. Two days later she comes to me with an offer 45% under that price which was 65% under the list price. Tried to get me to accept it because ( it’s the best offer she’s had) it had been on the market two days! Ended my contract with her that day waited six months listed it with a different agent and sold it for 10% over asking.",
            "A realtor is the only person you pay that never wants to see you again.  \n\n\nEverything you know about customer service,  integrity, etc does not apply to realtor.  \n\n\nThey want to spend as little time and effort is possible while getting you to pay as much as possible.   \n\n\nPerhaps Zillow or a similar service would be a better fit for you",
            "It all depends on the market you are in, but when I worked in real estate it was common knowledge that, on average, homes would sell for about 10% less than the listing price. Of course in today's market we sometimes see home buyers bidding for prices above the advertised listing price. Again, it all depends on the market you are buying into, but it is worth submitting bids under the asking price if you are interested in a property.",
            "It’s all about their commission.",
            "Real estate agents are the biggest scammers ever. What is the purpose in today’s world anyway?",
            "You found several homes in your price range and that you presumably liked.\n\nMost agents are worthless. I hate that they’re a necessity in most cases.",
            "I purchased a home over budget but no by a lot. It has turned out to be a fantastic investment and home. Real Estate agents work on commission so they want to sell up. Get a buyers agent that works for you.",
            "The market is flooded with realtors and alot have very little experience.  The knowledge needed to pass the real estate licensing test doesn't actually equate to real estate knowledge.  I should know.  I had to my license for property management reasons and I promise you there's no way in hell i could be a competent realtor.\n\nYou did the right thing by firing her.  She sounds awful.",
            "This happened to us and we were buying our first house. Realtor explained how we could afford things. We put an offer on a house that was 25k above our budget (250).and 50 over asking. It was accepted. Our offer was contingent on inspection and the inspection failed hard. Our realtor kept pressuring us to stay with the deal and that the 50k in repairs was not a big deal and we could always get a loan. I fired his ass on the spot, called his supervisor and explained what happened, and then told them to fuck off. \n\nWe are now in a much better house because we found a realtor who cares about us and not about the paycheck.",
            "Now imagine the people who rely on the realtor because they don’t have the financial acumen for such decisions. People blindly follow advice from “professionals” without realizing the pros are hawking a product always/forever with limited exceptions.",
            "Realtors are shit from my experience. When I was looking for my first house I had a hard time finding a decent house in my price range (less than 100k). I ended up finding a house I liked same day it was listed. Realtor took me to look at it and I wanted to put in an offer. I asked him for advice on what to offer and he pretty much just shrugged his shoulders and said it was up to me. Being young and naive I ended up paying asking price for it.\n\n 6 years later I found out I overpaid and sold the house at a $12000 loss. Hard lesson learned that he didn't want advise me on resale value and make a lower offer because the less I paid the less he would make on commission. I did get lucky and sold the house myself and only paid something like $300 bucks to a lawyer to write up my sales contract instead of paying 5% or more  for the privelage of them posting some pictures on a website.",
            "In my opinion real estate is fairly complicated, at least behind the scenes, therefore part-time real estate sales people, soccer moms, just don't have the experience to properly serve their clients \nAgain this is just my experience your experience may be different",
            "The problem is that all of them do",
            "I think the agent must’ve gotten this buyer confused with someone else. No way you’re sending houses *40%* over budget. That’s insane. \n\nOh, and to the point about getting you to spend more money. No one cares. Getting you to spend even a crazy $100k extra only nets the average agent, what? A couple thousand after all is said and done? Maybe? It could be way less. Contrary to popular belief, agents don’t get paid enough to upsell you, they actually get paid *too little* to care how much you spend.",
            "The only industry that the worse of a job you do for your client, the more you get paid.",
            "Our first realtor was like that. She got fired. Our second di a *really* good job; either showing stuff only in budget, or, the house we got which was way out of budget, but she was pretty sure was over priced. We ended up getting the place (which was fantastic) for just a hair over. (Like 5k on a half million house)",
            "The pay difference is pretty negligible compared to getting the sale quicker.  100k is sales price is only 3k commission before the split and/or referral fees.  You are also almost never going to get someone to up there budget that much.  Selling a house quickly at 500k is much more lucrative than trying to talk the buyer in to buying a 600k house.",
            "I almost got fired for showing homes 50k over budget. Never again.",
            "She would have downplayed major defects",
            "Most realtors are con artists. Basically salespeople with a realtors lisence. They sell what they want to sell you, not what you want to buy. I can tell you a milllion stories or dummy illegal realtor behavior.",
            "The audacity to tell someone to liquidate their 401k. This is not someone I would trust with the biggest transaction of my life.",
            "Saaaame. After almost a year of house hunting, I contracted on my literal dream starter house 20 days after firing my old realtor and hiring a new one.",
            "Explain please,  curious to hear your story.",
            "Don’t ever listen to a buyers realtor. Initially they are there to open doors, that’s it. Later they are there for the paperwork. They are not specialists for home construction, nor should they give you advice how to do some repair (because they aren’t technicians). \nAgain, THEY ARE THERE TO OPEN DOORS AND DO THE PAPERWORK.\nEven telling me about the wall color is TMI and just another persons opinion. Fuck’em!",
            "Us too. Don’t feel bad for a second.",
            "Same",
            "it's because if you buy a more expensive house she gets a bigger payment..",
            "Do tell.",
            "Nearly the same. We asked Realtor #1 about a specific house. She replied “ oh, it’s not a great location.” It happens to be in one of the more desirable locations of our town. We saw a few more houses and asked again. “Oh, it’s pretty chopped up, little flow among rooms, you wouldn’t like it.” Instead she’d show us over priced houses that needed tons of work. Fired her a week later. New Realtor, no questions asked, showed us the house. Bought the house, it’s got solid bones and it was move in ready, we love it.",
            "How did you find a good one and where? Any tips???",
            "Congratulations! Did you get another realtor or do it on your own?",
            "The first realtor I worked with really stunted my ability to go to more viewings and explore my options. She told me that real estate was her second job, and that was clear to see. I understand having other aspects of life (kids, pets, etc) but she had zero hustle and it wouldn't take long for houses to go off the market like *that.* I met a much better realtor on my own, and I'm sure he could have found me the perfect home if it wasn't for my personal finances.",
            "Happened to us too! Not exactly dream home, but something that was actually in budget and fit the neighborhood style we wanted.",
            "Very scummy. Idk if it's shadiness or just being stupid.",
            "Came here to say that. The realtor has probably already conned others out of liquidating their 401k’s to pay for houses they can’t afford so that she can get a bigger commission. Scummy.",
            "It's one thing to borrow against it to be non-contingent and pay back when your current house sells if you're short like 40k. Liquidating is really dumb.",
            "Same. Our agent showed us a couple houses that she picked to get us an idea of what the market looked like and then left it to us to find what we wanted. She would also get us into showings within minutes of finding something we wanted, could tell us all about every listing we found, and knew guys that could do quick inspections and quotes on repairs, aggressively negotiated any offer we wanted to make, and guessed to within a few thousand what a house would ultimately sell and appraise for.",
            "Had a realtor who did the same. Showed me crappy homes that were way overpriced though in my range. She had backup homes priced 100k over what I wanted to pay. I have a good paying 6 figure job and the whole time she kept trying to push my budget higher and higher. I also don’t want to be house poor. I left her quick.",
            "No, in the last seven years 99% of my buyers have brought the house that they wanted to me. While I do send them lots of homes and spend time looking for exactly what they want, sometimes I can't always see that thing that stands out to them in a home, that makes them say this is the house.",
            "Agreed! I’m on house 4 and I’ve always sent the home I was interested in to my realtor. They will of course have automated searches set up that email me listings each day based on my parameters. But for the most part they are setting up showings and pulling comps/detail for the homes I was interested and the neighborhoods/amenities.",
            "Agree. The house I finally bought the realtor didn’t initially show me because it was above the initial price range I asked to look at. I ended up negotiating down to my price range.",
            "Sure, but the commission difference between a 600,000 house and a 500,000 house isn't big enough to warrant spending a couple extra months showing a client around to houses they can't afford.",
            "The crazy part is that it would still probably be cheaper with attorneys on both sides rather than realtors. You would have much more educated representation also.",
            ">Just pay attorneys instead \n\nYou know your profession is scummy when people would rather deal with lawyers lmao",
            "Just some leeches on society",
            "Do car dealers next!",
            "This only goes for lower priced areas\n\nLuxury residential or even mid-range looks nothing like this and it’s a much more complicated process",
            "AI will replace many industries soon. But baristas, cleaners, farmers - the service class you think you are better than will continue.",
            "I used Redfin. Different times during the rush a few years back, but aside from unlocking the doors, evaluating property as a second set of eyes for disclosures such as cast iron plumbing, foundation issues, etc, everything else I sourced on my own. My agent did send me a few extra properties to review out of the 50 or so I booked on my own,  but to your point, they just take the emotion out of the numbers. \n\nI also found a great, unbiased and thorough home inspection company outside their network and set my own bank financing deals.",
            "This was how I did it too. My sister however is in a hotter market, where a lot of listings never make it to Zillow. \n\nThey had to get a realtor whom was in the know, someone whom could have showings arranged the day the MLS dropped.",
            "It is very dependent on the competitiveness of the market. Our realtor was great and got us into private showings the moment homes hit MLS, before they hit zillow or redfin. We placed offers on those homes within 1 hour of the showing and often before the official open house, repeated that a few times to close on our current home.",
            "That's why I will not use a buyer's agent unless the seller is paying.  I can find my own inspector and be with him/her during the inspection, find my own title company and hire an attorney for the paperwork.  I won't need a lender.  The agents charge way too much for what they provide with little recourse if there is a problem.",
            "Same thing here. We’re under contract currently, we found the house. We went to their open house. I just called my realtor after we exited the house, my wife said she liked it, and i immediately called my realtor and said send them an offer.",
            "My realtor would send me listings about a day before they showed up on the rest of the housing websites so that was pretty nice.",
            "It doesn’t sound like you need an agent at all",
            "You wait for open houses to see a home? Why?\n\nI tried to see homes asap & make an offer that day, why be part of the herd (unless I'm misunderstanding?)",
            "Why the fuck would you let your realtor know about your net worth? I have a mortgage broker who knows those things. I found the realtor separately",
            "Yeah let us know bc I would love the idea of no realtor commission",
            "Interesting, once you’re through the process you’ll have to let us know how it went.",
            "Until you have a client who thinks they can get a $600K property for 50% off.",
            "Honestly after my buying experience I’ve been thinking about it lol. I would be a “hands off” realtor, charge a flat rate that wouldn’t be much maybe 1-3k. I’ll send you some suggestions but really I’m just there for negotiations and information. \n\nIn this day and age, everything is online and you can schedule most viewings yourself online. I did the entire buying process myself and spoke to the lender directly. My realtor who was my cousin simply filled in some blanks, and was my middleman to the other realtor. \n\nI know there’s a few other people like me who want to do the house shopping mostly independent.",
            "If you're willing to listen to your clients wants and needs and put their goals and dreams ahead of everything else, you will make an excellent realtor and if you're seriously interested, I could probably put you in contact with someone who could get you through school for free. We need more people like you. More agents need to realize it's not about us. It's about our clients.",
            "My initial reaction was “because you’d be good at getting people to liquidate their 401ks…?” I trust that is not what you meant now lol.",
            "Did your lender give her the information?  I would have fired the lender as well if they did.",
            "Because it’s ridiculous to go tour a house if there’s absolutely no chance you’ll be able to buy it. Wasting everyone’s time.",
            "This! We also asked our lender to only be prequalified up to the maximum payment we were comfortable with, and we had done enough research to feel comfortable with the housing choices in that range. It really helped a lot to keep our realtor on track and for us to not be tempted to look at more expensive properties. When the lender initially told us how much we *could* qualify for, I almost spit out my drink. I actually laughed and told her she should absolutely not lend us that much money.",
            "I’m glad it worked out for you. Yeah, our pre-approval is for $1.1M. Which, by the way, seems absolutely ridiculous. We cannot afford a $1.1M house, especially because my wife plans to stop working for a few years once we have kids. \n\nWe are very debt averse though and live well below our means. We both grew up pretty poor and have lots of financial trauma from parents bankruptcies, repos, etc.",
            "No, we’re not interested in any of the homes she showed us. They were far too lavish for a first home. We are not looking for a forever home, just a starter home. She was showing us giant 3000 square foot houses with outdoor kitchens and giant pools etc. when we just want a simple 3/2.",
            "Many Americans agree with you. Most, probably.",
            "It's been the opposite experience for me, though I know what you're saying. I was referred by family to a buyer agent that was absolutely terrible. Slow to respond, constant excuses, \"didn't get my text, email\" \"Oops! I'm suddenly on vacation overseas!\" \"Oops! I got hacked and lost your info!\" etc. She would not sign the release of agency form. Her broker was completely unresponsive. Complaining to the local BoR would have gone to the same broker because he was on the board. I had no prior experience buying and I was locked down for a year.\n\nHired my cousin against my previous policy of not working with friends or family and she's been awesome. Everyone prior had said she was awesome. Won multiple awards, happy with her work ethic, etc. She found us a house last year and has been working with us on the long haul of finding the right piece of land for my current project.",
            "I legit tried that and no one would even talk to me. So that's not a hard rule everywhere...",
            "Maybe. \"House poor\" is a term used in real estate to describe homeowners who spend a large portion of their income on housing, leaving little money left over for other expenses.",
            "Yeah that makes sense. There are definitely a ton of homes in my area under $500k, I’m not in a high cost of living area.",
            "Probably right. Also seems stupid. Basically have a client going “take my money!” and instead going “ok!” she goes “hmm how can I squeeze more out of them?”",
            "I wouldn’t even know where to start unfortunately. I’ll definitely look into doing it myself, I just know nothing about it.",
            "You paid 3% to do all her work for her and successfully push the right offer offer over her objection? Wow. I’d be frustrated idk.",
            "Taking a $10k loan to furnish the place is one thing (still not the best idea but it is what it is), using it for a very large down payment is another thing entirely.",
            "Yes, in the U.S. it is common practice.",
            "Yup. Tons of homes in the 400-500 range. I knew what I wanted and there’s tons of inventory. 400-500 around here is a decent starter home, there’s actually lots in the 300-400 range too.",
            "They’re not shitty. $500k buys a very nice home in my area. You can get a decent home for $350k here.\n\nWhat I’m looking for is about 1800-2000 sq feet, 3 bedrooms + office, 2 baths, at least a quarter acre lot. Tons of those for under $500k.",
            "Most parts of the Midwest $500k will practically get you a (small) mansion.",
            "Nope. I found all three myself.",
            "Yes.  After we fired our first agent for not being able to find us any homes that worked for us. Our new agent with many years of experience met with us for less than an hour, and we discussed our budget and what kind of homes we had already seen. She found us 5 listings that week, and we spent one day with her seeing them. Our house had just dropped in price by 10k, putting it in our budget. Our offer was accepted 3 days later. We still live there after 20 years.",
            "Seriously— why suffer fools? 👍",
            "You may not realize this but it sounds like you don't have a clue. Closing cost of 30k vs 3k, man your funny.",
            "*gamut 🙂\n\n“They struggle to find their way home each night”😂",
            "BTW, when my grandson was at closing and we were moving in (we'd been given a key), I discovered we had no water.  I was living with my grandson since I was helping him raise his son.  Since the previous owner had moved back to PA 18 mos earlier, the entire system of copper water piping had been removed by thieves while it was sitting there with no one in it and someone (probably the seller's agent) had padlocked the crawl space door.  I'm sure the inspector we hired had simply sat in his car checking off stuff.  It cost the seller $6K to have it replaced when I called my grandson's realtor who was at the closing--she had it OK'd immediately.  The poor seller had to put it on a credit card.  Thanks again, Renee!",
            "What is so complicated behind the scenes?",
            "My Realtor was great. And paid for a bunch of things out of her commission as well including the inspector, cleaning crew, AND moving company. While staying not only 48k under our $450,000 budget for the exact style of home we wanted, but also getting them to drop the price by $14,000.\n\nHer welcome basket for the home was also a lot of what we needed for the first week of our new home. Food, hygiene products, etc.",
            "Not “all of them do”. There are many of us who are extremely professional and always act in our client’s best interests, even if it means losing out on income. Its unfortunate that agents like the one in op’s post are conducting themselves this way and further tarnishing our reputation. The great thing is, as a consumer everything is online and buyers and sellers are more than welcome to research agents before deciding to hire one. Things like past client reviews and number of closed sales speak volumes. I guarantee the ones that pull the crap mentioned here do not have glowing online presences.",
            "I always find this logic flawed, in my market a buyer spending 200k more only puts and extra 3k in my pocket. Who cares. Although I’ve had clients that want to spend 500k but want a 700k house. Then I become an educator not a sales person ",
            "Not at all. \n\nMy realtor encouraged me to buy the cheapest house of the 7 or so I looked at. Because he thought it was the best house for my situation.",
            "Not all, there are many professional agents who really are just trying to get their clients into the right homes. But as with all sales positions, there are a large chunk of unethical agents out there. Its something all sales positions deal with. Its low hanging fruit in sales and most people don't know how to spot it or say no for some reason.",
            "This is false, in fact realtors are OBLIGATED to work in the best interests of their CLIENTS. The realtor in the OP can be reported to the national board of realtors.",
            "Yes! This exactly. Realtors are obsolete.",
            "I always set the limit of 50k over because some people are delusional on what they think their house is worth and it sits/ has to lower price",
            "Not a realtor but there's definitely a time and place for doing something like that, especially if it gets the client exactly/more of what they're looking for. Prices can be negotiated after all.\n\nThat and people have no idea what things cost.",
            "There’s nothing wrong with calling/emailing and saying “I know your budget is 500k but this house has everything you want and is listed at 548k. Would you like to see it?  I think you’ll really like it”. The issues people have is either “you said $55k, but what about 800k?”  Or the worst - show someone a house they love and then tell them it way over budget.",
            "Downplayed issues and convinced them it was a good investment and whatever else it took to get them to buy so she’d get a bigger commission",
            "When we were working with a few, we had a VERY specific design type. They were not hard to find. We were shown everything but that style. This was from numerous realtors. It's like they don't listen and just send whatever they want. \n\nUseless.",
            "And people think car dealerships are scummy. (Yes, they do exist in 2024) ",
            "It’s not hard to get a realtors license either. There are more licensed realtors in the US than houses for sale.",
            "There are some that behave that way, but that is not the majority of them.  Realtors' bread and butter is repeat business and referrals, and those would be few and far between if they aren't acting in their client's best interest.  Or maybe I'm the odd one out that got into it because I actually want to help people.",
            "It’s sales for sure.  But ppl who are difficult don’t know they’re difficult either.\n\nIt’s a big purchase and its needles and pins, the biggest for some of their lifetime.  I wouldn’t wanna be an agent !!  I mean, ppl don’t maintain their cars and flip out if the bill is over $100 when it breaks.  So……",
            "Was that time on the market prior to the firing?",
            "Actually, the title company and mortgage broker does most of the paperwork. The purchase contract is fill in the blank. It’s more accurate to say that they open doors and coordinate communication between the seller, the buyer, and the lender. Not worth 3 percent by a long shot.",
            "I would expect their best value add to be helping with negotiations by using their industry experience…. And there are various stages of negotiations at different checkpoints…. And help close the deal with the buyers best interest (or to walk away from it if it’s not) \n\nUnfortunately this doesn’t happen nearly enough…. So I am aligned with your take on this",
            "They are not there to open doors and that's all. They can help in invaluable ways at all points of the process. They also help when the home inspection goes sideways or the seller is being an ass.",
            "Nope, it always depends on the person. We initially made contact with a buyers realtor because the realtor I had previously used to sell a home was unavailable for the property and had not been very helpful with the last couple of houses we had looked at. She literally was contacted and showed up 15 minutes later and walked us through the property, ended up calling her father (a registered plumber) about a question and we decided not to continue with that property. We ended up using her to purchase a different property (the final one we got during the insanity of 2020) after looking for another couple months. We will use her again as a buyers agent (and pay her) if we purchase again in the same city.",
            "good buyers realtors will have a book of connections for contractors of all types",
            "Yeah. And yet as a seller I'm paying the 2.5%. In what other contract am I paying for the other persons representation. Crazy.",
            "My girlfriend's \"family friend\" realtor insisted that all the foundation issues in a listing were \"fixed\" despite the buyer's extensive disclosures that there were recent issues and had been reoccurring for years and years in spite of tens and tens of thousands of dollars of foundation \"repair\".\n\nI argued that there were clearly still problems with the house and they were selling because they were tired of dealing with it.\n\nThe realtor just repeated herself over and over that they were \"fixed\". My girlfriend bought the house.  I put my own money up to try to have it inspected, so someone impartial would also tell her what a bad idea it was, but all the inspectors were very inconclusive since the house had already had so much work done. We'd only been dating a few months and I didn't want to be seen as bullying her out of something she wanted and was buying with her own money. I said my piece and she and her family decided their realtor friend knew more about it than I did.\n\nFoundation issues from day one. Quotes from foundation repair companies for tens of thousands more in \"repair\".\n\nAs far as I'm concerned that realtor gal is the scum of the earth and there isn't anything karma could do to her that would make me feel bad.",
            "Exactly. I feel like this is contributing to the problem for sure.",
            "We did end up buying a more expensive house, that’s the thing.",
            "If my client can only afford 60k then we look at everything from 20k to sometimes 70k. If it's been sitting for a while we might get it for less. If they are approved for 400k but want to look at homes in the 200k range, then that's what we do. Usually, they find they were expecting more than they can get at that price point, so we bump up until they find what they want. I don't try to make them like a house. It's got to be their decision. If they buy a house they don't like, nobody wins. They will be unhappy, and they will not refer me or use me again. \n\nI don't work in an area where here are million-dollar homes. My buyers have very little money and can't waste it on a poor deal. I try to be as helpful as possible. I know which lenders are having first-time buyer promotions, down payment assistance and who has the lowest closing costs. I answer questions, make calls to the lender to clarify issues, and keep them on track with paperwork the lender needs. I show up for all inspections and recommend my buyer be there too so they can ask questions. I go over the report with the buyer and explain what issues have to be fixed for the type of loan they have. I show up for estimates, structural engineers and surveyors. I call county auditors, health departments and check flood plains. Communicate with title and make sure my client knows how much they need to bring to closing and I show up at closing. Not because I'm going to get a check that day because I don't always get one day of close. I show up because someone I have worked closely with and now have a relationship with, has finally reached their goal of becoming a homeowner and we are all very thrilled for them!",
            "A little from Column A, a little from Column B",
            "Why not both?",
            "Greed. It’s greed, they just see dollar signs.",
            "In our market at the time 2020 the best thing our realtor could do was getting things scheduled right away for us. I’m the one who found our house, but she’s the one who got us in as the first people to see it, before any pictures had even been posted. That and dealing with all the junk between offer and closing. ",
            "Yeah. We used the same realtor for both our homes. Extremely happy with the results we got and always felt like she had our best interests in mind. But ultimately, no matter how many details we gavw about what we wanted in a home, we still knew the right houses when we found them.",
            "So like, what would you say you do here?",
            "What other explanation is there.  It's pretty extreme for someone to recommend pulling money from a 401k.",
            "An extra 3k to 6k for maybe another 6 hours of \"work\".  Sign me up.",
            "Ummm maybe throw some of those numbers in a calculator and get back to us. No rush",
            "This! Cars sell themselves. Car salespeople just make the process 1000 times harder.",
            "Huh, do people not do offer review dates in your sister's market?\n\n\nI live in Seattle, and bought a couple years ago before interest rates went up. It was a very hot market, but pretty much every house was guaranteed to be available for a week, because they all had offer review dates.",
            "That makes sense. I've occasionally done that in the past, but I wasn't buying when our market was like that. Now it has slowed down a lot so there's time to see things.",
            "That's interesting. I just replied to another comments saying that sellers around here do not accept offers before an open house. They want as many offers as possible and they want a bidding war.\n\nUnfortunately for them, it's not 2021-2022 anymore. Bidding wars only happen on really desirable places that are underpriced to begin with. Otherwise, the strategy fails. But they ALL try. They even set a date/time for offers to be submitted. And yet...sometimes there aren't any.",
            "Basically the same, but I don't make an offer without reading disclosures. So my realtor always gets those first. She goes through them as well and points out any weak part or missing docs, so that's helpful as well.",
            "The market isn't like that here. Nobody accepts an offer before an open house and it's useless to submit one. They want as many people to see it as possible, then the listing agent tries to get everybody in a bidding war.\n\nSometimes it works, other times it doesn't. It definitely isn't 2021-2022 anymore.",
            "I live in Australia and this is breaking my brain. Hiring a realtor to buy a house isn’t a thing. You browse the houses for sale in your area and they all have inspection times/contact info for the selling agent. You either go to the scheduled open inspection on a Saturday or organise your own during the week. Paying someone to schedule an inspection for you sounds fucking mental to me.",
            "The experience has been good so far. It’s really easy to create and send an offer. I haven’t had an offer accepted yet, but once I do it supposedly keeps track of all your deadlines for you. It’s definitely a “do it yourself” tool, but it’s saving me almost 40k.",
            "For sure - I’ll let you know! I mentioned below, but the experience has been good so far. It’s really easy to create and send an offer. I haven’t had an offer accepted yet, but once I do it supposedly keeps track of all your deadlines for you. It’s definitely a “do it yourself” tool, but it’s saving me almost 40k.",
            "Honestly lol",
            "I’m approved for more than what the property is listed for.\n\nIf the house was in good condition I had no problem paying over asking(like the house I’m closing on now)\n\nI just shared a bargaining point with my realtor and instead of just setting up the tour, he tells them I plan to offer less before I even stepped foot in the place.\n\nYou don’t see the issue with that? 🤔",
            "We felt the same way about $450K. There was no way we were going to sign up for that. We put $50K down, so it would have doubled our mortgage ($400K vs $200K), plus upped our taxes and insurance. This was 2004. I lost my job when the 2008 crash happened. I am the primary earner, and I was out of work 8 months. We would have been screwed if we took on all that debt. We skated through with no major issues because we do not carry a lot of debt.   Back then real estate was red hot. There were bidding wars. People were seeing their home values skyrocket from month to month. They took out second mortgages for remodels, etc... When it crashed, values dropped 40% almost overnight. I watched a lot of people lose jobs, lose their houses and have to either short sale or file for bankruptcy because they were so upside down in their houses. Meanwhile, our investment accounts dropped 40% as well. You are definitely doing the right thing here.",
            "Ugh what a waste of time!",
            "Oh. Thank you. Like, they're poor because they spent too much on the house and have expensive mortgage payments.",
            "What purpose does it solve? Do houses have open inspections on a weekend over there? Surely you guys can just find houses in your area that you like and then go have a look?",
            "Very good! That’s a realtor that basically has no morals or work ethic. I can’t stand when people are so dedicated to a shitty agent they don’t even allow themselves to open up to agents that are actually skillful or having some real work offerings",
            "Post your closing fees for a average home and location.",
            "legislation, lender rules, ethics, etc etc etc",
            "My friend is a real estate agent and she does stuff like this all the time.  She loves helping people buy their first homes and the gift baskets she does for them are so adorable.",
            "What state/ city pls!!",
            "My realtor said she’d be at the lawyers office to close with me, hit me up a few minutes before saying she couldn’t go. Said she’d swing by with a welcome gift later that day, nothing. Said she swing by sometime next week, nothing. She hit me up like 1 1/2 months later and I just said good and didn’t reply to any of her messages afterwards. I honestly didn’t expect anything, but don’t say you’re gonna do something and not.",
            "I've had a really good real estate agent! We gave her an absolutely preposterous budget (250k in the puget sound, with a FHA loan to boot) and she worked hard to find us some, even tho it took months and she could've spent the time on us working with her usual clients in the 700k+ range. We were driving several hours each time and she stuck with us until we finally found one so close to our goal location despite all odds.\n\nThey're rare, usually only word of mouth.",
            "I wonder if more realtors became fiduciaries that they’d be held to account for the best interest of their clients….",
            "Thanks for being one of the good ones. I was fortunate to find one of the good ones who was great! We nabbed my condo the day it was listed. She gave me good advice and I'm grateful.",
            "99% of them do",
            "As a buyer I would be okay with that if you said it's listed at x but I think we could get it at your budget. If you weren't pressuring me to go over budget on the offer I'd actually appreciate it.",
            "I respect the client and don’t show them anything over their budget.",
            "Up to 10k is my max.",
            "Our limit was $25k *over*...  which is what our future house was listed at.  We were blessed to get it for $25k *under* our target price",
            "As long as you communicate that with your buyers, that's great.  But if they tell you \"don't show us anything over $X\" and you explain why you want to show them $X+50K, and they still say no, don't do it.",
            "We went to go see a house that was hilariously out of our price range. Turned out to be a huge project, inside and out, but a lot great about it. We only went to see it on a lark because it was convenient. Turns out the sellers were about to lower it by a massive amount ... so: you never know. That said, for houses that aren't a shitshow and on the market for months, probably not a great idea. Some people go see stuff way out of their budget because it's neat and interesting, then become ultra-critical of what they can actually afford, which really does not serve them well.",
            "Yes, why listen to your client?  After all the higher the price, the more *you* make.\n\nIf your clients give you a budget and you “always set the limit of 50k over”, then you should be fired from all of your listings too.  Glad I never hired you.",
            "5-10% over is reasonable for that reason especially in a softer market. The perfect house could be priced too high. You don’t want to miss an opportunity simply because someone has over valued their home but is willing to come down. \n\nLikewise, as a buyer, I’d hate to miss a house at $505k if my budget was $500k\n\nHowever, I would have that discussion with the client first. If they still want to stick to the hard line, then stick to it.",
            "What design type? Now you've got me curious",
            "The things I would do to be able to buy directly from the Toyota/Honda factory and cut out all these damn middlemen...",
            "You're the odd one.  The same is true for car salesman and solar salesman.  Most are scumbags, but if you look hard enough, you'll find a good one.",
            "Sorry I’m dumb, I don’t understand the question. Are you asking if I spend one year looking for houses with my last realtor? If so, no. I started searching the end of 2023 independently, got disheartened by interest rates, waited a few months, started making a whole lot more money, and then started searching again in February with my ex-realtor. \n\nI worked with my ex-realtor from February to the first week of May. I could write paragraphs about how awful she was. At one point, she tried convincing us to commit mortgage fraud. It was awful. Fired her, switched to our current realtor, and it’s been amazing ever since.",
            "Absolutely agreed. The title company and the mortgage broker are doing the most heavy lifting!!!",
            "Agree, being a realtor is such a waste of a job. I wish we didn't need them and could just buy and sell houses and then have the title company and mortgage broker, if you're getting one, do the rest.",
            "Depends by market, but how terms are written in make a big deal. Knowing how to specify that the carpets being cleaned before possession can be the difference between the place being a mess or a $2500 credit ",
            "Actually most of their job is dealing with buyers like you who don’t value their time and drag them all over the place wanting to see houses that they know you aren’t going to buy…for months…with no pay.",
            "And if you are paying cash, you don’t need a buyers agent at all, just a good attorney, which you would need anyways with a realtor.",
            "When the inspection goes sideways? How can a realtor help? If the Inspection goes sideways, there is obviously something wrong with the house. Then the buyer/seller either negotiate or the buyer can walk away. \nThere is no way in hell I (as a hypothetical buyer) would let a realtor negotiate on her terms or whisper in my ear…. Only I know my finances and how and financial decision impacts me…. All I would do in case of a negotiation is tell my realtor to write up an amendment with my demands…. Which is paperwork for the realtor to do….",
            "But. Are they the best? Maybe if the realtor brought in 3 guys for estimates. But that's not the case. They have their guy, and you blindly assume the cost is good and they are good.\n\n\nOnce you own the home, you're going to get a few estimates and pick the one you like.",
            "But when you buy again you would benefit from the same deal.",
            "Right? I've used two. Both times we were the ones finding the houses and then they'd go unlock them for us. Totally worth the thousands and thousands they made off the deal.",
            "That she is stupid. I mean look at the execution on this one.",
            "The most likely other explanation is that OP has a list of non-negotiables they chose not to mention in this post that are impossible to find for under $500k. They could be ignoring those when doing their own searches but the realtor knows that if she shows them places going for $450k they'll get pissed for a different set of reasons.",
            "I don’t know about that. I’m looking in Middlesex county and have lost 7 bidding wars.",
            "Same in my area. Every time we've asked to see a place before the open house we get rejected.",
            "Ok yeah definitely a different market. I still don't see why seeing a home with your realtor on your own isn't better than attending a potentially crowded open house. I also wouldn't put such blanket assumptions about every seller out there as fact, some people (in any market probably) just want to sell or have extenuating circumstances where they need to sell & would be happy to skip an open house if they got a suitable offer. But yeah absolutely YMMV.",
            "It’s completely mental, but it wouldn’t be America if we didn’t squeeze every last dollar of profit out of everything we do.",
            "Paying someone to schedule an inspection makes sense if that person charges what personal assistants charge.",
            "Technically you can do it yourself if you want to, but most people don’t. A lot of people (especially people in this subreddit) *hate* realtors because they get paid 3-6% of the purchase price for their services and a lot of people think they’re glorified salespeople who don’t really do anything.",
            "Using your example in PA for a buyer there is 1% state tax, and optional title insurance that is a % set by the state. Guess it could be $30k if the home is $2,000,000 or more but not many markets like that except Philly and Pittsburg.",
            "And the realtor has nothing to do with that. Lender rules, fair housing, and such are lender obligations. There's virtually nothing a realtor can do that a real estate attorney, research, and lender can't do. Realtors have no expertise and will often try to show properties beyond the buyer's stated price point since they're commission-based. \n\nOf course, loan officers are salespeople, too, but at least the lender has compliance standards they have to meet.",
            "Your friend is a god send, please tell her that for us",
            "Your agent was a genie in the bottle! \nAnd yup- all the best agents are all word of mouth!",
            "How did she find you something??? I have a similarly impossible budget. It’s been months. I am finding all the houses myself too. She has an auto list but hasn’t helped with finding any. I’m ok with it but it’d be nice to have support. I kinda think it’s bc what I want doesn’t exist. Idk 🤷‍♀️",
            "Hey, I'm in this general area and looking for a realtor. Care to share in DM?",
            "Yeah, no pressure, I’ve never been able to buy a house with an unlimited budget.  I wouldn’t expect my clients to either",
            "Thank you for that. I set a hard limit with my first realtor and it made me feel so bad when she sent me links above that. Like, I know I don't have a lot of money or a super impressive budget but there are homes out there for me. (I did end up finding my home.)",
            "That’s a good way too.",
            "What the previous poster is saying is that after negotiations it likely is within their budget.",
            "Asking prices are quite often inflated and there’s nothing wrong with showing someone a house listed over budget so long as both parties understand the offer will be less. Has everything to do with communication and nothing to do with respect",
            "Thank you.",
            "Not bad either. I just explain why I do what I do and it’s not to push their budget but some of those 550k house might be well over priced and we can just keep an eye on it. I have an auto email that’s sends out houses every morning house that just came into the market in the specified price range and housing type",
            "Yeah, if they are that adamant then I wouldn’t, I’ve never had that scenario come up",
            "I do it to collect houses over priced, not evening listed at 500k was originally listed at 500k.  I always explain the strategy with clients.  I don’t necessarily show the houses over 500k, just have them there in case they sit.  If I have client like you who obviously has an issue with that then i won’t do it. Not about “ making more” I could care less, it’s a small amount",
            "Of course, I’ve never had a client say no after I explain it but if they did, I’d set the hard line as well",
            "Autocorrect got me. It was supposed to ask if the home you ultimately bought was on the market when you fired the first agent, the implication being that if it wasn’t, then the first agent never had a chance. \n\nSounds like she was a real idiot. They abound in every profession.",
            "You can do exactly that. Talk to a bank or mortgage lender, get pre-approved, figure out your payment on that amount monthly, adjust budget if necessary to fit the payment you can handle in your budget. Use one of the hundreds of home search apps to find a house you want. Talk directly to the selling agent (or owner is it is a for sale by owner) tell them you're pre-approved with money and want to make an offer. Download a home buying contract, fill in the basic info (address, price, any special conditions) and submit it. If you get accepted, talk to an inspector, make sure things look good and the house doesn't have any issues you're not comfortable with, talk to the title company and they'll handle things from there.",
            "Have you read the nightmare a buyer write about a few days ago on Reddit? Her realtor suggested a roofer to replace a roof, they closed the deal, roof was worked on by that roofer and a year later the new roof needs work. So the buyer, now owner,  finds out her realtor had recommended an unlicensed roofer who now ghosts her. Go figure! I bet the realtor had a deal going with the roofer, maybe it was her father in law or who knows who! — So yeah, some of those realtors are charlatans who are doing this only for themselves. Never trust a recommendation for a technician/worker from a realtor! As a buyer, find your workers yourself….",
            "Yes. But I'd rather pay them directly and negotiate a fixed price. Until we can roll the buyer realtor cost I to the loan from the buyer side, it won't happen. Which is weird, since we're doing that indirectly now anyway.",
            "There's no reason why the realtor can't say this.",
            "Except OP sent a list of houses that were possibly acceptable which I assume those checked the boxes.",
            "I’m all about hiring a realtor when I’m selling because I know they definitely do a better job than I could at selling it for top dollar, but as far as buying goes, yeah I really can’t see what they’re gonna do that I can’t.",
            "So there are a lot of variables, you can't escape certain things. TN has no sales tax or Florida.  Escrow is going to happen or pay your taxes up front.  But in just realtor fees.  Most people pay for a ton of extra fees not just the commission.  Those are the things I am talking about.  Take your time at closing and read everything.  Taxes, insurance for your area is what it is.  This is a huge topic, lots of good reddit on this.  Don't trust just me.",
            "It basically doesn't anymore in my area, unfortunately. It's gonna be a LONG time. This was back in 2019 and I can only imagine it got worse. Our house is now taxed at 300k, even tho there's no way we could actually find a buyer at that price I'd think. It barely passed inspection, it's tiny, there was a LOT of work to hide how bad the blackberry and ivy infestation is in the yard, the plumbing and wiring is sketch as hell because the owner did it all. \n\nIt took nearly a year of constant looking and we only lucked out because so many people were passing on it for all the signs we missed/chose to ignore.",
            "I'd have to find her info again but when I do I'll DM you! She works mostly northern western WA, kinda made an exception for us lol",
            "There's a house for sale on our block that is asking $500k and it's worth _maybe_ $400k. Owner died and family is trying to milk it for a payday. Been listed for months while a dozen other houses have sold in the same timeframe. (High-traffic, military area.)",
            "Yup, always be transparent.",
            "I think if you explain it and they’re good with it that’s a good strategy.",
            "My buyer realtor recommended his guy to do the inspection. Cash only. Seemed a bit rushed (but, he was available very fast).\n\nIf I was to hire a guy, I'd expect to spend a few hours with him going over everything. I am fairly experienced with home repairs because I've owned a home for a while now and I'm handy. The inspection didn't tell me anything I couldn't see myself, but it was good to have a second set of eyes.\n\n\nContingencies have a due date, so you don't really have the opportunity to do research and compare companies. If the realtor knows a guy who can do it tomorrow, you go with that guy.\n\nIf we didn't have the system we have, there would be better services to help through the process.",
            "These are normal home costs and are part of home ownership no matter if you use a Realtor or a lawyer. There are not usually any fees for buyers. You're just wrong, sold hundreds of homes for buyers and there are no extra fees. There are fees but like I stated earlier these are home ownership costs.",
            "Ugh",
            "Do you regret it or nah? Even with all the fixes.",
            "Happens all the time, there’s a house in my moms neighborhood where they over did the house,  all modern layout and fixtures, built extension on the back. Then they wanted to list it 150k over market price thinking they will get it.  Been on the market 3 months.  No price reductions.  Just letting it sit because they over built the neighborhood",
            "Personally no regrets, but it is a mixed bag. We were thankfully able to work with the seller on the electric, so that got added into the loan. Otherwise we couldn't afford it. There's SO MANY things we have to do that just wouldn't be an issue if this was a normal, well maintained house but. At least we have one. Our mortgage + repairs is less than rent in the same area for an apartment the same size and we have a yard + no landlord to fuck with us as a cherry on top. \n\nIf I was less handy around the house or had higher standards for my living space, it would be really rough. Nearly not worth it rough. But having a fairly stagnant \"rent\" after years chasing cheaper rentals and being stuck in shitty places, I'd rather be stuck in a mid place that I own. At least I can paint the walls and know nobody has the right to come in with 24 hours notice.",
            "I often wonder if I did this with our house. I don’t see this as my final home, but it certainly could be. It was a builder basic track home when we bought it 9 years ago. Our upgrades include resurface the pool, (pepbletec), new patio cover, full house with bamboo floors, marble countertops in kitchen, new cabinet faces with solid wood cabinets, full gut and remodel in master bath with very high end Italian tile, and US/German fixtures, etc. still have the garage to do. I’ve basically turned this builder basic track home to a nicer custom feel but it still has the same structural design, just with high end stuff. (Well except for the bathroom). I’ve put probably in total $120k in upgrades to the house since we’ve owned it, and we do love our home. (Although I’m still always on Realtor.com looking at a place with some property.  However the last thing I want to do is embark on another fixer upper, and nice homes on property are just out of my price range. So, here I stay, in my beautiful track home.",
            "That’s a good perspective thank you. I’m not terribly handy unfortunately.",
            "Yeah, you have to account for your neighborhood when listing.  My example, the house is listed 125k over the next highest sale in the neighborhood without being a bigger sqft house.   While those finishes will probably make you the next highest neighborhood sale, it wont get you an insane more amount. Kitchens and bathroom upgrades get your money back but when you go high end finishes, you won’t recoup it most likely.  Enjoy it though while your there"
        ]
    },
    "First Time Home Owner at 46": {
        "title": "First Time Home Owner at 46",
        "score": 1189,
        "url": "https://i.redd.it/c48mg2rbpz7d1.jpeg",
        "content": "After 20 years of paying off student loans, building a nest egg, saving some for retirement and saving for a down payment, and, honestly some long back and forth on whether to buy, I now own a home.  This is in no small part due to advice from this sub (including how to leverage a low-ish appraisal to renegotiate the  sales price of the home).  I am not an advice guy and I know times aren’t great, so I will just leave it at:   If you want a home, I sincerely hope it happens for you.  It is a great feeling and offers a real sense of accomplishment.  Thanks all. ",
        "num_comments": 46,
        "comments": [
            "Thank you u/Jbond970 for posting on r/FirstTimeHomeBuyer. \n\nPlease bear in mind our rules: (1) Be Nice (2) No Selling (3) No Self-Promotion. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FirstTimeHomeBuyer) if you have any questions or concerns.*",
            "I love black and white kitchens! Congratulations!",
            "Nice to see the cabinets go all the way up to the ceiling and a proper vent hood! Congrats!!",
            "Seeing this gives me so much more motivation! In my early 40s now and still haven’t bought my first house. With the current market and the fact that I’m waiting so long to buy it can get disheartening. Congratulations!!!",
            "40+ gang gang!",
            "Congrats. It's never too late to start. You are on right track. Beautiful home. Enjoy it. It's a real achievement that after paying for 20 years of student loans, you are able to buy the house.",
            "Thank you! Just turned 40, and I needed some hope that it wasn't too late. I'm so happy for you!",
            "Congrats! I love the large island.",
            "That is a GREAT kitchen. Congrats! Hope you have many good times and memories there.",
            "Congrats!!!!🎉",
            "So happy for you! I’m in that 40+ club. So thank you for giving me hope!",
            "So you’ll be done with payments at 76",
            "Congratulations!!",
            "Congrats! Enjoy your new home and that fantastic looking kitchen!",
            "Congrats 👏 👏",
            "Congratulations!",
            "Pure awesome! Congratulations 🎊!",
            "Beautiful 🤩",
            "Love the contrast! Congrats",
            "Congrats! I can’t wait to have the feeling you have right now.",
            "Very nice!! Great kitchen! Congratulations!!",
            "Congratulations! Also stunning color palate in your kitchen.",
            "Wow. Amazing kitchen! \n\nCongrats on becoming an owner.",
            "Zero to 60. This is phenomenal. Congrats.",
            "Congratulations!",
            "Congrats dawg!",
            "Congratulations!!",
            "Congrats !!",
            "Good on ya!",
            "Age does not matter. Congrats",
            "Congrats!",
            "Nice work man, congrats!",
            "That kitchen is to die for!",
            "It looks to be worth the wait!! Congrats!!!!",
            "Nice congrats",
            "congratulations!!!",
            "Looks amazing…congrats!!",
            "Congrats on the purchase. I love your kitchen. Can you say how tall your ceiling is and what size cabinets are those?",
            "Congratulations",
            "Looks amazing, congrats!",
            "Well no retirement for me till 72 , congrats on the house though",
            "Biden will forgive your student loans free education",
            "Such a basic thing yet so rare",
            "I was trying to provide a little hope with my post.  It was a long road- but totally worth it.",
            "45 and just bought a house. You can do it!! 😊",
            "61.  But thanks for playing."
        ]
    },
    "i am a mortgage lender": {
        "title": "i am a mortgage lender",
        "score": 229,
        "url": "https://www.reddit.com/r/FirstTimeHomeBuyer/comments/1dljbsg/i_am_a_mortgage_lender/",
        "content": "it is so discouraging.  I spend most of my day letting professionals making good money know that there is no way they can buy a home and keep the payment where they want it to be.  Some qualify for much more, but based on the cost of everything else , including child care, they are not comfortable going that high.  understandable.  i am in Florida and not only are prices sky high, but so is insurance.  ",
        "num_comments": 61,
        "comments": [
            "Thank you u/malibufeet for posting on r/FirstTimeHomeBuyer. \n\nPlease bear in mind our rules: (1) Be Nice (2) No Selling (3) No Self-Promotion. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FirstTimeHomeBuyer) if you have any questions or concerns.*",
            "Super appreciative of my mortgage guy and realtor for totally being upfront and honest about how messed up this market is. \nOur mortgage guy runs numbers at multiple sale prices for any house I go look at just to see what I can get away with offering and affording the payment 😅 \nThis sub makes me feel better that other people with decent jobs are also struggling",
            "The payment I can handle and it would be fixed.\n\nthe taxes, insurance, liability, fire, flood, title, water, sewer, electric, natural gas, garbage, HOA, sidewalks, SID, and I know I am forgetting some.",
            "For those you help,  we really appreciate it!",
            "If we weren’t buying for the long haul in a forever home with a baby on the way…we wouldn’t be buying. This market is craaaazy.",
            "My rule for the financing side of home buying: only you should be choosing the lender. Let the realtor be good at their specialty which doesn’t involve your credit.",
            "The whole economy is so discouraging right now. My wife and I make great money and basically living paycheck to paycheck which is just insane. Really stresses me out",
            "I appreciate your honesty. In the same boat in Florida and don't want to be house poor. In the meantime I just daydream on Zillow 😔",
            "It’s interesting how Florida went from affordable utopia to affordable utopia with expensive insurance to unaffordable with expensive insurance hellhole. \n\nI live near DC and yes houses are like $1M but insurance is only $80/month.",
            "How often do you see borrowers using their max approval limit, versus people being financially educated and understanding they should probably be buying way under the loan approval amount?\n\nWe bought during the pandemic and my wife had lost her job (our income was cut in half), so only my income was counted for the mortgage approval. It was a blessing in disguise, because we bought under the limit approved for just me. Had my wife been included, the limit would've doubled. We know we are financially secure if one of us loses a job has medical issues, etc.",
            "It is definitely appreciated. I've been looking in Florida for the last 3 months. The market here is absolutely ridiculous. Even with a decent salary, the homes are just within means especially once you factor rising insurance and everything else. I'm sure rates will go down eventually. But here we are in hurricane season. Only time will tell.",
            "Exactly. I make good money and I can't afford a house. Bills and utilities takes a big chunk out of my monthly paycheck. It just a big risk that I'm afraid to make a commitment to.",
            "That describes me as a buyer. I am preapproved and underwritten for well over $1.2 million yet there’s no way in hell I want to spend that much money.",
            "My mortgage has gone up twice in 2 years because of insurance.",
            "I just closed on a home $800 over what we wanted our max budget to be. What I didn’t know: you can deduct your mortgage interest and property taxes. My mortgage interest alone puts us over the standard deduction - we will get about 9k back from the IRS excluding any other write offs for the year. That puts us in our budget.\n\nLook at new builds… we got 40k off, 25k flex (would have been more if not for a VA loan) and a 5.5 rate. My builder is still doing that but offering 4.5 first year, 5.5 2-30 for a conventional loan.",
            "Unfortunately had no option but to buy. Relocation due to new job. Shits tight financially now it’s not fun. It’s insane how much, or lack there of, house you get now. The days of getting an affordable single family home that isn’t a POS is over for awhile I think.",
            "Last I heard, Florida inventor is rising abruptly.  That's the good news.  The bad news has to do with the weather...",
            "I’m a Florida lender as well & busier than ever. I’ve already surpassed my production from last year. \n\nThere are many people who can still afford to buy & continue to buy. Maybe a higher share of people need to be a little more intentional with their money than in the past, or buy a little less house than what they would like, but the sky is not falling my friend",
            "Rates in low 6s would be normal historically.  U will never see sub 4 again.  In 1988 I bought my first home for $118k at 9.5% interest and it was a VA.  2005 I bought a new build at 6.5%.  It was a good rate.",
            "Why are you telling them?\n\nDid they not plug current rates and prices into an online calculator before talking to a mortgage lender?\n\nAn approval may vary a bit from online rates, but not a shocking amount.",
            "Are you the Lender or Loan Officer?",
            "I am 66 and bought a house last year for $360,000. Mortgage is $1185. Dropped $180,000 down. Now moving again and will own outright. No mortgage.",
            "Am I your guy at 🚀, sounds like me 😊",
            "As a lender myself, everytime I run numbers for a client I’m like “man… these extra bs fees and monthly payments are such a drag”. It’ll literally increase the payment by 33% in some places.",
            "I really do appreciate mine. \n\nBought my first home 4/30 this year. My realtor was a nice kid and wanted to help him out by giving him some business his way. He recommended a mortgage broker and I did a search and he seemed fine so I stuck with the  2. \n\nThe Mortage broker and I had so many calls, him giving me recommendations on this and that. Talking me out of a 15yr loan, which builds to look out for, just overall how the market is and on his opinion is at this time. \n\nI don't have regrets on my new home but find a good Mortage guy first before finding a realor.",
            "My husband and I have been wanting a house for years now and we just recently got pre approved, have an agent and a lender. My husband's grandmother, since the beginning, has always told us to not worry, and that it's just our first home and we don't need to be picky on school district/location/etc. \n\nI told her if we're buying, it's for forever. I'm not putting myself through this stress just to do it all over again",
            "Sorry to say but we also said that every year for the past 8+ years.",
            "Just gonna get crazier down the road when the wage catch up.",
            "And you as the buyer should talk to multiple lenders. Shop around for that rate.",
            "I know.  I have 2 sons that are in their late 20's early 30s .  very educated, make good money, but the timing o what has happened has made then so discouraged. But everything is cyclical.  i have been in this business for over 25 years and what goes up, always comes down.",
            "Why ??? I’m doing great .",
            "I call it \"making myself sad\" I'm 30 🥲",
            "$80/month on a $1MM house?!?! I’m in Massachusetts and our insurance is twice that on an $843k house.",
            "I think that a lot of people think they can do better than average, and are surprised to learn they can’t.",
            "The problem with Florida is the additional homeowners insurance and property tax. Looking at a home in the 500k range and insurance ranges from $3500 a year up to $9000 a year. Property tax is about another $3000 a year so whatever the calculator states add about a $1000 in escrow, then begin to add utilities.",
            "Wait what? Lol",
            "Why are you moving again after only a year?",
            "Will you stop calling me please.",
            "33% more, I wish, try closer to 100%. and goes up every month.",
            "Meh. You say that, but in reality buying a your second house usually goes a lot smoother and isn’t quite as big of a problem. You’re more comfortable with the process and everything moves a little smoother. Just my 2 cents (:",
            "Buy for the school district now!!  We bought 6 years ago and then had two kids, we’re under contract for a new house to get in a better school district.  It matters and kindergarten sneaks up on ya!",
            "What goes up must come down isn’t true at all though \n\nCheeseburgers used to be 5 cents \n\nHomes used to be 25k \n\nIt ain’t going down \n\nBuy if you can and be glad you did",
            "If its supposed to come down then it should alrdy has. Inventory is just not there lol",
            "Based on the value of a dollar homes aren’t anymore expensive then the past. The salary is what’s lacking.",
            "I hope you’re right",
            "So you think rates are gonna come down? And when?",
            "I’m glad your situation is a great one, count your blessings",
            "I just bought my second house after staying in the first one for 18 years, and it wasn't smoother at all..I think the first one was a way better because I had the down payment in cash, whereas I was trying not to touch my asset as much as possible for the second one. Timing everything correctly was quite stressful, especially the earnest money.",
            "Agreed!",
            "You definitely would have learned what to look for after buying the first one.",
            "Exactly. We are so fucked. “Things will get better again” is a boomer pipe dream. From delusional people with no concept of the corruption and problems we’ve allowed to build in this country for decades now. Prices will come down only if we hit the reset button on this whole damn system which will unfortunately never happen",
            "Agree with this. I think it’s much more likely wages increase over time to make the high prices more affordable than prices to “come down” significantly. The demand is just too hot.",
            "Bullets shot into the air usually come back down!",
            "Rates will stay where they are. It will take a crisis for rates to get very low again. But, the crisis will happen at some time. ",
            "Yeah, the market and options will be different each time. Each scenario. I bought my first home solo/divorced two years ago. That market was awful for different reasons than now. To everyone saying it’s forever, only doing this once. Life happens, changes. Economy, divorce, jobs. Anything. In February my 83 yr old mom moved in with me. Suddenly I’m closing on a different house, different town in 16 days. To accommodate mom. You do know more about what to look for but every house comes with its own issues. Every transaction with buyers and sellers that aren’t you, some deals can be a pain in the ass or smooth sailing.",
            "Yeah I don’t know if Stefako has been in this market",
            "What do you mean by corruption?",
            "Bustin caps in the skyyyyyy, to make sure the rent ain’t high!",
            "My wife and I are closing on our second home this Friday, and things went a lot smoother this time around. YMMV.",
            "Username and avatar checks out! 😆",
            "These are the locations with low home prices. I keep saying that!!!! Go to where the bullets are, folks."
        ]
    },
    "I’m excited and anxious at the same time.": {
        "title": "I’m excited and anxious at the same time.",
        "score": 1005,
        "url": "https://www.reddit.com/gallery/1dl6ly4",
        "content": "",
        "num_comments": 105,
        "comments": [
            "Thank you u/T_L_Wynn for posting on r/FirstTimeHomeBuyer. \n\nPlease bear in mind our rules: (1) Be Nice (2) No Selling (3) No Self-Promotion. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FirstTimeHomeBuyer) if you have any questions or concerns.*",
            "As a potential first home? You’re killing it boss",
            "Go easy on um Moneybags.",
            "Closing on July 8th, 2024. Wish me luck boys.",
            "That is gorgeous!! Anxiety is ok. Means you actually have a sense of the commitment and work. But you've made a great choice!!",
            "Wow ur rich lol",
            "Absolutely stunning!! Congratulations!’ - Crying in NJ.",
            "Congratulations! Your home is beautiful and that backyard looks so cozy! ",
            "Where is this ? That’s beautiful",
            "Is this in Dallas?  I think I looked at that house",
            "Your house is beautiful!!! Congratulations. 🥳",
            "Wow😍😍😍",
            "buy a reverse osmosis for your sink. clean them gutters regularly. enjoy!",
            "Holy hell, what a patio! Enjoy!",
            "Wow, nice house! I’m jealous",
            "Looks so nice omfg goals af. Congrats!!!!",
            "Such a cool house! I see you're a little anxious. What kind of monthly payment are you looking at? Open to roommates?",
            "Gorgeous! Love it.",
            "I love it! Congrats! Such a cool living room and back deck ",
            "This house looks like a dream house! Congrats!!",
            "That’s goals right there! That’s forever home status! Congratulations!",
            "Damn son! Nicely done, fingers crossed",
            "Nailed with that backyard",
            "This is honestly so beautiful! You got this, nothing to be anxious about",
            "NICE!!!! Congrats 👏🏽👏🏽👏🏽",
            "This is a beautiful find! Congratulations!",
            "Looks like an awesome place, congratulations!",
            "Wow it’s beautiful!!",
            "Absolutely gorgeous property. What area/how much?",
            "Very cute place!!",
            "Wow such a cool design! Never seen anything like that",
            "Wow that’s a beautiful house.",
            "which city?",
            "My wife wants to know if those path lights are solar & if so where you got them.\n\nShe likes how bright they are.",
            "🍻🍻",
            "Wow that’s so nice, congrats!",
            " Congratulations wow!! There’s so much character!",
            "Noice!",
            "You got this! Blessing 🙏",
            "This is cute!! Perfectly my vibe!",
            "Great house.  Congrats!",
            "It's such a unique shaped house",
            "Good luck, I brought another home. And it's nice. Nut do not get a home warranty they are a rip. On your final  walk through Nring marbles junp on floors check by toilet for rot and don't buy  home with a crawl space",
            "Lovely place",
            "Is this in California?",
            "The backyard 😍😍😍",
            "So prettyyyyyy! Just get it",
            "🤞🏾 Good luck. It's beautiful.",
            "This is beautiful! 🤩",
            "You’re doing just fine",
            "lol I don’t think anything will be a problem when you can just pay to fix it",
            "That backyard 😍🥰. Congratulations!",
            "Gorgeous",
            "That’s lovely. I love the outside and the living room! Nice kitchen too. Congrats!",
            "Wow!!!! I love this!!",
            "Beautiful home",
            "looks awesome - congrats!",
            "Good luck, it looks wonderful",
            "Bro, what state is this? I only ask because my mom has the same exact house, just different paint and renovations.",
            "So cute!! Congrats!",
            "That’s quite the first home bud.",
            "Cozy vibes!!!",
            "Nice place you got",
            "Personally, I'd be more anxious about sharing the listing photos on this post. I found the exact address in 20 seconds flat. \n\n13312 etc etc",
            "Ill be happy to take that anxiety off of u",
            "Way to brag Richie rich",
            "r/TVTooHigh",
            "I need to keep reminding myself the same. Granted we plan on our home being our forever home, not just our first home. But even still, we did really good for our first home purchase. It checked all but 1 box and that box was a 2nd bathroom which we will remodel to add down the road when it’s in the budget then we’re living in our dream home. I get hung up on that missing 2nd bathroom or on the old paint, ugly tile but ultimately we have our dream house and it can only get better from here!",
            "Same day we're closing on ours. Good luck!",
            "Congrats!! And you’ll never get tired of having a nice outdoor space!",
            "I am a girl so no luck wishing from me ✌️",
            "Big $$ if Austin!",
            "That's quite the starter home! You got this!",
            "There myself the following week but mine don’t be looking like yours at all",
            "How much?",
            "Texas. Beautiful homes. Horrible representatives, politics, and city planning.",
            "Yes it is! What did you think? It’s a little on the pricey end but we were able to negotiate. I loved the backyard and just how well everything was kept and maintained in the house.",
            "I’m still in the option period but everything has gone well so far. We did find that one of the main drain pipes has a root growing in it, but my agent and I had a plumber come out and got a quote. We used that quote to negotiate a few thousand off of the original offer price.",
            "Thanks for the tip!",
            "Roughly $3,200, but not 100% sure yet until we get the final number. And yes, I’m going to charge the boyfriend for rent (thinking $1,300). I was thinking of doing a short term rental for traveling nurses, but the bf wanted to continue living together for another year. I’m a big fan of having roommates for cost saving purposes.",
            "Not op but I found it. 469k and Dallas.",
            "Dallas, TX",
            "That I’m not sure. Something I should check, though.",
            "It’s in Dallas",
            "Agreed! \n\nI have a partially covered outdoor space for the first time since moving out of my parent's house (so 20ish yrs). My dogs and I are out there for at least an hour a day, we LOVE IT! \n\nI'm even excited for fall/winter to come to enjoy the rain while not getting wet.",
            "Same, so I’ll wish you luck instead ✨🍀✨",
            "So edgy",
            "Best politics.",
            "We were very interested.  Congrats!",
            "Hey dude just an FYI you should remove the listing link.\n\nGiving the internet the address of your home or soon to be home generally isn’t a great idea. You never know what kinda weirdos are on here lurking and their intentions.",
            "I paid extra for the full inspection to check the piping since it’s an older home, but glad I did. Remember, everything is negotiable. With that said, I been having anxiety all week thinking if I’m over my head or if I’m going to be able to afford this. It’s still scary and I can imagine this process is much like getting married.",
            "Back at you 🥰",
            "It is edgy to act like there are no women on the internet! 💀",
            "Have your upvote",
            "Do you feel that way every time your electrical grid fails?",
            "How’s your power grid doing in the extreme heat and extreme cold? Enjoying the power outages?",
            "To each their own.",
            "Close second to Florida",
            "It’s good advice. People should also stop posting the photos from the listing because it’s incredibly easy to reverse search the image to find the listing/address.",
            "Thanks for the tip! And you’re 100% right.",
            "Yah you're going to love it. One of the main challenges is accepting some of the things that are hard to change in a house, kind of like a partner. It's easy to think about how things could be different. The high ceilings and outdoor space make this look like an easy place to live in : )",
            "Just go gather loose data... roughly how much was it for your \"full inspection\" in the end?  \n  \nI'm currently in the market for my first home as well, and I keep leanign towards older homs for style alone",
            "It's been stable since 2021 at least in south East Houston suburbs.\nI'm not sure how being in a smaller municipality helps or detriments utilities though",
            "It's been stable since 2021 at least in south East Houston suburbs.\nI'm not sure how being in a smaller municipality helps or detriments utilities though",
            "This-took me less than a minute to find out where this house is. Listing photos are way too easy to find."
        ]
    },
    "Living the Dream": {
        "title": "Living the Dream",
        "score": 437,
        "url": "https://www.reddit.com/gallery/1dl9sws",
        "content": "We got the keys! I'm so excited to be a first time home buyer! I never thought it was something we would ever be able to afford. ",
        "num_comments": 33,
        "comments": [
            "Thank you u/AlysInBetween for posting on r/FirstTimeHomeBuyer. \n\nPlease bear in mind our rules: (1) Be Nice (2) No Selling (3) No Self-Promotion. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FirstTimeHomeBuyer) if you have any questions or concerns.*",
            "What a beautiful home! I love the lot and the backyard looks like an oasis",
            "Can I ask you - what changed to eventually make it something that you COULD afford if anything at all?",
            "Love the backyard!",
            "This home is too cute I love it",
            "Wow you’ve got to be rich. Ur house is nice asf",
            "Yes you are 🔥",
            "Congrats! My wife and I closed last November. Had the same sentiment about never being able to afford it. It's a good feeling. Ride it out until the first major repair lol. Beautiful home btw.",
            "Congrats! However, please be smart and not post pics from the listing. It's too easy for people to reverse image search and find out where you live in Colorado.",
            "beautiful, congrats!",
            "Gorgeous, enjoy!",
            "Wow! Where are you living said dream???",
            "I feel like I saw this place on Zillow in the north west Denver area lol",
            "Congratulations!",
            "wow - that looks fantastic",
            "Gorgeous home! And that backyard is a dream!! Congratulations!",
            "This is AMAZING. When can I come over??",
            "I like how the neighbors dont even have to leave the bed room to see what your grillin",
            "Thank you so much! It's so peaceful in the back.",
            "whats oasis",
            "I was working as a nanny full time. My partner is fully disabled. She rapidly got much sicker. I had to come home to take care of her in October of last year. There is a program where I live where the state pays me to stay home with her. I'm making a lot more now being paid to do the things I was doing anyway. We are much better off physically too. I wasn't really sleeping or eating trying to work full time and take care of her full time as well. Now she has the care she needs, and I'm able to take care of myself better.\n\nI wasn't expecting the pay increase, but I am very grateful. It was enough of an increase to get into this house that we are going to make completely accessible to her. \n\nMy realtor is one of my best friends. She really helped me out. My lender is one of her friends. He really cut me a deal on closing costs, and he found me an awesome down-payment assistance loan. \n\nPreviously, we were in an apartment that has no emergency exit for handicapped people. I was really afraid something would happen and we would have no way to get her out.",
            "Thank you! Our dog is 100 lbs and has spent his whole life in a 2 bedroom apartment. It's so sweet to watch him get so excited to go outside.",
            "Seconded!",
            "Thanks!",
            "I just got extremely blessed. The person selling it listed under market value and appraisal and refused to sell it to investors.",
            "Thanks so much! I'm terrified of repairs lol. I did hire a really good inspector who went over it with a fine tooth comb.",
            "Lol! I noticed that too. I'm going to plant some tall bushes or something foe a little more privacy.",
            "anyway, here's wonderwall",
            "That’s a fantastic story.  State benefits being used appropriately to better someone’s life.\n\nCongrats, it’s beautiful.",
            "So the state is paying for the home then?",
            "I love this story and wish you both the very best.",
            "That's dope. Congratulations!",
            "He has a job from the state. That job pays for the home"
        ]
    }
}