{
    "Weekly Music Feedback Thread - June 19, 2024": {
        "title": "Weekly Music Feedback Thread - June 19, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/FL_Studio/comments/1djj83c/weekly_music_feedback_thread_june_19_2024/",
        "content": "# WEEKLY FEEDBACK THREAD\n\nHere is a place to post your music for feedback without the limitations of **Tunesday**.\n\nPlease leave feedback for others that have posted in this thread. If you share feedback for someone else, you're more likely to get feedback on your own comment.\n\nYou have the control to make it less of a mindless \"click\" thread. It is also a great opportunity to explore new music and find gems! If you didn't receive any at first you can try again after 3 days.\n\nPlease link to **specific tracks** for feedback - not artist pages or full albums.\n\n**You can** [**visit our discord**](https://discord.gg/27wgKfafmP) **at any point to post your track for feedback in our Feedback channel.**",
        "num_comments": 9,
        "comments": [
            "Hey Awesome FL users, here is my latest. Please would you give me the honor of receiving some feedback? Thanks a freaking lot! [https://soundcloud.com/hubert-camirand/la-verite-de-la-mort](https://soundcloud.com/hubert-camirand/la-verite-de-la-mort)",
            "New dancefloor track from myself! With 4x4 switch ups! [Interrex let go](https://open.spotify.com/track/0vwS5lAVkQ6zwah7xPuA6a?si=OVsiL-AlSCSyYzO8XLhvOw&context=spotify%3Aalbum%3A64PKgd2H5KapMmS4fZfE7h)",
            "Here's my new track, mostly looking for feedback on the sound of it. I want my tracks to sound more professional. Also, not sure what genre to tag this as so any help there appreciated \\^\\^\n\n[https://soundcloud.com/silphidae/pathfinder](https://soundcloud.com/silphidae/pathfinder)",
            "Hi all new here but have a piano house track that will showcase where I'm at which I'm happy with :)\nLook forward to your feedback.  PS I used the same vocals as Sammy Virji\n\nADF - If You Need It\nhttps://on.soundcloud.com/vkCTxwNHtzEZKsxv6",
            "Made this ambient track a while ago. Might not be your typical style, but I'm welcoming any feedback.\n\n\nhttps://youtu.be/MipJSGwbQok?feature=shared",
            "That phaser effect on the vocals (or the entire track, can't tell if it's effecting everything or not) is kind of overwhelming for me personally, but if that's the style you were going for I think it's great :) I think you could clean some elements of the track in general up in the mixing process, but for the most part everything sounds great man!",
            "A cool mix of Electro house and DnB (i guess?), sounds pretty good! If you want to improve something the mix is quite muddy and everything else sounds wide, more separation for clarity would be nice 👌",
            "I don't know if it's just because I'm high, but this is one of the sickest tracks I've heard so far from this subredit. \n\nI would say that there are a TON of complextro elements in your tracks, do you have any tips or advice for someone just beginning to learn complextro type tracks? Any finger in the right direction, maybe to a well-rounded tutorial or something, would be much appreciated! :)",
            "thanks! I'm glad you enjoyed it \\^\\^\n\nas for the complextro elements, honestly, I didn't have a specific technique in mind when making it. I just added different synths and sounds wherever it felt like something was missing. Just experimenting and layering different elements\n\nI haven't watched any tutorials on complextro, but this one from Infowler seems really detailed and well rounded: [https://www.youtube.com/watch?v=IBIatSkDpMM](https://www.youtube.com/watch?v=IBIatSkDpMM)"
        ]
    },
    "Feedback Friday is live!": {
        "title": "Feedback Friday is live!",
        "score": 1,
        "url": "https://www.reddit.com/r/FL_Studio/comments/1dkqdtv/feedback_friday_is_live/",
        "content": "Today we will be having a Feedback Friday.  \n  \nAll the normal Tunesday Tuesday rules still apply, except **please use the \"Feedback Friday\" flair for your posts!**  \n  \nThe event will close around 12:00 PM **EST** on Saturday. If you have any suggestions, questions, or comments, please [send us a modmail message](https://www.reddit.com/message/compose?to=/r/FL_Studio).",
        "num_comments": 0,
        "comments": []
    },
    "CPU overload (no plugins)": {
        "title": "CPU overload (no plugins)",
        "score": 4,
        "url": "https://v.redd.it/3a1jgry2z38d1",
        "content": "Recently I've had this problem, basically I can't do anything because of CPU spikes, even with no plugins and 5 tracks. I tried correcting the problem with anything I've found related to CPU spikes problems but nothing works so far.\nThis problem showed up when I upgraded from FL20 to FL21, I went back to FL20 hoping it would work normally like it used to but this problem remains",
        "num_comments": 5,
        "comments": [
            "Hey u/Cheap_Assist_5904, thanks for submitting to r/FL_Studio! Take a moment to read our [rules](https://www.reddit.com/r/fl_studio/about/rules).\n\nIt appears you're looking for help. Please [read the frequently asked questions](https://www.reddit.com/r/FL_Studio/wiki/faq/) in our wiki, if you find the answer you're looking for, please consider deleting your post. If you don't find the answer, your thread can remain active and other users will be here to help you shortly.\n\nPlease do not post your question more than once and please be patient.\n\nJoin our [Discord Server](https://discord.gg/27wgKfafmP)!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FL_Studio) if you have any questions or concerns.*",
            "Ah, this reminds me of my early days. peaked out at around 11,000%. Don't ask me how it makes sense, i just knew at the time that it was going to be straight heat.... what i actually made was lukewarm at best. \n\n  \nEither way, This kind of behavior is Based off of multiple factors: \n\n1. The software or plugins being used. You stated that you're using nothing but stock, so that rules out that problem. (However Harmor, Patcher and vocodex can be absolute monsters depending on how they're used, so be careful) \n\n2. Hardware specifications. depending on the type of computer, even the simplest of plug-ins can cause this issue. What you want is a computer that has at least 8 GB RAM as well as SSD storage and something above an i3 Intel processor or something equivalent, be it Ryzen or otherwise. Also, it should be fairly modern. an i5 from 2010 may not be as powerful as an i3 from 2020, etc. \n\n3. Internet connection. While it may sound a bit strange, sometimes an Internet connection that is slow can end up affecting the entire system, including FL studio. \n\n  \nTo remedy this issue, I would recommend the technical approach of trying to isolate the issue. First off, you said this issue started around FL21, So you can definitely go ahead and see if downgrading to FL20 has the same issue. You can also try using those same plugins on a different computer if one's available, or the easiest, in my opinion, using FL studio without an Internet connection. The latter of which helped me immensely before I got a new computer.",
            "Does this problem occur while normally producing or does it happen only when you stress your computer like that lol",
            "ITS OVER 9000",
            "Turn off fx vst one by one , starting with the most hungry and see if it drops suddenly. Hence, you identify the problem vst.\n\nGot to audio settings and change the default audio driver. If it is on AISO4 all, switch to system default. \n\nI assume your buffer size is correct?"
        ]
    },
    "How do i make it so it scrolls smoothly and not choppy?": {
        "title": "How do i make it so it scrolls smoothly and not choppy?",
        "score": 5,
        "url": "https://v.redd.it/0hyxqai7538d1",
        "content": "I updated it and it does this.",
        "num_comments": 4,
        "comments": [
            "Hey u/JRDAN__, thanks for submitting to r/FL_Studio! Take a moment to read our [rules](https://www.reddit.com/r/fl_studio/about/rules).\n\nIt appears you're looking for help. Please [read the frequently asked questions](https://www.reddit.com/r/FL_Studio/wiki/faq/) in our wiki, if you find the answer you're looking for, please consider deleting your post. If you don't find the answer, your thread can remain active and other users will be here to help you shortly.\n\nPlease do not post your question more than once and please be patient.\n\nJoin our [Discord Server](https://discord.gg/27wgKfafmP)!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FL_Studio) if you have any questions or concerns.*",
            "in the top left where those red squares are on the right of the record button, right click the one with the arrow pointing to the right and click smooth scrolling",
            "You need to select fl asio or your audio interface in fl studio audio settings",
            "Select Asio4all in settings>audio>device"
        ]
    }
}