{
    "Daily Newbie Thread": {
        "title": "Daily Newbie Thread",
        "score": 1,
        "url": "https://www.reddit.com/r/Flipping/comments/1dls9ig/daily_newbie_thread/",
        "content": "Whatever you want to know about flipping, no matter the question, ask here. Even if it's been covered 1,000 times before. Doesn't matter if you're new or old. If you stop learning things, you're probably on your way out.\n\n\\-If you're completely new to flipping, I highly recommend checking out our [Noob Guide](https://www.reddit.com/r/Flipping/wiki/noobguide) for some basic information about flipping to get you started!\n\n\\-If you're wondering about how to start selling your thrift finds online, check out this [Complete Beginner's Guide to Ebay](https://www.reddit.com/r/Flipping/comments/5pf38k/complete_beginners_guide_to_ebay/?ref=share&ref_source=link)\n\n\\-If you're wondering about how to start sending and selling books through Amazon check out this [Beginner's guide to flipping books with FBA](https://www.reddit.com/r/Flipping/comments/5pn3j8/here_is_my_free_beginners_guide_to_flipping_books/?ref=share&ref_source=link) \n\n\\-If you're wondering about what kind of stuff our members buy & sell, check out our previous [Weekly Haul](https://www.reddit.com/r/Flipping/search?q=title%3Aweekly+haul+author%3Aautomoderator&restrict_sr=on&sort=new&t=all) and [Flip of The Week](https://www.reddit.com/r/Flipping/search?q=title%3Aflip+of+the+week+author%3Aautomoderator&restrict_sr=on&sort=new&t=all) threads.\n\nThis is an extremely newb-friendly thread. As such, any rudeness is to be reported.",
        "num_comments": 0,
        "comments": []
    },
    "Customer Issues, Rants, and General Complaints Thread": {
        "title": "Customer Issues, Rants, and General Complaints Thread",
        "score": 1,
        "url": "https://www.reddit.com/r/Flipping/comments/1dls9im/customer_issues_rants_and_general_complaints/",
        "content": "Back again, for more tales of woe, sadness, and despair. Flipping can be an emotional roller coaster and a desolate career path; we understand that and we're here to help. Lowballed on Facebook Marketplace? Priced out of your local Goodwill? If we can't help, we can at least commiserate.",
        "num_comments": 0,
        "comments": []
    },
    "Do these look opened and resealed to you": {
        "title": "Do these look opened and resealed to you",
        "score": 206,
        "url": "https://www.reddit.com/gallery/1dlf8bo",
        "content": "Bought at the Amazon return store. Outer boxes were opened obviously. ",
        "num_comments": 108,
        "comments": [
            "Yeah. Especially the last picture.",
            "Yes, when I was in elementary school I used to do this and sell to my fellow students. I got punched in the face and lost two front teeth. I deserved it.",
            "Just wanted to say thank you, OP for posting this. This is really valuable information for some of us, and hopefully you can get your money back.",
            "Yup. This is a scam by carefully opening a pack, pulling the rare and valuable cards out and attempting to resell them with glue or whatever.",
            "Girl in middle school did this to me with Jurassic park cards. She elmer glued the packs closed and I noticed cause the glue was still wet. We are still friends.",
            "Bro yes LOL. Looks like someone tried to commit fraud here.",
            "Plot twist: OP opened them and is trying to see if his reseals are passable",
            "Yep 100%. Last picture sold it",
            "100%",
            "Both ends are heat sealed. Do they look identical or is the defect only on one side?",
            "100%",
            "Yes and you did a bad job",
            "100%",
            "I work with my family managing an eBay store. We are a sub powerseller with $1 million+ in gross sales a year.\n\nThat said, when my dad brought in three boxes of unopened baseball and football cards from the 90s, I told him we must sell them locally.\n\nNo eBay. Cash only sale, but only after verifying with our local card shop that they're legit. Maybe we offload them to said local card shop.\n\nWe already got screwed 5/5 times with TCGs. I told him when we first started more than a decade ago to never buy TCGs because they're rife with scam buyers.\n\nMy partner was a big TCG collector and player. We would sometimes go to a card shop and shoot the shit with the owner. Very enlightening. I repeated the owners casual warnings.\n\nThey went in one ear, out the other.\n\nI have no idea what these could contain, but my brother agreed with me; these need to be sold in store, to someone locally, or offloaded to a card shop.\n\nSo, they've been squirrelled away by me and my brother until my dad forgets about them.",
            "Very clearly opened and resealed.",
            "Yes",
            "What's the \"Amazon Return Store\"?",
            "This is notorious for pallet stores to have these because it’s a very common Amazon scam. They open the cards return them via Amazon then they get dumped at all the bin stores.",
            "Yeah never buy anything worth anything on Amazon returns like video cards, game controllers etc.  This is what scammers do with hot items, they do a switcheroo",
            "I worked at a card shop in the late 80s-early 90s. We went to regional shows every weekend. We only had one instance where we suspected this, but when we counted the cards there was a whole pack — but I guess they could have just added a different two cent card. \n\nThere are way better ways to inconspicuously seal these packages. They didn’t even bother to TRY to hide it. OP, I think they screwed you.",
            "This happened with Japanese Pokémon cards I picked up from the bin store. Looked great, sealed , but I inspected closely and one was slightly open. Good think I checked. They’d all been swapped out with basic Pokémon cards",
            "Don't buy cards from return stores....cards against humanity,  90% of board games...all counterfeit.\n\nEdit. Any type of filters, food (expired),\n\nThey've gone down hill.",
            "Yes",
            "Yes",
            "Definitely it’s very noticeable",
            "100%",
            "SMH dirty ass hands about to handle sports cards. Lavate las manos.",
            "Yes",
            "Yes",
            "I did this once with Pokemon cards in the late 90s as a kid 😅",
            "Yes 100%",
            "Yes, they do.",
            "Yeaaahhh.",
            "Yes",
            "They do look resealed, compare them to a new pack",
            "Yes",
            "What's a amazon return store?",
            "Are these panini packs including autos? Definitely looks resealed and I'd say that's the consensus here. Recently seen some videos of guys saying they can feel autos instantly through a pack, backed by tons of commenters agreeing.",
            "U can take an iron and seal back",
            "Yes",
            "Yes",
            "Those are def resealed and poorly at that",
            "Yes",
            "Dude you bought from the Amazon return of course they been opened",
            "Ohhh yea",
            "Yeeeep",
            "Dude what type of camera did you use to take these pics?",
            "Let me guess....u prob bought on whatnot. That place is ripe with scammy sellers rips.",
            "Looks like a grown man playing with trading cards... just put em down and walk away. The gun section is in the back of the store, look for the other grown men...",
            "Exactly.",
            "And gained a valuable lesson in life.",
            "I’m proud of you for recognizing that you deserved it lmao",
            "But at least you made $10!",
            "Thank god your teacher gave you a valuable lesson.",
            "Do you have implants now or what?",
            "‘Your students” makes me think you’re the teacher and some mouthbreather had enough",
            "lol it’s only $15. No returns at the bin store",
            "Heat sealer was used \nYou can tell from the last picture",
            "Yep, this sucks because these packs are [pretty pricey](https://www.ebay.com/sch/i.html?_from=R40&_nkw=2023+nfl+panini+blaster+donruss&_sacat=0&_odkw=2023+nfl+panini+blaster&_osacat=0&mkcid=1&mkrid=711-53200-19255-0&siteid=0&campid=5338535524&customid=fp&toolid=10001&mkevt=1).",
            "I grew up near a card shop that did this in the early 90s.  They had unopened packs of the Michael Jordan rookie year cards that they sold for $100 a pack.  My dad went to buy a pack once, looked it over, and realized they did a terrible job at resealing it lol.  Card shop owners always were sus back then.  And apparently, some sellers still are.",
            "Or just, return them to Amazon, and get more of them",
            "[ Removed by Reddit ]",
            "Well, well my flair never comes up on this sub.  Finally some dino chat.",
            "Looks like they did commit fraud. They already go their money back from the return.",
            "Exactly what I was thinking",
            "Sealed it.",
            "Jeez. If you don't mind me asking, what was your path to get to $1mil/year?",
            "> No eBay. Cash only sale, but only after verifying with our local card shop that they're legit. Maybe we offload them to said local card shop.\n\nWith all due respect, what in the fuck are you on about? Having sold millions of dollars in cards on eBay going back to the 90's I can't even imagine what could be bouncing around in your head. For starters, your cards from the 90's are probably near worthless but I and literally thousands of others sell very expensive sealed product all day every single day.",
            "So I opened a few. They only had 12 or 13 cards in each pack. Supposed to be 15 per. Out $15 but lesson learned",
            "A dig bin store where business buy pallets of returns/ close outs and sell items individually with set prices that get cheaper thru the week",
            "I love doing that on amazon",
            "Cards against humanity is collectable?",
            "My iPhone? Why?",
            "Don't cheap out on the bag crimper?",
            "\"don't get caught\"",
            "*Mr. Rogers smiling*",
            "Keyword: fellow",
            "Reading comprehension isn't your strong point, I'm guessing.",
            "Idiotic assumption",
            "We just had one open up near us. What are your overall thoughts?",
            "Now I know why someone bought my heat sealer on ebay.",
            ">Card shop owners always were sus back then.\n\nAs a kid, I hung around my local baseball card shop constantly in the 90's. The owner was basically my babysitter a few hours a week. \n\nHe ended up burning the place down for the insurance money.",
            "I don't know how attached are we to Jurassic Park cardboard?\n\nI KNOW YOU TOOK THE TRICERATOPS OUT OF THIS PACK JESSICA",
            "Wasn’t your’s “I’m back, you wench!”",
            "Pealed it",
            "A combination of things, really. We didn't start off that way. That's gross sales but the way, not net.\n\nMy dad worked as a small appliance and television repair person for about 15 years. The license doubled as a permit to buy and sell electronics. At some point, my brother and I started working for him.\n\nMy dad taught my brother about electronics, fabrication, etc. I went to college. I ended up working with my dad when the degree didn't pay for itself. I managed the shop while they were away.\n\nWhen the repair industry began to die, he expanded the business to secondhand dealing. It allowed us to buy and sell more than what we could with the BEARHFTI (now BHGS) license permitted.\n\nMy dad already had lots of contacts since he's started his business with a stellar reputation from Curtis Mathes, so during those fifteen years it really expanded. \n\nI can remember one time going with my dad to some millionaires property with two huge mansions at the end of a long drive way surrounded by tall gates. In the one he was working in, there was a managerie of exotic birds in the back yard. I spent quite some time contemplating the gold-plated toilet seat I saw in the bathroom. I couldn't wrap my head around how useless it was. I think I was ten.\n\nAnyway, a few doors down from our shop we had a long time family friend who was also a pawn shop owner. He had served in the Navy with Richard Harrison (Old Man from Pawn Stars) and was a friend of his.\n\nHe shared a lot of insider information on the pawn business (and related, secondhand dealing) with my dad and said that when he officially retired, he wanted to sell the business to my dad, although my dad didn't want it.\n\nHe didn't retire though.\n\nUltimately, he died of medical malpractice. This was about a few months after Old Man died. Dad still didn't want to buy the business, so his widow tried to sell it. No one wanted it.\n\nSo, she ended up selling all the inventory they had and closing it. Dad ended up with some people who were looking to buy that inventory asking about his. So dad started making some more connections, including connections to abandoned storage auctions and such. That was almost six years ago.\n\nSo.... yeah.",
            "Ask the dad, not  the one scared to sell 90's cards on eBay.",
            "I will reiterate: there are three boxes, sealed, which contains brand new, sealed packs of MLB and NFL trading cards from the 1990s. Specifically, they are TOPPS cards.\n\nAs to what they actually contain, I again reiterate we do not know, however given previous advice from a card shop owner and from prior negative experience, it is best not to deal with online sales.\n\n- TCGs: Five brand new, sealed Pokemon or MtG box sets ranging from $35 to $100. Confirmed legit. INADs on all five. All five had cards missing (rares, holos, etc). Separate addresses, separate usernames, across three years.\n\n- Card Shop Owner: Some warnings include frivolous chargebacks because card wanted was not in pack or box. As well as fraudulent returns with resealed packs (like OP). He sells online too, but only graded.\n\nSo, yeah. Previous experience and contact supports action. Last we checked, one of these boxes was trending sold on eBay for $300. The other two, under $100.",
            "Not too bad of a loss for a good lesson. Please make sure you inspect beforehand and look up ways to detect the fraud if you are going to buy old unopened packs again. I have seen people pay tens or hundreds of thousands for Pokemon packs because hey didn't see the signs. They faked it well in that case, but that's why you needa be more careful.\n\nThe one you bought from was an amateur faker... Not even having the right number of cards :/",
            "Sweet! Any tips on finding one? Or are there only a few around? Thanks in advance",
            "No, but yes. People will collect anything and CAH have quite a few expansions to collect.",
            "In fact it is. Fellow = male in this instance, as he likely taught at an all-boys private boarding school.",
            "Dad?",
            "Same with me, at a different one than in my original comment, because we moved.  I hung out there a lot. He ended up faking a nighttime burglary for the insurance money lmao.\n\nHe was always nice to me. His daughter was my actual babysitter for a short time.",
            "GA?\n\nEdit: LOL just looked at your profile and first post is Georgia related…\n\nHow about this… was it in middle Georgia?",
            "IT WAS A VELOCIRAPTOR AND GURL IT WAS THE ONLY CARD I NEEDED ALICIA!",
            "Right.\n\nSo, explain 5/5 TCG INADs.\n\nYou know what the definition of insanity is, right champ?",
            "Hundreds of thousands? Like, jake pauls 1st ed booster case that turned out to be GIJoe packs?",
            "Just google your zip code plus bin store or return store or pallet",
            "I was never a fan of Amazon returns. It was mostly garbage or returns that have been picked apart.",
            "Yes, keep going through life, making up explanations for things when, in fact, you have no idea what you're talking about. Let us know how that works out for you",
            "Followed by an idiotic explanation.",
            "CARL TOLD ME HE SAW YOU WITH A SHINY DINOSAUR EGG CARD. WHY WOULD HE LIE TO *ME*? HE KNOWS I AM THE QUEEN DINO OF THE CLASS",
            "Who gives a shit? I sold a 1999 era Pokemon collection last month. 3000+ cards listed one at a time and except for a few very  cheap cards that went in an ebay envelope that were reported INR everything else was fine. And you don't get an INAD if you take care of the damn problems that come up. It's literally impossible unless you don't respond to cases.",
            "I haven't seen that, but I hope you're not kidding and he isn't pulling a prank",
            "It was legit, he bought a case that looked sealed for like 1mil and the authenticators that said it was legit were there when they opened it and it was all GI Joe packs 🤣",
            "I would say that's a win. I didn't even know Gi Joe had cards, so they must be worth more :)",
            "I mean, that sounds *exactly* like a stunt Paul would pull for attention. It's kind of what made him (in)famous.\n\nEDIT: Um, yeah. [This is called acting, dude,](https://www.youtube.com/watch?v=ZhpgQglY3RU) and they're all remarkably bad at it. \n\nI can't wait to see Tyson punch his head off his body."
        ]
    },
    "Thoughts on Rocking High Chair": {
        "title": "Thoughts on Rocking High Chair",
        "score": 0,
        "url": "https://www.reddit.com/gallery/1dlujsz",
        "content": "It’s a metamorphic high chair. Any thoughts on age, style? I don’t have a picture of it standing up but it pulls up and is then like a regular high chair. ",
        "num_comments": 1,
        "comments": [
            "I just picked a similar one up, but it extends up and down with an according style mechanism instead of scissors."
        ]
    },
    "Phone flipping issue": {
        "title": "Phone flipping issue",
        "score": 0,
        "url": "https://www.reddit.com/r/Flipping/comments/1dlu8dm/phone_flipping_issue/",
        "content": "I bought few iphones a week ago, nobody is messaging me, on fb marketplace, im not in usa, in winter it was selling soo fast, now nobody is Coming to me what should i do",
        "num_comments": 4,
        "comments": [
            "Welcome to the summer slowdown. You can wait or drop the price.",
            "As long as they are priced right, eventually Facebook will show them to users. I can go a week without a single message then get a dozen in an hour. You are at the mercy of Facebook's algorithm.",
            "Some months are better than others welcome to the life of a reseller",
            "I often keep them on there for around 4-7 Days, If I don't receive any offers or Interest. I just Mark the Price lower or Relist them with better Pictures. \n\nThere's always going to be Slow Days/Weeks \n\nJust need to stay Patient"
        ]
    }
}