{
    "13 GREAT books to learn Investing & the Stock markets! [summary included!]": {
        "title": "13 GREAT books to learn Investing & the Stock markets! [summary included!]",
        "score": 158,
        "url": "https://www.reddit.com/r/FluentInFinance/comments/153seh5/13_great_books_to_learn_investing_the_stock/",
        "content": "We've received many questions for **recommendations on books for Investing & the Stock markets.** We've curated a list of our 13 favorite books on Investing & the Stock Market, and explanations on what the books are about. I've learned a great deal from these books. All of these are by really great investing legends/ gurus. These books offer a few different approaches to the stock market. Different investment styles will help educate you on how to make successful long term investments, minimize risk, and analyze stocks more accurately. All of these books can be purchased used very cheaply ($1 to $5)!\n\nAs your income grows, your investment portfolio should also grow. One of the biggest obstacles for beginner investors is just knowing how to get started. Learning about financial concepts can be intimidating at first. A great way to start, can be by picking up a book by an expert who thoughtfully and sequentially presents & explains these concepts and topics. Resources like these can help investing be less intimidating and complicated. One of the best strategies is to learn from the insight and wisdom of gurus. I hope these book recommendations help!\n\n \n\n#  Book List:\n\n1. [How to Make Money in Stocks](https://amzn.to/3ujiApd) by William O'Neil\n2. [The Little Book That Still Beats the Market](https://amzn.to/2OfR4d9) by Joel Greenblatt\n3. [A Random Walk Down Wall Street](https://amzn.to/3ud6E8A) by Burton G. Malkiel\n4. [Principles](https://amzn.to/3wk9CtU) by Ray Dalio\n5. [One Up On Wall Street](https://amzn.to/3rEN9E9) by Peter Lynch\n6. [The Big Secret for the Small Investor](https://amzn.to/3fHyJ3I) by Joel Greenblatt\n7. [Winning on Wall Street](https://amzn.to/3rH4TyH) by Martin Zweig\n8. [Irrational Exuberance](https://amzn.to/3mbTjKQ) by Robert Shiller\n9. [The Bogleheads' Guide to Investing](https://amzn.to/3uaehfS)\n10. [Common Sense Investing](https://amzn.to/3ucV0dW) by John Bogle\n11. [The Intelligent Investor](https://amzn.to/2PqdzMQ) by Benjamin Graham\n12. [The Only Investment Guide You'll Ever Need](https://amzn.to/3ugMSJu) by Andrew Tobias\n13. [You Can Be a Stock Market Genius](https://amzn.to/3meewnv) by Joel Greenblatt\n\n&#x200B;\n\n#  Book Descriptions & Covers:\n\n&#x200B;\n\n[**How to Make Money in Stocks**](https://amzn.to/3ujiApd) **by William O'Neil**\n\n* This book is about growth investing. O'Neil explains what most successful stocks have done to be successful. He explains his 'CANSLIM' method, which is an acronym for 7 fundamental criteria which you can use to pick stocks. An AAII 8 year study of different strategies showed O'Neal's CAN SLIM with a 860% return from 1998-2005 (Second place). First place was Martin Zwieg's returning 1,659.3% (we will get to Zweig on this list too)\n\nhttps://preview.redd.it/xqsteucgng191.png?width=195&format=png&auto=webp&s=ce61da8980efdfe0ecef663ab05a97f4838182dc\n\n&#x200B;\n\n# [The Little Book That Still Beats the Market](https://amzn.to/2OfR4d9) by Joel Greenblatt\n\n* The idea of this book is to buy undervalued good businesses and hold them long-term, which will eventually beat the market index.\n\nhttps://preview.redd.it/qmrq2minng191.png?width=365&format=png&auto=webp&s=46dd18b57e2bdc7afb8fa1f5e1ff025615d16a76\n\n&#x200B;\n\n# [A Random Walk Down Wall Street](https://amzn.to/3ud6E8A) by Burton G. Malkiel\n\n* This book covers investment bubbles, fundamental vs. technical analysis, modern portfolio theory, index funds, etc.\n\nhttps://preview.redd.it/x7t5gloong191.png?width=329&format=png&auto=webp&s=2d43edcd511ef371a506419cec2ac8462a7d844a\n\n&#x200B;\n\n# [Principles](https://amzn.to/3wk9CtU) by Ray Dalio\n\n* This book provides the insights from one of the biggest hedge fund managers of all time, and I think there are many great lessons to learn in this book!\n\nhttps://preview.redd.it/cwv7dc4png191.png?width=333&format=png&auto=webp&s=3b5d86b9f669f59e1240f53628e59daf3ae97323\n\n&#x200B;\n\n# [One Up On Wall Street](https://amzn.to/3rEN9E9) by Peter Lynch\n\n* This book emphasizes the advantages that individual investors hold over institutional investors (when it comes to finding investment opportunities). Lynch also gives many of examples of mistakes he has made, and how he has learned from them.\n\nhttps://preview.redd.it/a3hze2lpng191.png?width=326&format=png&auto=webp&s=e94cbc8e20e50f7cd9b92a67c140952529bd0d04\n\n&#x200B;\n\n# [The Big Secret for the Small Investor](https://amzn.to/3fHyJ3I) by Joel Greenblatt\n\n* Greenblatt explains why index funds can be better than actively managed funds. The big secret is maintaining a long term perspective!\n\nhttps://preview.redd.it/qvhszg2qng191.png?width=347&format=png&auto=webp&s=0dc31f381276a372d5cb2eeb1c0afa91fb253454\n\n&#x200B;\n\n# [Winning on Wall Street](https://amzn.to/3rH4TyH) by Martin Zweig\n\n* Zweig's success came from his ability to predict the bigger picture (such as trends in the broader market). The combination of his stock picking skill, general market understanding, and market timing, made him one of the great investors of stock market history. Zweig was more interested in growth than value. Unlike Buffett, Zweig isn't a 'buy and hold' investor. An AAII 8 year study of different strategies showed Zwieg's returning 1,659.3% from 1998-2005. He was #1 out of 56 others, including Buffett, Lynch, Fisher, O'Neal's CAN SLIM, Motley fools, and using ROE, P/E's etc. Second place was O'Neal's CAN SLIM with a 860% return.\n\nhttps://preview.redd.it/tysdlflqng191.png?width=313&format=png&auto=webp&s=7d8ce17fd8550c7fd873d563fa3b90cd82b8c005\n\n&#x200B;\n\n# [Irrational Exuberance](https://amzn.to/3mbTjKQ) by Robert Shiller\n\n* Shiller makes strong argument that perfect market theory is flawed. The Idea of perfect market theory is basically that the markets are all knowing and completely rational, and in the long run can't be beat. Therefore , you can control costs with index funds and diversification. (You can't beat the market, therefore controlling costs and diversifying seems like logical strategy)\n\nhttps://preview.redd.it/l01rs20rng191.png?width=331&format=png&auto=webp&s=151c657fc6b320267ae031848aa220565c024e7b\n\n&#x200B;\n\n# [The Bogleheads' Guide to Investing](https://amzn.to/3uaehfS)\n\n* The key concepts of this book are risk tolerance, asset allocation, a balanced portfolio, tax efficiency and cash management. This book explains many of the pitfalls of investing. The Bogleheads and Jack Bogle preach the power of compound interest. Investing in low-fee index funds and holding them long-term is the method. This book gives an excellent, detailed rundown of how to implement this kind of investment plan.\n\nhttps://preview.redd.it/mqmzqqerng191.png?width=335&format=png&auto=webp&s=942f56ed1175ccb9c7e5652f647b7ad24dd17228\n\n&#x200B;\n\n# [Common Sense Investing](https://amzn.to/3ucV0dW) by John Bogle\n\n* Great information for anyone who is trying to make sense of personal finance and basic investments. This book explains why passive investing is a worry free, long-term strategy that consistency wins over time, and why active trading always returns to the mean.\n\nhttps://preview.redd.it/h7aw2btrng191.png?width=354&format=png&auto=webp&s=8d706a714a567b2e59a27f840328cce4496408f0\n\n&#x200B;\n\n# [The Intelligent Investor](https://amzn.to/2PqdzMQ) by Benjamin Graham\n\n* This is a great book for anyone who is interested in introducing themselves into the world of investing, or wants to get better at investing. This book gives lots of valuable information to help one understand the basics of value investing.\n\nhttps://preview.redd.it/jux3a18sng191.png?width=325&format=png&auto=webp&s=7ca28ae1e0affb69e1c1717da5d18b86660c4642\n\n&#x200B;\n\n# [The Only Investment Guide You'll Ever Need](https://amzn.to/3ugMSJu) by Andrew Tobias\n\n* This is a book for people looking to learn the basics of investing and saving money\n\nhttps://preview.redd.it/n8odacksng191.png?width=328&format=png&auto=webp&s=f1b6ef78987fd43e278b18f267c8ce8621ef4d5f\n\n&#x200B;\n\n# [You Can Be a Stock Market Genius](https://amzn.to/3meewnv) by Joel Greenblatt\n\n* This is not a book for beginners. Greenblatt gives a nice exposition of some more \"special situation\" investment styles & areas of equity investments (mergers, spin-offs, rights offerings, etc.)\n\nhttps://preview.redd.it/mjm6kxzsng191.png?width=333&format=png&auto=webp&s=80d6fb469143339516c9012b6b7d60162ffab565",
        "num_comments": 31,
        "comments": [
            "r/FluentInFinance was created to discuss money, investing & finance! Check out the FREE Newsletter, Youtube Channel, or Twitter, Subscribe at www.BeFluentInFinance.com\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FluentInFinance) if you have any questions or concerns.*",
            "Surprised to see Psychology of Money, and Millionaire Next Door missing. Also Benjamin Graham is an awful read, even though the ideas are great. You can find a better version of his teaching written for a broader audience in other books.",
            "Which one would you guys recomend as the starting one? Nothing too heavy ideally",
            "It would be awesome if some one picked the top 10 stocks according each book this year 2024 !!",
            "Recently finished the \"Principles\" by Ray Dalio  and it was a great read!\n\nBack in the days I read \"The Intelligent Investor\" by Benjamin Graham and it was a though read... may I should revisit it...",
            "Trading for a living by Alexander Elder \nThe disciplined trader & Trading in the zone by Mark Douglas\n\nThese should be on top of the list if you even consider trading. Everyone is capable of learning the fundamentals of basic trading and even the advanced trading techniques, but the market is never 100%, you’re going to lose sometimes. You have to learn to manage your feelings. These books teach you the psychology behind trading. Having self awareness and discipline will help you to make better trades and retain your portfolio.",
            "I've read The Little Book and it's pretty good but I can't help but think that value trading is not the best idea in the current market.",
            "Great book to read-you won’t believe it when you do.\n\nConfusion de La Confusions. 1688\n\nInvesting advice-buy the longest term options on the market you can afford.  People will always try to advance the market.",
            "I’m gonna get Irrational Exuberance audiobook and listen to it",
            "Thanks for sharing..",
            "Add The Masters of Private Equity and Venture Capital to your list",
            "![img](avatar_exp|175728865|bravo)",
            "actually read The Bogleheads' Guide to Investing - good book tho, but probably outdated. you should pick some new ones since the markets are changing everyday",
            "You spoiled brats don't know what poverty is...\nHow many of you idiots have ever lived in another country?  If you did you would know how easy your life compatlred 95% of the world.  \n\nIf you want nice things, get real skill sets that apply to the job industry outside fast food!",
            "Thank you for making this list.",
            "Bogle's Common Sense Investing has been my fav . It prompted me to start investing back in 1987 when most funds required 3k or 5k to start Vanguard Star fund could be started for $1000 . in my 20's i coundnt afford to buy a fund for 3k but Bogle made Star fund an affordable gateway fund for invester to get started and be in the market. I still invest in STAR fund  and also Wellington and in a total market fund from Fidelity FZROX.",
            "Great list. Read all of these solid foundation.",
            "Graham is all you really need (besides loosing few k$ on options:\\] )",
            "ok",
            "what books would your recommend that capture graham's ideas?",
            "It’s not on the list but I thoroughly enjoyed “psychology of money” it’s not too heavy and it’s a great start to understanding more about how people think when money is involved",
            "Good question!",
            "Start with classics if you know nothing. A radmon walk down wall street is great. The chapters on margin of saftey is still the gold standard and maybe the most important investing concept that nobody seems to want to follow.\n\nGranted I have only read two of these but both are top notch based on the research out there. But its a great list. If you want to get into real estate investing Irrational Exuberance is the gold standard as far as I consider. His ideas hyper apply to real estate markets. I mean he created the Rober-Shiller Index which is the index for the housing market.",
            "Actually the version they show there is a great version - it is annotated by Jason Zweig. Yes, the original Graham book is dry and a boring read, but Zweig annotates every paragraph and makes them relevant. Also, the original book is from 1949 and while the principles apply, it’s super dated. Zweig gives recent examples and shows how the advice still applies today.",
            "Thanks for the tip! Will look that one up"
        ]
    },
    "👋Join r/FluentinFinance's weekly newsletter of 40,000 readers — where we discuss all things investing and finance!": {
        "title": "👋Join r/FluentinFinance's weekly newsletter of 40,000 readers — where we discuss all things investing and finance!",
        "score": 40,
        "url": "https://www.TheFinanceNewsletter.com/",
        "content": "",
        "num_comments": 5,
        "comments": [
            "r/FluentInFinance was created to discuss money, investing, and finance! Check-out our Newsletter, Youtube Channel or Twitter for additional insights and updates — Subscribe at www.BeFluentInFinance.com!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FluentInFinance) if you have any questions or concerns.*",
            "good"
        ]
    },
    "“Medicare for All” would save the U.S $5.1 Trillion over 10 years": {
        "title": "“Medicare for All” would save the U.S $5.1 Trillion over 10 years",
        "score": 16648,
        "url": "https://www.commondreams.org/news/2018/11/30/easy-pay-something-costs-less-new-study-shows-medicare-all-would-save-us-51-trillion",
        "content": "",
        "num_comments": 2015,
        "comments": [
            "r/FluentInFinance was created to discuss money, investing & finance! Join our Newsletter or Youtube Channel for additional insights at www.TheFinanceNewsletter.com!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FluentInFinance) if you have any questions or concerns.*",
            "What about the share holders? WON’T SOMEBODY PLEASE THINK ABOUT THE SHAREHOLDERS?",
            "But what about the economic rape of America by the medical industrial complex?  How will we continue to feed the insatiable financial appetites of the few who have become insanely wealthy under our current “system”?",
            "I work for a major US hospital. My health insurance is $1200/month for my family- of which I pay about half. My spouse just had a tube of blood drawn, and we had to pay $132 OUT OF POCKET. Apparently, I need to meet an $8000 deductible before things like diagnostic testing is actually covered by my insurance.",
            "That’s trillions the paperpushers and administrators won’t get a piece of. Lobbyists will have a field day with this",
            "Ha! Not a chance of this ever happening.  Just think of that crappy job you have for the only reason of the company’s “cheap” healthcare plan. \n\nWith U-heathcare, you could work anywhere, in fact, companies might have to become more competitive and pay a living wage to keep you!  \n\nNope! Never happen- there are billions in lobbying monies just waiting to fall into the pockets of politicians who can and will squelch better, cheap health care for Americans.",
            "I don’t know if this claim or its math are accurate. What I do know is this:  US healthcare is in crisis.  I’m a nurse practitioner and I have never seen turnover like this before, especially of physicians. The workload and environment are untenable.  Systems are crumbling, yet money continues to be extracted.  Patients and workers are not getting what they need. \n\nAnother thing I know, patients wait here too, sometimes for over a year, depending on the complaint and specialty.  The argument to keep our system as is because patients wait in single payor systems is simply not a good one.",
            "**In America:**\n\nPerson with a fever of 99.0F (37.2C): Get back to work.\n\nPerson with a fever of 100.0F  (37.7C): Stay home take some cough syrup.\n\nPerson with a fever of 101.0F (38.3C): Stay home take some cough syrup.\n\nPerson with a fever of 102.0F (38.9C): Stay home take some cough syrup.\n\nPerson with a fever of 103.0F (39.44C): I'm going to try cooling down with a bath.\n\nPerson with a fever of 104.0F (40C): I think I should go to the hospital.\n\nPerson coming across a Person convulsing on the ground with a fever of 105.0F (40.55C): \"OMG! CALL A $10,000 AMBULANCE!\"\n\n**In Countries with Universal Health Care:**\n\nPerson with a fever of 99.0F (37.2C): I'm going to see a doctor.",
            "How much would we save if overweight adults dropped to below 20%?",
            "Can we count on the government to successfully implement Medicare for all without it being just as expensive as non Medicare options?",
            ">According to the [200-page analysis](https://www.peri.umass.edu/publication/item/1127-economic-analysis-of-medicare-for-all) of Sen. [Bernie Sanders](https://www.commondreams.org/tag/bernie-sanders)' (I-Vt.) Medicare for All Act of 2017, the researchers found\n\nI tried to follow this link and got a 404 Error.   I also tried to follow and earlier link which also lead to a 404 Error.\n\nI guess I can't comment intelligently because I can't see how they did their calculation.",
            " I remember hearing stuff like this 10 years ago. Universal healthcare gets in the way of the rich and their many ways of exploiting the poor. While they are in charge, this will never happen. \n\nAnd they become further and further in charge every day.",
            "To quote Nixon, \"Fuck the people!!\"",
            "Too bad America can't think beyond 4 years at a time.",
            "Not taking sides against a public health care option, but this definitely sounds like a people trying to to fit the math to come out to the answer they want.  Someone else could fund a study coming to a different conclusion and we would not know if either would turn out to be true.",
            "Because the govt is known for saving money and never having ballooning budgets/spending",
            "I've personally lost trust in both the government and companies to handle healthcare. \n\nCompanies just make some bean counter override my doctor's recommendations and if we let the government do it there'll be four years where we have a system that has a vague support of science and another four years where we'll be putting chickens on our bubos and blowing smoke up the assholes of every drowning victim.",
            "Which is why it won't happen.  Somebody (somebodies) won't make 5.1 Trillions dollars.  Cheaper to buy a congress than to take that kind of loss.",
            "What to do about the 1,000 executives put out of a job? What about their second homes?",
            "Is this similar to how the ACA was going to make healthcare affordable without making people change their doctors? Because that didn’t happen for most of us.",
            "You’re being anti-corporatist, you should stop or you’ll trigger the shareholders",
            "Straight up, American's could set \"Medicare for All\", allow all insurance companies to transfer their employees to Medicare administration. Most of the staff would be unnecessary (that is where the savings come from mainly), but the US government could guarantee their wages, based on their previous years wages, for the next 10 years to allow them to retrain, retire, find work, etc. \n\nThose who want to continue their career in the Medicare system could apply for permanent positions in the Medicare system as the large increase in cases will require trained staff, Medicare could open offices across the country for the needed workers and allow the rest to \"work from home\".  \n\nWorkers who are temporary could seek positions in a new industry, use the money to go back to school, transition back to the private non-medical insurance industry, or simply keep cashing their pay cheques for 10 years and retire. Every year natural attrition would save the system millions, and after 10 years they would have all of the savings, and the private insurance industry would save the cost of transitioning their staff (or mass layoffs) that would accompany such a massive change.",
            "Nope this would let them Dems win. Can’t let that.",
            "\"But we would rather burn down the country than let knee growths be treated as equals.\"\n\n- Most of America\n\nHaving been born into and raised in the south, hatred of minorities is the primary political position of millions of Americans.\n\nBut call them \"racists\" and they cry.",
            "Common sense isn't allowed here. Sponsored by Splurge. Use code \"Splurge\" at checkout for 10% off a shitty policy that only covers 100,000 and 5000 deductible!",
            "Ah yes, if there’s one thing we can say about government services, it’s that they drive costs down 😅",
            "But how will exploit the working class if we don’t tie (fucking shitty) healthcare to employment!?!?!?!?",
            "I have yet to see a single government program that saved a single dollar (excluding the IRS and income tax)",
            "do people on Medicare like it?",
            "Obamacare repurposed.",
            "No it wouldn't. It would just give people a different broken system to try to exploit, except this time it would be run by bureaucrats who only care about political advancement with no incentive to make the system better, as opposed to right now where at least there is some incentive to provide more appealing options than competitors.\n\nI'd much rather deal with the demon who's intentions are plain than the one who hides his motives.\n\nLet's fix the system instead of just nudge it into different hands.\n\nMake malpractice a criminal offense tried by a jury of physicians. No more money flooding into lawyers pockets. No more malpractice insurance to pay out giant settlements.\n\nGet rid of health insurance and make cost available upfront. Insurance is a business model that is incentivized to not do the very thing that you pay them to do. Most businesses take their revenue and spend it on the supplies and labor necessary to provide goods and services to the consumer. Insurance takes your money for doing nothing, and spends it on trying to find ways to deny your claims so they can keep it. Dumb system.\n\nThe primary reason healthcare is expensive in this country is because of insurance. Insurance haggle with hospitals over what percent of a claim they are willing to pay, and the hospital often eats the rest of the cost. If a hospital gives you a medication that cost them $1 to get, they will charge the insurance company $100 to get $5. If they charge the insurance company $5, they will only pay 25 cents. So the hospital charges to $100 to get $5, but if you don't have insurance then you still get a bill for $100. These are fake prices, and need to stop.",
            "How much will your federal taxes go up to cover this?",
            "Then why won't Biden push for it?  The dems have major power in congress right now.  Why don't they do this?",
            "According to the same people who said Obamacare would save money and they were wrong. Healthcare costs skyrocketed.",
            "But that wouldn't make line move up for private corporations.",
            "$5.1 trillion.",
            "Which means the oligarchs in the US will miss out on $5.1t dollars. Tough battle to win.",
            "Yeah, but it would also cost the health insurance industry leadership $5.1 Trillion over 10 years so they'll never go for it because they need another ski chateau at Big Sky that's closer to the lift line.",
            "And fuck those of us who are sick and actually need it. \n\nWe have Medicaid for the poor \n\nMedicare for the sick and elderly\n\nEveryone else is able-bodied",
            "QALY designed programs save a lot of $$ everywhere it's used. The consumer suffers physically, but whatever.\n\nMedicare is a terrible program. The only people who think it's good are those not using it. Kind of like Social Security. It's great until you do the math and realize it's terrible.",
            "But the physicians never went to med. school.",
            "And make the health insurance lobby go broke. Cutting off an income stream to congress. Magic 8-ball says “NEVER GONNA HAPPEN”",
            "Fuckin up that profit schema. \n\nIf it won't make billionaires more rich, it ain't happening until we revolt.",
            "I heard an interesting hypothesis aboit how our system stayed fucked and other countries did it.\n\nIn ww2, europe and japan were destroyed. Obliterated. Their governments had to prevent disease spreading, cover food shortages, and all on the tightest budget - nationalizing healthcare is simply more affordable. \n\nThe US by comparison was functionally untouched by the war. Our system of healthcare was increasingly privatized by then. And it had no incentive or reason to be changed due to pure necessity of postwar reality - our economy was roaring.\n\nThe same logic could be applied to public transit.\n\n\nBut this is just a hypothesis, i have no data or actual facts spent studying it. Just interesting to think about.",
            ">Medicare for All” would save the U.S $5.1 Trillion over 10 years\n\nSure. Ok. But tweak that model and suddenly Medicare for all costs an extra $5T over 10 years.\n\nStart by expanding Medicare and then see a) what savings are realized and b) the resulting change in health outcomes.  If they're both positive, then expand more.\n\nWe can start with all the advocates of Medicare for All in the Senate and the House. Prohibit their use of private health care and mandate their enrollment in Medicare for All.\n\nIf it's a good idea for America, then it's a good idea for them.",
            "This is the single biggest issue facing the county in my mind.  Imagine the mental health gains alone.",
            "Veteran Care for All would save even more. Imagine no accounting paperwork and no high paid executive.",
            "It would break the Health Care Monopoly, which has got a lot of paid representation in the US Congress.",
            "The alternative interpretation is that currently the medical/insurance industry devours $510BN a year, and the people making that money have a huge incentive to oppose change.",
            "That’s $500b a year btw. Inflating numbers over time is odd to me.",
            "And it could unfortunately still leave millions with massive medical debt.  It’s a step in the right direction though.",
            "But those savings mean the leeches that are making a living off of those costs won't. That's why it will NEVER happen.",
            "The trouble is that if it would save US taxpayers/voters/patients $5.1 Trillion it would cost Providers/Pharmaceutical companies/medical device manufacturers/Insurance companies $5.1 Trillion.  They are going to fight real hard to keep what they have.",
            "Think about the collateral damage this would cause. The no longer necessary health insurance conglomerates might need to consider doing something other than raping the government, small businesses and the public at large. Anyway...",
            "I'd be surprised if it was that little.",
            "Not likely.  Several someones out there would find the right scam to take their slices off of that supposed savings.  I think it would more realistically end up being a financial wash, but more people would get the care they need.  That would still make it better than the current system.",
            "Garbage",
            "The whole Medicare budget wouldn't even cover the GLP-1s for people who qualified for them. Don't know what this is supposed to tell me",
            "B-but the 100 billionaires wouldn't be able to buy a second yacht to fit their first yacht into!",
            "I want it to happen.  It's a major reason why I've supported Bernie Sanders since 2014.\n\n\nWe just went through a pandemic and the USA government didn't even vote on this.\n\n\nIt is NEVER going to happen ",
            "Considering that Congress won't implement real cost controls on Medicare or Medicaid, it won't save money.",
            "You can get free healthcare plans over at healthcare.gov \n\nUnemployed? You can get full benefits for $0 a month",
            "bUt ThAt’S sOciALiSm",
            "It would increase deficit spending to two trillion a year and result in massive inflation. \n\nYou don't need a M4A. Practically every healthy problem would be better addressed with diet, exercise, not drinking, not smoking, not eating sugar, eating vegetables. \n\n57% of young people today are obese! 57%! Healthcare is a service, not a solution.\n\nIt would absolutely destroy America. For more reasons than I care to list here. One of which being the GOP would never go for it and would destroy it at every turn, making it far more inefficient. And the healthcare industry would prosper so much, they'd print new billionaires every week. \n\nWe need a universal cancer coverage and universal preventative care coverage. Everything else should be private. \n\nMost of the horror stories you hear about healthcare and cancer. Again, diet and exercise would address this and a universal insurance for cancer disaster is definitely an option.\n\nThe fact is that no one here, not a single person, truly understands what this system would take. You think it's about good vs evil. It's not. It's just not practical, it makes no sense. But you don't want to hear it, you'll just ignore what im writing because it doesn't serve your narrative. \n\nYou're 100% wrong if you think this current plan would work.",
            "We totally shouldn’t do it then…",
            "NOT ENOUGH !!!! If it isn’t $100 trillion then don’t talk about it",
            "https://preview.redd.it/1b5lnwyqfz7d1.jpeg?width=1125&format=pjpg&auto=webp&s=e9681c7d444320a3ffcce43bc97d2846e71aa29a\n\nnot related to the topic but i thought it was cool",
            "How? Do they think hospitals and providers will charge less?  When there is a guaranteed payer they prices will only increase, just like college tuition.",
            "Yeah, paying only 1/25 of billed services won’t put any hospitals or clinics out of business",
            "The Medical Industrial Complex employs a lot of people.",
            "That's probably not even at all trying to count how much it would save individuals.",
            "Not one of the two parties are in favor of it and the people keep voting for them we get what we deserve.",
            "The question nobody is asking is how exactly will it save the US 5.1 trillion? Who do you mean by the US? The government? The people? How will we finance it? Higher taxes? Are you supposed to just trust me bro?",
            "Not if limits aren't put on the medical industry.",
            "Hospitals will create a platform to auction organs, if they are left to their own.",
            "We already paid of Israel 🇮🇱 healthcare and education.",
            "Try finding a doctor that accepts Medicare patients. United Health Insurance is buying medical clinics, closing them and leaving Medicare patients without a doctor. It happened to my husband and me.",
            "Said differently, it would eliminate $5.1 trillion in revenue from the healthcare providers.  I.e. you see why it’s in their interests to spend billions to lobby against this change.",
            "Sure, everytime the government projects a cost rather that's in revenue or loss they miss the mark.",
            "Nope. It would cost money. Please learn how to think critically",
            "This $5.1 trillion consists of my salary so I’ll pass",
            "It would be a superior system to what we currently have.",
            "All for socialized medicine but we can’t provide for the world - ie open borders.",
            "Yeah, but the shareholders wouldn’t make more money and that’s what really matters.",
            "Not just saving money. But it would save even more money by the country being in a much better state, mentalist, physically, etc.",
            "R's - Hey hey....we're not socialists...the radical left us trying to provide for EVERYBIDY..../s",
            "You dont say...",
            "Yeah, this has been known. Insurance companies will fight till their death to stop this",
            "I would love to wait years for care like they do in Canada...",
            "It won't happen because that money is currently going into someone's pocket.",
            "SShhhhh Mathin' ain't easy for some.",
            "Whenever I read these ideas, the quote that lives rent free in my head always comes to mind. \"He's not hurting the people he's supposed to be hurting.\" \n\nWe have a large segment of the population, who would rather no one get healthcare if it means the people they don't like, don't get healthcare either. We have decades of large voting blocks who vote against their own interests due to the culture war.",
            "But.. but.. what about the record year over year Big Insurance and Pharma profits?  /s",
            "Yeah unfortunately we are living the beginnings of a blade runner type distopia here state side.\n\nThis is what happens when regulations for cooperations are made by the very industry that should be regulated.",
            "Yes “but I can’t choose my own doctor” member that old chestnut?",
            "But it would lose pharma, insurance companies and the health industry money. Can't have that or CEOs might not be able to buy their seventh yacht this year.",
            "Aka Medicare for all would cost a bunch of fat cats that much in profits that they can squirrel away into investments and offshore bank accounts and use it to build bunkers. Think about who doesn't get that money. Those are the people who are stopping this from happening. Some of them might be you, like if you work for a PBM or a health insurance company or are an administrative person at a hospital",
            "Yeah, sure thing bud.",
            "Woke policies!!!!",
            "Hahahahaha omg thanks!",
            "I love how it gives no real details on how it will save u.s. money. We will still rely on big pharma I don't think they are willing to take a profit loss when many of the larger shareholders are our law makers.",
            "Who is going to tell them?",
            "Imagine going to a restaurant with your family and when they come with the bill that shows it’s $200.   Then they say “if you pay for everyone else’s food too, the bill would be $150 instead of $200 just for you”.   \n\nThen imagine saying no.  Because other people having a worse time makes your dick hard.  That’s what this is.",
            "its almost like proavtive medical care and letting people go to the doctor when sick and injured whenever they can without worrying about medical costs is much cheaper than people waiting till they are on death's door increasing the cost of treatment",
            "Ease the debt and give people healthcare. Win win",
            "We could nationalize every health insurance company and then take every executive/board member from those companies and jail them for life for hundreds of thousands  (if not millions) of murders, untold amounts of fraud, and crimes against humanity. Then take every single last asset they own and auction them off to pay for the transition. It would start to provide justice to the American people.",
            "We spend more on helping banks and finance market execs.",
            "\"Would allow the government to spend $5.1T dollars elsewhere over 10 years\" \n\nFIFY\n\nThe government does not save money in the way we think. They move it from one spending source to another. That is all.",
            "When has a government run program ever saved money compared to the free market?  People are sheep looking for a handout.",
            "Never gonna happen",
            "The United States spends [**twice as much per person**](https://www.commonwealthfund.org/publications/issue-briefs/2023/oct/high-us-health-care-spending-where-is-it-all-going) on healthcare services as countries with socialized healthcare spend. All of that tax money, in fact, *double* the tax money per citizen, goes to paying healthcare corporations instead of paying for a national, equitable healthcare system for all of us.\n\nNow, with the government spending **2x per capita** on healthcare compared to countries like Cananda and England, somehow, as if by magic, [healthcare debt causes 60% of all personal bankruptcies](https://www.citizen.org/article/medicare-for-all-prevents-medical-bankruptcies/) in the United States.\n\nSo, the Federal Government spends twice as much per person on any comparable country, while the out-of-pocket expenses for individual healthcare drive the majority of bankruptcies in the United States.\n\nWhere is all the money going? That is a reasonable question, because despite all the money we spend as individuals, and all of our tax dollars our Federal Government spends, people in the United States [have lower life expectancy than countries with socialized healthcare,  higher mortality during hospital care, and the mortality rate for mothers giving birth is almost *3 times higher* than the next worst country for maternal deaths and **6 times higher** than the average rate.](https://www.kff.org/health-policy-101-international-comparison-of-health-systems/?entry=table-of-contents-how-do-health-insurance-systems-and-coverage-in-the-u-s-compare-to-other-countries)\n\nI don't know where all the money is going, but it's sure as hell not going into healthcare.",
            "Like any estimate this will be wrong very very wrong",
            "Rich Americans apparently need there to be poor Americans to compare themselves to or they aren’t fulfilled.",
            "It would eliminate the leeches",
            "How many libs will that unown though?",
            "But would leave these politicians without Big Pharma throwing money into their pockets.  How will they ever feed their kids if they just accept their pay as a normal politician?",
            "Force the 1% pay for it.",
            "It won’t , government can’t run shit",
            "Communism!!  Some folks will prefer to die in their own feces and bankrupt lifes",
            "It's not about saving money it's about getting rich get with the program!",
            "Without flat taxes it's just another welfare program that some of us would have to pay for.",
            "What ??? No —- if you do this Medicare for all then people cannot pull up their bootstraps!!!!\n\n\nNoooooooo",
            "Yeah, but that 5.1 trillion is coming out of the pockets of the pharmaceutical and insurance companies!! Think of the poor medical industry!",
            "Why not say 500 billion per year? That sounds like a lot more.",
            "I actually think there are better systems but literally anything is better than we have. I have excellent private insurance and also the VA. The VA is also pretty dang good but I actually opt to use private clinics not covered by either because I have the means and it’s more convenient. I would much rather the resources go to those who need it. And I’m not even a millionaire. I can’t ever fathom being a billionaire. The govt has to step in a curved their lesser instincts.",
            "HAHAHAHAHAHA AMERICA ACCEPTING THE IDEA OF PROVIDING UNIVERSAL HEALTHCARE HAHAHAHAHAHAH",
            "Yep",
            "Politicians have a narrow world view, They don't Understand that Saving money is Having more money, they Only understand that Getting money is having more money >\\_>",
            "Nahhhhh 30 billion more for Ukraine and isnotreal!!!",
            "I’ve see what happens in hospitals. They over charge the shit out of everything from a small container of apple sauce to multi million dollar equipment. They overcharge the insurance companies and then the insurance companies play broke and can’t help people of all classes because their insurance “doesn’t cover that procedure” and other similar stories. \n\nIt’s all being inflated. It’s all a bunch of bs, but I have no idea what I’m talking about so perhaps u should go take a look for urself and figure out why we don’t have free health care- spoiler- it isn’t so simple as “because we have a big military”",
            "Not that I disagree with the assertion, but why are we posting articles from before the fucking pandemic",
            "The US government is not interested in what benefits Americans.",
            "It’s not about saving money. It’s about punishing people they consider unworthy.\n\nAlso, the system is so confusing as it as that any change, even for the better, seems too scary.\n\nFurthermore, insurance companies and others make too much money to stop the current system.",
            "Sure let’s go it then",
            "So it would have lost corporations 5.1 trillion.  That’s a no go, bud.",
            "Are they counting the 30m illegals?",
            "that's 5.1 Trillion reasons why politicians won't give it to you, they know it comes off the plate of their friends and the donor class",
            "If you think only in terms of money (and numbers) then you don't think like an economist at all. Economists take into account incentives.",
            "That's just 5.1 trillion that the corporations lobbying to keep it privatized would argue they would lose. Ironic if true.",
            "The problem are the current set of politicians (Nancy Pelosi and friends), as well as executives, lobbyists, and shareholders would lose the profiteering.  They’re used to making loads of money and won’t quietly stand aside.\n\nWhile it benefits society, there would be a huge, almost impossible fight to wrestle control from the current people in power and do the right thing with universal healthcare.",
            "Press X to doubt",
            "I'm pretty sure that is just out of pocket cost.",
            "A drop in the bucket if they'd tax a \"church\".",
            "That’s crazy considering Canada’s situation",
            "Hey Hey! do not talk in factual numbers, conservatives and Big Insurance hate it. Just pull yourself by your bootstraps when you get injured or sick and keep paying your premiums for shit coverage.",
            "But COMMUNISM!",
            "Fiscal Conservatives hate this one trick...",
            "The issue with \"free healthcare\" is that it's not free and can be quite easily played by bad actors and stupid patients.",
            "SAY IT LOUDER FOR THE FOLKS IN THE BACK",
            "The only way it would save the US money is if they either got rid of Obamacare and let the government negotiate pricing with the medical industry, or just deny/limit care like in England/Canada.",
            "This is my favorite graph. Get rid of the bloat (admin) and divert even a fraction of that money to the people who actually impact care of the patients (physicians, nurses, allied staff, support staff). Even in doing so we will save trillions.\n\nhttps://preview.redd.it/9anlepbo708d1.jpeg?width=1290&format=pjpg&auto=webp&s=cbf976d4f2aaed547b8ddd7402837576211897ec",
            "Nah. DC would just fuck that up and spend it on something else.",
            "Not a chance it would save money.",
            "Save the US…but would take from the greedy cunts",
            "But then the insurance companies wouldn’t get theirs",
            "I’m in favor of it, but I also remember being told the Iraqi oil would pay for the war and reconstruction.",
            "Great! More money for more carriers and jets and bullets and shit.",
            "One of the reasons it would save this so much is because of the reimbursement rate of medicare in comparison to private coverage.  Medicare reimbursement has been largely stagnant, in comparison to inflation, since the 90s.\n\nThis plan does mean a reduction in the US healthcare workforce.",
            "If somehow, it, m4a, passed both houses and landed on my desk, I would veto it. wHo’S gOnNa pAy fOr iT? - Joe Biden\n\n\nJoe Biden is a good friend of mine- Bernie Sanders",
            "Think about this when you VOTE In November!!!",
            "It makes you think: who are taking those 5 trillions? Where do they go? Someone are stealing your taxes through this system, and you get nothing in return.",
            "Might as well now.  Because they destroyed our health care system for middle class America. \n\nBut we need to limit what we do for the indigent. They shouldn't just get every damn thing there is.  Way too much abuse.",
            "Making insurance schemes illegal would save the country significantly more than that. Imagine people weighing the cost/benefit of their healthcare decisions rathe than just ignoring the entire thing because insurance bullshit has made it all far too complicated and expensive.",
            "Insurance companies will never let this happen. It would literally mean the end of private health insurance in the US as we know it. That's a multi-billion dollar industry. Some of the largest lobby-funding groups in the world.",
            "Let's do it! Stop this big scam known as \"insurance\".",
            "Republicans will hear this and think, \"If it doesn't save me money, it's worthless.\"",
            "No shit",
            "Mannn like 5 ppl gonna not be as rich",
            "Medicare for all OR Medicaid for all? Medicare still has some quite unaffordable co-pays on some stuff.",
            "It’ll never happen because that would be “socialism”, and socialism is the most evil thing in the world! /s",
            "One step closer to communism!!!! When the government offers savings and what’s good for the people, it’s a set up always and forever",
            "THINK OF THE CEOS BOAT HOUSE PLEASE!!!\n\n![gif](giphy|3o6wrvdHFbwBrUFenu)",
            "It's good for america? Watch, the government is gonna fuck it up.",
            "Save who?",
            "The metric shouldn’t be how much money it saves, but how many lives are saved or improved…",
            "That's how much them companies would lose so the will do anyone to stop it",
            "These proposals would open doors that would never close...\n\n* A 3.75 percent sales tax on non-necessities, which includes exemptions for spending on necessities such as food and beverages consumed at home, housing and utilities, education and non-profits. The researchers include a 3.75 percent income tax credit for families currently insured by Medicaid. ($196 billion)\n* A net worth tax of 0.38 percent, with an exemption for the first $1 million in net worth. The researchers state that this tax would therefore apply to only the wealthiest 12 percent of U.S. households. ($193 billion)\n* Taxing long-term capital gains as ordinary income. ($69 billion)",
            "The primary problem with \"Medicare for all\" is the quality of care.\n\n\nThe doctors are trash and are right up there with the VA in regards to the level of incompetence and fraud",
            "Like it or not healthcare is a private good. A private good is something that is rival and exclusive. If I have an appointment with a doctor at 3:30 p.m. you cannot have an appointment at 3:30 p.m. with the same doctor. Also, it can't be \"fair\" by definition.",
            "But unfortunately it would save *the wrong people* $5.1T. Sorryyyyyyyyy.",
            "But the cost would be devastating to our top .01%. It can't be allowed.",
            "I see a lot of comments about doctors and nurses being underpaid. \n\nHere's the reality:\n\nGeneralist physicians in the US earned an average of $218,713, compared to an OECD average of $133,723, while specialists in the US earned an average of $316,000, significantly higher than the OECD average of $182,657.\n\nHospitals are in part so expensive bc our MDs are so expensive without providing much higher quality of care.",
            "Over ten years. That’s all it will take. Now please stop voting GOP and make it happen America, you deserve a better way than breaking bad to get over health issues. ",
            "Then have Congress pass a law where all politicians and their staffs have to use Medicare.  Easy peasy.  Show us how good it can be.",
            "Britain's system delivers poorer quality and poorer service.",
            "Where does that money go? \nWhere would it have come from otherwise?",
            "NIMBY",
            "I think they mean would cost rich people 5.1 trillion in missed profits. And we can't have that",
            "Yea but there are millions of people who treat their bodies like complete shit. I shouldn’t have to pay for them. They should be left to suffer for their mistakes. I shouldn’t have to pay for that.",
            "And just think if the USPS was a default ISP,",
            "How much would it cost to get to that $5.1T savings?  Cost of new systems, moving people to them, unemployment of people who work in the insurance sector who aren't migrated to work in the M4A insurance system (upward of half a million people from some quick googling), the drop in economy and taxes due to the dismantling of healthcare insurance, changes to medical record systems, staff retraining, compliance oversight expansion, etc...\n\nNot saying we shouldn't do it, I think we should, but savings doesn't mean anything without the costs to get there.",
            "Republicans don't like saving... They only want to add to the US debt...",
            "No.  It would bankrupt Medicare, and make healthcare further inaccessible.  I’m currently waiting 3 months to see a specialist.  The last time I had this issue was in 2005, and I was upset about waiting 3 days to see a specialist.\n\nThe problem isn’t affordability, it’s availability.  There simply isn’t enough doctors to see everyone.  Now people go to an orthopedic specialist for a stubbed toe.",
            "we could totally pick up a sweet used 'vette with some of that.",
            "Then stop screwing around and do it. Do it NOW.",
            "I’m so confused. How do people not have health insurance and how is it the country’s fault ? You can get it via your job or the marketplace. What am I missing ?",
            "It won’t. It’ll be a political football for like 2 decades as each party goes back and fourth funding and defunding sections of it and then it will ultimately cost more than what we’re doing now because disagreement is expensive.\n\nThe thing people just fail to realize is that no one can really do anything unilaterally.",
            "That's why corporate America will never allow Medicare for All to happen.",
            "This has been known for at least a decade or so",
            "Can I haz",
            "Yeah but that means corporations would not be able to make pure trillions in profits :€",
            "I have better ideas.\n\nRemove all smokers from public health benefits/support.\n\nNo more Medicare/Medicade trips via private ambulance for dumb shit. \n\nRemove anyone convicted of a crime related to alcohol abuse.\n\nkick out illegals clogging the healthcare system. Using EDs and ERs for GP.\n\nDeport illegals with their anchor babies, that they didn't want anyway and will probably be neglected setting them on track for mental health service.\n\nBring back institutionalization. Or just keep making the mentally ill homeless. I heard the streets are a far better option for them and society just ask shitty pockets in D.C. \n\nRemove all bed bound bariatric patients from public health aid. Unless a doctor can confirm it is ACTUALLY a thyroid issue.\n\nIf you think about it, if we had isolated China decades ago like the world did to north Korea....the GLOBE would have saved many many trillions, and saved many lives.\n\nThat being said, if you recently lived in an area known for having wet food markets. You can't come in unless you have lived someplace without for at least a year.\n\nNo more funding to hocus pocus hippy health care. \"My cancer went away when I stopped using modern medicine and started micro dosing shrooms\" you only think it did..but that because you stopped using modern medicine like CTs or MRis. Ignorance isn't a cure.\n\n\"Give us your sick and....\" That's over.  Just like Slavery is over no more taking on other countries sick so they can become a ward of the state.\n\nAbolish Nurse unions. Let market forces do to them what it does to the rest of us.\n\nIs this mean? Maybe will it save loads of money absolutely.\n\n\n\n\n\n\n\n \n\nNo more funding trashy people who can't afford one kid but have seven with another on the way.",
            "Thankfully Obamacare solved all the healthcare issues once and for all.",
            "Many businesses would lose power over their employees if health care wasn’t tied to being employed.",
            "yeah but some dumb old dude might lose a few million, who is thinking about him",
            "With 2 party system in US, it ain't happening.",
            "But that's communism/s",
            "Yeah.  The government has such a fantastic track record of fiscal responsibility.",
            "I stopped reading at the mention of Senator Bernie Sanders report. While I think there’s a valid argument for Medicare for all, quoting Senator Sanders study isn’t enough for me.\n\nWith the way Congress works, even if 90% of Americans were behind the concept of single payer, it would still take them 40 or 50 years to get around to doing something about it. Just look at Social Security. They will kick the can down the road as long as they can, and then some. True leadership is absent in our government and social media like Reddit doesn’t help, but just makes it worse",
            "Who you think that money goes to?  They aren’t interested in saving money.",
            "Can we get an independent, 3rd party analysis on this?",
            "at least",
            "So many naive people in here think socialized healthcare is a good thing. Like theyre not the reason shit is expensive af.",
            "Lol no it wouldn't. Just like affordable college and affordable housing lands, FREE MONEY CAUSING FREE MONEY PROBLEMS.",
            "Nah, empathy and compassion are psyop agendas pushed by socialists /s",
            "Of course it would",
            "I’m a staunch liberal and agree healthcare needs to be fixed. That said, I have friends who live in Canada and Germany, both of which offer free healthcare.\n\nMy friend in Canada pays 60% taxes. She makes a decent salary (80,000 U.S), but has to have a second job because she can’t afford her expenses otherwise. She does say healthcare is pretty good, but said that she had to wait 9 months for surgery a few years ago (I have no idea how this compares to the US as I’ve never had surgery, so I’m just sharing).\n\nmy friends in Germany say the same thing about waiting. His mother in law (who was born in Germany) sometimes has to wait months to get care that she needs. They agree, the cost is nice, but struggle with the wait times because the MIL in her early 80s. \n\nAgain, I’m not saying that Medicare for All isn’t the answer, but I do want to share friends of mine have shared, none of whom are conservative by US standards.",
            "Having your health insurance be tied to your job has to be the dumbest thing ever conceived.",
            "Or 4 trillion by NOW if it was enacted in 2016.\n\nGotta love opportunity cost.",
            "If I’m not adding shareholder value then what are we doing here?",
            "The bottom line is profit= before people",
            "I remember when there was a Koch backed study, I think the Heritage foundation, that arrived at similar findings to this with a slightly smaller number of ~2T a number of years ago prior to the Covid pandemic. It wasn't even citing savings from a reduced market or an adjustment of the majority of costs, like prescriptions prices. It's just that they'd be intervening more to improve lives at less critical points where interventions are worst. Get more hospital and care doing normal things rather than fewer having to do the extreme",
            "It would certainly make the phenomenon of people falling into instant poverty when a serious medical issue arises a thing of the past.   Because right now you have to have some seriously robust medical insurance AND a lot of cash on hand to be able to absorb that kind of illness.\n\nI've 3x in my life been in that kind of situation but because I live in a country with socialized medicine I walked away with a bill of 0$.",
            "not a fucking chance",
            "Exactly, everyone looks at the healthcare crisis from the perspective of the patients , lol the US healthcare is built around the private equity groups , insurance industry, big hospital systems , big pharma ,labs and diagnostics imaging, medical devices  ....every part is making fat profits, look at it from their perspective and it all makes sense. Meanwhile 33+ other developed countries with way smaller economies can somehow offer universal healthcare..go figure...",
            "From personal experience dealing with a health care billing department is impossible. They do nothing but send emails to each other about emails. It's not even about making money since they're not even good at that. They would improve the efficiency of healthcare if they just dug holes and filled them back up.",
            "They have a fi*DOUCHE*iary responsibility to gouge as many people as they can at their weakest moment! \n\nHow am I going to afford my house in Hawaii? The economy is going to collapse!",
            "My wife works for a health insurance company. Medicare for all would likely mean she loses her job or goes with the federal government. It could cost us almost half of our income. Everyday, I hope we get Medicare for all. We can bounce back individually for the good of the whole.",
            "Been holding UNH stock since 2012. 38yrs old and could retire now if I wanted to. Please think of guys like me before you comment. lol. \n\nAll jokes aside, it’s too big to fail. Bunch of scumbag companies.",
            "The healthcare industry spends more on lobbying than the defense and fossil fuel industries combined.",
            "Seriously think of the poor C-level employees that won't be able to redo the walnut wood trim on their yacht's kitchen 😭",
            "Yep, that’s the problem. All the lobbying and shut, because they don’t want the faucet of money-flow to stop.",
            "Lol if it was only healthcare, add to that the military industrial complex ,big oil, big agriculture, bill banking sector etc.... the US economy is the seat  of capitalism and maximizing profits for the capitalists , how do you propose we change that?",
            "You pay $1200 for insurance and didn’t read what is/is not covered before meeting the deductible? You pay that much for that high of a deductible?",
            "Actually, I believe that is their piece.",
            "It's saying that it would cut costs by roughly 11%, which is rather audacious. \n\nMedicare admin costs would be the same, or higher, which is around 2-5% under M4A.\n\nPrivate insurance admin+profit is ~17%.\n\nHowever only about 65% of people are on private insurance.\n\nSo even if you dropped all private insurance and profit to admin rates of Medicare, it wouldn't cut over all costs by 11%. They are claiming some downstream economic benefits which may or may not be actualized.",
            "Do you believe paying nurses less would somehow ease the staffing issues? The argument against a single payer system like in Canada, is valid, has always been valid, and always will be valid. Healthcare sucks in Canada. Wait times are terrible for anything other than acute care. Pay for providers is low which is why you get a lot of immigrant providers from places like India, where as in the US you get immigrant providers from places like Canada...",
            "A temperature of 99.0F is not a fever.  It is well within the average of normal body temperature.  An elevated temperature is not considered a fever until it reaches 100.4F.  If everyone with universal care went to a doctor at 99.0F it would bankrupt and clog the system very quickly.",
            "Does everyone in Canada and the UK really go to the hospital when they have a fever of 99F? What about when they get a splinter, mild ankle sprain, or runny nose?",
            "? And the doctor is supposed to tell you go back home and drink water and take Tylenol. What else are you supposed to do when you get a cold. \n\nMy copay is $10 and med cost $5 and I don’t go to the doctor for cold. If your doctor is prescribing antibiotics for common cold then you should report that doctor right away lol",
            "I get your point but please don’t go to the doctor just for an isolated low grade fever (fyi fever is 100.4 and above). Stay home and take a fever reducer is the correct answer. No need to come into a doctors office/ER and get vulnerable people sick.  \n\n-a physician",
            "My favorite counter argument I've heard is \"people will just go to the doctor for anything!\"\n\nWhich 1: have you been to a doctor's office? It sucks and is boring.\n\n2: fucking good, id rather have people go for minor issues and live better lives",
            "And then by the time they see one their fever is gone lol.",
            "American having lived in Europe and the UK. \n\nNo it’s more like having to wait several weeks to be seen by a GP to be told to go home and take Tylenol while resting. I had my foot run over by a car and was told the same thing.",
            "In cartoon reddit America maybe. In real life America routine doctor visits are covered if you're one of the rare 95% of Americans with health insurance coverage.",
            "99 isn’t a fever.",
            "Who the hell is seeing a doctor for 99* fever. Better question what doctor is going to allow such stupid visits",
            "Are people really this ignorant about America, lol?",
            "Going to the doctor's office every time you have a 99F temperature is a huge waste of resources.",
            "What’s your proposal? \n\nit is crazy how well obesity rates correlate to political parties.\n\nIf you start at the fattest state, you have to go to number 13 before you hit your first democratic 2020 voting state. 19 for your second. Only 2 dem states in the bottom 20, only 4 rep states in the top 20",
            "20% What?",
            "Not much. \n\nThe UK recently did a study and they found that from the three biggest healthcare risks; [obesity](https://iea.org.uk/themencode-pdf-viewer-sc/?file=/wp-content/uploads/2017/01/Obesity-and-the-Public-Purse-PDF.pdf&settings=111111011&lang=en-GB#page=&zoom=75&pagemode=), [smoking](https://iea.org.uk/themencode-pdf-viewer-sc/?file=/wp-content/uploads/2017/08/Smoking-and-the-Public-Purse.pdf&settings=111111011&lang=en-GB#page=&zoom=75&pagemode=\n), and [alcohol](https://iea.org.uk/themencode-pdf-viewer-sc/?file=/wp-content/uploads/2016/07/DP_Alcohol%20and%20the%20public%20purse_63_amended2_web.pdf&settings=111111011&lang=en-GB#page=&zoom=75&pagemode=), they realize a net **savings** of £22.8 billion (£342/$474 per person) per year. This is due primarily to people with health risks not living as long (healthcare for the elderly is exceptionally expensive), as well as reduced spending on pensions, income from sin taxes, etc.. \n\nIn the US there are 106.4 million people that are overweight, at an additional lifetime healthcare cost of $3,770 per person average. 98.2 million obese at an average additional lifetime cost of $17,795. 25.2 million morbidly obese, at an average additional lifetime cost of $22,619. With average lifetime healthcare costs of $879,125, obesity accounts for 0.99% of our total healthcare costs. \n\nhttps://www.niddk.nih.gov/health-information/health-statistics/overweight-obesity\n\nhttps://onlinelibrary.wiley.com/doi/epdf/10.1038/oby.2008.290\n\nWe're spending 165% more than the OECD average on healthcare--that works out to over half a million dollars per person more over a lifetime of care--and you're worried about 0.99%?\n\nHere's another study, that actually found that lifetime healthcare for the obese are *lower* than for the healthy. \n\n>Although effective obesity prevention leads to a decrease in costs of obesity-related diseases, this decrease is offset by cost increases due to diseases unrelated to obesity in life-years gained. Obesity prevention may be an important and cost-effective way of improving public health, but it is not a cure for increasing health expenditures...In this study we have shown that, although obese people induce high medical costs during their lives, their lifetime health-care costs are lower than those of healthy-living people but higher than those of smokers. Obesity increases the risk of diseases such as diabetes and coronary heart disease, thereby increasing health-care utilization but decreasing life expectancy. Successful prevention of obesity, in turn, increases life expectancy. Unfortunately, these life-years gained are not lived in full health and come at a price: people suffer from other diseases, which increases health-care costs. Obesity prevention, just like smoking prevention, will not stem the tide of increasing health-care expenditures.\n\nhttps://www.rug.nl/research/portal/files/46007081/Lifetime_Medical_Costs_of_Obesity.PDF\n\nFor further confirmation we can look to the fact that healthcare utilization rates in the US are similar to its peers. \n\nhttps://www.oregonlegislature.gov/salinas/HealthCareDocuments/4.%20Health%20Care%20Spending%20in%20the%20United%20States%20and%20Other%20High-Income%20Countries%20JAMA%202018.pdf\n\nOne final way we can look at it is to see if there is correlation between obesity rates and increased spending levels between various countries. There isn't. \n\nhttps://i.imgur.com/d31bOFf.png\n\nWe aren't using significantly more healthcare--due to obesity or anything else--we're just paying dramatically more for the care we do receive.",
            ">How much would we save if overweight adults dropped to below 20%?\n\nAround 170 billions per year in 2016 prices, or $1.7T in 10 years.\n\nFear not, semaglutide is going off patent in 2033 in US and 2026 in Europe.",
            "Do you propose camps?",
            "Obese people tend to cost fewer health care dollars because they die earlier. Same with smokers.",
            "Perhaps that would be more feasible for them if they access to medical guidance, medical care/treatment, and access to a dietician.",
            "> **Key Findings**\n\n> * Private insurers paid nearly double Medicare rates for all hospital services (199% of Medicare rates, on average), ranging from 141% to 259% of Medicare rates across the reviewed studies.\n\n> * The difference between private and Medicare rates was greater for outpatient than inpatient hospital services, which averaged 264% and 189% of Medicare rates overall, respectively.\n\n> * For physician services, private insurance paid 143% of Medicare rates, on average, ranging from 118% to 179% of Medicare rates across studies.\n\nhttps://www.kff.org/medicare/issue-brief/how-much-more-than-medicare-do-private-insurers-pay-a-review-of-the-literature/\n\nMedicare has both lower overhead and has experienced smaller cost increases in recent decades, a trend predicted to continue over the next 30 years. \n\nhttps://pnhp.org/news/medicare-is-more-efficient-than-private-insurance/",
            "Remember “we could solve world hunger forever for $5 billion!”\n\nThis is just another one of those",
            "The Kochs funded a study to basically make the numbers as bad as possible for M4A and it was still saving a couple trillion. It’s the most slam dunk policy possible from a net cost perspective.",
            "You mean like when the [libertarian Mercatus Center did a study](https://slate.com/business/2018/07/single-payer-health-care-could-save-americans-usd2-trillion-conservative-think-tanker-accidentally-argues.html) accidentally showing single payer healthcare would save Americans $140,000,000,000 a year?",
            "That's the benefit of [metanalyses](https://thehill.com/blogs/congress-blog/healthcare/484301-22-studies-agree-medicare-for-all-saves-money/).",
            "Do you genuinely believe the current system in the US is the cheapest most value for money system? Do you still believe it when you look at countries with successful universal healthcare?\n\nYou could say that about any research paper. It’s peer reviewed.",
            "I'd take it over insurance companies, pharmaceutical companies, and everyone else in the business trying to wring every last dime out of every person they can, outcomes be damned.",
            "No country with universal healthcare has that issue. Hospitals and doctors know how to run themselves - they just get money via the government.",
            "This is the same govt that has the FDA approved food additives that are banned in other countries- Fix the food and many people wouldnt need so much healthcare- and the obesity wouldnt be where it is-",
            "I've lost trust in most institutions at this point.",
            "From 1998 to 2013 (right before the bulk of the ACA took effect) total healthcare costs were increasing at 3.92% per year over inflation. Since they have been increasing at 2.79%. The fifteen years before the ACA employer sponsored insurance (the kind most Americans get their coverage from) increased 4.81% over inflation for single coverage and 5.42% over inflation for family coverage. Since those numbers have been 1.72% and 2.19%.\n\nhttps://www.kff.org/health-costs/report/employer-health-benefits-annual-survey-archives/\n\nhttps://www.cms.gov/Research-Statistics-Data-and-Systems/Statistics-Trends-and-Reports/NationalHealthExpendData/NationalHealthAccountsHistorical.html\n\nhttps://www.bls.gov/data/inflation_calculator.htm\n\nAlso coverage for people with pre-existing conditions, closing the Medicare donut hole, being able to keep children on your insurance until age 26, subsidies for millions of Americans, expanded Medicaid, access to free preventative healthcare, elimination of lifetime spending caps, increased coverage for mental healthcare, increased access to reproductive healthcare, etc..",
            "The aca was gutted by Republicans and democrats owned by the Healthcare corporations. \n\nLook at the original draft vs the final one. \n\nMoney is the problem and  always was. Take money out of medical care and the problems will shrink.",
            "The ACA has made healthcare affordable to millions, it has been very successful at helping low income folks. People making decent money don’t qualify for the subsidies unfortunately.\n\nThere are also numerous parts of the ACA that impact everyone outside the cost of premiums that people tend to gloss over.",
            "yes- the postal service is so much more expensive than UPS.",
            "Our peers with universal healthcare are spending literally half a million dollars less (PPP) per person for a lifetime of healthcare while achieving better outcomes. And government plans in the US are, in fact, already more efficient. \n\n> **Key Findings**\n\n> * Private insurers paid nearly double Medicare rates for all hospital services (199% of Medicare rates, on average), ranging from 141% to 259% of Medicare rates across the reviewed studies.\n\n> * The difference between private and Medicare rates was greater for outpatient than inpatient hospital services, which averaged 264% and 189% of Medicare rates overall, respectively.\n\n> * For physician services, private insurance paid 143% of Medicare rates, on average, ranging from 118% to 179% of Medicare rates across studies.\n\nhttps://www.kff.org/medicare/issue-brief/how-much-more-than-medicare-do-private-insurers-pay-a-review-of-the-literature/\n\nMedicare has both lower overhead and has experienced smaller cost increases in recent decades, a trend predicted to continue over the next 30 years. \n\nhttps://pnhp.org/news/medicare-is-more-efficient-than-private-insurance/",
            "> **Key Findings**\n\n> * Private insurers paid nearly double Medicare rates for all hospital services (199% of Medicare rates, on average), ranging from 141% to 259% of Medicare rates across the reviewed studies.\n\n> * The difference between private and Medicare rates was greater for outpatient than inpatient hospital services, which averaged 264% and 189% of Medicare rates overall, respectively.\n\n> * For physician services, private insurance paid 143% of Medicare rates, on average, ranging from 118% to 179% of Medicare rates across studies.\n\nhttps://www.kff.org/medicare/issue-brief/how-much-more-than-medicare-do-private-insurers-pay-a-review-of-the-literature/\n\nMedicare has both lower overhead and has experienced smaller cost increases in recent decades, a trend predicted to continue over the next 30 years. \n\nhttps://pnhp.org/news/medicare-is-more-efficient-than-private-insurance/",
            "When I was on it, my diabetes pump and supplies had a copay of zero. I got married and went on my wife’s insurance. She works for the US Postal Service. 22 years. Unionized. Federal government. \n\nMy supplies are now around $900 every three months. My copays are more. For everything. \n\nI was better off with Medicare.",
            "I know a lot of Healthcare providers who complain about Medicare paying less than other insurance companies.\n\n I knew one pharmacy owner who claimed that they lost money when taking Medicare.",
            "My husband is on Medicare and pays for part B. I get my insurance through work, although they cover it entirely. Mine costs about $1000/mo and I basically have the gold version of his platinum. So, I’d say paying $170/mo for better than I get for $1000/months is something people on Medicare should like. A lot!",
            "I don’t want Medicare, I want that shit that congresspersons get.",
            "Medicare consistently has higher patient satisfaction ratings than every individual insurance company.",
            "Everyone I know on Medicare that I've discussed it with likes it.  They pay way less out of pocket, many times zero, than I do on an insurance policy that costs me $1.3k per month for myself and two dependents.",
            "It’s subsidized healthcare they don’t have to pay for, of course they like it.",
            ">The primary reason healthcare is expensive in this country is because of insurance.\n\nWhich is the primary thing Medicare for All does, gets rid of private insurance. Also, under Bernies plan it would have given the government the ability to negotiate drug prices. On top of it all, it would allow democracy to be involved in the form of voting in or out those in charge of said programs depending on their actions. Keeping the status quo is literal insanity.",
            "How it gets fixed is another question, but the insane inefficiency of the US Healthcare system is obvious. Basically all other developed, and many undeveloped countries put in much less unto the healthcare system per person and get better health outcomes. \n\nBut the US government doesn't give a damn, and the insurance companies/hospitals need all them sick people to keep paying those insane prices. \n\nAlso Medical education in the US is a cartel, so despite all the constant doctor shortages, they won't open more schools, shorten then years od completely unnecessary education, or do anything else that would raise the number of doctors and lower their insane salaries. And they believe it's totally justified too, because they took out a crazy amount of loans for the education, so now expect an enormous salary.",
            "If you're poisoned and I have the antidote. You would give me literally all of your possessions for me to hand it over to you. \n\n\nThis is the problem with profit incentives within the context of healthcare. \n\n\nThe value of the 'product' is not tethered to it's material cost or quality. Its tethered to the desperation with which it is required.\n\n\nIt's one of the few cases, similar to the emergency services like fire and police, in which natural market forces aren't the best way to allocate capital. ",
            "***Get rid of health insurance and make cost available upfront. Insurance is a business model that is incentivized to not do the very thing that you pay them to do.***\n\nYou are the first person (aside from me) who I've heard say such a thing.  \nObviously I agree. Heartily.\n\nI remember a time when nearly no one had medical insurance 60 or 70 years ago.  \nYou had hospitalization coverage ONLY.  \nThat was because a hospital stay could be ruinously expensive.  \nBut hospital stays are unlikely.  \nHigh cost but low likelihood translates to a low, affordable insurance premium. S'good.\n\nYou didn't need coverage for a doctor office visit.  \nThat might cost a mere $2 in the mid-1950s. Yes, really.  \nThat's around $22 today.\n\nBut a half century ago we got into the habit of wanting and expecting coverage for nearly every medical event.  \nAnd where there's a vast pool of money to pay for things, there are hands open to taking it. Prices skyrocketed.\n\nWe need to ELIMINATE medical insurance.  \nThat's not easy. That's REALLY difficult.  \nBut I see no alternative.",
            "A system to exploit? It’s healthcare, what is to exploit? Are you going to get sick just because you can? \n\nInsurance is a problem but not the problem. The problem is healthcare is a business. A highly lucrative one.",
            "The “free market is the best way to allocate resources” model of economics completely falls apart when you don’t have things like price elasticity of demand. This is acknowledged in theory and visible in practice.",
            "Significantly less than most people's healthcare costs today.",
            "They what?",
            "Because it's better for them to say it and keep it as a problem and then blame the other party to garner votes.\n\nThat's just establishment politics. Keep key issues as issues and make some token improvements to continue to milk those issues for votes.",
            "From 1998 to 2013 (right before the bulk of the ACA took effect) total healthcare costs were increasing at 3.92% per year over inflation. Since they have been increasing at 2.79%. The fifteen years before the ACA employer sponsored insurance (the kind most Americans get their coverage from) increased 4.81% over inflation for single coverage and 5.42% over inflation for family coverage. Since those numbers have been 1.72% and 2.19%.\n\nhttps://www.kff.org/health-costs/report/employer-health-benefits-annual-survey-archives/\n\nhttps://www.cms.gov/Research-Statistics-Data-and-Systems/Statistics-Trends-and-Reports/NationalHealthExpendData/NationalHealthAccountsHistorical.html\n\nhttps://www.bls.gov/data/inflation_calculator.htm\n\nAlso coverage for people with pre-existing conditions, closing the Medicare donut hole, being able to keep children on your insurance until age 26, subsidies for millions of Americans, expanded Medicaid, access to free preventative healthcare, elimination of lifetime spending caps, increased coverage for mental healthcare, increased access to reproductive healthcare, etc..",
            "The providers aren't even considered.  They're more like cattle for the Beef industry - necessary but only because they don't have a product to sell without them.  Healthcare is all about executive salaries at the very top and theyeven made it illegal for doctors to own a hospital so they wouldn't have to worry about providers becoming executives!",
            "My wife work in healthcare, the company she works for has been on a steady decline for those that are employed for this huge conpany.  I explained it's a for profit entity, the product is life saving healthcare, the only thing that matters to shareholders is maximizing profitablity. I said the declining pay scale for nurses is a prime example of this.\n\nMore patients than a e.r. can handle? Better buckle up as they prioritize care. We witnessed this in COVID and while it's not nearly as acute it never left. Do more with less and be thankful you still have the privilege of employment.  The executives only care of it effect profitable or the image to share holders.\n\nThe u.s. is the richest country in the world and spends 17.5 Percent of GDP on care. That number is only going up while care quality and life expectancy is going down.\n\nBut what about the shareholder?",
            "I remember working for a company who made polyester loops used in ligament repair surgery. I spoke to the distributor for these once about what they sold them for. In terms of cost, it was maybe $0.80 on our end to make these loops and we could make hundreds an hour. Sold to distribution for $20/ea (insane margins). \n\nThat same distributor sold them for $80/ea. Now, I imagine the hospital was charging hundreds easily for these. All for a fucking tiny loop of polyester that cost less than a dollar to make.\n\nIt was one of the most eye opening experiences of my young life.",
            "As a provider I can assure you that I am not the one benefiting from this bullshit system we have.",
            "When the politicians say we have best healthcare in the world (not even close), what they mean is we have the most profitable healthcare in the world. \n\nEveryone assumes they mean quality of care and better outcomes. No one ever asks their definition of best.",
            "Nothing in the US healthcare ever considers the physicians!!",
            "I’ve been in insurance forever (thanks Great Recession job market). The problems are VERY basic. Long story short the government created this mess a long time ago. They didn’t want universal healthcare because the Nazis had it. Then they couldn’t get ppl back to work because they made too much money in the war so they created benefits. Now they can’t fix it because it’s 20% of our GDP. Like everything going wrong in the US our government has given us the shaft with no Vaseline and they try and put the blame on everyone else. Insurance and hospitals both suck but the real problem is all the shit caused by our cluster eff of a government because if we had proper regulations we wouldn’t have high hospital pricing and no need for insurance. But they like it because they all get rich off of it. They created this mess period!",
            "Yeah but it’s not the federal government made it illegal to not buy services from insurance companies, the government subsidizes healthcare and allowing for insurance companies to rob us blind.",
            "Lol what",
            "Believe me, insurance is the root of a lot of that problem. They’re going back and forth to see what they can find out and often run into road blocks where people don’t want to provide a solid answer one way or the other.",
            "Lol hawaiis economy IS collapsing because fucking RESIDENTS here can't afford a home",
            "Psychopaths do make the \"best\" CEOs.",
            "plus if you are nearing retirement age you would benefit from lower inflation protecting your savings. these old folks who vote for corporate Democrats in the primary don't realize how much more inflation their fixed incomes are subjected to because we let our Healthcare system inflate the fastest of any country in the world. That leads to more inflation everywhere else. Higher wages higher cost of goods, everything goes up when Healthcare costs go up. And senior citizens actually fare the worst",
            "It is already failing. No one is paying their medical bills (not even the rich), ACA caused a bunch of high deductible plans to go to market so few can afford testing beyond labs, people who should have been caught by the med system are putting off screening until it’s almost if not too late. And the hospital systems are suffering too. Small independent hospitals are being swallowed up by large conglomerates and then noping out, leaving whole towns without hospitals.",
            "And every dollar they spend is a dollar that is not spent providing care.",
            "Do away with insurance companies and make lobbying illegal.",
            "The insurance companies run the world. It all goes back to them.",
            "Show me something supporting your claim like everyother idiots claim that Canada has longer wait times than the US. Not just that there is wait times. YOU HAVE TO SHOW THEY ARE LONGER THAN THE US. And you can't, because wait times for the non elite or wealthy are just as bad here. \n\nThis claim is tiring",
            "Just want to chime in here real quick. I live in Canada and qas diagnosed with cancer a couple years ago and it progressed to stage 4 about 6 months ago. My Healthcare has been A+. Literally no complaints. I haven't had to pay a dime either.\n\nI'm in multiple forums for the type of cancer that I have and probably every 4 out of 5 posts are people from the states looking for advice on how to afford drugs or pay hospital bills. It's awful. Meanwhile the only bill I ever get is for parking. I'm incredibly Thankful that I don't have to worry about finances during all this.\n\nHealthcare Def has its issues here,  very short staffed but overall it's nowhere near as bad as people make it out to be.",
            "I’m not sure how paying nurses LESS would ease staffing issues.  Sure, there are places that cut staffing too much, but I was speaking of the issue of healthcare workers electing to leave because the working conditions suck so bad. \n\nNurses are paid well in some areas, but not all.  The work is absolutely back breaking and soul crushing.  Between admin and patients abusing nurses, the problem will only get worse. Benefits are being taken away piece by piece.",
            "They don't go to the doctor's office, they go to the ER because they can't find a GP.",
            "ER. Obviously.",
            "Do you? If the answer is no then you can logically extrapolate that most people don’t choose to overuse health care. It’s got like diminishing marginal returns on wasting time for a splinter. It’s not what you’d consider a normal good, ya know? \n\nI realize the example is kinda bogus, but I get what they’re putting down. If insurance companies can lower costs by having a larger pool then why can’t that apply to an entire population?",
            "I have 3 or 4 issues I'm ignoring right now because I don't want to be sucked dry financially",
            "Interesting.  I saw the DR twice in 8 months in Ireland as an American and paid 10 bucks for an antibiotic the first time and the second time needed a tetanus shot and I don't even remember if I paid anything at all.  I got in same day both times.  Much like everything, it's probably about where you are.",
            ">I had my foot run over by a car and was told the same thing.\n\nYou went to A&E and were sent home without receiving any kind of examination?",
            "It takes months to get appointments in the US now too. It’s not a socialized healthcare issue, it’s a medical professional shortage issue.",
            "Stop this fake narrative that there isn’t wait times in the US.",
            "I’m an American living in America, I had my foot ran over by a car and I just took some Tylenol bc, come on, like I was really going to go to a doctor. An ER would charge something outrageous and most GP’s aren’t taking new patients or it takes weeks to get in. But not having insurance does help sometimes bc we pay cash the day of and doctors like that. \nSame when I broke my finger. It wasn’t life threatening so what’s the point.",
            "American here, we also wait weeks for a GP appointment.",
            "\"like having to wait saveral weeks to be seen by a GP\"\n\nAnd how long does it take in the US before you get in and are charged $400 for the 7 minute appointment?",
            "Several weeks to see a GP? I’m usually able to see one in a few days.\n\nWhere do you live?",
            "Yep. I'm in Ohio and all my medical appointments are me telling a doctor \"I made this appointment 2 or 3 months ago then whatever it was went away on its own\"",
            "American living in America here. In America we have to wait several weeks to be seen by a GP to be told to go home and take Tylenol while resting, and we have to pay out the nose for the privilege.",
            "Bruh I was trampled by a horse and told to go home and rest. Also in America. And that MRI I need for a complex surgical complication? Two months out at minimum. Same with most specialties. \n\n\nLong wait times are not unique to universal healthcare countries. But they are often made worse by privatized healthcare.",
            "No kidding. We got the same wait time here in Canada. Even then, they just can't wait to get you out of their office.  I've been dealing with a fucked up ribcage for the past 4 years and they just feed me pain killers and judge me later as a fucking addict. Ffs I just want to know what's wrong with me.  I can't even look at my own goddamn x-rays bc of some bullshit PHIA.",
            "The other 5% of Americans:\n\n![gif](giphy|3CU5tmCJy8zMoN3mMD)",
            ">95% of Americans with health insurance coverage.\n\nThanks, Obama!",
            "I wonder how many of the 95% have a deductible over like $5000-8000.  Even single patient insurance can be that high.  I am a healthy person who hasn't even needed to spend anywhere near that amount on total medical care in more than a decade.",
            "It’s also crazy how it correlates to poverty. Poor people are fat, and poor people vote Republican.",
            ">What’s your proposal? \n\nPay 100 billions to Novo Nordisk (something like 20 times their profit from Ozempic) and make patent available for free.\n\nIt's probably the best investment possible, as US is estimated to lose $170B every year (2016 prices) due to obesity and overweight.",
            "WTF is the point of your answer around political parties.  His question is what if they dropped weight, not who they voted for.\n\nBTW, the older a person gets, the more conservative (Republican) and fatter they get. So...",
            "The obesity epidemic in the US is a HUGE health crisis that needs to be solved, but it’s not the core problem of our healthcare costs. It’s really a greed problem like many other things in the US.\n\nDiabetes care is [very costly](https://diabetesjournals.org/care/article/47/1/26/153797/Economic-Costs-of-Diabetes-in-the-U-S-in-2022), but as you outlined obese people with diabetes don’t live as long so cost per lifetime is lower. So I guess since they die sooner it’s a wash.",
            "Hate to ruin your hope, but it's not ever going to legitimately be off patent in the US. They will slightly alter the chemical makeup of it and renew the patent with marginally worse results(more side effects) and keep it going for another 40 years. \n\nWhy? Because the people everyone says will help wrote the laws around medical patents to allow this level of bullshit. No not one party or the other. Both agreed to this. They even wrote the way \"generic\" medicines were to be made in a way that one company can make a life saving drug, make a second company to make the generic and charge 10% less and if anyone questions it rinse and repeat the middle step until no one notices for a life saving medication the only companies allowed to make it all run at a cost you can google the price to manufacture and realize they are all charging way more than necessary if they truly were competing. \n\nThey aren't. US healthcare is rigged to dump the entire cost of developing medicine for the world on the US citizen. They can't negotiate with other countries because as you said they have their own patents that follow ours somewhat close so it's play by their rules or miss out on that money so they get their profits from the only place they can. Healthcare wouldn't be so expensive if they had fair negotiations around the world, but they automatically lose China and Russia due to China just stealing everything and they'd sell to Russia on the cheap.",
            "Good idea, Let me call Ben Stiller.",
            "More like, 30-50 billion every year for the next decade. And that isn't exactly all of world hunger solved, IIRC it's just extreme hunger... but still beats 9 million dying from it each year by a landslide.\n\nStill doable though, just check how much money the richest people have for doing nothing effectively significant.",
            "But have they done enough studies? I think we need a 23rd before we can be sure /s\n\nGotta make sure we give those poor insurance companies enough time to pivot, of course",
            "And yet it there’s a doctor shortage and long wait times here in Canada, and in the UK too",
            "Tell that to a Canadian. We had 17,000 people die waiting for surgeries last year, this years number is going to be even higher. Think about that, right now the world is losing their shit over a similar number of civilians dying in Gaza, but we just gloss over how badly health care is run by the government in Canada because it goes against the popular narrative that America has the worst health care and we have everything figured out",
            "Another reason for socialized medicine. Right now the food companies and for profit healthcare win for providing expensive care for people who’ve eaten shit food. If we’re all paying for it, there would be an incentive to keep people healthy. Right now sick people are a profit centre.",
            "Democrats had the votes to pass whatever they wanted. No Republicans even voted for it and it still passed.",
            "Is it really taking money or of medical care or aligning the money to incentivize good care? So much money is wasted on onerous insurance overhead and expensive catastrophic care that could be avoided with regular, accessible primary care.",
            "You have a funny definition of affordable.",
            "I’m getting close to losing money on Medicare total joint patients. Which is 75% of my practice.",
            "It pays 40% less on average. The primary \"savings\" if medicare for all would be the decrease in reimbursements which would basically bankrupt the healthcare industry in the  US as those 40% reduced fees are only tenable because they're subsidized by the customers paying full price or 100% UCR.",
            "Source? This would be awesome if true",
            "That they pay for with taxes. Ftfy",
            "True, but the vast majority of healthcare is not immediate emergencies. \n\nSingle payer does nothing to mitigate this problem. It just adds in a different middleman trying to fill their pockets. \n\nMost of the money in healthcare ends up in the pockets of malpractice attorneys, insurance companies and hospital administrators. My proposal is cutting them out so that you're paying for cost of supplies and labor only.",
            "I'm saying that malpractice attorneys, insurance companies and hospital administrators exploit sick people to make insane amounts of money. In 2022 America's largest health insurers made over $40 billion in profit, not gross revenue, profit after costs!\n\nHealthcare is a lucrative business, but being a healthcare provider is not.",
            "“The data allow us to break down the pre- and post-ACA changes by age, individual vs. family, and plan type. Overall, Health Maintenance Organization (HMO) premiums actually decreased 4.6% in the four years before the ACA reforms came into effect (that is, from 2009 to 2013), but increased 46.4% in the first four years under the ACA. Point-of-Service (POS) premiums decreased 14.9% before the ACA, and increased a whopping 66.2% afterwards. Premiums for the more common Preferred Provider Organization (PPO) plans increased 15% in the four years before the ACA, and 66.2% afterwards.”\n\nThanks for playing.\n\nwww.forbes.com/sites/theapothecary/2017/03/22/yes-it-was-the-affordable-care-act-that-increased-premiums/",
            "This always seemed so anti-competitive to me. A trained physician should be able to start up their private practice/clinic to compete for patients. Just like any other business model, serving its customer base through transparent competition.",
            "Mayo Clinic would never have been founded today...",
            "If we didn’t have to pay shareholders, imagine how much a nurse, a doctor, or a nurses aide could get paid, how much better our care could be. And how much the average person could save while doing so. \n\nUnited States has about 31 doctors per 10,000 people. Some countries in Europe have more than double that.",
            "Yes. All true. But the private health insurance companies are the primary ones siphoning money out of the system with absolutely no added value. Pure parasites that exist only to enrich their shareholders and especially executives.",
            "The federal government made it illegal to not buy insurance ",
            "So the real question is how do I luck into being one of those executive salaries with the least effort possible?",
            "As an MD, thank you for recognizing this. We so often are blamed in the media for rising health care cost despite obvious data that shows administration salaries skyrocketing while actual medical staff tracks inflation at best.",
            "That’s why I don’t give a FUCK squeezing them.",
            "I’ve been working in medical device sales for about a year and I’ve seen about a dozen small practices converted to chains. \n\nAnd I feel terrible for the providers. Cattle is an apt analogy. They are the product being sold.",
            "Aren't a large swath of providers non-profits for this very reason? So you wouldn't have to worry about doctors acting for financial rather than care reasons? Also, pharmacies (not the drug producers but the dispensaries) used to be required to be majority owned by pharmacists for the same reasons doctors couldn't be shareholders, so you didn't have people who only cared about money deciding which drugs to stock on the shelves and drive business decisions counter to care.",
            "Yup, line up the top insurers side by side and it's clear from the stock charts why healthcare is ridiculously expensive. It's because it's covered in ticks.",
            "We moved from the US to Canada in 2018. My wife is a nurse, she is so much better paid in Canada and also has a union which has been an amazing advocate.\n\nThere's also the added benefit of the fact she's in pediatric ICU - she had to deal with gunshot wounds all the time in the US, not once in 6 years in Canada.",
            "Closer to **19%** as of 2023, but your point is absolutely spot on",
            "But it’s “medical-grade” polyester.",
            "I agree , I will adjust by providers I meant things like private equity running medical groups, not the actual physicias.or front line providers , those folks are underpaid...",
            "Everyone seems envious because they think doctors are rich.  Reality is doctors are just pawns for insurance companies.  They are hardly rich. For the mental and physical stress they have to endure in their line of work, they are not even rich.  Not compensated enough.",
            "I agree it's ita not the  physicians",
            "The reason we have private healthcare in the US is because it's a system run by the capitalists for their benefit,.not yours or mine.... Offering healthcare is an inconvenient by product  of them making fat profits.",
            "I have a doctor in my family, private practice. He has multiple people on staff whose entire job is dealing with insurance companies and claims. It's expensive for him to deal with.",
            "Don't worry, Oprah and the rock will buy it all up!!!!",
            "Hehe the people who have health insurance under the ACA weren't getting tested regularly beforehand. The ACA at least made a lot of base tests free or included in your insurance as well as affordable co-pays as compared to just nothing.\n\nThat being said, get rid of the middlemen. Payers and providers of service and care. No profit margin for middlemen. Profit for the providers? Understandable.",
            "The CEO of United Health Care (a misnomer as it is an insurance company) makes $68,500 a day. A FREAKING DAY!!!!",
            "While there are a lot of problems with the insurance industry I am not sure doing away with them is the best solution. You kind of do need insurance of some kind (e.g. without home insurance banks will just increase the mortgage cost as they will be self-insuring to take on the risk so you pay out the cost of the home insurance in higher mortgage costs but don't get the benefit of being able to file claims.  Driving when other people on the road don't have car insurance will be awful too).  \n\n\nI do like the idea of the US government replacing private insurance with a public option (Medicare for all) as they will not be incentivized to pay out the minimum needed including sometimes denying valid claims because it is cheaper if x% go to court to fight them and win than if they had to pay out all of the valid claims of that type (and Medicare saves a bunch through reducing administrative bureacracy).  \n\n\nBut you could also see it becoming a mismanaged mess like the US flood insurance which operates at huge loss and is basically subsidizing Americans to live in places they really would choose not to be living in if they faced the true cost of living there.  The same thing happen with other types of public insurance since it divorces the cost of insurance from the cost to insure when it is run by the government to optimize voter support in the next elections.  Instead of health insurance companies running programs for things like reimbursing member's gym membership if they go a certain number of times a year you get Public healthcare approving drugs to be covered based on pharmaceutical lobbying and campaign donations.",
            "....again how can that work when human nature, greed  and the wealthy folks won't just let that be...",
            "And then you can quickly kiss that $5 trillion (and more) goodbye",
            "There's so many new grads that can't get residencies. This is a manufactured issue or the hospital cutting staff to save money.",
            "When I broke my hand in February I made a same day appointment the next morning for 10am at urgent care. The appointment cost $80.",
            "It's so difficult and takes so long to see a doctor these days in the US, let alone a specialist even if it's an emergency. If you don't live near a major city then just forget about it. That's the boogeyman I was always warned about with universal healthcare. \n\nIt's all horribly discouraging, try calling your health insurance customer support, which puts any public bureaucracy to shame and getting a straight answer about anything if you want to cry in frustration.",
            "I just got seen same day by my GP. They do walk-ins 8-6 everyday.",
            "That’s simply not true. Walk into any UC and you’ll be seen instantly",
            "It depends on many things.\n\nWhen I needed an MRI, I was in there two days later getting an MRI.  When I needed an endoscopy the earliest they could get me in was 6 weeks away.  But I had the choice of getting an endoscopy 2 hours away the next day and chose to wait instead.\n\nWhen I crashed my ATV and was carted into the ER they dropped everything and took me back immediately.\n\nIme, when I wait it's because there's no harm in waiting, it's not an emergency, and if it's an emergency there's 0 wait.",
            "Made a doctor's appointment with McLaren in Michigan back in February. Got cancelled a few days before in April because the doctor went on vacation. Had to have it rescheduled for July. I swear if it was serious I could've fucking died by now...",
            "Seriously, I mean mileage may vary from region to region, but I’ve lived in PA, TX, and [OH](https://open.spotify.com/track/6vpfYLa0lJrH6wTPjZ6qWl) and it’s always months not weeks to get seen most places.",
            "Yeah… had a seizure and was told I needed to get an EEG done, immediately. Called to schedule after the first visit that took 3 weeks to get to after the seizure, to be scheduled out 2 months to be able to get my test done.",
            "Right? I called my gastro in January and my appointment was set for June and then pushed to August.",
            "Holy shit appointments with doctors in the US are quick. At the local private equity medical factory near me you don't even get 5 minutes.",
            "Yeah, I had to make an appointment just to get some stitches removed and my health portal told me it was going to be a month.",
            "$400? \n\nYall not have 15 dollar copays?",
            "Generally speaking, according to Pew Research, poor people tend to be more Democrat leaning.\n\n[https://www.pewresearch.org/religious-landscape-study/database/compare/party-affiliation/by/income-distribution/](https://www.pewresearch.org/religious-landscape-study/database/compare/party-affiliation/by/income-distribution/)",
            "There's a higher rate of poverty amongst minorities.  Minorities tend to vote....oh wait.",
            "Most of the poor people around here vote democrat",
            "The poverty-fat relation has actually been studied a lot anthropologically.  Basically throughout the history of mankind, the least nutritious, fattening foods are the cheapest, while the healthiest are more expensive.  Essentially Top Ramen and hotdogs are cheap while fresh vegetables and lean properly fed meats are more expensive.  Not that its that simple on a case by case basis, but when you look at the population as a whole the theory is that it has a very large effect.",
            "Novo will make over a trillion over the next 30 years from Ozempic and the future generation of the drugs.",
            "So instead of saving $5.1 trillion, we instead save $170 billion (minus 100s of billions we have to pay)?",
            "I believe the point is that republicans like to deflect the cause of our exorbitant healthcare costs away from the best way to pay for healthcare to stuff like, \"well, if we weren't such a fat country, we wouldn't be spending so much on healthcare.\" It absolves the private insurance model because, god forbid we get \" ThE sOcIaLiSm\"",
            "I’d rather wait for healthcare than not be able to afford it in the first place. \n\nI’m lucky enough that I have great health insurance, but many people simply do not seek care because of the cost.",
            "Same problem as in the US…",
            "It's the same in the US, there's just a fast lane for the wealthy.",
            "I have decent health care in the US and there was still an eight month waitlist for getting a primary doctor",
            "That's because they have neoliberals in power who are intentionally trying to slowly starve and dismantle the public system. The NHS had some of best health outcomes in the world. It's not because it's public that it's failing. It's starting to fail because it's being intentionally killed in order to finally privatize Healthcare like the did the rail system. \n\nCapitalism ultimately destroys everything eventually.",
            "Not any worse than the U.S.",
            "https://www.citizen.org/news/nobody-should-die-because-they-cant-afford-health-care/\n\nAnd the study the article is referencing:\n\nhttp://www.pnhp.org/excessdeaths/health-insurance-and-mortality-in-US-adults.pdf\n\nTL;DR\n> The study estimates that 35,327 to 44,789 people between the ages of 18 and 64 die in the U.S. each year because they lack heath insurance.",
            "Your 17k is Bullshit mislead. How many do you think die annually in the US due to a lack of healthcare?\n\nCanada ranks higher than the U.S. for healthcare outcomes. There’s thousands of supporting studies and organisations that rank this.\n\nZero say the US has better health outcomes. Do some research.\n\nhttps://www.axios.com/2023/11/07/us-health-gdp-oecd",
            "I’ll take Canadian life expectancy and infant mortality and medical bankruptcy rates pls!",
            "Pretty sure Joe Lieberman blocked it similar to how Manchin/Sinema blocked recent bills.\n\n> The public option was initially proposed for the Patient Protection and Affordable Care Act, but was removed after independent Connecticut senator Joe Lieberman threatened a filibuster. As a result, Congress did not include the public option in the bill passed under reconciliation. https://en.wikipedia.org/wiki/Public_health_insurance_option#:~:text=The%20public%20option%20was%20initially,the%20bill%20passed%20under%20reconciliation.",
            "No they didn’t. Huge, fatal concessions had to be made to get Lieberman to vote for it. He single-handedly hobbled the efficacy of ACA.",
            "[https://www.kff.org/private-insurance/poll-finding/kff-survey-of-consumer-experiences-with-health-insurance/](https://www.kff.org/private-insurance/poll-finding/kff-survey-of-consumer-experiences-with-health-insurance/)\n\nRelevant chart attached (here ESI stands for Employer sponsored insurance)\n\nhttps://preview.redd.it/pdth64gv1z7d1.jpeg?width=1125&format=pjpg&auto=webp&s=c72579728c15fdcbd3ff87a811ca369aba3ccd30",
            "But that will literally never happen. You can't make it so there aren't civil cases for malpractice. That's literally impossible by how the legal system works and would require the constitution to be rewritten to change how the judicial system works. If one party causes another party harm the harmed party will always be able to sue for damages, even if the harming party is found not guilty in a criminal trial. Just look at OJ.\n\n\nAnd hospitals will always have administrators. Doctors know how to do medicine, they don't know how to run a complex buildings with multiple types of employees. Administrators are responsible for everything from ensuring fire suppression systems are functional and up to code, to employing the proper amount and types of doctors and nurses, to trash collection, and everything in between. How do you just get rid of that?\n\n\nAt best, you can get rid of insurance. That's what Medicare for all would try to do. And you seem to be against that.",
            "Remember that ACA originally required people to be covered or pay a penalty. It also introduced preexisting conditions being covered. \n\nBefore this the competition of the market was pretty good. Obv not having to cover preexisting conditions saved a lot on premiums for some plans.\n\nIn my state many companies left because they couldn’t stay profitable.\n\nThis was a necessary inevitability. You need standards in healthcare.\n\nACA makes it so you don’t have hundreds of plans to choose from, from a bunch of companies all trying to screw you in different ways. Standardizations. Paying low premiums but having terrible coverage isn’t really that great tbh.\n\nThis all increases premiums, but again it needed to happen eventually. \n\nI could go on but you get the point.",
            "Transparent competition. What a quaint concept. That era vanished after 1980 and won’t see the light of day again. Certainly healthcare is an expensive mess. The AMA was firmly against socialistic government medicine back when Truman proposed it in the late ‘40s. Medicare in the ‘60s turned out to be a huge money grab. Now that Managed Care has taken over the Medicare, and increasingly Medicaid, markets, healthcare is funded largely by the government, although made more expensive due to Administrative Loss Ratios going to the Managed Care Firms. Medicare is the most efficient payor of healthcare in the US, with all the benefits and few of the drawbacks of private insurance (the energy expended on private insurance appeals is ridiculous).",
            "They can do that. What they can’t do is stand up a service to which they refer their own patients. It’s to prevent things like routing patients to higher-cost, lower-quality, or harder-to-access goods and services. We don’t want doctors submitting prescriptions exclusively to a pharmacy they own, for example.",
            "A great deal of money is made here on the sole premise of regulating competition out of business.",
            "Anti competition legislation? In the US?? No way",
            "That's how most family/general practitioner doctors make any money in the US. Private practice for rich people.\n\nOur doctors are just schlubs like us as far as pay goes",
            "Thats the point.  Business executives CAN'T compete with experienced health care professionals on an even playing field when it comes to actually delivering decent health care and knowing what patients want and need.  Doctors dont want to avoid delivering health care or saying no to needed procedures simply because they could charge 1000% profit margins if they let a few people die.  Doctors actually take a vow that prohibits them from behaving like health care executives!  What executives can - and did - compete with effectively was bribery and corruption to lock out their biggest potential competitors from entering the playing field.\n\nThe point isn't to compete for the best health care - its to compete for the maximum amount of profit at the bare minimum deliverable amount of health care possible.  This isn't just how ownership of hospitals works - they also have price fixing built in to insurance schemes to make sure prices remain high and health care doesn't get too affordable.  Crime and corruption are systematic in health care, so regulatory capture at the federal level came naturally.  Politicians LOVE bribes so it was a swipe right relationship from the beginning.",
            "Well yea if they built it today, everyone would think “we already have the Mayo Clinic. Why are they ripping them off?”",
            "The CEOs of those “non-profits” make a shitload of money. The hospital may not have shareholders but it is still primarily concerned with making money.",
            "We spend more than anyone else by a wide margin. I think Germany and France are the next inline at 12/13 percent.  \n\nBut again, it's not about saving money, it's about making money for shareholders.",
            "Definitely agree",
            "I don’t think that’s true.  Unless you choose to work in a setting serving underserved communities, you are probably doing very well.  A GP in my area, mcol, makes at least $300,000 a year.",
            "I havent even crest $60000 and this man takes that home in 20 hours. Imagine going on a week vacation and you come back having been paid equal to 7 of your employees YEARLY salary. That's insane.",
            "Clearly it’s because only way to incentivize people perform, no one would do his job for a measly $68,100 a day",
            "Human nature and greed are already accounted for in our constitution. We already have the tools to make the change we want. No one's really getting up to do it though. We all screech from our couches and then continue on our day like its the latest news fad. \n\n  \nThe wealthy have to crumble for anything to truly change here.",
            "You have to convince several million incredibly stupid, stubborn rubes that things like unions and democratic socialism contribute to a far better life for the working and middle classes. Cletus from Cousinfuck, Mississippi needs to get real with himself, drop the socialist bogeyman bullshit, admit he is never going to be a billionaire and that it's not the fault of immigrants or the gays.",
            "It takes someone profoundly ignorant of basic sociology to conclude that greed is \"human nature\".",
            "RN here. Hospital cutting staff or running thin to save money. They sure as shit don't pay nurses enough either. All about maximizing profits for the c suites.",
            "I had a ct scan of my liver a few weeks ago, they found a 30mm growth on it that might be cancer.\n\nThe soonest appointment for an mri to find out  is 3 hours away and in September and that was after me bitching that I needed something not in November. I live an hour outside of NYC, not in the boonies.\n\nThere are a couple places that have earlier appointments, but I can’t really pay the out of network copay.\n\nSo now I might just have cancer and not getting it treated for 4 months, which is fun to think about at night, because it would cost a crap ton to get something earlier.",
            "Obviously, these things are location dependent. The availability of care differs by state and geographic classification (urban, rural) and also whether or not the care facility takes your insurance.\n\nI’m guessing you’re insured and that’s why it cost $80? Because when I’ve been uninsured it was like $300 just to be admitted and speak with someone.",
            "I'm in San Diego, and have had a mostly pleasant experience navigating the medical system for my cancer over the last few years. I am on some FB groups for similar cancers, and that is not the case around the country. Very location dependent. Also I have Kaiser (good tier at that through my work), and Kaiser SoCal are on their shit. Not every insurance provider is streamlined and in-house like mine.",
            "because fractures are time sensitive and are completely different type of doctor",
            "Good for you. In NYC my past two PCPs had a month-long waitlist.",
            "My current one I can get in the same day for everything except like annual physicals and that type of stuff where you schedule it a month in advance.  My old Dr you couldn't walk in but you could call and if it was something pressing they would typically get you in as they left several slots a day for someone who had a serious issue that couldn't wait a day or two.",
            "The clinic I go to has walk-ins but you're not going to see a doctor, you'll see a nurse practitioner. In fact i haven't seen my doctor for months, all I ever see are physician assistants because my doctor is booked out months ahead.",
            "The comment I was responding to was about seeing GPs or PCMs, not urgent cares.",
            "Seeing my PCM or specialists is what has taken weeks to months for me. If I accidentally saw off my arm while I’m doing some wood working, I’m sure I can get shuttled by ambulance to a hospital and be seen relatively quickly.",
            "I was diagnosed with stage 2 cancer in my kidney in January 2018.  They told me that the tumor was too large to make an attempt to save the kidney, and that it would need to be removed immediately because I was at extreme risk of the cancer spreading to my lymph nodes and other organs at that point.  I was made to wait *an entire month* for surgery that was considered immediately necessary.  During that month of waiting, I had to have *two* separate emergency procedures to have a 400cc blood clot removed from my bladder, because my kidney was so malfunctioned from the tumor that it was regularly sending blood to my bladder, which would then coagulate and completely block my urethra.  \n\nYeah, Americans are made to wait for medical procedures, too.  Even immediately necessary ones.",
            "More and more employers are pushing the high deductible plans. There's no copays, you just pay for everything non-preventative up to an annual max.",
            "Depends on the service and deductibles. One time I went to a doctor to get me ears cleaned instead of using q-tips like everyone says you should and was surprised by the $500 bill. Last time I ever did that.",
            "Nope. Fully out of pocket till I hit my annual max. Great fucking system we got.",
            "After I meet my $3500 deductible and $3500 co-insurance, it's free!\n\ncries",
            "Haha. Yall not have deductibles",
            "The urban poor lean democrat.  The rural and small town poor lean heavily republican/conservative.  It’s worth noting that the former are often minorities while the latter are mostly white.",
            "Eh. It's $5.1T over 10 years (claimed by politician), while $170B (in 2024 prices it's $225B) is every year.\n\nSo Ozempic nationalization would cost $100B now to save $2.25T over 10 years.\n\nThis has key political advantage over universal healthcare - patent nationalization would be effectively irreversible, while universal healthcare can be gutted by Republicans in next election cycle. It can also be framed in \"patriotic\" terms, like creating jobs in American pharmaceutical factories.",
            "And if there is public healthcare that fast lane for money will still exist if people want to use it. So it’s not like people would even be losing out on anything.",
            "I’ve had to wait up to 6 months for appointments  in the US with my dermatologist and OBGYN.. I’m an established patient at both practices. Glad I didn’t have any urgent issues but there’s definitely long wait times in the US",
            "Did those 17k die because they hadn’t had their surgeries?\n\nOr are the people who need things like knee and hip replacements also people who tend to be elderly or obese, many of whom will end up dying over any significant span of months regardless of whether those surgeries happen?",
            ">Your 17k is Bullshit. \n\nGoogle exists ,you cant just blatantly deny reality \n\n>Canada ranks higher than the U.S. for healthcare outcomes.\n\nIn what years and based on what rankings?",
            "Lieberman was officially an “Independent Democrats” and caucused with the Democratic Party. He was more of a Democrat than Bernie Sanders is.",
            "(not a Republican)",
            "My healthcare Econ prof Nancy Wolff said the VA was the most efficient payor if I recall … but, crap, that was 30+ yrs ago. She advised Hillary’s healthcare panel in the 90’s",
            "Tied-house laws like they have for alcohol?",
            "Idk other corps are able to horizontally integrate. Seems weird. Seems like we should just be able to submit to whatever pharmacy we want vs the MD making the submission?",
            "Obviously, the old one sat in the fridge for too long and went bad.",
            "Fine. Build a Miracle Whip Clinic.",
            "One Mayo Clinic in a country of 300 million.",
            "Yeps",
            "C'mon man , really accounted for in the constitution?, do you know unless your a land owner you couldn't vote back in the day, the constitution is an antiquated document that never envisioned our modern world.  Sure some of its tennents are still valuable , but it's an entire different world.",
            "And those who are trying to fix things get called conspiracy theorists. We have an easy way to fix it , but people dont want to believe \n\nYou can check my profile to deduct what the solution could look like",
            "Another issue that gets overlooked is the pay for instructors. \n\nIn my state, all Nursing instructors (except for clinical instructors) are required to have their Masters with a focus in education, but most positions are about the same pay as a bedside nurse. \n\nWhy am I going to go into debt to pursue a significantly higher degree to get paid the same amount of money? \n\nYou need more instructors to allow for more potential nurses to hit the workforce. \n\nI’ve always considered education further into my future but can’t justify going back for my BSN, then also my MSN, to make the same amount of money I am now. \n\nIf salaries start improving for educators or the requirements start to lower due to “The Nursing Shortage” that we’re all expecting, then I’ll probably get into when I get older.",
            ">maximizing profits for the c suites\n\nwell yeah, the CEO definitely earned his yacht and *really* needs to redo the wood trim in the yacht's kitchen /s",
            "It's because you don't pay for your nursing care. It's rolled into the room charge, so hospitals are highly incentivized to use as little nursing as possible. A 20-year-old who had an appendectomy, gets to the bathroom by themselves, and needs a couple doses of antibiotics and pain meds pays the exact same amount for nursing care as an 80-year-old 400 pound incontinent dementia patient with 15 medications, who needs turning every 2 hours, frequent bed changes, 1:1 feeding, multiple dressing changes, etc. If we charged for nursing care based on the actual amount of nursing time needed and used, they might not be so quick to run us bare bones.",
            "I’d say that’s true of every industry these days, from fast food places having like 2 people to stores having one person trying to run a register and stock shelves.",
            "It’s a clinic homie. You really need to see a licensed doctor? If you have something that extreme go to an urgent care or the ER dude.",
            "I think that really comes down to availability.  My primary care physician generally can slot me in within days of a phone call, but as he get's more popular and books up it'll take longer, he's super young and great so I imagine it won't be long before I'm waiting, but yeah.\n\nThis is why I employ other services.  If I have a physical or have questions etc yeah I'll schedule with my Primary Care physician.  But if I think I have pneumonia I'll just walk into Urgent Care.\n\nAnd with urgent care I use the new online scheduling system and text messages, so I can checkin from home and just head there when the wait timer get's to about 30 mins estimated.\n\nMy insurance covers me anywhere I want to go.",
            "ah, i guess i just had decent insurance last time. $2000 out of pocket max and low copays for visits to your primary.  Specialists will cost a higher bill of course.",
            "Yep. Insurance doesn’t pay shit for me until I’ve spent $2800.",
            "A useful distinction to be sure.",
            "I googled your 17k. Comes from a conservative think tank. Secondstreet.org. Pushing for free market solutions. Funding primarily from banks and oil companies.\n\nYou are easily fooled.",
            "OECD healthcare outcomes. Google exists.\n\nhttps://www.axios.com/2023/11/07/us-health-gdp-oecd",
            "It is still true.  And one of these from the power of bargaining on drug prices that the VA receives.  Pharma fought this when Medicare part D was passed as they didn't want state programs to collectively negotiate prices.  The pricing power is substantial where wholesale in drug x might be $1000, the VA is getting it for $200.  This is most but not all drugs",
            "That’s still the case.",
            "3 Mayo Clinic’s actually",
            "you're over 10% short. It's 330M+",
            "When I say 'accounted for', I mean the part where it is our shield against tyranny. Human nature and greed cause that. I never said the whole document was valid anymore, but as American citizens we have the RIGHT to strike these things down when we deem them tyrannical. BY LAW we can do it. If the law isn't on our side then the system isn't on our side.",
            ">Sure some of its tennents are still valuable , but it's an entire different world.\n\nListen, if you don't think the 2nd Amendment guarantees my right to own machine guns and bazookas to defend myself from tyranny, I don't know what to tell ya.",
            "Memes and shit posts, apparently?",
            "In larger universities, nursing professors are generally paid less than other science degree programs.",
            "Yep - NPs are fully qualified to treat majority of patients that come in to a walk in clinic",
            "Also: poor states vote republican, rich states vote democrat. But within a given state, a richer individual is more likely to vote republican.",
            "Pretty sure you can't own bazookas... But I really don't even care about the 2nd amendment, my point  is so much of our American society is different than when the founders wrote that document , that maybe we shouldn't take it to be sacrosanct and consider that our world has evolved and our governing ideals should too."
        ]
    },
    "College degree inflation. Requiring college degrees for jobs that don’t need them is a mistake.": {
        "title": "College degree inflation. Requiring college degrees for jobs that don’t need them is a mistake.",
        "score": 1736,
        "url": "https://www.vox.com/policy/23628627/degree-inflation-college-bacheors-stars-labor-worker-paper-ceiling",
        "content": "",
        "num_comments": 382,
        "comments": [
            "r/FluentInFinance was created to discuss money, investing & finance! Join our Newsletter or Youtube Channel for additional insights at www.TheFinanceNewsletter.com!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FluentInFinance) if you have any questions or concerns.*",
            "Virtually everyone my age was pushed to get a degree. A lot of us earned degrees. A lot of us earned degrees that weren’t in demand. They couldn’t find jobs. They took a job that didn’t require a degree. The employers saw that they could hire someone with a degree to do that job. The employers required a degree.",
            "One of the problems is no child left behind and the devaluation of the high school diploma. Illiterate people should not be graduating high school. The baseline standard has shifted to be inclusive of those not qualified for general entry level positions.\n\n\nThe problem is employers don't need a college degree but the public education system isnt trustworthy enough to produce capable workers.",
            "In many cases, employers don't demand higher ed degrees because they need them ... they demand them because they can.\n\nIt's just a side-effect of the push to make it a lot easier for more people to go to college. It's not necessarily good or bad thing ... it's just the inevitable consequence of a higher % of the population holding degrees.",
            "And this is why a good percentage of young adults are going to be saddled in 10s of thousands of dollars in debt. The other option is to do grunt work for the rest of your life unless you can get into a good trade. Even that usually requires some kind of certification program, though. You don’t just become an electrician or a carpenter.",
            "There’s talk of making what I do require a bachelor’s degree when historically it’s a 2 yr degree. There is a 4 yr program at many universities already if you’d like to teach or become management. The sad thing is because of technology it’s become a much more efficient and easier job so I’m confused what they would “teach” with 4 more semesters. Not a fan of the idea.",
            "The big brain is not have/not list your degree.\n\nEmployers think they can me less since I don't have a degree but I work in a technical field and degrees don't matter, experience does.\n\nI'm a RF test engineer, no degree required but you do need to understand how electricity flows, how to read schematics, and how to build complex pieces of equipment with nothing besides a picture of the finished product. Most companies require 5+ years of experience and funny enough, the military will give you all that if you're willing to enlist. (this isn't a thinly veiled attempt to recruit people, I just like to share my personal experience with others while also letting them know that there are more jobs besides the infantry)",
            "America's highschool system is a joke, a highschool degree used to mean you were at least marginally competent, capable of doing your job and showing up on time. Nowadays schools will literally pass anyone, because failing students makes them look bad and lose funding. A HS degree no longer means anything to an employer because they will literally give that to someone who can't read",
            "As a hiring manager, most of our positions require a bachelor's degree when the job role doesn't necessarily fall under what someone would study in a college major. My understanding is we are making sure you're mature enough to prioritize time management and are able to take instruction, find and answer, and apply it to something. If you're graduated college with a bachelor's, I know you've done these sort of things in your classes.",
            "I grew up being told a college degree would make me more money.\n\nA 4 year degree I have discerned only really gets you a set schedule anymore",
            "And the fix is to stop giving student loans. So that's never going to happen.",
            "A college degree determines whether or not a student has the \"stick-to-itiveness \"that they need in their job. \n\nKids that get out of high school, generally don't have the skills for anything anyway. \n\nI once had somebody tell me, \"I'm educated, I have my GED\"\n\nSo when the basis of education system, is not really an education, you need something else. And that's what college does",
            "A college degree proves to me you can read and be trained, a high school diploma doesn’t.",
            "Economist Bryan caplan has an interesting and controversial book about this.",
            "One of the major issues with credential creep like this is that employers just don't want to train new workers anymore. They are actively trying to offload as much training cost to prospective workers as possible to save themselves the time-opportunity costs of training new workers when they start. This is especially the case in Software Design and IT in general, where job listings will often ask for 3-5 years paid work experience for entry level positions",
            "No, it's not a mistake. For the employee candidate it's a pain in the ass and many jobs that require the college degree won't require the technical skills the college degree provided them. For the employer, however, it's smart to require the degree anyways. It guarantees that everyone in your hiring pool has some ability to be responsible for taking care of difficult/assigned tasks and dedicated enough to push through something that is challenging, time consuming, and often unpleasant.\n\nWithout this requirement your pool is filled with high-school rejects who think a job is an entitlement to provide them money for their weed habit.\n\nCan you find that gem of a person who is disciplined, hard-working and didn't go to college? Sure, maybe. But McDonalds saves way more time and money by just requiring the college degree for all applicants even though the register could be operated by a trained service dog. For the employer, requiring the degree isn't a mistake.",
            "I'll take it a step further. Requiring college courses for degrees that don't need them is a mistake as well. They do it for the same reason, watershedding so they can select from a smaller pool of applicants and seem more elite as a result. I'm not talking about a good writing class or communications course. Things like that apply to a lot of different jobs and degrees. I'm talking about requiring Calculus for a job like Optometry on the shaky logic the class forms a base of knowledge for other courses. You don't need to know crap about asymptotes and how to analyze them by hand in order to do that job so why require it other than to create another sieve to filter people through. Same thing with requiring credentials that don't mean crap and you can buy for a few thousand and a 20 hours in an online seminar (here's looking at you Lean/6 Sigma)",
            "Yep",
            "I realized this when I found out what I wanted to do in finance doesn't require a degree. Just take the exams on your own and you're qualified. Only certain exams you need to be sponsored for. \n\nCome to find out the reason alot of Finance employers want a degree is that it shows you know how to study and take exams.",
            "It is quite counterproductive because people spend more time in school when they could be gaining experience working. \n\nCompanies want someone who can “hit the ground running” but want to pay entry level wages. Someone with experience can leverage it to get better pay and actually entry level workers need to be trained. Adding a degree just restricts wastes everyone’s time",
            "Fully agree. As a pilot, I think my bachelors degree is an absolute waste of fucking time and money When it was a requirement Up until about four or five years ago.\n\nNow it’s just preferred.",
            "This is true.  What‘s also true is that high school is nearly a complete waste of time and shouldn’t be.  Fix that and the other problem likely fixes itself.",
            "My state just made it so any resident who’s parental income is under 80,000 can go to school tuition. Coincidently the state university just raised their tuition significantly. This is an unsustainable cycle if there isn’t some body regulating these schools and their price structure!",
            "I'd argue that over 60% of jobs asking for a degree don't need one, and instead could have a simple 4-8 month training program where you get paid less during training, then get your actual salary afterwords.",
            "Thank you, tell me where I need a 4 year to babysit stoners grilling seafood. It's ridiculous. I get the need for making sure supervisor position candidates have an innate level of responsibility, but anyone working retail or service with a Bachelor's is getting underpaid.",
            "Biden could fix this problem easily and it would help with student loans also.  I've said this for years.  \n\nOne of the biggest problems with obtaining a college degree is that the accreditation agencies require classes that are complete BS or they require a master's when one is not needed.\n\nExamples include the following:\n\nThe American Dietetic Association (ADA) is the accreditation agency that sets the standards for Registered Dietitians (RD).  Starting 2024, they have now demanded that an RD get a master's degree.  There's no reason an RD should need a master's in order to work.  All they have done is prolonged students from getting into the workforce and causing them to obtain more debt.\n\nThe accreditation agencies also require bullshit filler classes instead of streamlining.  When I was obtaining my nursing degree I had to take BS electives that had nothing to do with learning the skills I would need when I entered the workforce.  Eliminating those BS classes would have allowed me to graduate 1 year earlier and with less student loan debt.\n\nIf the Biden administration could meet with the accreditation agencies and instruct them to cut out the requirements that are not directly useful for the job requirements.",
            "And yet there is a big push for free college in the US which will just lead to MS or PHD being the bare minimum to pass HR filters.\n\nI also think people will complain no matter what.  Theres going to be issue no matter what direction.\n\nHiring based off networking and it is too neopotism.\nHiring based off degree and we get degree inflation.\nHiring based off of testscores and suddenly it becomes a big race issue.\n\n\nPeople need to realize it is a cut throat world.  The population is at an all time high with only so many jobs available in so many desirable location.  \n\nEither adapt/get left behind or vote for politicians that push for universal basic income.",
            "Efficiency means highest quality worker as cheap as possible\n\nDegree already implies a lot of skill\n\nAnd it would imply momentum too, but since there’s so many people with degrees struggling to get jobs, employers can maintain a steady pick of high quality workers by limiting themselves to degree holders",
            "But it gets them indebted for life so they have to work until they die while making their employer and banks wealthier..",
            "Nothing new here. I remember applying in early 2000's for IT jobs where they asked for university education and 5 years of experience in a software that was out for 9 months.\n\nStupidity is rampant in a system where we 'grow the economy at all costs'",
            "I’m very much in favor of aptitude tests and solid work experience being the barrier to entry with many jobs that currently require a degree. My resume and ability to articulate my position in the workforce should be enough, but I’d be willing to put that to the test.",
            "Once read about a company that bragged how every position was filled by people with Bachelors Degrees. Has to be one of the stupidest things you could do. Besides, something goes missing you know either the file clerk, the mail guy, or the receptionist. Cause they don't make enough to pay back their student loans.",
            "I got along just fine with an associate degree but I might just be really lucky.",
            "The issue is companies assume a degree helps with your management skills. Which it really does not. Some the best managers I know have very little post education, and simply \"get it\". A degree might help if you need technical know how for a specific department. But if it's just general admin corporate stuff you really just need to learn to manage time, people, and policies. All which are not really taught to you directly in school.",
            "The real rub are the ones that don’t need it but secretly do.\n\nWhere I work yea, you don’t need a college degree to be an entry level manager. It just so happens that over the past 3 years something like 98% of those entry level roles have gone to recent grads. 🤷🏽‍♂️",
            "Shop and home economics were required classes when I was in junior high.  No longer.",
            "Requiring a college degree for a job that really would not require one is the last remaining form of discrimination that an HR department can legally perform.  It is a way to eliminate minorities and older workers without triggering an EEOC lawsuit.",
            "I work in Finance and have a Masters degree in Finance.\n\nThe only thing that really mattered in my life is that my parents are rich",
            "Kind of not fair to remove requirements for a degree considering a lot of people got into crippling debt for them. Just a thought.",
            "It’s not the degree. It’s that you have the money to get that degree.",
            "Class warfare",
            "Only entry level jobs that have no other barometer of judging suitability of a candidate for a position should require a degree. If someone has been verified doing a job in an equivalent position elsewhere the degree should be optional",
            "It is intentional classism.",
            "I see the jobs my company posts as requiring a degree and knowing what those jobs would be doing, no way they need a degree. And they dont care what the degree is, just have one. So dumb.",
            "Duh.  Most jobs don’t need a college degree.  Waste of time and money.",
            "There should be regulations in place. Something like (I’m just throwing out random numbers, the actual minimum wage proposed should depend on multiple factors).\n\nMinimum wage if a high school diploma/GED: $15\n\nMinimum wage if bachelors degree: $25\n\nMinimum wage if masters degree: $35\n\nEtc etc.\n\nThat way the company is forced to pay people appropriately, or change their job requirements to hire people at an appropriate level. Not all secretaries need a masters degree, but if you require your secretary have a masters degree you should have to pay them for having to get that degree. IMO",
            "Some claim that unnecessary college degree requirements are because companies are precluded from administering their own intelligence or knowledge tests (or they think the risk of a discrimination claim is too high), so college degrees are a decent proxy.",
            "Not if you’re selling overpriced degrees",
            "Government guaranteed loans is the biggest problem, get them out of the way and the issue will begin to resolve itself.",
            "No shit your about 10 years to late",
            "NO SHIT",
            "It's basically corporate welfare. Many companies don't want to pay the associated costs of onboarding a newhire and training them to do the basics of the job. Basically investing in the newhire and needing to provide a good work environment so they stay a good while and you more than make up for the initial costs. \n\nThey found out that they can lean on the tax payer to issue a loan to a high-school grad so they can learn how to read and write at an adult level, and learn basic technical skills that realistically can be taught in a few weeks at these entry-level jobs. That way, the newhire/ taxpayers (college loans are guaranteed/issued by the government) can incur all the costs of providing you a job applicant that you theoretically don't have to onboard much, or have to treat well to incentivize them to stay. \n\nThis may, or may not actually result in lower onboarding costs for certain companies, but its probably what's pitched to the shareholders and therefore makes it into the entire hiring structure and overall corporate culture. Of course, lots of inertia from the legacy perception of college in the boomer days also contribute. The degradation of the quality of public education also contributes.",
            "You really don’t need a college degree for a large amount of the jobs out there. I am a self taught senior IT architect for 2 jobs.",
            "All according to plan for corporate America.\n\nMaking a bunch of for-profit education campuses and pressuring everyone to get degrees “or else” wasn’t an accident. \n\nWhat happens when everyone has degrees? Companies can hire overqualified people for pennies on the dollar. \n\nAnd they’re all so desperate for work because of their student loans, that all 200 applicants for the 1 opening will accept whatever shit-ass pay they get offered so they don’t go into bankruptcy. \n\nBasically slave labor for modern America.\n\nCapitalist dream.",
            "Or how about going to college and majoring in a degree that makes you unhirable.  Now you're in debt whining about student loan forgiveness to pay for the college degree you just got just so you can work retail next to the recent high school graduate.  we need to stop pushing majors that don't have good job prospects.",
            "Here is the thing… no job requires a degree. There are some things you would prefer people to have standards for. But I bet if apprentice programs were created, the world wouldn’t end.",
            "It’s because 49% of the population has a degree, it’s a preselection process.  Makes life easier for the employer.  Colleges are hurting as fewer people are going.  The job market will follow that trend.",
            "Daily reminder a college degree isn't only to learn your craft. It vastly improves one's overall critical thinking skills too\n\nWe need affordable education",
            "It is not a mistake for employers. You can reduce the number of applicants from 1000 to 20 with this one trick.",
            "Generally agree but sometimes I wish my Ubereats driver had a college degree so they could actually get my food to me without screwing up. I swear, many of the delivery drivers are regarded these days...",
            "Almost like the system wants people in debt and desperate thus willing to accept poor wages and poor working conditions rather than question how we make more goods and services than ever before, yet people struggle to get their basic needs met.  Huh.",
            "And it discriminate against the stupid.",
            "It's their money ...",
            "Most jobs don't require a degree.",
            "The average college degree is a dunce cap in disguise.",
            "I dont know man. I recently hired a collage dropout for a clerical type of a job replacing an art graduate after she went on maternity leaves. The \"high school graduate\"  does not understand how to respond to business e-mails. does not understand how to google and figure out simplest shit (Setting up a printer etc.). And worst of all, she is unwilling to learn and untrainable. Anytime I try to train her on anything, she gets offended.",
            "Education is what made this country great.\nHow do you expect to have the best scientist? \nHow do you\nExpect to have the best doctors . \nhow do you?\nExpect to have the best teachers . \nHow do you? \nexpect to have the best military.. \nhow do you .\nexpect to have the best minds in the military?\nEducation stimulate your mind and in some cases, takes you places you’ve never thought you could go. or would go\nWho’s to say what deserves a degree and what doesn’t deserve a degree.\nDo you go to work Just to do enough to get by. What do you go to work and do your best?\nTo deny anyone of an education to find the potential is a disservice to our country. Because you never know where it could’ve taken us.. especially in the competitive world we live in today. Instead of using colleges for profit, we should be using it to better our country.\nOnly fools would not want a better country.",
            "And some of us weren't able to for economic/family reasons. It either limited our career options, OR gave us major impostor syndrome if/when we're successful. Or both!",
            "“A lot of us earned degrees that weren’t in demand”.\n\nThat’s a big part of the problem, and it’s still happening. I went out last weekend for Father’s Day and we were talking to our server, who is going to a very prestigious school in the area, for “social sciences and film appreciation… it’s a double major” he had to tell us with a highbrow shitty attitude. My old man looked at me and said if I majored in something like that when I was in school he would have disowned me. That poor kid is gonna be six figures in debt, working as a bartender for the rest of his fuckin life. I almost felt like I owed it to him to tell him for the love of god to change his degree to something marketable, but it probably wouldn’t have made a difference anyway.",
            "Almost half of the people that apply to work in the shop where I work fail the tape measure test.  It's not really timed very strictly either.  I get what youre saying about the school system, but I think parents have a role too",
            "I always got shit for “gatekeeping” which in college. I was always of the mind that the entire point of college is the gatekeep. The school is enforcing a standard, so if you don’t meet that then yeah, you’re being “gate kept” from the degree. I felt almost no accomplishment seeing some dumbass graduate with the same degree as me because the standards are so low",
            "I have met a ton of college graduates that really aren’t much smarter than high school kids. More opinionated and self important? Absolutely! But not more intelligent.",
            "It's sad to say that we are seeing this creep into undergraduate programs, too. I had a conversation with an engineering senior design professor who was complaining that some students made it to senior year without understanding pretty basic stuff.\n\nI've also heard people complain of absolute garbage PhD theses but the PhD was granted anyways.",
            "This has no relation to no child left behind. This is an issue in Canada which has no such policy.\n\nThis is all about employers creating arbitrary requirements and refusing to do on the job training.",
            "NCLB is the biggest education mistep ever taken by a country. It actively hinders the brightest from over achieving by attempting to drag the lowest achievers up to slightly above the bottom of the barrel.",
            "Not sure what State you are referring to but in mine, the standards remained the same. The graduation rates were essentially unchanged except for the year or two after the pandemic. No child left behind added additional funding for various programs etc.  I would have liked to see an expansion of vocational training programs.  I see too many inept carpenters, plumbers and general tradesmen who may have an issue with advanced trig or reading the classics, but I would like to hire someone who can cut boards straight and drive a screw or two correctly.",
            "Well this is the world people wanted. Everyone gets a trophy.",
            "Bingo.",
            "Agreed, and it doesn’t seem like too much to ask that an individual demonstrate that they can read and write at the 12th grade level.",
            "100%… we keep pushing forward even tho a large percentage of students aren’t meeting the basic requirements to pass their current grade level. And on top of that, HS push college like it’s the only solution.",
            "More basic than that. When jobs get tight, HR needs a box to tick that also doesn't run afoul of EEOC.",
            "Great point",
            "The private school education system isn’t either. You should see the nonsense coming out of some of these private charters in AZ.",
            "Fully agree.  It's a nice, in theory, idea to make politicians have a talking point say look at my graduation level.since I've taken office.\n\nHowever, in no uncertain terms, a portion of the population does NOT have a HS graduates education even though they have a diploma.\n\nWe also see this with these new BS colleges (ime. Phoenix or other papers mills) which essentially just took money in and printed a associates or bachelor's.\n\nAccredited universities need to have rigorous criteria that is reviewed every decade or so.  HS graduation needs to have rigorous government back standards that a certain level of competenance can be covered.  I don't know if that can be derived from taking an SAT or similar test but some standardized test which can at least say this person is competent and the teachers can't teach to it directly",
            "It also serves as an IQ test. IQ tests are illegal for the job interview process, so getting into and passing some or graduating college is certainly an effective filter for this. \nA certain percentage of people with an IQ of less than 83, about 12% of the population, cannot be trained to do anything of any utility in a reasonable/efficient timeframe. Combine this with the fact that companies can be slow to fire and now it’s a total headache",
            "PREACH!! PREACH!! PREACH!!",
            "It’s funny because Progressives actually think they’re doing something useful when they’re lowering standards",
            "The sad thing is college is also being dumbed down. It’s easier to lower the standard then help people meet it.",
            "Texas is a prime example.",
            "Yes",
            "IMO it’s a good thing that more people have access to education, including higher education.\n\n^^^ a statement that is surprisingly controversial.",
            "What, I thought No Child Left Behind was supposed to devalue public education while dramatically increasing the cost of a college degree",
            "I remember some jobs I applied to as a teenager required some very basic tests.  Making sure someone can read and write and knows basic math doesn't seem that hard.",
            "This have been going on long  before no child left behind",
            "Can’t exactly rule over an intelligent populace like you can with a bunch of dumb dumbs haha.\n\nMove over high school diplomas. There’s a new participation trophy in town 😂😂",
            "Ok.. how about a 2 year degree?.. and remove needless electives and less credits.. this will make sure some competancy!",
            "Sadly at this point even a lot of colleges don't produce cabale workers anymore. It's more like give them your money and show up, they'll hand you a degree after 4 years.\n\nNow every college is different I'm sure, but I'm noticing this more and more with State colleges.",
            "Not sure what State you are referring to but in mine, the standards remained the same. The graduation rates were essentially unchanged except for the year or two after the pandemic. No child left behind added additional funding for various programs etc.  I would have liked to see an expansion of vocational training programs.  I see too many inept carpenters, plumbers and general tradesmen who may have an issue with advanced trig or reading the classics, but I would like to hire someone who can cut boards straight and drive a screw or two correctly.",
            "That’s racist",
            "Well, when conservatives push that the government is hopelessly inept and the public insists on not listening or valuing teachers, of course you get idiocracy instead.",
            "The schools aren't failing America, America is failing its schools. They're underfunded and under attack.",
            "Bingo.\n\nFederalization of anything wrecks it",
            "Pay a shit load of money or stay poor.  Sounds fair",
            "This was Speech Therapy school for me. That grad program was tedious and boring AF, because it honestly is not a field that should require 6 years (undergrad plus masters) of education.  I felt like I was learning in some classes, but easily more than half were just filler.\n\nMeanwhile, in most of the Western world, it is a bachelors, attainable in about 3 years.",
            "Because the American education system is failing fundamentally before school. Kids are getting dumber. Source : am young",
            "Radiology tech?",
            "Same, except I got the degrees in the Army too. Might as well use the free college tbh.",
            "It’s not just the military - there’s a lot of solid skill-training jobs for young people that people just aren’t aware of.\n\nI have a grad degree and a pretty good professional job, but my cousins that went the blue collar route after high school are all making around the same ballpark earnings as i am.\n\nI feel like a lot of political messaging today is telling kids the system sucks and there’s no opportunities.  They need to be told where to look",
            "So you're essentially a tech, engineers definitely require a degree",
            "well that goes without saying…experience will always trump just having a degree\n\ni think the main gripe is that people are “required” to have a degree first in order to even start getting the experience ",
            "I would argue that you're not really an RF Engineer unless you can tell me quantitatively what would happen if I changed something on the schematic you're reading. Any idiot can learn how to read a VNA, but an engineer's work is to understand where the reading came from and how to make it do what I want it to",
            "The military is a fantastic source of upward mobility for those that choose to use it wisely.",
            "i'm not crazy about a system where the most reasonable course for adult education is through the military.",
            "[deleted]",
            "Yup. I'm in FL and have several teacher friends and the amount of students that adminoves on to the next grade despite actually being illiterate is fucking WILD. And most of the kids are okay with staying behind because they've been struggling and obviously don't need harder topics to cover if they don't understand the basics.\n\nIt's getting scary out here, I really want to move back up north where teachers actually make decent money and admin isn't COMPLETELY CLUELESS.",
            "Ideally highschools would teach this and the idiots who can't do it should flunk out",
            "On average a person with a college degree makes 1.5 million more throughout their lifetime than a person who doesn't. Just because this is not true for you doesn't change thay fact. Before college I made $11/hr, 3 years out of college I make 6 figures.",
            "Or to fully restore bankruptcy rights to student loans, as in you fill bankruptcy and the loans are discharged along with all the other unsecured debt with no specific proceedings required.",
            "Exactly. When I went through college I saved up, worked and paid my way. Loans are just a tax on those who didn't go to college.",
            "You are a shit analyst.\n\nI regularly hired 3.0+ GPA college grads for $14/hr customer service jobs.\n\nAll that debt…. Not much income.\n\nWhy?  Because the supply of people with degrees (especially liberal art degrees) increased but the job market remained largely similar.\n\nWhat a shit analyst 🤦‍♂️",
            "I’ve been in my field for 16 years and it takes 5 years before you really start making much over base wages. You think 4 years in college shows some kind of stick to itiveness that I lack?\n\nI was in my previous field for 11 years and only left because college degree requirements were pushing me lower and lower down the pay scale.\n\nDemanding a college degree for every job is counterproductive for many employers. Some jobs absolutely require a degree but the accounts payable people don’t and sales people, unless they are technical sales , don’t. Plenty of jobs “require” a degree that provides no benefit to the employee or employer.",
            "Ex post facto rationalization.",
            "If a degree determines that, how come college graduates make half of what I do? \n\nEdit: Bunch of broke people below me, downvoting me isn’t going to change that fact. How’s it feel to know both my paycheck and the retirement pay (thanks for your tax money) are larger than any of you would make if you were even capable of getting an EE degree? That recruiting office door was open wage slaves. 🤡",
            "Isn’t that what interviews are for? And even still, I spent 5 years in an engineering degree to apply for a job that takes people with business degrees. If we’re just testing if someone is a fucking moron or not, why not just interview them and do an internship? You should be able to find out within a week or two if they’re cut out for the job or if they’re better suited for other things. You might have an interview with a kid who can talk his way out of prison with a orange jumpsuit on, but is applying for a highly technical job. It used to be you’d find a spot that worked for him, now if you don’t fit the position they just tell you to fuck yourself",
            "This is the answer.  \n\nI tried to downgrade education requirements once (for a secretary job).  It was a disaster.",
            "With the loose worker rights in the USA I see the problem that quite a few companies will abuse the shit out of this.",
            "I'm curious what the bullshit classes were?",
            "Wow, a masters?  Yikes! I remember my sister (who got their bachelor's in dietetics) complaining about how the program could really be an associates degree, as there was a bunch of fluff classes to get it to be a bachelors.  Now they want to make it a masters?  They are doing this with Occupational Therapy Degree, switched it to be a master's degree instead of keeping it a bachelors.  The problem with these certification upgrades, is that people's salaries are not being raised in sync.  So coming out with more debt, yet only being paid a somewhat mediocre salary.",
            "I've always said that about free college. College as it is now is absolutely an absurd expense but if you straight up make it free everyone involved will treat it like it is free because that's how it always works.",
            "That's like saying we shouldn't have environmental regulations because too many people already died of lung cancer caused by air pollution.",
            "Largely because, if we are honest, college does a poor job of preparing you for the actual career most of the time.\n\nIt in essence teaches you the respective language you will be speaking on the job. You learn how to work, well, at work.",
            "Most jobs around me above 40k require a degree outside of sales jobs or trades. It is absolutely a requirement if you want to live anymore outside of those two jobs. It's absolute bullshit.",
            "That's one example. And since when is setting up a printer simple? They are always a pain in the ass.",
            "Hope this doesn't come off as rude, but I really think you need to improve your use of punctuation.",
            "How do you expect paragraphs? How do you expect to use autocorrect? How do you expect to not put question marks where they aren't supposed to be?",
            "I agree, but I disagree with how we’re funding college education with federal debt causing prices to rise to astronomical level. If you compare tuition prices now compare to 10-30 years ago.\n\nThey need to overhaul how people pay for college in a responsible way even if it realistically means fewer people will go. Because they can’t secure government loans.\n\nI was lucky to have the GI bill to pay for mine. But, unlucky to have a stem degree and I’m not employed in my degree job field.",
            "Sounds like you’ve had some therapy",
            "Yet he will be on Reddit saying college just isn’t worth it anymore unlike the good old days.  Give me student debt forgiveness because I was tricked!  There is so much opportunity for college grads right now if you have the right skill sets or adjacent skills to the areas of the right skill set.",
            "Wait wtf is a tape measure test? Are there adults walking around who can't use a tape measure?",
            "Like… they can’t use a tape measure?",
            "I’d almost argue after lack of gov spending, parents are predominantly to blame.",
            "All the adults play a role, the school don't hold the parents accountable and vice versa. Just a big mess unless you're extremely involved as a parent ",
            "Tape measure test?",
            "Yes ask any teacher these days and they will tell you how much things have changed from 10 years ago. :/",
            "To be fair, a tape measure includes numbers that go beyond single digits",
            "When do they get to be home to teach their kids anything?  They have to be working 3 jobs just to make rent, let alone having the resources to enrich them.",
            "I’ll self report and confess I had this embarrassing moment in college. Professor had slides of a tape measure and asked us to tell him what the number was, we all thought it was easy. 2? That’s 2 inches. 5 and middle line? That 5 and one half inches. \n\nThen he showed a line that, look, I simply didn’t remember. But I remember most of the class making “oh.. hmm” sounds and laughing because, before this slide, we all thought we were above the exercise. I think it was a X and 5/8th. But I hadn’t used a ruler since idk grade school? Not saying that’s makes it acceptable, but it seemed normal because everyone else was confused too. Stuff just falls out of memory.",
            "This is why where you go to school does actually matters and will become more important as time goes on.",
            "College doesn’t make you smarter just more informed. Do you think you can teach someone to be smarter?",
            "Sure, there are plenty of smart high school dropouts, and plenty of stupid college graduates. \n\nOn average though, education level is correlated with intelligence, regardless of how much you may dislike that fact.\n\nAnd when it comes to jobs, that isn't even remotely the most important part. A college degree demonstrates a degree of follow-through, work ethic and ability to delay gratification. When you have 100 applicants for a position, it's a useful screen to help winnow down the applicants to a manageable interview number.\n\nIn my previous role I managed a team of 14 technicians. The position didn't require a degree, but the pay and benefits were good enough that we still got many degreed applicants. While I still hired plenty of high school grads, and a few of them were among my best technicians, there is no question that on average the college grads outperformed the non-grads. \n\nAnd it was not at all about intelligence or anything they learned in school.",
            "I know plenty of boneheads with degrees.  The ones without degrees are doing better in life than the ones that have them.",
            "The hardest part of graduating from Harvard is getting into Harvard.",
            "I've been noticing this too, at all levels.  Covid was a devastating body blow to education across the board. I don't know if it'll recover.",
            "No one is paying a person to to learn to read on the clock. I don't think you've had the pleasure of hiring for a low or even intermediate skill position. It isnt about on the job training it's about people unable to read written instructions and count change. Have you had an employee write axe instead of ask in a power point slide?  ",
            "It's not no child left behind specifically, but the idea that requirements should be lowered so everyone can pass. Hasn't that happened in Canada? It sure has happened in most of Europe.",
            "KC just passed a law requiring no grade to be lower than a 40% even if the student did not turn it in.",
            "You could always open up your own vocational school to teach people how to cut boards straight and drive a screw or two in correctly if the demand for mechanically competent personnel is that high. You might even be able to work with master carpenters, plumbers, and other tradesmen to have them hire graduates from your school.\n\nVocational classes cost money, and as teachers are already purchasing their own supplies for their classes it's unlikely that schools would be purchasing equipment to train students on. Additionally, there might be both legal and liability ramifications to permitting < 18 YO kids accessing the more dangerous tools. Fuck, when I was a kid working for a grocery company it was state law that only 18+ could use the trash compactor. At KFC only 18+ were allowed to use the god damned potato mixer. Stuff like that isn't on schools.",
            "IQ tests are not illegal for hiring processes. At this point possibly millions of people have taken the ASVAB, which is an IQ test administered by the federal government. \n\nGriggs vs. Duke Power showed disparate scores on an IQ test so employers must show that an IQ test is reasonably related to the job (hooters waitresses discriminate by sex because the job *requires* them to be women, as well as fairly conventionally attractive but that's not a protected class). It turns out that people with higher IQ perform better in busy about every job. Recall that police departments can choose to not hire based on too high of an IQ score. You basically need to engineer the test to discriminate against a protected class in order for it to be an issue like in McCollum vs. FAA.\n\nBut yeah my biggest aggravation is \"well I'm not gonna do my job to see if this person could do their job, but UT said they might be good at it, and without even looking at why UT says that, it's good enough for me\".",
            "I have a few friends that are teachers. They weren't allowed to fail anyone. They would give extra credit to bring the grade to passing or there would be a computer program that kids would retake the same stuff over and over until they passed.  \n\n\n Additionally colleges did away with GMAT and SAT scores during that time.\n\n\nCOVID hid away failures. Nationally there has been a rash of public schools losing accreditation and even teachers going to prison for falsifying standardized tests.",
            "Lowering standards is racist imo.",
            "Ever heard of the \"Soft racism of low standards\"? Basically saying we should not expect the same level of competency from certain races.",
            "Sarcasm?",
            "Teacher salary maybe but under funded? I wouldn't say that. Many are mismanaged with top heavy over compensated administration.",
            "Yes! Just look at our super shitty interstate highway system! And military! The Postal Service is barely able to get something all the way across the country in three days for less than a dollar! Speaking of dollars, I wish every state had its own currencies again! \n\nThere are places for corporatization. For localization. And for federalization. The idea of saying any one of those things automatically ruins something is absurd.",
            "yeah but here in france for example you won't get anywhere that pays well is you dont get a masters and thats 2 years on top of your bachelors",
            "That’s by design for one major political party.\n\nThey don’t want intelligent voters. Intelligent people are harder to control, and the whole corporate capitalist bullshit scheme will start to crack.",
            "Yup",
            "I got 3 years left of the post 9/11 to use!",
            "People see social media and everyone is \"product manager\" for some product they don't make. It took years to learn about fabrication and production and all my coworkers are 30+ years my senior. It shocks people when a 30 year old walks in for a position that's been held by 60+ year olds.",
            "Yeah, they changed the job title a few years back. It was \"test technician\" now it's \"test engineer\". They do that so they can hire \"engineers\" without actually hiring and having to pay for engineers.",
            "Which, for 90% of the jobs out there, is just companies being lazy as all fuck.\n\nEven with a degree, you still need OJT. Your degree will kinda come in handy, but you don’t actually know wtf you’re doing until you get a company and they train you on what to do.\n\nCompanies just don’t want to train anyone anymore, then they all whine and complain that they can’t hire someone for $15/hr who has a masters degree and 10 years of experience with 15 different highly specialized tools or programs.",
            "Different jobs, for sure. \n\nFar fewer jobs available though for people actually designing the things we use.",
            "I did my part!\n\nNo but seriously. I did. \n\nBut I agree. It’s fucking shit. I only did it because there was literally no other way I was ever going to be able to afford anything.",
            "The military isn't an easy route.",
            "There’s nothing easy about living with PTSD.",
            "It's as of 12 years of k-12 education isn't enough. We need to make people pay to sit in class for an additional 4 years to see if they can learn how to do a simple task",
            "💯",
            "That would work as well because banks wouldn't loan to bad students who couldn't find jobs to recover the loan. I'm fine with that.",
            "You are right, because you could. \n\nAnd there is a oversupply of degrees like that that are worth nothing. And the colleges still sell them. \n\nI think it kind of proves that the people that get those kind of college degrees, are not college material in the first place.\n\nWhy not just hire a GED person and pay them the same wage?  Or a high school Dropout?\n\nIt's because you would rather have a college degree person making the same wage.  Because the college degree means something. Even if it's in the wrong discipline.\n\nHowever, you might want to reevaluate those wages. They should be making at least $30 an hour. Why don't you pay $30 an hour? And just raise your price?",
            "I hired plenty of people with degrees for technician roles that didn't require degrees. \n\nThey on average significantly outperformed those without degrees. Sure, I had a couple superstars that didn't have degrees, but most of the best employees did. And not a single one of the completely useless shitheads had a degree.\n\nMaybe you were just a shit boss.",
            "Why do college dropouts in the NBA or people who never went to college like boxers, actors, models, musicians, etc, make more money that you and I? It’s supply and demand. \n\nIf you have a skill that is in demand and low in supply you will make more money. Plain and simple. At least until the corporations and their allies in Congress flood the market with cheap labor.",
            "Median salary for someone with a bachelor's degree compared to only a high school diploma is 60% higher, 2x for a masters, and 2.5x for a professional degree.  While you may make more than some, the numbers say the degrees pay more.",
            "Because there’s exceptions to every generalized rule? The fact that you don’t intuitively understand that shows that you’re uneducated lol",
            "Including disability from the navy isn’t a flex. We all know people who got full disability and still work normal jobs.",
            "The irony is palpable",
            "Good question. \n\nIn life, there was always somebody that wants to get up earlier than you, work later than you, work harder than you, and do what it takes to achieve. Just a little bit more than you. \n\nAnd that's the way life is",
            "It’s an unspoken caste.",
            "Electives that included geography, music appreciation, 2 PE classes, 2 religious classes and others I don't recall.",
            "Not quite, in my opinion. You will continue to do harm to those who took out loans by over saturating the market and likely even disadvantaging them since non-graduates may take lower salaries. I think if this happens, companies that required the degrees should be held liable and in Contempt.  They are basically admitting it was all a scam.",
            "Like I said, I’m sorry, but I’m at work running to multiple machines just trying to get a point across.",
            "\nSorry, pardon me I’m at work running multiple machines trying to double task and just trying to get a point across that was important to me . and I admit, I’m probably not as highly educated as you and I know some of the stuff is simple to you. I care more about getting my point across than I do punctuations.",
            "The problem isn’t how people pay for college using the colleges for profit is the problem. there’s a reason why we have a shortage of doctors, nurses and teachers those are very important things that this country needs. we should want to be a great country and you get a great country with education and more important and information just like a doctor or scientist or teacher you don’t get your information from one source the more sources the better the product. and if worried about inflation, we should’ve given tax breaks when we have a deficit we shouldn’t have given tax breaks to companies and corporations that are making record prophets.. the future of our country is far more important.",
            "I have indeed.",
            "Not always true. \n\nI know people with STEM degrees and experience who have been unable to find work (and some laid off). \n\nIt’s not as easy as just “because the right degree.”",
            "I’m convinced a quarter of people have to remember to breathe. Not surprising that so many can’t read a tape measure.",
            "Its just a piece of paper with pictures of measurements.  Easy",
            "While teaching art in middle school, about 9 out of 10 kids coming into my class did not know how to read a ruler.  Nor did they know how to draw a straight line....with a ruler.  I had to teach it.",
            "Tesla tried recruiting me years ago when the plant in Fremont was first opening. I confirmed it was a technician spot, not an assembler. The lady assured me it was a technicians position. Scheduled an interview, went in and was surprised to see about 60 other people in the wiating room with me. Then they brought allll of us into a conference room for an aptitude test and thats when i started thinking \"yeah this is an assemblers position\"\n\n\nWe were given a ~1ft piece of rebar, a ruler in cm and 3 nuts. The test was only to see if you could convert cm to mm. I laughed and looked around to see who else was finding this hilarious and was saddened to see mostly confused looks. I put the crap down and left.",
            "I shit you not, when I worked maintenance at an engineering university, half the student workers there couldnt read a tape measure.",
            "\"fractions are hard\" -my PhD holding wife that makes experimental cancer medication and could not use a tape measure to hold save her life. ",
            "i know there's adults who can't read an analog clock but cmon.\n\nalso, at the same time, I got bullied once for not knowing how to use a pallet jack cause no one ever showed me how.... \n\nfucking with public education is how you get adults who can't use an analog clock or a tape measure.",
            "I use a tape measure everyday, go point to 7.437” on it. It’s not difficult to learn but if you never learned your fractions to decimals how would you know I meant 7 and 7/16?",
            "Sadly….yes.",
            "I almost never need to do if it's not marked or a main number I couldn't tell you.",
            "What’s a measuring tape?",
            "Yes.\n\nAnd levels. Which is even more baffling to me. I worked on a solar field project that hired temp workers from the local area to meet a quota before the gc could bring in more of their own workers.\n\nThe amount of people that didn't understand or didn't care to throw a level on anything was astounding.",
            "Dude, there are people out there who can't even tell time on a standard clock.",
            "It was quite baffling to me as well. I literally looked up to check if there is a special test called tape measure that I don’t know of.",
            "The test is a picture of measurements",
            "I agree, parents need to value their child’s education and need to have an active role in their learning. They need to out education as one of the forefronts of the household.",
            "Are you for real.? Lack of government spending in education is partially to blame?\n\nDo you realize how much money is spent on public education and how much they continue to throw out it.?\n\nA lot of the blame goes on the parents. Having misbehaved children with terrible habits and a shitty diet will obviously help sitting in a fluorescent lit classroom for eight hours a day being talked to.\n\nBut also getting relaxed on the standards to even pass. I’m sorry, but some people just have to dig the ditches as terrible as that sounds.",
            "Some of these districts losing accreditation were the best funded in their respective states. It wasn't a spending problem.",
            "Parents way before spending, even. Look at the performance of Baltimore City schools and the amount per student spent at them - they have very high spending per student. \n\nKids are learning from birth and a lot of parents don't value learning or critical thinking. My kids could read before they went to school, just from my reading to them to entertain them, bedtime stories, and lightly encouraging them to participate in the reading. I don't mean to brag, my point is that they were way ahead of kids who didn't have a book in their house.",
            "In Chicago, somewhere around 80% of black kids grow up in single parent households...and about the same percentage are born to unwed mothers.  (For context ~ 12% of white kids are born to unwell mothers in Chicago)\n\n\nPoverty/lack of education/lack of involvement by parents is a vicious cycle.... \n\n\nWhat chance does a kid who grew up in abject poverty with limited parental guidance, surrounded by gangs and drugs, with few if any role models really have?",
            "A big problem is that in the modern con-game that is capitalism, lower-income families just do not have the time or resources to devote to effective childcare.\n\nA single parent working 2 or 3 jobs simply cannot give a child the attention required to meet many milestones of development, unfortunately.\n\nUntil we reorganize society around more humanistic values and less economic values, this is unlikely to change.",
            "It's not a money issue, but a spending one.\n\nFar far far too many bad teachers are allowed to keep their jobs indefinitely. Many people point out how little teachers make but ignore all the benefits the job comes with due to teacher unions fighting for those benefits.\n\nAmerica is the 4th highest in spending per capita and below 10th in every major category. \n\nMost of the issues are parenting, the Department of Education, and cellphones.\n\nSince the inception of the DoE, America has steadily declined in every measurable category of intellect. \n\nThere's been multiple studies showing heavy social media usage lowers IQ, and the younger people start using cellphones to show negative correlations with attention spand, social skills, and reading comprehension.\n\nTo top this all off, look at the sheer amount of administrative staff, partly required via regulations and some due to local pushes for them.",
            "Parents will always want the best outcome for their children. It's up to the gov and school districts to be their limiter.",
            "Nobody holds the teachers accountable, try flunking two kids in the same class, I can assure you that the administration will be dragging that teacher into their office of an explanation and to change those grades.  Flunk too many kids and you will be fired, it's a pretty clear understanding as a teacher that if you want to keep your job you pass the students no matter how poorly they perform.  So the teachers are actually held accountable for their actions, just not in the way you think.  Then again if your are a parent you'd likely be screaming at the principle if your kid failed a class -it's always the teachers fault, it has nothing to do with a kid who never does their home work, sleeps during class on the rare occasion that they actually show up.",
            "Just a paper with pictures of measurements.",
            "What the heck?  I guess the situation is fixed.",
            "Is funding tied to a certain percentage of students \"passing\"?  This is utterly ridiculous.",
            "What part of \"No Child Left Behind\" is this referenced as requiring??",
            "I just heard this. That is absolutely insane. If they deserve a zero, give them a zero.",
            "Not too long ago, those classes were in school. People used to do shop class or auto repair, electrical, HVAC, you name it. It's also pretty easy to add training specific to particular industries into regular classes \"Sally cuts an 8' 2x4 into three equal pieces how long are they?\" The question people are posing here is if someone is in school for 12 years, how many more years should they need to go to school to learn how to use a saw when, again, they've been in school for 12 years already? \n\nPlus there are schools that do exactly what you're saying, so it's entirely possible to do it, the question is, why are so few places doing it? \n\nhttps://www.nisd.net/cca\n\nI know they have hiring pipelines to a bunch of businesses. There's even a signing day which is like a pep rally in the spring where people with offers after they graduate either sign their employment contract or \"sign their employment contract\" depending on how old they are.",
            "Grades were definitely inflated during that time, but the State Wide exams to graduate were back in place, as were the Standardized Tests.  These tests do  nothing to fix the issue, btw, just indicate how horrendous the situation is.  What can be done with the students who were not instructed during that period and the ones who completely drop off the radar is the question...",
            "Makes far more sense to me.",
            "Yup I agree. I thinks it’s ridiculous and a dumb way to try to fix an issue. I scored far higher on the fire test and lost my job to people with far lowers scores Because of my race. Guess diversity is more important than saving a life.",
            "Indeed. Just what I was told when they made D’s a passing grade and you could pass with a 1.5gpa.",
            "They are top heavy, true. They are also underfunded and under attack.",
            "I mean... yes, look at our super shitty interstate highway system, bloated military, and inefficient USPS that spews out carbon emissions from their outdated fleet built in the 90s.",
            "Is that why France has such a high youth unemployment rate?",
            "It’s also location dependent because there’s plenty of schools in affluent blue areas where American children learn media literacy and college level anatomy and programming.",
            "I had GEDs and Highschool diplomas on the same team.  \n\nMy favorite hires were DACA Spanish speakers because many were brilliant but college wasn’t on the agenda.  \n\nI didnt target college diplomas when hiring, they fell to me as they slipped through the cracks of the local job market.  The job paid what it paid.\n\nAnd ah yea, just double the wages of the labor force!  Fuck already thin margins and financial analysis.\n\nCmon man….",
            "It heavily depends on the actual job. It seems your job is more technical, where an education and technical background (even technical theory) is beneficial.\n\nMany entry-level jobs want a degree because they figure a college grad knows how to use microsoft365 and can read/write. Most high-school grads, and a good number of college grads (with non-language majors) are semi-illiterate when it comes to any psuedoprofessional communication.\n\nIt's just a way for many employers to avoid maintaining a Cadre of experienced employees to train up newhires to get up to speed. That would ultimately mean that instructor tabbed employees would demand a higher salary, and you'll have less desperate newhires that need to make good on the $50k high interest loan they're on the hook for.",
            "Nah, you just dont grasp the concept of degree inflation.  \n\nYou missing the point (degree inflation is an economic burden) doesnt have anything to do with me being or not being a shit boss.",
            "Can you link me to your source?  I’m not debating it as a fact, I would just like to read more about it.",
            "Uneducated and making more than you. It’s a cold world. 😌",
            "Who mentioned disability dumbass? How are you flexing a flex no one made. Broke boy.",
            "also, one adecdote does not mean much as a general reference or thing to be thought of as a common, verifiable truth",
            "Maybe you should focus on work. Then after gather your thoughts then make a coherent comment. \n\nI'm hardly educated myself. I just have a a buisness degree.  I'm just a bit acoustic. Like autistic but nicer. You should care more about your punctuation so you can get your point across more clear and people will take you more serious.",
            "Damn I was hoping tape measure test is to pull out x inch length from the tape to see spacial awareness / if they know ish how much an inch is not if they can read the damn tape measure.  \n\nIf you can read a ruler you can read a tape measure and how the fuck can someone not know how to read a ruler",
            "More than a quarter of people can’t read an analog clock. \n\nAnd what % of Americans do you think can name all 50 stars, let alone their capitals, and point them out in a map?\n\nYou’d be shocked at how many people can’t pick out their own state on the map, or tell you the states that border it. \n\nThe US populace is made up of an exceptional amount of dumbasses. And our schools send these kids from one grade to the next regardless of how woefully unprepared they are to move on.  I can’t believe what our schools are churning out. It’s no wonder so many parents are putting their kids in private schools if they can afford it, or homeschooling them if they have the time.  The system is failing. From the teaching to the parenting. People need viable alternatives to the public school system, because all the taxes in the world and all the higher salaries aren’t going to fix what’s going on right now.",
            "That's not right. Back in the day, when did we learn to read a ruler? Grade 2?",
            ">cm to mm.\n\nWell, can you?",
            "Jesus. This is depressing. I went to cosmetology school 20 years ago and you bet we knew how to use rulers and measuring. It was a big deal. \n\nSo many clients think 1 inch trims are actually 3 inch haircuts. You have to constantly refer to the ruler on barbering combs to be clear. Otherwise, someone might cry. No one wants that!",
            "As an engineering student, that tracks. Alot of my fellow students couldn’t tell you what a crescent wrench was, or why any actual operator likes to call them universal bolt strippers",
            "Right, you need the skills for the job you  want",
            "As a hobbyist woodworker, I’m rounding up to the nearest 8th and planing that shit down. In this case 7 & 1\\2.",
            "I learned them but rarely use them. Also hate math especially fractions.",
            "is it something you can't teach on the job - I get wanting people to come in ready to work on day 1, but we keep gutting vocational education too in schools have at least a generation or two have been pushed to college, meaning I'd bet a large number of people have very little experience with their hands",
            "People would value education a lot more if they didn't need two jobs to survive. Or both parents working overtime just so they can eat and live. Don't get me started on daycare costs. It's multi faceted. Many, many things need to change.",
            "That's why I shell out for private school. I pay my taxes too so I don't want to hear shit about how I'm part of the problem.",
            "That depends, after working for my old state's Board of Regents, the amount of funding spent on public education actually goes to school districts already well off (we're talking upper echelon middle-to-high-class school districts). \n\nDon't get me wrong, there's plenty of parents that fail to live up to the ideal standard of parenthood. But a lot of struggling school districts receive so little in funding it's pretty much dooming certain populations to fail (plenty will make it out, such as myself, but I imagine if I didn't have the support network I did, I'd likely be a fast food worker or in jail because prospects were so bleak).\n\nIt's not so much a funding problem but \"Where is the money going\" problem tbh.",
            "Do you have a source for this claim?",
            "Black kids in Chicago get the same education as the white and Latino kids, they all have the same degrees.  The difference is what is going on at home, it's always been about the parents working with the kids and always has been.",
            "This!!",
            "Who would become a teacher except the dregs of college graduates?\n\nI'm one, and I've been doing it 12 years.  I will max out the salary scale within the next 10 years.    The pay is SHIT.\n\nI now believe it was the mistake of my life to choose this low paid, low status, bullshit career.  I don't know what the younger me was thinking.  WE NEVER GET RAISES.  We are underperforming inflation by about 20% and getting worse.  The job pays 20% LESS than it did when I started in 2012 because the salary scale is mostly static, does not adjust for inflation.\n\nWhst benefits are so great?  \n\nHealth insurance?  Every FT job gives that.  \nPension?  Its formula is based on a shit salary.  A better paying job with a 401k match will overperform our pensions considerably.  Summers off?  I have to work summers. I work as a bartender and an Uber driver to have some semblance of retirement.  During summers I go full time at those jobs.\n\nEver since 2020, our hiring pools went to complete shit and are often empty with ZERO qualified applicants. Young people figured out the con.  No one decent applies for these jobs anymore.",
            "Only a dumbass would become a teacher these days.",
            "Both sides can be true , I assure you both things are happening across America. ",
            "Passing and attendance. My kid was out sick and they made him sit in the classroom alone while everyone else had a pizza party with bounce houses for a perfect attendance party. Literally bribing/retaliating against parents to bring their sick kids to school ",
            "The highway system is one of our greatest achievements and created our ability to be the financial powerhouse we are. It is for sure (to me) not shitty, but I’m genuinely open to hearing why you think it is.\n\nI agree with you on military budgetary bloat… but that’s different than federalization “wrecking” it. The thing, national defense, would not be possible without federalizing the concept of the military. \n\nAnd what do you mean by “inefficient” in regards to the USPS. It makes sure packages can be delivered to any American no matter where they are… and at the same cheap rate regardless of where you live. No other service provides that. As far as carbon emission, I agree with you. But its private competitors aren’t any better, so the federalization of it isn’t what causes the high carbon footprint. The government has the ability to change that, for sure, but people who don’t want to spend tax resources for political reasons choose to slash the budget when we could be dealing with the USP’s greenhouse gas emission.",
            "Honestly i have no idea. One interesting thing is that there's more freshmen that total uni spots so freshman year is usually very hard to sort of weed people out. But college is practically free so idk.",
            "Thin margins my ass. Tight margins as the ceo gets 50M. See Boeing.",
            "You can see what the wages are in the blue States. McDonald's workers are making $20 an hour. \n\nLyft and Uber drivers are making even better than that. \n\nYou can bet that wages are going to skyrocket with Democrats",
            "Degree inflation is irrelevant to whether or not degree holders are better employees.\n\nSounds like you were definitely a shit boss.",
            "https://www.bls.gov/careeroutlook/2024/data-on-display/education-pays.htm",
            "I sincerely doubt it 😌",
            "I like how you responded to this but not people asking questions, Mr. Moneybags.\n\nLol at your comment history after his snark though.",
            "You pud. Three months disability retired from the navy. Gargling too much seamen you’re knees prolly gave out.",
            "What color is your Bugatti?\n\nI bet you have a landlord.",
            "Maybe not. And I wasn't specifically referring to you, but just life in general. \n\nNo matter how hard you work, no matter how early you get up or how late you go to bed, there's always somebody willing to do it even more.",
            "Noted, thank you.",
            "I can't read a ruler, I don't ever use one. I'm really good at excel though, I use it all day.",
            "Geography is a weird way to judge intelligence.",
            "Work in cybersecurity, finished calc 3 and some college level physics/chemistry courses, I can think at a high level. I can probably only name 20 states off the top of my head in a short time.",
            "Show me where Ohio touched you on the map",
            "To be fair, how often is it actually useful to know the names of the states by memory?\n\nI know many, but I mix up plenty in the Midwest if I’m not looking at names/map.\n\nDo you think someone dumb, because their brain holds knowledge of computers instead of states?",
            "Shouldn't they teach critical thinking, more than memorization?  Naming the states is something anyone should do, the capitals is more like useless trivia.  How gives a fuck lol\n\nWhat you should do is reduce the teacher to student ratio, spend way more time doing hands on activities instead of blah blah blah memorize this for the test.\n\nYou should probably move the kids from broken homes that act out and the dumb kids that hold the whole class back into some other class that is more suitable for them.",
            "Memorizing state names is absolutely a useless task.",
            ">More than a quarter of people can’t read an analog clock. \n\nI feel like this one is simply because it's outdated technology.  How often do you see analog clocks anymore?  It's like being disappointed that kids can't use rotary phones anymore.",
            "I can’t recall much about any of the flyover states off the top of my head. I know some shitty little mountains (compared to the Rockies) and the Grand Canyon are in there somewhere. But yeah I have a Master’s degree in computer science.",
            "Just multi by 10 ie 25cm*10mm/1cm= 250mm. Metric system is based on the power of ten, pretty simple system.",
            "I couldn’t tell you either but I’m in IT so I normally google what I don’t know and apply the knowledge. It’s crazy how we have the internet at our fingertips and no one uses the vast ocean of information to learn anything. It’s all for social media.",
            "Too many engineers design stuff without consideration of the people who have to work on it.",
            "Channel locks are my tool of choice for bolt stripping. Then I use a pipe wrench. Finally I use a sawzall to cut the miserable stump of a head off. Then I drill and tap it. Easy-peasy.",
            "I thats where they decided to draw the line.  They say 20 years ago they could hire workers off the street.  Now new hires dont know the names of the tools or how to use them.  Reading a tape measure is a minimum requirement",
            "Sure, but that is definetly not an excuse. \n\nIt takes very little time to \n\nA) ask about school\n\nB) see results (report card, call teachers) \n\nC) implement correction plan.\n\nMy parents would ask where my report card was, if I hid it or “didn’t have it” they would assume there was a bad grade on there (I mean duh). They would call the school and easily get it. Depending on my report card they would either let me do the things I want or not.\nUnder a B? No video games, sports, phone privileges until you get it up.\n\nThis entire process takes very little time and it lit a fire under me to get better grades. Having two jobs ( my parents did) is no excuse not to be semi active in your child’s learning.",
            "Depends on the state. Some states pump money to the bad schools and it doesn’t help.",
            "The high profile cases in Atlanta and oklahoma",
            "https://preview.redd.it/mhje7sgrmy7d1.jpeg?width=749&format=pjpg&auto=webp&s=199cf62c490e75588b1a4f8ab6068f9ffaea2059",
            "Baltimore is absolutely nightmarish on the returns theyre getting\n\nhttps://foxbaltimore.com/news/project-baltimore/in-baltimore-city-65-of-public-schools-earn-lowest-possible-scores-on-maryland-report-card",
            "Chicago public schools spend about 30,000 per pupil. They have the money \n\nhttps://wirepoints.org/illinois-per-student-spending-jumps-to-nearly-24k-cps-at-nearly-30k-wirepoints-quickpoint/#:~:text=Chicago%20Public%20Schools&text=CPS%20will%20spend%20nearly%20%249.5,just%20under%20%2421%2C000%20per%20student.",
            "You live in the wrong place.  Where I live L1S1 makes \\~$60K and it goes up quickly.  Every year you get another step and another raise.  The benefits are still good but not live they used to be, my neighbors are retired teachers and both have pensions in the mid $100K's.  2.5 months of vacation isn't too bad either.  the worst thing about being a teacher where I am are the parents and the administrator (who enable the parents).",
            "Outrageous!",
            "😂 what a weak attack\n\nI can agree that on the average, degree holders will outperform non-degree holders while also recognizing the negative consequences of degree inflation.  \n\nAnd somehow you think that makes me a bad boss 😂",
            "More bad analysis.  Your analysis is biased by the entire reality of degree inflation.  \n\nAll you proved is that more education means more money on the average.\n\nWell no shit, smarty pants.   Not the point.\n\nThe point is that people go into massive debt to get jobs that shouldn’t require a degree.  But since so many people have degrees, they get hired preferentially for the lower paying jobs as well.",
            "/yawn. Tough guy gotta rely on the reply and block like a little itch.",
            "You're welcome. Now go forth and conquer",
            "You were never taught how to use a ruler in school? I definitely used them in 3rd grade, can't remember if we started using them before that.",
            "Some of these people are broke, with little or no skills.  Getting turned down for an entry level job.  Its sad",
            "No, it a way to judge someone’s willingness and ability to memorize. Memorization is not intelligence. It’s data storage. Being able to utilize what you’ve learned in new and creative ways is intelligence.",
            "There’s no doubt people can go far without knowing much about  the basics.  There are probably doctors that can’t balance a checkbook or spell worth a good goddamn.",
            ">To be fair, how often is it actually useful to know the names of the states by memory?\n\nIf one works in logistics, knowing the difference between Ontario, Canada and Ontario, California may have some utility.",
            "Knowing geography is an example or proxy for being a generally educated person.  The particular information is not terribly important.  Being able to process it when needed, is.",
            "If you don’t know basic facts about the world you probably aren’t smart enough to do much of anything.",
            "Man. If only we had more teachers. Especially ones that speak languages other than English.  It’s a shame the cost of education is what it is. It’s one of the big barriers to having more teachers.  We have far more kids being born or otherwise entering the country than we have people endeavoring to be teachers.   The class sizes are getting bigger. Not smaller.",
            "No…it’s not. Nor is memorizing foreign countries or other things about them.",
            "I dunno. Most wrist watches?  Not everyone is wearing a digital watch. Even Apple’s watch has options for a traditional dial. \n\nI simply cannot believe people who attend class for 12 years with a click on the wall of every classroom they attend, can’t read a clock.",
            "Okay, that may have been for those two districts-doesn't mean it represents anything more than those 2 districts, though. Even for those 2 districts there may be a lot of missing context and additional contributing factors involved.",
            "My spending has nearly doubled since 2012 and quality of life has dropped.",
            "Why wouldn’t any student try on one of those standardized tests?\n\nIt has nothing to do with their GPA",
            "We’re allowed to curse on this website sir",
            "I was, never used it again though so I forgot. I can look it up online and figure it out no problem.",
            "It is an indication of curiosity too, like you've lived here for how long and don't know where California is?  I don't think you need to memorize every state, but to have some overall idea of how things relate is a good sign.",
            "Willingness and ability to memorize something everyone is taught early on. Along with math, reading, and science. \n\nGeography isn’t some bullshit subject without relevance.",
            "Yeah so then why do you take random niche examples and then go on to say Americans have a special kind of stupid? The outliers will always be loud and obnoxious, but the school system is still pumping out tons of kids eager to continue learning. Just because everybody doesn’t meet your criteria for being smart (which is apparently geography and time-telling via analog clocks) doesn’t mean they’re dumb.\n\nDon’t judge people by what they don’t know, you don’t know a lot of simple (to others) stuff just like I don’t.",
            "lol sure..\n\nDid I come anything close to suggesting “knowing the names of states is never useful”?\n\nClearly if Reddit is anything to go on, what schools need to focus on is reading/comprehension skills..\n\n(It was a rhetorical question, obviously knowing state names has use cases, but there aren’t many, so it was a bad example/call out in my view)",
            "Ontario Mills? Sounds like a foundry to me, ship it.",
            "If one worked in logistics they would likely know their geography a bit better by trade. \n\nI don't know all 50 to spout at a while but I could easily figure it out with just a paper and pencil. \n\nAs pointed out I think the problem is critical thinking for many. Our education system has been failing the country for years. Math and science is lagging so far behind\n\nDon't need geniuses to be service employeess",
            "In my opinion, remembering/knowing random facts that you might utilize is a waste of energy/time/effort\n\nConsidering a random piece of knowledge to be a “proxy for being a generally educated person” is flawed logic in the context of calling people “dumbasses” because they don’t know a particular piece of information.\n\nWhich is what I responded to.",
            "lol\n\nI’ve got 12 years of experience with IT System administration, and sometimes get to tell technicians from Microsoft and other well known organizations, things they don’t know yet.\n\nBut no, I can’t remember which states are exactly where on a map with no names, and I can’t tell you but a handful of capitals.\n\nThe only dumb people in this thread, are people who base intelligence on arbitrary knowledge of facts that may or may not matter.\n\nThe real test of intelligence is how much you understand, and how quickly you can adapt and learn new things when needed.",
            "I'm 45, am a vet, have a bachelors in tech, which became a career in tech, and at no point in my life have been able to label all 50 states from memory. In 4th grade I identified that as a useless skill and refused to learn it. \n\nWhat teachers don't tell you is that the point isn't to learn the 50 states (because it's truly a useless skill), but to teach rote memorization which may be useful to prospective employers. \n\nRote memorization isn't an indication of intelligence, and you probably shouldn't value it as highly as you seem to.",
            "I don’t have all 50 capitals memorized at this point in my life, it’s kinda useless memorization.  But literally this week I was using trig in code I am writing to calculate relative positions of objects based on their gps position and heading.    I make a decent six figure salary.  Im pretty confident I know the states but not the territories despite having visited a few of them.",
            "Corrupt school boards seem to be highly corollary. Higher pay didn't elect higher qualified members. More funding somehow gets soaked up by administration while teacher pay is still low.",
            "In my region the city school district has both the highest per-student spending and the worst performance when compared to the neighboring suburban districts.\n\n\nHowever, the city school system has a lot more ESL teachers, free lunches, and the like to pay for because the students come from poorer families and have less access to early interventions.",
            "Stop using that common core maths!",
            "It’s a fucking ruler. You don’t even need to know how to use it… it just is what it is. I can’t even comprehend what you are saying.",
            "It's pretty simple, it's basically a stick with numbers written on it. The numbers denote distance usually in inches or centimeters",
            "Numbers in inches.\n\n1---2---3---4---5---6\n\nHow many inch/es is the word \"How\" in your screen\n\nBro are you really telling me you need to Google that?",
            "Indication of curiosity in 1 hyper specific domain that is pretty irrelevant.",
            "Never said it was.",
            "They are a special kind of stupid. Look at where we rank in major subjects. Look at what the average reading and math scores are relative to grade level. And we don’t hold these kids back, either.",
            "Has some use?  Yeah. Like being able to know where someone is talking about when they reference whatever state it is you know nothing about.",
            "A \"dumbass\" in this case would be someone who could not process geographic information when they needed to.  \n\nI don't know the geography of Indonesia off the top of my head.  But if my company assigns me to find the best place in Indonesia to place a manufacturing facility, I will need to become fluent in its geography pretty quick, or else be a useless employee.  I'll need to know how to read different kinds of maps to get started, etc...",
            "Unions in a nutshell",
            "Fractions and percentages are the bane of a lot of people's existence.  Not mine, but I see it more often than you'd think.  But college won't fix that either.",
            "I can't read the 1/16th or 1/8th off the top of my head.",
            "I can't read the 1/16th or 1/8th off the top of my head.",
            "Yeah, the details you’ve mentioned?\nI’ve had brought up in conversations maybe 10 times over 30 years? That I can remember anyway.\n\nAnd I can’t remember any mattering if I could google it vs remember lol\n\nYou’re just trying to make it sound super important to know something, that is just no longer super important to know (unless you’re around judgmental pricks like yourself I guess?)\n\nLike.. glad you memorized Wackos state capital song..\nI’ve got google for that..",
            "but only if they're from the capital? lmao\n\ndumbass",
            "Not having a bunch of factoids about the Capitol of Connecticut or w.e does not imply you can't \"process geographic information\"",
            "Non union teachers are paid even less.",
            "Yep that is what unions do. They result in lower wages. Oh wait that is in fact the exact opposite of what unions do. Union employees make more than their non union counterparts in most fields. [https://www.afscme.org/blog/the-union-difference-in-wages-18-higher-pay-if-you-belong-to-a-union](https://www.afscme.org/blog/the-union-difference-in-wages-18-higher-pay-if-you-belong-to-a-union)\n\n[https://aflcio.org/formaunion/collective-voice](https://aflcio.org/formaunion/collective-voice)\n\n[https://www.bls.gov/opub/ted/2020/nonunion-workers-had-weekly-earnings-81-percent-of-union-members-in-2019.htm](https://www.bls.gov/opub/ted/2020/nonunion-workers-had-weekly-earnings-81-percent-of-union-members-in-2019.htm)\n\nYou are literally spewing nonsense just shut up."
        ]
    },
    "Lax Antitrust Enforcement Imperils the Security of the Nation’s Supply Chains": {
        "title": "Lax Antitrust Enforcement Imperils the Security of the Nation’s Supply Chains",
        "score": 29,
        "url": "https://logisticsviewpoints.com/2024/06/17/lax-antitrust-enforcement-imperils-the-security-of-the-nations-supply-chains/",
        "content": "",
        "num_comments": 2,
        "comments": [
            "r/FluentInFinance was created to discuss money, investing & finance! Join our Newsletter or Youtube Channel for additional insights at www.TheFinanceNewsletter.com!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FluentInFinance) if you have any questions or concerns.*",
            "“ A whistleblower sent a 34-page memo outlining all the production quality problems. The FDA didn’t do anything about it.”\n\n\n\n“That company, Abbott Nutrition, remains one of the largest infant formula manufacturers. “Nobody from that company was sent to prison. Nobody was fired.” Yet this factory – a factory supplying one-fifth of the US’s baby formula – was being run “in completely unsanitary conditions. That’s what you get when you have unchecked corporate power,” Schlosser reiterated.”\n\nThere is a clear contradiction between these 2 paragraphs.  The government, the FDA, dropped the ball."
        ]
    }
}