{
    "Self-Promotion Saturday": {
        "title": "Self-Promotion Saturday",
        "score": 2,
        "url": "https://www.reddit.com/r/flying/comments/1dls9he/selfpromotion_saturday/",
        "content": "Do you have a Youtube channel, Instagram account, podcast, blog, or other social media thing you'd like to promote?\n\nThis is the time and place!  Do remember, though, that [rule 2 (\"keep it relevant to pilots\")](https://www.reddit.com/r/flying/wiki/sub_rules#wiki_rule_2) is still in full effect.\n\nMake a comment below plugging your work and if people are interested they can consume it.",
        "num_comments": 0,
        "comments": []
    },
    "Passed ppl checkride": {
        "title": "Passed ppl checkride",
        "score": 198,
        "url": "https://i.redd.it/d6hm3ecl438d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Well done !",
            "Congratulations",
            "Just FYI, not sure if you care but you've doxxed yourself. If you zoom in you can definitely read your name.",
            "Hi fellow Rainier person!  And congrats!  Now get an instrument rating in case it ever rains here again.",
            "Big congratulations. Any experience you can share? Mine is coming up in a week.",
            "Nice!!",
            "Congrats! What did you learn? Who will your first passenger be?",
            "Fuck yeah, good job brother.",
            "Hell yeah. Who's your first passenger going to be? (Don't count the DPE lol)",
            "Insane username lol thank u"
        ]
    },
    "Smashed a 912i against the runway": {
        "title": "Smashed a 912i against the runway",
        "score": 114,
        "url": "https://www.reddit.com/r/flying/comments/1dlgek0/smashed_a_912i_against_the_runway/",
        "content": "I figured you guys would enjoy such a story for the luls\n\nI am a student pilot, training for my PPL and on my checkride before my first solo, I smashed the plane against the runway\n\nI fly a Petrel 912i which is an argentinian aircraft (a cheap version of a 152 basically) and its flaps lever is like a handbrake in the center (important detail). The story is as so:\n\nIt had stormed for a whole week and the academy is on a dirt runway. Due to the mud, only 1/3rd of the runway was available. It is a very long runway when 100% and it wasn't very short at 1/3rd either but regardless, I had to land super slow with 3pts of flaps and brake as soon as possible. \n\nAnyways, I land with 3pts of flaps with idle power and touch almost at the start of the runway and in the center but I was too fast and bounced back up. As soon as I feel myself back in the air, I communicate that I am aborting the landing and push full power and at the same time, I push right rudder. \n\nHere is where shit happens lol, my brain switch to car mode and I thought I was releasing clutch and pushing throttle........and removed the \"handbrake\"\n\nthe plane fell like a meter from the air and HARD, my instructor was pale white and yelling \"WHAT THE FUCK ARE YOU DOING\" and after smashing, I immediately get airbone again (full throttle from before) and I was terrified to look at my instructor in the eye lmao\n\nSo I get back into the circuit, got my ass handed to me, land properly, and when we park at the hangar, the next student was there waiting. \n\nI was silent with a blank stare and my instructor told her \"check the landing gear thoroughly\"  She asked \"what did you do???\" and he jokingly says \"don't ask\". A few seconds later, she turns around (she was heading to do the preflight check) and yells \"it better be dead!\"\n\nMy instructor and me had a good laugh of it. Of course I failed and was denied the solo but luckily we both walked away and there was no substantial damage done\n\nso yeah, don't release all 3 points of flaps dangerously slow and low lol",
        "num_comments": 28,
        "comments": [
            "this is actually my landing technique",
            "This one time my instructor and I were practicing engine out procedures and I had my landing spot picked out but I wasn't going to make it in the current configuration so I dumped a notch of flaps to increase my glide distance and my instructor was like \"huh, I've never seen someone do that before, but it worked! Typically you just keep the flaps full once they are put in.\"",
            "In one of the 172's I fly the spring loaded flap lever is broken, so there's no spring and it just clicks up, off, down. Super hot day, very high DA, During a touch and go I hit the flaps up and instead of neutral I accidentally pushed them down and had full flaps about 100 AGL after takeoff and started dropping like a rock until I got the nose back down and realized flaps were back down.\n\nSuper unnerving that close to the ground when not expecting it at about 9k DA in an old 172. Got that awful sinking feeling in my stomach for a moment lol. Luckily I did not hit the ground, but I quadruple check the flap lever in that specific plane now.",
            "I've done it too, during my PPL training, solo flight, did either a touch and go or a go-around and went from full flaps to zero when I was like 100ft AGL. Plane dropped a good 20 ft and I puckered so hard a diamond came out of my ass. Quickly learned to never make that mistake again - if you're airborne, don't work up flaps until you have speed and altitude.",
            "Que boludo! 🇦🇷",
            "yeah, do some go-arounds on your couch:\n\npower, altitude, 1 notch of flaps\n\npower, altitude, 1 notch of flaps\n\npower, altitude, 1 notch of flaps\n\npower, altitude, 1 notch of flaps\n\nover and over until it becomes muscle memory.\n\nYou can also do spin training the same way --\n\npower off, ailerons neutral, opposite rudder, elevator nose down\n\npower off, ailerons neutral, opposite rudder, elevator nose down\n\npower off, ailerons neutral, opposite rudder, elevator nose down\n\npower off, ailerons neutral, opposite rudder, elevator nose down\n\nuntil it takes less than a second for it to kick in",
            "Had a similar experience a few days ago. Came in for a landing with two notches of flap and started balooning a bit due to excess airspeed. Decided to go around and put in full throttle. Was about to reduce one notch of flap but dumped them all at once accidentally. Dropped about a 100 feet all of a sudden but was luckily high enough to recover without incident.\n\nIf we were any lower, would have slammed into the ground and crashed. Saw firsthand the effectiveness of flaps and learnt a lesson I'll never forget.",
            "i thought the mantra was \"any good landing you can walk away from, and any great landing you can use the plane again\"",
            "How much is a new one?",
            "Cosas que pasan! Muy bueno, todo sirve de enseñanza!",
            "the Ryanair signing bonus check is already in the mail",
            "I know someone that just did that getting cirrus training in their brand new cirrus and they were not s student pilot. Dumped the flaps on a go around and dropped out of the sky and smashes the gear to hell.",
            "The headline had me expecting at least a prop strike. Thanks for the clickbait.",
            "How else would SWA drop a 737 on the numbers and make the first turn off?",
            "That's what happens when people learn to fly by numbers without understanding how your control surfaces actually work.  Great job thinking outside the box and using your control surfaces actively to achieve your needs.",
            "I would imagine this works best at full flaps and may be acceptable (in a Warrior, for instance) at the second notch as well. I’d be more hesitant to ditch the first notch.",
            "I think the sensitive thing there is you have to pitch down at the same time for more airspeed. by dumping flaps, you could be putting your slow flight plane into a stall",
            "> In one of the 172's I fly the spring loaded flap lever is broken, so there's no spring and it just clicks up, off, down. Super hot day, very high DA\n\nJesus man, that reads like one the intro to the Air Safety Institute Accident Case Study vids. \n\nDoes it not need fixed? That could actually kill someone.",
            "That needs to be fixed. If it's left up on accident, it could burn out the flap motor.",
            "man la frase original fue \"QUE MIERDA HACES, ANIMAL!\", estaba re caliente ajajajajj\n\nno sabes el CAGAZO que fue, sentia que iba a atravezar como lanzas el tren de aterrizaje\n\ndespues una vez en el suelo, unos amargos y nos cagamos de risa",
            "Se emocionó tanto con el partido de ayer que quería ir a conocer a Maradona",
            "By landing 7 miles before the approach end and blaming scheduling",
            "If you're pitching for best glide and not short final, you can afford to lose some flaps without being at risk of stalling.",
            "Yeah, that's a _control surface_, for chrissakes.  \"Oh well sometimes the yoke just pops off the shaft and you have to wedge it back on lol\"",
            "Yeah dude, I don't know. I'd figure they would want to fix it. It won't go flaps down without user input because it still clicks into place, but it really caught me off guard since they take essentially no force to push down.",
            "There is no flap motor.  He said it's a handle, so that means it's an early model 172.  \n\nThe spring is part of the system.  If it's broke, the system is broke and therefore the plane is broke.  I would have words with the mechanic okaying it.",
            "Hey when your duty day is up you have to stop flying that's the law",
            "I know they said handle, but the rest of the wording (and description of their experience) makes me think they meant to say flap switch."
        ]
    },
    "I failed a 141 stage check in 2006 but my school has zero information on my time there (I called asking for my records because I lost a log book). Do I need to report this for an airline job?": {
        "title": "I failed a 141 stage check in 2006 but my school has zero information on my time there (I called asking for my records because I lost a log book). Do I need to report this for an airline job?",
        "score": 61,
        "url": "https://www.reddit.com/r/flying/comments/1dlhong/i_failed_a_141_stage_check_in_2006_but_my_school/",
        "content": "Obviously I don't have much against reporting it--it was a long time ago and I was a dumb kid but I'm curious if it's expected or even asked for.  Have started finishing up my ratings recently as I'm nearing retirement from ATC",
        "num_comments": 21,
        "comments": [
            "Whether or not they ask for it comes down to...well, whether or not they ask for it. \n\nSome applications specifically call out 141 stage checks, but not all. Some will ask if you've failed *any* checking event. Read the questions carefully. \n\nWhen in doubt, err on the side of disclosing it. \n\nFailing a stage check nearly 20 years ago is a nothing burger.",
            "They might not find it, but if they do you’ll lose a potential job over something they most likely don’t care about anyway other than the honesty aspect. This is if they ask about training failures and not checkrides specifically.",
            "Just tell them and say you have no record of it. They won’t care. If you fail to report it and they find out you knew that’s far worse",
            "During my piedmont Interview they asked if I had any stage check fails and I honestly can’t remember because its nowhere near as significant as a checkride but if they wanted the records I could rummage through the schools basement to find out.",
            "They probably couldn’t care less if you report it. But they’ll care a lot more if you  don’t and they find out.   It will be a good talking point for 30 seconds in the interview where you can turn it into a learning experience and then that will be that.",
            "Stage checks don’t go anywhere on your record except your school’s. It’s not part of the federal database. Only official checkride are. And if the school no longer has those records? Oh well.",
            "You can find your PRIA on the faa website somewhere and check",
            "If they don't ask about it and you didn't put it on anything oh well. If you don't put anything on your app and they find out expect to be blacklisted and have your cjo revoked. Why risk it? Have a humble reason for the failure and explain what you learned from it. Alot of pilots have at least one failure anyways.",
            "There is no need to guess. Submit for a copy of your PRD/PRIA records. The only things you need to disclose training wise are the things that show up on there. The only things any employer cares about are what verifiable records you have. After you making a smoking hole in the ground with one of their airplanes and the courts and media dig up your information. They don't want to be blindsided by your past. So again, they really only care what is actually on your record.",
            "They're not going to care, but answer the question you are asked. Some airlines ask for \"any training failures\". Some just ask for checkride failures. \n\nWhether or not to disclose something in aviation never comes down to whether or not you think someone can find out the truth some other way. Always just answer the question you are asked truthfully. You may or may not be asked to disclose it. That should be what determines whether or not you do.",
            "Always err on the side of more disclosure vice less. Almost all of us have a failure of some variety in our training past. Having a coherent answer about how you positively responded to the failure is way more important than having a spotless record.",
            "Well another reason to stay away from 141's",
            "I would only disclose whats on your pilot record database (thats on there for life) and what you failed only 10 years ago or less, i.e training events. As it’s against the law for airlines to hold onto training records for more than 10 years. This opens up for liability and lawsuits. Then again training events are in the PRD as well. \n\nStage checks from 20 years ago from 141 do not need to be reported. The only way they could find out you are “lying” is because you recorded it in your logbook and they found out thru a logbook review, as your school has no record on it.\n\nHope this helps :)",
            "This is why you keep up with your entries when you submit your medical..",
            "Ok that's kind of what I figured.  Plus I still remember the exact scenario and what I did wrong, the plane I was flying and the approach I was being cleared for 🤣\n\n\nProbably makes a strong anecdote about self improvement and humility",
            ">Failing a stage check nearly 20 years ago is a nothing burger.\n\nFor real. Especially when you spent that 20 years as a controller. I’ve never been on a 121 hiring board but that’s gotta be like crack to them. \n\nOP: “I failed a 141 stage check, then I spent **20 years** in ATC, then I got the rest of my ratings and flight time.”\n\nAirline: “You’re hired”",
            "It is perfectly reasonable though that someone could forget they failed such a minor training event 20 years ago. Especially after they pursued a different career entirely.",
            "My understanding is they care more about the fact you're willing to learn than that you failed a single event. They don't want you to be all defensive over it, in my interview I think one of the interviewers was assigned \"bad cop\" if you will, and they kept asking probing questions about my failed flight. I think he was looking to see if I'd get defensive or if I'd try and explain it purely from a \"this was my fuckup, here are steps I did so it never happened again\" perspective.\n\nI answered everything honestly and politely and got hired.",
            "Doesn’t seem like this person forgot though. I don’t care what you put on your application so feel free to try to “forget” things lol 🤷",
            "It's likely more than that, accountability is key but not every needs to have \"fucked up.\" But you do need to be able to be in touch with areas you have a harder time with and have insight as to why it is challenging for you. \n\nI interview people for non flying jobs and the same thing is expected for those jobs too, the what did you do wrong questions are the most important followed by a difficult situation and how you worked to resolve it. The point is those questions are easier to read through the person you are hiring. Sure the person rehearsed that question too if they were smart but you get some insight as to *what* that person sees as a significant mess up and did they kick themselves for it and stagnate, did they resolve it and move on, did they brush it under the rug, or did they give the \"obvious\" response they think the interviewer wanted to hear."
        ]
    },
    "Spokane/CDA/Missoula Folks: Dr. Mark Manteuffel is Gone": {
        "title": "Spokane/CDA/Missoula Folks: Dr. Mark Manteuffel is Gone",
        "score": 53,
        "url": "https://www.reddit.com/r/flying/comments/1dlij41/spokanecdamissoula_folks_dr_mark_manteuffel_is/",
        "content": "Friend dropped by in person to deliver the news -- he's the AME for a lot of us in this area -- I did a consult with him, and he's been my friend's AME for decades now. Unfortunately, he's gone. It seems he was taking a trip with a friend in said friend's helicopter, and they both perished at the scene of the accident. [https://www.spokesman.com/stories/2024/jun/20/two-spokane-area-men-identified-in-fatal-helicopte/](https://www.spokesman.com/stories/2024/jun/20/two-spokane-area-men-identified-in-fatal-helicopte/)\n\nLeaving behind a big hole in the community up here. He was a good one. Hopefully it's blue skies and tailwinds in the great beyond.\n\n  \n\n\n\n\n",
        "num_comments": 6,
        "comments": [
            "Oh... God... that's just awful news.",
            "He was such, such a good bro. He was the only HIMS in the area and is the reason I have my medical at all. I’m kinda lost on what’s next now. \n\nBut seriously, he was a great human. His daughter was his secretary and is also super sweet. I feel horrible for his family.",
            "Very sad. My heart goes out to everyone affected!",
            "This is terrible, one local professional pilot was killed last week, and now our AME.  I had flight physical in January, Mark was as evenhanded and fair as ever.",
            "I only interacted with him long enough to get my medical, but he seemed like a really cool dude. A friend of mine worked with him at the hospital and he was very well liked as an ER doc too.",
            "It really is. He was, as I understand it, a really even-handed AME."
        ]
    }
}