{
    "Excited for the new Amazon Fallout TV Series? So are we, but please use /r/fotv or /r/fallout, as the series itself is not about Fallout 4": {
        "title": "Excited for the new Amazon Fallout TV Series? So are we, but please use /r/fotv or /r/fallout, as the series itself is not about Fallout 4",
        "score": 313,
        "url": "https://www.reddit.com/r/Fotv/",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Fallout 4's visuals have aged like a fine wine": {
        "title": "Fallout 4's visuals have aged like a fine wine",
        "score": 260,
        "url": "https://www.reddit.com/gallery/1dlq6c1",
        "content": "",
        "num_comments": 24,
        "comments": [
            "For a game that came out in 2015 it definitely isn't bad.  \n\nIt's looking a bit outdated graphically sometimes but holds up nicely.",
            "Art direction can go a long way. The only thing I downloaded was a lite grass mod to add a tiny bit of green and wow, such a small mod went a very long way.",
            "Yeah, a really pleasant game to look at for sure, especially with the god rays. Good art direction too!",
            "Held up better than Skyrim",
            "The materials work and natural lighting is on point. It is just the animations and LOD management that’s hurts it. I had a mod that put everything to ultra, and I never notice pop in until now, because of the dumb update I can’t access my mod menu anymore to re-enable it. And I got to tell you, I didn’t realise how diabolical the render distance was.",
            "Wait, which pistol is that?  Snubnosed with tactical sight?",
            "Aged better than Starfield",
            "For me it holds up fine. Sure it’s not amazing but it doesn’t take away from the experience or immersion",
            "wish my PC was strong enough to handle enb presets. this game can be pulled apart and put back together to look truly phenomenal. base game looks *good* sure, but modded it’s amazing.",
            "Any mods ?",
            "The only NPC that looks good is Nick Valentine, the rest are typical Bethesda fare.",
            "i feel like fallout is stylized enough for the lighting to not age as much as hYpEr ReaLIStiC shOoTErs",
            "Well if your graphics were still bad anytime after 2010 then that was a fucking skill issue",
            "I like to call it my \"comfort graphics\". It's not too old and rough but also it's not too modern that it's anime-esque or going to uncanny valley territory.",
            "I ran one that just changed the foliage and grass that's already in the game to green instead of brown, but didn't add anything. It was perfect.",
            "To be fair, it did come out much later than skyrim.",
            "Which rendition? Vanilla? EXTRA? Pro Pack on the Switch? Ultimate 5 year Anniversary Bethesda Celebratory Hype game marketing version?",
            "Looks like Kellogg's gun judging by the barrel",
            "Exactly! 100% agree.",
            "It’s November in my play thru so I’m looking for a good winter mod.",
            "A whole 4 years.",
            "Kellogg’s gun is just a legendary .44 Revolver",
            "Seasons Change has an incredible winter, I'd imagine you could freeze the date but I'm not sure.",
            "Huh, I thought it was unique. But I don't think I've ever modded a regular .44 pistol",
            "Thanks for the suggestion. Is it on PS5?"
        ]
    },
    "Anyone else always see these and confuse them for holotapes? I stop by every time I play and they still get me.": {
        "title": "Anyone else always see these and confuse them for holotapes? I stop by every time I play and they still get me.",
        "score": 289,
        "url": "https://i.redd.it/svw145eym28d1.jpeg",
        "content": "No clue what they are supposed to be but always gets me!",
        "num_comments": 28,
        "comments": [
            "Yea same happens to me",
            "All the time. I see one and I become activated.\n\nI think it's supposed to be a crushed cigarette carton, but not sure. Very mysterious.",
            "I wonder if there is someone who didn’t mistake them for a holotape at least once. :))",
            "Yup!  There is literally a mod called Holotape Tease fix or something lol",
            "im sure they did it in purpose",
            "How many times is this going to get posted?",
            "All the damn time",
            "ALL THE TIME",
            "Im glad im not alone",
            "I've read about this a few times lately, apparently there is a mod to get rid of it. Although I can't find the link 😕",
            "The trash always gets me",
            "Holotapes? No. Advanced targeting cards? Yes.",
            "I actually almost hissed a holotape that got knocked off a desk by an explosion because I didn't want to get fooled again, lol.",
            "Same,\nEspecialy in settlements\nI drop things....",
            "Every. Single. Time!!",
            "Must be Saturday, this is posted again",
            "Can we make a separate subreddit for these posts or something?",
            "I think they did this on purpose to troll us 😭",
            "I was mostly over it... Then this playthrough I've started to find fusion cores on the floor. So now I keep seeing the yellow and it grabs me for a sec.",
            "How many \"wood I&D\" have I picked up before I realized it is not any for of ID",
            "All the time",
            "Thankfully, there's a mod for that. https://www.nexusmods.com/fallout4/mods/6731/",
            "I’m switching back and forth between this and Starfield and it’s driving me faking crazy between this and “things” on the ground that look like slates but are really just a part of the floor",
            "Every time",
            "I'm confused every time I see people take photos of thier screen, on platforms with dedicated screenshot buttons.",
            "You are correct yeah, it's a cigarette pack",
            "Yeah [here](https://www.nexusmods.com/fallout4/mods/6731/)!",
            "I've seen at least 3 different posts this week."
        ]
    },
    "What's with the golden gate bridge in Kelloggs memories?": {
        "title": "What's with the golden gate bridge in Kelloggs memories?",
        "score": 1235,
        "url": "https://i.redd.it/cv6l5rha808d1.png",
        "content": "",
        "num_comments": 140,
        "comments": [
            "San Francisco Sunlights. Hmm, interesting brand.",
            "A big part of his backstory takes place in San Francisco. There are nice little throwbacks/references to Fallout 2 and everything.",
            "The bridge has collision. If you're on PC you can TCL over there and walk on it.",
            "He's from the west coast, the radio transmission you hear in his memories talks about his settlement/town/raggedy shack, voting in favour of joining the New California Republic, later when remembering about the job he had to maintain his wife and baby he mentions that he's working for the Xi that are located in California and are a throwback to the og Fallout, which is also the point where you see the Golden Gate from one of the windows.",
            "Kellogg is from the West Coast near San Francisco as evidence by him saying things about the Hub",
            "San Fransisco",
            "It's a Fallout 2 reference. Along with him mentioning his time with The Shi.",
            "Maybe it’s in reference to Kellogg being in San Francisco at some point lol",
            "I have to wonder If this will be the location of Fallout 5. Bethesda loves to tease the sequels of their games.",
            "..... San Francisco",
            "It's because he's from California.  He grew up in the NCR.",
            "Can you imagine how amazing an adventure a cross country trip would be in that world? I realize it's just too much for a game to handle but I mean you can't even go from one end of a town to another without fighting through 3 war zones. Crossing the wasteland of the entire country including two mountain ranges? \n\nThat would be amazing.",
            "Plenty have mentioned here that Kellogg is from the sanfransisco area, but something I never noticed before is what good condition the golden gate bridge is in his memory. Was it never bombed? Repaired? Did Bethesda not put as much thought into this boring throwaway section as I am? Who's to say",
            "San francisco",
            "Kellogg came from California. If you listen to the radio in the first memory, it brings up the NCR.",
            "You should play Fallout 1/2 sometime",
            "Fallout 5 in San Francisco CONFIRMED",
            "It’s Kellogg’s Golden Gate Memory Grahams",
            "Fallout 5",
            "The memory is in san Fransisco?",
            "He's from San Francisco, duh",
            "That mission is one giant mindfuck.",
            "This is Bethesda saying fallout 5 is going to be in San Fran\nIf WW3 doesn't happen first",
            "Kellogg grew up in the fledgling NCR and left his hometown and first stop on his lifelong road trip was san fran. He was a hired gun and did work for the Shi and others and seemingly had built a quality life for himself and his family as he was well respected and good at what he did. well ig he screwed over his employer/employers and they killed his wife and infant daughter and he went john wick mode and killed them and left town and over probably the course of a few decades to 50 years he meanderd across the country becoming more cruel and heartless woth every mile and job and eventually started working for the institute, i think this guy is like 105 ish years old because SCIENCE.",
            "Bro just listen to the story and what he has to say, would’ve taken far less time than this post, or even google",
            "He was a big fan of Full House... Until the bombs dropped.",
            "Question is hi it’s still fully intact",
            "Lots of references to San Fran…",
            "The voice that taunts Kellogg when his family dies sounds familiar, does anyone know who that might be?",
            "Ncr",
            "It's weird that it doesn't have a space shuttle. maybe the hubs really did go to space and forget about Oxigen...",
            "That’s where he lived",
            "There's Also A Random Call Button Floating Out In The Void",
            "He's from San Francisco",
            "This mission was so cool 🤯",
            "It's memory he has of the golden gate bridge. Genius. 💁",
            "Next game location.",
            "Kellog was a Christian, His gun was kind of cool though.",
            "Oh damn I didn't even get that. Good catch!",
            "GREAT brand! IFYKYK",
            "I could use a cigar about now!",
            "Ohh that makes more sense, thank you!",
            "And Fallout 1.\n\nKellogg was a kid before the events of Fallout 2 and the radio mentions that Aradesh was still president.",
            "I bet somebody made a mod and placed it somewhere on the map.",
            "pretty cool, never knew. 👍",
            "I wonder why they gave it collision when you were never supposed to even be over there? Or why it has a fully plotted 3D model if it was just supposed to be background imagery? \n\nReminds me of Fallout 3 if you TLC to get up on top of the lookout area above the entrance of Megaton and the watchman, I think his name was Stockholm, asks, \"How did you even get up here?\"",
            "I had the **Rocket Ring** Mod on console and it freaked me out when I jumped over to it. It's way bigger than I expected.",
            "On Xbox too, there are mods for disabling collision and walking over there.",
            "He is from the west coast. There are references to Fallout 2, and there's a radio broadcast about his town voting to join NCR. He also spent time with the Shi, a society founded on the coast by chinese submarine crews.",
            "They already released the game that was teased in 4, Vault 76 is flat out mentioned by name in the beginning of the game, the bridge being there is just to further reiterate that Kellogg is from California",
            "Maybe. I can't wait to play it 25 years from now.",
            "Another one is to follow Cabot. He says he’s headed to the Mojave to find another lead on an artifact.",
            "I’m gonna bet they go with somewhere that hasn’t already been featured in two games",
            "It's a location in 2",
            "Bethesda seems to be fixated on the East coast for Fallout.\n\nEdit: What could I have possibly said to offend you?",
            "IIRC the original idea of Fallout 4 was traveling from New York to Boston in search of the Institute",
            "A linear Fallout game, or maybe hybrid open world/linear a bit like Metro: Exodus, (but more Fallouty, ofc.) Would be interesting. I see it more like a DLC, but could still be neat.",
            "I’m gonna be real with you, I love FNV to pieces and if that game tells me anything, it’s that walking through irradiated, post-nuclear, Nebraska would not remotely be my idea of a good time.\n\nIt might be a decent option for a fallout themed sleep aid though.",
            "It'll definitely be impossible with the current ancient game engine that Bethesda uses. But there's a chance that it could be possible if it was to be set up something like eso with its map cut into different sections and used a game engine that wasn't majority outdated.",
            "I can imagine when SF became part of the NCR they put a lot of effort into refurbishing it as a show of strength or something. did the NCR ever incorporate SF?",
            "I mean the Shi are one of the highest tech factions in the wasteland, they might have fixed it.\n\nKellog’s memories might also be playing tricks on him, this is the first and last time he was happy.",
            "Headcanon: it’s just Kellogg’s rose-colored memory. If it’s still up, it’s an icon for SF, he remembers it fondly",
            "I'm guessing that last part, but the actual golden gate bridge does have rust proof paint n junk that would probably let it last much longer than most bridges. But yeah it'll definitely be in shambles after 200 years, it mostly depends on how close was it from where the bombs dropped in that area tho 🤷‍♂️",
            "Maybe its what the institute planted as memories in his brain, hence the good condition?",
            "And he says him and his wife were in San Francisco if you interact with him during this specific memory",
            "There was a Fallout .5?  I never knew!  Are the graphics any good?",
            "Drag Queen Raiders and mutated sea otters",
            "*mashes button to skip dialogue. Has no idea what's going on*\n\"This game makes no sense.\"",
            "And still red, shit shoulda rusted off decades ago",
            "Old game location.",
            "I didn't know he was from SF before this post. I just remembered that line. Lol.",
            "That’s not a “good catch.” Medium catch at best. Really a pretty easy catch.",
            "How is it a good catch when it’s literally a plot point?",
            "MY BRAND, for my special eyes",
            "It is your cake day be happy.",
            "I don’t recall doing anything recently, but I feel I deserve a smoke!",
            "The SEX settlements mods have one where you can just place an entire big ass bridge for some reason 😹",
            "I downloaded one that redoes Spectacle island and adds this bridge in next to Warwick Homestead.",
            "Laziness. Same reason why the model boats are downsized actual boats.",
            "tbf Vault 76 was also mentioned in FO3.",
            "I thought 76 Easter egg only came out after 76 release ?",
            "I'm assuming it's too much to hope that we will see an old Jack Cabot in Season 2 of the show. Imagine the fucking whiplash most people would get by introducing psychic-powered ancient aliens in the show.",
            "Shows heading east towards Vegas, I'd bet fallout 5 is going to be east of there, somewhere in the Midwest.\nChicago and Springfield have been done, but maybe there would be cool in 3D",
            "Redditors will downvote folks for saying water is wet.  Don’t take it personally",
            "A continuous map like that would be impossible in any game engine",
            "The Golden Gate Bridge is painted constantly because it corrodes so fast. I doubt it would last longer than other bridges. The Forth Bridge (a similar bridge in Scotland over the estuary where the Forth meets the North Sea) was painted continuously too until 2002 when they started using a glass based epoxy, and even that only lasts 20 years. The GGB would probably be rusted to hell in 200 years, regardless of bombs.",
            "Maybe the human maintenance team were replaced by a Mr. Handy crew?\n\n\nTBH I think it's partially shown in FO2 and is in a state of disrepair.",
            "It’s CGA.",
            "That would actually kick ass.",
            "Well, it is said that he was with the NCR, so it does have background that he traveled from West to East.",
            "As others have said Kellogg is from California and San Francisco. When the specific brand of cigars that he likes is San Francisco Sunlight's I just thought it was a random specific name just to give them some importance to the search, when actually the reason those cigars are that brand is because he's from San Francisco. I never caught that small detail until he/she said something about them.",
            "Look! Look with your special eyes!",
            "the WHAT mods????",
            "Great just as i suspected. 😂",
            "I gotta get those mods",
            "Wouldn’t it take more work to put collision on he bridge?",
            "Ive totally missed both of these mentions",
            "The true fallout experience",
            "I think it’ll be San Francisco because Todd won’t let anyone do anything with SF.",
            "Do you even “Death Stranding” bro!!!",
            "I mean I definitely couldn't be the *whole* map of America, but it definitely could be a lot bigger than past games",
            "Ahh okay, that makes more sense. Thank you",
            "That’s okay.  The Golden Gate Bridge already looks like it is covered in rust.  I assume that it’s intended, since they chose to use rust-colored paint",
            "The Mr handy thing would actually be pretty neat for a strange side question or something like that",
            "Yes, even though it went over your head doesn’t mean it wasn’t a plot point. It’s not a small detail. You literally search for that specific brand in multiple locations around the Commonwealth specifically to find Kellogg.",
            "I'm pretty sure they meant the SSEX mod - Settlement Supplies EXpanded",
            "the deathclaw dommy mommy cbbe lusty argonian mods",
            "https://www.nexusmods.com/fallout4/mods/1145",
            "They also have the broken huge highways you see in-game a lot and they take up like 50% of your settlements and are impossible to place without place anywhere mods 😹",
            "[it's here if you want it 👍](https://www.nexusmods.com/fallout4/mods/1145)",
            "I think I recall it being mentioned on a terminal in vaulttec headquarters, but just like a throwaway line. Definitely don’t know about a mention in 4 either tho",
            "I feel like Death stranding is something like 95% empty space though, since the point of the game is literally to travel from A to B. In Fallout games you are meant to get sidetracked and such.",
            "The brand of cigars that he smokes is not a plot point, you could swap out San Francisco Sunlights for Mississippi Sunlights and it would just be a different brand of cigars that you are searching for, the plot point would remain completely unchanged you are still searching for the brand of cigars that he smokes.. but that wouldn’t relate to where he is from and the nice small detail wouldn’t be there, however they chose San Francisco Sunlights as it’s a nice little detail that relates to his backstory. Detail not plot point.",
            "okay buddy",
            "Like just because someone likes Buffalo wings doesn't mean they are from Buffalo",
            "Who pissed in your sugar bombs?",
            "Why are you assuming only people from San Francisco can enjoy a brand from there? If someone smokes camel cigarettes, it doesn't make them a camel.",
            "Tell me you’re single without telling me you’re single.",
            "But there is a sex mod.",
            "Yea that one!",
            "link?? 👀👀",
            "Or in the terminal, while looking for the vault 87 location, in the citadel",
            "In 4 it is mentioned on the news broadcast in the intro. The news anchor says “Since debuting Vault 76 last year, in honor of America’s Tercentenary, Vault-Tec continues to expand with plans for well over 100 Vaults around the country.”",
            "Buffalo wings. Hmmm. Interesting brand.",
            "Or just like if someone likes French fries, it doesn't mean they're from France.",
            "Or better say, Sugar, who bombed you piss?",
            "What a braindead comment lmao",
            "Several.... or so I hear\n\n<.<\n\n>.>",
            "Yeah but I don't think they involve the golden gate bridge",
            "There's sex in the base game, too, but you're not allowed to see the action for yourself.",
            "Damn you’re right, forgot that one.",
            "Oh yea that part. All pretty inconsequential mentions honestly",
            "Allegedly",
            "Yes. I have also heard....",
            "👀",
            "Nah just the Eiffel Tower",
            "Close enough, that would be the golden gate b!tch.",
            "Vault 76 is also mentioned in the mothership zeta expansion for FO3. There's an audio log of an abducted assistant chief executive officer of Vault Tec who was inspecting the Vault 76 construction site at the time of his abduction.\n(Giles Wolstencroft).",
            ">Vault 76 is also mentioned in the mothership zeta expansion for FO3.\n\nTo give some potential credibility to people hoping/expecting 5 to feature San Francisco, the equivalent of this would possibly be Nuka World featuring the Hubologists.\n\nHubologists was an opposing faction for the Shi in Fallout 2. The Shi are in San Francisco and mentioned by Kellogg. Additionally, although less noteworthy, there's a Shi skin for some items in 76.\n\nI say it's likely but far from a guarantee.",
            "Damn, that’s a deep cut… Zeta is all a blur for me, never liked it much and think I finished it like one time."
        ]
    },
    "Every time I go to Rhys for a clear out mission I steal his clothes because he is rude": {
        "title": "Every time I go to Rhys for a clear out mission I steal his clothes because he is rude",
        "score": 1292,
        "url": "https://i.redd.it/cv56gn2u4z7d1.jpeg",
        "content": "",
        "num_comments": 97,
        "comments": [
            "Man, when you aren't distracted by how caked up he is in that Brotherhood Uniform you really notice how unfortunate looking his face is...",
            "Now reverse pick pocket summer shorts and a visor.",
            "r/FuckRhys",
            "I wish they would've done a few different dialogue for him as you completed cleaning the Commonwealth. Like after 10 missions doing the Lord's work for the BOS, maybe he starts to lighten up some. Then once I take Bunker Hill with them he's even cooler, might even like me some. Then when. I bring down the prydwyn and kill everyone in the faction he's back to square one",
            "OH NO HES HOT",
            "I always assumed he was secretly in love with me.",
            "A rude, nude dude always in a mood and got a ‘tude.",
            "P1:Pickpocket might be questionable for strategic purposes, but it definitely is hilarious.",
            "He’s helped thousands reduce stress and should be thanked for it. Having a bad day! Start of course with the fat man but then get creative. Junk jet, drug him with the syringes, flame on, baseball launcher. Go for the legs, five grenades. The fun never ends. Get a new weapon? Fast travel quick save try it on Rhys.",
            "Honestly though, unless you side with the brotherhood in the end. He's not exactly wrong about you, in his defence",
            "Can't you just \"eliminate\" the rudeness once all his missions are done?",
            "With that face, he reminds me of one of those sock puppet monkeys.",
            "*scribe haylen liked that",
            "Steal his clothes? Bah. Child's play.\n\n\nReverse pickpocket a synth component on him.",
            "I know a guy that looks just like that with the same douchebag jawline beard, It makes me dislike Rhys even more lol",
            "First person I’ve really disliked in this game.",
            "now now\n\nwe know that your posting this and claiming its coz hes rude\n\nbut you realy wanted to check out dat 8 pack hes packing and just see how buff he is\n\nno need to lie, we are not judging hear",
            "And then I follow him around… For reasons.",
            "lol i just quicksave and shoot the shit out of him whenever he says something rude, but i might do this next time",
            "So is he just always a dick? Or does he eventually warm up",
            "He is rude!  He gives you this half-assed apology after you're promoted to Sentinel and then goes right back to giving you missions with snark and attitude attached.  Grrrrr Rhys",
            "Fair",
            "I sometimes wish I could jail him like Clarke for Insubordination. \n\nIs there a mod for that?",
            "I do this for the Prydwen. Every visit nets me 3 new PA suits, around 4-6 cores, a dozen lasers and respective ammo.\n\nExcept I stealth kill every unnamed person instead of pickpocketing them.",
            "I punch him in the face every time I get a new mission. I turn in the old one, get a new one, listen to his rude and smartass comments, then deck him before going to Scribe Haylen.",
            "He looks like a monkey",
            "He’s the type of guy who refers to himself as a based gigachad.",
            "For the ultimate revenge, you could reverse pick pocket explosives to *take care* of him",
            "Sean Strickland?",
            "He may have a bakery, but he's a dick",
            "ahh pickpocket.. finally find a use for this perk.",
            "I do it for the boner fodder",
            "Beefcake Rhys",
            "He is nasty, I think everyone will agree, In FO3 you could sneak up on someone, put a live grenade into their inventory & blow them to bits.  Don't know you can in FO4 but it would be fun.",
            "Slip a grenade into his pocket (preferably nuclear)",
            "I believe you can punch him once or twice without him becoming hostile, if you are unarmed. But better save first, just in case. :)",
            "The only other that rivals his twat-ery is Marcy.\n\nYou'd think you'd end up hating the man that killed your spouse and abducted your child more, but nope. Not even close.",
            "any mods have clown hair toupees ?",
            "My , it is a little breezy in here ...",
            "He does have a spectacular ass, however.",
            "Killed this prick 3 x hoping if no one saw it wouldn't fail the brotherhood. As soon as I get the next achievement for them he's screwed.",
            "I swear everytime I go to talk to him he swings around to show me his ass, I'm at the point that I think it was intentional.",
            "Oh no he's hot!- me seeing this pic",
            "I hate Rhys. Worse than Preston Garvey, imo",
            "🤣 nice",
            "I do something similar with Preston Garvey except I git him with a 2076 series baseball bat",
            "I hate Scribe Haylen more. When i 1st talk to her that dialog I say Suits me fine, she says, You dont sound so sure. WTF? So hes a cocky Knight, I like that in a guy. And then I take a mission, and Haylen immediatly sandbox into me and bitch about me still being there. Its been only a split second since i got my orders. With Ryse I can take it, but from Haylen it cat fighting time. lol",
            "The zoomer mind cannot comprehend how to take a screenshot",
            "Agreed. Huge ass, bad face",
            "He's a butter face. Everything is perfect but his ugly ass face.",
            "The good ol butter face",
            "Dudes jacked tho",
            "I do that to Macready. Or a nice green summer dress. ",
            "🙏",
            "With that face?  Unlikely",
            ":(",
            "I love that I immediately read that in Squidward's voice",
            "That has to be the worst profile picture I have ever seen.",
            "I’m glad I’m not the only one. Boy being super rude… yeaaaah u like me. :3",
            "But it’s rude to say it out loud. That makes me go from scavver to executioner.",
            "If you kill him you are immediately made an enemy of the Brotherhood, even if undetected.",
            "They are radiant quests, they repeat forever.\n\nHe does change after you become a sentinel and talk to him... but right after that conversation he goes back to his usual behaviour.",
            "Right!!",
            "I’m millennial and prefer to just whip my phone out",
            "My high school nickname \n\n\n\n\nAnd college \n\n\n\n\nAnd middle school before that \n\n\n\n\n\n\nAnd what my neighbors call me",
            "Big ears",
            "Women without makeup",
            "nein, just a bad actor with blowup muscles",
            "But that bod tho",
            "whats wrong with it",
            "I mean yea it's a little rude. But I went on to kill all his buds and blew up there air, with children on it",
            "I don't mind a little rudeness. \n\nHe doesn't attack you, stab you in the back and you're safe to rest inside the police station with him around. \n\nHe can be snippy and suspicious all he wants. \n\nGiven a choice between his attitude or that suicide bomber super mutant that I can hear but can't find until it's too late... \n\nThe choice is clear.",
            "Tech illiterate behavior tbh.",
            "I'm sorry McDonaldsSoap",
            "I never wear make up, I am naturally beautiful, just ask me and I will tell you so.",
            "It makes me incredibly uncomfortable",
            "I find it funnier to upload a shitty image",
            "You've peaked my curiosity",
            "You know it's a joke right",
            "Whats wrong with a Squickenster ?",
            "There is always an excuse. \n\nMany such cases.\n\nI would simply just post a screenshot.",
            "I know humour is subjective and all that, but it was objectively unfunny",
            "Excuse for what?",
            "I disagree",
            "Not taking a screenshot.",
            "As the author you don't get to decide if it was funny.",
            "If the sub was regulated in such a way then I would have, but I’ve already explained myself otherwise 👍",
            "And you do? Talk about double standards",
            "I didn't spend hundreds of hours with the engineers and designers working on the share button, just for people to take pictures of their screen like a grandma trying to share an email.\n\n\n\nImplementing the share button was my life's work. It cost me my marriage.   We made it SO EASY, and yet people still don't know to use it.\n\n\n\nGamers™️ proved themselves unworthy of our efforts, and I curse them for it.",
            "As the audience, yes. The author has no control over something after they release it."
        ]
    }
}