{
    "Samedi Écriture - Sujet Libre ou \"Vous vous faites pincer par un crabe mutant, et acquérez de super pouvoirs\"": {
        "title": "Samedi Écriture - Sujet Libre ou \"Vous vous faites pincer par un crabe mutant, et acquérez de super pouvoirs\"",
        "score": 4,
        "url": "https://www.reddit.com/r/france/comments/1dlutcq/samedi_écriture_sujet_libre_ou_vous_vous_faites/",
        "content": "Bonjour À Tous ! Aujourd'hui C'est Samedi, Donc C'est Samedi Écriture ! Et comme ça sera tout le temps le cas maintenant, c'est aussi Sujet Libre ! (merci de l'indiquer au début de votre commentaire, sinon je m'y retrouverai pas)    \n    \n**SUJET DU JOUR :**    \n    \n**Au choix :**    \n    \n* Sujet Libre      \n      \n*  \"Vous vous faites pincer par un crabe mutant, et acquérez de super pouvoirs\"    \n    \n* Sujet alternatif : Rédigez un texte en utilisant au moins 5 des mots suivants : \"Scorpion, Fuir, Bourse, Rural, Flou, Examen, Deuxième, Document, Mascara, Nouveau\".    \n    \n    \n**Sujets De La Semaine Prochaine :** \n \n**Au choix :**    \n    \n* Sujet Libre.    \n \n* \"Vous voyagez dans le temps, et êtes venus assister à la fin d'une ère\"              \n    \n* Sujet alternatif de la semaine prochaine: Rédigez un texte en utilisant au moins 5 des mots suivants : \"Talc, Agent, Convertir, Climtisation, Formel, Plage, Torsion, Cidre, Calmar, Outil\"\n     \n**Sujets à venir :**      \n \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nA vos claviers, prêt, feu, partez !",
        "num_comments": 1,
        "comments": [
            "Je l'avais dit il y a 2 semaines mais je le réécrit : j'ai vraiment plus l'énergie de continuer à poster ce fil toutes les semaines.\nDonc le 29/06 (samedi prochain donc) ça sera le dernier Samedi écriture que je posterai. Si quelqu'un veut reprendre le flambeau, ça sera avec plaisir que je lui dirai le très peu de trucs qu'il y a à savoir.\n\nPS : merci à celles et ceux qui m'ont envoyé des messages auxquels j'ai pas répondu jusque là, c'est gentil :)"
        ]
    },
    "Forum Libre - 2024-06-22": {
        "title": "Forum Libre - 2024-06-22",
        "score": 7,
        "url": "https://www.reddit.com/r/france/comments/1dllvfd/forum_libre_20240622/",
        "content": " \n\n**Partagez ici tout ce que vous voulez !**\n\nCe sujet est généré automatiquement vers 7h - [Archives](https://www.reddit.com/r/france/search?q=Forum+Libre++author%3A%22automoderator%22&restrict_sr=on&sort=new&t=all).",
        "num_comments": 65,
        "comments": [
            "C'est quoi les exigences les plus WTF que vous ayez vu sur une offre de location immobilière ? Hier, en parcourant les annonces sur lbc, un propriétaire a mis \"je visite le logement de chaque candidat\".",
            "J'ai fait des tests avec un tailleur, en lui demandant s'il pouvait faire des fringues d'après une photo tout en la modifiant selon mes critères.\n\nÇa a été nickel, donc je passe à l'étape suivante : Lui faire réaliser des trucs sur des dessins. Je commence à dessiner mes prochaines fringues pour me donner des idées et m'habituer au coup de crayon.\n\nJe vais y prendre goût.",
            "Ah noooon, la personne que j'ai vu hier qui se réveille sans goût ni odorat. Pitié, pas de covid à une semaine du début de mes vacances...",
            "J'ai eu 2 révélations ce matin en allant acheter le pain :\n\n- La technique pour pas manger le crouton de la baguette sur le chemin du retour c'est d'acheter une chocos et de manger la chocos.\n\n- Les gens qui grimpent l'Everest, ils portent des couches/se retiennent/se font dessus quand il font la partie final qui dure plusieurs heures? Sachant qu'il fait juste beaucoup trop froid pour baisser son pantalon.",
            "Bonjour le FL du samedi !\n\n\nJe cherche un truc à dire mais j'ai le cerveau grillé par la fatigue due à mini pintade. Je rêve d'un 6h de sommeil d'affilié. Je me contenterais de 5h si il faut. Ou seulement 4h. 3h est dans le domaine du possible mais le tunnel est encore loin.",
            "Salut les gens, j'espère que vous allez bien. Go rester doux et soyeux. Bonne journée à tous et à toutes.",
            "Ça fait des années que j' attends patiemment que mon vieil ordi crame pour le remplacer avec enfin quelque chose de bien et ça y est, le jour est arrivé. Par contre je ne sais pas ce que je veux et j' en suis même à me dire que finalement je pourrais peut-être faire sans. Alors que non parce qu'il me faut au moins un truc pour lire des médias",
            "Je suis giga crevé aujourd'hui. Je devais faire le ménage mais je crois je vais rester dans le canap a lire des BD avec mon chat.\n\nBon je vais quand même ranger un petit peu mais pas trop.\n\nÉdit : grosse sieste ! Fait du bien",
            "J'ai mis des plombes à m'endormir même avec CBD + mélatonine et Sous la Seine en fond sonore pour distraire mes oreilles mais j'ai du dormir 8h au final. Mais en me levant la misère qu'est ma vie désormais m'a fait essayer d'imaginer que je peux arrêter mon coeur à volonté. Je dois tirer les enfants au marché pour voir mon père et j'ai pas l'énergie pour ça. Un pote me parle d'activités que je peux plus faire de sports en intérieur. J'ai rêvé que je chantais avec un groupe dans un micro. J'ai aussi rêvé d'activités à la montagne. En vrai rien de tout ça.\n\n\nEt le botox dans lequel j'ai mis plein de fric marche pas bien. Je vais devoir retourner et espérer qu'ils en mettent plus. Mais en vrai je sais pas trop pourquoi je fais ça. C'est un peu absurde je vais devoir vivre comme une petite vieille autant en avoir la tronche.",
            "Ca intéresse quelqu'un deux tickets pour le dimanche des Francofolies de la Rochelle? Je vais rien en faire perso.",
            "J'ai fait part à mes parents, à mes frères et sœurs via Messenger de mon récent diag TDA plus un trouble dépressif lié (prise d'antidépresseurs) qui fait suite à plusieurs tests/rdv . Ma fratrie m'a soutenu, mais ma mère m'a appelé paniqué, un peu désemparé, remettant en cause quasiment le diag et la prise d'antidépresseur ; elle m'a dit qu'elle aurait préféré être au courant de mes démarches en amont, de pas l'apprendre comme ça, qu'elle était un peu blessée et que je n'avais jamais eu de problèmes enfant. Je pensais que j'allais avoir un peu de compassion de sa part vu mon état, mais pour l'instant il n'en ait rien. Je trouve ça étrange, elle m'a demandé de se rencontrer pour en parler, mais j'ai peur d'être dans une posture défensive, comme s'il fallait que je me justifie auprès d'elle de ce que je ressent. J'ai été désarçonné parce que j'ai eu l'impression de passer pour un escroc, un menteur. Bref ça fait du bien d'en parler. Bisous à tout le monde et bon week-end.",
            "[removed]",
            "Des abonnés du le1hebdo ici ? Je me demande quel est le consensus de l'orientation politique/biais du journal ? Vu que c'est le même groupe que le point je me demande si c'est la même ligne editiorale.",
            "L’ergo d’Amazon est à chier. J’en fait appel à l’intelligence collective de Reddit :\n\nhttps://www.amazon.fr/Batman-Superman-Worlds-Finest-English-ebook/dp/B0BTTXHF6Q/?_encoding=UTF8&pd_rd_w=qq7TZ&content-id=amzn1.sym.69ddbdfa-6f86-49d2-a878-e83873af1828%3Aamzn1.symc.fc11ad14-99c1-406b-aa77-051d0ba1aade&pf_rd_p=69ddbdfa-6f86-49d2-a878-e83873af1828&pf_rd_r=YY07WHXSCQPNYNGBP1BA&pd_rd_wg=kOZcs&pd_rd_r=1f9e6fff-978d-40f0-afdd-90b87a87b3e0&ref_=pd_hp_d_atf_ci_mcx_mr_ca_hp_atf_d\n\nCe comic est en promo. Je souhaite connaître tous les comics actuellement en promo en version numérique. Je fais comment ?",
            "Je dois envoyer des papiers au gestionnaire de la coloc dans laquelle je vais déménager et je peux pas faire de DossierFacile parce qu’il (le gestionnaire) me demande juste CNI, certificat de scolarité et avis d’imposition, vous avez des idées pour quand même transmettre ça de manière sécurisée ? Genre un site pour mettre un filigrane ou autre ?\n\n(Je sais que la coloc est safe, j’ai une pote qui y vit depuis 2 ans, mais sait-on jamais)",
            "[removed]",
            "\"C'est bien, mais ce n'est pas suffisant.\"",
            "- Laisser une chambre libre au cas où il ai besoin de dormir dans ́le coin\n- il loue le garage, mais il faut laisser son tas de merde et SURTOUT NE PAS Y TOUCHER. Et pas la place de rentrer une voiture bien sûr....\n- declarer une coloc avec ́le garant\n- non eligible aux APL (Ecrit directement que tu le declares pas, c'est plus clair..  )",
            "C'est chouette. Quel est l'ordre de prix pour des fringues sur mesure?",
            "Qu'entends-tu par \"une choco\" ? \n\nAttention ! Une mauvaise réponse pourra entrainer un signalement aux autorités concernées",
            "Inoxtag en avait vite fait parlé dans un extrait qui avait tourné tu peux choisir de mettre une couche ça se fait beaucoup notamment sur la dernière partie où tu peux faire longtemps la queue juste avant le sommet",
            "bonjour vonjour",
            "Bonjour!",
            "Souvenirs d'une année complète où j'ai pas dormi plus de 3 h d'affilée...\n\nÇa va mieux maintenant 🙂",
            "\\*court se peigner les cheveux\\*",
            "Ma passion sur reddit c'est de provoquer les autres, faire des débats sans fin. En fait reddit c'est mon trait toxique puisque dans la vraie vie je suis tout l'opposé et plutôt peace & love. Reddit c'est de moins en moins doux et soyeux quand même tout le monde s'engueule partout",
            "Si c’est un PC fixe que tu cherches à remplacer et vu que t’as pas l’air si pressé que ça puisque tu te demandes même si t’en as besoin, alors le mieux serait de chercher un “mini PC” en occasion.\n\nLes mini PCs, c’est les tout petits boîtiers qui sont installés derrière les panneaux publicitaires, les postes de travail des employés qui n’ont pas besoin de beaucoup de puissance… Il y a beaucoup d’entreprises qui veulent s’en débarrasser (parce que leur besoin a changé, ou parce qu’ils veulent mettre à jour leur parc informatique).\n\nDu coup ça se brade pour pas cher, si peu que tu prennes le temps de configurer des alertes et de t’armer d’un peu de patience, tu peux trouver un truc pas mal du tout pour moins de 200 balles.",
            "Les soldes d'été commencent le 26, si tu peux reporter ton jour-qui-est-arrivé!",
            "Une bd , un rangement",
            "Fais attention pour la mélatonine il y a beaucoup d'histoires de surdosage. Tu n'avais pas prise de café auparavant ou autres pour que ton mélange ne fonctionne pas ? C'est vrai que ça ne marche pas sur tout le monde",
            "C'est surement un choc pour elle si tu en avais jamais parlé avant, c'est une chance d'avoir l'occasion d'en parler et j'espère que vous allez réussir à vous comprendre. Je pense que beaucoup de parents ont peur d'être mis face à leur échec (même si ce n'est pas le cas, ça peut être perçu ainsi).\n\nQuand j'ai fait part de mon diagnostic à mes parents ils ont répondu ''vu'' par mail et on en a jamais reparlé, rien à battre dans ma famille. Bon courage à toi.",
            "Ma pauvre j'ai la chance d'être née dans une famille de TDA/H donc de mon côté pas eu ce problème ça doit être horrible qu'elle puisse remettre en question ton diag TDA/H alors que c'est déjà assez compliqué au quotidien. Ce que je fais en dehors de ma famille avec ceux qui doutent de mon diagnostic c'est que je dis \"Ah, tu as fait des études de neuropsy de ton côté pour savoir si j'en ai un ou non ? Tu es apte à poser des diagnostics toi maintenant ?\" etc etc. Puis il faut aussi dire à ta mère que des tas de TDA/H n'ont pas forcément de gros problèmes enfants, TDA/H c'est un handicap mais loin d'être un maladie grave surtout qu'il y en a des prononcés d'autres non (mon frère et moi on l'a pas du tout au même degré et ça se voit clairement) il y a des TDA/H qui sont loin d'avoir des problèmes par ex le médecin connu Michel Cymes (pardon si mauvaise orthographe) l'est et pourtant il a bien fait des études de médecine... On dirait que ta mère en a l'image d'une personne qui a forcément de gros problèmes et que du coup selon elle bah non tu ne l'es pas. La génération de nos parents ne sont pas du tout aussi renseignées que nous sur la neuro-atypie donc parfois pour eux c'est juste une mode, il y a la vidéo de Fabien Olicard qui est sorti récemment que tu pourrais lui montrer pour qu'elle se renseigne sur le TDA/H et comprenne mieux ce sujet",
            "Bonjour,\r\n\r\nreddit n'est pas une vitrine publicitaire, que l’intention soit commerciale ou non !\r\n\r\nCe contenu a été retiré. Tu peux cependant poster ton contenu dans le prochain topic « Dimanche Autopromotion » qui est posté tous les dimanches.\r\n\r\n\r\n\r\nLes règles de /r/france sont [disponibles ici](https://www.reddit.com/r/france/wiki/regles?utm_source=reddit&utm_medium=usertext&utm_name=france&utm_content=t1_em586i2). Pour contester cette action, ou pour toute question, merci d'envoyer un [message aux modérateurs](https://www.reddit.com/message/compose?to=%2Fr%2Ffrance).\r\n\r\nMerci de ta compréhension.",
            "Je l'achète de temps en temps, perso je le trouve neutre et factuel, un mélange d'analyses hyper intéressantes et parfois pointues sur le thème, bref pas du tout comme Le Point.",
            "J'ai utilisé la recherche et appliqué quelques filtres : Bandes dessinées, Comics, Ebook Kindle, tri par ordre croissant.\n\nEt j'obtiens [ce résultat](https://www.amazon.fr/s?k=comics&i=stripbooks&rh=n%3A601818%2Cp_n_binding_browse-bin%3A901116031&s=price-asc-rank&dc&crid=2H9027EV0G3NY&qid=1719052743&rnid=492479011&sprefix=comics%2Caps%2C87&ref=aa_sbox_sort&ds=v1%3AkmT7YSCygJ2%2FxJqZunIP6pxUPZQpw2m1nl2MJuFLaos)",
            "Sur l'appli dans la section Boutique Kindle j'ai un lien \"[Bons plans et petits prix\"](https://i.ibb.co/X2978JQ/Screenshot-20240622-133842.png) avec des promos semble-t-il.",
            "Y a un service en ligne (en bêta) du gouvernement pour mettre des filigranes.\nC'est [Filigrane facile](https://filigrane.beta.gouv.fr/) \nIl marche plutôt bien",
            "Filigrane facile ou alors watermarkly sur android.",
            "C'est pas ici le SAV.",
            "Entre 50 et 80€ pour des hauts, j'ai pas encore testé le pantalon et le costard complet. Sachant que c'est moi qui choisis et achète tissus, boutons etc. ça peut vite monter à 150€ total si je veux un truc en tissu un peu stylé, beaucoup moins si je prends du coton de base. C'est pas donné mais ça permet une customisation complète, ce que j'ai jamais trouvé chez les tailleurs classiques qui font plus dans la demi-mesure.",
            "Une chemise je sors à 75, un costume à partir de 400 environ",
            "> une choco\n\nUne choco**latine**.\n\nJe n'ai pas peur de dire les mots tout fort monsieur!",
            "Une 'chocos' même , sûrement un truc espagnol comme un tacos (ou alors grenoblois, comme le tacos lyonnais)",
            "Merci bonne journée à toi aussi 😭😭😭",
            "Je suis en germanie, mais bien vu je vais me renseigner",
            "J’ai rangé une petite cuillère dans un tiroir c’est bon je reprends une BD",
            "Merci pour le soutient, je ferais peut-être une maj sur le forum libre, on doit se voir vers le 10 juillet avant que je parte en vacance.",
            "Merci pour ces explications et ce soutient, je vais regarder en détail. Oui c'est un peu ça, surtout que je suis au chômage et en reconversion professionnelle, qui a tardé mais que j'entreprends ; heureusement j'ai aussi le soutient de ma compagne ! ",
            "C'est pas mal mais le prix par ordre croissant ça va surtout te filer des pages et des pages de free comic book day. Des issues toutes seules, et pas des recueil complet en promo malheureusement. Mais merci d'avoir essayé !",
            "C’est moins cher que ce que j’aurais cru (pour la région parisienne, en tout cas), même en sachant que tu fournis les matériaux.",
            "Merci. C'est pas donné mais ça me parait pas excessif, et ça doit être confortable d'avoir des vêtements adaptés à son corp.",
            "C'est terrifiant, depuis les dernières élections certain extreme sudistes se sentent pousser des ailes pour tenir ouvertement ce genre de propos haineux",
            "Je vois... Je fais de ce pas un rapport à la ~~kommandantur~~ modération",
            "Aïe!\n\nOn a déjà suffisamment à faire avec la crise actuelle pour ne pas en rajouter une couche. Ça va partir en crise politique cette affirmation!\n\n^/s ^toujours ^au ^cas ^où",
            "Et [comme ça](https://www.amazon.fr/s?k=comics+serie+compl%C3%A8te&i=stripbooks&rh=n%3A601818%2Cp_n_binding_browse-bin%3A901116031&s=price-asc-rank&dc&crid=12SFRDTB15PFM&qid=1719053663&rnid=492479011&sprefix=comics+serie+compl%C3%A8te+%2Caps%2C95&ref=aa_sbox_sort&ds=v1%3AzWDHuY8tyr0c1dUKn3%2FTJlnRDEDW5Vc89ET68jyea%2Fc)?",
            "La solution c'est de trouver un Bangladais qui officie dans un trou dans un mur qu'on peut pas voir si on sait pas qu'il est là. Les derniers sur-mesure que j'ai fait chez des tailleurs \"établis\" m'ont coûté 300€ pour un gilet, tissus compris.",
            "Doucement, il n'est pas impossible que ce soit en réalité une opération de trolls russes venus semer la zizanie.",
            "Nope comme tu peux le voir il n'y a que deux pages de résultats et ils sont pas en promo. Mais c'est bien tenté !  \nL'exemple que je donnais dans mon post initial c'était un tome de World's finest qui regroupe les issues 1 à 6 de la série. Et il y a d'autres tomes derrière c'est pas une série complète.\n\nPar contre c'est en promo à 2.88 alors que d'habitude il coûte plus de 16€ hors promo.  \nEt le truc giga chiant c'est que c'est même pas indiqué comme une baisse de prix. Si tu sais pas tu crois c'est le prix normal. \n\nJ'ai fait un post l'autre coup sur les livres numériques mais je crois que le plus gros frein ça reste l'ergonomie de merde des sites marchands. Le piratage est tellement plus easy.",
            "Du coup, c’est non déclaré ? Si c’est le cas, le prix m’étonne moins. Après, j’imagine que le Bangladais en question reste beaucoup mieux rétribué que les Bangladais qui fabriquent notre prêt-à-porter au Bangladesh, même en prenant en compte le coût de la vie en France...\n\nTu achètes tes tissus où, si ce n’est pas indiscret ?",
            "Bon, j'ai tenté, j'ai échoué :)",
            "J'en sais rien si c'est déclaré, je t'avoue. Le mec est ostensiblement à son compte, mais connaissant la commu bangladaise y'a moyen qu'il soit en sous-marin pour un autre gars. Et ses deux employés sont quasi-certainement pas déclarés.\n\nJe pense que c'est plus dû aux conditions des banglas en France, genre je te fous un billet qu'ils vivent à 8 dans un 30m² en dormant sur 4 futons à tour de rôle, comme ils vivent tous... forcément t'as moins de frais.\n\nPour ce qui est des tissus, j'achète au marché Saint-pierre, à Montmartre. Plus particulièrement dans chez un marchand de tissus qui s'appelle Reine.",
            "Ah et pour te donner un exemple, ils le font sur amazon US :   \n[Read Comics, Graphic Novels, Manga and More | Sales and Deals (amazon.com)](https://www.amazon.com/kindle-dbs/comics-store/sales?ref_=cmx_hp_b_d_u_bs)\n\n(et je suis obligé de l'ouvrir sur Edge pour y avoir accès sur PC c'est une dinguerie)  \nDepuis que Comixolgy (rip petit ange parti trop tôt) a fusionné avec kindle c'est complètement délaissé en France.",
            "Merci d’avoir essayé en tous cas !"
        ]
    },
    "Mon opinion sur le conflit Israélo-Palestinien est-elle antisémite ?": {
        "title": "Mon opinion sur le conflit Israélo-Palestinien est-elle antisémite ?",
        "score": 253,
        "url": "https://www.reddit.com/r/france/comments/1dlrl12/mon_opinion_sur_le_conflit_israélopalestinien/",
        "content": "1- Le Hamas est indiscutablement une organisation terroriste \n\n2- Les attaques du 7 octobres sont des attaques terroristes d'une ignominie sans nom. Aucune cause ne peut justifier les assassinats, enlèvements, viols et autres crimes qui ont été perpétrés envers des civils par le Hamas au cours de cette attaque.\n\n3- Les Palestiniens et notamment les gazaouis sont opprimés par l’Etat d’Israël, qui  pratique une politique d’extrême-droite ignoble. Rien ne peut justifier les bombardements massifs, aveugles et sans aucune proportionnalité qui ont lieu aujourd’hui à Gaza, qui visent principalement les civils. Rien ne peut justifier que l’on affame un peuple entier en limitant l’accès à l’aide humanitaire et que l’on s’attaque à l’UNRWA. Rien ne peut justifier les politiques de colonisation de l’Etat d’Israël en Cisjordanie et les conditions d’existences que l’on fait subir aux Palestiniens depuis des années.\n\n  \n4- Aucune amélioration de la situation n’aura lieu en perpétuant ces horreurs. Les attaques du 7 octobre nourrissent la haine israélienne envers les Palestiniens, et plus globalement les musulmans. La guerre à Gaza nourrit la haine des Palestiniens envers les Israéliens et plus globalement les juifs. En continuant sur cette voie on est dans un cycle de violence infini qui ne s’arrêtera que par le génocide de l’un ou de l’autre peuple. \n\n5- La seule solution est l’arrêt des exactions et la recherche d’une solution pour que chacun puisse vivre dans de bonnes conditions d’existence et de sécurité.",
        "num_comments": 221,
        "comments": [
            "Non, c’est la position de bon sens je dirais",
            "Pour moi, absolument pas.\nLa tristesse de ce conflit, c'est que tu as des deux côtés les pires personnes au pouvoir pour permettre une paix, et surtout une amélioration des conditions de vie des populations.\nLe problème, c'est que dans notre pensée politique contemporaine, une part importante des personnes considère que si tu as un méchant, tu dois avoir un gentil, alors que la nature humaine est bien plus compliquée.",
            "Pas du tout. Il faut arrêter de parler d'antisémitisme à chaque fois qu'on critique Israël. Par ailleurs, tu as une position tout à fait standard sur le sujet. Si tu veux approfondir un peu, tu peux te renseigner sur le caractère colonial de la situation, ça aide à comprendre pourquoi les choses se passent ainsi.",
            "Un point supplémentaire: \n\nIsrael et la communauté juive dans le monde sont pris en otage par les extremistes/suprémacistes de leur communauté.\n\nRabin a été assassiné par un extrémiste juif pour empêcher la paix Israel-Palestine. Le [Hamas est autant une création du Likud](https://www.timesofisrael.com/for-years-netanyahu-propped-up-hamas-now-its-blown-up-in-our-faces/) que des saoudiens/Qataris: le but avoué étant d'empêcher le Fatah de créer un état palestinien stable. Les [extrémistes juifs oppriment les communautés non juives](https://youtu.be/Ug0p3GDSrD0?si=EUiLeWknkQ3IlwtX) en Israel même. Sans parler des colons en cisjordanie.\n\nTant que ces extrémistes auront voix au chapitre en Israel, il n'y a pas de paix possibles ni pour Israel ni pour la Palestine.",
            "Non. Beaucoup de choses que tu as écrites sont des faits, pas des opinions.",
            "Le constat est bon, la conclusion est une illusion hors de tout encrage du réel. L'enfer est pavé de bonnes intentions.",
            "C'est que des avis consensuels je dirais.\n\nEst ce que le Hamas est un mouvement de résistance selon toi? \n\nÇa c'est un point plus épineux",
            "C'est la seule position acceptable à mon sens.",
            "C'est la position de la diplomatie française depuis octobre. Donc à moins de dire que la France est antisémite (bon, faut dire que c'est la position de Netanyahou), la réponse à votre question est non.",
            "Tout les gens a peu près censés ont cette position sur le conflit. Sauf que tu laisse sur un point :\"trouver une meilleure solution\".\n\n\nC'est bien beau de le dire mais s'arrêter là c'est donner 20% de son avis... Oui la guerre c'est horrible, oui les meurtres ça pue la merde, mais c'est juste pas possible de dire \"arrêtez tout !\" sans offrir aucune alternative",
            "Tu as oublié  le sort des otages.",
            "Non. \n\n\n\nOn peut tout à fait critiquer la politique d'Israël sans être antisémite (c'est d'ailleurs le cas d'une grosse partie de la population juive israélienne)\n\nOn peut même être antisioniste sans être antisémite (bien que plus les décénnies, plus c'est difficile à défendre)\n\nOn peut même insulter Netanyahu ou le traité de nazi sans être antisémite. Ce serait au contraire vouloir essentialisé tous les juifs à travers un juif qui serait antisémite.",
            "C'est la position que tout le monde devrait avoir mais apparemment l'histoire n'a pas suffit à tout le monde...",
            "C'est globalement la même position que LFI donc oui c'est antisémite. /s",
            "Ton 1 et 2 reflètent la position de la France mais pas celle de l'ONU et encore moins celle de la majorité des pays du monde \n\nl'ONU dans l'une de ces résolutions reconnaît au peuple un droit de résistance à l'oppression \nElle n'en fixe d'ailleurs aucune limite \n\nl'ONU et le New York Times notamment ont enquêté sur les prétendus viols\n\nIls ont conclu à une absence de ces faits\n\nJe te rejoins sur le caractère ignoble des attaques\n\nMais il faut que tu reconnaisses que ton point de vue n'est pas une vérité absolue \n\nVa regarder la position de l'ONU, de la CIJ et de la CPI sur le sujet, tu verras que la position française est ultra orientée",
            "Je pense que ta position est celle de 90% des gens dans le monde.\n\nIl n’y a que les sympathisants Hamas antisemites durs qui trouvent que le 7 octobre était justifié et il n’y a que les sionistes radicaux du camp de Netanyahu qui pensent que ce qui se passe depuis dans la bande de gaza est justifié et proportionné.\n\nLa plupart pensent qu’ils faudrait juste que tous ces gens finissent par s’aimer les uns les autres bordel de merde.",
            "Non.  \nN'importe quelle personne neutre avec deux sous de compassion devrait partager ton avis.",
            "Tu demandes au mauvais endroit, ce sub est très fortement pro-Gaza.\n\n\nMoi je ne connais que partiellement la situation mais \n\n\n> Rien ne peut justifier les bombardements massifs, aveugles et sans aucune proportionnalité qui ont lieu aujourd’hui à Gaza, qui visent principalement les civils. \n\n\nJe ne pense pas que les attaques visent principalement les civils, genre, je ne pense pas que les attaques soient organisés pour tuer le plus grand nombre de civils possible.\n\n\nEt je pense que si tu partages cet avis dans une communauté pro-israel, entre d'autres ils te diraient que oui, cette perspective est pollué par l'antisemitisme des medias qui visent l'Israel et par ton antisemitisme internalisé qui fait que tu remarques d'abord la brutalité des actions d'Israel sans le mettre en contexte avec des autres actions militaires similaires.\n\n\nEnfin moi perso je ne suis pas d'acc avec leurs arguments mais c'est ce genre de choses que je lis quand je les retrouve",
            "Non, c’est une position plutôt logique, j’ai même des potes israéliens qui partagent ta opinion",
            "C'est même pas anti-sioniste (= contre l'état d'Israël), c'est encore moins anti-sémite (contre les Juifs). C'est une position logique et qui devrait être la norme.",
            "Attention à ton point 3, tu mélanges deux choses qui ont un contexte très différent:\n\n-la colonisation de la Cisjordanie est un déni total du droit internationnal, Netanyahu a fait annexer un territoire sur lequel Israël n'a aucune légitimité. Cette action est par nature injustifiable\n\n-la répression sur Gaza fait suite aux nombreuses attaques du Hamas (dont celles du 7 octobre on été le summum). Le Hamas revendiquant la dissolution totale d'Israël, il est difficile de refuser à Israël le droit de défendre son territoire.\nLes frappes israéliennes visent à récupérer les otages du 7 octobre qui rappelons le ne sont toujours pas libérés, et à détruire l'organisation terroriste qu'est le Hamas, vis à vis du droit internationnal ces actions militaires sont légitimes. Le problème vient de la démesure et du systématisme de ces frappes. C'est leur quantité et leur violence qui est injustifiable, pas leur nature.\n\nNotons par ailleurs que lorsque des convois humanitaires ont pu être organisés au cours des derniers mois, c'est le Hamas qui les a bombardés. Ces gens n'ont que faire de la sécurité de leur population.",
            "Il faut surtout arrêter d'assimiler l'antisionisme à l'antisémitisme.",
            "Bonjour, je suis juif, je me plains beaucoup des remarques antisemites qu'on peut lire sur ce sub, et du fait que beaucoup de personnes ne connaissent ni l'histoire de l'antisémitisme ni les tropes utilisés (notamment par LFI). Y a beaucoup de problème d'antisémitisme lié à la critique de l'état d'Israël. La critique en soit n'est pas antisemite, mais on retrouve souvent des tropes, des liens avec l'antisémitisme, lorsque certains critiquent Israël. \n\nCependant, à priori, rien dans ce que tu dis ne relève de quoi que ce soit d'antisémite. J'ai des points de désaccords mais ce sont des arguments tout à fait recevables et entendable. \n\nMerci de faire attention à tes propos, ça fait vraiment plaisir à voir des gens qui prennent en compte le fait que leurs propos puissent être problématique.",
            "Le constat est bon. La position est neutre, bonne. Je ne vois rien d’antisemite.\nMais c’est clairement pas la position de la gauche, si c’était à ça que tu faisais référence",
            "Alors pas du tout antisémite.\n\nJe suis curieux de lire les commentaires classés en controversés.",
            "Tu as beaucoup de gens qui qualifient cette position d'antisémite? Elle me semble plutôt modérée et de bon sens",
            "Non c'est la pensée la plus sensée",
            "Je suis juif (laïc) et non y’a absolument rien d’antisemite dans ce que tu dis. Comme le dis un autre commentaire, c’est la position du bon sens et ce serait bien qu’elle soit partagée par plus de monde.",
            "Non, c’est position de bon sens selon moi.",
            "[removed]",
            "1) Oui\n\n2) Oui\n\n3) Oui\n\n4) Oui\n\n5) Oui\n\nOù est l'antisémitisme ?",
            "Antisemite : haine des juifs en tant que peuple\n\nCritiquer un gouvernement, quel qu’il soit, ce n’est pas être contre le peuple qu’il gouverne. \n\n\nDe la même façon, on peut considérer Poutine comme un fou dictateur dangereux pour la démocratie au niveau mondial qu’il faudrait arrêter à tout prix et apprécier la culture russe et ses habitants.",
            "Je pense au contraire que tu résumes la pensée de nombreuses personnes concernant ce conflit.\n\nMais on voit bien de nombreux israéliens manifestés [[1]](https://www.theguardian.com/world/article/2024/may/26/israel-gaza-war-anti-government-protesters-clash-with-tel-aviv-police-and-demand-hostage-deal) contre cette politique haineuse et également de nombreuses personnes de confessions juives dans le monde entier et notamment à NYC [[2]](https://www.challenges.fr/societe/a-new-york-une-communaute-juive-divisee-face-a-la-guerre_870762)",
            "Il y a plusieurs choses qu'il faut être ferme : fin de la colonisation et il ne faut plus que les frontières bougent. Mais il ne faut pas se voiler la face, ce qu'ils ont fait le 7 octobre tient d'une ignominie que jamais je ne pourrai comprendre ni même pardonné. Quand on sait que des non hamas ont également participer au massacre je ne veux plus rien à voir à faire avec des palestiniens ni même les accueillir chez nous. De plus la question se pose : comment cela se fait que les mecs du hamas soient riches, ont pu faire des tunnels, s'équiper convenablement? Ils veulent qu'une chose cassez du juif s'en tape et je pense même que pour la population tuer/violer des juifs est un intérêt supérieur à être en paix et développer leur territoire.  L'unrwa tu m'excuseras mais c'est un blague, on ne saura que la vérité sur cette organisation dans 10/15 ans et quel rôle ses membres ont eu lors de ce pogrom.\n\nAussi, je pense qu'il aurait fait la même chose à un pays comme la chine, ou USA. Gaza serait vitrifié à l'heure actuel.",
            "Chuis pas d’accord avec ton deuxième point. La cour pénal internationale a émis un mandat d’arrêt contre Netanyahu (et des chefs du Hamas) donc la guerre a gaza n’est « légitime vis à vis du droit international » ou en tout cas, c’est pas une évidence comme tu sembles le présenter",
            "Quel enfer ce débat mon dieu, éteignez CNews 2 secondes",
            "Tu vas t'apporter toi même la réponse.\n\nLa France Insoumise tient la même position que toi, sauf sur le 1 (et encore les avis sont partagés en interne, certains disant, ils ont commis une attaque terroriste, c'est des terroristes, d'autres disant que le Hamas n'est pas enregistré comme organisation terroriste à l'ONU et donc que ça ne l'est pas et que si on met le Hamas il faut mettre Israël).\n\nRegarde le shitshow que c'est depuis des mois.",
            "Ta position n'est pas antisémite, évidement.\n\nPar contre, c'est exactement celle qui permettra à \"l'extrême droite pro-Israélienne de circonstance\" de te qualifier d'antisémite.",
            " Nope ça joue de ouf ! Le plan développé dans le bouquin de sfar me paraît pas deconnant : désarmement du Hamas, libération des otages, fin des colonies en Cisjordanie",
            "Mais...\n\nHais-tu les Juifs juste parcequ'ils sont Juifs?\n\nSi oui, tu es antisémite. Si non, tu ne l'es pas.\n\nBoum, question répondue.",
            "On a d'un coté Netanyahu qui joue la montre jusqu’à l'élection américaine et de l'autre les américains qui continuent d'alimenter la machine de guerre israélienne. Le reste du monde peut faire ce qu'il voudra, cela va continuer jusqu’à ce que Netanyahu aie sécurisé sa position.",
            "Tant que tu fais la distinction entre citoyen palestinien et membre du HAMAS , tu es pas antisémite à mon avis.\n\nIsraël a raison de combattre le HAMAS , mais totalement tort de s'en prendre aux civils au passage. C'est aussi \"simple\" que ça.",
            "T'as critiqué Israël donc t'es antisémites tous ce que tu as dit avant est annulé. /s\n\nSans déconner c'est une position de bon sens de la majorité, sauf des extrêmes qui malheureusement ont beaucoup d'écho sur les réseaux.",
            "Je serais allé plus loin en précisant aussi que Israël est un état terroriste mais ces points sont justes",
            "Le seul truc que je dirais c'est que la politique d'Israel (qui n'est pas acceptable) est aussi une reaction.\n\nEn 1947 c'est les palestiniens qui on voté contre une solution a deux états (pas Israel - Israel été pour!). Pq? Parce que ils en veulent pas du tout d'un état juif - ou meme des juifs. La Palestine pour la plupart c'est tout le territoire. Faut pas oublier qu'Hamas est élu aussi.\n\nDonc c'est une histoire tres longe qui commence au moins depuis 1947, ou meme 1917, ou d'ailleurs avant.\n\nAussi: il ne faut pas oublier que ce cacher derriere sa populations est AUSSI une décision et une responsabilité. Quand on parle d'otage - ben en principe c'est tout le peuple Palestinien qui est aussi pris en otage. Ça n'excuse pas du tout les actions de IDF. Mais la responsabilité n'est pas seulement celle de IDF.\n\nDonc dans ce cadre il n'y a PAS de parti (en pouvoir) qui est raisonnable, qui on pourrait défendre.\n\nLa solutions a deux états semble comme la plus raisonnable - mais il n'y a en fait pas de bonne solutions. Mais ça reste la seule.",
            "Si tu es de gauche c'est clairement anti sémite sinon ça va",
            "Selon les médias français mainstream, tu es indéniablement un véritable antisémite.",
            "Non, c'est la position de bon sens. \n\n\nL'antisémitisme commence quand la remise en cause de la politique de l'État d'Israël devient une remise en cause de l'existence de l'État d'Israël.",
            "Les seuls trucs peut être a revoir sont l'UNRWA qui est fait plus empiré le problème que autre chose, notamment avec ses écoles.\n\nDeuxième truc : la riposte d'israel elle même est logique, ils veulent briser les capacités du Hamas. Mais ça n'explique pas le marathon de crime de guerre commis au passage.\n\nSurtout tout le reste est logique et pas antisemite",
            "Netanyahou et le CRIF diront que oui.\nLa loi française dira que non.",
            "Je vais aller contre le courant et faire un peu de provoc. Ton opinion n est pas antisémite. Mais elle est un peu \"lâche\", parceque il n y a plus de bonne réponse pour le point 5.  Parceque Israel a tout fait surtout depuis l arrivée de Sharon au pouvoir pour rendre impossible la création d un état palestinian.  Et ça va de leur soutien pour la montée de Hamas, jusqu a la. Colonisation injustifié de la Cisjordanie.\n\nJe fais un peu de \"provoc\", je suis désolé mais une vague réponse au point 5... Je crois que c est lâche",
            "J'ajouterais juste que l'état d'Israël et une grande partie de ces citoyens sont a minima autant des terroristes que le Hamas et un grand nombre de ces membres.\n\nLa terreur a des fins politiques, c'est l'ADN d'Israël. Depuis le départ.\n\nLe Hamas c'est des petit joueurs a côté, et ils ont au moins en leurs faveur le fait qu'ils résistent, qu'ils se battent contre un ennemi profondément monstrueux qui les pillent, tuent, humilient, volent depuis bientôt 100 ans sans aucune vergogne ni la moindre gêne",
            "Je pense que, dans le débat tel qu'il s'est radicalisé depuis le 7 octobre, il y a une logique sous-entendue qui explique le qualificatif d'antisémitisme qui semble être balancé à tort et à travers.\n\n\nEn gros, si on considère qu'il est acté qu'une coexistence pacifique entre les Israéliens et les Palestiniens est impossible, qui selon toi devrait avoir le pouvoir dans le territoire qui recouvre aujourd'hui Israël et les territoires palestiniens ?\n\n\nEs-tu du côté de la colonisation de la Cisjordanie, ou de \"from the river to the sea\" ? Pas le droit à la nuance, choisis ton camp.",
            "Je pense comme toi. Les 2 pays sont en fautes car les 2 ont tués des civils en nombre astronomique et quand on regarde bien 1 par 1 chacun avait de bonnes raisons mais ont été trop loin. \n\nAprès comment arrêter quand un camp à des otages et préfère laissez sa population mourir pour devenir des martyr et les autres veulent à tout pris faire en sorte que le 7 octobre n'arrive plus en éliminant à tort et travers...",
            "L’antisemitisme c’est un racisme particulier.\n\nTant que tu n’essentialise pas ta grille de lecture y’a rien d’antisemite dans la facon de juger un conflit, des organisation ou des gouvernements.\n\n- Cracher sur israel n’est pas en soi antisemite,\n- Cracher sur le hamas n’est pas en soit anti-musulman ou anti-arabe\n- chercher a contextualiser le conflit sans a priori n’est pas antisemite.\n\nA l’opposé:\n- juger que etre critique d’israel est antisemite, l’est car tu assimile tous les juifs a l’etat d’israel\n- juger que les palestinien meritent leur sort parceque hamas, c’est purement raciste\n- dire que toute vision visant a ne pas trouver legitime par nature le fait qu’un etat juif soit une absolue necessité et en particilier la forme qu’en a pris israel, c’est a la limite une porte ouverte vers de l’antisionisme mais ce n’est pas de l’antisemitisme (on peut tout a fait ne pas trouver que la constitution d’un etat religieux soit normal par exemple sans en faire une histoire de tous les juifs sont ca ou ci).\nLe simple fait que certains veuillent mettre antisionisme et antisemitisme sur le meme niveau de punition par la loi en dit beaucoup sur le brouillard dans lequel on est actuellement.\nLa encore amalgames qui sont de fait ce qu’ils pretendent critiquer.\n\nCe conflit est tout sauf simple et en plus la france a des conflits d’interets dans tous les sens.\n\nTu ajoute que tout ca est bassement utilisé a des visée electoraliste en france tu as le banco du n’importe quoi mediatique actuel sur ce sujet.",
            "attends j'ai mieux : les juifs antisionistes sont-il antisémites ?  \nlol",
            "Je rajouterai même il faut que UN et son conseil de sécurité prennent ses responsabilités et imposent une solution équitable aux israéliens et palestiniens en partageant le territoire en 2 offrant à chacun un accès aux ressources",
            "C’est quasiment le contenu d’un post que j’ai fait (confère mon historique). Et non, ce n’est pas être antisemite, au pire c’est être anti sioniste c’est à dire être contre la politique historique d’israël (le fameux Alya)",
            "Y a pas mal de gens qui disent que c'est une position tout à fait raisonnable, voire la plus raisonnable, je suis d'accord, mais c'est certainement pas du tout celle du pouvoir et des médias français (qui invitent Netanyahu pour déballer sa version à lui sans contradicteur, c'est plus ça le mood à la télé).\n\n\nDonc en fait le problème n'est pas de savoir si t'as la bonne version ou pas, si t'es antisémite ou pas, le problème est que n'importe qui qui tient ta position s'expose médiatiquement aux pires attaques. Cf De Villepin, quand même pas le pire gauchiste décolonial, à qui on invente des mots pour le salir : https://www.humanite.fr/politique/antisemitisme/accuse-dantisemitisme-apres-ses-propos-deformes-par-bfm-dominique-de-villepin-replique",
            "Non, c'est pas antisémite, c'est juste une attitude de compassion envers des humains opprimés et/ou massacrés par des ordures, que ces ordures soient Israëliennes ou membres du Hamas.",
            "Je ne pense qu'aucun des points ici ne fait réellement polémique.\n\nLe gros point polémique, que tu oblitères, c'est celui de l'avant : c'est de remettre l'attaque du 7 octobre en perspective de la colonisation israélienne. A savoir : à le lire comme un acte de résistance, ou de réaction, ou de rien du tout ? Justifié, ou logique, ou incompréhensible ? Etc. \n\nPersonnellement je n'accepterai jamais d'y voir un acte de résistance : les résistants français, que je sache, n'allaient pas tuer des civils, violer les allemandes, et tuer leurs enfants. L'étiquette \"pogrom\" me semble tout à fait adaptée.\n\nNéanmoins, cette attaque ne sort pas du néant, et toute lecture historique de la situation dans le futur ne pourra que la mettre en regard de la situation coloniale d'alors, et des morts palestiniens qui ont égrené les années précédentes – ne serait-ce que pour expliquer ce qui amène le Hamas au pouvoir, ce parti même fomentant cette attaque. \n\nLe fond du débat est là, et l'ambiguité antisémite (si on veut mordicus l'y trouver) aussi : à quel point la remise en contexte historique devient le cache-sexe d'une minoration ou d'une justification de ces crimes.\n\nL'autre débat, qui me semble plus inepte, c'est sur la qualification ou non de génocide, mais bon... Génocide ou pas, ce qui se passe à Gaza devrait faire réagir le monde entier.",
            "Je pense que la grande majorité des gens pense la même chose au fond. \n\nAprès on peut nuancer des choses ou se mettre à la place d’un côté ou de l’autre pour comprendre ce qu’il se passe. \n\nDe l’angle israélien, la condition principale pour un arrêt du blocus et des combats est la libération de tous les otages. Ce n’est pas étonnant de la part d’Israel et ce doit être ce qui était attendu par le Hamas. Pour le blocus, le gouvernement estime que tout ce qui peut rentrer dans Gaza servira aux combattants du Hamas. \n\nPour l’après, qui j’espère sera bientôt, il faudra bien trouver une solution même si je n’y crois pas. Il faudrait des efforts considérables des deux côtés et il y en aura toujours un pour se sentir lésé.",
            "Selon bfm tv t es un nazillon en puissance\n\nSelon le citoyen lambda, trkl frerot t es normal",
            "1) la dénomination de \"terroriste\" se fait au départ par rapport aux opposants au gouvernement et au système, et plus tard par rapport à des actions à impact telle qu'on les entend maintenant. Le Hamas est un mouvement de libération nationale, avec des travers. Le définir comme terroriste serait plutôt à laisser aux habitants futurs d'une Palestine libre.\n\n2) la résistance à la colonisation est un des cas qui, d'après l'onu, restreint grandement l'appellation de crime de guerre. Notamment, des colons, même \"civils\" ne sont pas traités comme tels en cas de guerre anticoloniale. Et oui, la lutte decoloniale peut justifier, dans une certaine échelle, ce genre \"d'exactions\".",
            "0 - Israel est une ethno-colonie raciste et segregationiste qui opprime, pille et annexe les populations et territoires palestiniens.",
            ">1- Le Hamas est indiscutablement une organisation terroriste\n\nSelon la loi international ils prennent utiliser tout moyen pour récupérer leur territoire. Même ça c'est discutable. Surtout quand tu compares le nombre de victimes Palestiniens et Israéliens chaque année.\n\n>2- Les attaques du 7 octobres sont des attaques terroristes d'une ignominie sans nom. Aucune cause ne peut justifier les assassinats, enlèvements, viols et autres crimes qui ont été perpétrés envers des civils par le Hamas au cours de cette attaque.\n\nLes viols c'est une fake news et une projection israélienne qui en commet réellement.\n\n> La guerre à Gaza nourrit la haine des Palestiniens envers les Israéliens et plus globalement les juifs. En continuant sur cette voie on est dans un cycle de violence infini qui ne s’arrêtera que par le génocide de l’un ou de l’autre peuple.\n\nTiens donc, comment crois tu que les attaques du 7 octobre sont arrivées de base ? C'était déjà un état ségrégationniste et oppressant...",
            "La seule solution c'est le bombardement nucléaire. Je suis pour la solution du zero état ou de l'état vitrigié.",
            "Palestiniens et Israéliens sont sémites à la base car peuples du moyen orient. Ca concerne les deux.\n\nThéorie p'têt à la con : Potentiellement quand on considérait donc cette définition. Un Arabe ou Israélien (Car on parle de peuplades du moyen orient à la base) du maghreb n'était donc pas Sémite.\n\nPuis apparemment de façon moderne on a \"réduit\" ça à ceux qui pratiquent certaines langues. (Ce qui du coup concerne aussi les peuplades du Maghreb.) C'est à dire que au niveau du moyen orient ca a + ciblé et éjecté des gens concernés. Par contre si tu parles un des dialectes concernés et t'es en Antarctique tu peux être Sémite. Même si t'es pas dans le Moyen Orient.\n\nJe dirais néanmoins... Qu'il est probable qu'on en fait tout un pataques inutile. C'est à dire quand on veut s'adresser à un groupe de gens on va dire un truc type : Les Chrétiens. Les Européens. Les Américains. (Mais le mec est Texan). On va faire des groupes pour simplifier une communication. Je pense que le terme \"Sémite\" a été créé dans ce but. Etant Européen, tu me dis que t'es contre les Européens bah heu ok super. Et j'continue à manger mon sandwich.\n\nAprès faut pas confondre un truc important selon moi : Juif & Israélien. Ou encore Musulman & Palestinien. Ou encore (Pour aider) Chrétien & Français. Si tu bombarde une zone parce qu'ils sont Musulmans / Juifs / Chrétiens. Bah t'as intérêt à bien cibler. Parce que j'dois avoir des gens dans ma famille qui pourraient se revendiquer Chrétien, mais le mec assis à côté sur le canapé l'est pas. Le gars au fond de la pièce par contre l'est aussi. Mais les deux à côté non. Faut bien savoir où tu tires ta bombe anti Chrétien.\n\nQuoiqu'il soit dit. Les bombes sur la Palestine ou celles en retour contre Israël. Elles sont contre les Palestiniens et les Israéliens.\n\nLe motif potentiel religieux derrière est en un sens abject. C'est juste une raison sur un fait possiblement jamais vérifiable (Dieu et toute la théologie autour) pour écraser des gens.\n\nOn est dans une cours de récré. J'te dis : \"T'aimes pas Sanbanyame ? Bon bah on te défonce la gueule.\"\n\nA la fin tu ramasses tes dents en te disant probablement : \"Putain mais c'était qui ce Sanbanyame ?\" Et en vrai même moi je le sais pas.\n\nC'est un peu le même concept.\n\nAprès avoir des réflexions sur les choses n'est jamais raciste, antisémite ou autres si tu précises bien le fait suivant : Le problème c'est pas qui tu es ou d'où tu viens, mais ce que tu fais. Et si à ce moment T tu fais de la merde, bah t'es potentiellement un con (pénible). Dans une heure p'têt ca ira mieux, mais là faut que t'arrêtes.",
            "Et ça me semble fou de penser une seule seconde que c’est antisémite et qu’il faut avoir la validation à ce propos.",
            "Exactement, la plus grande tragédie est que ni les dirigeants du Hamas ni Israël ne sont intéressés par la paix. La guerre leur profite à tous les deux politiquement et, pour eux, la mort d'innocents est une perte acceptable.\n\nIl n'y aura pas de paix durable tant que ces hommes resteront au pouvoir.",
            "Clairement, le Hamas n'hésite pas à se cacher dans les centres de population/hopitaux/écoles et d'attaquer Israël depuis ces positions (je trouve que c'est bizarrement assez rarement mentionné sur ce sub quand ça parle des frappes Israéliennes), et Israël n'hésite pas à tout raser pour y debusquer les membres du Hamas, qu'importent les dommages collatéraux. Des connards des deux côtés en somme, et ce sont les civils qui trinquent.",
            ">La tristesse de ce conflit, c'est que tu as des deux côtés les pires personnes au pouvoir pour permettre une paix, et surtout une amélioration des conditions de vie des populations.\n\nSauf que d’un côté les dirigeants ont été élus et de l’autre ils ont été élus il y a longtemps mais ont toujours le soutien de la population si j’en crois les sondages d’opinion des palestiniens vis à vis du hamas qui ont fait quelques unes ces dernières semaines. \n\nDu coup j’imagine que si les 2 peuples soutiennent les pires dirigeants pour la paix, c’est qu’ils veulent en découdre.",
            "> Il faut arrêter de parler d'antisémitisme à chaque fois qu'on critique Israël\n\nExactement. Et tant qu'à faire, il faut apprendre à repérer les pro-israélien qui accusent leur interlocuteur d'antisémitisme à tort parce qu'ils n'ont rien pour argumenter sur le fond. D'autant plus que quoi qu'ils en disent, ça dessert complètement les juifs victimes d'authentiques actes antisémites, après que ces clowns soient passés sur tous les plateaux télé.",
            "Et aussi pris en otage par tous les gens qui veulent absolument faire confondre juifs, israéliens, sionistes, extrémistes orthodoxes, partisans de Netanyahu par intérêt électoral, alors que chacune de ces catégories est différente. Il peut y avoir des recoupements, mais pas du tout à 100%. C'est une façon de cacher la complexité de la situation.",
            "Il y a une différence entre ce qu'il faudrait faire et ce qui se fera.\n\nIl y a aussi une différence entre ce qu'il faut faire et comment on y arrive.",
            "J'imagine que tu parles de ça :\n\n> 5- La seule solution est l’arrêt des exactions et la recherche d’une solution pour que chacun puisse vivre dans de bonnes conditions d’existence et de sécurité.\n\nEn même temps quelles autres options il y a que de souhaiter et tenter de tendre vers ça même si ca parait fortement compromis ?",
            "[removed]",
            "Non. C'est simplement leur justification morale. Le Hamas en a rien à foutre des Palestiniens.\n\n\nTu resistes en attaquant les soldats Israël, Tu fais des attentats sur les dirigeants, les administrations voire à la limite les employés qui représentent l'Etat d'Israël. J'admettrais a la limite même l'attaque des maison et leurs propriétaires \n colons dans les colonnies.  Bref tout ce qui vise l'Etat en lui-même. \n\nMais tu vas pas attaquer, tuer, violer et prendre en otage des civils durant un festival. Civils qui en soit n'ont très peu de pouvoir sur la situation. Ça c'est du terrorisme, pas de la résistance.",
            "Ils sont opportunistes, ils utilisent la merde actuelle pour pousser leur agenda. Et la droite israélienne fait pareil. \n\nOn ne peut pas les mettre au même niveau, mais ils tirent profit de la même situation de merde qu’ils entretiennent.",
            "J'ai jamais trop compris ce point perso et pour moi ça montre que le débat est hystérisé, notamment par la majorité présidentielle qui l'instrumentalise.\n\nEst-ce que c'est un mouvement de résistance ? Eux se vivent comme résistants à une oppression coloniale, c'est indéniable.\n\nEt alors ? C'est pas parce que tu résistes que t'es une \"bonne personne\". Y avait toute une partie de l'Action Française qui était authentiquement résistante aux nazis. Ça en faisait pas pour autant des gens dont l'historique devient appréciable tout d'un coup. Ca reste les gens qui ont défendu \"l'antisémitisme d'Etat\". Le problème c'est que la situation est complexe et que par intérêt politique des partis se rangent sur la position américaine du \"vous êtes avec nous ou vous êtes avec les ennemis\", y a les méchants et les gentils.\n\nLe fait que le Hamas se vive comme mouvement de résistance, est-ce que ça les rend légitime ? Bah assez pour moi c'est clair que non, étant donnée leur position anti-démocratique sur le sort de l'Etat Palestinien.",
            ">C'est la position de la diplomatie française\n\nEn fait c'est la position de la diplomatie française à l'ONU.\n\nMais ce n'est pas la position diplomatique de Macron et Séjourné.\n\nIl y a un vrai bipolarisme dans les relations internationales de la France, ce qui peut rendre la position de la France compliquée à comprendre par manque de cohérence.\n\nPar exemple, à l'ONU la France vote pour l'intégration de la Palestine comme membre de l'ONU.\n\nEt en France, Séjourné et Macron se disent contre la reconnaissance de l'Etat palestinien (pour le moment en tout cas).",
            "Depuis octobre ? Notre président avait proposé de former une coalition pour intervenir dans la bande de Gaza \"sur le même modèle que celle contre l'État Islamique\". Initialement, la diplomatie française était presque plus royaliste que le roi",
            "Vu la tenue de sa pensée on peu répondre sans trop se mouiller qu’OP trouve intolérable toutes les actions violentes du Hamas et que donc il souhaite la libération des otages. Je sais pas .. ça va sans dire non? A ce moment il a aussi oublié les convois humanitaires qui se font dézinguer par Tsahal.",
            ">On peut même insulter Netanyahu ou le traité de nazi sans être antisémite. Ce serait au contraire vouloir essentialisé tous les juifs à travers un juif qui serait antisémite.\n\n*Pleure en Guillaume Meurice*",
            ">(bien que plus les décénnies, plus c'est difficile à défendre)\n\nAlors que bizarrement on peut être anti-hamas ou anti-taliban sans être islamophobe. Il n'y a vraiment que Israel qui a ce traitement de faveur.",
            ">On peut même insulter Netanyahu ou le traité de nazi sans être antisémite. Ce serait au contraire vouloir essentialisé tous les juifs à travers un juif qui serait antisémite.\n\nNazifier le premier ministre du seul état juif, c'est franchement très limite. Tu peux le traiter de facho, l'insulter, mais la nazification de juifs et d'Israël, c'est de l'antisémitisme. \nTu peux aller faire un tour sur r/antisemitism ils ont des articles qui en parlent de mémoire.",
            "> Je ne pense pas que les attaques visent principalement les civils, genre, je ne pense pas que les attaques soient organisés pour tuer le plus grand nombre de civils possible.\n\nDonc ton argument c'est juste que, techniquement ils ont la capacité physique d'exterminer encore plus de civils? C'est pas faux, mais c'est ça ne contredit pas qu'ils visent principalement les civils et que factuellement la majorité des victimes sont civils.",
            "J’étais très d’accord avec toi mais j’ai un peu changé de point de vue, je m’explique.\n\nSi tu es anti sioniste, tu es contre la création d’un foyer juif. Est-ce que refuser une terre à ces gens n’est pas antisemite ? Est-ce que par exemple, c’est un droit que tu refuses aussi aux kurdes ?\n\nDonc ouais, nan pour moi, c’est plus compliqué que ça.\n\nEn revanche, on peut ne pas vouloir la disparition de l’état d’israel mais dénoncer le caractère ethno-nationaliste, théocratique et hyper impérialisme de ce pays.",
            "Excuse-moi mais \"from the river to the sea\" a tout d'un slogan antisémite pour moi qui suis juif",
            "Euh, même LFI, ils ont plutôt cette position là, hein... Dès le début, ils ont condamné les attentats. Ils ont pas dit que le Hamas était un mouvement \"terroriste\" (probablement parce qu'ils le voyaient plus comme un mouvement de \"résistance\" dont certains éléments ont fait des actes terroristes - ce qui est une connerie, soit dit en passant), mais ils sont pas antisémites, et ne soutiennent pas le terrorisme.\n\nDonc je sais pas trop ce que tu veux dire à propos de la position de la gauche...",
            "LFI a sorti bien pire que les takes de l'auteur. Il y a un vrai problème d'antisémitisme dans ce parti, arrêtez de le nier. 92% des juifs français considèrent que LFI contribue à l'antisémitisme en France. C'est casi-unanime.",
            "LFI ajoute un petit soupçon de \"de la rivière à la mer\" mais promis pas dans le sens \"il faut exterminer Israël\"",
            "Si tu hais les Juifs tout court c'est antisémite lol",
            "Oui, en même temps, on peut les comprendre. Du jour au lendemain, on leur impose (via l'ONU) la présence d'un état Juif, le partage de Jerusalem, tout ça. Et faut voir la gueule des frontières sur les résolutions de l'ONU, aussi.\n\nAutant, je suis partisan d'une solution à deux états, autant les frontières en question étaient dégueulasses, et pas vraiment tenables.\n\nBref, donc, c'est logique que la population ait voté contre initialement. Pour l'évolution, bah, à force d'en prendre plein la gueule depuis des décennies, ça n'incite pas la population à faire preuve de compréhension, non plus. Mais ça veut pas dire que tous les palestiniens sont des terroristes, ou des soutiens du Hamas. On rappelle que les élections, ça fait passer une \"majorité\" relative, et ça leur donne le pouvoir. Même si la \"majorité\" en question représente, disons, moins de 20% des inscrits...",
            "Merci !",
            "Tu vois OP c'est ça des takes antisémites. On a un mec qui essentialise une nation et la majorité de ses citoyens en les assimilant à des terroristes qui les ont massacré avec leurs enfants au petit matin et qu'ils dansaient lors d'un festival. Et en plus, c'est une approximation voir des mensonges sur l'histoire du conflit. Bref rien qui va ici.",
            "Ça n'arrivera jamais, les US vont veto toute position allant dans ce sens.",
            "Non, être anti-sioniste c'est être contre l'existence même d'Israël \n\nÊtre contre la politique de son gouvernement ça n'est pas de l'antisionisme puisque de nombreux Israéliens le sont",
            "\\~\\~Y'avait pas d'otages côté palestinien avant le 7 octobre\\~\\~ (Edit : je me trompe) , et y'avait déjà un blocus, des emprisonnements arbitraires, de la torture et des meurtres. Donc le fait que ça soit leur condition pour cesser tout ça, personnellement j'y crois moyen.\n\nPar ailleurs, je suis pas convaincu que la \"grande majorité des gens pense la même chose au fond\". Y'a beaucoup d'antisémites et de racistes anti-arabes qui prendraient des positions pro-extermination d'un côté et de l'autre, et je suis pas convaincu que ces deux groupes soient si minoritaires. Mais bon, j'ai pas de chiffre sur lequel m'appuyer, donc c'est juste une opinion en l'air. J'espère avoir tort...",
            "En quoi les civils tués le 7 octobre étaient un moyen pour récupérer leur territoire ? Aucun, c'était un pur acte de vengeance comme il y en a dans la région depuis des décennies.\n\nJe vois pas dans quel univers mental on peut soutenir que massacrer des gens à un reve party ça permet à la Palestine de récupérer le moindre terrain colonisé. Quand on voit les événements (prévisibles) actuels auxquels ça a conduit on peut même penser que c'est tout l'inverse.\n\nSi Israel est une plaie pour les palestiniens, le Hamas en est la seconde.",
            "La premiere phrase est déja un argument de con utilisé par certains antisémites. \n\nPedo ça veut juste dire enfants, philie ça veut dire amour.\n\nDonc tous les parents qui aiment leurs enfants sont des pédophiles.",
            "Oui c'est clair. Ca devrait être simple. Ca devrait être, si tu critiques la politique du gouvernement d'un pays pour ce qu'elle est, tout va bien, et si par contre tu critiques le peuple de ce pays pour ce qu'ils sont, ce à quoi ils croient, leur couleur de peau ou leur traditions, là t'es en train de franchir la ligne qu'il ne faut pas franchir.\n\nL'antisémitisme existe. Il existe en France, il existe aujourd'hui. On a des faits clairs, on a des paroles claires qui montrent ça. T'es juif en France, bah écoute je suis désolé pour tous les connards qui peuvent te rendre la vie difficile voire dangereuse et je souhaite vraiment que ça s'arrête.\n\nMais, et ça c'est indépendant que tu sois juif ou pas, si tu soutiens le régime de Netanyahu dans ses crimes de guerre, bah t'es un connard. Le fait d'être un connard  justifie pas que tu reçoives des violences ou menaces, mais t'es un connard. Et en face ceux qui, voyant les crimes du régime israélien, se disent que ça justifie ceux du Hamas, bah c'est des connards aussi (peu importe leur origine ou leur religion).\n\nVraiment, ça devrait être simple :\n\n- Va pas violer quelqu'un ou tuer quelqu'un (peu importe s'il a le même avis que toi sur le conflit et peu importe sa religion). Tant qu'à faire va pas non-plus l'agresser d'une autre manière hein.\n- Les Israéliens comme les Palestiniens ont parmi eux des victimes, des bourreaux, etc. Tu peux argumenter que l'un des camps a plus de bourreaux que l'autre, moins de victimes que l'autre, qu'il mérite plus ci ou ça que l'autre, ok. Argumente tant que tu veux. Mais si possible, fais-le, sans préjugé racial ou de religion. Et admets que dans ton camp préféré, quel qu'il soit, y'a aussi des gros bâtards, et dans le camp d'en face, des gens bien qui souffrent injustement. Parce que sans admettre ça, comment tu veux que l'autre camp prenne tes arguments au sérieux ?",
            "Là où en Europe, quand on a vu les horreurs de la 2nd guerre mondiale, on s'est dit \"plus jamais ca\", la mort des civiles dans ce conflit est célébré comme des martyres mort pour la bonne cause, et inspire la prochaine génération à faire de même.\n\nCe conflit ne se résoudra jamais pacifiquement. Gaza finira probablement par disparaître, un tel territoire n'est pas sérieux pour fonder un état. Les civiles seront probablement assimilé à Israël, envoyé en cisjordanie, réfugié dans les pays arabes autour ou iront demander l'asile en Europe.",
            "oui mais donner ça comme solution ça ne fait pas beaucoup avancer vers une amélioration de la situation. Qu'est-ce que tu veux négocier? On rappelle que pour le Hamas, Israel n'existe pas, que son manifeste ne parle uniquement de l'extermination des juifs. \n\nIl n'y a pas 50 plans pour essayer de s'en sortir : envoie d'une autre force sur place pour garantir la sécurité. ça n'a jamais été vu depuis le début du conflit, qui osera mettre ses troupes dans ce merdier?\nTu peux aussi espérer que la Qatar et l'Iran arrête de financer les groupes terroristes, vaste projet...\n\nAprès tu peux toujours mettre Isarel au ban de la communauté internationale, je ne suis vraiment pas certain que ça l'incite à se calmer si personne ne met réellement les mains dans le cambouis sur place.",
            "[removed]",
            "Pas de désinformation",
            "Totalement. D'ailleurs, les attaques sur les Kibboutz, généralement plus \"à gauche\" que le reste, ont pas mal fait basculer l'opinion publique en Israël, et pas mal de modérés sont devenus hostiles envers les palestiniens.\n\nBref, les fauteurs de guerres (des deux côtés) ont parfaitement réussi ce qu'ils voulaient, à savoir radicaliser le conflit pour empêcher toute résolution pacifique.",
            "Le soutient des Israëliens à netanyahou a un pied dans la tombe, aux prochaines élections il est dégagé. \n\nLe soutient des palestiniens au hamas est problématique et pose questions... Et il sera probablement un frein aux négociations",
            "Le Hamas est indéniablement un mouvement de résistance.\n\nLe souci, c'est à la fois sur les méthodes employées (terrorisme, usage de civils palestiniens comme \"boucliers humains\", puisqu'ils se planquent au milieu, etc.), et sur le but recherché (l'ératication d'Israël et possiblement de tous les juifs).\n\nC'est un mouvement de résistance, et c'est dommage que les Palestiniens soient défendus par *ça*, en fait, parce que ça les dessert plus qu'autre-chose (mais en même temps, c'est pas etonnant, vu que le Hamas a été soutenu par la droite dure Israëlienne - ça les arrange beaucoup que leur principal \"adversaire\" soit totalement infréquentable et aussi extrémiste qu'eux, c'est beaucoup plus facile de les condamner internationalement). Le Fatah, lui, était soutenu par pas mal de monde, pour des négociations pacifiques. Ce qui explique l'assassinat de Yasser Arafat, d'ailleurs...",
            "Je vous avoue que je ne sais plus qu'elle était la justification qu'ils utilisaient pour expliquer le paradoxe sur la reconnaissance de l'Etat Palestinien. Mais en revanche, la poursuite de la solution à deux Etats ainsi que le droit à Israël à se défendre dans le respect du droit international se retrouve bien dans les discours de Macron.",
            "Oui, et c'est dommage qu'il n'y en ait pas eu parce qu'à laisser Tsahal se débrouiller seul, on a laissé libre cours à sa destruction aveugle. Je suis persuadé que c'est parce qu'une coalition régionale aurait empêché Israël de raser la ville que Netanyahou ne voulait pas en entendre parler.\n\nMais sinon, pour appuyer ce que je disais :\n\nMacron le 24 octobre : \"La lutte doit être sans merci, mais pas sans règles, car nous sommes des démocraties qui luttons contre des terroristes ; des démocraties, donc qui respectent le droit de la guerre et assurent l'accès humanitaire, des démocraties qui ne prennent pas pour cible les civils, ni à Gaza, ni nulle part.\" \n\nJe peux aussi citer Colonna (le 12 novembre) : \"Nous sommes nombreux à rappeler l'importance pour une démocratie comme Israël de respecter pleinement le droit international humanitaire, c'est même son intérêt, le contraire serait contre-productif\".\n\nOn pourra aussi consulter les réunions du Conseil de Sécurité de l'ONU du [25/10/2023](https://undocs.org/fr/S/PV.9453), [08/12/2023](https://undocs.org/fr/S/PV.9499), [20/02/2024](https://undocs.org/fr/S/PV.9552), [22/03/2024](https://undocs.org/fr/S/PV.9584), [18/04/2024](https://undocs.org/fr/S/PV.9609), … qui soulèvent toujours les mêmes points :\n\n-\tla qualification du Hamas en tant que mouvement terroriste ;\n\n-\tl'appel à un cessez-le-feu ;\n\n-\tl'exigence d'une libération des otages ;\n\n-\tle respect du droit humanitaire international ;\n\n-\tle droit d'Israël à se défendre (dans le respect du droit sus-cité);\n\n-\tl'attachement à une solution à deux États.\n\n---\n\nEdit. Pour rajouter un passage sur les colonies,  voilà ce qui se discutait au Conseil de Sécurité à peine dix jours avant l'attaque de 07 octobre :\n\n> [Réunion du Conseil de Sécurité de l'ONU du 27/09/2023](https://press.un.org/fr/2023/cs15424.doc.htm)\n> \n> M. NICOLAS DE RIVIÈRE (France) a assuré que la France ne reconnaîtra jamais l’annexion illégale de territoires, ni la légalisation de colonies sauvages, et a appelé Israël à y mettre un terme.  Cette politique de colonisation mène à une impasse pour le règlement du conflit et pour la solution des deux États conformément aux paramètres internationalement agréés, a ajouté le représentant.",
            "https://youtu.be/_aEWTnwdjt8?si=ORC3Bxz57zbJog8U",
            "Israël est une démocratie (très imparfaite avec beaucoup de problèmes) dans laquelle les minorités ethniques et sexuelles ont le droit d'habiter (même si leur situation est loin d'être confortable), est-ce le cas en Afghanistan ou en Palestine[ où les gays se font traquer](https://www.bbc.com/news/world-middle-east-63174835) ? Bizarre de les mettre au même niveau \n\nRappel que le sionisme vise à l'existence d'un Etat Juif, être antisioniste c'est être contre l'existence d'un Etat Juif c'est aussi simple que ça. Etre anti hamas ou anti talibans c'est être contre l'existence de ces groupes et pas contre l'existence du pays où ils sont installés",
            "> Tu peux le traiter de facho, l'insulter, mais la nazification de juifs et d'Israël, c'est de l'antisémitisme. \n\nLe problème est que dans le début de votre proposition, on parle bien de Netanyahou : \"*le* traiter de facho\". En revanche, dans la seconde partie, ça devient \"la nazification *de juifs et d'Israël*\". Mais Netanyahou n'est pas \"les juifs\". Netanyahou n'est pas \"Israël\" non plus. C'est juste Netanyahou. On ne parle donc pas de nazification \"de juifs\", mais de nazification d'un mec en particulier. Il se trouve qu'il est juif, et qu'il est aussi premier ministre israélien, mais ça ne lui donne pas le droit à un traitement de faveur pour autant.",
            "Bah, excuse-moi, mais le fait de regrouper dans des endroits bien déterminés une population qu'on considère comme \"indésirable\", ça ressemble vachement à des camps de concentration.\n\nLe fait de cibler cette même population avec des lois injustes, de les expulser sans raison valable, de les spolier (destructions d'oliveraies, maisons volées par des colons juifs en Cisjordanie, etc.), ça ressemble aussi pas mal à certaines politiques ayant eu cours en Allemagne dans les années 30-40\n\nLe fait de massacrer cette population sans vergogne, d'avoir des discours véhéments appelant à leur extermination (pas Netanyahu, mais pas mal d'extrémistes juifs à la télé, tout ça), de démolir les infrastructures à Gaza, d'affamer les civils, et généralement les traiter comme des sous-humains, voire des non-humains, on en est pas à l'extermination systématique et \"industrielle\", mais on en est quand-même pas loin.\n\nAlors, ok, ils sont probablement pas \"Nazis\", dans le sens où ils ne prônent pas la supériorité de la race Aryenne, ils ne cherchent pas à créer un Reich pour une GrosserDeutschland, tout ça, mais y'a pas mal de parallèles qu'on peut faire, quand-même, sans être pour autant antisémites. Tu peux les comparer à d'autres ordures ayant massacré des gens comme du bétail dans l'histoire du monde, hein, si tu préfères. Les Khmers Rouges, le Japon impérial, etc.\n\nCe sera probablement pas plus flatteur - c'est juste que \"Nazi\" est un bon résumé, rapide, et qui permet en plus de montrer en quoi les \"victimes\" (descendants/parents de victimes, techniquement, parce que je pense pas qu'il reste beaucoup des victimes originales, surtout au manettes d'une telle ignominie) instrumentalisent le fait de \"oui, mais nous, on a beaucoup souffert\" pour, au final, faire à peu près la même chose à d'autres...\n\nParce qu'on dit pas que \"les Juifs\" font ça, mais que *certains* Juifs (des ordures immondes) font ça, alors que *d'autres* Juifs s'opposent à cette politique, que ce soit pour des raisons religieuses (genre \"la Jerusalem promise n'est pas terrestre\") ou simplement empreintes d'humanité et de compassion (en fait, les Palestiniens, ils sont humains, et c'est pas bien de leur faire ça).\n\nBref, oui, c'est anti-sioniste de critiquer l'action d'Israël (vu que ce sont des sionistes qui la gouvernent et mênent cette politique), mais pas anti-sémite.",
            "Nazifier Netanyahu antisemite? \n\nJ’ai aucune opinion favorable ou défavorable à l’égard des personnes juives mais c’est un affreux personnage.\n\nQue ça choc du monde de faire une blague sur les nazis et les horreurs qu’ils ont commis c’est normal. Toutes les vannes politiques heurtent des sensibilités. \n\nMais c’est pas interdit. Et ca n’est pas antisemite.\n\nNetanyahu c’est pas les juifs. Et être irrévérencieux c’est peut-être pas élégant mais c’est bon aussi: grossir le trait, appuyer la où ça fait mal, utiliser une formule oxymorique comme celle-ci c’est des instruments de l’humour. \n\nÇa fait pas rire tout le monde ok. Mais c’est complètement lunaire de juger ça antisemite.",
            "Tomato tomahto à ce point là, on est d'acc sur l'essentiel et on n'a pas vraiment les infos pour rien dir sur ce sujet spécifique",
            "C'est possible d'être anti-sioniste mais pas anti-juif, après comme tu le dis, pour l'être il faut être contre le concept de \"terre de religion\" ou de \"terre d'éthnie\" car sinon ca tombe bien dans de l'anti-sémitisme. \n\nLe problème c'est que la laïcité et la diversité c'est un concept qui s'applique bien à la France par exemple *(fin bon...)*, mais d'autre pays sont construits sur une éthnie commune. Pareillement je peux aussi comprendre que un peuple (exemple concret: les Juifs) qui s'est fait persécuter un peu partout veuillent leur propre terre pour enfin vivre en sécurité.\n\nMais sinon je suis d'accord avec le comm, c'est clairement antisémite d'aller crier que les Juifs ont pas droit à une terre pour ensuite crier qu'un autre en a besoin d'une. J'y avais honnêtement jamais vraiment réfléchi donc merci pour le comm' ! :)",
            "https://www.leparisien.fr/politique/conference-a-lille-melenchon-saffiche-avec-un-logo-qui-nie-letat-disrael-regrette-glucksmann-17-04-2024-7UEI46733BC2XEVLLYLOXN5QBE.php",
            "C'est pas parceque t'es majoritaire que t'as raison.\n\nLFI a dit quoi? Parce qu'on tourne en boucle dessus depuis des semaines mais ya rien de réel qui sort. On le répète tellement souvent qu'on pourrait croire que Mélenchon est le pire antisémite depuis 1945 et ya aucune plainte déposée...",
            "Aussi utilisé par le Likoud.",
            "Ah tu un lien pour appuyer tes propos?",
            "Ce slogan ne prône absolument pas l'extermination d'Israël mais la création d'un Etat binational et laïc (quelle horreur la laïcité).\n\nSinon, les palestiniens en Israël seront toujours discriminés.",
            "On peut comprendre — mais sa c'est fait en 30 ans (1917 - 1947) et pas du lendemain.\n\nAussi il faut comprendre le contexte du genocide Armenien 1917. L'empire Ottomans n'étais plus stable, et ça commençais avec des petit massacre de juifs par ci par la aussi.\n\nDonc la décision était a l'origine humanitaire. Mais avec beaucoup d'erreur ...",
            "Israël est un état colonial fondé sur la terreur. \n\nCe n'a rien avoir avec ce en quoi ils croient comme religion, mais comment ils agissent et le mal qu'ils font.\n\nLes Israéliens ne représentent pas les juifs, ils représentent que eux même. Dire que les Israëliens sont en grande majorité des terroristes, ce n'est pas les essentialiser, c'est simplement énoncé un simple fait corroborer par l'ensemble de l'histoire israélienne \n\nLes colons français en Algérie était aussi des terroristes en puissance, tout comme les colons européens en Amérique du nord ou du Sud.\n\nÇa ne fait pas de moi un christianophobe, c'est ridicule comme take.\n\n\nLe terrorisme est l'utilisation de la terreur a des fins politiques. Le colonialisme, d'ou qu'ils soit en est l'une des formes les plus brutal et violente, bien plus en tout cas que du terrorisme lié a une résistance contre la colonisation.\n\n\n\n\nTouts israéliens n'étant pas contre la colonisation et l'apartheid, c'est a dire la grande majorité sont des terroriste dans le sens où ils utilisent la terreur a des fins politiques quotidiennement et sciemment ;  structurellement comme conjoncturellement. C'est la manière dont est organisé leurs sociétés qui veux cela \n\nA force de voir de l'antisémitisme partout et pour absolument rien, vous faites extrêmement du mal a la lutte contre ce racisme ignoble.\n\nEn plus de faire le lit de véritables salopard comme l'extrême droite israélienne et ironiquement aujourd'hui, l'extrême droite européenne \n\nHonte a vous",
            "C'est bien ça qui est triste",
            "> Y'avait pas d'otages côté palestinien avant le 7 octobre\n\nAvera Mengistu, Hisham Al-Sayed et les corps d'Oron Shaul et Hadar Goldin. C'est pas du tout contre toi personnellement, mais sur I/P tant de monde est péremptoire sans raison de l'être...",
            ">Aucun, c'était un pur acte de vengeance comme il y en a dans la région depuis des décennies.\n\nDing ding, le bon mot est vengeance et je rajouterai désespoir.\n\nDepuis quand on puni Israël ? On met en avant le 7 octobre, mais combien de fois Israël a fait la même ? Certes ça n'est pas pardonnable, mais d'abord faudrait-il punir Israël ? Ça fait 80 ans que ça dure et toujours rien à part nos pays et les organisations dont nous sommes membres comme l'OTAN, qui supportent ouvertement un régime génocidaire.\n\nHonte à nous.",
            "Des fois que j'suis surtout allé chercher la définition.",
            "Les pays arabes ne veulent pas vraiment de réfugiés palestiniens",
            "> Gaza finira probablement par disparaître\n\nSelon toi, une situation finale stable serait que Israel soit le seul État mais avec des zones pour Palestiniens (ni Gaza, ni Cisjordanie; tout Israel)? Style ce que les USA ont fait pour les natifs Américains qui avaient survécus; les \"Indian reservations\" + réparations.",
            "En vrai la question se pose toujours dans ces cas. Les Black Panthers ou les revolutionnaires indiens ont fait des actions violentes et il y a pas eu que MLK et Gandhi.",
            "Je pense qu'il n'y a pas grand-monde qui reproche à Israël de se *défendre* (par exemple, abattre des terroristes armés en train d'attaquer des positions Israëliennes, ou des civils).\n\nPar contre, le fait qu'Israël bombarde sans distinction civils et combattants (et on peut se demander si c'est vraiment par \"erreur\", ou si c'est une stratégie voulue pour éradiquer autant que possible les palestiniens), ça, c'est pas de la \"défense\", et c'est inacceptable.\n\nLe souci étant évidemment sur la sémantique, puisque tout le monde répète depuis le début que \"Israël a le droit de se défendre\" (ce qui est difficilement attaquable), alors que dans les faits, ils soutiennent les actions d'Israël, y-compris dans ses actions les plus immondes.",
            ">Bizarre de les mettre au même niveau \n\nNon effectivement, parmi les trois il y en a un seul qui est colonialiste dans son ADN, je serais de mauvaise foi de les comparer. \n\nTa définition d'anti-sionisme ne fait pas la différence entre état et pays, ce qui est fâcheux. C'est à cause de cette subtilité qu'il y a des juifs israéliens anti-sionistes par exemple, ou des arabes israéliens sionistes. \n\nQuant au reste, j'avoue que l'argument \"les démocraties et le camp du bien ne peuvent pas être critiquées sans que cela soit ethnique\" me parait totalement abscons.",
            "\n>C'est pas parceque t'es majoritaire que t'as raison.\n\nPourquoi on fait pas confiance aux juifs pour savoir ce qui est antisemite ? C'est pas majoritaire la, c'est casi-unanime. 92% c'est pas une petite majorité. \n\n\n\n>LFI a dit quoi? Parce qu'on tourne en boucle dessus depuis des semaines mais ya rien de réel qui sort. On le répète tellement souvent qu'on pourrait croire que Mélenchon est le pire antisémite depuis 1945 et ya aucune plainte déposée...\n\nhttps://x.com/senateur_binks/status/1802273875952013781\n\nTiens ça permettra ptet de comprendre que y a un problème.",
            "Utiliser par une grande partie des sionistes et ce avant même qu'Israël soit créé.",
            "Tout à fait, pour dire exactement l'inverse. Comme quoi il y a des extrémistes des deux côtés.",
            "https://fr.m.wikipedia.org/wiki/Du_fleuve_%C3%A0_la_mer pour le contexte et Rima Hassan pour le choix de cette expression très polémique.",
            "Ta connaissance du slogan est factuellement fausse. Il est utilisé par les Israéliens pour exterminer les Palestiniens, et par les Palestiniens pour exterminer les Israéliens. Tu répètes les mensonges de LFI sur le sujet.",
            "Fournir un endroit où les Juifs puissent vivre ensemble et assurer leur sécurité, aucun souci sur le principe.\n\nLe fait d'avoir choisi l'emplacement actuel, par contre... ne serait-ce qu'avoir choisi un point revendiqué par trois religions majeures, et qui a été l'enjeu de plusieurs croisades / jihads, c'était une connerie monumentale. Ne pas avoir accordé à Jerusalem le statut de ville internationale (genre, sous l'égide de l'ONU), c'est une connerie aussi.\n\nJ'ai pas de bonne réponse sur un emplacement alternatif, mais cet endroit-là, ça a juste été mettre de l'huile sur le feu, en fait.\n\nAccessoirement, ça semble être un choix bien plus \"religieux\" que simplement \"politique\", puisque c'est un territoire revendiqué bibliquement. Alors que filer un bout d'Alaska ou de Sibérie, par exemple, y'aurait eu vachement moins de compétition pour le territoire (alors que ça reste vivable aussi), et donc beaucoup moins d'emmerdes par la suite.",
            ">Israël est un état colonial fondé sur la terreur. \n\nNon. \nEt on pourrait dire ça de la Palestine, ouvrez un livre d'histoire. \n\n>Cela n'a rien avoir avec ceux en quoi ils croient comme religion, mais comment ils agissent et le mal qu'ils font.\n\nIl y a juif et Juif, le peuple et la religion, ça se superpose mais ce n'est pas la meme chose, vous ne maitrisez pas le sujet.\n\n\n>Les Israéliens ne représentent pas les juifs, ils représentent que eux même.\n\nIsraël est peuplé majoritairement de juif, et concentre la moitié de la population mondiale de juifs. \n\n>Les colons français en Algérie était aussi des terroristes en puissance, tout comme les colons européens en Amérique du nord ou du Sud.\n\nIsraël est peuplé majoritairement de sepharades et de mizrahim, qui sont des réfugiés ayant fui les pays arabes.\n\n\n>Toute israélien n'étant pas contre la colonisation et l'apartheid, c'est a dire la grande majorité sont des terroriste dans le sens où ils utilisent la terreur a des fins politiques quotidiennement et sciemment ;\n\nNon, il y a une difference entre soutenir la colonisation en Cisjordanie et utiliser des moyens terroristes pour y parvenir. \nEt les Israéliens ne soutiennent pas tous la colonisation en Cisjordanie. Par contre Israël n'est pas une terre colonisé, désolé, c'est l'inverse.\n\n>C'est la manière dont est organisé leurs sociétés qui veux cela \n\nVous ne connaissez rien à la société israélienne ni palestinienne, vous n'y avez jamais mis les pieds. Vous dites des conneries, j'y ai été, en Cisjo et en Israël, vous n'y auriez passé qu'une journée vous comprendriez la betise de vos propos.\n\n\n>A force de voir de l'antisémitisme partout et pour absolument rien, vous faites extrêmement du mal a la lutte contre ce racisme ignoble.\n\nOui oui, vous dites que la majorité des juifs sont des terroristes mais c'est pas antisémite.",
            "Si tu pense qu'être juif c'est \"ce en quoi ils croient comme religion\", ton opinion sur l'antisémitisme n'a vraiment aucun intérêt.",
            "OK, je me suis trompé. Au temps pour moi.\n\nJe ne pense pas que ça remette en cause le fond de la question : Israël n'oppresse pas la population palestinienne depuis 70 ans pour le retour de 4 otages enlevés après 2014.",
            "Je suis bien d'accord qu'Israel manque de sanctions internationales, et qu'à la fin ce sont les palestiniens qui, une fois de plus, sont ceux qui morflent.\n\nMai le Hamas n'est pas un parti de résistance, il ne cherche pas à reprendre stratégiquement le terrain, il ne cherche que la vengeance la plus meurtrière qui soit au nom des siens.",
            "Je pense qu'ils faut juste les assimiler et qu'ils deviennent citoyens à part entière d'Israël. Les laisser se mettre en communauté c'est prendre le risque du retour de l'intégrisme islamiste notamment avec l'influence du hezbollah, du Qatar et de l'Iran tout autour, et reconduira à encore plus de violence.",
            "C'est pour cela qu'il ne faut jamais dire \"Israël a le droit de se défendre\" (ce qui est plus l'opinion d'un Habib ou d'une Braun-Pivet) mais bien \"Israël a le droit de se défendre dans le respect du droit international\". En l'occurrence, Tsahal s'assied allègrement sur la deuxième partie.",
            "Non je comprends pas le problème.\nDans le gouvernement israélien actuel, certains ministres pensent que le territoire palestinien leur revient en totalité car ils sont ''le peuple élu ''.\n\nJe trouve ça bien de pas les laisser y croire sans rien dire. En quoi c'est antisémite de dire ça?\nTu penses que les juifs sont supérieurs aux autres ?\n\n\n\n\nLes juifs ont déjà fait des erreurs gravissimes dans les années 30-40, ceux qui ont quitté l'Allemagne en se disant que ça allait mal tourner ont été la cible de moquerie...",
            "C'est con, parce que moi non-plus, je crois pas aux peuples *supérieurs aux autres*. Et tout peuple qui se considère comme *élu* se met, à mon sens, le doigt dans l'oeil, jusqu'aux orteils (le coude étant un peu trop proche, à ce niveau-là).\n\nC'est pas antisémite de dire que pour moi, les Juifs sont un peuple *comme les autres*, ni supérieur, ni inférieur, et certainement pas \"favorisé par Dieu\" (encore faudrait-il que je croie en Dieu pour pouvoir leur accorder ce point).\n\nDonc parmi les Juifs, y'a des gentils, des méchants, des intelligents et des cons, des beaux, des moches, etc... ils sont **humains**, comme les autres, en fait.\n\nEt donc, critiquer ceux qui ont des opinions problématiques, c'est pas une critique envers *tous* les Juifs. Dire que *certains* Juifs posent problème, c'est pas une critique des Juifs. Critiquer la politique d'Israël, la politique d'un gouvernement (d'extrème-droite, soit dit en passant), c'est pas critiquer le droit des Juifs de vivre en paix et en sécurité. De la même manière que critiquer Macron et le gouvernement Français, c'est pas critiquer *tous* les Français, en fait.\n\nCe serait bien de moins écouter les extrémistes Juifs (ceux qui ont tout intérêt à ce qu'on confonde critique de leurs idées et critique des Juifs en général), ceux qui crient à l'antisémitisme dès qu'on ose critiquer Israël (ou une personnalité se trouvant être Juive, même si on l'ignorait auparavant), tout ça. Ca dessert vraiment la cause, en fait.\n\nComme le fait d'avoir critiqué Mélenchon et crié à l'antisémitisme pour avoir dit que Yaëlle Braun-Pivet était allée \"camper\" en Israël. \"Oh, le méchant, il ose parler d'un *camp* pour une dame Juive, c'est antisémite\"... bah, euh, non, pas spécialement, en fait. Surtout si la dame ne se tatoue pas une étoile de David, c'est pas marqué sur sa tronche \"attention, ne pas utiliser certains mots, qui pourraient être mal pris\"...\n\nJ'ai, pour ma part, sérieusement l'impression que tout est fait pour aller chercher *le* mot qui pourrait discréditer un propos, même si le lien est super ténu, en fait, plutôt que de chercher à répondre aux arguments sur le fond. C'est plus \"confortable\" pour les défenseurs de cette politique, puisque ça évite d'avoir à répondre aux critiques (pourtant légitimes) sur celle-ci.",
            "Bah je sais pas, ça a l'air d'aller pour Israël en ce moment non?\n22 employés de la croix rouge tués hier au calme.\nTu me rappelle combien Mélenchon et Rima Hassan ont buté d'Israéliens ?",
            "Rima Hassan a été on ne peut plus claire : elle parle de la volonté de créer un état binational et laïc.",
            "Tant je comprends que ça puisse être antisioniste, tant j'ai pas compris le caractère antisémite. Même l'article n'explique pas le raisonnement.",
            "Ce slogan est devenu un slogan mainstream qui n'a absolument pas cette signification.\n\nQue des extrêmistes l'utilisent ne le dévoie pas de son sens le plus couramment utilisé.",
            "Merci j'allais casser mon ordi à force de lire ces énormités pareilles écrites par des petits bourgeois si sûrs d'eux dont la seule référence juive est Tsedek",
            "Ça n'invalide pas le reste de ton propos (effectivement pas la crise des otages qui a déclenché l'occupation), mais ça donne l'impression que tu ignores un détail basique. Du reste, le blocus de Gaza n'a pas 70 ans non plus, il date de 2007 (prise de pouvoir par le Hamas à Gaza).",
            "Il y a une importante minorité juive séfarade dont les membres ont des difficultés à s'intégrer. Ceux-ci sont méprisés car ils ne sont pas Européens ashkénazes. Si ça ne marche pas entre juifs, ça va être compliqué pour les Palestiniens. Et perso, même si ils y arrivaient, ça se passera très mal s'il n'y a pas au moins des réparations.",
            "vu qu'Israël se considère comme un \"état juif\" à part entière, l'assimilation serait surtout une fin pure et simple d'un peuple palestinien (à moins que tout change en Israel mais je n'y crois malheureusement pas).  \nPour moi il faut reconstruire un état palestinien en Cisjordanie, en permettant aux gazaouis de se reconstruire là-bas",
            "Comme je le disais, si ils attaquent des quartiers civils, c'est pas de la défense. Mais bon, c'est pas nouveau qu'Israël s'asseoie sur les résolutions de l'ONU, du TPI, ou autres...",
            ">Je trouve ça bien de pas les laisser y croire sans rien dire. En quoi c'est antisémite de dire ça? Tu penses que les juifs sont supérieurs aux autres ?\n\nNon, vous ne comprenez pas ce que signifie cette notion pour les juifs, vous l'utilisez pour attaquer les juifs sans la comprendre\n\nhttps://x.com/chocapicjew/status/1350589174504595456\n\n\nDans le précèdent lien, il y a plusieurs dizaines d'autres remarques cités de LFI. Je vous envoyais le thread complet pas juste cette remarque.",
            "> C'est con, parce que moi non-plus, je crois pas aux peuples supérieurs aux autres. Et tout peuple qui se considère comme élu se met, à mon sens, le doigt dans l'oeil, jusqu'aux orteils (le coude étant un peu trop proche, à ce niveau-là).\n\nLe terme \"élu\" est biblique est ne sous-entend aucune supériorité des juifs vis-à-vis des autres peuples, il s'agit d'un terme religieux qui souligne l'alliance entre dieu et les juifs et leur rapports \"privilégiés\"\n\nIl n'y a pas de connotation raciale",
            "Ça va super bien pour Israël qui a vécu le pire pogrom de son histoire il y a 8 mois et qui va bientôt devoir faire la guerre au Hezbolla👌",
            "LFI fait de la la \"plausible deniability\" : ils utilisent des mots qui sont des dogwhistles très clairs (\"de la rivière à la mer\" ou \"dragons célestes\") puis font les naïfs offusqués quand on leur fait remarquer le fond des termes qu'ils emploient.\n\n\nLibre à toi de penser que Rima Hassan a utilisé cette expression sans connaître sa connotation pour promouvoir une solution pacifique avec un seul Etat comme elle l'explique. Cela suppose qu'elle est complètement ignorante d'un sujet dont elle est censée être experte mais bon, on n'est pas à une contradiction près.\n\n\nQuand tout le parti continue cette tendance, j'ai plutôt l'impression qu'ils savent ce qu'ils font et qu'ils surfent sur la limite de l'antisionisme/antisémitisme par électoralisme. Et voir les commentaires comme les tiens se précipiter pour les défendre, ça en dit long sur l'absence de principe tant que \"mon camp gagne\".",
            "\"From the river to the sea\" sous-entend la destruction d'Israël et renie donc aux juifs le droit à l’autodétermination\n\nOn ne parle donc pas ici de solution à deux Etats",
            "C'est marrant parce que je suis sûre que tu ne tiendrais pas le même discours sur des expressions venues de l'extrême droite",
            "Je n'ai pas dit que le blocus datait d'il y a 70 ans.\n\nMerci de ta correction sur les otages.",
            "Les choses sont en train de changer en Israël. C'est un pays démocratique dont une part conséquente de la population viens des pays de l'Europe ou de l'Amérique du Nord. Dans les 20 - 30 prochaines années, les influences théocratique vont disparaître petit à petit. Et ça a déjà commencé.",
            "Israël continue de coloniser et opprimer en Cisjordanie donc c'est aussi impossible. C'est un état impérialiste ethno-nationaliste, ils veulent leur Lebensraum et se considèrent supérieurs aux Untermensch.",
            "Ah oui mais a un moment, s'ils ne veulent pas que les gens utilisent ce terme, il faut que les fachos israéliens arrêtent de l'utiliser aussi.\nBen Gvir l'a utilisé en disant même qu'il faudrait utiliser la bombe nucléaire pour raser la Palestine.\n\nLes Israëliens, du moins une partie, mais c'est celle qui commande; utilise ce terme pour justifier le grignotage du territoire palestinien depuis des décennies.\nTu permets donc que ceux qui luttent contre le gouvernement israélien actuel puissent l'utiliser.\nS'ils estiment qu'il est raciste, qu'ils utilisent un autre terme.\n\n\nEt tu ne réponds pas à mon message précédent. Si LFI est antisémite, pourquoi ne prend elle pas des procès plein la gueule comme les Lepen, Soral, Dieudonné et autre?",
            "J'avais écouté une interview d'elle, elle est extremement claire : elle dit qu'elle a un avis ocmplètement minoritaire, y compris dans son propre parti, et elle sait qu'on va la traiter de \"hippie\" en gros pour son histoire d'Etat binational (qui paraît, en première analyse, complètement absurde vu la situation actuelle).\n\nJe vois pas trop a plausible deniability là dedans : elle est plutôt très claire qu'elle défend un projet politique inaudible, minoritaire et qui va lui rapporter que des problèmes (voir le harcèlement qu'elle subit). Ça me semble plutôt honnête au contraire, on peut la traiter de menteuse, mais ça me paraît bien idiot, elle a pas grand chose à y gagner. Le coup de l'antisionisme électoral est un peu étrange : soyons clairs, le sous-entendu (Ruth Elkrief et son commentaire sur le \"communautarisme\" ambigu il y a quelques jours le prouve encore) évident c'est qu'on parle des musulmans, faut dire les termes. C'est à dire une population statistiquement plus pauvre, habitant plutôt dans des quartiers populaires, minoritaire dans le pays, détestée d'une très large partie du pays (ça se saurait si les positions anti-musulmanes étaient disqualifiantes en France) et qui vote pas ou peu. C'est quand même un calcul très bête, à quel moment ça pourrait pas être sincèrement leur position ?\n\nAprès c'est en effet une position critiquable pour plein de raisons, en dehors d'un clientélisme.\n\nLe coup des \"dragons célestes\" c'est pas elle mais Guiraud et là par contre c'est juste une connerie indéfendable, surtout pour un gars qui reconnait avoir été influencé par Soral étant plus jeune. Là oui je pense qu'il y a du clientélisme en mode \"clin d'oeil\". Mais ça me paraît incomparable entre Guiraud qui est rentré par cet angle et une personne Franco-Palestinienne visiblement très concernée par le sujet.",
            "Qu'elle est l'intérêt d'être limite antisémite électoralement?\nAccueillir les votes populaires maghrebins qui de toute façon ne vote pas?\nEn ce mettant a dos le reste des français ?\n\nJe l'ai expliqué plus haut, l'expression'' de la rivière a la mer'' est utilisé des deux côtés. Et Rima Hassan parle depuis plusieurs années d'un état unique et laïc avec les juifs et les musulmans intégrés dedans.",
            "Déjà, amalgamer \"de la rivière à la mer\" avec l'histoire des dragons célestes, c'est juste absurde. Il s'agit bien de deux choses différentes. Belle tentative de moving the goalpost en tout cas. \n\nLes accusations de tenir tel ou tel type de propos par \"électoralisme\", on ne les entends que lorsqu'il s'agit de LFI. Sauf que... bah en fait, c'est une accusation qui pourrait tenir pour : toutes les prises de paroles de tous les partis tout le temps. Eric Ciotti mange une socca sur un marché ? Electoralisme. Macron tient des propos transphobes ? Electoralisme. Etc etc. En fait, c'est une accusation absolument inepte parce qu'elle ne dit rien. \n\n\"se précipiter pour les défendre\"\n\nAh ouais ? J'avais plutôt l'impression de rapporter ce que Rima Hassan dit de tout cela. Juste rapporter son avis. \n\n\"ça en dit long sur l'absence de principe tant que \"mon camp gagne\".\"\n\nDéjà, je n'ai pas de camp chez LFI (et vous devriez d'ailleurs faire attention à l'utilisation de ce mot, on en a accusé certains d'antisémitisme pour avoir dit que \"Braun-Pivet allait camper\" alors bon...). Pour tout dire, j'en ai rien à cirer de LFI. Mais absolument que dalle. \n\nPar contre, accuser quelqu'un de \"manquer de principe\" quand on fait preuve d'autant de mauvaise foi que vous ça ne manque pas de sel. \n\nRevenons à cette histoire d'état laïc bi-national. En quoi il y aurait quelque chose d'antisémite là-dedans ? Il semble que la solution à deux états soit enterrée depuis un moment. La proposition d'un seul état pour deux peuples n'est pas si absurde que ça.",
            "dans 20-30 ans il sera peut être trop tard malheureusement...",
            "ça reste plus simple que d'avoir un état palestinien fort dans Gaza et en Cisjordanie...",
            ">Ah oui mais a un moment, s'ils ne veulent pas que les gens utilisent ce terme, il faut que les fachos israéliens arrêtent de l'utiliser aussi. Ben Gvir l'a utilisé en disant même qu'il faudrait utiliser la bombe nucléaire pour raser la Palestine.\n\nOn parle des juifs français pourquoi leur reprocher ce que dit un ministre d'extreme droite d'un pays étranger ? \n\n\n>Et tu ne réponds pas à mon message précédent. Si LFI est antisémite, pourquoi ne prend elle pas des procès plein la gueule comme les Lepen, Soral, Dieudonné et autre?\n\nTu sors la même chose aux femmes victimes de VSS ?",
            "LFI parle à son électorat le plus fidèle.\n\nArrivé en tête dans 3 départements pour les européennes. Le 93 (son plus score), le 95 et la Martinique.  \n\nArrivé largement en tête aussi à Vaulx-en-Velin, Venissieux, Bron, Quartiers nord de Marseille, Trappes, Les Mureaux, Mantes la Jolie ....\n\n\nEt oui la gauche va perdre les élections en partie à cause de l'entêtement fe LFI sur ce sujet en particulier. Ca a fonctionné pour faire le carton  p’ein dans les quartiers. Mais ça a dégouté une bonne partie du reste de la population.",
            "Mélenchon a toujours été clair que sa stratégie est de mobiliser les abstentionnistes de banlieues populaires. Je suis d'accord que c'est probablement une mauvaise stratégie mais c'est bien celle de LFI.\n\n\nÊtre \"limite antisémite\" est donc bien un moyen d'attirer ceux qui sont alignés avec ça en évitant de s'aliéner ceux qui ne le tolèrent pas. Ça marche plutôt bien vu les commentaires qui défendent LFI sur le sujet et font semblant de ne pas voir de problème avec leur approche ",
            ">Revenons à cette histoire d'état laïc bi-national. En quoi il y aurait quelque chose d'antisémite là-dedans ? Il semble que la solution à deux états soit enterrée depuis un moment. La proposition d'un seul état pour deux peuples n'est pas si absurde que ça.\n\n\nCe n'était évidemment pas le sujet de la discussion du tout mais belle tentative, après m'avoir dit que j'étais probablement antisémite. On va s'arrêter là, j'ai l'habitude de tes commentaires et ça n'amène jamais rien de très utile.",
            "Ça sert a rien de mobiliser les banlieues populaires si tu perds le reste de ton électorat.\n\nOn fait pas semblant. Avec les chiens de gardes des organisations juives comme l'UEJF, la Licra ou le CRIF qui déposent plainte au premier pas de travers, tu penses bien que s'il y avait quoi que ce soit il y aurait déjà eu des procès contre LFI.\nLes seuls qui ont été condamnés pour antisémitisme ici, c'est le Rassemblement National.",
            "\"après m'avoir dit que j'étais probablement antisémite.\"\n\nGenre le truc que j'ai dit... absolument nul part. Faut aller toucher de l'herbe là.\n\nEDIT : il m'a bloqué. Bien joué.",
            ">  Ça sert a rien de mobiliser les banlieues populaires si tu perds le reste de ton électorat.\n\n\nEn effet, et on voit bien LFI chuter dans les sondages et Mélenchon être là personnalité la plus clivante pour les français. Il n'y a que LFI qui n'a pas encore compris que c'était une stratégie stupide.\n\n\n>Les seuls qui ont été condamnés pour antisémitisme ici, c'est le Rassemblement National.\n\n\nJe ne suis pas plus pour le RN que pour LFI. Ce n'est pas faux mais c'est juste détourner l'attention : \"LFI n'est pas antisémite parce que Oh regardez là-bas, le RN !!\"",
            "N'hésite pas à relire ce que tu écris, cela te permettrait de savoir de quoi on parle. \"Toucher de l'herbe\", cette expression magique."
        ]
    },
    "Caricature de Soulcié dans Mediapart": {
        "title": "Caricature de Soulcié dans Mediapart",
        "score": 192,
        "url": "https://i.redd.it/pa3slaeb138d1.jpeg",
        "content": "",
        "num_comments": 12,
        "comments": [
            "\"Rions tant qu'on peut\"\n\nPutain ouais. L'avenir s'annonce pas jouasse.",
            "En plus Macron, il joue avec l'argent des autres. Même s'il perd, il sera encore président pendant 3 ans. Ceux qui vont payer, c'est les députés de Renaissance qui ont commis l'erreur de croire en lui. Et puis la France, ensuite.",
            "En soirée du 30 juin prochain:\n\n*\"- Cette dissolution, c'est le peuple qui l'a voulu.\"*",
            "Sauf qu'à la différence de Winamax, les perdants, ce sera toute la France.",
            "Maintenant je veux les mêmes chaussettes bordel !\nCœur cœur sur toi Killian.",
            "Attention à pas le prendre au premier degrés, demander aux français de voter n'est pas un jeu de hasard ou une perte de crédibilité dans la vrai vie :)",
            "Pas mal, bien trouvé !",
            "Excellent !!",
            "Première fois de ma vie qu'une caricature me fait rire",
            "Avec la censure des médias si/quand le FN passe, ça sera pas jojo",
            "Pourquoi la censure ? Remplacer les chaînes du service public par Russia Today est un beau projet !",
            "Ça sera pas jojo même sans RN vu ce qui est en train de se profiler dans le service public."
        ]
    },
    "Législatives 2024 : le ton commence à monter aussi entre les économistes": {
        "title": "Législatives 2024 : le ton commence à monter aussi entre les économistes",
        "score": 223,
        "url": "https://www.lesechos.fr/elections/legislatives/legislatives-2024-le-ton-commence-a-monter-aussi-entre-les-economistes-2103173",
        "content": "",
        "num_comments": 268,
        "comments": [
            "De Julia Cagé au Prix Nobel Esther Duflo, plusieurs économistes en vue contribuent au programme du Nouveau Front populaire. D'autres, tels qu'Olivier Blanchard ou Philippe Aghion, sont très critiques. Aucun économiste ne s'affiche en revanche ouvertement au côté du RN.\n\nLes économistes de gauche montent sur le ring politique. Ce vendredi, trois d'entre eux ont rejoint sur l'estrade les représentants du Nouveau Front populaire qui présentaient à la presse leur programme économique  : Julia Cagé, professeur à Sciences Po, Eloi Laurent de l'Observatoire français des conjonctures économiques (OFCE), et Eric Berr, co-animateur du département économie de l'Institut La Boétie, un think tank proche du leader LFI, Jean-Luc Mélenchon.\n\n« C'est un programme crédible sur le plan économique. C'est pour cela qu'on est là pour le défendre. En face de chaque dépense, on a mis une recette », s'est enflammée après la présentation Julia Cagé tout en assurant devant quelques journalistes qu'elle « n'était pas encartée ».\n\n« Provoquer un choc de confiance »\nTous ont d'ailleurs tenu à préciser qu'ils avaient été sollicités en tant qu' « expert », « invités à porter un regard indépendant », selon Eloi Laurent. Leur conviction est néanmoins que « sept années de Macronisme ont fracturé la société ». « L'intérêt de ce programme est de provoquer un choc de confiance. Car en économie, sans confiance rien n'est possible », a défendu Eric Berr.\n\nEgalement soutenues par Thomas Piketty, Michael Zemmour ou Esther Duflo, Prix Nobel d'économie et spécialiste de la pauvreté, les mesures proposées par l'union des gauches inquiètent en revanche au plus haut point le patronat et la majorité présidentielle par l'avalanche des dépenses et une hausse sans précédent de la taxation qu'il prévoit.\n\nDaniel Cohen, mentor commun\nCe ne sont pas les seuls à être critiques. Ce vendredi, l'ancien chef économiste du FMI, Olivier Blanchard, a jugé sur X que le programme du Nouveau Front populaire était « plus dangereux » que celui du Rassemblement national , avec un long développement à la clef. Olivier Blanchard, qui se revendique social-démocrate, souligne l'aspect confiscatoire des mesures proposées, à la différence d'un programme de gauche qui viserait la redistribution tout en préservant les incitations à la création de richesse.\n\n« J'aimerais avoir une discussion économique avec lui », a réagi Julia Cagé rappelant qu'il avait été à l'origine de la politique « catastrophique » menée en Grèce au lendemain de la crise financière. Ambiance…",
            "Pour une fois qu'on a un débat sur la politique économique du pays, on devrait les encourager.",
            "Je suis surpris qu'il y ait une telle disparité d'avis au sein de la \"communauté\" des économistes. Je veux dire, on passe quand même du jour à la nuit, comment est-ce possible qu'ils ne soient à ce point pas d'accord ?",
            "Duflo n’a pas contribué au programme du NFP. Elle soutient la gauche mais c’est tout. Il n’existe aucune source montrant qu’elle a soutenu le programme économique.",
            "Dans ce thread : les Redditeurs ne comprennent pas le concept de \"science sociale\", épisode 480075.",
            "Je ne sais pas si tout le monde prend mesure des enjeux d'une élection du NFP :\n\nCôté pile, si leur programme économique se réalise, c'est un fait majeur : ils font voler en éclat le fameux TINA de Thatcher en montrant qu'il existe une autre politique qui soit viable que celle des libéraux du centre.\n\nCôté face, s'ils se plantent, on risque une crise budgétaire majeur. Avec les conséquences sur les plus vulnérables d'entre nous.\n\nJe ne sais pas pour vous mais moi, j'ai l'impression de jouer aux dès là. Je m'y connais juste assez en économie pour savoir que je ne m'y connais pas assez pour me faire un avis rationnel.",
            "Ce serait bien que ce genre d’article précise quels économistes sont orthodoxes et quels économistes sont hétérodoxes. Il y a une grande différence entre un économiste qui analyse les programmes selon la ligne standard de le recherche académique en économie, et un économiste qui les analyse selon un prisme plus idiosyncratique, ou en tout cas non-mainstream.",
            "Le FMI comme boussole qui indique le Sud.  Je prends",
            "Trop drôle Eric Berr était mon prof d’économie politique à la fac de Bordeaux",
            "Les météorologues sont plus précis que les économistes. C'est un domaine trop chaotique pour prétendre avoir raison.",
            "S'ils veulent être pris aux sérieux, ils devraient surtout être sous aucune étiquette politique. Ca casse illico leur argumentation à mon goût.",
            "Quand tu lis les sciences économiques, tu te dis qu'une bonne partie devrait être reversée à la théologie.",
            "Pas de consensus, il faut continuer les recherches.On est d'accord que c'est plus des militants que des chercheurs, prix Nobel ou pas (on la connait l'histoire des Nobel qui déraillent)",
            "L’âge de départ à la retraite aurait dû passer à 65 ans minimum depuis bien longtemps.",
            "En 2022 déjà, Thomas Piketty, Julia Cagé et l'économiste Gabriel Zucman, qui a conseillé le démocrate Bernie Sanders aux Etats-Unis, s'étaient engagés avec d'autres de leurs confrères dans la campagne pour soutenir la Nupes. Les trois experts comme Esther Duflo, aujourd'hui à la tête de l'Ecole d'économie de Paris, ont plusieurs points communs : ils ont eu le même mentor, l'économiste Daniel Cohen, disparu l'été dernier. Tous ont beaucoup écrit sur les inégalités. Tous sont aussi reconnus dans le monde entier, certains à l'image de Gabriel Zucman ou Esther Duflo ayant passé de longues années aux Etats-Unis.\n\n« Les Horace » du RN\nLe Rassemblement national, lui, ne fait pas appel a priori aux économistes. En tout cas, aucun expert des chiffres n'est réputé travailler pour le parti d'extrême-droite. « Et si c'est le cas, ils ne le revendiquent pas », pointe un observateur. Au sein du parti, deux hommes s'expriment sur les questions économiques : Jean-Philippe Tanguy, député sortant et ancien membre de la commission des Finances de l'Assemblée nationale, et Renaud Labaye, ancien de Bercy passé par HEC et secrétaire général du groupe RN à l'Assemblée avant la dissolution.\n\nTous deux sont entourés de « quatre, cinq personnes » extérieures au parti, a précisé ce dernier à « Politico » : « Les Horace », une équipe constituée de technocrates et d'hommes d'affaires. A l'approche du scrutin, ces derniers surveillent comme le lait sur le feu l'impact budgétaire des mesures présentées et les réactions qu'elles suscitent. Quitte à faire évoluer de jour en jour les propositions du RN.\n\nPour cette campagne des législatives anticipées, le camp présidentiel, qui mise il est vrai sur la continuité plutôt que sur un nouveau projet, se repose peu sur les économistes. Un certain nombre d'entre eux ont pris leurs distances avec Emmanuel Macron, à l'image de Jean Pisani-Ferry, architecte du programme de sa campagne présidentielle de 2017. Sur France Inter celui-ci a estimé que le « pari » fait par la majorité sortante qu'en augmentant le taux d'emploi, on allait redresser les comptes », a « échoué ».\n\n« Il faut rester au centre »\nLa politique de l'offre défendue par le chef de l'Etat conserve néanmoins les faveurs de beaucoup d'experts. « Les programmes du Nouveau Front populaire et du RN sont irréalistes. Il faut rester au centre », plaide l'économiste et professeur au Collège de France, Philippe Aghion. Pour lui, « la politique économique mise en oeuvre depuis 2017 a été la bonne » : « Elle a rendu la France attrayante pour les investisseurs étrangers et a généré de nombreuses créations d'emploi. Mais il y a eu un déficit de dialogue et les sacrifices n'ont pas été suffisamment partagés. C'est là où le bats blesse, d'où l'urgence d'un changement de méthode de gouvernement », dit-il.\n\nLa campagne passionne en tout cas nombre d'économistes au vu des messages virulents qui ont fleuri ces derniers jours sur les réseaux sociaux.",
            "> chef économiste du FMI\n\nTu m'étonnes, l'institution du néocolonialisme mondial par excellence. Responsable de la pauvreté de centaines de millions et donc de la mort des centaines de milliers de personnes dans les pays du Sud.",
            "Maître de conférences en économie, j'apporte ma pierre. \n\nL'économie reste une science humaine. Il y a des théories économiques pas une seule et elles peuvent être en contradiction.\n\nSans rentrer dans de détails de ce qui peut être critiqué dans le mainstream ou le non mainstream, de ce que je peux avoir comme critique sur les pratiques de certains confrères/consoeurs etc je vais essayer de donner une explication simple de pourquoi y'a des désaccords.\n\nD'abord il faut savoir que de manière très large les économistes sont d'accord sur énormément de choses. Même les hétérodoxes et les orthodoxes ont beaucoup d'accord sur des éléments fondamentaux. Là où on va avoir des différences c'est quand il s'agit de faire des recommandations de politiques publiques. Deux économistes peuvent analyser une situation réelle de départ de manière différentes menant à des préconisations différentes. Ils peuvent également avoir une vision totalement différente du rapport entre politique et économique. L'économie reste une institution humaine qui n'a potentiellement pas de lois immuables. Certains économistes ont une vision naturalisante de l'économie (\"ça fonctionne ainsi et donc on peut pas faire n'importe quoi\") d'autres ont une vision plus constructiviste et normative (\"notre société a besoin de faire une transition écologique, ou désir plus de justice sociale etc : comment construire et mettre en place des institutions économiques qui vont dans ce sens tout en restant viables économiquement?\"). De fait ces deux visions de l'objet d'étude vont amener à des préconisations différentes. \n\nLe truc c'est que ce rapport à l'objet est pour le coup pas l'objet fondamental des travaux en économie. Du coup ça dépend des convictions des scientifiques sur leur métier.\n\n\nAprès il faut rajouter à tout ça la sociologie des scientifiques eux même. Parce que oui on a tous des biais qui nous traversent, étant nous même part de la société. Ce qui fait l'objectivité de la science c'est le pluralisme des scientifiques dans leur ensemble, pas que chaque scientifique soit objectif (c'est impossible).",
            "Je fais un parallèle foireux : imaginons un autre domaine où on est d'accord sur le constat : y'a moins de blancs que de gens de couleur en prison (je sais pas les chiffre, c'est juste pour avoir un exemple parlant)\n\nEt bah de là, deux écoles de pensées sur un même constat : 1- Ils sont culturellement violents 2- Ils sont statistiquement plus pauvres\n\nEt donc deux constats sur un même fait apportent deux lots de solutions radicalement différents\n\nBah là c'est pareil mais en économie",
            "Pace que l'économie est une pseudoscience. Je sais que c'est très impopulaire mais c'est la vérité. Au minimum ce n'est pas une science empirique, ça personne ne peut dire le contraire.",
            "L'économie c'est un peu comme l'histoire, ca marche vachement bien pour expliquer le passé, par contre pour prédire le futur c'est pile ou face.\n\nSuffit de regarder les crises de 2008, 2000, le krach pétrolier, 1930: tous les experts vont te faire un séminaire de 8 heurs en t'expliquant minutes par minutes que c'était prévisible, inévitables, etc. par contre ceux qui ont prévu a l'avance ce compte sur les doigt d'une main et sont pris pour des pessimistes ou des fous",
            "Comme beaucoup de domaines, tu as toujours un % de \"spéciaux\". Wakefield, Oz ou Raoult en medicine, par example.\n\nAprès tu as aussi des visions \"morales\" pour certains economistes moins...objectifs. Ils sont plus populaire à la tele du coup.",
            "Clairement. Et comme elle serait loin de son champ de spécialité elle préfère ne pas se mêler aux débats",
            "Oui mais les sciences sociales c'est des trucs d'islamogauchiste >:(",
            "Entendre dire que l'économie c'est comme l'astrologie, je pense que je vais envoyer ce fil à mes potes thésard en éco pour leur dire que leur thèse c'est du vent tiens",
            "Oui mais la moitié des redditeurs détestent les sciences sociales et les considèrent comme des sous-science, donc leur monde se bouleverse un peu faut les comprendre.",
            "Plus un programme économique est ambitieux, plus les risques sont importants. Si on veut gagner la confiance des électeurs il faut leur apporter des garanties à la hauteur, avec l'assurance que si ça ne fonctionne pas on pourra faire marche arrière sans trop de dégâts.",
            "Si ils se plantent c'est pas que les plus vulnérables qui vont prendre.",
            "Oui parce que Macron a pas massivement creusé le budget aussi ...",
            "Si ça peut te rassurer les plus vulnérables ils en prennent déjà plein la gueule. Donc ton paris en résumé c’est plus :\n\nPile on change tout pour le mieux\n\nFace on continue comme avant",
            "Je rajoute tout de même un élément : la pièce est lestée \n\nLes marchés financiers vont peut-être réagir de manière hyper hostile au NFP ce qui les empêcheront de mener leur politique",
            "Sachant que les deux alternatives sont strictement pires dans tous les cas, joue aux dés.",
            "Il y a une possibilité bien plus probable que total succès ou plantage.\n\nIls appliquent quelques politiques qui marchent, d'autres qui tournent plus mal, ils le réalisent et renoncent à en appliquer d'avantage / adaptent leur programme pour finir d'une manière plus gestionnaire.\n\nA la limite si on était dans un gouvernement 100% gauche radicale très idéologique un scénario \"crise budgétaire majeure\" suite à obstination pourrait être à craindre, mais avec une moitié de socio démocrates dans l'alliance (voire plus selon comment on compte EELV) c'est très improbable qu'une application totale du programme soit privilégiée à son adaptation si l'économie commençait à vraiment décrocher.\n\n(edit : ou même deux d'ailleurs, il y a aussi la possibilité où le programme est appliqué et sans avoir de résultats mirifiques n'en a pas de si mauvais que cela conduise à plus de crise que les politiques actuelles)\n\nps : par contre en parlant de crise budgétaire majeure, j'arriverais au pouvoir j'ordonnerais un audit aussi rapide que possible des comptes, vu l'empressement de Macron à vouloir refiler la patate chaude à d'autres, c'est là où un *vrai* scénario à la grecque est à redouter, je le crains.",
            "Bah, on appellera Delors à la rescousse",
            "Sachant qu'en vrai on a déjà lancé les dés et pour le moment ça penche plus coté face que coté pile.",
            "De ce que je lis que le NFP ou le RN gagne c'est la merde économiquement, mais c'est surtout parce qu'on est déjà en train de couler: [https://www.theguardian.com/world/article/2024/jun/19/european-commission-warns-france-over-fiscal-rules-as-election-looms](https://www.theguardian.com/world/article/2024/jun/19/european-commission-warns-france-over-fiscal-rules-as-election-looms)",
            "S’ils se plantent de quoi ?\nLes recettes prévues c’est de taxer les plus riches, rétablir les impôts plus justement (de manière plus progressive) et supprimer les niches fiscales polluantes. Supprimer également la flax tax.\n\nIl y a quoi de « risqué » la dedans ?",
            "Une belle mentalité de macroniste.",
            "Pour le coup : Cagé, Piketty, Blanchard, Cohen, Aghion, Duflo sont tous orthodoxes. Michaël Zemmour est plus hétérodoxes mais il publie aussi dans du mainstream.",
            "Tout à fait!\n\nLe problème des économistes c’est que leur discipline est empirique. Ce n’est pas vraiment une science dure.\n\nJe constate qu’on assiste plutôt à un débat technique militants vs militants et non à une analyse économique dictée par les faits.\n\nBref, on ne s’écarte pas vraiment du débat idéologique et la caution de tel ou tel expert militant de longue date pour un mouvement ou un autre ne vaut rien.\n\nNon pas que les constats soient mauvais (ils ont les même en général), mais les prédictions souvent limitées à une analyse macro économique locale relèvent plus de la prophétie que du sérieux.",
            "En clair ca veut dire quoi?",
            "Euhm, les deux utilisent les mêmes méthodes universitaires hein, la différence fondamentale c’est que l’un des deux groupe estime que c’est une science exacte, que c’est une sorte de macrocomptabilité.",
            "Du coup le FP est soutenu essentiellement par des orthodoxes",
            "Ben non, c'est compliqué mais y a de plus en plus d'outils qui se montre efficace pour modéliser des réformes en économie",
            "Ils ont des étiquettes politiques ?\n\nL'article dit ça :\n\n> Tous ont d'ailleurs tenu à préciser qu'ils avaient été sollicités en tant qu' « expert », « invités à porter un regard indépendant »",
            "Dire que leurs actions passées cassent leur argumentation c'est exactement la définition d'un argument ad hominem.\n\nhttps://fr.wikipedia.org/wiki/Argumentum_ad_hominem\n\nOn peut considérer que leur avis est biaisé ou orienté, mais ce n'est pas ça qui casse leurs arguments. On peut très bien être totalement biaisé et avoir quand même de bons arguments, tout comme on peut être totalement objectif avec des arguments qui ne tiennent pas.",
            "En parlant de militants, tu parles bien de Philippe Aghion et olivier Blanchard, n’est-ce pas ?",
            "> prix Nobel\n\nEn passant: Le \"Prix Nobel\" d'économie n'existe pas.\n\nC'est le \"Prix de la Banque de Suède en sciences économiques en mémoire d'Alfred Nobel\" qui existe et a été créé en 1969.\n\n\nDès sa création le prix a été controversé\n\n[Wikipedia](https://fr.wikipedia.org/wiki/Prix_de_la_Banque_de_Su%C3%A8de_en_sciences_%C3%A9conomiques_en_m%C3%A9moire_d%27Alfred_Nobel):\n> Certains membres de l'Académie émettent des réserves quant à l'aspect suffisamment scientifique de l'économie, mais Lundberg et surtout Myrdal (qui sont également membres) finissent par convaincre l'Académie entière. Myrdal le regrettera par la suite et exprimera son souhait d'abolir le prix (après l'avoir reçu) en 1974.\n\nEt c'est clairement contraire à la volonté d'Alfred Nobel:\n> Depuis, le prix est couramment surnommé « prix Nobel d'économie2 » alors qu'Alfred Nobel disait n'avoir « aucune formation en économie et la [haïr] du fond du cœur »3.",
            "Il n'aurait jamais dû être abaissé à 60 ans pour commencer.",
            "> Mais il y a eu un déficit de dialogue et les sacrifices n'ont pas été suffisamment partagés. \n\nPeut-être qu’on n’a pas envie de sacrifier nos retraites et nos services publics sur l’autel des cadeaux aux entreprises Philippe.",
            "Je sais que c’est puéril, mais ce sont des petits bonheurs simples des punchlines comme: « De Julia Cagé au Prix Nobel Esther Duflo, plusieurs économistes en vue contribuent au programme du Nouveau Front populaire. D'autres, tels qu'Olivier Blanchard ou Philippe Aghion, sont très critiques. **Aucun économiste ne s'affiche en revanche ouvertement au côté du RN.** » des le matin.\n\nMerci pour le partage de l’article!",
            "Un déficit de dialogue, est-ce que c'est un euphémisme pour dire un déficit de démocratie ? Sont drôles ces économistes",
            "tous le défenseurs de Macron en mode: on s'est planté il faut à tout prix perséverer. ces gens sont dangereux.",
            "Blanchard qui se dit social démocrate, quelle blague",
            "> a été la bonne » : « Elle a rendu la France attrayante pour les investisseurs étrangers\n\nça résume la situation la science seule ne peut pas faire une politique. La décision politique doit se baser sur la science mais c'est la politique qui décide si la priorité et d'attirer les capitalistes étranger par des baisses de protection des salariés ou si le but est d'améliorer la vie des gens. Si vous commencez à me parler de ruissellement, je sors jouer de la trompette la nuit en espérant vous faire chier avec le bruit.",
            "Ça fait tellement du bien de lire des économiques qui assument les limites de l'exercice comme toi. J'ai encore en tête mon super cours avec Pierre Picard en 2009 qui nous expliquait que c'était génial parce qu'on vivait une période d'opportunités (et Patrick Artus derrière histoire d'enfoncer le clou).\n\nEn fait ce qui fait chier c'est d'assimiler directement économie et politique publique. Qu'on demande des conseils, qu'on écoute les gens qui étudient l'économie, bien évidemment, mais ça fait trop longtemps qu'en terme de politique on nous dit \"non mais [cet économiste qui est d'accord avec moi] a dit que, donc il faut faire comme ça c'est de la science les p'tits gars\".",
            "L’économie est une science sociale, et une science où on ne connais jamais tous les paramètres. C’est pour cela que en rétrospective les crises s’expliquent toujours mieux car on peut voir des facteur qui ont interagi entre eux d’une manière inattendue. Pour prendre l’exemple de la Grande Récession de 2008, aucun économiste de qualité aurait affirmé que la finance est sans risque. Mais sans voir le niveau de diffusion des subprimes et l’étendue de la bulle immobilière, il était facile de sous-estimer le risque. De ce fait, l’économie est plus proche de l’ingénierie: une économie est une machine que l’on construit avec certaines structures, mais il est toujours possible qu’un élément casse et provoque une crise car la présence d’une variable a été sous-estimé/ignoré.\n\nDe plus, il y a la théorie et la pratique : beaucoup d’économistes ont eu du mal à prendre en compte la dimension politique et dynamique des politiques publiques et des agents dans l’économie. Par exemple, la théorie néoclassique du commerce internationale suppose qu’il y a des gains absolus pour une économie du commerce mondiale, mais que certains vont y perdre et certains y gagner de manière locale. En théorie ce n’est pas un problème car un Etat impartial peut taxer les gagnants et compenser les perdant de manière à que tous y gagnent. En pratique, les gagnants font du lobbying et la redistribution n’a pas lieu. C’est en partie pour ça que tu as un vrai retour de l’économie politique aujourd’hui, pour prendre en compte ces aspects.",
            "Moi je dis l'économie c'est un peu comme l'astrologie, on peut faire des calculs trés compliqués avec mais c'est avant tout un truc inventé par des hommes et on peut lui faire dire ce qu'on veut. C'est pas un truc immuable comme les lois de la thermodynamique quoi\n\n(oui, c'est du troll (enfin, un demi-troll))",
            "Merci!",
            "Merci pour ta réponse ! :)",
            "D'ailleurs, quels sont les axiomes qui font conscencus chez les économistes ?  Je me souviens du tronche en biais #45 la dessus, et je n'en avais pas tiré grand chose.",
            "Merci pour cette mise en perspective !",
            "Un/Une maître de conf sur Reddit, la classe ! Merci pour ton commentaire <3\n\nC'est hyper intéressant cette dichotomie entre vision naturaliste et constructiviste, elle semble s'étendre au-delà du prisme économique. On la retrouve dans les questions sociétales de genre par exemple, ou encore sur le sujet de la procréation. \n\nPar ailleurs, tu voudrais pas nous faire un AMA sur ce sub par hasard ? On gagnerait tous à avoir une meilleure compréhension du fonctionnement de l'économie et des enjeux asssociés :)",
            ">Ce qui fait l'objectivité de la science c'est le pluralisme des scientifiques dans leur ensemble, pas que chaque scientifique soit objectif (c'est impossible).\n\nÇa semble pas si difficile d'être un minimum objectif, ce qui ne veut pas dire être neutre.   \n\nT'as un parti qui arrive avec \"je veux financer A, qui coûtera X, je pense pouvoir le faire en faisant B qui me fera gagner Y\" et t'as une partie des économistes/politiques/journalistes qui arrivent en mode \"c'est impossible\".  \n  \nLes gars on vous donne la parole, vous avez le temps de faire la phrase \"A coûtera peut-être plus que X\" ou \"B apportera peut-être moins que  Y\", \"donc je m'y risquerais pas/je recommande pas\", ou même \"si on peut vraiment économiser Y alors je pense que cet argent devrait en priorité servir à financer C\",  mais si A et B sont possibles et les estimations X et Y sont plausibles alors c'est juste malhonnête de simplement dire que c'est pas viable parce que c'est pas aligné avec vos idées. \n\nTu donnes juste l'impression que l'économie est avant tout un battle d'égo.",
            "Sauf que les études sociologiques savent répondre à cette question et la réponse est claire : c’est la pauvreté qui crée la délinquance",
            "C'est surtout que c'est un peu comme les historiens : ça marche très bien pour expliquer les choses de manière rétrospective, mais ça n'a pas de grande valeur prédictive.",
            "Je ne dirais pas une pseudoscience, mais certainement pas une science “dure” à l’instar de la physique et des maths.",
            "L’économie en soi n’est peut-être pas une science, mais cela ne nous empêche pas de l’approcher de manière scientifique, avec des hypothèses que l’on rejette au fur et à mesure sur la base de preuves empiriques.\n\nAussi, je trouve ça particulier de rejeter un particulier le fait que c’est une science empirique. Les 20 dernières années c’est en particulier le côté empirique de la matière qui a vu énormément de bons développements avec la “Credibility Revolution”. Le côté empirique (l’économétrie) n’a jamais été aussi costaud, avec une emphase énorme sur de nouvelles méthodes d’estimation et les circonstances dans lesquelles elles sont appliquables.",
            "Évidemment que des gens peuvent dire le contraire. Y a des courants, (post-keynesiens, institutionnels, de manière générale tous ceux qui ont une approche historique) qui sont plus descriptifs que d'autres ; et la behavioral est plutôt expérimentale (c'est globalement de la psycho).\n\nAprès, y a une part important qui a l'air plus intéressée à étudier le Solow growth model, IS-LM et tous ces autres objets mathématiques qui n'ont qu'unnressemblance passable avec l'économie réelle (et s'ils avaient des pouvoirs prédictifs significatifs, et étaient des guides efficaces pour les politiques publiques, peut-être que \"l'économie est une pseudo-science\" serait pas un refrain si populaire).",
            "Source: trust me bro",
            "C'est une science sociale et ça s'apparente plutôt a des prédictions de Nostradamus : ça s'applique d'ailleurs très bien à Bruno Lemaire.\n\nÉvidemment, il y a des règles d'économies, mais dans l'analyse que certains donnent et les résultats obtenus... On attend toujours qu'on se sorte du bourbier",
            "On peut connaître plein de choses sur un phénomène, et même très bien le comprendre, sans pour autant être capable de prédire certains évènements. Et toutes ces connaissances peuvent être très utiles quand même, y compris pour prédire le futur, même si on ne peut pas prédire des évènements précis. C'est le cas pour les tremblements de terre par exemple, ou le climat.",
            "C’est typiquement ce que dirait un smithien ascendant Keynes",
            "Les moins vulnérables ont l’avantage de pouvoir suvivre aux coups durs",
            "Et ? Que Macron ait pas réussi à équilibrer le budget ne démontre nullement que NFP réussira forcément au même exercice.",
            "Une spirale négative : tu taxes plus donc ça réduit l'investissement privé donc ça réduit la croissance donc les revenus de la taxe baissent donc le budget est en déséquilibre donc tu investis moins donc tu as moins de taxe, etc...\n\nC'est une grossière simplification bien sûr mais l'idée sous-jacente est que des impôts trop élèves peuvent étouffer l'économie.\n\nC'est une théorie, je sais pas ce qu'elle vaut : on en revient au débat de quels économistes ont raison...",
            "Tu peux lire le thread d'Olivier Blanchard dont l'article parle si tu veux le point de vue d'un économiste sur les risques du programme. https://x.com/ojblanchard1/status/1804052251364762049",
            "Berr est clairement hétérodoxe, et Eloi Laurent est un peu un noname qui ne publie quasiment que dans la revue maison de o'ofce",
            "Que les économistes orthodoxes sont vues à gauche comme des économistes plutôt libéraux donc plutôt à droite et qu'il ne faut pas oublier cela dans leurs analyses. \n\nCe qui est plutôt le contraire pour les hétérodoxes, même si dans leurs cas, les écoles de pensées sont multiples.\n\nPersonnellement, j'avoue que ça m'exaspere ces commentaires, des critiques fondées peuvent venir de tout le monde et qu'un économiste soit orthodoxe ou non, ne devrait même pas être un argument, on se fiche de qui écrit la critique ce qui importe c'est l'exactitude de cette critique.",
            "En gros il y a deux types d’économistes, les orthodoxes qui correspondent au mainstream académique et les hétérodoxes, dont le seul point commun est de rejeter l’économie orthodoxe de façon plus ou moins importante.\n\nBien entendu tous les économistes orthodoxes ne sont pas d’accord entre eux. Certains vont vouloir plus d’intervention étatique, d’autres moins, certains sont plus à gauche, d’autres plus à droite etc. Mais ils ont en commun des méthodes, présupposées, etc.\n\nD’un autre côté les hétérodoxes rejettent l’économie orthodoxe. Ça peut être un rejet idéologique, méthodologique ou autre. De fait ils sont minoritaires, et ne seront en général pas publiés dans les revues d’économie orthodoxes (de la même façon que, disons, un chimiste qui refuse de respecter les protocoles expérimentaux standards aura du mal à être publié dans nature).\n\nC’est pour ça que je pense qu’il est important de préciser si l’économiste est orthodoxe ou hétérodoxe quand on parle de critique des programmes.",
            "Les méthodes ne sont pas toujours les mêmes. Un économiste marxiste va vraiment partir dans une direction différente, genre en faisant reposer son analyse sur la valeur travail.",
            "Si c'était une science exacte il n'y aurait pas de voix différentes et on serait capable d'agir rapidement sur l'économie.\n\nLa seule chose dont je sais qu'elle fait consensus c'est que pour tuer l'inflation on augmente les taux directeurs.\n\nEn faisant ça le recours aux emprunts diminue, l'investissement diminue, l'activité économique diminue, le chômage augmente donc l'inflation baisse.\n\nSi tu as d'autres exemples notamment sur comment stimuler l'économie d'un pays en faillite budgétaire comme la France je suis preneur parce que de toute évidence les économistes ne sont pas écouté des politiques qui arrivent difficilement à relancer le pays",
            "Il suffirait de googler Julia Cage ( pour ceux qui ne la connaissent pas ou son mari Thomas Piketty) pour comprendre qu'elle a une étiquette politique, et des travaux pas exactement 'indépendants' . Milton Friedman aurait aussi approuvé de façon indépendante la politique  économique de Reagan.",
            "oui",
            "Tout le monde le sait.\n\nPar contre cela ne change rien au fait qu'il s'agit du prix le plus prestigieux en sciences éco, indépendamment de son nom.",
            "On devrait bosser jusqu'à ce que mort s'ensuive, pour sauver les actionnaires.",
            "Oui oui allez, vous dites ça bien assis le cul sur votre chaise de bureau dans votre taf bien planqué c’est si simple :)",
            "C'est surtout que, comme toujours, le sacrifice est demandé à l'éxacte même classe : celle des salariés de classe moyenne / moyenne haute.\n\n\nPersonne ne veut s'attaquer sérieusement aux inégalité de redistribution (exemples les plus scandaleux : grosses retraites et niches fiscales, souvent cumulées).\n\n\nQuand on cumule ça, la dernière réforme des retraites et l'épisode COVID, on prend le risque de créer une fracture de la solidarité transgénérationelle.",
            "Non mais tu comprends il n’y a pas de choix possibles, pas d’alternative aux politiques économiques du gouvernement. Donc s’il faut changer quelque chose c’est l’emballage. Et surtout de la pé-da-go-gie.",
            "C'est une construction sociale. Mais Durkheim disait \"une construction sociale c'est aussi tangible que les murs d'une pièce\".\n\nC'est pas parce que c'est construit que ça peut pas s'analyser!",
            "T'es à deux doigts de découvrir les sciences humaines, attention!",
            "Hmm par nature des axiomes ne font jamais consensus. Les axiomes ce sont des hypothèses.\n\nDans les trucs qui font consensus, là de tête je dirais les affirmations suivantes :\n\n- un monopole naturel devrait être un monopole public.\n- une entreprise en situation de monopole sera nocif pour l'économie.\n- il existe des secteurs/situations où il y a des défaillances de marchés.\n- selon la nature et l'ampleur des \" coûts de transactions \" (en bref les coûts périphériques nécessaires à mettre en place un échange, prospection, détermination des besoins, négociation des contrats etc) les modes d'organisations peuvent varier de l'échange de marché pur à l'intégration dans une même structure.\n- d'un point de vue macroéconomique, une relance nécessite forcément un déficit.\n- toute la typologie qui existe des biens (complémentaire, substituables, veblen, giffen etc) et l'analyse des chocs de prix par rapport à la consommation en fonction de ces types de biens fait consensus (en gros la micro consommateur quasiment dans son entièreté. Y'a des subtilités qui diffèrent quand on va un peu plus profondément sur certains aspects mais franchement c'est assez secondaire).\n\n\n\nDans tout ça y'a aussi des trucs qui paraissent des évidences mais qui, en fait, ne coulent pas forcément de sources. Ex: \n- une population mieux éduquée favorise la croissance économique \n\n\nC'est difficile de faire une liste complète. Y'a des choses très fondamentales qui sont des constructions de bases de la pensée économique. Y'a aussi des choses un peu plus avancées mais c'est pas évident de lister !",
            "Après je vais transposer à une autre échelle. Je fais de la biologie cellulaire, sur des réseaux de régulations des gènes. J'étudie donc essentiellement un réacteur chimique, on a des trucs comme des lois d'action de masse, toute l'enzymologie. Bah déjà là, comme y a des boucles de rétroactions de partout, des effets non-linéaire et pas mal de stochasticité, c'est très dur de transposer des résultats obtenus sur un type de cellule à un autre contexte. \n\nJe peux fit un modèle qui marche relativement bien sur mes cellules dans mon labo, pis d'autres gens arrivent, font la culture avec les même cellules mais cultivées sur du collagène, et tout d'un coup ça marche plus.\n\nNiveau boucle de rétroactions dans tous les sens, les sociétés humaines et l'économie, ça se pose encore plusieurs ordres de grandeurs plus haut.",
            "L'économie *politique. Enfin, toute science a un certain niveau va se trimballer des égos, mais là le souci c'est que t'as des gens qui se drapent dans leur légitimité issue d'un travail scientifique pour donner des avis politiques. \n\nPour rapprocher ça d'un exemple qui, je suis sûr, fera plaisir à ce sous, suite le nucléaire : il y a de la science, et puis il y a des préconisations politiques où des scientifiques peuvent être en désaccord, et chacun des camps va prendre avoir raison parce que la science.",
            "[removed]",
            "Tu peux pas juste regarder un seul facteur, surtout en socio. Y'a des riches délinquants aussi. L'une des clés des sciences humaines, c'est bien que tout est systémique, complexe et multifactoriel.",
            "C’est à prendre avec beaucoup beaucoup de pincettes à vrai dire, à la fois quand on fait une analyse inter et intra pays. L’étude du gini pour comparer les pays montre bien qu’il y a une énorme composante culturelle également.  Quand tu descends à un niveau assez bas géographiquement tu n’as quasiment plus de corrélation entre revenu/inégalité et violence, et il est assez évident que tu as des dynamiques communautaires en jeu. Tu as pas mal d’études qui montrent que plus une zone est homogène culturellement plus tu as du contrôle social qui est plus efficace pour prévenir les crimes que la police d’état centralisée.  Les dynamiques de confiance sociale sont fortement impactées par l’arrivée d’individus extérieurs comme l’a montré Putnam et être une low trust society n’est pas une simple question de richesse. De ce que je me rappelle un excellent prédicteur des crimes dans une région c’est simplement le pourcentage de jeunes hommes ayant moins de 30 ans. Et il est difficile, quand 90+% des criminels violent sont des hommes, de simplement dire « c’est la pauvreté ». Le sexe joue un rôle, parmi d’autres",
            "Les habitants des campagnes sont bien plus pauvres que les habitants des villes et des banlieues urbaines.\n\n Ça a été largement documenté, un fils d'agriculteurs dans la Meuse est plus pauvre qu'un fils de femme de ménage à Villeurbanne. Plus pauvres culturellement et financièrement. \n\nDonc non, la délinquance n'est pas uniquement créée par la pauvreté.",
            "> c’est la pauvreté qui crée la délinquance  \n\n\nC'est très très très réducteur quand même, les milieux ruraux sont très pauvres, avec beaucoup moins d'aides et d'infrastructure, pourtant la criminalité y est moindre.\n\nLa pauvreté n'explique pas tout non plus les violences sexuelles, les homicides, etc. les vols je veux bien a la limite\n\nD'ailleurs après une recherche google je trouves 0 études qui offre une réponse claire, c'est plutot bien nuancé, ca parle de culture, d'éducation, de manque d'opportunité, bien plus complexe que le \"pauvreté = crime\" que tu invoques",
            "Et ça n'empêche pas certains bords politiques de quand-même penser que 1) est la cause... malgré toutes les preuves scientifiques du contraire.\n\nLes oeillères idéologiques, ça existe.",
            "Ouais mais si tu commences à te baser sur des faits, on n'est pas couchés. C'est bien connu que la réalité a un biais de gauche, on ne va pas s'en embarasser",
            "C'est pareil pour les économistes de droite. Ils s'appuient sur des hypothèses fausses (ruissellement, ressources infinies, besoins infinis, rationalité des investisseurs, ...) pour privilégier une interprétation plutôt qu'une autre. Tout le monde sait que c'est faux mais ils considèrent que \"ça tient\" malgré cela (ce qui est peut-être vrai mais hautement scabreux). \n\nJ'imagine qu'il y a aussi à critiquer dans les économistes de gauche, je parle juste de ce que je connais.",
            "C'est plutôt costaud prédictivement l'économie, si tu parles à des économistes et non pas des politologues qui veulent faire passer leur idéologie politique à couvert. Malheureusement, c'est comme les philosophes qu'on voit à la télé, les plus acoquinés avec le pouvoir et les plus fans du status quo sont les seules qui ont portée médiatique.",
            "Les maths ne sont pas une science, mais un langage.",
            "Je sors de mon master en économie, donc je vais défendre un minimum la discipline tout en faisant l’avocat du diable, je n’aime pas la macroéconomie.\n\nDéjà, il faut souligner que le but d’un “bon” modèle économique n’est pas de ressembler à la réalité. Les bons économistes savent que tout modèle que l’on peut créer aujourd’hui sera toujours limité, on est très très loin d’une “théorie générale” ou quelque chose de ce type. Plutôt, les modèles (mathématiques) sont utiles parce qu’ils nous forcent à formaliser notre pensée à propos de phénomènes ou interactions particuliers qui nous intéressent, et à être clairs sur quoi reposent nos modèles. Les fameuses “assumptions” sont, assurément, irréalistes, mais cela n’empêche pas *en soi* des modèles qui peuvent prédire la réalité.\n\nTu mentiones spécifiquement les modèles Solow et ISLM, qui forment la base des modèles macroéconomique modernes (il y a des bonnes raisons théoriques pour faire ces choix, même si, en effet, les modèles en soi sont complètement irréalistes). Par contre, ayant été developpés dans les années 50-60, ils sont *très* loin de la frontière actuelle en modéllisation macroéconomique, les modèles “New Keynesian Dynamic General Stochastic Equilibrium (NKDGSE)”, et “Heterogenous Agent New Keynesian” (HANK), qui sont utilisés par les banques centrales, agences gouvernementales, et institutions privées avec un succès relativement élevé.\n\nJe suis entièrement d’accord pour dire que ces modèles resteront probablement toujours limités comparé aux modèles de physique, par exemple. Par contre, je ne trouve pas ça juste de dire qu’ils ne peuvent pas être un guide utile pour les politiques publiques: ils sont irréalistes et imparfaits, certes, mais leur rigueur et succès partiel valent bien plus pour moi que ce que proposent les politiques par eux-mêmes, avec des propositions infondées qui ne reposent pas sur la réalité dure des chiffres, ou sur quelconque bonne théorie économique (comme il en est discuté dans l’article). Il faut plutôt se demander qui en politique a un intérêt à discréditer les “experts”, surtout quand de plus en plus d’entre eux commencent à vouloir taxer les riches, d’instaurer plus d’action sur le climat, et plus d’intervention étatique pour aider les gens…\n\nBref, j’ai clairement trop de temps libre maintenant, mais j’éspère que c’est au moins un peu intéressant à voir un autre point de vue!",
            "Le dictionnaire.",
            "> une crise budgétaire majeur.\n\nOn est déjà dans une crise budgétaire majeure",
            "Le point c’est plutôt que même si le NFP arrive pas et creuse le budget : c’est déjà ce qu’on fait avec Macron. Sauf que Macron le fait en rognant et en privatisant les services publics. Le NFP financera en augmentant les impôts et en relançant l’économie. Le parie peut ne pas marcher, mais ça peut pas être pire qu’avant",
            "Tout à fait mais ça montre au moins que la politique eco de Macron ne fonctionne pas. Et comme c'est une politique de droite, ça donne pas mal de raisons  de faire autre chose",
            "Pourquoi tu le présentes comme un enjeux du NFP alors ?",
            "Bah fichu pour fichu autant miser gros non ?\n\nLe programme eco de Macron est clairement 100% perdant tel qu'annoncé là.",
            "Moi aussi je peux te faire une « grosse simplification » : plus de recette, plus de redistribution donc plus de revenus pour les plus pauvres (qui ont une tendance à plus dépenser le surplus qu’à l’épargner, ca c’est des etudes qui le montrent carrément) = plus d’achats, plus de tva, plus d’investissement…\n\nCa marche dans l’autre sens aussi, c’est juste une façon de voir les choses ;)",
            "Tu connais le passif de Olivier Blanchard ?",
            "Il y a des gens qui aiment bien étaler leur confiture dès le matin là où il n’y en a pas besoin.",
            "La grosse différence est dans la technique surtout. Avant les années 90, l'économie ne modéliser que des équilibres. Y a pas de théorie du crash économique en économie classique. \n\npar hétérodoxes ont entend des économistes qui utilisent beaucoup plus la modélisation, la théorie des système dynamiques, l'intelligence artificiel.",
            "C’est vrais et ce serait invalidant en milieu universitaire si la méthode utilisé majoritairement avait pas cette fâcheuse tendance à se prétendre science exact car la base est une matrice totalement libérale et dans un monde prévisible. Si les économistes « de gauche » prospèrent c’est parce qu’ils ont des arguments de variables intéressants et proposent un paradigmes solide",
            "> Si c'était une science exacte il n'y aurait pas de voix différentes et on serait capable d'agir rapidement sur l'économie.\n\nPersonne ne prétend non plus que c'est une science exacte.\n\nEt même si ça l'était ça n'empêcherait pas d'avoir des voix différentes.\n\nEt même si c'était une science exacte et qu'il n'y avait pas de voix différentes ça n'empêcherait pas les politiques de ne pas l'écouter.",
            "De ce que je vois elle est de gauche et a déjà soutenu d'autres programmes de gauche. C'est ça qui lui donne une étiquette politique et « casse illico son argumentation » ?\n\nPour évaluer la pertinence d'un programme politique il faudrait quoi selon toi ? Ne pas avoir d'avis politique et n'avoir jamais préféré de programme dans le passé ?",
            "> Tout le monde le sait.\n\nJe ne crois pas, non\n\n> Par contre cela ne change rien au fait qu'il s'agit du prix le plus prestigieux en sciences éco, indépendamment de son nom.\n\nC'est vrai. Mais j'aime pointer du doigt le fait que les économistes essayent (et ont réussi) de coopter Nobel pour s'acheter une crédibilité.\n\nAu contraire des mathématiciens avec les médailles Fields par exemple.",
            ">Tout le monde le sait.\n\nL'article parle de prix Nobel. La page wiki [https://fr.wikipedia.org/wiki/Esther\\_Duflo](https://fr.wikipedia.org/wiki/Esther_Duflo) parle de Nobel. Non tout le monde le sait pas.",
            "C'est une idée stupide.",
            "En l'occurrence notre système de retraite en carton si cher à la gauche c'est les actifs qu'il éclate, pas les \"actionnaires\" (qui est de toute façon un élément de langage vide de sens en l'espèce).",
            "Je suis bien assis alors explique moi pourquoi même avant la réforme macron un prolo qui monte du parpaing ou travaille dans un abattoir partait après un machiniste de la ratp ou de la sncf à des conditions inférieures.",
            "> C'est surtout que, comme toujours, le sacrifice est demandé à l'éxacte même classe : celle des salariés de classe moyenne / moyenne haute.\n\nJe te rassure c'est aussi comme ça dans le programme de gauche. En gros pour tous les bords politiques c'est toujours cette classe qui prend (enfin les riches peuvent prendre mais ils peuvent esquiver bien plus facilement surtout), c'est quand même dingue que personne semble viser cette partie de la population (qui est pas si petite)\n\nLe fameux \"trop riche pour des aides, trop pauvre pour être vraiment riche et faire de l'optimisation fiscale\"",
            "Ces personnes qui sont dans les classes supérieures, qui ne s'intéressaient pas aux combats des plus précaires et qui ce font maintenant rattraper par la hausse de tout les coûts (inflation, dérèglement prix marchandises et biens immo...) viennent maintenant ce plaindre",
            "Tout a fait ! Mais aprés faut pas oublier non plus que c'est une construction sociale, ça passe au second plan pour moi, on peut pas voir le monde dans son ensemble uniquement sous le prisme économique. Si demain on a +5 degrés, adieu monde moderne, on entendra plus parler d'économie en fait.",
            "J'aime beaucoup cette expression, c'est très parlant aussi pour la construction sociale du genre. Qui peut être un mur infranchissable.",
            "Je crois que je met les sciences humaines au dessus des sciences économiques ahah",
            "Intéressant comme point de vue, merci à tous les deux ! Je me demandais justement si une partie des désaccords ne portaient pas sur la causalité (les variables sur lesquelles on peut agir vs les autres). Mais est-ce que les boucles de rétraction que tu évoques ne rendent pas cette question super simpliste ? Une boucle oubliée dans la modélisation et hop, le truc bien net se met à osciller, diverger ou converger sur des temps trop longs. Avec en plus le comportement statistique des individus qui doit être très compliqué à modéliser car faisant partie du système.\n\n\nDu coup je me demande quelle est les place de la modélisation en économie, si elle est réellement si fragile ? Au moins toi tu peux mener des expériences, et elles ne durent pas 30 ans",
            "Bonjour,\r\n\r\nCe contenu a été supprimé. Les propos discriminatoires, xénophobes, sexistes, transphobes, etc. ne sont pas tolérés sur ce subreddit.\r\n\r\n---------------------\r\n\r\nThis comment has been removed. Discrimination is not tolerated on this subreddit.\r\n\r\n\r\n\r\nLes règles de /r/france sont [disponibles ici](https://www.reddit.com/r/france/wiki/regles?utm_source=reddit&utm_medium=usertext&utm_name=france&utm_content=t1_em586i2). Pour contester cette action, ou pour toute question, merci d'envoyer un [message aux modérateurs](https://www.reddit.com/message/compose?to=%2Fr%2Ffrance).\r\n\r\nMerci de ta compréhension.",
            "J’ai fait court mais je te rejoins bien sûr",
            "Merci. Je vois en quoi les gens veulent éviter de stigmatiser des groupes en essayant de réduire les choses à la pauvreté seule, mais on n’améliorera pas les choses si on ne met pas clairement en avant les autres paramètres qui jouent - et fortement en plus",
            "La concentration de la pauvreté aurait été plus précis tu as raison\n\nEt sinon la magouille en milieu rural c’est quand même assez répandu",
            "Le délinquance est très présente en milieur rural mais elle est plus difficilement identifiable et donc moins combattue.",
            "Non tu racontes n'importe quoi. Aucun économiste ne parle sérieusement de ruissellement ou ne dit que nos ressources en pétrole, gaz, charbon, métaux ne sont infinies.",
            "> je parle juste de ce que je connais\n\n\nVisiblement non.",
            "Pour être plus précis, les économistes de droite s'appuient sur des fables (littéralement), sur des théorèmes et des lois, les économistes de gauche sont beaucoup plus dans l'observation du réel.",
            "Non l’économie a un pouvoir prédictif très faible des que l’on sort des clous.\n\nTypiquement quasi personne n’a predi aucune des crises économiques récentes et ceux qui l’ont fait se sont plantés massivement sur l’échelle. \n\nL’économie fonctionne comme science quand les choses sont prédictives et n’évoluent pas ou peu.\n\nCela reste absolument essentiel mais il ne faut pas avancer de choses fausses",
            "Qui paraîtra bien pâle par rapport à ce qui nous attend après ces élections en carton.",
            ">Le parie peut ne pas marcher, mais ça peut pas être pire qu’avant\n\nHeu, si ? Il existe un scénario, comme le dit Blanchard, que lez recettes des nouveaux impots ne soient pas à la hauteur et/ou découragent les investissements et que le budget dérape encore plus qu'actuellement.\n\nJe ne dis pas que c'est une certitude : c'est justement ce que j'explique qu'à notre niveau de simples citoyens qui regardent des économistes experts s'écharper sur le sujet, je trouve ça quasiment impossible d'avoir des certitudes.",
            "> Le parie peut ne pas marcher, mais ça peut pas être pire qu’avant\n\nBah faut savoir, je croyais qu'on reprochait ce raisonnement aux électeurs RN qui disent \"on a jamais essayé ca peut pas être pire\"",
            "Bien sûr que ça peut être pire qu'avant.\nIncapable d'emprunter faute de confiance sur les marchés, la France serait obligé de faire une grosse cure d'austérité. \n\nUne augmentation d'un taux d'imposition ne signifie pas forcément une augmenter des revenus fiscaux\nSi il y a derrière une baisse de l'activité économique du pays cela peut au contraire se traduire par une baisse des revenus.\n\nLa France n'est absolument pas dans un état catastrophique donc croire que ça ne peut pas être pire c'est se mettre le doigt dans l'œil. Regardez un peu le reste du monde.",
            "Quels services publics ont été privatisé ?",
            "C'est l'argument de pisani-ferry dans l'article, oui. La question, c'est la dose de changement qu'on met dans la politique de Macron.\n\nMoi, je suis partant pour changer les choses, ma question porte sur la meilleure manière de le faire. Le NFP a fait le choix d'une politique ambitieuse et audacieuse tandis que d'autres partis de gauche européens sont beaucoup plus modérés (les travaillistes anglais par exemple).",
            "Car ils proposent une politique économique très audacieuse, c'est tout le sujet de l'article partagé ici.\n\nAlors que Macron fait grosso modo la même politique économique que tous les pays de l'OCDE donc qu'on aime ou qu'on aime pas, on sait à quoi s'attendre : il n'y a pas de risques de choc brutal car c'est la continuité.\n\nLà, le NFP revendique un programme ambitieux avec une véritable inflexion, inédite en Europe.\n\nDu coup, c'est normal que leur programme soit très scruté.",
            ">Bah fichu pour fichu autant miser gros non ?\n\nBen, c'est un peu le souci, non ? J'ai pas envie de jouer au casino, moi, j'ai envie de voter avec la certitude que je fais le bon choix pour mon pays et notamment mes concitoyens plus vulnérables aux chocs économiques que moi.\n\nClairement, j'aimerais que le NFP ait raison et c'est ce qui me pousse à vouloir voter pour eux. Mais j'aimerais être convaincu qu'ils sont pas justes des gens avec des bons sentiments mais qu'ils savent ce qu'ils font.\n\nJe n'aime pas la logique quitte ou double quand il s'agit de voter : sur le brexit par exemple, pas mal de britanniques ont voté en se disant que ça ne pourrait pas être pire. Et ils le regrettent aujourd'hui avec désormais une majorité qui veut rejoindre l'europe.",
            "Ivre, il reprend les arguments du vote RN pour le NFP sans s'en rendre compte.",
            "Oui mais j'ai jamais dit le contraire, c'était tout le sens de mon paragraphe sur le côté pile de la politique du NFP dans mon tout premier commentaire.\n\nJ'ai l'impression qu'on veut me faire dire que je suis contre le NFP alors que ce n'est pas le cas.",
            "Je connais ses travaux oui.",
            "Mdr, exactement ça",
            "> par hétérodoxes ont entend des économistes qui utilisent beaucoup plus la modélisation,\n\nDésolé mais c'est complètement faux.",
            "Je n'ai que des connaissances basiques mais Schumpeter il est orthodoxe et toute sa théorie s'intéresse justement aux crash non ?",
            "Je suis désolé, mais ce que tu dis est globalement faux. La vaste majorité des (macro)économes aujourd’hui utilisent toujours des modèles basés sur l’équilibre général, les modèles les plus communs sont les “DGSE” (Dynamic General Stochastic Equilibrium) et “HANK” (Heterogeneous Agent New Keynesian). L’économie “classique” au sens littéral du terme date du tout début du 20ième siècle, les “néoclassiques” des années 60-70, on est depuis les années 80 dans un paradigme globalement “Néo-Keynesien”.  C’est basé précisément sur l’idée que l’économie ne fonctionne pas parfaitement, que les crashs peuvent avoir des conséquences permanentes, et que cela présente un rôle important pour l’Etat.\n\nIl faut souligner que si cette école de pensée moderne est hétérodoxe au sens de critiquer la pensée classique, elle est absolument orthodoxe au sens d’être quasi-universellement acceptée aujourd’hui. Les systèmes complexes ou dynamiques sont de mon avis prometteurs, mais représentent une minorité minuscule des économes, et souvent plutôt comme une curiosité intellectuelle.\n\nJe ne sais pas ce dont tu parles en disant que les héterodoxes s’intéressent à l’IA, ça ne fait pas particulièrement partie de quelconque théorie économique que je connaisse.",
            "Wow c'est n'importe quoi ce commentaire. Chaque phrase est fausse, c'est impressionnant.",
            "Faut pas faire une association hétérodoxes = gauche et orthodoxe = droite je pense.\n\nPiketty et Duflo sont et de gauche et orthodoxes (de même Krugman, pour citer un autre poids lourd de l’économie contemporaine).\n\nL’école autrichienne est et de droite et hétérodoxe.\n\nAprès, je ne sais pas si les économistes hétérodoxes prospèrent ailleurs que dans les médias. Lordon n’est pas vraiment une référence dans le monde économique à ma connaissance, par exemple.",
            "Ce n'est pas le sujet de cette discussion. Julia Cagé a une étiquette politique marquée et n' est pas un expert indépendant, avec son mari ce sont des économistes engagés, contrairement à ce qui est affirmé et cité dans l'article et leur regard n'est pas indépendant.",
            "Ah ben non, tu ne vas pas me dire que l'argent est moins important que quelques vies de personnes lambdas, quand même ???",
            "Je t'invite à aller faire le job de machiniste a la RATP.  Moi j'y travaille mais comme tu dis bien planqué dans un bureau. C'est pas le cas du machiniste.  Il a une pression et une responsabilité qui n'est pas compatible avec un travail a un âge avance . Ce sont des métiers qui abîme.\n\nTout autant que porter des parpaingsnet du coup il faudrait réduire l'âge de la retraite de l'ouvrier plutôt que de vouloir augmenter celui du machiniste....\n\nPourquoi le nivellement se ferait par le recul ? Pas par l'avancement ?",
            "Oui bravo tu viens de découvrir les régimes spéciaux",
            "Non, sur le programme de gauche, c'est clairement les riches qui sont visés, pas la classe moyenne.\n\n4000€ net par mois (pour un célibataire), on parle plus de \"classe moyenne\". Je veux bien que ce soit pas une richesse démesurée, mais faut pas mentir aux gens non-plus, on est dans le premier ou second décile (donc dans les 10 ou 20% de Français qui gagnent le plus).",
            "J’ai trouvé le compte reddit de Serge le mytho ?",
            "100% d'accord",
            "C'est vrai que du coup, ayant pas beaucoup d'expériences dans la science économique, mais pas mal dans la modélisation de systèmes complexes, les modèles que je vois dans les papiers économiques (et surtout la confiance, si ce n'est arrogance des économistes à propos des dits modèles), je suis super sceptique.\n\nDans mon domaine, l'approche de modélisation permet justement un peu de détecter ces inconnus négligés. Si, comme tu le dis, on observe des oscillations, on sait que y a un nombre limités de motifs qui peuvent y donner naissance, et par exemple dans le cas d'une culture sur collagène, je peux déjà fortement suspecter que des stress mécaniques (et donc cytosquelette ou integrines) vont être impliqués. De ce point de vue là, y a un aller-retour assez productifs entre modèles et expériences.\n\nAprès effectivement, non seulement mes expériences durent pas 20 ans, et je peux faire varier des paramètres assez précis, mais en plus je prends un fibroblaste aujourd'hui, ou dans 50 ans, il fera pareil. Alors que tu te demandes si des conclusions faites sur l'économie dans les années 50 ont encore une quelconque validité sans empires coloniaux, un environnement légal différent, des institutions différentes, etc...",
            "Alors que la magouille dans les cités c'est du jamais vu ?",
            "Les économistes de gauche s'appuient tout autant sur des théories et des lois hein, faut arrêter de croire qu'il y a des solutions simples et magiques à tout.",
            "Je suis globalement d’accord, mais un petit détai à ajouter: l’économie en soi n’est peut-être pas une science, mais cela ne nous empêche pas de l’approcher de manière scientifique, avec des hypothèses que l’on rejette au fur et à mesure sur la base de preuves empiriques.",
            "On peut avoir un pouvoir prédictif fort sur certains aspects tout en étant incapable de prédire des évènements précis. Pour le climat par exemple on a des modèles qui prédisent plein de choses très utiles, alors qu'on ne peut pas prévoir plein d'évènements, ou même juste si une année particulière sera chaude.",
            "Oui enfin, le caractère absolument prédictif des théories n'est pas un critère pour juger de sa scientificité. \n\nVa t'on reprocher à un biologiste de ne pas prédire l'évolution de telle espèce sur les 10k prochaines années, ou à un géologue de ne pas prédire l’occurrence d'un séisme 16 ans à l'avance? \n\nL'économie peut prédire des tendances, de grandes orientations, pas anticiper au centième près le niveau de l'inflation. Et encore, c'est conditionnel à l'information dont tu disposes à l'instant t.  \n\nPour la crise de 2008, c'est plus un problème de paradigmatique. Si tu reprend les travaux d'Hyman Minsky ou d'Irving Fisher, tu as déjà tout un corpus théorique permettant d'expliquer (et de prédire) l'imminence d'une crise financière dès 2005.  Le problème étant que ces travaux étaient laissés dans un profond oubli à l'époque. Oups.",
            "Ok Mme Irma.",
            "Ce n'est pas exactement ça. Quand tu as des économistes renommés qui soutiennent le programme c'est assez différent du 'on n'a jamais essayé de sauter du haut d'une falaise sans parachute '",
            "Dans le cas du RN c'est plutôt essayer un truc de merde qui a déjà été essayé ailleurs et à d'autres époques et dont on sait très bien que c'est de la merde.",
            "Qui est responsable de la dégradation des notes de la France depuis 7 ans ?",
            "Le ferroviaire, une partie du conseil auprès de l’état, historiquement internalisé ou fait auprès des universitaires, une partie de l’éducation nationale, l’électricité, etc",
            ">Le NFP a fait le choix d'une politique ambitieuse et audacieuse tandis que d'autres partis de gauche européens sont beaucoup plus modérés (les travaillistes anglais par exemple).\n\nNon, c'est une augmentation massive des impôts. Ni plus ni moins. Sans strictement aucune remise en question du fonctionnement de l'Etat.\n\nC'est pas audacieux et encore moins ambiteux de changer des curseurs...",
            "Tu peux très bien avoir un choc brutal si les facteurs extérieurs changent et que tu n'y est pas préparé... Au hasard: le changement climatique.",
            "Le brexit était définitif une fois engagé, là c'est 3 ans avec un sénat opposé, faut prendre du recul un peu. Je ne pense pas que si ça plante comme tu dis, ça soit si important car un programme majeur ne pourra pas s'appliquer entièrement dans ces conditions.\n\nMaintenant ce qui est fait par le parlement peut très bien être défait, donc rien n'est définitif et le parallèle avec le brexit s'arrête là. Si ça plante, le gouvernement d'après s'empressera de supprimer certaines mesures.",
            "Supposons que le NFP passe, avec une bonne majorité absolue, qu’elle est la probabilité qu’ils se trouvent un milliard d’excuses pour ne pas faire ce qu’ils ont promis?\n\nJ’ai envie de dire pareil pour le RN, d’ailleurs Bordella a commencer a préparer le terrain pour faire style « ah mais on n’a rien pu faire ils bloquent tout sont méchants ». \n\nOn a eu Mitterand, Jospin et Hollande, et la différence avant/après était pas spectaculaire, en tout cas sur le plan économique.",
            "> Mais j'aimerais être convaincu qu'ils sont pas justes des gens avec des bons sentiments mais qu'ils savent ce qu'ils font.\n\nL'avis des économistes qui soutiennent le programme du NFP cités dans l'article ne te suffit pas ? Il te faudrait quoi ?",
            "Le problème c'est que le programme économique actuel est catastrophique, on racle sur tous les acquis sociaux depuis 10 ans sans que les économies faites aient eu le moindre impact positif sur l'économie.\n\nEt là Macron nous annonce la même en encore pire et en investissant encore plus dans les domaines qui ne profitent ni aux Français ni à l'économie (doubler le budget militaire déjà élevé pour une puissance militaire en paix...).\n\nDonc oui le programme économique du front populaire comporte des risques mais le programme économique actuel n'est pas viable et est une lente agonie (que le gouvernement veut accélérer) dont on doit sortir dans tous les cas.",
            "Mais du coup il est où le doute ?\n\nL’état aura plus de recettes, il n’y a aucun doute.\nL’état va investir ce surplus dans les services publics (et les salaires du public), redistribuer vers les plus pauvres, il n’y a aucun doute.\nL’ensuite les études montrent que plus les personnes sont pauvres, plus elles vont consommer le surplus de revenus, la aussi aucun doute.",
            "Ses travaux sur la crise Grec ? On doit avoir le même avis alors ;)",
            "Oui mais pas en tant modélisation (ce qui est bien normal vu qui avait même pas d'ordinateur à son époque). Son travail c'est un peu comme se rendre compte qu'on a des saisons en climatologie. \n\nPour continuer le parallèle avec la climatologie, aujourd'hui on prédit les phénomène el Niño et la Niña assez bien par la modélisation. On aimerai prédire aussi bien les conséquences d'une politique économique en science économique.",
            "Mais j'ai jamais dis que les nouvels méthodes n'utiliser pas les équilibres. j'ai dis que les anciennes ne prenait pas en compte la dynamique des systèmes. Et pour cause c'est un truc qui est rendu possible que par la puissance de calcul qu'on a aujourd'hui.\n\nPour ce qui est de l'IA. Des que t'as un modèle \"agent-based\" qui s'adapte, c'est de l'IA (90% (chiffre au piffomètre) de l'apprentissage par renforcement)",
            "Ah bon ?",
            "Oui oui mais je fait rapidement car c’est comme ça qu’ils sont dépeints souvent. Et oui la portée est mondiale pour la « technique » (encore une facilité de langage), Lordon je sais pas mais s’il est traduit je pense qu’on devrais faire une statue en l’honneur des centaines de traducteurs qui y ont perdus leur cheveux",
            "Comment ça c'est pas le sujet de la discussion ? Tu dis que leur étiquette politique casse leur argumentation, et je te demande ce qu'il faudrait pour pouvoir évaluer un programme politique, puisque que tout le monde a un avis politique.",
            "4000 et célibataire à Paris, c'est classe moyenne (impossible d'être propriétaire d'un petit logement). Et tu n'as pas ce genre de salaire ailleurs 99% du temps. \n\n\nDonc ça correspond bien à ce que je disais :)\n\n\nps: et vu le prix des loyers, avec le barème d'imposition proposé par LFI, il ne sera presque plus possible d'être locataire d'un 35m2 à Paris en dessous de 80k brut\n\npps: Sachant qu'on parle de 4000 net imposable hein, pas 4000 supernet. Donc 64k brut annuel, et 3440 supernet mensuel. Ceux qui croient que ça n'est pas la classe moyenne à Paris, vous vivez dans un monde alternatif :/\n\n[edit] Vu que je me fais downvote, je vais mettre des chiffres pour ramener les gens à la réalité.\n\nEn prenant un 35m2, à 32e/m2 (la moyenne de Janvier 2023), pour un célibataire, ça nécessite :\n\n* 3360 supernet\n* 3906 net\n* 62502 annuel brut",
            "Ce n'est pas riche non plus selon moi (je suis loin de ça mais je pense pas que tu vis dans le luxe non plus à 4000€ nets par mois) donc en dessous de riches c'est classe moyenne sup si tu veux diviser plus. \n\nC'est pas parce que les autres sont pires que ça fait de toi quelqu'un de riche c'est juste que les autres sont encore pire  Les classes moyennes si tu regardes juste l'ensemble en France au final elles galèrent avec l'inflation et la crise immobilière, elles sont limite pauvres au final. \n\nDe plus t'es pénalisé avant 4000€. Dès la tranche des 30% (28000+€) avec la disparation de la flat tax notamment.",
            "[deleted]",
            "Tu prêches à la paroisse, trop de gens discréditent l’économie sans raison.",
            "Ils parlent de 100 milliards d'euros de dépense supplémentaire, c'est plus de 3% de PIB, c'est énorme.",
            "Le parallèle avec le brexit était pour illustrer que la politique du choix du risque pour les électeurs n'est pas forcément payante par rapport au statu quo, pas à comparer les deux situations.\n\nJe suis d'accord qu'il faut rester mesuré et qu'on va pas vriller en mode Venezuela. \n\nPour autant, même des \"petits\" effets comme un déficit de croissante de 0,5 point de PIB par exemple peut avoir un impact important sur le long terme.\n\nLe brexit par exemple continue à handicaper les anglais et au bout de 8 ans de sous-performance économique engendrée par le brexit, ils ont de vrais problèmes de crédibilité budgétaire : il suffit pour s'en convaincre de se rappeler de la déchéance de liz truss et de voir comment est timoré le programme des travaillistes anglais (quasis assurés de bientôt gouverner) par rapport à celui du NFP.\n\nPour nous, le risque, c'est la confiance pour les investisseurs dont nous avons besoin. Si le NFP réussit (ce que j'espère), cette confiance sera conservée voire augmentée (jackpot) mais si c'est l'inverse qui se produit, il faudra peut-être plusieurs années pour restaurer cette confiance, comme pour les anglais.",
            "C'est une blague pour Mitterrand ou pas ? Parce que justement il a tenté, ça a foiré spectaculairement et ça nous a mis durablement dans la merde. Et on parle d'une époque avec une marge de manœuvre plus importante.",
            "Tu as raison, est-ce qu'on aurait un moment 1936 ou 1983/1997 en pratique, c'est difficile à dire. Dans le deuxième cas, c'est peu de risques mais aussi peu d'opportunités.\n\nDéjà, il faudrait que le NFP gagne bien sûr.",
            "Je vais essayer de lire leurs arguments et les comparer avec ceux de leurs contradicteurs pour me faire ma propre opinion.\n\nMais idéalement, je sais que c'est illusoire en économie mais j'aimerais avoir vu une preuve par l'exemple ou un consensus.\n\nLe réchauffement climatique, par exemple, je sais qu'il est réel car j'ai lu et été convaincu des preuves scientifiques et qu'il y a un consensus écrasant parmi les climatologues.\n\nHélas, rien de tel en économie...",
            "Ben le doute, c'est que si c'était si simple et si évident, pourquoi tous les autres pays d'europe ne le font pas ? Pourquoi y a-t-il des économistes sont-ils en désaccord avec ton raisonnement ? Si c'était aussi bête que ça, ça devrait faire consensus parmi les économistes, logiquement.\n\nMais ce n'est pas le cas. Ce qui laisse trois hypothèses vis-à-vis des économistes en désaccord avec ce que tu as écrit:\n* ils sont de mauvaise foi pour X raison.\n* ils sont de bonne foi et ils ont tort (spirale positive)\n* ils sont de bonne foi et ils ont raison (spirale négative)\n\nPersonnellement, je ne pars pas du principe qu'ils sont de mauvaise foi car ça ressemble trop aux arguments que les climato-négationistes ont adressé aux climatologues.\n\nReste les deux dernières hypothèses et on revient à mon message d'origine : je ne pense pas avoir l'expertise pour trancher entre les deux et ça me travaille.",
            "En supposant que les “saisons” dont tu parles sont les “business cycles” qu’il a étudié, on rejette aujourd’hui largement sa théorie de cycles réguliers dans l’économie, donc l’analogie des saisons n’est pas très bonne.\n\nDe plus, sa contribution était moins de se rendre compte qu’il y a des saisons, mais d’apporter une explication pour cela. Pour lui, c’était un partie régulé par les “entrepreneurs”, qui apportent des innovations et cefaisant, “perturbent” l’équilibre, avec des cycles accompagnateurs. De manière plus générale, on parle aujourd’hui de chocs aléatoires et donc par définition imprévisibles, dont la macroéconomie moderne essaie surtout de modéliser les effets, plutôt que les prédire.",
            "Euh ? J'ai répondu à ton commentaire plus haut qui niait qu'ils avaient une étiquette politique\n\n\"Ils ont des étiquettes politiques ?\n\nL'article dit ça :\n\n> Tous ont d'ailleurs tenu à préciser qu'ils avaient été sollicités en tant qu' « expert », « invités à porter un regard indépendant »",
            "L'avantage c'est que la France, c'est juste Paris et ses 2 millions d'habitants, et qu'on s'en bat les couilles des 68 autres millions de pécores, hein?\n\n4000€ a Paris, t'es EXTRÊMEMENT confortable. Personne ne te force a acheter dans une des villes les plus chères du monde, et tu as un pouvoir d'achat énorme avec 4k.",
            "euh, bien sûr qu'il y a ce genre de salaire ailleurs mon bro, surtout que l'on commence a taxer plus a partir de 4000€, mais les gens qui seront les plus touché sont ceux qui gagnent bien plus.\n\nSans compter que la gauche souhaite s'attaquer aux niches fiscale, l'un de leur objectif c'est aller récupérer une partie des 100 milliards de fraude discale.  \nDe plus une autre mesure importante c'est de taxer le fait de posséder des entreprises (typiquement imposer Bernard Arnault sur ces 200M de capitaux).\n\nEt je ne parle même pas de la hausse du smic et de la réduction d’impôts pour les plus précaires\n\nDonc si, la gauche s'attaque a ce problème, c'est pas parfait ni assez mais vu comme ils se font tirer dessus a boulet rouge pour ce qu'ils proposent on comprends qu'ils ne soient pas encore allez plus loin.",
            "Ce salaire dont tu parles, c'est deux fois celui de la caissière de ton supermarché. C'est trois fois celui de celle qui garde tes enfants.\n\nC'est le to 10 ou 20% des salaires français. C'est plus la moyenne, même supérieure.\n\nCe n'est pas parce que la petite classe Supérieure commence à se faire rattraper par la flambée des prix délirante et les conséquences de la bourgeoisie avare débridée que c'en est moins la petite classe supérieure",
            "Ça veut rien dire \"classe moyenne à Paris\".\n\nLe fait d'habiter à Paris est une conséquence du salaire, pas l'inverse.\n\nLe m² à Saint-Tropez est quasi équivalent de celui de Paris, pourtant on ne dit pas que \"4 000 et célibataire à Saint-Tropez, c'est classe moyenne parce que tu ne peux pas acheter là-bas\".\n\nEt je ne parle même pas des monégasques.",
            ">4000 et célibataire à Paris, c'est classe moyenne (impossible d'être propriétaire d'un petit logement)\n\nOui mais justement habiter à Paris intra-muros c'est un choix ... de riche. Mais tu peux totalement travailler à Paris et habiter en banlieue proche (montreuil par exemple) et là un tel salaire est totalement suffisant pour s'acheter un appartement complètement decent.",
            "Une médiane (ou moyenne si tu veux tricher) à 4000€ net avant IR à Paris ? 🤔 Elle est originale celle-là, tu la sors d'où ?",
            "> 4000 et célibataire à Paris, c'est classe moyenne (impossible d'être propriétaire d'un petit logement).\n\n4k€ nets ça fait un emprunt de 290k sur 20 ans, à 1.5%. Les taux se sont envolés depuis mi-2022, mais avant ça, avec un peu d'apport (un truc pas très compliqué quand tu touches 4k), ça permet assez facilement de s'installer, même à Paris. Et si tu es prêt à sortir du périph', c'est open-bar.\n\n[exemple 1](https://www.seloger.com/annonces/achat/appartement/paris-11eme-75/belleville-saint-maur/204344287.htm?projects=2,5&types=2,1&natures=1,2,4&places=[{%22divisions%22:[2238]}]&price=250000/350000&mandatorycommodities=0&enterprise=0&qsVersion=1.0&m=search_results_map_mapview-redirection-detail)\n[exemple 2](https://www.seloger.com/annonces/achat/appartement/paris-2eme-75/montorgueil-saint-denis/222820247.htm?projects=2,5&types=2,1&natures=1,2,4&places=[{%22divisions%22:[2238]}]&price=250000/350000&mandatorycommodities=0&enterprise=0&qsVersion=1.0&m=search_results_map_mapview-redirection-detail)\n[exemple 3](https://www.seloger.com/annonces/achat/appartement/paris-15eme-75/alleray-procession/218628271.htm?projects=2,5&types=2,1&natures=1,2,4&places=[{%22divisions%22:[2238]}]&price=250000/350000&mandatorycommodities=0&enterprise=0&qsVersion=1.0&m=search_results_map_mapview-redirection-detail)\n\nAlors oui, en ce moment les taux sont plus prêts de 4%, ce qui fait plutôt 230k€ d'emprunt sur 20 ans, ce qui suffit largement à trouver des trucs très corrects en petite couronne.\n\n...Maintenant, si tu voulais un prêt sur 15 ans sans apport qui te permette d'acheter 40m² dans le 8ème, pas de chance...",
            "Le choses perdent leur sens aussi...\n\nSi avec un salaire d'ingénieur (deux fois supérieur au smic en net après impôt) tu peux pas te payer un 45m² dans la capitale c'est que le problème il est pas du côté des impôts mais de l'immobilier délirant ou d'une dévalorisation de l'argent incroyable non répercutée dans les salaires.\n\nParce que ouais, avec ce genre de salaire, t'es dans les 10 ou 20% des gens avec le plus haut salaire, si c'est pas plus que la moyenne je sais pas ce que c'est que de dépasser la moyenne",
            "Et là on parle de 4k net imposable, soit 3,4k supernet. Donc plutot un 30m2.",
            "Parti comme c’est, je dirais (prévisions sortis de mon cul) 40% NFP, 40% RN et vaguement 20% Macron et ses potes. \n\nÇa va être très fun quoi qu’il arrive.",
            "Côté réchauffement climatique le consensus est sur le constat, pas sur la façon d'en sortir.\n\nL'économie n'étant pas une science en soi j'y crois moyen au consensus.",
            "Le réchauffement climatique et un programme politique sont des objets très différents quand même. Ça ne me parait pas vraiment possible d'avoir un consensus sur un programme politique, simplement parce que les objectifs ne sont pas les mêmes. Les scientifiques peuvent éventuellement trouver un consensus qui dit « si on veut X alors ce qui a le plus de chances de marcher c'est Y ». Mais si X varie c'est normal qu'il n'y ait pas consensus sur un Y unique.",
            "Comme ca tous les autres pays d’Europe ? Alors déjà une bonne partie des pays européens c’est l’extreme droite au pouvoir donc la defense des classes moy…riches.\nEnsuite on peut prendre l’exemple d’un pays avec un gouvernement de gauche, à savoir l’Espagne où le smic a fait +45% ces dernières années. Sans crise budgétaire majeure.",
            "Pourquoi les autres font pas ça car le CAPITALISME LIBERAL mon copain on vie dans une société qui a décidé que la vie humaine a un coup que gégé le sdf il vaut 0 euros et que toi t'en vaux un peut plus mais a tout moment tu vaut rien et t'es jeter\n\nEt puis tu parle des conséquences du programme de NFP mais celui de l'extrême droite tu y'pense ?  J'espère que tu kiff les services publics anglais car c'est ce qu'on aura si le RN passe",
            "Tu as tout à fait raison. J'ai jamais dis que sa théorie était bonne d'ailleurs. C'était novateur il y a 150 ans.",
            "Si je demandais ça c'était aussi pour savoir ce qu'était pour toi une étiquette politique, notamment pour comprendre en quoi ça cassait leurs arguments.",
            "Encore une fois, on parle de 4k net imposable, pas de 4k supernet (soit 5k net imposable).\n\nMerci de lire.",
            "Bernard Arnaud ne possède pas les capitaux en direct, il a un montage complexe avec différentes holdings, certaines pas en France.\n\n\nSi tu crois que virer le PFU et mettre l'ISF va impacter la famille Arnaud, permets moi de te dire que tu ne sais absolument pas de quoi tu parles ;]\n\nEt oui il y a ce genre de salaire en dehors de Paris... mais pas pour la majorité de la population, même chez les ingénieurs ou autre. Donc en quoi ça contredit ce que j'ai dit? Tu as lu mon message en fait?",
            "Non mais taxer Bernard Arnault (et autres super riches), c'est illusoire, le gars a une armée d'avocats qui font tout pour lui trouver de quoi payer le moins possible. Et si pas possible il se domicilie  fiscalement ailleurs",
            "2 fois le salaire d'une caissière c'est être \"riche\" maintenant ?\n\nEn plus faut arrêter avec supposer qu'on paie pas assez d'impots. On est quasi le pays avec le plus de prélèvement au monde (y a pas que l'IR évidemment). Y a l'argent, faut peut être juste mieux l'utiliser",
            "Elle paye combien d'impôt la caissière et reçoit combien d'aides directes et indirectes de l'état ? Alors oui je caricature un peu, mais déso, j'ai juste pas envie de payer encore plus d’impôt quand j'arrive déjà pas à m'acheter un logement pour fonder une famille.\n\nTaxons plus le capital, augmentons la TVA sur les produits de luxe putain.",
            "Ok donc on reserve Paris :\n\n* aux top 1% des revenus\n* à des gens qui acceptent de vivre dans la misère\n\nEt les classes moyennes ont qu'à déménager en banlieu. Donc on vire 1 million de gens de Paris.\n\nFaçon San Francisco quoi. Super modèle de société :/",
            "Je suis à Aubervilliers, à 2mn à pied du terminus de la 12. Bon, j'en ai chié pendant la construction, tout ça, mais maintenant, c'est bon :)\n\nEt, oui, 45m² pour 200k, alors qu'à Paris, dans du neuf, j'aurais eu 25m² pour le même prix (et pas dans les meilleurs quartiers, plutôt dans des coins pas top du 18ème)\n\nDonc, oui, habiter un 45m² à Paris en étant célibataire, je dirais qu'il faut pas trop se plaindre, c'est déjà du luxe. C'est *au minimum* de la classe moyenne *supérieure*, et ça flirte avec le qualificatif de \"riche\" (sans être dans les super-riches qui vivent sur des yatchs de 200m de long, hein...)",
            "Et tu es en train de découvrir que la pauvreté est extrèmement prévalente à Paris? Après, si le modèle de société, c'est de dire que tant pis, au moins il ne restera que des riches et des pauvres à Paris, et que les gens n'ont qu'à aller vivre ailleurs s'ils veulent vivre correctement, bah ce n'est pas mon cas.",
            "AJA que \"S'installer\" c'est vivre dans 24 mètres carrés",
            "* 4000 net imposable ce n'est que 3440 supernet pour une personne seule\n* Quand tu achètes, tu dois payer des frais du mutation et prévoir des travaux, ce que tu ne prends pas du tout en compte dans les biens que tu as regardé :/",
            "Je suis d'accord qu'il y a un souci avec le coût de l'immo loc ou achat, mais du coup est-ce la solution que de taxer encore plus ceux qui ne vivent clairement pas dans l'opulence, quand bien même ils sont labelisés de \"riches\" par certains (ce qui était mon 1er propos) ?",
            "Je pense pas aux programmes du RN, ce sont des gros cons et des menteurs. Quoi qu'il arrive dans ma circonscription, ce sera tout sauf eux.",
            "J'ai réagi au fait que tu ne semblais pas convaincu qu'ils aient une étiquette politique et l'affirmation qu'ils aient un avis indépendant. Je ne suis pas économiste, mais pour caricaturer un peu, à chaque fois que j'écoute Piketty sa réponse est la collectivisation quelle que soit la question. C'est un raisonnement qui n'a de portée que s'il s'applique à l'économie mondiale ou dans un contexte d'autarcie.",
            "Oui oui. 4k net imposable, t'es EXTRÊMEMENT confortable a Paris. \n\nMerci d'arrêter d'être dans le déni.",
            "bro, ces entreprises et actif vont rester en France hein, bien sur que c'est possible de le taxer.",
            "J'ai pas dit que c'était riche, j'ai dit que c'était bien au dessus de la moyenne. Ce n'est pas ma faute si dans ce pays être dans les 10% les plus gagnant ça veut dire galerer aussi. \nOn est aussi l'un des pays avec le meilleur service public mais je suis d'accord avec toi, utilisons mieux cet argent, et les biens présents dans ce pays et, par exemple, plutôt que de faire cadeau à des holdings pour qu'elles puissent acheter plus de logements, achetons ces logements pour un service public d'habitation qui propose une alternative aux holdings et force une diminution des spéculations par offre non speculative ?",
            "Quand tu gagnes plus que 90% des français, oui, tu es riche.",
            "Hey, c'est complémentaire. C'est normal de taxer les revenus, et de taxer plus les *hauts* revenus (et ce, de manière exponentielle - vu que le début est indispensable, et que plus tu montes, plus c'est du superflu - même si ça fait jamais plaisir d'en avoir moins).\n\nCa veut pas dire qu'il ne faille pas taxer *aussi* le patrimoine (ce qui inclut le capital). Et plus on taxera le capital, moins on aura besoin de taxer le reste, d'ailleurs, pour un budget équivalent.\n\nIdéalement, faut taxer les flux (revenus, qu'ils soient du travail ou du capital), et le stock (le capital, financier, immobilier, etc...)\n\nLe droit de succession est également très important si tu veux redistribuer correctement, et éviter une accumulation dynastique en mode \"monopoly\".",
            "En proportion ? Elle paie plus que l'ingénieur en impôts. Et reçois moins d'aides de l'état que le.patron.\n\nJe t'invite ensuite à lire la réponse que j'ai faite à quelqu'un d'autres pour cette question d'augmentation des impôts, qui ne te toucheront pas si tu galères déjà soit dit en passant",
            "A Paris il y a deja 25% de logements sociaux qui permettent à plein de gens pas riches de vivre convenablement. \n\nEt puis pour acheter à Paris il n'y a pas besoin de gagner 10000€ par mois non plus, je connais plusieurs personnes qui ont acheté en gagnant 50k brut. Évidemment dans ces conditions il faut accepter qu'on ne peut pas avoir le beurre et l'argent du beurre : un grand appartement spacieux tout en vivant dans les lieux les plus prisés de France.",
            "Bah, en même temps, tu peux pas permettre à *tout le monde* d'habiter à Paris intra-muros, sans aucune contrepartie, hein... Au vu de la demande, forcément, tu as un prix qui augmente.\n\nL'alternative, ce serait de ne pas être tenus par le marché, mais faudrait gérer la pénurie autrement. Par exemple, avec des listes d'attente, comme pour les logements sociaux, ou une loterie, que sais-je ?\n\nComme ça, oui, on aurait probablement une belle mixité sociale, mais d'autres se plaindraient aussi qu'ils sont prêts à donner plus pour le privilège, mais qu'on les empêche de le faire, que c'est une ingérence insupportable de l'Etat, etc...\n\nBref, si tu as des solutions miracles, n'hésite pas, je suis sûr que ça peut être intéressant.",
            "Dans une des villes les plus denses du monde, oui. Autant on ne peut pas comparer les salaires avec le reste de la France, autant il ne faut pas chercher à comparer les surfaces.\n\nLa chose qui est rare à Paris, c'est le m². Y'aura rien à y faire. On ne peut pas garantir 45m² à toute la classe moyenne, ça n'est pas possible.\n\nLe critère de sélection, c'est l'argent. Il est modulé par une offre sociale qui monte beaucoup plus haut que dans les autres régions de France (la dernière fois que j'avais regardé à 2000 net par mois, on était encore dans les critères pour des HLM \"catégorie élevée\"). Mais là encore, c'est pas parfait et pas linéaire : il n'y a pas et n'y aura jamais assez de HLM par rapport aux demandeurs et il y aura toujours une coupure entre les HLM les plus cher et le début du parc privé. Ce n'est juste pas possible de faire autrement.",
            "En étant célibataire sans apport et en voulant vivre au centre d'une métropole, il te faut combien exactement ?",
            "Et ? La capacité d'emprunt se base sur le net imposable, pas sur le supernet.",
            "Bah en fait... Oui.\n\nMais je vais pas me contenter de \"oui\" je vais développer.\n\nDéjà, on parles de taxation progressive, c'est pas tout d'un coup tu passes de 3999 €/ mois et 5% de taxe à 4000€/mois et 80% de taxe (chiffres irréalistes). C'est pas mon argument, juste une clarification pour pouvoir développer mon argument.\n\nPrenons l'exemple de l'immobilier. La part majoritaire de l'inflation des prix de l'immobilier est due à des jeux et montages économiques. On garde des bâtiments vides pour faire monter la demandes, on augmente les prix et ne les baisse jamais, etc. Spéculation, stockage d'argent sous forme de viens, revalorisation des petits logements, nome ton poison.\n\nCes gens qui sont derrière tout ça, ils en sont capable parce que ce sont des biens privés, des services privés. Le logement est une nécessité vitale, au même titre que la nourriture et l'eau, et pourtant tous ça est uniquement accessible par échanges privés soumis à l'application de volontés arbitraires de quelques aisés.\n\nComment apaiser tout ça? Par une proposition alternative publique forte. Si il est possible d'obtenir un 38m² abordable, pourquoi aller chercher un 45m² pour trois fois le prix? Par les mêmes lois économiques qui permettent aujourd'hui l'escalade indécente, un service public fort aide à résoudre le souci.\n\nOr, un service public fort ça se paie par les impôts. Donc oui, régler le.probleme, ça passe par une augmentation des taxations, de manière progressive, des plus possédants. Et contre toute première impression, se faire plus taxer veut dire qu'à terme, tu auras plus d'argent pour toi.",
            "Merci de te rendre compte que les fachos on un programme eco encore plus claquer au sol que le NFP. \nMaintenant j'ai une question c'est quoi qui te pousserait à choisir de voter pour une politique social moindre ?"
        ]
    }
}