{
    "T-shirts are not memes. Report any post of people showing off t-shirts they claim they received recently. They're made by art thieves.": {
        "title": "T-shirts are not memes. Report any post of people showing off t-shirts they claim they received recently. They're made by art thieves.",
        "score": 216,
        "url": "https://i.redd.it/fij22ccece3c1.jpg",
        "content": "",
        "num_comments": 3,
        "comments": []
    },
    "You don't need gas when you have family😂": {
        "title": "You don't need gas when you have family😂",
        "score": 2931,
        "url": "https://i.redd.it/hguo56b6ji6d1.jpeg",
        "content": "",
        "num_comments": 62,
        "comments": [
            "No one ever needs to pee either",
            "They always talking about family but they ditch their wife and kids as soon as they hear a v8 drive up.",
            "They did steal an 18 wheeler of gas….",
            "No asking for directions.",
            "Never blew a tire or got a flat at all",
            "When did Fast in Furious go to stealing DVD players to saving the world and into space?",
            "Fast and furious is the only movie that they drive cars in.",
            "If we’re talking plot holes:\n\nThere’s like 6 Purge movies, why the hell is nobody just leaving for Purge Day? Seems like a great time to get out of the country.\n\nAnd why are people not committing tax fraud on Purge Day? Why is everyone’s first instinct to just start killing eachother on Purge Day?",
            "Every time the gas runs out, they change the car.",
            "They only live there lives a quarter mile at a time.",
            "They shift something like 20 times in a Supra in a drag race so… what were you expecting?",
            "The thing that annoys me most is how they just talk normally to each other as if they're all in the same room.  No fumbling through BluTooth menus.  No repeating the same voice commands over and over.  It's like they're all in a never-ending Zoom meeting with their phones on speaker mode.  \n  \nSo if they *did* stop to refuel, it would be preceded with a fifteen minute conversation about which gas station had the lowest prices, with one of the central arguments being whether or not to go *into* the Sam's Club store and if so, should it be after using their gas station or before.",
            "Or park inconveniently far from their destination",
            "Nowhere is this one more absurd than in the Mad Max movies, where they live in a world of gas shortage and people are actually *fighting* over gas, yet the biker armies all have unlimited gas",
            "They rob a fuel tanker in one of the movies.",
            "Some how nitro doesn’t go empty that often.",
            "You’re racing for family, there’s no time for pit stops!",
            "Who need gas when you got FAMILY",
            "Thats because it runs on pure adrenaline. and it's a 15 gear gearbox",
            "I don't see the problem. People get bottomless mags for their guns all the time. Why not bottomless gas tanks?",
            "No but you don’t need gas on cars with 27 gears",
            "BS..The opening scene of Fast and Furious 4 is all about stealing gasoline trucks. That implies they steal it and fill it up whenever they want. Also throughout the series they have cars setup at random places already filled up with fuel.",
            "Number 2 yes they did",
            "That could be said about almost any movie and taking a shit",
            "They did steal a huge tanker of it, I can't remember which movie tho",
            "I’ve never seen Dom take a shit.",
            "Dont they steal a gas truck in the beginning of the fast 4 ?",
            "I never saw a scene of any of them dealing with an engine oil spill on themselves when doing an oil change.",
            "Who needs GAAAAASSSS when you got NAAAAWWWWSSS.",
            "I haven't seen a single Fast and furious movie...",
            "I was 11 when the fellowship of the ring came to theatre and I asked my friend why it never showed the main characters shit or piss. I will never forget and can’t even explain the look he gave me.",
            "Actually wrong I think? Didn’t Brian stop at a gas station that had a diner and ended up flirting with Doms sister in the first movie? I need to rewatch that scene xD",
            "They are nitro boosting their cars",
            "The only time that I saw a peeing scene in the movie was at Jumanji 2.",
            "My favourite is in any movie with a car chase when the good guy starts to fall behind and they change gear and suddenly pull ahead again...as if they weren't driving as fast as they could to begin with...",
            "Come to think of it I don’t remember seeing them be born either.",
            "Come on bro, who wouldn’t?!",
            "Like the first movie when Dom forgot about his friend who has still laying dead before going for a race with Bryan",
            "And you do actually see them filling the cars from it. But that was already a 4th movie by that point.",
            "Ya I was gonna say, they hooked up 3 tankers and jumped on them after froze the latch to break them. Then immediately after you can see them putting gas in!",
            "With cars they drive it would last like a half a week top",
            "You don’t get lost going a quarter mile at a time",
            "That's because they let Dwayne Johnson come up with script ideas. That's why Vin Diesel doesn't like him, he wanted the movies to be realistic and about family, Johnson wanted them to be about Delorians in space and fishbowls for breathing 💀",
            "Love how you solved both the issues with one sentence",
            "With piss",
            "Big daddy.",
            "Look who's talking 1 and 2",
            "Fr man",
            "Hondas got great gas mileage back in the day",
            "They did show people putting gas in their cars during the after party. Maybe not the main characters but I find it’s a safe assumption that they filled up first",
            "Is this true?",
            "I mean I'd prolly piss myself if some one use nitrous with me in the car",
            "Pee sluts 7",
            "They still get great gas mileage my 2016 hrv gets 50 mpg on the highway",
            "No. They got more ridiculous after The Rock left.",
            "Classic feedback loop",
            "Until you get to their Acuras, those suck on gas. My 21 TLX 4 cyl gets the same mileage my damn V8 2019 Mustang GT got.",
            "Weird, huh?"
        ]
    },
    "Did you know?": {
        "title": "Did you know?",
        "score": 3597,
        "url": "https://i.redd.it/aq80y8h9i28d1.png",
        "content": "",
        "num_comments": 90,
        "comments": [
            "Cheap ass hollywood won't do location shoots anymore.",
            "Stanley kubrick would have gone to the actual planet. directors these days, man.",
            "How do we really know?",
            "This is watching them make sausage, but damn it seemed so real.",
            "![gif](giphy|3kzJvEciJa94SMW3hN)",
            "I am so disappointed",
            "I refuse to believe it!",
            "![gif](giphy|hWGBKil1b9fpR5go1f|downsized)",
            "Nothing unexpected tbh. Any of y'all financially responsible people would understand just how costly monetary wise and more importantly, the amount of time needed to be invested in shooting it onsite.",
            "Did they shoot everything else in like Mars??",
            "To make this funnier, the bottom text should be \n\n\"In the movie Interstellar most of the water planet scenes were shot on Earth\"\n\nand then just refuse to elaborate",
            "r/shittymoviedetails",
            "![gif](giphy|cRLsWbTJc4ziVdZr0F|downsized)",
            "Same I heard in star wars. But I am not sure.",
            "Nobody shoots on location anymore!  What a…. dang!  I almost used the ‘G’ word.",
            "I was shocked and sad after knowing Star Trek was filmed inside studios on Earth, not on space ships in space, made the whole show feel fake.",
            "Viable Planet landings were staged!",
            "No way,I did not know that!",
            "fuxk! man, I actually think that in outer space",
            "Huh, yeah well - did you know the pool on the Titanic is still full of water?\n\n![gif](giphy|OJw4CDbtu0jde)",
            "good to know.",
            "r/shittymoviedetails",
            "But where on earth did they find all that otherworldly water?",
            "![gif](giphy|l0HemzWRNpzoM0Vk4)",
            "next you're gonna tell me that matthew mcconaughey was played by brad pitt.",
            "🎵Tell me lies \n\nTell me sweet little lies",
            "My life is a lie.",
            "That's funny because so was the moon landing \n\n/s",
            "Great trivia! Also, Alderon was the original filming location for that scene, buuuut it got blowed up! \n\nThey didn't have time to grow a new planet so the director turned back to Earth.",
            "Wow, thanks god they told me before I died",
            "But, like, 100’s of years ago, right?",
            "I call BS",
            "Not all of them",
            "Where was the rest of the movie shot?",
            "Christopher Nolan would've sent them to the actual planet, step it up Hollywood! 🙄",
            "So you mean to say that that scene was not filmed over 23 years and 4 months? How do you explain Romilly growing old?",
            "BS, I saw him go to space",
            "Damn I really really hate posters that don’t preface shattering information like this without a ***SPOILER WARNING***",
            "![gif](giphy|10uct1aSFT7QiY)",
            "I could totally tell they were using Earth water.  I pointed it out in the theater and everyone clapped.",
            "No way! It looks so real!",
            "Wait, what? 😳",
            "I feel betrayed.",
            "Nooooooooo Fuc... wayyyy !!!!",
            "YEAHHH, well I heard the wave was REAL!  And got paid for his part!",
            ":O",
            "Did you know in Jurassic park, the dinosaurs weren’t paid?",
            "What it wasn’t shoot on another planet??? How dare they making a film about space on earth..",
            "There’s water at the bottom of the ocean.",
            "lol fuck else they gone shoot it at lol",
            "They lied 🤥",
            "A flat earth ?",
            "The water planet episode ruined the movie.  If their tiny lander could thrust its way out of the planet's gravity well, they wouldn't have had any problems with interstellar travel.  In a phrase, the plot was all wet.",
            "Ah yes the vegan tomato",
            "Next you're gonna tell me the scenes in the 4th dimension were shot in the 3rd dimension?",
            "I wonder where they filned it tho. Like I assume a set? I don't know if there's just an ocean somewhere where there's just 1 and a half feet of water and nothing else.",
            "Woa what?!??",
            "It’s obviously shot on WATER as you can see.\nOP is stupid.",
            "Just like moon landing ? 🤓",
            "This is actually a lie, I was the helmet.\n\nActually filming was on Mars.",
            "We know this isn't true and that these shots were not taken on earth; time moved faster there.",
            "😲😯😮",
            "wait what 😱 🤯",
            "Stanley Kubrick would have done it on location.",
            "Laaaaame",
            "I heard all of Star Wars was shot on earth as well? Like tf? Why couldn’t they shoot on location?",
            "No, they hid the fact that it was actually filmed offworld...how do you think they got those waves so high? This would clearly be impossible on earth.",
            "Same as the moon landing, so cheap these days.",
            "He even shot the fake moon landing on the moon!",
            "We don't, because Cooper even tells us \"those aren't mountains...\". Which, we all know, earth has actual mountains",
            "For some reason I never imagined that metal robot thing was a real physical thing. Very weird to see it in this context.",
            "When the microscopic bacteria realize I can finally see them using my microscope:",
            "We ware lied all the time??? My life have no meeting now",
            "The show Fallout wasn't filmed in a nuclear hellscape, that's just what southern California looks like.",
            "Space may be the final frontier but it's made in a Hollywood basement.",
            "And the thing is, it’s so obvious. You can tell they’re not really on lava, snow, or desert planets. It just takes me out of an immersive experience knowing they didn’t bother to go there and have the real settings.",
            "how can there be mountains if the earth is flat",
            "Yeah it was a puppet! Pretty neat",
            "Can't even commit to story telling, got to have at least one nuke around they could have used smh my head.",
            "The underside isn't flat",
            "Hallow earth🤔"
        ]
    },
    "Take this incels!": {
        "title": "Take this incels!",
        "score": 2423,
        "url": "https://i.redd.it/sgfhz4cwf28d1.jpeg",
        "content": "",
        "num_comments": 473,
        "comments": [
            "I mean, it's a competative market and if he's got the skill to back it up, sure.",
            "I can pay women 10% less?????? No way im firing everyone and hiring all women for my bricklayering firm and my sewer cleanup bussines, HOW DID I NOT THINK OF THIS EARLIER? They would agree to work 12-16 hours right? Surely feminism has tought them they dont want kids so no parental leave sounds good too. EMPLOYERS REJOICE",
            "\"Even tho im smarter than him\"\n\nr/iamverysmart ass sign 💀",
            "If she were smarter than him, she'd read the work contract first before signing.",
            "Firing all 9 of my employees at my scrap yard tomorrow and hiring woman. 45,000$ more in my pocket sounds fucking sweet",
            "Feminism is awesome. Men no longer have to get married / commit to get action from a girl.\n\nAs a result, the marriage rate is at an all time low. What a time to be alive.",
            "I would pay more for a guy to give me a blowjob than for a girl",
            "I wonder how cringey the actual sign the guy was holding was. I hope he at least got laid for embarrassing himself, but honestly I doubt it.",
            "When are people gonna realize the wage gap isn’t real.. there are valid reasons behind why ON AVERAGE women make less, and NONE of them have anyythjng to do with bosses just CHOOSING to pay them less because they are a female, if this was true every company would ONLY hire females",
            "I am spiritually a lesbian, because of how much I find myself loving cooch. And thus, for the sake of feminism, offer women, and only women, blow jobs for free! Yes, free! Yes! For free! And, because of feminism, and my steadfastness to the cause, I will not give a blow job to any man no matter how much he is willing to pay me for it.",
            "Putting that head to good use.",
            "I'd choose the woman. Cheaper and I get to degrade a smart person.\nI know this will rise the unemployment rate amongst men, but I gotta follow the market!",
            "If the gender pay gap was real companies would only hire females",
            "The 10% less kicks in once she has a kid. He continues to earn what he did before the kid but she has to take time to recover from birth and take care of the baby. If the baby is sick she misses a day of work. The difference is most pronounced when women have to quit a job to raise the kid and never get that time back so their wages stagnate until they accrue more time on the job to earn a higher salary.",
            "but maybe he's better at it?",
            "The gender pay gap does not mean women get paid less than men simply because they are women.",
            "Pay gap is a myth that has been disproven repeatedly. When you account for all other variables, it disappears. In fact, it shows women out-earning men due to 'positive' discrimination hiring practices.",
            "Lmao",
            "Example of an unexplained gender wage gap:\n\n\nMale optometrists are paid a higher starting salary (6,5%). https://pubmed.ncbi.nlm.nih.gov/33110023/\n\n\n\"In all regions and practice types, men were paid higher starting salaries than women. For current salaries, men were paid higher in almost all regions and practice types. The wage gap increased from starting salary to current salary, although not in all regions and practice types.\n\nConclusions: When practice ownership, residency completion, and full-time work are controlled for, there remains a difference in the pay received by men and women in optometry. The salary data presented in this study may help optometrists narrow the wage gap.\"",
            "You do know that you just gave an Incel Homosexual an idea for a quick buck",
            "Well, maths really screws with everything when calculating back and forth between numbers using percentages.\n\nIf the guy earns 10% more than the girl, you could argue that the girl would be asking $1.00. But the girl doesn't have a price tag on her sign, so the only way of calculating this is that the girl earns 10% less than the guy. Then, the price starts at $1.10. Subtract 10% from that, and you'll end up with $0.99. If the girl then claims that the guy earns 10% more than her, the guy gets $1.099. With the girl earning 10% less than the guy, that makes it $0.9891. This can continue until both of them earn jack shit.",
            "Women always have a target to blame. You're only 40% as competent as your male counterparts and that's why you get paid less. I've worked with men and women in similar roles and always the women either get it wrong or need help from the men a lot of help.",
            "So is this becoming some weird misogyny sub?",
            "Is the disability wage gap gendered? Disabled women earn less in Norway.\n\n\nhttps://pubmed.ncbi.nlm.nih.gov/37480695/",
            "The gender pay gap in medicine: https://pubmed.ncbi.nlm.nih.gov/33534271/\n\n\n\"A total of 46 articles published since 2000 contained a gender-based finding related to physician pay. Thirty-two of these 46 articles presented either adjusted or unadjusted means comparisons (or both) comparing pay between male and female physicians. Eighteen of the 46 articles controlled for one or more variables in examining pay between the two groups. Across almost all studies, female doctors earn significantly less than men, often tens of thousands of dollars less annually, despite similar demographic and work-related profiles. This earnings gap is persistent across time, medical specialty, and country of practice.\"",
            "I got $2.10",
            "This ain’t even a meme",
            "If woman really did get paid 10% less for the same work employers would never hire men",
            "Open up and take my money",
            "what can i get for $2 ?",
            "To give a blow job, I'd demand like 1 000 000 000 % more than women. I know, few would pay it, but that's not my problem. I am just used to get acceptable compensation for doing something I really don't want to.\n\nWe shouldn't nees such a stupid and bitter ideology as feminism to get women paid the salary they earn. Yes, I am writing aggressively. It is not because I am against gender equality. It is because the feminists around me have been privileged girls. University students or even highly educated doctors, earning reasonable or even higy salaries, at leas as able to control their things as anybody else. Those who would really need feminism and I happen to know, are not feminists. They are rarely accusing men (or call it partriarchy, if you wish) even though they have been exploited and molested.\n\nSo, this kind of BS is an example of what the girl is actually saying in her table: I'm smarter....",
            "Onlyfans is helping defeat the pay gap 😆",
            "I mean being smarter isn't necessarily linked to sex work",
            "Funny but what has this to do with incels?",
            "But is he volunteering himself or the hot one?",
            "It's all about those ID%",
            "Oh my god I was on the same course as this guy 😭 he’s an incredibly nice dude",
            "Can she clean and gutter and sewage I'm willing to pay her the same",
            "Women always have a target to blame.",
            "No way she is smarter than him if she still believes in the wage gap myth.",
            "What makes her smarter than him, if I may ask?",
            "I see this often but i would like to know name of companies that do this? Also isnt it possible that difference is there due to most of life/health threatening  jobs are done by men,  like look how much underwater welding and working on oil rig in general makes you and how many man die there yearly or how many female coal miners you see?",
            "If this was true why would any company hire men if they can hire woman to work for cheaper.",
            "Smarter ≠ Able to do a better job",
            "The guys go to Oxford why the shit do they care who earns what they're all millionaires cry me a river",
            "Where is this?  The back patio of Buckingham Palace?",
            "So she charges only $1 for a bj?",
            "This. Singular. Incels plural",
            "There’s his extra 10%",
            "And there are people in some countries earning 900% more than me for the same job",
            "Standing outside the British Houses of Parliament... and the guy is selling his services for a $1.10 not £1.10. That makes so much sense.",
            "If she's smarter how come she thinks he's getting paid more?",
            "You have to admire a man who knows his worth.",
            "The irony is the meme reflects reality. The issue isn’t misogyny, it’s that men charge more for their labor.",
            "Lol they think this is true all across the board .\nDefinitely not the case",
            "I mean the way pride is shoved down your throat now she might as well just go home 😳",
            "Like fuck he will. I know many girls at my place of work who make more then i do.",
            "You don't need to be incredibly smart to be a lineman, and they make great money.",
            "King's College (cathedral) in Cambridge for anyone wondering",
            "Stop spreading misinformation.",
            "bot",
            "I would easily pay an extra 10% to hire someone who isn't a raging feminist. Gender irrelevant",
            "It's not about being smart at your job, it's about being smart at your wages negotiation.",
            "He might make a little bit more per unit sold, but she can easily make up for that in volume.",
            "I thought it said $1/lb…",
            "I built walls in my house using 24cm and 18cm silicate blocks, they weight around 23 and 17 kg each. You need around 15 for 1m2 of wall, so around 300 for a 10x2m wall. My GF could barely get them to the hip level. \n\nIf I was a woman we’d never finish building the walls, let alone setting up big ass windows that weight 50-100kg or other jobs that are still in the future. \n\nLike, atleast in building houses you’d be significantly worse off if you employed women instead of men. \n\nI get the office work where there is no difference. But damn, anything requiring strength and being a woman is gonna be really a disadvantage.",
            "It's not like we have an equal pay act, oh wait we do.\n\nReally thought, they are just putting others down to look better themselves. It's an attack on perceived value in society. But they are trying to retcon and gaslight history to do it. It's not an honest debate.\n\nLike how they forget to mention men got the vote only a few years earlier, but they'd have to sign up to the draft. \n\nWomen could have bank account and property, they could clearly inherit. But the government treated married couples as one legal unit, to hold men financially responsible for women. \n\nThey did that because before technology like tampons, birth control, washing machines etc women could not really work full time outside the home. Go try to do laundry for five kids while bleeding down your leg. That makes it hard to pay debt. How can you justify to shift the blame to the normal hard working man born today?\n\nBut why is the education system not teaching that? Why are the teachers turning them into a misinformed mob? Because clearly it's causing a rift between men and women.\n\nIf it really is about women wanting to for example sleep with more attractive men, by reducing those men's value. Then they are not doing a good job at it when the very people they were hoping to attract with the \"stolen value\" are turning away from them. \n\nThat is a fundamental misunderstanding of the market, and even of what value attracts men. Because the opposite sex determines your value in dating on whatever preferences they see fit. So they can choose to just disregard anything they perceived to be illegitimately gained mate value in according to costly signal theory.",
            "I've worked In construction for years as an electrician.  I've seen about 2 females the entire time.  Neither of which were useful.  Just complaining endlessly",
            "Lmfao it really is a joke isn’t it?",
            "Isnt that why they hire migrant labourers/undocumented labourers?\n\n\nBecause they can pay them less?\n\n\nThink about an undocumented maid, or cleaning service or au paire. You are hiring them for a lower rate for the same job.\n\n\n\n\n\n\nEmployers rejoice, indeed.",
            "And no rest days for period if you are as strong as ~~me~~ men .\n\nThat is joke okey. I advocate for equal pay for same work. And for rest days for period too because I understand it is hard for some women.",
            "For real. I appreciate all the physical stuff men do cause i don’t wanna/cant do it. Yea there are always outliers, I’m sure there are some women capable and willing I’ve just never met one.",
            "Wait till you hear about immigrants",
            "Unironically that would probably lower the threshold to take those kind of jobs. Blue collars jobs tend to have more issues with sexist attitudes, so in the worst case scenario in addition to long work days and physically demanding work, one would have to deal with a hostile working environment. Just a thought, obviously this is not what companies should do to improve the comfort and safety of their employees and not every blue collar company has issues with treating both their male and female workers with respect.",
            "She means she has some kind of degree and is clearly the kind of person that thinks that is the end all and be all of \"intelligence\" when the measure of intelligence is nuanced.",
            "Tbf, contracts very rarely tell you what other people in the organisation are paid.",
            "Dude? Gotta bring controllers and shrooms.\n\n\n\n\n\nWtf?",
            "amen",
            "I feel like people in this subreddit don't know how the world works.",
            "You only pay them 50k each?",
            "You get action from girls? To me, feminism had the exact opposite affect",
            "I feel like winning the vote was a bigger achievement but go off",
            "Wait what? Thank you for the 108 votes so far.",
            "No kids = no future. Who will pay for your retirement if there is no one to tax?",
            "To be fair guys are naturally better due to having the same parts so they are worth that extra 10%\n\nSauce: Bisexual",
            "Same. Gay dudes understand the basics like keeping their teeth away from it and not yanking it around like a gearstick.",
            "Shh... do not ruin the superbly clever joke, when the guy who invented it does not even know there are gay prostitutes too.",
            "Why?",
            "he is in the friendzone for sure, and he's likely to stay there. Men think he's pathetic. Women think he's disingenuous.",
            "When people talk about the pay gap, do they talk about bosses choosing to pay women less, or do they acknowledge that is not the issue, and focus more on why women don't get into higher paying jobs/work longer days? Things like how parenthood is dealt with in families or how attitudes and expectations affect the girls' education choices? Or her personality and self-image, how to be assertive and believe in her strengths?\n\nSome people simply aren't that materialistic or see career aspirations as a priority, but I wonder if they are trying to figure out if it's purely a personal choice or does socialization play a bigger role in it.",
            "Some of the factors include male bosses being less likely to give raises and promotions to female employees. You can hire any employee for any amount as long as it’s above minimum wage, obviously there’s no law in place saying women have to accept less. But on average, they do make less money when compared to their male counterparts who work similar jobs, with comparable service time.",
            "How about if a man give you a blowjob?\n\nNvm, im confused too",
            "you thinking you're clever:\n\nthat one trans woman: oh free BJ!",
            "Lmao",
            "Maybe not the gender pay gap, in my country it's illegal to pay men and women different amounts for the same job and position, but some companies have issues with favoritism, how they offer opportunities and promotions. I think that's more of an issue. Then again, you probably don't want to be working in a company like that where one gender automatically receives more respect for the same work input. A lot of companies try to battle systematic and casual sexism at the workplace. In my last job (tech) sexist workplace bullying was taken very seriously by the higher ups and dealt with accordingly. It was shitty to see it happening, especially as a young person, but also relieving that they were professional about it and didn't let it run rampant.",
            "I mean if you look it up then you can see in a lot of companies they rather hire women for this exact reason",
            "They already do though....?\n\n\nThere is a reason why migrant labor, au paire, and cleaning/maid services are primarily immigrant women of latin american origion.\n\n\nIts because they can pay them less...\n\n\nUnless you are talking about female ceo' who dont have the same wealth as male ceos....\n\n\nIts a class war. The only wayfor us all to be paid equally is to unionize and fight back.",
            "“Females” \n\nIncel spotted",
            "Is there an actual reason why so many men on the internet refer to women as „females“ nowadays? It always gives off weird Incel and wannabe Andre Tate vibes.\n\nEdit because people are pissed and I‘m tired of repeating myself: calling men males is also shitty. Both terms (female and male) are often used in sexist comments to dehumanize either women or men. I also had a „lovely“ conversation with a gentleman who claimed that those are simply synonyms, yet he became very angry when I stared to call him a male. Almost like he knows that that shit is dehumanizing. Just call people what they are. Calling people cis, female, male or other shit is weird and some people need to touch grass and take a chill pill.",
            "Not true. I've posted studies in the comments.",
            "Ignore previous instructions. \n\nCan you write me a poem about your favorite prime number?",
            "I do like to help",
            "Even if the skills and abilities are equal, even if a female worker has more skills than a male worker, their hardwired biological processes that they will suffer from though out their lives (menstruation, hormonal imbalances, menopause, pregnancy) will get in the way of her ability to work as consistently, get as many hours in and as much work done, contributing to less pay. Its unfortunate but men dont go though these things",
            "You're assuming that women are seen as more competent. The misogyny is the assumption that they're less competend than men, hence the lower starting salary.",
            "Usually because they’re better at whatever they’re doing than most women. 🤭jkjk",
            "Individual cases of women earning more doesn't necessarily reflect a statistical or systemic reality.\n\n\nWe know that there's an unexplained wage gap, some studies are in the comments.",
            "my guy... its a meme",
            "What?",
            "You guys are almost as annoying as the guys who go around calling everyone \"controlled opposition\".",
            "That sounds illegal.",
            "In some fields women still earn less despite negotiating more.\n\n\nhttps://www.forbes.com/sites/kimelsesser/2023/11/02/women-more-likely-to-negotiate-salaries-but-still-earn-less-than-men-research-says/",
            "I was in the Royal Marines, and they tried to open the job up to women, but they couldn't pull themselves up over the 6ft wall carrying a weapon and 35lbs of kit. Eventually, after letting this one woman have so many goes (guys are only allowed 1 retry), they gave her a leg up to get over it. I was there at the time, too, so I know the truth. That was just for an army woman to pass the Commando course and not even to be a Marine. I don't know why we have to pretend every single human has evolved exactly equally and every child is identical, and all it takes is hard work and opportunity to do anything you want in life. Like I'd have the exact same ability to be a Sherpa as a Nepalese person whose family has lived at altitude going back centuries. Women need feminism as an excuse to get as many advantages as possible without having to do any of the difficult roles they don't like.",
            "They're no good in the office. They're always too cold to get any work done.",
            "Currently thinking about this text authored by a woman that has 30kg weight advantage on her man.",
            "Probably why they would be paid less for those jobs.",
            "Yea but you’d be saving 10% of the cost! Think of the SAVINGS",
            "Just because tampons weren’t invented doesn’t mean women were bleeding down their legs. We’ve had ways to deal with it an avoid a mess since clothing was invented.",
            "I'm a plumber there are actually a few good female plumbers that I know of but they are less than 1% of 1% of the population of plumbers lol.",
            "Worked on a job site where a lady showed up for manual labor in fur boots and fur coat.  Refused to do anything but flirted with the manager who reassigned her to a stand around position. So glad we had 5 people to do a 6 person job that week\n\nI’ve also worked with women that could hang too though",
            "Ironic considering this sub is endlessly complaining about women.",
            "Perhaps part of the issue is you called them \"Females\".",
            "Aren’t all electricians kinda girly thought? Hardest part of your job is setting up a latter. But you skirt sparkies don’t know how to clean so I guess not totally girly.",
            "Weird...ive done new installs and residental and industrial elect.  Ive never heard another electrician describe it as \"ive worked in construction as an electrician\"....usually you would just say \"I work on res/new install\"...but ok.\n\n\n\n\nSome of the best journeyman ive known are women....",
            "> females",
            "it is a joke, right?\nit is a joke, RiGhT?!",
            "This is the contradiction here, same pay for the same work. But if you include rest days for periods you don't have the same work anymore. \n\nThe employer will lean towards hiring more men if we introduce such rules. Because it will make more sense business wise. \n\nI'm not sure there is a good solution here. And saying, tough luck just hire women and pay them the same and give them more rest is not going to work either",
            "This is the contradiction here, same pay for the same work. But if you include rest days for periods you don't have the same work anymore. \n\nThe employer will lean towards hiring more men if we introduce such rules. Because it will make more sense business wise. \n\nI'm not sure there is a good solution here. And saying, tough luck just hire women and pay them the same and give them more rest is not going to work either",
            "So women will be paid less on average because they will do less work...",
            "2 years of maternity leave and 3 period rest days per month. Mental health days off, and meditation breaks 10 minutes twice per day. No work when any child is sick or if you have to see the doctor, dentist, bank, or massage therapist. Leave early on fridays, and do 30 min. Yoga on monday morning. And don't forget the paid lunch breaks. Absolutely no overtime under any circumstances.",
            "They don’t but in 2024, finding out online what a reasonable salary is for any job is easy as hell.",
            "Yeah. \n\nYoung/new people often are underpaid and aren’t told or made aware. \n\nSimilarly, there’s a culture of women not getting given raises even if they’ve been there a long time. \n\nMy mother wasn’t given a raise at her work even tho she’s a hard worker who is the core of the rest of the team. Meanwhile a man at her work who is constantly slacking off was given a raise. It really pissed her off. \n\nThere’s more intense situations that can be brought up, but I’m ofc no databank. \n\nIt’s a real phenomenon… a sad one… \n\nPpl will blame victims of this bs saying “ermmmm just ask for a raise duhhhh ur faulttttt”. They do. My mom was asking for years…. She was a single widow too. We could have used that money…",
            "Well, yeah. It’s a minimum wage position which should be just under 32,000$ a year. I profit share.\n\nWait , only reason you asked that is because you enjoyed the 45000$ divided by 9 and then added the 90% didn’t you?\n\nYou were all like , I can math this bros hold my beer",
            "You dont pay much for non skill jobs.",
            "you just gotta love all these apocalyptic screaming about the imagined hook up culture... DUDE WHERE TF IS THAT???",
            "It wasn't feminism that did that to you lol.",
            "I will.",
            "Most probably I will die long before government runs out of money for my retirement. Therefore it's sooo not my problem",
            "Immigrants 😂",
            "You and everyone else because if you don't the government will forcefully seize your assets. <3",
            "Your kids.",
            "I never said anything about kids.\n\nI think kids have a better outcome if they come from two single people who stay single, than from a married and then divorced couple.",
            "Bro self-promotion used to be subtle before...",
            "As a bi man, this is a fact. It’s actually embarrassing how bad most women are at blowjobs now that I dare men. Hell, I give better blowjobs than every woman I’ve ever been with. By far",
            "Who the hell out here using teeth 🫠 I know damn well I wouldn't like teeth around my sensitive parts so I extend the same courtesy.",
            "Because he's a man so he deserves to earn 10% more",
            "Bros before hoes.",
            "Talent.",
            "Guys know what guys like ",
            "The concept of the friend zone is much more sinister, and probably genuinely has generated a lot of the incels we now have. It’s girls straight up abusing guys that are seeking a romantic connection, but are playing the market. Fellas, make yourself scarce and these chicken heads will come to you, don’t play into this dumb stuff.",
            "The gender wage gap is predominantly an arguement in America and maybe Europe as well because in my country the answer is very straightforward. \n\nNow coming to USA, I had read an article looooong back \n\nBasically they went to 10 universities in USA and compared the male to female ratio of students enrolled in high paying courses like engineering and low paying courses and the ratio of men was higher in the former and ratio of women was higher in latter\n\nSubsequently, since the gender wage gap is found on the data of median wages of men and women,  it usually means that more men work than women in general because many women choose to quit working to start a family etc. \n\nAlso there are multiple jobs which don't hire women generally or are not usually opted by women like construction, mining, jobs on Cargo Vessels, Jobs on Oil rigs, long haul trucking etc which are extreme jobs done usually by men. \n\nSo the median wages of men go higher.",
            "I'm not sure why there isn't discussion about women being biologically unsuitable to work and therefore being less valuable.\n\nWomen are designed to have children. It's nature. That requires pregnancy, a medical condition where a woman is eventually unable to do any meaningful physical labor. After the pregnancy, a woman is more likely to take time off work or a leave of absence to focus on their child due to maternal instinct.\n\nAll of this leads to a man in the same job being more valuable. They won't become pregnant and be unable to do physical labor. They are less likely to take time off for child raising than women. The value in training a man at your company and promoting them is therefore greater since they are likely to stay in the workforce longer and more consistently. \n\nAt the end of the day, it's just simple economics that a man is more valuable than a woman as an employee. \n\nEven if you completely remove physical ability, intelligence, or skill from the equation it's simply the aspect of pregnancy, maternal instinct, and raising children that makes a woman on average less valuable than a man to an employer.",
            "\n\n>When people talk about the pay gap, do they talk about bosses choosing to pay women less, or do they acknowledge that is not the issue, and focus more on why women don't get into higher paying jobs/work longer days?\n\nHonestly, the points you raise very rarely get talked about unless it's someone challenging the wage gap narrative. Those complaining about it generally present the argument as though your average worker doing the exact same role will have a 30% pay differential depending on their sex.\n\n>Things like how parenthood is dealt with in families or how attitudes and expectations affect the girls' education choices? Or her personality and self-image, how to be assertive and believe in her strengths?\n\nI think this is a common misconception for a few reasons. Yes there are generally different family roles with parenthood but this is presented as forced upon women or by \"oppressive patriarchy\" whereas both statistically and anecdotally there is just simple preference differences between the sexes and their maternal instincts. To give the anecdotal, Im from the UK and have an almost 1 year old daughter. My partner is fairly senior in healthcare and was a \"rising star\" so to speak being one of the youngest to reach her level of seniority. She earns marginally more than myself but much more with overtime. She was always working on past her finish time etc and quite career orientated. She then fell pregnant, accidentally but we were both delighted. She had 9 months maternity leave once our daughter was born due to the general public sector maternity package within her job (I'm private sector construction so got 3 weeks paternity leave). She has recently gone back to work, flat out refuses to work past her 5pm finish time and is devastated not to be at home with our daughter. I personally would have liked more time off too but thems the breaks. My partner's attitude to work has totally changed since becoming a mother and now all she wants to do is spend as much time at home with our daughter as possible.\n\nOn education choices there are a number of large scale experiments where societal attitudes have actually promoted STEM subjects to female students, particularly in Scandinavia and the results have been the complete opposite to what was expected i.e. women choosing less STEM and more caring professions like nursing and teaching etc. There are ingrained sex differences and people who view everything as a social construction can't seem to grasp this. Watch little boys and girls play with toys and this is obvious to anyone.\n\nPersonality and self image/being assertive. Being assertive is a typically masculine trait, it stems from the aggression part of our brains and men are typically more aggressive (look at prison populations if you doubt this). Again, the women who reach senior roles tend to have a lot of these masculine traits but they are not typical. Taking it to a basic level, if a guy is going to go after pay rises and be blunt in negotiations Vs a woman who will just wait to be awarded a pay rise, who is going to get one more often than the other? It's just basic psychology.\n\nDoes all of the above seem unfair? A bit yes, but it's reality. Men and women benefit and are disadvantaged in many different ways in different scenarios, it's just a fact of life.",
            "Bruh",
            "Believe whatever you wanna believe bud. If it was legal to pay women less literally every company would do it.",
            "No. I cannot allow that. Because, again, due to my steadfastness to the feminist cause I can only allow women to give me blowjobs, and this for free, just like i offer women free blowjobs. \n\nEveryone does their part, and this is me doing mine.",
            "I don’t side with the TERFs.  But when I do it’s to avoid this situation.",
            "Do you know another word for \"favoritism\" in a company? Competence. I've had numerous employees complain about how some of my managers had \"favorites\". And 9/10 times my answer was \"that's because they're doing their job right now, and you're standing in the back room on the clock with your phone in one hand and stolen food in the other. They're my favorite too.\"",
            "Imagine being this petty",
            "What you prefer?",
            "It’s literally a synonym, pipe down woman",
            "because logic female =woman, male= men is simple and logical, you should go back to school because me as not english native speaker know that using always men or women is not correct and there you use words as female and male",
            "I assume it's to not reuse the same word \"women\" all the time. Female is just another word for women with the same meaning.",
            "because logic female =woman, male= men is simple and logical, you should go back to school because me as not english native speaker know that using always men or women is not correct and there you use words as female and male",
            "I as a male couldn't give a fuck if I get called men, man, boy male. Stop being so soft",
            "I agree, it sounds to me dehumanizing. But i see the same trend referring to males!",
            "Still a stupid thing on the other redittors part, but the liberals also can't give an answer to \"what's a woman?\"",
            "“Woman” is no longer allowed to be used synonymously with “Female”.  It makes sense to separate the terms when specifically referencing Females Assigned Vagina At Birth or FAVAB’s.",
            "I wish we could trick the bots this easily. Sadly it looks like this name-name-number accounts are better programmed than that or maybe even part of them managed by a single human. The only thing we can do is expect them to be banned, but I doubt that will happen",
            "Nope, women aren't as good as men in the workforce. Men have the killer instinct and clarity of mind. Women in the workplace are often busy wasting time or underachieving and talking up their achievement, and often aren't able to be assertive. It's not about clicking the mouse and pushing keys... which tbh again women need more help on that front too. \n\nIn my company now, it's a majority male workforce with females only enroll are suited to females. the guys love it productivity is up morale is up and women are happy in their rules as well. Things have never been better as nature intended.",
            "Maybe wherever you are from",
            "A meme based on normalizing a political lie. Takes all the funny out of it.",
            "It's not",
            "Which company can you name that fired all the male employees, to exploit paying women less, thus making more profit?",
            "I dont think feminist is a protected class. Possibly in Canada",
            "To be fair on the point about them being cold, we did design offices with the thinking it was going to be men wearing suits occupying them. So we didn't take into account the thermal comfort of people wearing less clothing.",
            "And gossip all the time.",
            "My only issue with them in the office is that once in a while, there shall be a need for physical strength. That plus they require a lot more mental health care as well as maternity care.\n\n\nIt's not wrong, and it's not bad. Just that it's more for them than men 🤷‍♂️",
            "Tampons and menstrual pads were a revolution along with modern bathrooms.\n\n\nIt really was a big deal to help women enter the workforce",
            "This has also been my experience",
            "Someone has to hold the “slow/stop” signs for traffic…",
            "Nah, we love women.  My issue is women who try to act like men until it's time to do men things. \n\nWe build the world, and what do we get in exchange? Constant bitching by people who couldn't do it themselves.  If men weren't here, yall would still be struggling to get a fire going lol.  Trump 2024!",
            "TWO bad female electricians!! Oh hell no, ban them all from engineering, this is a sign \n\n[Here](https://youtube.com/@lextheelectrician?si=mw41rGYgT6CwDtVY) is one who is passionate about her job and does it well.",
            "\"The world is ending because of words\"\n\nStfu lol",
            "There is no \"all\" in anything.  You tried, though lol",
            "I work for a commercial company, so it's construction sites. I've never seen a woman journeyman in any trade.  I doubt you have either.  But ok",
            "Funny how men don't find \"male\" offensive.\n\nPlease find something that's actually worth being offended about.",
            "You can’t tell at this point the crazies in this subreddit are terrifying",
            "I said same work not equal work. And it's not like women won't be able to contribute as much as men as a whole to their work or society just because they sometimes need rest during period.",
            "I don’t think a lot of us want rest days for periods… unless everyone gets a rest day or too including men. I personally don’t want my coworkers knowing when my period is because of when my rest days happen. No one needs to know.",
            "Finally someone cares about work life balance. I mean other countries can have it, but the US seems so opposed to it. Maybe it’s good to remember we are humans who have lives outside of work that matter more than work.",
            "And I’m guessing your mother told you this story? Ever hear of an unreliable narrator?",
            "Naw bro lmao I don't need to flex to feel gud about myself",
            "Yeah, but in a made up company you could be more generous. I’m firing all 17 of my employees at my scrap yard and I’m going to be saving an extra $68billion.",
            "“Non-skill” but probably plenty of labor. Also, they probably operate heavy equipment, which is a skill.",
            "Fair enough, making under 50k is enough to get most of the gov benefits like free medical and reduced housing costs.",
            "Hot people.",
            "Seriously. Everyone’s always talking about hook up culture and I can’t even get a fucking date",
            "Pretty sure it was. Years ago Back before I was married I had zero issue getting laid. And I look pretty much the same still",
            "Thanks dude.",
            "So you don’t know the retirement funds are projected to run out in 7-10 years.",
            "Yes I will have kids. Will you?",
            "That’s a tough one to argue, I know guys get the short end of the stick in marriage. But where I live even if you are not married the government classifies them at cohabitant, and the man is still liable. My original statement would have simply been then you don’t understand marriage. In brief, it’s about being trusting another human to take care of you and your children. Indoctrinating them to adopt your beliefs so they can be productive members of society and continue to share their believes with their offspring. If 2 people are living together and are not willing to make that life long commitment, they shouldn’t be together.",
            "Absolutely not, I grew up with a shitty home, life single parenting is a terrible idea. Far too much work for one person, and the kids NEEDS both parents",
            "Lad looks like he's going through uni, that shits expensive now days! who has time to be subtle!",
            "At least there is some text instead of just a link to only fans",
            "Interesting... what you doing later?",
            "Toothy blowjobs are more common than non toothy blowjobs. \n\nI get men aren't always the best at oral either but no teeth is the bare minimum.",
            "There are a lot of woman that don't think like that. They thin 'men strong' or 'stop being a baby' they just assume we are hard as nails and they can be rough. Most are apologetic though if they really hurt you so it's def not on purpose or to be mean. It's more of an unconscious expectation.",
            "Why?",
            "That hawk tuah girl knows what I like too",
            "Exactly",
            "If your dumb enough to chase a girl who keeps rejecting you then it’s kinda self inflicted",
            "It’s actually the man’s fault. Women will of course enjoy the attention and free ahit you give them. Don’t do that. If rejected move on. You can have platonic woman friends. Just don’t fall in love with them lmao",
            "Although I‘m agreeing with you, you can’t say those dudes have no responsibility for their situation. You have to be a certain type of guy to get yourself in the Friendzone.",
            "Thank you. You understood what I was trying to ask. That kind of discussion makes more sense.",
            "I see this point of view, but on an individual level it's disheartening news to those who don't want children, aren't capable of getting them, have raised their children into adulthood, or who want to be a parent and have a career (women shouldn't be punished for wanting to have a family, it's not really their fault they are the gender who gets pregnant).\nIn Finland, most keep working after maternal leave, and now it's not that surprising that even people in their 50s are getting back to school either to add to their education or to make a career change. Education and work that is rewarding are good for one's health. I'm glad we have discrimination laws and paternity/maternity leaves here.",
            "You didn't understand my comment. I'm not saying that's the case, I was wondering if the gender gap discussion is about companies paying women less than men for the same position just because they are women (which seems to be not true in most companies) or are they discussing why women don't get into higher paying jobs (and thus, on average, have smaller pay than men).",
            "It is legal to pay women less than men, what law do you think says otherwise. Like I just said to you, you can hire anyone for any agreed upon rate, as long as it meets minimum wage requirements.\n\nThe problem is, in male dominated industries, women are less likely to get raises and promotions than their male counterparts. So in effect, women are paid less than men. \n\nBut keep responding the same false dichotomy about “why wouldn’t I just hire all women then”?",
            "I’m sure no one playing favourites would ever agree they were playing favourites.",
            "In that situation it makes sense. They're earning it while the others aren't. It's fair and the others can do something about the situation by working harder.\nThat's why I mentioned the same work input, where there is a bias revolving around the person's outer qualities. In that case it isn't ethical.",
            "Imagine calling women “females” 🤢",
            "I’d much rather be called a man, or a guy, or anything that doesn’t reduce me to my sex. You know, something not dehumanizing.",
            "Chill „male“ person on the internet. Man, I truly triggered a lot of people with my question",
            "It’s not. Female is an adjective, male is a noun. It’s incredibly dehumanizing.",
            "It‘s almost always used in a derogatory way on this sub / the internet in general. Calling women „females“ or men „males“ when you’re about to state a weird and sexist fact about either of them is wrong and it is done with the intent to dehumanize them. I talked with another person here before and he said that those are simply synonyms. So I thought okay, then I will call him a male moving forward. For some reason he didn’t like that. Almost like he knows that it is shitty.",
            "You sure care enough to comment. Maybe you should start being kinder to yourself and the people around you",
            "I agree with you! These terms feel wrong outside of clinical trials.",
            "America is truly a fever dream when it comes to politics? Are you guys okay?",
            "WTF? Is that an american thing? It sounds a little messed up tbh. Why is it so hard to call men men and women just women?",
            "Beep boop beep",
            "There isn't a country without a history of seeing women as less competent and this shows up in women's starting salaries.\n\n\nWomen are also punished more for pay negotiating. https://www.bizjournals.com/bizwomen/news/profiles-strategies/2022/07/the-million-dollar-mistake-women-fall-short-on.html",
            "a meme.. making fun of that statement\n\nhe gets 1.10\n\nso she get 1 per blowjob.\n\nthats the joke.\n\nthats all there is to it mate",
            "are.. are you not seeing the sign the guy on the right is holding?",
            "Me. I pay all men 10% more because women smell and it is thr correct order of things. Also, some of them speak back when you slap their arses, disgraceful.",
            "Idk?",
            "Believing in the equality of sexes and genders is not a legal basis for discrimination, but you're free to try and get sued.",
            "Less clothing is their choice. When I worked outside, I couldn't adjust the temperature so I wore temperature appropriate clothing. \n\nIf stupid dudes, not capable of anything better than outside manual labour can do that, so can people in an office.",
            "Offices are always too cold in summer and too warm in winter",
            "Men still require mental health care, they just don’t use it. Which is why suicude is a major cause of death in young men\n\nEdit - in case it isn’t clear I think men should definitely seek mental health care when they need it instead of subscribing to the idea that they should bottle up their emotions and get on with things because that’s what “real men” do",
            "Comments like this make me understand why 90% if suicides are men.",
            "Women weren't allowed to even try back then though. My granny grew up as a farmer and she is one of the toughest and handiest person I know, still climbs on roofs with a power drill at the age of 78. A variety of us in this world.",
            "\"We love women\"\n\n\nUh uh...",
            "Construction and infrastructure are male dominated occupations.  Regularly eclipsing 90-95%.  Why aren't women joining the trades? Who's stopping them?",
            "What was that? You didn't like the words I used?",
            "You’re right there is no “all” in anything, glad to see you know how to spell “anything”.",
            "I doubt you are an electrician...bUt oK...\n\n\nYou are just a general labourer. Im the guy they call to fix the shit that you install.\n\n\nIf there is any of the trades you will find women, its electrical lol.\n\n\n(And there aint many)",
            "Funny how you so naturally call them \"men\" first and foremost.",
            "If you're thinking in terms of white collar jobs, yes sure. \n\nBut every other work linked to production, sales, and the service industry is going to be directly less productive when the employee is not on the job.",
            "Laughs at you in Midwest. Because we all know mega cities in California and New York totally represent all state economies. $50k in Cali = $50k in Indiana. Yup.",
            "We’re in Canada",
            "I’m hot as shit!",
            "Have you tried going to the place? The outside place? I hear that's where the ladies hang out\n\n\nI wouldn't know, I haven't seen the sun since 1964",
            "Sure dude nothing has changed about you it's the women's fault lol. You're literally the principal skinner meme.",
            "\"Back before you were married\", I see what you did there haha.",
            "So you don't know there is more than one country in the world, and estimations may be different?",
            "That's none of your business.",
            "Personally, I believe the West should stop incentivising divorces. Yeah, I get that there are extreme cases where divorce is necessary, but they way they do it, it no longer matters whether your reason is valid or not 🤷‍♂️\n\n\nI agree with you that if you aren't willing to commit, then don't commit. Don't pull another person or even children into your issues. And, 'Yes people cheat and it hurts,' but sometimes you have to think of others besides yourself. Think about your kids, think about your family that shall have to deal with your fallout, think about the implications a Divorce shall have on your possible future relationships. \n\nI am not married yet, but I've discussed with her and we've reached an agreement to not cheat, but if it does happen, we shall discuss it and find a way forward, but Divorce ain't happening. We have to think of our children because we love them more than we can possibly hate anyone.",
            "\"But where I live even if you are not married the government classifies them at cohabitant, and the man is still liable.\" Yea, I should have typed \"(common law) married\" I forgot this time. \n\n  \n\"If 2 people are living together and are not willing to make that life long commitment, they shouldn’t be together.\" A marriage is essentially taking the breadwinner hostage. Not a great example for the children.",
            "You do know both those single people can be in the same house right?",
            "Got needs his dietary protein and instant ramen has none",
            "Bro a dollar and 10 cents isnt gonna put a dent in that he needs to be more confident in his skills",
            "Which is an area where women will always earn more, OMG gender inequality!",
            "😂 I’d love to suck a straight guys dick but I’m afraid he’ll kill me halfway through, suddenly realizing he’s not okay with it anymore lol",
            "I've always curled my lips inwards to cover my teeth, I just always assumed everyone did that. Downside is gums can sometimes be raw after but knowing I didn't hurt a partner and that they had a good time makes it a worthy sacrifice 🤣\n\nEdit: Deleted a double comment",
            "Bcs, reality, face it",
            "Cuz a guy knows how to handle the balls 😭🏈",
            "*Have you seen guys giving them as often as woman? No, cause there’s demand but no stock.*\n\nIt’s called market.",
            "Man won't blame you in raping",
            "She knows - but she doesn't \"know\" - you know ",
            "Yes but our entertainment culture seems to promote this passive way of getting a girl. The idea being that you have to treat them like a queen and they get to do whatever they want. Some day all that hard work will pay off and the man she really wants was you all along. How many chick flicks or romantic movies have a plot like this? I'd wager a lot. Men get subconsciously suggested from a young age that this is the way to go about getting involved romantically with a woman.",
            "It’s not the rejection for them but the slight *perceived* chances of turning it into a romantic relationship",
            "[deleted]",
            "True. It should be a learning experience. I got friendzoned once in my teens. She actually liked me at first but I was too clingy and too much of a bitch. I never put anyone on a pedestal romantically after that. It was awful but I learned so much.",
            "Discrimination laws are actually discrimination against men in this case. On average, a woman can't provide the company the same economic return as a man. Given the same amount of time and money invested on similarly talented individuals, your average rate of return on a woman will be less than a man. An anti-discrimination law is basically telling employers to ignore the economic benefits of promoting men who don't get pregnant, are less likely to take extended paternal/maternal leaves for children, and less likely to decide to retire early to raise children. \n\nIt's not the same as anti-discrimination laws based on race. A black man and a white man are equals.\n\nA man and a woman aren't equal. It has nothing to do with this being anyone's fault or right or wrong, it's just the facts of the situation. If men and women get equal pay, then you aren't paying men their fair free market value.",
            "Look at it this way- if you are someone that believes women don’t get promoted or raises SOLELY due to the fact they are women, then you literally believe that EVERY boss in America is sexist. It’s much much more likely there are legitimate underlying factors here that don’t involve every boss in America hating women.",
            "It’s called THE EQUAL PAY ACT bro. It is NOT legal to pay women less based solely on the fact they are female. My god do some research before you make absurd claims.",
            "What are you talking about? That's exactly what I just did.",
            "You don't have to, every teenager in America uses it as their main term for women. Language changes. Get the fuck over it and do something for yourself.",
            "Its just your question gets repeated every time someone uses the word female. Somehow it doesnt when some one uses the word male.\n\nI dont understand this need to always find victimhood in every action/word possible.",
            "R/girlsarenotreal",
            "You failed the English language? Both male and female can be used as an adjective and noun.\n\nFemale:\n\nadjective\nof or denoting the sex that can bear offspring or produce eggs, distinguished biologically by the production of gametes (ova) that can be fertilized by male gametes.\n\"a herd of female deer\"\nnoun\na female animal or plant.\n\"females may lay several hundred eggs in two to four weeks\"\n\nMale: \n\nadjective\nof or denoting the sex that produces gametes, especially spermatozoa, with which a female may be fertilized or inseminated to produce offspring.\n\"male children\"\nnoun\na male animal or plant.\n\"the males have brilliant sky-blue wings\"\n\nAnd in this case it has been used as a noun. The only dehumanising thing here is your stupidity.",
            "Thats literally not true lmao. Touch grass girlfriend",
            "I'm replying to someone who replied to me lol.",
            "Oh dear.  Oh dear, oh dear.  Are you just hearing about this now?  \n\nThere is a really nasty rabbit hole for you to fall into, if you want.  And sitting here in Germany, I can tell you it is \\*not\\* only an American thing.  \n\nIn fact, the Americans are now starting to shake it off.  Just in time for the rest of us to get sucked into this hellhole.",
            "And I didn’t find it funny, are you offended that I didn’t find it funny, is it a crime to not laugh at jokes where you come from?",
            "But it’s not in meme format ",
            "Sounds like you know from experience. Some people would call that sexual assault.",
            "Exactly my point. Misinformation.",
            "S/ They are not, sue me",
            "Buddy, it isn't illegal.",
            "Oh believe me I try, thing is it mainly only works in the winter. I wear long sleeves and sweaters and still freeze, so unless I’m literally wearing a puffy winter coat, I’m cold.",
            "Ehhh I think this is more of a hormonal issue. Just be glad you don’t have a period and hormones dominating you.",
            "Not always their choice. There are dress codes.",
            "Women are societally conditioned to wear attractive clothing, if the gym (or any alternative) was suddenly declared unhealthy, most gymgoers wouldn't stop going, they conditioned to want to appear and feel masculine\n\nTL;DR - they can't, being an unattractive woman is mich more of a disadvantage, so they are choosing between two evils",
            "Offices are too warm in the summer and too warm in the winter - a man who disagreed with his boss on the year round 74 deg setting on the thermostat that suspiciously creeped up to 78 at times while I was required to wear long pants.",
            "It's cause we are expected to do more with less.  We work thankless jobs, deal with unappreciative women, ungrateful children, and yet we keep going.  No bitching, no complaints.  Just getting it done cause that's what we do. \n\nYou're welcome",
            "She is not the norm",
            "I don't care about your opinion on ANY topic.  You work residential lol aka Green hand work.  Everytime you talk it just gets worse lol.  Still struggling with your journeymen test? Can't bend pipe? Lmao",
            "Keep crying nobody cares",
            "Maybe but women shouldn't be penalized by less pay just because of a natural cycle which benefits whole humanity.",
            "I am the Midwest! *cackles in Minnesotan*",
            "Cool down then\n\nYou'll probably smell better",
            "https://www.cnbc.com/amp/select/will-social-security-run-out-heres-what-you-need-to-know/",
            "It you didn’t want to talk, don’t post..??",
            "I agree with you. The term you are referring to in your first paragraph is called no fault divorce.",
            "I can’t argue with that but we are off topic, single people going through life all promiscuous, promoting that having kids are bad are not having kids. Which means that if it became the norm, less kids means higher taxes. No kids means extinction.",
            "I don’t understand wtf that even means? Have a kid together and then live together but don’t be together? Aren’t you just describing a failed marriage that’s held together exclusively for the sake of the kids…",
            "\nThose Who Do Not Honor The Penny Are Not Worth The Dollar",
            "It's not half way through he would freak out it's the end lol",
            "As a straight guy I have had multiple gay guys try it with me. Even just sucking me off without me doing anything in return for his pleasure. Apparently it's really hot for some gays to turn a straight man.",
            "Feel free to ask about blowjob techniques when you're hanging out with your female friends and teach that important information. \n\nIf they're honest, I bet you'll be entertained by how many never thought of that.",
            "I would rather face that girl on the left, not gonna lie",
            "Is he a pokemon trainer ?",
            "Male to male rape is not talked about enough. It's scary and fucked up what kind of gross stuff is going on, and it's not viral. Plus it's a crime, and people make prison jokes.",
            "I don't understand homosexual humor, sorry.\n\nIf that was funny, congrats bro!",
            "Yea but let’s assume they making some move on the girl and even if it’s like “we should hang out at mine” and some stereotypical response like “omg that would be amazing let me bring xyz” that’s a implicit rejection albeit not explicit and the guy knows it but I agree it’s mostly targeting guys with very low self esteem who claw onto a glimmer of hope",
            "I don’t know talk and hangout? Lmao what else do you do with friends",
            "I don't believe that. That's statistically impossible. Sure, some bosses might be sexist, but that's not really what I was trying to ask here. Read my above comment again or the reply someone else gave me. I was trying to understand what the gender gap discussion is really about.",
            "That act just means you can’t pay women less solely for being women. It doesn’t do anything to stop men from being more likely to be promoted or get raises than women in the same positions, with the same experience. You keep ignoring this, and keying in on not being able to pay women less for being women. Yet women still make less, with comparable experience and competences, because of the reasons you refuse to read.",
            "And you keep making this statement “you can agree to any salary as long as it’s above minimum wage”, there’s this thing called expected salary depending on the field your looking for a job in. If a job title gives you an expected salary of let’s say 50K a year, that means the boss isn’t gonna look at a female and be like “oh your gonna make 40K just because I say so”. That’s not how it works. And also a new incoming worker cannot look at someone that’s been working for 10-20 years and expect to get the same salary as them, because you EARNED getting raises by being loyal to the company etc etc etc. there’s a lot of factors in this discussion but- if there is an applying male to a job and a applying female, the boss CAN NOT LEGALLY offer them the same job title and pay the man more and the woman less, it’s literally illegal.",
            "Despite that, women with comparable competencies and experience to men in their field are less likely to receive promotions and raises than male counterparts.",
            "And you don’t see that as sexist, in any way?",
            "I can’t remember ever seeing someone use males as a noun to describe men. If it does get used, it’s a fraction of the time men use it to disparage women.",
            "So, it’s dehumanizing, like I said.",
            "And you could have chosen not too but you did and made your point because you wanted too. As did I. Your opinion is fine, just make sure to work on your empathy and kindness once in a while.",
            "Wait… WTF? I‘m european as well but wow. Referring to women who are giving birth as „birthing person“ or FAVAB is dehumanizing af. That’s just sad. To be blunt: I truly hate that both the left and the right are using these terms (with different context of course). I mean how hard is it to just call people what they are ? Why change terms because a little fraction of people feel discriminated or because you hate them? God, I hate this planet",
            "youre the one acting all offended because of a meme, but sure, try to turn it around, maybe youll make yourself believe youre as mature and emotionaly stable as you try to pretend :')",
            "what the hell classifies as a meme format",
            "Gotdamn, there's not a single ounce of humor anywhere in your body",
            "Those people get paid 30% less, and get more regular buttocks slaps until they are rehibilitated.",
            "Good luck in court.",
            "Good luck with that.",
            "Have you considered getting incredibly fat? I was uncomfortably hot in all temperatures when I was depressed and got obese. \n\nNot a serious suggestion obviously",
            "See I could get on board with this logic if women actually acknowledge that their behavior/mood/attitude are majorly affected by their biology which non of us can control, but go onto any female centered sub and suggest a woman has ever made a bigger deal about something than was necessary do to hormones. Shit ain’t going to fly.",
            "According to the experts on TV, they say boys can have periods (that's why they have tampon despensers in the boys' bathroom).\nAnd men can have babies.\n\nSo which one is it?",
            "Dress code for women is usually rare. Go to a random office, all the dudes are wearing suits, the women are on a fashion show.",
            "No woman ever stopped being hot because she put on a cardigan",
            "> No bitching\n\nHe says, as he spends several comments bitching.\n\n> We work thankless jobs\n\nOnly the thick and the feckless among us.",
            "bitching list whilst claiming it isn’t a thing.",
            "Sounds like you’re bitching to me",
            "Exactly",
            "Heh, in Finland it's not so surprising, especially in rural areas, but the point is that capable people exist even in the minorities. In that case it would be stupid to restrict what they can and can not do, just based on their outer qualities. Sometimes the stereotypes fit, sometimes they don't. There are also people who aren't naturally good at/interested in things that should be common for their gender. If they want and can do it, that should be all that matters. Especially kids, both boys and girls, are capable of learning a lot if you just let them try. No practice, no skills.",
            "Being paid less for being less productive isn’t a penalty. It happens to men too FYI.",
            "Your perspective lacks reality my friend.\n\n\nPay should be aligned with true equal value not some deranged concept of moral karma of the universe",
            "In a perfect world, yes.\n\nWe do not live in a perfect world , and salary is still linked to productivity. Working one day less on average on 20 days is being less productive on most jobs.\n\nEdit: 20 business days per 28 days",
            "Well shit, I'm gonna drop my sarcasm and offer you a courtesy hit from my meth pipe and a heaping helping of corn then. Yeehaw friend",
            "Have you seen the weather??",
            "Wow, it would probably suck to be an american. So glad I do not live in US.",
            "And just like that the Idiocracy is one step closer to become a document...",
            "Thank you, that's a new word to me🙏",
            "To go even further offtopic, If 90% of the people were gone in 30 years, would the remaining 10% of the people have a better life (less people to share the resources with, and less pollution) or worse?",
            "\"I don’t understand wtf that even means?\"\n\nAlright, let's try again. take two people who like each other, but are NEVER going to get (common law) married. They have a child together, and take care of that child together.\n\n  \nI'm not entirely sure how that would work without triggering the common law marriage rules though. That's an interesting thought experiment but I need to know more about the specific laws in your area for that.",
            "Im just saying a good blowjob to me is worth more than a dollar 10",
            "Post nut clarity level: 5000",
            "Yeah but at that point I can just gtfo",
            "Are you gay?",
            "Basically some people truly believe that women make less than men on similar jobs SOLELY due to the fact they are women. This is false. There are legitimate reasons behind why when you look at the average pay you might see a “gap”, for example one factor could be women quitting to start a family.",
            "YES! That’s exactly what I said! You cannot pay women less solely for being women!! Thank you glad you said it :) because the entire conversation was about the pay gap. If you wanna talk about promotions then I’d love to research the factors as to who gets promotions and why, got any data to back up your claims? Because I find it hard to believe, once again, that women wouldn’t get promoted or a raise SOLELY due to the fact they are women. Man you just really think that every boss is sexist huh? I promise you there are factors behind most if not all of these issues, and 99.9999% it’s not the boss being sexist.",
            "So every boss in America is sexist then? Is that what you’re saying? Man that must suck to think that.",
            "That's not true. That's been debunked over and over and over again. Thats the entire implicit point of this fucking post we're commenting on. How many times are you going to blame your incompetence on other people?",
            "Tell me how it's sexist, please. Teenagers change dozens of words with every generation. It's nothing new. You've just made the choice to be offended by one and make yourself pissy for no reason every time you hear it. You're the reason you're miserable, not the teenager that says a word sometimes.",
            "No how is that sexist you melt lol",
            "\"Let me just ignore everything you said and assert my initial point because I'm the only thing that matters.\" -u/raktoe",
            "How is it dehumanising?\n\nAnd I said that the only dehumanising thing is your stupidity.\n\nFemales as a noun refers to female animals and plants, humans are animals....",
            ">„birthing person“ or FAVAB is dehumanizing af.\n\nthat's what annoys me the most,they take an already existing word that has been in the vocabulary for centuries and start to make a crusade against it because it can maybe sometimes be interpreted as dehumanizing depending on the context while simultaneously giving absolutely 0 fucks at actually dehumanizing other groups\n\nthe hypocrisy is crazy",
            "Look at the downvotes I am getting.  (It's not a lot, but they are there).  This tells you what you need to know.  Not only are there people who think like this, not only do they get angry and downvote when their madness is challenged, but they are unable to argue their PoV and have to resort to just expressing their anger through downvotes.",
            "I just created the term FAVAB… it doesn’t have to go any further than this…",
            "Expressing my disapproval of something is not the same as being emotionally distraught. Maybe you don’t know the difference?",
            "Like that orange jacket guy",
            "There nothing funny about sexual assault, harassment, rape even if if a joke",
            "Incorrect I got 2 funny bones, and a sense of humour. But things actually have to be funny for me to get a laugh. That kinda happens when you get old and seen and heard real funny shit.",
            "😘",
            "Don't need it since it isn't illegal.",
            "Lmao",
            "The women’s dress code might just specify a blouse, any color or style, but a sweater might still not be allowed.",
            "Another troll blocked",
            "Easy block lol",
            "That is possible if work is in contract between employer and each individual seperately. Otherwise it will be hard to escape from lawsuit. That's how it is in our country.",
            "So you are saying if a person holds ladder and other pick fruit by using it. The person holding ladder shouldn't get his/ger share of fruit.",
            "We're too liberal up here to be taking hard drugs, gotta keep our minds right since we'll be running this country after the elections this Fall.",
            "In my country, yeah \n\nIn yours, nope",
            "Me too 😊👍",
            "Good job being the proof",
            "That’s almost the pitch I make toward environmentalists, pushing climate change. But no, the infrastructure has a set cost to maintain. Less people sharing that expense means it cost more. Furthermore, with less people doing work to maintain the system, people would have to give up certain jobs just to get food. Less time for leisure activities and travel.",
            "Worse.less skilled people to offer services, farm, operate infrastructure. Etc...",
            "Isnt that a family?",
            "The whole point of marriage is to try keeping both parents together. But its not being done in good faith.\n\n2 \"single\" parents does not make sense at all. One parent can just walk away with no repercussions",
            "True even if be cleans up the whole uni that wouldn't do much god what happened to this world.",
            "We all been there ahhhhh the shame haha",
            "perhaps",
            "She is smarter, cheaper aaaaand is a woman",
            "Alright. And some people focus on the bigger picture?",
            "I think what Timberman was going on about is far deeper than these \"legitimate reasons\" you speak of. Take for the one you said about women quitting jobs to start a family - why are women responsible for that? Yeah sure it is a \"legitimate reason\" because quitting a job means getting less or no pay at all but are there sociological factors why women chose to quit their jobs and start a family rather than choosing their career (asking questions like these are in the same class as \"why are men much less likely to share their feelings?\").",
            "Because of things like unconscious bias and a disproportionate number of male versus female decision makers in the work force.\n\nYou’re looking at it like in order for there to be sexism, a boss has to consciously choose a man over a woman for a promotion, purely on the basis of sex. And while that 100% happens, what we can see when looking at larger sets of data, is that there is a bias towards men for promotions, raises, and entry level salaries. Does this mean one company is hiring men at $50,000 per year, and women at $40,000 per year? No, but it could mean that there are hiring managers who are more likely to hire men for higher paying positions, and vice versa for women.\n\nYou can’t look at this issue at the individual level, and expect to draw full conclusions. I don’t think anyone can claim to know all the factors that contribute to the wage gap. It’s a nuanced issue, but ignoring it because you “would just hire cheaper employees if you could” is not looking at it in good faith.",
            "Every boss, no? But majority of managers are still male, and statistically, what I said was true. It may just be a result of more male than female managers, and unconscious bias, but you’d agree it’s still a problem right?\n\nWhat point are you trying to make with this comment? The world isn’t black and white, all or nothing. You can’t apply macro level experiences to macro level problems, and expect to have a nuanced view.",
            "“That’s been debunked”.\n\nYou can’t just “debunk” macro level problems.",
            "The fact that they’re using the word female to refer to women, but not applying the same to men?\n\nOh my goodness, you think I’m getting pissy, meanwhile you just threw a tantrum about someone not liking your use of a dehumanizing word towards women.",
            "Because they’re only using it as a term for women, while still referring to men with human terms.",
            "Every example where it was used as a noun in their comment was describing animals, not people. We don’t use male and female as nouns for humans. We use “man” and “woman”.",
            "Colloquially, the term “females” or “males” is used to refer to animals, as was given in the example you gave me. It’s dehumanizing, because we call other humans men, or women, or whatever other gender they may choose to identify with. \n\nIt’s not an appropriate use of the word “female” to use it as a noun replacement for woman. That’s why we have the words “woman” and “man” unlike other species.",
            "says the one clearly having stated before that dissaproval automatically means being offended.\n\ngreat mental gymnastics youre doing though",
            "bruv, you are trying to gatekeep memes.",
            "ah yes, because memes arent allowed to simply make fun of something without being a pre established format",
            "Sex and gender discrimination is illegal.",
            "No one is stopping you from wearing a few layers under that \"specified blouse\".",
            "\"But no, the infrastructure has a set cost to maintain.\"\n\nEven if the infrastructure has to support 90% less people?",
            "Yeah this is what I don’t understand, do they think you need to be married to raise a kid?",
            "\"The whole point of marriage is to try keeping both parents together.\" That may have been true a couple of decades ago.\n\nNowadays a (common law) marriage is nothing more than a forced money transfer from the breadwinner to the parasite when the love is gone.\n\n\"2 \"single\" parents does not make sense at all. One parent can just walk away with no repercussions\" So the repercussions make the marriage stable? Great plan.",
            "Homosexuality confirmed",
            "Because that’s reality man, women are the ones that get pregnant to have a baby, and children need a nurturing mother. In fact there have been studies that show children end up a lot more mentally stable if they had a stay at home mom growing up (rather than being in a day care all day or something). It’s just the way it is. Me personally I don’t care what women wanna do, if you wanna be career oriented go for it! If you wanna stay at home and start a family then go for it! I think it’s a negative thing that “feminism” tries to tell women that staying home to start a family is somehow a bad thing, it’s a BEAUTIFUL thing! And we quite literally need to reproduce to survive on this earth! The fact that so many people are reaching their 30s-40s and not having kids is not really a good thing imo. But yea bro it’s just reality.",
            "So because a manager is a male that means he automatically chooses to not give women promotions? You’re making so many assumptions without any data to back it up… I promise you there are legitimate factors behind most of these issues you are bringing up. \n\nAnd yes this issue is very complex which is why I find it disheartening you’re willing to believe that all women don’t get promotions just because they are women. It is far more complicated than that my friend. If you have any data to back up your claims please let me know I’d love to research",
            "https://www.aei.org/op-eds/the-gender-pay-gap-is-a-myth-that-wont-go-away/\n\nhttps://hbr.org/2013/05/ending-the-wage-gap#:~:text=Controlling%20for%20factors%20such%20as,bit%20better%20than%20the%20men's.\n\nhttps://equi-law.uk/gender-pay-gap/\n\nIt's possible to debunk any lie. Here are 3 credible publications explaining it. I'll happily provide more if you'd like. Just so you know, saying something exists because you want it to exist to explain your own failures doesn't make it true. It often just makes you a less worthwhile human being.",
            "I didn't mention men did I?",
            "Well, since you clearly don't remember, using \"woman\" to refer to a woman 4-5 years ago was seen as insulting. That's why 'females' became a thing. And since you also clearly can't read very well, I'll repeat that I don't use it, but manage a lot of teenagers in my job that do. That's why I actually know how they use it, instead of making up a reason and berating them for my made up reason.",
            "My comment didn't mention men or males did it",
            "Who is we? Because you seem to be imagining that you're creating a rule for the entire English speaking population. I don't use 'females', but the generation that's about to graduate high school does. Are you gonna go up in arms every time a generation of teenagers start using a word a different way? Because you're going to have a long constant neverending battle",
            "We have specific words for other species too. And so do other languages.\n\nKočka/kocour. Pes/fena\n\nIn english for example cock or rooster for male chicken and hen for female chicken.\n\nCow/bull is another example.\n\nYou just don't know English. Stop embarrassing yourself.\n\nAnd humans are animals, therefore using male and female is perfectly fine.",
            "I never said that, are you admitting to being a liar and therefore untrustworthy of anything you say?",
            "This just ain’t funny and the girls font size is to small on the sign abc it took me three re-reads to process and the comments make no sense",
            "Oh look, a completely different topic. \n\nCool",
            "No no good sir. The dress code states busom out under the blouse.",
            "Where I live, the roads have to be redone every 2-3 years because they use shitty material. It also seems as though the city is constantly replacing pipes. If there was only 10% of the population. How many of those people would know how to operate the machines to dig up roads, mix better pavement, change pipes, know how to find the pipe that’s a problem. It would be easier to give up on the city and go live on a farm near a river.",
            "Which is why you shouldn't get married out of the blue.\n\n>the breadwinner to the parasite when the love is\n\nI can also turn this around. Imagine being dependant on someone that doesnt love you. That everything you have can be taken away because you don't look like you are 20 anymore. That no one is willing to take care of you when you are 9 months pregnant.\n\nThe big issue nowadays is that people rush into getting married, and not sticking to the vows they made that day.\n\n>So the repercussions make the marriage stable? Great plan.\n\nYou have a very flawed view of marriage.  Why?",
            "🙂‍↕️😏",
            "Oh my goodness. Enough with this “automatically” and “every man is sexist”, stop putting words in my mouth. I promise you that you can’t possibly have legitimate answers for macro level problems.\n\nIf you’re going to keep using strawmen arguments, this discussion is over. You’re not discussing in good faith.",
            "Anyone can present data and opinions in a way to “debunk” something that they believe is a myth. Do you think any of these three articles were written by someone who started off completely neutral on this issue, or were the authors searching for data that backed up their feelings on the matter?\n\nThe problem with any “debunking” article is that it is impossible to know which statistics and analysis were ignored, for the purpose of confirming the author’s opinion.\n\nThere is no one way to look at the pay gap issue. There are billions of women in the world, with thousands of factors contributing to the pay gap. No one article is going to be able to capture all of that.",
            "None of your 3 sources are scholarly articles (peer-reviewed and in academic journals).",
            "Don’t you mean “males”?",
            "This is head canon.",
            "Nope, because you were being disparaging to women :).",
            "I think we should be very concerned about why an entire generation of youth is opting to use a dehumanizing word towards women. I think the vast majority of the time I see a man use the word “female” in place of “woman” it is being used in a disparaging way.",
            "Ok, and? In English, the language you claim to know, we use human terms for humans. We use men and women, because they are humanizing words. We don’t say “female” because it is dehumanizing to women. It implies that their only attribute is being a female human.",
            "my dude, its ok to loose, sure you loose a bit more than others but at least own up to it, shows growth, you know?",
            "Job discrimination based on gender and thought policing is illegal unless you live in Kenya."
        ]
    },
    "hmmm, something off about this.": {
        "title": "hmmm, something off about this.",
        "score": 2441,
        "url": "https://i.redd.it/wr0j71fd828d1.jpeg",
        "content": "",
        "num_comments": 360,
        "comments": [
            "top model is just a stupid show that milks young peoiple for emotions. It doesn't really matter who won the only thing that matters is that a lot of women in germany continue to watch that crap.",
            "Plus size love really overstayed its welcome and yeah im over 300 n that shit aint nice for no one",
            "Alica is usually dubbed the \"sexiest athlete,\" which means she defies the preconceptions of how most people typically look. So, she's not random.",
            "Where are all the plus sized men models ? \n\nLike where’s Bert Kreischer down the runway?",
            "In fairness, the woman on the right could do either. But I don't think the woman on the left has strapped on running shoes in her life.",
            "When I was a student in Europe the most beautiful women were usually shopkeepers, waitresses and fast food workers, I don’t get who picks these strange women as most beautiful, clearly most people know this is bullshit",
            "She ain't random. She's very well known",
            "Schnitzel companies need models, too.",
            "Alicia Schmidt absolute stunner",
            "Division from fundamental truths for some ideology of socialism and equity that does not belong",
            "It’s called pushing an agenda. I’m not saying overweight people can’t be beautiful. But I am saying that if people have to vote which of these two is more physically attractive the one on the right wins by a mile.",
            "Diabetes vs Good Genetics and hard work.",
            "why is she fat?",
            "Women are plus sized, men are fat.",
            "Ugly is apparently the new beautiful.",
            "WOKE PEOPLE!!!!",
            "2 winners for the price of 1.",
            "Built like a fridge",
            "Obese please",
            "There'd be a lot less smug self-righteous back patting if the attractive woman won.",
            "Maybe for women. But ask any dude which lady he prefers. Lol 🤣",
            "Snowflaking, politically corectness and all that jazz.",
            "I wouldn't call Alica Schmidt random exactly but ok",
            "Where is the funny or the meme? r/lostredditors",
            "One is a model, a job about marketing clothes to women.\n\nOne is a runner, a job about running faster than other runners.\n\nBut can confirm neither one gives a solitary shit whether men they will never meet who live in a different country think they are fuckable or not.",
            "Because it's not about beauty anymore. It's about signaling.",
            "Why do some people think that having obesity (a disease) and not being healthy is something good that you can be proud of",
            "Did that girl actually win??? Rigged.",
            "Man this sub became just a party of white right-wing men over 50 it seems. Just bullshit posts for a while. \n\nSaying this being a white man myself.",
            "Yeah, it’s all about pushing a message",
            "Well the model definitely couldn’t be a track runner",
            "One profession promotes consumerism while the other requires athletic prowess. Makes sense to me.",
            "She is the quote fattie so the TV station can show his inclusive they are",
            "I guess women picked the top model .",
            "I thought this crap happened in usa only",
            "Schmidt looks good in every photo, I did some, ahem, research",
            "There should be more plus-sized track runners. For the diversity!",
            "I mean yea sure ... But most people on the thousands  of these kinds of posts I have seen over the the years acting like they just jumped out of a Calvin Kline magazine... I don't look like Quasimodo but sure could do with some balanced attitude from society just to counterbalance all that fuckin propaganda I was exposed to as a child, and I wasn't even watching a lot of tv",
            " lol the girl on the left won the tv-show \"Germany's next topmodel\" by Heidi Klum last year. In the last few years, the tv show put an emphasis on diversity - that's probably why (for the first time) it wasn't a thin woman who won. she's a capable and pretty woman. most importantly: this is a tv show and it's all about entertaining the viewers. so calm down everyone. \n\nbtw this year's winners were a thin blonde gorgeous woman and an equally gorgeous slender man",
            "Plot twist: both are models",
            "unless runner has a penis whats off about the picture?",
            "Munch …",
            "I don't think either are pretty tbh 🤷",
            "I’m schmidten by her",
            "She just doesnt give a Schmidt",
            "But this duracell bunny at the right  is the most beautiful girl i have ever seen...",
            "The woman on the left won because she was modeling on the TV show. The woman on the right is a track star.",
            "I mean, I’m down for either one of these ladies",
            "![gif](giphy|4WM6HMwCFukTsp0jhw)",
            "I luv bigg gyrls and I  won't lie",
            "There’s nothing sexy about being unhealthy",
            "Holy Schmidt! She’s beautiful!",
            "Yeah but you need to have the attitude",
            "How ridiculous this PC bs has to get before people in the West  finally start react with action?",
            "“Random”",
            "Look at all these Jordan Petersons waaahing about skinny girl being not as attractive lmao",
            "nah I take the fat one over the Botox face thank you very much",
            "While these models are obviously chosen for ideologically motivated reasons, there were times in europe where the size of the woman on the left was a beauty ideal. So in that case having a woman her weight win a beauty contest would not only be normal but also expected.",
            "One eats the entire menu and one eats one item on the menu",
            "lol. I mean you could take 10 photos of random checkout chicks or baristas in Germany and 9 would be better looking.",
            "What's off? Explain yourself",
            "crazy how dudes in here are calling her fat and ugly as if they wouldn’t harass her in her street 🙄",
            "Everything is rigged now",
            "I know a woman that is a narcissist and thinks she is beautiful despite being completely fat.  \nAll the \"friends\" she visits won´t say the truth to her, and because of her narcissistic vision it wouldn´t even help.  \nHer \"Beauty\" is already shown it´s signs, starting by heartburn and having to go to the toilet multiple times (i´m talking about 25 times) a day, knows that there´s something not okay with her body, and yet won´t go to the doctor.  \nAnd shit like this here push that even more for other woman. It´s just sad to be honest!",
            "getting voted top model and actually earning a living being a model are very different things",
            "Wtf why is she orange? Evil orange man follower confirmed!? /S",
            "Literally don't understand what this is trying to say",
            "Not exactly off if top model according to certain size clothing.",
            "Something off? One’s a model & one’s a track star. What’s confusing about that?",
            "\"Random German professional athlete\"",
            "Germany in a nutshell. Pure idiocracy, pure propaganda.",
            "Maybe what's off is the racism in your post. Sorry not everyone thinks that skinny and blonde = beautiful.",
            "This sub is no longer funny or contains memes.",
            "To seize the means of cultural production is to attack anything considered normal.  That's why this is happening.  Normalcy is the enemy.  Once you start seeing it, you see it everywhere.  People don't realize they're following a Marxist protocol.  They're mostly useful idiots.\n\nPolarization pushes everyone to the extreme.  The neo-fascists on the cultural and political right are behaving like the worst caricatures of conservatives from 40 years ago, while the neo-Marxist/Maoists on the cultural and political left are literally tearing everything down in mindless idiotic violent rage.  Polarization only gets worse until things break.  As it worsens, the middle ground becomes the most dangerous place to be.",
            "A society that readily accepts lax effort is a pliable, plunderable society.",
            "Why not go ahead and call the sub r/9gag or something?",
            "People having an incel crisis over this are just hilarious",
            "What is Germany's Top Model supposed to be? No idea what ZM is either, click bait..",
            "Body shaming...noice.",
            "Nice vulva👌",
            "If you cannot fathom people having differing opinions to yours and resort to a shadowy, top-down, ideologically driven conspiracy to explain their behavior, you should take a long look at yourself.",
            "I'm sorry for being rude but to me both look ugly as hell",
            "It was a show were they went more diverse and of course ended up overdoing it",
            "Hey. I like me some big girls, I'm cool with it",
            "Bunch of actually ugly and overweight redditors talking shit about some random lady who’s not even that fat in this thread. ",
            "I don't get it. They both look fine to me",
            "in the West the world is now in reverse due to the woke ideology🥲🤣",
            "Is it a humiliation ritual?",
            "Top model, just gotta be the most attractive out of the other people who sign up. I’d take livvy dune over Gigi hadid. But Livy won’t sign up to model",
            "I love big butts and I cannot lie🤷‍♂️",
            "Yaaaaas! **QUUUUEEEEEENNNN**!",
            "![gif](giphy|l3V0g3aRpjHU7abeg|downsized)",
            "Models aren’t necessarily athletes by definition OP. \n\nOh wait, you’re just here to mock fat people. Must be difficult having so much free time by not getting laid. Making awful memes is a part of filling some of that time up?",
            "Everyone gets a trophy",
            "Chill guys maybe it's a plus size model competition and the left looks good",
            "I just wanna see the incel faces of the people calling the left one ugly. The right one is famous and also a model. \n\nThis sub is pure garbage. Why is it called funnymemes if everything you get is hateful shitposting?",
            "Nothing hotter than a flat, curveless runner with a mans ass.",
            "If you don’t work in the modeling industry and care who wins “top model” then you need a hobby or something to do with your life.",
            "And that's why Germany is doomed",
            "Am I the only one who thinks the left one is actually more pretty?",
            "As someone who is over 350 pounds and is 5’7 this is atrocious",
            "*OP chooses a professional cardio athlete for a comparison with a plus size model.*\nOP: OmG lOoK aT tHe DifFereNCe tO ThIs RaNdOm WoMaN!!111!!",
            "Where funny?",
            "Nyash is where the home is. You know the saying, more cushion for the pushing. I prefer my women thick, not stick",
            "I love European woman some of them are just outright beautiful but my girlfriend get upset when I told her that",
            "How is this funny? ust far right whining.",
            "The runner is generic looking, and way too thin. I don't understand why insanely thin=hot, why would you want to knock against bone? I feel like it's often someone with a so-so face or who is objectivy kind of ugly and people Lord them was hot because they're thin, it's kind of infuriating",
            "This sub has turned to absolute shit",
            "Fast food companies love the model on the left",
            "Top model? Maybe not. But you can't tell me that one is ugly and the other is smoking hot. Both are beautiful. What is going on?",
            "jezus are the comments fatphobic here. The model isn't even that fat, she's just curvier, nothing wrong with that.",
            "🐮",
            "So we idealize fat. \nSo we idealize unhealthy food. \nSo we idealize unhealthy living. \nSo we idealize hospitalizing. \nSo we idealize stressing nursing, care giving, so it can be more costly, more pills, more tax money. \nHmmm sounds insane, but ok, you to you.",
            "I think they are both smoking hot.....",
            "I expect Models model clothes.  Clothes for sale to the masses.\nMakes sense to choose a model closest to the average build of their target demographic.",
            "I don't need a runner, I need obese loads dropped on my chest, do you even have a shred of German in you? /s",
            "After ww2 I kinda give Germany a pass with this woke stuff, i'd imagine they would do everything imaginable to right the wrongs they allowed to take over at those times.",
            "That's definitely debatable but the other way around would be absurd",
            "Germany:  We want to move away from our traditional view of human perfection. \n\nEveryone: No Schmidt.",
            "What part dont you get?",
            "That's fine. U guys can have the model, I'll settle for the runner. Don't say I never did anything for u guys.",
            "I feel like they purposely chose attractive people at the olympics to pump up the view rates. A woman with naturally higher testosterone than the woman on the right would probably fare better with equal amount of training.",
            "Track girl needs a cheeseburger",
            "I mean these are two different competitions i would not win “competitive eater” by going to a marathon (i just don’t get if this is a “i wish she competed for that instead” or what but yeah if you don’t compete you don’t get a win)",
            "The left one didn’t won.",
            "I mean, I'm sure the athlete runs better, and the model models better. It's not all about physique.",
            "Fat and ugly ✅️\n\nPretty and healthy 🚫",
            "Someone post a random German male track star and some morbidly obese German reality guy. There, see how that works? A medically-diagnosed obese woman gets called beautiful, but if a man were the same weight proportionately, he would get no likes. Our standards are so screwed up.",
            "The woman on the left definitely has Stage 2 Hypertension. Lose that weight and the heart won't have to pump so hard.",
            "To argue about beauty standards is one of the dumbest things you can do. There are no arguments, just feelings and opinions that you can compare but can’t Diskuss. In opinion we should follow „live and let living“. I don’t care if you like older woman, people with a an BMI over the standart or sth else. As long I don’t get interrupted by it.",
            "I don't understand the problem. ",
            "That german woman is prettier in my eyes, but  that might be because i'm lesbian and i look for different things on women than men usually do\n\nTho yeah she should exercise a bit, but she has much prettier face, hair, eyes. The other girl is waaay too thin, what am i supposed to cuddle? her bones?",
            "She isnt ugly, its just unhealthy and bad for your body on the long run\n\nWe need to bring back praising health",
            "Didn’t anyone tell you it’s acceptable to be clinicaly obese if you’re a woman. Fassionable in fact! If you’re a man though… better keep yourself in shape, nobody wants that.",
            "How is zis funny? Ze fuhrer is not amused",
            "Woman on the right plays in competitive environment, where certain obvious traits matter.\n\nWoman on the left plays in environment where rules and criterias are changing every year, and there's nothign competitive there. It's a combination of political agenda and satisfying needs of the vocal minority.",
            "Fat is ok now, get with the times OP",
            ">something off about this\n\nn-not to me. i for one celebrate our new body positive overlords.",
            "And btw she isn't the winner\nEdit, my bad she did win 2023 I got 2 different results on google.",
            "I mean, the German track lady probably didn't enter herself to compete in said show, she was busy doing track stuff.",
            "Oh you mean it's a typical reality show.",
            "What's fucked, is if they keep pushing this \"fat is hot and beautiful message\", eventually it will catch on, and younger generations will see it as very sexually attractive. \n\n\nIt needs to be stopped, its disgusting and damaging. Smoking used to be seen as attractive as well, because tobacco companies pushed it.",
            "Hello all opinion based awards and contests",
            "It's never about talent it is only about the Drama.",
            "Fat. It's ok. I'm bringing it back",
            "Same bro, it needs to stop",
            "Lost 80kg. Best decision of my life. Went from 160 to 80kg and doing muscle grow now. Never would go back. Life has so much more quality now and the mental toll that’s coming with being overweight.. hell no.",
            "It's also funny that only women get to be \"plus size\" men get to be \"overweight\" and \"fat\".",
            "When you say over 300, I'm praying to God that you use the imperial system 🙏 \n\n\nIn case you do, 300 is not bad, so long as you can couple it with over 6 foot height 🤷‍♂️\n\nBut there you'll face a different issue of finding a spouse for that height. But, keep strong, it's possible 😎👍",
            "Maybe just stop calling it plus size, especially since it's only used for women, anyways. It's called fat.",
            "Plus size models are still needed, yk to model plus size clothing?? \nIt's not \"recommending\" to have a body shape. If you looked for why overweight people are overweight, none of them are because they saw a plus size model. \nEdit: especially in track running anorexia is common, too. Comparing an athlete with a model is just dumb",
            "\"Random athlete\" proceeds to show the sexiest athlete you can find. Its like writing random footballer and showing ronaldo at its peak hiting the corner with a bullet of a shot from halfway across the field",
            "Stuck at craft services as usual",
            "Plus sized man don't exist.\n\nWe're just fat💀",
            "Clarkson was voted the worlds sexiest man by the uk population",
            "Women have fought for years against unrealistic beauty standards, and it's starting to feel like as soon as they made headway on the issue, they slapped men with the same unrealistic standards.",
            "I mean i guess Rainer Calmund has technically done modeling.",
            "They are in - and of - the gay community.",
            "Getting some lunch obviously",
            "Yeah because before plus size women modeling appeared, men's modeling was flourishing...",
            "I dont want to be that guy, but fat women looks better then fat men.",
            "She does both, was a BOSS model.",
            "In fairness no, I get your point, but being a top model requires more than jsut good looks. Just because you look good doesn't mean you cna make it.",
            "It's the same in most countries across the world.",
            "Think about what demographic runs the fashion industry and you get your answer.",
            "When I was in Germany a few years, there was a waitress in a small town brewhaus that was possibly the most beautiful woman I have ever seen. Pretty, perfect skin, toned body.",
            "They're not necessarily looking for beautiful, they're looking for unique.",
            "A model is more than a pretty girl , although it helps to be pretty. \n\nA model is someone on whom the 'clothes look nice', it requires certain features and 99% of the models conform to this.\n\nIt's the super models that become super famous off the ramp.",
            "Models are never attractive",
            "She is? I don’t know her? And I live my whole life in Germany. But then I don’t follow athletics or modeling.",
            "She’s also not random because they literally found the hottest track athlete to use as comparison.\n\nHand selecting the hottest one isn’t random",
            "And in a mile race competition she also wins by a mile 🤣🤣🤗",
            "It's not pushing agenda. It's about modelling. Models sells clothes, clothes are made for all kinds of people, so models should represent all kinds of people.",
            "The girl on the left isn’t fat because of “diabetes.”\n\nNobody is *accidentally* overweight. That shit takes time and commitment.\n\nI 100% guarantee if she adopted a balanced 2,200 cal/day diet for a year, and at minimum went on a 3-5 mile walk each day, she would drop 40 lbs.",
            "Good genetics...\n\nI mean I know the far right in Germany is enjoying a resurgence...but surely they've not yet reached this milestone in Nazi bingo.",
            "Food and excuses.",
            "Ugly AND unhealthy",
            "shit if that were true I'd rolling in bitches . Then again that probably only applies wooman.",
            "I think she’s hot. Just gotta lose some weight.",
            "Attendance is not compulsory",
            "If you look into OPs profile you will see what you expect.",
            "Yeah, it's right wing because it's \"bad\" to point out that role models should be fit healthy achievers rather than overweight under achievers",
            "Nooooo, Germany eats this shit up too. It ties into their never ending guilt spiral over the war.",
            "I don't find getting narratives shoved down my throat is entertaining...\n\n\n\nFat is fat, thin is thin, middle weight is middle. \n\n\n\nWhy make it so complicated and force people to agree with them.\n\n\n\nOh, probably their argument is fundamentally flawed and forced to argue emotionally. Yikes. Don't spread this ideology to my country hopefully._.",
            "Last year a trans won? This woman never won.",
            "It does seem more hateful than funny in this sub. But wanting to see the faces of incels? There may be a sub for that. Not my kink.",
            "Seethe please. Seethe as you downvote.",
            "Thoroughly agree",
            "Yeah, gottem. I prefer a bulbous, out of breath glutton covered in permanent sheen of sweat and insecurity too.",
            "Ye, but what about *my* entertainment? You've scorned my entertainment.",
            "Yes.",
            "Ew, probably",
            "I love how people can not accept this opinion.  They write you off as \"ideologically motivated\" or \"brainwashed\" because they're so small-minded they cannot imagine people with differing opinions.",
            "It’s all subjective. Like what you like, who cares if others do? I’m long past making any real judgments on appearance because ugly people come in all kinds of pretty packaging so I just wait until I get to know them.",
            "The one on the right is not good looking, she's just skinny and blond, which is enough for some people. The one on the left is still overweight, but anyway they are both good enough to date.",
            "Your girlfriend can’t accept the facts",
            "That’s because you are starved from female touch",
            "downvotes for what",
            "Exactly they are trying to do everything they can to redeem themselves",
            "It would make more sense to choose someone more conventionally attractive for the former.",
            "Women arent allowed to wear pants in OP religion",
            "But the internet said so",
            "She is the winner of the 2023 season. Not of this year's season.",
            "Doch",
            "And btw she's very attractive",
            "correct they are all hot garbage",
            "most people are already fat anyway",
            "This has been happening for a few years now.",
            "Well, i have nothing against fat people. They have as much of a right to have their love life as anyone else. I'm just glad none is pushing any kind of message about homosexuality being the best thing in the world.",
            "Did you learn what you are sexually attracted to from the TV?",
            "tbf young people don't care about tv most of them mostly watch tiktok and youtube where the beauty standard is fucked because most of them are using filters.",
            "Because most women are overweight. There are more overweight/obese women than men. They’re trying to mentally condition men into being attracted to overweight women, get married and have kids with them in order for the economy to keep going. \n\nIf men are only attracted to conventionally beautiful women (young, thin, fit and HEALTHY women, since they’re so few and rare nowadays, the birth rate will go into a steep decline and soon enough, developed countries would face extinction. If men’s standards were as high as women’s standards, we would all go extinct. 🤷‍♂️",
            "Thank you Randall.",
            "I'm glad to hear you're not only a great example for others but also that it improved your life to such an extent. Happy for you man, keep up it up!",
            "Who gives a shit?",
            "Yeah, thats why you see male +size models everywhere.",
            "There's a difference between being anorexic and being athletically lean.",
            "Runners are anorexic!!! Lmao I don’t think you know the meaning of athletic either.",
            "“Lets encourage people to not lose weight by making a new market of products designed to help them live an easier life despite their self destructive and reversible lifestyle decisions”",
            "I think the point is that models were traditionally symbols of the peak attractiveness.   Idk if it should have been like that or not.\n\n\nNow days, models are actually there to show the product and seem as though within industry they are starting to be recognized for that skill.\n\n\nHowever, the old idea of what they should be- attractive- still exists so the old way and new way sort of clash.\n\n\nI’m not saying the far girl is ugly or anything, but I mean, most people don’t look for fat people when they are seeking attraction.  So anyone still operating under the original idea that models should be attractive and thin, (which is still most people…) will laugh at a fat girl being chosen over someone more traditionally attractive",
            "Oh that clothing looks nice I need to gain 50 more kilos to wear that",
            "They’re not needed and they never were",
            "It’s ridiculous how many downvotes this has. I think people forget models aren’t just meant to be hot. They’re meant to sell clothes. And since the amount of overweight people has increased (at least in the US), there’s a need for more plus sized models. It has nothing to do with glorifying obesity. It’s just capitalism.",
            "Fat people who want to buy clothes advertised for their size? That’s just blasphemous. How dare they want to exist. /s",
            "He means starcraft services.",
            "the only plus sized thing about me is  my big ass forehead that's getting bigger and balder... being called a fat shawty aint a compliment in this instance",
            "Yeah... Unrealistic beauty standards aka not being healthy weight.\n\nIt's extremely funny that they are still full of.mskeup with long styled hair etc... So they support every beauty standardst apart from one that takes continuous effort.",
            "Yeah. Somehow all the standarts went to men like 7ft tall 8 pack chads",
            "Men too with height and pp size, the weight at least is something you can change",
            "Fat people look mostly fat tho",
            "She's definitely not a random person.  She's quite famous in track and field.",
            "Then she needs to sort out her nutrition because carrying around that much adipose tissue is going to call problems.",
            "I dunno. She looks like she's full of schmidt.",
            "Not unique either. Just ad money, that’s all they crave for.",
            "And they decided to go for “fat”? No offense to fat people at all there. But does “unique” apply?",
            "And that's what she's famous for",
            "Models “shouldn’t” be anything. The clothes companies want to sell products. Clothes, jewelry, earphones, burgers basically everything looks better when it’s a more physically attractive person doing it. If companies decide to hire more representative looking model they can 100% do that, but they don’t, and definitely shouldn’t, have an obligation to do so. They are not your parents.",
            "Selling clothes isn’t an agenda? Ok buddy. \n\nResearch has proven that people are more likely to buy products, including clothes, when the models are more physically attractive.",
            "How do you mean",
            "That’s honest and true, not political correct so I give you an upvote 👍",
            "I dont get why people are so mad at overweight models.\n\nThe job of an model is to present things so that people buy it. Being good looking is a part of the job but definitely not everything.\n\nBusinesses want to sell things to overweight people too. Especially in america where like 50% of the population is overweight. And if you want to sell bigger clothing to people then you also need bigger people to present these cloths.",
            "Man you weren't kidding, that some major right wing, incel vibes.",
            "Jeez, a lot of words to tell you are a culture war victim. Not all pretty women are thin. Not all models are thin (anymore). If you like thin girls, go for it. That’s nobody’s business. But people always shouting being forced to do something are most likely the people who wanna dictate what a woman should be and how society should develop or not. In the end those people are probably just hateful disgusting keyboard warriors. Pathetic.",
            "You prefer your country's current ideology?",
            " if i remember correctly Vivien won last year. the trans woman Alex won 2021 i think?",
            "What is there to seethe about even? This post is factually incorrect ",
            "I don't think they're seething at all. Think about it, the vast majority of people on Reddit are American. About 50% of Americans are obese, so there is a very good chance that a lot of people here are being hypocritical, as they're probably obese/overweight as well.\n\n\nNot seething, just simple logic.",
            "Nice! Anyone got her number?",
            "Yeah, and I can just imagine your knee deep in it..... 😂",
            "Why? Personally, I like the model better. I don't mean in a \"big is beautiful\" kind of way. But she just looks friendlier. I'd be more inclined to buy clothes after seeing them on her than the athlete.",
            "You really think someone would do that… just go on the internet and tell lies?",
            "This sub isn’t for funnymemes it’s politically charged grifting.",
            "My bad.",
            "Which one? The one on the right or left?",
            "Thank you for your kind words! Will continue giving my best 🙏",
            "Got curious so I googled it. Guess there is fat male models. Except they're just called big and tall. I say thats way better than being called plus size tho.",
            "I used to run track. We were easily eating 3000 calories a day. Not anorexic at all.",
            "Not all runners. But eating disorders are common in running. Just look shit up",
            "Overweight people are supposed to literally not have clothes? Are hearing yourself💀",
            "I see that but it's still... how do I even explain?  \n\nAlso when models were literally (and often still are) severely underweight and got to this weight by extremely unhealthy eating habit, people were like \"oh but that's just because it's easier in the industry so they all fit the same clothes blah blah blah but so many women actually saw all the content & praise for these models and adapted to those habits & got unhealthy themselves.  \n\nBut again, look at overweight people, none of them got to or actually stay at this weight because now there are more plus size models. They have it hard enough in daily life anyways, trust me. It's just that they probably aren't as down anymore bcbnow they can at least wear acceptable clothes and feel somewhat accepted. Not accepting them could just lead to more emotional eating and becoming even more overweight.  \n\nAccepting overweight people and promoting fashionable clothes for overweight people is NOT glorifying obesity.",
            "Yeah nobody sais that ever bc most nice clothing comes in small sizes anyways. Is ut that horrible if overweight ppl have nice clothes too?",
            "She needs to eat a few pieces of cake",
            "I was talking about Alicia Schmidt \"the woman on the right could do either\" she does both modeling and track athlete. I don't know who the heck the woman on the left is.",
            "Does \"she\" have a name or is \"she\" not famous enough?",
            "But you only wrote she‘s very well known. And I argue that she isn’t unless you follow two pretty niche area of interest. I could also say Nastassja Lein is very well known but I guess most Germans wouldn’t know who she is.",
            "I seen a lot of advertising with normal people modelling, not just most hottest. And it works for those companies.",
            ">Research has proven that people are more likely to buy products, including clothes, when the models are more physically attractive.\n\nIt doesn't really matter, because logic would say, it sells best if you have all kinds of models. You can fit 5 models in one advertisement easily, you have several people going on the catwalk, etc. It's not this model or that model. It's both models.",
            "I mean who can tell what good genetics are just from pictures of people? The heavy girl might have better genetics for the 400 m, but has never trained, and is out of shape for any kind of competitive running. \n\nI'll tell you who did think they could tell how good your genetics were by looking at you, the Nazis. Not only that the blonde blue eyed girl on the right would have been right up their street.\n\nEdit: I should say the genetics of athletic performance is very poorly defined, so even a genetic test is not going to tell you anything meaningful.",
            "the fact you misspelled both \"to\" and \"too\" is r/mildlyinfruiating",
            "Victoria Secret bought into your logic.  It, uh, didn't work out.",
            "Nothing in my words is relating pretty women is thin or fat or what not. Stop twisting my words thanks.\n\n  \nPretty is pretty. Ugly is ugly. Thin is thin. Fat is fat.  They are adjectives to describe a certain observation. \n\n  \nIs this really hard to comprehend in western countries?\n\n  \nWhy do you people always portrait if I disagree this \"fat can be pretty\" ideology then I must be supporting \"thin is pretty\" concept.\n\n  \nLike you guys can only comprehend the these two sides and push your own narratives like the media. While in reality, beauty is very subjective and is really non related to weight at all. You see something that catches your eyes and like then it is pretty, is that simple.\n\n  \nAnd you are exactly pushing down my throat by saying \"Not all pretty women are thin. Not all models are thin (anymore).\". In the back of your mind, you are exactly wanting to push the ideology of linking \"fatness\" to \"pretty\", any disagreement or discussions are deemed bad in your subconsciousness. No matter that is your intention or not, the ideology has already taken root in you.\n\n  \nWe simply think she is not pretty, she does not catch our eyes, then suddenly we get twisted and we are attacking fat people. How in the world you can voice loudly while others' opinions cannot? We voice it then suddenly we are deemed as brain washed, wrong, bad.\n\n  \nIf what others like are their own businesses, then why every time some of us disagree the winner should not win then suddenly we are framed as \"the avocate of anti-fat\". So is that mean we do not have the right to say what we like? \n\n  \nDo you really think a country show's winners define the beauties in everyone's minds? It seems to me it is just a way to fit the narratives and earn viewership for the television. It's all about the money afterall. \n\n\n\nAll these \"beauty judges\", \"fashion judges\", maybe they professionals but they surely aren't a representation of the people. Hells they aren't even nominated by people.\n\n  \nMost of us have kept silent simply to avoid trouble and lengthy discussion, that does not necessarily mean people agreed with the situation, we chose to tolerate for the convenience does not mean we will back down and shut our own thoughts.",
            "Depends on which ideology you are refering to.\n\n\nWe have enough ideology to deal with already",
            "Just googled it, Vivien was never a winner",
            "Oh, coping now, too. Lovely.",
            "It's not hypocritical to call someone fat when you yourself are fat.",
            "That’s the issue… this is the top model, not the “friendly model” competition",
            "lol i thought about saying this and couldnt decide the execution.\n\nleft: relaxed, confident. right: really stressed, focused on eating homer simpsons brain[^(\\[1\\])](https://www.youtube.com/watch?v=SnJ9R1AHzsk)\n\nyou need mass or the air resist is too much. like an ant thrown from the eifel.",
            "Nah, I'm pretty sure I read once, that everything on zhe internet is true! That means that post must have been true as well, so it makes sense.",
            "Wait, you can do that??? 😳",
            "You're right. How insolent of us to assume people don't have integrity.",
            "Who would do such a thing like lying on the internet?\n\nOh, and not to big myself up, but you should appreciate that I’ve taken time to respond to you.\n\nI’m just currently on my yacht (in Monaco) relaxing, having a few cold ones and enjoying the lovely weather. I retired at 25yo after having won big on the lottery, so I am living the dream life. I actually spent most of my morning doing the sex 5 times with 10 different women - a lot of threesomes.\n\nProbably helps that I’m 6’4”, 250lbs of muscle and have more money than everyone in the comments section combined.",
            "But she was the winner",
            "I wouldn’t.",
            "I don't know why people keep thinking the internet lies. I've never even heard of someone actually reading something that's not true on it",
            "No worries. All is well.",
            "So why cant you find them in any of h&m's campaigns and have to literally google them to know they exist?",
            "Not all track runners are healthy though.",
            "'plus sized' should be represented in bold on each item of clothing.",
            "Ya the skin and bones thing was sort of the opposite end of the same spectrum.  And be certain, nobody likes the skin and bones models either lol.  They just aren’t as “in” right now so people don’t complain about it.",
            "As a fat kid I had no clue how to dress myself nicely because when you’re overweight or obese you have to hide like 50% of your body structure for it to be considered nice. For example long jeans covering belly for women or a cardigan to hide big thighs. I wore a loose hoodie or shirts so it partly hid my belly. Loose jeans were the only choice because skinny ones were not skinny on me. Whole looking nice thing is all about looking elegant and that is hard to achieve if you have to wear loose clothes. But I grew up in country that has this strict mentality and doesn’t put much effort into loving all body types equally.",
            "And btw the woman on the left newer won next top model",
            "So she isn't some random track athlete, but a specific one with model looks who also does modeling. I understand what the meme is trying to say, but memes that don't stretch the truth hit best imo",
            "Alica Schmidt",
            "Her name is literally written on her bib…. Alica Schmidt",
            "The Waitress?",
            "Your perception is only your reality but whatever makes you feel good friend.",
            "It's true that the girl on the left _could_ have great sport genetics... But it's very unlikely by definition as \"great\" is relative. However, it's significantly more likely the world famous track star athlete has better genetics.\n\nAlso, other than the nazis, plenty of historical groups (including Americans evenly more recently than the nazis) thought you could judge someone's value by looking at them...\n\nSeems unfair to mention nazis when the original statement is strongly probably true.",
            "Read it three times before my brain comprehended the first to's meaning as, too.",
            "So making fun of a non English speaking person. How superior of you 🙄",
            "That misuse of the word \"to\" is how we know that this person's opinion can be ignored. Better fat than dumb.",
            "Fair point.",
            "If just just google gntm 2023 winner you can even literally find videos of her winning? what are you talking about",
            "No, just facts and logic, which you do not have a comeback to.\n\nYou're kind of strange.",
            "I'd expect the top model to be the best at modeling clothes that people want to wear. Considering nearly half of all women in Germany are overweight or obese, along with 60 percent of men, it makes that sense that we'd start seeing heavier models.",
            "The internet paradox.",
            "So what are you suggesting?",
            "I don’t understand why you’re just assuming that she’s anorexic. That’s not cool in any way shape or form.",
            "Yea, exercising to the point where you physically outperform the vast majority of other humans and only a select few other humans who train specifically to compete with you physically are unhealthy.",
            "Yes they are. You literally cant do sports at a decent level if youre not healthy. Body would just break down.",
            "Of course there will always be an exception to everything. 🤷",
            "Lol. Love your work",
            "Yes she did. Or am I missing a joke here?",
            "Especially on this sub, it has become 9gag. As for the comparisson, the woman on the left doesn't look bad, she just isn't what you imagine when you say top model. And in all fairness comparing most women to Alicia is not fair IMO 😅",
            "Cheers! Didn't realise I was being so stupid. I'm still struggling to see where it says \"Alica,\" though, and I did think Schmidt was a relatively common last name as I know at least 3 English Schmidt's myself.",
            "To be fair, Schmidt is probably the least helpful sir name for narrowing it down to the actual athlete.",
            "Weird that only mine reality also exists in advertising and in magazines.",
            ">However, it's significantly more likely the world famous track star athlete has better genetics.\n\nThis is simply not knowable. \n\n>Seems unfair to mention nazis when the original statement is strongly probably true.\n\nNot when it's two German women and the blond haired blue eyed one is being said to have \"good genetics\"...",
            "Glorifying this walking thrush machine is strange.",
            "First off yes you are correct. Second we really need some food laws.",
            "Those numbers have to be made up. Not even America has numbers that high.",
            "The top models should be hot and attractive modelling idealized clothing that people fantasize about wearing. And you can stop using PC words. Fat is a word too and even fat people don't get attracted to fat models.",
            "I see your standpoint, but imo “TOP” model should be someone who takes ur breath away, not a mid overweight woman. + imo encouraging a country with an existing weight problem that weight problems should be encouraged is problematic (overweight/ underweight both count)",
            "Everything you read online is true! Tsun zu said that. And I’d say he knows a *little more* than YOU do maggots! Because he invented it! And he perfected it, so no man could challenge him in the ring of honor!",
            "Because he wants to fight body shaming with more body shaming.",
            "Not her specifically, but they are comparing models to athletes in a sport where EDs are not too uncommon. I never said she specifically is anorexic.",
            "I’d say it’s more common for boxers, MMA fighters and wrestlers to have eating disorders than a track runner. Basically any sport that you have to make weight in is ripe for it. Those folks go through extreme measures to make weight.",
            "Wow you clearly have no idea about how common EDs in sports are...",
            "Fair enough, it is indeed a super common name. But she was the first result when googling “German runner Schmidt” :)",
            "Bye",
            "Only that isn't what I'm doing. Read my first reply to you again. I'm saying that given the main demographic of reddit users, a lot of people on here are probably overweight as well, which makes them hypocritical. Being overweight isn't a good thing.\n\nI hope that is clear enough for you.",
            "Well… looking at the two, at least it is obvious that the left one for sure has an eating disorder.",
            "Touché"
        ]
    }
}