{
    "Forging A Return to Productive Conversation: An Open Letter to Reddit": {
        "title": "Forging A Return to Productive Conversation: An Open Letter to Reddit",
        "score": 1191,
        "url": "https://www.reddit.com/r/funny/comments/14jmh7e/forging_a_return_to_productive_conversation_an/",
        "content": "To All Whom It May Concern:\n\nFor fifteen years, /r/Funny has been one of Reddit’s most-popular communities. That time hasn’t been without its difficulties, but for the most part, we’ve all gotten along (with each other and with administrators). Members of our team fondly remember Moderator Roadshows, visits to Reddit’s headquarters, Reddit Secret Santa, April Fools’ Day events, regional meetups, and many more uplifting moments. We’ve watched this platform grow by leaps and bounds, and although we haven’t been completely happy about every change that we’ve witnessed, we’ve always done our best to work with Reddit at finding ways to adapt, compromise, and move forward. \n\nThis process has occasionally been preceded by some exceptionally public debate, however.\n\nOn June 12th, 2023, /r/Funny joined thousands of other subreddits in protesting the planned changes to Reddit’s API; changes which – despite being immediately evident to only a minority of Redditors – threatened to worsen the site for everyone. By June 16th, 2023, that demonstration had evolved to represent a wider (and growing) array of concerns, many of which arose in response to [Reddit’s statements to journalists](https://www.washingtonpost.com/technology/2023/06/16/reddit-ceo-blackout-moderators-steve-huffman/). Today (June 26th, 2023), we are hopeful that users and administrators alike can make a return to the productive dialogue that has served us in the past. \n\nWe acknowledge that Reddit has placed itself in a situation that makes adjusting its current API roadmap impossible. \n\nHowever, we have the following requests:\n\n- Commit to exploring ways by which third-party applications can make an affordable return.\n- Commit to providing moderation tools and [accessibility options](https://www.reddit.com/r/Blind/comments/14ds81l/rblinds_meetings_with_reddit_and_the_current/) (on Old Reddit, New Reddit, and mobile platforms) which match or exceed the functionality and utility of third-party applications.\n- Commit to prioritizing a significant reduction in spam, misinformation, bigotry, and illegal content on Reddit.\n- Guarantee that any future developments which may impact moderators, contributors, or stakeholders will be announced no less than one fiscal quarter before they are scheduled to go into effect.\n- Work together with longstanding moderators to establish a reasonable roadmap and deadline for accomplishing all of the above.\n- Affirm that efforts meant to keep Reddit accountable to its commitments and deadlines will hereafter not be met with insults, threats, removals, or hostility.\n- Publicly affirm all of the above by way of updating Reddit’s User Agreement and Reddit’s Moderator Code of Conduct to include reasonable expectations and requirements for administrators’ behavior. \n- Implement and fill a senior-level role (with decision-making and policy-shaping power) of \"Moderator Advocate\" at Reddit, with a required qualification for the position being robust experience as a volunteer Reddit moderator.\n\nReddit is unique amongst social-media sites in that its lifeblood – its multitude of moderators and contributors – consists entirely of volunteers. We populate and curate the platform’s many communities, thereby providing a welcoming and engaging environment for all of its visitors. We receive little in the way of thanks for these efforts, but we frequently endure abuse, threats, attacks, and exposure to truly reprehensible media. Historically, we have trusted that Reddit’s administrators have the best interests of the platform and its users (be they moderators, contributors, participants, or lurkers) at heart; that while Reddit may be a for-profit company, it nonetheless recognizes and appreciates the value that Redditors provide. \n\nThat trust has been all but entirely eroded… but we hope that together, we can begin to rebuild it.\n\nIn simplest terms, Reddit, we implore you: **Remember the human**. \n\nWe look forward to your response by Thursday, June 29th, 2023.\n\nThere’s also just [one other thing](https://i.imgur.com/xLmTxcR.jpg).",
        "num_comments": 1,
        "comments": []
    },
    "] REMINDER] ANY political content will earn an immediate 30-day ban\"": {
        "title": "] REMINDER] ANY political content will earn an immediate 30-day ban\"",
        "score": 699,
        "url": "https://www.reddit.com/r/funny/comments/160kuuf/reminder_any_political_content_will_earn_an/",
        "content": "",
        "num_comments": 1,
        "comments": [
            "---      \n>✨⭐ **Don't miss [our 50-million-subscriber-mark celebration](https://www.reddit.com/r/funny/comments/14eg7k5/to_celebrate_reaching_50000000_subscribers_rfunny/)!** ⭐✨\n>\n>This is a friendly reminder to [read our rules](https://www.reddit.com/r/funny/wiki/rules). \n>\n>Memes, social media, hate-speech, and pornography are not allowed. \n>\n>Screenshots of Reddit are expressly forbidden, as are TikTok videos.\n>\n>**Rule-breaking posts may result in bans.**\n>\n>Please also [be wary of spam](https://www.reddit.com/r/funny/wiki/spam).\n>\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/funny) if you have any questions or concerns.*"
        ]
    },
    "The service is good but the waiter seems in a bit of a hurry": {
        "title": "The service is good but the waiter seems in a bit of a hurry",
        "score": 2023,
        "url": "https://v.redd.it/9oyq8fya438d1",
        "content": "",
        "num_comments": 84,
        "comments": [
            "---      \n\n>This is a friendly reminder to [read our rules](https://www.reddit.com/r/funny/wiki/rules). \n>\n>Memes, social media, hate-speech, and pornography are not allowed. \n>\n>Screenshots of Reddit are expressly forbidden, as are TikTok videos.\n>\n>**Rule-breaking posts may result in bans.**\n>\n>Please also [be wary of spam](https://www.reddit.com/r/funny/wiki/spam).\n>\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/funny) if you have any questions or concerns.*",
            "This is how u get that 15years experience when u are 20 years old.",
            "Who would've thought that child labor could be so cute.",
            "I've been to Costco exactly once in my life.  I grabbed a bag of bagels and went to the checkout.  The cashier announced, \"sir, these are buy one get one free\".  Immediately the guy bagging groceries ran off to the other side of the store and ran back with another bag of bagels.  Sadly it was so many bagels they all got moldy three days later before I could eat all of them.",
            "His name must be Gonzales.....",
            "Nice spinoff on bob’s burgers lol",
            "child labor is so cute",
            "Best waiter",
            "O Letting your child help with the restaurant you own - Good idea\n\nX Letting your child help fly your plane - Bad idea",
            "The little hop !",
            "He needs a raise lol",
            "\"De plane! De plane!\"",
            "Cute as heck",
            "This must be what job qualifications mean when they say they want someone who is young but with a minimum of 15 year experience",
            "Just another day in America with its new revised child labor laws",
            "Slow down man youre making us look bad",
            "The restaurant seems a bit short staffed",
            "No tips???",
            "\"Oh look, a child slave labourer! How cuuuuuuute!\"",
            "Disappointed to not see the southpark child labour force GIF",
            "Anything worth doing, is worth doing AS FAST AS YOU CAN!",
            "Express service.",
            "when you need to be 23 with 23 years of experience",
            "I mean, that’s pretty fucked up.",
            "How spicy would you like your chang sauce, actually f off I'm too busy",
            "Those bagels running a marathon! This is how u stock the pantry by 20",
            "Ah thats Timmy. His dad says that in his work, hundreds of people a day depend on him and HIS NINE, truly what a role model for out resident FAILURES also known as kids",
            "If child labor is involved then you knew your food will be great",
            "I want to see more of this",
            "I didn't know Hassabullah had a part time job",
            "I got served a beer by a little kid in China. I'm like, \"Um.. is this legal?\"",
            "That open stairwell though, yikes :(",
            "Thanks to new legislation.....child labor laws.\nThat's too young to be working.\nThe good news is he makes $18 hr minimum.",
            "[removed]",
            "He'll be the manager when he reaches 15",
            "ok but no tips?",
            "True Pokémon master status",
            "But does he even have his masters degree to be qualified to be a waiter?",
            "It's because of his sheer determination to fulfill his duty",
            "kids yearn for the mines 😔",
            "Got to put them in the freezer, playboy",
            "This made me cackle picturing dude dodging fools full tilt with his bag of bagels.",
            "Plot twist, the bagger has a crush of bread girl and promised her he’d get that moldy bread sold and this was his chance to pawn it off.",
            "Moldy costco baked goods is such a sadly common experience for me.\n\nI am but one man.",
            "How do you go to Costco just once? Like you bought a membership and used it just the one time for only bagels?\n\nThats some expensive bagels.",
            "Costco doesn’t bag groceries…",
            "The girl at the end almost said it and stopped herself...\n\n\"He's like speedy gonzal---hahaha.\"  \n\n*whew, close one, that would have sounded bad*",
            "Tito's Tacos",
            "Oh please, what could go wrong? It's not like they'll inadvertently disengage the autopilot, roll the aircraft into a steep bank and dive straight into a mountain or anything. Stop overreacting!",
            "I was curious about this after watching a lot of Bob’s Burgers. It’s allowed in a family business as long as they don’t perform dangerous tasks (among some other rules). \n\nAnd of course, kids have been working in family businesses for all of history.",
            "Damn right. We work for our suppa 'round 'ere boy.",
            "Psshaw I made it by 10\n\nalso with no pay",
            "That comment was the tip, really",
            "Well, he doesn't want the boss to give him a spanking after all that. 😟",
            "Freezing bread changed my existence as a bread eater forever",
            "Slice them first, then you can take just one at a time- straight from the freezer to toaster oven.",
            "This is the way",
            "I worked in the Costco meat dept and we loved the bakery girls most were older Spanish ladies that would cat call us and we loved that shit. They always brought us fresh right out of the oven stuff and extras they couldn’t sell and we would reserve whatever cuts of meat they wanted….and maybe accidentally label it at a tremendously discounted price :) those darned complicated wrapping and label machines always acting up",
            "“You know what would really impress me, Derrick… if you sold that moldy bread to someone.”\n\n“…yeah, I think I’m good, Carrol. See ya.”",
            "Maybe they tagged along with a friend with a membership once?",
            "Not if his name was Gonzales.",
            "Omg!",
            "For all of human history slavery has existed.  Doesn't make it right or legal.",
            "Weird flex, but ok ",
            "Amen",
            "username checks out",
            "We have bakery outlets that sells breads the factories don't shjp out. It's like 1.25 a loaf. I buy like 6 of them at a time and freeze 5.",
            "I cannot get my head around the fact the bread wouldn't get wet(?)\n\nWhen you defrost it, isn't it mushy?",
            "In the Netherlands the bread is already sliced( if you buy it at the supermarket, at the bakery it is uncut and they will cut it for you with a machine). So you buy a loaf and just 'break' the slices you need and put the rest in the freezer.\n\nThat way you don't have to unfreeze or pre-cut your loaf.\n\nIt works great.",
            "Still does. It's legal and we're trained to believe it is right.",
            "not by choice obvs, hence the 'slave' part of 'child slave labour'",
            "Hello Baker here\n\nAs long as you don't have shit bread like in America, then it is absolutely perfect to freeze your bread as long as you let the bread thaw naturally",
            "You gotta toast them after defrosting.  It even works with salt bagels which always get wet and mushy first (if you don't freeze them).",
            "It's a joke bro I'm joining your sarcasm",
            "Something about unfreezing with no water hurts my brain but I will trust your expertise.",
            "You're not a baker lol. Not that a Dutch man would know anything about good bread."
        ]
    },
    "Be Honest!": {
        "title": "Be Honest!",
        "score": 13983,
        "url": "https://v.redd.it/sb7afts1hz7d1",
        "content": "",
        "num_comments": 792,
        "comments": [
            "---      \n\n>This is a friendly reminder to [read our rules](https://www.reddit.com/r/funny/wiki/rules). \n>\n>Memes, social media, hate-speech, and pornography are not allowed. \n>\n>Screenshots of Reddit are expressly forbidden, as are TikTok videos.\n>\n>**Rule-breaking posts may result in bans.**\n>\n>Please also [be wary of spam](https://www.reddit.com/r/funny/wiki/spam).\n>\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/funny) if you have any questions or concerns.*",
            "When I was a kid I had a friend who would fart in his hand and throw it at people. It worked surprisingly well.\n\nEdit: this comment really blew up. I didn’t realize the flatulence grenade had so many names. Some of my favorites: \n\nScoop and serve,\nThe Dutch hand grenade,\nCup o’ cheese,\nThe boofa,\nScooby snacks,\nNinja dust,\nAir biscuit,\nThe ancient rasengan,\nPalm bomb",
            "This video looks to be in reverse",
            "Only every time I drive my Prius",
            "It's an emergency energy source, sort of like drinking your own urine if you are in the desert.",
            "[removed]",
            "Nope, sadly I can smell my own fart even in a hurricane. Might have digestive problems tho.",
            "My sister fell asleep on the couch in the middle of the day when she was 16 and I was 12. On the way to the bathroom, I saw her sleeping and farted in her face and she didn’t wake up, but me and my other sister thought it was hilarious. Later that day she woke up and told us that she had the craziest dream that she was in this field and then all of a sudden these mud puddles started to appear and smell so so bad. We died laughing and told her. She wasn’t even mad.",
            "Of course everybody loves their own brand",
            "“So what do you do for work?”\n\n“I work in accounting. How about you?”\n\n“I hold up an umbrella for Taylor Swift.”",
            "No but I know a reversed playback video when I see one.",
            "The video is in reverse, I feel like an idiot for not noticing right away. Rofl",
            "I wish this wasn't reversed",
            "Taylor Swift gives the best Dutch ovens",
            "the footage is played in rewind, but good effort",
            "yes",
            "Seems like this is in reverse",
            "This sub is fucking garbage.",
            "[what's cup a fart?](https://youtu.be/8u7Qkjx4_uE?si=qC5qeyV0jtJWe9al)",
            "This is in reverse, ya?",
            "I'm coining the term Snifties right now.",
            "Not sure what the big deal is, I'd smell her farts",
            "Ah the old reverse footage to make someone look bad.",
            "Brother’s friend would fart in an empty pringles can and sneak up on his friends for the release.",
            "My great uncle and his son used to mail farts in jars to each other",
            "I usually catch other people's farts with my cupped hand and smell it.",
            "That's disgusting.\n\n\n\n\nYes",
            "I think this was played backwards",
            "I can't stand these clips after seeing her wipe snot everywhere. Uuuuugh, that might be what she was doing here.",
            "Now I can’t unsee that.",
            "Never. However, I often rub my anus and smell it as a way to examine GI health.",
            "What actually happened is she picked her nose and wiped it on her butt.",
            "We used to sit on nerf footballs,  fart as you sit up and throw it to a friend. Also works surprisingly well as a fart grenade",
            "If anyone could ever be medically prescribed a BBL, we're looking at the top candidate.",
            "Taylor Snift",
            "Taylor Snift",
            "She buttercupped herself",
            "Though to be fair, \"farting into your own hands and smelling it\" is pretty much a metaphor for how Swift writes her own songs... \n\n*\"Oh GOD I'm SO GOOD at this!\"*\n\nDon't tell me you can't imagine that *right now.*",
            "Christ she's hot, and was 11/10 in that dress",
            "GIF is backwards. Low effort. Kind of breaks the illusion when you have to alter the source to fit your little joke. F-",
            "/save",
            "If I was that smug, I would sniff my farts on purpose, too!",
            "No, but I've cupped a fart and blown it into a coworkers face.",
            "My best friend as a kid sealed a fart in a bottle of potpourri before handing it to me.\n\n\"Hey, [VerdantSF]! I think this stuff is spoiled!\"",
            "This is clearly the ole \"Something smells of ass... Is that something me?\" move.",
            "Of course",
            "Have I ever breathed air?",
            "/r/reversebot",
            "What song is that?",
            "Too valuable to waste",
            "What?",
            "Do people seriously do this? What?",
            "It's like sulpher salt but more convenient",
            "More normal just itch ass and rub nose",
            "..... so hear me out....",
            "Oh God I was an evil kid, I used to fart in my hand and blow it at people I didn't like like a kiss.",
            "I once cut a silent fart in an elevator and said out loud, “I smell popcorn!”",
            "No, but thank you very much for challenging my set ways. Always good to learn about new opportunities.",
            "Yes",
            "Ahhh - The good ol’ cupcake!",
            "Looks like Taylor's whiffed.",
            "The ol “cup of soup?”",
            "an inter dimensional entity that controls her is just simply eating all the low butthole centered energy she's gathered.",
            "Not in reverse I didn't",
            "Smelled like the devil's cum.",
            "Pink eye",
            "nasty!",
            "This video is playing in reverse",
            "Of course",
            "Daily.  Also share with the wife, but she doesn't always know",
            "My ex would fart in a pringles can and trap it to use on me when I walked back in the room.",
            "This is the second post today I’ve seen where she wipes her snot on herself. Internet is weird sometimes and that’s super nasty",
            "Sure",
            "Like her, I farted then scooped some up for inspection prior to releasing it to the masses.",
            "I love me some 90s style legbum. Got that Denise Austin dumper",
            "No!?",
            "Never!",
            "Me and my son were just talking about this. I did it, now he does it. It’s funny I never told him I did it. \nI’m so proud of him!",
            "The best it to cup your asshole in the shower and fart. If you do it just right so it’s half submerged the hilarious noise is worth the consequences.",
            "Have any of you know about the self made Fart Hand Bomb\n\nthey work pretty good \n\nAnd don't fcking lick your lips when you become a victim of it",
            "Everyday.",
            "My little brother was so enthralled with the television as a youngster that nothing could distract him. That is except for beef stew... a fart straight to the face was the only thing that could take him away from Darkwing Duck.",
            "Have I or Do I? Cause that’s two totally different questions…….that have the same answer.",
            "My best friend 30 yrs ago used to call them poop dogs, for whatever reason, and could seriously hit you with one from 10ft !",
            "Ever since someone said that she always looked like she was farting into her microphone I haven't been able to unsee it :(",
            "nope I just smell the room",
            "I was joking around after a party once that i liked the smell of my own farts, but i didn't like the smell of other people's farts. Then this random passed out guy wakes up and says \"Did you just say you enjoy your own brand?\" (Not what I said, but I thought it was a great line). It stuck with me, and now that's what I say if people complain when I let one rip.",
            "That's called the cup of soup",
            "Nah, that's the cup 'o soup you give others",
            "I used to fart in my hand then clamp it on a friends mouth and nose.. lol..",
            "Testing for scatter matter",
            "Only on days that end in with the letter y.",
            "No, I am already disgusted enough",
            "You gotta check for health.",
            "What's the song?",
            "Air out that long back.",
            "I'm doing Kamehamehas with those",
            "Everyone knows the best way to smell your own farts is to squat down and stick your head between your legs, like a stinky gargoyle.",
            "No I make someone else smell it",
            "She's literally perfect!",
            "That’s disgusting, of course I have.",
            "I mean if you can get away with it?",
            "Me",
            "Yes. I fart into my cup hand and let my son smell it.",
            "Nose almost in his food",
            "Cup O Soup anyone?",
            "The trick is to fart in your hand and lick before u rub your eyes",
            "Well, this bitch did it,so it must've been popular. 🤔🤦‍♂️🥴",
            "I did this to my dad and got spanked",
            "Yeah just not on stage",
            "No. That is weird and awkward. I bend down and sniff between my legs like a normal person!",
            "How stupid do you think people are?\n\nHint;  not as stupid as you are.",
            "That’s called a cup of cheese!",
            "\niiiiii that's even more disgusting than eating boogers.",
            "No, but i’ll smell hers………..",
            "She just wiped as her ass sweat and licked it !",
            "That's a No from me.",
            "This phenomenon os called a \"fish cake\"",
            "Ummm, no. No, I have not.",
            "Stink cups, a popular game in Australia",
            "The buttercup",
            "Is there another way to do it?",
            "THATS A MAN!!",
            "Nope, but i dont need to cause my farts are deadly without the cup",
            "Taylor Sniffed!",
            "Her farts are worth more than my house!",
            "That's a rooky move... I for one collect a couple of them under my bedsheet and blast them in my face all at once",
            "Always called that a cup-o'-fart",
            "Only high class people fart in a jar",
            "Did she just wipe her nose???",
            "Yep..her shit stinks too",
            "https://youtu.be/IUJtvN7ToC8?si=mL6O2OU0IQPxCc7g",
            "Not yet, but when I fart I put my face in the AOE and smell how bad it is",
            "She’s checking she hasn’t followed thru I’d say",
            "Cup a spell. Although I'm more partial to sneaky squeaker because of how Randy teaches it",
            "The old \"Cup of Fart\"",
            "Ooppss?? Did I shit myself?",
            "Swift would be someone who'd enjoy the smell of her own farts.",
            "Jogi Löw is jealous",
            "Yes, I do it every day",
            "Blaaaaagghhhhh",
            "That is some stick of truth shit",
            "Was in university when I learned that you could fart into a ziploc bag or jar and open it up later to an unsuspecting victim. College was never the same after that...",
            "There's a kids toy called something like \"air cannon\" or \"air bazooka\". Its like a open ended bucket with a bag at the end, the bag being attached to a big rubber band so it can shoot big puffs of air. The first review on it ask something along the lines of \"can it shoot farts\". The top voted reply is of a US Army soldier confirming he used it to shoot a fart across the tent to his CO, and it worked. I came across one within a year at a liquidation shop for a dollar. So I can confirm it works as I shot a fart down a hallway into our room at my SO and she was pissed.",
            "The old Dutch hand grenade.",
            "We called that a boofa.\n\nI have no idea why, but we would yell it when we chucked our farts at people.\n\nOccasionally, you could get a good cup seal around someone's nose.  That was the sneaky boofa and had to whisper it.",
            "The ‘cup cake’",
            "My son does this… he learnt it from his uncle… my brother… sigh…",
            "I’m gonna do this to my sister thanks for the idea",
            "The ole cup of cheese",
            "Hapooken",
            "I wonder if he has seen the movie Orgasmo. It was the villain's signature move.",
            "It's called a buttercup",
            "My whole family used to do this, Mom, step dad, Brother and eventually when my sister grew up we taught her.  Stopped doing it once I got to highschool lol.",
            "I had a friend who would do that also",
            "My friend had a sleep over and when we were all in our sleeping bags on the floor they farted into a jar and rolled it across the room to where my other buddy was laying. Also worked vet well",
            "That's the ancient rasengan",
            "Scooby snack",
            "I used to do that to my sister. When I would throw it in her face I would say \"magic\". 🤣🤣🤣",
            "I’m 36, I can assure you it still works pretty well",
            "We called them Scooby Snacks in my family.",
            "NINJA DUST!✨💨",
            "I was that kind of friend. I would also say in a bad British accent “a cup of fart for me and a cup of fart for you my good man”. \nI was…not everyone’s cup of tea.",
            "Cupping a fart is what we called it",
            "[A-Cup!!!](https://www.youtube.com/watch?v=E2xPiha_znY&start=42)",
            "All fun n games till you catch some taco bell juice",
            "That’s called “a bowl of soup” and my friends were absolutely serving it up. Dickheads.",
            "I do that to my significant other on occasion. She gets so mad. But to answer the question. Who doesn't love the smell of their own brand",
            "The old fart fastballs. I've been hit by a few unfortunately.",
            "Ah yes, the original Rasengan.",
            "Same. He called it a scooby snack and could hit you across the classroom.",
            "I did this to a huge dude in rehab, no idea what I was thinking. I ripped one into a Tupperware or something and threw it at him. Dude almost threw up and everyone else barely kept him from kicking my ass. Highly effective",
            "I used to fart in my hand, close it into a fist, then open my hand under my friends nose and flutter my fingers.\n\nI made him throw up one night while drunk.\n\nProudest moment!",
            "\"Would you like a cup of cheese?\"",
            "Wow. Now that is a superpower ",
            "Ninja potion!",
            "I do this to my wife all the time",
            "Was his name Patrick?",
            "[Hand Fart Kill](https://youtu.be/aICIH90vk4M?si=YllOHsY2-GnJ8lT8)",
            "Another good one is to ask if they smell popcorn right after you fart.",
            "Cup of soup",
            "90s things.",
            "I feel like it's one of those horrible traditions that has existed for centuries among kids.",
            "You knew him too?!",
            "Same",
            "Hand fart kill",
            "Looks like the dude on the left is about to go ham, WWE style bc of he way it cuts lmao",
            "Extend arm, open hand near victim and ask \"Air Biscuit?\"",
            "Bro I had a friend that did it too! Dude had the most god awful farts too\n\nEdit: Shit, my bad dude. I didn’t realize we all had the same friends 😂😂",
            "Can confirm. Had a baby cousin who would say,  \"I'm going to fire my butt at you.\" Yep. The little shit sure did.",
            "My cousin did that.",
            "Yeah, \"friend\".",
            "Ninja steath attack, always silêncio, always mortal.",
            "I knew a guy that would do this as well.  It was always funny.",
            "Me and my friends would fart into our hands and then cup said hand over someone's mouth and nose and yell \"MUFFIN\". We were truly animals lol",
            "You have to wait until their mouth is open",
            "Dude same. Buddy of mine could literally curve his throws to skip a few people before hitting me. Blows my mind how that was even possible. Used to call him a Gas Bender",
            "Cup of cheese. ",
            "Aren't those called scooby snacks?",
            "We had dozens of different buttercup maneuvers, but the most effective was rear naked smoke",
            "We called it a cupcake. You fart in your cupped hand and \"Swiftly\" move it over your buddy's mouth and nose lmao",
            "The chosen one",
            "We used to call this a “cupcake” at school. You cup a fart in your hand and move it slowly to someone’s mouth and nose. If you had a few brewing because you needed to go bathroom but couldnt leave class, that was known as “baking cupcakes” cause you had a steady supply of freshly baked goods.",
            "Palm bomb",
            " When I was little I farted into a mason jar and asked my big sister to open it and see what it smelled like. She just about puked.",
            "Fus ro dah!",
            "They called that the good old “scoop and share”",
            "Taylor Sniffed",
            "Hand fart kill 😂 \n\n[https://youtu.be/aICIH90vk4M?si=-tMtA-9YZ-UCdxqq](https://youtu.be/aICIH90vk4M?si=-tMtA-9YZ-UCdxqq)",
            "It's called the \"Buttercup\"! And yes. I do it to my dog to this day.",
            "LMAO.. didn't ever think I'd live to read this kind of stuff!",
            "Cupping a fart! We went for the kill by opening our hand directly over people’s noses. ",
            "I do this to my son. Saw it in Batman Forever, the Riddler did it.",
            "Jamie Tartt?",
            "Cuppa soup, anyone?",
            "My friends little brother did this as well. He would also yell \"FART GRENADE!\" while doing it.",
            "That's called the scoop and serve",
            "It’s called “passing gas”",
            "Are you me?",
            "Suuuure, your “friend”.",
            "On the west coast it was called a fruit cup",
            "I did that! Sometimes, am still tempted with my co-workers",
            "If you fart, tornado your hand at your rear and swish it at speed at your target. My girlfriend is astounded at how effective of a move it is. I learnt it from people who do tricks with vape smoke.",
            "When I was in year 8 or 9, farting in one’s hand and bringing it up to someone else’s face was known as a cupcake.\n\nExample of usage:\n\n*Griffo just cupcaked Timmy, who’s now cry-retching in the dunnies trying to wash it off*",
            "Dude your edit got me laughing out loud in an airport terminal and people are wondering wtf...",
            "I recently taught this move to my teenager.",
            "Ah yes, the \"Cup O' Fart,\" also known as the \"Stand and Deliver\"...",
            "I learned this trick in boot camp \n\nI also learned another term for crop dusting",
            "We called it the cobra",
            "Idk why tf we called it a Reece’s cup",
            "Came here to say we called it the cup of cheese, but I see you mentioned that. I love the flatulence grenade though, haven’t heard that one.",
            "Fart Dart, all day.\n\nWhen older it was an ass blaster, pronounced \"aaaass blesta\"",
            "Here in ATL it's called The Flying Biscuit",
            "Weapons of ass destruction",
            "Boofo throwed",
            "I grew up knowing it as “the dutch muffin”",
            "Is this you south park video game?",
            "My sister did that too, she would also fart into jar and throw it at me later",
            "A friend of mine had an [\"air vortex cannon\"](https://www.exploratoriumstore.com/cdn/shop/products/7fa608534ef4f3a825a25d98591e9098_800x.jpg?v=1625842598) that shot air in the shape of a small donut  surprisingly well. We were hanging out in his living room watching TV with his sister, when he gets the idea to fart into it and shoot it at her. So he pulls it back, farts into it then takes aim and fires. It's a direct hit, her hair flutters up as the air crashes into her face, which immediate sours as she begins dry heaving and running for the door. It was a pretty impressive variation on the Cup O' Cheese.",
            "While playing poker, the guy across from me 'submarined' one under the table at me.",
            "The ol bowl of soup",
            "That’s called a cup-o-fart",
            "I still do that",
            "Just to add to the terminology, we always called it a Tea Cup",
            "Fireball",
            "You killed me dude",
            "The best is trying to hit someone across a crowded room.",
            "Speed balls",
            "”The boofa“ in Portuguese Bufa actually means fart!",
            "Cup of soup for us",
            "That was my man Andrew. \n\nNINJA DUST",
            "Or ring pvc water guns simple tube o ring takes a dring and a hand saw to make. You fart put gun near hole suck it up. Put finger over barrel and find a victim. Once friends brother got him while he was sleeping did made a seal on his nostril and blew it right into his nostril.",
            "It's possible to catch a Pink Nose doing that",
            "We used to call this a buttercup back in the day",
            "Lol it is called \"The Wizard\"",
            "Fart punch.",
            "You mean the wizard?",
            "Capture in french",
            "YO, my friend, Scott, did the same thing. Called it the cheese cup.",
            "When I was a lad just starting out on the corporate world I had a great mentor.  The greatest knowledge he imparted to me was (sorry the name has been lost in the mists of time) if you needed to fart you went to someone else's chair and pushed really hard into the foam seat cushion, release, and then rise very slowly.  The foam would hold the gas for a time to be released when the chair owner returns and plops back into the seat.  Hilarious every time.\n\nThroughout my long career, I've imparted this knowledge into what must amount to be an Army of little farters.\n\nWhen I eventually retire, it'll be in the glow of knowing I've done my bit.",
            "The fart hadooken",
            "That is fancy. We used to just asked if someone could smell popcorn whenever you farted",
            "the technical term is \"cup cake\"",
            "Handful of fun",
            "Had a friend that would do that too. Shove it right in my face with his hand.",
            "A classmate in highschool would shout out, \"does anyone smell popcorn?!\"",
            "Stuff like this makes me glad I'm a girl.\nThis is just nasty. It is not a fair fight and it is psychologically damaging.",
            "Ha doo ken",
            "I am a fifty year old man who is copying and pasting these into his notes for future reference. Never grow up, Never mature!!!",
            "We called it buttercupping. And you could actually launch it across a room if the air was still enough. It was great haha",
            "Cup of fart",
            "We called it a Ninja Bomb",
            "The ancient rasengan holy shit I almost died from laughter lmfao",
            "My wife gets me with this all the time. I now have gotten very well at it. It takes some skills and timing",
            "The can of beef?",
            "My dad calls that giving someone a Capture, my grandfather called it Tossing Farts!",
            "my brother used to do that to me",
            "[deleted]",
            "I died at air biscuit 🤣🤣🤣",
            "You know those air cannons they sell at gift shops and stuff that you pull back and then it shoots a big pile of air forward?\n\nMy literal first thought when I first used one was I wanted to fart into it.",
            "I call them Dragon Palm Butt Bombs.  I like dragons and just thought of them while thrusting my hand out after scooping my fart air.  I do it all fluid kungfooey-like.",
            "Cupcake is what we called it",
            "My brother would always chant \"cup of soup\" when he did this....",
            "Shit I thought scooby snacks were the end of a weed jar. I have some calls to make.",
            "The kids I coach have taken it to a new level. They call it a \"fart transplant\". They wait for their teammate to lay on their belly, then they sit ass to ass, yell \"fart tranplant\" and fart on the bottom person's ass. It's getting weird over here lol",
            "Ninja dust rofl",
            "We used to call this \"cup o'soup\"",
            "It looks that way because it is.",
            "Even then, she had her hand on her ass cheek not her asshole, 0/10 form. You miss 100% of farts you don't cup.",
            "You're supposed to call upon u/gifreversingbot to see if true",
            "That's an insane accusation",
            "True if big",
            "Its the alt right attacking swift because she supports biden",
            "Because it is",
            "Still funny, because now she wipes her runny nose and then rubs it off lol.",
            "Ah so she just wiped out her snot on the ass",
            "What gave it away? Was it everyone walking backwards?",
            "Big if true.",
            "But that's impossible - how could anyone breathe out their fart, bring to down to their butt, then suck their fart back into their ass cavity? /s",
            "Does that mean her ass smells like her mouth?",
            "Haters will say that",
            "Play it correctly and she’s wiping a booger on her booty.",
            "the original video is way funnier, she's wiping boogers on her pants.",
            "That means she wipes her boogers on her thigh",
            "SMUG ALERT!",
            "Theeeeenks! 😁",
            "Great reference!",
            "I’d be putting it on a fine wine cup first",
            "I don’t get it",
            "Good for you!",
            "Pious driver checking in. ",
            ">sort of like \n\n*exactly like",
            "Kinda like those smelling salts athletes use.",
            "Why do I drink my own urine?\n\nBecause it’s sterile and I like the taste.",
            "Cows are little methane generators.",
            "Taylors Wift",
            "Stop gaslighting! 😀",
            "No this is just a normal clip from a Taylor Snift concert.",
            "So she wiped her boogers on her butt?",
            "She usually moves like an alien trying to pass off as human so this looked totally normal to me",
            "Lovers will say it’s not fake",
            "Can’t one of you millennial tech ninjas post a link to the reversed clip reversed (aka forwards)?  There’s gotta be a bot for that.",
            "Nah it's totally normal. At least I hope so because we have problems if not.",
            "Same, except I definitely don't have a problem because the smell is awesome",
            "Is it possible your fart started the hurricane?",
            "we all get high on our own supply",
            "\"Cool!\"",
            "*Nothing* gets past you!",
            "I think in this clip, a bunch of snot came out of her nose, and she had to wipe it on her thigh. Obviously, snot is pretty normal, but if you wanted to see Taylor do something gross, I think she still did here.",
            "Probably notes of pumpkin spice and chicory.",
            "Had to scroll way to far for this reference!",
            "No, it's Cup-O-Fart ... Cup-O-Fart.",
            "Eat* FTFY",
            "I'd let her give me pink eye",
            "I'm surprised this isn't the top comment.",
            "How DARE they give you a downvote for this! I'm outraged.",
            "Must be. It’s literally one of my earliest memories.",
            "it was the guy who played Neutered Man's go-to move on Orgazmo so it makes sense that they'd also put it in a South Park game 25 years later",
            "First it was Orgazmo shit but still the same people so it’s ok.",
            "DRAGONSHOUT!",
            "Pretty sure you can do that in Fractured but whole",
            "And some entrepreneurial women have made a disturbing amount of money selling their stink gas in mason jars online",
            "The foulest stench is in the air  \nThe funk of forty thousand years    \nAnd grisly gas from every ass  \nIs closing in to seal your doom  \nAnd though you fight to stay alive  \nYour body starts to shiver   \nFor no mere mortal can resist  \nThe evil of the thriller",
            "My buddy cracked a rat into an empty Pringles can and put it under his brother's pillow 🤌",
            "Reminds me of my [favorite comic strip ever](https://imgur.com/science-cant-explain-everything-cmouEhM). Enjoy!",
            "I had a very different college experience",
            "This is what the internet is for, this kind of documentation.",
            "We called it a hand delivery.",
            "Ah. I just called it the 'fart ball.' I had 3 or 4 different pitch deliveries too.",
            "In these parts we called it a buttercup. ",
            "I have a question, why is everything fart related \"Dutch\"?",
            "Nice! Lol",
            "Cuppa cheese!",
            "The sneaky boofa. Savage. I love it.",
            "Believe it or not this makes you qualified for SCOTUS",
            "OMG, so much right with this.....I miss my youth.",
            "Bufa is Portuguese for fart, maybe you knew or were around Portuguese people?",
            "Boofa deez nuts!",
            "We always called it the cup of soup in middle school hahaha",
            "😎🫴💨💀",
            "My son does this too….he learnt it from me…hit grandma with the hadouken.",
            "NOW YOU'RE A MAN MAN!",
            "Neutered Man!",
            "I haven’t thought of that movie in a minute!",
            "A dish best served warm",
            "Neat!",
            "You can tell because she actually blows in her hand then fills it into her ass.",
            "You can tell because of the way it is.",
            "So she wiped her snot with her ass?",
            "Too true to be good",
            "big if true",
            "TH-anks!",
            "It's a South Park reference.",
            "Oh I know, but the \"authorities\" get really upset if you light one in a power failure.",
            "Taylor's Whiff",
            "Lol you mean light gassing",
            "U know that can light ur but if ur not careful",
            "Perfectly acceptable, let’s move on now…",
            "You store them up there then when you poop you can just get rid of all of it at once, instead of being a dick and leaving your boogers all over the place.",
            "Narrator: It was in fact a problem",
            "Wiping snot on her ass or huffing her own farts, either way I'm into it.",
            "Someone's just a hater that I said the truth first. We were all thinking this.",
            "> Must be. It’s literally one of my earliest memories.\n\nStick of Truth was released ten years ago.  Are your earliest memories in the womb?",
            "Now, I don't want to sound like a queer or nothin', but... \n\nTechnically the character you're referring to is A-Cup. While he plays Neutered Man in the in-film Orgazmo porn flicks that they are making, he's really just A-Cup. This is only important because later when the director Max Orbison loses his testicles (under the care of a doctor played by Lloyd Kaufman, head of Troma Films who gave Trey and Matt their start with Cannibal: The Musical) he *actually* becomes a real-life (in-film) Neutered Man. Neutered Man's power is that he has no balls so the Orgazmo-rator won't work on him. It's A-Cup that farts and throws it, but the Orgazmo-rator definitely works on him. It's a subtle differentiation, but it's important to me. Like the difference between Scott Baio, Frank Gifford, and Sancho. \n\nCHEOPS!!! I think unicorns are kickass.",
            "AND CHODA BOY!!",
            "Immediately what I thought of",
            "… time to setup some websites as my female alter-ego.…",
            "I mean upvote the info, but who can I down vote that does this?",
            "I’m curious if “cracked a rat” is a typo or a euphemism I’m unfamiliar with.",
            "You ever just fuckin crack a rat?",
            "AI ain't gonna train itself.",
            "“here, have some soup”",
            "We called it a buttercup",
            "We called it \"Cup o' Fart\"",
            "You guys had names for this stuff?",
            "We called it the cupcake. We would always ask people if they wanted a cupcake. They got it regardless.",
            "Cuppa Cheese!",
            "I believe Plato first asked this question, and it has never been answered.",
            "According to Statista, the average Dutch person consumed about 22.1 kilograms of cheese in 2022. They are efficient at turning that to farts.",
            "I'm intolerant of anyone who's intolerant of other cultures, and the Dutch.",
            "He's using it as a derivative from 'Dutch Oven', which refers to keeping a person under a blanket after you farted underneath, which in turn refers to a type of cast iron pan.",
            "The Dutch oven is a covered pan. To cover something is to Dutch it in this case",
            "My dad taught me that one lol\n\nI have no idea where he got it from, likely someone from that threw a fart at him and yelled \"Bufa!\"\n\nThanks for the knowledge, I hadn't boofa'ed someone in a while, so I was planning an attack and now I know more about the nomenclature of the attack I have been using since my youth.",
            "The buttercup",
            "bottom ramen 🍜",
            "Lmaoooo",
            "🤣 jokes",
            "Hey, I think you're pretty neat, but I respect your distance.",
            "How do you think she makes that Swifty Magic?",
            "Blows her nose onto her hand and wipes it on her ass",
            "Storing it for later",
            "Good fur yew",
            "Thank you!",
            "You mean white assing ",
            "Nope, but I’m clearly dating myself. I assumed Stick of Truth was just some obscure euphemism.",
            "Beautiful. A masterpiece.",
            "No, I am Sancho.",
            "I don’t mean to sound like a queer or nothing, but I think Depeche Mode is a sweet band",
            "Doesn't work. Female and male farts have very different aromas.",
            "[/u/TrekForce](https://old.reddit.com/r/funny/comments/1dldlpc/be_honest/l9ov1tb/)",
            "If it wasn't before it is now",
            "I'm pretty sure it was originally a typo that people are now running with.  Crack a rat is now a euphemism for farting, as seen on Reddit.  This is the third time I've seen it and the first comment had an insane number of replies.",
            "Cupcake",
            "Is someone making popcorn?!?",
            "Cuppa soup🤢",
            "Same.",
            "Ya, that’s what my brother and I called it",
            "Yeah, and we thought we were the first to invent it.",
            "Dude that's not surprising- hie spelunking advice sucks. Or it might be excellent, iunnno, I don't talk about spelunking all that much...",
            "This is what we called it too",
            "87 represent!",
            "Hey dad I don’t think I’m gonna do hamster style anymore\n\nThat’s nice…. That’s nice…",
            "We found your first customer.",
            "Either way, you gonna have to pay me and let out the captured fart to decipher.. and since you let it out.. sorry no returns.",
            "No it might be a New York thing, I've heard it on 10-year-old Impractical Jokers episodes",
            "Serious question. If \"cracked a rat\" is a typo, I cannot for the life of me figure out what euphemism he was trying to type out. Any guesses?",
            "BEEF STEW!!!!",
            "That's how people said it here\n\nKids are gross. Definitely getting my roommate a cup when he gets home tho.",
            "Don’t even get him started on the Dutch gas mask.",
            "Maybe it refers to when a dead / bloated rat splits open and releases it's rotten corpse gas?",
            "Cracked a fart, obviously. Rat is fart rearranged without the F."
        ]
    },
    "A take on psychosexuality [Bilbro Braggins (parody) on X]": {
        "title": "A take on psychosexuality [Bilbro Braggins (parody) on X]",
        "score": 2853,
        "url": "https://v.redd.it/2n1azmeoj08d1",
        "content": "",
        "num_comments": 73,
        "comments": [
            "---      \n\n>This is a friendly reminder to [read our rules](https://www.reddit.com/r/funny/wiki/rules). \n>\n>Memes, social media, hate-speech, and pornography are not allowed. \n>\n>Screenshots of Reddit are expressly forbidden, as are TikTok videos.\n>\n>**Rule-breaking posts may result in bans.**\n>\n>Please also [be wary of spam](https://www.reddit.com/r/funny/wiki/spam).\n>\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/funny) if you have any questions or concerns.*",
            "Oh my god I think I have this disease!",
            "It was a white Jeep compass but pretty spot on lol.",
            "Guys.... I have a problem",
            "“If she’s fucked in the head, she can fuck in the bed” 😂 I love it!",
            "I was told never put it in the crazy…..now I’m reconsidering",
            "The tongue thing😂 wtf was that",
            "My sister’s ex-roommate was in a psychosexual relationship. Whenever the couple had a petty fight, he would drunkenly storm off and ride Chicago’s L, turning his location on and off. The roommate would then make my sister get in her car and frantically follow him to whenever he turned his location on, all while sobbing non-stop. They’d end up chasing him throughout the city. If he didn’t storm off, she would throw things at him and lock herself in her room blaring Taylor swift. My sister moved out as soon as she could. \n\nThey just got engaged. I’m sure it will be an uneventful marriage.",
            "Wow, after all these years I found the name for my ailment. I just thought Becky \"ruin your life\" Lynn was my type I didn't know it was an actual condition!",
            "Did you know that all those guys who warn you to \"never stick your dick in crazy\" are just saying it so they can have the crazy ones for themselves?",
            "Hey I drive a white jeep! 😃",
            "I feel seen.",
            "This is sheer wilderness Lmaoo",
            "That final point is definitely true. There’s a reason why he went back after waking up in the middle of night and seeing her standing over him with a knife. He ain’t scared of her he’s scared of life without her 😂.",
            "I have a disease and they don’t know what to call it.",
            "This explains a lot.",
            "This was essentially me from 20-31 only I never knew what it was called.",
            "Their Youtube is [Content Machine](https://youtube.com/@content_machine?si=gMS7jZ9L7hRzmk_n)",
            "All aboard! Ha ha ha ha ha ha haaaa!\nAy, ay, ay, ay, ay, ay, ay... 🚂",
            "I can fix her.",
            "Noice!!! 👌🏼",
            "Why won't it let me post a doctor zerious break dance",
            "Holy shit this is me! I feel like a magnet for these people.",
            "I like crazy girls too.\n\nBut, they cheat if you hurt their feelings.",
            "Finally some good content 👌🏻",
            "They are all crazy!",
            "Welp, he has my vote.",
            "The context machine",
            "My ex is your girl then",
            "It is actually the eyes.  Also none of these women are psycho.  They are just rational actors.",
            "I never knew they had a name for it, it explains so much.",
            "Slippy socks, grippy box.",
            "Oh the \"I can fix her type\"",
            "My soul just died.\n\n(Bury it anywhere but Florida but yeah dead)",
            "[YouTube](https://www.youtube.com/watch?v=5abamRO41fE)",
            "It’s also known as Forrest Gump Syndrome. It’s where you’re attracted to crazy women, and are yourself also kinda stupid.",
            "I have whichever disease makes bisexual witches with BPD cheat on me.",
            "She said Jeep Wrangler though",
            "go on…..",
            "In my experience if a person is reserved and reasonable and suppresses all their emotions - they actually fuck like the devil because sex is that outlet for all complicated emotions and desires they withhold.\n\nPeople who are “fucked in the head” are just a bit stupid. Still waters run deep though.",
            "Don’t knock til you tried it…and make sure you know when to fill out a restraining order 😂",
            "They say that to keep the best to themselves, its all psychosexual propaganda",
            "Don’t do it. Or if you do, go in with an escape plan.",
            "They wouldn't need to have a saying about it if it wasn't so tempting.",
            ">I was told never put it in the crazy…\n\n...unless she is really really hot",
            "I believe that was a PsychoSexual act",
            "The best part",
            "Oh my goodness. Can you imagine their kids therapy bill? Dammm",
            "We agreed to keep this a secret Alex",
            "It’s ok, I can fix you! 😂",
            "This was by far the funniest comment I have read in a week.",
            "Pretty sure Barney Stinson was responsible for awareness on psychosexuality dedicating most of his career to this phenomenon. The Hot/Crazy Scale was revolutionary.",
            "This made me so sad :(",
            "What if you’re just kinda stupid?",
            "Goddamnitt Jennyyyy… Why tf did you say PingPong would be a lucrative career path?",
            "Here I thought it was just me",
            "Fuck….",
            "Dude... Damn. Same.",
            "I feel personally attacked and I'm old, I shouldn't relate.",
            "By chance do you know any male names that start with a and end with a?",
            "Why do you have to call me out like that?",
            "Some people are just dull all around …",
            "It's always the quiet ones.",
            "I dunno that implies the kids gonna be able to afford therapy. With parents like that it seems doubtful.",
            "please don´t call me alex, i´m still your dad!",
            "You probably say that to all the girls 🙄",
            "Ah, the Vicky mendoza diagonal. She'd get a boob job, then stab him with a fork",
            "Also true"
        ]
    }
}