{
    "r/GamingLaptops Discord Server Status Update, June 2024": {
        "title": "r/GamingLaptops Discord Server Status Update, June 2024",
        "score": 8,
        "url": "https://www.reddit.com/r/GamingLaptops/comments/1dfzq9m/rgaminglaptops_discord_server_status_update_june/",
        "content": "Howdy r/GamingLaptops community,\n\nI'm excited to announce that we're working hard on launching our official Discord server! The release date is expected to be later this month or early July. However, if unforeseen circumstances arise, there might be a slight delay. Rest assured, the server will be coming extremely soon its just a matter of bot & server related structuring.\n\nOur goal is to create a beneficial and streamlined server for all users. We're experimenting with our own bot, Buzz, adding innovative functionalities, and ensuring the community has a say in the direction we take. Toxic meming culture will be discouraged; we focus on activity, knowledge, good sportsmanship, and fostering great community attributes.\n\nThere will be no paid roles or donation links or focused financial incentives. We value genuine engagement, activity, and contribution. However, we may only add supporter roles in the future if we achieve the goals set.\n\nIf you have questions ask them in the comments!\n\nThank you for your patience!\n\nBest, Melm",
        "num_comments": 5,
        "comments": [
            "And yes, I know we've told you before that our server is releasing soon \\*cough months ago. However, real-life stuff happens out of nowhere so you can't plan everything precisely.",
            "Excellent to see, better to refine the server than set dates in stone and rush things.",
            "Great news!",
            "NICE!! :D"
        ]
    },
    "Got a brand new laptop, should I charge it to 100% or drain it first? HELP": {
        "title": "Got a brand new laptop, should I charge it to 100% or drain it first? HELP",
        "score": 27,
        "url": "https://i.redd.it/oghj0gnrq38d1.jpeg",
        "content": "It's my first laptop (G14 2024), I've read around the internet a bunch of tips on how to handle laptop batteries on its first boot up...\n\nNow I'm confused! Should I drain it 'til it shuts down or charge it to 100% at least once then limit next charges to 85 to 90% and never let it drain?\n\nThank you everyone!",
        "num_comments": 25,
        "comments": [
            "That’s an old myth.",
            "New laptops have battery management programs that help you get the most out of your battery. The most common settings will be 80% charging while running of wall power. There’s a lot of old information about batteries that come from the days when batteries had nickel in them and would develop problems due to battery memory. The new lithium polymer batteries don’t have the same issues.",
            "Oh no. You should do neither. Only let it charge to 100% when you’re going out\n\nLet me explain: when the battery is perfectly balanced at 50%. Between two sides, both sides are perfectly content at staying that way. But let’s say it’s at 0% or 100%. Then you risk battery damage because the charge on one side is significantly higher than the other. Hence  one side desperately wants to move to the other side. And the other side desperately wants to gain some from the higher charge side.\n\n(Sorry for any mistakes I made, it’s been a while since I’ve done any explaining on this)\n\nSo. The best charge at all times is a perfect 50%. 50% full. Or 50% empty. Plus since you’re always gonna keep it plugged it when gaming, It’s going to continually be taking in power. So go to your control center and set the battery cap to 50%. And only too 100% when you go out.",
            "Using the MyASUS app limit the charge to 80%\n\nOr use GHelper and set it to 70% thats while on use. If you are gaming while it’s charging it’s better to limit the charge to avoid battery degradation",
            "I see you have a G14 there, install G-Helper from Github and set the charge limit to 50% when you're using wall charging. Only charge it to 100% when you're going out and not expect a wall plug to be available for an extended period. The G14 has excellent battery life anyway so I wouldn't worry about that, just focus on preserving your battery and getting the most out of it.",
            "not required. just remove  the bloat you get on windows. and enjoy your new laptop.",
            "On a brand new machine, I always do a couple of full cycles. Charge 100% and drain until shut off. It helps bed in the cells and then windows also has an idea of battery potential.\n\nAfter than I leave it on the safe charging settings of about 80% and do a full cycle every month or so since it stays plugged in most of the time anyway.\n\nThey normally suggest keeping it between 20-80% for general cycles since it wears the battery less. On the other hand I was told my battery specialists that if you keep it plugged in most of the time at 80%, its important to do full cycles to keep its capacity and output.\n\nDepends what you read and where, over the past few years battery tech and treatment of them keeps changing.",
            "It's an old myth. Btw Nice laptop man, can you tell me the full specs?",
            "I think G14 ryzen comes with undervolted GPU",
            "For the love of everything good, please don't smother your laptop's bottom vents by putting them flat on the bed. Those internal cooling fans will be gasping for air. This has been a common cause for overheating and system failures.",
            "Dude \nDont put it on a soft surface!!!!!\nThe fan needs air",
            "Do nothing, just use it however you want. Use it plugged in or on battery or play football with it. It doesn't care.",
            "The sweet spot for charging is between 40% and 80%.\n\nAlso, new lithium ion batteries don't need to be fully discharged or fully charged on the first go-around. This is an unfortunate carry-over that some people still push that was only applicable to \\*much\\* older battery technologies.",
            "Lithium batteries only get damaged when fully depleted. So basicly it doesnt really matter anymore.",
            "throw it :)",
            "Very old one. Oh and op should remove battery when on cord to protect it!",
            "Not a myth though, just not true for modern batteries",
            "Can I get the source for this?\nI remember learning about this during one of my classes lol",
            "Video or article for this? Thank you.",
            "They come with lower wattage GPUs because Asus wanted to get a better heat management. It’s a thin laptop.",
            "Damn why didn't i think of this like the past 10 years",
            "https://youtu.be/UpqaQR4ikig?si=BglwIb6-rUHY9rcx\n\nAround 04:00",
            "It's the same with a phone, everyone recommends to keep it between 20% and 80%, less charge cycles, longer lasting battery. I don't know how many people actually do that religiously but that's the best for a battery.",
            "Lots of recent phones have options that cap charging at 80% and turn it off at 20%. I've got it capped at 80 but don't have the 20% part enabled, I tend to get home with maybe 10% remaining sometimes",
            "I cap my Legion laptop at 50-60% and use it plugged in at the desk almost 99.99% of the time. After 8 months, the capacity went down from 83 to 82Whr (the standard capacity is 80Whr), so a 1% loss.\n\nI cap my ThinkPad laptop at 80% but I use it more like a “laptop”, meaning charging and discharging. After 6 months 5% of the original battery is already degraded.\n\nTherefore, as long as you keep it plugged, the laptop will pull the power directly from the charger, hence not degrading the battery."
        ]
    },
    "Finally got it…": {
        "title": "Finally got it…",
        "score": 152,
        "url": "https://i.redd.it/d79yxshyvy7d1.jpeg",
        "content": "Dell G15 5535 Ryzen™ 7 7840HS RTX™ 4060 16gb RAM",
        "num_comments": 72,
        "comments": [
            "People here will hate Dell laptops but congrats man. That's a nice one. \n\nNext up should be some better peripherals to really finish off the experience",
            "Grats",
            "What's the screen on it?  Nice setup btw",
            "That's a crusty pair of headphones",
            "congrats bro. some descent gadgets and ur good to go.",
            "How much did it cost?",
            "Enjoy gaming!",
            "Mousepad is the best accesory - complements the setup well",
            "What game are you playing there?",
            "congrats! got the same exact specs in my laptop. the performance is amazing!",
            "Nice one! \n\nI've not had a Dell laptop since 2008 (my first ever laptop actually, an Inspiron 1525) but I've seen this and the G16 on really good deals recently, the specs look good and people seem happy with them.",
            "Get a laptop cooler/stand for better airflow. It will help a lot with the insanely high temps your laptop will be running at.\n\nAlso invest in a mousepad, I bought some cheap clothlike mousepad and it works so neatly. Fits my table just nicely. Other than that enjoy the laptop, looks good",
            "Congo, Man how's it performing? I am thinking to buy one. Is the brightness usable in outdoors?",
            "Does dell have thunderbolt?",
            "Are those the soundcore space one?. How is it",
            "Nice, thermal is like the biggest issue for Dell G15 line of laptop so i hope u got a solution",
            "W game. Only other game than last of us that made me feel like getting punched in the gut.",
            "Just wondering if the G15 is actually good I heard it keeps on blue screening and do you think its good.",
            "how big is the charger on this model?",
            "How much just for laptop?",
            "Bought the same one with a 3050 about 5 months back. It is a beast and am playing the same game right now. Hope it serves you well!!",
            "I have the same specs but in an rog zephyrus",
            "Planning to buy the same, but I have concerns about battery back-up? How much are you getting and does it have a mux switch?",
            "Dude are those Soundscore q30's? You can buy replacement earpads for those, as well as headband covers.",
            "What game is that?",
            "another Dell G15? hell yeah!!",
            "Why is your mouse placed on your death note?",
            "How does it perform in terms of thermals, battery life and fan noise? Asking for personal curiosity.",
            "good looking one man! enjoy the games",
            "shiii thats budget af",
            "People here only like Lenovo laptops, it's pretty strange.",
            "Thanks. \nYeah, would buy some peripherals after a while. Had to unload my whole budget in this machine.",
            "Thanks man",
            "It’s a 1080p 165Hz panel",
            "Thanks btw",
            "Yes, planning to change the earcups , sound is good otherwise.",
            "That’s the plan.",
            "It was under 800$ after tax in the US.",
            "Yes",
            "Yeah, Planning to upgrade one by one.",
            "It’s ghost of Tsushima",
            "Thanks and congrats.",
            "Ive got that g16 :D would recommend it",
            "Yeah",
            "It’s very bright and is usable outside, but by outdoors if you mean you travel much you could go for other options cause the charging brick is chunky.The performance is good too , haven’t run into any issues too..",
            "Nope. My model doesn’t.",
            "Only on intel laptops. AMD doesn’t have Thunderbolt",
            "It’s soundcore Q30 , I think it’s the predecessor of space one.",
            "Maybe but Mine doesn’t get as hot as people on reddit make it to be .",
            "I Agree, i just got started ,hopefully going to finish within the next few days.",
            "Maybe, it hasn’t happened to me yet, Also majority of the posts or queries people make are when there is an issue with the product not when someone’s happy with it.",
            "It’s literally the size of a brick",
            "Ive gotten the g16 model and its 300w but chunky as heck",
            "It was under 800$ after tax in the US.",
            "Same to you too",
            "The battery backup is pretty good for the gaming laptop segment , doing just mild programming and web browsing it lasted for 2.5 hours. I haven't tested while gaming, so can't tell. I've read on a post that you can enable or disable mux switch, but i forgot so make sure about it if you need.",
            "Yeah I knew you could change the earpads but what i didn't know you could change the  headband cover,\n\ngoing to repalce it soon tho.",
            "Ghost of Tsushima",
            "Kill assist lol: \n\nIt's my mousepad for now.",
            "I love my Lenovo, but there’s nothing wrong with a Dell. It’s just an Omen or AW at half the weight and price.",
            "https://m.youtube.com/@TK2236 for free games pasta",
            "That's cool",
            "Get the Sennhieser Pc38x, amazing headset.",
            "Where did you get it from?",
            "Ohkay thanks!!!",
            "hey man I am planning to buy Dell G16 same processor but 16gb ram and a 4060... Is there anything I should know about before buying like battery life, display brightness, and does it overheat while gaming?",
            "From USA",
            "Go for 32 gigs if you can. You'll need it.Display is good 240Hz 1440p 👍\nBrightness is good but i havent tested it outside.\nBattery life is not the best tbh 2,5-3ish hours...\nFor overheat i havent experienced much of overheat but i can recommend somethings.Disable intel turbo boost it dropped my temps by 15C (both) \nDownload Alienware command software for keyboard & Fans\n(You may want to invest in a cooling pad later on though)\nBtw if you want to change how long your kb stays lit up its in Bios idk why they put it there :/\nİf you have further questions lmk!",
            "As in which store or website?",
            "Or any games for fps",
            "Oh, Dell’s official website.",
            "Nice grab! Very good value!"
        ]
    },
    "How to turn off?": {
        "title": "How to turn off?",
        "score": 12,
        "url": "https://i.redd.it/oy98ofzwu28d1.jpeg",
        "content": "Hello everyone!\nI really hope you're all doing well!\nPlease, I would like to request your help to solve my \"problem\".\nI've recently bought a Predator Helios Neo 16 and I would love to know how turn off this white LED. It's too strong.\nCould you please help me to find a solution besides break, tape or disconnect the LED?\nThank you very much!\nI really appreciate your time, patience and effort to help me.",
        "num_comments": 10,
        "comments": [
            "You cannot turn that off. The button is for switching modes.",
            "If there isn't a software that can turn off the light, than black electrical tape will do the job",
            "Press and hold that blue button for 5 seconds /s",
            "If I were you I'd tape around it, framing it perfectly, then get a sharpie and colour it in. Remove the tape so you got clean lines.\n\nThe button's brightness will be very dull yet still visible. \n\nIf you're not keen on colouring it in, buy a black sticker and cut it to size to cover the light.\n\nLuckily for me, Asus 2024 models allow you to turn the status and power button LED's off via BIOS. ;3",
            "U can turn down the brightness of the keyboard lights by holding the Fn button and pressing F11, OR use the settings in the Predator Sense app. Press the button above your Num Pad that has the symbol matching the symbol below your screen to launch the Predator Sense app.",
            "Not related to the post but does your helios have advanced optimus?",
            "Check bios or advanced bios if it has a setting for it. You'd have to look it up in the user manual.",
            "Unfortunately, that white LED to change modes doesn't respond to these commands, mate. 😭",
            "i have the same model and it has one.",
            "Try tape, preferably black electrical tape."
        ]
    },
    "Just baught a smart heater.": {
        "title": "Just baught a smart heater.",
        "score": 4,
        "url": "https://i.redd.it/5fc2owrcu38d1.jpeg",
        "content": "",
        "num_comments": 0,
        "comments": []
    }
}