{
    "Friendly Friday Thread": {
        "title": "Friendly Friday Thread",
        "score": 3,
        "url": "https://www.reddit.com/r/gardening/comments/1dl0c29/friendly_friday_thread/",
        "content": " This is the Friendly Friday Thread.\n\nNegative or even snarky attitudes are not welcome here. This is a thread to ask questions and hopefully get some friendly advice.\n\nThis format is used in a ton of other subreddits and we think it can work here. Anyway, thanks for participating!\n\nPlease hit the report button if someone is being mean and we'll remove those comments, or the person if necessary.\n\n\\-The [/r/gardening](https://www.reddit.com/r/gardening) mods",
        "num_comments": 34,
        "comments": [
            "Hoping someone might be able to lend some insight into what's going on with this blue salvia. I bought three plants (presumably all the same...) late last summer and planted them in the yard. The existing stems were pretty wimpy and all died/fell off over fall/winter, but they came back surprisingly strong. Now that they're coming in, two look bushy, green, and healthy, while the third is looking pretty sad and wilty. They're all in roughly the same area, probably get the same amount of light, and they all get watered at the same time, more or less the same amount. At first I thought it looked maybe over-watered, so I tried to cut back and kind of watered around it. Didn't really show improvement over a couple days, and I also read that leaves tend to curl up when underwatered, so now I'm watering it again, but it still looks about the same. Soil doesn't seem wet or mushy. Pretty sandy/dry sticking my finger in an inch or so down. So... I dunno.\n\nIs there something more I should be doing? Is it just genetics? Also, the other two salvias have real wide, fat leaves, but this one has narrow, spindly leaves. Genetics again, or maybe I bought a different variety by mistake?\n\nOh, it basically gets full sun and I'm in zone 7b. Low humidity, dry, has been high 80s, low 90s the last couple weeks, brief cold front aside.\n\nhttps://preview.redd.it/o8vthg1y2y7d1.jpeg?width=3072&format=pjpg&auto=webp&s=15bbd98c034289c5228b8b8c4b3ba870a6e6c151",
            "I'm Minnesota zone 4 with a ton of direct sun, and the plants that seem to thrive best in my yard are native sunflowers, coneflowers, and goldenrod. Any suggestions for plants that might enjoy my conditions but that bloom earlier in the season? I'm basically bloomless until mid-July when everything pops off at once",
            "What do I do about all this (maybe) purslane that's emerged in my raised beds? For context, I moved into this new place less than a month ago, and just barely had time to amend the soil of these raised beds and pull approximately five million weeds before planting in them. It seems that my turning over awoke a dormant seed bank, and now we have what looks like purslane all over. Will this be a problem for the plants, including the basil that I planted from seed? And if so, how should I deal with it so that I don't harm the peppers, beans, tomatoes and tomatillos that are in here? Photo for reference, it's quite dense in this bed especially.\n\nhttps://preview.redd.it/j58kxyn1vy7d1.jpeg?width=3024&format=pjpg&auto=webp&s=2f6cd8456480ef108400e56611f1daaa241edee8",
            "posted this comment at the tail end of the last thread, will remove it if it counts as spam \n\nRecently moved into an apartment with fairly large back yard and have been wanting to start gardening so I figured this would be great time to start. I already planted some beans as I read they’re a good choice. I probably should’ve thought about this before but I’m worrying if this area is too shady. So I was wondering did I screw up and plant something that won’t survive? And what suggestions would you guys have for new additions that would fit will into this area\n\nPictures were taken at approximately noon\n\n[https://imgur.com/a/yard-photos-jfFpX0f](https://imgur.com/a/yard-photos-jfFpX0f)\n\nI'm in eastern Pennsylvania, zone 7a",
            "https://preview.redd.it/v1xblbjkjx7d1.jpeg?width=3448&format=pjpg&auto=webp&s=7092c043ba43a4fc402995c76e0de6dac5b9c0b4\n\n~~Can anyone help me identify what kind of eggs are on this leaf? The plant is a river birch and it's located in Southern Maine. They definitely don't look like they're part of the leaf, and there are a ton of them!~~\n\n  \nSolved thanks to u/scotty\\_beams ! \"Those are leaf galls of one of the eriophyid mites (→ Gall and Rust Mites, [Family Eriophyidae](https://www.inaturalist.org/taxa/55584-Eriophyidae))\"",
            "I’m at my wits end with the critters here (Pennsylvania zone 6b). I suspect squirrels and rabbits. They chew some - not all - my lilies, leaving just a stem. Others they dig in the soil/mulch and just leave holes in the ground. They dig up my creeping thyme and irises - apparently just for the fun of it because they aren’t eating anything. I’ve tried those cayenne pepper sprays and sprinkled red pepper flakes, but it doesn’t keep them at bay for long. Is the anything at all that deters them? They’re such jerks! Do I have to build little chicken wire fences around everything?",
            "Does anyone else here struggle with kneeling to weed/plant/mulch/whatever? I am getting the WORST head rushes, even if I'm only squatting down for a minute. I'm fine while squatting but as soon as I stand back up I get slammed with fuzzy head, vision going dark, face feels flushed, and heart beats like crazy. Then like 30 seconds later I'm fine. I don't have any DX medical conditions (tested for POTS 8 years ago, tilt test negative). If anyone else gets this I'd love to know how you garden around it or if you've ignored it, whether it was fine or got worse. I'm afraid I'm going to pass out 🤦🏻‍♀️",
            "Can someone help me get a better understanding of different fertilizers? \n\nI recently got all my plants into pots with a raised bed/container mix that came premixed with some nutrients. The bag said N=0.3% P=0.1% K=0.1%. \n\n  \nI've read that in containers fertilizing every 2 weeks or so is a good idea so that was my plan for this weekend. \n\nI've seen recommendations for a few different brands of things but I'm a bit confused by the NPK.\n\nIn one case, Neptunes Harvest Tomato and Veg solution, the NPK is listed as 2-4-2. Then I looked at Miracle-Gro performance organics edibles mix and the NPK is MUCH higher at 9-4-12. Those are the extremes but other mixes have been 5-7-3, 4-4-4, etc. \n\nMy question is why is there such a wide range here? I don't want to go overboard but I also don't want to under fertilize. \n\nAt this point I think I'm supposed to prioritize the nitrogen to encourage plant growth over flowering (I've got tomatoes, peppers, cucumbers) so I'm just trying to figure out what the best thing I should add is and how best to do it. \n\nThanks!",
            "Could these various sunflowers be dead headed so they’ll grow back or do y’all think they’re too small?\n\nhttps://preview.redd.it/pjtxy2nkrz7d1.jpeg?width=5712&format=pjpg&auto=webp&s=d2d4d325c3bed04bb97078de053f5f644f945a0c",
            "[removed]",
            "Any advice for moving from zone 6b to 9b? Moving from NJ to AZ and I want to continue to grow tomatoes and peppers and such as well as establish a new native pollinator garden in my yard. Some stuff might be in containers and others I would like to try and grow in the ground.",
            "Do I want to take this guy out at the root with boiling water, or do I want to encourage him?  What is this?\n\nhttps://preview.redd.it/g7v2zay4f18d1.jpeg?width=4284&format=pjpg&auto=webp&s=9f7e12147f5aa890678e5c8e8ee559311e7890e3",
            "I have a question about pests. I planted some water spinach seeds in a container on my deck, and the leaves all came up quickly, but over the next few days the starter leaves all got shredded, leaving just stems behind.\n\nWhat bugs or pests tend to do this? Just eat all the new growth on leafy greens? I thought it was squirrels at first, but I built a cage around the container and the leaves are still getting shredded.",
            "I'm new to the world of trees (in the sense that I never had enough room before, but I'm looking for some interesting suggestions (and (online) resources where I can learn about growing them). Let's say to a height of about 5 meters. It will be planted in full sun, I plan to grow other plants in the shade underneath (so preferably single-stem, with a bit of height to the crown). I would like it to be useful w/r/t insects and/or birds (the more boxes it ticks, the better). I came across the Heptacodium miconioides (seven-sons tree) myself, which is beautiful and seems very useful indeed. (Oh and I'm in zone 7 or 8, that might be useful.)",
            "Here's a happy, healthy one, maybe six feet away, for comparison.\n\nhttps://preview.redd.it/hio9xfl83y7d1.jpeg?width=3072&format=pjpg&auto=webp&s=21bae9d2ef84a6f7c48f92faa1218ccd30c11a55",
            "Here is a list of native flowers that like sun and bloom in May/June:  [https://www.wildflower.org/plants/combo.php?fromsearch=true&distribution=&habit=habit\\_herb&duration=&light\\_sun=1&may=1&jun=1](https://www.wildflower.org/plants/combo.php?fromsearch=true&distribution=&habit=habit_herb&duration=&light_sun=1&may=1&jun=1)  I have woodland phlox in full sun. It blooms for a month - quite a long time in early spring. It is probably not rated for full sun but it does fine in spring sun in my yard. Another very interesting plant is prairie smoke. It starts off with nodding red blooms and slowly transitions to the \"smoke\" look. Ultimately, they have wavy off white hairs ready to carry seed to new places which reflects its other name of old man's whiskers. You have a treasure in your state, [PrairieMoon.com](http://PrairieMoon.com) There are other native plant sellers in your state. Look online. Fall, after a hard frost, is a good time to put in native plants. Plugs and bare root plants are much cheaper than quart or gallon sized nursery plants. Deer and rabbits eat tulips but leave daffodils alone so that's another option.",
            "Just pull it up by hand, or use a hoe. Super easy.",
            "move them to the right of the tree, where the sun is shining. You're right, that's too much shade. In a shady area, about the only thing that will grow is ornamentals.  Try some impatiens flowers and hostas if that spot is all day sun.",
            "Every once in a while I actually have tulip blooms. The rest of the time, deer and rabbits feast, the old nipped in the bud robbery. If you have a perennial herb like one of the sages, prune it back in spring and sprinkle the trimmings around/over the plants to be protected. I've never seen critters bother iris unless you have been working the soil and it's nice and easy digging for them. There are repellents which are said to work. I don't know how much they repel humans with their smell! Names I hear the most are Deer Out and Liquid Fence. One strike against blood meal is the smell but it is said to work. I don't know if the first two are safe for veg. gardens.",
            "I got this a lot when I restarted yoga almost a year ago, in transitioning from bending/squatting to standing upright. Part of what helped me was just taking the movement slower; I think I also got used to it over time, and I don't notice it as much now, whether for yoga or gardening. If this is relatively new for you and you've been gardening for a while without it, would def recommend talking to your doc. Is there a possibility that you're dehydrated/undernourished while you're out gardening? Sometimes it seems like easy work to the brain but it can be quite laborious for the body!",
            "re: fertilizer.  There's a wide range because different plants have different needs.  N= nitrogen, P= phosphorous K potassium.    Nitrogen promotes green leaves, phosophorous promotes flowers, and darned if I can remember what K does.  Just buy some 8-8-8.  Then do some research on what needs what. I do remember that Tomatoes are heavy feeders, they like a good bit of nitrogen.  HOWEVER, remember that Tomatoes, cucumbers and almost every other veg starts with the flowers- that's the phosphorous part, so don't skip it.  If you feel the need to feed every two weeks, just get some miracle grow and mix it with water.  Honestly- try not to overthink it, just don't give each plant like two cups of fertilizer and you'll do fine.",
            "Higher numbers of NPK generally mean you use less product per application. Those ferts aren't inherently better. Organic fertilizers have very low numbers compared to chemically manufactured ferts. That doesn't mean chemical ferts are stronger or better; it does mean that a smaller volume is used. Whatever you buy, read the instructions on the container! Applying every 2 weeks may not be correct. It depends on the product.",
            "I hope you'll find useful info [here.](https://extension.arizona.edu/vegetable-gardening)",
            "It sure looks dry although there's a chance a vole or something is nibbling on roots. Try weekly watering of 5 gallons per sq. yard, roughly an inch. When temps are over 85F. increase to twice weekly. Mulch is a big help retaining moisture in soil. 2 inches of wood chips is enough. Don't put it against plant stems.",
            "Ok that's what I was thinking, and fussing with a bit this morning. It seems like a shallow root system so hopefully it won't come back? Kind of an annoying little task, but alas, the things we do for our gardens lol.",
            "Thanks - I’ll look into some of those and see if anything works!",
            "Thanks for the reply! It isn't new, I usually just avoid the motion and it's harder to avoid now that I'm spending more time in the actual ground (previously I've only used container gardens). I'll try taking it slower.",
            "Wonderful! Thank you!!",
            "I eat it! I usually sauté some in with a more desirable crop (like black eyed peas or spinach) just to bulk up harvest and change the flavor a bit. It has a very light flavor and is supposedly full of nutrients. \n\nSometimes I purposely use it for ground cover over deep rooted vegetables. The purslane is so shallow it’s not really competing. It WILL return. I live in a very harsh climate. All the things people talk about invading their yard doesn’t really happen for me. But purslane is everywhere.",
            "Ahh that makes sense. Yea, I wonder if your proprioception just needs to adjust to it. I hope it gets better!",
            "Ah this is really interesting, thanks for sharing! That's curious that it can be a sort of microgreen, do you eat the roots too, or just the tops? I think I'll try to keep it from going to seed if nothing else, but that's cool that you actually like it for ground cover too. I haven't wanted to mulch this year so maybe I'll just... let this do it, lol.",
            "I sorta just yank it up and chop so I’m sure there’s been root segment in there too. Lol\n\nAnother thing I do, since there’s so much and it supposedly contains so many micros, is make compost tea from whatever I pull. For one, it guarantees it’s dead. It’s one of those (for my climate at least) if you drop the tiniest piece, it will root. It seems to make a really good additive."
        ]
    },
    "Mentioned to my bf that I needed a trellis for my beans and I came out the next day to find this setup. 🥹 How'd he do? ": {
        "title": "Mentioned to my bf that I needed a trellis for my beans and I came out the next day to find this setup. 🥹 How'd he do? ",
        "score": 3214,
        "url": "https://i.redd.it/geirt1m0ry7d1.jpeg",
        "content": "The front row is okra, back row is beans. \nMade me want to cry I was so happy he did this for me! ",
        "num_comments": 224,
        "comments": [
            "I think you mean your future husband. This relationship is definitely sprouting to be something special!",
            "get him pregnant asap",
            "Looks good.  He wants to impress you.",
            "As a single gardener... marry this man immediately because he cares enough to do this for you <3",
            "Anchored to the ground. The stakes are solid, the spacing is good, the height seems to work.\n\nMarry him. If you want another solid test plant peas next year.\n\nOn secon thougt just marry him.",
            "That's one VERY smart man!",
            "It doesn't matter how he did... he took the time to give you something you wanted! It's amazing! When is the wedding date???",
            "That’s so sweet! I told mine I needed a temporary shade for my tomato plants and he stopped watching TV and went and built me one with drop cloth until I got a real plant shade.\n\nhttps://preview.redd.it/s1nexgoklz7d1.png?width=3809&format=png&auto=webp&s=517a9afdf8dbb2af6cfba06dddd8d795b7943cd9",
            "Yeah idk why this sub is going off script so let me… BREAK UP WITH HIM YESTERDAY!",
            "Best BF. Gold stars.",
            "Marriage.",
            "Green flag behavior for a green thumb win!",
            "He may be a keeper",
            "He's a keeper!",
            "Marry this man before we do!",
            "i love him.",
            "Now your beans can climb what he erected!",
            "He's a keeper!",
            "As a gay woman, is he available?\n\nSomeone clearly loves you. Give that man a bushel of beans!",
            "This is so incredibly thoughtful. I forget this is how men should be 😔",
            "That's a good man Savannah",
            "He's a keeper. It's a chore getting the dishwasher emptied here 😂",
            "Attaboy",
            "Because he’s an awesome boyfriend",
            "Omg that’s so sweet. I’ve been trying to get a new telling for my jasmines for years lol wish my husband would have made it years ago lol",
            "Y’all looking to become a thruple? 😂",
            "I’d marry him just for that. He actually cares about your hobbies and interests.",
            "He is a keeper.",
            "Are you still calling him boyfriend? He's making husband moves here.",
            "You are all so sweet!! I shared this post with him and he loved all the comments just as much as I did.",
            "Can I be your friend? My garden needs a ton of work. I’ll make cocktails as we observe his gardening skills.",
            "Does he have a brother? 😉 (single)",
            "Number One draft pick",
            "This is really romantic and it's awesome how he acknowledges your passions.",
            "I propose a series of increasingly difficult challenges culminating in designing, constructing, and populating a chicken coop.",
            "Omg that's so cute!! Wish my setup was that adorable, currently just some old wire stuck in the ground, lol",
            "Married 28 years today and hubs watered the garden every day while I was gone this week. Came home to harvest snow peas. Marry this trellis building hunk!",
            "Marry him!! \n\nMy husband is the same way!! I will have some off hand remark or just muttering to myself and shit magically happens. He is magic. Oh my garden got bigger and I need to get another line of drip hose? Magically arrives and gets hooked up. I need to clean out and hook the rain barrel? Done suddenly. I need cardboard  for sheet mulching? Boxes appear. I’ve started to try and be more careful about what I say so I have something to do!! \nI do not take the man for granted. Everyday he knows how lucky I am! \n\nMarry that man, right now!",
            "Looks like a synthetic twine, something like jute twine would give the plants more to hold onto and would be friendlier to the planet. But the construction and spacing looks great. I wouldn't be surprised if the peas are up and over that top in a few weeks!",
            "Good bf! He deserves a treat!",
            "What a star! So thoughtful",
            "Wonderful.  That's love.",
            "It’s time for marriage OP!",
            "Im chronically on reddit and some of those stories are just horrible so I think he did amazing and you have a good one",
            "Can I adopt the both out you bc my husband could but wouldn’t lol. Gurl if you’re just mentioning things and he remembers he’s a keeper 😉",
            "Give him some hawk tuah",
            "He did a great job!  However I'd suggest you secure the string to the fence. Maybe staple gun. Once the plants latch on and grow they'll get heavy and the string will become a mess. Especially when they're bigger and it gets windy, they can collapse and get messed up.",
            "He basically just proposed to you 😍",
            "This is the type of guy I want to be",
            "He’s a keeper",
            "Husband him up",
            "Great job on the trellis! Def a keeper!\n\nBut, front row is okra? You do know that okra grows to be a pretty big shrub, right - like 5 feet high and 4-5 feet across? You might want to move it while it's still young. I'd recommend at least 18 inches apart. We plant ours 36 inches apart in my community garden here in Houston.",
            "He's a keeper! 🙂❤️",
            "He's a keeper. Lucky girl, he did great.",
            "He’s a keeper.",
            "Thumbs up",
            "He’s a keeper",
            "He’s a keeper.",
            "He did a great job! 👍",
            "How sweet.",
            "Keep him at all costs.",
            "He’s a keeper",
            "Awww! He did a great job! 🔥🎉",
            "Heck with the trellis where did you find this man?? And does he have a brother?!",
            "He did wonderfully. That is no small amount of work.\n\nThat dude is a keeper for sure.",
            "Can he come build one for me? Lol, my beans aren't quite as far along as yours. My kid planted them as a project for the end of school, so the plant is still tiny.",
            "Keep him! A man who builds you garden things is a keeper.",
            "Good good man - there is love in that work of his.",
            "You have a darling boyfriend! Build a good fence around the two of you! That setup looks beautiful.",
            "May I please borrow your boyfriend?!  I promise to feed and water him and send him back home once my bean trellis is done! lol!  You found a serious keeper my dear!  What a sweetheart.",
            "Awesome.  You know how you have to thank him now. 😎",
            "He’s a keeper",
            "Even if it was a mess, he's a keeper for doing all that for you.",
            "Marry him. Immediately.",
            "It’s a great setup!",
            "Wow, marry him.",
            "Dang. I need me one of those boyfriends.",
            "Marry him.",
            "He’s a keeper.",
            "Is your boyfriend single? .... And gay?...\n\nAsking for a friend",
            "Aren’t you lucky?!  It like a beautiful dream. For you to just mention you ‘d like it & poof there it is! Great job 🏅",
            "Your bf loves you very much",
            "Y'all... I think this is my favorite comments section for a post ever for this community. Just straight silliness. I love it, I'm here for it.",
            "That's love right there.",
            "Marry him!!!!!!!!",
            "Treat him right, reciprocate hun. From a dude who is like this and never gets it reciprocated.",
            "He's bean a man of your dreams!",
            "In the future, if you don't want to trellis, try jade bush beans. They are very prolific and handle being planted tightly.\n\nI planted about 150 plants and plan on canning 50-60 pints.",
            "We need an update when you’re married 😂 this is too cute",
            "Keeper!!",
            "Give him a big hug and a little kiss.",
            "The fact alone that he did this immediately after you mentioned to him that you needed it is already a huge sign that he did pretty well. Marry him!!",
            "he sounds like knows his way around a bean 😉",
            "I love the enthusiasm, but that wire is over kill and will be pain in the arse to clean, if you get really hot weather it will stunt the plant growth by burning the tendrils, and it is easier to harvest with access to both sides of the vine. The best bet is a free standing A frame with strings or sticks that beans can climb. But next level system is definitely the 3 sisters method (corn, beans and squash) planted in sequence you'll be harvesting heaps with little effort.\n\nhttps://en.m.wikipedia.org/wiki/Three_Sisters_(agriculture)",
            "He did a great job! Very thoughtful and kind of him to do that for you. I really appreciate those who pay attention to what I say and like making me squeeeeeeee like a little kid. I LOVE surprises and anyone who makes that effort for the joy of seeing me light up with glee is a wonderful person who I want to be around as much as possible, y’know? He sounds absolutely lovely.",
            "Excellent \nThis boy knows what he’s doing!",
            "Did you say to him \n“Yeah Baby you did good”",
            "so good",
            "He's a keeper for sure",
            "Truely it’s a great construction, well done to him! Just be diligent in training the vines up the wire, if there’s gaps between the fence palings your beans will be visiting the neighbours!",
            "Looks good, great work! I..I",
            "He will do great plant husbandry for you!",
            "Lettuce pray for a long, happy marriage!",
            "That’s impressive! I thought it was fencing to begin with. Looks really good! Great job 👏",
            "Very nice!",
            "Daniel cremiuex",
            "So many green flags here!",
            "Fishing line works best. But, not bad.",
            "KEEPER!",
            "He’s bonafide.  He’s a keeper.",
            "Waaaaay better than I would have. He's a keeper.  🙂",
            "Thats truly a man who loves his gf. He did great, you should reward him with extra desert at dinner 😉",
            "Bee smart don’t string bean him along he loves ya girl",
            "You’ve greenery in you garden💚 You’ve green flag as a bf^^",
            "That dude is a gem.",
            "I would literally melt",
            "That'll do donkey. That'll do. ",
            "10/10 good bean trellis.",
            "Sounds like he’s a keeper!",
            "Marry that man!",
            "He gets ultra mega points for being so attentive",
            "Well done",
            "I need a BF that builds trellises.",
            "Looks great",
            "What a nice gesture!",
            "Wow! He may like beans too. Nice job!",
            "So you are saying you need a man.",
            "I just got that net type the other day, that stuff isn’t the easiest to deal with and he did a great job.",
            "Marry 'im.",
            "Good friend",
            "I think he did well.",
            "He's a keeper!",
            "Did really good!!! Very good",
            "It’s called webbing and great for season clean up you cut the string and pull out all the waste",
            "He loves you dearly.",
            "Mmm someone must have gotten some that night.",
            "Fantastic job. Enjoy your bounty.",
            "Awww he did great - so thoughtful- what a lovely thing for him to do for you !",
            "Divorce him! Oh wait this isn’t relationshipadvice",
            "Not so fast.  Look how he planted the potato.",
            "THIS IS SOOO CUTE I CANT wait to do this for my bf because he’s way more into it than I am; I’ve been trying to learn lately tho!!! I’d say impregnate him tbh",
            "He is a keeper!",
            "Keep him. 😂😂",
            "It'll work.",
            "Just awesomeness 👌",
            "„Yes Kids, and this was the day I decided to marry the hell out of your dad.“",
            "Keep that guy for sure!!!",
            "Good job no named BF",
            "He can tell us in the morning ;)",
            "I have a question. To whom dies the fence belong? You or your neighbor?  If your neighbor, you are on another person’s property.",
            "Looks good. If he wants to save time though they have pre made stuff cheap on TeMu. I used to make my own but it’s cheap and gives me time to do other things in the garden.",
            "Gaylord",
            "Is he African? It is well done.",
            "So if u dont like it take it down and put up something urself thats better",
            "They need to get married and turnip!",
            "Two peas in a pod.",
            "I came to say the same thing, that’s gonna be your husband 😊",
            "They’re going to have to have a big ceremony, they cantaloupe.",
            "Came in to say- husband material!",
            "I know what he really wants....... it's to listen.",
            "That's the goal 😂",
            "Pee in his butt YESTERDAY GIRL",
            "yes.",
            "🤣🤣🤣",
            "Him?",
            "He’s peacocking!",
            "Cannot agree more!",
            "Hooray for good partners!",
            "Nice!",
            "🤣 Wait, is this /r/aita? You forgot:\n\n\n-Evict him immediately!\n\n\n-Go No Contact! \n\n\n-Get a restraining order! \n\n\nand\n\n\n-Sue him in court!\n\n\n🤣 Have a great weekend, everyone. 🙂",
            "Marinara flags! 🚩🚩🚩🚩",
            "Ah ha! You just want a crack at him!  Leaf them alone! lol!",
            "He’s clearly gaslighting her by trying to be such a great boyfriend she can’t believe it’s real. Probably a narcissist.",
            "Clearly love- bombing. Big red flag. Can't be real, can't last. Run!!!\n /jealousy",
            "My loooong term bf & I alway use the gold star points in our house! Not that we actually keep count, but if he does something nice I tell him u get a gold star! U know what that means in a man’s world?",
            "Or a bee keeper",
            "Do you lend him out?",
            "I see what you did there…",
            "😏",
            "I read this quickly and it read to me as “I’ve been trying to get a new husband” 😂",
            "I would love that. I think I've found my community.",
            "This 😂",
            "Yepp!! I have to be incredibly careful. He says when I mention something we need around the house he has a rule-\nIf I've mentioned it once and he's already thought about it prior to me suggesting it then he gets it or does it the first time I mention. \nIf I mention something twice he knows I really want it done and he'll do it the 2nd time. Because now he's had time for \"market research\" haha \nAlthough I was not made aware of this until a year into it so I have become more selective of what I say. I love him spoiling me but I also like purchasing and fixing things around the house. He steals my thunder and I'm okay with that. \nAnd yes, I am trying to marry him!! Just waiting around for him to propose. Lol",
            "Yup not jute, divorce",
            "We will keep that in mind! Thank you",
            "Yeah, I did not know that. I may have been a bit chaotic with some of my seed placement this year as I've been learning. I'll take your advice and move them!",
            " I just joined this community not too long ago but the support has been wonderful. I've had so much fun reading these comments. Completely agree!",
            "Aw, I feel that. I went through several failed relationships and a marriage before finding this gem of a human being. I do reciprocate in whatever ways I can. I hope that changes for you in the future ❤️",
            "Will keep that in mind for next year. This is my first year gardening so I'll take all the tips I can get.",
            "I'll try my best to remember to update all you lovely folks!",
            "Flicking that bean on the reg",
            "I'm going to be trying the 3 sisters method next year! But for now we do have a 50% sun shade on the whole setup. I hope that helps when it heats up, thanks for the advice!",
            "I would rather spend the time making it than support a company like Temu [https://www.usatoday.com/story/tech/columnist/komando/2023/04/20/delete-temu-app-cybersecurity-expert-advice/11667796002/](https://www.usatoday.com/story/tech/columnist/komando/2023/04/20/delete-temu-app-cybersecurity-expert-advice/11667796002/)",
            "I think that emoji face is a happy face.",
            "You better be-leaf they will throw the best party. Clearly mint to be together.",
            "omg I wasn't expecting to see a comment like this in /gardening LOL",
            "https://preview.redd.it/3gwcblfvg08d1.jpeg?width=478&format=pjpg&auto=webp&s=e69f88597bb9111218fcfd1d4f7e563997d950ed",
            "u me 😉😫🍆🍆🍆🍆🍆🍆🍆",
            "It sounds like he watched VH1s Pickup Artist.",
            "Cut off lawyer, delete gym, facebook up",
            "Do not pass go, do not collect $200",
            "Also she needs THERA-PEA!!!",
            "😂😂😂",
            "It’s not about the Iranian yogurt!!!!!",
            "Ooh yes, if they’re doing this well with beans, imagine their stewardship of our little pollinating friends 🐝",
            "Haha I meant to say trellis 🤣",
            "Pssssh girl, it’s 2024. You want that man… you propose!!",
            "My sister's company won't let her use Temu, or employees could be terminated as she handles work stuff on her phone. They've had so much sensitive information stolen, and she doesn't even work for the government.",
            "Thistle be a great day 🙏🏼",
            "I was lowkey nevrous to post it because i know certain subs can be touchy about silly jokes. so im glad everyone took it well",
            "If she has to handle work stuff on a phone they should provide her with a company phone.\n\nIf she leaves the company how are they going to make sure everything work-related is erased? What if her phone breaks outside of working hours? Or gets stolen?\n\nI don't know the laws there but they shouldn't be able to tell her what to do with her personal phone, if they want to control what apps are there they should give her one.",
            "I wonder how long they’ve bean together",
            "Lettuce speak now, or forever hold our peas.",
            "Please, I need more. This is my kind of humor. First thing I've laughed out loud at all day!",
            "It actually made me burst out laughing!  I appreciate it.",
            "LOL I love when chaos gardening extends to the humor.",
            "She does have one, but if she is out and about, she doesn't want to have two phones on her. I also have a work phone and will take calls and respond to work emails here and there. \n\n>If she leaves the company how are they going to make sure everything work-related is erased?\n\nNormally, you do an exit interview and have to hand everything over. You're not allowed to keep company records, and they suspend your old work account.\n\n>What if her phone breaks outside of working hours? Or gets stolen?\n\nYou sign a contract stating you are responsible for the phone and that you will continue to meet compantpolicy. Most states are at-will states and can fire you for any rhyme or reason. Also, they are stealing credit card information. It protects her just as much as it protects them.",
            "This thread is exactly why I love gardening Reddit\n\nSeriously, OP. You’ve got a keeper.",
            "Let’s not squash this budding relationship.",
            "I posted it and went to work- came back to amazing comments on my lunch break. I knew I loved him and that he's wonderful but seeing other people recognize it puts such a smile on my face! He truly is a keeper.",
            "Water y’all talkin about? These tucan cantaloupe in Vegas and live in a cabbage in the mountains, make sure to take a bunch of photosynthesis and post them on snappeachat",
            "Still, i’d hold out for a full carrot.",
            "A beeee keeper 🐝"
        ]
    },
    "First time growing Cherokee Purple, anybody know what's going on here?": {
        "title": "First time growing Cherokee Purple, anybody know what's going on here?",
        "score": 842,
        "url": "https://www.reddit.com/gallery/1dlhs7t",
        "content": "I have six plants, the other five look relatively similar to each other and only have one of the big flowers in the middle; this looks like 3 fused together, and I counted 29 flower buds in that cluster around it/them lol.",
        "num_comments": 257,
        "comments": [
            "The flower is fasciated. It's a growth abnormality.\n\nYou will end up with a very interesting tomato.",
            "Almost thought you were growing some sweet kush from that first picture",
            "OP if you can afford it, take off the rest of the blooms from that plant and let it focus its energy on that mammoth specimen.",
            "you will get the ultimate legion tomato out of that.",
            "Flowers are fused. This happens a lot in beefsteak type tomatoes. That's part of the reason they can grow so big. Sometimes you get multiple fruit fused into one. I don't think I've seen an example that extreme before though. It would be interesting to see what turns out of that, but it would probably be a drain on the plant and the rest of the fruit.",
            "Check out r/fasciation!",
            "Now you just need Cthulhu to come pollinate it",
            "You have to post what it looks like!",
            "I am fascinated by this tomato fascination!",
            "Ooooh I can’t wait to see. I couldn’t grow Cherokee purples for shit last year and now you’re going to have a giant alien baby one.",
            "I can’t wait to see the final product.",
            "Make sure each of those flowers gets pollinated and find the number for Guinness World Records.",
            "The jackpot of all mutations?",
            "One tomato to rule them all",
            "A lot of the first blooms on heirloom-type tomatoes fuse like this. Not sure why. Sometimes we pinch, usually we don’t have the time. It’ll level out.",
            "[removed]",
            "If this actually ends up producing, you have to post it! I’ve had fasciated tomatoes before, but none with the potential to be this wild and crazy looking.",
            "That is a fused blossom and those type blossoms are the holy grail for competitive growers. Lightly flick it daily, or gently tickle with a q-tip and pollinate that thing to the best of your ability. And then get ready.",
            "super invested in how strange this tomato will look.",
            "That is some amazing fasciation. Heh.",
            "Isn’t there an update me bot? We really need to see what happens.",
            "I'd just pinch it all and let others growth go. If that's an opinion.",
            "Why is it I've never encountered fasciation IRL but it's always on Reddit?",
            "Please please please update us with the pictures of that tomato. I actually bought a cherokee purple plant today at the request of my son who saw Adam Ragusea saying he likes them so now I’m so curious!",
            "Wow thats the biggest mega bloom I’ve ever seen.  If all those flowers are truly fused together, I’d make sure that gets pollinated properly and remove every other flower/fruit on the entire plant. You could end up with a monster sized tomato. It would be very interesting to track its progress and watch it develop. Its an opportunity for a record. 🤩",
            "Who else totally thought this was weed?",
            "Megabloom....MegaBLOOM",
            "Swear on my mom I thought Cherokee Purple was a new strain and some weirdness was going on with your buds.",
            "OP. I don’t know what’s wrong with your tomato plant but I have genuinely enjoyed reading your witty comments to other Redditors. Keep doing (not the Lord’s work) and living your best life. \n\nBest of luck with the tomatoes! I’ve felt like a bad ass for churning out a bunch of cherry tomatoes. These Cherokee purples look like monsters.",
            "I'm all riled up for the absolute freak of a tomato that flower is going to produce",
            "The Old Ones have blessed your garden.",
            "Thats going to be a MASSIVE tomato. You better make sure the calcium in your soil is good and you probably need to support that tomato when it gets large.",
            "Well, y'see what you've got there is some yellow.  That's yer problem right there, op, is that you think you're growing purple but you're actually growing yellow instead.  Vary common rookie mistake there, planting yellow instead of purple.  If you really want to guarantee yourself some purple next season what you want to do is plant some red and some blue together.  Start from the ground up, I always say.",
            "That is going to hopefully be a very large, strangely seamed tomato",
            " Mutant!!",
            "You should share the photos with your state’s extension service!  They may want to document it!",
            "I’ve been growing CP. tomatoes for 6-7 seasons and have never seen anything like this! Very interesting.",
            "I grew them last year. They did this. Growing them again this year and they are doing the same thing.   \n  \nThe tomatoes are awesome. My favorite by far, no competition.",
            "Interesting. I've never seen that before. I grow about 10 Cherokee Purples each year.",
            "Fasciation",
            "Dude, you should prune every single flower on the plant so that the tomato will make one enourmous crazy looking tomato. What’s coolest - another typical boring tomato plant with a tiny weird part or the internet fame that will come from your abnormality?",
            "Looks like you bred a new strain.",
            "Mutant. I’d pluck it as your tomato will be weird too",
            "r/fasciation",
            "My god I love Cherokee purples. I had many clients that grew them and when I was working for them they would encourage me to eat a few. It’s a standard in any garden I have.",
            "I need to see how this grows, keep us posted OP.",
            "Omg following. Please share updates!\n\nI thought this was cannabis at first and I was excited about that, but now that I see it’s a tomato plant, I’m on the edge of my seat.",
            "I've waited my entire life for this post.  👀\n\nPinch the smaller blooms and grow it out.  You could have a world record contender!  I call it a 'megabloom' and is basically several ovaries fused together.  Will probably abort partially but you never know.",
            "Do you live near an airport or an area with radioactive activity? I've seen radiation have effects like this on plants, even in low doses. Clover near airports often have 4-6+ leaves instead of three for this reason. \n\nYou might invest in radon detection or a radon meter.",
            "Weirdness, for one",
            "I believe this is a crested mutation",
            "Wow, please keep us updated... imagine the crop.",
            "It happened to my tomato plants last year, and yes, it ended up being mega tomatoes",
            "Cherokee purple are my favorite to grow they’re so pretty",
            "Aren’t these the best tomatoes????",
            "[deleted]",
            "r/fasciation would LOVE this",
            "[removed]",
            "ooh i can’t wait lol",
            "a cold snap did this to mine last year. none of the deformed blossoms ended up maturing very well",
            "Looks like space weed!",
            "Mega bloom, I’ve only seen one other post like this, you’ll get a huge tomato from this, what luck bro",
            "Looks like Cherokee Green and Yellow to me",
            "The Cherokee Purple is one of the best tasting, meatiest, most perfect for everything tomato that ever tomatoed. Mine are doing this too, this year. At least 4 out of 6 are.",
            "Kill that flower cluster. It will be a really fucked up tomato and suck up most of the nutrients",
            "You gotta show us the tomato that grows from that!!!!",
            "You have summoned the void.",
            "Very interested in the answers here, as my ananas variety has a similar flower, albeit much smaller\n\nhttps://preview.redd.it/gih4zp42p28d1.jpeg?width=2448&format=pjpg&auto=webp&s=07fc9010da2b6a4c88d7f16dabca738c98692ec0",
            "That's an orgy.",
            "ive never been good at really identifying it, but does anyone think it could be aster yellows? \n\n\njust a guess, I know mutations do happen for other reasons but since it is on all plants I wonder if it might be a disease.  I have seen this before especially on  some monarda and it is only mutation \n\nhttps://extension.umn.edu/plant-diseases/aster-yellows#sources-3208560",
            "My CP’s have never done this but I’m fascinated.",
            "I’m growing some Cherokee Carbon hybrids and my first flower is looking like this too! So interesting! The rest of the flowers coming in look normal.",
            "I need to see this update!",
            "It's a triploid?",
            "That will be the ugliest, meatiest tomatoes you’ll probably ever have lmao I’d keep it",
            "https://preview.redd.it/7jaf2z6y848d1.jpeg?width=2008&format=pjpg&auto=webp&s=0945fbcdfff8540881471ee7f85a39abfda0583c",
            "Cherokee Purple are my favorite tomato. You will love them",
            "I had about half of my black Krims (roughly 60 plants) fasciate like this. Never seen it before in tomatoes, and now here's a photo of it on Reddit too!",
            "I having a potatoes plants in my back yard and I have a YouTube Channel name is Samra’s wonderful Organic garden😁",
            "Right on. It's a freak like me and it's now my favorite plant.\n\nEdit: I should have thought about that more, there's another plant I really like, at least equally.",
            "I have one growing like this as well and I’m SO excited to see what crazy mutation is gonna come from it",
            "Fascianating 🧐",
            "Not tomato related but SO many of my daylilies were fasciated this year. I’ve never seen anything like it",
            "I always want it to be fascinated. \n\n(It so rarely is)",
            "And fascinating.",
            "Fasciated plants are my favorite!",
            "Hopefully a new Loewe tomato!",
            "That’s assuming it will even grow into a tomato.",
            "I've had cannabis do this also.",
            "Or some amazing smoke...",
            "How can you tell a plant is fasciated vs having witches broom typically?\n\nI grow more cacti but do some fruit and veggie gardening as well and haven't ever seen broom or a fasciated plant yet.",
            "Cherokee purple are VERY prone to fascination in my experience. Always have several that do that",
            "It reminds me of that movie Annihilation.",
            "Ya.. I thought they were saying Cherokee Purple is weed strain now too. 😂",
            "In due time my friend.",
            "Me too.",
            "I've seen an adnormality exactly like this with some MJ plants. The flowers never mature they just keep growing new ones.",
            "I'm glad this wasn't just me!",
            "same! 😂",
            "I mean I can afford it I just don't want to pull off flowers dammit 😫 \nBut maybe I will who knows, anybody's guess. I have it on pretty high authority that I'm a dumbass and easily influenced.",
            "That would be cool. Normal tomatoes are boring. Like I don't need a hot tomato on my arm to feel like a real man, but I am a sucker for the exotic if ya know what I mean.",
            "I'm hoping for something like a sea cucumber, does that seem reasonable?",
            "Ha I didn't know that was a thing!",
            "If it survives I will! I literally have no idea what I'm doing, I planted seeds for purple stuff and they grew 🤷‍♂️",
            "But are you fasciated by the fasciation?",
            "Maybe it will be big enough to have four or five catfaces, catfacing is super popular in my garden.",
            "Does that toothbrush thing actually work? So far I've had hardly any blossoms just drop off and pollination seems pretty rad, I feel like maybe I should just let nature kick ass.  I planted marigolds, lavender, and sweet peas and I always see bees out there.",
            "Or we don't know anything about pinching so we didn't pinch.",
            "[removed]",
            "This is generally the same advice I give my husba… ooooop wrong sub",
            "That's literally what I said when I saw it. \"Heh.\" Then I took a dramatic pause because the crape myrtles were eavesdropping, and I fucking said it again.",
            "I wish I could make it go faster but it's only been a couple of hours since I posted that.",
            "It is a valid opinion",
            "Yeah, when I decide to megabloom I like to really go for it you know, it's my Triple Lindy",
            "It seems a lot. Wishful thinking is allowed until I'm allowed to grow.",
            "It would be Grandaddy Purple and.......something",
            "🤣 thanks. My sungolds are all perfectly normal, my black krims are about 50% catfaced...",
            "Vary sensible.",
            "I prefer to call her blossom-challenged, and she's very special.",
            "Do you think it's that unusual? I'm getting the impression that heirlooms just do this sometimes.",
            "What tiny weird part?",
            "I denounce your eugenics.",
            "It has friends now 😶",
            "Depending on your savory/sweet preference they can pair well together.",
            "Tomato Octomom",
            "Not near an airport. I have radon detectors in my house but not my garden.\nI may have been displaying some toxic masculinity or something when I handled it. I mean you can try your best to talk to your plants but sometimes the damage is done, ya know.",
            "I don't know! Never even had one before.",
            "Ha!",
            "I may pop over there, shake my tail feathers",
            "Mmm yes. That would take knowledge of plants, of which I have none now so I certainly didn't at pinching time. I was raised to lay down in abortion clinic driveways so killing those baby tomatoes causes a deep moral conflict for me.",
            "Well now the cats out of the bag, thanks a lot",
            "Got a couple more too",
            "So which of us is colorblind? We'll never know.",
            "See, people need to stop blaming my toxic environment.  I'm trying to be better ok.",
            "No.",
            "Oh ima show you.",
            "Probably attracted to the void inside of me. My void is voidier, which creates a simple vacuum.",
            "That does look similar!",
            "Georgia O'Keefe's kids have let the brand deteriorate. It used to be classy and suggestive and now you just have this gonzo smut.",
            "What if it's a juicy delicious disease though?",
            "Mine are copycats",
            "Tomatoes be weird like that I guess. Like all of my Black Krims have lots of nice fruit growing, but every one of them has a huge scar on the bottom of just the first one. All the rest are smooth.",
            "Only update so far is that I think I have 2 more 🤔",
            "It looks like 3 side by side. I have another with two, and yet another that looks like it might fuse 3 again. I can't decide if I'm the tomato God or tomato Satan.",
            "I got another one I think",
            "Please post a photo update! 🍅",
            "Pinch all the other regular flowers to concentrate all the plants' efforts on the fasciated one. It will be effing enormous. You might have to devise a contraption to keeping from prematurely falling off the vine, but boy, would I love to see that. Plsplz baby this thing. Water consistently every day to avoid splitting. Gonna be a monster.\n\nEdit: autocorrect",
            "I was about to suggest you post on r/trees until I zoomed in 😂",
            "Yes, please let us see what happens. For science.",
            "I resonate with your comment 💯 please keep us or at least me updated. For better or for worse I’m really curious",
            "Lmfaooooo iktr 🎏",
            "Don’t cha?  Don’t cha baby? 🎵",
            "Assuming your other favorite plant is cannabis, it can fasciate too.  Years back I was doing some seed trials of a new cross for a breeder friend of mine, and one of the phenotypes was particularly prone to fasciation.",
            "\"freak like me, freak like me\" - santigold",
            "Im truly interested in this as well. I must know.",
            "RemindMe! 3 months\n\n\nI gotta see this freaky tomato!!",
            "If something weird like this is happening with a tomato, it’s probably a Cherokee purple. #thekingfreak",
            "Following for update on super awesome 🍅",
            "Lol were you worried about the other plants feelings? I do that!",
            "That's awesome! It's great to find a new favorite plant that resonates with you. It sounds like you have a couple of contenders now—always good to have options!",
            "Then you’re going to like r/fasciation :)",
            "Got that Cherokee Purp!",
            "I hear growing weed is a lot like growing tomatoes.",
            "Like cauliflower",
            "I selfishly want you to pare it all back cuz I wanna see the end result.",
            "Do it. Do it. Do it.",
            "Do it for science!!!! 😂",
            ">But maybe I will who knows, anybody's guess. I have it on pretty high authority that I'm a dumbass and easily influenced.\n\nFelt!!!",
            "They are kidding, do not do this",
            "You do you with your property. \n\nBut for maximum success here..  choose normal or monster.",
            "You know what you have to do. But do you have the courage?",
            "Never know, they usually end up kinda funky looking. Only time will tell.",
            "Those flowers look really tight, so lightly shaking it or batting it would likely let enough roll around it the flower, if the bees are around though their wings sort of do that for you.",
            "I just flick them and my plants are loaded right now.",
            "😂",
            "Gotta watch them Crepe Myrtles,  they like to gossip.",
            "Try harder!! 😂",
            "If you know you're spot it's easier to know how to treat your plant",
            "Oh hell. I have big dreams of a vegetable garden soon but I might stick with cherry tomatoes based on your luck. The bigger the tomato the more difficult to grow? Sure seems like it!",
            "I suppose.  My mistake.  I find it fascinating & unique tho - thanks for sharing & good luck!",
            "Agreed!!",
            "Coffee came out my nose. Thank you! 🤣",
            "I said \"usually\", not that it had to be done... Check out the link, tells you some things you can do when they occur",
            "Out of the \"bag\"",
            "it’s probably nothing but if you want good fruit i would remove it.  the plant may be putting a lot of energy into it.  or, keep it for the curiosity",
            "YES.",
            "I freekin love how excited you are. r/gardening people, y’all make me so happy.",
            "Ooh, and when OP does, panty hose will work to keep it suspended safely. Just tie that to a stick or a pole or something.",
            "There is no N in fasciation 🙂",
            "Cherokee Purple? I never heard of that strain. Like the ?…..oh yeah, tomatoes",
            "lol same😂",
            "Well my overall plan that's worked so far is walk out there in the morning while I drink coffee and go \"they didn't die and nothing ate them, my job is done here.\"\n*sip*",
            "It's tied to a stake so technically it's a freak on a leash.",
            "They're indifferent to my freak flower so they're dead to me.",
            "We call it Churps on this side of the reservation",
            "Fact",
            "Can confirm",
            "Sir or ma'am, with all due respect I went to a Christian school that my parents and their friends started in the basement of our church. THEY told me science and government aren't real. I feel so conflicted.",
            "Science! Science! Science!",
            "Are they though? I'm beginning to suspect that they don't actually care about me and my own tomato feelings.",
            "Augh I don't know! Part of me wants to see how many of those turn into tomatoes and part of me wants to make it a 4H biggrest tomato at the state fair project. But no, I couldn't GO to 4H because I was a city kid and they didn't want me there. Uppity farm kids.",
            "That seems easier.",
            "I stared at it with a stern i-mean-business look for a good 15-30 seconds this morning, I'll see what that does to the attitude.",
            "I guess it depends how you define difficult 🙃 I ain't working hard, I just watch what happens",
            "YOLO",
            "I used to do it professionally and the best part was seeing the joy I brought to my customers when they saw their new gardens. Especially the ones who didn't know any gardening and were expecting some basic lawnguy job (yes, offense to lawn people, you all suck)",
            "A cute little hammock with a giant tomato",
            "Maybe an old brasiere I've used the to hold my vertically grown cantalopes.",
            "Autocorrect doesn't like that",
            "Sure, there’s one at the end.",
            "I had the exact same thought process!",
            "Cherokee Kush?",
            "Cherokee Hazeeee lol",
            "I hope more people post on that sub. I'm in a current transiting sub and it's annoying",
            "You garden like I do except beer instead of coffee, and afternoon instead of morning. I mean, we're practically twins!",
            "I switched from Roma tomatoes to Sungold, and the ability to ascribe to this type of morning routine is so relaxing. Granted, it’s been raining enough that I should probably be building an ark as well, that probably helps.",
            "A follow up with the final results of even progress pictures would be great!",
            "I'll start jamming to that every time I stake up a word plant in the future. Thank you.",
            "😆🙏🏆",
            "Then do it for Jesus!",
            "Well isn't THAT special. ⛪",
            "My favorite science class was always Bible study!",
            "If anything, you should be removing the “superbloom”, but it’s up to you. They take a lot of energy to produce big zippered fruit that isn’t as good",
            "You can come to my 4H club. We smoke the devil's lettuce and anyone who beats us in competition gets a flaming bag of dog poop on their porch!",
            "🤣 I’m too anxious to wait and see what happens. Wish I could adopt this attitude!",
            "I worked in several of those “landscape” jobs when I was younger (we just mowed and occasionally threw plants/mulch in places).  It was when I worked for an older lady who didn’t do any mowing, just flowerbeds very, very meticulously that I realized how true this was.",
            "Mow water weed....I mean they suck right?",
            "Hey Siri- you’re not helping.",
            "NVIDIA begs to differ.",
            "True! 🤣 there’s ONE N in fasciation",
            "Me, too, and I've grown Cherokee Purple tomatoes in my garden for years",
            "I'm both of you! Stumble out in the morning half awake with the hose for watering. Come back in the afternoon with a beer and pick the weeds, prune, pick, and straighten",
            "What’s rain? I’m on the east coast and it’s been so long since we’ve had any precipitation.",
            "My sungolds are going crazy, about a hundred green ones and hundreds and hundreds of flowers. All six  plants have at least two sets of fruit and 5 to 10 more sets of flowers.",
            "You just used the Lord's name in vain and now my plant is gonna die, I hope you're happy satan worshipper",
            "Our preacher did a whole sermon on the evils of watching SNL. 😒",
            "Especially the part about people and dinosaurs chillin' together. The earth is only 10,000 years old you know.",
            "Zippered is in the eye of the beholder.",
            "I can roll with that",
            "In my gardens, if you mow, you go (away)\nEpitome of Dunning Kruger.",
            "Ride so they blow their clippings in the garden beds, pull things that aren't weeds, butcher arbs, make mulch volcanos..  yeah they suck.",
            "This is me, except with wine in the afternoon...and the dogs snapping at the watering hose.",
            "I have always been told to water in the evening,  something about watering before high temps being bad",
            "I don’t think growing plants in the lords name is part of the blaspheme they talks about. Iirc it’s pretty specific about using it as a lie or swearing on it thru a lie or something",
            "I've always done morning, so plants aren't sitting in wet soil overnight with no evaporation. Can avoid root rot or fungal growth. Morning watering gives evaporative cooling to the plant on hot days too\n\nMy container tomatoes get both, the thirsty bitches. I also forget morning watering about 30% of the time so they get watered whenever",
            "Totally joking. It's easy because religion is a joke 😀",
            "😂 couldn’t agree more"
        ]
    },
    "Look at them. ": {
        "title": "Look at them. ",
        "score": 1560,
        "url": "https://v.redd.it/x2q8lmif1z7d1",
        "content": "Loving the magnolia! ",
        "num_comments": 61,
        "comments": [
            "My favorite is the bee on the bottom left who gets in there, flips upside down and starts rolling around 😆 reminds me of my little dog when he finds something stinky to roll around in outside",
            "It's crazy that Magnolias are older than bees. They developed the large waxy leaves and petals so that they could be pollinated by beetles before bees existed.",
            "Love seeing some reasons why ancient things like a Magnolia are still around",
            "I too would like to roll around in a magnolia flower",
            "I can smell Memaw from here!\n\nSide note I have a love hate with my magnolia tree. It’s beautiful but so messy: first it’s the leafs, then the flowers, then more leaves and then the seed pods.",
            "Absolutely lost in the sauce.",
            "Crackheads",
            "Last bee gets freaky",
            "Par-tay!!  Bees are the best.",
            "I’m so jealous! My area is too populated, so I might see an average of one bee a week :(\n\nAt least there are plenty of butterflies around",
            "It looks like the bees are carrying off little match sticks... i see that it's a magnolia, can someone fill in the blanks for me?",
            "Wow where is this located :)",
            "I had a magnolia tree in the yard of my childhood home, such sweet memories with these trees. The flowers smell amazing.",
            "I have a dwarf magnolia. It’s just enough.  I would never plant a large magnolia anywhere on my property ever.\n\nA little dwarf one is so perfect. It’s the same size.  It has now started flowering here and there.  Two years ago, I had one flower.  Last year I had two and this year I had more.  It’s a pretty nice looking tree.",
            "My 38 acres in se Georgia has several volunteer magnolias growing on it. Still waiting for blooms on most of them.",
            "Busy bees.",
            "Damn i wish magnolias grew where i live!",
            "I’m so jealous! We only got 3 blooms from ours before the squirrels ate the rest of the ones getting ready to open up. Now beetles are destroying the leaves. 😭",
            "Even my baby magnolia tree was swarming when they bloomed. First time owning one.",
            "I spent a second wondering why all those match sticks were in a flower",
            "Very busy indeed",
            "Last bee looked it was in ecstasy",
            "They’re so happy!",
            "This one is safe for work.",
            "We tried to grow a magnolia and accidentally over watered it 😭",
            "so cuuuuuuute! they are so happy!",
            "What was that last bee doing?? 😳",
            "My yearly reminder to buy a magnolia tree",
            "Happy as can bee 🐝",
            "❤️magnolia",
            "Look at these filthy little addicts, so buzzed they can't even fly in a straight line.",
            "👁️ 👁️",
            "Going AFTER it!",
            "Lost in the sauce",
            "He's rolling around like a sugared up kid in a ball pit!",
            "Now it's New York's hottest club\n\n\nFirst found by the esteemed beetles, the bees have continued the legacy of keeping the Magnolia the hot buzz\n\n\n*insert Stefon mouth cover*",
            "Happy honeybees make me smile!",
            "No shit that’s super interesting thanks for that lol",
            "Beatles? Are those strawberry field magnolias? Coo coo cachoo!",
            "I planted several magnolia trees and shrubs when I bought my place 12 years ago and I’m so glad",
            "I didn’t realize they’re ancient! I want to plant so, so many.",
            "That’s all I ever want to do for the rest of my life.",
            "They smell so good! Bee ecstasy.",
            "Memaw! 🥹 \n\nI agree. Seeing this gave me another check on the “love” list.",
            "Yeah I grew up in a house with a magnolia tree near the driveway and I have sworn to never have a magnolia on my property. It was my job, of course, to clean up under the magnolia. So annoying.\n\nAnd of course I twisted my ankle a couple times on the seed pods while I was playing basketball.\n\nI did like pretending they were hand grenades though.",
            "😂",
            "I lived in relatively central London and still saw many bees. Where there are flowers, there will be bees :)",
            "They look like stamens to me:\n\nhttps://preview.redd.it/6ydham2kl08d1.jpeg?width=454&format=pjpg&auto=webp&s=f5e06257951004bedbfaa8e1c1c074359f2e1715",
            "Southwest Virginia, USA",
            "My house is almost a constant 65 to 75 degree year round, outside is colder. I bought a magnolia alba tree for shits and giggles. And theres actually alot of flowers, my house smells like the flowers. Its just in a big pot.",
            "Very excited",
            "It’s got everything…",
            "I live in Riverside, California, US. So many people feel as though bees are pests, so the bees generally stay out in the fields and hills. We still get pollinators, but man I’d love to see this kind of bee activity",
            "are they freaking kidnapping and stealing the stamens? Screw making multiple trips for the pollen, lets just bring the whole flower back home! The queen will love me now!",
            "Rub it in why don’t ya 😜",
            "Sidney Applebaum",
            "wait WHAT!? People think \\*bees\\* are pests? That's genuinely baffling to me. Like... do they not know how food works???",
            "Roman J Israel Esquire.",
            "lol yeah, southern Californians are a very different breed. I’ve seen it in many cities, honestly. Once people are surrounded by housing tracts, shopping centers, car lots, etc, they start to define a pest as “any living thing that even slightly inconveniences me.”\n\nMost of these same people will actually admit how useful & necessary bees are to life on our planet. But…”can’t they just, like, live on a farm or something?”",
            "MTV’s Dan Cortese",
            "God that's so sad. I guess that's what happens when you pave over all the nature – people forget it's supposed to be there. American cities are concrete wastelands istg."
        ]
    },
    "Little snack tray from my berry garden": {
        "title": "Little snack tray from my berry garden",
        "score": 52,
        "url": "https://i.redd.it/iqwbv47eg48d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Can you name them all please!",
            "This looks so well curated!!!",
            "Clockwise: Black raspberry, yellow raspberry, tayberry, blackberry, polarberry, purple raspberry and then in the middle: red currant, jostaberry, black currant and wineberry."
        ]
    }
}