{
    "Welcome to /r/Genshin_Memepact": {
        "title": "Welcome to /r/Genshin_Memepact",
        "score": 2466,
        "url": "https://www.reddit.com/r/Genshin_Memepact/comments/j77d3k/welcome_to_rgenshin_memepact/",
        "content": "dank memes only.\n\nhave fun and enjoy!",
        "num_comments": 65,
        "comments": [
            "Hello Genshin r/0sanitymemes...\n\nJokes aside, thank God because the main sub is just filled up.",
            "Can I just say that this subreddit is my god damn happy place instead of that ***other shitty*** subreddit (y'know, the umm.. official genshin reddit page. Yeah fuck that! I'm staying here!)  \nLove the memes people post here. And a super massive thank you for creating this subreddit!",
            "There are some solid memes on this subreddit. I wish they got more traction.",
            "are there any gentlememer rules about ripping on the mainsub? i badly want to but i don't know if it's thought of as bad taste?\n\nsee r/FFXIV vs r/ShitpostXIV",
            "Ah yes the fun one",
            "Seeing as how I can't get into the main sub to ask this CAN SOMEONE HELP ME GET A MIHOYO ACCOUNT SO I CAN PLAY THE DAMN GAME? Their stupid website wont load on any of the browsers. What am I supposed to do?",
            "This sub has turned into a tier-list memes sub :/",
            "Don't mind me, I just felt like appearing in this post's replies.",
            ":)",
            "[deleted]",
            "I've come from the other reddit and just want to ask can I post pictures of a summon I did as the other subreddit doesn't let me",
            "Holy shit, we can comment here again",
            "Heyyy",
            "funny how i didnt find a single bug yet lol",
            "Also, fuck the main sub. The moderation team is very inconsistent in what constitutes as fluff. Garbage team.",
            "Hi",
            "The Mihoyo website will not load up. I get nothing but a blank screen.",
            "Why can't I post",
            "Yoo thanks, hello",
            "Someone help me find that meme where Venti is rhyming about Signora! HALPPPPPPP",
            "I can't post?",
            "Can I post a hilarious interaction between 2 GI RP accs here?",
            ":D",
            "Can you enable text flairs so I can change mine to \"f2p btw\"",
            "J",
            " We love memes!\n\nI'm sure there's thousands already made, but we're starting a new one with lots of cool features including Klee Bot.  \nWe have Giveaways starting soon, Movie nights, Karaoke nights, etc.Co-op channels, Build channels. You name it!  \nAnd if we don't have what you're looking for? then we'll cater to you, 100$ guaranteed!  \nWe definitely also want you to feel welcomed <3\n\n[https://discord.gg/RFZumfPXhY](https://discord.gg/RFZumfPXhY)",
            "New here!\\^^ Hello everyone!",
            "Yes",
            "666",
            "I came to the right place. Now....where to find seductive drawings of Zhongli....",
            "did zhongli get a buff?? I mean in the last 24 hours?? Yesterday my super only did 3k, now it does up to 16k",
            "Hello, i wanted to post a link to a youtube video of my gameplay, but considered appropiate to ask first if it would be wellcome since it contains no memes",
            "Help with coop challenge\n\nHey, would anyone be able to help me with today’s treasure hunting co op challenge (fight 2 fatui agents in 30 seconds?)\n\nI legit am unable to clear this in time :(\n\nWilling to make long lasting online friends as well :)\n\nMy ID is 808076059 Asia server",
            "Why i cannot change my flair",
            "Ayyyeee HU TAO BABYYYYYYYY \n\nhttps://youtu.be/2pV26VY0fTk",
            "Sucrose. Its sucrose. Put me against any abyss mage and their shield will be broken in seconds",
            "Hi, I get notifications on this subreddit, but I didn't join. How do I stop the notifications?",
            "Did the xiao banner leaving video that had scenes from honkai impact 3rd get removed? Wanted to show that to a friend since they didn’t get xiao anyone have a YouTube link. \n\nIt’s the one with what people called someone named seele",
            "To you all meme makers, do you guys like, crack or buy Photoshop  or use free alternatives? Just curious because I can never get good image editing with Paint 3D",
            "How to block this.",
            "Could we ban political stuff in this sub? I come here to get away with all the political crap and focus on Genshin memes only thanks",
            "Is the Anemo treasure compass a one time use thing? I want to make one but the amount of materials it needed is too much",
            "Don't think I should be making a new post just for this so I guess I'll ask here.\n\nAny captain know how did the dude in the meme for average \"blah blah\" enjoyer/appreciator come about?\n\nAny sources?",
            "Please make it so people can't post lore spoilers at least until they comes to na server. I'm tired of waking up and going on the subreddit and suddenly everyone is talking about how traveler dies in event or whatever it is",
            "I've been here before the end of the game?!.",
            "If your post is still undergoing moderation after 2 days, does that mean it's been rejected?",
            "Hi, I'm new, say hi!",
            "Have I seen you before?",
            "Y",
            "Honestly I don’t know what there’s doing with the main subreddit. Every post gets an auto modded message almost. Memes are not even allowed anymore, so are pictures or clips from your gameplay... even if you post a question, you have to mail the fucking mods first?? Wtf, they really made that subreddit wack real fast",
            "Yes thats a shitty depressing and toxic hellhole",
            "*You are goddam right*",
            "are you on mobile? i just tried chrome on win10 and it was fine. maybe try through a proxy? [delete cache on chrome](https://support.google.com/accounts/answer/32050?co=GENIE.Platform%3DDesktop&hl=en)?\n\nalso, just in case, you create an account here: [https://genshin.mihoyo.com/en](https://genshin.mihoyo.com/en)\n\nclick top-right \"Log In\" then \"Register Now\"",
            "now it is GENSHIN TENNIS",
            "Ok",
            "It have 7.48GB in-game download",
            "You can because the mods don't care about the sub, but you shouldn't. It's not a meme, it doesn't belong here.",
            "Y'all are lucky to have such good artifacts.",
            "Y'all are lucky to have such good artifacts.",
            "Gimp is sufficient bruu",
            "It's been 2 weeks and I think my question about team building still wasn't approved",
            "Yet the sub is filled with memes, even tho it's supposed to be serious topics only. More toxicity then ever. More butthurt people then ever. That sub is just pure cancer now.",
            "Alright thanks for clarifying",
            "No problem. Hope you enjoy your stay here mate."
        ]
    },
    "I am sorry, my dear team but Fontaine is next then Natlan.": {
        "title": "I am sorry, my dear team but Fontaine is next then Natlan.",
        "score": 418,
        "url": "https://i.redd.it/kn033d96928d1.png",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Who's the one between Mona and Ayaka?",
            "Almost tear my eyes out exploring Sumeru 😭, unfortunately need primos for furina",
            "Exploring the entire region 100% is much longer than Archon and Story Quests.",
            "Don't worry guys the desert is so much quicker to max than the rainforest",
            "This is literally me farming primos to do more pulls before Clorinde's banner goes away lol. I recently 100% Petrichor and the past week I've been doing the Sumeru desert WQs (Jeht's storyline)",
            "Ayakers",
            "Are the two boys Xiao and Kazuha?",
            "Me with Xianyun: hah. peasant",
            "Don Sombrero corroding into pixels.",
            "On my end, I see a little silhouetto of a man",
            "Took me 2 years to find that last aranara.",
            "But underground system sucks.",
            "I actually used her but forgot to put it",
            "scaramouche, scaramouche, will you do the fandango",
            "🤣 same I understand the pain",
            "Sameeee!",
            "At least you have an ingame map now. I didn't back then.",
            "True but at the same time I got 100% exploration just by doing the world quest",
            "Imo shes the best one when there is any elevation",
            "thunderbolts and lightning, very very frightening me",
            "Oh god I remember how painful it was exploring the underground sections without the in-game map when the desert area was first introduced. I never wanna experience that type of hell again"
        ]
    },
    "screw which mains subreddit has the most members, get ready for which mains subreddit has the most subreddits for a specific character": {
        "title": "screw which mains subreddit has the most members, get ready for which mains subreddit has the most subreddits for a specific character",
        "score": 541,
        "url": "https://i.redd.it/opyulx25718d1.jpeg",
        "content": "",
        "num_comments": 53,
        "comments": [
            "In the end, _nsfw or _hentai will win so it doesn't matter lol",
            "Of course the _ at the end one has kaiser",
            "Everyone fighting to be special and i guess they want the \"luxury\" of being an owner of a subreddit? Kinda cringe if you ask me",
            "More like which one will a normal person be comfortable in",
            "I had a quick look at the smaller subs,  it  seems that except for one, the rest are inactive where no posts and the mods are not actively posting either despite lack of activity for like... at least a month+\n\n\n Unless there is a collective effort to get the sub running by the players and the mods, people are just going to just join the one with the most members, and Reddit algorithm also means the sub with highest members will more likely to be recommended.",
            "I love it because somehow in these kinds of subs they always feel different from each other despite everyone being the same main",
            "Do not visit them...\n\nI saw pictures of Sigewinne that should have never been drawn...\n\nDunno where I can find a normal place to chill and discuss my love for Sigewinne.",
            "Ask-Me-For-Directions-Arnold mains [https://www.reddit.com/r/AMFDArnold/](https://www.reddit.com/r/AMFDArnold/) solos",
            "idk who has the most but alhaitham has 2 official subreddit one for the horny ones and one for sfw",
            "Sige\"wine\" 🍷at the end",
            "Who tf is kaiser",
            "Neuvillette: *Gets VERY concerned looks.",
            "Hmmn",
            "Ok, just did some research. The top one (2.3k) is kinda valid, I didn't see anything crazy.  \nThe second one (500) is just full of \"😭\"",
            "I just looked up \"Sigewinne\" to see how much more mains subs it has, ended up finding a sub called GenshinImpactCunny... please report it if you can.",
            "Isn't Sige minor?",
            "Venti...",
            "Please do not the Melusine",
            "This guy knows his priorities. Respect+",
            "well kaiser is in both the big ones so theres really not much of a difference now. Another child subreddit owned by a degenerate.",
            "Ew no",
            "oh god",
            "It’s worse, the other one with 507 members also has him…",
            "who is this kaiser guy",
            "Usually when this happens its because Kaiser beat everyone else to the name, which means the original sub is now full of porn.",
            "Yes, it is 100% cringe. But what can you do about power hungry people.",
            "[deleted]",
            "Could try the one with [76 members](/r/sigewinnemains), they hate kaiser as I recall. Though I fear they may have already given up on building a community to counter him.",
            "saw all the capitano glazing and thought I was in r/fatuihq",
            "Last I recall, at least 6 Alhaitham related subreddits",
            "There's actually a 3rd one for build spams",
            "Legally speaking....nobody knows. \n\nIts kinda implied that all melusine appeared at the same time. As neuvillette was already ludex at the time, that puts her at most 500 years old. But saying that theres another conundrum: shes not human. What the fuck even constitutes being a minor when you're from a race of slug people born from the blood of a dragon created by a mad woman? Much like Klee, we have no idea if shes in what one would consider to be the adult or a very smart toddler. That said, the fact that she has a job indicates shes legally an adult by Fontaines standards, whatever they may be. But model wise, shes still using the kid model so lusting for her is definitely pedo behaviour. \n\nTheres no ambiguity or room for interpretation like with Yozora from sewayaki no kitesune. That goes for all the child models in genshin.",
            "Can't believe how venti still wins",
            "I mean someone had to do the melusine, because Sigewinne is clearly having a human face, lol.",
            "somebody needs to get the small characters a restraining order against him :|",
            "He is fucking power hungry here",
            "TheOneTrueKaiser is a guy who is (was?) a mod on a ton of character main subreddits (because he creates them as soon as the characters are revealed).\n\nHe's especially infamous because of how he is on the subs for the small girl characters. Let's just say that he likes a certain type of art, and Nahida_Mains is banned for a reason.",
            "according a comment on this post, the two largest sigewinnie subs are modded by kaiser, so that checks out.",
            "Username doesn't check out, forgot to mention redflags, nta and claim to be atheist",
            "Well, it's pretty dead but I'll join it for now anyway, thanks.",
            "Here's a sneak peek of /r/FatuiHQ using the [top posts](https://np.reddit.com/r/FatuiHQ/top/?sort=top&t=all) of all time!\n\n\\#1: [Who Killed The Fair Lady?](https://i.redd.it/59znqm1occnc1.jpeg) | [73 comments](https://np.reddit.com/r/FatuiHQ/comments/1bammjf/who_killed_the_fair_lady/)  \n\\#2: [Can I get a fact check on this?](https://i.redd.it/odc4lzdrv25c1.jpg) | [26 comments](https://np.reddit.com/r/FatuiHQ/comments/18dnko0/can_i_get_a_fact_check_on_this/)  \n\\#3: [Most wholesome moment between the harbinger gang.](https://i.redd.it/3g1diqbt91fc1.png) | [36 comments](https://np.reddit.com/r/FatuiHQ/comments/1acincu/most_wholesome_moment_between_the_harbinger_gang/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
            "Wow I was not aware of it",
            "Ehe...",
            "The 4.7 stream mentioned her story quest will explain her appearance, I'm looking forward to the explanation actually",
            "Please FBI, pretty please just look at that dude’s computer, you’re almost guaranteed to find something",
            "I mean all of these clone subs are. Who will win the right to be a mod of the sub! People are pathetic.",
            "The name already gives it away. \"Kaiser\" is german and means \"emperor\".",
            "ehe TE NANDAYO!",
            "I too am interested in what sort of ass pull theyll make. After the travesty of the inazuma \"scary monsters\" event,nothing can surprise me.",
            "Don't get it",
            "There’s a certain mod of a lot of “\\_\\_mains” subs who almost exclusively posts NSFW pics of the loli model Genshin characters"
        ]
    },
    "Neuvineuvi cute tho ": {
        "title": "Neuvineuvi cute tho ",
        "score": 734,
        "url": "https://i.redd.it/wscfz96rl08d1.jpeg",
        "content": "",
        "num_comments": 33,
        "comments": [
            "Llettellette is just a JoJo's character",
            "Neuvineuvi looks like when you hose down a long-haired dog",
            "They would be Neuvivuen and Llettettell, no?",
            "They both look like Dante and Vergil respectively",
            "Neuvineuvi needs to start a glam rock band",
            "Neuvineuvi .....\n\n\n\nW O U L D",
            "So, i need to see the people commenting something about \"🛐\" to Neuvineuvi",
            "I want neuvineuvi ingame",
            "They look like Dante and Vergil",
            "Neuviivuen\n\nEttellllette",
            "Would",
            "Bro looks majestic even with that huge ass forehead.",
            "Unironically, I think Lettellette looks the best.",
            "Bro looks gorgeus in all of them",
            "He looks like an Ace Attorney character before and after you press them for murder",
            "Neuvineuvi is the one by the end of that one cutscene.",
            "Someone give Neuvineuvi the H-protag look, then have him animorph into a hydro slime.",
            "Neuvineuvi looks like Otto kinda",
            "Neuvilette Jostsr",
            "It's not written in the Suaus code :(\n\nShouldn't it be Neuvivuen and Ettelette?",
            "I think it should be :\n\n- Neuvivuen instead of Neuvieuvi\n\n- Ettellette instead of Lettelette",
            "LletteLlette looks so sassy. I'll take him!",
            "Here’s me trying to pronounce that name: \n\nhttps://youtube.com/shorts/zeplgjsmxqs?si=yr_1CsAcmNdAR92G",
            "HELP THAT'S TRUE THO",
            "Like \"yoiyoi\" and \"miyamiya\"",
            "Ooh really? I dunno I saw a yoimiya version of this and I decided to make it onto neuvi, mb",
            "Neuvivuen and Ettellette",
            "I corrected it on my next post",
            "Yes. I corrected it on my next post, too late now:(",
            "Was hoping it'd be this https://youtu.be/jRG0gyVFP60?si=8DOMRdr9yz3eQVew",
            "And Llettellette is when you powerblow dry said dog",
            "Nothing serious, mostly a joke haashahsa. Usually these memes are with reflected images, so sometimes people also reflect the names. Nothing wrong with doing it like this too, of course."
        ]
    },
    "An Eremite Dancer and a Mirror Maiden": {
        "title": "An Eremite Dancer and a Mirror Maiden",
        "score": 67,
        "url": "https://v.redd.it/shld66oot38d1",
        "content": "",
        "num_comments": 4,
        "comments": [
            "And here, we can see the mating dance of the Eremite as it tries to wow a potential mate.",
            "I fucking love eremite clearwater\n\nWe should've gotten Jeht as a playable character, you can't change my mind",
            "Jeht trying to impress Agafya",
            "Canon Jeht activity"
        ]
    }
}