{
    "February Game/Location ID/Where Is This? Megathread": {
        "title": "February Game/Location ID/Where Is This? Megathread",
        "score": 22,
        "url": "https://www.reddit.com/r/geography/comments/1agkj29/february_gamelocation_idwhere_is_this_megathread/",
        "content": "Do  you like to test others on geographic knowledge, play geo guessing  challenges (guess the location), or discuss the daily Worldle? Then this monthly thread is for you!\n\nPlease  use this thread to post and discuss any and all of your geography  related quizzes, challenges, games, or location identifications. Any  standalone posts relating to quizzes, games, challenges, or location IDs  posted to [r/geography](https://new.reddit.com/r/geography/)  outside of this thread will be removed. This includes posts flaired as a  Poll/Survey that are actually quiz style questions in disguise. The  Poll/Survey flair should be used only to conduct research or gauge  opinion on something, not to test knowledge on a particular subject or  fact.\n\nPost all new quiz/games/challenges as top-level comments within this post (i.e., direct comments to this post).\n\nTo add an image to a comment, upload your image(s) [here](https://imgur.com/upload), then paste the Imgur link into your comment, where you also provide the other information necessary for your post. See this [guide](https://imgur.com/a/6CZfaeO) guide for instructions.\n\nFor other subreddits devoted to this type of content, please check out [r/geoguessr](https://new.reddit.com/r/geoguessr/), [r/geoguessing](https://new.reddit.com/r/geoguessing/), [r/geochallenges](https://new.reddit.com/r/geochallenges/),  [r/guessthecity](https://www.reddit.com/r/guessthecity)*,* [r/WWTT](https://new.reddit.com/r/WWTT/)\n\nSee [r/whereisthis](https://new.reddit.com/r/whereisthis/) for help with identifying unknown locations, or use your geo detective skills to help others.",
        "num_comments": 69,
        "comments": [
            "https://i.imgur.com/3eruvaY.jpg \n\nCan anyone guess where this is? I am in a plane and my camera is facing east",
            "Hello, I am looking at place called Ridumir in early XXth century sources. It should be situated somewhere around South Serbia, Kosovo or North Macedonia (in the area between Kačanik, Skopje, Bujanovac, more or less). It is possible that the place has changed names since, or that there is a slight error in the transcription. My source is in Serbian, so I imagine there might be another macedonian/albanian name that would be more in use nowadays. Does anyone have a on where this place could be ?",
            "https://preview.redd.it/aii4vosj7zoc1.jpeg?width=4032&format=pjpg&auto=webp&s=9bafb88c033913054188691e82d8b4457192842c\n\nGuess the location, feel free to ask for hints",
            "Challenge: Name 2 transcontinental countries\n\nThere are many definitions of continents and the world can be divided into 4-7 continents by different definitions. Let’s say in this challenge, continents are defined as contiguous and interconnected land masses that are bigger than Greenland. \n\n1. How many continents are there? (Hint: all start w A)\n2. Can you name at least two countries that are transcontinental (spans over two continents)?",
            "https://preview.redd.it/3m0k28wz3qpc1.jpeg?width=544&format=pjpg&auto=webp&s=ec7fc598827e9416a48b4ae9340b9959c316f391\n\nBought this photo set from Hobby Lobby, curious if anybody would be able to figure out exactly where it is, and what mountains are pictured.",
            "Can anyone guess where this is? I know it is close to a coffee-house in the inner city of Vienna in the late 60s\n\nhttps://preview.redd.it/rkv2t7o0i8rc1.png?width=2556&format=png&auto=webp&s=0adc8fab2f9f1d5e1ff36a3c1e84538b94d665ea",
            "Does anybody know of some good alternatives to the Jetpunk Countries quiz? I love its format and have been using it to try and memorize names+locations, but it has some problems.  \n  \nFirst off, its list of countries incomplete - like for example it doesn't have Greenland, Palestine, the Cook Islands, etc. It also uses the same shorthand for multiple countries, so for example if you put in \"congo\" you get both R. Congo and D. R. Congo.",
            "I feel like you guys will like this map guessing game: [https://mapl.life](https://mapl.life)",
            "https://preview.redd.it/rqvang1gyt0d1.png?width=1146&format=png&auto=webp&s=8395ff618d08e8ba90b7926e9eebfe445b7f140f\n\nWhat skyline is this?",
            "https://preview.redd.it/r2whr7argu0d1.png?width=412&format=png&auto=webp&s=130df48dd5f5eabd5a752a750d0ed1a5ea709115\n\nWhat city/place is this an outline of? Thanks!",
            "hey I was looking for a city in Appalachia that has a very long, windy main street with lots of shops and historic buildings. The town is located in some kind of valley where I believe there is a river and some of kind of railroad infrastructure. not sure if the railway is still in use, but there is a historic museum at the bottom of this town near the river.",
            "https://preview.redd.it/cnt1v9vitysc1.jpeg?width=1034&format=pjpg&auto=webp&s=2f7c7a3a4d931685cc05f829991c410efceac232",
            "Random Trivia: what’s special about this ring of counties in Kentucky? Hint: it’s politics related\n\nhttps://preview.redd.it/7p2aoukt4utc1.jpeg?width=671&format=pjpg&auto=webp&s=99a691d6178c2e55c7af5b6d37ddc7df9032769f",
            "https://preview.redd.it/yt4zlrv0l9uc1.jpeg?width=3024&format=pjpg&auto=webp&s=52cf2d99da430cb00d7ed8d19ee7b8cdb8f520b7\n\nDoes anyone know what part of the globe this is supposed to represent?",
            "Full the table with your best geography knowledge!\n\nRules:\n\n1. Only one country per grid\n2. Do not repeat your answer\n3. No transcontinental countries (Türkiye, Russia, Kazakhstan, etc.)\n4. Though not illegal, try to answer without Googling.\n\nHave fun!\n\nhttps://preview.redd.it/c4u0tfeeq54d1.jpeg?width=1080&format=pjpg&auto=webp&s=80a994d231a9ecda0c0ff7abfd6bbc2e13676ab1",
            "The Carolinas?",
            "Gaspe Peninsula and St Laurence",
            "Southern Maryland",
            "rio grande do sul?",
            "I have an unshakeable feeling it's in West Africa, but if I had to pick a place from skimming through Google Earth, it would be Gosongtelaga, Aceh, Indonesia.",
            "Curonian split?",
            "Northern Michigan or Wisconsin?",
            "Are you sure the Serbian Cyrillic transliteration is correct?\n\nAnother possibility, albeit very remote, would be an English word \"ridgemoor\" (or Ridge Moor or Mountain) transliterated into Cyrillic - as \"ridge\" is \"greben\" and \"moor\" can be translated as mountain or peak, which then would refer to Grebnicka Planina, a mountain peak 64 km northwest of Kačanik.\n\nIf possible, provide the data in its original form, perhaps in Serbian-Cyrillic, and a little more details about the sources.",
            "East of the Rocky Mountains?",
            ">!Turkey and Egypt!<",
            "France and Kingdom of the Netherlands.",
            "Snowmass Lake, Colorado. Looking at Snowmass peak, but the image is inverted.",
            "I like this game, with each guess you become so much less persice while getting more accurate!",
            "I believe that is Calgary.",
            "My guess would be the north of Brazil or the water that separates Uruguay's coast from Argentina's coast.",
            "Boone NC?",
            "The cylindrical building is the One William Street a.k.a the Tower of Power, a skyscraper in William Street, Brisbane, Queensland, Australia. The construction by its side will be the gigantic complex of three buildings with more than 800 residential apartments.\n\nThe bridge in front is the recently completed Neville Bonner Bridge.\n\nThe photo was taken from the south bank of the Brisbane River (the buildings are on the north bank), close to the cycle path that borders the river.",
            "Maybe these Counties are Wet when referencing sale of alcohol?",
            "Asia (in silver) and Indian Ocean (in gold). It is upside down.\n\nhttps://preview.redd.it/1jpnoauvlhuc1.png?width=5859&format=png&auto=webp&s=2fef2b99859b60be43d3eee4788c79755bd0cc7c",
            ">!no-!<",
            ">!no-!<",
            "The source is Živko Pavlović, Rat Srbije sa Austro-Ugarskom, Nemačkom i Bugarskom 1915. godine. It is directly in Cyrillic and the scan I'm using is from the NBS website, it's good quality. Obviously mistakes can happen in the original too but I have no indication that it could be the case (in fact I searched for Radumir for instance). \n\nI paste here the original cyrillic (OCR-ed so a few chracters may be off, but Ridumir is very clear here).\n\nЗа појачање 3-er пука упућен је батаљон 2-or пука са водом митраљезаца преко Качаника, а на лево крило одред од: 2 батаљона, вода митра­љеза, 2 француска брдска тола, 2 брзометна топа упућен је преко Рожанца ка Кучковом вису, са задатком: да очисти десну обалу Лепенца, да умири побуњено село Ридумир, и да доће у везу са Тетовском колоном.",
            ">!No!<",
            "Nope, they both belong to the same continent according to my description (interconnected landmass) above.",
            "Thanks! Weird that it is inverted, makes me wonder if they didn't have the rights to use the photo, so they inverted it.",
            "Thank you! It totally is",
            "https://www.reddit.com/r/YAPms/s/iLIFULSr0B",
            "I'm not going to pretend that I know the military history of that region or the languages, the level of research you are doing is far beyond my reach and my level of knowledge. I apologize for the nonsense I proposed in my previous comment.\n\nThere's an interesting thing: you researched \"Radumir\" and you weren't satisfied.\n\nHave you considered the village of Radomir in Bulgaria? In 1918, it became the center of the Military Revolt (Vladai's Uprising or Soldiers' Uprising), an armed rebellion of disorganized formations of the Bulgarian army, which deserted after the defeat at the Dobro Pole. Pavlović seems to be clear that the village \"Ridumir\" was rebellious.\n\nRadomir in Bulgaria is 145 km east-northeast of Kacanik.\n\n\n\nWhy would Pavlović change the name of the village in his book? We can consider:\n\n1. typographical, transliteration, or definitional error in Pavlović's book. Example in the same sentence, the same river: \"Лепенца\", also called in other sources as \"Lepenc\", others \"Lepenca\", still others \"Lepenac\" (in Skopje) or \"Lepenica\" (Kacanik), and still \"Лепенец\" ;\n\n2. cartographic error on Serbian military maps over another country (Bulgaria, at the time, an enemy);\n\n3. difference in accent between the Serbian and Bulgarian languages of the time when referring to the same place;\n\n4. avoid reader confusion by differentiating (and protecting) the name of his superior and friend, Duke Radomir Putnik, in addition to \"Radomir\" being a Serbian name that was not so uncommon at the time;\n\n5. Passing a derogatory tone on a place considered a \"den of mutineers with socialist tendencies\" (\"military insurrection\" was adopted in historiography during socialism, but after 1989, some historians define it as \"an attempted coup d'état, to change the constitutional order by force\"). This would be unacceptable for traditionalist military men like Pavlović who was director of the Belgrade Military Academy (1919) with hundreds of young officers under his responsibility.\n\n\n\nI believe you have already considered this possibility. If you ruled it out for any reason, please let me know, I'm curious. But I don't think I can help much more than that. I apologize for the previous nonsense and the new nonsense above. I hope you can find what you are looking for.",
            "WA, OR, or CAN?",
            ">!Spain and Egypt? Or do you not count the Suez Canal? (Africa and Eurasia)!<",
            ">!yes!<",
            "by the above definition - interconnected landmass meaning Africa and Eurasia would both be a sub-continent of the greater continent Afro-Eurasia. Turkey, Egypt, Russia are not transcontinental countries because they are all Afro-Eurasian countries",
            "Puget sound?",
            ">!France. Is one with a department in S.A.!<",
            ">!yes!<",
            "You got it. It is indeed a transcontinental country! Good job",
            "What direction are you facing?",
            ">!do you count Antarctica? Because otherwise, Australia is only occupied by one country, and between the Americans and Afro-Eurasia, I can only think of France that has territory on the mainland of the Americas. Monroe doctrine and such.!<",
            ">!Guess based on the mountains using google. (And you should be able to tell my approximate latitude from that as well) if you are stumped, I’ll say.!<",
            "Yes, by this definition there’s only one truly transcontinental country. If we were to think of another, then we would need to pick a country that has a claim on that white land",
            "Looking North to the Olympic Peninsula?"
        ]
    },
    "The State of the Sub and What You Can Do About It": {
        "title": "The State of the Sub and What You Can Do About It",
        "score": 174,
        "url": "https://www.reddit.com/r/geography/comments/1aj2gsn/the_state_of_the_sub_and_what_you_can_do_about_it/",
        "content": "The mods aren't blind, and are as tired of seeing low effort trend posts as the rest of you. Realistically though, we can't spend all day removing posts, and there are only so many words we can blacklist through Automod before the only remaining passable words are numbers. \n\nWhat can YOU do to improve the quality of this subreddit? \n\n1. Downvote posts and comments that do not contain the type of content you'd like to see on this subreddit. This is quite literally why the downvote button is there. \n\n2. Stop commenting on low quality posts to call out OP. Reddit sees this as engagement regardless of what you say, and now you're boosting OPs post and encouraging more low effort posts from karma farmers. \n\n3. Stop making \"meme\" posts that complain about the current trend. You're just adding to the clutter, not being a hero. \n\n4. Report low effort and irrelevant posts. Enough reports on a post, it gets removed, it's that simple. \n\nThe mods have no intention of blanket removing trend posts at this time. Some trends actually drive discussion and allow your fellow users to learn more about the world, many do not. We don't have time to check each post and comment, we have jobs. Help us out. \n\nDo us a favor, if you want more high quality content in this subreddit, contribute higher quality content to the subreddit, and follow the guidelines above to police low quality content.",
        "num_comments": 2,
        "comments": [
            "In my opinion there should be a category of posts that are serious and require serious replies of an educational nature. A special flair and a stickied comment could inform users of that.",
            "Alternatively, moderators could put question threads into contest mode then have two categories to reply under, one for serious replies and one for non-serious replies."
        ]
    },
    "After seeing the post about driving inside your US state without leaving": {
        "title": "After seeing the post about driving inside your US state without leaving",
        "score": 232,
        "url": "https://i.redd.it/3f7mfw8le38d1.jpeg",
        "content": "For my fellow non Americans, what’s the further you can drive without leaving your country?",
        "num_comments": 169,
        "comments": [
            "https://preview.redd.it/8mrcfh8tf38d1.jpeg?width=1080&format=pjpg&auto=webp&s=94815b56555d0c4d8227335205ac9d3b06cda6b4",
            "\\~ 30 minutes driving slowly, not even 20 km (from Rovereta to Confine)\n\nhttps://preview.redd.it/iok1bsian38d1.png?width=1080&format=pjpg&auto=webp&s=e18a449bd3251b6e422be80d07dee9100c6c75f3",
            "I live in Australia. I cannot leave my country by car.\n\nUsed to live in a part of the state that was 13 hours to the nearest state border. You can do 30+ hours from one end of Queensland to the other.",
            "https://preview.redd.it/q4vq9tp8h38d1.jpeg?width=661&format=pjpg&auto=webp&s=a7f3f3f2cc39ae53ba9c05774da689cdde48ca46\n\n1152 km",
            "https://preview.redd.it/keosdb88k38d1.jpeg?width=1079&format=pjpg&auto=webp&s=9adc8a77e37985af658b23e7f696d6d7b2a8f042\n\nI can do this without leaving the state (29 hours). And this isn't even the biggest state! No hope of leaving the country by car.",
            "- The maximum one can go by just travelling East-West is \\~[3,700 km](https://maps.app.goo.gl/kGCs3SjTfanYWBz37) (\\~72 hours).  \n- The maximum one can go by just travelling North-South is \\~[3,900 km](https://maps.app.goo.gl/SUC8egSGJNYVnBsh8) (\\~71 hours).  \n- The maximum overall, as far as I could find, was \\~[4200 km](https://maps.app.goo.gl/nkdGCz6fRMRdAYi57) (87 hours).\n   \nThese are approximates for India, my home country.[](https://maps.app.goo.gl/nkdGCz6fRMRdAYi57)",
            "Heh, nothin' personal, kid.\n\nhttps://preview.redd.it/7udb3xc6x38d1.jpeg?width=547&format=pjpg&auto=webp&s=1483ebba79e0c8a27736d5185113fd26c32efa58",
            "The version of this question I like the most is \"how long do you have to drive to get to a place where most people speak a different language\". In the US is synonymous with the whole country, except for secluded communities I guess, whereas in Europe is like 2-6 hours in most cases XD",
            "https://preview.redd.it/txjaudw5m38d1.png?width=1080&format=pjpg&auto=webp&s=6afe65348f99c4a9faff42c28771af86532276c1\n\nI did it within just Shizuoka prefecture\n\nThe power of mountains",
            "https://preview.redd.it/ki427zx0q38d1.png?width=1080&format=pjpg&auto=webp&s=28b7223d6bcb293cff86933893124e24d21f7551",
            "If I can take a ferry (because Salvini hasn't built the bridge yet) something like 20 hours, around 1800 km (from the northernmost point of Alto Adige or the border of Trieste to Marsala).\n\nIf I can take a longer distance boat and then drive again , around 1900 km and 1 day of travelling (Ponte sull'Aurino, BZ - Lampedusa, AG).\n\nhttps://preview.redd.it/pi5285tm848d1.png?width=862&format=png&auto=webp&s=35af6e2e87bb7c6618318fb2ee390cc440206eed",
            "&#x200B;\n\nhttps://preview.redd.it/o5m5tx64t38d1.jpeg?width=815&format=pjpg&auto=webp&s=38fa83cb0d7fb169f4f180a0a6937b8782ee42a0",
            "https://preview.redd.it/rf6494dzy38d1.png?width=1084&format=png&auto=webp&s=0efc37b61af00f8e186bfdd948685acc2a450cfd",
            "Austria,  788km.  Had to add a couple of stops to stay in the country\n\nhttps://preview.redd.it/qyeldy29i38d1.jpeg?width=750&format=pjpg&auto=webp&s=df9a79b17fd344d71ed53819abc8bfb5e8f3b17f",
            "https://preview.redd.it/yu6ndlpyy38d1.jpeg?width=1080&format=pjpg&auto=webp&s=ed8b8ab7e8222d96209461a6f02ce7d8113ff9f7\n\nIf you wanna go further south in Chile you gotta cross over to Argentina or take a ferry so this is the longest you could drive without any stops.",
            "If I consider the paved paths in this square enclave of Germany: about 10 meters\n\nhttps://preview.redd.it/bcac1kocs38d1.png?width=1124&format=png&auto=webp&s=853a8c1a5fd8920eb190ef796344e2c99ae9e39b",
            "https://preview.redd.it/k8e0fbwwt38d1.jpeg?width=1080&format=pjpg&auto=webp&s=cf8651b95a9c6810b51f8645e565757ec69eae8a\n\nIn such a small state, this is how long it takes to cross my country from end to end... with traffic.",
            "Approximately 18 hours from the southernmost to northernmost tip of Ghana.\n\nhttps://preview.redd.it/thc16tbwu38d1.jpeg?width=830&format=pjpg&auto=webp&s=cc4ca8e012e26fd18f6977f55c33d3e9565c1284",
            "https://preview.redd.it/3ododilwq38d1.png?width=747&format=png&auto=webp&s=1a70ce1021dcb557a3d7f3dd8de60fb68489b6a1",
            "https://preview.redd.it/no99ss0y148d1.jpeg?width=1080&format=pjpg&auto=webp&s=f9081a3be9a4b6913093f33d648c33020699c2e2\n\nCroatia is pretty interesting. Small country, but because of its shape you get to travel 961 km without stopping (9h 22m).",
            "https://preview.redd.it/vwwj6tldz38d1.png?width=2463&format=png&auto=webp&s=bc2e151c4d32947fae6e5b8dce469aa8a4624c80\n\nApprox. 10k km  \nReminds me a meme: \"There's only one country between North Korea and Norway\"",
            "In Brazil, you can go from Sibauma Beach to São Bárbara, total of 5,441 km. The route includes more than 500km of dirty road through Amazon area, some rivers are crossed by ferry, not bridges. I doubt that the road is feasible during the rainy season.",
            "This is the longest in France, I think:\n\n&#x200B;\n\nhttps://preview.redd.it/ql35vcwct38d1.png?width=1251&format=png&auto=webp&s=cd7d2d59e22c329ab1284711b387d1ef8d59b1fa",
            "https://preview.redd.it/u99b8q44x38d1.jpeg?width=1125&format=pjpg&auto=webp&s=297cbb63c8498b00e8a4f8e8c84a038eb569a674\n\n1.077 km, São Paulo state, Brazil",
            "https://preview.redd.it/ydkctk3vx38d1.jpeg?width=1080&format=pjpg&auto=webp&s=6a8630af10d03f1878ff5a4026f882a5dd921298",
            "https://preview.redd.it/vobsw6bv148d1.jpeg?width=1242&format=pjpg&auto=webp&s=93df1810f8f76daca97ec28e2acb979d6cf7b535\n\nSweden. From Malmö in the south to the border by Riksgränsen in the north",
            "https://preview.redd.it/qddf3bh1348d1.png?width=1080&format=pjpg&auto=webp&s=e41b9dcd71ebf461b8f50a0a3df01c8263992342",
            "Why end at Barcelona?\n\nThe longest one is from Isla Canela (Ayamonte, Huelva) to Cap de Creus (Girona)\n\n&#x200B;\n\nhttps://preview.redd.it/tk9ltkp9s38d1.png?width=1064&format=png&auto=webp&s=a43b9b6f8f86410766f7191738bb707578b54573",
            "https://preview.redd.it/16my9qbxy38d1.jpeg?width=2436&format=pjpg&auto=webp&s=db95dce7ebfaa2da8b03beb3315afbb6077d1452\n\nSmol country",
            "Longest one I did was about 6000 km. Halifax NS to Sechelt, BC",
            "https://preview.redd.it/g60fqcx7548d1.jpeg?width=1170&format=pjpg&auto=webp&s=d32edd6627dafd35078083fdd0ef3c9c3d21af45\n\nFrom Mizen Head to Malin Head",
            "https://preview.redd.it/an2mdhpm848d1.jpeg?width=1080&format=pjpg&auto=webp&s=ef12113cafc201d293434b17f921c9300d56a614\n\nDo we allow ferries???",
            "I can drive a thousand miles and I'm only half way across the USA. Someone is about to pay me 1k to drive from Portland Oregon to New York state",
            "15 hours and 1300km from Helsinki to Nuorgam.",
            "2 hours within my part of the UK and 12 hours within the UK.",
            "https://preview.redd.it/lebkpwi5148d1.jpeg?width=828&format=pjpg&auto=webp&s=b44b55466d884bf4fa3ffd94f924285c4896a124\n\nWithin my state from where I live (add 5 hours on if you want to drive from mount gambier",
            "Its a 6.5 hr drive from top to bottom of virginia Ave it's the 35th biggest state. \n\nThat said, spain is huge. Only texas and Alaska are bigger.",
            "https://preview.redd.it/oohyqftw348d1.png?width=357&format=png&auto=webp&s=8556634b201bb187b350da007d02c8ca2e9e1142",
            "https://preview.redd.it/zgsmpkgh548d1.jpeg?width=750&format=pjpg&auto=webp&s=0890c2d1c440cc9f8863aeb5cb573940553b19ef\n\nA short drive",
            "I'll just leave this here: [I Rode A Barbie Bike Across An Entire Country](https://www.youtube.com/watch?v=NGqTzcQjD2c)",
            "That’s about the time to drive across Texas…. 😂",
            "https://preview.redd.it/amy0n4dya48d1.jpeg?width=1080&format=pjpg&auto=webp&s=f90932a86734ba8295d6322025d17d2b26e95c48\n\nDude",
            "https://preview.redd.it/mwz6uuc2x38d1.jpeg?width=725&format=pjpg&auto=webp&s=dc8ba89951524dbf4439a8c0952bef1bf003c973",
            "Norway probably got the longest trip in europe, Lindesnes(southern most point) to the russian border in the north is about 42 hours.",
            "https://preview.redd.it/fzm2zzak148d1.png?width=1080&format=pjpg&auto=webp&s=650edc7c30e8d5afb6d6499b353ab77b99d3c3b7",
            "The largest state in Malaysia, Sarawak. The route from \"Kilometer 0\" in the west to the border of the state of Sabah in the east.\n\nThe island of Borneo is 748,168 km2, for comparison Spain is 506,030 km²\n\nhttps://preview.redd.it/rr7a5pet248d1.png?width=1008&format=pjpg&auto=webp&s=481786d2d40015e73be6017bb9c43b0f5ecd294a",
            "https://preview.redd.it/vqswww4p248d1.png?width=1080&format=pjpg&auto=webp&s=055067baae86d4c24c1971f304a185832822a93c\n\nHere in Maharashtra - India, one can go from Shiroda, Sindhudurg in Southwest to Sironcha, Gadchiroli in East for a distance of 1275 K.M. nonstop taking 26 hours without leaving the state. However, there is a shorter route which involves going through the neighbouring states of Karnataka and Telangana which cuts the distance and time to 940 K.M. and 17 hours.\n\nShiroda to Gondia in Northeast (1150 K.M. and 22 hours) is better candidate for longest intra travel through the state. An alternate intra state route is avaliable which increases the distance by 100 K.M. but reduces the time by an hour.",
            "https://preview.redd.it/hswmqcyo748d1.jpeg?width=828&format=pjpg&auto=webp&s=0ca56e368b364f3e33ecee6b25930c1e8da42542",
            "https://preview.redd.it/wvvzxv4w748d1.png?width=466&format=png&auto=webp&s=df4768ade6751342f9e05c4d083b0fa8320b8c2e\n\n8 hours with our road quality",
            "https://preview.redd.it/52wsae0g848d1.png?width=1080&format=pjpg&auto=webp&s=c755991185404ba430496f1080d6dad296428dca",
            "Took me 3 days in Croatia, since I kept getting lost and then found out that for a few miles Bosnia Herzegovina actually cuts Croatia in half.  Never seen a country separated like that before.\n\n#",
            "That’s a walk in the park in Saskatchewan",
            "https://preview.redd.it/ofncee4qa48d1.jpeg?width=1290&format=pjpg&auto=webp&s=e1556cc4103f03f89d8fda5e87580693134d6155\n\nstarting in kaliningrad would be cheating.. and anything further east than that requires ferries n stuff because... rivers. you can get to Omsukchan which would make this 6 days 14 hours, but you need to cross river Aldan by ferry. still pretty long i think",
            "1 day and 9 hours to go as far up Quebec as possible\n\nhttps://preview.redd.it/x9u6dgd0c48d1.jpeg?width=1170&format=pjpg&auto=webp&s=5d19d36e82ebdb642a112f070c70254571fa8f1e",
            "https://preview.redd.it/yyn4bpvjc48d1.jpeg?width=1170&format=pjpg&auto=webp&s=256336468771eee905285de7f58eeb17b644bb3b",
            "https://preview.redd.it/n1697dclc48d1.jpeg?width=1170&format=pjpg&auto=webp&s=516821a0247fee0f820b3cc374a53bb09f4e0695\n\nSweden is a very long country.",
            "https://preview.redd.it/zwaigoz9d48d1.jpeg?width=1170&format=pjpg&auto=webp&s=a7ee38181c9a2eb3b56789f0f2ef1bc64ccd3313\n\nJohn O’Groats to Gretna",
            "I live in florida\n\nhttps://preview.redd.it/bjfe2wnfd48d1.jpeg?width=1170&format=pjpg&auto=webp&s=eec5e9ac94b410cab1646178f4903a8703f06107\n\nThis is to drive to Seattle.",
            "&#x200B;\n\nhttps://preview.redd.it/bb7nfs2gd48d1.png?width=319&format=png&auto=webp&s=e64cbd8add61578fd0ed43b12ab17289cd6a258b\n\n\\+4000km (assuming you survive the road trip on our well-maintained national routes)",
            "So far man. Days and days and days. Sometimes even in a straight line. What a country",
            "https://preview.redd.it/wh7yp22we48d1.jpeg?width=1220&format=pjpg&auto=webp&s=887c1a566a62bfc52a4123d206555dada67955da\n\n(28hrs) Entire length of NZ anyone?, can't exactly drive anywhere else",
            "I did this trip three times. There and back lol. I did go through the states one trip, but the way out there the first time I drove through Canada. Anyone suggesting this. Wouldn’t recommend - boring and not much to see. Take the us route instead\n\nhttps://preview.redd.it/u5td376m448d1.jpeg?width=1179&format=pjpg&auto=webp&s=060c5b3c27000583781de96de81a9fc68a83cd04",
            "I didn’t realize Spain was so small.\n\nhttps://preview.redd.it/d55c33rg548d1.jpeg?width=1179&format=pjpg&auto=webp&s=5fb7132d39f1bd36df8903e3a647a580dec92939\n\nCheck out this trip in Texas.",
            "Don't want to dox myself, but my US state is 12 and a half hours end to end and it's not even in the top 20 for total size. (though it is \"long\")",
            "Nice, is there a great difference between north and south Netherlands?",
            "Eemshaven to Sluis? Eede?",
            "Same time for me to go North to South in Western Washington",
            "This is similar to getting through the Holland Tunnel from Manhattan to New Jersey at 5pm on a Friday. Solidarity, friend!",
            "Man I love San Marino\n\nhttps://preview.redd.it/7t6vl7kjq38d1.jpeg?width=3264&format=pjpg&auto=webp&s=cb3ded999dc4f55ebe443fbb97113c199c3089a4",
            "you missed the opportunity than you can go for 4,5 hours and still be in the same country.  \nIf you choose to walk",
            "https://preview.redd.it/m5q0n1ppt38d1.jpeg?width=1179&format=pjpg&auto=webp&s=2d86bb420b3e70b9c5170249668586ee86240561\n\nAlbany to Kununurra in Western Australia.. 36 hours.",
            "Damm, well in your case, what about your province or county? Here is mine:\n\nhttps://preview.redd.it/ruh55drag38d1.jpeg?width=750&format=pjpg&auto=webp&s=e60a75d2655a8f4ca0ad9d5bd43ce0c678e84266",
            "Canada's big ass provinces enter the chat",
            "Yes but Australia has what, territories? In the post about states people were posting Canadian territories",
            "The best thing is that car trains are unknown to American Google Maps, so they show up as ferries instead",
            "Well, this is more than one state though. The biggest state would be Bavaria.",
            "Plus after a certain point north of the Daintree the sealed road ends and you need a 4WD to get to the tip of Cape York",
            "I bet it’s beautiful out there, isn’t it?",
            "I'm Western Australian I've never in my life seen a $ sign on google maps I assume this a toll road or something",
            "And what about inside your subdivision?",
            "I've done the vast majority of this drive.  Whitehorse to Toronto, multiple days.",
            "Nothing personnel, comrade\n\nhttps://preview.redd.it/rujcslxk848d1.png?width=1335&format=png&auto=webp&s=148f812fb6891b8e5451a34b74450802de5c4134",
            "Wait till you get humbled by a Russian.",
            "Is there a Canadian cannonball run?",
            "For me, it would be a five-kilometer drive.",
            "Damn french-canadians making my answer only a few hours",
            "The difference of a dialect and a language is a language has a army and a navy. \n\nBeing german and lifing in germany. \n\nThat said the closest that i can find an elderly person who can speak in a dialect I can’t understand would be less than 5km. I life 500km from the place i grow up so lets try from that place again. Border to the Netherlands 20km. Nearest old person who lifes in germany and whose dialect i will not understand probably 50km lets say 100km to be sure.  \n\nAnd no i didn’t count immigrants.",
            "Uhh.. have you been to the Bronx?",
            "If I have to exclude small communities that speak Occitan or Walser, I guess an hour/hour and a half to get to bigger French or German speaking communities.",
            "I can walk there lol",
            "I live in Texas, I would just have to drive across the city to find a neighborhood that is strictly Spanish speaking.",
            "The US has many world cities. In a place like NYC you only have to walk a couple of blocks to find a neighborhood where people speak a completely different language. One that may not even be related to your own",
            ">whereas in Europe is like 2-6 hours in most cases\n\nNorway would like a word. 40+ hours from the southern coast to the russian border.",
            "I think you massively underestimate how diverse the US is. Most people live close to a city or in a city. And pretty much every city has massive minority groups",
            "Subdivisions in Japan: 6:30 hours of voyage Subdivisions in Spain: 4 hours max\n\nhttps://preview.redd.it/wqfy9hnmo38d1.jpeg?width=750&format=pjpg&auto=webp&s=a94937766cd5e4643ef4835468dca73222215108\n\nPD: Mount Fuji just trolling your driving routes",
            "A mari usque ad mare",
            "The actual longest length of road would be from TN to Mizoram.",
            "This is really putting things in perspective for me. I always imagined India was around as tall as the US, but 2 days driving is much further. \n\nI've gone from the north east to south east US a few times and it's about 24 hrs drive time so India is almost twice as long driving.\n\nCould part of it be road conditions too? In the US there is one large highway (95) that goes along the whole east coast, but if you're route is all side roads, it could be similar distance.",
            "The Legio shortest traveling during the Punic Wars be like:",
            "I didn't realize Canada had highways up to the arctic Ocean. I have a friend from Bethel Alaska and Alaska has no highways west or north of Anchorage.",
            "How common it is to get over the border when traveling through Austria?",
            "Damm, you sure are fast",
            "Why is that house in Germany?",
            "translates to 38 hours or 1 day 14 hours.",
            "Came to post that route. Although, why stop in Bergen? Adds another 434 km and 7 hour drive….",
            "Murmansk - Magadan is longer: 11,325 km and 157 hours.",
            "Some more if you start from  Borisoglebsk border Checkpoint - 10 613 km",
            "Because originally the question was about driving from where you live to the furthest point, not just the two most separate points",
            "The longest one is from Portbou, North of Cap de Creus, to Finisterre, with no highways. It's more than 18 hours. And I guess it could be more if you end at La Guàrdia in Portugal's border.",
            "https://preview.redd.it/2z10ezmt848d1.jpeg?width=1080&format=pjpg&auto=webp&s=3157202850d5eead50d205739aa8f402aff2028d\n\nIf not... I think it would be this. Don't ask me why Google Maps insists on translating Mull of Galloway into Chinese or something, though 🤷‍♂️",
            "How much you take in clear for those 1k?",
            "I hope they're providing the vehicle and fuel and sleeping accommodations or that's definitely not worth it",
            ">I can drive a thousand miles and I'm only half way across the USA.\n\nNot even a half. Me and my friends drove from Chicago to Denver and it was around 1K miles. LA was another 1K from there. Boston's another 1K from Chicago though. And there's still 500 miles or more left to reach the border on each side.",
            "Unless you drive a Tesla then it'll be another 36 hours for filling up",
            "Didn't think it'd be more",
            "Technically that's two countries, this is more accurate. Either way we definitely lose though :P",
            "In terms of subdivisions, so counties in the U.K. I can cycle from my home into probably 10 counties in around an hour-1.5 hours or 20 counties within 3 hours. So driving within my county is not a long drive!",
            "1 day and 16 hours in Western Australia though\n\nhttps://preview.redd.it/lfu32tpkc48d1.jpeg?width=1170&format=pjpg&auto=webp&s=91141ca7eda427e3784c800cb3f11109359f9ee2",
            "https://preview.redd.it/xtajkvadd48d1.jpeg?width=1170&format=pjpg&auto=webp&s=7dd7fe4d317a5395bb18565b1749b6bf96ebcf4c\n\nAlso John O’Groats to Porthgwarra. Seeing everyone else’s long ones makes me realise how tiny this island really is",
            "Yeah Spain is not that big, but also Texas is like one of the biggest US states.",
            "Not between these two ends of the road. Only the little panhandle in the southeastern corner has a different landscape.",
            "In the far north half the population speak West Frisian natively, which is fairly significant.",
            "This is about the time it takes to go from end to end in Maryland.",
            "What’s this drive like? How are the road conditions? Heavily traveled area? \n\nI’ll be doing this drive next year my first few days in Australia",
            "This only proves that Australian cars are very slow",
            "About 84 minutes/95km. I live in one of the most populous LGAs (Local Government Area; county-equivalents) in the country. It's near a major city, and the metro LGAs tend to be relatively small.\n\nIn the same state, there's an LGA covering 94,000km^(2) with a population of about 300. They vary in size a lot.",
            "I have gone to barcelona and girona driving from Madrid on a rental on my last vacation there, Girona is recommended",
            "Australia has states, except for the Northern Territory and the Australian Capital Territory",
            "Western Australia is a state, and we have a mix of states and territories. Smallest mainland state is Victoria! *",
            "Had to look up car trains, seems neat!",
            "post asks for country not state though.",
            "Yeah there's still about 1000km to go north of Cairns!!",
            "https://preview.redd.it/zuueehgjo38d1.jpeg?width=2268&format=pjpg&auto=webp&s=737876d017a999e069c6e22328affbc0bc27b9fe\n\nWell it looks like this off my balcony, which is near the start of that route, so yeah. It's pretty nice",
            "Yeah. Stupid stupid toll roads around brissie",
            "around 750 km over 12.5 hours.",
            "Did you forget about Sweden? Even if you only consider very different languages: Germany is 14h way without going by sea, Finland is 18h (give or take a few h depending on where you start).",
            "I think in Japan the longest would be in Hokkaido with 8:30\n\nHave you tried other Spanish subdivisions?",
            "Pretty common to drive through Germany, especially connecting from east to west (Salzburg to Innsbruck for example).   The highway system can be limited due to the alps",
            "I just assumed op meant from where I live.",
            "My wife drove with her son from Austin to Denver in a KIA electric.  A friggin 2 day nightmare - she came back with the view of never an electric car 😆",
            "https://preview.redd.it/v1b8pmsh848d1.jpeg?width=1080&format=pjpg&auto=webp&s=d55ed88e9f3abfdc0abd83406980bdc80e6afb9e",
            "Nope 1 country. Passport says so - there’s no such thing as a citizen of England, there’s no such thing as a citizen of Scotland. It’s messy, but it’s 1 country. I live in the United Kingdom of Great Britain and Northern Ireland.",
            "My state is pathetic though😭\n\nhttps://preview.redd.it/c4glrnred48d1.jpeg?width=1169&format=pjpg&auto=webp&s=632d392a856e6844c63fd1da395b9bb80f6609ef",
            "Alaska is bigger, but also Alaska doesn't have highways.\n\n If you want to travel from Anchorage to Bethel, Nome, Fairbanks, Dillingham etc. you have to fly on Alaska Airlines. Or spend a month hiking/dog sledding through the forests and tundra.",
            "Limburg is very hilly",
            "Highly doubt it heavily traveled since most of the area it covers is uninhabited",
            "I’ve personally only done a more popular route.. Perth to Exmouth, about 12 hours straight up the coast. This inland route is likely going to have a lot more trucks than cars.",
            "True, didn’t read the subtitle.",
            "All I see is creepy critters crawling clandestinely",
            "I thought Australia was covered in spiders and other deadly critters. Maybe they’re hiding",
            "Who's that behind the tree? You got an Uncle?",
            "Hehe 😁 I mostly meant that driving along that seashore must be a gorgeous view, but yours is great too. Apart from all the deadly critters mentioned in the others comments 🤣",
            "In Spain the longest would probably be Andalusia side to side:\n\nhttps://preview.redd.it/2u4d0qanr38d1.jpeg?width=750&format=pjpg&auto=webp&s=269307f15ed0cc758d5344efaed437947ecd560a\n\nAlthough Castille & Lion has more surface, Andalusia is the widest I think.",
            "Dotted line between England and Scotland that disappears as you zoom out shows Google agrees with me 😉",
            "England is one of four countries which make up the UK I'd say. It is complex though. Technically the UK is a country, so are the others? Like if you look on Wikipedia for example they're all \"is a country in Europe.\"\n\nSo yeah, it's weird af.\n\nEdit incase anyone can answer if they see this discussion: are there any other countries with this kind of confusion?",
            "Australian animals and invading incognito insects are adept assassins.",
            "They’re outside the city. Havent you ever played an rpg? I mean hell, you might need an rpg and an ied, awd, and a tank to take out the things in an australian wilderness. Lions of the savannah? Shoot son. They got boxing kangaroos and drop bears, spiders bigger than your head. Snakes for days. Killer rabbits. Nope, none of that please.",
            "Do NOT look at my profile! Trust me",
            "That might be my wife's arm",
            "The drive is mostly very long and boring 😂",
            "One day my one might genuinely be the furthest you can go without a passport 🥺",
            "But the U.K. is a country. I understand the concept of “a country of countries” as the U.K. is often described but the fact that the 4 constituent “countries” are often described as countries doesn’t mean that the U.K. is not a country. So while you might have to drive through 2 “countries” to do lands end to JoG you are only in 1 country.",
            "Spiders are cool, they don't freak me out in the slightest. But finding a large highly venomous snake in the kitchen, OH HELL NO.\n\nCool pics tho.",
            "I think OP should have specified just for us Brits because tbh I think both answers are valid. \n\nNow I'm just on a mission to find other countries this applies to.",
            "I don’t see how both are valid, and if it wasn’t for the way we participate in international sport I don’t think any one would try to argue the sub-nations are in fact countries.",
            "They have their own parliaments. They have more autonomy than Greenland does from Denmark but we consider Greenland a country."
        ]
    },
    "Whats the most interesting fact about Rwanda?": {
        "title": "Whats the most interesting fact about Rwanda?",
        "score": 361,
        "url": "https://i.redd.it/xp14nbnul28d1.jpeg",
        "content": "",
        "num_comments": 150,
        "comments": [
            "The entire country is required to perform three hours of community service on the last Saturday of every month ([Umuganda](https://en.wikipedia.org/wiki/Umuganda)).  Due to this, Rwanda is an exceptionally litter-free country, sometimes compared to Singapore.",
            "It has been the fastest growing economy in Africa since 1990 ies.",
            "It's one of the only countries in Africa to have extensive google street view, and the landscapes mostly consist of beautiful hills",
            "My exs mother went there and she told me people were riding bikes there in the way you would see in Europe. At least in Kigali. Wearing helmets, riding bike lanes (that even exist in the first place) and stopping at signals. \nI’ve spent some time in Nairobi and imagining this is quite unbelievable. Really makes you understand how fast some parts of Africa, especially Rwanda, is developing",
            "They have the highest percentage of women in parliament in the world (61.3 %)\n\nhttps://www.statista.com/statistics/267028/women-in-selected-national-parliaments/#:~:text=As%20of%20December%202023%2C%20women,53.4%20percent%2C%20followed%20by%20Nicaragua.",
            "Plastic bags are banned",
            "I remember their flag used to have a big \"R\".",
            "It sort of looks like Switzerland.",
            "The Tour of Rwanda cycling race is one of the biggest sporting event in the world based on attendance. It has 2 million spectators each year. This is the main reason that the 2025 Cycling Road World Championships will be held in Kigali, Rwanda.",
            "It has recently become popular as a destination for British politicians.",
            "They use drone delivery of medical supplies. \n\nhttps://en.wikipedia.org/wiki/Zipline_%28drone_delivery_company%29?wprov=sfla1",
            "The national animal of Rwanda is a leopard.",
            "Kigali agreement to reduce HFCs by more than 80% was held here in 2016.",
            "If you remove the first letter you get Wanda which is my great aunt's name",
            "One of the best climates on Earth, 25 degress year round.",
            "It was in tne Belgian colonial empire, forming with Burundi the Rwanda-Urundi",
            "It is an amazing place! I’ve been there a couple times. The people are incredibly resilient and very friendly. \n\nInteresting fact - in the north west, close to Gisenyi is where the Silver Back Gorillas are. This is where Diane Fossey was based. Gorillas in the Mist was filmed there. She helped stop the poaching trade and many of the former poachers now work as conversationists and guides. \n\nIn the national park there where the gorillas live you can see 5 active volcanoes.",
            "Frequently ranks among the top 10 most equal countries in the world, above countries like Canada or the UK. \n\nThe demographic of working adults  tilts way towards a female surplus due to the civil war in the country during the years 1990-1994. This could also be part of the explanation to why the government is more than 60% female, the highest in the worst.",
            "Rwanda is now part of Commonwealth of Nations though it has no British colonial ties. The main reason is the civil war and the French support to the majority Hutus\n\n[http://news.bbc.co.uk/2/hi/africa/8384930.stm](http://news.bbc.co.uk/2/hi/africa/8384930.stm)",
            "It's one of the few African countries the Tories know about.",
            "It produces excellent coffee.",
            "According to the law in the U.K., it is safe.",
            "The UK sent refugees there for some reason lol idk why",
            "Shake Hands With The Devil",
            "Their national women’s cricket team made the World Cup for the first time last year. Apparently the resources put into women’s cricket in Rwanda from the Government and local businesses would be high for even a developed nation with a cricketing background",
            "Maybe not the most interesting but I think it’s actually pronounced Rgwanda!",
            "It’s clean as hell",
            "The British 🇬🇧 Government would like folk to ‘visit’ there, having sponsored Arsenal Football club in this effort for more than a decade",
            "Almost a million people died in less than 3 months in the 90s and almost noone knows a thing about it.",
            "167th in GDP per capita. Despite its progress, it’s still pretty behind",
            "Went to a wedding there in the late 90s. Cows are still a very important wedding gift. The couple received 17 cows that night.",
            "Wakanda is within Rwanda",
            "Rwanda genoc1de",
            "Living proof absolute shitholes can be salvaged as long as people are held accountable for the consequences of their own actions",
            "What is the lake next to it",
            "She's my Ex..",
            "The R is silent..",
            "Rwanda is the geographic inspiration for Wakanda (or at least the Burundi-Rwanda-southwest Uganda-eastern DRC region is).",
            "Imagine if every person did one hour of community service a month!",
            "Damn good coffee",
            "It is day time in Rwanda when the sun is shining in the sky.",
            "It exists",
            "That big lake over there has the potential for a limnic eruption and kill millions",
            "Used to be a German colony (part of German East Africa)",
            "Its ruling elite are the minority Tutsi people whose ancestors apparently migrated from somewhere in Ethiopia. It’s illegal to discuss about Tutsis and Hutus the ruled majority as two different ethnic groups in Rwanda. Tutsis are known as one of the tallest people in the world, this is Rwandan presidents daughter who is being groomed to take over his position after him.\n\nhttps://preview.redd.it/gn5mbv7f948d1.jpeg?width=750&format=pjpg&auto=webp&s=c041633bc811ce41925216126a07f67a4a950f1f",
            "I hear their hotels are nice.",
            "Lake Kivu has the potential for a limnic eruption that could release hundreds of cubic kilometres of CO2 and Methane quickly suffocating millions of people who live on its’ shores.\n\nRwanda is also stunningly beautiful.",
            "Rwanda spelt backwards is Adnawr",
            "Spelled backwards, it’s “Adnawr”, which is… something.",
            "Only country in the world that starts with two consonants?",
            "That's actually a really good idea",
            "lol this is literally so smart. the idea alone encourages everyone to not litter.",
            "We need this everywhere. I would do this. Well done, Rwanda",
            "what do you mean by « litter free » ?",
            "Is it something that is abused by the elite in which the poor have to do it but the wealthy can seek exemptions?",
            "I just looked at a few parts of Kigali on it. There are so many walls everywhere.",
            "Rwanda is known as the Land of A Thousand Hills! The “Hotel Rwanda” as called the Hotel des Mille Collines, which translates to Hotel of a Thousand Hills.",
            "There’s a popular ultradistance amateur race there, Race Around Rwanda. Contestants are required to bring old bike gear to donate.",
            "That's amazing, and totally makes sense as I know bike racing is extremely popular. The Tour du Rwanda is is held annually and 'Team Africa Rising' (formerly Team Rwanda) is well know in cycling circles in Western countries (they promote cycles tours too for tourists).",
            "But taking war into Congo like Russia elsewhere.",
            "Well that’s a big plus",
            "Probably has better cell phone coverage than Switzerland though",
            "Mark Rober did an excellent video on that",
            "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^Abracadabrism:\n\n*If you remove the*\n\n*First letter you get Wanda*\n\n*Which is my great aunt's name*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
            "At a Miami Beach nudist beach, I saw a Rwandan guy come out of the water with \"Wanda\" tattooed on his penis. I asked him if he was acquainted with your great aunt, and if that's why he tattooed her name on his private part. He said that no, the water was a bit cold, but his tattoo actually said \"Welcome to Miami Beach and have a nice day\".",
            "Mine too!",
            "Lake Kivu on the west is the most deadly lake in the world. There is a lot of methane underneath that seeps up. It has exploded and killed people. Now the Rwandan government collects methane and uses it for electric generation.",
            "And excellent tea!",
            "Does it?",
            "They tried to, but it was blocked by the courts. Only one refugee ended up going and he went voluntarily.\n\nThe conservatives managed to get the bill passed just before the election was called and parliament was dissolved. It’s very unlikely now that anyone else will be sent to Rwanda.",
            "I think they’ve sent two there so far, by essentially bribing them.",
            "Wouldnt imagine hell to be clean tho",
            "I think it’s what most people think of when they think of Rwanda. It was one of the most brutal genocides in human history",
            "\"Almost no one\" screams Gen z",
            "Almost no one in the world who was alive then would agree with this statement. It was international news for months.",
            "They made a movie about it in the 2000s.",
            "This should be top. I know it's awful, but there's an entire western generation that probably knows almost nothing about it (or any other African conflict: ever heard of the Second Congo War? It ran from 1998 to 2003 and caused over 5 million deaths). Absolutely defined Rwanda, and we have a duty to teach and learn about it.",
            "Ok I know I'm 37 but I swear this was all that was in the news when I was a kid. Everyone knew about it",
            "If by \"almost no one\" you mean,  \"virtually everyone who was alive then because it was plastered in the news for years, plus anyone afterward who was not living under a rock,\" then yes.",
            "I'm so surprised this wasn't the top and only comment. They ran out of bullets to kill people with. Most of the world's attention was on the OJ trial",
            "Not the only way to measure a country",
            "No it’s not, it’s a fictional place from children’s entertainment.",
            "It's an anagram of and raw.",
            "Thailand? Philippines? Bhutan? France, Spain, Ukraine, Ecuador, Equatorial Guinea, china, there’s quite a few",
            "I can already hear the screams of 50% of my country’s people who would believe this violates their rights somehow",
            "The current UK government is about to be throw out on its arse in part because they want to bring this in for 18 year olds. Practically everyone in the country hates the idea. It’s one of those things that sounds great until it turns up at your doorstep and then the practicalities of it make it a nightmare policy.",
            "Kind of a neat thought: what would they all do for the three hours when litter has been so successfully minimized?",
            "My father and I regularly cleaned (he still does, I moved to another country) around our building, and we fixed broken sidewalks uprooted by trees, cut grass,  put lights in dark areas where drunks and junkies would piss and shit, and so on. What I'm trying to say, you can do this without anyone mandating it.",
            "Rwanda brings Wonders! A possible oasis for people like me who’s got some tidiness OCD/hates litters. \n\nHaving said that, I was actually disappointed when I visited Singapore for the first time - I drop something on the floor as I was just about to enter a hotel lobby. When I picked it up, it had something sticky on it - it was someone’s saliva. So there might not be any chewing gum or ciggy butts on the roads/streets, but definitely not saliva free.",
            "If the wealthy pay all the taxes, which benefit everyone else who takes more from the system than they give, I don’t see a problem with it actually.",
            "I also looked at Kigali. Seems to me that most of the many walls I saw there were put up by private residences.\n\nOne of the things that stood out to me personally is that what I think are their motorcycle taxi drivers seem to all be wearing a standard uniform—red vest, red helmet, and red motorcycle. In the (likewise poor) country I'm from, motorcycle taxi drivers just wear casual clothing. This makes it easy to accidentally hail down a non-taxi motorcycle, to the mild annoyance of the guy just trying to drive home from work. A bit of a tangent I felt like mentioning for no particular reason.",
            "I went Rwanda last year 100% because of that video.  Would highly recommend!",
            "Epic bot",
            "**huh**",
            "It does: tropical temperatures plus lots of elevation.",
            "I’m sure most OCD folks end up there",
            "Helped by western charity work.\n\nSwiss (the case I am familiar with) development money went to Radio Mille Collines that was advocating for months to murder Tutsis. It's not like they didn't know it, but thought it was ok.\n\nQuite a stain.",
            "We actually spent a not insignificant amount of time on it in AP World. Though tbf, I doubt many people in my class actually *remember* learning about it. Most people were there to look good to colleges rather than an actual interest in history",
            "\"I just discovered this unknown band who played in the '70's called Led Zeppelin, why haven't more people heard of them?\"",
            "It was a huge deal and I remember it clearly.",
            "I wrote a 50 odd page coursework about it in university years ago and at some point I really regretted digging into that rabbit hole. People are capable of doing unimaginable things to each other when it comes to violence. Creating new ways of hurting each other in thousands of ways and prolonging the suffering is something we are really really good at sadly.",
            "To be fair, the geographical features attributed to Wakanda in the comics are those found in the Burundi-Ruanda-Uganda region. You could say it was partially inspired.",
            "Ummm no it’s not wakanda is real it just joined nato.",
            "Or raw DNA.",
            "You started great and got a bit sloppy towards the end…",
            "Good start, but then you said Ukraine, Ecaudor and Equatorial Guinea for some reason...",
            "Sweden? Greenland? Brazil? French Guinea? Chile? Trinidad? Greece? Chad? Myanmar? \n\n\nI'm starting to think OP might be wrong.",
            "If you’re American, one could make an argument it violates the 13th amendment.",
            "It is mandatory, failure to comply can result in a fine. I'm pretty sure this goes against multiple constitutions, so those 50% would probably be right depending on where you are.\n\nStill, a voluntary initiative with a lot of marketing and designated 'centers' for this stuff would be nice. Could bring neighbourhoods/towns together and stuff. One could also sweeten the deal with coffee and cakes, (or whatever one uses to lure people into gatherings in your country).",
            "Only 50% of the country would oppose forced, uncompensated labor?",
            "They would be right, according to the constitution.",
            "I mean if you're required isn't it literally just forced labour?",
            "I was in Rwanda on such a Saturday; the answer is - mill around, mostly brush dust back and forth on their street and congregate in corners gossiping and chatting (including to foreigners walking around trying to find an open bar for a drink).\n\nIt is an exceptionally clean country (at least Kigali is) and I suspect it's more to do with not littering than necessarily the ritual community clean up. Although, in many ways, perhaps the fact that they know if they litter they're going to have to clean it up anyway discourages them? \n\nAlso the armed police *everywhere* might act as a deterrant.",
            "How tf are you gonna keep the streets saliva free constantly? Mop all the streets every day?",
            "Most fucked up shit ever. My favourite game was Far Cry. Apparently the games reference the Rwandan massacres a lot as a lot of the fighting was coordinated by radio propaganda so you'll see lots of radio stations in the game",
            "Oops, I just saw the second letter being a consonant. Now this makes me look fucking stupid",
            "How? Does getting drafted to the military violate the 13th amendment? It doesn’t happen now but it has and still possible.",
            "Honestly mad how they'd think this would be a classic right v left debate. This is a \"I work hard all week, I shouldn't have to do uncompensated labour in my free time because my taxes should pay for basic public services\" debate",
            ">It is an exceptionally clean country (at least Kigali is) and I suspect it's more to do with not littering than necessarily the ritual community clean up.\n\nWhen you have to clean up after yourself, you start littering less.",
            "3 of them also start with vowels lol",
            "Also, the first three start with two consonant letters, but only one consonant sound",
            "Good question! The 13th amendment forbids “involuntary servitude.” Given that, I would argue that the draft is indeed unconstitutional, despite past rulings by the Supreme Court.",
            "I think \"involuntary servitude\" implies non-payment, so the draft most likely squeaks through because you're paid for your service.",
            "\"Make me? you and whose army?\" remains a important legal question",
            "Not necessarily, I believe that specific performance of a contract, i.e., a court order requiring a party to perform a specific act to fulfill a contract, is not granted for personal service contracts because of the 13th amendment. Not a lawyer, though.",
            "No.  By that logic, slavery could have survived the Thirteenth Amendment so long as slave owners in some way paid their slaves.",
            "Would that be indented servitude?",
            "It actually kinda did for a long time via sharecropping.",
            "Forgive me for being imprecise: \"Involuntary servitude\" implies non-payment as one of several conditions.",
            "Not quite. Indentured servitude is basically using your labor to repay a loan (I.e. 100% of your \"wages\" go to loan repayment). While indentured servants of the colonial era had a rough go it and there were no doubt abuses, injustices, and death, fundamentally the person agreed to the arrangement and there was a nominal end of term."
        ]
    },
    "Would it be more feasible to build a bridge to Vancouver Island from the state of Washington than the mainland of Canada?": {
        "title": "Would it be more feasible to build a bridge to Vancouver Island from the state of Washington than the mainland of Canada?",
        "score": 1092,
        "url": "https://i.redd.it/zir5nzpyly7d1.jpeg",
        "content": "The major population centers of British Columbia are far from the island, and the close parts to Vancouver Island are very rocky and mountainous where a road cannot be built. Therefore, is it more feasible for the bridge to be built to Washington?",
        "num_comments": 218,
        "comments": [
            "longest bridge over water is about 24 miles, and this bridge would be 26 miles",
            "I'm in Victoria. Originally from Vancouver.\n\nGenerally speaking, there isn't much will to put a fixed link to the mainland from those that live on the island. People here prefer the separation and not to be connected to Vancouver as it would create even more of a likelihood that the island communities would become bedroom communities of Metro Vancouver.\n\nSo, even if there was serious consideration to being connected through the US, the likely consideration would be through the San Juan Islands. However, would the San Juan Islands WANT to be connected to the US mainland as well?\n\nWhile I have never been there, our own San Juan Islands, the Gulf Islands, do not want to have a fixed link, to either Vancouver Island or the mainland. When a bridge to the mainland has been discussed as cutting through those Gulf Islands, there actually is something called the Island Trust which part of their governance forbids a fixed link connection, even a fixed link between the islands themselves.\n\nSo, what's the purpose of a fixed link connection? Beyond tourism, mainly it would be commercial traffic and delivery. So would it make sense to create a connection to deliver goods from Canada, where you need to cross the border twice to deliver them to the island.\n\nWhile you indicate that the part of the island / mainland are rocky and away from the population centers, the northern part of the island would make the most feasible sense to do. This has also been studied. The area on the mainland called the Sunshine Coast as well has no fixed link, and that even though it's part of the mainland, you need to take a ferry there. There has been talk about making a fixed link from Squamish and over, following old logging roads, and that this possibly could as well be considered to do some island hopping to Vancouver Island as part 2.\n\nWhile it seems like a poor place to do this, with upgrades to the highways leading to this, would allow for truck traffic to come through Hwy 99 and bypass Vancouver itself from a route from the interior.\n\nSo, while it could be more feasible to consider going through the San Juan Islands, I've never ever seen this discussed and with my rationale and reasoning, I don't see why this would even make sense. The north island route, one that would bypass the Gulf Islands and any potential floating bridge across Georgia Strait to as well accommodate boat shipping traffic could happen, seems like the most plausible if there is a will and desire to do this.\n\nIt would make no sense to me even if feasible to connect us from Port Angeles. There is no interstate going anywhere near there and the Olympic Peninsula itself is remote as a result.",
            "As other commenters pointed out, the parties involved likely do not want a bridge. The ferry systems (this one and other WA ferries) have worked very well for me in the past. What we need is a couple new ferry boats.",
            "It would cost an astronomical amount. And the engineering would be difficult. It would be easily one of the longest bridges in the world. Its deep water, and earthquake zone and a really busy shipping lane. It simply will never happen. The other question is do people on Vancouver Island even want a fixed link to the States? I don't think many do. The ferry service to the BC mainland could be improved for a fraction of the cost.",
            "It's an answer to a question that no one is asking.",
            "in addition to other things people have pointed out, the Puget sound is also quite deep. For example, there is an island west of Seattle called Bainbridge Island, and there is only ferry service to it but no bridge because if you dropped the space needle in that water you wouldn't be able to see it.  Iirc near Seattle the sound is like 400 feet deep",
            "Too long and that area gets high wind and heavy rain in the winter. Also disrupts shipping if not done properly.  There is a ferry from Port Angeles so its really not needed. ",
            "I used to live in Victoria. The top problem is just how unpopular bridge is locally. It's some what a common saying \"Thanks God we don't have a bridge to Vancouver\".",
            "Keep in mind that's one of the busiest shipping lanes on the continent.",
            "Finally, a thread about building unbelievably massive, expensive and complicated bridges to connect a low population island.",
            "Its probably more feasible in the technical sense, but its still a crazy idea.   Nobody is taking 6 hours to drive Victoria to Vancouver with two border crossings via Port Angeles and Seattle.",
            "Is it more feasible?  Sure…is it reasonable? No.",
            "Well: \n\nyou could build a bridge for far less distance with one side of it being destination pure Rockies (around Sayward, BC). \n\nOr you could build a much longer bridge to connect near Victoria to Washington. \n\nI'm not sure a bridge in either situation is merited.",
            "A better connection would be from Campbell River, crossing over to Quadra Island, then Read Island, then Cortez Island, and then connecting to the mainland near Bliss Landing. This goes through Powell River, then connect across Nelson Island to the mainland again to the Sunshine Coast Highway. Then you either have a bridge over the Squamish River in Squamish, or a bridge somewhere across the Howe Sound. It keeps it disconnected from Vancouver by a good distance, but still has a road connection with no super long bridges. Seems the most feasible route to me, but it’s probably something that really wouldn’t happen.",
            "nope",
            "I am from Vancouver Island and I can tell you the locals do not want any bridges to or from their island. It will never happen.",
            "Building and incredibly important expensive bridge in the vicinity of a major fault line expected to pop in the next century or two seems like a poor choice.",
            "It would be totally ridiculous to build it. It's very far, deep and a major shipping lane. It would be the most crazy bridge in the world, and not enough people would use it.",
            "Not sure if there is a worse place to build a bridge span than the Strait of Juan de Fuca.",
            "Not worth it enough to build like a 25 mile bridge.",
            "The BC government maintains a great website addressing this question. Issues include the length, depth, seabed type, waves, wind, shipping traffic, earthquakes, cost (including inevitable tolls) and that no similar route has ever been constructed.\n\n[Vancouver Island - Mainland](https://www2.gov.bc.ca/gov/content/transportation/transportation-reports-and-reference/reports-studies/vancouver-island/fixed-link)\n\nMy favourite suggestion is the submerged floating tunnel - it’s described as “unproven” and noted that a “breach would be catastrophic”",
            "Maybe from the peninsula east of Sooke would be more feasible? Looks much shorter. Although, the terrain could very well be rugged and unsuitable. Plus, looks like they would have to construct a new road as well.",
            "AS someone who lives in Vic it looks like a long ass distance to build a bridge and we already have ferries to Seattle and pirt angeles plus u can just fly for cheaper and faster, definitely unnecessary.",
            "Why don’t they just build a really long bridge? Are they stupid?",
            "I think we need to reignite the pig war and build bridges to the mainland through San Juan",
            "Considering that port angles is pretty remote I doubt it. Plus the city makes decent money from parking fees",
            "No. The most feasible would be Tsawwassen ferry terminal to Salt spring Island (over Galiano Island) which is just under 20 miles avoiding US territorial waters or about 18.5 if right of way can be negotiated with US.  with a second bridge of 3.5 miles from Vesuvius to Crofton on Vancouver Island.  \n\nIt is more direct for populations, crossing less deep water, deepest being around 150 meters, and offers only two major crossings instead of at least 4.  It also has more existing road infrastructure that can accommodate the traffic and would not be an international crossing.\n\nMore feasible than trying to island hop the San Juans, but still not feasible.",
            "The ferry is fine. I've only been up there once, but you can also package the ferry ticket with hotel and attractions. With the exchange rate, I got a nice little weekend out of it without spending too much.",
            "There’s already a ferry. Would be crazy expensive to build and probably made even more complicated by starting and ending in different countries. i work in transportation and it’s already complicated getting consensus on projects due to all of the stakeholders. This doubles the number of stakeholders. \n\nI can’t even imagine how big the EIS would be on this. \n\nBasically this is so out of the realm of possibility that it will probably never happen, and i have even mentioned that there’s not enough traffic to justify the cost, which would be in the billions, 5-10 probably.",
            "this sub is just about the best thing on the entire internet. every single day i learn something new or am reminded of something i once knew but forgot. regarding the post, i suspect that if an extension bridge were feasible, it would have been done earlier this century. (since 2000)",
            "I don't see what the point would be, the big cities in that area are Vancouver and Seattle, both of which are already connected so going over Victoria (a city of less than 100.000 inhabitants) with a bridge just seems like a huge detour and meaning the bridge will take far too long to earn back its massive price-tag.\n\nOther issues I could think of is that you appear to suggest a North-South bridge, which is about the worst way you can align a bridge because winds tend to be east/west in direction, so the whole thing is likely to shut down if the wind gets a bit brisk. \n\nAnd finally, shipping lanes, we've seen what a big cargo ship can do to a bridge if the accident happens, and here you will have to design the bridge to make space for them meaning its got to be tall, making the wind issue worse, or you have to put restrictions on what ships can visit Vancouver and Seattle, which I doubt either will be in favor of.",
            "I used to travel between Port Angeles and Victoria all the time. The ferry is awesome and doesn’t take much time. To create a bridge / roadway between here would take considerably more traffic than the ferry pulls. And the ferry was not super busy. The 101 highway going up there from Shelton/Olympia is beautiful though",
            "I have sailed this area a few times as a passenger. I would not envy the people tasked with building this bridge. As it stands, there are already multiple ferry systems to get to Vancouver Island from WA. If it ain’t broke…",
            "no i think this would be easier\n\nhttps://preview.redd.it/o0jxdwhh108d1.png?width=1101&format=png&auto=webp&s=f34c91e10ca0182ffc32eea4de7b030dd92562c9",
            "The main problem is there isn’t enough traffic that would want to go from Vancouver island to Washington state. And vice versa. As it is there is one small foot ferry only between Seattle and Victoria and it’s hardly ever full. \n\nMost of the traffic from Vancouver island wants to get to Vancouver and not the USA.",
            "Port Angeles is the largest city on the Olympic Peninsula and is under 20k people.  It takes multiple hours to get there from Seattle.  Victoria is not on the BC mainland and isn't huge either.  And then there's everything else mentioned, most notably the weather, wave action, and potential tectonic movement.  This would be an extremely dumb idea.",
            "The current connection by the Black Ball ferry MV Coho -which carries 115 vehicles and dates back to 1959- makes four round trips daily; where's the demand for something like this?",
            "Both are bad ideas.",
            "There would be insufficient traffic to make what would be a profound engineering undertaking worthwhile. Highway 101 up the Olympic Peninsula is predominantly a 2 lane road, and much of it runs along the Hood Canal portion of Puget Sound. It’s a long winding road that would require lots of work, in environmentally sensitive areas, and an Indian reservation, to achieve. Then after all that you would just be making it easier to get to Vancouver Island, which has the same issues with roads and environmental impacts. Add to that the vast majority of folks who live up there aren’t interested in making things more accessible.",
            "Lots of good reasons here, but there’s one more: the US Navy would NEVER allow this to get built. \n\nAll an invading force would have to do is destroy the bridge, then suddenly an entire US Navy carrier group at Bremerton and at least three nuclear subs at Bangor would be trapped in Puget Sound.",
            "Y'know the original plan was to have the CPR terminus in Victoria.  They drew up plans in the 1870s that the train line would carve down the coastal mountains and they would build a series of stone bridges across to the Campbell River Area.  Of course John A MacDonald was a drunk.",
            "I’m from Victoria. Nobody here would want to have all that money to build an expensive bridge to the middle of nowhere. No offense to people from Port Angeles. Plus there are ferries that do just fine.",
            "I have been on the ferry across this straight on a windy day. The waves were intense. My wife spent most of the ride throwing up in the bathroom. I was pretty close to vomiting myself. I am not an engineer but I bet that makes building a bridge pretty difficult.",
            "that is 20 miles, over 200 foot deep water. That would be some serious engineering, and a full cities worth of material.",
            "why does this have so many upvotes? It makes no sense when you think about it for 10 seconds",
            "There is nearly sero reasons to build a bridge or tunnel from Victoria to Port Angeles. Only someone with no familiarity with the area would even suggest an idea like that.\n\nA bridge is never going to happen. Not only due to winds, tides, rains, but earthquakes. The area is overdue for a magnitude 9+ earthquake. Nothing in that area is designed to survive such an event and the fault line is maybe 100 miles west.\n\n100% of the trade to Victoria comes from the BC mainland. To utilize the crossing, a semi truck would have to cross the BC/WA border, drive around the Puget Sound or take a ferry across the Puget Sound. With border waits, driving, then finally taking the crossing to Victoria, you are looking at a 10-24 hour journey. It's faster to take the ferry at Tsawwassen to Victoria and not worry about any hassle at Customs.\n\nA rail tunnel like the one from England to France is the only way to make such a crossing to Vancouver Island work. But there is no real rail infrastructure in that area. A tunnel under the Straight of Juan de Fuca would need to go deeper than 400 feet. In some places the depth is 900 feet. It's the same issue with the Haro Straight and the Straight of Georgia, they are incredibly deep. Plus there is the earthquake issue.\n\nThere simply isn't an economic justification to build a crossing. Beyond that as other commenters mentioned, you don't move to Port Angeles or Vancouver Island because you want to be in the middle of a metropolis. You can find that nearby in Vancouver or Seattle.",
            "Nuclear submarines come through there, to get to Bangor and such.\n\nIt wouldn’t be allowed.",
            "What would be the point?\n\nIt would probably be the most expensive Infrastructurist project in Canadian history, and it would service less than 1M people (island is 890k).",
            "There's already direct ferries from Victoria to Vancouver and Seattle, not sure there is en economic case for such an enormous piece of infrastructure",
            "What about the mega tsunami?",
            "We just went through there on vacation!    \nCutest little town!    \nNice little ferry ride....but I don't see a bridge that long over water that deep....I'd hate to go over one THAT tall...in high winds?!",
            "Why would you connect the direct center of a town? Move it over to the left for that muuuuch less mile gap",
            "Just chiming to say that the Coho ferry ride is one of if not the prettiest in the world.",
            "Vancouver Island  have a low population",
            "Driving piles in the strait of juan de fuca would be...problematic.  Technically you pass the 100 fathom curve in the strait",
            "There’d sooner be a bridge built between Vancouver Island and the Canadian Mainland than this proposal simply because there’d be more demand, being one country and all. Port Angeles isn’t a big city nor is it easily accessible to Seattle as it is.",
            "Sounds a little like you’re just asking if Victoria is closer to the us or Canadian mainland.",
            "Why not island hop from the east? The straight there is too deep.",
            "Would love to see the response on r/askengineers wrt feasibility and the lack thereof.",
            "Not to Port Angeles.",
            "Not to Port Angeles. I have been on that ferry ride.",
            "I’ve read the proposal paper and one thing that stood out engineering wise was that the ocean floor is too soft adding to the complications.",
            "Looong brige $$$",
            "Feasible perhaps. Attainable absolutely not. If you are want to fire up a group it’s Vancouver Island with another connection to the outside world. They will turn their spirit bears on you and it’s all over.",
            "Saw a bear on the beach in Sooke. \nGo to Song & Surf in Port Renfrew. \nTake the dang ferry and be happy.",
            "But why? Victoria isn’t exactly a major economic destination.",
            "Hear me out.  Super drones lift your car, using magnets, and deposits you on the other side of",
            "The reason there is no bridge is because\n\n1. Cost: it would end up being the longest bridge in the world\n2. The ocean gets is too deep there and it would be the deepest bridge in the world\n3. The weather is too extreme\n4. The soil at the bottom of the ocean in the straight of Georgia is too loose to pile drive properly",
            "Winter storms in that area get wild too.",
            "Magic 8 Ball says no.",
            "What's the reasoning and question???",
            "No.",
            "Short answer to OPs question: no. \n\nReason: see all the other answers.",
            "Port Angeles is just a bizarre city to connect to. Not enough there to ever warrant a bridge",
            "Chunnel.",
            "Would be better to just put a ferry line there",
            "You might be able to have like a bridge tunnel. I grew traversing the Chesapeake bay bridge tunnel. I believe it’s around 17 mile long.",
            "It's more feasible to use boats.",
            "How about you don't drive everyhwere??? OMG.",
            "What American wants a bridge to BC?",
            "good way to ruin Port Angeles, one of the very few normal towns lefts on the pacific coast.",
            "A tunnel would probably be more appropriate",
            "https://preview.redd.it/6r2ljlws8z7d1.png?width=601&format=pjpg&auto=webp&s=04dc8a6779b48a4c35038688dd7abcc8c4750059\n\nThis way would make the bridge shorter, while only moving it a bit west connecting a road and Sooke",
            "If you make it like the Chesapeake bay bridge-tunnel, maybe it could work. The tunnel bridge is 17.6 miles so this would be about 1.7 times the length. It could be done if it was jointly funded.",
            "Also worth noting that the longest bridge over water in the US is over Lake Pontchartrain which maxes out at about 12 feet deep.",
            "We’re gonna need a bigger bridge.\n\nI was just out at Port Angeles. Cute little town. Has a rad crabfest.",
            "It'd be one a hell of a marathon course.",
            "...and this bridge would need to allow for aircraft carriers to pass under. There are multiple naval bases in the Puget Sound.",
            "That would be a boring annual marathon",
            "Sounds like a new record opportunity to me",
            "Do we know if the water is troubled?",
            "Hong Kong has a bridge that is 34 miles long including 4 artificial islands. \n\nhttps://en.wikipedia.org/wiki/Hong_Kong%E2%80%93Zhuhai%E2%80%93Macau_Bridge",
            "Yeah, that gap is huge. Plus you have naval fleets that go through there.",
            "[deleted]",
            "but longest sea crossing is 34 miles, so I guess it is doable?",
            "Sounds possible. There's probably no hurricanes there either.",
            "The San Juan's definitely don't want a bridge either. We just want new ferries that are well staffed and on schedule.",
            "Also: it would be a bridge to nowhere. Port Angeles has a population of 20k, is in the middle of nowhere, and is a 3-hour drive from Seattle. So it would be spending billions to not really connect anywhere worth connecting.",
            "As somebody who has multiple connections to the San Juan Islands, I can assure you they don't want anybody out there. They like living on an island. That's kind of the point.",
            "Yeah, I grew up as a Puget Sound island dweller. They absolutely do not want bridges. Being isolated is a big part of the appeal.",
            "Several people have commented that the people in the San Juans don't want a bridge.  \nThe thing is, even if they did... it is more or less a dozen miles from Anacortes to Friday Harbor. (And yes, the bridge could also touch down on Lopez Island). This is about equivalent to the longest over-ocean bridges in the world...and it would be to connect an island with 10,000 people. Even if everyone on the island was begging for such a thing, it would be one of the biggest engineering projects in the US, to an island that is about the size of a small suburban town.",
            "So you’re saying there’s a chance, like one in a million?",
            "LOL Hwy 99 from the Interior to Squamish then a fixed link to Sunshine Coast and on to the Island. Have you driven Hwy 99 (Duffy Lake Road)?  It’s not a viable truck route without more billions in upgrades",
            "I talked about it on here a few years back, someone pointed out how deep the water gets in some of the channels from Vic through the San Juans to Anacortes area. Not much more feasible than the old proposed Salt Spring route",
            "Yeah, I really doubt the San Juan residents would want a bridge. Perhaps if it was locals only, lol. So gorgeous up there! Haven't made it to Victoria yet, but I'd love to! How long is that ferry ride from say, Anacortes?",
            "Can confirm, work with a dude from the island. Asked him for advice for when I visit Vancouver BC in the fall and he blew me off saying he tries to avoid the big city at all costs and knows next to nothing about it.",
            "The Island Trust is basically the Chuck Norris of NIMBY's",
            "Even a bridge from Gabriola island to Nanaimo (currently a 15 min ferry ride across Nanaimo harbour) was vetoed by Islanders, and that one would be much cheaper and simpler to build than most other fixed links in the region. I doubt any will ever happen.",
            "i do so enjoy paying a weeks pay to ride the tsawwenn (sp) ferry to nanimo. and again back.  but vancouver island is so worth it. victoria is okay for the average tourist, but center to north  island is gods' country.\n\nas well, the water is anywhere from 450 feet deep to over 2,000 feet deep at jarvis inlet. dunno what that is in bananas.",
            "I would like to see the Anacortes ferry return to Sidney, BC.",
            "And crews to run them.",
            "Last fall, I was stuck on Shaw Island waiting to get back to Anacortes. Ended up being a 4-5 hr wait because a ferry was out of service, so they serviced the bigger islands first. More ferry's would be awesome",
            "I was going to say, there's really not enough going on in Vancouver Island to demand a bridge, especially a huge one in deep water. It's much more cost effective to boost the ferry service.",
            "Strong currents and strong winds, too.",
            "Transportation planners use a cost/benefit ratio to rank potential projects. This has such a ridiculously high c/b  ratio that it would just be rejected immediately. No further study needed.",
            "700' in places. I live on Bainbridge, and regularly torment FB island groups suggesting the feasibility of building a bridge either to Seattle or Bremerton, because 1. I'm an asshole  and 2. It's lovely getting a rage out the local dotards. A bridge was proposed in the 60s and roundly shot down. There is one bridge on the north end of the island to Kitsap County and the peninsula businesses and outdoor activities in the Olympics.",
            "And this isn't even Puget Sound, it's out in the Strait of Juan de Fuca so even more exposed to wind and weather coming in off the North Pacific.",
            "Realistically if there was going to be a bridge to Vancouver, it would be in Nanaimo. But of course, it'll never happen anyways so whatever.",
            "I mean by Canadian standards the population isn’t that small (medium id say) By American? Yeah I guess. Everything else I agree with though",
            "Constructability is one of about 25-30 fatal flaws on this. I keep thing of new ones every 10 seconds. I can’t even imagine a contractor wanting to take on the risk this would entail. I mean, they could technically build it, but it would be a constant minefield of issues.  The one I just thought of is that this is major shipping lane for both countries. It’s just got disaster and boondoggle written all over it",
            "Maybe you know this, but for everyone who doesn't and might be interested, way back in the 1870s when BC joined Canada on the condition that a transcontinental rail link would be built to the Pacific, there was a plan to build the railway across these islands, or other nearby Discovery Islands, to Vancouver Island, then south to Victoria. William Fraser Tolmie, one of the HBC \"fathers of Victoria\", even wrote a paper about the two main routes under consideration at the time, with the impressively long title *[Canadian Pacific Railway routes. The Bute Inlet and Esquimalt route no. 6, and the Fraser Valley and Burrard Inlet route no. 2, compared as to the advantages afforded by each to the dominion and the empire.](https://open.library.ubc.ca/collections/bcbooks/items/1.0222229)*\n\nI haven't read that paper, but my understanding is that the railway route was envisioned as going from the BC interior through the Homathko River canyon, then down Bute Inlet, an 80 km long fjord that is mostly cliffs into the sea. Then across bridges over several islands to Quadra Island, then a bridge over Seymour Narrows to Vancouver Island at Campbell River, then down to Victoria.\n\nIt was basically reviving \"Waddington's Road\", an 1864 attempt to build a road from the interior to Bute Inlet. But the Tsilhqot'in (Chilcotin) First Nation asserted their sovereignty and stopped construction, triggering the colonial government to wage the [Chilcotin War](https://en.wikipedia.org/wiki/Chilcotin_War), which involved the deliberate use of smallpox as a terrorizing bioweapon against the Tsilhqot'in, and ultimately the hanging of a number of Tsilhqot'in chiefs who were only exonerated in 2014.\n\nObviously the powers that be chose to make the railway terminus on Burrard Inlet and what became Vancouver instead. Not only because the Bute Inlet route would have been stupid expensive, but because of the Chilcotin War and the resulting chaos and danger in The Chilcotin and along the Homathko.\n\nIn any case, a bridge from Cortes Island to the mainland at Bliss Landing, while possible, would certainly alter the feel of Desolation Sound quite a lot!",
            "A know someone who worked on the Victoria Clipper for years. Has a number of intense stories relating to bad weather. The Strait of Juan de Fuca can get large swells coming in from the open ocean. Like up to 30 foot swells. In the little aluminum Clipper people vomited all the time when there was weather, apparently. Sometimes the Clipper has to take shelter behind the aptly named Protection Island at Discovery Bay. Sometimes it did so only after taking a nose dive into a big swell, or getting wave smacked hard enough to break windows. Of course normally the weather isn't *that* bad and the Clipper can be quite enjoyable.\n\nThe Strait is much more ocean-like than Puget Sound or the Strait of Georgia. Ferries in Puget Sound are \"flat\" looking. Puget Sound can get choppy sometimes, but never has the kind of seriously dangerous seas that the Strait has. Puget Sound ferries could not handle the Strait of Juan de Fuca, where you need \"ocean worthy\" vessels. Plus it is frequently completely foggy over the water. Really thick fog that can last all day.\n\nIn other words, yea, The Strait can get some really serious and nasty weather.",
            "The depth alone isn't a challenge. Norway has tunnels 900+ feet deep under the ocean.",
            "there already is a ferry there, the Coho",
            "The Strait of Georgia is a lot deeper than Chesapeake Bay. It’ll be a pretty big challenge to build a tunnel.",
            "This is someone even worse than the original suggestion, the road between Sooke and Vic is already way over capacity and the bridge could get you even furthur from Seattle.",
            "Also isn't in a highly tectonically active region.",
            "Maxes out at 65' deep. Average depth is 10'-16' though.",
            "And also is the super important gateway to the pacific for our nuclear submarines",
            "Beautiful area",
            "Birthplace of John Elway!  Also had the best jumbo prongs of my life at a spot there in the late 90's.  Cool area.",
            "I had a crabfest once. The shampoo and comb did the trick.",
            "Sounds like that bridge would ruin the area with more commerce / traffic running through there.  Also, like other posters said. There no major highway there anyways.",
            "I ran both the Port Angeles and Victoria marathons. Would love to now add this one to the list.",
            "Plus gigantic cargo ships going into seattle",
            "The Chesapeake Bay Bridge has an annual 10k over it. The wind blowing against you can be tough.",
            "S&G reference aside, the waves in the Juan de Fuca Strait are pretty rough open ocean waves.",
            "Isn't that a system of several (still long) bridges and a tunnel, that all combined sum up to 34 mile length? Not a single bridge.",
            "i'm no expert, but I'd imagine a river delta is shallower than a strait",
            "> longest bridge over water",
            "No hurricanes, but the strait does get high winds, which would present some engineering challenges. The bridge would also have to be built high enough that container ships and navy ships can pass underneath.",
            "Pretty sure earthquakes are a bigger deal than hurricanes",
            "The area between Seattle and Vancouver gets about 400 earthquakes annually.  \n \nThere’s also several rainforest in the area, so there’s a lot of rain.",
            "Lol, so many down votes for forgetting about earthquakes.\n\nI live in Florida. Hurricanes are the main concern.\n\n I've only been in one earthquake and that was in Japan. \n\nI'll also admit that I haven't been to this part of the US or Canada. I've been to more than 20 US states and to multiple Canadian cities, but the West Coast is nearly the opposite side of the world for me, so I haven't been.",
            "And get some rent-controlled places for the workers to live while you are at it.",
            "Yup, I finished my post with that part. The Olympic Peninsula is really off the beaten path too, with no interstate connection, hence why I said that theoretically it would make more sense to island hop through the San Juans, even though they wouldn't want that either.",
            ">They like living on an island. That's kind of the point.\n\nAssumed as much, and would have been more shocked to hear they'd want a bridge. Our Gulf Islands are the same way.",
            ">Being isolated is a big part of the appeal.\n\nKnowing the Gulf Islands, that is 100% the same appeal there. So I surmised it was the same, but nothing to back it up.",
            "I've lived in BC my entire 48 years on this 3rd rock from the sun, and my entire post was more or less indicating that even if technically feasible, it isn't economically feasible nor desired. The only real reason to make a bridge to the island would be for commercial purposes, getting goods on/off island easier, and those goods wouldn't be going through the US, they'd be going through Canada.\n\nTo what you are saying though, it would be the same as going through our Gulf Islands, the connection through the San Juans isn't about connecting them, but to another destination. Let's say that Victoria was like a Vancouver sized city, the goal wouldn't be to connect the San Juans but to use them to connect to another place.\n\nBut again, there is 100% no reason or need for a bridge to Vancouver Island through any US destination.",
            "There's probably a greater chance that you pick the correct lotto numbers than this happening.",
            "I've seen the idea thrown around, not officially by the government but by groups lobbying for a connection to both the Sunshine Coast and to Vancouver Island.\n\nNo, it won't happen but it's a lot more feasible than building a bridge across the Strait of Juan de Fuca if we're discussing pipe dreams.",
            ">How long is that ferry ride from say, Anacortes?\n\nREALLY long right now, as there is no ferry coming across since COVID. Port Angeles would be the only way here from the US.\n\n[https://anacortes2sidneyferry.org/](https://anacortes2sidneyferry.org/)",
            "So does everyone. I wish blackball would expand with another ferry to serve that route. Their current service of Victoria to Port Angeles is run extremely well.",
            "To say there isn't enough going on would be incorrect. There's almost 900k people that live on the Island, and another 4 million across the strait in the Lower Mainland. PEI has less than 200k and has a bridge. ",
            "I have taken the Black Ball Express ferry many times and I can attest that every crossing is a buffeting experience. The wind is so loud and harsh. And the waves make the boat sway considerably. Don't get me wrong it is completely safe but ya... definitely strong currents and winds would make a bridge a no-go.",
            "I've lived in Victoria my whole life and never heard anyone discuss a bridge to Port Angeles. Its not a thing anyone has ever actually wanted either.",
            "Agreed. The ports of Seattle, Tacoma and Vancouver have a little more pull than the few people that would benefit from this bridge. Block access from Seattle and Vancouver to Asia? Plus it will be the most expensive transportation project the world has ever seen? Sure thing.",
            "The depth isn't the main challenge. Norway has multiple tunnels exceeding 900'",
            "Hey fellow Kitsaper! ya the Seattle Bainbridge would never happen hahaha  \ni do think that a floating bridge like the Hood Canal would definitely be feasible between say Illahee Park in Bremerton and the southwest area in Bainbridge. That way it would avoid the naval traffic from PSNS and usually only pleasure craft are around there so we could build an elevated portion for them to pass below without having to raise the bridge. it would save people 45-50 minutes of driving. but hey - it's Bainbridge island. it would *never* be build lol",
            "But again, even with all these myriad issues, it is still TECHNICALLY more feasible than a bridge from mainland BC.  Thanks OP for a totally useless question.",
            "Thanks for the details. I have been on several other ferries all over Washington State's coastal waters,  never even got a little nauseous until I traveled Victoria to Port Angeles.",
            "I understand reading comprehension is a lost art. I would like to once again mention the active fault capable of delivering a magnitude 9 earthquake only 100 miles to the west. No tunnel or bridge in the region is capable of withstanding that. Plus every other reason I mentioned.",
            "Also isn't in a major international shipping lane too.",
            "Also aircraft carriers move through there",
            "Off topic but I got to tour a docked nuclear sub at Bangor pre-9/11.  Only place we didn't get to see (rightfully so) was the reactor room.  I believe it was the USS Kentucky.",
            "My family lives in Pt Townsend. I can attest that it’s beautiful there.",
            "How did you stumble into the crabfest?",
            "We ferry-hopped around up there a few years ago, I don’t think I’d want to do it any other way. Such a great way to see the area",
            "I’m sure you could call it what ever you wanted to. \n\nThe bay bridge that connects Oakland to San Francisco stops off at an island and no one says it’s two bridges.",
            "I’m pretty confident in that too.\n\nI’m also confident that it’s still a bridge and that that 34 > 24",
            "It would have to be a tunnel, like in the Chesapeake. \n\n\nAccess to Puget Sound is too important, given so many of the Navy's nuclear subs are stationed there. \n\n\nBut a tunnel would present additional challenges since it's something like 200 or 300 m deep. Although the same challenge exists for supporting a bridge.",
            "How about one of those bridge/tunnel/bridge things like what crosses Chesapeake Bay?",
            "Ah hell i missed the last bit. My bad!",
            "But there is A chance.\n\nEdit: Edmonton Oilers fan, so I’m betting on all the long odds these days!",
            "Totally agree",
            "I’m in Seattle and there are several options for getting to Vic. No one here thinks a bridge would be a good idea",
            "The main challenge is building in an active subduction and fault zone stretching from Vancouver Island to Mendocino California. Of course nothing might happen for 7000 years, then again, a 7.0 earthquake could happen as I finish this sentence. No sense sinking close to a trillion dollars in one.",
            "Never say never. Take a look at Manhattan in 1770. When Starfleet builds their base in Georgetown the island will be overrun with workers needing homes.",
            "Actually the bridge from mainland BC might be more feasible since at least the waters are more protected.",
            "Yes, I merely pointed out that depth is not the issue. I understand succinctness is also an underappreciated art.",
            "Also doesn’t have insane tidal flows.",
            "That is why the Chesapeake bay bridge and tunnel has the tunnel section.\n\nBreak the tunnel as hard as you like and ships can still pass.",
            "Somewhere there is an old 35mm picture of me and a buddy sitting at the helmsman stations of a boomer in our Scout uniforms.  This was \\*way\\* before 9/11.",
            "Wow, just discovering about that base through this post, and now praying we never piss off Canada. Gonna make that base hard to protect.",
            "The northeast corner of the Olympic Mountains is highly underrated. Everyone goes to see the Hoh Rainforest, but to the east it's a dry forest with waterfalls and huge rhododendron bushes.",
            "You know… festival atmosphere, loud music, drinks…",
            "Ah, so you are the worst sort of correct.  Good job.  Or well… sub adequate job.",
            "This will never happen. Best guess is that a 26 mile tunnel between two countries would cost $10 billion at least.",
            "The average depth is 100 meters. I think that type of structure would be difficult to build and maintain.",
            "The Chesapeake isn’t tectonically active. I’d be hesitant to build a tunnel that long that far underwater in a region that experiences earthquakes",
            "All good, but yeah, mainly was saying I 100% agree. It's a theoretical bridge to nowhere.",
            "What I read were more feasibility study levels on creating this. Essentially they're proposing a new route to the coast, significantly upgraded, with a byproduct being traffic would be alleviated on the current route to the coast and establishing a new route for coast bound traffic to the island.\n\nBut pipe dream stuff.",
            "You still alive bro",
            "I laid out a detailed, but brief answer of why bridges and tunnels will not work and you are cherry picking imagined faults of why it would work and you are wrong. You are not contributing.",
            "It’s starting to sound like building a bridge there would be a bad idea.",
            "Dang Lake Pontchartrain is blushing over here, y’all!  \n\nOh wait, that’s an algal bloom, nevermind.  Shit.",
            "Isn’t the wind through the straight prohibitive?",
            "Also why the fuck",
            "Also doesn’t get extreme weather",
            "Also, no Kraken",
            "Eh wouldn’t worry too much about it. We have Naval Air Station Whitney, JBLM, and the rest of Naval Base Kitsap all within a couple hours of Bangor.",
            "That base isn't a big target in my mind.  If you destroy it somehow, that just means the SSBNs can't restock there and need to go to Kings Bay.  And if the SSBNs are in need of an urgent restock it means they have already launched at which point the jig is up for civilization anyways.\n\nIt won't stop a first strike.  It wouldn't stop a second strike.  I guess it could stop at third strike a few week later.",
            "Of course. But it's better to explain everything that would need to happen to do something like this and let people figure out for themselves why the answer is no.",
            "True. And after asking they I realized it crosses a fault line that could be very problematic",
            "Tunnel Time!",
            "More like an experiment bro",
            "Bah. That’s nothing a few billion dollars can’t overcome.",
            "I am in favor of catapults, myself.",
            "Very seriously prohibitive. See also [Hood Canal Bridge collapses in storm](https://www.historylink.org/file/5501) (1.2 miles long floating bridge)",
            "The list of the things that would need to happen is extremely long. I’ve worked on a few billion dollar plus projects over the last 15 years and I would estimate that 95 percent of the public has zero idea of what is involved. For example any large scale project will need environmental permits for construction. These cover water quality, wildlife habitat, air quality, noise, vibration, archaeological, endangered species and more. Water quality is especially complicated. There will be several agencies and groups that regulate water quality. The city, county and state you’re in. The federal government. Local ports, local tribes and more. Build a bridge between two countries and the number doubles. \n\nAnd once construction starts there are regular inspections and daily reporting of everything the contractor is doing, if something happens\n\nAnd if the contractor violates anyone of the permits, that’s reported and addressed. This is not taken lightly. \n\nI could go on for a long time, just on this one topic. A topic that is one of dozens.",
            "By getting very wet very quickly down there in an earthquake, yes that would be a problem",
            "We’re gonna bore!",
            "Might need to add a zero or two to that.",
            "Trebuchets get more funding",
            "I'm already bored with this conversation",
            "[someone call elon](https://www.youtube.com/watch?v=6oXlNIsxQTM)"
        ]
    }
}