{
    "June 16 - Weekly r/geometrydash Questions & Achievements Thread": {
        "title": "June 16 - Weekly r/geometrydash Questions & Achievements Thread",
        "score": 12,
        "url": "https://www.reddit.com/r/geometrydash/comments/1dgz8nj/june_16_weekly_rgeometrydash_questions/",
        "content": "Welcome to /r/geometrydash! This is a catch-all megathread for a variety of discussion topics that don't require their own individual posts. Here's an idea of some things you can share and talk about here:\n\n* Quick or common questions with closed-ended responses\n* Recent completions, progress on levels, or other in-game achievements, if you can't record footage\n* Asking for suggestions on levels to play or other opinions/feedback\n* Collab recruiting, planning, and organization\n* ...and much more! If you're not sure where to post it, this thread is likely the right place.\n\nCommunity Resources:\n\n* [Geometry Dash Discord Server](https://discord.gg/geometrydash)\n* [Pointercrate Demonlist](https://pointercrate.com/demonlist/)\n* [Geometry Dash /r/Place Discord Server](https://discord.gg/hZj5evMRZr)\n\nHelp:\n\n* [Setting up a user flair beside your username](https://support.reddithelp.com/hc/en-us/articles/205242695-How-do-I-get-user-flair-)",
        "num_comments": 31,
        "comments": [
            "I beat Caput Mundi a couple hours ago as my second demon ever (and my first easy demon ever (and my first gauntlet demon ever))!!!!!!!!!!!!!!!!!!!\n\nlevel was absolutely beautiful and really fun (even though the ending part was kinda confusing)\n\nedit: forgot to mention, 134 attempts!!!\n\nhttps://preview.redd.it/synnvno1yu6d1.png?width=487&format=png&auto=webp&s=2dad29b49295b5f04c7239fa477e3ea6eefdd077",
            "https://preview.redd.it/sdmpadh54w6d1.jpeg?width=2436&format=pjpg&auto=webp&s=dcac22a115e7e1fe5a2043194cc1647431af4b02\n\nGot 89 on poltergeist this week as a 60hz mobile player. I dont think its gonna be a new hardest since so far i havent struggled with it too much. (My current hardest is supersonic)",
            "I deadass just pulled an EVW and fluked one of my hardest demons from 49% and beat in 456 attempts. And I thought I was gonna spend several days on this. Just how?\n\nhttps://preview.redd.it/5nv76kqmq37d1.jpeg?width=2340&format=pjpg&auto=webp&s=3af82232953ddad39424d4d2b6da2de6a8b977ff",
            "Almost finished with Deadlocked as my first Demon! Any suggestions for what I could do after Deadlocked?\n\nStarted the level roughly 5 days ago, made progress really quickly :D",
            "I beat B as my first medium demon 2 weeks ago, Color crusher as a new hardest and second medium a week ago, and im currently beating biru as my third medium demon, new hardest and 30th demon",
            "Pretty stupid one, but I hit 1 billion jumps by weighing down the jump button for 5 hours on 96333369 by CatGirlBlitz.",
            "I need a new hardest.\n\nMy hardest is currently Leyak and I have 76% on Acu but quit after dying from 71-76 way too many times.\n\nMy best skills are memory/learny and fast paced, but I am really horrible at ship.\n\nI want to do something harder than Acu that isn't Triple Six.",
            "I beat CraZy in 4272! It’s a fun level but holy shit I got unlucky. 97% 3 times…yeah\n\nhttps://preview.redd.it/b2qpf3yg6o7d1.jpeg?width=2160&format=pjpg&auto=webp&s=38dcd9e3cabed30637a405c77d9c970f37d0978f",
            "My 9 year old just beat the insane demon Poltergeist!  He had 6566 tries.  He’s super happy.",
            "I beat In Perceptible as my first medium demon. Is definitely easy demon or 9 stars in actual difficulty though.",
            "Can someone with copy hack make a copy of Atomic Cannon Mk II for me to copy and practice with?",
            "Posted a post before realizing this oops, but i need help with progression. My best game modes are wave and ship while my worst ones are spider and ufo.\n\nhttps://preview.redd.it/tz5ectz5f37d1.jpeg?width=2532&format=pjpg&auto=webp&s=c3ad25f498dbd0e71c6e1a1af0fac19fe272cf42",
            "Dumb question, if you beat a level before It gets rated does It still count as a rewarded completion?",
            "Are there any 60hz victors of How To Platformer? I suspect level 1394 may be impossible on 60hz.",
            "I went from not playing Aleph-0 in over a month to now having it in two runs. 41% and 31-100. Although that chokepoint at 84-85 is brutal.",
            "I need a new hardest my current hardest is Cloud Nine\n\nhttps://preview.redd.it/9z17bbt5ss7d1.png?width=1151&format=png&auto=webp&s=53359f9d8bde2cd2b9713a35161b0f32e9882d68",
            "Am I missing something obvious with platform levels?  There are certain one's where you have to solve different rooms.  The problem is I end up messing up and if there are no spikes to kill myself I am just stuck.  I've spent forever on the \"generations\" level and now I'm stuck in room 7 because I messed up and there are no spikes around to restart the checkpoint.  This is fucking aggravating",
            "I was super unlucky on FD",
            "I almost fluked it aswell but didnt😭😭i progress fluked 51-91 but i bet ur better than me since this level took me 3.8k atts to beat so",
            "I just went from decode to nine circles cause I thought it would be funny to beat 2 well known 1.9 levels",
            "I've heard Delirium Tremens is a good easy extreme (learny/fast paced), maybe try that one?",
            "r/unexpectedfactorial ",
            "Wow! Bro that is incredibly impressive for a 9 year old! Im 13 and dropped poltergeist after 7k attempts.",
            "ID:92008121, altho its a uldm version and im not sure if its a direct copy. So there could be sone misalignments that shouldnt be in the level",
            "Nah you’ll have to beat it again for the stars and stuff",
            "honestly, why not go for lost love? its also memory and its really fun",
            "I will, thanks",
            "I…sorry I don’t get it. (Nevermind I got it now)",
            "YAY!!!!!",
            "No i dont think so. I beat dashplorers before it got rated and after it was rated it counted as a hard demon on my profile. The stars im not sure tho (but be real u wont be beating a hard-extreme demon for the stars r u?)"
        ]
    },
    "Geometry Dash Retrospective - A Klaux Animation (~2.7K layers total, took 5 months)": {
        "title": "Geometry Dash Retrospective - A Klaux Animation (~2.7K layers total, took 5 months)",
        "score": 1268,
        "url": "https://v.redd.it/2cm6ulnbiw0d1",
        "content": "",
        "num_comments": 126,
        "comments": [
            "Holy shit dude that’s incredible. The 3d scenes are insane.",
            "THIS IS INSANE!!!\n\nhttps://preview.redd.it/ipfkqjjaxw0d1.jpeg?width=640&format=pjpg&auto=webp&s=845ee6caf3021e0f907449997cd179672f3c11bf",
            "I dont even know which is gd and which is not, absolutely insane",
            "[removed]",
            "stcubing wants his AE license back",
            "absolutely goated, keep up the good work!",
            "Bro how are you this good at editing??? All im waiting now is for it to be recreated in gd",
            "someone name all the levels",
            "I think we have our first mythic autolevel",
            "I kept going \"hey I know that\" every 2 seconds lmao",
            "Black Blizzard included\n\nInstant 11/10\n\nBtw this is insane, good job",
            "For anyone wondering the song is There by Garlagan",
            "this is so amazing i can see why it took so long",
            "STOP POSTING PEAK FICTION NOW",
            "incredible",
            "absolutely insane",
            "why is this such a banger",
            "This is EPIC",
            "THIS IS FIRE WHAT?!?!?!?!",
            "This is actually sick as hell",
            "Fuck this is cool you are a talented animator",
            "Absolutely outrageous lmfao",
            "W GD ANIMATION",
            "HOW",
            "BROOOO HOW DID YOU COOK THIS??? 🗣️🔥🔥🔥🔥",
            "Simplesmente KlauxGD, brabo d+",
            "this is out of this world",
            "Incredible, I saw everything I wanted to see inside, perfection reached.",
            "Hope you will earn a lot from being a professional.",
            "mods pin tbis",
            "peak",
            "This is the most beautiful thing I've ever seen in GD",
            "Based music choice, love the animation",
            "SO INSANE!!1",
            "Sirius mentioned!!!!! 🗣️🗣️🗣️🗣️",
            "This is actually phenomenal. Probably the best thing I’ve seen on here.",
            "This is actually phenomenal. Probably the best thing I’ve seen on here.",
            "I don't think I can say anything else but...\n\n# HOW",
            "Mythic auto level incoming 🗣️🔥🔥",
            "BROOO, that's so sick!",
            "I don't understand how you can do this with the fucking geometry dash editor. You have great talent, awesome job!",
            "You would be an insane collab with spunix",
            "Oh my god this is amazing",
            "This is made in geometry dash???\n\nedit: wait nvm is it or is it not",
            "No watermark? LOOK at this thing i just created 😎🤑🤑🤑",
            "hi klau gd!!",
            "HOLY SHIT DUDE. BEST EDIT I HAVE EVER SEEN WHAT!?!!",
            "that's ACTUALLY insane, congrats",
            "amazing level, I gifted my award",
            "CLOCKS MY GOAT 🗣️🗣️🗣️",
            "jesus man you're actually clinically insane for this",
            "I cant be the only one who thought that this was a level and was searching for the id right😭😭",
            "star power song but no star power inclusion </2 why would u do this klau gd",
            "*jaw drops in awe",
            "Thats so cool",
            "This is the kind of stuff you have to make to not get your post removed by rule 3\n\nSo good though",
            "Mythic rate",
            "Lol how, 2.2 is insane",
            "That feeling when you recognize every single level shown (I should go outside)",
            "This needs to get rated by Robtop, this is perfect",
            "SEND THIS TO DAILY DOSE OF GD",
            "Gawd damn. What's the ID?",
            "This is 1000% gonna be in a Daily Dose of GD video",
            "Was this made in GD? If so, probably one of the most impressive things made in gd. If not still impressive honestly.",
            "Upload it and give us the ID, please :3",
            "this is probably made in gd",
            "obviously arfitical inteligence made tishs............. too good for humaenz",
            "u/savevideo",
            "I know that I'm getting disliked to oblivion with this comment but what was this made in? Flipaclip? GD Editor? Vidmix???",
            "You mi dercargar geometry dash 2.2 plis☺️.           🤫🧏🏻‍♀️",
            "Mi nombre es lian soy un niño de 10 años porfabor me descargas geometry Dash 2.2 plis.  😕🤛😂",
            "Is it possible... If you could recreate that on GD?",
            "actually sick af. i think this is genuinely worthy of being in official gd media tbh",
            "I shit myself while watching this. Incredible!",
            ":O i'm speechless (not including what i'm saying right now.)",
            "WHITE SPACE SHOWN, 12/10",
            "I still am confused at the retray part. How",
            "This is amazing! And the references are so cool!",
            "You have an extreme talent, you should be a professional animator.",
            "I WANT TO PLAY THIS ID IS WUT",
            "Rate. NOW!",
            "it wasnt made in gd",
            "[removed]",
            "I thought It was his for a seconds 😭",
            "LOL I love stcubing dude\n\nalso fun fact: I actually didn't use After Effects in this project at all since I didn't have ae back when I started it (it's fully made with Blender and Hitfilm Pro 👍)",
            "Pre 1.9:\n\n  Clubstep\n\n  Demon Park\n\n  Ice Carbon Diablo X\n\n\n\n1.9:\n\n  Retray\n\n  Decode\n\n  Nine Circles\n\n  Death Moon\n\n\n\n2.0:\n\n  Unity\n\n  Sirius\n\n  Lit Fuse\n\n  Motion\n\n  Altergame X\n\n\n\n2.1:\n\n  The Eschaton\n\n  STARPUNK\n\n  HOW\n\n  Well Rested\n\n  Limbo\n\n  Edge of Destiny\n\n  Between Worlds\n\n  White Space\n\n\n\n2.2:\n\n  IRRITATE\n\n\n\nOutro:\n\n WHAT\n\n Crazy III\n\n Castlemania\n\n ACU\n\n God Eater\n\n Mayhem War\n\n Cold Sweat\n\n Future Funk\n\n Bloodlust\n\n Black Blizzard\n\n Windy Landscape\n\n La Campanella\n\n Tiny Tunes\n\n Revolution\n\n Rainbow Dust",
            "this ... isnt a level ?????",
            "unfortunately [this](https://www.reddit.com/r/geometrydash/comments/1aj2xw3/what_is_this_w_level_in_my_saved/) would be the first one",
            "it wasnt made in gd",
            "Happy in the cake day",
            "it isnt in gd tho",
            "it wasnt made in gd",
            "I actually made it with Blender and Hitfilm, but ty!",
            "it wasnt made in gd",
            "no",
            "https://preview.redd.it/7rhitydfd91d1.png?width=680&format=png&auto=webp&s=59c117ccc468a61cf0581c7cdf8cc400fd9c7229\n\nbro",
            "https://preview.redd.it/l4vquhqkza1d1.png?width=625&format=png&auto=webp&s=9d6915e179562edea380a2a7aec0c8fb327827c0",
            "it wasnt made in gd",
            "it wasnt made in gd",
            "It was lol",
            "No, it would take some spu7nix level wizardry to make this in gd. Hopefully someone does it though",
            "no yea I made it in blender and hitfilm 👍",
            "it wasnt made in gd",
            "it wasnt made in gd",
            "I made it with Blender and Hitfilm Pro 👍👍",
            "it wasnt made in gd",
            "it wasnt made in gd",
            "ahh… so you didn’t use gd for this like stcubing used for HOW",
            "THANK YOU SO MUCH!! Glad to see I got some of them correct!!",
            "I don't think that's a real level. At least I couldn't find it, I had seen it but it no longer exists",
            "Ooh, gotcha. Probably got confused from the \"2.7k layers\" in the title. Still amazing, though.",
            "You're welcome! Although this isn't made actually in GD, this is extremely impressive either way! I mean, just look at the fucking sick transitions between each level.",
            "Oh I thought it was",
            "Oh",
            "i know, thats why i said it",
            "Oh, I wish I was made in GD",
            "Ye",
            "It's totally real",
            "mb 💀",
            "Well i guess it's a bug so this would be the first REAL auto mythic level"
        ]
    },
    "Me and my friends got into a disagreement about this, Which game is harder?": {
        "title": "Me and my friends got into a disagreement about this, Which game is harder?",
        "score": 292,
        "url": "https://i.redd.it/4ffl9hprh18d1.jpeg",
        "content": "(I obviously said GD)",
        "num_comments": 154,
        "comments": [
            "As a player of both, I say both are difficult in their own ways and aren't comparable due to how differently their respective games work\n\n\nGeometry dash banks hard into tight timings, memorization, and generally very unforgiving gameplay, but the levels usually only last a few seconds to a few minutes in terms of how much gameplay\n\nJuke's towers of hell is a lot more reliant on special strategies for specific jumps, endurance, and much longer length (anywhere from a few minutes to hours to complete towers); but towers are generally more forgiving since you can catch yourself on lower floors if you fall",
            "As someone who thinks that Tidal wave is in the top 3 accomplishments in any video game bare minimum, Its GD and its not close, I think Trials of death in Mario make is about tied with Tidal wave (I believe that the individual that beat ToD was less equipped to beat it than zoink was to verify tidal wave, I also believe if Mario maker became competitive to the degree of gd, there would easily be more than one person who beats trials of death)",
            "i think coiv and tidal wave are both some bullshit",
            "You can't compare JToH and GD.\n\n\nGeometry Dash relies on precise clicks, jumps, gamemodes and speed to create a level. Not mentioning that it's in 2D.\n\n\nJuke's Towers of Hell relies on various mechanics such as client objects, mechanics, flicks, and glitches to form its towers, which are all in 3D (not minding CoTaW that utilizes a 2D section halfway through).\n\n\nThe building process however is kiinda the same on both games, you build creative gameplay, design it, spend months of your time making the level/tower, and what you get is a finished product that if executed well, will get the hearts of the players that beat it.\n\n\nif anyone asks, hardests are ToCA and a weekly easy demon (I can't remember the name😭)",
            "cant be compared. very different games, both based off user generated levels.\njtoh has a much higher skill ceiling potential but gds difficulty has been raised much higher due to a bigger playerbase",
            "gd there is no competition",
            "kinda obvious, does juke's tower of hell have levels like emptiness",
            "Idk bruh they both crazy.",
            "I play both, i’d say they are hard for their own reasons, but JTOH has a greater capacity for difficulty, but GD’s peak is much better explored and explorable\n\nIt being 3D and the fact a whole coding language and engine is used should be all the proof needed for its capability for difficulty",
            "jtoh is younger so ofc it's not as established in terms of difficulty yet\n\nHaven't had a new top 1 for months and it has like 10 victors\n\njtoh has a lot more potential for difficulty than in GD since the movements can become more complex, precise and not to mention that it's 3D which allows for more room in terms of error\n\njumps in jtoh are nearly impossible compared to gd since every tower is different and has many mechanics and different kinds of jumps that need learning, stratting and technicality, while gd is just clicking\n\ngd rn is harder, but jtoh has so much more potential we just beat our first unreal tower like 7 ish months ago which is probably around where bloodlust is now prob\n\nwhat also proves its difficulty is the large community gd has that has beaten an extreme, compared to those who are capable of beating any intense tower in the game\n\nI do play both for the purpose of reliability, hardests are ToGF and diligence",
            "3... 2... 1.........\nGEOMETRY DASH",
            "Gd is much harder according to literally every top player in jtoh",
            "Jukes is harder on average but Geometry dash has a higher ceiling. I think if Jukes had more customs, like levels made by randos, it would probably even things out.",
            "I would say Geometry Dash also, it gets super hard and to literally impossible levels of difficulty (those endless levels)",
            "JToH has a greater capacity for difficulty since it has more controls and dimensions to work with, but gd has much, much, much, MUCH harder levels since its been out for way longer and it's difficulty has been more explored",
            "geomy daas🎮",
            "Ofc GD",
            "Does the other game need mostly 5000+ hrs of playtime to be good enough to complete the hardest lvl in the game",
            "i play both\n\njtoh hardest: tomm \n\ngd hardest: fire temple\n\n\nGD is harder on the average side but when we're talking absolute peaks then JToH is kinda ridiculous, but i'm unsure if Tidal Wave is harder than CoIV",
            "~~well i think it's pretty obvious that geometry dash CAN be harder, i mean it depends on the level, i've played tower of hell before, while it does have a skill curve, it's not even close to a game that would take thousands of hours to beat the hardest stages (at least from when i played, when it was just called tower of hell). Comparing anything in that game to tidal wave is just a non argument. Yes they are different types of difficulty that don't directly translate, but geometry dash can become so much more insane soley based of the fact that tidal wave has jumps that have a 15ms window to click. Comparing toh to stereo madness or like an easy demon though you could probably make an argument. People can beat easy demons in their first 100 hours.~~\n\nEdit: Just learned that tower of hell is not the same as jukes tower of hell",
            "It’s not close and you’re fucking with yourself if you think it is. GD has a MUCH larger and MUCH more dedicated player base that has been pushing the limits for years. JToH’s top 1s get 5-10 victors every time before a new one comes out, and that’s with a player base like 1/20th the size. It’s a better question to ask if JToH breaks into main list demons. If you believe JToH is harder or even on par, that also means you must believe all the top players of GD kinda suck, because they’ve put in more time, for longer, on harder things than anyone who plays JToH has.",
            "To my knowledge, GD is a lot of muscle memory and practicing.\nJToH is more of an IQ test. But not exactly.\nSomeone like einstein could beat a catastrophic tower in few attempts (as his first) because he's smart and this game is all about strategic mechanics and fine motor skills (camera controlling, on the other side GD isn't anything like it, its more about timing and muscle memory, again compared to mechanics and camera control",
            "I don't really know which one is harder, as I am not very good at either one(my hardest is Hyperio Technia/Supersonic in GD and ToEI in jtoh), I would say that they have the same potential for top 1's, but jtoh just is not played as much since it is a pretty obscure rage game(but still very fun)",
            "doesn't make sense to compare a 3d platformer to a 2d auto-scroller. completely different skillsets here.",
            "They aren’t comparable until you see ToSF",
            "Jukes is a precision and patience game, more comparable to lets say a platformer level that is over 5 minutes long without checkpoints in gd in which case I personally think jukes is harder but we obviously haven't reached peak difficulty yet in platformer like we have been pushing normal mode for years.",
            "gd, there is just more possibillities in the editor i guess so the game will naturally be harder",
            "Idk much about JToH, but I feel like GD has had its difficulty explored more so far, so its currently harder. Im sure as people get better at JToH and it gets harder it has enough potential to surpass GD.",
            "I play both games. My hardest are Tower of Curved Ascent and Mechanical Showdown. I put far more effort into JToH than I do into GD, so I think ToCA is harder than mech showdown.\n\nI’ve talked to Gammattor who has beaten an insane demon and an extreme difficulty tower. He says that they were around the same difficulty",
            "GD bc nessus",
            "Depends",
            "oh that's a tough one, probably Juke's?",
            "Current skill ceiling of GD HAS to be higher. GD is 2 times older than jtoh, and has a larger player base. Unless jtoh players are somehow more capable than gd players, this would be an easy W for gd",
            "Thing with GD is that it's essentially as hard as you make it and as hard as the community levels you play are. The RobTop levels aren't especially hard, nor are the majority of featured levels. If you want to play Extreme Demons all day then sure the game is difficult, but I think it's hard to gauge the actually difficulty of the game as a whole.",
            "GD:tap tap tap\nJTOH:yeah just do this 10 floor tower while moving your fingers",
            "I played a bit of Jtoh,I personally think its harder,Altough thats because i am not really good at 3d Platformers.\n\nThis is sort of the \"Minecraft VS terraria\" Argument,They aren't comparable. If someone asks you \"Whats harder,Legendary Mode Moonlord,Or Hardcore minecraft without any Armor?\" Then you can't really answer it,Since they're completely different.\n\nJtoh has more potential to be more difficult,Because it has a whole NEW Dimension to deal with,but GD is currently harder,Mostly because its way more popular,So more people made hard stuff in it.\n\nIf Jtoh had the same amount of popularity as GD,Then it would probably be harder,But overall both games are Peak difficulty in terms of any game,Ever made. Especially Jtoh for Roblox games,its definetely one of the hardest Roblox games out there.",
            "To be fair, Geometry Dash has a level based on JTOH and it’s only like a hard demon",
            "im harder\n\nhttps://preview.redd.it/bxktri9ux38d1.png?width=422&format=png&auto=webp&s=db79e82c3cc7050c7c96d8d2165b6f61ca302c85",
            "It's gd and it's not even close",
            "While they're both very different skillsets that utilize very different mechanics and strategies (and because of this imo they cant be compared); I'm inclined to say that JTOH/tiered towers have a WAY higher skill ceiling compared to geometry dash in terms of what's possible. There's a subsection in the obbyist community dedicated to clearing the hardest individual jumps, requiring an insane amount of precision and timing. The Barcode, Sora No Shinku, Eternally, X.Code... All of these use a myriad of mechanics and tech that abuse roblox's game engine to its limit, and some take dozens of hours to pass a SINGLE jump.\n\nWith respect to JTOH, currently the hardest towers beaten legitimately iirc are CoIV, ToEV, ToTRP; and for tiered obbies Emi Nubu, Back There Benjamin, Ikea Tower. If you have experience with both of these games, compare them to GD's top levels and see for yourself.\n\nPersonally, if you want to compare these two different skillsets, then I''d say they're both VERY close. Some JTOH top players say GD is harder, and some top GD players say JTOH is harder. Problem is I don't recall anybody who's both of these things, which would offer the most unbiased result; it's like being a world renowned chess player and asking them to compare Chess and Scrabble, they're very different skillsets. \n\nI think the best way to measure is just general precision. Individual jumps? Goes to JTOH easily. Timing? GD. Consistency? Both require immense consistency. Reaction time? GD. Mechanics/movement? JTOH due to the insane amount of discovered tech.\n\nAnd if this is relevant; I have kinda good experience with both. My hardest tiered obby is a Tier 11 and have played obbies for many years now. In GD, hardest is Insane demon (both classic and platformer).",
            "GD GD",
            "comparing to dimensions to each other, but I dont care, its gd (definetly unbiased)\nwhat doggie is currently achieving in GRIEF or how hard tidal wave is just tops almost everything",
            "Tower if hell is ez",
            "The guy that tried to beat GD...",
            "Both are respectfully difficult in their own playstyle.",
            "Stop the paragraphs, obviously jtoh (at least in my opinion)",
            "GD is like a quick sprint of really precise timings over a short period of time. JToH is a much longer test if consistency and stress, where each timing is still really difficult, but you can do them at your own pace. They also both have ways for the community to make levels/tower and technically if we only look at “main levels”, jtoh high catastrophic towers are WAYYYY harder than robtop demons. If we look at the hardest things in each game, the different skillsets needed would make them incredibly hard to compare as mentioned before. \n\nNow what about gd vs fe2…",
            "A Roblox obby game vs. Tidal Wave. Pretty tough decision",
            "i think jtoh is harder, gd is all about memorising the click patterns if it's 4x speed with fixed hitboxes + wave. jtoh need precise timing and jumps, with w, a, s, d, space, shift, right click and scroll wheel. Gd only needs lmb. you can argue straightfly needs skill yes, and I can argue that ONE SINGLE RUN OF A CITADEL TAKES 1+ HOUR",
            "It's definitely gd lol, tidal wave is stupid hard and when you consider grief and apocalyptic trilogy too, it's far more difficult",
            "As a pretty good play in both (2 intense towers and 2 easy demons) I’d say jtoh, as there are more complex controls.",
            "Jtoh is shit from p2w",
            "If a GD player tries JToH first time, they would say it is harder because they're used to 2D autoscroll platformers, yet JToH is a 3D platformer. Honestly JToH's main story is not that difficult, but beating every tower... that's when I consider it harder than GD. After you 100% the canon towers, you have the -Pit of Misery™-. The towers in that realm are almost humanly impossible, basically top 100 ILL difficulty. \n\nIn conclusion, JToH has harder towers (levels) than GD [if talking about top 10's)",
            "200 frame perfects. \ntidal wave is PROBABLY the hardest achievement in gaming. \neasy gameplay for an hour in a row deathless is still easy gameplay, and any 2 minute section of coiv is easy compared to tw. if any 2 minute section of coiv was as hard as tw, doing coiv would be like doing 2000 frame perfects in a row, and that's humanly impossible in 2024, therefore any 2 minute section of coiv is much easier than tw, therefore easy gameplay for an hour in a row deathless is still easy gameplay",
            "Gd but thats because I’ve never played that game",
            "GD and what is your friends hardest",
            "Gd by far. At 100% speed, does this seem possible to you?  *Shows tidal wave*",
            "Depending on the GD level, you can be looking at hours to universes in length ",
            "Any game where custom levels are the main focus is immediately invalid from any difficulty comparisons because the difficulty is completely fluid",
            "jtoh is spatial precision (mouse), gd is pure timing precision. spatial precision is completely impossible in gd. even tho both are precision, a degree of spatial precision that's objectively exactly as hard as a frame perfect doesn't exist, also there's no objective amount of 2 frame timings that are objectively as hard as a frame perfect. like intuitively an fp is twice as hard as a 2frame but that doesn't actually work in practice",
            "Agreed",
            "So Geometry Dash is Flood Escape 2 but with extra spice",
            "Me when 55 minute Extreme Demon:",
            "I feel like just due to the limitations of the Mario Maker editor, it is impossible to get levels to the same difficulty ceiling as GD.",
            "How the hell did you make this about mario maker",
            "Tosf has NEVER been beaten making it harder than tidal wave making it top 2 in video game achievements at minimum",
            "what abour vsc",
            "i dont think tidal wave is top 3 over all video games are you for real?\n\ndaigo parry\n\nEZ4ENCE (that was on the news in finland)\n\nbeating all souls games back to back no hit\n\nsub 1minuet GOIWBF run was HUGE\n\nrychu(spelling) winning TEKKEN7 as panda\n\nhungrybox winning the smash bros tournament is at least top5\n\ni think tidal wave was huge sure but as an accomplishment the race to beat sonic wave or the verification of bloodbath is so much more historic.",
            "yeah can i get the",
            "there hasn’t been a good top 1 since Tartarus",
            "Well, you can compare the time it takes to become a pro player. For gd it can be in the thousands of hours but I'm not sure about jtoh (which mind you has a much smaller community that has been around for less time so I dont see it being harder)",
            "wait until you encounter one of these soul crushing towers in jtoh (and they aren't even the hardest)",
            "I ain’t gonna lie jtoh is actually kinda crazy in terms of peak difficulty, the problem with scaling it in difficulty with other hard “platformer” games is that it has whole other dimensions to work with, but is also very limited since you can’t “change gamemodes” or anything like that and your max jump distance is pretty locked. A lot of difficulty in jtoh also comes from length and nerves, which is kinda optional in gd(see Acheron, slh, Avernus, etc.)\n\nIn general it’s really hard to say what’s harder so I won’t say anything at all",
            "Jtoh has difficulties beyond the chart they give you, they just aren't official difficulties because it's just crazy.",
            "\"the fact a whole coding language and engine is used\" ..what?\n\nJTOH uses Lua and Roblox, GD uses C++ and Cocos",
            "Well yeah you could say it has more “capability for difficulty,” but the thing is those can only go as far as humans can play so it doesn’t really matter. You could probably make a harder impossible tower in JToH, but the thing is that JToH never has and never will have high-quality impossible towers (except CoV ig) thanks to JJT kids",
            "You’re playing the wrong game, Tower of Hell is a completely different game. Far easier than JToH and much lower quality ",
            "It doesn't come down to IQ, it comes down to skill. A smart person can't just do something really difficult in a few attempts. Let alone Einstein knows what the hell a computer is.",
            "No top player wants to play ToSF",
            "JToH’s editor is literally the Roblox game creator. So people say “GD is a game engine” and while it kind is, JToH towers are genuinely made in an actual game engine\n\nAlso there is SOOOO much bullshit you can pull off with Roblox physics. Think controlled flings ",
            "I think gd wins for being around longer and having a larger community",
            "this ain't your average roblox obby game",
            "Players using up to literal thousands of hours and hundreds of thousands of attempts on one single level that’s like 2 minutes:",
            "check out ikea tower",
            "check out citadel of infinite void in jtoh",
            "Literally what about JToH is pay to win??",
            "JToH’s main story is not gonna be finished until like 2030",
            "Play it, it's really fun.",
            "its like platformer of gd, but in 3d and more creativity.\nI'd say jtoh is objectively a better platformer than gd platform mode because of the extra dimension",
            "timeless:",
            "But we have 4 lists in charge for the difficulty (The Demonlist, the challenge list, and their platformer versions). so we can compare the hardest demons or challenges in GD to the hardest towers in JTOH",
            "Based off of a summoning salt video on mario speedruns, i think that if people tried as hard on maker as they do on gd they could reach higher than gd",
            "If we go down this trail, what about Aeternus?\n\nEdit:\n\nNevermind Aeternus, what about PPLLLife?",
            "you know what else hasn't been beaten?\n\nton 618",
            "so Tosf is now top 1 in video game achievements or what? what the heck are you yapping about?",
            "well 13 people beat vsc",
            "As a souls challenge runner, all souls games back to back no hit is a lot easier than tidal wave.",
            "I will say I don’t think the news are going to be a very reliable source of what’s the hardest achievements, moreso depends on how impressive it looks and the cultural/subcultural ramifications",
            "r/redditsniper",
            "Do da do do do dat do do do bishwo",
            "Dat doo doo doo Dat doo doo doo",
            "there's firework for roughly 18 seconds",
            "tidal wave is a good level but it’s bullshit hard",
            "Problem is that people just have different skillsets. Zoink could be really good at gd and invest a bunch of time into jtoh just to struggle on tots or soemthign",
            "<<<<Tidal<<<<\n\n\\>>>>Wave>>>>",
            "Compare Geometry Dash's top 1 to jtoh's top 1\n\nOne is like 3 minutes but the other is 3 hours\n\nThough the difficulty of Tidal Wave is consistently difficult for the most part, while CoIV fluctuates massively",
            "well for that you should look at tower of cruel punishment a high-peak catastrophic that sits at 11.99",
            "But you don’t script with C++ and Cocos in game do you",
            "Roblox Lua\\*",
            "for real? alright nvm then i'm gonna give jtoh a go then. Thanks.",
            "the first computer was made before einstein died",
            "My phrasing was purposeful to make the reader bias towards Geometry Dash being the harder game. I play Roblox but I’ve never played this game. I’m doubtful that a Roblox game can be harder than the hardest levels in Geometry Dash.",
            "also jtoh players when they trip and have to do the entire citadel again:",
            "jtoh players facing the same thing but 30x longer:\n\n\n🤡🤡🤡",
            "If i remember correctly theres a Gamepass that costs 3000 robux and gives you the ability to fly.\n\nThe problem is that it literally doesn't let you get to the exit in Soul crushing towers,Like the exit doesn't exist.\n\nSo its basically just a practice mode for specific parts of towers,So idk what they're yapping about,Since it isn't really p2w.",
            "True but they say unlocking everything shouldn't be harder than insane difficulty",
            "What does your Morse code translate to",
            "I don't think so just because Mario Maker is limited in level space. You could theoretically replicate anything in Mario Maker with the GD Editor, so I don't see how GD's difficulty ceiling wouldn't completely encompass the ceiling of Mario Maker.",
            "????? since when what the fuck",
            "Well 2 people beat Citadel of Void",
            "this was a fun sub to go down lol",
            "oh true that’s an alright level",
            "Also all the other ones",
            "[https://www.youtube.com/watch?v=Mtcliw0KJ4w](https://www.youtube.com/watch?v=Mtcliw0KJ4w)\n\nzoink approves",
            "thats just how long the levels are not how long they take to beat, kenos took 8 months not 2 minutes and 30 seconds 😭",
            "Yes, but the new plataformer top 1's are like 40 min too",
            "Yeah, I'm just saying there are harder towers like in the pit of misery for example.",
            "Not exactly with the coding languages themselves but using triggers to advanced degrees is pretty much writing scripts. I don’t see how the complexity of ingame programming relates to the difficulty of the game though",
            "Luau is pretty much modified Lua 5.1 with some modules backported and without access to Debug, OS and garbage collector",
            "Yeah also when you play it, be aware that the early areas are generally lower quality than the later areas. The earliest high quality area you can unlock is called “Garden of Eeshol”",
            "you're in for a surprise. jtoh gets ridiculous",
            "Roblox obbies actually have a surprisingly high skill ceiling. In gd you have tight timings, but in roblox you have tight timings AND tight camera control at the same time. I agree that gd is harder, but that's only because of a larger player base.",
            "GD players when they wait a couple milliseconds too long and have to start all over.",
            "I agree with you, it also needs patience, if one gd player cant handle a 2 minute level, dont start on 1 hour",
            "Yes. It costs 5000 robux and you can beat any tower as long as it’s:\n\n- Remorseless difficulty or lower\n\n- Not a citadel \n\n- In an area where items are enabled (they’re disabled in arcane area, pit of misery, and events)\n\nSo you can beat rems with it, but beating a rem is not considered to be that impressive anymore. Like it’s a big achievement to beat one legit, but tens of thousands of people have done it",
            "Yeah, they’ll never requires SCs for progression. It feels kind of anticlimactic that TGI’s obelisk will only be intense. But at least the SS obelisk will be rem",
            "It was verified almost 3 years ago, not sure what you expected. Slaughterhouse was verified only a few months later and that has 47 victors now",
            "lmao same what? I thought it was like 3",
            "oh dam he truely does.\n\nanyway \n\n[https://www.youtube.com/watch?v=WIjuyPd3kck](https://www.youtube.com/watch?v=WIjuyPd3kck)",
            "jtoh players when their jump is 0.01 studs off: (they fall to the first floor and have to waste another 30 minutes to get there)",
            "The TGI obelisk is only an intense? I thought it was gonna be mid rem",
            "Has it really been 3 years already?? Its so over",
            "Fair enough, but, like\n\n\nit's VSC",
            "dam aeternus, but anyways jtoh and gd are hard in their own ways, can't really compare a 3d platformer and a 2d autoscroller",
            "GD players when they click 4,327,748 CPS instead of 4,327,749 CPS and lose 10^10000 seconds of progress",
            "VSC is around slaughterhouse difficulty. Most top players just dont play challenges and the challenge player niche of the community is much smaller than the demon player side",
            "Fair.",
            "jtoh players when roblox failed physics and flings off to the 2nd floor",
            "damn really? vsc easier then i thought\n\nstill pretty insane tho\n\n...literally\n\nplease laugh",
            "Can’t top mine",
            "i dont see any player, even human getting 4m cps. Have a logic sense",
            "Its PPLLife. Top 4 hardest GD levels ever made. Former Top 1"
        ]
    },
    "throwback to the time my friend thought he could reset the gd shop": {
        "title": "throwback to the time my friend thought he could reset the gd shop",
        "score": 86,
        "url": "https://i.redd.it/60lwwynn738d1.png",
        "content": "",
        "num_comments": 7,
        "comments": [
            "bro mustve looked for hours where the microtransaction store was",
            "I mean there is a geode mod for it but i dont think geode is up now soooo",
            "“What do you mean it doesn’t refresh?!”",
            "_\"where can i buy V-orbs?\"_",
            "Exactly what I was about to say",
            "pretty sure geode betas have dropped, i have a friend back on geode",
            "Beat an extreme demon for 500 v-orbs :)"
        ]
    },
    "I BEAT QDYNAMIX 100%, HAVEN'T BEATEN AN EXTREME DEMON IN 2 YEARS LETS GO!": {
        "title": "I BEAT QDYNAMIX 100%, HAVEN'T BEATEN AN EXTREME DEMON IN 2 YEARS LETS GO!",
        "score": 753,
        "url": "https://v.redd.it/ef22dijlfz7d1",
        "content": "",
        "num_comments": 102,
        "comments": [
            "I was going to say “I wish you did a backflip” but then you did one",
            "I thought to myself, “this guy looks a lot like KingSammelot”. Then I realized you actually are KingSammelot. GG!",
            "GG! how hard is it?",
            "**HE AIN'T THE KING FOR NO REASON** 🔥",
            "gay demon?",
            "Common KingSammelot WWWw, great mashup too GG",
            "GG",
            "I didnt even know queer dinamix exists",
            "my poor eyes\n\nhttps://preview.redd.it/q08pt3yuuz7d1.jpeg?width=564&format=pjpg&auto=webp&s=7b3f8748c5c142803a37e49a9263912aa5bb4746",
            "ggs",
            "I wasn’t here",
            "W",
            "JOHN CENA YOU CANT SEE ANY UNDERSKILL",
            "LET’S GO KINGSAMMELOT",
            "Most normal geometry dash completion (ggs)",
            "congrats sammeleilei",
            "gg 𝓯𝓻𝓮𝓪𝓴sammelot",
            "Gg königsammelot",
            "I uhh...  I beat Sidestep today...  Yeah...",
            "The backflip/sideflip goes hard",
            "AMAZING, ITS SO COOL!",
            "gg",
            "GGS SAMME",
            "W YES LET'S GO",
            "LESS GOOOO\n\n# \n\n#",
            "GG",
            "LMAO",
            "#GG!",
            "i mean, nice but why did you go for a hard extreme demon instead of a \"normal\" one since you couldnt beat one for 2 years",
            "gg king feet",
            "this cant be real its too perfect",
            "GG SAMMELOT W",
            "Baller remix",
            "GG SAMME",
            "obligatory pri**de mon**th comment",
            "I haven’t beaten one in 16 years… still counting",
            "Im",
            "This looks hard,\n\nWell done👍",
            "NOO WAY KINGSAMMEBALLS GGS!!!!!",
            "Ggs",
            "GG!!",
            "GGs",
            "W",
            "Bro thats so chaotic",
            "GG CONGRATS SAMMY",
            "I've never sen anyone react DURING a completion LMAO",
            "hello samme",
            "good skills",
            "https://preview.redd.it/20v20c1ujz7d1.jpeg?width=3024&format=pjpg&auto=webp&s=8dc8458315ee79990773b78b52ce02e6e8f064a3\n\nGood job, have some French Toast my friend made",
            "Holy shit me jumpscare at the start\n\nGGs on the silly extreme demon",
            "WHO DO YOU THINK YOU ARE I AM",
            "The man, the myth, the legend, and dare I say THE GOAT",
            "Gg!",
            "Good job sammy! Hope you have a good day!",
            "Your reactions are one of a kind XD",
            "GG!!!",
            "Should’ve done a backflip for every death",
            "GG",
            "GG! The backflip completely sold me on the scale of victory!",
            "what is this airborne robots john cena remix and where can i listen to it",
            "Why is a pride flag flashbanging me 💀",
            "fire mashup and fire gameplay holy shit",
            "Popoff.",
            "Holy fuck king sammelot",
            "Gg",
            "GG!",
            "New video?????",
            "gg mr kingersammelot!!",
            "Let's go gg",
            "Oh i remember him. He is \" OMG he beat THE GOLDEN 3 times IN A ROW, backflip guy. \"",
            "Genuinely do you lose all musical taste after beating one extreme or what",
            "milo cube",
            "This mashup is confusing",
            "DID IT",
            "Lesbian subliminals 😂 lesbian flashbangs",
            "I DID IT",
            "[removed]",
            "i commented first",
            "He should have done two backflips",
            "In the \"aredl\" it's placed at #612. making it slightly easier/around the same difficulty as for example aftermath (#593) or Plasma pulse III (#602)",
            "not as hard as cant let go",
            "extremely hard",
            "it is as hard as plasma pulse III",
            "Easier than square adventure",
            "yes",
            "Flair checks out",
            "a",
            "Istg i thought those were pieces of meat bro😭😭💀",
            "Those look vile",
            "Wasn't even first-",
            "Dude, open a subreddit and sort by New and you can be the first to comment every time\n\nThis sh\\*t isn't anything even remotely impressively",
            "This ain't youtube.",
            "He did a back full so its two spins at least",
            "WHAT",
            "He should have done three backflips",
            "Do you happen to be a gymnast by chance or am i forgetting how common calling it a back full is",
            "Mashup Week?",
            "He did a back full so it's three spins at least",
            "He should have done 4 double backflips"
        ]
    }
}