{
    "No shit": {
        "title": "No shit",
        "score": 981,
        "url": "https://www.reddit.com/gallery/1dlhh8i",
        "content": "",
        "num_comments": 84,
        "comments": [
            "I mean, realistically, no one would expect a creature like this to exist and she probably thought Kōichi was simply over exaggerating due to PTSD. So obviously, after seeing the giant monster that matches the descriptions of Kōichi’s tale, she’d obviously wonder that…\n\nI don’t think anyone ordered a Yappachino but you got one anyways.",
            "She might think godzilla was this EXACT height all those years ago.",
            "https://i.redd.it/qpo03h9r318d1.gif",
            "https://i.redd.it/3016zpcmc08d1.gif",
            "“It looks like Godzilla, but due to international copyright laws, it is not”",
            "Why does Noriko ask the window, if that is Godzilla, when he is there and could answer her question? Is she stupid?",
            "![gif](giphy|bSa7cOkZ2pG2A)",
            "Weirdly enough no, that is a completely unrelated giant monster.",
            "Guys. She never heard of anything called Godzilla before, nor has she ever seen anything like this. She wasn’t actually asking, she was just shocked. ",
            "Actually it's Gigantis, figured that was obvious",
            "I kean I would have the  same reaction",
            "No, it's Gojira",
            "No it’s the other 160ft tall lizard",
            "Well, the VFX were added in post, so to be fair, she couldn’t really be sure - could she?",
            "In her defense, how should she know when the original movie come out years later.",
            "No he's just here to help you save 15% on car insurance",
            "Well, she’s never seen what Godzilla looks like up to that point. From her view, prior to seeing the big guy, Godzilla could be anything. A giant alligator of all things could be what she imagined.",
            "I do wonder were the storyline would have went if the train conductors had started moving the train backwards",
            "I mean ngl I would be like ''Is that...Am I seeing this correct? I must be trippin'' So pretty similar reaction.",
            "Nah it’s a thermonuclear war lizard that has the capability of taking down cities in less than 20 minutes",
            "It's actually Zilla",
            "I mean in her defense this movie takes place before all other Godzilla movies and only person to had saw him were 2 at beginning that lived. She was told his name by one of them so it’s more her asking herself is that who she was told about.",
            "No it's DeityLizard",
            "Well...she could've thought it was an earthquake that stopped the train and then she turned around she asked that in disbelief when she him",
            "Nah thats “Shit Sherlock”, first name’s “No”",
            "![gif](giphy|nW5BIQe600lVu)",
            "Someone should have yelled from behind: No its King Kong.",
            "This made me burst out laughing",
            "No it’s mothra",
            "Almost 99% of Toho Godzilla movie dialogue is like this for some odd reason",
            "run its godzilla!",
            "Na, that's just Bill coming home after a grueling day of work",
            "No it’s the tooth fairy, Norico.",
            "I love how they mixed man in suit vibes along with more realistic smooth motion",
            "Damn, is Noriko stupid? Goji's been in like almost 40 movies, why is she acting like it's the first time she saw him.",
            "Clearly it's Gamera",
            "No it's Becky",
            "Lmaooo",
            "No, it's Santa Claus.",
            "Is she stupid?",
            "This is the most beautiful and perfect rendition of Godzilla ever in my opinion, the size, the body, the spikes (plates or whatever that are called) the atomic breath, everything was just perfection. I loved this movie so much.",
            "We would like to take a moment to discuss your vehicles warranty....",
            "That or Hillary Clinton",
            "\"How did you under sell it? I thought he was way smaller than that?!\"\n\n\"Well, he used to be!\"",
            "No, i'm not\n\n*rolls credits*",
            "Who else would it be, Noriko? Fucking hell",
            "It might be Godzilla but due to international copyright laws, it’s not!",
            "No, it's Thor God of Thunder!",
            "She was probably thinking \"Jesus Christ, I need to find you some decent meds one of these days....\" when hearing Koichi traumadump about Godzilla.... Probably didn't expect it to be legit lmao.",
            "> Yappachino\n\nI love this expression, truly.",
            "Probably my second favorite scene in the movie lol. And my 3rd favorite scene in all of Godzilla media",
            "Bro looks so mad in that scene or maybe taking a big dump after tacobell",
            "When you drink a frozen drink too quickly",
            "\"Still we should run like its Godzilla\"",
            "r/Godzillacirclejerk",
            "send her to the aslume",
            "Why is she asking us, if we don’t speak Japanese?",
            "Geogantis*",
            "I always mix those two up. They should wear name tags.",
            "\"I believe that is Reptilicus, ma'am.\"",
            "Cracking up over here",
            "its actually gorosaurus lady",
            "She’s asking the director because she’s technically staring into space and needs motivation",
            "\"We have been trying to reach you about your train's extended warranty!\"",
            "Zilla From the hit 1998 Movie Godzilla created by the tallented minds of Roland Emmrich and Dean Devlin? That absolutely amazing movie with one of the greatest lines in cinema history \"that's a lot of fish.\" That Zilla?",
            "Koichi told her about a massive lizard creature called Godzilla",
            "What other giant lizards are there",
            "*It looks like Godzilla but due to international copyright laws, its not!!!",
            "Bruh this movie killed it on all fronts.\n\nFavorite Godzilla movie by far",
            "“Though it isn’t”\n\nAAAAHHHHHHHHH",
            "There should be one that's more active called okbuddygoji",
            "https://i.redd.it/at3k0op5d18d1.gif",
            "No, it's rhedosaurus",
            "No the other one",
            "Agreed",
            "It’s awesome I think it’s about as good as a Godzilla movie could get",
            "Ah man, we meet once again! For it is i, Woman!",
            "No… noooo",
            "https://preview.redd.it/hpvcqe2mj28d1.jpeg?width=1404&format=pjpg&auto=webp&s=173011b7bfd8d712804a7a682e3b48259927a621",
            "Sure it ain't Reptar?",
            "Damn i guess i'll go f my self then!",
            "Yeah…you’re woman",
            "Yes, reptar is from 20,000 leagues under the sea"
        ]
    },
    "The glazing is crazy😭": {
        "title": "The glazing is crazy😭",
        "score": 167,
        "url": "https://i.redd.it/6hbfm7npr28d1.jpeg",
        "content": "",
        "num_comments": 60,
        "comments": [
            "https://preview.redd.it/n0adho5t538d1.jpeg?width=556&format=pjpg&auto=webp&s=4a3f1b6512ccc34d2861c70955c84da21c1d5f80",
            "I. . . I think you may have a different understanding of 'glazing' than I do.",
            "For me they’re pretty close.\nMonsterverse is a lot more agile but Heise has a lot more power.\nFor me based on what we see on screen monsterverse should win but based on what we know with all the statements heise should win",
            "I watched both movies and think Evolved would win.",
            "It's hard for me to get a good grasp on how strong Godzilla is supposed to be in GxK because he didn't do anything. Like, he's more agile and glows a different color, but that seemed to be about it? I don't recall anything he did being particularly effective against the monsters he and Kong were fighting. Kong's power glove felt like a bigger upgrade.",
            "Unfair fight, Burning is already dying, this is Mike Tyson vs Mike Tyson who is having a heart attack",
            "Showa beats them both though",
            "that's probably because, comparitively, very few people have watched GvD and just vote evolved because they know he his powerefull without knowing anything about burning godzilla",
            "Honestly, I think Evolved does take this fight 😅\nMV Godzilla is just so strong these days",
            "Evolved does win, until he doesn’t. And then everyone loses. Unless they become friends and Evolved Godzilla rips Burning Godzilla like a bong dialing him down from death",
            "Burning Godzilla just wins here\n\n-said a very VERY confident Reddit user",
            "Well, the Heisei era iteration of Godzilla hasn't been updated in nearly 30 years at this point and as such doesn't get stronger anymore, meanwhile Legendary's iteration just gets stronger and deadlier with every new film that is being made (and the next Monsterverse film is confirmed to be centered around Godzilla himself, no monkeys involved)\n\nso It's only a matter of time before MV Godzilla's position as the most powerful live-action Godzilla is fully solidified.\n\nBut I agree, Heisei's burning Godzilla is still stronger in terms of sheer firepower.",
            "This Burning Godzilla would definitely lose to Evolved Godzilla, no doubt, but I think Burning Godzilla from KoTM could actually stand a chance atleast.",
            "not as much as kong riders 🗣️",
            "MONSTERVERSE SWEEP",
            "Heisei is my favorite Goji era. That said, GxKGoji wins this. He's a better fighter, comparable to FinalGoji, but much much bigger. BurningGoji probably has stronger fire breath and if he were to meltdown everyone loses, but 1v1, no meltdown, I give it to GxK due to mobility and sheer size",
            "So whoever voted on this poll and votes for normal Godzilla clearly dont know how strong burning Godzilla is",
            "Indeed. It’s crazy just how one-sided this whole debate even is.",
            "Naw who tf is that sped",
            "I mean GvsD version is literally dying, while Evolved is at his absolute peak performance. Evolved just has to blast his slow chonker opponent a few times to speed up the meltdown and it's an easy W. While on the other hand, pretty sure Evolved could tank any beams he could dish out from what we've seen.",
            "Evolved wins.",
            "https://preview.redd.it/1kqkk2qtl48d1.png?width=1080&format=pjpg&auto=webp&s=e26f70d0211535bafc88ef8bf5d0e5cb6a415002",
            "dont fuck with us godzilla fans\n\nwe’ve only watched the monsterverse movies",
            "Burning Godzilla was a PLANET KILLER!!!! He beats Evolved G easily!",
            "While I yeah Heisei solos, that doesnt change the fact that Heisei scaling is utter trash",
            "Oh boy the Monsterverse D riders are at it again 😮‍💨",
            "Look at that little goober",
            "Grogu has nothing on this adorable lil mfer",
            "![gif](giphy|ycagKBYEmaili)",
            "Elaborate",
            "I think Heisei is going to be pretty difficult to approach. I don’t know with absolute certainty that he wins depending on how close to meltdown, but Destoroyah was trying to flee for dear life as those spines started melting with world destroying energy.",
            "I get that like evolved is strong. I’m not saying burning would one shot. But I still think burning has it because of the infinite spiral heat ray",
            "I think him being able to match Shimo’s strength is supposed to be a decent indicator. Only problem is we don’t see as much of their fight as we should have. \n\nHe also ragdolls Skar easily and almost kills Kong with the Beast glove (not without a brief struggle though).",
            "![gif](giphy|3KbliBOdHlUE8)\n\nHe's too powerful.",
            "Yeah i guess so it’s probably mostly the little kids voting I actually still haven’t watched GvD but I know what happens and still how strong he is",
            "How?",
            "Well, he doesn’t just win. It’s probably a little fight, but it’s not just one shot.",
            "The next movie is currently being described as GxK 3 with Godzilla as the main character instead of Kong this time. So yeah Kong will be there(as of current information).",
            "[deleted]",
            "Speak for yourself.",
            "Heisei Burning was a **potential** planet killer, a feat that would've involved his own death as well. We have no indication he could consciously harness that level of power... at least not without killing himself in the bargain. Hell, Destroyah was able to hang in there against multiple red spiral ray attacks and wasn't even killed by them. It was the military's cryo tech that finished him off.\n\nAt best, I'd call this a draw, but even then, Legendary could potentially absorb the excess radiation before Heisei's meltdown reached planet-killing strength.",
            "My understanding of the various definitions of 'glaze/glazing' starts with the pottery use of the term, which I don't think fits here as the post doesn't seem to be pottery (and/or glass) related. There's also the particular idiom involving someone's eyes 'glazing over', but I've never seen the 'over' left out of that usage of the word and, again, I don't see any indication that this post is about Godzilla getting bored and spacing out. Lastly there's 'glaze/glazing' in a culinary sense, a sugar-based sauce used to coat food items that dries on the surface in a way evocative of the pottery use.\n\nIt's that last one, specifically with doughnuts or similar baked good and plain sugar icing, that leads me to the most modern slang usage of 'glazing' that I'm aware of and the usage that would be my first guess for a post like this on the internet. In short, seminal fluid looks visually similar to icing and things/people can be 'glazed' in a euphemistic sense. This leads me to question whether this post is *actually* about Godzilla being slathered in semen, or if there's some even newer slang that I haven't caught up to.\n\nI also have the vague notion that there might be some metalworking use for the term too. . . but I'd have to look it up to know and am not going to count it as part of my understanding given that.",
            "What’s you’re saying is not about a battle you’re comparing only their powers.\nBut if you look how monsterverse fight is clear that he fight in a more dynamic way.\nIf both fight in close range I think that monsterverse has more probability to win but if they fighting from afar monsterverse Godzilla is going to get destroyed by heise.",
            "Define \"infinite\"",
            "Both Evolved and Heise have spiral rays.",
            "He suplexed Kong nuff said",
            "Thanks for the spoiler 💀",
            "One Godzilla winning and then succumbing to irreversible *self-inflicted* damage due to his biology doesn't make it a draw. That Godzilla still won technically. A draw is when neither can defeat the other. If Burning Godzilla melted down and died *before* he could kill him **then** that would make Evolved Godzilla the winner, by default.",
            "speak for 95% of the current fanbase***\n\ni can always count on u people for misinterpreting comments",
            "Glazing lore",
            "I’ve seen examples of the “over” being left out of “eyes glazing over,” but it generally seems to refer *specifically* to the lifeless stare of a corpse in my experience, whereas “glazing over” itself can refer to the same, or simply spacing out or otherwise taking on a “glassy” stare.",
            "as always, redditors arent caught up with new internet slang.\n\nfyi its the new way of saying “dickriding”, as in monsterverse godzilla gets all the love and praise among newer fans while barely acknowledge the older godzillas and their respective films (other than using the showa films as criticism deflection lmfao)",
            "https://www.urbandictionary.com/define.php?term=glazing\n\nThe first couple definitions are what OP meant.  Basically overhyping something/someone that doesn't deserve it.",
            "You opened my eyes comrade",
            "Here I am thinking it's something for donuts.",
            "The \"infinite\" in the infinite spiral heat ray is left specifically vague",
            "“Infinite” in the “it sounds cool so let’s add it” way.",
            "It’s infinite heat/power",
            "Impossible: the universe would simply break beyond a certain temperature, and the infinite heat ray didn't actually destroy the universe."
        ]
    },
    "Here is what Minus One looks like with classic colors": {
        "title": "Here is what Minus One looks like with classic colors",
        "score": 993,
        "url": "https://i.redd.it/cvp3cpvgoz7d1.jpeg",
        "content": "Feel free to give your thoughts.",
        "num_comments": 40,
        "comments": [
            "https://preview.redd.it/69sz0t2q108d1.jpeg?width=828&format=pjpg&auto=webp&s=f531af6eb7f8b12c85f0951152e926f555155175\n\nThe evolution of mankind",
            "Love it, does feel classic for sure",
            "I kind of like it.",
            "Is this the S.Hmonster arts figure done the classic colors or is it photoshop.",
            "Reminds Me of The Gemstone Goji Design From “Godzilla vs. Gigan Rex”.\n\nhttps://preview.redd.it/3rbie5cyg08d1.jpeg?width=640&format=pjpg&auto=webp&s=653abba5cde5e8f8df16f03e725c690638ffe92b",
            "WAY better imo.\n\nMinus one's design is amazing, but I hate the one color tone he and legendary have (besides evolved). \n\nThe dorsal plates need to be a different color from the skin to work imo, it doesn't feel right otherwise.",
            "looks really good.. honestly if TOHO was gonna keep the design for mass marketing use these colors .. or even use Heisei Godzilla colors.",
            "I like it it looks really nice 👍",
            "So much better than the mud look in my opinion",
            "It doesn’t really feel right, imo. Besides the fact that Minus One already has “classic” colors, outside of the dorsal fins. In the movie, and on the stock SH figure, he’s very much a charcoal gray color with patches of tan across his body, most notably on his feet and chest. And, his fins also have some color to break up the grayness.",
            "It looks actually really good!",
            "That looks really cool",
            "Now it really looks like a heisei goji 2.0",
            "Lowkey just looks like Spiky Heisei",
            "Omg that looks cool AF",
            "This works really well.",
            "Beautiful ",
            "If we get a Minus one sequel, this is what I'd want the second godzilla to look like. It's just so perfect and natural looking.",
            "It suits him so well, somehow I like it better than his old colour scheme which was pretty cool. I hope this is what he looks like in the sequel if they follow through and make one.",
            "If this becomes an actual paint job I’m buying it without hesitation (and kidneys)",
            "I like the Godzilla minus one movie quite a lot, but does anyone think he looks a little dog-faced? \n\nHe just reminds me of a puppers. Like alot, couldn’t see anything else but the puppers face.",
            "Looks pretty cool, not sure which I prefer tho",
            "Damn - !\n\nThat’s PERFECT!🤩 \n\nI already love & revere the Minus One design of Goji, but with the more traditional color scheme, it is (in my humble opinion) THE ultimate incarnation of Godzilla!  Thank you for sharing! 😁",
            "It turns a good design to a great design 👍",
            "Link for purchase?",
            "Ima be honest I didn't even know for the longest time he didn't",
            "Makes him look more haunting ",
            "This is awesome!\n\nMaybe you could apply the same paint job to this fella as well?\n\nhttps://preview.redd.it/pmd1lekg428d1.png?width=1280&format=png&auto=webp&s=38ccea717843600b442147bc8d97d2d618ec6322",
            "It’s fire, ngl if I could get this, I would",
            "https://preview.redd.it/oj5se2vob38d1.jpeg?width=750&format=pjpg&auto=webp&s=22dd32b9b42543dc199a16cac9356152e2985d62",
            "Could you put in the original colors for reference",
            "that's super reminds me of kirio goji, just Me?",
            "Now THAT is a recolour I want shma to make..it would be (imo) the peak goji figure",
            "Much better",
            "[deleted]",
            "\"STOP FUCKING WITH THE DAMN UI-\n\noh.. It's a screenshot..\"",
            "It’s photoshopped.",
            "While I personally don’t mind the same colored plating, I completely agree that having the plates be a different color really improves a Godzilla design",
            "It’s photoshopped.",
            "https://preview.redd.it/1xqw01sqt08d1.png?width=544&format=png&auto=webp&s=5aac9245848712b8f3deec4f5b976ae39baedfd7",
            "Ok it’s done really well"
        ]
    },
    "20 years ago, the Prince of the Monsters would enter his first battle in protection of humanity. ": {
        "title": "20 years ago, the Prince of the Monsters would enter his first battle in protection of humanity. ",
        "score": 867,
        "url": "https://v.redd.it/jdpgxu0ypz7d1",
        "content": "",
        "num_comments": 29,
        "comments": [
            "Desteroyah getting folded by a child",
            "Isn't this movie 30 years old or something?",
            "First, it was nearly 30 years ago. And second, are we gonna forget that Minilla fought and landed the final blow on King Ghidorah?",
            "This was actually the first old school Togo godzilla movie I ever watched",
            "Even as a juvinile,jr was fearless ,just like his dad",
            "Heisei godzilla is peak fiction",
            "I remember that good one",
            "I haven’t watched the Heisei era. But I gotta admit I love this fight scene.",
            "Very nice battle",
            "Junior!",
            "I hope for the 70th anniversary for godzilla they rerelease every godzilla movie to watch",
            "This is going to be one of my favorite moments in Movie Cinema",
            "https://preview.redd.it/bzps0ryrp18d1.jpeg?width=828&format=pjpg&auto=webp&s=93a9db025a3c5de9593461f3b5965c27659df92b",
            "Why does Desteroyah  have jet propulsion coming out of his butt in the flying sequences?\n\nI assume it's a miniature? So they hook the miniature on a piece of wire and use the jet propulsion to move it along?\nWouldn't an electric motor inside have been a better option? (Or even using gravity?)",
            "I hope they give us a Destroyah in the new Monsterverse. I want it!",
            "Isn't Gomora the prince of the Monsters?",
            "They not be related by blood, but Jr's got his father's fighting spirit.",
            "Will be turning 30 years old next year!",
            "Just about",
            "Yeah, I give him credit for that, also that was a typo.",
            "What movie was this in?",
            "I mean, let's be honest. Minilla did the last 0.1% of Ghidorah's HP",
            "Hell yes, I stand this",
            "https://preview.redd.it/8lhhve91j18d1.jpeg?width=1414&format=pjpg&auto=webp&s=a04ada130fd7b8392460c09b1734cc35c9a2df9e",
            "True....",
            "Godzilla vs Destroyah. One of my favourites!",
            "No sorry I should have specified, which movie did he last hit Ghidorah?",
            "Ah fair enough my bad. That was Destroy All Monsters if I'm remembering right.",
            "Thank you! I guess I need to dona rewatch 😁"
        ]
    },
    "Pick three to protect you, the rest attacks you": {
        "title": "Pick three to protect you, the rest attacks you",
        "score": 54,
        "url": "https://www.reddit.com/gallery/1dlsu47",
        "content": "",
        "num_comments": 34,
        "comments": [
            "Mecha g,godzilla and ghidorah is the strongest of the six",
            "Godzilla, Mecha Godzilla and Ghidorah. \n\nThere is no reason to choose anyone else. Maybe Kong will be a slight problem but not too much.",
            "Ghidorah, MechaGodzilla and Mothra. Mothra would convince Godzilla to join my side and I win.",
            "Muto, Mechagodzilla, and Ghidora",
            "Godzilla, ghidorah and muto, cuz mutos kill mg with emp , king ghidorah kills mothra and rodan and godzilla jills kong. Gg",
            "Godzilla, Ghidhorah and mothra",
            "Godzilla ghidorahmothra. Use ghidorah t kill mothra. Turn godzilla into burning godzilla and solo everyone else",
            "Well, the two obvious picks are gonna be King Ghidorah and Godzilla, that’s a no-brainer. Mechagodzilla or Kong could be the third member, but if it's the Kong shown and not current MV Kong, then you should pick Mechagodzilla.",
            "Godzilla mechag and king g. They lurking everyone.",
            "Godzilla, mecha g, and ghidorah",
            "Godzilla ghidorah and mutos",
            "Godzilla, Ghidorah, Mothra, for me these are pretty good picks, Godzilla and Ghidorah are probably the two outright strongest. And Mothra for extra air support ig\n  Alternatively it could be Kong or Mecha G leaning towards Kong",
            "Godzilla, Mothra & Kong",
            "I pick Godzilla himself, he's easily the strongest kaiju in the Monsterverse with the evolved form.",
            "MG, G and GGG\n\nThe MGGGGG",
            "If the Mutos breed, then yeah, I'll call for them for sure, if for whatever reason they can't then Mecha Godzilla can show.\n\nKing Ghidorah protecting me would be sick, and as long as a thermo Godzilla doesn't show, we'll be fine... unless the big guy kills me unintentionally...\n\nAnd finally, Godzilla has got to show, it was either that or lock his thermo by taking Mothra.\n\nEither Gojis or King Ghidorah would slap kong hard, Mothra and Rodan are nimble but dual breath lasers from the Gojis and Ghidorah could slap them from the sky. Truthfully Mutos might be the most challenging, given the time they can go 1998/ 2016 on our buts, and flood the region with a mini-army, Ghidorah or thermo G would be needed for a large group like that.\n\nKong could be a challenge, since the humans would give him some bs knowing how he keeps getting gifted new weapons by others in recent movies.\n\n\n\nKing Ghidorah would definitely have to stay on our side, since mecha would be weak to those beams relatively, and the fliers would be zapped, and Goji might not be strong enough, since his 2014 and 2019 variants were definitely not strong enough, and GxK Goji might have better chances, but he's not in the above images.\n\nMecha Godzilla wouldn't be too bad to take down, since the design uses its tail quite a bit in GvK from what I remember and the knees would be a relatively open place for others to attack if it was distracted, not to mention ghidorah could just drop the guy.\n\nGodzilla as an enemy would be a bit tricky cause he has been improving through the movies, so he could be a threat if not taken care of quickly, and he could make use of whatever combination, since kong would be a fair bit nimbler than most kaiju.\n\n  \nWell anyway, I'll be going with Godzilla, Mecha Godzilla and King Ghidorah, and although it may seem like an obvious win to some, the opponents should not be underestimated, especially a breeding muto population and an equipped kong.",
            "MechaG, Godzilla and ghidorah, triple G team. Don’t never need mecha Godzilla, Godzilla and ghidorah team literally can’t be beaten",
            "Godzilla, mecha Godzilla and Ghidorah.",
            "I'm just curious, wouldn't the MUTOs actually be super good against mecha g and ghidorah?",
            "Big g, mecha g and gidohra",
            "Im choosing mechagodzilla, no reason other than he's my favorite",
            "Godzilla cuz he's really srtong\n\nGhidorah cuz he's the most OP of them\n\nand MUTO to take down MG with the EPM attack at begining of the figt making the other team very weak, also with MUTO in the other team it would be really hard to Godzilla survive",
            "Screw the Meta, I take 3 Rodans.",
            "Probably Ghidorah, obvious, Goji, obvious, and Mothra just in case we need a need a bit of kaboom.",
            "Ghidorah, godzilla and kong",
            "Ghidorah, Godzilla and Kong. Why Kong over MechaGodzilla? They're pretty even power wise but Kong has a special connection and understanding with humans, so he would be a lot more gentle when guarding me and is agile enough to dodge any aerial attackers. MechaGodzilla on the other hand is controlled by the most unstable Ghidorah head and would probably crush me on accident. ",
            "Godzilla, Gamera, and Ghidorah",
            "MUTO take down MG.",
            "Only if you gave him the glove and axe..\n\nEven then, he needed it powered up to even hurt Mecha while Godzilla is self explanatory plus Ghidorah can fly. (Also regen heads and blast him but with 3 heads to do it)",
            "Yeah i think i should have left out Godzilla or Ghidorah, i was hoping for a more diverse opinion, but it’s always the same i am reading because it’s to obvious who to pick",
            "MG would be taken dowm by MUTO with the EMP attack",
            "man, MUTOs have emp attack, your MG is gone",
            "why is no one using the brain and instead yall are shoosing MG to your team to go against MUTOs? that's just stupid",
            "Finally someone who says f*ck you to the Meta 🤝"
        ]
    }
}