{
    "[Official Tournament Discussion Thread] 2024 Traveler's Championship": {
        "title": "[Official Tournament Discussion Thread] 2024 Traveler's Championship",
        "score": 17,
        "url": "https://www.reddit.com/r/golf/comments/1dka9ne/official_tournament_discussion_thread_2024/",
        "content": "Event: The Traveler's Championship\n\nLocation: Cromwell, CT\n\nCourse: TPC River Highlands\n\nPurse: $20,000,000\n\nDates: 6/20 - 6/23/2024\n\n[Tournament Website](https://travelerschampionship.com/)\n\n[Field](https://www.pgatour.com/tournaments/2024/travelers-championship/R2024034/field)\n\n[Tee Times](https://www.pgatour.com/tournaments/2024/travelers-championship/R2024034/tee-times)\n\n[Course Overview](https://www.pgatour.com/tournaments/2024/travelers-championship/R2024034/course-stats)\n\n[Leaderboard](https://www.pgatour.com/leaderboard)\n\n[Fedex Cup Standings](https://www.pgatour.com/fedexcup/official-standings.html)\n\n[TV Schedule Link](https://www.pgatour.com/watch)",
        "num_comments": 262,
        "comments": [
            "I would enjoy seeing Tom Kim or Fowler winning",
            "bhatia has the same build as his putter",
            "It feels like Scottie’s just getting started, but massive props to the mad lad Tom Kim for leading R1!",
            "Rickie rising.  You love to see it!",
            "Love seeing Tom Kim starting to get some consistency",
            "Tom Kim is giving his whole meat to this course good lord",
            "Is homa crying? Lmaoooooooo",
            "Rickie finally gonna do something this week?",
            "Feels weird watching a normal course",
            "Tom Kim is 2.5 years younger than Ludvig Aberg",
            "I love Viktor, but it seems every time he's doing well, and i start to watch him, he loses it all. I feel like he's cursed whenever i start to watch him play.",
            "Jordan: smashes a nice draw off the tee, club twirl, doesn’t watch it land …. Right into the bunker",
            "Wow. Rickie had an amazing day.",
            "Matt Fitzpatrick is kinda on a suck streak. He made the cut at the US open then finished +13. Finished today at +5\n\nEdit: +4 for today but that's still good for T-67 - only one guy did worse",
            "Rickies putting was locked in. I might have to bust out some Puma polos this weekend lol",
            "Birthday Tom Kim new mythical golfer?",
            "Someone please get Jordan a real good sports psychologist.",
            "No one ever talks about Sung Jae Im but it seems like he's in top 10 every week lol",
            "The conspiracy all makes sense now. Bryson has been promoting himself on YouTube to be palatable to PGA fans. An agreement between Jay and PIF was that he needs to to win a major and go on a friendly PR tour to soften the blow of the eventual merger. Rory was given big money to lose and accidentally started sinking 20ft+ putts at a US Open on Sunday, so he had to throw on 16 and 18. Now for the first time ever I see a LIV livestream on my YouTube feed during a PGA weather delay. They played the algorithm beautifully to gain an extra 1,000 viewers.",
            "an withdrew?!?!?",
            "Has anyone played this course in real life? It's a fun layout to play in 2K23.",
            "I did not have Tom Kim whipping the field on my bingo card at all.",
            "Decent 29 from morikawa on the front 9",
            "the rough on the backside of 11 green should be cut way short so it rolls down into the waste, having long shots just stop on an uphill lie seems lame even if the rough is 5 inches long or whatever",
            "The current top 6 are partly or totally of Asian/Pacific Islander descent.",
            "It’s like each hole they show has different weather. Gotta love Connecticut",
            "Haven’t payed attention to coverage until just now when I got off work early. JT being 6 under is legit shocking",
            "They're letting guys lift, clean, and place when there are multiple people in double digits on Friday? Jfc this is lame golf",
            "Oh boy if Scottie is having those falling in he’s going to destroy the field ",
            "Looks like Scottie’s off to a good start",
            "How many times has \"highly improvisational shot there by Spieth\" been said in the past few years?",
            "will z -6?\n\nfirst time they have shown him.  weird",
            "LAME",
            "Alright folks, it's that time of the year again where I get to dish some observations from the course!\n\nI'll start off the big one: ShotLink is simply not as sophisticated for the volunteers as it had been since I started volunteering this event in 2013. Yes, we have all the cameras around the course tracking the balls, but it's become so automated that the tour doesn't even bother having the spotter volunteers learn the gadgets anymore, so all we have to do is follow balls in midair, track what they land in, and flag them if needed. It sucks, I loved using the lasers and the tablets and I didn't mind having that kind of job for a couple of rounds. Will I stop volunteering? Nah. Will I find something else to do next year--preferably a standard bearer or walking scorer? Depends on if there are slots available and I'm willing to work all the rounds they want me to.\n\nSo I was stationed on 3 fairway today, haven't been on that hole since one of the years Bubba Watson won (I remember it being overcast and dreary on Sunday). First time I've ever been on the shady side of the hole though, left of the fairway. Was very pleased at all the shade I had throughout the whole shift, almost as much as I've had on 10 the past two years. So that was a good start.\n\nSeeing the front left pin location, I expected a lot of misses wide right as well as a lot of less than driver off the tee to keep it in the wide part of the fairway. The first few groups seemed to defy both of those, but as it got later in the day and the fairway dried out, the players wisened up and took it easy, although there were still a few misses. Even saw a few balls bounce off the cart path, one going so far as to land on 4 fairway (Nick Taylor I think? I know it was one of the Canadians).\n\nApologies to Cam Davis, we nearly lost his ball in the fescue, but his caddie came in clutch, then *he* came in clutch after he punched out to save par and eventually posted a very nice 65.\n\nBrian Harman's waggles are absolutely legit even on Thursday. This is not him trolling for the camera.\n\nCameron Young and Patrick Rodgers' caddies *really* don't like Detroit Golf Club...either that or they don't mind the course but they don't like Detroit.\n\nLudvig Aberg and his caddie are two great guys. I flagged his ball because it was kinda in a blind spot in the hill and I wanted to give our tech a fair chance to properly confirm where it came to rest. (Mainly to make sure we got the right cut of rough.) It was barely sitting in the primary rough and was actually fairly visible, so I hoped it didn't come off as condescending to Ludvig, but I guess it didn't. He thanked me and his caddie got a kick out of me observing him using the sand rake to pull Ludvig's divot from his second shot out of the bunker. They're having a great year, why shouldn't they enjoy the little things?\n\nFinally, I think I've got an answer to that burning question I've had since Pebble Beach. I asked our tech between groups what was going on with the super late call to cancel the fourth round at Pebble and what would have happened if Wyndham and Ludvig were tied, rather than Wyndham one ahead. (I still feel the outright lead was a large part in the tour waiting as long as they did to call it.) He thinks they wouldn't have attempted a playoff on Sunday or Monday and that they'd have called it a split victory. So I guess some people are good with ties.\n\nI'll be back out on Saturday as I usually am! Probably back on 3, or maybe even 2, judging by my check-in time and if that rain looks looming I might get some shelter! Careful out there everyone!",
            "Akshay has been playing some pretty good golf the last couple of weeks. Hope he can put up 3 more low scoring rounds.",
            "that eagle was too easy for scottie",
            "Conners finally waking up",
            "Schefflers odds are not even worth it lol. Then again they probably are because he’ll probably win again",
            "Gotta say it’s gonna be a fun golf day today. Womens PGA should be shaping up to be a good one. The travelers is a fun post US Open tournament. Should be good golf today!",
            "Just started watching, what’s the deal with guys (Hovland, Zala) getting club length relief around the green?",
            "-11 early on a Friday seems kinda wild.",
            "lol what a par by Viktor",
            "JT Poston starting out hot 🔥 🔥",
            "for all the idiots not paying attention:\n\nits lift, clean and place today.",
            "Spieth is still outside the FedEx's Top 50. He still has time but that's terrible career management/worst case scenario from him. Either take time off and fix the injured wrist or make sure you're in that top 50. Taking that  time-consuming job on the board is also dumb AF. A whole season with nothing to show for on and off the course.",
            "Scottie got to -11 it’s over for the field",
            "Scottie needs to get to -11 today",
            "Putting a signature event the week before AND after a major is asinine behavior from the PGAT",
            "Damn, I forgot to bet on Akshay before this tournament...",
            "Hot take: Dechambeau should be on the US olympic team over Clark",
            "I love Hideki’s swing. So simple and smooth.",
            "Scottie was pissed about shot 4",
            "I love a good chip on the green",
            "All these guys are like 5 yards from amazing shots on 15, they're all leaving it a hair short\n\nAmazing how consistent they all are, I bet they're all aiming that little bit short cause it's the better miss",
            "Zalatoris is -7 but they've shown maybe 2 of his shots?",
            "Another birdie fest",
            "Let’s go Rickie and Scottie and Postman!!!",
            "I've been wondering about the Brice Garnett guy who won the Puerto Rico open. I didn't see him in the US open field or in this weekend's \"signature\" event. I guess winning an alternate field event isn't enough to guarantee your appearance in such tournaments. Is anyone familiar with the rules and what you get (other than money and FedEx points) from winning such a tournament?",
            "From Tom Kim’s back nine yesterday and front nine today, he -9 with no bogeys lol",
            "Anyone know who’ll have coverage when the delay is over?",
            "Does justin rose have the flu or something? How is he +7",
            "It’s actually wild how Scottie is 2 back amongst an absurdly packed and talented leaderboard and everyone is like “congrats on the win!”. He just has that inevitable aura when he’s up there on the weekend.",
            "As much as I like Bhatia I really don’t want him to win this thing",
            "JT is a Mickey Mouse course merchant at this point",
            "The sound needs to chill",
            "19 straight holes Tom Kim has hit the fairway or for par 3s, the green, with the exception of one hole he landed in intermediate.",
            "Is JT back?",
            "Dogshit audio thanks espn",
            "I still refuse to believe megacorp is a real thing ",
            "Just once, I’d love to hear a “Shut the fuck up” when some idiot yells “Babbabooey!”, “Mashed potatoes!”, etc..",
            "I knew Willy z couldn’t hold the lead",
            "Dang. Didn’t realize most everybody is in this tournament.",
            "Is there a Xander featured group on ESPN+? I wanna see him play the last 4 holes",
            "This course looks to be in perfect condition. Not a single patch of non-uniform grass. Props",
            "Tom Kim gotta fuck up a little so it’s fun for us lol",
            "Tom Kim Jesus",
            "Malnati with the birdie birdie finish to beat Bezuidenhout by one as he bogeyed the final hole. Absolutely terrible play by Bezu. Dont even get me started on Will Zalatoris. Cant string two days of good play together on an easy course. Shame.",
            "Scheffler 🔥",
            "Scottie winning this week with Morikawa as runner up again",
            "Not saying I’d want this, but Cantlay sleeper British open pick?",
            "Easy courses are boring now, Pinehurst has ruined me.",
            "Pretty insane that Clark is in the Olympics over Bryson",
            "Postman with the back to back birds hell yeah",
            "Cameraman got fooled twice with the Clark chip",
            "Victor “I’m not known for my short game” Hovland ladies and gentlemen ",
            "Can someone explain what Xander is doing with his fidgeting prior to hitting a ball? Is this just his version of a waggle?",
            "What's up with Matt Fitzpatrick? Seems like he's in very poor form this year...",
            "Silly Willy can’t buy a birdie today",
            "Uh oh X man came to play",
            "Did Tom Kim just lift and clean? What was that about? Why did he pick his ball up off the fairway?",
            "Dang round 2 resumed",
            "Woah JT is on the leaderboard",
            "Oh my god can the boom mic guy on the tee box scoot the fuck back? The fore calls are fucking up the audio on my tv",
            "Big Viktor Hovland pretty mediocre today but overall looking like a guy that’s ready to explode this weekend. Top 10 incoming is what it looks like.",
            "Gotterup with a quad bogey. OB back to back off the tee. Man he sucks.",
            "do pro's even gain confidence beating up an easy course",
            "Any of you want to do a tier list for all the stupid things people yell when the player drives the ball: such as \"light the candle!\", \"mashed potato!\" and \"Baba Booey!\" I heard someone claim that during the US Open someone yelled, \"I shit my pants!\" but I did not hear this firsthand.",
            "Scottie! Scottie! Scottie!",
            "Lol this guy really ask if new haven pizza was New York style?  Jfc",
            "No tournament thread for LIV Nashville?\n\nGo Bryson and Crushers!",
            "Must be a typo on the front page of the leaderboard. Wyndham Clark is on there. Don’t tell me he learned how to play golf again?",
            "Good to see that Clark might not be a total waste of a Olympic spot ",
            "Weather delay cause it's kinda cloudy out, this is soft as baby shit",
            "I love that I can’t even watch any golf on any of my TV channels right now. They don’t show the women’s PGA championship on any network in Canada and men’s golf starts in another hour. I’m glad golf central pregame is on when all the major pros are teeing off.",
            "Not that it matters but Wyndham Clark’s fit today is garbage. White and blue polo with the black and pink T-mobile hat looks like a second grader who dressed themselves",
            "After such an amazing US Open, going back to a current status quo PGAT event just feels like waking up with a hangover after an amazing party the night before and you have to go to work that day. \n\n\nTune in this week to see which player you've barely heard of tries and ultimately fails to unseat Scheffler for the title. ",
            "im so glad liv is on and they actually show golf.\n\nany word on a restart time for travellers?",
            "You may know me as an Aberg hater if you frequent this thread but one of my clients this week was a Swedish woman who made me lots of money so I saw it as a sign to bet on Aberg this week. So LfG lol",
            "Is there a feature group with Rickie that I'm not aware of? He's one back near the top of the leaderboard, and it seems like I've only seen one shot of his in the last 20 minutes",
            "Any round 3 2ball bets?",
            "I predict Justin Thomas, Tony Finau, and Shane Lowry will all blow it today and be out of contention",
            "Anyone watch LIV because of the delay?\n\n![gif](giphy|Bng9nsAhSaDVxWsSLh)",
            "I did not see Tom Big Bombs Kim showing up today",
            "It’s a pretty bad miss for a guy that hits 1 draw a tourney. I know it was a double cross, but maybe the wind got in his head.",
            "Fuckin hope so. Dude was on a completely different planet over the last few weeks. Would love to see him grab another W.",
            "I learned recently Ricky is my grandfather’s favorite active golfer which is a completely unexpected pick",
            "wow.  another one.\n\nim completely shocked by his performance today",
            "Best case, he is in contention Sunday and then fades down the stretch.",
            "About a year younger than Thorbjornsen who’s making his pro debut this week",
            "Yeah but Tom looks like a 6th grader so what’s the point lol",
            "\nstop watching   Him",
            "He’s logged those shots in his journal tho",
            "There's a cut this week?",
            "Don't forget he shot a 60 in the third round last year and got that Detroit win shortly after so he might be feeling the summer vibes.",
            "That's quite the conspiracy. You honestly believe that?",
            "Never played irl yet (hoping to later this year), but whenever I go to watch in person the players always seem to have fun with it and feel really comfortable throughout.",
            "Watching the round this morning, it does look like a really fun course for Weekend Whackers, as most of us are.",
            "How many American Olympians among them?",
            "Barstool sports guy says Connecticut has the best pizza 🍕",
            "5 under on the day through 12 with no bogeys, crazy good round so far",
            "too bad hes botching this par 5",
            "~~-2 though 3~~\n\nedit: -3 though 4",
            "How many times does he do something stupid off the tee (all the time)",
            "He got it to 7 under",
            "Trying to ice scottie!",
            "Hot enough for ya?",
            "Thanks for the super detailed updates every year!\n\nStandard Bearer is IMO the best volunteer position as long as you don't mind the walk and carrying a sign. Done it at 4 Canadian Opens (3 PGA and 1 LPGA). The only position with a front-row view of a group and pretty stress free since you can refer to the walking scorer if you lost track of score.\n\n>Cameron Young and Patrick Rodgers' caddies *really* don't like Detroit Golf Club...either that or they don't mind the course but they don't like Detroit\n\nDetroit GC is a pretty standard course with no huge hills so multiple **caddies** not liking it would be pretty interesting... I'll just assume it's the city.\n\n>He thinks they wouldn't have attempted a playoff on Sunday or Monday and that they'd have called it a split victory. \n\nI imagine they'd split the purse and FedEx points, but one interesting question is whether it counts as an official PGA Tour win in the # of wins column or not (for example, Adam Scott winning at Riviera one year when it was shortened to 36 holes did not).",
            "Love me some Akshay. Fellow lefty and it's cool watching the slender man smoke bombs",
            "Corey already woke back up last week!",
            "lift, clean and place today.\n\nviktor is taking advantage of it around the greens",
            "That's what I'm wondering. I'm at the event now and I seen it several times. I saw someone get a clublength in the middle of the fairway. I don't get it",
            "-12 now through 27 holes is crazy. Honestly I’m not a fan of this kind of golf",
            "> Spieth is still outside the FedEx's Top 50. He still has time but that's terrible career management/worst case scenario from him.\n\nHe’s doing it in solidarity with his BFF JT",
            "Scottie gettin hottie with 2 birds in a row",
            "They do that on purpose cause otherwise the big boys don't show up",
            "Right. I know it’s not easy, but they are making it look like and easy course compared to last weekend",
            "Consider yourself lucky, cause it’s gonna be demoralizing to be holding an Akshay ticket at 90-1 when Scottie inevitably wins by multiple shots",
            "absolutely scalding take that the US open winner should be on the team over someone named Wyndham",
            "Not a Bryson fan, but I agree. It's sad the main reason Clark is in is because he finished first in a 54-hole event. In the past, you used to not get points for rain-shortened events and they changed the rules on it recently.",
            "That’s not a hot take. It’s in fact ice cold.",
            "It’s the olympics, it should only be amateurs. Let the pros make their millions and the amateurs play for their countries.",
            "way better shot 5 tho",
            "Historically for this place? Yes.",
            "...yeah, like last week...",
            "Oh and yeah Aberg lol",
            "Only winners of regular field events earn a spot in sig events. The PGA Championship is the only major that gives a spot for winners of alternate field events.",
            "He might not have had enough world golf points or maybe for whatever he didn't want to play. I can't imagine all non-signature event wins get you into the signature events.",
            "I would like to know too. What’s the update? Are they going to get back out there today or finish tomorrow ?",
            "Sometimes golf isn’t all sunshine and *roses*",
            "That's golf ",
            "He’s 44 years old. No spring chicken anymore. ",
            "I shot a 95 and a 79 three days apart a couple weeks ago.\n\nSometimes it be like that.",
            "Not sold on that one. On a harder course, if he was this close going into the weekend I'd love his chances. But on this track it might be anyone's ballgame",
            "Congratulations Scottie 👏 How many wins would that be for him this year? 6?",
            "L take",
            "See, that's the problem. The good ones know *when* to shut the fuck up.",
            "It's a signature event. They're gonna be as odd as that seems",
            "Not in a featured group unfortunately",
            "He's such a disappointment. He's only won 1 major this year. :P :P",
            "I like them both ways",
            "You’re gonna hate Troon then.",
            "I mean it wasn’t a handpicked thing. It’s literally the top 4 golfers based on OWGR. And LIV golfers can’t earn points toward that ranking.",
            "Bryson could never pass the Olympic drug testing protocol, that's why he joined LIV.",
            "Clark earned it.",
            "and is in great shape on 15",
            "I'm curious what's up. Maybe he's injured a bit? He can get a good round in every once in a while but he can't out it together for 4 days",
            "He just finished top 5 at the Memorial 2 weeks ago. Just a bad round today.",
            "Preferred lies",
            "I believe there is a storm around noon approaching, meaning the guys in the afternoon will be playing in messier conditions so they likely made it lift clean and place today. Don’t quote me on that.",
            "Why you gotta come at r/golf like that 🥲",
            "lol someone did. It was after a drive by Neal Shipley.",
            "Haters gonna hate.",
            "It's probably due to lightning strikes within so many miles of the course. Looking at lightningmaps.org there have been plenty in the last hour in the greater Hartford area.",
            "could you buy espn+ and have been watching since the first group teed off?",
            "Traveller’s is a designated event so it should be all the best guys on tour right now. But yea, hard to follow up the US Open especially with all the excitement on Sunday.",
            "Is this just complaining for the sake of complaining? It's literally everyone that played last week except the LIV guys.",
            "Women's PGA championship is this week! I'm going to watch that instead, the women's us open was really entertaining.",
            "I like seeing guys I've never heard of (and some that I have) win their first pga tournament. Can't imagine the feeling.",
            "LIV has an event?",
            "https://preview.redd.it/7alc5g3ljq7d1.jpeg?width=1125&format=pjpg&auto=webp&s=31782dd21d3f8085ad4cd2974a48c0389e8d8dc0\n\nHe’s not in a featured group today",
            "> Anyone watch LIV\n\nNaw",
            "I didn't even know LIV had an event.",
            "I think he gave up trying to go 320 yd and just decide to go back to his old style of making the fairway 90% of the time",
            "There was a good long stretch of years where everyone just assumed Rickie would finally put it together. A major, if not multiple, felt inevitable.\n\nIt still wouldn't shock me to see him in contention on a Sunday in some random major. The shocking part would be if he didn't collapse on Sunday",
            "No",
            "No, he's just close to last. Finished +4 for T67 out of 70 - only 1 golfer did worse",
            "Do I believe that the US Open was rigged to boost LIV viewership? No.\n\nDo I believe the PIF will fund Bryson's impending (and entertaining) public year long victory lap at a financial loss just to prod negotiations along? yeah",
            "TWO!",
            "I don't know who that is, but he's not wrong.",
            "facts!",
            "It was nasty out there for sure yesterday! Like I said though, it was nice to have gotten an area where I had a choice of trees to station myself for the day, and the only times I really had any extended exposure to the sun was when I was walking any more than 30 yards at once. Suffice to say I've accumulated a ton of free sunscreen from the volunteer tent over the years and I've never been shy to use it!",
            "PGA Tour events shortened to 54 holes have been marked as official wins for a while. (Insert Dustin Johnson LIV jokes here.)\n\nAs for Detroit GC/Rocket, yeah, it definitely had the vibe of Detroit itself being a bit skeevy. That and you're hitting the post-US Open doldrums where there really isn't anything big besides the Open Championship until the FEC Playoffs begin, and even that's been shortened to three tournaments.\n\nI've said it before, I'd actually be okay with the Travelers ceding signature status for a year to give one of the midwest tournaments at least a temporary boost, but I think we all know most of it comes down to which sponsors are willing to put up the most money to elevate their event.",
            "No doubt. Was just surprised he started off sluggish at 2 over, but then he turned it on.",
            "No one else is within 6. Kim is just playing lights out.",
            "Do you feel the same about basketball?",
            "Also would be cool. Shipley would be there",
            "People want the best in the world to play. They don't want to see some nobody play.",
            "No…",
            "Winning a regular non-signature event definitely gets you into all the signature events, from what I've observed. It's just the alternate field events that don't, apparently",
            "Started again on ESPN",
            "I’m not actually sold either. So many guys up top capable of going really low and running away at any point. Was more just commentary on how the golf watching/betting world views things when Scottie is in the mix.",
            "Jail changes a man ",
            "Which is stupid, and invalidates the O in OWGR",
            "Actually, he had one really good round at Memorial that got him a backdoor top 5. Outside of that, he's really had a bad stretch since the Players.",
            "Also a pretty bad tourney last weekend, though",
            "That makes sense but gives a huge advantage to morning guys.",
            "Not a hater. But the guy has been terrible the last couple of months and I think 99% of golf fans would agree he shouldn’t be on Olympic team.",
            "A little lightning never hurt anyone. ⚡⚡⚡",
            "Isn't it only like $10? That's how I'm watching it but in my case espn+ comes included with my Hulu package because they are both owned by disney.",
            "Really annoying that ESPN+ is an additional fee on top of my youtubetv subscription lol. I know its only 10 bucks, but when you start adding up all the fees required to be a sports fan it is not cheap.",
            "Thank you forgot about that! Will definitely be watching the ladies this weekend",
            "I could believe all of that. But what stuck out to me is if you really think Rory booted those punts for a payday?",
            "I'm going there on Sunday only and have been anxiously watching the forecast.  Latest word seems to be is that Sunday is gonna be just as bad as every other day of the tournament",
            ">PGA Tour events shortened to 54 holes have been marked as official wins for a while. (Insert Dustin Johnson LIV jokes here.)\n\nThat's only if the weather affected the event badly. I'm not sure they get official world golf points.",
            "I mean guys will get close. I’m saying the fact that it seems harder to bogey than birdie these holes for these guys",
            "All sports in the Olympics. If you’re in a pro league you should sit it out and let amateurs represent their countries.",
            "The best in the world already play against eachother 4 tournaments a year",
            "....right....",
            ">It's just the alternate field events that don't, apparently\n\nYes, that's what I meant.",
            "Right but as it stands it’s an unfair advantage for the guys in the morning who don’t have to worry about weather a muddier conditions.",
            "His results since the Olympic qualifying period started are hard to deny. Won the Wells Fargo, won the US Open, 3rd at the Tour championship, won Pebble Beach, 2nd at Bay Hill and the Players, dozens more strong finishes at big events. I probably wouldn't take him if I was picking the team, but he earned his spot.",
            "i pay $10,99 for just espn+.\n\nbut if u like golf and your work computer doesnt block it or you wfh its easily worth it",
            "No. Just a joke that the long putts don't drop on Sunday at a major anymore. However the \"angrily leaving the parking lot\" right at the end would be a great way to sell it if it WAS rigged, especially when they get to compare it to Bryson's handshake with Xander after the PGA.",
            "He was clearly joking lol",
            "They've installed a *lot* of water stations on the course. Keep a map handy so you can find the nearest ones and refill accordingly.",
            "Just looking up the OWGR site, when Clark won at Pebble he scored ~71.74 points for the win plus 4 points for what they called \"Multi win bonus 70%\", jumping from 10th to 6th in the rankings at that time. Even without the bonus and without a fourth round to play, that win actually gave him slightly more points than when he won at Quail Hollow in 2023, as an event on the same tier (although that had a full 156 player field which might have affected its strength a bit). \n\nFor an even closer comparison of tournaments, Scheffler only got about 63.9 base points for his win at Hilton Head and Rory only scored 60.8 for his win at Quail Hollow this year. I'm not exactly sure how the strength of field calculations work these days, but that anomaly might have something to do with Scheffler; he theoretically can't score ranking points \"against himself\" so him winning Hilton Head might seen as slightly weaker than someone else beating him to win, and of course he sat out Quail Hollow which weakened the field a bit.",
            "Oh for sure. But that’s what’s expected with a TPC course.",
            "I don't mean in just golf.",
            "Let’s revisit this Sunday and see the scores lol. The cut will probably be close to par, versus +5 last week. Last week was not a birdie fest.",
            "And a whole lot of missed cuts especially in big events. And Pebble doesn’t really count since it was 54 holes. Shouldn’t have counted for OWGR.",
            "A lot of subscriptions can be a rip off but espn+ has a TON of content and I think it's a good value 🤷🏽‍♂️",
            "Lol I gotcha just making sure.",
            "Brother it's reddit, you never know.",
            "So, short answer is yes if it's a weather affected event?",
            "Oh, then I’ll let you know, most people in the Olympics are “some nobody”",
            "This is a no cut event.",
            "Buddy I agree with you. I was laughing at that guy complaining about \"another\" birdie fest when last week was literally the damn US Open lol",
            "He has 7 total missed cuts (and 12 top tens) in 52 events during the qualifying period. That's pretty damn good. Even if you throw out the win at Pebble Beach, which is silly, he still earned the spot.",
            "Definitely yes!\n\nTo be honest I couldn't immediately remember if it was a yes or a no offhand so I just had to do a deeper dive to see what the numbers looked like.",
            "What? They're all professional athletes. Lol you clearly don't know about Basketball.",
            "Ah gotcha. I took that dudes comment as more like “another week on the PGAT,” which generally are birdie fests. My bad.",
            "Swimming, track, distance runners, find me a millionaire professional javelin thrower. I have tickets this weekend for the big Greek wrestling event at Madison square garden. Olympians are poor and following their dreams in every country except the United States, which has a few highly paid athletes but still mostly poor.",
            "> which generally are birdie fests. My bad.\n\nIf you define birdie fests at around -10 to -15 under par then yes. What we saw at the pga was rare. Now historically The Travelers has high teens sometimes breaking -20 under. So, yes this week will probably be a birdie fest.",
            "Yea that’s what I meant haha",
            ">Olympians are poor and following their dreams\n\nI'm not disagreeing with this, but they do get paid outside of the Olympics in their perspective sport. They're still professional athletes getting paid. No one wants to see amateurs.",
            "Last year's tournament had what felt like a ludicrous number of rounds in the 60-62 range. It took almost all day for us to see our first and only 62 yesterday, and they're trying to beat some possible thunderstorms today so the course may stay firm and fast today. I'll predict the 36 hole lead around -11 or -12 and then we'll see what happens over the weekend since there's a chance for more storms tomorrow.\n\nEDIT: My prediction is already false, Tom Kim is in at -13, but the afternoon wave isn't going that deep. Doesn't look like we'll have a ton of players at double digits under after 36 holes.",
            "lol no"
        ]
    },
    "[Official Tournament Discussion Thread] 2024 KPMG Women's PGA Championship": {
        "title": "[Official Tournament Discussion Thread] 2024 KPMG Women's PGA Championship",
        "score": 19,
        "url": "https://www.reddit.com/r/golf/comments/1dkac8y/official_tournament_discussion_thread_2024_kpmg/",
        "content": "Event: KPMG Women's PGA Championship\n\nLocation: Sammamish, WA\n\nCourse: Sahalee CC\n\nPurse: $10,400,000\n\nDates: 6/20 - 6/23/2024\n\n[Tournament Website](https://www.kpmgwomenspgachampionship.com/)\n\n[Field](https://www.kpmgwomenspgachampionship.com/players)\n\n[Tee Times](https://www.kpmgwomenspgachampionship.com/starting-times)\n\n[Leaderboard](https://www.kpmgwomenspgachampionship.com/leaderboard)\n\n[TV Schedule Link](https://www.kpmgwomenspgachampionship.com/how-to-watch)",
        "num_comments": 109,
        "comments": [
            "So it’s only on Peacock starting at 4pm?!  We can’t see any of the Rose/Celine/Nasa or Nelly’s group?",
            "I'm excited for this one, hope Nelly does better than the US open 😂 anyone know if there is any coverage before 4pm est?",
            "I love Nelly, but I am all for Lexi Thompson this week. She deserves to go out on top. ",
            "HOLY SHIT this course is narrow",
            "Got the chance to play the championship routing once. Sa-hallway is 1000% accurate. Disgustingly narrow on some holes, after getting destroyed by the course looking forward to getting to go and watch the weekend action.",
            "This is a bit of a weird tangent, but I fucking LOVEEEE it when a major (or any sort of tournament in the summer) is at a West Coast destination.\n\nI mean, how else can you be able to tune in and watch some competitive shots late in the day? It’s essentially primetime for the rest of us!",
            "Good round for Nelly. Shame we only got to see one hole.",
            "Nelly forgot how to play golf",
            "The Korda/Yin/Green group has the number 1,3, and 5 ranked players in the world. They combined for +19.",
            "Sure would be nice to be able to watch this...",
            "Lexi on fire again it sounds like",
            "Nelly went from can't lose to can't make the cut (3 in a row now). Golf is strange. ",
            "Nelly missing the cut at the two biggest tournaments of the year just sucks.",
            "Trying to get in and SeatGeek dropped everyone's tickets, huge line trying to get in. Finally got in and got to hole 1 just before the 8:50 group",
            "Oh my God the way Nelly just stuck that shot on 15.",
            "Would love to see the PGA return to Sahallee. It’d be a whole different subset of the men competing for the major than your typical bomber course",
            "Happy to see Jin Young Ko playing well. Need to see her back on some leader boards.",
            "Love getting BlueChew ads during my LPGA background noise",
            "Come on Brooke! Need her to have a complete tournament for once with 4 good rounds",
            "Nelly doing Spieth things",
            "Nelly +6 through 9 holes today, this is a meltdown!",
            "Nelly better not miss the cut cause I’m going on Sunday and wanted to see her 😭",
            "Can't believe Nelly is going to miss the cut after going - 3 yesterday",
            "Anyone else disappointed that early coverage is not available to watch? Got to see Nelly play 2 holes yesterday and can’t watch Lexi and the early groups play today.\nThis is a Major Championship and the coverage for Women’s golf again leaves fans wondering wtf!! Maybe they need better people, preferably women in place to better promote the sport and the women who play. Can watch any men’s tournament all season long from start to finish who make way more than their worth.\nI love Women’s golf, they play hard, make less, and hardly complain. ",
            "This is the last week for Olympics qualifying as well which could add a bit to the drama. Can Megan Khang play her way in and get 4 players for the US?",
            "Luke Kwon played there last year and made a great video:\nhttps://youtu.be/k3Xf2H-05tg?si=NxGrp_KlA9q1KNlM",
            "Gg Lexi",
            "4 over through 4 and two missed 3 footers for Nelly...wtf",
            "wtf nelly",
            "she may be ob",
            "OB for Nelly...holy shit this is hard to watch.",
            "At least Lexi is playing good so far",
            "This is a nice compilation with all of Nelly's televised shots for round 2. Have to watch through your fingers for this disaster\nhttps://www.youtube.com/watch?v=RD8izBcAOB4",
            "I find it a bit suspicious that Scottie's and Nelly's dominance started and fell off at roughly the same time",
            "This leaderboard is so good compared to the Women's US Open.  Hope it co tunes to Sunday",
            "How is there OB long of a green",
            "I'm new to golf so bare with me here. Not sure if I'm just stupid but is there no way to watch this live in the UK until it comes on Sky later? I know it's airing on Peacock but is US only? If I wanted to watch Nelly's round would the only way have been VPN + Peacock?",
            "Big names at the top + Shibuno and Yubol up there again.  Caroline Ingils is the big surprise but she has PNW roots. My girl yealimi made a triple but is only at +1, still very much in it!  I hope she can get back on the Solheim team this year, they need her power. ",
            "Still keeping an eye on some of the Olympic implications. Megan Khang and Alison Lee for the US have likely played themselves out of contention with poor first rounds. Alison Corpuz has set herself up nice for the rest of the tournament and maybe a chance to sneak into the world top 15. \n\nOther interesting stories include Japan and Sweden. Furue and Yamashita are likely competing for that second spot after a poor first round from Hataoka. For Sweden, Madelene Sagstrom played a nice first round and with a strong tournament could possibly see herself leap past Linn Grant for the second spot. Still a lot of golf to play though.",
            "Sahalee looks tough af. Narrow with thick ass rough.",
            "wow a 69 to an 81. A tale of 2 days",
            "Got to attend Day 1 and followed the Amy Yang group for their back 9. Yang just incredibly consistent off her tee shots.",
            "Golf is a humbling game. Hopefully Nelly figures it out",
            "Peacock showing this week LPGA tournament live with good coverage.",
            "I’m reading some info on this course. Found a bunch of complaints about Lancaster and green speeds. As someone who has worked 2 pga tournaments and 35 years in the business I have one thing to say. Media and general public has really no idea what green speeds mean. It doesn’t really matter.  The best player that day wins no matter what. Your playing outdoor in nature and have to adjust. This course looks tight and the greens seen fairly firm. Watching a few puts, I think the greens could be slightly faster. Gorgeous course.  Listening to the announcers I’m sure they don’t know what they are talking about. Corses Olay how they play",
            "Yea it's shit.",
            "It's in Washington, so they should still be playing when coverage starts.",
            "It's on the golf channel starting at 3pm PST. I'm an hour away and you can golf until 9 this time a year, they're starting pretty late",
            "I don't think so, unfortunately.",
            "EDT*",
            "Peacock is showing full coverage of it, you can use Peacock streaming and if you are outside the US then use this service to avail all golf channels and peacock golf pass without VPN. GOLFLIVETV DOT NET",
            "Being here in person I've been trying to figure out how the hell I'd play this course and not lose 2 dozen balls",
            "I played there last week. They don't call it \"Sa-hallway\" for nothing",
            "First Championship course I've seen on TV that I have very little to no desire to play",
            "Gotta love the #1 player in the world sneaking in an early round and taking the lead at a major with no coverage",
            "Am I jumping the gun in being worried about her mental state after the US Open disaster? She played herself out of the tournament within three holes at the Meijer, and is now having a 4 hole disaster to possibly play herself out of contention.",
            "I'm more concerned with how she is missing cuts.",
            "Just an imposter.",
            "> Trying to get in and SeatGeek dropped everyone's tickets\n\nCan you elaborate what happened with SeatGeek? Just realized it's at Sahalee and I can go. Tickets are $50 on SeatGeek. Never had problems with them in the past.\n\nShould I expect issues or was it more a temporary glitch? Any insight appreciated",
            "Are you able to watch somehow?",
            "She's flirting with cut line now. Actually insane.",
            "I always go to tournaments on Friday for that reason haha",
            "you better get out there fast",
            "Here's the bigger joke. The Travelers is currently in a weather delay and Golf Channel (which is still NBC) is replaying the golf they already showed today. Meanwhile, a women's major is exclusively on the paid service Peacock only. ESPN and CBS are doing a good job lately. NBC/Universal, which also owns and runs GolfNow, is a plague on the world of golf.",
            "Yeah it's bogus",
            "Khang, Alison Lee, Corpuz, and Ewing all have a good chance with a good finish. Nelly, Vu, and Rose are cemented ",
            "Scottie's dominance has gone nowhere",
            "It looked like homeowners property. And that is always ob",
            "Agreed. Seems like a ridiculous place to be OB.",
            "It is yet to even come on in the US.",
            "God that’s frustrating. How can viewership grow if you literally can’t watch it anywhere?",
            "I understand but there’s a whole morning wave that includes most of the top 10 in the world that isn’t being televised.",
            "PDT*",
            "Tru",
            "You wouldn't even have to be playing poorly to lose a bunch.\n\n\nI haven't looked up a scorecard. Is it long?",
            "Is it fun? It looks to me like the play off the tee for damn near everything is a 2i stinger.",
            "I certainly enjoyed playing it regardless of the difficulty. I've also played Snoqualmie Ridge which hosts a senior tour event, definitely much more fun private course I could see actually playing all the time.",
            "She bogeyed 5 out of 7 so far. Ouch.",
            "Honestly, there may be a legit question of how well she can play on tough setups.",
            "Seemed like a temporary glitch. For about 10 minutes everyone's tickets disappeared off the app and nobody could get in. We were in line at the box office to get physical tickets when it fixed itself.",
            "Yeah I'm here",
            "I thought for sure she would make the cut and be in contention for the whole thing 🥲",
            "Damn it this is what I get for assuming she’ll make the cut",
            "[removed]",
            "Doesn't look like Alison will be able to make it with a rough start. Rose has not played great, but Corpuz looks to be in good form.",
            "Yes I spoke before checking his position this week",
            "Oh wow, that seems.. questionable.",
            "This x1000",
            "6754, so not really, just very, very unforgiving.",
            "Two pars in a row now! 😬",
            "yeah I wasn't being sarcastic",
            "Probably running system backups -- surely, nobody would be using a ticketing app on a Thursday morning.",
            "Thanks!",
            "Haha oh that'll do it",
            "I misspoke - NBC pays the USGA to broadcast the tournaments - but they have to recoup+ on their end with sponsors and advertisements. \n\nSo basically those 2 groups don’t deem this as lucrative as the US Open, and thus NBC isn’t going to add additional coverage on their dime. \n\nFor context, NBC took over for Fox, halfway I believe, through their $1 billion contract for 12 years with the USGA.",
            "He just won the Memorial too. One off week at a major is the anomaly",
            "Yeah it's dumb. Only got to see one hole from the best player in the world. The US open coverage was better.",
            "and finally, a birdie on 18",
            "I mean, they’re live for 6 hours today, takes a lot to put on a proper broadcast, esp if it’s just so people can see 1 golfer for an additional 4ish hours",
            "US open did two or three featured groups in the morning, wish they did something like that",
            "That’s bc the USGA and their deep pockets paid for it.\n\nIf I’ve learned anything about the industry it’s that it’s all about the $$$",
            "I mean yeah obviously but if they grow the sport they make more money. Seems dumb to me not to have at least some coverage of the morning rounds during a major. Not the end of the world but I was wanting to watch this morning and couldn't. Was a bummer.",
            "the big mistake was having Korda tee off in the AM, very surprised she did",
            "It makes sense she would tee off early today I think cause now she will have a late time tomorrow which will probably have more viewers. We will get her whole round tomorrow luckily."
        ]
    },
    "Avoid Callaway Pre Owned!": {
        "title": "Avoid Callaway Pre Owned!",
        "score": 1260,
        "url": "https://www.reddit.com/r/golf/comments/1dlifl4/avoid_callaway_pre_owned/",
        "content": "I just bought a used fairway wood from their website since they had some on sale, and it just arrived today... And let me tell you I did NOT get what I paid for.\n\nWhat I ordered was a used \"good condition\" wood. That wood that I got still had the plastic wrap from the factory on it. Not a single blemish.\n\n\"Used\" my ass. This thing is brand spanking new! For a fraction of the cost! Anyway, avoid these suckers, I'm keeping them all to myself from now on.\n\n/s\n\nEDIT: to all the people I had grabbing their pitchforks and torches... I sincerely apologize 😂",
        "num_comments": 156,
        "comments": [
            "![gif](giphy|y2i2oqWgzh5ioRp4Qa)",
            "Oh I was ready to go to war for CPO after I scored a perfect Heavenwood.\n\nWhat do I do with this provoked rage?!?!",
            "Ya, almost always new in wrapper for any good or better \n\nBut shipping to canada has really burned me bad last couple times.",
            "They are doing it on purpose to clear out old last year stocks. Better for their brand this way, instead of dumping wholesale to third party resallers.\n\nIt is not 100% for last year not-used stock; some reported they did get slightly use secondhand. Also some bought and return without being hit under callaway awsome return guarantee; then they are being resale as pre-own.",
            "Having “lost” the CPO lottery on my paradym feels sad still lol",
            "Tell that Tabasco guy we’re tired of this bait and switch. We ordered used and got new? Cmon man! /s Tabasco and Callaway Preowned, thank you!",
            "Just bought a Stealth 2 Plus it's clean! I mean, no don't give them your money! Bad Callaway Pre Owned.",
            "Steven Singer is that you?",
            "I woke up today... And while I was still in bed (before my morning piss) I ordered a putter from CPO. They have me in a stranglehold.",
            "Callaway is fine. In most cases, there are clubs I would probably rather game. But because of CPO, I only have two non-Callaway clubs in my bag. It wasn’t on purpose, and I don’t even consider myself “cheap” when it comes to golf stuff. I just know I will always get good product for a great price through CPO. And I know what Callaway stuff feels like (few significant design overhauls), so it’s never much of a risk.",
            "I bought 3 jaws wedges from them for half price and I could not tell they had ever been touched.  I think part of preowned inventory has to be overstock or something, unless the previous owned whiffed at every single wedge shot they ever attempted.",
            "I clicked on this so fast to come tell you to shut the hell up. Callaway pre owned is the best. Also the worst because I can't not look at clubs every day. And I can't not try new clubs.",
            "Terrible service, you should always get what you paid for, to send something that is not as advertised is a disk race.",
            "if i was the mod, i would remove these types of posts for sure... damn it, now the internet knows",
            "Been using this site for years. Never received a club that didn’t look brand new.",
            "I immediately jumped onto reddit in a rage when this flashed up on my phone ![gif](emote|free_emotes_pack|joy)",
            "Avoid them at all costs if you hate saving money and don’t want products in better condition than you think you ordered them in! I bought 4-AW last year in “used” condition. They came in factory wrap with a few manufacturing defects!!",
            "Gotta be careful with these posts… I insta-downvoted. Then I thought, “I gotta know what happened.”  Got me, for sure.",
            "Bro you had me. Well played.",
            "Had the same experience with a driver and woods, bought some irons in “good” condition and they are extremely beat up. Going to send them back actually ",
            "Because you did it wrong. If you connect with Cole you end up with an amazing deal that make your friends jealous. Legit my golf buddies think I have a friend that works for Callaway based on what his prices are and what arrives.",
            "I just got a “like new” Epic Speed driver that had a chip in the crown.  It definitely doesn’t affect play but it’s very noticeable. Was a little disappointed it wasn’t like the “like new” 3 wood I got earlier this year that was still wrapped in plastic.",
            "Very frustrated I fell for that headline….well done",
            "Literally just got my Edge set from them. Its as if someone took them out of its original packaging and just reboxed it. Perfect condition.",
            "Let me know when Smokes start to come in stock in steel discount",
            "lol you almost had me. The brand that got me to buy new clubs way back in 2014. I got a couple hybrids and a 64 degree wedge for an awesome deal. Those clubs were as good as new for a newb golfer like myself way back then. I got them at least half off and have only heard good things about the brand since then :P",
            "Yeah they are so terrible I will never buy another driver/wood for anyone but them ….”good condition “ my ass … it’s damn near mint 😂",
            "Hahahaha I got fired up when I read the title as my whole bag is from there!!!   But ya it sucks don’t buy from them",
            "I just got a pxg driver from them for Father's day.  They claimed \"Very Good\" as the description. Looked like it was never swung one time at a ball.",
            "My sentiments exactly.  Sending me a club without a mark and calling it used",
            "BRO!  i was gonna say they hooked me UP once. quality shit post.",
            "I bought a demo model 3 hybrid and it’s been killer for 4 years now",
            "Shhhhh…..",
            "My whole set is Callaway pre-owned, Global Golf used, and Golftown demos. Everything purchased arrived looking new in plastic. If they are used they are amazing at cleaning them up.",
            "Same thing happened to me with a 3wood. Rated “very good” came brand new in plastic. $150 vs 300 brand new at Roger Dunn",
            "The amount of posts I see here about Callaway p/o being \"new\" has got me suspiciousous. \n\nFirst off, you can plastic wrap anything. But the no-hits part is weird.\n\nWhy are so many seemingly new clubs finding their way into the pre-owned? Is it a sneaky clearance thing? Are they replacing snapped shafts? It's just weird.",
            "I was hoping for this experience. Instead I got the condition I ordered. Boooooo.",
            "One of the great websites on the internet. Up there with The Hub",
            "God damn you baited me so hard.",
            "i always buy like new condition, and half the time it's still got stickers and wrap etc, and sometimes it's clearly demo clubs or returns with very minor cosmetic blemishes. never had to return or complain, it's just worked out easy.",
            "Yea I’ve bought two clubs from them. I bought one in the like new and another in good condition.  You got what you paid for.",
            "i have bought a ton if stuff from them and its always immaculate and like new",
            "I'm literally in the market for my first set and have been on CPO all day....you almost got me OP, you sly dog.",
            "I have never been disappointed with a purchase from them.",
            "I always recommend them to good friends. When a broke buddy lost his 9i, I picked him up a good one for $40 on this site and he was stoked",
            "Dude I was ready to do battle in the first half.",
            "😂😂 Just ordered one!",
            "I’ve had the same experience. False advertising… excellent condition should have said “new”",
            "love CPO. back during their 35% off sale I got a new putter and two wedges for the MSRP price of the putter alone",
            "Oh man, I bought a 3h in January from them, same conduction, it was still brand new, and had a Tour AD shaft in… for less than $200 total.",
            "Great site…always order average condition and typically get almost new instead.",
            "Even if you had a problem Callaway has treated customers very well for 30 years now. TM/Callaway/Titleist. To me there are no other companies now.",
            "2ndswing is another good spot for pre owned.\n\nI just bought a PXG 0811X Gen 2 and it was rated as like average and when i got it looked almost brand new. They use real images of the clubs. Customer service was also very helpful.",
            "https://preview.redd.it/frk4j4dmt18d1.jpeg?width=1180&format=pjpg&auto=webp&s=6ce42ee24b12b98000211e821b644b5f9ff0c6d0",
            "Reading comprehension keeps getting validated around here.",
            "So I had a good and bad experience. Ordered a \"like new\" Paradym Driver and two \"good\" matte black Jaws wedges. Driver was brand new and wedges looked like they'd been chipped around with in a store a bit. \n\nI was so happy with that order I placed an order for a \"very good\" Jaws wedges and it was beat. Worn face, markings on the hosel, grip was in rough shape. I should have taken pics, but I just put it back in the box and started the RMA. Which was an easy process, but still bummed about it.",
            "If  you're some Callaway suit with 12 year old reddit account, just know you're not fooling me. Didn't work. I definitely did NOT just buy the Rogue 3wood and 4hybrid I'd been contemplating pulling the trigger on for over a year.",
            "I was about to rip you a new one!  I got a whole new set via Callaway pre owned and it was the absolute best!  \n\nEnjoy the NEW club.",
            "Nearly my entire bag is from Callaway preowned!",
            "first off, CPO is awesome for deals and like your post says, providing above expected cosmetic quality of used clubs. \n\nI ordered a ‘good’ rated driver and 5 wood last year, and both club heads were like-new on arrival, BUT I ordered new grips for them, and both of them were installed with the logo pointing basically to my lead shoulder. I was kind of disappointed in the lack of QC, but not enough to send them back or complain. So yeah, those guys suck haha.",
            "I may be in the minority...but I just did my first purchase with them...2 wedges in \"very good\" condition.  Ngl...very disappointed...they were average condition at best...dings chips scratches etc. I probably won't order from them again",
            "I read the title and thought “you’re gonna lose this one bud”",
            "Oh man… I came in here real angry and ready to share the same story OP posted, hahah.",
            "I have a used driver in the mail from CPO right now and you had me real nervous. Feeling real good about the purchase now.",
            "I get that it was a funny but pretty shitty making a post with this title. People just scrolling past now think CPO is bad even though its 12/10",
            "![gif](giphy|3oEjI1erPMTMBFmNHi|downsized)\n\nI was about to draw for the friendly neighborhood Callaway guy on here that can beat even the website.",
            "I fell for it. 😞 Sadly, I am a poor duffer and will continue to get my pre-owned Callaway's from Goodwill.",
            "I love them so much. So happy with my set bought last year. Hoping they do worldwide shipping soon",
            "Really had me in the first half not gonna lie hahahah",
            "Do they ship overseas? Really hard to get good clubs in my country",
            "Ordered a ton of stuff from them but recently, a 54 and a 58. Both came brand new. Its the second best site on the internet behind youporn.",
            "I saw your title and thought this person is a clown. Then read on...lol. Been using them exclusively for years and years and years. The best!",
            "i was getting ready to throw hands. CPO might be the one thing the entire golf community agrees on",
            "Cpo is the absolute best when you are looking for slightly older model cally products, esp putters. I grabbed a 2-3 year old putter in Great shape for like $100. It felt like stealing.",
            "Seems like they dump the beat up stuff on eBay.  But the prices are even a bit better…",
            "I got some brand new plastic wrapped Rogue X irons a few years ago too. Great value!",
            "I’ve gotten near perfect clubs from them regardless of what condition they are marked as.  \nAbout to order some irons.",
            "I was ready to fight. I bought my irons off CPO and they came in plastic wrap unplayed",
            "I did get a HEAVILY used wedge from here. It has the most perfect center-face wear I've ever seen. I love it. Whoever had it before must play a LOT, and have an amazing swing.",
            "They sell unsold prior year gear returned from merchandisers or from their warehouse as used. Pretty well know fact.",
            "Exactly how I got mine too! Ridiculous and misleading! Preowned my butt.   \n\nlol",
            "My god man!  I will be ordering something from them shortly to validate these atrocious quality control standards!",
            "Best website ever",
            "Agreed everyone should avoid it. I certainly won’t be using it either…",
            "Not a golfer, but this is like the 3rd time I've seen almost this exact same thread from r/all",
            "Can we stop sucking their dicks? They get plenty of publicity from this sub.",
            "Cool, another ad.",
            "/u/callawaypreowned",
            "I came in ready to defend CPO lmaoooo. Did not see that coming. \n\nI've had nothing but success from them and they're a golfers treasure for sure.",
            "Was coming here spoiling for a fight because I ordered a 'excellent' condition set from them and I have no idea how it could have been called used. Just phenomenal.",
            "![gif](giphy|1AfLx8dLTVoHK)",
            "![gif](giphy|NiBMdMizycNCE|downsized)",
            "Try contacting them through email or phone call and explaining what the issue is I had a similar dilemma and all worked out after reaching out to C/S . It takes a few days for them to get back to you but they will try to make things right",
            "Unfortunately, it's still Callaway.",
            "I get the sentiment, but in this era where people only read the headlines and/or the first half of a whole explanation, this could actually hurt them lol.\n\nFWIW too: My whole wood setup is from them and I always look at CPO for new clubs before anywhere else",
            "I came in hot, ready to fuck people up...but I knew I had to address my shot, and read the post before I beat this fucker in the rough...he got me good.",
            "![gif](giphy|ejDxbDaxZZkeQmr0yu)",
            "This was the desired result",
            "What do you do? WHAT DO YOU DO? You go buy a new GOT damn driver!",
            "Does the pitchfork store accept returns?",
            "Which model? I keep looking at them but haven’t pulled the trigger yet.",
            "I was warming my fingers up as I opened the thread 😆",
            "Just ask the guy guy on here who helps everyone and he will take $10 off. He just shipped me a set of irons from Houston to Canada in 1 day. Fastest shipping I've ever seen ",
            "tabasco hooked me up pretty good but once it was all said and done I had the same experience, all in cost was more than I thought it would be. Ended up being about what I would pay for the clubs locally, but couldn't find locally, so I won't complain.",
            "I'm not crapping on CPO at all. But I just got a set of \"like new\" clubs and they are what I would expect for the definition of like new. Just not what this sub has preached about what \"like new\" sometimes looks like. \n\nAgain, not crapping on them. I got amazing clubs for an amazing price and have zero complaints.",
            "Yeah me too man. Got jerked around pretty good the last six weeks and still don't have a club to show for it 😕",
            "> Also some bought and return without being hit under callaway awsome return guarantee;\n\nThose fucking bastards, I knew there was a catch...\n\n(built a $2500 set for $1150 over the course of 3 months, as a lefty, that's tough.  Even got my dream White Hot putter for $70)\n\nCallaway Big Bertha D, 3, 3H, 5H, TaylorMade rocketballz 5-8, JAWS P/L/S, White Hot)\n\nAnd just to be clear $400 of that was spent on TaylorMade RBZ's at Golf Galaxy.  Because I hadn't heard of CPO before.",
            "Yeah I got a set of “like new” rogue st max irons and they certainly had been played.  Still in very good condition but they weren’t pristine",
            "I know u/tabascopro has said if you are buying like new through him he can often go pick out the best of the available stock for you.",
            "My buddy got banged up irons from CPO and took them in for fresh grooves and a polish. Look amazing now. Maybe worth taking them in.",
            "Your reading comp needs a little work.",
            "Who is Cole and how does one connect with him?",
            "Multiple comments saying they clear last year's stock and lots of returns on new items for reasons untold (since they're bought they're \"used\").",
            "Happy Cake Day!",
            "One of us! One of us!",
            "I saw this ad and went to Callaway preowned to spend money right away because I'm such a reddit bugman.",
            "Hah, I'm more of a ping guy myself. Couldn't find a 7 wood in lefty around me and I don't like buying new so I figured I'd give these folks a try. Didn't disappoint",
            "Good, let it keep people away so they don’t get the best deal before I do!",
            "I downvoted immediately because callaway pre-owned is the tits. My vote has been updated to \"up\". This post is amazing 😂",
            "Hopefully that hurting turns into a lesson.. to read more than just the headline.",
            "This is a good thing. Let it be less known.",
            "Callaway is doing just fine",
            "![gif](giphy|Y07F3fs9Is5byj4zK8)",
            "__Looks away after just buying a CPO Rogue driver__",
            "Paradym. Reach out to u/tabascopro so he can get you the best club in the category you’re looking for. Trust me. He did me a solid.",
            "u/tabascopro",
            "Ya, that more recent time I decided to use their ebay site vs the normal cpo site because the shipping was a little more but ebay calculates the import fees vs charging it at the door like cpo does when using ups.\n\nThe shipping was more then the 7 wood I bought which was crazy, but a good deal anyways.\n\nBut then I still got charged an extra $20 at the door anyways.  Oh well love the club.",
            "Do you have to pay customs when shipped to Canada?",
            "Yeah my 3W wasn’t in the wrapper and came with a 7w cover, but it was untouched and a great deal. Got that little twinge though lol like damn this metal has been exposed to air already.",
            "At least you got jerked around though. That ain’t bad.",
            "I told you in 5th period I’m good using Cliff Notes #TeamCole",
            "u/Tabascopro",
            "Preach! Haha",
            "lol yes!",
            "I clicked on it to rip ass. Glad it was /s",
            "Why, reading only the headlines got us the two best octogenarians in the world as candidates for the last leader of the free world.",
            "Too good for two new drivers!? Do you even play golf!?",
            "You seem em**bold**ened.",
            "Happy to help anybody who contacts me! PSA - I am leaving on vacation today until Thursday 6/27. I can honor any sales that might end before I come back though.",
            "+1 for u/tabascopro, hooked me up with \"like new\" putter, still in the packaging.",
            "Thanks for the tip! I’ve been hunting for an M2 5HL (to match my 3 wood) but they seem to have all been made with senior shafts. I like the idea of the Heavenwood and people seem to love them.",
            "I got the same thing from there. New in wrapper. The club is a beast too",
            "He's the man!",
            "Hasn’t been active in awhile",
            "I just found out the wood covers are all the same and you can unclil the tag on them and rotate a piece inside to change what is on tag",
            "Leader of the free world! Ha, there is 190+ countries that don't see it that way.",
            "I had to look up the word octogenarian before I downvoted you.",
            "> Do you even golf!?\n\nI just bought Woods’ 2018 left sock. Should improve my handicap by +/- 10.\n\nWhat do you think!?!?!?!",
            "It's an oversized head with a 7w loft on an long shaft.  I have a Rogue ST MAX one and the head is 153cc which based on size slots between a 3 and 5, but has a 20 degree loft and a 43\" shaft which for all purposes is 3W length.  \n\nHuge high arc and soft landing, always going 200 yards min.  So easy to hit.",
            "U could still dm or email him",
            "I just dmed him within the last week and we emailed 2 days ago.",
            "r/woooosh",
            "10 is aggressive, but if there’s dead skin or toe nail shrapnel in it, you’ll have a chance.",
            "That’s just what I need between a 16.5 3-wood and a 21 degree 4 iron. I can’t seem to find a hybrid that doesn’t go left or hit bullets. Thanks again!",
            "He is online he responds to DMs and emails all the time."
        ]
    },
    "What makes Rory’s swing so good?": {
        "title": "What makes Rory’s swing so good?",
        "score": 852,
        "url": "https://v.redd.it/dwi6tbh0408d1",
        "content": "I feel like his swing is the benchmark for which amateurs should strive, I know it’s a tough ask but this is the swing I analyze and then try to copy the most - with not much luck I might add.\n\nWhat would you say is the best part of his swing?",
        "num_comments": 253,
        "comments": [
            "he had a \"playing lesson\" on golf channel a few years ago i recently watched. him and his coach he's had since he was 7 break down every part of his swing. it was pretty cool\n\ni tried to replicate it, but failed miserably lol",
            "His core power and flexibility are next level to me. Especially the shoulder turn on the backswing and followthrough. I don't even bother trying to emulate it, my body doesn't move like that.",
            "His takeaway to me is the best in golf. I try to mimic how far he keeps his hands from his chest during it. They move as one and maintain that same separation deep into the swing. Really nice.",
            "All of it. One, out of many, particularly impressive aspects is how far left (behind him) his hands get at the top of his backswing. Tremendous rotation and flexibility.",
            "Almost identical to prime tiger woods. I'm always impressed by rory's balance. To be able to swing so fast and make it look so smooth and simple is just a beautiful thing.",
            "I just keep watching it on repeat.",
            "Alot of flexibility in his left shoulder to get that club way back there",
            "He snap loads his power package.",
            "He hits ball good.",
            "His finish is something I've been practicing. At the range I will almost try to have a little jump from my right foot during the transfer to the left to ensure my weight shifts. When it works I notice my drives go way farther.",
            "This right here. This is the perfect slot position with driver. So much power with that lag and the weight is almost all on his left side already.\n\nhttps://preview.redd.it/lzzyt767y08d1.jpeg?width=2306&format=pjpg&auto=webp&s=819e3c7eb14c196ab1707f15cf08d2e24c3e4872",
            "there are indeed many elements that amateurs should, and can fairly easily strive for.  It's not too dependent on timing and maximum effort, which is the bane of everyday amateurs.\n\nI'd start with looking at his stability, his weight shift onto the right leg, his redirection to a shallower downswing is natural, and he finishes with 95% of his weight on his left foot. Notice how he pushes the club straight back instead of jerking it with his hands. All of these are readily adoptable fundamentals. And he doesn't pass parallel, for the Daly-wannabes among us\n\nHe does the drop down to hit up on the ball, with a lot of ground force, which is the key \"expert timing\" for his distance.",
            "His. Head. Does. Not. Move.",
            "Left video, watch his head, it's insanity how little it moves throughout that swing...",
            "These Taylormade videos always drive me nuts because they aren't different angles of the same shot.",
            "Wide arc on the back and down swings. Shallows it out into a free fall building the centripetal force. Aided by his leg drive from the start of the down swing. Then top speed at impact with his hands, arms, and feet launching into the ball. Hitting slightly up on the ball at impact from the leg launch cuts down on the back spin which increases distance. It's a phenomenal swing and imo top 5 in the history of golf. \n\nEven Tiger tells his son to watch Rorys swing over his. The amount of power Rory can generate with his frame is insane being that he's only 5'9\".",
            "Try and bend your front arm at the wrist like that, and tell me your head is this still? Wow. The dude really has some crazy flex in the joints!",
            "How much his hips and torso separate and stretch in transition and downswing. Look at how open his hips are at shaft parallel. Ridiculous. Dunno how he does it. Feels super weird when I try it.",
            "Rory specific things aside (like really good mobility)… here are things I think any amateur can try to strive for:\n\nhe does a great job of staying on plane in his takeaway\n\nHis first major move in the downswing is a little squat which he later explodes out of to get power\n\nHe comes down a little shallow, but not majorly and he holds the lag so he releases late",
            "Driver swing is sweet, everything else is mid",
            "I’m gonna teach my kids to swing like Jim Furyk",
            "Not an iota of wasted effort. Perfect balance. Effortless, yet so violent.",
            "Casual observer. I'd suggest that just body ratios are a big factor. Starting with the arm bone lengths and articulation. Variations on the De Vinci man makes physics complicated.",
            "Width, high chest and shoulder rotation, fast dropping of the hands on the downswing.",
            "Look at that angle of attack on the downswing prior to impact, especially how he pulls that rib cage up.\n\nHe drives the ball some 130ft into the air with 185mph ball speed, that’s how he gets those 330yd bombs.",
            "Sold his first born child's soul.  Had a similar opportunity once, almost took it.",
            "What makes Rory‘s swing so great ?\n\nRory (and some practice time) !\n\nWhat could make your swing better ?\n\nTake a guess ?\n\n\nIn theory the answers in golf seem so close, but yet so far. In reality the ball will be so close but not so far after you give it a full swing (unless you miss the fairway)…\n\nIn reality I hate this game … again and again, but in theory I‘m in love with it.",
            "Mostly because of the way that it is.",
            "His take away is buttery and the way he gets his weight torqued up and then shifted to his lead foot is so efficient.",
            "You can it’s an awesome swing by the way that it is",
            "Solid feet and a unreal transition",
            "My back",
            "I've watched this video so many times that I can hear the song when I look at the still image",
            "It’s good because it’s like a fluid robot was programmed to swing the perfect swing",
            "It’s the way he does the hitch at the top. \n\nIt isn’t something you should necessarily teach, but the way he times it gives him so much power it drives me crazy trying to replicate. \n\nBro has some strong legs too",
            "I always marvelled at how much rotation he gets with his torso. \n\nIt’s how he can generate more length and therefore more club speed.",
            "The width he keeps while having that speed and balance. \n\nLike sure his driving is incredible but have you seen this guy hit irons. I’ve never seen irons either a draw go that high in the air. It’s crazy",
            "Spooky action at a distance.",
            "Width",
            "watch how his head not only doesn't move but stays well behind the ball. also the way he rotates around the axis his spine makes.",
            "He consistently can replicate contraction and expansion. Far easier said than done or we’d all be pros.",
            "“It’s all in the hips”",
            "He’s got hips like Griffey. And everything else is perfect too.",
            "Practice.",
            "Pay for lessons with your local pro kid,\n\nFocus on swinging through the ball not at it and watch plenty of youtube shorts and instagram reels for top advice.  You've got good rhythm, just gotta y'know tighten it up a bit.  Try some towel drills.\n\nOne day the guy in this video might be as good as Dechambeau, or even Koepka.\n\n\n\n/s",
            "Width",
            "The \"X-Factor\".  Hips waaay around before imapct.\n\nhttps://youtu.be/6Tv0fjK7LqU?si=h5anYC5e4HzCz-RX",
            "Copying swings is fruitless unless your body is built just like that person, down to mobility, flexibility, lengths of bones relative to others and so on.\n\nBetter and easier to just learn what works for you. Rory still has swing flaws that he's able to mitigate only because he's been doing it for so long. It's aesthetically pleasing and that's why people want to copy it.",
            "Talent?",
            "Everything about his swing is excellent. \n\nHis course management and mental game… room for improvement",
            "That lag is amazing.",
            "Zero wasted movement",
            "No wasted movement…every contributes\n\nThats what kills high handicap golfers. When things start falling apart and small inconsistencies take away from the swing path or ball strike.",
            "Honestly Rory’s iron swing is bad. He drops the club inside so much so that it’s either a block slice which he plays for or a pull draw/straight. If you watch him play he aims like 30 yards left to account for this. Now I shall state that I am a plus 1 handicap. I suck at golf compared to Rory and should never judge him but at the same time know a thing or two and have made a living teaching beginner golfers for a year. I suck but Rory’s swing should be open to criticism cause everyone sucks at golf",
            "Dorf",
            "Big turn, perfect shift in body weight, and balance.",
            "1. Ball Position\n2. Shaft Angle\n3. Calm Head\n4. Club Face Closed through takeaway\n5. Full Shoulder Turn on plane\n6. Shaft Exactly Parallel to ground\n7. Shallows on downswing on plane\n8. Pelvis initiates the shoulders through\n9. Swings out towards target line\n10. Full extension out, through and around\n11. No flip, no hit, no hold on\n12. Freak of Nature physique",
            "Like Chubbs says,  \"it's all in the hips\"",
            "it’s perfect",
            "Both his feet stay firmly planted to ground.",
            "Everything.",
            "Spends all his practice time on his drive and not his putting?😬 Too soon?",
            "Decades of practice. There helped you",
            "Width. Depth. Rotation. Timing. Speed. Consistency.",
            "Everything",
            "It allows him to hit the ball long off the tee on his intended line and to hit his irons close to the pin.",
            "Practice",
            "Efficient and on plane",
            "The guy attached to it",
            "I used to have the Nike golf app. Shows Rory and tigers swings up close. Along with others. I couldn’t replicate but just wanted to pass it along.",
            "He always ends his shots holding his finish [club high over left shoulder:  belt buckle aimed at target] \n\nEvery Single Shot",
            "For a dude who’s 5’9” he sure can rip it.",
            "Seems like there is no wasted movement",
            "He uses the ground better than anyone.",
            "1) Unbelievable rotation.\n\n2) Incredible use of the ground. Look at how much he uses his legs in the downswing.\n\n3) Immaculate balance. It looks like he pures it on every swing based on his perfect pose.",
            "His putting",
            "The way he loads his back hip and just the precision of his lower body. You can the see the power production there and everything upper body catches the timing perfectly on the transition and path forward. You can see the hip coil and all that power fire as soon as he starts moving forward. Upper body is effortless because it’s following the path the hips have already set. I would say the separation of hips and shoulders is what makes it so perfect. Violence in the lower half to generate the power yet consistent timing with limited effort in the upper half. A swing that can play for a very long time and become more consistent with age. Similar to Phil Mickelson. Different use of hip angles but from opposite sides, pretty similar swings. Phil won a PGA in his 50s. Rory has a similar projection in my eyes",
            "Where the balls goes afterward",
            "On his back swing.. his left arm stays sooo straight geez. I just tried that (no club in hand) and wow, I mean it’s a big stretch for me and I definitely am used to bending my arm to a full 90 at the height of my backswing. (Context - shit player)",
            "It's because his hands and arms are very deep in P5 and he swings very in to out.  Thus creating the high draw ball flight that most hacks envy.  This is also why he struggles on certain courses and is very one dimensional.  Great for hitting bombs, not great for overall control and playability",
            "Its the way he pulls his club down with the leftside muscles of his back that does it for me. I get good shoulder and hip rotation and can get my ass in to it and im 4 inches taller than him. Im pretty sure his extra 40 yards of carry over me come from being able to pull hard with his back muscles without closing the clubface",
            "The way he transfers his pressure is elite. Perfect sequencing and organization.\n\nIf there's one thing to study it's that.\n\nThe rest of it takes a level of conditioning and setup that probably should be left alone by the average golfer unless you already use a weaker trail hand.",
            "His putting",
            "4 major limit.",
            "Bro yall need to go to a pga store you get his full swing and stats on the sim . I think his farthest drive like 320+yards crazy to compare everyone’s states . Bet the lpga players could roast 95% of the people here",
            "He has to be double jointed 🤦🏽",
            "That it's not putting",
            "Width of his backswing, full shoulder turn and the amount of ground force he generates are a few that jump out. Maintains great balance throughout as well",
            "Looks like pendulum, study those hips and what they do. Imma do the same",
            "How wide he gets in his take away and how well he uses his lower body to push off and create rotation.",
            "Everything",
            "if it is so good, why he hadn't win?",
            "The fact his head stays soo still and then goes down and back.",
            "Makes ball go far.",
            "Balance, pace, power, discipline- do those things, ez pz",
            "Deal with the devil",
            "I don’t understand how to get the club to release like that",
            "Width, efficiency, compression, speed",
            "It’s not a putting stroke",
            "Creates huge width on the backswing, which gives the club extra space to generate speed on the downswing. Plus his use of the ground adds massive power.\n\nTo generate this much speed, while being quite short is amazing",
            "His putting",
            "Lower body engine.",
            "Maybe because he’s a pro",
            "u/saveVideo",
            "For me the answer is flexibility.  I'm 45 and my body can't get into those positions anymore nor do I have the reflexes to whip the body around.  Probably a good thing ling term",
            ">What would you say is the best part of his swing?\n\nThe extreme stability of his head.",
            "Nah I'd rather swing and putt like bryson. ",
            "His choke factor",
            "F Rory. Just stopped by to say that.",
            "When you win, people say you have beautiful swing and start drawing lines all over the place to show what aspects of swing we should copy.  Reality, Rory’s body just happens to move naturally. He does not tell his hip to bump and then turn.  If he does, his hands will forget to hit.  You have to swing your own swing. Find your own swing.",
            "It’s all great. But he’s getting that power because he extends into the ball at exactly the right time.",
            "To me it looks like his doesn't want to hit the ball, but swing through the ball generating a ton of speed",
            "I’ve attempted this and I’m just not flexible enough to rotate anything like he does on the backswing. I love the look, but I’m not sure it’s something ams should try to replicate. ",
            "Yes",
            "Imo it’s the way he does it",
            "I believe a large part is his angle of attack\n\nHe did a range session with Tiger and Nelly Korda. He had like a 16° angle of attack up, the others capped out at like 7 or 8. Not a golf expert, but I believe that the higher your angle of attack is upward (to a certain point) reduces the spin on the ball, and reduces the drag. If you look he gets real low, and then once the club starts to go upward on his swing plane, he starts to stand up, just adding a bit more.\n\nObviously, that's just optimized with a high swing speed and boom.",
            "Getting square to the ball; that’s pretty much golf.",
            "He was basically born with a club in his hand and has worked on his swing religiously with the best teachers and tech for 20 years.",
            "Thats the king of the swang",
            "To quote Allen Iverson: “PRACTICE???”",
            "Lots of practice",
            "[It's all in the hips.](https://youtu.be/ZS8xaWleuRk?si=FhXXcvBgTAU8RosJ)",
            "It chokes a little at the end… jk jk",
            "I’m more of a Nelly Korda. Ernie Els. Vijay type of admirer. Slow easy tempo that can last til you’re 65",
            "Center face impact with 110 + club head speed = 340 yrds total.",
            "Difficult to pick any one part of Rory's swing that needs help.\n\nIf I HAD to choose one thing though, it looks like his hips stall out for a brief moment in the backswing. He might have a bit of a restricted hip turn.",
            "width, decades of focus on fundamentals, natural talent",
            "It's the camera angle.",
            "Yet his putting sucks!",
            "Just watch his head,  the flexibility needed to keep your head that still while rotating your body is incredibly difficult to do for the average person.",
            "No majors in 10 yrs is not a good swing.  He should have joined LIV for 300 million and be happy.",
            "[deleted]",
            "The start is great but never liked the finish",
            "He spends all his time working on his driving and not so much working on his putting",
            "Practice",
            "10,000 hours of practice on it before he turned pro.",
            "He does a great job of loading his power package",
            "It doesn’t involve a putter?\n\n\nHeyooo, I’ll see myself out….",
            "To be honest, most of his swing isnt very good.  He's practiced bombing the shit out of it off ths tee.\n\nOn the other hand, a high single digit would be even money for closest to the pin from 100 yards.",
            "[deleted]",
            "He should spend more time on his putting stroke.",
            "Growing up, I tried to replicate Ken Griffey Jr.’s baseball swing. I studied it like crazy. Broke it down into steps. Proceeded to hit the absolute best pop ups of my life.",
            "Did you start when you were 7? That probably helps...",
            "That online anywhere?",
            "Us muggles should never be even close to taking the club that far back lol",
            "The key here has been a coach since 7.",
            "He was built for this",
            "Who's the most inflexible player on tour nursing a dozen injuries? I should be studying their swing.",
            "I feel trying to emulate elite athletes’ body motion is a fools errand in any sport. It’s as likely that I can swing like this as I could windmill dunk. ",
            "Remember that sports science show from about 10 years ago? Was on science channel or something. They had him on there and basically his core flexibility and how he’s able to separate his upper body movement from his lower is well above the average persons",
            "This… most people don’t have anywhere near his shoulder mobility, spine flexibility, hip mobility etc.. copying him without his grip, his build and his mobility is just asking for trouble.\n\nHis swing is aesthetically pleasing and very symmetrical with “classic” positions. That’s why everyone drools over it, but there is a reason even other professionals don’t swing it like Rory.",
            "It's not even that. It's the legit repetition, from a professional athlete.\n\nI don't dare try to get that extra 60 yards.\n\nLet me hit the fairway.",
            "I think Adam Scott’s swing is the best for amateurs to try to emulate, his is a bit more normal on body rotation and flexibility. ",
            "He often talks about all the work he does to keep his hands in front of his chest. I agree he has a beautiful takeaway.\n\nIMO Rory’s swing is the absolute best at maximizing energy from the least amount of exertion. He’s pound for pound the longest driver on the tour & a lot of it is due to that takeaway and the full extension he creates.",
            "This is my swing thought. Hands high and away throughout. Any time I lose focus of that I start hitting it fat",
            "Tiger told his son Charlie to swing like Rory. Not himself.",
            "Balance and tempo. Just mesmerizing to watch, but so hard to repeat.",
            "Best balance in the game",
            "https://www.youtube.com/watch?v=cHcP6X7dEUo\n\nThere used to be a high def version and you could swap between the different angles.  I get sad at least once a year I can't find it anymore. I even learned to play the cello part on my guitar.  So beautiful.\n\n[Here's one slicing the different angles together](https://www.youtube.com/watch?v=iteiTB40TXM)",
            "I'm on rewatch #14.",
            "Oh daddy",
            "That's pretty much what I look like ... In my mind",
            "The don't move your head idea is kind of overdone, and if you look you can see his head move a decent amount based on the leaves behind it. I think golf channel did a YouTube video on Nelly korda and how her head also moves a good bit, and her swing is gold",
            "His eyes never leave the ball",
            "Yes this!  For me as a beginner  this is what i can really pay attention to.  It indicates how stable your axis of rotation is. It really helps a lot imo.",
            "The fastest hand speed happens almost straight after transition not at the ball. The CHS is highest then but not the hands.",
            "Citation needed.",
            "i'm dying..",
            "###[View link](https://rapidsave.com/info?url=/r/golf/comments/1dlgjf0/what_makes_rorys_swing_so_good/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/golf/comments/1dlgjf0/what_makes_rorys_swing_so_good/) &#32;|&#32; \n [^(reddit video downloader)](https://rapidsave.com) &#32;|&#32; [^(twitter video downloader)](https://twitsave.com)",
            "Yep. Just like that.",
            "I keep hearing diverging thoughts  from coaches… speed up or slow down backswing",
            "What's so bad about it?",
            "![gif](giphy|kc0kqKNFu7v35gPkwB)",
            "You can swing super hard and still suck 🤷‍♀️",
            "I knew it was coming 😂",
            "As a little league coach I try to tell my players to mimic a simpler pro swing like an Alex Bregman or Kyle Tucker (I’m in Texas so many of them like either the Astros or Rangers). Some kids want to swing like Corey Seager but that one is a little complicated for kids. \n\nGist is, unless their parents are their swing coach or they’re paying for one, I always try to teach them something simple. Bregman (I know he’s not loved outside of the Astros fanbase) IMO has the most simplistic and repeatable swing for a young kid (6-10) to learn and try to emulate. Bryce Harper is another good one.\n\nJr’s swing was aesthetically beautiful but he did some unique things which made it hard to copy well. It was my favorite swing growing up.",
            "Yeah this is like trying to duplicate Fred Couples’ swing. You just can’t teach that",
            "I am you.",
            "At summer camp, we got an extra icee every time we hit a line drive to the back net.",
            "Please tell me you are also familiar with the Ken Griffey Jr instructo swing 2000 training system!",
            "Did you have a hat on backwards?",
            "https://m.youtube.com/watch?v=vmhInVHNHF8\n\nedit: thats not the one. martin hall is the host in the one i watched\n\nedit2: https://tv.apple.com/us/episode/rory-mcllroy---part-1/umc.cmc.3kqw2flo52tt1ufmt2cr60onh?showId=umc.cmc.1hmcheqfzospy9izddraxj1q9 \n\nthis is it",
            "Tiger",
            "Probably tiger woods now lmao 😂",
            "Rahm is probably the best person to emulate due to his inability to fully turn",
            "Mickelsons swing these days seems do able",
            "Flexibility is overrated",
            "Good analogy. That’s why I always find swing videos so funny. \n\nShow me how to windmill and I’m still not even touching the net ",
            "I think of it the other way around. Technique at the top level is built on body mechanics. If you can't do the technique properly it means you have an injury or muscular imbalance preventing you from doing so. A lot of the time those imbalances have existed for so long you don't even realize that you're moving \"incorrectly,\" so doing your best to max out your technique is often a good way of identifying those imbalances that you might not otherwise even realize exist.",
            "To be fair, I think you can get a decent result with 75% of the backswing and using his takeaway as a starting point.",
            "Your \"pound for pound\" comment has me dreaming about Rory's swing in Bryson's body. It might go 400.",
            "player|avg drive|weighs lbs|d/w ratio\n---|---|---|---\nRory|326|161|2.02\nKorda|266|132|2.01\nBryson [longest yr]|324|240|1.35\nBryson [current]|316|210|1.50\n\nIf Korda hit with Rory's ratio it'd be 267 yds. Basically the same.\n\nBryson [current] with Rory's ratio would be 424.",
            "I know he can be a douche a lot of the times, but Sean Foley has a YT video where he really drives home the “width” theory of the swing. That’s really been a major help with both consistency and distance for me.  I’d let my trail elbow fold too much. This video is a perfect example of what he was teaching.",
            "This is beautiful",
            "> The don't move your head idea is kind of overdone, and if you look you can see his head move a decent amount based on the leaves behind it.\n\nI doesn't move at all until he initiates the downswing and squats, and doesn't move to his left until after he hits the ball.  And even then, its just a little bit laterally.",
            "You sure? He seems like he's almost 5' from the ball.",
            "Then let’s de-mystify it:\n\nThe crappy coaches (and crappier high handicappers) insist that you slow down your swing. Plot thins as their average swing speed fails to reach 100mph, let alone break it.\n\nHere’s what really happens when you measure it: average your hand speed from address to impact is about 1 second, Rory’s is 0.9, whereas the average low and slow spamming screwball mentioned earlier takes way more than a second to get from address to impact. It’s one of the eye-opening differences you’ll see with other useful tools like the Tour Tempo (highly recommended, by the way).",
            "No astro is loved outside of their fan base.",
            "In other words, for the casual golfer, keep the moving parts down to a minimum.  Rory actually does that too.  Look at how stable his platform is.  Doesn’t take the club past parallel.  Quiet. Disciplined. Very repeatable.",
            "Bregman is exactly the swing I’m trying to get my 8 year old to mimic. It’s perfect and, easy enough to replicate, for a kid.",
            "Sorry, but Harper’s swing would be incredibly hard to replicate. He rotates so hard his back foot elevates off the ground",
            "If you want to mimic Alex Bregman's success though, you have to find someone to bang on a trash can.",
            "Golf is the same and no one should be trying to copy Rory McIlroy's swing. He is able to do things anatomically (range of core rotation, for instance) that most people can't (including most other Tour pros), and in general the male pros' degree of speed and strength conditioning puts their swings out of reach.",
            "Useless random fact: Rory is at Floridian National in this video which is also owned by the Houston Astros owner, Jim Crane.",
            "I’m trying to teach my 6 year old my swing (I was Ichiro-like in that I could get a hold of one, but I was so consistent just putting it in play).  All he wants to do is tear an oblique swinging with power of 100 dying stars. Hopefully in a few years he’ll realize he should probably find a middle ground between swinging out of your shoes and being a singles machine.",
            "I used to play around with chipper’s rh swing in practice and wiffle ball. That shit is hard. I figured out the timing a couple times and it was awesome. Effortless swing",
            "I don’t trust anyone that watched Ken Griffey Jr. play and didn’t at least empty handed try his swing at one point",
            "No! I am self taught. Go on…",
            "I clicked that on mobile and it took me through like 3 different pages 😂 ended up on peacock which thankfully I have",
            "Sorry honey, I need to have an affair. It's for my golf swing.",
            "Those hips and that ass though",
            "Really? He looks crazy flexible for his age to me.",
            "“Here we learn how Otani throws a 101moh fastball. You’re going to want to have your elbow pointing right at the batter while your forearm is pointing straight backwards. Whip that arm forward and…. Ah, your arm has separated from your body and has landed halfway to third base”",
            "This is true. It also has nothing to do with emulating Rory’s swing. He doesn’t swing safely. He swings at super high speed with tons of torque and twist. ",
            "Or just a 6’4” Rory",
            "brysons average driving distance is less than rorys? wow that's surprising to me",
            "Tiger torqued the hell out of his left knee before his knee injuries.\n\nRory is similar, but not to the same degree.",
            "What an amateur (even a good am, like a 5hcp) and an elite pro does *should* be different. It’s like suggesting pickup basketball players at the gym shoot like Steph or just jump over dudes like LeBron. Just because a pro can do something doesn’t mean amateurs will be successful trying the same thing. We aren’t as athletic and we don’t practice high skill shots for hours per day. ",
            "I’d say Detroit still loves Verlander but yeah otherwise I get it.",
            "Cheats",
            "Agreed. They’re rarely talked about except as cheaters, and even that is rare. ",
            "One vote for Altuve here, but otherwise good point!",
            "Church.",
            "Problem is that to get into the positions that Rory does in his swing requires a LOT of coordination and a very high amount of flexibility that 99% of golfers do not have. \n\nHis arm depth + hip mobility is ludicrous. It “looks” so simple, because he is not even at the full range of his mobility. However, ask your local weekend hacker to get their arms as deep as Rory and they won’t be able to make a downswing from that position. \n\nAgree with your post, you can try to emulate a lot of what he does, but to actually *look* like Rory is a pipe dream for the vast majority of amateurs. It’s beautiful tho.",
            "Yeah. I’d say Aberg is the only “simpler” swing that generates a ton of power, but he’s also tall so doesn’t need to do what Rory does.",
            "The thing is Rory’s core is both ridiculously flexible and strong. Most people replicating this swing will not get the same result as Rory, but will subconsciously expect it.\n\nThat IMO is the biggest hurdle. You have to work up to the strength and distance, but rarely are people able to stick with it long enough for it to happen and will likely deviate along the way.",
            "I like that he puts a lot of content on social media about what he’s working on & his swing thoughts. He talks about swinging the knob of the bat just like Tony Gwynn did.",
            "My 7yr old is the same. Best thing IMO is putting them on the slowest Fastball machine setting because there’s no way he’ll make contact trying to load up and murder it. It forces them to just put the bat on the ball.\n\n[Here’s my kid doing it](https://imgur.com/a/Og949BP)\n\nThis speed is faster than coach pitch so it’s good for this drill. Usually at the cages we do the softball 6ft arc setting because it most closely mimics coach pitch",
            "His LH swing was so much sweeter though!",
            "An affair?  Those are rookie numbers.  You need to get those numbers up.",
            "He thicc",
            "Yeah, Rahm has a ton of lower body strength. It works because he's almost turned all the way to the target at impact.\n\nhttps://golf.com/news/follow-these-steps-swing-like-jon-rahm/",
            "It’s the gambling, start betting your scratch buddies $1,000/hole and you’ll immediately develop a Mickelson swing.",
            "“Yeah see. You’re just not whipping your arm properly like he does. Go pick it up and try again.” ",
            "He's shockingly small in person. I'd guess 5'7\"-5'8\". Amazing how much he gets out of it",
            "He’d be way across the line if he swung like that at 6’4”",
            "Bryson, after winning his first US Open, lost a lot of the weight he packed on when he learned how to hit long (he's talked about it).  He can dial up and down how hard he wants to hit it (watch him on YT), but he's clearly trying to favor being in play off the tee.",
            "With those mental gymnastics, it's no surprise to see why the better players get better while the not so good players stagnate. If not get worse.\n\nObviously there's no overnight changes, it's as realistic as expecting a child to run before they learned how to crawl, it's also not realistic to expect every single movement and angle copied and pasted verbatim, etc. But there's plenty to learn from the better players and longer hitters such as Rory to claw out of that rut (ie: swing faster, get more athletic, get stronger to make it more sustainable, etc) instead of retaining the quitter mentality (more appropriate for AA) and definitely instead of the more commonplace, \"confidential\" angry downvote brigading devoid of critical thought and/or word salad that could've been simplified by saying you guys neither want nor deserve the gifts of learning what you can take to your game to hit bombs and improve, for a nice change of pace.",
            "Your god damn right I do.",
            "My son and I were recently commenting on Aberg’s mechanics.  We love it.",
            "Nice short step. We’re on coach pitch and he hits well enough but he knows he gets more than three strikes so he just wants to crush one. I should take him to the cages sometimes.",
            "Sorry I slept with every decent looking woman who would have me, and some who weren't even decent looking?",
            "I’m 5’9.5” and stood within a couple feet of him several times (I was a Marshal at the Dell Match Play every year) & we appeared the exact same height.",
            "Also love his pace of play",
            "My son started the spring season batting 2nd and making contact every time and usually going 2 for 3. Problem became our leadoff hitter is a taller/athletic beast who kills the ball & my son wanted to hit it like him. He started swinging harder & was dropping his hands which caused a 3-4 game mid-season slump as I had to re-train my son for a contact swing. Told him he could worry about hitting for power later on.\n\nIt’s actually funny, my philosophy is completely opposite for golf. I get him to swing out of his shoes in golf with the plan to rein it in later. Reason being, you don’t need to worry about the ball moving in golf.\n\n[Golf swing](https://imgur.com/a/aBnfEED)",
            "So no one..",
            "That .5” makes me laugh. I’d still love you at 5’9” flat big dawg ❤️",
            "Lol I am in the no round up camp as well, respect 🫡",
            "5’9.5 = 5’7. Coming from a 5’7 guy",
            "He’s got a little Scottie driver footwork going on there.",
            "I only mentioned it because I’ve seen some places reference Rory as 5’10” but he ain’t; trust me I pay attention :D An inspiration to shortys like us everywhere :)",
            "Yeah, I think our next big goal is getting him to transition the weight better to his front leg. I’m his main swing coach but have our club pro giving his thoughts and he said the lower body stability would come as he gets older/bigger."
        ]
    },
    "How did I never notice this": {
        "title": "How did I never notice this",
        "score": 271,
        "url": "https://i.redd.it/li5h9xfcr18d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "“Stay off the weed - duh”",
            "I love Hovland's smile, mostly because it never goes away.  He just seems so pleasant.",
            "Scha-wing!",
            "Hovland definitely stoned out there",
            "Vik has his next Halloween idea!",
            "It's a birdy, baby!",
            "Zaaaaaang!",
            "Has someone already done dechambeau vs michael bublé",
            "So if Hovland is Wayne, who on tour is Garth?",
            "*playing air guitar while frantically rolling around on couch*"
        ]
    }
}