{
    "😭": {
        "title": "😭",
        "score": 896,
        "url": "https://v.redd.it/gxmi60cemz7d1",
        "content": "",
        "num_comments": 56,
        "comments": [
            "Ye has the worst discretion when it comes to which tracks to release",
            "tys vultures verse is heavenly",
            "i still refuse to believe he listened to v1 and said yeah that sounds finished release it",
            "Vultures would be trash without our lord and savior Ty dolla $ign",
            "i like the song vultures",
            "Then when the song drop yall say it's bad, spazz out, then have an existential crisis for a week",
            "Vultures goes hard and i will die on that hill",
            "where rick rubin at",
            "This song is hard tho",
            "Snippet syndrome strikes again",
            "what snippet is this this bruh, ive been out of loop for a while im a yandhileaks, WSE and GAS veteran, gave up on following ye after that alex jones shi",
            "I just fucked a jewish bitch is an iconic bar tho lets be real",
            "He brought his fanbase into a more religious arc and listening mode with his previous two albums (and to be honest throughout his whole career).\n\nSo, of course, a song with the lyrics such as on Vultures will be a massive disconnect with the fan base he has built.",
            "second song?",
            "If you put an audio filter on vultures and cut it to 15s ppl would beg for it just as much",
            "vultures 1 deserves more hate",
            "I actually like vultures (the song) a lot, tys verse is heavenly",
            "Vultures hate not accepted here 😡",
            "that snippet is amazing wow",
            "Vultures hate will not be tolerated",
            "Yall ain’t even gonna be listening to this after a week.",
            "Kanye's studio & live performance rarity vault releases when he inevitably passes over to the other side is going to make Prince & Michael Jackson's estates sweat bullets.",
            "https://preview.redd.it/uudabulho38d1.jpeg?width=1079&format=pjpg&auto=webp&s=5f9cc3122355bc5d97453501c348bc83595bf2fa",
            "vultures better than yo fav ye song",
            "My guess is he has a bingo cage for songs and just gets hammered to pick random ones to put on the album",
            "i love the instrumental during his verse, the strings are beautiful and his voice accompanies them so well",
            "Almost like it’s a collab album or sum",
            "Yet he’s the reason y’all hate on the album.\n\nIt’s half Ty Dolla solo stuff turned into a collab album, only having improved production.",
            "Album is really good to but yall not ready for those convos",
            "Snippet syndrome",
            "down syndrome or something",
            "Big ass toaster🔥",
            "Love Me The Most",
            "For the wrong reasons",
            "Love Me The Most. Snippet of it came out last week.",
            "https://preview.redd.it/6oa2n3qkk38d1.jpeg?width=1080&format=pjpg&auto=webp&s=9dcbde77df1d9e09ebe03c4f8689321b4eee6731\n\nThe duality",
            "Album is good to",
            "https://preview.redd.it/mq2alkxlk38d1.jpeg?width=1080&format=pjpg&auto=webp&s=8cbc2bc82332290712b00c40b92e240392d7d807\n\nof man",
            "Too many fakes here",
            "\"Alright, the next song is... New Body- um, Closed on Sunday!\"",
            "He can't decide how to form a tracklist otherwise",
            "Yeah but collab album means they both pull their weight, Jay wasn’t as good Ye on watch the throne but he still did pretty well.  But Kanye is so much worse than Ty on almost every track when it comes to vultures",
            "Love that Verse idc",
            "tq gang",
            "Went crazy live 🤷‍♂️",
            "Yes",
            "I don’t feel this at all, is that the consensus on this sub? That’s crazy to me",
            "Tf u talkin bout Jay not being as good on watch the throne. He killed who gon stop me and ham 😭😭😭😭",
            "Kanye has always had songs that are conscience, while also being playful and witty which made him quite balanced and accessible to loads. Even as recent as Donda, a song like Jesus Lord shows how perceptive Kanye can be. But that is completely missing on Vultures, he’s leaned into the playful side but not in a way that’s new or at the very least funny in most cases, just lewd. Ty ain’t much better but at least he got that heavenly ass voice. Ntm Kanye along wit his mediocre bars doesn’t even sound energised for parts of the album. Legit never heard him so disengaged on an album of his like this before\n\nI actually do like the song vultures tho",
            "Yeah he did great, I never said he was ass . He just didn’t do as good as Ye, but that’s because that was Kanye at his lyrical prime so on the album as a whole he performed better than Jay.",
            "I actually feel like on a good amount of the songs Ye has better performances than Ty, I think they both did their thing but it’s not nearly as bad as people make it out to be. Plus he’s showing a whole other level with Vultures 2 imo that he’s more than capable, the album was supposed to be lewd and stuff, it’s a Ty$ collab album for gods sake",
            "Nah I get it being Lewd but it ain’t even like entertaining to me, I ain’t asking for groundbreaking shit but if the music ain’t engaging, then it just isn’t good enough. I don’t think the album is ass, I’d give it like a solid 6/10 but it just doesn’t really have replay value compared to even his other collab albums. Vultures II does look good but it ain’t even out so ig we’ll see what he brings",
            "It’s only one installment of this collab album though which means it’s not the fully complete fleshed out idea. I understand that some of it can be eh but it’s overall pretty good imo and I enjoyed Ye’s performance",
            "It’s not exactly some deep concept that it needs multiple instalments to be understood. It’s shallow club music, and considering the album is able to stand by itself, I don’t think it’s fair to say we’ve only got one instalment. I’m hopeful for vultures II but it is really its own thing, we can’t say they require each other to make sense",
            "In terms of their collabs and it literally being called Vultures 2 and it being planned to have 3 installments from the beginning, I’m saying that they’re probably better together. Yes they’re way different in theme but we haven’t even seen their full vision, and I enjoy the 1st one so it’s whatever imo"
        ]
    },
    "After Donda ***": {
        "title": "After Donda ***",
        "score": 594,
        "url": "https://i.redd.it/66kku0cdvz7d1.jpeg",
        "content": "",
        "num_comments": 33,
        "comments": [
            "Hit me like hiiii with a bunch of I’s or heyyyyy with a bunch of Y’s",
            "It's scary how accurate it is",
            "Yoo ye might use this ngl",
            "Keep it burning is one of the best post-donda feature for me.",
            "Ay man he's had a few solid bars since, just not consistently at all, and just more bad ones than good ones",
            "UNTIL VULTURES 2 DROPS",
            "Since means after bro",
            "He always been like this ?? This post is almost a mirror of that “then your fat friend, her nickname is Mini van” line",
            "I sucked on your girl’s cheeks while I was high\n\nShe said I was fent-ass-tick",
            "Corny bars are literally his staple. Where is his real fans at?😂😭",
            "What if we took her on a field trip instead",
            "I imagined this over the I Love It beat",
            "Say Less",
            "CAN’T AFFORD YA THATS TOO BAD \nTELL EM WHATCHA GON DO WITH A DURAG",
            "its so true tho, he’ll use the word history and then say his-story. corny stuff like that",
            "He too horny",
            "that could be a ye bar from GAJ 2008 and we would never know",
            "“Yo bitch went out on a work trip, she just going for my work dick HAAAAAAAAAAA” yep checks out",
            "i shoulda known!! what mcdonalds work trip could there have been!!!!!!",
            "that shit was catchy as hell tho. That’s why it was the one lyric that went viral on Tik tok.",
            "I’ve lived a hundred lives uh guess that mean I had a hundred wives",
            "Wish my crush would hit me with a hey with a bunch of y’s or even just a few y’s tbh ☹️",
            "These as lyrics would fit do it",
            ".  that song shoulda been bigger",
            "For sure bro, Kanye and future never miss on a track together, sucks most they stuff unrealsed 😞",
            "Literally",
            "How am I antisemitic? I just fucked a Jewish bitch ",
            "OCD bro my bad",
            "I think the main difference is, I could imagine Ye using the work trip line if he was doing it with a decent pace and in an unserious, fun, charming tone.\n\nBut 2024 ye rapping that bar would be like as if he’s saying it just before or after busting a nut, all out of breath and with a kinda weird sexual energy.",
            "They off the grid grid grid with the kids ",
            "we need promotion 😭",
            "This is true back in the day he used to rap these kind of bars with a degree of charm and charisma that made it funny now it’s either with the tone of a deviant (which he might be) or a person that’s just discovered what sex is",
            "not even might be man, he definitely is. \n\nthe topic of his lawsuits & lyrics, yzyprn, his wife, the pictures of him getting top on a boat with his asscrack showing, the laptop his cousin stole, his ex wife kim k, the topic of the song “hell of a life”, do i need to go on?"
        ]
    },
    "Why is it impossible for dickriders to understand some people don’t love vultures? Also vultures > ye is an insane opinion. Can’t even be in the same sentence ": {
        "title": "Why is it impossible for dickriders to understand some people don’t love vultures? Also vultures > ye is an insane opinion. Can’t even be in the same sentence ",
        "score": 169,
        "url": "https://i.redd.it/9xdlt2ymu18d1.jpeg",
        "content": "",
        "num_comments": 88,
        "comments": [
            "this back and forth about vultures is hilarious like all of yall are repeating yourselves lowkey",
            "why is it impossible for people in this sub to understand what an opinion is\n\nlove everyone",
            "People hyped it up like it was going to be the greatest thing of all time and they're too prideful to admit they were wrong",
            "I feel like people are heavily influenced by social media. Obviously some people don’t like the album, but the amount of hate is kinda weird imo",
            "The idea that GAS’s opinion was moulded by fantano is wild rather than the hype of a new album dropping just wearing off",
            "One of the worst posts on this sub. Makes us look so bad.",
            "vultures over ye and ksg is wild",
            "relistened to vultures today, solid 8/10",
            "(yap incoming)\n\nvultures so far is the only ye album without any theme or congruency. i used to think that it was just a \"lighthearted album\" but ye either does something dumb, like bbtbnwhatever, paid, or alvin, has deadpan delivery (vultures, beg forgivness), or just has some comical lines that ruin an otherwise great song, like king or even some parts of problematic and keys to my life.\n\nid say its a 7/10\n\neven if v2 has better music, and would maybe be an 8, the issue is that there's no unified sound. theres house, trap, sample-based, old-school hiphop, even brazillian goddamn funk.\n\nits everything, which makes it nothing. hoping the solo album might have some direction (i think there was a theme of guilt and regret in some tracks like always, love love love, swabf. theres a shared anger in tracks like quiet \"ima shut it down like quiet,\" bobby digital \"im gonna close it all down,\" and even some d2 songs like beautiful life \"you want a beautiful life fine just dont threaten mine.\"",
            "vultures is defiantly bottom three kanye even if it has songs i like",
            "When the worst person you know makes a great point 💔",
            " the title of that post is so fucking stupid to me",
            "Ya gonna hate but Ye is one of his weaker albums imo. Outside of ITAKY, it’s hit or miss for me. And I think production wise, Ye wasn’t better than the other GOOD albums that dropped that summer.",
            "It's not. Ye sounds so lame and unfinished",
            "Vultures > Donda is an insane opinion, let alone Ye 😂",
            "Vultures 1 is just objectively not the best Ty carries the whole album and Ye has some of the worse verses and bars of his career…and although the production was good it was also a downgrade from Donda \n\nI like vultures but it’s like a 5 which is average and maybe a 6 on a good day",
            "Interact with what you like and ignore what you don’t, the internet is easier that way, no?",
            "IMO I love every vibe of the album and some songs  do MEAN MORE TO ME PERSONALLY than some songs on other albums",
            "Facts, when it comes to album reviews on here I just scroll through.",
            "Why is it hard for people to understand that some people absolutely love vultures and regard it as another near perfect album?",
            "It's called having different opinions",
            "I like it and think its an overall 7/10. Not top 5 ye but i’m fed",
            "He’s right tho",
            "He's right and it is",
            "This sub clowned on fantano for months after that “review”, and lowkey still continues to do so. To insinuate that he influences members’ of this subreddit’s opinions is crazy. If anything, the only people on here are die hard fans and can’t be influenced by one person’s opinion. Anyone who is swayed that easily is not on a alternate subreddit. Literally type fantano into the search bar here and it’s 85+ % negative. It’s crazy how short term memory this place is.\n\n99% of the members here would agree that vultures 1 was never in contention for top ye albums. It’s a collab club album with Ty. Stop forming your entire personal opinions off one random guy you see on Reddit lol",
            "Vultures has skips",
            "Almost as if people sat on the album and realised it was mid af",
            "Say it sucks all you want but the numbers don’t lie",
            "Ew reporting idc if it’s a screen shot i hate fantano posts. he’s annoying  🥱",
            "Ye is a 9/10 album\nVultures 8/10\nsimple as",
            "Donda 2 > Ye",
            "Shut up lol people can have opinions and Ye is his weakest release",
            "Vultures is actually better than ye imo. By miles. ye is easily the most overrated Ye album of all his career. And people must see this",
            "&#x200B;\n\nhttps://preview.redd.it/x10nz4hjp28d1.png?width=923&format=png&auto=webp&s=b0ad534552be8758885bb2ced8f5e9ef53b45d16",
            "Seen the same discourse over the course of like 3 months",
            "there are minimum 3 posts a day like this, so lame",
            "Mental illness",
            "Anyone who looked at a club-focussed collab album and thought “oh yeah this boutta be the next MBDTF” deserves the disappointment",
            "Just want to point out that people were hyping the OG Vultures tracklist, Everybody, Slide, River, Maintinence etc. which IMO would have been Kanye's opus house album which he has talked about for years. Splitting it into three parts and sample clearance issues ruined vultures 1 potential of being in the debate against the rest of his work.",
            "This is exactly what’s happening",
            " Agree it’s overhated and there’s kind of a cifclejerk against it, but the opinion that it’s no skip and best since Pablo is far more delusonal, in my opinion it’s okay, like 6-6.5/10 but nothing cray",
            "Yeah like we all managed to simultaneously clown on Fantano while believing everything he said?",
            "GAS learns the term recency bias",
            "Funniest thing about this post is the insinuation that Fantano killed the hype on Vultures 1 and flipped public opinion \n\nHis “review” was a fart in the wind, nobody who liked v1 before stopped liking it after that, and nobody who disliked v1 before stopped disliking it.",
            "Legit posts in response to posts in response to other posts. Ts is so lame 💔",
            "Calling the album with Paid, Paperwork, and beg forgiveness no skip is peak Kanye fan delusion",
            "Agree 😎",
            "Yeah juice wrld profile pic usually got horrendous takes but this one is actually true unfortunately",
            "Finally",
            "This is Drake Stan level cope. I like the album, but numbers don’t mean shit",
            "https://preview.redd.it/w5mutssi028d1.jpeg?width=1179&format=pjpg&auto=webp&s=400cf5c2fb99323ab73b9bfc00a78b4c66fae4f7\n\nCorrect",
            "Holy fuck this is retarded and I love Donda 2",
            "Maybe finished D2 but def not in its current state",
            "Yeah if it was actually finished lol",
            "i know this image is stupid as fuck but it fits the scenario",
            "and most importantly ye fuckin ass lazy verses",
            "Yes",
            "It’s def not best since Pablo, but I can understand the argument for it having no skips/few skips. Like none of songs are really that terrible. The worst songs aren’t bad they’re just mid like paperwork and keys to my life aren’t bad just not fully finished feeling like Paperwork especially is just demoish. \n\nAlso it doesn’t have any songs that just heavily disrupt the flow of the album like Donda with Remote control and others.",
            "I was talking about what majority said in its release.\n\nI still think its no skip but nah Donda&Ye better than Vultures1\n\nDonda is top 2 with TCD imo",
            "He’s talking about the post I screenshotted",
            "Oh cmon now don’t do beg forgiveness like that",
            "I gotta be meshed with these delusional niggas man.\n\nhttps://preview.redd.it/f0jbc5dhw18d1.jpeg?width=756&format=pjpg&auto=webp&s=9ac8b7c6a8856905325512c8b22e007ce6a459fd",
            "Never speak about Beg Forgiveness that way again wtf 💀",
            "Wouldn't it be up to the individual for whether they skip or not 🤔",
            "Put some respect on pieawsome",
            "People said the same thing about donda till it won a Grammy",
            "Facts",
            "6 min song and the first 4 minutes is boring with one of Kanye’s worst verses of all time on it \n\nTy’s part is really good but it’s not worth sitting through the first part for at all",
            "I've seen people celebrate the grammy's that DONDA received but I've rarely seen people defend the album by talking about the grammys",
            "Wait this is the worst take in this entire sub. Beg forgiveness is his best song since donda 😭",
            "Exactly lol",
            "Lmaoooooooo",
            "It’s terrible \n\nSeriously wanna sit through 4 minutes of looping domestic abuser with the most half assed Kanye verse thrown on the end of it????",
            "If your music taste is purely based on morals than how are you even a ye fan",
            "It's not looping. the production has changes with the vocal effects and the vocal layering builds on eachother with ty dolla $ign singing over him. \n\nHow is it a half assed Kanye verse it's like one of his three introspective verses in the last 3 years, I understand more about modern Ye through that verse then every horny ass interview he's done",
            "Ty comes in and saves it by rhyming \"sad\" \"bad\" and \"mad' 🔥🔥🔥",
            "It’s not I was just clowning Chris brown idgaf",
            " Fuck it up one time\nI know what you want\nI'm readin' the signs\nDon't let your moment pass you by\nDon't let your moment pass you by\nHad to go in my whole life\nA hundred percent covered in ice\nPut down your phone, cut off the lights\nLights\nCut off the lights\nCovered in ice\nAnd if I go tonight, know that I lived a lovely life\nJust make sure my kids are right and it is alright\nAnd if I go tonight, just know I lived a lovely life\nTell my kids to live they life how they wanna live they life\n\n\nThis is filler bars until the very end and barely introspective it’s just slightly sad \n\nAnd he sounds lazy on it especially the first parts",
            "chris brown killed it though fr",
            "How are those \"filler bars\"😭 do you need genius.com to explain it for you? \n\nLet's look at another Ye song that when you reduce it to text it looks like filler ramblings \n\nHey, hey, hey, hey\nDon't say you will\nUnless you will\nHey, hey, hey, hey\nDon't say you will\nThen play you will\nI pray you will",
            "I actually agree with what you’re saying for the most part, I just thought putting Beg Forgiveness with Paid and Paperwork is a lil crazy. Those two are by far the worst",
            "That’s a hook, not a verse \n\nAll he’s doing on beg forgiveness is saying random sad stuff it has barely any depth to it all and most of all he sounds bad doing it \n\nMany of the bars do not relate to eachother\n\nEven if it was the most meaningful verse ever it sounds bad",
            "paperwork is better than hoodrat"
        ]
    },
    "Ant Clemons liking this comment": {
        "title": "Ant Clemons liking this comment",
        "score": 44,
        "url": "https://i.redd.it/svrslktxg38d1.png",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Poor guy 😪 he deserves more recognition for his talent",
            "I mean ant clemons isn’t helping himself considering he never drops",
            "I wonder if he could ye ask for the songs and get them, or if ye would say no",
            "fr, his album was really good"
        ]
    },
    "What Happened This Week": {
        "title": "What Happened This Week",
        "score": 245,
        "url": "https://www.reddit.com/r/GoodAssSub/comments/1dliti5/what_happened_this_week/",
        "content": "For people that are not chronically online:\n\n- Ye and Ty dropped a feature on Gimme a Second 2 by Rich the Kid.\n\n- A version with only Ye as a feature was first uploaded with about 3-4 more lines from Ye instead of Ty’s feature. \n\n- An insider (Luit) let us chose between 3 unheard tracks for a snippet. We got a snippet of Love Me the Most (The only snippet that had Ye vocals). \n\n- The other choices were City Underground (only Ty) and Aperol Spritz (Ty and mystery artist). \n\n- Ye is most likely having a show in Korea in August. \n\n- Ty and Ye are both in Paris. \n\n- Ty has a show Saturday in a club again and theres a chance that Ye might show up.\n\n-  Aus (The guy doing all the creative stuff for the shows) visited multiple stadium in Japan, Korea and Taiwan. \n\n- Aus and Ty linked up with Westside Gunn. \n\n- We Love You is an unheard Vultures track. \n\n- Ye and Ty performed Carnival in Tokyo during a Wrestling event called Wangmania. \n\n- Saint Leon invited a basketball player (Wemby) to a \"Vultures party\" this weekend. might be a reference to the club event Ty has planned where Ye might go or a private listening party like ones months ago. \n\n- Not Inclusive was brought back to Vultures 2. The version of this song we \"heard\" recently was AI.\n\n- Star Time is also brought back but with a different name. \n\n- Ty did an interview with Billboard and said the Vultures 1 rollout was \"fucking perfect\".\n\n- He also states that the album could drop any day but the interview is from May 16th. \n\n- As of May 16th, Vultures was still a trilogy. \n\nhave a good day everyone!! ",
        "num_comments": 27,
        "comments": [
            "Actually an eventful week, album in a couple months for sure",
            "We love you LovelyShitStain❤️❤️🦅🦅\n\nhttps://preview.redd.it/2xqh7ww6o08d1.jpeg?width=1179&format=pjpg&auto=webp&s=468e35f89ce279838a31874c952894ca31d6adcf",
            "Holy shit, a Lovely Shit Stain appearance?? Something big is about to happen",
            "Are we glad or not glad about Ye's break from social media",
            "There is so much potential for a reboot of this rollout. We the Vultures🥹",
            "TY AND YE IN THE SAME PLACE VOUCHERS TOO SOONR‼️‼️‼️",
            "need vultures 2 to come out and be great bc all the ye hatred online is getting depressing",
            "u/LovelyShitStain never misses",
            "Damn dude something going to happen soon for sure \n\nNice to have the recaps back",
            "And Elden ring DLC has been released 😅",
            "what’s a bad rollout if v1 rollout was perfect ?",
            "https://preview.redd.it/3uwn8owrn08d1.jpeg?width=224&format=pjpg&auto=webp&s=d9e31b5b7f4c36cf8a90d4abcf120ec59804ac63\n\ni love you shit stain\n\nyou’re so lovely",
            "Can someone send love you the most snip link?",
            "Wait, when they performed carnival, was it actually performed or a listening party",
            "Mods sticky this, I can't handle there being no stickied posts on the sub",
            "months??\n\nVOUCHERS 2 TONIGHT 🦜🦜🦜",
            "love yall too gang 🤝",
            "the show tomorrow at 5pm est. ![img](emote|t5_67n60j|32329)",
            "definitely glad he’s been off the internet and silent since it saves him and us from more unnecessary discourse/drama however i wish he was like this after he drops the album",
            "I don’t mind it let the man cook in silence",
            "Ye is going to get hate either way. he deserves it in some ways🤷‍♂️\n\nBut Ye is a good person and should not be painted as an evil being like he often is.",
            "probably the future Vultures 3 rollout ngl 😭",
            "fuck my life",
            "nah he deserves criticism for his actions \n\nit’s when r/playboicarti blames ye for their lying vampire man not dropping that gets annoying",
            ">But Ye is a good person\n\nWhat are you basing this off",
            "Unfortunately it is true that Ye told Carti to wait for his albums",
            "The deeper into the vultures rollout we get the closer I am to fully realizing this man might genuinely suck \n\nEven if he didn’t SA anyone is it even worth defending him "
        ]
    }
}