{
    "Admissions/Rejections season can be really hard. Please offer support to one another and other resources here.": {
        "title": "Admissions/Rejections season can be really hard. Please offer support to one another and other resources here.",
        "score": 476,
        "url": "https://www.reddit.com/r/gradadmissions/comments/11bcrvq/admissionsrejections_season_can_be_really_hard/",
        "content": "Original post: https://old.reddit.com/r/gradadmissions/comments/dyxhsw/modpost_graduate_admissions_is_a_grueling_process/\n\nMore recent post:\nhttps://old.reddit.com/r/gradadmissions/comments/lakb6l/admissionsrejections_season_can_be_really_hard/\n\n\nMany if not most of those previous numbers are still valid, but please continue to contribute and build a new database for helplines.\n\nWhether you get in, don't get in, get in and then lose your funding, don't get funding at all, or whatever, everyone has risk at having a crisis when they need to talk. I personally used one of these helplines after losing funding as a graduate student during the '08 recession when I was in a really bad way. There is no shame in calling them. At. All.\n\nWhy is this necessary to post and share and sticky? As /u/ThrowawayHistory20 said in a previous thread:\n>Many of us seeking admission to top tier grad schools, and just grad schools in general, grew up our whole lives hearing “wow you’re so smart!” Or “you’re so good at X field!” from parents, teachers, friends, etc. That then causes many of us, myself included, to internalize this belief that being smart or good at our field or just knowing a lot of things is what makes us valuable. It can help drive us to be good at our field (though in a toxic way because it’s driven by a fear that if we fall behind, we lose the thing that make us valuable), but it also makes rejection very rough.\n\n>We know logically that when we get rejected from a top school in a competitive field that it means “you were a well qualified applicant, but there were too many well qualified applicants for us to take everyone,” but it can feel more like “you’re not good enough at the one thing you’re good at and the one thing that gives you value as a human being.”\n\nAgain, please share any additional resources and/or helplines here.\n\nArchived Helpline Info:\n\nIn the US, you can call 988 for crisis support, or 1-877-GRAD-HLP for support specific to graduate students/grad school issues.\n\nText 'HELP' to 741741 in the United States, or 686868 in Canada.\n\nAustralian folks can call 13 11 14.\n\nIn the UK, text 85258.\n\nIn Brazil, The CVV number is 188.\n\nIn India, call 022 2754 6669.",
        "num_comments": 132,
        "comments": [
            "The fact that there is a number in the U.S. specifically dedicated to graduate student crisis is alarming. . .\n\nBut glad the resource is there!",
            "I just got rejected. It was my first time applying as I’m 42 and finishing my undergraduate degree currently. I can’t help but feel it’s because I’m older and changing careers. It’s really humbling and definitely not a good experience",
            "I wnated to say, I really massively respect the dedication, focus and insane tenacity and skill of all people who seek to do a Masters or PhD. Your passion for the field and your ability and willingness to care for every detail, and the reams of article drafts you have to pour over... when universities say they stand on the shoulders of giants, they are standing on yours too! \n\nThis includes folks who are not commencing a Masters or PhD this cycle. Whether you try again (I hope you do!! Damn the application fees) or apply your skills and virtues elsewhere, the world needs your gifts and is the better for it.",
            "One of the tougher issues is getting admission and being denied a visa to go to school. For some of us in developing countries, the trauma is sometimes twofold. 1. Getting for the admission process hurdle and 2. Getting over the visa application process hurdle.",
            "Applied to twelve PhD programs, rejected from ten of them, still haven't heard back from two. I thought I was a strong enough candidate to at least get an interview, but I guess not. All that time and money down the drain and now I don't know what to do. I'm trying to bounce back and am applying to jobs and researching master's programs. Trying to see it as a blessing because I'm not so sure I even want a PhD anymore. I just feel so guilty like I'm letting my family down because I would have been the first in my family to go to grad school and I took a post-bacc year to focus on strengthening my profile and applying and now.....all that time and money gone. Sigh. Can't talk to my friends about it because they've been getting good news and I don't want to make them feel like they can't celebrate it with me. So I'm just venting here. I knew my program was competitive, but geez. Wasn't expecting this sudden life crisis lol",
            "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAH Where do I grow more patience 😭😭 I'm obsessively refreshing my email 60 times an hour, still haven't heard back from unis with December deadlines ;__; it has been a full quarter guys pls get back to me thnx looking forward to your positive reply xoxo sincerely\n\nI finally understand why they repeatedly tell us to not contact them regarding admission status (:",
            "Pretty sure i got rejected from my masters programs. Saw people post about their acceptances on grad cafe but i haven't heard back lol.",
            "This is so so thoughtful, hang in there everyone! Good things are coming ✨🌻♥️",
            "As someone who got rejected from all 10 PhD programs two years ago (worked on masters in meantime), I just want to give some solidarity to whoever needs it. I've been putting off working on my applications this year because even though I know getting rejected isn't a comment on my abilities or on myself, it still hurt and it still left some scars. \n\nI just want to tell anyone who needs to hear that they're not alone. We'll get through this. It might take time, but we'll get through this.",
            "thank you for pinning this!",
            "I spent the morning struggling with rejection and seeing this post, especially the quote from throwawayhistory20, helped me understand why I'm struggling and that was so so valuable to me. Thank you thank you thank you",
            "i know i should be grateful to have interview offers when others don't but...\n\ni always keep my phone on do not disturb. i swipe up and see a gmail notification, but when i put in my password to see the preview, it's something random. every day goes by without an offer. i'm constantly on the master spreadsheet...",
            "Just heard back from the last graduate school I had been waiting on. And no shocker, I was rejected yet again. I need to figure out a new plan for the upcoming months until I can reapply.",
            "Got my first rejection today and it's hitting harder than expected. I feel like I overshot by applying to way too competitive programs and at this point it's too late to apply to new ones because I can't find anymore professors to give LORs. \nIt's just the starting of the application period and i am already feeling I will not get in anywhere. I spent the last 6 months preparing for this and I feel so lost now.",
            "Hang in there everyone. And don’t give up until every single school rejects you. And even then it’s not the end. Several of my friends got in the second and third time around. Some had to do that and take the extra year to mature themselves and their profiles and improve their writing and interviewing skills. One year is not much in the grand scheme of things. Never give up. Keep applying. Keep interviewing. Keep writing and trying and begging and clawing your way into your dreams until you make it. It’s the only way. ❤️",
            "I got my first rejection today,",
            "I want to make clear before saying this that this is no fault of the professors, I understand that they are incredibly busy and likely do not have time to deeply consider the needs of potential grad students. However, it is extremely frustrating to me when professors don't make it clear on their websites whether they are open to accepting graduate students for the upcoming semester. I feel like it wouldn't take long to just update the lab/faculty website with a line like \"is/not accepting grad students for the 2023 semester.\" Wouldn't it be better that way? That way they wouldn't get hundreds of emails asking about availability. It just feels like the chances of me wasting my time investing in learning about a professors research are relatively high when it isn't clear whether they're open to accepting new students.",
            "Feeling like I am going to throw up :( I HATE THIS PROCESS!",
            "Just got my first rejection ever. I have a really niche field that has very few options within the US. Only applied to one school because it has been a dream of mine for the past 10 years. I have worked my ass off and have gone through a lot to get here (mental health/financial struggles). I knew that the acceptance rate was going to be low so I was expecting a rejection, but I could not have predicted how much it would sting to get that email.",
            "Just got denied from two of my top three programs within an hour of each other. I'm feeling it rn",
            "Hopes and dreams can be dashed by one letter.  It sucks, but keep your head up and don't let life beat you down.  You just got to beat it harder.",
            "No rejections yet (although I do anticipate them)--is this a positive thing? Lol",
            "Can we please bring this thread back/revive this thread! the programs I applied for have a 1%< to 5% acceptance rates and I am pretty sure I am not getting into any of them lol (MFA things)",
            "I want to hug everyone. This process is so difficult",
            "I just want to cry today, honestly just cry and be disconnected for a while. I really don't understand where did I mess up and how did i mess up so bad. Got my SOP reviewed by many folks and didn't find any glaring issues myself. So where are the damn admits?! I keep telling myself it is a test of patience but I am seeing folks left and right getting admits while I am lie in the pool of despair. I should be satisfied with my one sole safe admit but the remaining are just testing me to be honest. Every congrats I say these days becomes bittersweet cause even though i feel happy for the person, I further fall in unnecessary stress of \"what will happen to me?\". I know I overestimated myself a bit (split my applications in MS/PhD instead of only MS which was my only plan) thinking I might have a shot of getting a PhD straight out of my undergrad. I honestly feel unis should just send out the rejects instantly for those they don't want instead of giving the false sense of hope by delaying the inevitable. I know this cycle of decisions is something out of my control and I did what i could while building my profile. It is not in my hands and should be grateful but IT IS SO GODDAMN DIFFICULT! Stay strong folks",
            "I got rejected 3 out of 4 programs I applied to\n\n1. I was too technical of a person\n\n2. My Gpa was not good? It was actually!!\n\n3. No reason",
            "It is really so sad.  I have received two rejection letters.",
            "annnnd another rejection. womp womp.",
            "Haven't heard back from any of the unis I've applied to. Just give me a rejection already, but don't make me wait anxiously :(",
            "just got rejected from the only msw program i applied to and it def hurts. it's the only place i wanted to go for multiple reasons so im crushed. currently trying to follow up w the program director to understand why they said no and what i can improve on for the next application cycle. this is lowkey one of the more embarrassing moments of my life...",
            "Waitlisted to Tulane University's School Psychology PhD program. Very disappointed as this is the only school I applied to due to geographical restraints. Hoping a miracle happens. Any advice on what to do in the meantime and overcome waitlist blues would be much appreciated.",
            "Had an interview with a professor yesterday saying they’d like to be my advisor and that they are recommending me for admission into the program (masters) Does this generally mean you’re  in?",
            "[deleted]",
            "I applied to five places for Ph.D. and got rejected from 3. In two, I got to the first interview round. In one, I got to the final round of interviews (Aries DTP). I haven't heard from Aries yet, and they were supposed to give the first round of offers one week ago. So I was feeling really low today. What sucks is that I am already a Ph.D. student at a really good university, and I decided to leave my current super-toxic guide after much consideration and thought. And everything is making me question my decisions sometimes. I really, really wish to get selected for this session; otherwise, I might have to leave my dream of becoming a professor.",
            "For those that will apply or will reapply this year, try your best and be positive!",
            "Thanks",
            "go jim",
            "Applied to 9, got my first rejection but thankfully it was from probably the farthest reach of my list, and I spent a lot of time telling myself I am likely to get all rejections and how PhDs are hyper competitive, very few spots etc so I don't feel much, kinda expected this but still sucks. As more roll in especially from some of the \"lesser\" schools I'm sure it'll hurt more.",
            "I got waitlisted. I feel so confused and kinda hurt because the program director emailed me the day after interviews asking me to apply for her lab. And now I’m waitlisted :( I was feeling really confident because of her email and now I feel silly. Im trying to not take it personally or feel like a second choice but it’s hard not to",
            "Hi everyone,\n\nI hope you guys don't ever give up. It's stressful process. Last year, I was rejected from 2 universities. I was going through a rough time so I decided to take break. This year I only applied two universities. A few days ago I got accepted into university. However, I'm still waiting for a decision from a different university. \n\nUpdate: I got accepted into my top choice for grad school :)",
            "if anyone sees this, i could use some advice regarding whether or not I should see this as a red flag:\n\n[https://www.reddit.com/r/gradadmissions/comments/1b77ooz/is\\_this\\_a\\_red\\_flag/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/gradadmissions/comments/1b77ooz/is_this_a_red_flag/?utm_source=share&utm_medium=web2x&context=3)",
            "I got rejected from Carnegie Mellon MIIPS program today. I was also rejected from the product design master's program at Boston University. I don't know why I even bothered applying anywhere. My parents really want me to do a masters program in the US so that I can leave my country, which is really not doing great at the moment. I feel like I'm letting them down.",
            "Applied to PhDs at McMaster U and SFU. Honestly, I was feeling way more hopeful with my master’s applications a few years ago. I don’t have a good feeling about the PhDs (haven’t heard back from any program yet)",
            "I just got rejected from stanford for fall 2024 computer science masters. That was the most heartbreaking mail I have ever read. Is there a way to request the university to reconsider my profile? I'm a first gen student and I have worked really hard and published an IEEE paper as well in BCI domain. Please help!!! 🥺",
            "I didn't get into my dream school, which is located literally 15 minutes down the street from me. \n\nOh, well!",
            "Any one joining the University of Southern California for MS Biomedical Engineering for Fall 2024 please DM!",
            "That makes things much easier",
            "I don't know people are coping with the rejection. I was the perfect student and I'm getting rejected everywhere. I feel like I worked so hard for nothing.",
            "Well, you could always try again.",
            "[deleted]",
            "I read somewhere that you should not look at non-admission offers as a rejection, but rather as the inability to offer a place in the program because of limited space. This mindset has helped me lot, so I'll include it here!",
            "Hey Everyone, just wanted  some advice on which schools to apply to for MS CS.\n\nMy profile is as follows:\n\n● CS from Top college in my country \n\n\n● 3.71/4 GPA  that will rise to 3.74/4 after my final semester. \n\n\n\n● 2 published research papers : 1 in IEEE Access, 1 in IEEE AICAS \n\n\n\n● 2 research internships: one in IIT and other (ongoing) in a major FMCG company.\n\n\n\n\nI didn't want to apply blindly to colleges like my peers, rather, I wanted to understand what programs would be ideal for my profile (not factoring the competitiveness of the 2024 admit cycle). Also do note that I am interested in developing a deeper theoretical understanding of the field.",
            "I had a panic attack from some extenuating circumstances of extreme loneliness and depression for the past year when I had to accept a grad decision offer and the portal closed. I immediately reached out to the PI who was interested in me told me I could still get in after I explained my situation. The day after the deadline, the graduate program agreed to accept me still and understood my situation. The head of the grad school on that same day, 24 hours after the deadline, said it wouldn't be possible and said I would need to reapply in a year. The program still wants me to reapply again next year as they think I'm a good candidate but I seriously don't know if I'll be around in a year at this point. while this is not a rejection in the way many people may have dealt with it this cycle, it is very hard. I am ultimately at fault for rejecting myself the opportunity in a moment of clouded judgement. I feel my brain slipping away.",
            "Hey guys how will a Master of Science in Health Promotion and Management from Merrimack College compare to an MPH - Community Health Education from UMASS? UMass is my state-flagship insitution but they haven't given me any financial aid information (scholarships, graduate assistantships, fellowships, etc) but Merrimack College has given me a Presidnetial Fellowship opportuntity that'll cover 100% of my tuition. Basically what are my chances being success (as in having access to good paying jobs post-graduaton) if I pick a well known program from a well known state flagship or niche degree from a niche regional school? I'm afraid since the MS in a newer, niche major from a smaller regional school that'll I struggle to find a job. I have until Friday May 17th to decide.\n\ntldr: Help me pick the best for long term career success: MS in Health Promomtion and Management at Merrimack College (100% off tuition) vs MPH - Community Health Education(financial aid: unknown) ?",
            "I just got rejected from a Masters programme in the US (I'm from Europe and have a Bachelors' degree from a 3-year university). The reason for the rejection was \"Does not have 4-year degree equivalent\". Meanwhile, one of the documents required from me was a WES credits evaluation, since my university offered 3 year bachelor programs. When I received my copy of the WES evaluation, it mentioned \"Total Undergraduate Semester Credits: 125.0\", which to my knowledge is more than what US universities offer (120), yet I got rejected for this. Is there anything I can do in this case?",
            "Help Needed: Choosing Between UCL’s Health Data Science and Harvard’s MPH in Quantitative Methods!\n\nHi everyone,\nI’m a health educator from Taiwan and I’m excited to share that I’ve been accepted into two amazing graduate programs: UCL’s Health Data Science program and Harvard’s MPH in Quantitative Methods program. I’m thrilled but also a bit overwhelmed, and I could really use some advice to help me decide which path to take.\n\nMy Dilemma:\nI love the idea of living in London and traveling around Europe during my studies. However, Harvard’s global reputation is incredibly appealing and could open many doors in my career.\n\nQuestions:\nWhich program would provide a stronger foundation for applying to top-tier PhD programs?\n\nWhat are the career prospects and industry connections like for each program?\n\nHow do the alumni networks compare in terms of support and opportunities?\n\nIf you’ve attended either program, what was your experience like?\n\nAny other factors I should consider in making this decision?",
            "Hello everyone. I applied to several schools for Ph.D. in Biostat, anxiously waiting for the decision right now. Does anyone here apply to the same program?",
            "After scoring 7.24 cgpa in btech(Completion in 2021)cse, i started my mtech in 2021 in order to improve my profile as I learnt my lesson regarding high cgpa(Got rejected from the universities I applied in 2021).\n\nIn mtech, I scored 8.89 cgpa in my 1 year but the counselors said its a bad idea to show mtech in cse if you want to do masters in the same field and face difficulty in getting a visa as well. So I took a pause with my mtech studies in 2022.\n\nFacing rejections for 2023 applications, where I didn't show my mtech. I have a doubt, should I show my mtech 1 year marksheets to the university and complete my mtech as well or just work with my btech scores?",
            "Hello folks,\n\nI have applied for Ph.d in Biomedical Science but got rejection from 2 universities. Could you guys please tell me about Upstate Medical University? I want to know how is the University, their culture and chances of getting accepted. \n\nThank You.",
            "I have been admitted to northeastern university and have also paid the enrollment fees but haven’t received any update on further process plz help ",
            "I thought I had a really good application to the programs I was hoping to get into. Good grades, stellar recommendation letters, and several years of volunteer work that actually made me want to do this career in the first place (rather than volunteering so it would look good on an application). I only applied to three schools because I really, really don't want to leave the state and two of them have already said no. I went two rounds of interviews with one school and I thought I was gonna get in. \n\nAt this point, I really don't think that the third school is going to want me and I don't really know what to do. Any ideas of how I can do better next year?",
            "**Will my GPA be enough?**  \nI am from India, and during my B. Tech, I achieved a score of approximately 72.5%, which roughly translates to a 3.1 GPA. Now, I aspire to be admitted to the Master of Science in Computer Science program at UIUC.",
            "Believe me, as a former grad student and current mentor... It's needed. I HATE the academic hazing complex.",
            "Thank you for all the resource",
            "I respect you\nPlease continue what ur doing!",
            "Hey! I’m really sorry about this year. Definitely give yourself some time to grieve. I’m sure you worked your ass off. I also suffered a year of complete rejections after graduating from my undergrad as a non traditional student (31 y/o). I decided to change fields and do a MS in computer science and will graduate this year (37 y/o). Since I enjoyed CS research as much as I enjoyed chemistry research I decided to apply for a PhD and finally was accepted at my ideal program. Don’t give up if it’s your passion. Also, I think directors and advisors like our maturity and our drive to push through when most are bogged down with common issues in a middle aged adult life.",
            "Please let me know about your successes. I am 35. I want to do my masters. My post asking for suggestions was trolled in this sub. Please tell me a positive story and motivate me.",
            "Keep hustling friend. Education has no age limit, no one is ever too old to learn. All the best for your future.",
            "I also wanna add that international students are also fucked over with funding after admission and other costs/emergency routes home.",
            "Woah, you can be denied a visa? Dang.",
            "Hey man, trust me your parents are still proud of you. All that hard work won't go to waste, you'll get something better next year. Or if you decide not to do a PhD, maybe that's what was written all along. I believe everything happens for a reason. Talk to your friends and family, they'll support you and cuss those unis with you. My friends used to say \"we'll drink together if you get an admit and we'll drink together if you get a reject.\"  As you said, your program is competitive af, no one knows what these unis want. Take a few days off and take care of yourself!",
            "Same😭I got rejected by two schools in January, got one offer yesterday but still waiting for my top choice😭😭😭It's SUPER stressing when u see others applied to the same program getting their offers\n\nI wanted to contact the admission but your comment reminded me lol",
            "I'm in the same boat, feels like I've been waiting forever",
            "Join the club!\n\nSeriously, we need to start a club",
            "[deleted]",
            "Do you have an idea what it might have been? A bad LOR you think? Bad grades? Or was your application pretty good overall?",
            "I hope you did get in somewhere, and even if not we always have plan Bs! I am in the same boat. Got rejected from two schools and accepted in one of the school that was my back up. Not too excited about it!",
            "Posting on my alt, but wanted to offer you hugs. It looks like I'm 0/4, if it makes you feel better. One denial, one program has allegedly sent out acceptances and I was not among them, another program interviews and I didn't get an interview. I don't think I want to go to the 4th after an absurdly awful experience with an admissions officer at that school, so it might as well be a rejection. \n\nMy advisor essentially established the field and he was shocked. Apparently he spoke to my PI at my top choice (small enough of a field where they all know each other and are actual friends) and I had it in the bag. \n\nI've only worked intermittently for the last 6 or so years because I was fighting two diseases that were determined to kill me. I made it, but I suspect the huge gap in my resume did me in. Which, as you can imagine, made 0/4 feel like the biggest kick in the ass after everything I've been through. \n\nSorry for ranting on as a reply -- I just wanted to know someone is there with you. Fingers crossed you get that last one. I think I'll go get my MA abroad as my dual citizenship just finalized and the application for that program doesn't close until the 28th. But I want to be very small when I think about having to transfer my maintenace medical care abroad for a year. \n\nSorry for ranting on as a reply -- I just wanted to know someone is there with you. Fingers crossed you get that last one. I think I'll go get my MA abroad as my dual citizenship just finalized and the application for that program doesn't close until the 28th. But I want to be very small when I think about having to transfer my maintenance medical care abroad for a year.  This was the last year that this PI was taking students before retirement, so it does indeed suck. \n\nHugs and positive vibes to you (and everyone else).",
            "I don't have any good solutions or ideas for you, but I still wanted to say that getting two rejections in the same day absolutely sucks. I had two in the same week and that knocked me on my ass.",
            "shit... that hurts...",
            "depends i think? i like to think so...",
            "Any update?",
            "Same! I mean the acceptance rate isn't so low for the program itself but since I'm an international student, it makes it harder. The unis I've applied to for a Master in Architecture accept only 1-2 international students per year. I've lost hope.",
            "Mine did not give me any reasons expect it was competitive due to there being a lot of applicants.",
            "Did you apply PhD or masters?",
            "Did you get any advice? I too have applied for only one program and IDK what to do if I get rejected...",
            "Yeah that’s huge! Congrats!",
            "I'm looking at your post and that's absolutely not true. People are consoling you and giving you some recommendations for the next round. . .",
            "I got rejected from 4/6 yet, 2 more to go. It is so difficult to get into ESRC studentships as an international student, I can't help but feel so low already. Feel like I might get rejected from the other 2, they were anyway hard to get in. But hang in there pal, we will figure something out anyway!",
            "Good luck! My fingers are crossed for you.",
            "Why don’t you try Canada instead?",
            "Does your WES report specifically state that you earned the equivalent of a US Bachelor's Degree? If it does, then it is probably either 1) your program of study does not have equivalent coursework to what the program of study here would be; or 2) your university does not have accreditation in your country that would be equivalent to US regional accreditation. Were you in contact with a grad admissions advisor? You could reach out to them and talk about this issue, they may have more specific information for you.",
            "That’s amazing! Congrats. I just finished undergrad there and I loved it. What’s your major?\n\nEdit: Is it for spring? They probably haven’t sent out the info yet but keep an eye on your email. I can’t remember how it all started.",
            "Ha bhai!! Apply karde",
            "Oh absolutely! I'm in the last semester of my Master's. I completed my coursework last semester and am focusing on my thesis and I have never experienced the type of pain and stress that academia inflicts. This is also my second round of Ph.D. applications and I have gotten rejected from two out of three schools. The last school is my first choice, so I am just hoping I hear back positively. Because nothing says \"You haven't dedicated every waking second to academia quite enough!\" like getting rejected two rounds in a row LOL!",
            "Brother what degree did you pursue and how did you become a mentor I too am interested in helping out people so that's why I am asking.😁",
            "I don’t have a good story. I have a degree in social science and I’m unemployed. Having a hard time finding employment and was rejected from grad school 🤷‍♀️ sorry",
            "I'm 30, and I just got into a Ph.D. program in sociology. It is certainly possible, although I won't lie that it is extremely difficult at times (and I am sure I have more difficult times to come as I actually start my Ph.D.). But, I know that I am pursuing my passion and I proved to myself that I am worthwhile enough to get into a Ph.D. program despite being a non-traditional student. I am sorry to hear you were trolled; some people just need to make others feel awful to feel better. Whatever path you pursue, I wish you the best of luck. Don't give up.",
            "That was my situation last year unfortunately, could have gone to oxford for a masters but cannot afford to do so anymore bc of some crisis back home:(\n\nSo I took a gap year and worked in a lab this year hoping that this experience somehow helps, if i don't get any funding this year either then it'll really suck for me",
            "Not the one we wanted, but it's the one we needed.",
            "I got my rejection :(",
            "There are some things that I wish I had done, like contacting potential advisors, but overall I think I had a good application. I think it was just done to chance. Grad applications can be super competitive. I was applying for astronomy and I'd heard schools had between 10-20% acceptance rates which is an 11-35% of not getting accepted. It turns out, that year even the 20% schools were taking 5 applications out of 200 which is a 60% chance of getting rejected from all school. (Assuming each school has the same acceptance rate then doing (1-rate)\\^10). It's just hard.\n\nAnd even when I don't believe in myself, I can look to other people I know who got rejected from all their programs and realize how amazing they are and all of their good qualities, and say that theirs must have been by chance.\n\nGetting rejected is not a school saying no forever.",
            "Haha apparently they just don't tell you if you get rejected. One school responded and said they rejected me but couldn't give me feedback on my application because of how many there were and the other two just never said anything. Disheartening shit.",
            "Assholes.let them be",
            "Mine were either: You were a good fit but someone else was better, There were a lot of qualified applicants, or no reason.",
            "[deleted]",
            "Apparently this was the problem. The evaluation stated my degree was equivalent to 3 years in the US, which was the reason for denial.",
            "Hey wanting to know if you made it in!",
            "How are you doing now?",
            ":( sorry",
            "I’m applying to astronomy programs this year and hearing this is making me scared. I haven’t started connecting to potential advisors yet, is it too late?",
            "What the fuck is wrong with these monsters? just an automated email would do...",
            "Ah, okay, gotcha! I was like, well, it seems like you got some really good feedback on that post lol. My apologies. :D",
            "Not at all! This is a great time to start emailing potential advisors. You have at least 4-5 months before applications are due, so there's no rush to get everything done at once. For me, when I get scared about application stuff, it helps to do a little bit at a time and break it into chunks. That way you feel like you have control of the stuff you have control over, which makes the less controled stuff less scary (aka the eventual decisions). \n\nIt also helps with the scariness to talk to peers and mentors. And to remember all the work you've already done to get to the this point. \n\nI know people who got in on their first time applying and people (like me) that got in on their second time applying. Next year, I'll be going somewhere where I didn't get in the first time I applied. No matter what happens when you apply, it's not a reflection of your worth as a person or your potential to do good research. Things will work out even if they don't happen as you expected."
        ]
    },
    "I WANT TO BE THE GREATEST THIS WORLD HAS EVER SEEN": {
        "title": "I WANT TO BE THE GREATEST THIS WORLD HAS EVER SEEN",
        "score": 86,
        "url": "https://www.reddit.com/r/gradadmissions/comments/1dlf0na/i_want_to_be_the_greatest_this_world_has_ever_seen/",
        "content": "Been a long time lurker on this sub. This is not a typical grad admission post seeking out for help from fellow Redditors regarding which university or major is a better choice. It’s definitely fulfilling and heart-warming to see helpful people out there who give their two cents to the ones in trouble. This post is about me, and I really wish that anyone who is reading this gets something good out of it and does something beyond their limits.\n\nToday marks one of the most memorable days in my life. One must be wondering that this dude might have gotten into Harvard or Stanford, or this dude’s cracked. Well, neither, or maybe the latter depending on your level of tolerance. \n\nI applied to colleges just a couple of months back and I’m satisfied with the admits that I have but I’ve realised that a degree is not going to define me whatsoever. Nor is it going to give me an edge over others. My purpose and passion will. This cascades down to the mental awareness I have which further links to a lot of neurological effects. No matter whatever corner of the world I go to, I’m gonna put my best foot forward. Help people, add meaning to their lives and be the greatest of all time. \n\nTo the people applying to colleges, please remember why you’re doing it. In a world full of cyber-zombies, be the light and invent things which the world has never seen before. I want to gain respect of my loved ones and the people I help, which transcends the materialistic aspects. I want to take the lead. Sure wealth is important, but it wouldn’t be possible without having a meaning to your job. I’m gonna go work a 9-5, gain required skills, work the job that I despise without any complaints, not get irritated by that annoying coworker and later build an empire of my own. All of this will be worth the hustle while I can keep my mental health in check. I want to be the greatest the world has ever seen. ",
        "num_comments": 9,
        "comments": [
            "I need a discord server for all of us that are like this. It really is hard when 99% of people are the exact opposite. Yes, we all lead different lives and go through hard stuff (I've been through a lot, too), but no matter what life throws at you, let it motivate you even more 💪",
            "you rock! following the same path as well!!",
            "Let’s get it!!!",
            "Nice to see your motivation dude, ngl it's contagious \n\nHope you achieve your dreams and all future endeavours (unless they are unethical 👀)",
            "lets goo!!!!",
            "You can't",
            "Now imagine if we all banded together and made actual useful software tools that solve real world problems. Or simply a group of highly motivated folks who work for non profits across the world to make good tangible impact\n\nIf you guys ever make a discord server, sign me the fuck up",
            "Sign me up too",
            "The indomitable human spirit:"
        ]
    },
    "comments on cv for master of clin psych": {
        "title": "comments on cv for master of clin psych",
        "score": 3,
        "url": "https://www.reddit.com/gallery/1dlux6n",
        "content": "reposting bec the previous one had a lot of errors in the caption \n\nthis is the cv i used for my msw application, which has gotten me 1 out of 3 offers so far. i would also like to apply to a master of clinical psych program. what information do you think i should exclude and rearrange for my master of clin psych application? \n\nyour specific and general comments are very much needed and appreciated!! ",
        "num_comments": 2,
        "comments": [
            "I didn't see a lot of research experience in your profile. That might diminish your chances greatly, especially if you don't have a publication or a bachelor's thesis. Are you planning on getting more research experience?",
            "i have an undergrad thesis. my research experience are only mostly research papers in 3-4 subjects that i plan to specify on my statement of purpose. im not quite sure where to get a proper research experience where im from, but ive applied as an assistant college instructor in a nearby community college"
        ]
    },
    "Is it really easier for US applicants applying to US grad programs than internationals?": {
        "title": "Is it really easier for US applicants applying to US grad programs than internationals?",
        "score": 37,
        "url": "https://www.reddit.com/r/gradadmissions/comments/1dlc1tz/is_it_really_easier_for_us_applicants_applying_to/",
        "content": "I'm from the US and I'm having a hard time figuring out what schools to target because the programs I am interested are heavily international. I have talked to a few applicants/current students to get an idea of their profile/stats and see if I should bother applying to the program or if my profile doesn't stack up.\n\nI only have 3 people who I can get LoRs from, and I don't want to ask them for more than 8-10. Therefore, I was looking through the list of programs I am interested in and decided to not apply to more than 1 or 2 at top schools (M7 business schools)\n\nHowever, I have also heard from some people including my own family, who were former international Ph.D. students, that it is easier for US citizens who have US degrees to get into US grad programs. So they think I should apply to the top programs even if my profile isn't necessarily as good as some of the people I've talked to (who are international). Is this actually true, or would I be wasting application fees and letters of rec? I always thought that there was little to no bias against international applicants for grad programs.\n\nThanks for your advice!",
        "num_comments": 32,
        "comments": [
            "Of course it is easier for US residents. This is because you're a domestic resident, and possibly a taxpayer, hence entitled to opportunities before foreigners. However, this doesn't mean that your residency makes up for a mediocre or average profile. You're still required to be as competitive as the international candidates.",
            "Yes, it’s easier for US residents.\n\nAlso, you shouldn’t limit your applications due to your letter-writers. Just ask them to submit their letter to Interfolio, which can then forward the letter anywhere you want.",
            "Yes.  My PI is the head of the graduate committee at my university.  They had 250 international applicants this year.  Accepted 9.  Zero domestic applicants.  But my PI says the only requirement for entry for domestic students in my dept are a degree in chemical engineering and a pulse",
            "A lot of research funding from AFSOR AFRL DOD ARMY NAVY is all for US students only, which makes up a huge chunk of research funding for engineering and stem fields. Ive spoke with lab at Umich and cmu and they consistently struggle to find US national applicants for certain engineering grad programs.",
            "As others have said, there are certain scholarship/fellowship programs only open to US citizens which makes you far more desirable. Plus having education from a US school with a known reputation is less of a gamble than some international institutions. Some STEM programs get a lot of military funding for research and only US students can work on certain projects. I know at least one top 25 engineering program that will basicslly take any American with a pulse and engineering undergrad degree",
            "it is cheaper to fund a domestic student",
            "literally yes. always. usually like 10% of a cohort is reserved for international students, so while domestic students are fighting to get spots in a 50 person program perchance, the international students are fighting to be one of 5!!\n\nit you talk to an international student, they are almost always more qualified than a domestic student for the position. all of the international students in my PhD program have masters, at least a few years of work experience, and multiple publications (with some already having first author pubs before starting).\n\ni came in with no publications, a bachelor‘s degree, a couple years of undergraduate research, and vibes.\n\nasking domestic students for what their CV looked like when entering will give you a much better idea.",
            "I would focus on a range of schools based on your academic profile (that does not include citizenship status) and the academic profile of the students that typically get admitted.",
            "Generally, but not always. My PhD program in the U.S. is a little more than 50% international students. But it’s in the humanities, where languages / regional studies are a large part of the cirrulum.",
            "I'm trying to help my student from the US get into a masters program in the EU. If they stayed in the US, I could get them into a top 20 university for grad school with a phone call.  I don't know how to dial international much less know anyone there.",
            "Significantly \n\nUnless you're from an underrepresented country then it depends",
            "Yes, it is",
            "Yes. I applied to a STEM program that had an in- person interview session which I could not attend due to being an international. Also, some research grants are specifically for domestic students.",
            "I know this is a genuine question, but as an international student this actually pisses me off so bad. Yall have no idea how much advantage u got over us when applying to schools, getting jobs, etc.",
            "Yes",
            "I’m applying again this fall and I asked my writers to submit my forms via portal, is interfolio a platform that can do this???? I have no idea lol would you mind explaining?",
            "i assume it's a chem engineering program?",
            "Such as? Genuinely curious.",
            "ngl this is actually sad but a nation can do whatever it wants with its money and it should absolutely prioritize its own citizen. \n\nWhats sad here i think is a average person from NA or EU will have 100's of more opportunity than someone from Nigeria or India.",
            "Your country would have preferential treatment for citizens too. It's YOUR country, after all. Why would you expect the US to be different?",
            "Stay mad or go get a PhD in your country.  Don't expect us to roll out the red carpet or anything when you are a guest here",
            "Interfolio is a portal some universities list their job postings in directly. It can accept letters, and can either apply them to job postings it has internally, or can send them to job postings in other platforms, or email to specified email addresses.\n\nFor your purposes, it could just be a place to hold recommendation letters and send them out as desired without bothering the original letter writer.",
            "Indeed.  The job market is currently too hot in the US for many domestic applicants",
            "Some thermal fluids like hypersonic and material sciences related to that application , a lot of renewable energy research like wave energy is funded by the Navy. Material science research and semiconductor research can also protected. Lots of niche biomedical research the army is interested in as well. Anything with DARPA funding thru a university likely also has strings attached to it.",
            "Oh look who’s mad, throwing immigrant hate comments. Though it sounds about right coming from a citizen of a country that calls foreigners nonresident aliens. I’m already in gradschool, so cry somewhere else.",
            "OP mentioned business schools. Interfolio is not used for there. At all. His LoRs will have to be manually submitted at every school he applies, and most ask questions besides a letter (like, tell us about a time you gave OP constuctive feedback) Interfolio is usually more for PhDs and the odd masters degree.",
            "Neat. I don’t have an engineering or science background as my name suggests. Nor do I have the academic credentials to get into these graduate programs.",
            "I'm not throwing immigrant hate.  Allocating resources for citizens is pretty standard in nearly every country in the world.  I wouldn't go to your country and expect equal opportunity as it's citizens, especially on a guest visa.  It's a ridiculous sentiment.",
            "Thats fair, i think outside of engineering and some stem fields its kind of a non issue to run into us nationals only funding.",
            "You literally said go back to my country lmfao bro doesn’t know what he’s talking about.",
            "I never said go back to your country.  Ever."
        ]
    },
    "First Generation Student Graduating Next Year, I'm So Lost": {
        "title": "First Generation Student Graduating Next Year, I'm So Lost",
        "score": 8,
        "url": "https://www.reddit.com/r/gradadmissions/comments/1dllpbj/first_generation_student_graduating_next_year_im/",
        "content": "I have one year left in my forensic anthropology undergrad program and I need to make the most of it to hopefully get into grad school. My current GPA is a 2.7, which I know isn't great, but I still have time to make it better than it is. I also don't have any research experience, although I will have some opportunities this upcoming year at my school that I plan on taking advantage of. That being said, I'm currently working on a small project with a faculty member in my department, and I have an extensive volunteer history. \n\nAs I stated before, I'm a first gen student and I kind of have no idea how to navigate this. I've found some schools that I'm interested in, but I'm not sure where to go from there. I also have no clue what the \"timeline\" is for getting things ready and completed in the process besides the due dates that are listed for the schools I've looked at. \n\nI guess I'm looking for advice on two things: \n\n1.) Are there any other measures I should be taking to make myself more competitive for applications? \n\n2.) What is the general timeline and steps I have to take to submit my applications successfully? Are there any other major steps I have to take besides the applications themselves? \n\nAny advice is welcomed and appreciated. I've been stressing about this for a while now and I could really use a guiding hand.",
        "num_comments": 2,
        "comments": [
            "1. Retaking classes, getting excellent grades in your remaining classes. You need to identify where you went wrong before and make real changes. \n2. Get as much relevant experience as you can.",
            "Thank you, this is great advice. I already plan on retaking two of the classes I struggled with and I'm hoping I can squeeze in one more. Unfortunately a few semesters ago I had some complications with my disability that made my grades really slip, so now I'm playing catch up.\n\nI'm also gonna see if I can volunteer at one of the museums nearby for the rest of the summer, that's an easy way to get some experience. I'll keep an eye out for other opportunities too."
        ]
    }
}