{
    "Regarding Female Space Marine posts on Grimdank": {
        "title": "Regarding Female Space Marine posts on Grimdank",
        "score": 2118,
        "url": "https://www.reddit.com/r/Grimdank/comments/10w7usq/regarding_female_space_marine_posts_on_grimdank/",
        "content": "Grimdank has always and will be a sub for sharing of the dankest Warhammer, 40K, AOS and other tabletop memes, Jokes and other forms of media. The mod team strongly believes in the freedom of expression of all the voices that contribute and bring this wonderful hobby of ours together.\n\nHowever, there is a recent rise in drama-baiting using a specific topic of female space marines, which then in turn results in more flame wars and other drama.  **We believe that these posts contribute nothing (not even a laugh) and serves no purpose other than to stir up drama in this sub-reddit. And to be frank, this topic has been well discussed and the proverbial dead horse well and truly beaten.**\n\nDue to the above reasons, moving forward all female space marine posts (Specifically posts that reference female space marine, this does not include Femboy posts, transfem meme etc) **will be considered as Malicious trolling and removed as part of rule 7. Depending on the severity of the post the user can face a ban.**\n\n&#x200B;\n\n\\- Grimdank Mod Team.",
        "num_comments": 0,
        "comments": []
    },
    "people keep saying why don't we put the emperor in a dreadnought or hook him up to a titan. I say we hook him up to the main terra defence grid ": {
        "title": "people keep saying why don't we put the emperor in a dreadnought or hook him up to a titan. I say we hook him up to the main terra defence grid ",
        "score": 1245,
        "url": "https://www.reddit.com/gallery/1dlkmj2",
        "content": "",
        "num_comments": 69,
        "comments": [
            "What's the point of- \n\n(*Flips over to your second picture*) \n\nWell, here's my money.",
            "I’d crack a joke, but I’m not sure whether to compare Unicron to a C’tan or a Chaos God. He kind of fits both depending on the continuity.",
            "“Sir- we CANT move the Emperor off the throne.”\n\n“Then move the throne.”\n\n“Sir- we CANT move the thrown offworld.”\n\n“Then move the planet.”\n\n“Sir- we… huh… that might work.”",
            "But a bunch of rockets and warp drives on terra, loads of weapons and make big E control it. Space ship emps",
            "I fully support Big Empicron",
            "Then I already have a BIG E figure!\n\nhttps://preview.redd.it/wqwn52g2v18d1.jpeg?width=2280&format=pjpg&auto=webp&s=b730ff0f7114168d26b484b216789e2378ccbdde",
            "You will get a cease and desist from the necrons",
            "Why not do the 2nd thing and turn Terra into  phalanx 2.0 and he can go on a greater crusade and bring the fight to the eye of terror.",
            "https://www.reddit.com/r/ImaginaryWarhammer/comments/p0wbvk/based_on_a_4chan_joke_about_terra_being_actually/\n\nWe have thought of this before",
            "My brother/sister in Imperial glory, He is already hooked up to the GALACTIC defense grid. That's what the golden throne is. It amplifies His psychic power across the imperium and enables Him to assist when a human prays & acts in His name.\n\nI'm really not trying to be a dick here but if this post isn't a troll it's a massive fuckin woosh.",
            "That's the lighthouse everyone uses to navigate the dimension that wants to eat, f**ck, kill you... Is it wise to move that...?\n\nThis smells like something Tzeench would come up with...",
            "Isn’t the Astronomicon technically part of the Terra Defense Grid, ever since a certain one-eyed, red-skinned psyker barged through the warp via the webway, and turned that project into a warp rift? Malcador and later Emps have to sit on the Golden Throne just to keep the backflow from happening.",
            "Unless the Dreadnought kills him as fast as the Golden Throne, it won't work.\n\nSo we're going to have to get HERETICAL about this",
            "Unicron but somehow he's less of a dick",
            "U-u-u.. ..unicron....\n\n![gif](giphy|3240pzelRQkjj9XaiK)",
            "Are you going to credit the artist?",
            "By the Emperor, imagine the price listing!",
            "Gork and Mork approve of this plan. Are currently whipping up the biggest WAAAAAAAGGGGGHH ever to make sure it happens. \n\nSeems like \"A ROIGHT GUD FOIGHT\".",
            "With Big E level of psyker anyone within the solar system with even a thought of going to chaos will be evaporated.",
            "\"YOU GOT THE TOUCH, YOU GOT THE POWER!!! YEEEEAAAAAAHHH!!!\"",
            "He is already hook up in the main terra defence grid",
            "+++we call it the Universal Control Reactive Operator Nexus or short the Uni-CRON+++",
            "***YOU'VE GOT THE TOUCH!***\n\n\n\n# YOU'VE GOT THE POWER!",
            "Imperial Palace Titan\n\nOR\n\nSomething like the Dark Angel's Shard but it's the chunk of Terra with the Palace and the Hollow Mountain in it that gets charioted into the Eye or something",
            "Bros already hooked up to the highway lanes lol",
            "Unicremporer? Empicron?",
            "Is that not what girlymans new armour was? A mobile golden throne, but it was just created too late",
            "Or what you could do is make a machine that keeps the warp rift closed without needing the Big E, or one that seals it permanently (some Necron tech can probably do that, they nearly closed the Eye of Terror)\n\nWith the burden taken off Big E, his perpetual-ness will allow him to start healing, hopefully",
            "On the subject of Big E in the Dreddie, I remember there being a printable model of that…\n\nGoes **stupid** hard, and is one of the models I’d print if I get my hands on a resin printer",
            "reminds me of toys and a program I had as a kid - War Planets and Shadow Raiders\n\nhttps://youtu.be/7TfF3TUFNE8?t=70\n\nExcept, more golden and more dakka.",
            "Isn't he the only thing keeping the Asrtronomnicon working? Well that and the 1000 rogue psychers a day that are sacrificed.",
            "100% one of the forge worlds has this and refuses to talk about it because no way a tech priest would spill the beans of a battle planet",
            "Honestly a fan fiction where terra is lost and the emperor is put into a giant craft world style ship would be dope",
            "Where’s my model?\n    \nBitch, you’re playing on it.",
            "Thank you, i was real confused what this post was saying till finally swiping right",
            "Fun fact, all Unicron from all continuities are the same dude. There's only one and he's multiversal",
            "The eldritch madness & realspace influence of a C'tan, & all the malice of the Chaos Gods jacked up to a billion. Ayep, he fits.\n\nDo you think he represents Hate, or Silence? Chaos is no question (as in Greek \"gnawing at the edge of reality\"), but he does fit both.",
            "His nickname is The Chaos Bringer btw.",
            "That isn't as far fetched as you thought. The AdMech has stolen some tp techs from the orkz, that doesn't just move but teleport entire planet.",
            "og unicron trilogy or the haslab one?",
            "Damn, I think I still have that in ball form under my childhood bed at my parent's house.",
            "It's possible Webway gates cannot be moved from their locations once created, or that attempting to move the one in the Imperial Palace specifically will re-open the tear that Magnus made and the Warp will inatantly swallow humanity's cradle.",
            "This is the greatest thing I've ever seen",
            "The joke is that a fortress planet is a better battlesuit than dreadnought armor.. by a lot",
            "I think OP is suggesting turning Holy Terra into The Emperor new body",
            "The Golden Throne is breaking because it's increasingly failing to hold him back. Our best man will make things right, just you see.",
            "I remember that show.\n\nThe planet in the OP’s picture is Unicron, the OG battle planet from transformers (1984) when I was a kid",
            "Dude, so much resin.",
            "We've gone from tabletop to larping",
            "The model for the earth made to scale with a Warhammer mini would be about 236 miles in diameter, about 2.5 times the size of the Death Star.",
            "He *was* multiversal, they had an arc in the comics where all of the connections were broken and not everything is linked to one another",
            "Unicron is.",
            "unicron is canonically Evil itself, hes not a represantation, hes not an avatar of it, hes not an embodiment.\n\n  \nEvil as in the concept is Unicron itself",
            "Destruction. Unicrons desire is to destroy every single reality. ",
            "Didn't they teleport Armageddon? Or was it Ullanor, which became Armageddon?",
            "Graia manufactorum complex canonically can space and warp travel to another planet.",
            "This is the OG Armada one. It's only missing a few pieces.",
            "Web way gates have to be movable though as Terra is actively being hurled through space meaning the gates location is always changing. \n\nUnless Big E stopped all of Sol from moving in which case that WOULD be a very Big E thing to do.",
            "Aww fuck, I wooshed then didn't I?",
            "Always has been.",
            "Well the main one would still be multi/extraversal no?  Since he still exists outside the main multiverse. Like Darkseid kind of. His avatars are just now independent",
            "Ullanor became armageddon.",
            "Only because the Graian Crown is a big ass Space Station. ",
            "Well, maybe the heavenly movements are just an integral part of how warp portals function or channel energy, did you think about that, Mr Smarty-pants?",
            "I didn't forget about the movement of the planet, sun, Sol system, and Milky Way galaxy. I'm sure the hyper-intelligent toadmen didn't either.",
            "All I know is, given the option, I’d ride a planet into battle",
            "I don't think that's how it works, from my understanding, unicron and primus aren't beings of higher dimensions with avatars in each universe, originality each continuity had its own unicron, then it was stated to all the same same guy as a multiversal singularity. And now each unicron in each continuity and dimension is its own unique being with no connection to other dimension versions of unicron",
            "If you worship Slaanesh hard enough the planet rides YOU",
            "Rocky start, solid recovery and absolutely stuck the landing."
        ]
    },
    "But hey that just a Gaaaaaammmme Theory": {
        "title": "But hey that just a Gaaaaaammmme Theory",
        "score": 968,
        "url": "https://i.redd.it/t2w7kw03218d1.png",
        "content": "GW might be coming up with something ",
        "num_comments": 55,
        "comments": [
            "The updates to the Codex Astartes following Rowboat Girlyman’s resurrection allow for multiple captains in the same company in certain situations. \n\nAdditionally, the First Company is implied to have had a pretty rough time on Oghram, so it’s possible the captain deployed there was killed and replaced. \n\nIt’s also possible that Mr. Roboto Gorrillaman simply gave one of his captains terminator armor as a reward for good service. \n\nAll of this is pointless conjecture, however. The true answer is that he is Alpharius. (This is a lie.)",
            "There can be only one 1st Company captain, but other Captains may have had Terminator honours from induction into the 1st prior to becoming Captains - and so can still requisition the armour.  \nOr the Ultramarines have loads of spare suits since the 1st company are professional redshirts.  \nOne or the other.",
            "It’s the guy on the right obviously.\n\nGuilliman is blonde, Alpharius/Omegon are bald.\n\nIn the grim darkness of the 41st millennium, all bald guys are evil.",
            "If I’m not mistaken Captains of any company can have Terminator Armour/Honours.",
            "The guy on the right is left handed.",
            "My fourth company captain has termie armour so checkmate, “Alpharius”",
            "They’re the same dude.\n\nThey both have versions of Captain Agemman’s Red and white checkered heraldry.\n\nThey’re two versions of the same person.",
            "Other companies can have Terminator armor, it's just that it's highly unlikely those other companies will reach the heroic feats required to earn it.",
            "my head canon is that captains can wear whatever armor they feel like, regardless of company, i assume that all captains have the right to wear terminator armor, it would be a bit weird if they didn't.\n\nhowever there have been well more then 10 ultramarine captains depicted since the introduction of primaris marines: 10 currently available (uriel ventris, primaris capt, gravis capt, gravis capt with bolt rifle, capt with relic shield, jump capt, phobos capt, pushfit termie capt, termie capt, company heroes capt), 1 in a blind bag (space marine heroes series 4 capt), 1 no longer available (dark imperium gravis capt), and two promotional (2017 store anniversary capt, imperium magazine capt). \n\nmeaning there have been 14 captains of the ultramarines since the indomitus crusade. which it seems totally reasonable that the ultramarines would have lost 4 captains considering how many conflicts they participate in.",
            "\"Only first company can have terminator armor\" is not a rule on the codex astartes, nor anywhere else. It's just that a chapter barely have enough terminator armor to outfit their first company with them, if even that. But of course a captain of another company who wants one gets one, they are among the most honored and skilled warriors of the chapter.",
            "The 20th what?",
            " Being a \"veteran\" isn't limited to the first company, being in the first company is limited to veterans. On earning the crux terminatus you probably serve in the 1st for a while but you don't necessarily stay there forever. The chapter could decide your skills are more useful elsewhere or because it's a mark of reaching a certain standard of skill maybe you end up with over 100. This is why there's veteran sergeants and before primaris added demi companies that was where most captain candidates came from. Lieutenants probably increasingly will be veterans too, veteran sergeants are are probably where most new ones will come from. \n\nWhose dick would you have to suck to have not been awarded the Crux Terminatus for valour but be the chapter's senior leadership?",
            "Terminator armor is not reserved for the first company, is reserved gor veterans, and all oficers in the Space Marine army are veterans, therefore it isbpossible for various captains in Terminator armor",
            "i like to think that the captain from the leviathan box (aka, the cool mini) is severus agemann\n\nthe other? i dont mind XD",
            "I guess they split up the company in different groups and  whoever is leading that group is the capitain.\n\nAlso, of they're not named it explains everything",
            "Where is the model on the right even from?",
            "Well the model on the left has been confirmed as being Agemman, but not with a new datasheet",
            "They’re the same guy in the slightly alternate universes sustained by each players collection.",
            "Terminator armour has always bothered me because, what are you going to do if a bug or something crawls in next to your head? Your arms don’t have the mobility and your hands are too big to squeeze into the gap anyway. You can’t even get a battle brother to help because their massive gauntlets are too big as well.",
            "imma just say that space marines players are so spoiled they get to have literally the same unit with the weapons in the opposite arms",
            "Though it is usually reserved for the first company, terminator rights are something that can be earned for use as needed, and captains are also often given the option to wear it as many are former 1st company members and generally they are the most important marines in a given conflict and may decide they need more survivability over speed. This can also apply to specialists. Also just as a fun fact, in many chapters, the 1st is so valuable that they rarely fight in a single unit and are often split up and seconded to other companies to support them, that's why you'll often see terminators, Vanguard veterans and sternguard veterans fighting along side more standard units, under \"lower\" captains.",
            "Anyone with terminator honors can wear the armor. Majority of marines in a given chapter with terminator honors are in the first company OR various command staffs in the chapter.",
            "HE IS ALPHARIUS",
            "Of course it’s a lie. Alpharius is dead. This is Omegon.",
            "So if there can be multiple captains why don't they give muh boi Titus back his rank?",
            "In what situations can one company have multiple captains?",
            "Is there a list or something i can read up on, on all the changes Robbie G made to the codex?",
            "Imagine if that captain goes up to guilliman in private, and than just goes “hello brother”, and it turns out he’s Omegon.",
            "As the first company contains most the chapters veterans it’s highly likely almost all company captains have served in the the 1st company before being given command.",
            "And Vulkan?",
            "This is correct.  Most but not all company captains in a Codex compliant chapter have at one point served in the first company and earned their Crux Terminatus.  If they have, they can wear Terminator plate.  The captain of the Blood Angels Third company wears it and with some space vampire based exceptions they stick to the codex pretty closely.",
            "No, the guy on the left is right handed.",
            "May not even be lost captains - they could just get promoted up and someone else fills the gap.",
            "Exactly, don’t even acknowledge their existence. ",
            "He has literally Agemann's personal heraldry. So he probably is. ",
            "^(>!This is a lie.!<)",
            "No it waa Omegon who died. Alpharius survived.",
            "If I had to guess during a crusade they’d promote a couple more captains to accommodate the extra marines",
            "I think also a captain (who is usually a veteran with terminator honours) could possibly take their suit with them when they lead another company",
            "not captains but black templar marshals can originate form the same \"company\" every crusade is lead by a marshal so if one force generates more than one crusade at a time (usually the way a crusade ends is declaring a few new ones to embark on) each new force will have a marshal but the black templars use the codex astartes as toilet paper.",
            "Child immolator",
            "He's the exception.",
            "Vulkan actually has hair, it’s just too beautiful for us mortals to behold.",
            "Shaves his head. He isn't naturally bald.",
            "And one of them speaks the Truth!",
            "i'm painting mine as agemann anyway",
            "The user above me is lying.\n\nI am lying about the above and below statements.\n\nThe above statement is truthful.\n\nHydra Dominatus.",
            "Of course he did. I'm right here...",
            "It would catch fire in the forge.",
            "… I can’t do it, but I was trying to think of an elaborate set up of the whole logic puzzle, where you tricked them into revealing which one is which, but it was actually just me trying to date, identical twins, but I’m too high and I couldn’t think of it.\n\n🫡",
            "The other is incapable of lies.\n\nI have tried using puzzles, and players are awful at solving them.",
            "*Muffled gasmask noises* all of the above",
            "Uh… I’m Spartacus?",
            "Blessed is the snout unable to express doubt"
        ]
    },
    "HIS COMING WAS FORETOLD": {
        "title": "HIS COMING WAS FORETOLD",
        "score": 2864,
        "url": "https://www.reddit.com/gallery/1dlb91s",
        "content": "",
        "num_comments": 57,
        "comments": [
            "LISAN AL-GAIB\n\n![gif](giphy|UJG2T7uZeJuZCLitY8)",
            "Somebody should make an inflatable Greater Unclean One punching bag",
            "Rejoice! Plague be upon ye!",
            "LETS GOOO. Instant buy and will be seated next to his brothers on the chair of chaos in my living room. (The cats chair they use as a perch)",
            "https://preview.redd.it/c8z2nurzvz7d1.jpeg?width=920&format=pjpg&auto=webp&s=9c3c2685c53e0b8c918a32f0652d85d93f84286d\n\nIf u wanna get pedantic Boltgun just straight up took his design from the one on the base of the Plague Marine Champion.",
            "Now let's do a Credo mini.",
            "now I never was intersted in plushies but I sure as hell getting this one",
            "I'd buy it just to throw and call Chaos Filth",
            "I am not ashamed to say I bought two of the last wave. Will definitely get this one too!",
            "When is he coming out",
            "PRAISE HIM, THE CHAOS FILTH",
            "I buy my wife plushies all the time and the theme is that it’s always been from a video game every time.  I don’t know about you boys but I think this counts.",
            "Sassy Dave!!!",
            "Someone get Rogue Hobbies on the phone.\n\n>!The joke is she loves the sassy nurgling.!<",
            "Lewdfang Daemonette plushie when?\n\nhttps://preview.redd.it/t4x1i9p8uz7d1.jpeg?width=862&format=pjpg&auto=webp&s=e33eebf70e3cfef080fdf1bb62901b0846fa0596",
            "Blessed be the rot!",
            "Ah fuck... the chubby cute bundle of filth is gonna clean out the wallet when he drops I just know it.",
            "Important question: is he small enough to proxy a Great Unclean One on the tabletop?",
            "https://i.redd.it/1oagnlci718d1.gif",
            "https://preview.redd.it/08fvwadik38d1.jpeg?width=1440&format=pjpg&auto=webp&s=2efa7e31481dde0ec6ef578f70077aad3b8667f7",
            "[removed]",
            "There's also a Little Unclean One, a chibified Great Unclean One. As soon as I saw the Little Unclean One my heart melted in joy. And now I know that my Little Unclean One needs a friend, and the friend is there.",
            "Let's be real. You hit Taunt by accident trying to reload and you're actually about to run away from that nurgling (and his dozen mates), until you can find some high ground to jump up on like a woman fleeing a mouse in an old cartoon. Then once you're safe up there you'll get to work with your good old shotty.",
            "I hate the nurglings in bolt gun. Those fuckers have aimbots. They just little by little take down your health so you sre completly fucked once you reach the bosses. They even prefire before you turn corners!",
            "Klonk plush when ?",
            "LISAN NUR-GLING!!",
            "NISSAN AL-TIMA",
            "As it was written!",
            "**AS WRITTEN**",
            "No, a bean bag, those ones that you sit on, like the Snorlax ones",
            "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^Bromjunaar_20:\n\n*Somebody should make*\n\n*An inflatable Greater*\n\n*Unclean One punching bag*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
            "https://preview.redd.it/6r09visfr08d1.jpeg?width=1197&format=pjpg&auto=webp&s=a63a1e37be3358323620610df7dc4509fadf09f6",
            "All hail the Plague father!",
            "A fine addition to their chaos realm",
            "On one hand: one of the worst value kits GW has ever made. $35 USD for an 18 point model that needs at least 4 other Plague Marines to be fielded, while a box of 7 can make the same loadout + 6 additional dudes for significantly less than double the price. They are obviously fucking you and think you’re a moron easily parted from their money, if you buy this from them.\n\nOn the other hand: sassy nurgling.\n\n…damn. Those marketing execs are good.",
            "Every enemy in boltgun is just a GW model that’s been pixelized, so yeah",
            "They didn't 'take' the design, it's stop motion photographs of that mini, same as the original Doom did it with clay models.",
            "I'm picturing American psycho gif. \"Very nice. Now let's see Credo's mini\"",
            "\"later this year\"\nnothing else has been specified in the article",
            "He was in boltgun so it counts.",
            "I heard about that from Vince when he tried out her pro acryl paint set.",
            "Due to issues with botting and ban evasion, we are restricting fresh accounts from commenting/posting. DO NOT contact the moderation team to ask for these restriction to be removed for you unless you are a comics artist or equivalent trying to post your own original content here. Obviously photoshop memes don't count. DO NOT ask us what the thresholds are, for obvious reasons we won't answer that.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Grimdank) if you have any questions or concerns.*",
            "You understand my pain but also fuck those plasma gunners and the ducking aspiring champions can get quacked too.",
            "He's not the Lisan al-Ghaib, he's a very naughty boy!",
            "NISSAN KICKS!",
            "Good bot",
            "https://preview.redd.it/6eb1ut7au08d1.jpeg?width=786&format=pjpg&auto=webp&s=a99faa890c9fa6d9560bfc8a91d48bedd4919d79",
            "Correct",
            "https://preview.redd.it/liew6bxgi28d1.png?width=828&format=pjpg&auto=webp&s=bde76c20baae4d7c91d4c64833c9304401d419c1",
            "> one of the worst value kits GW has ever made\n\nI bet most people legitimately buy the kit for the Sassy Nurgling. >!Like me.!<",
            "NGL I have enough paints but I watched the episode about her pro acryl set and...they look really good, they do.",
            "You're a Sternguard Veteran! Go and fuck them up yourself!",
            "Good bot",
            "https://preview.redd.it/1ors42h5s18d1.png?width=418&format=png&auto=webp&s=b5ad33e12714472092eab55d68bbc17ed5f84314",
            "“Whoa, new Nurgling sculpts???” and then immediately spending disproportionate amounts of money is an extremely relatable feeling amongst all Nurgle players. >!I can also confirm from personal experience.!<",
            "Saw the video she made about her own set, it’s nice that you can use it to make any kind of color but I already got 10 browns, gonna go up to 11 next week since I’ll be buying two thin coat’s version of doombull brown, think I got at least my brown tones covered, but that ultramarine blue, orange red, the green, damn are those some vibrant colors.",
            "Are you sure about that? Because I am 99.91277% sure that Ur_fav_Cryptek is not a bot.\n\n---\n\n^(I am a neural network being trained to detect spammers | Summon me with !isbot <username> |) ^(/r/spambotdetector |) [^(Optout)](https://www.reddit.com/message/compose?to=whynotcollegeboard&subject=!optout&message=!optout) ^(|) [^(Original Github)](https://github.com/SM-Wistful/BotDetection-Algorithm)"
        ]
    },
    "Turns out being neglected and forgotten has its perks.": {
        "title": "Turns out being neglected and forgotten has its perks.",
        "score": 3802,
        "url": "https://i.redd.it/56n28kow3y7d1.png",
        "content": "",
        "num_comments": 79,
        "comments": [
            "Oh, fr? How'd Drukhari get indirect buffs? I've only seen the point changes. I mean, I've seen the rules changes but I don't know how it'd affect them.",
            "Explain",
            "*WHAT , XENOS BEAT MARINES? NEERF THEM*",
            ">me having bought a drukhari army last week",
            "For clarification: \n\nOur vehicles all have bases so we can all pivot for free, getting some extra distance.\n\nArchon's Vect (the ability that increases command point cost) ability got replaced with a better version, meaning that its now a 12 inch aura and no longer requires him to be a Warlord, meaning multiple of them can cover a huge part of the field.\n\nHeroic Intervention is now 1 CP, which makes it dangerous to charge when Lelith is around.",
            "deets OP, give us the deets",
            "Come on give an explanation",
            "Blood Angels feel you bro.",
            "The coloration here made me think of Vivec long enough I got confused by the title",
            "I think this is exactly why Eldar armies as whole have a history of being overpowered. GW literally forgets about us and assigns their worst teams to create our rules, which results in undertuned abilities that interact with the rest of the game strangely.",
            "We are talking about the current edition.,are we ? the same thing happened in 4-5th edition. The deja-vu ist strong.",
            "Ignore me harder GeeDaddy 😩",
            "Talking of Vect, why does he not have rules anymore. When was he removed? I believe he is alove as a dark muse? Also, didnt Malys have a model and rules?",
            "I do still hope they get less neglected and get some nice new models this edition",
            "Not for the first time then",
            "So I've never had the money to get into the table top game. If a faction doesn't have a released codex yet do you play with the most recent version of the rules for your faction? Ex using 9th edition rules for a faction that hasn't had a release in 10th",
            "admech player sitting in the corner crying right now",
            "Our vehicles all have bases so we can all pivot for free, getting some extra distance.\n\nArchon's Vect (the ability that increases command point cost) ability got replaced with a better version, meaning that its now a 12 inch aura and no longer requires him to be a Warlord, meaning multiple of them can cover a huge part of the field.\n\nHeroic Intervention is now 1 CP, which makes it dangerous to charge when Lelith is around.",
            "Not OP, but I think he is talking about the new pivot rules. Because their vehicles have round bases, they have 0 pivot cost if they are side on a target the can pivot for free and then move meaning they get 1-2 inch of extra move.",
            "Triple vect auras are super powerful.",
            "Pretty much every Xenos army beats marines lol",
            "You must be new around here if you think Xenos beating Marines is new lmao",
            "Welcome to the Dark City.",
            "I would have imagined that if you have a base, you measure from the base. Though, RAW for movement it seems like you're right.",
            "I remember being sad when we lost our free pivoting. Finally things are back to normal!",
            "Yes but sometimes they get changes in the meantime, for example we got new rules regarding detachment (basicly army rules) at the early 10th edition, Skysplinter Assault.\n\nIn this case it wasn't really Drukhari specific but general core rules that were changed.",
            "Nah man, we good",
            "I play Admech too, we got some big changes coming, we hit far more consistantly now, leading to more damage. They also increased unit cost so we arent that hordey anymore.",
            "Heroic Intervention dropping in price is great. I know everyone was happy about the improvement Drukhari got from the second detachment, but I miss my murder elves jumping units my opponent thought weren't going to get charged this turn.\n\nThanks for the write-up!",
            "I really don't expect the first two to last. It seems like the intent for \"round\" bases caveat was for vehicle keyword models like dreadnoughts and dunecrawlers who rely on their bases to measure everything to not be penalized when pivoting. It really doesn't make sense for something like a raider getting a free pivot while a custodes grav tank doesn't because their base is an oval.",
            "Does the new Vect rule also work on Counter Offensive, bumping it to 3CP and making it super hard to use against us for combat armies?",
            "Less bring it down from those vehicles too. \n\nAs a DG player I'm jealous, it's obvious that they didn't give our index any serious thought because they left a rule in that has been removed elsewhere but we just got nerfed on points (very slightly) and quite significantly by the changes to secondaries. 1CP heroic intervention might be good on a slow army with access to fights first though. Hmm. \n\nDrukhari were actually winning a lot of games (higher WR and ratio of tournament wins than average). Maybe now though it won't be mostly because of 2 or 3 people.",
            "Correct this change affects Drukhari more than most if not anyone else, also the new Vect rules buffs the hell out of our archon, especially if you run multiple of them.\n\nHeroic intervention being 1 CP makes Lelith even more dangerous too.",
            "Not a deldar player but that seems very very lore appropriate for eldar",
            "Common drukhari W",
            "Thats sorta flavorful, right? Kinda expect Drukhari to be pretty darn agile",
            "So Drukhari are drift kings now?",
            "I don't think triple Vect works. Archon's ability specifies it has to be your warlord, so only one Archon with 12\"+1 CP aura unless they change it or neft points to 95 or so.",
            "The winrates are fairly innacurate as space marines have lots more players than everyone else and especially lots more new players",
            "Specifically vehicles with bases measure from the hull or the base, whichever is closest. But pivots are determined by if you have a round base or not. So Drukhari boats get the best of both worlds, a free pivot and a super long and thin hull that let's them get 2-3\" free movement just by turning",
            "Lore-wise I feel like it does though. Drukhari vehicles are both blindingly fast and extremely nimble. It's like their whole thing since they specialize in lightning raids in those vehicles and use them as weapons. The vehicles would have to be extremely responsive to skewer victims to take back to Commoragh. Plus the tech of a ~60 million year old civilization should be better than a 12,000 year old one.",
            "As far as i know it does since it affects all strategems if i read it correctly, i might be wrong though and i hope GW launches an FAQ about it.",
            "New vect rules? Did I miss something?",
            "Why do I hear Eurobeat in the distance?",
            "White scars players sad in the distance",
            "they used to call them the drift king",
            "It does, the balance dataslate specifically mentions that the new rule replaces the old ones entirely, not change them, therefore the Warlord requirement is dropped.\n\nI think it was an oversight on GWs part because they forgot about us (like most of the time), now they have to deal with our bullshit in the meantime.",
            "The dataslate says that the old ability is replaced with the new one, not that the existing one is changed. So no warlord requirement",
            "Aura abilities from auras of the same name don’t stack as a part of the core rules I thought.",
            "Most Marine army win rates are sitting at low to mid 40's. Xenos meanwhile (with the exception of Tau and GSC) are either at high 40's or low 50's. So yeah, no Xenos are beating out Marines lol. Marines usually get beat out every edition, and 10th is no exception",
            "Without even looking through the lore to refresh my memory, I'd bet good money that \"inertial dampeners\" or some other such name for technology that contemptuously and repeatedly breaks Newton's First Law has made a showing of itself in some Space Elf Codex or another.\n\nOr it could just be [Reaction Control Systems,](https://en.wikipedia.org/wiki/Reaction_control_system) but darker and Elfier.",
            "Vect is now a 12\" aura making all strats 1 cp more",
            "You are correct, no Warlord requirement raw, but can anyone else spam these abilities? I know Callidus and Swarmlord are epic heroes and much more expensive. I expect a FAQs about this being once per and pivots applying to flying bases.",
            "It's not about stacking, it's about coverage. Three 12\" bubbles cover three times as much space as one 12\" bubble.",
            "They dont stack but you can use multiple auras of the same type and spread them out acting as 3 seperate ones.",
            "Ig it’s balanced out by them getting all of the lore, models, marketing, getting their subfactions as codexes etc",
            "I am no player but I do remember that the top of the bracket for 10th were Necron and Tson during the early tournament.\nI have not followed evolution since",
            "ive had a conspiracy theory for a long time that GW keeps marines beatable for long periods of time on purpose to encourage new players to start a second army. tons of new folks start with marines so if they play for six or so months and they're marines stop winning reliably... chances are decent they either back off or start a second army.",
            "What is Vect? I tried finding it in the app, but nothing came up?",
            "Not that i can think of right now since most are epic heros. But yeah i expect one too and it probably will not last for that long.",
            "Watchmaster in deathwatch is the only other generic  character that does it",
            "I agree that they are the primary focus for lore and marketing, but it is hard to deny that xenos and non-space marine armies aren't starting to get more and more love in terms of models. No they're not comparable to space marine bloat (though that bloat is shrinking more and more each edition), we've got a huge model refresh for Necrons in 9th and Tyranids in 10th, and hell a shit ton of new models for Tau recently. Honestly the only xenos army that really isn't getting much \"love\" in terms of new or refreshed models are the Aeldari.",
            "IS is also the coolest faction with the hottest women and most beer.",
            "Would argue you that they get about as much lore as everyone else. But feel free to keep hating Space Marines man, you do you lol",
            "Nickname for any ability that increases the cost of an opponents stratagems.",
            "\\*Drukhari - Craftworlds got a release, even if it wasn't the biggest, and there are rumours of another wave.",
            "But it’s all men…not that there’s anything wrong with that. And the only ones that drink are space wolves. If you want drinking and women Orks are the superior choice (Google bloodbowl Ork cheerleaders and fungus beer)",
            "Compare the amount of Space Marine books to the amount of Xenos books. Also how Space Marines are in nearly every starter set.",
            "Look at BL’s book selection and you’ll immediately see that this is blatantly false. The HH alone is more books than any xenos faction can dream of",
            "Oh! I take it that's from a previous edition when Vect was playable and a menace to people's CP?",
            "I thought there were mixed and female only IG units?",
            "I honestly dont remember a starter set without marines.",
            "Yet Xenos books do insane amounts of building onto the already existing lore. 97% of HH is just bolter porn and doesn't add anything. There is a reason that books like Infinite and the Divine and Twice Dead King are so praised",
            "in 9th and probably past editions if you played Kabal of the blackheart, there was a stratagem that cost 0cp called \"agents of vect\" that let you increase an enemy stratagem by 1. and the name just stuck",
            "Oh shit I meant ig as I guess. My bad",
            "There was one where they had CSM vs Druhkari or something.",
            "Just because you don't like the lore doesn't make there be any less of it. The attention from GW is not equally split. There are many times more books about Space Marines *alone* than there are xenos books put together.",
            "Wdym it adds so much, there’s a reason there are so many lore videos on the primarchs and primarch/space marine related posts on r/40klore . Hell space marine subfactions have more lore than some full xenos factions (the Votaan), I long for the day we get enough lore to make a full ass breakdown of the Bad Moons or sa’cea or Iyanden",
            "I dare to say that **Chaos Space Marines** have more books than any of the Xenos alone. Hell, there is an *entire book* about a Death Guard *warband* - \"Lords of Silence\", to be more precise and that seems to be very cool - while even now Leagues of Votann (the more blatant example) has nothing.\n\nP.S.: To be fair GW is giving, *very slowly*, some love to Xenos in general. It will be released, very soon, the *Lellith Hesperax* book (a character that has **decades** already in WH40K lore). In videogames, not only the Necrons will be playable in *Mechanicus 2* but the Orkz will gain a Twisted Metal-like cart game. But it is not enough: just talking about Drukhari again, **many** of its named characters presented in their Codex from the 3rd edition doesn't have a plastic model *even today* for instance."
        ]
    }
}