{
    "Weekly GTA6 FAQ and Wishlist Post": {
        "title": "Weekly GTA6 FAQ and Wishlist Post",
        "score": 8,
        "url": "https://www.reddit.com/r/GTA6/comments/1dhxigq/weekly_gta6_faq_and_wishlist_post/",
        "content": "# Welcome to our new weekly post for FAQ's and Wishlists that is replacing our monthly FAQ/Wishlist post. This post will refresh every Monday at 9am EST.\n\n&#x200B;\n\nSome examples of FAQ's are listed below, but this is only a small list of the repetitive questions/posts we're seeing:\n\n* **When is GTA6 being released**\n* **When do preorders start**\n* **When will the PC version be released**\n* **What hardware will I need to run the game on PC**\n* **Will we be able to...in the game**\n* **Will GTA6 have...in the game**\n* **How big will the game be**\n* **Speculation on who the voice actors will be**\n* **Will GTA6 Online have...**\n* **Will (any previous GTA character) be in GTA6**\n* **What music will be in GTA6**\n\n&#x200B;\n\n# Other useful resources:\n\n[**Official r/GTA6 Discord**](https://discord.gg/gta-vi)\n\n[**Official Trailer**](https://www.reddit.com/r/GTA6/comments/18ax6xd/official_gta_vi_trailer_video/)\n\n[**Trailer Analysis Documents**](https://www.reddit.com/r/GTA6/comments/18gn019/gta_vi_comprehensive_trailer_1_analysis/)\n\n[**r/GTA6 Rules**](https://www.reddit.com/r/GTA6/about/rules)\n\n&#x200B;\n\n# As far as what you want to see in the game, post those wishes in the comments below.",
        "num_comments": 20,
        "comments": [
            "It’s very minor, but new episode(s) of Republican Space Rangers.",
            "i want it to show your character enter your properties and not show a black screen and it cuts to you inside",
            "For Online: If they are going to have the exact same cut scenes play over and over, and it's over a minute long,  for the love of everything that's good,  please let us be able to skip them if we've already seen it,  thank you",
            "Story mode/single player mode DLCs.",
            "Jasmy Coin + GTA 6 = wen lambo🏎️",
            "As far as Story mode i hope we get a lot more robberies than v story mode. Now for online more broken down businesses as far as the drug businesses. For example when we first buy the business we start with small deals therefore as we level up so does our clientele. Our have our introduction to Leonida somewhat pay homage to vice city",
            "Why am I unable to make topics on here? I have ore that 5 karma and my account is more than a day old. I just mde a post and it got removed straight away, what the hell?",
            "Car livery customization similar as Forza horizon",
            "Please let there be a photomode day one, I know we’ll have a phone that we can take pictures with and that’ll be great, but I also really hope for a Photomode too.\n\nAlso I hope they change their photo saving method that they have in GTA V & RDR2 with it being saved inside a gallery in the game, and then having to upload it to the social club, then having to go onto the social club and downloading my images to my phone/laptop. Most games nowadays when taking images in photomode it automatically puts it in your consoles gallery, which I then can seamlessly transfer to my hard drive, then to my Laptop.",
            "Over the weekend I got the itch to play GTA5 online. But I was suddenly reminded why I dont play it that much. Tried to do the Cayo Perico heist and it froze on loading screens back to my sub three times. Finally I just exited out and played something else. Coming from playing a lot of MMO's I love the concept of GTA online and would play it a WHOLE LOT more if it wasn't so buggy and the menus were such garbage. I obviously played it a lot more when it was newer (2013-2017). But slowly stopped playing it regularly due to difficulty loading into sessions or trying to join a friends session then getting kicked.  I've still popped in for updated content here and there but its always the same. Start playing it, convince other gamer friends to join and eventually we all get frustrated with kicks, freezing loading screens or just game breaking bugs in general. I've always said I would be happy to pay a $5-$15 monthly fee if that meant R\\* would actually maintain their servers. I know a lot of people, especially in this type of game genre would absolutely scoff at the idea. But coming from MMO's where its either pay to win or has a monthly sub, I would have no issues with a monthly sub whatsoever. Again, given its less pay to win and the servers aren't complete dog s\\*\\*\\*. \n\nAlso did I mention the menu system in GTA5 online is also hot garbage? Game matching menus included. I hope they fix that too.",
            "Does anyone think that Lazlow can have a comeback on the radio?\n\nLike he moved back to Vice City after all these years. It would be comical to hear him comment on how Vice City has (not) changed since the 80s.\n\nI know he left Rock Star, but the game has been in production for so long. It might be possible that they have already recorded all they need before his departure. Or maybe they just temporarily hired him for the radio shows.",
            "![gif](giphy|VLljKzBZ2uPfYDpsNV|downsized)\n\nHe has to make a cameo. The game could suck and I wouldn’t care as long as he makes an appearance.",
            "A dexter side mission",
            "I wish they put as one of the apartments you can live in a prison cell. Once you check into prison you will be locked in the prison until you escape or get let out. But you should be able to get in and out rather that it be just a part of the story.  Or maybe you have a characters in prison the whole time that you can fast switch to (like in gta5. )\n\nThe prison would have a high fidelity simulation of gangs and activities like lifting weights sending secret messages and buying and selling contraband etc, raids, etc.  you would have a cell/locker for large items as well as a butt innovatory for small items and weapons.",
            "Its needs actual Police dogs",
            "The more minor features they add to the game, the better the game will be. The reason these games are so good is because people are still finding little things all these years later.",
            "?",
            "I hope that GTA VI online will also be slightly more solo friendly. Being blown up randomly by flying motorcycles is really annoying. Less Saints Row and more realism, if you ask me."
        ]
    },
    "Sad thing about gta 6": {
        "title": "Sad thing about gta 6",
        "score": 32,
        "url": "https://www.reddit.com/r/GTA6/comments/1dltu25/sad_thing_about_gta_6/",
        "content": "Remembered that some people will actually race through this once in a decade experience just so they can ruin the ending for everyone else. ",
        "num_comments": 30,
        "comments": [
            "One hour after the game launches: GTA 6 (VI) LUCIA KILLS JASON AND GIVES BIRTH TO THE DEVIL SAD SCENE 4K 1080P 60FPS",
            "Or rush through it to avoid having it ruined by someone else. Which is also shitty. I want to be able to take my time and enjoy the experience but I have legitimate concerns that it's going to be spoiled for me if I don't essentially speed run the game.",
            "People are also going to complain about every little thing that they think is missing.",
            "PC players have it even worse. I’m going to have to just shut this community out when it releases on console.",
            "Definitely. Just stay offline to avoid spoilers. It’s common practice for me if I haven’t finished a big trending game, tv show or movie \n\nTrolls are everywhere and the only way to beat them is to avoid them",
            "Or you can just not show up in any gaming communities that involve GTA 6. That way you can just play the game and finish until then?",
            "All rdr2 endings appeared the day after release, so yes",
            "Basically, a couple days before GTA 6 releases, I will leave this sub (or just not visit it) and not open YouTube until I complete the game. It worked for me with GTA V, I'm hoping it will with GTA 6.",
            "The last one most of us will play",
            "Take a week off from work. Stay at home. Stay offline. Don't talk to anyone.",
            "Yeah, but I guess that can be countered by muting all gaming communities on different platforms until you finish the story, that’s my plan anyway",
            "Avoiding spoilers has become relatively harder now.",
            "Fun fact, game isn't even out yet and there are spoilers already",
            "Ok",
            "Im staying away from youtube and all until I beat it idc😭",
            "Im staying away from youtube and all until I beat it idc😭",
            "I will race through it the first time just so no one spoils it to me",
            "If I find the game boring I won't finish it, I'll just watch the story on YouTube and then jump to Online. I don't have too much patience for story games",
            "*one minute after",
            "Nah just stay offline or immediately ignore anything GTA 6 related. I got pretty good at tuning stuff out I don’t want spoiled",
            "so no internet connection nor visitors for a month then",
            "Right! 🤦🏾‍♂️",
            "That is the most annoying part of the GTA fanbase. They complain about things in one game and when they remove it the next game it is a problem.",
            "Not really. Just mute gaming communities and stay off YouTube. Or if you’re on YouTube just ignore anything you recognize as GTA 6 or even GTA at all. That’s the kinda thing I do",
            "The fastest nut in the west\n\n![gif](giphy|sGnKAiOUrincs)",
            "I don't know, GTA VI is going to be such a big event that I fear even amish grandmas are going to know how it ends within days of release.",
            "Maybe it'll have a VR mode and I can get a headset and headphones and strap them to my head for a month",
            "I know this is a joke but I’m literally praying that there will be PSVR2 support. Imagine how amazing it would be!",
            "It's only half way to a joke. I would be ecstatic, it would actually be the game that made me buy into VR"
        ]
    },
    "Online character creation will look spectacular.": {
        "title": "Online character creation will look spectacular.",
        "score": 488,
        "url": "https://i.redd.it/8pe4ns2x9z7d1.jpeg",
        "content": "I truly belive rockstar will deliver an insane character creator, one that is easy to use, yet massively diverse and allows everyone to create a truly unique and personalized look. \n\nGTA Onlines character creator was honestly awful. I mean you couldn’t even apply a proper beard to your character, and most faces I had seen in game honestly all shared resemblance. \n\nWith that being said, I cabt wait to see what this character creation will look like for 6, I truly believe that whatever it is rockstar will deliver. ",
        "num_comments": 136,
        "comments": [
            "Spoilers - It won't look anything like this. I expect it to be slightly better if not identical to RDRO.",
            "As long as that horrible “choose your parents” feature goes away I’m good.",
            "![gif](giphy|mPAfmTMIGPZsqACDPf|downsized)",
            "it won’t, I 100% sure you’ll need guide to not make an abomination (I hope not)",
            "I doubt it. It’ll be a minor improvement over RDR2’s creator but it’s not going to revolutionize anything. Their character creators have always been kept to the necessities with more focus on gameplay.",
            "If you are genuinly expecting Reallusion tier character creation tools INSIDE GTA 6 you're gonna be real dissapointed.",
            ">I truly belive rockstar will deliver an insane character creator \n\nFollowed by \n \n>GTA Onlines character creator was honestly awful \n\nBro why would you expect some generation defining character creator if you thought they were awful at it?",
            "Are you like 12?",
            "![gif](giphy|PjU0WtzRVbQUO4qe6v)",
            "Will it mate yeah",
            "What a stupid post",
            "Who made you the expert?",
            "If we can't do a full body scan of ourselves and upload into gta6online2, is it even worth playing?",
            "[deleted]",
            "As cool as this would be it would without a doubt be a nightmare to most people",
            "This is absolutely not what it is going to be.",
            "If it is the Red Dead Online version but better, I am not complaining at all. \nThat one was already good. I am very curious what a 5+ years advancement of that look like. \n\nI can imagine I will spend dozens of hours in character creation, especially if they add plastic surgeons to the game (pretty sure they will), so you can alter the appearance later on.",
            "With a ‘2 Billion’ budget I expect to Copy and paste my Own ‘Nucleotides’ on to my Online character and I’ll settle for nothing less 🤷🏾‍♂️",
            "$100 says they do an nba2k type facial scan thing",
            "You guys are really setting yourselves for disappointment. This is just ridiculous on so many levels.",
            "So you’re just gonna toss out user friendly out the window like it doesn’t exist, huh? 🤔 you are interesting lmao",
            "This is overkill, that’s all it is",
            "Don’t want it!",
            "As long as they stay the same unlike red dead online",
            "I doubt it as the rage engine has limits. And GTA is no RPG for getting in nearly every detail.",
            "I'm sure we're still going to be choosing our parents instead of this",
            "I bet it will be like RDR2 but with less ugly faces to choose from initially and more options overall.",
            "the only thing they need to remove is the preset parents, takes away so much freedom from creation when you’re stuck with 20 ugly presets",
            "What would be great is if you could upload your photo and let AI + facial scan do the rest and make a GTA world replica of yourself, now that would be next level 😂\n\nSurely someone’s already thought of this?",
            "I very hope so",
            "if you want every piece, features, etc in detailed. It'll be twice in game size, and might be laggy idk.",
            "Might even get face scanning like 2k",
            "Achilles detail is crazy lmaaoooo",
            "Picture from?",
            ">I truly believe rockstar will deliver an insane character creator.\n\nBut why? What evidence makes you think that? Their last character creator was shit. Red Dead was a bit better I think but still mediocre.",
            "I have no idea why people think an in-depth character creator won't happen. Every GTA Online character looks the same and they're all ugly. I want to play this game for 10 years and see unique characters everytime I log on.",
            "If its like this. Im going to create some abominations even god could not love.",
            "Oh! So like Saints Row?",
            "You don't know that. You are pulling wishes out of your ass.",
            "I realize GTA isn't an RPG so it's not expected to have insane character customization options, however I've always been a fan of more options for customization. In GTAO you could somewhat make a decent looking character but if you really tried hard and played around with the sliders. In RDRO I actually found it was worse compared to GTAO's.\n\nSomething akin to Starfield's where you can blend the actual traits would be amazing, with 10-20 default presets.",
            "As long as you can change body types",
            "Meh I highly doubt it, Red Dead Online's isn't even good. Bethesda's character creators like in Fallout 4 and Starfield are still better.",
            "Yeah I have high hopes for the character creator, they’ve said it’s going to be their most immersive game yet and I doubt they are going to miss a single thing with the online mode. If the online mode is executed well enough it could have a lifespan two or three times compared to GTAVs, I truly think they are going to go all out with the online side of the game and deliver something that has abit of everything for everyone. I doubt they will fall short on allowing us to make extremely unique looking characters",
            "From what game is this?",
            "I expect it to be in depth. They literally have 2 billion dollar budget.",
            "If you're expecting Starfield/Star Citizen-like character editor from Rockstar, don't bother. \n\nHowever, I'd *love* to be proven wrong (and I'm crossing my fingers), but with how RDO's character creation went... I won't be regarding GTA6O's character creation *that* highly for now.",
            "it’s not going to be anything like this dude, it’ll just be a slight improvement to RDRO’s character creation, which was also a slight improvement to GTA5’s character creation, don’t expect anything drastic.",
            "They don't have a great track record with that. RDO's was an improvement but idk why you're putting so much hype into this particular aspect.",
            "I haven’t been able to play either GTA5 or RDR1 much less 2 due to stomach issues I have had for years. \n\nI have RDR on original Xbox and GTA ALL of them on PC and GTA5 also on PS3 although I also have a PS4. \n\nWith all that out of the way I think realistically also not trying to be rude that it’s best to not get hopes up and simply hope for the best and keep up with all the news about GTA6.\n\nWe still have time hopefully it will be awesome I love this franchise though admittedly due to the stomach crap I have only been able to play a few…so far anyways. \n\nCrossing my fingers I will finally be able to overcome this and be able to actually immerse myself in this beautiful fun world. \n\nWhat I have always loved about this franchise even from gameplay videos is the massive worlds and equally massive things to do in these worlds.\n\nI love the freedom this franchise has always allowed. \n\nOne thing I hope they will add is being able to enter EVERY building instead of just a few that would be so cool. \n\nJust think positively and optimistically that’s what I’m gonna do.🤗🫶❤️👏",
            "It'll hopefully be on par with something like Cyberpunk 2077. Felt like that game really did a good job with having a good amount of options without being overwhelming.",
            "I just hope they put in an actual afro for a hairstyle, seems most games don't do that. Downloaded a mod for Skyrim that has it, Stardew Valley has it, and GTA Online got an update and added a small faded afro about a year or 2 ago.",
            "I hate the “online” dimension, its just a chaotic mess of cheaters and kids. I wish R* focus solely on making the best possible game ever and constant update it, more quests etc,\nMore campaign",
            "I hope it’s not too overwhelming. I love lots of detail but the initial feeling of a new open world game gives me anxiety because I’m so excited to explore and learn, I don’t know where to start lol",
            "rdo character creation wasn’t even good so i doubt it",
            "Fuck online",
            "Why not let AI generate a character for you by putting in a name or uploading a photo?",
            "No it will be slightly worse than RDO because RDO was slightly worse than GTA5s one.",
            "Unpopular Opinion: I hope there's no multiplayer.",
            "Agreed",
            "Thank god!! The gta 5 models are shit. The feet even look weird.",
            "Everyone thinks we’re getting nopixel shit because rockstar bought cfx. But cfx doesn’t even own nopixel.",
            "Fans here are delusional",
            "Yep.",
            "Do you think we’ll get bounties",
            "Lmao, saying “spoilers” like you designed the character creation yourself.",
            "It's not going to be anything like rdro just like rdro isn't anything like gta 5 online",
            "Lol, are you forgetting the little to no shits they gave for RDRO? On top of that, the game released for the PS4. GTA6 will be rockstars first next gen title so for you to think that it will look identical to RDRO character creator is laughable.",
            "When will we ever get something like this? With graphics, with gameplay, with everything its always “a little bit better”. I want a jampacked game with character creation like this, I want realistic graphics, I want as much as possible. Why would it be so hard for them to do this? Is making a developed complex character creator really THAT hard?  \n\nI want something A LOT better. Is that too much to ask?",
            "yeah ngl that was ass 😂",
            "They gotta add \"realism\" to a game with flying cars that shoot homing missiles",
            "Choose your parents, yet all we got was John marston and a meaty selection of ogres",
            "Rockstar will try anything but give us a regular, fully controllable character creator like we’d see in a game like Saints Row.",
            "that was literally such a lazy and dumb feature, they should’ve just done random generated faces instead.",
            "Why do you doubt an in-depth character creation for practically the biggest game oat?",
            "I honestly don’t understand why anyone would want to create anything but an abomination 😆 that’s all the fun",
            "This is exactly how I feel. RDO was already a step in the right direction by allowing body types with a weight system on top of that. And women characters were about a head shorter than men, so all those features together let players distinguish themselves a bit more compared to the two body types in GTAO which look freakish in groups and especially when next to NPCs who actually have unique proportions.",
            "LMAO",
            "There's gonna be 12years of time between the two initial releases",
            "NO ITS NOT",
            "I literally have 70 hours on Baldur’s Gate 3, yet I’m still on Act 1. Most of the time I spent were downloading appearance mods, if I didn’t like it, I’d redo the whole character again. That was before they added the ability to change your character after CC. Still haven’t went back to it though. I’m waiting for the official mod support to be added",
            "I said that it would be easy to use…",
            "I would never want to see myself online let alone play with myself online. 😬",
            "Because their history tells otherwise. It is much smafter to expect something on line with what they've done previously than to expect something never seen before and generally perfect.",
            "Not a game, but a character creation software called Reallusion",
            "Yes exactly that’s all I want",
            "Unpopular opinion:  gta 5 multiplayer is what funded gta 6",
            "Nopixel is the server. \n\nNo one thinks they are going to implement RP because they bought the server. \n\n\nR* bought/hired cfx which is the team that built everything that we see in GTAORP. They did this with the intention to use them for some of their talents.\n\nGta 5 had a second life because of the RP servers, and they don't want to miss out on profiting on that next time. \n\nThey are clearly going to use the elements in some way, even if not as detailed at it was in RP..",
            "If you can do it with FiveM, it means the GTA 5 engine is able to do it. Because other than ported 3d models the game functions that every FiveM server uses are the ones that Rockstar created.",
            "Not only that, they even said themselves they will have no involvement with future games including gta vi",
            ">Everyone thinks we’re getting nopixel shit \n\nNoPixel's character creator is the same exact as GTA:O just presented in a different way and then a clothing section with all clothing enabled...",
            "Exactly, the posts here verge on nonsense and hyping up themselves for disappointment",
            "I don't see why we couldn't. That's even the theme of upcoming gtao update and vigilante missions were always very popular in previous gta games.",
            "They gave a shit the beginning of rdo's lifespan but since it didn't make gtao levels of money they dropped it",
            "I like how you used an unrelated image to show off how good the creator will be based on nothing.",
            "What is actually laughable is that you think that the character creator will look like Adobe Substance 3d Painter mixed with Photoshop... \n\nCharacter creator has nothing to do with the game being next gen. There are a lot of very old games (especially RPG games) that had way more advanced creator than some modern gen games.   \n  \nThem abandoning RDRO after couple of years cause it wasn't generating enough profit is also completely irrelevant to what character creator they added to the game at launch. Ridiculous argument.   \n  \nWhat's relevant is what kind of customization are they willing to implement to their own engine and character creator. RDRO character creator was better and more advanced than GTAO creator. Just like GTAVIO creator will be more advanced and better than RDRO creator. But you have to be delusional to think it would look anything like the picture you just presented.",
            "damn u asking for 5-10 more years in development",
            "yes, it is that hard\n\nentitled ass gamers lmao",
            "When will we get a character creator that looks like Adobe Substance 3d Painter mixed with Photoshop? Never. \n\nThere's a reason why modern games have great character creators but they don't look anything like this picture. Character creator needs to be user friendly and appeal to the general audience. If you overload people with this kind of UI and give them more options than a professional program for graphic designers most people would get overwhelmed. \n\nThat's why most games have character creator more similar to Cyberpunk of Fallout. Something that gives you a lot of options but also doesn't overload you with them.",
            "GTA 6 better",
            "i don’t think you realize that gaming systems are limited. there will always be a limit to hardware. no way a AAA on the level of GTA 6 sells enough on PC only, especially if the minimum requirements are NASA-level computers",
            "Couldn't have come up with a better review myself it was exactly ASS",
            "I spent like an hour on Youtube looking for references until I finally found a *decent* one. I hope it never returns nor should other games implement it ***at all***",
            "I think it’ll be better than 5’s, but not an MMORPG scale thing. Like Saints row’s system but make it less insane.",
            "GTA5 and RDR2 were both massive and their character creations sucked.",
            "Because despite Red Dead Redemption 2 being critically acclaimed and downright gorgeous it had an absolutely shit character creator, I'm hoping and praying it's better in 6 but I don't think we're instantly gonna jump into having the best, in-depth character creator.",
            "I thought RDR2's online character creator would be better and it ended up disappointing. Don't expect much from it.",
            "I get big into the roleplaying side of things, It's nice to actually make a character how you envisioned it in your head instead of looking like Shrek's alcoholic uncle like half the damn characters in RDR2 look haha. Certainly hope they let us make both in 6.",
            "Consider that there are players like us who love to \"insert\" ourselves within the game.",
            "I've spent well over 3k hours on gtao from ps3 - ps5. If I'm going to be looking at something for that long, it best look nice.",
            "it’s not hard to believe that people would want to make their character look hot as hell lol.",
            "So?\n\nThere were great character creators in 2013, what was the excuse then?\n\nRockstar’s never been good at custom character customization. Why are you expecting that to change with zero evidence?",
            "You are just the hand full of people who want this complexity for a character customization in gta 6. Keep it simple and straight to the point. I don’t want Shrek looking characters in the world. Keep that in modded servers.",
            "Oh ok, thank you",
            "Damn that's probably true lmao",
            "You just shared one of the most widely accepted opinions",
            "FiveM does not necessarily equal RP, it's a multiplayer modification framework built on top of Gta 5.\n\nMy take is that rockstar wants to build something similar to what Fortnite and Roblox did.\n\nThey talked about \"User generated content\", that's exactly what FiveM is and what Fortnite and Roblox did. They won't stop with Sp and Online...",
            "> they bought the server\n\nAfaik, they have not purchased nopixel. \n\n> no one thinks\n\nAnecdote alert- tons of folks here are conflating the cfx acquisition beyond what cfx actually does, to me it’s quite rampant. \n\n>the team that built everything we see\n\nRockstar bought the team that makes the app. Literally everything you see up to the point you *join* a server… literally! There is a vanilla server loading screen, but I’m sure you’ve seen server owners who develop their own loading screens. The rest is stuff that happens in the background. Cfx does not make RP scripts. They make a few basic ones that support the server infrastructure, and OneSync. \n\nNothing else, sorry. *Rockstar* literally risks infringement if they decide to copy anything a server does to the point a judge would agree.\n\n> second life\n\nI’m a PC gamer, but this statement is just blue-skying. PC is only something like 20% of the entire playerbase.",
            "> They did this with the intention to use them for some of their talents.\n\nThey much more likely did it with the intention to stop hemorraging money from players playing on these unofficial servers where they don't buy shark cards. Wouldn't want SixM to release right after the new online releases or all these players already on FiveM will move over there instead of playing actual 6 Online where they buy shark cards. It's difficult to stop a big modding project like that - especially without major community backlash - but buying them is much easier, lets them make sure they don't release another competitor to the official servers any time soon, all the while winning goodwill from the community.",
            "Yes, but all that costs time and money and occupies the time of developers that are very expensive to pay. Servers like nopixel have features like that because their profit centers are slightly different and the folks working on it are probably passion taxed to hell and back, in addition to likely not having a way to see what the actual overhead is in respect to revenue. \n\nIf it don’t make dollars, it don’t make sense. Just because it can be done, doesn’t mean it can be done quickly or cheaply.",
            "I won't be surprised if it's bots",
            "Yea right in this next update what if we got personal bounties",
            "I used a flashy image to get people’s attention, posts that don’t include something to catch someone’s eye get little to no traction lol",
            "That’s not my expectation, but I do think that it’ll be something that is unexpected and admirable, obviously won’t be the best tho",
            "These posts must be made by kids who glorify Rockstar and hype up VI to be literally a perfect game in every possible regard.\n\n\nThey don't seem to be able to think realistically using all facts.",
            "The same reason we are expecting a great game with billions poured into it despite GTAO being a cash cow regardless. Rockstar strives for excellency and maybe that will stretch to the online character creator being better than the one 12 years ago.",
            "LOL. I agree no shrek looking mfs, but I can get around a more in depth customization system. Similar to cyberpunk, but not with all the metallic skin color bs.",
            "☝️🤓",
            "but still PC is the best platform.",
            "Nopixel is the most famous server on FiveM, developers are paid a lot of money already (and it's known inside of the community).  \nThere is a lot of people that does it for passion and without making a cent on FiveM, but Nopixel is a success story.\n\nWhen it comes to FiveM (not the servers, but the service), they generate revenue in plenty of ways.  \n1) Every server with more than 32 slots pays a monthly license, based on the amount of slots they want, that ranges from €15 up to €50  \n2) Every real money \"transaction\" that a player does on a server must go through Tebex, which is the only official way of selling stuff on servers or for servers (as a developer/modeler etc.)  \nThey take 15% of every transaction that happens on tebex.\n\nAnd trust me, there is a lot of money that goes around this small world.\n\nFiveM isn't a money sink, it's profitable, my bet is that Rockstar wants to take it to the next level for GTA VI and make even more money from it, while also delivering a better (and controlled) way of modding their game. Roblox and Fortnite do this already and it's pretty successful.",
            "The basis of this thread is founded on nothing though. It would make more sense if you said “I hope the character creation is better this time around” instead of saying “it will be amazing!”. Just my opinion. Not tryna be rude",
            "You'd do well as a game journalist.",
            "I'm just keeping my expectations a little level with it, I would fucking love if they turned round and produced some immersive character creator but I doubt it. It'd be real nice to finally have characters that looked like actual people you'd see walking down the street and not monstrosities or clones, swaer to fuck every third male character used that same spiky haircut.",
            "They don’t strive for excellence with their online modes, look at GTAO and RDRO. They strive to deliver the bare minimum that will make the shark card buyers and GTA+ members happy.",
            "Why are you telling me?  That’s not what this discussion is about."
        ]
    },
    "The homeless man that found the diamonds in GTA 4 was said to be going to Vice City to open a gun shop & liquor store according to the Liberty Tree. Be on the lookout for Jerry Kapowitz": {
        "title": "The homeless man that found the diamonds in GTA 4 was said to be going to Vice City to open a gun shop & liquor store according to the Liberty Tree. Be on the lookout for Jerry Kapowitz",
        "score": 273,
        "url": "https://i.redd.it/pktasu4rvz7d1.png",
        "content": "As long as they didn't forget about him, this would be cool to find his gun & liquor store",
        "num_comments": 35,
        "comments": [
            "Vietnam Veteran? He will be at least 70 in 2025",
            "Someone probally has to remind sa developer to make a refrence.  But I'm sure developers look at these reddits imo because imagine working on a game as a full time job as a 25-35 tech savy nerd. Not being curiose of what people kn twitter and reddit is probally not possible",
            "I bet there’s gonna be a gun store owned by him and they’ll use a pun on his surname “Kap-owitz” lol",
            "The gta universe is wild for all these mini spin-off moments. Honestly rabbit hole 🕳️ vhybes in the best way",
            "he will probably be for some missions like how Karen (Michelle) was in a heist for GTA online as well as the story mode",
            "I'm sure developers read these reddit lol. Their 25-35 year old tech savvy guys",
            "Sounds like someone stole some diamonds and hid them in the trash to collect them later and the trash got picked up earlier than expected.",
            "Has anyone taken the delay test on the game, saw it for the first time the other day. well funny",
            "Good find.",
            "It wouldn’t surprise me if they forget about this guy since he’s pretty much not that important",
            "The current devs don't even know things like this exist.",
            "Still possible. And he probably will own the store(s) not run them",
            "Totally possible!",
            "Yeah there’s very few old people in Florida",
            "kapow!\n         -itz",
            "Saving this comment for when the time comes",
            "\"Put a cap on his ass! Buy Kap-owitz!\"",
            "Did you play the story of GTA IV, TLAD, and TBOGT?  The diamonds are one of the core plot points",
            "“Not important” yeah as if the final cutscene of the second dlc showed him getting the diamond.",
            "You’re stupid if you think new devs wouldn’t read up on or not care about GTAs extensive lore.",
            "His good for nothing nephew manages the store.",
            "yeah homeless veterans are known for their healthy lifestyle",
            "I mean just a microscopic amount , I hear they’re spraying pesticides to kill anybody over 50",
            "Definitely no abundance of New Yorkers, either.",
            "🤞🏾 would be a wasted opportunity otherwise. Same universe and they set it up 16 yrs ago. Would tie all the games together in a cool way and add to the lore",
            "Just wait.",
            "This is a rockstar dev account!! We found one boys",
            "He found $2 million. Yeah some might waste it all, but it's entirely possible he used some to get full health checkups and stuff",
            "Dude, will shit himself to found out Yusuf from the tbogt was in gta 5",
            "90 percent of the people that created gta pre Gta V are gone. Gta 6 will capitalize on your wallet more than anything you've seen before. They don't care about lore anymore.",
            "Where did you pull that statistic from? Your ass?",
            "I guess Sam houser is a useless person then and not only that but red dead redemption 2 is shit because you mentioned only the people that work gta 5.",
            "Fuck Rockstar and gta. Sam sold out. Everyone else left because they saw where grand theft auto was going. Dan was fired for going on vacation on the release of gtav. Literally made them a billion dollars in 3 days with the release of gta v and fired him. I've beaten every single game 3 times. I've been playing since gta 3 was released. I know more about this than any of you. You'll downvote me but, when gta 6 releases I'll come back and say I told you so. Gta isn't gta anymore. It's only here to sell shark cards now.",
            "Bait? I feel like you’re bait is shit man",
            "> Dan was fired for going on vacation on the release of gtav.\n\nbait or mental deficency? call it"
        ]
    },
    "Since Jason and Lucia is a couple how do y’all see the strip club being used in GTA 6?": {
        "title": "Since Jason and Lucia is a couple how do y’all see the strip club being used in GTA 6?",
        "score": 1039,
        "url": "https://i.redd.it/wdrkko5jqx7d1.jpeg",
        "content": "I predict that we may not be able to fully used to strip club due to Jason and Lucia being in a relationship\n\nIn the game maybe we might if were to break up and be back together or some shit lol 😂 \n\nOr cheating with each other like Michael from GTA 5\n\nIdk 🤷🏾‍♀️ tbh I just can’t see both of them being in the strip club together unless they’re that kind of weird ass couple.\n\nI do think Lucia might be the type to be jealous if she sees Jason throwing money on a big booty chick \n\nEither way, I am going to look forward to see on how they’re going to use the strip club for GTA 6",
        "num_comments": 299,
        "comments": [
            "this might come as a surprise but sometimes characters in GTA games make morally questionable decisions",
            "Maybe you’ll get a phone call from Lucia if you been visiting too often. But I doubt there would be any serious consequence",
            "Micheal from GTA 5 was married (even if they weren't happy most the time they were) but he still can go do I doubt it'll prevent us from going",
            "They both are at strip club in the leaks for the missions. Why would they implement it and couldn't use it for some kind of \"morally right\"-reasons? It's a fucking GTA game which rounds on bad life habits.",
            "Have you heard that Lil Wayne song Mona Lisa",
            "I mean they're not glued at the hip. Hopefully you can have the other follow you whenever you want (holy shit, I've never thought about that before - that would be amazing), but its not like they're always going to be with you.\n\nBesides, this is GTA in Miami of all places. Monogamy and faithfulness is the last thing the game is going to try to uphold. This isn't Red Dead or the sims or something lol",
            "I bet the owner or some vip who hangs out there will have missions for you. Other than that, it's just a bar with titties. I don't really expect Lucia and Jason to directly interact much outside of missions, scripted events tied to missions, and dialogue cues, so maybe at the most they will make a comment about glitter on your clothes or the smell of stripper perfume or something.",
            "Theyll have male and female strippers, there we go.",
            "In gta iv, I’m sure you could take some girlfriend out to strip clubs on dates. I guess it’d work the same.",
            "> I do think Lucia might be the type to be jealous \n\nDude the game won't be out for another year how are you making conclusions on their personalities?",
            "When jason visits the strip club and when Lucia asks where he’s been, he’s gonna lie. Because who needs that headache? But then she’s gonna find out anyway and she’ll bring it up every time they fight.",
            "Does anyone remember one of the girlfriends from gta 4 was a stalker? Kiki I think? I think it would be funny if Jason goes to the strip club a red blip appears on the mini map and it’s Lucia trying to get him. He has to move around the club to avoid her. If she catches him a cutscene plays of her dragging him out by his ear. Obviously this is all jokes but would just be funny.",
            "they will be able to do 3somes",
            "just be the worker and the customer at the same time, jason be the worker at the strip club and lucia as the customer\n\n![gif](giphy|mEsqfG9Zbuj7CDsroa|downsized)",
            "It’ll be a place where we get missions",
            "Lol you really think rockstar is gonna make these 2 G rated Christian lovers? Come tf on",
            "I can see threesomes being a thing",
            "Sometimes couples go to strip clubs together",
            "What do you mean? Michael De Santa was married to Amanda and I went go the strip club all the time with him lol I think the real question is will there still be \"dates\" in GTA VI or will V be the last game to have the feature? 🤔",
            "BRING ON THE DANCING SHIRTLESS FIREMEN!",
            "You were able to take one of the girlfriends in GTA IV to the strip club, and she enjoyed it. Could go either way.",
            "People are really over here like “Lucia’s going to get mad at Jason” \n\nOkay? I’m gonna have Lucia in the strip club constantly so what about consequences for her",
            "Maybe there's a male strip club too",
            "This might come as a surprise but couples do go to strip clubs together.",
            "My girlfriend and I go to the strip club together. Why wouldn’t they?",
            "100% lucia lost titty bars. She will be making it rain, slapping asses non stop. \n\nHonestly, I think she will be addicted. Jason, just goes with his girl and she will be beggin for him to get as many lap dances as he can but it just not his thing.",
            "the same way i still get me an occasional hooker with Michael",
            "Think of it, Michael was married 🤣",
            "Don’t think there will be any consequences. In fact I don’t see the characters saying anything about it. Maybe at best either Jason or Lucia calls you up but no real consequences",
            "Micheal could go to the club",
            "Well if you paid attention to the gta 5 storyline, you may know that Michael is not cheating on Amanda, they just agreed about open relationship.",
            "I’m pretty sure we can just go to the damn strip club whenever we want i don’t think she would know of cares",
            "Yknow. Michael has a wife. Didnt stop my 12 year old ass from taking him into the strip club",
            "they arent together 24/7",
            "I want male strippers and male hookers",
            "You go together and the bone the stripper together like a real couple would do",
            "It wouldn’t surprise me if they put a male strip club in the game honestly. Florida is wild",
            "It's actually pretty fun to bring your gf/wife to a strip club with you... they girls seem to gravitate towards other women in the crowd",
            "Strip clubs aren’t cheating if your relationship can handle them bro.",
            "Are you 7 years old? What kind of dumb question is this?",
            "You guys do know that couples like to go to strip clubs together without having to be kinky or bisexual?",
            "The strip club is for little kids tbh",
            "Tbh it’s not as out of the ordinary as you’d think for couples to go to a strip club together",
            "I think they should add male strip clubs too, even if they might not get used a lot. Women also go to those places after all.",
            "Maybe she's bi and also into it.",
            "I've suggested it before on another post but it would be funny and even a callback to that one GF from GTA 4 that if you hangout at the Club too much or use too many Hookers, the other protagonist will be stalking you in the open world.",
            "I’ll be very frustrated with all that jiggle mechanics and no way to fuck those bitches",
            "Lucia Will be the one who likes to fool around… so that’s why she said “trust” and Jason had that poker face replying her “trust” trusting shit",
            "You can pick up prostitutes as Michael and go to the strip club. He’s married with two kids.\n\n\nHell, his wife was a stripper.",
            "I vote for a weird ass couple...",
            "It’s 2025, women love strip clubs",
            "Maybe they're both non-monogamous 🤷🏻",
            "You have ABSOLUTELY no idea if they are a couple or anything else you've stated.",
            "Open relationship do exists in real life",
            "I think we go to a stripclub to see strippers.\nI don't think the game will have this kind of cringe to it that feelings and teenage drama will be a thing.",
            "maybe it’s like gta 3 after a good heist one ditches another and we play both sides and once they meet either they fight or explain why they had to ditch and fight a common bad guy",
            "Both are going to the strip club… separately",
            "have you played any other GTA game? LOL",
            "They might not always be a couple in the story",
            "I think there will be a trust mechanic in the game. It is influenced by actions you make as Lucia and Jason. I think it would ultimately play into the ending.",
            "more like a job place like in leaks where they get missions",
            "Michael is married and can visit them. So nothing new.",
            "Will both of them be playable? I feel like Lucia is the main protagonist.\n\nAnyways, we all know GTA Characters are all super faithful anyway /s",
            "🚔",
            "I'm just wondering which ones gonna die at the end",
            "For meetings in a back room",
            "You were able to date in the previous games and still go to the strip club ",
            "Probably the same way it worked in SA, 4, and 5. And considering the strip club is where I’d take all the dates to in 4, I doubt there’s going to be a consequence for visiting.",
            "I mean, Michael had a wife, albeit there was infidelity between them. You could still pick up hookers and go to strip clubs end game when things were better between them. An in previous games you could still go to clubs although you had a girlfriend. I don't see why gta6 would be any different.",
            "Well if it's anything like Old GTA you probably will have to either kill people, get lapdances in 4k, start a side mission sequence.",
            "I could see them being made to be bisexual and also in an open relationship. They don’t peg me as a traditional couple that would be into monogamy. Especially with prostitutes, I could see them being able to hire either male or female prostitutes and it not being a problem in their relationship.",
            "For all we know one of em could or probably will die at some point anyway. Not like it matters we’ve been through this Michael and others when they have girlfriends it’s a game",
            "What we do in our free time isn't canon to the story.",
            "Exactly as in the leaks, there's a leak video about lucia and Jason in a strip club",
            "By me",
            "if it's an option at the end of the day it's really up to the player, personally if they're romantically involved I won't be going to the strip club because it wouldn't feel right.\n\nI get attached to characters in games, some people don't care and that's fine too.",
            "I want a relationship system where both can cheat and use the stripclub and it affects how they interact with each other. \n\nLike an honor system in RDR. \n\nBut rockstar may just prevent the use of prostitutes which will surely elicit controversy among the fans.",
            "I see it being used by throwing them dollar dollar bills at them dancing ladies lol",
            "I could see them having a falling out at some point or having negative honor if that is implemented in GTA. The story looks much more grounded, so it might be like Red dead where you’ll be offered sex but you can only decline the offer or insult them for the offer. It really depends on how locked in these characters are in the relationship",
            "I’m really not sure why people are so sure rockstar will let players be unfaithful",
            "Why does everyone think these characters are going to be limited to what you can do in free roam?",
            "I doubt that it will make a difference",
            "omg i’ve been wondering how they were gonna do this so thank u. like are they gonna be in an open relationship? or just openly cheat on eachother…  so curious",
            "Definitely online, but also potentially for a heist.\n\nCould also just be normal for married people to go to the stripclub. It's Vice City, after all.",
            "Maybe the club could be owned by a relative, or a mission giver is always there (like Kent Paul in VC) , but i wish they would add a club similar to the Malibu club rather than strip clubs.",
            "Yes they will. This is GTA were talking about. Secondly you see guys in the NBA/NFL going to clubs despite having a family. They probably keep both sides completely separate and it's probably an open secret.",
            "I think they’ll be cheating on each other",
            "I swear if this is like RDR where your only options are decline/reject, ima be annoyed",
            "Didn't stop Michael",
            "Night club for drug meetups or whatever",
            "Why they gotta be weird if they go together. Going to a strip club with your girl is super fun.  All the strippers gravitate to ya'll. They love couples.",
            "Same thing I do with Niko and Michelle",
            "[deleted]",
            "They would go together like the hip couples on Twitter",
            "I mean Michael is married to Amanda but he can go to the strip club and he can pick up hookers",
            "Money laundering",
            "If they're relationship is poly then we should be fine to do whatever we want as either character, also who cares about a relationship it's a video game these ain't real people they're pixels, the reaching is wild 💀",
            "i hope i can stick my online characters finger in a strippers butt",
            "In the leaks they showed a mission were they both enter s nightclub..maybe entering the stripclub to talk to someone there is part of a mission most likely",
            "its a group activity",
            "i’m not sure they start as a couple. I personally think the beginning of the game is a flash forward that we get to play. Likely ends at some cliffhanger where we get the typical fade to black and “3 months earlier” text across the screen. GTA V started similar but it was a flash back. either way the three characters started off split up",
            "Same way as other games. Lucia might get on you but they’re not gonna change the way they function",
            "Speak for yourself",
            "Maybe Lucia can work there, and it'd be a little mini game",
            "Maybe like Gta V, someone is a traitor and we will follow Lucia after she was \"released\" from jail",
            "Lmao you know how many couples go to the strip club together",
            "Probably for a mission to meet up with a character to do a job in the game.",
            "Maybe they’re polygons or whatever the fuck",
            "Date night!",
            "It will be like real life. Just don't let your partner catch you.",
            "This is something I've been thinking about as well. I wonder if Rockstar will have Jason and Lucia be in an open relationship throughout the course of the game so that you can go to strip clubs or pick up prostitutes as either one.",
            "The same way people in relationships use it in real life",
            "they made Michael a family man able to fuck prostitutes they could’ve easily disabled that feature for him but they didn’t so this couple is  definitely gonna be cheating on each other",
            "michael and his wife we're a couple. that doesn't stop u from getting a private dance or even a hooker",
            "Front, Traphouse",
            "I wonder if they’ll even be DATING at the start of the game. This game might show their story unfold from the start and maybe they’ll be strangers at first. I’m sure there will be some kind of consequence for either party if they go in while dating",
            "I’m pretty sure it’ll effect the relationship and maybe it’ll effect the ending too",
            "its 100% perfectly normal not “weird ass” for couples to enjoy a strip club. Obviously if both consent and just have a good time.",
            "Man, this 8s VICE CITY! Lucia better understand that I wanna check out dem jiggly butts and Tattas. ",
            "Wasn’t Michael married with kids??",
            "Damn now I’m genuinely curious how the strip club will affect the couple’s relationship, I hope it won’t end up as another bad case of Rockstar’s ludonarrative dissonance.",
            "Ummmm….surprise!  Couples go to strip clubs. Frequently.",
            "given that its gonna take place in modern day, i am pretty sure youll be able to interact with the strip clubs just the same regardless of which character you're playing as, also tons of couples go to strip clubs together/allow eachother to go with their friends etc",
            "I mean who says they a really even a couple? For all we know they’re just crime partners who shaboing sometimes?",
            "This game going be so tuff",
            "Michael was married, correct? I dont think GTA characters have much in the way of a moral code beyond not killing children.",
            "You are technically still dating Michelle when you visit strip clubs early on in GTA IV.",
            "gta protagonist kill people so maybe cheating is nothing",
            "Probably some odd threesome.",
            "fuck it I want a full blown sex minigame between the 2, with quick time events and shit",
            "Business",
            "It’s alright to look so long as you don’t touch.",
            "Because i don't have to be faithful in a video game haha",
            "Prolly business since online already got the foundation of owning a nightclub",
            "Who said they’re a couple?",
            "Bro you’re like 10 go worry about something other than fictional strip clubs",
            "We really are desperate for a trailer 2",
            "We literally played as a middle aged married man in the last game",
            "I think it will have some Consequences like angry calls or relationship Broken kinda \nThe same Thing which happens in San Andreas",
            "She'll be a total pickme to appeal to GTAs core demographic.",
            "There’s a 3rd playable character in gta6",
            "“Weird ass couple”?",
            "Michael promised to not cheat on Amanda but hey you can still pay 70 dollars for a sucky sucky.",
            "It’s where he meets her.",
            "Maybe they have an open relationship.",
            "Same way my fiancée and I use a strip club. 😎",
            "i hope they both are straight to be honest (because protagonists always have been) ,we dont need no woke shit",
            "I think it’s kinda obvious. There in an off and on, “complicated” relationship. Don’t see each other for long periods of time… That type of thing. There not a couple, there just two people who’s lives just keep crossing paths at very difficult times.",
            "Jason will come to see Lucia but wait she is showing to everyone.",
            "I’ve seen couples in strip clubs plenty of times, I don’t get it but they do",
            "Maybe if you maintain the relationship well, they can have dates at the strip club together. I've seen lots of couples go to the strip club. If you keep them loyal then one partner doesn't care what the others do. An insecure/secure meter perhaps.",
            "Maybe she was a stripper like amanda? 🤷🏽‍♂️",
            "*phone rings. Showing Lucia is calling.*\n\n*Jason picks up phone.*\n\nJason: “Hey Luci, how’s it going?\n\nLucia: “Fine I guess. So what’s this I hear about you being a “good customer” at Jack of Hearts?”\n\nJason: “It was just for a drink, that’s it. And you even said that it was okay to just look, just as long as I don’t start throwing money at them.”\n\nLucia: “And it better be JUST a drink!” (Pauses and sighs.) Look, I just don’t want you to end up like how (insert ex-boyfriend’s name) was.\n\nJason: “And I’m not going to. You have my word. Listen, let’s hang out soon. Clear your head, you know? I’ll call you later.”\n\nLucia: (sounding depressed.) Yeah… sure… bye…”\n\n*Both hang up*\n\n*Alert on top left of screen 1: Lucia Respect -5*\n\n*Alert on top left of screen 2: You just lost respect from Lucia. If her respect from her keeps going down, you’ll loose player abilities with her and she’ll be harder to hang out with.*",
            "In gta 5, if you as one character (example, Franklin) start stalking another character (example, Micahel) for too long, they get angry enough to punch you into the nearest hospital. Besides that, no long term consecuences.\n\nThey could make it so, if one character cheats too much, the other comes and shoots you. With either permanent or temporal effects after that",
            "They’re poly amorous",
            "I really hope a cheating mechanic is in the game",
            "If there’s a honor system like in RDR2 then you’ll probably lose honor",
            "For cheating",
            "You’re telling me that the characters we play as are bad people?! B-but I thought the protagonist was always the good guy… /s",
            "I love following all traffic laws in GTA\n\n/s",
            "Or at least the player can have them do so.",
            "Bullshit",
            "🤣🤣🤣",
            "If only that applied in Red Dead. Having single adult men that can't go to brothels or enjoy prostitutes in the Old West is a juxtaposition compared to GTA.",
            "This is funny, but anyone who has played all the major GTA games knows they have gotten a lot more PC recently. I really hope they get back to\nmore of that dark atmosphere and lack of moral boundaries we saw in earlier games. I feel like there’s a whole generation of kids who were raised on GTA V who just think of it as some arcadey sandbox without much depth or darkness to it.",
            "It would be cool if there were long term consequences for cheating, which would influence how the game ends (like in RDR2).  Imagine if Jason or Lucia cheats a lot, then in the end you get a bad ending for the couple",
            "Go to the strip club five times in one week, Lucia walks in, caps your ass and you get a WASTED death screen.",
            "The equivalent of Michael texting you for bombing his house lol",
            "I’d imagine there would be a honour system like rdr2 but for Jason and Lucia’s relationship so if you do all the good couple stuff you’ll have a stronger relationship if not and go to strippers it would go down. Stronger relationship may improve stats/ability’s",
            "She comes in yelling in Spanish",
            "Maybe Lucia is a stripper for a mission and steals some high rollers cash or belongings. Or socially engineers some big wigs or something",
            "Or if you get a lap dance she will comment on a \"questionable\" smell on you.",
            "Compared to what his wife did, going to the strip club ain’t too bad 😂",
            "Tbf they were there to meet a guy  not to get lap dances but I agree with you",
            "There’s a whole generation of children who were raised on GTA Online and don’t understand how dark and morally ambiguous GTA games used to be. They just like flying wacky vehicles around and shooting colorful guns.",
            "Because everything in Grand Theft Auto games is morally right",
            "Also strip clubs aren't even that bad. Some couples even go to strip clubs together. Strippers being down to fuck the player in GTA V is the kind of \"men locker room behavior\" Rockstar is probably trying to weed out.",
            "LMAO",
            "Or call the other protag and ask to hang out. That would be pretty dope. Let's go bowling! 😂",
            "Maybe monogamy is present in your sims but definitely isn't in mine.",
            "Lol The Sims encourages cheating too",
            "They're quite literally glued at the hip in the poster",
            "Hopefully you'll be able to control both even while free roaming, you can't really do that in V which is pretty lame.",
            "If they do, I hope you can do either-or for both characters.",
            "Who would use them anyways?",
            "What kind of date is that💀",
            "Who says Lucia can't enjoy the strip club herself?",
            "This is the third comment I've seen about Lucia getting angry at Jason for going to a strip club but no one is bringing up the fact that if that is going to be a thing, Lucia will **also** be able to go to them.",
            "Noo",
            "Makes me think of the How I Met Your Mother episode where Marshall and Lily go to a strip club and find a stripper that looks like Lily and Lily insists on getting a lap dance.",
            "You can date strippres as Michael",
            "There was one in The Ballad of Gay Tony, so I wouldn't be surprised.",
            "That’s surprising to me",
            "How does that work though",
            "That may be true",
            "![gif](giphy|iiTXaJVjiSHew)",
            "Wholesome bonding moment ngl",
            "I think it is weird, but that’s just me 🤷🏾‍♀️",
            "Wait your are forced to become bisexual  when you go to the club? Goddamn im sorry guys, didnt know this rule",
            "literally, ill be surprised if they dont, please us gay people too rockstar </3",
            "They could make both partners bisexual, and you can hire male prostitutes as Jason and female prostitutes as Lucia. Make it like Cyberpunk and make it so your character can get with anyone.",
            "Seems like a safe assumption considering the penultimate scene in the trailer.",
            "You can even pick up hookers in GTA Online with a female character, I think it just uses the male character animations lol",
            "In V Michael will mention his free roam crimes to his therapist, so I'd say it's somewhat canon.",
            "Yeah, you can literally kill thousands of civilians and cops and then no one cares about it or mentions it lol",
            "Reddit is so fucking stupid you have to put /s",
            "Eh, I think there is plenty of darkness in GTA V, it's just juxtaposed against the material excesses and glitz of LA. \n\nDarkness doesn't make something in any way more mature or more adult. Edgelord content is typically attractive to teenagers and people suffering from arrested development, it's not really mature content. \n\nLike this thread is about how strip clubs will be used in the next game. GTA V had a strip club you basically ran and let you get lap dances. What else do you need, full penetration?",
            "The only “dark” GTA was IV.",
            "I’d be surprised if there is a good ending to be honest",
            "Have you ever played The Witcher 3? A wonderful game that has features very similar to these you mentioned.",
            "Honestly thatd be cool. Especially with how popular relationship rp was w cyberpunk’77. Rdr2 was apparently a big base point for gta6 i can see consequences coming back for different endings and such",
            "what did his wife do",
            "he was cheating too",
            ".....you don't know that.",
            "Underrated comment… \nKids these days don’t understand the grind on a ps2 22 years ago in vice city for that Frankie outfit…",
            "So? It's just a poster.....",
            "Impossible",
            "Impossible",
            "😈😈",
            "I was just making a little joke. I don’t think it’s gonna play out like that at all. I pictured a getaway gone wrong, they’re yelling at each other with 4 stars and she brings it up.",
            "Well, the Hercules in TBOGT wasn't precisely a Stripclub, it was a Nightclub, like the Maisonette 9 wasn't a Stripclub either, but I get your point.",
            "She’s bi, and I’m straight. Works out great.",
            "atleast, thats what im assuming, i always judge the quality of the gta game by their clubs >:)",
            "Yes I am",
            "Fr, like there’s absolutely no reason to go to a strip club if you’re in a relationship, unless for business.",
            "If that kind of stuff not getting added \"surprises\" you, boy, you're in for a lot of surprises.",
            "I can see the anti woke people going insane over this feature now. \n\nthey won't grasp that this is better than getting rid of prostitutes and strip clubs in general.",
            "What is /s?",
            "It’s not necessarily Reddit’s fault, it’s just the text not giving a lot of social cues. There’s no face or body movements to give the impression of sarcasm or whatnot",
            "YOU my friend are the stupid one, bro HAD to ruin the joke. mouthbreather activities",
            "It’s more about the feel of it and how that washes over the more anti-hero aspects of the game. It just feels very arcadey and cartoony by comparison with too much wackiness. I think that makes people not really appreciate that aspect of the story telling and even not realize how it used to feel. Really I’m agreeing with you about the juxtaposition because that does take away from the feel of it. But at the same time there are definitely topics that they used to have social commentary on that they won’t touch anymore. That’s just objectively true.",
            "That ain’t true",
            "Why? There was a good ending in GTA 5, San Andreas, Vice City, and 3",
            "oh yknow, fucked a tennis coach, sent her husband into a rage (ultimately this one falls a lot on Michael too,) and then her actions pretty much indirectly causing the deaths of multiple government agents, a shit load of Chinese nationals, gang members, and a Multi-Billionaire. Not to mention if you pick the option to actually kill Michael, you can really see the dominoes falling from her fucking that tennis coach lol",
            "Literally caused the whole game.\n\nIf she wasn't caught that day, micheal never would have robbed the jewelry store, meaning Trevor would have assumed micheal was still dead, and well that's it.",
            "Yeah that was only for one clip. The other clip was Lucia chilling in the strip club during free roam lol",
            "Maybe they like to watch together lol.",
            "Why would it be impossible? lol",
            "You do you sorry bro I just be trolling. Please don’t take it in a bad way 🫡",
            "The anti woke people were already up in arms about a latina female protagonist. I wouldn’t go by them. They actually probably won’t like any prostitutes and strippers in the game anyway.",
            "(Satire)",
            "oops didnt read the next comment guess im one of them now",
            "/s ruins the joke immediately.",
            "yeah, I didn't get that at all. People talk about GTA V like it's Saint's Row but it really isn't. The most you can say for it being \"wacky\" is Trevor doing insane shit, but it's also established that he is insane, so it fits with his character. \n\nGTA V is definitely more of a dark comedy than, say GTA IV, but that doesn't make it any less dark imo. It's just in GTA IV they're very obvious about it and focus on how sad/angry Niko is — which is fine but, imo, just because it's obvious doesn't make it better. \n\nI think sometimes video game fans, especially young ones, have little exposure to really good literary fiction, and they see something like \"Niko has regrets\" or \"Arthur is scared\" and think what they're seeing is top-tier character work, but really it's just like, basic good character writing.",
            "Yes it is lol. Vice City and San Andreas were both super goofy. III didn’t have a talking protagonist and still managed to have the off brand humor of the series.",
            "I’m just going off the vibe from the ending of the trailer I got.\n\nAnd RD2",
            "Bonnie and Clyde, Thelma and Louise - crime duos don’t end well usually",
            "San Andreas doesn't have a good ending arguably as most fans say how lonely the ending feels it literally just ends with Carl leaving whats left of his friends and family who are celebrating to go get \"some air\" \n\nHe is clearly still affected by the fact his childhood friends betrayed him and that his mother is still dead. And his life has been through a rocky adventure.",
            "Amanda says she never cheated until Michael did. So they both cheated but depending on what you view as justified Amanda only did it after Michael started.",
            "oh, i thought you meant she did something AT the strip club, im a bit slow sorry",
            "Michael cheated first, then she had a revenge affair. Then they opened their marriage.",
            "Pretty sure Michael did all that.",
            "Oh GTA 5 was so good lol",
            "she was faithful until Micheal cheated",
            "What about her being in gta iv dating website? Idk if that's really her but it really sounded like her because she describes her being on witness protection and her life being boring because of it",
            "Don't worry bro, no problem here :)",
            "they'll still play the game one handed while staring at Lucia they can deny it all they want lmao.",
            "Or sarcasm.",
            "Okay ty",
            "Yeah but that basic good character writing is what lacked in GTA V and part of that is because of the three characters system too. You don’t get to feel as much for any one of them individually and immerse yourself in their world because your attention is pulled in three different directions with three different backgrounds and somewhat conflicting motives. It’s not like I’m young or not well read like you’re suggesting. Many people agree that V was just a lot more “surface level” compared to the older games, and not just IV.",
            "I’m not saying they weren’t goofy, IV has goofy aspects too. But there’s definitely topics that they used to make social and political commentary on that they don’t really touch anymore.",
            "Yeah,  it seems like lucia will be a snake",
            "Red dead 2 had a good ( well better ending )",
            "Two wrongs don't make a right",
            "Yeah but Michael said he was stopping",
            "LOL it’s okay I should’ve added a comma before I posted",
            "What make michael enraged was the fact she fucked the coach on his house and his bed. They had an agreement to not do anything inside the house.",
            "I never knew that Michael cheated first. This changes my whole entire perspective on Amanda.",
            "I mean even if that was the case, getting revenge for cheating by cheating is a bad tactic",
            "I thought it meant serious",
            "I'm not talking about you specifically, I was talking more broadly, and a lot of that is based on my experience on the RDR2 sub where people act like Arthur Morgan is the greatest character in all of media because he was sad. I love the game but c'mon.\n\nEither way, I still disagree with you. I thought there was plenty of great character writing in V, I just think because it isn't obvious — dark, brooding criminals expressing their regrets constantly and being angry — it's lost on some people.\n\nMichael is a deeply insecure man who lacks self-awareness and can't cope with his conflicting desires to both be a normal man with a normal family and his impulses toward high-stakes chaos and violence. Michael doesn't *need* to be a criminal — he already has the wealth. But he needs to feel *alive*, and he can only get that from his criminal activity.\n\nFranklin is ambitious, grounded, and driven, but he can't see that his drive to make it out of the hood via criminal activity will ultimately leave him alienated from everyone except for his criminal allies — and depending on which ending you choose, potentially even alienated from them.\n\nTrevor is a maniac whose only real human quality is his deep, deep loyalty to people he considers his allies, even if he actively hates them like he does Michael. He is impulsive, destructive, but buried beneath all of his psychotic behavior loyalty keeps him tenuously tethered to reality.\n\nThe characters are well written, they just aren't sad or angry all the time, so people think they aren't serious enough, which is silly.",
            "Examples?",
            "What if Lucia is an fbi agent like how they did Niko in gta 4 with that one girl",
            "RD2 has a “good” ending but it’s more of a good ending for Arthur’s soul and his redemption.\n\nUltimately Arthur’s fate is the same no matter what. But if he tries to be a better man, he gets redemption.",
            "Well they're both clearly not very good with agreements lol.",
            "She said she was faithful to Michael until she found him *in* a stripper.",
            "I honestly don't think that will happen, Jason and Lucia will either have an open relationship or the strippers/prostitutes will not be usable, like on RDR1.",
            "It wasn't cheating because Amanda and Michael were in an open relationship. They just agreed to not do anything like that in the house which is why Michael got so angry.",
            "Amanda had no real choice but revenge i guess, she can't leave him both due to selfishness of losing the benefits Michael has. And she also probably might lose the benefits his \"deal\" with Davey gives him. \n\nAmanda does come close i know but i guess she was just conflicted during that time.",
            "You’re likely not the only one. That’s why it’s kinda stupid. If your sarcastic tone isn’t clear in your message, then the humor was already lost.",
            "thats /srs",
            "/s is sarcasm (like how /j is jk/joke) /Srs is typically meant as serious",
            "Still haven’t gotten over that. Fuck that girl.",
            "lucia was in prison. if anyone if fbi its jason",
            "That blows my mind. I thought she was just toxic and cheated on him because he got bored with life or something. It’s been over ten years since I actually played the story mode so most of it is just a blur to me.",
            "I agree, but there’s also a common issue that a lot of people on Reddit have the mental awareness of brick and don’t realize your making a joke even when you’ve spelled it out for them",
            "Michelle is said girl",
            "True",
            "Nope, Michael in the middle of his mid life crisis had an affair, and the way Amanda puts it makes me think he caught him mid penetration.\n\nSo she had revenge affairs, and she even got an throat std from him, that's why she won't go down on him.",
            "Let that be their problem. It’s more fun when people get genuinely mad at jokes, especially when they don’t know you.",
            "Karen",
            "Woooow. I was out here feeling so sorry for this dude like he was the victim of his own family. Really he set the ball in motion by doing it first. It makes me understand her more, because she was hurt and betrayed all this time."
        ]
    }
}