{
    "DISCUSSION MEGATHREAD: SYNT #75": {
        "title": "DISCUSSION MEGATHREAD: SYNT #75",
        "score": 15,
        "url": "https://www.youtube.com/live/R-u2gC_CQJI?si=8l3dxOKkV8REHhWY",
        "content": "",
        "num_comments": 52,
        "comments": [
            "i love how giddy dan gets when they find the most moronic far right content",
            "begging superchats are cringing me TF out.",
            "Wom Ward",
            "Can’t afford a membership rn, can anyone give me a cliff notes version of what he says about the kendrick concert pls (if he talks about it)",
            "Bro Ethan chews food like a 4 year old 😭",
            "My issue with Ethan chewing is he smacks his lips every couple of words after taking a bite.",
            "Real question: What does Terrance Howard think 2x1=? Would he say 2? Does he think 1x1=2 and 2x1=2??",
            "PSA to Ethan: artificial sweeteners can cause diarrhea/digestive issues for some people. I don't know how much of it he's ingesting in a day but it doesn't take much for me and I'm ruined for the next 48 hrs 💀 if he hasn't done it already, it might be worth cutting all fake sugar for a while to see if the tummy troubles get better. From there you can slowly add them back one by one to see if any of them trigger your symptoms.",
            "I love these episodes, they seem more chill, Ethan seems more at ease. Good times.",
            "Petition to have Tom Ward on every SYNT!",
            "Please have Olivia do a deep dive on the OK Baby update. Remember their bizarre break up video you covered? Kyra has now married her best friend's husband and is pregnant with his baby. She had a sex podcast with the best friend before she stole her husband. This will be her 5th child and her Dr told her not to have more children bc it's not safe so Oscar (her ex from the break up video) got a vasectomy right before she ended things. It's so full of tea and we've got to cover it more!",
            "Laura Clerys new podcast with her ex husband about 30 minutes in he brings up h3 and being hit up by female followers his reaction to when the crew brought it up and also after they announced their separation. He’s a character to look into for a proper deep dive it’s been crazy to watch",
            "PLEASE get Martin to rate freedom water ",
            "Absolutely hilarious that the leftovers pun went right over their heads considering he literally hosted a podcast named LEFTOVERS with this exact pun for two years",
            "24 hour ban for saying I’m bored during a science stream ama <\\3",
            "Pretty dry one today",
            "Anyone looking for people to go to the show, hmu! M34. Looking for friends, not (necessarily) dates, but single ladies over 25yo looking for a date, I'm here :)",
            "[deleted]",
            "Ethan is a far far smarter he lets on. He is right about the dunning Kruger effect, it affects everyone and it's about over confidence rather than how dumb someone is. The Dunning Kruger experiment tests self-assessement on a particular task and measuring neuropsychological humility.\n\nPeople mistake DKE with confirmation bias all the time. Dr De'Grasse is wrong on this too. Terry Lawrence is a manic episode rather than on the DKE. Lmao.\n\nFrom now on when Ethan speaks, y'all listen.",
            "Wait whaatttt he was there?!",
            "Didn't say much. It was good and Kendrick supposedly sang \"Not like us\" 5 times in a row which is funny.",
            "If you have cashapp, I'll send you some money for a membership if you'd like. you can dm me",
            "It's the same key of E.",
            "same kiloelectronvolt (keV)",
            "That and proton-pump inhibitors(the antacid medication he takes) do that too.",
            "Yeah and if you drink tons of powder fiber, stop and see what happens.  I've had bad experiences with fiber that the opposite effect as intended.",
            "I'm realizing this is probably me too. I can't resist a zero sugar soda but I'm on the toilet all the time.",
            "Shit posting gives me explosive diarrhoea. So please cutdown on the shit posting otherwise Ill shit myself.",
            "Hiding Tom Ward behind a paywall: -9 hoe points",
            "I second that",
            "Also, the best friend who was first wife of Preston's released a version of Kendrick's \"euphoria\" with lyrics she wrote about the cheating scandal with Kyra. Would love to see Ethan's take on that.",
            "He has - [https://www.instagram.com/martinriese/reel/CzFKKuMvLKF/](https://www.instagram.com/martinriese/reel/CzFKKuMvLKF/)",
            "That's actually kinda crazy they were thinking of banning a paying member for a single comment saying they're bored during a science talk",
            "[Question #1](https://www.youtube.com/watch?v=iZlpsneDGBQ)\n\nedit: downvoted for making a joke, can yall lighten up?",
            "Sounds kind of James Charles'ish...",
            "Are you single? Because you have other posts saying you're married.",
            "Wth you talking about, Tom was a joy to have on and the vibes were super fun and chill with him there",
            "I think someone needs to get outside and touch some grass",
            "Hard disagree!",
            "Tom seems like a sweet guy but just not an entertainer.",
            "He’s been popping into SYNT",
            "One, two, three, four, five, plus five",
            "So awesome!  ",
            "Thanks Jake dolittle for your expert advice",
            "he didn’t drink it though ",
            "I dont think they realize how much this shit hurts them in the long run. Why would anyone participate in your community when a sarcastic quip or light criticism could get them permanently banned? ",
            "I 100% agree with them, saying you're bored in the chat of a show with thousands of viewers is the most entitled bs I can imagine.",
            "ban only stops chatting, they can keep watching, like a wide majority of members who watch without chatting.",
            "True, I will send my hard earned money tomorrow when I’m free as an apology.",
            "how does it sound like that?",
            "K thanks for replying",
            "Recently divorced. Yall suck",
            "Yeah according to what they said in the outro they Ethan and Tom (plus whoever) had a meeting scheduled right after the show so it sounds like Thursday PM is their usual"
        ]
    },
    "DISCUSSION MEGATHREAD: This Influencer Killed Her Cat - H3 Show #26": {
        "title": "DISCUSSION MEGATHREAD: This Influencer Killed Her Cat - H3 Show #26",
        "score": 0,
        "url": "https://www.youtube.com/watch?v=GkAiYALkd9Y",
        "content": "",
        "num_comments": 1268,
        "comments": [
            "I know for 100% fact Ian is just straight up playing solitaire or something on his computer right now, and has been for the past 3 hours",
            "I still haven’t figured out why Ethan decided to conduct the interview like that… that’s not how you interview someone, especially when you have no proof they are in the wrong. A cat doesn’t get that sick over night, she had plenty of time to take her to the vet. As a cat owner, I’m always on high alert for any symptoms I notice. Cats are good at hiding their pain, so if it got to the point of what we saw in the video, she must have been suffering for a while. I’m disappointed by how Ethan handled this issue.",
            "Appreciate Olivia and Dan, especially this episode.",
            "Dan proving once again why he's the most level headed",
            "PLEASE if you see a dying animal you should 100 percent try and rescue it. The fact that she had this cat for months sick and he tried to rescue this cat speaks volumes to each of there characters if you ask me.",
            "Am I the only one who is suspicious that she never took the cat to the vet EVER, like never a check up for vaccines or a microchip or nothing? Like or did she take him to the vet before but not recent enough.",
            "\nI’m having a really hard time with the conclusions the crew are getting to….\n\nI think when they did the interview the guy was obviously flustered and forgetting specific details, but he was still implying a lot of things. Like to me it was obvious that he was at that house and was passively observing the cat for a decent amount of time and noticing the way it was being treated, to me it sounded like there was a conversation between the roommates about the condition of the cat and it seemed like they had all agreed upon taking action if this girl wasn’t. \n\nOn top of that Olivia is right, during Covid it would’ve been incredibly hard to get a pet in. And to top that, yes, urgent cares do not have the same amount of care an actual vet would. And why would you bring a sick animal to wait hours in emergency, just to get subpar care? Wouldn’t you rather the animal feel safe and wait a day or two when you KNOW the animal will actually get treated and correctly observed? \n\nNot to mention the guy literally said he thought the cat was starving at first, and didn’t realize that the cat maybe had more going on which is why it took an extra day or two to get to the vet. Also coming down on this guy for waiting 3 1/2 days compared to the MONTHS this girl had the cat.. like really? \n\nWith the seizures too.. cats don’t randomly have seizures, usually that happens because of an underlying condition that requires medication. I wouldn’t be surprised if that was happening in her care before he took the cat.\n\nWhen I originally heard about this situation I had watched her first tiktok about it. My initial reaction was that something was off because if I was in her situation and my cat got out and it was sick, I would be destroyed. Even years later I find it hard to talk about my dog that passed because I was away at college when it happened and I feel incredibly guilty that I wasn’t there for her. Imagine thinking that your cat is sick, lost, and alone and just talking about how “you didn’t kill your cat”. Like please, and the fake in and out of crying on her videos… really girl? \n\nIn conclusion I would’ve done the same thing that the guy did. I’ve been in a similar situation before with a roommate and I did speak with him, eventually he decided to give the cat to someone who would care for it. But we don’t know this girl, that conversation could’ve been had between other roommates. Ultimately if the cat was this sick to the point where he brings it to the vet and their best advice is to put it down.. it was very obviously neglected, and it bothers me how this guy is on the hot seat and not the girl. \n\nI get they need to question every motive of this guy but they did it so harshly and focused on small things and it felt like they missed the point of what he was saying.\n\nI love the H3 podcast and I’ll always be a dedicated viewer but I feel like they missed the mark with this one (as doobrik would say)",
            "BUT YOU WERE GIVEN THE OPPORTUNITY, GIRL. she’s saying that Seven got sick often, and she never took her to get checked out. you were given the opportunity to address her health concerns multiple times and YOU DIDN’T. \n\nthe guy who took her cat is definitely a bit strange too, but i don’t think he’s responsible for Seven’s death at all.",
            "I knew this was going to go downhill when the girl dropped a superchat.",
            "This is sad, as someone who works in the vet field regardless of what happened the cat should not have gone 3 weeks without seeing a vet… also the shelter should’ve been contacted only to discuss medical history and advice, she should have absolutely seen a vet a few days after symptoms pursued. Yeah it’s her first pet but don’t get a cat then if you don’t know what you’re doing 🥲 she has more than enough $$ I’m sure to have gotten her adequate care.",
            "This is probably the only time in h3 Reddit history that I believe that the insane amount of criticism the gang is getting is warranted.",
            "I don’t think he deserves the hate, why would he take the cat and spend money on the visit? Why would he even take the cat even in the first place? He was only outed because someone leaked his DMs, so I don’t think he did it for attention.",
            "That girl should be banned from ever owning an animal again she tortured that cat",
            "For a vet to recommend putting down a cat, that cat is very far gone \nHe would not have been able to neglect the cat enough in 4 days for the vet to recommend euthanasia. Saying that the cat died under his care is ridiculous. That cat was neglected for long enough that the vet literally did not believe it was going to make it. A cat won’t get that bad in 4 days. That’s an extended period of neglect. Ethan and hila were unnecessarily hard on him. And AB trying to say he stole the cat for content is so fucking wrong. I think they owe Jacob an apology",
            "Why are we making so many assumptions 😭 ESH!!",
            "Hila was so rude during the interview coupled with Ethan yelling to interrupt and ask if he was in love with Rhegan??? So inappropriate I never come on the reddit but I had to see if people agreed",
            "I just want to add, on NYE one of my cats got super sick so I couldn’t take him to a vet unless it was an emergency vet and I wasn’t sure of what to do. I don’t even have a Chewy subscription nor have I ever purchased anything from them but I was able to use their online chat with a vet that I could let them know what was going on and get some advice. The advice I got was to monitor and see if the cat got sick again and if it did take it to the emergency vet/ take him in the next business day that my normal vet was open. Js, even without bringing the cat in, there are ways to get better advice 🤷🏼‍♀️",
            "She's a terrible owner. When my cat, or dogs are sick, I take them to the vet and I would never get a new cat and not take them to the vet. And if my cat went missing, I would not go out partying. Jacob was wrong to take the cat but he did not kill her. Three days is not crazy for the vet during that time. At least he bloody tried, the reckless speculation by the crew was kinda off-putting. It's just really sad.",
            "**A cat doesn't get in that bad of shape in less than a week.** I think she had FLV or FIP and I don't think R did due diligence at all to notice the signs.\n\nI agree with Dan that the other guy, J, was stupid and young and didn't do right by the cat either/maybe had petty intentions, but by the time he was involved, it was way too late anyway.",
            "Is this girl an idiot?",
            "I don't know if Ethan and Hila have never come across as more out of touch lol",
            "i don't think this guy was in the right but his point that the cat had been sick before and she hadn't ever taken it to the vet is damning. if you love your cat so much why are you just letting it get sick continually and doing nothing about it? what a shit show",
            "It’s so weird to me how they immediately started dogpiling this guy; I mean seriously, stressing him out about “You could’ve taken the cat to the vet” \nhe told you guys the reasons why he couldn’t \nand then to have the gall to tell him “You could’ve waited in line but- you didn’t want to wait - you just didn’t want to wait!!” \nwhen you guys were literally just talking about how easily cats can get stressed out … but yeah, seems like a great idea to wait in line for hours with a sick kitty isolated in its crate!!! God i hate how passive aggressive they can get when they think they’re right about something. It’s so fucking annoying.\nAll in all everyone is just odd and annoying in this whole situation.",
            "ISTG the OJ trial took less time to decipher. Why are we picking every bit of this story apart? lolol",
            "owning cat at content house should be banned",
            "The vibes are so awful rn. This is such a sad and intense story.",
            "cats can't lose 3 POUNDS in 4 days.",
            "Why did AB just make up an entire scenario in his head about Jacob taking the cat just to play the hero, and then play it off as real?, it was pure conspiracy. That was insane, and against someone trying to save a poor neglected animal...",
            "Yikes, this whole interview seems unnecessarily aggressive and pointless.\n\nWhere are the goofs and gaffs? 😭",
            "Hila is taking it too personal, yes if someone stole my perfectly healthy and spoiled dog I would go after them. She was neglecting the animal!!!!! The cat died!! Did he see enough to justify taking the cat, probably not but she killed her cat period.",
            "They could have milked it harder and got the girl to call in if they didnt go so hard on him in the interview. She noped out after seeing that. Also I find it weird how Ethan just automatically takes the side of the girl in most cases like with Daisy. \n\nWish they let Oliv and Dan speak more on this as they seemed to have a more level opinion on the matter.",
            "This is a really sad and depressing episode.",
            "This episode makes me wonder how you guys view cats in general? Why is their abuse less severe to watch than the supposed dog video? Would you have shown videos of a dying dog too? If it was a dying, severely malnourished dog with secretions coming out of the airways, diarrhea, matted fur and seizures that got saved from a room in a loud LA party house… would you have grilled a person who stepped in and took it to the vet in that case?",
            "I liked exactly nothing about todays episode. Weird ass takes from Ethan, Hila, AB, and even Love. Grilling the guy and then claiming he did this because of some jealousy thing or other ulterior motives. Seemingly siding with the neglectful owner. Showing a video of a seizing cat?? Seems like everyone collectively lost the fucking plot this episode. It also sucks that this ep is so close to the break because now they’re gonna have to rehash this whole thing on Monday because of the backlash, or because the girl decided to call in, or some other idiotic reason. I don’t see goofs or gaffs on the horizon and it makes me sad. RIP Sevyn, the ONLY victim in this situation.",
            "I’ve been a silent watcher for years but this was insane to watch. The grilling everyone did on Josh was so unfair. Do I agree with how he handled it, no… but honestly it seems like there were sincere intentions. I also feel more research should have been done on Rhegan and all her deleted videos on the topic because her “proof” of Sevyn not having matted hair and other “proof” she tried to debunk was comedic and ridiculous. She never has any decent pics of sevyn before their passing and everything is a screenshot of a video because she wasn’t a present cat mom at all it seems. \n\nThere’s also been a lot of other controversies of Rhegan lying and being an overall shitty person so honestly I’m not shocked or surprised this happened. This whole stream just came off like the pod just wanted to protect the “girlies” and just dog pile on the “incel”. Not cool. Really sad how everyone approached such a sad and sensitive topic. At the end of the day, Rhegan was responsible of HER cat and should have never let their poor pet get that bad where someone felt they needed to intervene. Anyways😔 \n\nRIP Sevyn. The true baby and victim of this horrible situation.",
            "I’m surprised they chose to talk about this after they just discussed in a recent ep how people are having a hard time watching the more serious topics",
            "Ideas for content that aren't 2 hours of animal abuse litigation:\n\n- Put a go pro on Ducky (corner camera)\n- Dan teaches Olivia Warhammer 40k (12 hour stream)\n- Piss challenge\n- Watch Air Bud In Silence. Lights Out",
            "The way Hila acted this episode was absolutely gross. Willing to put this dude over so much scrutiny but not the woman clearly not taking care of her fucking cat. Then she has the audacity to say he knows nothing about taking care of cats? Hila, you don’t know shit about it, clearly.",
            "The end of the episode just felt like they were playing Among Us. Not cool and kinda disrespectful to the dude who actually went there and showed face for his actions.\nMeanwhile no accountability for the owner who did nothing but play victim.\n\nDon't let idiots adopt pets ...",
            "This whole ep should have been buttoned - a 40 month member who’s never skipped an ep",
            "I really wish this topic hadn't been covered the entire episode, it was too difficult to watch for this long.",
            "the way this woman dodges responsibility for living with 10 other people and doesn't even refer to her own cat by name? did you even take YOUR OWN cat to the vet after you keep admitting it was sick?   \nThe fact that Jacob spent $600 to get tests after 3 days, and talked to other people in the house (and later his Mom) about taking Seven into his care because of the abuse leads me to believe that people were all hesitant to get involved, but they needed to intervene.  \nMy theory is this new guy was concerned and probably didn't want to cause any awkward confrontation about animal abuse to  someone he lived with, worked with AND possibly hooked up with in the past without tarnishing his job/reputation or embarrassing anyone. he had experience taking care of a cat and probably underestimated how sick the cat was (also probably due to conversations with Reghan saying Seven was sick all the time). Getting a cat to the vet in 3 days during covid is way more than 9 other people did in that house for that cat.  I think he also probably has some resentment for reghan with how she acting during the time he had to deal with it. This guy was fucking stupid for not communicating with her at all but IMO i do this he had the best intentions.\n\nSo so sad but what the fuck is up with Ethan and Hila's attitude towards this guy when Reghan has so many red flags (that other people also vouch for)?\n\n  \nSide note: Content houses need HR department",
            "This girl is obviously wrong to some degree (provided every ounce of charity that I can muster), and they’re inviting her on the show while criticizing the guy who did the right thing…\n\nI’ve never heard so many irrelevant points and suppositions without merit before in my life. “The cat definitely weighed way more 4 days earlier”…literally wtf are you talking about Ethan, you think the cat lost 3 lbs in 4 days? This is hard to watch",
            "MEDICAL NEGLECT IS NEGLECT. \n\nAnd we KNOW that the cat was medically neglected from Rhegan herself. Josh did the right thing despite the means being questionable.",
            "It was extremely frustrating  to watch the  crew analyze and critique the  actions of  the man who saved the cat more closely than the person who abused it to  begin with. I actually was shocked to hear some of  the comments made. Crew members saying things like \"the  cat dying two days after  it  was rescued is suspicious\" or  \"maybe taking the cat to a different  environment made things worse.\" (obviously paraphrasing) I understand these people don't have abuse training, but  when you  come across an animal or  a child being  abused by their caretaker,  you absolutely  do  not try and  convince  the  abuser to do better.  You  Absolutely do remove them from the abusive environment and take them to a professional who can treat their condition, which is  exactly what the young  man did. The first  thing you do is provide  SAFETY for the  victim and then begin treatment. You don't see a living thing  suffering and try to argue with the victim's ABUSER to take better care of  it. Honestly the speculations  that he may have made the situation worse or  even  had bad intentions coming from certain crew members was  disturbing and gross. His mom was right, at least the cat died  around someone who cared about it. And then the comment about changing it?s environment, sure maybe it would have suffered longer and died a  few days later alone in a closet had he not rescued it, but it should  go without  saying that is not  a better outcome!",
            "This is the saddest episode and the most out of touch Ethan and Hila have ever been. Left a bad taste in my mouth.\nRIP Sevyn",
            "Hot take but I don’t think he deserves the intense third degree. I do think he was careless but he tried to do the right thing even if it’s too late",
            "I would rather hear them talk about literally anything else",
            "I was pretty harsh on the dude before, and I'm still think he did some things wrong, but Ethan's going off a little too much. What are we doing lol. \n\nChat was out for blood and they got it.",
            "I really hope Ethan and the crew see how bad these takes and decisions were. Please apologize to Jacob for attacking him, his intentions and coming up with wild irrelevant theories. Please do NOT platform the animal abuser in this situation. We do not need to hear any more sides. Let Sevyn Rest in Peace.\n\n1. Why would you ever show animals suffering/dying/dead and think that’s something entertaining or part of the bit. This is really distasteful in my opinion to Sevyn — a once living creature. How would you feel if this were your pet? I can’t watch things like this, let alone thinking about someone playing videos of them suffering in the way it was done on today’s episode in such a trivial/distasteful manner which discredits the animal and animal’s life. \n\n2. Animal suffering and abuse is not fun, “drama” or something we should be discussing with the tone of todays episode\n\n3. You should not be defending the animal abuser and then aggressively coming after someone who was misguided but at least was trying to help. This girl let her cat suffer for 4 months, at the very least she was very neglectful. Your cat should not be repeatedly sick and never go to the vet. WTH? The cat weighed 3.8 lbs when finally taken to the vet? That is a cat that has been suffering for a prolonged period of time, and without any vet visit or true care? Disgusting. \n\n4. The speculation and wild theories and assumptions being made were out of line and frankly just not at all appropriate for this topic\n\nI usually don’t comment on things. I have watched the podcast since 2020 and I never have been left with such a bad taste in my mouth from an episode. I genuinely like everyone on the crew and Ethan and Hila. This episode like some sort of twilight zone echo chamber. I would expect the cat owners on this Pod to have better takes. And Ethan and Hila having dogs and going through Shredder’s illness and passing, imagine shredder going through that with a neglectful owner. All the time you spent researching what he can and can’t eat, trying different foods to get him to eat. I’ve been there. It’s all consuming, because we care and we just want them to be happy and healthy and “better”. Sevyn was suffering and did not have pet parents like that. I know you are dog lovers. Please also extend this to being animal lovers. If you are so ignorant on a topic, then maybe try to not make wild assumptions and theories and go off of vibes. This situation is sad, and depressing and this episode did not help anyone. Please do better.",
            "Why are we making even MORE assumptions after grilling that guy for MAKING assumptions?? \n\nUgh, I think I need to check out of this ep. Horrendous vibes. 🫡",
            "I know people were very against the video being shown but I want to point out that the cat seemed very comfortable with him and not traumatized like Hila wanted to hold onto so deeply. Yes, some cats have a hard time readjusting to new environments but not everyone. In the video the cat leans into his petting which to me, who has owned cats, indicates that it trusted him to some degree. Cats that do not want to be around people, especially when sick, will find a place to hide. Cats are especially known for hiding when they are sick and yet this cat looked comfortable with him.",
            "Idk why everyone is ignoring the fact that she said herself she knew she should have taken it to the vet and DIDNT. Thats neglect",
            "just assuming the man's motives were romantic is kind of gross",
            "God wtf!!! They're harping on hin taking 4 days to go to the vet and the bitch didn't go AT ALL!!!!",
            "Love y’all but imma skip this one.  I got maybe 20 minutes into the cat segment and had to tap out. For anyone still watching I’m wondering if it’s actually necessary that this story take up pretty much the whole episode? Seems like a heavy topic to spend this much time on.",
            "Why is Ethan always talking about cats?",
            "Also fuck having an episode on a cat dying, and then choose not to even villanize the actual abuser of the cat. This was a hard watch all around. I don’t know what they were thinking with this.",
            "the fact they wanted Rhegan to call in was shocking. I thought Ethan was like a die hard animal lover? Why platform someone who abused theirs? Not feeling the peace and love lol",
            "She neglected this cat!!!!!\n\nI think this kid did something he thought was the right thing to do, which was not necessarily the right thing to do. But at the end of the day, this cat didn’t die in his care because he did anything wrong. \n\nShe neglected this cat!!!!!",
            "Why because Bobby didn't show up did we go down a huge rabbit hole accusing a guy of all sorts of shit because Hila had bad vibes towards him? This is a super cringe episode. Also who only has like four photos of a cat they love?",
            "Also it is SO irritating to know that this will be brought up on the podcast like it’s just the “viewers bitching like they always do” as if this isn’t different. \n\nThis isn’t people not liking a 10 minute moderately awkward interview with a guy making questionable jokes. This is people pointing out the blatant hypocrisy of two “animal lovers” excusing the abuse of an innocent kitten, meanwhile asking to see the literal corpse of said kitten as if they wouldn’t be horrified to see the same image if it were a dog.\n\nLook inward. Seriously.",
            "They’re being way too harsh on this guy IMO. Not saying he didn’t fuck up or wasn’t a little weird but I think he thought he was helping",
            "I don’t like how they are coming at this guy. He seems strange and could have done some things different but I don’t think he was at fault for Seven dying.",
            "Wow, what an absolute stinker of an episode. You tried, AB. But the subject matter and Ethan’s & Hila’s behavior couldn’t be salvaged.",
            "A 9 month old cat does not get to 3 pounds after a few days. That is the result of an extended period neglect/sickness. It was clear that the cat had underlying health issues that the owner at the very least noticed some signs of (sickness, diarrhoea) and chose to do nothing to properly address it. He shouldn’t have taken the cat from its owner that’s for sure, but you could imagine a young person seeing an animal in that state would think they are doing the right thing.\n\nThe way that Ethan and Hila were harping on 4 days that he tried to care for it on his own before taking it to a vet, then hanging onto the idea that this was done on purpose due to a crush/previous relationship???? Absolutely insane end to the episode after going through all the evidence against the owner.\n\nHe shouldn’t have stolen the cat. But the owner should never have let the cat get to a state where someone felt that stealing it would help, at least he tried to do something. Just insane the way the opinion turned so heavily on him.\n\nAlso, this was meant to be a reply to another post that expressed disappointment with the tone shift at the end of the episode, but the post has conveniently disappeared, along with others that I saw and upvoted.\n\nBless Olivia for trying for always offering grace!",
            "Ngl this was probably the worst episode yet lol",
            "I believe him. I don’t get Hila’s hard line. The cat was clearly unhealthy enough for it to be concerning. His story makes sense and he seemed genuine. Especially in the face of all the pushback on everything he’s saying on live! The cat should never have been in that house with a bunch of partying children.",
            "i love the crew and the show but god when it’s bad it’s BAD… at least olivia attempted to share a sane perspective before hila shot her down",
            "At no point did Jacob say he didn’t want to wait in line to get the cat help. Us commoners have to go to the normal vet, where they were totally slammed during covid and it’s honestly amazing he got it in to see the vet as quickly as he did.",
            "You didn't need to call him an incel for no reason",
            "yeah imma skip this one",
            "No goofs or gafs. One bummer topic took up a whole Friday ep",
            "Are we grilling this guy for trying to save a clearly neglected cat???? Ethan and Hila are absolutely ridiculous for this interview",
            "I feel like a juror rn",
            "hila had such a horrible take this episode its rlly not looking good for her. ethan was delusional as always. the speculation and jumping to the extreme worst option over basically nothing while ignoring the piles of evidence that rhegan was a horrible owner really cemented how awful this episode was. they need to take a break asap and get it together",
            "the incel assumptions were insane - no wonder people dislike this podcast",
            "i'm just a casual watcher but i think this was the absolute worst episode of theirs i've ever seen. ethan and hila had some of the most idiotic takes and it's crazy how fast ethan's attitude changed after the girl's first dono. such a frustrating watch, and hila shutting olivia down like that towards the end was so weird. \n\ngross, sad, and disappointing is how i'd describe it.",
            "I can listen to a lot of fucked up stuff, but animal abuse is hard. We have total power over our pets, and it is pure evil to abuse that.",
            "Olivia was all of us when Hila was yapping about not knowing if the cat was mistreated\n\n“The cat died” is what we’ve been yelling at the screen for an hour, girly",
            "I think I’ll be taking a break from the podcast for a little while",
            "This is all Bobby Lee's fault",
            "On top of the neglect of not taking the cat to the vet when she knew it was sick, why would she bring a newly adopted pet to a chaotic environment with a bunch of strangers? Why would she think the cat would be safe and comfortable in a content house of all places? I would never do that to an animal I just adopted, especially one with recent health issues. Just wait until you’re done filming to adopt or have it stay with family until you get back.",
            "Here's my understanding:\nThe cat was frequently sick, noticed by the owner, her boyfriend at the time and other friends (hearsay but apparently confirmed through Jacob's 1st hand account). Despite this, she never had it taken to a vet. Her housemate/s, acting impulsively, took the cat, thinking it was merely starving and one tried to take care of it with his mom's help. Seeing its condition worsen, he scheduled a vet appointment and paid for it out of his own pocket, but the cat died soon after.\n\nThis, to me, suggests the cat was already seriously ill when taken. Despite the wrongful act of stealing it, the cat’s rapid death implies it was already (allegedly) very sick under the original owner's care.\n\nAlright, some thoughts:\nThe criticism the guy received for trying his best to handle a difficult situation was unfair. While taking the cat was wrong, it was probably already in poor condition and would've died quicker if nobody took action. In fact, we might not have even learned of this issue as it would have been swept under the rug. The focus should also be on the person who had the cat for months before. Blaming 4 days of inaction over 4+ months of (alleged) neglect is unreasonable.\n\nFrom the start, her behavior seemed suspicious. Her calmness about the pet’s disappearance, despite being accused of its death, seemed odd. She appeared more annoyed that people were bringing up the cat than distressed. Her emotions only surfaced when people began confirming the rumors via Jacob's statement, making her seem guilty (for me).\n\nAdditionally, the romance theory is irrelevant and distracts from the real issue of responsibility for the cat's condition. It has no bearing on who was at fault and only muddles the discussion about the cat’s care and eventual death.",
            "Literally would have preferred 3 hours of random talk /random anything rather than this mess that became at the end. I was enjoying the episode but towards the end not really",
            "I feel like they leaned too hard on him for the “waiting 4 days to take the cat in”. I understand why: if he thought the cat was DYING RIGHT NOW and that’s why he took it, then of course it would be strange that he wouldn’t head straight to an animal hospital.\n\nBut he was trying(poorly) to explain - according to him, he took the cat because he thought it appeared generally, habitually, neglected. Not because he thought it needed an emergency vet visit. He took it thinking it needed proper husbandry, then later realised it actually needed urgent vet care. \n\nAnyway this segment was demented and it annoyed me so much it went all the way around to being entertaining again",
            "How on earth can you all forget that she neglected the cat HE WAS SICK ALOT never visited the vet. Thats why she killed it. Also the guy might be weird but he tried. The owner did nothing a stranger tried. But sure he might be an incel so fuck him??? How was this the conclusion???",
            "this was genuinely a terrible episode",
            "Anyone with a basic level of experience with cats can diagnose that level of neglect at a glance let alone 5 minutes. Give me a break, so frustrating.",
            "Rhegan killed her cat plain and simple. She left it suffering for MONTHS. Can any animal lover/pet owner say that they noticed their pet is sick and then waited more an a week to take it in for check up? No, no they cant. Because to leave an animal suffering is an evil that most people don't have in their soul. There's videos where her cat seizing in the background while she is vlogging, she's repeatedly said that her cat \"keeps getting sick\" and never got it checked, and multiple people from the house she lived in say she never fed it. That poor guy just wanted to help, he saw an animal suffering and did what he thought was best. Content house people aren't known for being the brightest, but that being said I don't think there's many people who would've done something different. People saying he stole the cat too fast blows my mind, people break dogs out of cars for less than what that cat was going through. His timeline matches up as well. He took the cat initially thinking it was malnourished, he tried feeding it for a few days and while caring for it he came to the realization that there's something more going on. After he realizes the cat needs medical help Jacob and his MOTHER try and take the cat to an emergency room. COVID times were hard for people and pets when it came to medical care, and medical staff were tired and overworked. When people are overworked their performance gets sloppy, that is a fact. They most likely realized the wait was going to be the same regardless of what vet they took Sevyn to and chose to go with the more reliable option, that being a private vet. Cats cannot go from healthy to severely malnourished in 4 days, that's just not possible. Even if it took a week for this guy to get the cat seen by someone, the state it was in is solely Rhegan's responsibility FULL STOP. Rhegan777 neglected, abused, and starved her cat Sevyn. She deserves hell.",
            "Ethan and especially Hila owe Jacob an apology. Insane to assume he only did this because he must’ve been secretly in love with her (instead of just being genuinely concerned for the cat). \n\nAnd Ethan saying it’s weird they weren’t on good terms…maybe Jacob didn’t like Rhaegan cuz of how she treated her cat/people/things he observed while in the house. It’s not that hard to comprehend. Maybe she was just a bad person. Not that he was attracted to her. \n\nHope they address this Monday and don’t ignore it like they always do with bad takes. But whatever… I won’t be watching anymore anyways.",
            "I wish they would've continued on with the high school incident stories and skipped the cat abuse story",
            "Throwing all the blame on this man and extremely picking apart his story is insane. The cat was being neglected by the woman his instinct to intervene is valid imo",
            "THANK YOU OLIVIA my queen of common sense",
            "I'm usually not one to complain. After an hour and a half I decided to skip the rest of the segment only to realize it was the whole damn episode. This was a total miss. I know they will bounce back just fine Monday, but sheesh.",
            "It’s clear that the crew isn't very familiar with cat ownership. \nI live in LA and have two cats and I know for a fact that it was super hard to get a vet appointment in August 2021, I myself struggled to get appointments during this time. \nAnother thing about cats is that they’re quite resilient, I don't see how him neglecting the cat (if this is the argument you want to believe) for a few days would cause the cat to die unless the cat was unfortunately already dying-and the fact that he took it to the vet and the vet suggested to put the cat down confirms that this is true. \nLastly he mentioned FIP. FIP is a brutal fatal disease, the treatment he mentioned requires several daily vet visits, only an owner who is truly committed to their pet would commit to such a treatment. \nI agree that he should've had a conversation before deciding to take the cat, but ultimately I do think he was acting in good faith and did not deserve the negative speculation.",
            "What good pet owner would go out to a party and leave their sick animal at home? Why is it weird vibes that he brought that up!?",
            "Ultimately it was her fault. I don't care about his angle or motivations, romance or no. Did he have enough information to steal the cat? Probably not. But the vet said to euthanize it, four/five days in his care is not going to put it in that state. The death is her fault! She neglected the cat to the point the advice given was to put it down. She killed the cat. I feel crazy seeing them entertain that it was his fault.",
            "Y’all went way to hard on that kid for trying to save an animal!  That was hard to watch",
            "I never skip episodes, but I did today. \nWith peace & love, maybe having stronger evergreen backup plans would be a good idea?",
            "She was an ignorant child who had no business even owning a cat. Hila keeps defending her saying oh she must have been stressed cause she was taken. Imagine how stressful that house was with ten stupid young influencers trying to film content constantly. That would have been so stressful even more stressful. She had the money and never took the poor thing to the vet and she suffered for weeks. The audacity for her to keep mentioning that the roommate recording the cat while she was seizing is so much worse than what she did. For God's sake the cat was happy was getting attention and quiet and love in his strangers home. I can't believe they ended up siding with her cause she was in the chat. Such pushovers.",
            "Okay for the first time ever I am shocked at Ethan and Hila's takes. Usually I can understand their POV but they just sound so insane and mean-spirited today. I have been a member for ages but this ep gave me such nasty vibes from them I feel like discontinuing my membership. I really hope they take time to truley reflect and honestly apologise to the guy - and not in just a PR way. W Olive. W Dan.",
            "[removed]",
            "First livestream I've had to dip out of in a long time. Not just a depressing topic, but also frankly kind of boring. Tons of repeating/clarifying the same minutiae and then speculating on what it could or could not mean. Feels like we spent 10+ minutes on whether her room was the size of an entire family home??? They should have contained this segment to 1 hour and couched it on either side with goofs and gaffs. That being said, I know its a last-minute show so I can sympathize.\n\n\n\nSorry, the Friday ep should be fun and this wasn't.",
            "To think I was excited that the guest cancelled… this is worse",
            "Jesus, I never comment on Reddit but I just can’t bear how they milk this sad and uninteresting topic for drama/entertainment. I was just thinking how jarring some of their takes are (excluding Love’s) like „oozing incel energy” or the comment about him not knowing about cats coming from Hila (does she know?) but whatever, until this point it just seemed off, but whatever.\n\nBut now they started literally comparing it to true crime and dateline, trying to „solve the case” and all seem genuinely ENTERTAINED, which is so cringe and content-brained. How old are these people? Is it some brainrot from watching reality TV?",
            "[removed]",
            "Not ethans conclusion being LITERALLY what they said 3 hours ago 😭\nShe was neglecting the cat and he shouldn't of took the cat 😭 was there seriously nothing else they had to talk about at all",
            "I left and came back several times and it just kept going man :(.\n\nI know the fans are crazy sometimes and can have to high expectations but honestly, 4 hours of cat abuse?",
            "Cats don’t lose that much weight in 4 days \n\nCats don’t lose that much weight in that short of a timeframe, that cat had been underweight for a while before being taken in to the vet. The cat’s owner knew that it was sick and decided not to take it for veterinary care? I can’t understand that mindset at all. I have cats of my own and foster cats, that cat was presumably growing out of kitten hood into what should be sustained growth(based on the image of its adoption date and the vet documents) but the cat didn’t grow into a healthy weight under her care. I understand if someone saw a malnourished cat that they might make an instant decision to remove it from its environment. \n\nThere is clear neglect that happened under the owners care, she shouldn’t be given an out because the strange catnapper guy created a lie around the disappearance of the cat. He’s impulsive in stealing the cat but he did what the owner didn’t do, take it to see a professional when it was clearly in bad shape. The neglect falls on the owner. But why did he lie about stealing the cat?",
            "The cat wasn't eating because it was sick for weeks and dieing",
            "It bummed me out when they kept hammering on him about doing the right thing. Dan ended up saying what I was feeling, that he was a young stupid kid who didn't know what he was doing, and did the complete wrong thing. But they just kept hammering him about every decision, as if they didn't make stupid split second decisions at that age. Like it was a sinister thing.  \n\nShe wasn't caring for the cat properly. \nHe never posted about this until years later, it wasnt for clout. He was an idiotic kid who did something really stupid. But the harsh judgments from the crew, on some idiotic kids doing stupid things, was insane and hypocritical considering past takes. And at the end, they kept doubting points that were already answered.  It felt very \" we need to nitpick on people 20 years younger than us to find a bad guy.\" They were young once. Ethan has said he was a jerk when he was young. :(  I get it's for the show, but this is real people, so it just seemed intense. \nBTW, I'm a 34 year old who has never heard of these two people. It was just so saddening to hear thier takes. It seemed a bit.... idk. I've loved H3 for so long, though.  I'm just sad about it all :( and stoned, sorry if this was all over the place, lol. ✌️ n ❤️",
            "Possibly the worst episode ever.",
            "Worst. Episode. Ever.",
            "WHAT THE FUCK HAPPENED? BY FAR THE WORST EPISODE I HAVE EVER SEEN - 32 month member",
            "How is this the whole show? When they did it first I thought it was to get it out of the way, not eat 3 hours. lol",
            "Why are we believing every random thing this woman (who was neglecting her cat and who at the start of the episode was providing ZERO proof how many times did they talk about that pitch black cat pic) but  nitpicking everything the Man says.\nAlso why do we care the poor kitty passed because these teo adults were negligent who cares if they dated for a week 😭",
            "I love yall but you need to take notes when these people are talking or go back and relisten when they are gone. You guys get caught up in debating so much that you don’t listen. The biggest issue for me was Hila said several times he knows nothing about cats. However he said his mom rescued animals his whole life and his cat has FIP that he was treating. I’m not saying he was right but yall misrepresent him a ton. I love Olivia playing devils advocate! She was saying what I was thinking a lot. Especially with the Covid vet stuff, that was hell on earth. I also agreed with him on emergency vets. It could just be the ones in my area but they over charge and push pets out the door with treatments  rather than doing bloodwork to diagnose. Emergency is better for like open wounds and broken bones not diagnosing a dying cat.",
            "[removed]",
            "Damn I just got off work and was so excited to watch the ep but the comments of “worst episode ever” are def concerning lol…gonna try to dive in but I’m scared",
            "It’s all fine and well to believe in the girlies but does it have to be at the expense of the actual truth, sounds like the poor bloke was in a bit of a precarious situation and made a decision to try save the cat. The cat was recommended to be put down by a vet, this is not decided lightly this Cat had been neglected from the girl for a serious amount of time. This amount of neglect has to be intentional, that girl wanted that cat to die",
            "Damn I thought AB was doing a great job and was entertaining but I ended up stopping because I went to the comment section. Really disappointing that almost everyone turned on the guy that tried to save the cat from a neglectful situation :(. Would not have been the same energy from Ethan and Hila had it been a dog, and even I’m a dog person but I still have a heart I mean damn.",
            "Why are they all saying that the cat lost weight while he had the cat? That isn't even a fact they're just assuming cause she was small. She could have been like that the entire time.",
            "Honestly, once Rhegan made herself known in chat everyone switched up.",
            "Why are we going so hard against the guy that actually took the car to the vet and not the person who didn’t take the cat to the vet for months",
            "Spoke with my dad who is a vet, and his (and mine) conclusion its clear Rheagan neglected the cat to a point where it was terminally ill and the vet recommended euthanasia and that jacob also neglected the cat by putting it through unnecessary pain and suffering after. Jacob obviously legally stole the cat, but rhegean neglected it to terminal status and jacob just prolonged its suffering",
            "Cats need to be taken to the vet ASAP when they are sick!!! They get dehydrated within 24 hours and it’s extremely serious.  Poor kitty.  She was not responsible enough with that cat.",
            "That episode felt like a punishment. 🤣",
            "What are Ethan and Hila on about?? How do they spend so much time grilling the guy who tried to save the cat from a shitty situation, and not the girl who essentially is to blame for the whole thing? Is this because she is a hey girl queen slay🖐️✊🖐️✊or what’s up? If I was the guy I would do the same thing, if he had done it a bit earlier it could have saved cats life, and he had to try. If the owner is an irresponsible 18 year old influencer who neglected that poor thing in their first place, why would anyone want her permission? We stealing the cat and she can go to hell",
            "Hila saying the guy gave incel vibes was so out of pocket",
            "I’m not usually a complainer but how long are they going to talk about this fucking cat? This is so completely uninteresting, honestly a new low for me as far as TikTok bottom of the barrel “drama”. I don’t know who any of these people are and don’t care in the slightest!!",
            "This went from Friday fun with Bobby Lee to hey look at this dying kitty",
            "I have never in my life made a comment about the tea segments, but man, the whole time, I was so hung up on the fact that the lady barely had any pictures of her cat. I know they mentioned it a few times on the podcast but It cannot be stressed enough how much of a red flag it is on top of everything. Everyone that loves their pets take tons of pics/vids of them (ethan literally can not stop getting tattoos of them), and you would think an influencer of all people would take advantage of that. (I will admit the guy was weird, and his side of the story didn't line up as well)",
            "Omg hila.. lol i think the focus is on the wrong person",
            "Idk if it's just me, but the interview on todays Pod was irritating. Ethan and Hila are both doggin on Jacob and grilling him and trying to make his intentions anything other than he was worried about a cat. Don't get me wrong, what bro did was 100% wrong and he should've carried this out MUCH better. But seems to be going extremely soft on Rhegan, who put the cat in the initial position and obviously sucks at being a pet owner. As someone who recently lost their dog from cancer a few months and cares A LOT for animals, people who mistreat animals need to be called out. Everyone in this event is in the wrong and everyone is going too easy on the person who started the mismanagement of this poor cat.",
            "‼️This isnt the first time Ethan and Hila have done this‼️\n I believe the discussion would’ve gone ALOT differently if it was two girls or two guys involved. \n\nAs a 23 yr old woman,  I’ve felt uncomfy in past pods with how they demand the ONLY POSSIBLE outcome is that the girl/woman is right. This isn’t the first time one/both of them get verbally hostile as soon as someone communicates a different viewpoint (ex: Hila to Olivia in this ep)\n\nHila defends her opinions with, “ I don’t trust him” but I agree with Dan. Why is she trusting HER SO HARD  in this situation. \n•Hila also says, \n•“For me it’s not that I’m trusting her more…” ❗️That’s absolutely what she’s doing.\n•“…it’s just that he’s the one that stole a pet and made that decision” \n❗️I agree that he could’ve handled it differently but he MADE THE DECISION to take seven to the vet. YES it took him days but SHE had WEEKS/MONTHS to do the same and neglected to do so.",
            "Ethan and Hila disappointed tf out of me today. When gross, problematic, Bobby Lee cancelled I was stoked for a fun Friday show, but instead got 4 hours + of garbage takes across the board. Good thing Ethan and Hila didn't end up getting a kitten. They obviously find them lesser beings than dogs. Grim.",
            "I have to wonder how Ethan and Hila would feel if it was an emaciated dog vs a cat. I left my cat with someone who was meant to look after her, and she lost heaps of weight when I came back! Clearly not being fed properly, but not enough to kill her. She fattened back up when I took her home. This cat was clearly unwell, and she ignored that. Everyone but Olivia has such a bad take. \nHila has the worst take. I’m so disappointed in her.",
            "I can’t think of a single topic or segment that could justifiably take the whole episode. Not even my personal favorites or the crowd favorite fun segments should take the whole episode. Watching this show for years I can’t remember an entire episode dedicated to 1 topic, especially not something like the “drama” surrounding the literal death of a pet.\n\nGenuinely asking, did anyone enjoy this episode?",
            "I can't listen to animal abuse stories",
            "Imagine if someone said Shredder died because they didn't get him care \"fast enough.\" \n\nMy 12 year old dog, who was the love of my life, just passed from cancer, and my cat died in 2021 from a heart defect. We could not get her into any vet & went to 4 emergency vets before one would take her in. We waited hours in the car due to covid at every ER vet, they'd come out with masks on, take a look at her, and say \"she'll be ok until you get into the regular vet\", which was weeks later. We did everything we could until we finally found an ER vet to get her into - they said she was literally in heart failure, and she died days later.",
            "I thought the doc was an ever growing content resource... Why resort to a last minute unprepared segment that no one wants to see? I usually think people overreact way too hard in chat/the sub but man I get it this time, almost been 2 hours of nothing but animal abuse talk....",
            "Good god this is a terrible episode. I miss OG After Dark vibes",
            "They went so hard into conspiracy on the guy. Is it that crazy he didn’t want to say they hooked up one time on live? That makes him an incel? And the pushing that he hurt the cat by taking it, and he was the cause of its death, is insane. It’s fucked to spread something so terrible about him with no basis. We SAW the cat sick a month prior and she did nothing. It was so ill, he had it for three days trying to resuscitate it and the vet said to put it down. That is FAR gone. It was super distasteful the way they treated him, when the owner was literally abusing her animal. Olivia & Dan had the only down to earth perspective, but Hila instantly shuts down anyone with differing views and is an ass about it. So there’s no chance for a real discussion with her there. Not to mention it allows Ethan to be completely off base with no correction.",
            "As long time family who has defended Ethan and the crew throughout every controversy, this is the first time I’m genuinely reconsidering my support for the H3 universe.\n\nI usually have a strong stomach and high threshold for getting offended by comedy. But…what the actual fuck was this entire episode. As a cat owner this was a ridiculously hard watch…showing the video of that helpless emaciated kitten seizing?? Hila being more concerned about “property theft” than literal animal abuse??? Switching sides to take this deranged girls defense the minute she donated, to GRILLING that well-intentioned,albeit flustered, kid who tried rescuing a clearly ill and dying cat while he was trying to explain himself???? Imagine the guilt he already feels about that, like he needs humiliation on top of it. \n\nThe entire conversation would have been wildly different if this was a story about a yorkie that came from a backyard breeder. Peace and love was not in the room with us lol.. All I can say is YIKES. Whole thing made me sick and left an awful taste in my mouth…animal abuse, or neglect for that matter, isn’t a joke.\n\nThank fucking god for Olivia if I keep watching she will be the only reason.",
            "I can deal with all things covered on this podcast, I’ve never had to not watch - apart from this. I’ll come back to watch when this topic is over but I wish they wouldn’t show it",
            "I lost my cat (soulmate) in September to cancer and I think I'll be skipping this one. My emotions cant handle it. See yall Monday!",
            "holy shit i can’t believe this ENTIRE ep is about this, i was watching for like the first 30 mins or whenever they started talking about showing the videos and i was like “there’s gotta be other topics imma just skip this segment” and then realized its ALL ABOUT THIS\n\nfirst time in a while i’ve just decided to skip an entire episode. bad bad baddddddddd fucking content brained idea on this one yall",
            "I had to bounce out for a bit. Cant do animal abuse stories. Too triggering. Ugh.",
            "I love my cats so much I don't understand how anyone could do this",
            "I haven't tuned into a live show in a while but Ethan's making it impossible to listen to this power point.. He's just babbling about nonsense and interrupting AB every 30 seconds to make some dumbass comment. Shit like this is why I haven't tuned in lately. I know he's done this forever but after not listening for a while it's super annoying as a viewer trying to stay engaged with the topic when the host won't stop babbling and derailing the conversation over and over again. Like please just stfu for 5 seconds and save your questions/comments until the end bro damn lol\n\nETA a good example: AB's explaining what's happening in the video, of course Ethan's talking and not listening again. So he has to ask AB to explain what he was literally just explaining when Ethan was busy babbling. Then Ethan asks if he'll just start the video over again.. Then Ethan starts babbling AGAIN while the video is playing so he has to ask AB to start it over again. This is literally less than 20 mins into the video. Like wth dude? How could anyone stay interested in this content when the host himself can't stay focused on the topic. \n\nI know they have before, but someone from the crew needs to say something to him. Or at least have him watch the segment back and see how fucking annoying it is. It really just makes Ethan come off as a self-important asshole.",
            "It bothered me soooo much that they didn’t notice the nutrí-cal prescription. Said it’s not malnourished. Lol nutrical is really a last resort supplement.",
            "Respectfully, I’ve been a fan since the Israel days. Today is the first day that I’ve been truly pissed about the content. You had no content for today and you end up deciding to pick on the person who holds the least responsibility for this cat as well as coming up with speculations about him, also calling him an incel for no reason??? I’m truly disappointed and expect a real apology on Monday \n\nPeace and love",
            "What the fuck? You guys really lost the plot on this one. Except for Olivia. Hila was throwing blind emotion this dudes way, Ethan was bending over backwards to twist this into a toxic male thing, or attempting a gotcha. Whatever it was, it was off base. Not an indictment on this entire show!!! but some of the worst tendencies were coming out today. \n\nDesperately need a refresh gaff episode. Bobby Lee caused this by falling off his bed.",
            "First time pretty much ever skipping an ep - can’t stomach animal abuse! See ya’ll Monday!",
            "Olivia and AB talking sense lol even though dude clearly a lil insane for stealing the cat",
            "Shoutout I-4 I drive it everyday to work. Voted one of the most dangerous highways in the country :3",
            "Am I on crack? What is going on",
            "This episode almost had me grind my teeth into nubs.\n\nTake Jacob out of the equation, she didn't take her clearly sick *kitten* to the vet! When she had a shit ton of money to do so! And then she doesn't put posters up or call local shelters to find her lost KITTEN?!\n\nEthan and Hila were basically implying he took a healthy cat and killed it. Hila literally said there was no sign of neglect/abuse, when there clearly was, they just watched videos of the cat shitting in the bed! And the boyfriend saying the cat is always sick! Kittens don't just have get colds and get over them, they have a much more weakened immune system and any sickness needs to be addressed by a vet *immediately*. And having a kitten in a loud house with a shit ton of people around before she's gotten all of her vaccines is incredibly irresponsible. \n\nSure, the dude is weird and should have talked to her first, but for the whole crew (minus Olivia) to just talk shit about Jacob after he had the guts to call in for a 2 v 1, calling him an incel, that he stole the cat for clout, or to be the hero, is so fucking gross. Getting a cat to a new vet in 4 days is insanely fast. I've never been so disgusted by the crew like this before. I had no idea who the dude was until today, so I'm not a fan defending him or anything, but they absolutely need to apologize to him. They were shitting on the one person who cared about the cat enough to take her to the vet. Fucking wild.",
            "How dare he judge her for going out and partying when her cat was lost. Are they high? I cried and cried for days when I lost my cat and was doing everything to find her. She is a bad person!!! She neglected her cat and when she thought it was lost she did not care.",
            "With peace and love this segment is going way too long",
            "To clarify the age on the history, it says 3 years, because the animal was not marked deceased, so it would be 3 years old, as the incident happened 3 years ago.",
            "No Uncle Gabe? Now I’m gonna have a hard time the rest of the weekend.",
            "I have spent several hundred dollars on both of my new kittens in the past 6 months for various issues, they said it right, do not get a pet if you are not ready. They are like children, their health and wellness rests on my shoulders, why would i let them suffer. To do that to any animal is horrific and he was right in taking that cat. To stand by is to be complicit. This is my favorite podcast and i typically refrain from criticism as mostly i find people blow little things out of proportion. But this was truly vile and delusional. I am 100% certain their views would change if it were a dog which is disgusting. Get a grip i beg",
            "How is Ethan not getting that the incentive Jacob had was to save the cats life? Yes the cat died, but he tried to do something after its owner neglected it for so long. No good deed goes unpunished I guess.",
            "Why is Hila going out of her way to defend an animal abuser? lol",
            "I don't understand any of the nonsense about what this guy did being wrong. If I see your animal in this condition and I have any reason to believe that it is due to neglect, I don't care anything about you. I'm not going to ask permission, I'm not going to warn you, I'm not going to return the cat to you after saving it. \n\nWhat he did is good and right. Nothing about it is psycho or weird. Her neglecting her car to that point is psycho and weird.",
            "show is still going but this girl is so irresponsible for allowing her cat to get sick repeatedly\nthe guy is mad suspicious for stealing a cat instead of being mature and discussing it with the owner, but the girl is just as bad in my opinion. \nalso yes EITHER of them should have 100% taken the cat to the emergency vet. they’re bad as each other, but i don’t think anyone should cut the girl some slack. \n\nthey’re both awful and don’t deserve call ins, i personally don’t want to hear animal abusers make excuses for themselves.\n\nEDIT: also big love to AB for pulling this together last minute!",
            "This is the worst episode. It's like speculating for 1 hour now. I'm over it, move on. Speculating doesn't do shit. Nobody wants to hear that much about an animal abuse case, and especially not about its speculation.",
            "Worst episode in h3 history.",
            "How are we almost 90 minutes in and this is the only thing they've discussed?",
            "Since evergreen topics have gone barren I've got some juicers:\n\nTwisted metal lore\n\nWhat happened to the hole in the ozone layer\n\nGuessing the crew based on dental hygiene routine\n\nIce tier list\n\nCrew shows off their favorite mug\n\nDiscussion of literally any non pop musicians\n\nThe implications of trickle down economics\n\nCrew plays a Nintendo choose your own adventure from the 90s\n\nA book report\n\nTesting fancy chalk\n\nA recurring segment where we see a basil plant grow from seed.\n\nLive commentary over a defunctland video\n\nInfluencers who are good and kind to their pets.\n\nCrew members switch off playing a game of their choosing that just plays in the corner of the screen\n\nTesting google glass vs the apple vision pro.",
            "I think this was officially the worst episode that they've ever filmed.\n\nIt could potentially be the worst podcast episode that's ever been made.\n\nMaybe they'll finally win a Streamy for worst podcast episode in the history of time?",
            "this episode genuinely made me sick to my stomach. as a long time cat owner i was disgusted by the crew’s comments and opinions on this whole situation. the fact is that this cat was sick for a long time and nothing was done about it. rhegan 100% neglected that poor cat. what pisses me off is that the crew seemed to be putting more blame and hate on the one person who actually tried to save the cat. rhegan had multiple chances to take the cat to the vet and she did not. and let’s be for real if you saw an animal being neglected by its owner what would you do? would you just let it continue to be neglected just because it is not your pet? no i’m sure any animal lover would do anything to get that pet out of that situation.",
            "Skipping this one, I'm not going to watch a bunch of dog owners show an abused cat and side with the abuser. For three hours. Nope.",
            "Seems like an Occam's Razor situation. He probably thought this cat was dying because it was sick, he'll try to save it, but his care wasn't the best because he's not as familiar with cats or this particular cat. There was probably an underlying health issue.",
            "Honestly idk why it got turned on the dude so much. The woman was clearly neglecting her cats medical needs",
            "This has to be my least favourite show so far, the vibes were off and I don't want to spend 2+ hours watching these dumbass teens abuse their pets. Idk why this topic was chosen.",
            "Oh no it's really still going",
            "Why does Ethan want to see a cat corpse?? What is wrong with him??",
            "Really dividing the audience today I see. Pretty boring depressing topic. The interview was mixed because it seems he thought he was helping but was probably hurting more anyway. I get why people are complaining about them being too harsh though. Both of them seem like they were young and stupid and unfortunately ended in a innocent cats death.",
            "This episode is all Bobby's fault lol",
            "Definitely skipping this one... This upcoming week is my cat's birthday, and then the following week is the 1 year anniversary of her being diagnosed with lymphoma. She passed in September. I'm still pretty traumatized, and this time of year is bringing up a lot of emotions. I definitely can't stomach today's EP, so I guess I'll for sure be skipping this one, which I never do with h3 🥲",
            "One of the worst eps lol",
            "Been more misses than hits lately with the pod",
            "Both influencers are culpable and giving me flashbacks to when I and my roommates had to help nurse a malnourished puppy one of my roommates’ 18 year old classmate bought (long story, but the dog survived and is living his best life with a new owner, the previous owner is in jail in Florida)",
            "i wish they’d stop with the rage bait episodes. i know they get views but i feel like we need more positive, funny content. it’s exhausting to sit through downers like this",
            "i pregamed the show tonight -- i had a mushroom candy bar, ready to have a good time.  i said to myself, the podcast always makes me laugh and will guarantee a good trip.\n\ni had a time, alright.",
            "I’ve never got triggered by this show before. Is this how it feels? Why show a dead cat? Am I that much of a snowflake? I thought we’re over talking about abuse topics. I guess it’s just 1 segment. I hope they delete or blur it in the edit.",
            "Maybe if a bunch of people leave the stream then Ethan will figure out that no, we don't in fact want to look at dead animals.",
            "holy shit this powerpoint is still going...",
            "the assumptions have gotten ridiculous at this point…like come on",
            "Olivia you were right girlie!!!!  This cat didn’t just fucking die out of nowhere.  And everyone got a pet in COVID. There were no vets available.",
            "worst episode 😥 seriously and for what? to listen to the horrible takes over and over from H and E? 🫥",
            "Im out. Showing a dead cat is not ok. As someone whos lost a pet i cant believe Ethan thinks thats not traumatizing and inappropriate. My cats been gone for 3 years and the thought of looking at anyones dead pet made me nauseous.",
            "This is on the Mount Rushmore of terrible h3 episodes. Hearing about animal abuse for 2 hours is a total downer and not what I wanted to hear on my Friday.",
            "I never comment but seriously what are they thinking? Why would anyone want to hear about this especially on a Friday? They really couldn’t think of any other topic? I’d rather they sit around and talk about nothing than talk about this for hours. How is this even remotely entertaining? And why the fuck are they going on so long about it? This is so disappointing.",
            "I rarely complain about the show, but this is possibly their worst episode. Very depressing",
            "Woof I would have rather had Wayne Diamond guest host the whole episode listening to Third Eye Blind and discussing disney deaths for 4 hours than a cat death story between 2 tik tokers I have never heard about. I appreciate they all got into the story a little too much really trying to find someone guilty, but I had to turn it off once they brought the guy on for the interrogation.\n\nAB did really well though. Big ups AB! He's a great guest host.",
            "At first I was relieved to hear Bobby and Khalyla weren’t coming. Then I’m shown a dead cat. Yikes.",
            "I held out, waiting for the segment to end and it just never did 🫤",
            "the cat owner was wrong for never establishing vet care right after getting the cat. It's the first thing you do when you get a new pet. A healthy pet still needs to go to the vet to get regular shots and treatments, and a sick pet definitely needs to go to the vet!",
            "My best friend is staying with me and I was like “oh yeah this is the podcast I LOVE watching 4x a week” and proceeded to introduce her to H3 with perhaps the worst episode I’ve ever seen? She was so confused, and for once it wasn’t because she didn’t know enough lore.\n\nThis episode just made no sense the entire time— bizarre takes and soooo much time spent on a series of events that happened like 3 years ago? I’m a hardcore cat lady and showing the cat seizure video was really traumatic to watch and the interview was rough to watch too. And for FOUR hours….yeesh. Not even an uncle Gabe break! I know they’re running on E prepping the live show and with the last minute Bobby Lee cancellation but damn….rough introduction to the pod for my bestie, recommend another route if this scenario happens again please 😬",
            "shoutout to olivia for speaking up. jacob was right for snatching that cat, seriously how did this get turned on him *when she was the one who originally abused sevyn*. she got her cat to the point where someone else needed to intervene and get sevyn help.\n\nrefusing to get medical help for your visibly sick cat for weeks is animal abuse. ethan and hila's attempts to downplay her involvement in her poor cat's death was way out of line. why are we supposed to side with an animal abuser?",
            "this episode was f\\*ckign disgusting",
            "I feel bad for AB. He prepared a surprisingly good quality powerpoint, last minute, and it's being dragged out laboriously (instead of letting him get through it). The way Ethan acted so incredulous at the fact that AB decided not to show the cat suffering, like???\n\n\nI haven't reached the interview part yet, but it looks like it is going to be pretty cringe. \n\n\nI hate the way AB is treated, it has always rubbed me the wrong way. I hope AB gets to prepare more slides in the future, albeit not about animal neglect.",
            "I don’t see the allure in talking about a couple of nobodies and their shitty behavior for 3 hours. \n\nHard pass.\n\nI hope Monday’s episode is a bit more interesting. Props to AB for pulling an all nighter.",
            "four fucking hours of this shit? you guys are skating on thin fucking ice",
            "Major episode fail, hard pass. Why you guys thought this was a good episode idea is mind blowing",
            "I'm a member, but I had to report this video for showing animal abuse/neglect, as well as bullying. The guy was a bit daft, but he didn't deserve that. C'mon guys, this episode was gross and has me wondering if the show is worth my time.",
            "Very weird start to the show poor AB doing a last minute presentation and getting grilled for it not being fleshed out and Ethan treating a horrible animal abuse story like a funny segment? … Not sure what’s going on here but it’s gonna be a no for me today I guess 😔😬",
            "Fuck this ep",
            "Regardless of the situation with Rhegan— this episode tells me something important about Ethan and Hila: they are not animal lovers. They are dog lovers. The lack of empathy they have for poor Seven is horrifying. \n\nIf by some off chance someone at H3 is reading this, think to yourself… would you ask to see a dog seizing? Would you ask to see a malnourished, abused dog in its last days of life? Would you ask to see that dog’s corpse? Would you excuse that dog’s abuser after a 4.99 superchat?\n\nI think we all know the answer to those questions.",
            "Good take away from this is firstly, always have pet insurance (it has saved me thousands), and secondly, at the first sign that something is wrong with your fur baby take them to the vets immediately. Even if you have to go to the emergency vets which is way more expensive, it is always worth it to save your baby and if you have the insurance, it will be covered anyway! additionally, just don't get a pet unless you have ample time to provide them and a prefect environment for them to live in.\n\nFUR BABIES DESERVE LUXURY!",
            "damn, I felt like the show was on such a good streak before today",
            "Hard skip. Idk who decided it was a good idea for a show",
            "Crazy idea but they are both in the wrong. They both failed the cat. She let her cat be sick for months without taking her to the vet and he let the cat stay sick for a few days. They are both terrible.",
            "Not to stir drama but didn’t Bobby’s lip thing happen like a week ago? It’s a reasonable excuse by why wait to cancel last minute?",
            "Ethan and Hila aren’t in a position to speak about anyone’s pets",
            "I’ve never once commented something like this, always find it rude and obnoxious when the chat is filled with stuff like this… but honestly\n\n4 hours on this cat story is insane 😭 I don’t mind not watching live/skipping segments but I keep checking back in on the live, and it literally looks like it’s been the same 2 tiktok apology videos for 4 hours. \n\nNot a bad segment topic or a boring story (and ofc they had a guest drop out last minute) but not for 80/85% of an episode\n\nEDIT: actually… Ethan/Hila AND everyone on the crew got really invested and into the story soo I can’t even hate. They had fun covering it so more power to them. At first it felt like lazy stretching of a story but they all got really into it. I would’ve liked more stories and didn’t watch the whole ep but I’m glad they all got invested and had fun covering the saga",
            "YouTube just recommended me a video that was basically titled \"dying cat\" with an extremely graphic thumbnail. Never seen that before. Algo seriously linked me what I can only assume is animal death porn (14M views). I don't want to be parasocial or one of those posters. Nuke this sub. But with peace and love, this episode was a nightmare. A nightmare.",
            "Never thought I’d have to sit out on an Ep but animal abuse is not something I want to think about or talk about ever, especially on a Friday when I’m trying to have a good time. No hate but definitely not for me!",
            "First, much appreciation to AB for pulling a late night to put together this slideshow. That was very kind of him. With that said, this is... such an unbelievably sad story and it's been going on for 2+ hours at this rate. Missing the goofs and the gaffs this Friday, with peace and love. I'll come back later once the stream ends ✌️❤️",
            "I didn’t watch the episode..  but did they at any point do a poll like, does anyone want to hear about this or should we just shoot the shit for a few hours? I would have totally watched a full ep of everyone just talking, watching fav tik toks, eating and goofin.",
            "also are we missing the point that he took the cat to the vet when he clearly didn’t have to! its not his cat at all! how long it took him shouldn’t matter it wasn’t his responsibility..the cat was clearly sick when she adopted him so why didn’t she take him to the vet? HELLO?? if my cat is sick i’d take it to the vet asap get that appointment in ASAP",
            "worst h3 ep of all time. i’d have rather listened to Ethan talk about the Palestinian genocide for 4 hours.",
            "Hey so like when y'all apologized for all the heavy topics why does it seem like we're getting an influx of way more heavy topics?\n\nDid yall forget about goofs and gaffs to just cover things that make us upset or- did I miss something",
            "after having this episode on in the background, I wish I was the cat it would be better than another 10 minutes of this",
            "I hopped on to the show late and as soon as it started heading in the dead cat story direction I rolled out. My mental health would only take a dive from listening to that shit.",
            "I’m going to save myself the stress and just skip this episode of the podcast 😅",
            "Sort comments by \"Best\" vs. sort comments by \"Top\" and it's like two different comment sections.",
            "this story is super heart-breaking. what i took from it is basically that both rhegan and the guy who took her were very neglectful, but at least the guy attempted to nurse the cat back to being healthy. but what i don't get is him waiting 4-5 days to take her to the vet and covering up the fact that he took her by saying she ran away. that's fucked up regardless of intentions. \n\nwhile yes i think he would be a better owner than rhegan, the people dying on the hill of defending him don't make sense to me either.\n\nbasically, if you aren't very comfortable and 100% certain that you can handle the commitment of a pet, don't do it. please, please, just wait, for the pet's sake and for yours.",
            "It takes a long time for a cat to show their sickness so it would have been suffering for a while but if you are a good owner you’ll see the signs even if subtle. By the time he took it in it would have been too late from her neglect. Im a first time pet/cat owner but As soon as one of mine is acting strange at all it’s an immediate phone call and/or vet appointment (and we have had to treat stuff from those on a whim appointments) \n\nAlso we don’t know the dynamic of the house, sure we could argue he was wrong for taking it on the low but also if your watching an owner ‘abuse/neglect’ their animal for a while there is a feeling of danger and wanting to ‘save’ the animal especially if it’s quickly deteriorating. Poor little Seven.",
            "Yikes. Big yikes.",
            "Bro they flipped on her so hard for $5",
            "My post got deleted and was advised to instead discuss it here. So here‘s my post again:\n\nI feel that they treated the guy trying to save the cat WAY too harshly. \n\nWith P&L I simply thought that after the 5$ Superchat came in they fully switched sides and they made tons of assumptions and did everything to try and nitpick in order to find anything to criticise the guy for. He seemed like a good person at heart to me, like he actually tried saving the cat, and instead the abuser is being defended because of a 5$ donation. P&L P&L Would love to hear thoughts about this.",
            "Anyone have the timestamp for when they stop talking about the animal abuse stuff? Or how far roughly into the livestream it is? With peace and love to Ab, and credit to him for bringing something to the table at the last moment; this is no slight to him, but that topic ain't for me.",
            "3h about this is 2h59min too long",
            "why is ethan actually mean to ab tho  like thats his employee",
            "This was terrible to watch. :( I am an RVT and a cat owner of 30+ yrs. Based on the little info provided, this cat appeared to have a condition like feline distemper or FIP which are both absolutely devastating diseases. They can both be very quick to progress but it is not overnight and the symptoms are not even close to something you could chalk up to as \"just a cold.\" The owner is 100% at fault! Zero room for doubt! Should the person who took the cat have documented it better? Yes. But he did not cause the issue. The cat was likely incubating the sickness before she was even adopted. It is the owner's fault for ignoring her symptoms.",
            "With peace and love, there were multiple issues with this episode, and I think the Bobby canceling contributed. Please have Crew Storytime prepared as a backup for situations like this. Have a topic ready and the crew can jot notes to jog their memory. We got cut off by Diamond before and instead of 4 hours of cat neglect time today, we could have had chill fun stories. No doc needed! AB isn't stressed! More comfy episode time!",
            "Really boring and unentertaining segment. Plus who wants to hear about animal abuse?",
            "rare hila L\n\npets shouldn't be treated like property, if one is being mistreated/abused it is 100% acceptable for someone who ISNT the owner to remove from the property and take it to the vet",
            "Catch me not listening to this episode. At all. I've been a member for over 40 months and haven't missed an episode yet.",
            "I'll comment when the animal stuff segment is over, for those of you who don't want to hear it.",
            "I can't believe they're still talking about the cat. We're going to discuss animal abuse for 2 hours? They really need to learn how to wrap up a segment. This one is somehow both very upsetting AND boring. It's almost impressive.",
            "I stopped watching at the beginning hoping they would be done with the cat stuff by now but they’ve juiced the topic for a whole 2 hours :/",
            "I just hope AB won't be getting the flak for this episode",
            "Love sounds like such a good cat dad, I love how much he loves and takes care of his cats.",
            "so i posted a post but it got blocked imma put it here for----- is it just me or this whole cat drama just overblown, like its being stretched out to the point of redundancy, i just wanna get a like a feel from you guys.",
            "Ethan choosing and encouraging to show a video of a dead cat is kind of insane. I don’t know that he’d do the same if it were a dog",
            "They are both in the wrong. She neglected her cat, he stole it with the intention of getting it help but also kinda failed his duty of care and comes off a tad psycho.",
            "I know AB squeezed this story to fill in for Bobby but this was such a nothing burger. The girl sucks for not taking the cat to the vet and the dude sucks for stealing the cat. Boom story done, how is this the longest pod we’ve gotten in over a month………..",
            "That's where he gets his Fortnite Hours in lol",
            "\"That man is playing Galaga. Thought we wouldn't notice, but we did.\"",
            "I felt like they were trying to imply that the cat died because of something he did, and that bothers me. If I were in his position and took the cat thinking I would be able to save it and it passed due to someone else’s neglect, and then the public turned it onto me saying it was MY fault I would be outraged…",
            "Ethan doesn't know fuck all about cats and often comes into situations with an ABSURD confirmation bias. It's almost like he sees what would make more drama instead of what is reality sometimes and just goes too far with it. This absolute bullshit is TOO FAR.",
            "Ethan needed something to happen this interview, i think he wanted to get him, to make the show more interesting, he knew this episode was crap. I dont think he cared about what was true.",
            "Honestly thank god for those 2 level headed queens.",
            "IKR. It was so much speculation and its like...she said they were dating he said they weren't. idk why they immediately took her word as truth without her providing any evidence or asking for evidence. This was kinda like the Daisy Fit Coconuts situation, both were bad people...but one they took word for...which some came out to be lies. \n\nI'm happy Dan did interject and say we don't know whos telling the truth and were speculating.",
            "She was clearly neglectful",
            "Yes because OBVIOUSLY the most reasonable explanation is that this guy stole the cat as a prank and it ended up dying so he panicked, faked a vet bill, leaked the story on reddit, got other tiktokers to back up the claims about her neglecting the cat, knowing he’d be asked to call into the show 3 years later….for clout. 🙄",
            "This was something I was wondering too. It wasnt clear if she had EVER taken the cat for the vet. For both dogs and cats, usually you’re at the vet a few times in the first year of having them for all their vaccines, neuter / spay, and all that other shit. \n\nSo I’m wondering the same thing because when I rescued my cat at 6 years old, part of the adoption contract was taking him and his papers from the shelter to my personal vet within 60 days or something like that, and for kittens it was required to take them to your personal vet within 30 days.",
            "Another thing I want to add here is that before Jacob came out and confirmed it was the cat in the photos, Rhegan was under the impression that it wasn’t her cat. Now obviously the cat is quite unique looking… and it has a notch in its ear. You 100% can tell that it’s her cat in the photos and videos, and as a pet owner if my cat got lost I would be looking for him everywhere and I would be able to recognize my fucking cat that I love so dearly. How on earth does her cat run away, she sees photos of the damn thing and she says to herself “nope not my cat that I lost and never found”.\n\nShe also allegedly went to a party the night her cat “escaped” like.. \n\nI think she was in irresponsible teen, who got a cat. And only got a cat for the novelty of having a pet. Didnt realize the care that the cat needed and neglected it. Like let’s be honest here she barely had photos of the cat to begin with… she’s in a tiktok party house, she was definitely not with the cat taking care of it 24/7. She wasn’t some homebody quirky girl who loves her kitty and crocheted on the weekends..",
            "Ya it’s inexcusable",
            "i think the guy taking the cat is strange and waiting 4 days (as he mentions he couldn’t go on the weekend so possibly only 2 days he didn’t make effort to go and just find a vet to take her in)   but i think the real issue is rhegan not ever taking her into the vet. she talks about how seven would be very sick and then be fine. wouldn’t that be even weirder to not take it to the vet. also she had the cat for 4 months? and never once brought it to the vet (as it seems) even thought it was claimed seven was sick constantly (like the ex said that the cat needs to stop being sick or whatever he said)   i think both are in the wrong but i think rhegan is clearly worse off in this situation.",
            "The tone shift gave me whiplash",
            "I feel like if anything, when it's your first pet you should be quicker to run to the vets when something is wrong. When something is wrong with my pet I'm at the vets the next day if it's not an emergency.",
            "and diarrhea is such a cause of concern for kittens and should’ve been a major red flag since it could lead to dehydration which can be fatal for kittens. i can’t with this story😭",
            "100% I've been a religious listener/viewer since the Vape Nation days and today's ep was the first time I was genuinely upset with the crew. The uncalled for aggressiveness during the interview and crazy speculation with no evidence. Basically, ignoring Js explanations and backing R who is the only one you can 100% say mistreated the Cat. They gave her all the leeway in the world but jumped at J any chance they got. \n\nMinus Olivia and Dan for trying to remain fair. \n\nEthan and Hila should be ashamed.",
            "They were so hostile towards him when his explanation makes perfect sense. He initially took the cat thinking it was just malnourished. Upon spending a  day or so with the cat he realized it was more sick than he thought so he took it to the vet (something Rhegan never did). The vet said the cat was basically dying. Taking the cat the way he did was odd but I think his intentions were good.",
            "Agreed",
            "He for sure had good intentions. ",
            "Yeah I feel like they should only speculate when it’s clear it’s a joke and Zach plays the conspiracy music",
            "Wow, everything I hear about Chewy is really great. I love that they offer that to everyone.",
            "I am not certain he was wrong. If the cat wasn't properly cared for, I think there is justification in taking it. He claims it wasn't cared for, others have claimed they heard it wasn't cared for, 4 days after he took it the vet said it need to be put down because of its poor condition. She says it was fine.",
            "Yes",
            "the fact that the hehe pod is defending her is making it worse.",
            "They probably can't hear you over the sound of their $12k fridge running",
            "There’s a list for sure",
            "100%. if i knew about a cat being constantly poorly, malnourished and not being taken to the vets - that is a good presumption that it will not be taken to the vets. yes, he definitely should’ve not have just taken it, but i can understand that he wouldn’t want to talk to her about it - if she was going to take it to the vets, she would’ve. i’m sure the cat would’ve died in the content house (possibly alone?) but instead a good effort was made to look after her and save her. again, there were better options but i totally believe he did what he thought was best in that moment - and so did the other people he was with. 🤷🏻‍♀️",
            "Plus, I feel like it wasn't about the wait...Jacob mentioned something about the quality of care his cat had received after waiting in the pet ER on a different occasion. So instead, he wanted to get in for a real appointment for Sevyn since the cat seemed in such bad condition. I think he had a hard time articulating himself because Ethan and Hila were interrogating him so aggressively.",
            "I don't want to aound like a snowflake but the way Hila speculated about him and how she called him a fucking incel and didn't acknowledge that it was Reagan's fault is so fucking gross and pathetic. like honestly fuck that.",
            "Like for reals hila keeps harping on it being stressful for the cat to be taken to a new place. Imagine that house filled with 10 plus stupid young influencers running around constantly and then moving like 3 other times before even getting to the house",
            "it was lmao",
            "Way too hostile with that poor guy. He seemed well intentioned. Pretending the cat ran away was weird but her doing nothing to try and find it was a lot worse.",
            "At first I was intrigued with the impromptu call in, but then it started feeling like the og Jeff interview 😅",
            "All of the “interviews” are just him cornering guests into submission. He talks to them in bad faith and asks  baited questions and only baited questions. The guests are in a lose-lose situation with every question he asks. They are more slam pieces or judgements without actually being an interview.  Personally I don’t enjoy it. It’s like writing hate mail, like all the subreddit drama he hates but actualized in real life. He’s not trying to truly understand anyone. He’s tunnel visioned.",
            "Dude took the cat on friday, gave him food and water on the weekend and was with it at the vet on monday 3 and 1/2 days later, what the fuck does Ethan mean \" Wasn't fast enough for the cat either\" , like FUCK YOU dude I'm so angry and frustrated at Ethan and I know I shouldn't but it's just fucking crazy thing to say. Scumbag.",
            "yeah i was surprised by her response to that. like yeah actually i am going to judge someone for that because it's awful",
            "Hila is incapable of not seeing these situations through her own lense it’s so frustrating. No one is talking about stealing your dog and then them dying, this was a starving cat that had no food or water and had never been to a vet. \n\nHe wasn’t giving incel, he was saying you don’t deserve to know about the outcome if you abused your pet… how did the plot get so lost the conspiracy theories were so embarrassing",
            "Agreed, and there might have been justification to take the cat. 4 days after he took it, a vet said we should put it down due to its condition, that means it was in rough shape.",
            "Exactly! They’re saying it was Jacob’s fault because the cat died in his care but if you adopt a cat and it dies within 2 weeks, anyone would assume they were given a sick cat. \n\nAlso the vet was ready to put the cat down 4 days after he took it. Is a vet really gonna put down a cat just because it hasn’t been eating for 4 days?",
            "Dan and Olivia had the sanest takes on this topic. I really can't understand why they took her side so hard it's really weird.",
            "At least with Daisy it made sense at the time",
            "Might go down in history as the worst episode",
            "the fact that the hehe pod is defending her is making it worse.",
            "Agree with you 100% and it is a very common and difficult to witness sentiment among dog exclusive pet-owners. The suffering of cats is not treated with the same level of empathy.",
            "Yes! I strongly believe H wouldn't be reacting the same way if it had been a dog.",
            "At least Olivia attempted a good take. She was a bit beat down for it though.",
            "Man, Love can have some crazy dumbfuck takes. I said it.",
            "Yeah I laughed hysterically when she showed “proof” his fur was normal when the first pic was all dark and the second pick just showed his head. Like girl who do you think you’re fooling?!",
            "Absolutely, it’s hard to watch them dogpile on him and call him an incel, he doesn’t deserve that at all. Completely unfair coverage of the situation.",
            "The accidents at Disney was a better segment, than this 4 hour episode on a dead cat..",
            "number 2 is such an awesome idea",
            "Watch ethan struggle to take a shit for 3 hours",
            "2 hours? try 4",
            "It’s overdone but I’d love to watch the crew play Among Us",
            "I’m very intrigued by piss challenge. Longest range? Maximum velocity? Color?",
            "I hate to agree with this because i love the show and crew,  but i was caught off guard by their take. Especially hila saying he gives off \"incel vibes\" because he criticized her for partying instead of watching her sick baby..",
            "As Hila has learned to come out of her shell more, we unfortunately realize the true her is not a nice nor good person",
            "Yeah I hate to say it but Hila was way off. He thought it just needed to be fed. After a couple days he realized it was far worse so he took it to the vet (something it's owner never did). The fkn vet said it should be put down.  That likely didn't happen in the 4 days he had it. That sounds like the cat was sick under its owners care long before he came along. Don't get why Hila was jumping to so many conclusions. ",
            "That's a bit harsher than I would have put it but I get the sentiment. Her and Ethan both were going with what they wanted to believe from the beginning instead of looking of the facts and working outward. \n\nObligatory longtime fan, first time poster, but this was the hardest episode to watch in a long time for me. I love Hila, but she commands the room when she gets passionate about something. Awesome on good takes, not so great on bad takes. She had everyone swayed by the end and it was pretty insufferable. The only real winner was Dan because he stayed out of the majority of it. He's a good man.\n\nBut like everything they said tonight, this is just my speculation.",
            "Them not knowing anything but talking shit is becoming a defining feature of the show. \n\nIt’s getting really depressing. Was my favourite show but they can be so god damn arrogant sometimes.\n\nI get that they’re upset by the subject matter, I get that it was a last minute segment choice to cover Bobby being unavailable, but they frequently have the worst fucking takes recently.",
            "I love that she didn't want to go on and for some reason was rewarded with their favor instead of the guy who actually tried to explain himself.",
            "I feel the same. I can’t finish this episode, it is just so completely horrifying",
            "Hopefully they read all of these comments and apologize to this kid. What a disappointing episode. Not funny, not entertaining, not reddit being Karens. This was bad.",
            "It's legitimately hard to watch. Them saying there's incel vibes because he said she didn't deserve to know, welp, she doesn't. The cat had never been to the vet and it's been sick long enough to be matted and emaciated. Olivia seems like the only one not completely off the rails rn.",
            "I find it absolutely crazy that they’re putting most (if not all) of the blame on the guy when he actually took it to the vet. The girl had a sick cats for months and did nothing. I’m not saying the guys methods were or is correct HOWEVER the fact that he actually took it to the vet and made sure it had food/water is WAY better.",
            "Also if the cat was so sick that the vet recommended it be put down right away if the cat was going to lose weight even if he was trying to help the cat. I am a bit behind but I hate that she is involved I don't want to hear anything she has to say, she was obviously negligent if not for not caring for the cat definitely for not taking the cat to the vet.",
            "Yeah this gets grosser by the minute. We’re questioning why he took the cat and overlooking the fact that the CAT DIED\n\n“Did you have any romantic interest in her”\nBruh this is a gross implication\n\nAs I’m typing this Ethan said “this led to the cat dying”…so now it is his fault? Absolutely wild",
            "The vet recommending that is a really good point that isn’t being brought up enough. He didn’t kill the cat in 3 days",
            "Also they completely missed the mark when they started focusing on Jacob’s dating history. Totally irrelevant and speculative. That poor cat deserved so much more",
            "And it's even worse when you have the chat saying he behaves suspiciously just from his body language. Someone needs to say those people that body language reading is total bs",
            "Insane the way that they kept saying “it died in his care”. If someone goes to hospital and dies after 2 weeks there, did the hospital kill them?",
            "“Maybe this malnourished cat was actually a healthy weight and lost half of its body weight after this guy tried to save it”",
            "Agreed.\nRest in peace, sevyn",
            "Yes. At the end of the day all this cat knew was neglect and pain. Living in such a chaotic environment, constant noise and loud music, untreated illness, starving to death. This poor little girl. Rest in peace.",
            "Crew was way too hostile towards him. He seems well intentioned minus pretending the cat ran away.",
            "Ethan and Hila were waaaay off this whole episode.",
            "Honestly its just making Ethan look like a fucking idiot",
            "Not a hot take at all. Ethan and Hila were way off base with this one.",
            "Not even close to a hot take. I invite you to find someone on this subreddit or comments here that is saying the interview was reasonable.",
            "Honestly. This podcast only talks about cats for some reason. Might as well change the name to The :3 Podcast.",
            "[removed]",
            "Calling him psychotic is way out of line to me. I know it's not legal but if I saw an emaciated cat like that, I think I would take it too. Cats don't get matted like that from a matter of days. It's been sick for a while.",
            "This is very well said. I kept on thinking to myself that they would be appalled/completely outraged if Sevyn were a dog. I actually unsubscribed because of this episode. The complete lack of empathy really disturbed me.",
            "Thank you for this",
            "This is what they need to do, but they won’t.",
            "The topic was interesting at first but man this is a rough watch seeing them come down so hard on him and not the girl who obviously neglected her animal.",
            "1000000%",
            "It’s extremely unnecessary, I wanted Friday fun and this is just grim",
            "Excellent work",
            "LITERALLY! The dude obviously did some VERY sketchy stuff HOWEVER it seems like that cat was badly treated for a very long time by the girl and Ethan and Hila putting most of the blame on the dude is crazy",
            "Yeah if this was a story about a neglected dog Ethan would have NEVER had the alleged dog abuser on",
            "I really hope after processing the story and seeing more points that they will have a better take on it Monday. And I swear if they have her on I want to see the same bad faith energy with her.",
            "Yeah, very odd to come down so hard on him when obviously her care of the animal is what lead to the cat's death.",
            "They’re all so LA brained I swear. Like every decent action has to be coated under 50 layers of bad intentions",
            "Yeah they were comparing it to a human being able to lose a pound a day if they didn’t eat, a cat does not drop more than half of its bodyweight after four days.",
            "Also, it’s crazy to paint him as an incel who’s in love with her. They didn’t gel. They were kids that messed around for a couple of weeks and then didn’t like each other. It happens. The judgment by the crew is fucked.",
            "The cat was so thin he saw it for just a few minutes  and decided to take it, the whole crew seems to be glossing over the fact that the cat’s appearance scared the guy enough to come up with the whole plot",
            "Yep same. Don't need this.",
            "And no Uncle Gabe",
            "It might be the worst ep ever, I haven't ever skipped an entire episode before. I've skipped segments but the fact that this depressing shit was the entire episode blows my mind. I would have rather had no episode at all than this tbh. Love yall but this shit was an awful choice for any day and especially a Friday ep.",
            "👩‍⚖️",
            "I really don't think it was necessary to watch the video of the sick and dying cat. I've watched too many animals get old, sick, and die. I don't need to be reminded of the worst part of being alive. Might bounce this ep",
            "Yeah abuse of power over something utterly defenseless is literally the worst side of human nature and I was only expecting to see Bobby Lee being inappropriate.",
            "It's like they forgot that the girl was neglecting the cat...",
            "Conveniently they’re going on break soon anyway",
            "Your first paragraph is a 100% spot-on summary of what happened. I wonder if Ethan and Hila zoomed out from their baseless speculation and read that paragraph, if it would change their minds.",
            "I'm not really sure why they couldn't understand that. He thought the cat was neglected not experiencing a severe medical issue.",
            "Hila is literally just mad the guy took the cat away from its abuser, pretty insane",
            "Plenty of funny ones got put up on the sub, they would have been great to go through. Plus the rest of the crew didn't share theirs",
            "They’re twisting his story to make him look guilty. It’s so disappointing. They’re letting her get away with neglecting that baby for months.",
            "[removed]",
            "Maybe they thought his tone was too personal when he was saying that? His judgement was spot on with it",
            "If they would have just said Bobby cancelled and they want to take an extra day to prep for the live show I think everyone would have been fine with that",
            "I agree I felt like them grilling him was so unnecessary. Definitely don’t agree with some of the choices he made but i think he meant well.",
            "I honestly would’ve preferred they cancelled today’s show to prep more for the live show next week instead of this.Actually I think many would prefer that anyways.",
            "It's giving high school cafeteria table",
            "Even Love was making statements as though he’s an expert, but he didn’t really know what he was talking about. My partner is a trained vet tech and he was just yapping, posturing as someone who knows about cats because he just got some",
            "Yeah, I always find it bizarre in situations when someone is clearly doing something wrong and someone tries to step in and do something good but don't do everything perfectly right and everyone chooses to come down harder on the person who tried to do something good instead of the person clearly in the wrong. \n\nObviously this guy had good intentions even if he did make mistakes in the situation, I fail to see how he's the monster when the girl was neglecting her animal. Is he right, no. But she is clearly wrong.",
            "I also don’t think you guys spent enough time talking about the conditions he was saying the cat was in… Love talked a lot about the environment needed for a cat. I think we can all agree the cat being locked in the bedroom during constant partying and filming would be stressful. Scary noises, weird smells, and no means to escape. My cat won’t even let me close a door while I pee, they hate being locked anywhere and are naturally curious.",
            "It’s not worth watching honestly",
            "She obviously got so stressed that he took her that she instantly dropped half of her body weight 🙄 that’s the only option",
            "she never should have been approved by the adoption center",
            "Lol its punishment for telling Ethan no more boomers",
            "I count on the Friday shows to kick off my weekend. This ain't it.",
            "TF ad into a 3 hour dead cat exposé. Wasted episode",
            "Yeah, they would be fucking pissed at the dog owner for not observing the obvious signs that your animal is in distress, not getting mad at the person trying to help. Such a stupid fucking episode.",
            "If it were a man who neglected a dog, they’d be out for the owners blood",
            "There’s no way anyone liked this",
            "And this is why they're hemorrhaging subs and less people are tuning in, myself included. Today's ep just solidified it for me. Stretching out lame, mundane \"drama\" for 4 hours. Plugging an ad and teddy fresh. And calling it a day. Truly peak podcasting. I mean, how could you not be entertained listening to a 4 HOUR breakdown of an influencers potential cat homicide?!\n\nOh and after all that Ethan and Hila still manage to have the worst take possible lol every comment on YouTube is calling them out for grilling him and going easy on her as soon as she started sending super chats.",
            "Same. Especially cats.",
            "Don't worry, Ethan and Hila didn't listen either and just shit on a dude who tried to do the right thing for 3 hours.",
            "It must be a nice privilege thinking you can get any animal into a vet the day you realize something is wrong, especially during covid. And I'm a huge H3 fan, haven't missed one episode in years. This was shit",
            "Hila was like, \"if someone stole my pet and it dies, I would COME AFTER THEM\", not realizing that that is NOT Reagan's attitude at all! Like, how is Hila not curious why Reagan isn't going fucking crazy learning about this, but instead shows weird videos trying to prove there was cat food in the house?!",
            "I agree. I’m laying with my cat in my bedroom until they finish this segment",
            "sorry about your cat fuckin fuck yeah you were a good cat parent and they loved you for taking care of them fuck baby shit on my butt",
            "I’m so sorry for you loss cats are incredible creatures and I would do anything for mine. I had to leave the stream this story is so fucked.",
            "i can comment to let you know when it's over",
            "AB was NOT talking sense he literally was trying to make a theory that Jacob stole the cat for content",
            "Hila shut Olivia down quick when she was trying to reel it back in lol",
            "I was proud of Olivia for standing her ground.",
            "Just too bad it had to be on the cat abuse episode.",
            "I lost my mind when they said that. I would ABSOLUTELY judge someone for partying while their pet is sick!",
            "i think it was planned to be the whole show because bobby canceled",
            "Are we grilling this guy for trying to save a clearly neglected cat???? Ethan and Hila are absolutely ridiculous for this interview",
            "I totally agree, I don't care if it's controversial. If I see an animal in distress or neglected I'm going to help the animal. I'm going to assume that telling you your animal is neglected or abused will not change anything except prevent you from helping the animal. I realize a lot of people see animals as property but it's a living being that should be helped and I agree with what he did.",
            "Her having the cat for months and not taking it to the vet breaks my heart",
            "this is all they will talk about, they had no show because it was planned for Bobby and Khalyla to be on but they couldn't make it.",
            "I'm clambering for the basil segment",
            "& still going an hour after this comment.\n\nI've been popping in & out of the stream every 20mins or so bc it's been the entire episode, & it's still going.",
            "Hey I’m so sorry for your loss. I went through the same thing with my cat, it’ll be 2 years next month.  I know it’s traumatizing. Stay strong, she’s still with you.",
            "Not being \"entertained\" by stories of animal abuse does NOT make you a snowflake, it makes you fucking normal lol. Only someone with serious issues would be stoked to tune into that kind of thing. Very shocked they decided to run this story.. yikes.",
            "Same! I’m kinda not emotional at all, but I actually found myself feeling triggered and actually upset when they showed that :(. I know they said they were showing it and to look away…but still. \n\nGlad I’m not the only one. I still love the crew. But idk, I just could have done without them insisting on showing the videos.",
            "No I’m with you!! First time ever I refuse to watch",
            "I dont think youre too sensitive. Pets are innocent beings, it be like showing a passed child to me.",
            "Yeah once Ethan said he was gonna show a dead cat I immediately noped out. ",
            "He's treating this like a humorous segment. It's such a weird energy.",
            "I missed a bit of the beginning of the episode if they explained it, but damn, hasnt Bobby and Khalyla dipped like 3-4 times in a row now? 😭",
            "I would have rather watch bobby struggle drinking a sodie way more.",
            "Strap in its the entire episode",
            "I didn’t see most of the ep, but I am fairly certain they wouldn’t be able to stomach so much of this topic if it were a dog breed that hit closer to home. ",
            "He said it was oozing or something it might have gotten worse overnight and talking for a long time on a podcast wouldn't be smart 🤷‍♀️ im not a fan of his but it seems reasonable",
            "That's true, almost a 3 hours show on the same topic is a bit much 😅",
            "The only poll they did was about who we thought was responsible unfortunately…",
            "The 'comedy podcast' is rarely actually funny",
            "I keep checking in and the story is still going so I think it’s just the show today…",
            "i told a few people i'll comment on their post when it's over. will do the same here",
            "Extremely common Hila L",
            "Thanks!",
            "It looked a bit silly with everyone piling on speculation and assumptions, when they had just told him he was making a lot of assumptions about the cat. Which they are also doing. Blah:(",
            "The way they will just take any random girls word without question and then just throw the most insane speculation on guys is just getting laughable at this point. Its even worse on Fridays when Hilas there",
            "It's cause she's a girly. They tend to just believe all women on face value till proven otherwise. WHICH IS NOT NECESSARILY A BAD THING! It just sucks when so many times they do it and the lady is full of shit and lying, telling them exactly what they wanna hear and then later, after everyone is done shitting on the naysayers, it comes out she WAS lying lol",
            "yeah, i agree w/ u 100%. i’m only able to watch part of the live pod on Fridays, so i may have missed him saying that? or i just missed it while i was watching,but yeah what he did was very strange. the whole situation is very strange, but ultimately Rhegan is responsible for the death of her cat. she can blame him all she wants and i get her anger because she’s just finding out about all of this now, but her not taking Seven to the vet the multiple times she needed to go is the reason she died.",
            "RIGHT!?!?! She tosses out 5 bucks and suddenly we are on her side? Hail no.",
            "I guess I just assume first time pet owners can’t recognize signs of illness or red flags quicker than previous pet owners but I can’t say since I’ve had pets all of my life haha",
            "she was 100% wrong for not getting blood work, kitty probably had feline distemper or another virus and these also can show no signs until it’s too late. \nwhy did this kitten not have blood work as soon as she got it?!?!?? im sorry this is WILD",
            "And he was completely right, at that time it was VERY difficult to get animals in to see a vet. Especially one that wasn’t an existing patient. My vets office stopped taking new patients and existing patients had to be dropped off. They just started taking new patients and letting owners come in with their animals last year.",
            "All the speculation without basis that they piled on after getting off the call with him was really uncool. Just making up unfounded claims without a shred of evidence is out of pocket. Why give the kid a chance to speak for himself and then do an hour of speculation afterward that he can't defend against? Calling him an incel and saying he took the cat to get her attention is weird.\n\nAlso, FIP isn't contagious, so his cat having FIP wasn't a danger to Seven.",
            "Not to mention that before she knew it was her cat she denied that the cat from Reddit was hers. There was no drastic change that could’ve taken place in that time to make her forget what her cat looked like and despite what the crew said, a cat would not lose weight that fast, it had to have already been significantly underweight. I have seen videos of people recognizing their pets that were lost and picked up by a shelter after months or even years apart, you don’t forget what your pet looks like after four days unless you really weren’t that invested.\n\nHer use of “the cat” or “it” and the fact that her excuse for not posting about the cat or calling around to shelters was that the day of she yelled at the roommates and walked the neighborhood is insane. Even her crying pictures that were supposed to prove she cared overlapped with a break up so they technically could’ve been about that and not the cat because nothing in them was specific. \n\nAlso for a cat to have an empty water bowl is just weird, cats usually take a while to finish a bowl of water and I know people that change out the water just so that they have fresh water before the bowl is seen empty. (and she downplayed their relationship by saying “he knows I don’t fuck with him and how would he even know, he had just got there”, acting like he was a stranger at the time, until she saw that Ethan pushed the angle that he was some kind of scorned lover and then suddenly she wants to talk about how they had something the very first week they moved in despite both of them immediately getting into other relationships 😐)",
            "But you don't understand, the months of her neglecting a sick cat don't matter, he's clearly a weird incel that's in love with her and took the cat to the vet to win her love!!! /s  \nThe only level headed one today was Dan as usual",
            "When was the last time the podcast even slightly criticized a woman at all? Even when she is so clearly in the wrong it doesn’t matter cause she’s a “queen” and can’t do nothing wrong. It’s honestly so frustrating and isn’t as progressive as they think it is.",
            "And he isn't wrong. My cat also had FIP, although a little further along in the pandemic, so things weren't quite as locked down. The emergency clinic in my town gave abysmal care. They were just awful, and it cost $800 to have them do basically nothing (we had mis-placed an injection, and the fluid migrated to Larry's neck. I panicked and took him in. He was fine).\n\nThe closest *decent* animal hospital/ER is an hour away, and the 2 times we took Larry in it was a 6+ hour ordeal plus drive time, and cost around $2k for two visits. That's a lot to ask of a kid who is 18-20 years old, especially for a cat that isn't his. I know he took responsibility the moment he took the cat, but I'm sure he never expected the cat to die just over a week later. He thought some food and love could save her. It's tragic that help came too late.",
            "the jeff one was at least a little funny iirc, this one is just cringe and sad. i feel simultaneously bad for and frustrated at everyone involved, i cant even get myself to laugh when ethan makes his usual remarks during debates bc this situation is so fucked",
            "She’s incapable of seeing anything from a perspective other than her own. She’s been so off putting lately.",
            "I really didn't understand the bending over backwards to give her excuses but then making up stuff about him. I realize there was a lot going on in this story to process and then make an opinion on but the baseline is still she neglected her pet. Olivia said it best, the cat died!",
            "it is starting to become sooo frustrating hearing her brain dead takes when she's always the least informed on the show. and she always gets so high and mighty about it too. is this boomer brain??",
            "Unfortunately I’ve seen this said way too often recently.",
            "True. Both she and Dan seemed the most level headed. She stopped speaking after it was clear hila wasn’t agreeing with her (no hate to Oliv at all, I’d be intimidated by my bosses having such a major reaction as well).",
            "Exactly! Can’t forget the picture of him in the cardboard box that’s also in the dark where you can barely see him or his fur yet she’s claiming that as “proof” his fur wasn’t matted🥲",
            "Exactly. They were just going off assumptions and theories instead of actual content Rhegan has provided already which is pretty damning in her case made me so frustrated. Like did the pod know that Rhegan also admitted to throwing her dog out of a 2 story window because she thought dogs could fly when she was younger?? There’s just so much more research that needed to be done about her perspective on pets and being an owner that the pod didn’t do which doesn’t bring enough justice to Sevyn and let’s Rhegan off the hook.. again.. Also the fact she didn’t even wanna call in is a huge red flag as well. Sigh.",
            "Right I keep skipping forward and still this damn cat talk",
            "They’ve done this one already for members",
            "That confused me. If your pet is sick it's the right thing to stay home and look after it!! Going out partying instead is psycho behaviour.",
            "Exactly! He called shortly after he took it, had to wait a weekend and the office was closed Monday, and got in for an appointment first thing Tuesday morning! His alarm bells went off within what, 12 hours of having the cat? That cat was beyond the point of helping when he stepped in",
            "Remember when they cut out the part of hila saying she texts and drives? Shit isn’t new",
            "Hila’s issue is that she is willing to take hard lined stances when she doesn’t have the whole picture of something yet",
            "It’s the H3 podcast we only attack men here",
            "This is exactly what I mean! He's being analyzed so closely with such a negative skew it's just unbelievable to me. People actually being more charitable to the absuer than the rescuer in this situation and it's outrageous! I hope if these people ever do anything half as good they are not scrutinized this way!\n\nEdit: spelling errors.",
            "I wouldn't even mind them reacting to cute cat videos lol this was just too sad and boring and LONG.",
            "Right! This is honestly such an sad situation and it all started with death of a cat. It shouldn't have happened in the first place. There's no winners here, no heroes.",
            "They both abused and neglected the cat. But it was HER CAT. SHE agreed to the shelter for providing for it, protecting it, and nurturing it. She failed miserably POINT BLANK PERIOD. doesn’t matter what some roommate did. It was HER cat.",
            "Exactly. they kept saying “wow you only saw it for 5 minutes and decided to take it?!”…ya the cat was in such terrible shape it only took 5 minutes to reach that conclusion.",
            "I keep fast forwarding and I'm shocked it's the whole episode. What a waste for the last official Friday ep before the break.",
            "I work in the vet field & see animal death and suffering on a nearly daily basis, I came home today after a particularly bad week and was excited to just sit and watch the podcast then saw… 4 whole hours of never ending animal abuse talk (accompanied with some really bad takes!!) I don’t skip episodes often but this whole thing is a hard pass for me",
            "i don't get how they jump to \"he stole the cat, it died in his care\" and completely choose not to recognize that that cat was neglected and clearly sick.",
            "Absolutely by grilling the man so harshly they're by default abolishing her of guilt. So silly",
            "Right😭 like I love hila but I think she's forgetting this woman was neglecting this cat and clearly wasn't a good owner. She had no intent to take the cat to the vet and imo the cat would have passed in her car regardless😭",
            "He was completely right! They were looking for any reason to slam this guy and jumped on the incel theory because they had nothing else to go off of.",
            "He definitely could have taken the cat to the vet sooner but her actions clearly killed the cat. Bizarre to blame him so much. Like if they speak to her I want to see the same energy.",
            "AGREED. Its so weird that they were like OH YEAH HE'S LYING, but don't at all think that she could be lying about them dating for a week which even so...who fucking cares. It was so flippy floppy.  and they just took her word as truth instead of asking for evidence of that. It was painful to watch and experience.",
            "Horrible energy and on the first day of summer 3 hours of dead cat talk and now interviewing some completely random nobody 😭",
            "Especially after mocking the girls evidence the entire fucking episode I can’t believe they sided with her",
            "Thank you, Uncle Gabe. You always know what to say.",
            "they are doing this the whole episode, aren't they? 😞",
            "welp. this is awkward",
            "Please",
            "Literally. They’re letting the girl get away with animal abuse.",
            "Completely. I feel like we’re losing sight of that during the call in with this guy.",
            "The show has a tone... and this.... is not it. It's so jarring. It's weird that they've doubled down but I guess there's an audience for it so here we are. I had to stop right at the beginning. It just turned my stomach. AND THEN I HAD A HARD TIME FOR THE REST OF THE WEEKEND. I don't have a problem facing difficult truths, but there's a time and a place. It's just such a strange choice for friday night baby wooo :(",
            "I feel like had this been a dog then Ethan wouldn’t have shown it.",
            "Daisy, now this girl. I wonder whats next...JLO?!? LMAO",
            "well as someone who got my first pet ever at like 24, within the first month of having her I was furiously googling to figure out if my cat was breathing too fast and almost took her to the emergency vet. if anything I feel like you’re even more paranoid bc you don’t know what’s normal, but I guess there are just two different types of people when it comes to stuff like that",
            "and the fact he wasnt even hostile when they were accusing him..hes innocent",
            "Oliv was cooking but was shot down </3",
            "I was so annoyed at how they said that she had a point when she said that if Antonio actually believed she did that then she wouldn’t hang out with her because they would think she’s a bad person and wouldn’t like her but then when they thought it seemed like the guy didn’t like Rhegan they called him an Incel and said that him not liking her means that he was biased and did it out of spite. There was literally no response that somebody could’ve had to her that they would’ve been deemed acceptable to them. Why should somebody that believes somebody neglected their cat to that point have a good opinion of them?",
            "That bias really is exhausting. Hila in particular tbh..  \nI think they're all good people trying to make a good show, and I enjoy it 99% of the time even if I don't agree with everything they say, but the obvious and constant man=bad, woman=queen is genuinely isolating to anyone who's not a 20/30s yo middle/upper class white woman.  \nI get that they're their biggest audience since frenemies, but still. It constantly reeks of misandry and hate.  \nI got the feeling that Olivia gets this and that's why today she was trying to be nuanced before she got shut down by Hila.",
            "Thank you. Been pointing this out for a while and being called misogynistic...",
            "Yeah the whole fresh and fit and Daisy incident where they were yasss queening her and later it turns out she had lied and already had the abortion before even going on H3. Did they ever mention her again after that interview?",
            "Show is going down the tubes, a weird shift happened post Ethan vs hasan on capitalism and then Israel/palestine. Since then he has gotten worse and worse",
            "Also saying that second hand accounts of her being neglectful don't matter but there's no one saying that she genuinely cared for the cat and all of her evidence being really flimsy lol",
            "it’s literally the entire episode:((",
            "Seems like it today. Disappointing.",
            "Absolutely. I wish they gave her the same treatment when they were commenting on the PowerPoint.",
            "my god i feel like im finally not going insane in this comment section, you should see the comments on kauschdaddys video. regan has HUNDREDS of her stan’s defending her animal neglect, it seems like the HEHE pod was paid by her to defend her in this video.",
            "Then saying “she mistreated the cat for a while” and “she’s not the BEST pet owner”… WHAT?? A cat weighing 3.8 pounds at that age is ABUSE. They’re downplaying what she did.",
            "Yeah, there was so much assuming about him yet they took everything she said as truth and downplayed the neglect she absolutely had. She was wrong for getting a cat in the first place, and even worse for proving she did not have the life or circumstance to take care of a cats bare minimum needs.",
            "It was insane to watch. Especially when he mentioned covid time, and their previous experience with an emergency vet. Makes total sense that it took some time, especially when they believed the cat was “just” being neglected. She would’ve seen the obvious deterioration that he didn’t. I knew my cat was underfed, so I was able to bring her back to health. He didn’t know this cat was unwell on top of neglected.",
            "For sure! It seems like Ethan and Hila has decided that it’s his fault alone (crazy) and now they’re just trying to make him look more guilty(?).\n\nThe girl literally owned a cat FOR MONTHS and acknowledged that it was sick and DID NOT take it to a vet? Yet they’re treating him like a villain?\n\nHe is absolutely weird/wrong for stealing a cat but she straight up neglected it.",
            "True. She was trying to be fair, but unfortunately she got shut down before she could even expand on her opinion.   \nIt seems to me that she's become aware of the tribalism that's going on",
            "then when they got called out they did NOTHING to admonish her in any way and literally said \"well if she got clout from lying right to our faces then who cares?\"... so annoying.",
            "100% that's when I stopped watching",
            "But it's actually all his fault and not hers for some reason. Insane takes today from the crew. Shoutout to AB and Olivia for having sense."
        ]
    },
    "I see no other option": {
        "title": "I see no other option",
        "score": 531,
        "url": "https://i.redd.it/0p9x1d60338d1.jpeg",
        "content": "",
        "num_comments": 65,
        "comments": [
            "And why was the girl seen as not the problem? Was so confused that they got to that after four fucking hours",
            "“if you don’t want to watch, just skip the segment!” but the segment is the whole show…",
            "4*",
            "Why couldn't they have just done the high school stories. That would have been more fun",
            "4 hour segment of 2 grown adults harassing someone for trying to save a cat while the girl that never even bothered to take it to the vet got off Scott free.",
            "Why even bother to spend so much time on some random he said she said influencer drama anyway. No one knows anything, no facts or real evidence and there’s so little to go on but their own misconstrued stories. What a fucking train wreck of an episode, I’d rather watch paint dry. In fact I did just that and it was way less frustrating and more entertaining, highly recommend.",
            "Such a shame... The show is supposed to be entertaining but it was just really stressful and frustrating to listen to. I've supported the show since day one but this was by far the worst episode with some horrible takes.\n\nEthan and Hila really need to be more open to opposing opinions too. They just had shitty attitudes for the 4 hour long ep :/.\n\nI really hope they acknowledge and learn from it.",
            "Yeah I skipped this episode and dropped my sponsorship level.  Been on board since 2016 and am struggling lately with the show’s content.  It’s probably just me but I’m not loving it as much as I used to. 🤷‍♀️",
            "Wtf is happening since the H3 show rebranding?!",
            "Yeah I just skipped the entire episode after the first 20 minutes",
            "Any time Bobby Lee is the guest, you have to expect him not to show up. This happens all the time for all sorts of reasons. Valid or otherwise.",
            "“this segment isn’t for me I do not care about this let me skip it… oh”",
            "They’ve been really bloating episodes with things that are hard to listen to. Peace and love the best eras are behind us I’m afraid",
            "WE WANT CREW SEGMENTS🙌🙌🙌",
            "4 hours\\*",
            "Yesterday's ep was a wash for me",
            "They talk about wanting to save the SA and Child Abuse stuff for the end. But someone mistreating a cat gets a mega episode???",
            "This is what I mean when I say the episodes are bloated",
            "And they wonder why people are embarrassed to recommend the show to others..",
            "H3 is missing the mark quite often. If they did silent library every single show they’d have millions of views",
            "Oh no… I haven’t seen Friday’s episode and this meme makes me nervous 😂",
            "*4 hour episode about dead cat",
            "First time I ever thumbs downed a vid",
            "It seems like the segments I LOVE (storytimes) always get rushed & Ethan doesn't want to do them but the segments like this go on for hours",
            "[removed]",
            "What do you expect from the guy who has two tattoos of a dog on him?",
            "I have only seen half, and now that I know they sided with that loser, no way I'm finishing it. That is completely insane to me.",
            "I agree i could not wrap my head around why we were going after this guy . That cat was already dying , I would have done the same thing.  Who cares about that girl and her feelings . Just because shes in chat ? She didn't take care of the animal and didn't care.  grilling and making that guy feel like that for calling in when she wouldn't do it is crazy.  I'm surprised he stayed on as long as he did.  He literally tried his best to save a cats life and is getting ripped apart.  The cat was dying regardless if he took the cat or not. It did not decline in the 3 1/2-4 days he had it.    The cat was dying and would have died a whole lot quicker if he hadn't.",
            "Cus they can't call her an incel",
            "I mean she was also the problem, she just wasn't on the phone to talk to. I have no idea why people are feeling so bad when his idea was to take the cat so it could go to the vet and then he DIDNT TAKE THE CAT TO THE VET for 3 full days Why???????? If you STEAL a cat to take to the vet, take it to the vet, then there's no question about what happened. \n\nI mean I get that he MAY have had good intentions (hard to tell with all the info that's come to light.) But ultimately he and his accomplices failed to follow through with those intentions. Why involve yourself if you're not going to do the hard part and get the cat into the emergency vet? I don't want the guy to not try anymore in the future but he will have to do better. If he took a human child because he presumed after 5 minutes that the mother wasn't taking care of it and DIDN'T find out the child's prior medical issues OR take it to the doctor, then the child died under his care, he would be charged with manslaughter and kidnapping. He made the wrong decision. He should have pushed her to take the cat to the vet right away.",
            "I mean I’ve skipped whole shows before. Sometimes the vibes are off and it’s best to just skip.",
            "Literally just about ANYTHING else would have been more fun 😭",
            "i’ve been waiting for that this whole week 😢",
            "Hey yeah they didn't finish. Wrf.",
            "Yeah this was insane. They were straight up harassing this guy during the \"interview\". I don't know how the guy put up with this shit. It was just nasty",
            "Like what the fuck was that interview?? Crazy. Interrogation to the person who tried to save the animal haha",
            "I wish i stopped after 20 mins. When they kept replaying clips  then after the 3-4 times someone one asking \"is it replaying?\"  Not even the crew waa paying much attention it seemed. And i swear they were starting / stopping and restarting on purpose cause it was a funny gag. I should have turned it off but i was cleaning and didnt have anything else to listen to",
            "You’ve just made me realise why I stop watching most episodes, they’re stressful to listen/ watch. It’s not what I want to watch after a long day",
            "Same and same",
            "They’ve had more duds than good episodes since they came back. I don’t understand why they got rid of after dark. Maybe the other shows ok but after dark has such a fun silly vibe and gives Friday vibes for the last 4 years.",
            "maybe Ian isn’t the creative genius we all thought he was 😢",
            "I skipped around because I assumed they would move on after 21 mins...",
            "Really? I'm a more recent and casual fan, so haven't really watched any episodes with Bobby Lee. Does he have a history of bailing out?",
            "RIP H3s best content 2020-2023",
            "I personally love the length of the episodes.",
            "Reaction stuff is so lazy when you have a whole crew.",
            "me neither.. I actually been away and have a weeks worth of episodes to watch but the sub is making me feel like each episode is a straight skip 😭",
            "This post was removed because your account is less than 40 days old, this is to prevent spam and rule breaking. Make sure to read the subreddit rules [here](https://www.reddit.com/r/h3h3productions/about/rules/) and get acquainted with the rules before posting. Please do not contact the mods about this we get 3 messages a day about this. You can start posting after a week. Sorry for the inconvenience. Thanks, h3h3 mod team.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/h3h3productions) if you have any questions or concerns.*",
            "Tbf, I ended up watching everything and imo, it seems like because the dude called in, he sort of incriminated himself more which made him seem more guilty.\n\nThey did not let the girl off the hook, but because she didnt call in they seem like theyre more believing her. But Dan did bring it back and say \"its a he said she said\" situation and at the end they concluded that everyone sucks and they wont really know until someone else who lived in the house speaks up.\n\nThis is just a summary for what I saw in the episode for anyone who might be a bit curious but I will defend them a bit and say they didnt seem to side with anyone at the end but the story started unraveling a bit and they acknowledged they need a new perspective bc both are untrustworthy sources.",
            "The moment Ethan heard she was in chat, his whoooole vibe around her changed. It's just so stupid, if you're going to be bias to a fan then don't talk about this shit haha",
            "My understanding is he thought the cat was just malnourished, not sick",
            "I said the same thing! \"nobody is listening eveything keeps getting repeated\"\n\nThen I said \"no way this goes on much longer\"  Then I skipped around and wow...",
            "I miss when off the rails was actually off the rails with the crazy intro and the crazy/goofy subjects.",
            "I don't know if he's ever canceled on the H3 pod but he canceled when he was supposed to be on Howie's live pod once. I like Bobby, sometimes he's unreliable though when it comes to being a guest.",
            "Honestly I loved the 2017-2019 era most",
            "They're always so biased to the girlies, especially hila.\n\nIdk what their problem was yesterday but jesus Christ no wonder theres a snark subreddit",
            "[removed]",
            "THAT MADE IT SO FUNNY FOR ME 💀💀",
            "It's crazy people are this heated about a fuckin cat but don't give a fuck about Palestinian children dying and Ethans shit takes on the situation that lead to the end of Leftovers.",
            "This post was removed because your account is less than 40 days old, this is to prevent spam and rule breaking. Make sure to read the subreddit rules [here](https://www.reddit.com/r/h3h3productions/about/rules/) and get acquainted with the rules before posting. Please do not contact the mods about this we get 3 messages a day about this. You can start posting after a week. Sorry for the inconvenience. Thanks, h3h3 mod team.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/h3h3productions) if you have any questions or concerns.*",
            "Honestly that's probably the worst strawman I've ever seen. Did you even put effort into it?\n\nNews flash, multiple things can be going on at once",
            "absolutely go touch grass",
            "Can we talk about the economic and political state of the world right now",
            "Strawman? You're a joke. Newsflash it's true you fuckin mouthbreather",
            "You're not even trying 🤣 \"um actually people are dying so you can't be upset about anything else ever\"\nAbsolute degenerate behaviour\n\nWhat have you done to support Palestine besides crying about it on Reddit?"
        ]
    },
    "Only 1 man can humble Ethan enough to give the show the reset it needs": {
        "title": "Only 1 man can humble Ethan enough to give the show the reset it needs",
        "score": 1607,
        "url": "https://i.redd.it/7pmu9pice08d1.jpeg",
        "content": "",
        "num_comments": 158,
        "comments": [
            "\"What is this weird fucking cat podcast you're doing here??\"",
            "What Ethan did with Sam Seder on Steven Crow~~der~~ning’s podcast is what Bobby Lee should do with Bill Burr on Ethan’s podcast.",
            "“You showed them a dead cat? Seriously man, what the fuck is wrong with you? You think people are tuning into your show after slaving away in some factory for eight hours to watch you look at a dead cat? No wonder you’re losing subs man!”",
            "Bring him back lol",
            "LISAN AL GAIB!!!!",
            "Oh. My. God.\n\nHonestly, the crew is too soft for Bill. He would definitely make AB cry.",
            "He's on the side of the kids",
            "When the world needed him most……",
            "I'm absolutely not watching 4 hours of one subject and especially animal abuse, frankly they shouldn't even cover stuff like that. Where's the \"show\"?",
            "i tried skipping the episode to see when the cat segment would be over (i don't like seeing anything about abuse of animals) and there was NOTHING ELSE! friday is my favorite show, it's supposed to be fun and light.",
            "Bill Burr is Ethan's Ego death personified haha",
            "It would obviously be a big ask but it’d be so fun if he was just there one day and sat in on like a normal episode. So we just get bills opinion on internet drama and random shit lol",
            "I can’t believe how hard they ran defense for the fucking cat abuser. WILD. Then to grill the dude that tried to help the poor thing and make up some insane assumptions about him after the call is crazy. Beyond disappointed",
            "so true completely unwatchable today",
            "Honestly I'd be fine with one less episode a week if it meant higher quality eps. I get the feeling that the podcasts go on for so long and they just run out of things to talk once they get deeper into the week.",
            "am I the only person who was interested in listening to the story today 😭😭😭",
            "i haven’t watched the show in awhile, but this would bring me back. haha",
            "Did I miss some part where he wasn't humble?\nJust say you didn't like it instead of turning it into some phycologists nightmare",
            "This episode was captivating, idk what you're talking about",
            "First podcast I skipped entirely, too triggering for me after losing 3 pets in the last few years 🥺",
            "Reset? Am I over reacting to a joke or is this community going through another bitchfest because the show didn't cater to their specific wants.",
            "“The lovely Hila everyone!!”",
            "[removed]",
            "we'll need Nia too! a double date Hahahahahah",
            "Is Bill Burr the one person who could make Ethan uncomfortable in a confrontation? Might be.",
            "I'm not sure a 45-min rant about how he \"haha\" hates women is going to do anything positive to any show, really.",
            "I got vip tickets to a Bill Burr show this summer.\n\nIm gunna ask him how many kids he has 😈",
            " Lmao Ethan needs a strike to cool himself down 😂",
            "Old Billy red balls. \n\nHila? Heela? Modal?",
            "It's just a podcast show... good days and bad days. Just like the sub reddit, we shouldn't take it seriously",
            "I hate this fandom to its core and I’m leaving this group because it’s full of WHINY little bitches who will constantly complain about everything. SHUT THE fuck UP YOU MAKE THE COMMUNITY ASS",
            "Don’t reset my show!!! I like it how it is",
            "Am I insane? Did we watch the same episode? It was pretty damn compelling and buddy who stole the cat was imo obviously in the wrong. Surprised to see so much negativity about it tbh",
            "Wtf is this chain, ik some yall kidding around but... come on 😬🙄",
            "I mean yeah the show was more dead than the cat but they had a guest coming in that cancelled so they probably had no plans for the show. They had to stretch out a cat segment for 4 hours",
            "Stop telling them how to run their freaking show. You're all free to stop watching if you don't enjoy it anymore.",
            "The show doesn’t need a reset… It’s better than it’s ever been!",
            "someone give this OP some clown emojis wtf is this",
            "LETS FUCKING GOOOOOOOO.\n\nBill would chew this shit up and spit it right out.\n\n\"Now Ethan, can you remind me why us as two middle aged men with children of our own to care for give a single fuck about this 17 year old girl on tiktok?\"",
            "I would love to see how it would go now that the show developed.",
            "Genius",
            "That is so bill burr it's crazy",
            "Now do his reaction when Ethan inevitably shows him the Hunger FF prolapse video haha",
            "couldn’t have said it better Bill! \n\nwe asked for less serious topics, especially concerning S.A. and other heavy topics. instead we got 3.5 hours of showing an abused animal and updates to the S.A. story that we didn’t wanna hear any more about. makes sense",
            "As a Pennsylvanian, I try my best",
            "I even read that in his voice ❤️",
            "LISAN BILL GAIB!!!!",
            "How I imagine it'd go: AB would make an offhand disruptive comment, prompting Bill Burr to zero in on him and tell him he looks like the third lead in a 90's boyband or something, then AB would chuckle and proceed to give the camera the Jim look while dying inside",
            "Idk if you know this but AB is from Michigan",
            "you think he would insult the crew?",
            "AB is a lot tougher than people give him credit for. After all, he is from michigan",
            "Dan reads a \"hey girly\" birthday request for a 27 year-old's birthday. Him and the crew start doing cutesy grabbing motions at the cameras.\n\n\nBill: What the fuck was that?! That was some of the gayest shit I've ever seen.\n\n\nProceeds into commentary about being an old dad and how homophobic Boston was growing up with a few shots at Dan for being a grown man doing that kind of thing for $10.",
            "I don’t think the crew is too soft but the fans definitely are lol",
            "You said soft and cry . Sorry for pointing this out,  but it’s 2024 and people still are being bullied for crying.",
            "Same. As soon as I saw the title I was out.",
            "The \"show\" was supposed to be Bobby Lee. When that fell through, they had to create a quick backup plan. AB did great on such short notice",
            "Bro why do you people always complain about everything like wow okay you aren’t gonna watch this one episode boo fucking who move on y’all are so toxic",
            "I fell the same way, I ended up watching one of howies episodes. No hate to the crew just not my thing to sit thru",
            "I tuned in during a work break hoping for a different segment. The ai chat summary said that Ethan was trying to show pictures of animal abuse lol fuck that. The first Friday episode that I skipped in YEARS",
            "I'm surprised it went on for so long I'm an hour in :/",
            "If something serious happens, then they should talk about it… just stop watching. I’m so tired of these people complaining that the show isn’t “their preference” of what it should be. Just fucking turn it off and stop watching. Live your actual life, take a bubble bath, watch a movie, read a book OR how about just shutting the fuck up and worrying about yourself instead of an Internet personality you’ve created an intense parasocial relationship with to the point that you all think it’s appropriate to police what they say, think, feel, or watch with the world when you could just press ONE SINGLE BUTTON and then guess what!? After that you don’t even hear or see Ethan or the crew anymore! It’s actually that easy!",
            "He would not care and start shitting on Ethan again.",
            "If you wanted to have a good show with Bill, you'd  do two things IMO. Have him destroy Zach in rock trivia then do a little jam session, background is Bill LOVES playing the drums and would geek out with Zach. Then have him do a segment called \"Uncle Billy Explains Sports\" and have him explain some famous sports clips to Ethan and the audience who aren't into sports at all. The dude has like savant level recall about all the major sports going back to the 70s. I don't know if Olivia is into sports or not but I think if she isn't it'd be funny to have her be the stand in for the audience and ask follow up questions. ",
            "Been that way since leftovers ended up",
            "Lol whatever today was entertaining",
            "Nah, the story was interesting and I don't mind the topic of discussion; it was annoying seeing the guy get so much hate for the one weird but only somewhat sensible thing anyone in the situation did, though. \n\nPersonally I would have called the fucking cops on her and tried to have her sent to jail.",
            "I also liked it. But this community can not go more than a week without crying and trying to bully the crew",
            "No. I had fun too. It’s just most the people on this sub are insane and plagued with awful takes. It’s the idiots here that always say mean shit about the crew and make Zach say he wants to “nuke the sub”.",
            "I thought it was all really interesting and compelling, very surprised by the negativity",
            "What wasn't cool was turning it into a witch hunt. They should have wrapped it up and moved on rather than calling and texting the people involved. Ethan was looking for blood and drama rather than the truth. You could see he was trying to get some gotcha moment that would make a good clip.\n\n\nIMO, the whole situation was fucked. Sociopathic teens kept a cat as basically a prop for their unregulated influencer reality TV show. The cat was only in the house for a few months and died within two weeks of being taken out.\n\n\nThe owner was wrong for having the cat there in the first place. The guy was wrong for stealing the cat. The people who own the house and ran the show are wrong for letting the cat into the situation. No investigation needed, everything was fucked. There are no heroes, only villains. Why give any of them an once more attention, sympathy,  or clout?",
            "No you weren’t. Unfortunately there’s a bunch of crybabies in this subreddit that need everything to be sunshine and rainbows on Friday.",
            "Neither. People are noticing a dip in quality. It doesn't have to be the end of the world. The show has seen better days. You seem so personally offended that the h3 show is being criticized.",
            "The community needs a reset tbh",
            "It is so annoying seeing people complaining about EVERYTHING each episode. Like jfc I can’t stand this community fulll of toxic people",
            "This post was removed because your account is less than 40 days old, this is to prevent spam and rule breaking. Make sure to read the subreddit rules [here](https://www.reddit.com/r/h3h3productions/about/rules/) and get acquainted with the rules before posting. Please do not contact the mods about this we get 3 messages a day about this. You can start posting after a week. Sorry for the inconvenience. Thanks, h3h3 mod team.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/h3h3productions) if you have any questions or concerns.*",
            "bye bye",
            "Commented this before i watched the episode",
            "If you think he was the one on the wrong, then yes you’re insane",
            "They really didn't have to. Sometimes a short pod should be ok.",
            "Maybe the creative director who sits in darkness playing solitaire should have had a backup plan",
            "But then they wouldn't get to tell everybody, thats no fun.",
            "I also don’t wanna watch a several hour long podcast slowly going over whatever’s viral on TikTok that I can be up to speed with in 15 seconds",
            "For the record, I didn’t mind today’s episode. I would’ve preferred they held off until they could do a bit more research and just did some goofy stuff today until then though. I’m just making a goof is all.",
            "TY",
            "God why do the people here think they can just “request lighter topics” and that some person they’ve never met should just change their public conversation to better fit the watchers very personal wants? People here are SO weird and reactionary.",
            "There's something entitled about this comment",
            "yes",
            "Yes",
            "Yes lol",
            "It's 2024, you can stop virtue signaling.",
            "As much as I hated the content of the episode, AB really did a great job with what he had",
            "This was great??",
            "This is a subreddit where we talk about the show. We are talking about the show.",
            "No hate to the crew? All the hate to the crew. Showing an abused animal on stream while your PAYING fans beg you to stop is sick and deranged. Wonder how Bozos the Kleins would feel if a content like that was made about Shredder.",
            "Same, the first episode I've skipped in years.",
            "is it really whatever? you're responding to a lot of people for someone that feels whatever about it",
            "What’s entertaining about animal abuse?",
            "It’s so anooying I can’t stand this fandom fr",
            "I actually think todays episode sucks AND we should nuke the sub. It’s almost like there are many people in this sub with many different thoughts and opinions.",
            "you “had fun” listening to 4 straight hours of a 3 year old story about a random tiktokers cat? K",
            "Lmao thanks for the theory reddit arm chair psychologist. You just assumed what this person meant and me. While knowing nothing about either.",
            "They want cookie cutter buzz feed content h3 style and im glad the show isnt doing that",
            "LMAO.",
            "Look, they both handled things poorly. She should have taken it to the vet earlier, 100%. But you can't steal a cat because you think it \"looks skinny\" and because it doesn't appear to have food at that single moment in time, with the intention to rehome it and never tell the owner, no matter how bad you assume (and he was assuming a lot it sounds like) the situation is. He didn't even confront her about the cat first! That seems like an obvious first step before immediately jumping to not only kidnapping the cat, which likely caused it a ton of stress, but literally conspiring to make it look like the cat ran away. That's a psycho move imo. So sure, she's not by any means \"right\" either, but this dude is no hero. He chose the weirdest possible way to deal with this whole situation. \n\nPeace&Love to you, btw. I mean no hostility, just genuinely shocked to see the reactions to the episode lol, seeing someone call for a \"reset\" for the whole show (even in the form of a funny meme) was surprising to me",
            "Surely no one would complain if they just did a short episode instead.",
            "probably because its allegedly a comedy podcast?",
            "Because there are a ton of people who are tired of it. Also not how reactionaryy is used btw.",
            "Where do you think you are? This is a subreddit dedicated to a media property. Coming in here and complaining about people giving their opinions on a show is like hanging out a cafeteria and complaining that everyone is eating all the time.",
            "i used to watch the pod and laugh. now i’m just getting frustrated and angry and anxious.  especially when the topic was JUST addressed by the crew this month",
            "> person creates content for consumer\n\n> consumer doesnt like product\n\n> consumer complains\n\n> „entitled“",
            "EXACTLY people are only downvoting you because they hate that Ethan doesn’t make the exact show that they have curated in their minds and that they wouldn’t even be able to perform themselves lol",
            "Getting downvotes for saying something any well adjusted human would realize. Reddit is a rat-hole.",
            "as long he's nice to Olivia",
            "Yes and I’m talking about how the show is fine and people are just whiny and sensitive and want Ethan and the cast to say exactly what y’all wanna hear and see and if they don’t do that then it’s all out hysteria 😺",
            "hey, snarker! don’t let the door hit ya",
            "So dude above me can have the opinion, which is gratuitously over exaggerative in my opinion, that todays episode was “completely unwatchable”, yet I’m not allowed to have the opinion that todays episode was “entertaining”? Also I didn’t say the episode was “whatever”, I was saying whatever to the semantics of his comment. I don’t feel the episode was “whatever”, I feel it was “entertaining”, it says it right there in the comment. Also, I guess the term “a lot” can be kind of subjective, but I have never really known it to mean “two”, because that’s the amount of people I have replied to about this, but hey who’s counting. More needless exaggeration to make language undefinable for the win I guess.",
            "The part where they defended the abuser and went after the guy saving the cat was a real twist ending I didn't see coming",
            "That’s like one of the dumbest straw man argument attempts I’ve ever seen. Grow up.",
            "Worst thing about h3 is the fans.\n\nIt's either people who peaked in high school that are bitter that he's more compassionate nowadays, concern trolling and picking apart and making assumptions about everything, or parasocials.\nShame, cause there's dome good people. Just have to wade through a lot of dumb shit",
            "Then leave this sub",
            "I haven’t seen todays episode but a large amount of content comes from this sub, I don’t think we could get 3 hour eps without it tbh",
            "Lol some of you are so absurd with your entitlement and superiority complexes. I “had fun” listening to the crew banter as usual while discussing it.",
            "Aaaaand you pounced on a non issue and were not even talking about the show any more. Bye...",
            "I agree that both are at fault to some degree. At this point my issue truly lies with Ethan and Hila for absolutely grilling the guy and asserting things that there is effectively 0 proof of. The entire jilted lover narrative felt gross, and post-interview the show mostly devolved into an attack on him. I think there’s a more measured way to go about things than what we saw today.\n\nAll that said, “reset” is probably a bit dramatic…but it fit the meme and hella homies complain on here so the bait worked",
            "What would you do if there was a dog trapped in a hot car? Either call the cops or break the window. The moral imperative of saving the animal supersedes the “how” in this case.",
            "We obviosuly ran out of peace and love. Only drama and hate left over.",
            "100% it's their product they can make it however they want. Especially when we are talking about creative endeavors. People need to stop thinking so highly of themselves. Make your own show if you have a better vision.",
            "She’ll get it the worst\n\nWhat’s up with this hey girlie bullcrap",
            "I didn’t like the episode personally. Just my opinion.",
            "did i say you can't have an opinion or did i say you care?",
            "It was a question. That was the only thing they talked about today, just asking why it was entertaining. Chill",
            "It’s entitled to actually want to be entertained by the show im watching😭 time for bed goofy",
            "Yes, talking about if I was offended or not had a lot to do with the show.",
            "Lol I respect the honesty about baiting with the meme, well meme'd, I did genuinely get a laugh out of it.\n\nFor sure, Ethan and Hila could have been a bit more level-headed with their approach to the interview, although I think the dude deserved some level of grilling and I'd argue they were successful in getting him to reveal some more insight into his mentality at the time.  The jilted lover thing was an odd angle though and really unnecessary. \n\nI wish the cat owner would have called in too, and if she did, I'd hope they'd grill her just as hard. But we'll never know, so eh 🤷‍♂️",
            "Very different situation imo. Hot dog in a car is clearly in immediate danger. This guy didn't have enough evidence the cat was being malnourished from what I heard. But I respect the difference of opinion",
            "THEN STOP WATCHING you guys are such haters and still WATCH EVERY EPISODE why keep going with your miserable lives? Lmao",
            "The way the crew approached it and the unfolding and details of the story itself. That's like wondering why people are entertained by true crime shows. Horrific subject, intriguing story behind it. It's not that complex",
            "Not at all. It’s entitled to come at me with a poorly veiled passive aggressive comment punctuated wonderfully with your little “K”, for simply telling the other person they aren’t alone in enjoying the episode today just because you disagree with me and didn’t enjoy it. It’s a shame you didn’t find it entertaining, just like literally everything else on earth I assure you that you aren’t the only one.",
            "Yes. You guys are literally shaming those that did enjoy the topics instead of just saying, not my thing.\n\n\"oh you enjoyed watching a ep about animal abuse. K\" what's that if not shaming. That the feeling of entitled that a person should be as triggered as you become you and others didn't, because you can't handle it.",
            "A cat under 4 pounds is in immediate danger",
            "They were pretending to be bill burr…",
            "Thanks for answering in a somewhat nice way. Not that hard to comprehend why a lot of people don’t want to watch a 3 hour long video about a cat being abused. Would rather not watch a cat actually seize on camera wtf",
            "Lol k",
            "Lmao okay now it’s really fucking funny…. 😅 sorry I’m enraged at the hate rn",
            "Yes, they could have gone without showing the seizing cat, Ethan should have watched it privately first before showing on cam and trusted ABs choice to not include it, I respect that opinion",
            "lol no worries go have a nice snack for yourself or something, no point getting upset over it",
            "Thanks I needed that fr 😂"
        ]
    },
    "Just close your eyes bro ": {
        "title": "Just close your eyes bro ",
        "score": 2966,
        "url": "https://i.redd.it/9lm7h25kdz7d1.jpeg",
        "content": "",
        "num_comments": 337,
        "comments": [
            "Ethan: I want to see the cat. We need to get mad \n\nAlso Ethan: I would have rather not seen a seizure",
            "Skipped this one and I never skip",
            "Poor AB can’t win. 😆😆😆\n\nSubreddit: “we are sick of Olivia power points”\n\nH3 response: “let’s have AB do the next power point…..on animal abuse”\n\nThis podcast 🤣🤣🤣",
            "I have 4 cats and I cannot handle seeing animal abuse/neglect. my heart can't handle it. I'll be waiting til they switch to a different topic and then watch",
            "i think we need at least a month of just goofs and gafs. maybe a year 😅",
            "I hate to be that guy but, I just lost my 17-year-old cat this week. I think I'll skip this one.",
            "I am begging for one light hearted episode. Please. As a treat.",
            "This one is definitely a skip",
            "Watched for aslong as I could but i have to turn off the pod. Just bumming me out, don't need to listen about some random tiktoker who neglected a little soul.",
            "i mean literally though, who tf are these people we're hearing about? yes this is not a nice story but, exactly WHY tf are we going over this in powerpoint detail?",
            "This is the first time I’ve just decided to skip a whole episode",
            "So jarring for me. Cats are too precious",
            "sadly i’m definitely skipping this episode.. I have 10 cats. I help the neighborhood strays get clean.",
            "First episode skip for me in years. I kept jumping ahead to get past the cat segment then realized that’s it. no hate, i know they didn’t expect bobby to cancel and had to figure something out last minute",
            "Who thought a 3 hour show about an abused animal would be good Friday entertainment? Beyond out of touch with the audience, but criticism will be written off as haters. Severely questioning creative judgement here. No one vetoed this??",
            "Bro how the fuck is the entire 3 hours about this shit? Are you kidding me? I couldn't even handle it for 2 minutes yet they are managing to go on about this for 3 hours? Insane.",
            "They’re still taking about it omg lol",
            "And after 3+ hours of this shit they blamed the dude who tried to save the cat.\n\nJust wtf",
            "How the fuck did they spend 3 hours on dead cats whyyyy",
            "Animal cruelty is my last straw.",
            "Yeah full skip from me. I lost my cat last year, she was 15 and I had her from a kitten and she was my world. Watched her fade away over a quick period of like 36 hours before I got her to the vet to say a final goodbye. Right now I take care of some strays in my neighbourhood and I can barely even handle how one of them has a wound on his tail (I'll be bringing him into the vet if it doesn't start to heal soon). I can't handle animals in pain. \n\nWhy even bring attention to this fucking psycho? I never heard of this until just now and I doubt I ever would have. Can we stop giving these freaks attention?",
            "I didn't realize the entire episode was gonna be this, had to skip unfortunately",
            "I can't believe this segment is still going lol. Looks I'll this might be the first full episode I skip in a very long time, bummer\n\nIs this one of the single longest segments they've done? It's like two full hours of this",
            "I work in Veterinary ER medicine and this stuff is rough to watch tbh.",
            "Glad I missed it, then.\n\nI always empathized with Ethan about Shredder because that's the kind of love and adoration I have for my cat, Chi. Imagine watching 3 hours of dog neglect and murder. This is such a bad look. No thanks.",
            "I am skipping a lot lately. It's just too much sometimes.",
            "I just do not understand why they felt like it was right to defend her at all??\n\nYes, Jacob did not do himself any favors by taking the cat/ inserting himself in the situation and absolutely should’ve just brought it up to her if he was genuinely concerned about it. I certainly wouldn’t “side” with him. But why this evolved into them defending Rhegen at all?? I don’t think she deserves any slack.",
            "Aw man i’m gonna have to sit this one out. Next week a 3hr segment on a child who suffocated in a plastic bag? 😀👍",
            "i can’t believe ethan was so adamant about showing this shit, howwwwwwww as someone who just recently lost a pet could he think it was “fine” to show something like that?",
            "Oooooof thanks for the warning, my heart cant take it 😭",
            "The first time I turned off the pod unfinished live :c lowered the volume at some point, zoned out, and couldn't believe they were still talking about it hours later.",
            "Yeah I kept checking back and seeing if they would change topic but they never did it was really frustrating. I can't handle any animal abuse especially with cats since I have one so it sucks that this was being talked about the whole episode",
            "I think it’s important to talk about these kinds of situations to hold her responsible for animal abuse but it’s been dragging on for way longer than it needed to and I had to leave. It did not need to be talked about for 3 hours",
            "I'm sorry, but something changed for the worst since the rebrand for the show. Was watching an episode from a year ago and was laughing my ass off. This content is just frankly stupid and drama brained. Boooorrringgggg",
            "Who thought it was a good idea to cover this story let alone make it the title. Don’t platform animal abusers.",
            "I couldn't watch this episode being a cat mum 😢",
            "Cmon man not in the same week I had to put my cat down",
            "Not even clicking on something with a title like that",
            "The WHOLE EPISODE?!!! Enough lol",
            "FUCK YOU BOBBY LEE",
            "I honestly want to know their thought process on doing this …",
            "I had to turn it off when Ethan started lobbying for showing a dead cat so I didn’t see any of the segment. wtf was that?",
            "Also the best segment we had this week had to be interrupted by a sexist boomer call in, I miss the goofs and gaffs",
            "This segment is sooooo damn long ooof",
            "Ohhh boy this was not an easy listen first thing in the morning",
            "If you see a pet being so abused/neglected, would you still need to have a \"talk\" with the abuser?",
            "I mean if this doesn't validate the fact that we aren't completely satisfied with the topics then idk what they want us to say. Ethan and Hila can't complain and say oh we're doing our best you should like what we're making, while we're not satisfied. There's no business model that works like that. They need to listen and do better. \n\nLike for one I don't care, I don't know who these loser influencers are, I don't want to watch/hear a 2+ hours about it. And no I would prefer not to see a dead cat. Of all the things to talk about why this.\n\nThis should've been a segment not the whole episode. Bruh",
            "Grilling that kid who was just trying to help a cat was hard to watch.",
            "Its been three and a half hours and they are still talking about it",
            "Why do they seem like they have no empathy? This was awful",
            "everyone on the crew in this episode was suffering from brain rot i felt like i was being punk'd at the end. the theories, the horrible takes, the beating down on the guy who actually CAME ON the show??? Hila saying he is at fault because he stole the animal....so seriously if you saw an animal dying you would leave it? i lost so much respect for both Ethan and Hila this episode.",
            "it's the monkey paw",
            "I think that over 3 hours about this story is too much. It's 2 people blaming each other, so we'll never know the whole truth.",
            "I hate that I forgot to watch live till I opened reddit and saw this post. Oh boy",
            "SOOOOO LAME",
            "Well I was excited to watch after work but now maybe not...",
            "God the SA stories were so difficult to get through and I had to scroll past some so I don’t get triggered… but I stopped watching around the whole Ruby Franke & bulk of Cauldron Ballinger stuff and I had to take a break. \n\nBeen catching up though but oof… I feel like I know what this is about because I saw another post on some like other sub where someone mentioned being obsessed with watching someone McNuttin?? And some >!cat blender video!<. <—— TW for animal abuse in the spoiler",
            "I blame that SOB Bobby Lee",
            "I tried to scrub through it to skip and it’s the WHOLE EPISODE?!",
            "I mean what the fuck",
            "read the comments on todays ep and decided to simply not watch. seems like a huge flop ep that i do not wish to bear witness too 😭😭😭",
            "5 minutes into the pod and i knew the vibes were going to be off, i should've trusted my intuition and skipped this whole ep.",
            "This could’ve been okay if they didn’t shit all over the guy who saved the cat, and essentially side with the animal abuser.",
            "We can all blame Bobby Lee for this debacle",
            "Yeah, I love yall, but with peace and love, this ain’t it. Maybe I’m just sensitive with animals, but I felt kinda upset when they showed the first video of the kitty :(. Could have done without seeing that. But that’s just me. 🤷‍♀️🫶",
            "Yeah I’m not watching today.. I didn’t realize this was gonna be the whole show 😭 it’s too sad man. Can’t do it.",
            "The fact that it was all they talked about for 4 hours 💀",
            "Zoomer influncers shouldn't have pets and this episode was awful.  Yes, it turns out that a bunch of immature little shits sucked at taking care of an innocent creature. \n\nWhy the everliving fuck was it necessary to have a nearly 4 hour episode trying to nail down which little d list zoomer influencer was most naughty?\n\nNearly 4 hours spent analyzing which privileged little fuck may have abused or neglected the cat the most.",
            "All Ethan does is talking about cats",
            "And Ethan wanting to show the body",
            "appreciate the commitment from everyone but unwatchable 😭",
            "Thank you for the heads up, I’m so soft about animal stuff I’ll need to skip that 😭 Did they at least get justice?",
            "I was getting surgery when the stream started and was excited to have a full 3-4 hour episode to watch when I woke up... Woke up to an entire episode about a cat getting killed... Didn't watch any of it",
            "Hated this epi",
            "very hard time to be an h3 fan😔",
            "Yep, started watching this episode and then had to stop before they showed any pics or videos of that cat. Not my idea of an enjoyable Friday night.",
            "How can you talk about this for 3 hours... These ppl have stomachs of steel but I can't watch/listen to it. I can't even deal with immediately clicking off animal abuse stuff I run into online, I would not mentally survive 3hrs of it. These guys can't be cat/animal lovers if they can go on for that long about it. And I don't think its a problem that we can do anything about, so it's not like spreading awareness can help here. Some people are just filth, and you can't change that.",
            "Animal abuse awareness is pretty important. The segment might prevent another cats neglect. I worked in SPCA and youd be surprised how common cat abuse is. And it gets much more gruesome and vicious than what we saw today :(",
            "Frrrr!!! 🙄omg I didn’t even finish the pod today Boring af!! 😭😭😭 why I’m sooo tired of these PowerPoints… 🤦🏾‍♂️",
            "Initially I was like nooooo wtf why is this the main story? But then they did a good job in keeping me interested",
            "[deleted]",
            "[removed]",
            "I busted out laughing when Ethan started tearing up, not become I love animal suffering of course I don’t, but because it’s the most Ethan move to make AB see the cat and get emotionally hurt by it 😭😭😂",
            "PLEASE a light hearted one🥲",
            "I watched a the tea spill video on the topic and that was enough for me. I can’t imagine watching h3 cover it super drawn out. Might be a skip for me.",
            "Guess I’m skipping this episode entirely",
            "Yep, I skipped this one after a few slides",
            "I had to skip that part, WHILE closing my eyes hoping not to see or hear anything. I just couldn’t do it. When I was a kid I literally watched my kitten die in front of me from a dog attack, so I’m traumatized to say the least. I truly do love the show and pretty much watch and enjoy everything, but it really hurt to see how much Ethan wanted to see the pictures. I’m glad I skipped cause it was even worse than pictures. Jesus.",
            "I tried avoiding the cat story ever since I seen it",
            "An immediate skip for me",
            "Ok guys, Bobby cancelled.  What do we have in the bullpen?\n\nAnimal neglect by Tik Tok influencers?  GOLDEN!",
            "There was literally a segment about imallex on wednesday",
            "Im gonna have to skip this one, I work in a rescue cat shelter. Dont need to see animal abuse in my free time.",
            "all they do is talk about cats…. It’s getting ridiculous at this point",
            "Really, a 4 hour episode on animal abuse on a FRIDAY?? They replaced goods with Bobby and showed a dying cat instead. What a way to set of the weekend. Happy midsummer",
            "First episode I skipped in literally 5 years holy shit",
            "Tana has accusations of treating her animals like shit too, maybe they should look into that",
            "Wow, that really sucked. Every single second of it.",
            "How in the fuck is this thread still up? Lol, WAKE UP SUPERAWESOMEMEGANERD, WAKE UP. CAT ABUSE CAT ABUSE,",
            "Mentions Do Not Fuck With Cats and then almost immediately after spends the next 4 hours fucking specifically with cats.",
            "I couldn't watch based on the title alone 🥲",
            "i heard abt the pod topics and did a HARD pass. i have five cats, never want to imagine them in that kinda situation 🥲",
            "There's a reason tv and film very rarely show animals (mostly pets) getting hurt or killed. People really really hate seeing it.",
            "had to skip this whole ep. i used to watch every episode, but lately i find the topics they're covering to be so triggering and upsetting. i'm skipping more and more episodes lately.. like i'm sorry but who wants to watch a 4 hour episode on animal abuse???",
            "Its not that deep, if you are triggered \"look away\" it's not like they didn't give you guys warning. People who are saying he \"shouldn't have showed it\", what's the point in covering the story if you don't acc see the condition of the cat? People who are saying \"he shouldn't have covered it\" grow up, would you rather ignore animal abuse?",
            "Is it just me or did the tone of the show change once the girl’s dono came in?",
            "Idk why y’all are upset Ethan literally always talks about cats it’s nothing new",
            "NO LITERALLY THE FUCK ARE WE DOING HERE WHY AM I LISTENING TO AN INVESTIGATION ABOUT CAT MURDER ON A FRIDAY NIGHT IM TRYNA LAUGH",
            "This I can handle. The conservative grifter water topic on the SYNT though, man that was dry. Pun intended.",
            "Meh, they gave many MANY warnings. I don’t think this is the most graphic thing they’ve showed on the pod, or even talked about. \nLove brought it up and my focus is he was disheartened as a cat owner and wanted to show something fucked that people should be aware about.",
            "why do yall watch the show atp?",
            "loved this ep! everyone was so engaged",
            "I understand H3 has been marketed as comedy a lot, but it's grown to be much more than that. I do think it's important to call these people out, just because it's difficult to talk/hear about doesn't mean they shouldn't bring it up. These are the kinds of people that deserve to get cancelled",
            "STOP WATCHING AND SHUT THE FUCK UP IF YOU DONT WANT TO WATCH.",
            "I swear the mental age of some of this aduience is like 8 years old, you cant cope with hearing about a dead cat? How coddled do you have to be to demand this many trigger warnings. If the podcast is too scary for you then why not go back to watching nick jr",
            "Is it terrible? Yes. Can you stop watching… also yes.",
            "Prepared for downvotes and oh well.  Get over it? Skip the episode fine but complaining on subreddit and trying to get them to cater to what you want the show to be is more annoying than any topic they could discuss. \n\nYea it's a downer conversation and it sucks that Bobby cancelled but it's a relevant conversation to have.  The show has always discussed shitty influencers doing shitty things. It bumps against something you care about and now it's a problem?\n\nI completely understand not being able to stomach the episode, it makes sense but just because you can't, they shouldn't talk about it? I'm not going to diagnose anyone over the Internet and have my own mental struggles but it feels like there's a reason and maybe you should look within to try and understand why you feel this way.\n\nMy wife has PTSD from SA she experienced as a minor, when it gets to be too much for her we skip that part or turn it off and I'll watch it later on my own.  She knows what her limits are and doesn't make it someone else's problem that she feels the way she does.",
            "Maybe curiosity killed the cat!",
            "Mfs will look up the prolapse but refuse to witness a dead cat. \n\nJesus guys, we’re grown-ups. I love cats too but you see them as roadkill all the time, it’s part of life.",
            "This is the level of true crime they should be covering.",
            "Best segment in awhile",
            "Believe it or not, you don’t have to post when you skip an episode. They put out 4 great shows a week, and if you feel like skipping, you can just not watch! Hope this helps",
            "I actually didn't mind the segment, which is odd because I completely get where the complaints are coming from after reading these comments. Maybe it's because I tuned in late -- around the time when the segment started -- but I was invested! The back and forth between Ethan, Hila, and the crew, the amateur journalism angle, the grilling... it was chef's kiss. I thought this episode might've been a banger based on that. Again, I tuned in super late. lol",
            "Lol",
            "lol all the snowflakes gathered here. This ain’t an airport, just leave, no need to announce departures. “I skipped this episode” great, fantastic! Make sure to unsubscribe while you’re at it.",
            "he would not have shown the photo if it was a dog",
            "It made me cry, like wtf. I went to pet my cat afterwards...",
            "I was fairly frustrated by that part, lol. Definitely turned my phone screen off for that.",
            "We didn't need to see the cat, lol. I looked away but, I thought it was ridiculous he was so adamant about seeing it.",
            "Same :( not my idea if a fun thing to watch on a Friday night",
            "same. the entire 4 hours was just this sad story. i understand it's important, but i also have depression and i don't need to make myself sadder.",
            "Same. I usually only skip segments, but I had to skip the whole episode this time. The topic was obviously depressing, but it wasn’t even interesting either. Why should I care about some random tiktok influencer killing her cat?",
            "You are not alone",
            "I didn’t get very far before reading comments… decided I’d skip it, too 😕 ",
            "After reading everyone's comments on this episode, sounds like I will have to skip as well. ☹️ Dead pets aren't the vibe for a fun Friday show",
            "RIGHT, i couldn’t do it, i watched the bathroom break and that was it😭",
            "Saaaame",
            "Samee, can’t watch",
            "it's not so much about the PP, but that's the ONLY topic they talked about today. i don't remember this ever happening before in any episode.",
            "I think I’m just shocked that they could stomach a 4 hour conversation about it 😩😩😩 i can usually power through what I’m disinterested in but I just kept looking at my cat for 15 minutes and had to close out.",
            "Gonna have to skip the whole ep then. This one is all about the same topic and continued to develop the whole ep.",
            "I can’t watch it either. Anything animal harming…. I can’t handle it. Even more than human suffering, I think it’s just that they are so pure. Going to have to skip this one.😞",
            "I ended up not being able to stomach this episode either. Poor kitty! ❤️",
            "how about just goofs and gaffs 90% of the time?\n\nhowever, with the US election is year so probably not.",
            "maybe some pornductions",
            "This",
            "be that guy, you don't need this shit while you're mourning",
            "Fuck baby sorry to hear about the loss of your cat fuck baby fuck yeah",
            "I wish I skipped it",
            "Same, mine was just shy of 20. It's been tough. Take care xx",
            "yep. if you really want that juice, just wait until tomorrow or later today for love to put the timestamps on.",
            "I’m sorry for your loss ❤️",
            "I’m sorry 😢 my kitty is 16 and I cry just thinking about that day coming. Def skip this episode it’s not only depressing but I was disappointed by Ethan’s take",
            "I’m so sorry about your loss. Cats are so special. Especially older ones. I wish you lots of comfort and healing ❤️",
            "my condolences and a virtual hug",
            "So sorry for your loss family. Sending you hugs. Do not watch!",
            "It was a good call. Condolences, friend.",
            "It literally affects nothing at all so you’re all good",
            "We need a full week committed to goofs and gaffs. Seriously.",
            "The problem is when they do the lighthearted, fun, or even funny episodes, the views are much worse. That's been an ongoing problem for years. It's the reason we never got a second ghost hunt.",
            "Yeah what the fuck is going on at this point? \n\nThe show is a chore these days, just a vacuum of actual humor or joy or anything truly creative. It’s a bummer. I’m out",
            "I am begging and pleasuring Ethan and MODS",
            "I skimmed first 2 hours and realized entire episode will be about this. Im skipping. Exactly; theyre nobodies even by influencer standards. Why is ethan so obsessed with making 3-3.5 hr episodes? I think id be okay with 60-90 minutes if they clearly dont have interesting topics to talk about.",
            "I'm constantly being forced to listen to stories about people I could not care less about strictly for the fact that ethan will say something hilarious that has nothing to do with the story and I don't want to miss it lol.",
            "To raise awareness and hold this girl accountable",
            "Because Bobby Lee cancelled?",
            "thanks for the heads up. i’ll remove from my watch list",
            "Same, and I was looking forward to it too",
            "I definitely thought you were helping the cats with drug addiction at first",
            "You're an angel",
            "They had nothing to talk about. It's pretty obvious. It's the reason they go on tangents for 30 mins about mundane details. They're trying to pad out 3.5 hours for watch time. A shorter pod would make a higher quality, tighter show but they want more watch time.\n\nTin foil hat theory: Ethan has made enough money to comfortably live off investments and is long form pranking us with terrible pods and seeing how long he'll get views.",
            "I turned the pod off to return to it later so I could skip the animal abuse and it looks like I'm skipping an episode 🙃",
            "Ethan’s interrogation skills are a bit annoying too. Hopefully he gives the girl this much shit.",
            "Yeah this is wild. I usually can’t stand the complaints on this sub and I typically never skip a single segment, but the cat stuff really hits close to home so like thirty seconds in I thought to myself this might be the first time I skip a segment. So I go to look at the time stamps and lo and behold it’s the entire episode. This is my 9/11.",
            "If you can get your hands on some Cetrigen spray, that can help the stray kitty with wound healing ♥️",
            "Remember when they used to do 4 hours straight on FnF and Aba n Preach? This is long but those were torture",
            "*four",
            "There's been episodes in the past where one topic is basically all of it. Not going to doublecheck, but I think the ACE family tour was most of the 4hr ep, Colleen eps were very tied to Colleen, several of them being 2hr+ on her. Sure, some of the longer eps have had 30-60m of random shit beforehand but it's still 2hr+ on same topic. Recently the ~3 Vaush episodes were like this too.",
            "same, the amount they were just simply getting WRONG was so frustrating. i had to turn it off 🫠",
            "yep and the whole time they're taking about it like ~drama and tea and theories~ when a cat actually died.",
            "Same, I wish them the best but I don't think I can watch as regularly as I used to.",
            "Same guess I‘m just growing out of the drama and tea podcast phase",
            "He clearly doesn't put cats on the same level as dogs, that's been evident in the past. Which like, fine if you're not a \"cat person\" but I get the vibe that he's one of those people that thinks cats do not bond with their owners the way dogs do and that they're just a less meaningful pet, which is catergorically (no pun intended) untrue. I wish I could recall the episode or even what the conversation was about specifically - maybe someone else can put it in the comments if they know the ep I'm talking about - but I remember an episode on the past where he started talking negatively about cats and it was so ignorant and like, disdainful almost that I had to turn it off cause I was getting really annoyed. I was very surprised when just a short time later they seriously considering getting a cat. It seems like most of the crew are also not \"cat people\" but I'm really surprised none of them saw just how bad of an idea spending hours talking about animal abuse, esp when fans have been voicing they want lighter episodes like hello?? You know they would not have spent that long/shown the fucking dead/sick animal if it was a dog. Ethan would have been like \"omg I can't see that dogs are so precious and pure\" and gone on a whole diatribe calling for prison time for the girl, and also never would have basically blamed the guy for trying to save it.",
            "At the end they blamed the guy who tried to save the cat lol",
            "And then blame the dude that tried to save it",
            "i’m sorry :( i’ll think up lots of peace and love for you",
            "i’m sorry bud 😪💔",
            "virtual hug! 💗",
            "WHAT? I haven’t watched yet but PLEASE tell me someone shut him down and kept it down. I don’t need to see a dead cat to get mad about it.",
            "I mean if we’re accusing someone of killing their cat it is kinda important to see what happened to the cat. It was really really sad. But he expressly said, if you don’t want to see this don’t watch this part. Also the cat wasn’t dead, it was sick.",
            "The boogie drama should've been so funny but it got constantly interrupted and they kept going on nothing tangents to the point that I can't remember one thing Boogie even said about Ethan.",
            "A week ago, people would've been banned from the sub for a comment like this. They should really think about all the criticism they ignored for it to get this bad.",
            "They could have talked for at least an hour about the charli xcx album, her and lordes Collab, Kendrick, James Charles new music, literally anything else.",
            "I mean it's a bit of a bummer, but this comment comes off as way too entitled imo. They can make content about whatever they want at the end of the day",
            "Dude same them talking about it at the end was insane",
            "You’re not missing out it‘s just he said she said tik tok teenage drama with extra sprinkles of animal suffering",
            "Save yourself the trouble and keep it turned off",
            "I did this as well 🥲\n\nI might be skipping this ep for the very first time",
            "Haha true",
            "They definitely would not have shown it if it was a dog and you KNOW they would not have talked to the guy who tried to save it like that if it was a dog. Ethan would have been like \"if I saw that I would have jumped out of a plane to save it and gunned down any mother fucker in my way\" and then would have kept making different hyperbolic statements on what he would do to a dog abuser and how dogs are so amazing and precious and we don't deserve them. Which is true, but cats are equally as important to people and I can't stand when people who aren't \"cat people\" think that the bond between cats and their humans are less deep or meaningful or that cats \"don't love like dogs do\".",
            "How about an hour later? 😭",
            "I tuned in late, but I was invested as soon as I jumped in. I was anticipating some kind of admission of guilt out of the guy.",
            "it really isn't :(",
            "This post was removed because your account is less than 40 days old, this is to prevent spam and rule breaking. Make sure to read the subreddit rules [here](https://www.reddit.com/r/h3h3productions/about/rules/) and get acquainted with the rules before posting. Please do not contact the mods about this we get 3 messages a day about this. You can start posting after a week. Sorry for the inconvenience. Thanks, h3h3 mod team.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/h3h3productions) if you have any questions or concerns.*",
            "I think a lot of these downvoted comments are missing the point. It’s upsetting to an extent based on the viewer, but, 3.5 hours (essentially the entire podcast) talking about one story about irrelevant content creators is a snooze fest. I learned enough within 30 minutes. The fact it went on for the entire episode is why people are annoyed and expressing their opinions.",
            "Yeah it wasnt horrible",
            "Who knows, so tired of these ridiculous posts. Do they not realize they are doing the same shit they are complaining about?  Always posting about how much they hate the episodes even though people are tired of seeing it. \n\n/sarcasm Why can't the sub stick to the goofs and gaffs?",
            "How dare you like the episode! I'm outraged! *Clutches pearls*",
            "Daddy chill",
            "Okay buddy I guarantee if it was a dog people wouldn’t feel the same especially Ethan who just lost a dog and is still coping but go off with that weird take",
            "Yikes, thinking these two are comparable at all says a lot about you.",
            "Eh? I don’t think that’s necessarily fair to say. Sure it’s part of life but people are very attached to animals and may have trauma associated with death. I see how animal death affects people daily due to my career along with my own personal experience. \n\nLike you and I may be fine with it as it’s a daily thing that I see unfortunately but it is a really shocking thing for many people who love their animals. Like seeing a dead baby or something.",
            "God I'm so sick of seeing this...",
            "Then they don't get to feel righteous though. I listen to a lot of podcasts and have skipped episodes of all of them at some point, never once posted about it though",
            "THANK YOU. Kinda nasty behaviour. \n\nHe has such a double standard for that, a lot of people do.. why can't you just love both animals and stop picking between them",
            "He was willing to watch the video of the dog being thrown to get all of the information. Ethan, as well as other people, had a morbid mind. And all people’s sensitivities are different. Although he is biased towards dogs I don’t think he’s that biased",
            "You're not the only one :( I'm on vacation and I can't hold my cat the way I normally would. Turned it off halfway through because it was ruining my day ",
            "It made me laugh. Typical Ethan move lol",
            "Imagine pulling up a dead Yorkie, he would have kicked off",
            "Little bit of wine, maybe some popcorn, and for entertainment 4 HOURS of a dead cat saga",
            "I don't know what possessed them to do a 4 hour abuse story on a Friday evening when everyone's trying to unwind from their stressful weeks. Truly baffling.",
            "i care about all cats, but this is incredibly sad to talk about for 4 hours",
            "But what about the square footage of the room??!",
            "Same this episode is almost unwatchable for animal lovers. I can't watch Ethan back someone who abused an animal so badly. My heart is broken just writing this for that poor animal. Him asking to show it like I have seen in comments is messed up. I agree with other comments if it was his dog he would never !!!! I hope Ethan will see how this affected the fans",
            "ARE YOU SERIOUS that it’s ALL they talk about???",
            "I agree. I am trying to make light of a much deeper issue.",
            "On a Friday show no less?!",
            "Haven't watched but damn 4 hrs?? Probably the last lengthy topic they talked about was the Ace Family house situation maybe?",
            "they probably covered it all ep because bobby canceled late and it’s all they had planned",
            "Are you serious it’s an entire 4 hours about cat abuse 😭",
            "I just skipped it, cats or dogs I'm not watching them talk about animals abuse like that",
            "I'm aware",
            "the US election can be milked for countless goofs, they are not mutually exclusive",
            "yeah we’ll probably be fighting a civil war for all i know. fuck me right?",
            "Thank you so much. I needed that. Family!",
            "the time stamps won’t even help it’s been the whole episode 😭",
            "Love ya'll, thank you.",
            "Well judging by the views and the comments on the video, this episode certainly wasn’t it.",
            "if only they planned a segment in a recent episode which was cut short by a guest appearing ;(\n\n(\"what was the incident at your school\" segment)",
            "They’re timing out anyone saying “can we move on” or anything like that. I fell asleep having heard basically everything I need to hear about it, woke up 90 mins later, and they were still talking about it.",
            "must be a slow week",
            "4.5M on tiktok on the woman? I think that's enough to be considered not-nobody.\n\nThere's history of people liking \"deep dives\" on likes of Colleen, ACE family. And when they start getting \"live updates\" and people involved want to call in, can't act surprised it becomes this.",
            "Right 😅 I’ll get fomo that I’m missing a soundbite being born. But the depressing vibe was more powerful than the fomo this time",
            "That sounds pretty miserable lol",
            "To the tinfoil hat part:\nHe obviously is focusing more on his family now, which makes sense and is okay considering he has his kids and just added another newborn. But then just trying to sail on and force his way in the podcast the way he has just goes to show how much resentment ethan holds for his viewers.",
            "Exactly what I did.  I kept coming back but it was just more of the same.",
            "oh he won't, as soon as he found out she was in chat his whole demeanor changed.",
            "Thank you! I've tried to wipe it down with a paper towel and warm water just to get it a little cleaner but he hisses as me (don't blame him lol) but I will maybe give that a try this weekend.",
            "I legit just got off a 15 hour horror shift and got all comfty for my H3 and my brain went into fight or flight mode 🤣. They talk about it FOREVER too so crazy lol",
            "This is how I felt during the episode where they covered the Drake/Kendrick beef",
            "Yeah, I cancelled my membership over this.",
            "Same but it's not even the drama and tea, it's the horrible sa, pedaphila, domestic abuse, and now animal abuse stories. I understand these things matter but at this point, I don't understand who 3 hours of it is for.",
            "I know what converation you're talking about and remember him saying that \"dogs are a human's best friend\" and that cats are not capable of forming the same bonds since they mostly just lie around. As far as I am aware, Dan, AB/Lena, Love and Ian/Sam all have cats, which makes all of this even more depressing.\n\nAlso, I am so glad that Olivia (who doesn't even have a cat) and Dan weren't so hot-headed as to participate from the same point of view as Ethan, AB and Hila and towards the end of the show, when Ethan and Hila were making really intense assumptions, just advocated for the well-being of the animal. IT BLOWS MY MIND that this wasn't the conclusion they all arrived on right away and that the debate devolved into pure speculation for the better part of 4 hours.\n\nImagine my disappointment when I realized that the reason why there are no timestamps on the episode isn't because Love forgot (silly), but because the segment spans the entirety of the show (sad) :(",
            "Wtf? That’s such an incredibly wrong decision😭",
            "A description is more than enough and I don’t want to get jump scared by a sick or dead cat today. I watch for the comedy part of the comedy podcast, not 3.5 hours of animal abuse talk.",
            "Yeah, can we really not handle a sick cat? Like AB was saying he wouldn't show some cat diarrhea and the the sick cat and it kinda feels like babying. Yeah it's morbid but do these folks not see dead birds every now and then outside? Hell, sometimes there are sickly cats by the dumpster and I still make it through the day.",
            "Refusing to listen to valid feedback from customers is never not detrimental to business.",
            "\"Extra sprinkles of animal suffering\" might be the worst way you could have phrased it lol, but thanks for the heads up :)",
            "Nah, I watch it all. Even the bad episodes. \n\nEspecially the bad episodes.",
            "Yeah! Now they are chewing people out! Entertaining.",
            "right, getting downvoted like crazy 😭 we talk about way worse stuff more regularly, but god forbid someone hurts an animal (which is hypocritical since most of those people arent vegans either)",
            "As sick as we are of seeing all the complaining that you hate the episodes when they discuss topics you don't like?",
            "Dogs are lovely. A lot of dog owners tho...Ugh. Unfortunately Ethan and Hila as well 😬",
            "Fr.. crazy how people ignore this",
            "I thought they would cover it for five minutes....",
            "This is why I feel like they are sometimes very out of touch. Like a normal person working Monday-Friday doesn’t not wanna spend their Friday night watching a 4 hour segment on animal abuse. at least not my kind of fun unwinding night",
            "unfortunately yes",
            "It’s because Bobby was supposed to be the guest for this ep and he called in “sick” day of so they had nothing prepared.",
            "girl i skipped through every minute and sometimes i stopped and listened about they were just taking about this, and the still frames were just showing the PP or the girl or the cat or the guy",
            "Family. Family. Family. Family. Family.",
            "I’m so sorry for your baby’s passing. I hope you’re comforted by the love and memories you shared with your kitty ❤️ family",
            "just tuned in to the end. 😇 afternoon = ruined",
            "love you too fam. as a cat dad i’m deeply sorry for loss and you’re not alone. take it easy bro. ✌🏻& 💖",
            "i, too, love u/h3h3pornductions",
            "There's no salvaging that. They shared the stories they had, time to double time investment on them was then if at all.",
            "Bro, i just tuned into the live feed real quick, and they just PAST THE 3 HOUR MARK AND STILL DISCUSSING THIS. Imma go ahead and say it: worst episode of h3 ive ever seen along with the Hasan episodes where they kept talking about israel/palestine and were adding no new information. Wild that 30k still watching live.",
            "They definitely are. Sad.",
            "[deleted]",
            "They say at the beginning intro that Bobby Lee cancelled just last night. So i get it",
            "I remember hearing some insane stat that like a hundred thousand ppl have over a million followers now, so its gotten to the point of it being normal where a multi million follower person is still considered very niche. Far and away are we in the day where a million meant something like when Smosh or Nigahiga achieved this.",
            "Bro could just retire and be happy. The pod doesn't need to exist. I've felt that same disconnect, his family life is so important to him that the pod just isn't his child anymore. And that's great, but don't write us off as haters because we call out a shitty segment that's too long.",
            "It's kinda gross. I'm very far from red pilled but Ethan has a clear, strong bias for girls in most situations.",
            "Honestly Cetrigen has been a genuine lifesaver when dealing with wounded animals who aren't used to humans. Best wishes to you and kitty!",
            "oh man, i feel for u!!! we get enough of this from misinformed clients 🤣🫠",
            "Exactly this. I can get into petty, dumb drama but the serious stuff just burns me out. There's been a lot of stressful stuff going on around me recently and I'd rather avoid things that are bringing me more stress like some of these topics.",
            "It’s not a jump scare when they quite literally warn the audience before they show it…. Did you also complain about it being a comedy podcast when Ethan held David Dobrik and Dom accountable??",
            "weird flex but ok\n\nand yes I’ve seen dead things before, but I don’t tune in to my favorite goofy podcast to get a dose of 4 hour long reality",
            "Wait why lol",
            "I will say, holy fuck, I didn't realize what kind of episode this was when I made this joke. Fuck me.",
            "It's just silly, I love my pets too but to down vote someone for simply saying they enjoyed something you didn't is pathetic.",
            "Lol right",
            "When I went to skip the segment, I was in actual shock they covered a dead cat for 4 hours, how can they be this out of touch?",
            "The podcast is not always about unwinding. I’m so annoyed about the people who decide that their idea of what they “want to watch” is what everyone should be putting their effort into making. Sometimes you need to hear about shitty things that happened. Sometimes people need to be held accountable, like damn why are so many people watching just to talk shit. Just stop watching it’s literally so easy. It’s just one button. I can show you if you would like?",
            "How is it possible they have this depressing topic the whole 4-hr episode when viewers were clearly getting upset lol. Didn't they try to check the vibe of viewers?? It's already 900+ comments in the megathread 😂",
            "talk to me babayyyy 😏",
            "We finally just got interesting with the call from the dude. The rest I can do without and pretty much agree with you. Those episodes with Hasan I also agree are some of the worst.",
            "They always just say “lay off the crew guys” which I understand if people are making insults or otherwise rude comments. But just commenting how the actual content of the show is slipping, nothing to do with the individual members? Lunacy to time those people out imo",
            "ah. i joined 1.5 hours into that so missed it. just saw someones post about bobby being the new pewdiepie (meming about him not ever showing) so i didnt know what to think about that. thanks for letting me know!",
            "According to socialblade, rhegan777 is 6109th most followed tiktok account with 4.5M.\n\nDefinitely not saying everyone knows you if you have 5M, I didn't. I probably would see names I never heard even at 20M+ followed channels. Still, it's big enough that if they get in drama, it'll be big in internet. Nobody called imalexx nobody in previous ep. Ofc it's harder to gather followers on youtube than tiktok but still, it's mere 2M followed channel.",
            "I dont think it was that, but he seems like he wasnf being balanced",
            "We feel this pain together 🙃",
            "I swear some people just complain for the sake of it like damn",
            "Because I love the show lol, why wouldn't I watch every episode of a show I love? \n\nThe bad episodes part was a joke, we all know we got a good episode (for once) coming up.",
            "right i understand that there is plenty of sensitive people in this audience and then to top it off we're on reddit but is that really necessary 😅 whatevs, hope you have a nice day",
            "Isnt h3 supposed to be a comedy podcast? Wheres the comedy? Or is h3 just drama and hate? Where is the peace and love huh?",
            "I respect that the podcast covers important issues, but my point was about timing and knowing your audience. Fridays are chill-out nights for many, so a 4-hour deep dive into animal abuse can be a lot to handle. It sounds like others were feeling the same way during the segment. It's understandable for listeners to express discomfort when a podcast airs content that feels heavy or intense. I'm a frequent watcher of H3, and it was disappointing to see them not hold the abuser accountable. But everyone can have their own opinion",
            "idk girl...i understand they're allowed to talk about whatever but it's just not my desire to be sad on a friday night you know. i fell in love with the show because of the goofs and gaffs",
            "I cant even name 6109 ppl on earth lmao.",
            "You do you, I guess",
            "You too!",
            "They almost always have heavy topics.",
            "Hey thanks for giving me permission to watch the show!",
            "Defensive much lol I just said to each their own",
            "Very cool stuff, I hope you have something you enjoy!",
            "Are you good lmao"
        ]
    }
}