{
    "Reminder: Please do not submit tech support or build questions to /r/hardware": {
        "title": "Reminder: Please do not submit tech support or build questions to /r/hardware",
        "score": 243,
        "url": "https://www.reddit.com/r/hardware/comments/3n9tky/reminder_please_do_not_submit_tech_support_or/",
        "content": "For the newer members in our community, please take a moment to review our rules in the sidebar. If you are looking for tech support, want help building a computer, or have questions about what you should buy please don't post here. Instead try /r/buildapc or /r/techsupport, subreddits dedicated to building and supporting computers, or consider if another of our related subreddits might be a better fit:\n\n* /r/AMD (/r/AMDHelp for support)\n* /r/battlestations\n* /r/buildapc\n* /r/buildapcsales\n* /r/computing\n* /r/datacenter\n* /r/hardwareswap\n* /r/intel\n* /r/mechanicalkeyboards\n* /r/monitors\n* /r/nvidia\n* /r/programming\n* /r/suggestalaptop\n* /r/tech\n* /r/techsupport\n\nEDIT: And for a full list of rules, click here: https://www.reddit.com/r/hardware/about/rules\n\nThanks from the /r/Hardware Mod Team!",
        "num_comments": 19,
        "comments": [
            "Lots of those subreddits aren't appropriate places for questions and help either.\n\n* /r/programming \n* /r/datacenter\n* /r/battlestations is for pictures of PC setups.\n* /r/buildapcsales is for links to good deals on PC components and peripherals.\n* /r/tech is for news articles and \"informative [...] self-posts\" about technological advancements\n* /r/hardwareswap is an informal marketplace for used hardware\n",
            "/r/AMD does not accept techsupport questions. Use /r/AMDHelp for that.",
            "Hmm, some of those subreddits refer to r/hardware though for tech support lol",
            "Are all new posts blocked pending moderator approval? Sorting the subreddit by \"new\" puts a 15-hour-old thread above a 12-hour old thread.",
            "Where should we go for random product recommendations? Just small random things like mice, keyboard, sound cards, general hardware.. etc. \n\n/r/buildapc ??\n",
            "/r/pcsupport is also an option for tech support. ",
            "This post isn't just referring to questions and help.\n\n>or consider if another of our related subreddits might be a better fit:\n\nThis covers the subreddits you're talking about.",
            "Mods here are informing noobs to not post tech support questions....\n\n...advices to post in other subreddits that also don't want tech support questions.\n\nNice job mods.",
            "Added to the list, thanks!",
            "Which ones? We'll contact them.",
            "Nope, new posts should appear immediately.",
            "/r/mousereview, /r/keyboards and /r/mechanicalkeyboards all have fairly active communities. For general computer suggestions /r/buildapc works too.",
            ">...advices to post in other subreddits that also don't want tech support questions.\n\nRead the post more clearly. It's not just referring to tech support questions that do not fit here... it's also about *any* post that might fit somewhere else better.\n\n>or consider if another of our related subreddits might be a better fit:\n\nWe're not advising people to post tech support questions in subreddits that don't want them. We're advising people to post tech support questions in subreddits that *do* want them, *and* to also consider if your post (irrelevant to tech support) fits here at all (such as a battlestations pic).",
            "It's not a very big sub compared to /r/AMD or /r/techsupport ",
            "r/techsupport for instance ",
            "Yep, I just added it to the list in this thread not the sidebar.",
            "Where? I don't see anything in their sidebar.",
            "Oh oops it was r/24hoursupport  "
        ]
    },
    "AI titans Microsoft and Nvidia reportedly had a standoff over Microsoft's use of B200 AI GPUs in its own server rooms": {
        "title": "AI titans Microsoft and Nvidia reportedly had a standoff over Microsoft's use of B200 AI GPUs in its own server rooms",
        "score": 202,
        "url": "https://www.tomshardware.com/tech-industry/artificial-intelligence/ai-titans-microsoft-and-nvidia-reportedly-had-a-standoff-over-use-of-microsofts-b200-ai-gpus-in-its-own-server-rooms",
        "content": "",
        "num_comments": 55,
        "comments": [
            ">Previously, the customer was responsible for buying and building appropriate server racks to house the hardware. Now, Nvidia is pushing customers to buy individual racks and even entire SuperPods — all coming direct from Nvidia. Nvidia claims this will boost GPU performance, and there's merit to such talk considering all the interlinks between the various GPUs, servers, racks, and even SuperPods. But there's also a lot of dollar bills changing hands when you're building data centers at scale.  \n>  \n>Nvidia's smaller customers might be ok with the company's offerings, but Microsoft wasn't. VP of Nvidia Andrew Bell reportedly asked Microsoft to buy a server rack design specifically for its new B200 GPUs that boasted a form factor a few inches different from Microsoft's existing server racks that are actively used in its data centers.  \n>  \n>Microsoft pushed back on Nvidia's recommendation, revealing that the new server racks would prevent Microsoft from easily switching between Nvidia's AI GPUs and competing offerings such as AMD's MI300X GPUs. Nvidia eventually backed down and allowed Microsoft to design its own custom server racks for its B200 AI GPUs, but it's probably not the last such disagreement we'll see between the two megacorps.",
            "Nvidia being Nvidia as per the norm.",
            "Big techs beefing with each other over AI is honestly very entertaining",
            "Microsoft standing up against vendor lock-in?\n\nExcuse me while I care about literally anything else.",
            "Nvidia is so cartoonishly evil (for lack of a letter word) that this is funny. I love it.",
            "Lol Jensen thinks data center guys are like the gamers. Who would eat this shit up.\n\nGamers love Nvidia vendor lock ins. Data center guys aren't this stupid however. Particularly Microsoft, they invented the vendor lock in.",
            "Will this AI diarrhea bubble pop already.",
            "Like how? MS as an enterprise vendor bought 10 pallets full of those GPUs which are primarily used for ML purpose, then exchanged it for cash loaded onto the same pallets, then started using them for their intended purposes and nvidia started screaming “you can’t do that”",
            "Let them bleed each other dry in legal fees for all I care. \nWould be ironic if Microsoft were to complain about anti-competitive behavior from Nvidia.",
            "If you read the article, it says MSFT was not happy about the **form factor** of the racks. \nIt is 100% not intentional from nividia, that would want to be compatible to most current datacenter to sell more, more easily.\n\nThe entire B200 rack is vendor lockin already, they do not need the form factor to be as well.",
            "Is there actually a decent product people are paying big bucks for using the hardware yet?",
            "Well they could try just buying the completing product like MI300x.",
            "So nvidia recommended to buy their racks for best performance and microsoft said no and it’s a story why? \n\nHow is this different from lenevo and hpe doing the same and skipping infiband interconnects between their cluster",
            "> Microsoft pushed back on Nvidia's recommendation, revealing that the new server racks would prevent Microsoft from easily switching between Nvidia's AI GPUs and competing offerings such as AMD's MI300X GPUs.\n\nAnd that's probably why Nvidia is pushing this. It's just another sneaky way of locking someone into an \"ecosystem\".\n\nAnti-competitive practices at its subtlest.\n\nCorrect me if I'm wrong, but I don't believe even Intel ever tried to do that to AMD ( or vice-versa ), that's saying something.",
            "That potentially runs into antitrust there. I'm sure it didn't take much convincing to get them to back down.",
            "I saw a similar story about how Nvidia managed to bully AWS in the same situation. I think they won out though.\n\nNvidia is milking the major cloud providers and I'm sure it will come back to bite them sooner or later.",
            "at least skynet will be delayed again",
            "This sounds like nonsense \n\nFirst, as shown at Computex, the Nvidia stuff is available from multiple different server vendors\n\nSecondly your not just going to throw an AMD GPU into a Nvidia system - your replacing the entire rack anyway. At which point the size isn’t relevant as at the cost of these systems (and at the scale Azure operates) the cost of the actual rack is irrelevant",
            "I mean, this is a good thing for the consumer isn't it? If this ends up escalating it will really weaken Microsoft's future arguments to the contrary.",
            "> Gamers love Nvidia vendor lock ins\n\nI wouldn't say love. There's just no real option to dislike it",
            "When it does, it won't be funny anymore. The top 5 companies in the S&P have a market cap of 13 Trillion, it's a catastrophe waiting to happen. People still have patience for the promise of \"growth\" from AI, but at some point, they will get anxious if there is no real revenue to back it up.",
            "It won't, the hype might fall a bit, but the tech is sound and extremely useful in a lot of applications. ML is here to stay, but in a couple of years we will likely think of it as just another thing computers do.",
            "> you can’t do that”\n\nIt is rather simple:  \n\n* enterprise grade gpus are not plug and play, there is usage licensing to deal with and these licenses carry usage restrictions. If you (customer) dont like it, you will either havbe to pressure nvidia to give you special terms (unlikely, unless giant like microsoft) or you can go pound sand to amd.\n* there wont be 11th pallet if you piss off nvidia corporate either",
            "Well, it's the same as me spending $1000 on my iPhone only to have Apple tell me \"you can't use third party nfc payments or install third party stores or any software we don't like\"",
            "I don't think it's even that subtle, it's pretty blatantly anti-competitive.",
            "Nvidia has a long history of burning their customers through pure greed dating back to the original xbox and it's a major reason why all the major tech companies are investing so heavily into their own AI hardware.",
            "Didn't Intel try to change the compatibility with home desktop cases by switching to the BTX form factor? I may be misremembering details of that whole saga, idk.",
            "I’m sure Intel might have pushed the same scheme if they sold the entire hardware stack direct like Nvidia.",
            "Yep",
            "Intel changes sockets to lock in customers.",
            "Are NVIDIA's, or Microsoft's, racks nonstandard?",
            "That's exactly the type of shit that Microsoft got in trouble for with the feds and then the states themselves.  If I was the feds I would be sniffing around that like a hound dog.",
            "Are you saying the report is entirely fabricated? Because it says Microsoft thinks it is very much relevant",
            "Weird to see \"B200\" and \"consumer\" in the same sentence, but I do take your point that this is... an alignment in interests. The enemy of my enemy is my friend and all that.",
            "Same goes for data center and now Ai.",
            "I understand that but let me rephrase: i’m going to sell you 100 ford transit, which is a van to haul wares in its normal configuration, it is designed to be used as a van hauling stuff, you then start a courier company, how would you react if i say “you can’t do that”, these licensing stuff with them are getting ridiculous.",
            "Nah, BTX was indeed superior to ATX but lost out to inertia. BTX would have better overall thermals, less wasted space, and better board topology to reduce latency. Intel does a lot of standards work in the software/hardware world, which is separate from the anti competitive bullshit they pull.",
            "Intel is one of the most open-standard companies, especially when it comes to data center hardware. Even when it had 95% market share, it standardized many of its technologies.  \n  \nSo I'm not sure where you got that impression, but most certainly not from working in the space...",
            "They did sell the entire hardware stack and did not try this. \n\nThat being said it’s kind of the right thing to do if you can get away with it. Goal is to maximize profits, and Nvidia has a nosebleed valuation to justify",
            "If anything, changing sockets would be a good excuse to switch vendors, as you have to get a new motherboard and such anyway.",
            "Who cares? If you buy a new PC for gaming, you get an '700K or '900K CPU to go with it, but since you've either got the second best or best CPU for that MB then you can't get anything better than that for it anyway. The days are long gone when your choices for Intel CPU's were starting from AUD $140 for a Celeron 700 to a top of the range AUD $1400 P4 with a half dozen Celerons and then another half dozen slower P4's in between. ($100 AUD = $67 USD).\n\nLatest MB's will take say 7000 MHz RAM and M.2 PCIe-v5 slots, or two previous gen MB's would have 6000 Mhz and M.2 PCIe-v4, earlier than that would be 5000 MHz and M.2 PCIe-v3. People want the latest and fastest gear all round anyway.\n\nTo summarize: You're pretty much always upgrading combo's consisting of MB+CPU pairs anyway. Much easier to sell that pair to someone else as compatible as you can guarantee that they work together because they currently are.",
            "\"The Feds\" wouldn't want to fuck with NVIDIA's AI dominance by intervening or legislating because it goes well beyond the USA and is a major advantage to have over *others*.",
            "And honestly ATX is growing more and more outdated by the year. It was never designed for 400W+ expansion cards or the huge radiators needed to cool modern top-end CPUs, forcing case manufacturers to invent exotic solutions and customers to spend time re-checking minor but critical things like RAM clearance, radiator compatibility, GPU length etc.\n\nBut any new effort at resolving all those issues will inevitably run against 40-year inertia, so people have stopped trying. Way too many parties have to play ball for it to work.",
            "You mean the company that paid PC manufacturers not to sell AMD-based systems? You must be joking. Intel is more than happy to engage in anti-competitive behavior as long as they think they can get away with it.",
            "If I can keep my old motherboard and simply upgrade the CPU 4 or 5 years later, I'm sure as hell doing that.",
            "Servers care",
            "I bet you 11th gen owners wish they could have upgraded to 13th gen like Zen + owners could update to a 5800X 3D.",
            "“The Feds“ are already looking into NVIDIA",
            "Yeah, \"The Feds\" wouldn't want to knock Nvidia down a peg or two lest foreigners like \\*checks notes\\* Intel, Google, Facebook, AMD, Amazon, or Microsoft gain an edge over the USA.",
            "yes, intel did that and corporations tend to be dicks, but this has nothing to do with standardized physical specs...\n\n... especially in data centers, which intel is great at doing: supporting standardized size specs.\n\nnvidia pulls some crap here and makes it difficult for consumer gpus to fit in workstation or server chassis as anything taller than pcie spec tends not to fit.\n\nnotice how the professional gpus are all 2 slots wide, just a few mm taller than the pcie bracket, and have the power on the tail, not the top?\n\nand how consumer gpus don't come in this size until some non-usa manufacturer like manli does it and charges a whole lot of $$?\n\nthen asus, gigabyte, and maybe msi release ”turbo” editions that have 2u blowers and power on the tail like the professional cards... and they do so for a lot of $$ for a 4090 (like $2500-3000), a very short run, tend not to be available to usa customers, not advertised, and nvidia gets pissy about?\n\nthis irritates me. it's truly petty.",
            "Intel has come a long way since 2004",
            "Look buddy, I'm aware there's more than one American player the game, but you're missing my point. It doesn't benefit the USA to stop Nvidia from dominating even though the next 5 companies area also American. The greater the lead over *that other country* the better off the USA is.",
            "In 2024 not giving motherboard vendors clear guidance on how much power their CPU's should consume leading to CPU instability, then blaming the motherboard vendors for the problem...",
            "Changing the topic much? I was specifically talking about their anti competitive practices"
        ]
    },
    "HUB - When Are Next-Gen GPUs Launching? Buy Now or Wait? - June GPU Pricing Update": {
        "title": "HUB - When Are Next-Gen GPUs Launching? Buy Now or Wait? - June GPU Pricing Update",
        "score": 13,
        "url": "https://youtu.be/ZnjO1spYcxg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "High end gpu monopoly yay :))",
            "My personal instinct is to wait for RDNA 4 at least.",
            "new gpus can launch tomorrow and the 60 series still be a year or more away, people that have money to spend in a 90 series now have money to spend in another 90 series whenever it shows up\n\ntheres no real debate here, get one now if you need it, if you dont need it or dont care, then dont get one. Simple as that",
            "Perhaps. Though I wager not many would have those cards other than those with more money than sense. The high middle is more than you will ever need.",
            "Obviously you should wait for competing products if they are released in a similar timeframe. I would even wait for Battlemage. Would be nice if they all release in Q1/25.",
            "Rumor has it we might see RDNA 4 around october.\n\nI'm not going for Battlemage, Arc is promising but it still needs at least another gen to cook if it's to be good for me."
        ]
    },
    "[2kliksphilip] Snapdragon X Elite - Still Waiting for Benchmarks": {
        "title": "[2kliksphilip] Snapdragon X Elite - Still Waiting for Benchmarks",
        "score": 10,
        "url": "https://www.youtube.com/watch?v=XuwFxIsuMpA",
        "content": "",
        "num_comments": 1,
        "comments": [
            "The Hardware is ready, Software isn't. The GPU (drivers) has issues and the applications that use some GPU acceleration are not using it just yet.\n\nPricing wise that is up to OEMs, the QC chip itself is being sold to OEMs at 50% price of a comparable Intel Chip"
        ]
    },
    "AMD Ryzen AI 9 365 Zen5 APU tested ahead of launch: IPC uplift measured": {
        "title": "AMD Ryzen AI 9 365 Zen5 APU tested ahead of launch: IPC uplift measured",
        "score": 84,
        "url": "https://videocardz.com/newz/amd-ryzen-ai-9-365-zen5-apu-tested-ahead-of-launch-ipc-uplift-measured",
        "content": "",
        "num_comments": 84,
        "comments": [
            "Link to the source by David Huang: [Detailed look (Chinese)](https://blog.hjc.im/zen5-preliminary-review.html) He discusses the uArch that AMD barely went over during Computex compared to Intel, and cache/memory latency etc.",
            "10% in SPECint. 15% in Geekbench 6.",
            "What a horrible name for a CPU",
            "No idea how this performs in terms of power efficiency but it appears that Intel might have a fairly decisve lead in multithreaded and roughly equal in single threaded applications (this is just speculation though). \n\nThe gains intel achieved on their little cores this general are fantastic. Each little skymont core will be equal to or faster than the Zen5c cores while probably taking up less area. And Intels big cores are on par or better than AMDs. So looking pretty solid for intel right now.",
            "8 ipc throughout L2 is really impressive, is there a caveat?",
            "The overall picture for Zen 5 is not great. It appears to be doubling down on HT at just the wrong time, at the cost of ST performance. Somehow AMD has managed to jack up its public image and deploy Bulldozer 2.0 in the same month. My god. My tendies!",
            "Remember, this is not the 370 HX (higher tier APU)",
            "In the blog there are some bombshells: \"Compared with the full version of Zen 5 for desktop/server, its maximum frequency is reduced from 5.7 GHz to 5.1 GHz, SIMD throughput is halved, and the corresponding L1 vector load bandwidth is also halved\"",
            "Maybe hotchip for amd?",
            ">10% in SPEC.\n\nPutting 10% SPECint on the IPC claim chart would've been too lame so the marketing team replaced it with Far Cry 6.\n\nThe most negative part of Huang's review is that he couldn't get the 54W TDP laptop to hold single-thread turbo in SPEC tests at stock clocks and had to downclock to 4.8GHz.",
            "I wonder if the desktop zen 5 will have a bigger uplift",
            "Horrible is an understatement \n\nThis is just an epic failure \n\nWhat is this F$#@ing name ?",
            "Why would each skymont core match zen 5c I’m confused?",
            "Not the mention, Intel Arrow lake has only big core + E cores, no SMT. Thats basically only 2 types of CPU architecture or 2 types of thread. \n\nThis AI 365 is Zen 5 + Zen 5c + Zen 5 SMT + Zen 5c SMT. Thats 4 different threads, it is OS scheduling nightmare.",
            "It’s not that bad at all.",
            "But doesn't the 370 HX use the same cores but more of them with higher clocks, more TDP and more GPU CUs?",
            "+2% MHz doesn't change anything",
            "its a clock for clock comparison, so doesn't matter what chip it is, other than 370 HX might have better binning.",
            "Was it the same way with Zen4 mobile vs desktop Zen4? I just assumed they are always the same core, with the exception of no chiplets (monolithic) and different cache sizes etc.",
            "Discussing about the uArch? Most likely",
            "It seems u/Exist50 was right. Zen 5 does seem to have some power problems.",
            "That 54w tdp is just specified by the oem .He never measured power consumption it’s also an pre production sample",
            "It should on floating point tests because the SIMD bandwidth won't be halved like it is on mobile.",
            "IPC probably not so much.",
            "AMD historically sandbags CPU performance and frontloads GPU performance",
            "only 5-10% less ipc, runs higher frequency Zen 5 c cores are only running at 3.3ghz. Gracemont has already shipped with 4.5ghz all core. Id ask why you wouldnt think itd win?",
            "Because of Zen 5c having Raptor cove level IPC. Just like Skymont",
            "not really. Zen 5 and Zen 5c run the same instructions. intel cores do not.",
            "It isn't so much a scheduling nightmare as much as each CPU exhibiting preferences for certain behavior:\n\nFor power efficiency reasons you'd probably prefer to just have the fewest amount of cores awake at a time. Preferably small cores even (IIRC this is what Intel prefers for Lunar Lake and what apple prefers for it's parts). Plugged in, though, you'd prefer just one thread per core until no more cores are available, probably preferring fat cores first.\n\nBut this depends on the CPU. Which means MS needs to work with CPU manufacturers to have the best scheduling strategy implemented.\n\nThis is why I'm looking forward to seeing how Linux performs on these newer parts to be honest. Scheduling is just more transparent there.",
            "SMT on LNL is cut to simplify the scheduler, saving power. It may still exists on Arrow Lake.",
            "It has 2 more Zen5c cores. So no it's not the same.\n\nRyzen AI 9 365 is 4 Zen5 cores and 6 Zen5c cores.\nRyzen AI 9 HX 370 is 4 Zen5 cores and 8 Zen5c cores.",
            "Zen4 APU just had lower fabric clocks and half the cache.",
            "Could be. AMD didn't mention anything about \"power efficiency\" at Computex (unlike Intel and Qualcomm), just \"most powerful\". For now, I would just attribute this to poor cooling. We will see more in the next weeks.",
            "Yep lol",
            "In the Chinese article it’s stated that the chip can’t maintain specified boost clock due to thermal issue. It’s possible that the pre production laptop has subpar cooling.",
            "Are there informations on how much SIMD the floating point tests use? The integer tests could also use SIMD or not?\nI'm curios now to see, how the IPC differs.",
            "Why?",
            "This is an independent measurement. And I don’t think the author is “sandbagging”.",
            "Zen 5c only in hx 365 runs at 3.3ghz. Zen 5c in hx 370 will have higher clocks speeds. Also ipc uplift in specint doesn’t translate to the same ipc in other workloads. Also lunar lake competitor is kraken point  4+4.",
            "I’m not sure Lunar Lake E cores will underperform Zen 5c at all, at least not in the Strix Point iteration. Check out Dave’s latency numbers. 170ns to communicate between cores in different clusters. Zen 5 launch is beginning to feel like a disaster",
            "Wym zen5c ipc is closer to Lion cove",
            "In consumer chips, Intel P and E cores do run the same instructions right? Instructions like AVX512 are disabled on the P cores for this reason.",
            "Instruction set is exactly the same in p and e cores.",
            "LNC doesn't support SMT at all. So no SMT for ARL either.",
            "But that doesn't matter for Zen5 and Zen5c IPC. In the tests both Zen5 and Zen5c IPC is measured. These IPCs per core wont change.",
            "To be fair, mobile Zen 4 chips are also limited to max 5.1GHz boost clocks for power reasons.",
            "Wonder why he didn’t do floating point spec test aswell.",
            "The regular cores use the same architecture.",
            "Huang has mentioned Zen5c can go \\~4Ghz. A phoronix test with the 8500g locked the Zen4c cores at 3.7Ghz from 3.2. It would be interesting to see the tests again if he can get Zen5c clocked close to \\~4Ghz limit he mentioned.",
            "bro thats literally what im saying why am i being downvoted for agreeing 💀.",
            "Zen 4 IPC was behind Raptor Cove by up to 10% even though it is more efficient. Something that looks like it won’t change much (except AVX512) looking at claimed IPC of Lion Cove vs Zen 5.\n\nZen5C will have mostly same IPC (the smaller cache will introduce some regressions) as Zen5.\n\nZen 5 P core unlike rumored for Arrowlake, will maintain same clocks. So advantage moves to AMD there.\n\nZen 5C slightly overcomes this IPC and looking at it again, it actually may have a 3-5% advantage over skymont geomean",
            "He said SPEC takes too long and the CPU was already throttling on SPECInt single thread. The laptop was on loan.",
            "What about this? https://imgur.com/a/dnLBUff",
            "He didn't say it can go 4GHz, he says less than 4GHz. In this case, the 5c tops out at 3.3GHz",
            "Though we were talking about integer(since that’s what intel used to measure ipc vs raptor cove) in specint because zen 4 and raptor cove have the same ipc there.",
            "Lock cpu to lower clockspeed, as long as it’s iso ¯\\_(ツ)_/¯",
            "Interesting, I missed that information. Where is that from? That would change IPC in vector workloads. So depending on the workload, if it can levarage that advantage, there might be some IPC differences. But tbh I haven't heard of the Youth Edition 'till now.",
            "I suppose you mean something like [this](https://x.com/InstLatX64/status/1800132652651159643). Same uArch but different packaging for mobile. On the surface, with mobile SKUs there always was a halving of the L3 cache, and of course it is monolithic. IPC may differ a little, but it's more single threaded uplift because of higher clocks for desktop.",
            "I think “Zen5 Youth” here is Zen 5c (cut down version of Zen5 core). Its IPC was also measured in the table. Worse than Zen4.",
            "Intel literally showed both specint and specfp side by side\n\nhttps://www.anandtech.com/show/21425/intel-lunar-lake-architecture-deep-dive-lion-cove-xe2-and-npu4/3#:~:text=Compared%20to%20Raptor%20Cove%2C%20Skymont,LLC%20or%20a%20Ring%20Bus.\n\n2% geomean for both vs Raptor Cove",
            "No, he meant he had a time limit with the laptop.",
            "https://blog.hjc.im/zen5-preliminary-review.html. This is where videocardz article info comes from",
            "https://imgur.com/a/dnLBUff",
            "No he was talking about zen 5 vanilla only zen 5 vanilla goes up to 5.1ghz https://imgur.com/a/dnLBUff",
            "You made a false statement saying zen 5c has raptor cove ipc level but your wrong it’s higher than raptor cove in integer which is way more important than floating foint",
            "Oh alright will wait for his full review in a couple weeks",
            "This is what [he is referring to](https://x.com/GPUsAreMagic/status/1797770939176034597). CCX0 is Zen5 with access to 16MB L3. While CCX1, Zen5c has access to its 8MB of cache. Tho, I think my point still stands:\n\n>On the surface, with mobile SKUs there always was a halving of the L3 cache, and of course it is monolithic. IPC may differ a little, but it's more single threaded uplift because of higher clocks for desktop.",
            "Ok, a cut down version for mobile then. But this is comparing Zen5 mobile to Zen4 mobile. Not sure if Zen4 mobile also had similar cut compared to Desktop version.",
            "Edit: Ok, by how much and based on what am I wrong",
            "That doesn’t match what he said. Also zen 5 vanilla only mobile has 16 mb of cache for 4 cpu cores it has the same amount of cache per core as zen 5 desktop,",
            "He said compared to zen 5 desktop/server zen 5 mobile is cut down",
            "Sure : https://imgur.com/a/u6Mv4ke. Similar integer ipc"
        ]
    }
}