{
    "Welcome to r/HeadphoneAdvice!": {
        "title": "Welcome to r/HeadphoneAdvice!",
        "score": 410,
        "url": "https://www.reddit.com/r/HeadphoneAdvice/comments/emnmt3/welcome_to_rheadphoneadvice/",
        "content": ">*Be Friendly. :)*\n\n*Minimum account age to post in this subreddit is* ***10*** *days.*\n\n# Purchase Advice Suggested Details:\n\n**What** **aspect of your current listening experience would you like to improve?**\n\n**Budget** \\- How much would you like to spend? Can you stretch your budget if significant quality/features improve at a slightly higher price point? AutoModerator will remind you automatically if it does not see a budget in your title or post; you can go back and edit the post if you forget. Please include currency.\n\n**Source/Amp** \\- What are you plugging the headphones into?\n\n**How the gear will be used** \\- E.g. Do you need noise isolation? Will this be primarily for home listening? Do you do a lot of flying (on airplanes)? Are you hard on gear?\n\n**Preferred tonal balance** \\- Are you a bass-head, focused on accurate acoustic timbre, looking for sparkly treble, or do you want a tonally balanced pair of headphones?\n\n**Preferred music genre(s)** \\- What do you listen to? Provide examples if it's something obscure.\n\n**Past** **gear experience** \\- What have you used in the past? What did you like about it and what didn't you like about it?\n\n# \"thank you\" system:\n\nWe have employed a \"thank you\" system for submissions. It's very easy to use - if a comment on your post is considered helpful, please reward them by using the term:\n\n    !thanks\n\nThis will add a thank you count (in the form of Ω) to that users flair. You can only award one per comment section. Thanks very much and good luck on your search for headphones!\n\n# Polls (Now Enabled!):\n\nTo help the community create its own user-driven resources, polls are now enabled on [r/headphoneadvice](https://www.reddit.com/r/headphoneadvice/)! Give it a try! You can read more about Reddit's poll system [here](https://www.reddit.com/r/announcements/comments/fo7p5b/introducing_reddit_polls_an_allnew_post_type/). Note that Old Reddit and mobile web support voting, but not poll creation.\n\n# HeadphoneAdvice Discord:\n\nJoin our **official Discord** to chat with like minded individuals about all things headphones here: [HeadphoneAdvice Discord](https://discord.gg/zPEmpuUW59)!\n\n# General Discussion:\n\nFor general discussion of headphones, news, theory, etc, please use [r/headphones](https://www.reddit.com/r/headphones/)\n\n\\---\n\n*Thanks for taking the time to read this sticky and for contributing to the sub! View the pinned mod comment for the latest community news.*\n\n*\\*If you have any sub related questions please feel free to contact the mod team directly via the \"Message the Mods\" button. (Not PM)*",
        "num_comments": 5,
        "comments": [
            "**Latest Community News:**\n\n* Join the **new** official Discord to chat with like minded individuals about all things headphones: [HeadphoneAdvice Discord](https://discord.gg/zPEmpuUW59)\n* We have employed a \"thank you\" system for submissions. It's very easy to use - if a comment on your post is considered helpful, please reward them by using this system. Read more on this in the main post.\n* Reddit Polls are now enabled on /r/Headphoneadvice! Please refer to the above stickied post for more information.\n* We have reached over 200K subs, gathering 2.8 million (on avg) views a month!\n\nI hope you find what you need here. Take advantage of the search feature, as we grow it becomes a more valuable resource.\n\nThanks,\n\nNick.\n\n![gif](giphy|bzuUs1uRLBHWe2aBPK)"
        ]
    },
    "Best wireless headset around 300-400 euro": {
        "title": "Best wireless headset around 300-400 euro",
        "score": 3,
        "url": "https://www.reddit.com/r/HeadphoneAdvice/comments/1dlttcd/best_wireless_headset_around_300400_euro/",
        "content": "I currently have the sony wh1000xm3's wich i have loved for years, but they are getting older and are partialy broken.\n\nI'm currently looking at the wh1000xm5's and the bose quietcomfort ultra.\n\nI don't really care about wich NC is better I just want it to be decent enough. I also am looking for one that is Comfortable to wear 4-5 hours a day, And has enough battery. Is there any other headphone i should look at besides these 2? ",
        "num_comments": 2,
        "comments": [
            "Thanks for your [submission](https://www.reddit.com/r/HeadphoneAdvice/comments/1dlttcd/best_wireless_headset_around_300400_euro/) to r/HeadphoneAdvice. If someone helps answer your question, please reward them by including the phrase `!thanks` in your comment. \n\nThis will add +1 Ω to that users flair. This subreddit is powered entirely by volunteers and a little recognition goes a long way. Good luck on your search for headphones!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HeadphoneAdvice) if you have any questions or concerns.*",
            "The non ultra QCs are probably you best bet, and you’ll save a lot of money. From your requirements, it’s unlikely you’ll miss the features the ultra has over the regular QCs"
        ]
    },
    "IEMs with replaceable/cleanable filters?": {
        "title": "IEMs with replaceable/cleanable filters?",
        "score": 2,
        "url": "https://www.reddit.com/r/HeadphoneAdvice/comments/1dluljf/iems_with_replaceablecleanable_filters/",
        "content": "I've been using the Moondrop Chu II for close to a year at this point and I love how they sound as well as the fact that you can unscrew the nozzle, remove the filter and clean it if any debris or earwax manages to squeeze its way in.\n\n\nI've previously had the Salnotes Zero and the Hola and they've both ended up imbalanced after a few months due to earwax regardless of how hard I've tried to make sure my ears are clean.\n\n\nI've been looking to buy another pair of IEMs with replaceable/cleanable filters but I've only managed to find ones with tuning nozzles that were well above my budget.\n\n\nI'd appreciate it if anyone has any recommendations for what I can buy at or under $50.",
        "num_comments": 2,
        "comments": [
            "Trn conch recently saw this while browsing for new IEMs",
            "Just took a look and it seems like I can get them for just under 30$, any idea if those tuning nozzles are easily cleanable?"
        ]
    },
    "Headphones for home use ": {
        "title": "Headphones for home use ",
        "score": 2,
        "url": "https://www.reddit.com/r/HeadphoneAdvice/comments/1dluix1/headphones_for_home_use/",
        "content": "I have some steel series Arctis 3 that serve we well but I would like to hear my surroundings more. Also a higher fidelity audio with better spacial audio would be appreciated my budged would be about 100-150 maybe 200 if the jump is worth I do a lot of gaming and I like to listen to synthwave a lot. I like wired btw. ",
        "num_comments": 1,
        "comments": [
            "Thanks for your [submission](https://www.reddit.com/r/HeadphoneAdvice/comments/1dluix1/headphones_for_home_use/) to r/HeadphoneAdvice. If someone helps answer your question, please reward them by including the phrase `!thanks` in your comment. \n\nThis will add +1 Ω to that users flair. This subreddit is powered entirely by volunteers and a little recognition goes a long way. Good luck on your search for headphones!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HeadphoneAdvice) if you have any questions or concerns.*"
        ]
    },
    "Sennheiser/EPOS PC38X build quality and alternatives?": {
        "title": "Sennheiser/EPOS PC38X build quality and alternatives?",
        "score": 1,
        "url": "https://www.reddit.com/r/HeadphoneAdvice/comments/1dlvwwk/sennheiserepos_pc38x_build_quality_and/",
        "content": "I picked up a pair awhile ago and boy do these things feel cheap and after a few months they creak like crazy. Not only when putting them on but also when wearing them and I take a drink of water or chew something. I don't play as many multiplayer games anymore, mostly single player, so I don't really need the mic and I'm wondering if there's anything out there that's better for gaming. Overall I thought the PC38X sounded fine but I wasn't blown away by them by any means.\n\nHow do the Philips Fidelio X2HR or Beyerdynamic DT 990 PRO sound in comparison in terms of detail, bass, and soundstage? Are there any other open back alternatives roughly in the same price range that I'm missing?",
        "num_comments": 1,
        "comments": [
            "Thanks for your [submission](https://www.reddit.com/r/HeadphoneAdvice/comments/1dlvwwk/sennheiserepos_pc38x_build_quality_and/) to r/HeadphoneAdvice. If someone helps answer your question, please reward them by including the phrase `!thanks` in your comment. \n\nThis will add +1 Ω to that users flair. This subreddit is powered entirely by volunteers and a little recognition goes a long way. Good luck on your search for headphones!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HeadphoneAdvice) if you have any questions or concerns.*"
        ]
    }
}