{
    "Team Cherry Update On 14 February, 2024: \"...we are still hard at work on the game.\"": {
        "title": "Team Cherry Update On 14 February, 2024: \"...we are still hard at work on the game.\"",
        "score": 706,
        "url": "https://www.reddit.com/r/HollowKnight/comments/1au94zr/team_cherry_update_on_14_february_2024_we_are/",
        "content": "Hey bugs and grubs! We always keep the latest Team Cherry news stickied to the top of the community and it's time for a new post! Since we had a couple different posts about it, we want to time-stamp the latest news and also link to the most recent discussions. We'll replace this post next time there's news.\n\n[We have an update from Team Cherry!!!](https://www.reddit.com/r/HollowKnight/comments/1aqy60g/we_have_an_update_from_team_cherry/)\n\n[Welp, there's that at least](https://www.reddit.com/r/HollowKnight/comments/1arpxr7/welp_theres_that_at_least/)\n\nAs always, you can find the affiliated Hollow Knight discord at https://discord.gg/hollowknight",
        "num_comments": 155,
        "comments": [
            "In my opinion the communication or lack thereof from TC is killing the hype. At least to me. There is no roadmap, no update, nothing. For all we know the game could be stuck in development hell.",
            "I thought I was lucky when I discovered hollow knight on 2021, thinking I'd get to play Silksong soon",
            "Expecting the same message next Feb 14th…",
            "The amount of dickriding in this community is insane. This amount of radio silence is just bad pr no matter how you look at it. I don't know why team cherry specifically gets a pass.",
            "“News”",
            "Honestly it's kinda sad that this is being treated as news. They've said they're still working plenty of times, just a few months ago Leth said this. It's not really an update so much as it is a casual reminder.\n\n\nI'm not dissing Leth for communicating of course, I just feel people are exaggerating when they refer to this as \"news\" or an \"update\" or \"confirmation that they're still working.\"\n\n\nIf they really wanted to update us, it'd be nice to like... not let us start counting the years we've passed the delay. At this rate we'll be celebrating the 1 year anniversary of it soon.",
            "In my opinion, Team Cherry shouldn't have announced Silksong so soon if the development was still in its early stages. This always kills the hype. It reminds me a bit of the whole Eitr situation, a game I was extremely hyped about when it was announced almost 8 years ago, and now it's just a meme.\n\nThat said I will play Silksong 100% when it is released so perhaps it doesn't really matter.",
            "This is what HK players call news and it’s fucking hilarious",
            "honestly ive kinda forgotten about silksong at this point, like, when i see something like this im like, “oh yeah that exists”, but i dont care all that much tbh 🤷‍♂️ i mean, i will still be super excited when there’s a release date, but who knows when that’lll happen",
            "There's also the fact that Team Cherry updated their copyright year a few days ago.  \n\n\nhttps://www.reddit.com/r/Silksong/comments/1as7b32/they\\_finally\\_updated\\_the\\_copyright\\_year/",
            "The fact that any of you were concerned they just up and quit working on Silksong without any kind of announcement is kinda mind-blowing.",
            "I still remember quite fondly some last year around this time saying June 2023 was a guaranteed release month. And a giant rant about how I was a “hater and an idiot” for doubting, because it was shown in the Xbox showcase. As if that was some legally binding contract or acting like Team Cherry was the one who made that presenting on & promise.\n \nAh how time flies!",
            "I am so lucky that I can keep playing SILK SONG when I just finish Hollow Knight\n\n\\---------written by 2020",
            "I wish they'd be like the Crowsworn devs and at LEAST show us stuff, screenshot, models, something...",
            "Silksong is gonna be the next Duke Nukem Forever. I'm calling it.",
            "Gives me that shake you get after beating a tough boss for the first time. Mine was Sentinel. This is what really gets me excited for silksong.",
            "With games like Prince of Persia Lost Crown doing some really interesting stuff will Silksong hold up to this insane expectation and hype ?",
            "Don’t worry, they probably saw how much love and attention the Memory Shards feature got it in Prince of Persia and now want to implement it. Only another 24-48 months to add that.",
            "I'm tired",
            "Yummy yummy info",
            "It's probably gotten immense by now.",
            "Uh huh\n\nSure",
            "Boy I sure doubt it!",
            "Man, people will say over and over again, 'I wish the Devs would at least say that things are continuing and they're still working on the game', and then they do, and people complain about that. Lol\n\nLike I want the game to come out too but at this point it's worth just forgetting about it and being surprised when it does.",
            "Everyone in this comment section has completely forgotten how small TC is and how big Silksong will be.",
            "There’s a difference between a AAA team stuck in development hell on a game for five years, and a small indie team carefully crafting a game for five years? Let them cook. Just don’t die, and you’ll get to play Silksong.",
            "This can in no way be considered news. It's them saying \"btw we're still alive and doing things haha\". It doesn't tell us *anything at all*.",
            "“we are still hard at work on the game”   *Creates folder",
            "when is it silk song coming",
            "Now let's see who was being disingenuous when they \"just wanted to know they're still working on it.\"",
            "I love that team cherry is so bad at media management that just one of the devs whispering about them still working on the game is news.\n\nThey know how far along they are in making the game, they're deliberately not telling us because they're either lying or dumb as hell",
            "wow, thanks for saying absolutely nothing.\n\nwe should expect more from them",
            "Why are though not in r/Silksong you could be a priest but nay though shall have denied the unholy way.",
            "4 months ago lol\n\nI just heard about the sequel. Kind of crazy to think it's been 4 months",
            "man i like this game but i kinda forgot about silksong. they should make constant updates at least because this is NOT it, people are celebrating ''news'' like this? cmon",
            "PLEASE HURRY",
            "Soon it will be two years we haven't seen any media about ss. What a shame. I don't really care anymore about this game",
            "Everyone's complaining in the comments, and it's sad. Guess I'll have to step in for team cherry (and take the downvotes).\n\nThis *is* news. Threads about the lack of communication come up over and over again, and people are divided in two categories: those who complain about the lack of news, and those who understand that if Team Cherry is still working on the game they might not really have actual news to share.\n\nSure, they could talk about some specifics they're working on (bosses, areas, mechanics,...), but maybe they don't want to spoil. They probably have a target release date, but we all know how this community managed when they shared the last one.\n\nTeam cherry is composed by 3 people, I agree that they're bad ad communication and they probably don't want to hire someone to do it for them. We also don't know what's delaying the development, maybe it's personal issued (with a team this small that can have huge impact), maybe it's publishers interfering with the development and schedule.\n\nAt this point Team Cherry are working on the game and will release it (or share a release date) when it's done. Which means the only news they can and want to share is that they are still working on Silksong, that the project isn't canceled.",
            "wonder if they gonna do some funny little joke in april",
            "oh man I thought the fan space was dead man.",
            "> For all we know the game could be stuck in development hell.\n\nIt was first announced 5 years ago, with very spotty updates. This already qualifies as dev hell lol",
            "The game is absolutely in development hell. The questions is whether or not it'll wind up being Cuphead, or Duke Nukem forever.",
            "that was my thought last year lmao",
            "I bought the game in 2022 and I'm now just getting around to playing it. Kinda glad I procrastinated 😅",
            "I though that when I started playing december last year.",
            "Gets a pass on what? \n\nThey say they're making the game. What more is there to say?\n\nJust wait until it's done. If you can't, forget about it and do something else.",
            "The amount of entitlement in this community is what's really insane tbh.",
            "What should they do? Game ain’t done yet and they don’t know when it will be. Why would they make an announcement on a game that they don’t even have a release date for?",
            "It's literally common sense, nothing dickriding about it. Bad PR would be giving constant updates making the fanbase think the game is close when in reality it isn't. Radio silence is their best option, when the game is done it's done and that's that. If you need updates to feel invested in the game, that's a you problem",
            "News used to be new",
            "What happened to “we’d be happy if they just let us know if they’re alive?”\n\nLet ‘em cook.",
            "Well, when there is people speculating for no reason that Silksong was cancelled, them saying they're still working on it is news.",
            ">I'm not dissing Leth for communicating of course\n\nGonna be honest? I am. He's PR, and to call *any* of this good PR is laughable.",
            "Desperation.\n\nThis is what a franchise with less than two games does without a game.\n\nPikmin fans could wait for pikmin four, literally having four (five? Maybe even six?) games already out, but Hollowknight doesn’t know how to wait.",
            "Yeah I saw a YouTube video saying there was “news” and it was just this. They said “some people might not be happy with it, but I’m happy with it.” Yeah of course you are. It’s enough for you to make click-bait content off of it.",
            "Honestly, Im the same. This excessively long drag has frankly killed my hype for Silksong to the point where Im probably going to have a \"meh\" response to it's arrival. Not quite the same, but I remember hyping up for Metro Exodus, then the whole shit with it being EGS exclusive happened, so I sat and waited for it to arrive on Steam and by the time it did, for several reasons, I just didn't care. The wait time had annoyed me so much I just forgot about it.\n\nI respect game development is a long and ardous process, especially since Team Cherry is, what, 3 to 6 people? But announcing the game 5 years ago is just taking the piss. And I seriously have to wonder if this will hurt the game's arrival when / if it finally happens as other people have just had all the hype deflated thanks to a half-decade wait.",
            "Same thing, I just hope I get to play Silksong in my lifetime",
            "I was literally thinking the same thing, so I opened this subreddit to see if there were some news. At this point I doubt it will release this year or the next one",
            "Leth -who only communicates on Discord, like a true pr professional- shot down a rumor that it would be released back half of 2024. So yeah not looking great. ",
            "I played Duke Nukem Forever, didnt know it had a history like that",
            "Or a Half-Life 3.",
            "they typically also want it to not be the EXACT SAME MESSAGE as the last one  \nmaybe say if X thing is completed or looks good, even if you can't show it",
            "I dont know what takes that long to make. You cant tell me they work on a triology sized DLC?",
            "Then what do you want? Do you want them to make up a release date or...?",
            "I think it's because they don't owe you shit and got sick of thousands of people asking the same unanswerable question.",
            "yeah, we shouldn't except this awful treatment of the fanbase",
            "they are evil...... very very evil.......         repulsive.... .... ....",
            "Wash your mouth out when you’re done and buy some knee pads",
            "I fear their scope might kill the game honestly lol, im glad they have so much love for the game and that theyre allowed to spend as much time on it as theyd like but i also feel like at some point someone needs to step in and say \"okay thats enough\"",
            "I disagree, in 90% of situations you'd be right but this is TC we're talking about. They delayed HK 2 years and needed a couple more months to get rid of the game breaking bugs. They also took another year and half to finish the game to their full vision, which is how silksong will be at launch. Look at the way HK turned out. No game that turns out as good as HK was in development hell.",
            "Can you explain a bit? Both seems like a finished game (never played both)",
            "I started playing HK some weeks ago and feel the same now xD\n\nI guess this is an endless chain all HK players have to go through :$",
            "that was my thought last week",
            "I thought that when I started playing it a few months ago. Silksong was announced as coming soon 7 years ago?!",
            "It’s more so how this community is excessively defensive of Team Cherry, albeit less so on this specifically. I got downvoted way back when I got angry at them getting Xbox to announce the release date rather than just saying it themselves because it was kind of derogatory to do so for a studio that has financed jack shit when it came to indie titles (I mean foreshadowing now they’ve shut down almost all their medium sized studios including Tango so it’s almost purely Triple A) and would be a way to deflect blame once they failed to release it.\n\nLike almost every single other indie studio does it through a developer which finances indie games like Devolver.",
            "The kickstarter promised another character.\n\nAs of right now silksong it's a 10k dollar scam",
            "buncha hypocrites.... or, they're different people saying different things.\n\nStill, I'm with the ones saying to let them cook. We're not owed anything after all.",
            "Because it's dumb to constantly let them cook because that famously turns out badly? Too long in the kitchen and the food's gonna burn!",
            "I feel like people forget that it’s only like two people for the most part. Regardless, stalking the internet for any source of news 24/7 isn’t going to accomplish anything but stressing yourself out. I highly recommend just playing and getting invested in other games in the meantime.\n\nThere’s lots of cool shit out there.",
            "Nothing, but this ain’t news.",
            "So if in a few months, we don't get yet another confirmation it hasn't been cancelled, does that mean we have reason to speculate that's the case? I appreciate Leth telling us and all, but calling this a necessary update feels like an exaggeration.",
            "Well, I'm speculating that at best, they are working on adapting it to Nintendo's new console coming early next year.  That they are getting paid handsomely for an exclusivity deal that will help promote the new console.    \n\n\nThat would mean us waiting another year so they can get money.    \n\n\nSomething is foul here.",
            "He's PR, but he isn't in control of the flow of information tbf. Unless Team Cherry expresses interest in updating us, Leth's hands are tied. All he can do is reassure us things are going well, so he's doing his best.\n\n\nSometimes silence is good PR though too. It builds hype. Let's be real, the day there's news, the community will explode. The lack of updates is only frustrating until an update actually happens.",
            "Don't you dare count hey pikmin as a game",
            "I clicked on your pfp to see the Kirby and now I’m intrigued. What is your favorite species of fish and / or turtle and why? If you can’t pick, what is a really cool one?",
            "Honestly people who say stuff like that just strike me as misinformed. There's no reason to speculate development problems have risen since last Leth said anything (which wasn't even that long ago, there was an interview he had just a few months ago where he of course said this exact same thing, as he's done this dozens of times.) So the only people who see this and go \"Finally, thank god\" are like... people who haven't checked to see if this has been said before who jump to conclusions?\n\n\nLike, **GASP**, Silksong is still in development? I wouldn't have ever guessed! Thank god Leth saved us by letting us know- we had no reason to think that was the case otherwise. Surely.",
            "Yeah 24 is a wash at this point. If they can't commit to a year halfway through it's not happening\n\nor any other year lol",
            "I will be hype for the game when I see an official release date and when we are within 2 months of that date. Until then Silksong might as well not exist to me.  \n \nI feel like a lot of the people who have been riding the hype train since announcement now are burnt out or delirious with expectations. Most of which probably won’t be fully realized. So I just plan to be excited when it’s near and worry myself with it til then.",
            "Wow we've got TC genuine white knight there",
            "They literally owe us EVERYTHING. Hollow Knight would be nothing without us buying it.",
            "Yeah, how dare they...\n\nOnly make a game.",
            "Silksong will become another Daikatana",
            "Why",
            "Development hell is an industry term for a software project that has gone off the rails in terms of scope, budget, or time (or all three, as they tend to be related).\n\nThe titles I just listed are two famous examples of a game stuck in development hell.\n\nCuphead had a tremendous number of delays and issues during development, to the point of the game nearly didn’t come out. After an excruciating amount of time, though, it did finally come out to critical fanfare and financial success. It is a cornerstone of the industry and its genre, and is universally loved.\n\nDuke Nukem Forever was in development hell and delayed for the better part of like 12 to 14 years. It changed studios multiple times, and development was completely started over from scratch multiple times because it had taken so long that game engines and entire console generations blinked in and out of existence. It launched, and was a critical and financial flop. it felt exactly like what it was - a late 1990s game badly ported into modern technology that had been developed by hot potato committee.\n\nFar more development hell projects wind up like Duke Nukem than Cuphead. With Silksong, only time will tell.",
            "this is relatable af",
            "Unless you believe the game will never get released you're talking total bs.",
            "While I totally agree, those that backed the kickstarter were promised a second playable character.",
            "\"We're not owed anything after all.\"\n\n  \nthis is probably one of the dumbest phrases i hear on reddit time after time, as the consumer yes you are owed the product you are willing to pay for, without that there is no funding for TeamCherry so yes the consumer is owed something? the fuck.",
            "I’m with you. We should let them cook. It’s the same thing with Playdead Studios. We just need to be patient. The game will come. It will be great.",
            "It's not necessary at all, that's what I'm saying. Honestly, the reaction that part of the community had to Leth's message is an indicator that they're full of shit. \"wE dOn'T wAnT a rEleAsE dATe, wE jUsT wAnT TheM tO lEt uS kNOw tHey'Re sTiLL wOrKinG oN tHe gAmE\" Well, we got just that and some people are still pissed off for some reason.",
            "Don't spin up random paranoid theories out of nowhere just to work yourself and others up.",
            "Nah, Silksong is still a Kickstarter reward for the backers, so it needs to be released on all expected/advertised platforms more or less simultaneously. Also, I think \"game pass day one\" deal with Xbox would prevent them from such exclusivity.",
            "I did!",
            "Crumbug alone justifies that game's existence.",
            "Oh finally, something this teenager can nerd about.\n\nI like yellow bellied sliders, in other words, my strawberry. I didn’t realize how much personality a turtle even could have.\n\nBlueberry, my red eared slider, is a timid little man, while it suits a turtle, Strawberry is more relatable.\n\nFor a turtle, a species known for being so skittish, literally tucking their heads into their shells to hide, she has a huge personality (as do yellow bellied sliders do in general.) As a 13 yo boy, who really only cares for animals and not the people around him (due to reasons I don’t want to explain on r/hollowknight of all places), having someone like that can really make your day. She’s very inquisitive about things. If I walk past the tank with a foreign object, she’ll look at it and follow it. She used to try to eat the fish but they’re too fast. I don’t think the turtles intend to kill them, rather it’s just their way of checking things out. She’s a freind (as everyone in the aquarium is.)\n\nFavorite fish? I’m not sure tbh. I only have three species in my tank and I’m too young to remember what was in my dad’s old tank. For now, I’ll say bristlenose pleco. Hope is really good at doing his job. He poops way too much though. Dad never bothers to clean his domain which is covered with poop during water changes (I’m too short to do them and he doesn’t trust me I think. Never asked.) Before hope, I had a common pleco named lucina who got chomped by one of the turtles while I was gone. It was probably for the better though. Common plecos can’t live in 55 gallon tanks, let alone with two turtles. They grow way too big anyways. I’ll miss her. Hope, my main man, has always been a shy guy. He’s a nocturnal species so I never see him that much but due to his uniqueness of being a pleco (those sucker fish you see in Asian restaurants that are way too big for the tank) I like him a lot.\n\nI also have convict cichlids which were forced upon me. I had a yellow lab cichlid who gave up and got eaten. He looked like he was dying…\n\nI have one African cichlid. His name is Oscar. As much as I like him, Central American and African cichlids do not mix due to water parameters. He too was forced upon me. \n\nI don’t know water parameters currently, baby sister threw the strips out (and an entice bag of cichlid food) so we need to buy new ones.\n\nIf I had the choice, I’d give the fish separate tanks and the turtles a massive one, large enough for the both of them. I’m not old enough to make these choices though.",
            "> There's no reason to speculate development problems have risen since last Leth said anything\n\n\nHaving a release date, then a month before that date having a last minute delay and reverting to no release date and then no communication for 7 months is a very big sign of dev problems. Of course, this new \"news\" does nothing to assuage that concern, but there's definitely reason to believe they're having problems ",
            "i love how literally both sides are getting downvoted lmao",
            "Lol. Buying a thing does not give you ownership of the franchise.  \nThey owe you whatever you paid for or a refund. That's it.",
            "At this rate we're looking at another Duke Nukem forever",
            "As someone in the artistic field, projects with larger scopes tend to rarely hit their marks.\n\nNot to say it’s not possible, but I know I can say I have had huge grandiose ideas that dont come to true fruition. While when I plan accordingly and realistically, I will almost always end up with a much more successful product.\n\nBut that’s just my experience. Larger projects and ideas = longer and harder to produce said content.",
            "If I have to defend Silksong, and just for the sake of the discussion, it is, similarly to Headcup, a platform game without technical ambitions, where its(their) merit comes from the design and gameplay. There are less chances (if no chances at all) that feels like a old game badly ported into modern hardware, as with Duke Numem. \n\nBut sure, we don´t know what we will find once it is out!",
            "If you lend someone money for a project you are a share holder, even in minor part, and a share holder is entitled to information. \n\nRIGHT NOW, I don't know where my money went, for what I know they used it on prostitutes",
            "Oh, I didn't know that. Well, I'd say they got way more than they bargained for (in theory lol)",
            "What you just said doesn't make any sense.\n\nI'm a consumer of the product only if I buy the product. I haven't bought Silksong yet, therefore I'm not owed Silksong.",
            "You’ve not paid yet, so you aren’t owed. You don’t owe me an ice cream because I’m willing to pay you for it. How stupid is that?",
            "The Hollow Knight community isn't a single person- if someone says \"We don't want a release date, we want to know they're still working on the game\", and someone gets pissed off when we get that, that's not \"for some reason.\" Those are two different people who feel different ways. I'm sure there are some people who are happy to see Leth tell us the game is still in development after all, but inevitably there are others who will feel this isn't really much of an update. I feel the latter are more correct about what's going on though- the former who believe we NEED to know they're still working on the game are just misinformed and don't realize how often we already get told that.",
            "> some people\n\nWho cares? Some people can complain, big deal. ",
            "How many times you can say that? In 2035 when they will say, ''they're working on it'' Game isn't coming, deal with it. \n\nThe worst part is that there are people who will believe them. Team Cherry isn't From Software, they're band of one song, one song made a hit, and now they can't reproduce that.",
            "Something is foul Noble.  I'm sorry.  \n\n\nFive years ago a playable demo with several areas of the game developed.  Three years ago a magazine cover with a lot of new information that could only come from TC.  A year and a half ago a promise to release within a year on Xbox platforms, as TC's apology attest to.    \n\n\nThe want for information and subsequent lack, KNOWING lack of given information is incredibly telling.    \n\n\nNo doubt the whole industry knows Silksong is going to be a killer game, and given Nintendo had a leg up on Silksong's introduction, it's reasonable to think at this point there is the distinct possibility they want an exclusivity now as a system seller come the beginning of 2024.",
            "Holy shit I really am an introvert.",
            "No communication? Not only did they outright tell us about the delay, but a few months later Leth had an interview with a YouTube who talked about stuff like this. Leth has even explained how that whole fiasco happened.\n\n\nThe Valentines update told us nothing new.",
            "I think, as I understand it, it was originally supposed to be a dlc. And was a kickstarter goal. So they do technically owe people, at least those backers, something. But in general, if they were just making another game, not related to the previous game's kickstarter. I would agree, they wouldn't owe people anything.",
            "Hence why they're taking their time.\n\nAs long as they say they're working on it, they are. \n\nNow, if they were taking money at the same time, like Scam Citizen, then we could talk. \n\nBut all we have here is a game company making a game, who keep confirming that they're working on it, and so it's done when it's done.",
            "Yeah that's not how being a shareholder works lol...",
            "The project delivered, you LOVED it so much that you're here 7 years later waiting for even a snippet of news about the sequel, that's how much you care. They fucking nailed it (pun intended).\n\nSerious question, would you prefer to have had your hornet playable character and no possibility of a sequel? \n\nLet them make their game how they see fit, that's when a game is at it's best. I've never seen such a bratty community as the silksong chasers.",
            "Yes but I’m owed to know what in the ice cream, how much it costs and when it will be available for purchase, how fucking dumb is it to buy some shit you have little to no information on other than “it exists”",
            "Alright, but then what is the update you're expecting? Cause let me tell you, the only relevant news left to announce is the release date. Anything other than that is a spoiler. And there's plenty of people who wanna go into the game as blind as possible.",
            "I like watching sharks get pet on the internet.",
            "I had no idea this interview occurred, and just listened to it.  I'm surprised it wasn't pinned in this sub.\n\nIt sounds like his \"explanation\" for the delay was mostly that they never really agreed to that date to begin with?  Like they said probably to MS and they just went with it?  On one hand, that's a relief because a last minute delay before a release date to no release date is a strong sign of dev hell.  On the other hand, if that wasn't something they agreed to directly or thought they could reasonably hit, why the sweet fuck didn't they say something? They obviously knew MS announced that, and it looks pretty bad on them for not saying something like \"um actually we never agreed to this, don't get your hopes up\"",
            "The project delivered and I loved it but they still owe me a new playable character or my money.\n\nThey CHOSE to make a sequel and that does make me happy but until said sequel is playable, or we get some info on it, team cherry got money they do not deserve and should communicate with us.\n\nIt's also in their interest! Hype makes money",
            "Like user Wills has been saying, you are not owed anything until you have given them your money for that product. Yes it’s disappointing, yes you may feel like you *should* get more than spotty updates for the past several years, but they do not owe you anything. Just because you’ve bought and played Hollow Knight doesn’t mean you’ve “bought” knowledge of Silksong in advance. They have their own respective prices and Hollow Knight can be considered a standalone since it is a complete game.       \n\nFrom a purely materialistic perspective, they do not owe us. The plot is complete. The main reason people are upset is because of precedent from other devs and if someone tells you they will do something and you expected it to be a year or even two years, and not five, and they’re also ignoring you most of the time, then yeah it is frustrating. Apparently those that funded the kickstarter are “kinda” owed if they paid for the tier that said there will a second playable character. But only those people are, and even then, technically there is good reason for them to not be upset as long as they trust that the team is working on it and it will be out eventually.  \n\n I’m thinking that Team Cherry is not giving many updates because they likely don’t want even more pressure from people when they say something about their work (giving unwanted comments/opinions on the prototype) or even steal the concept. Actually, I think the fear of theft is legitimate because Hollow Knight has had many copycats. If they show more of their developing product for Silksong and someone else manages to make an inferior but still complete/decent product of their game, they will become recognized for that and Team Cherry may be seen as just copying them, even if their version is better, and there won’t be as much interest in the version they made, than if they had released it first.   \n\nEven if Team Cherry did provide more detailed updates, there will still be people complaining that it’s taking too long, why can’t they just finish it, etc. I can imagine that the people that have already expressed their frustration online is already a weight on them that can delay/has delayed the process even further. From their perspective, it may be better to not engage or engage minimally and to devote all your energy to the development itself. That or there may be other personal life circumstances affecting the team",
            "But you aren’t buying it in advance. It’s not cod. You’re buying it after it comes out. You’ll know the release date before you buy. You’ll know what’s in it before you buy. You’ll know how much it costs and that it’s available for purchase before you buy.",
            "Surely you don't believe this is a relevant point...?\n\nWho's buying anything with no information? Have you already paid for silksong?",
            "I mean, there are other ways of gauging progress. \"We're close to a release.\" \"We don't see it releasing soon.\" \"Here's a snippit of our progress.\"\n\n\nIt's not like they haven't updated us before.",
            "what pet?",
            "Well, they did agree on it. They happened to be expecting a release within the next year so when Xbox asked if they could announce this, they gave Xbox permission. If Xbox hadn't approached them though, they probably wouldn't have announced that release window at all, but that doesn't change the fact that in the end, they still did- regardless of whose idea it was.\n\n\n\"On one hand, that's a relief because a last minute delay before a release date to no release date is a strong sign of dev hell.\"    \nNot really, it's a very common pitfall for game developers. There's a very good reason Nintendo, for example, waits until their games are pretty much finished before announcing them.",
            "Answer the question bud. Would you rather hornet was just in HK and there's no chance of a sequel? Which is what you actually paid for.",
            "The problem is that they *do* update us in that way. Leth has told us silksong is coming out before crowsworn for sure, told us about his own playthroughs through the game, etc. For whatever reason, the doomers like to act as if either these updates just didn't happen and don't exist or if they aren't enough",
            "Hell just a simple \"we are polishing things\" or \"we are still adding new things\" would be amazing",
            "Leth definitely made it sound like they were a bit surprised when MS announced that their game would be out in that window, even if they technically said yes it probably would be.\n\nI know delays are common, but a delay a month before release and going to _no release date_ is a sign of dev hell.  If you say your project will be done in a year, a year later there should definitely be less than 1 year of remaining work.  If they can't commit to saying that, one has to wonder why -- do they somehow have _more_ work than they had 1 year prior, and if so, why are they unable to approximate how long it would take them to do the work that they've done daily for over a decade?  It doesn't _have_ to be dev problems, but in a situation where that's what it looks like, their lack of explanation really doesn't do much to assuage any concerns.\nIf it looks like a duck and walks like a duck, it's their responsibility to communicate that it's _not_ a duck if that's what we're to believe",
            "I'd rather have hornet in HK at this point! I paid for that and want my money's Worth",
            "The process isn't that simple. Game development isn't always a line where you go from X to Y and just need to do a little polishing. They can always be adding a new thing.",
            "> I know delays are common, but a delay a month before release and going to no release date is a sign of dev hell.\n\nNo, that's called poor communication. Extrapolating dev hell out of that is baseless.\n\n\n\"If they can't commit to saying that, one has to wonder why -- do they somehow have more work than they had 1 year prior,\"    \nOr they just underestimated how much work they had left. It's hard to estimate how much progress you'll make in a whole year- that's a lot of time. Even AAA games suffer from this problem- release dates getting pushed back isn't that uncommon when it comes to games with release dates announced a year in advance.\n\n\n\"If it looks like a duck and walks like a duck, it's their responsibility to communicate that it's not a duck if that's what we're to believe\"    \nA single delay is not the same as looking like a game is in development hell. If they delayed the game, what it looks like is simple: The 1 year release window was inaccurate and they shouldn't have promised something so bold.\n\n\nI'd like to add that Team Cherry wasn't the only studio affected by this rash 1 year deadline Xbox announced. Many games failed to meet the window of time they agreed with Xbox on- this is why the 2023 Xbox showcase didn't make the same \"Everything here releases within a year's time\" promise.",
            "[https://help.kickstarter.com/hc/en-us/articles/1260805505829-The-reward-I-received-is-not-what-I-expected](https://help.kickstarter.com/hc/en-us/articles/1260805505829-The-reward-I-received-is-not-what-I-expected)\n\nGood luck with your refund.",
            "And it's such an injustice that I presume you won't be buying the game when it does release then right? You don't want to encourage TC's behaviour obviously! \n\nYou got your moneys worth in Hollow Knight, you gambled by backing a small company and it paid off in spades. When you donate money through kickstarter there's a chance you get nothing at all but you picked one of the best successes it's ever had. \n\nIn fact, it paid off so much so that they're now developing FAR more than you paid for. Lucky you! :) x",
            "Perhaps not,  but there is a clear difference between \"we are working towards perfecting existing features\" and \"we are in the process of implementing new features\"",
            "you seem to really be missing the point: i understand delays are common.  But I can't think of a single game that had a release date and then got _indefinitely_ delayed, and there weren't problems. It's not baseless to think that when this happens to TC, it's the same situation it's been every time it's happened before.  It's not the _delay_ that's the issue, it's that they approximated the amount of work they had, and then right before they were supposed to be done that work said \"we can't even guess how much work is left,\" which looks like they somehow _lost_ progress, which is obviously a bad sign.  It's certainly _possible_ that there are other reasons for it that aren't dev hell, but this is very much what it looks like to anyone looking in, and if they want us to feel like it's not that, then they need to say it."
        ]
    },
    "/r/HollowKnight - Weekend Flex Thread": {
        "title": "/r/HollowKnight - Weekend Flex Thread",
        "score": 4,
        "url": "https://www.reddit.com/r/HollowKnight/comments/1dl7gqd/rhollowknight_weekend_flex_thread/",
        "content": "Happy Friday! (or Caturday or Sunday!) Welcome to our weekend flex thread.\n\nThis is a place where anyone can talk about what they achieved in the game this past week, areas or challenges they're working on beating, artwork they've been working on, and anything else generally related to Hollow Knight that they're proud of.\n\nPlease be respectful and follow reddiquette.",
        "num_comments": 4,
        "comments": [
            "So this past week I manage to get all the dreamers for the first time! I also found all the stag stations and got the monarch cloak which is pretty awesome! ",
            "I got every single achievement recently",
            "Yesterday I started my first ever steel soul run. I am following a guide but I am about an hour and a half into it. Going for the 100% steel soul achievement. Hoping to finish it this weekend!",
            "I achieved getting stuck at nosk ol"
        ]
    },
    "Aren’t I supposed to get something here?": {
        "title": "Aren’t I supposed to get something here?",
        "score": 78,
        "url": "https://i.redd.it/sspm203k428d1.jpeg",
        "content": "",
        "num_comments": 25,
        "comments": [
            "No. Your shade spawns here if you die in the arena.",
            "No.",
            "Kill yourself. Then look in there",
            "Nah. That's just where your shade goes after you get killed in the colosseum",
            "Yes, if you lose to the coliseum, you get a shade as a participation trophy",
            "🕶️",
            "Black man spawner",
            "Nope",
            "U stinky.",
            "Nuh uh",
            "You may be confusing this with a different room in the game, which, to be fair, does look quite similar",
            "You're gonna get your geo and soul vessel back in here when you inevitably perish doing colosseum",
            "Only if you die it saves your shade here so you don’t have to get softlocked into the trial if you can’t win",
            "Colosseum of fools indeed",
            "LowTierHigherBeing",
            "uhhh.. could've phrased better",
            "Wow clever hint",
            "Shade*",
            ">!Abyss Shriek room?!<",
            "LowTierHamsterEater",
            "This is not where Fools thrive, this chamber only holds memories of past failures.",
            "Bro lmfao",
            "That’s what I’m thinking",
            "Yea fair. >!They do both have to do with void after all!<, so it makes sense they look somewhat similar"
        ]
    },
    "THIS CAN HAPPEN???": {
        "title": "THIS CAN HAPPEN???",
        "score": 637,
        "url": "https://v.redd.it/97x9mwfnhy7d1",
        "content": "",
        "num_comments": 49,
        "comments": [
            "oh wow... i assumed either the damage hitboxes or your hitbox would be immediately deleted after getting the last hit in",
            "THAT WAS RADIANT?? I FEEL SO BAD FOR YOU MAN",
            "Bloody hell, what a way to lose a radiant run... It must be so frustrating.",
            "It happened to me on Enrage Guardian in the story, he never respauned and didnt drop any geo",
            "Average team cherry hitbox moment",
            "At this point cheat it out, you have my aprovement",
            "# \"**If I'm going down, I'm taking you with me!**\"",
            "Bro I’d be PISSED…",
            "At that point I’d just cheat b/c that’s some bullshit right there.",
            "That's really strange.\n\nFor one, the orbs should disappear as soon as you get the final hit. I even checked a recording of one of my Radiant kills, where I have pretty much the same situation, and I would most likely have gotten hit by an orb after the boss died if the orb didn't disappear, but it did disappear instantly upon getting the final hit.\n\nFor two, it's kinda strange if this didn't count as a successful Radiant kill. Maybe it's just different for different bosses, but I know for a fact that at least on Markoth you can die during his death animation and it will still count as a successful Radiant, as that has happened to me.",
            "Bullshit i tell you",
            "I'm pretty sure that's a bug.\n\nI have had a ball nearly hit me many times during the last nail hit, but it disappeared as soon as I hit the Radiance.\n\nA bug like this happens during the nail rain phase too. Sometimes when you stagger her a new row of swords will spawn with a different pattern compared to the last visible one. I lost a few radiant attempts due to this, even tho it's nowhere near as infuriating as your loss.\n\nKeep going at it man, you're nearly there!",
            "r/mildlyinfuriating",
            "Has to be a glitch",
            "what? you just beat the boss",
            "whats crazy is the ball was still a measurable distance away when you got the hit. it traveled like 5 feet after you beat boss.",
            "F",
            "What the fuck?",
            "WHY !!",
            "Damn that sucks I would be real pissed lol",
            "Ohhhhhhhhhhhhhhhh that fucking sucks",
            "You wonn't",
            "how can she slap???",
            "This has happened to me before when I was practicing AbsRad. If this happened to me on radiant, I'd be so disappointed.",
            "Ikr this game's full of bugs smh...",
            "This legit happened to me while trying to beat radiant radience after like 2 hours. I eventually beat the boss on hour 5.",
            "this happened to me with oro and mato but it still counted as a win",
            "something something \"neither can live when the other one dies\"",
            "Lol\n\nYou still beat it tho\n\nThe game just thinks you didnt",
            "atleast i have it on switch, unfortunately my dog bricked it 🫡",
            "No way, the same exact thing happened to me on my first run. I was so upset when I got back there and I couldn't collect the geo and he was gone.",
            "To me it was hornet 2. I died, and she died right after thanks to my \"heroic smell\". I had to look up the dialogue.",
            "Mmm yes today I will use my excellent sense of spacing to- *damage noise*",
            "i didn’t notice at first, if i didn’t cut the clip it wouldve shown me laying down (because i was punching my bed in excitement) and then.. the realization",
            "ive gotten that one a few times, and after repeated attempts sometimes a stray sword will be stuck in the top right which is the essence of mildly infuriating",
            "i in fact did not beat the boss",
            "I mean, that is so damn unfortunate, I cannot expect it to happen. People in here has already said it’s somewhat kind of a bug (which is of course apparent in HK). Regardless, I wish you good luck with doing Radiant AbsRad again.",
            "no unfortunately i didn’t",
            "H- how does a dog brick a switch?",
            "I rewatched, I see the problem now",
            "How so?",
            "it’s a switch lite so it’s only a handheld and she’s a big girl (60lb/27kg [Amstaff pit mix](https://ibb.co/Ntc5jPg)) so she was laying between my legs and she wanted to chew on my hand, missed and hit the corner of screen and it got lines everywhere",
            "and what’s the problem?",
            "i dont have the radiant mark, and the radiant outline didn’t flash when i respawned in HoG",
            "Oof",
            "light orb hit me during the unmovable cutscene",
            "Again, you still beat it. The game just thinks you didnt. Try again some more and you’ve got this.",
            "oh, yea, that part i get, i imagined he would explain the mechanic thing lmao",
            "He means to say: maybe according to the game you haven't beat him, but to us you just proved you did. It was just a flaw in the game. Just keep doing it; you did it once, you can do it again!! We believe in you!"
        ]
    },
    "10,000 hours of gameplay ruined by one well": {
        "title": "10,000 hours of gameplay ruined by one well",
        "score": 17,
        "url": "https://i.redd.it/c1uwuu8d548d1.jpeg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "....how?",
            "Is this related to the Lever post?",
            "Maintenance bug isn't that rare",
            "... what?",
            "What happened ?",
            "The well texture is very confusing.",
            "\\*lever post intensifies\\*",
            "Oh..",
            "explain please",
            "What?",
            "Can you explain?",
            "Well, well, well.",
            "Menderbug RNG is 2%.",
            "mossbag please come and explain the lore of this post",
            "👀"
        ]
    }
}