{
    "Found my water shut-off…": {
        "title": "Found my water shut-off…",
        "score": 103,
        "url": "https://www.reddit.com/gallery/1dldqjc",
        "content": "Been searching for this for 3 years ever since I bought the house. Some blockhead put a vent-cover over it 😭 ",
        "num_comments": 22,
        "comments": [
            "omg",
            "Mine was literally behind drywall (no access panel). Only found it because it started leaking and ruined my basement…!",
            "I’m curious to know how you found it? What was the reason for removing the grate?",
            "I’d definitely put that back like it was.",
            "I hide shut off and random stuff like it behind fake air returns all the time. Pretty much any time i need into a walk and may need back into it. I always prefer things especially shutoffs to be extremely frequent and accessible.",
            "The shut off in my house was apparently encased in concrete at one point which caused a problem and flooded the basement corner. They solved it by cutting a long trench along where the pipe was in the wall and after installing a proper shutoff inside and encasing it, they filled the trench with glass blocks which light up our basement. \n\nIt's a really weird arrangement when you glance at it and think...what the heck? We found out what happened when a caseworker for one of our adopted kids happened to also be a caseworker for the family that lived there when it flooded. It was such a weird coincidence.",
            "Just like my clean out",
            "First off, great find! I don’t think I would have even thought to look there if I didn’t know where it was. \n\nAny plan on how you will access it from now on?",
            "Yeah it's hard to believe how stupid people are when they decide to finish the basement and don't even think about giving access to the plumbing and stuff",
            "I’m a plumber, this is a pretty great access panel tbh",
            "Other threads on this sub have recommended hiding plumbing holes behind fake air vents. Guess it’s pretty standard in a pinch",
            "You have one out in the yard…",
            "That's standard practice in my neck of the woods.",
            "It do be like that sometimes",
            "WTF? Woah!",
            "I was looking for the water shut-off for the millionth time, read online it’s almost always in the laundry room, look down behind the door and thought… wait a sec. My HVAC literally doesn’t go there. Why would there be a vent??? Pulled it right off and bam!",
            "This one",
            "Just take the vent cover off when needed?",
            "Could be a condo",
            "> read online it’s almost always in the laundry room\n\nThat's interesting... I've never had one located in a laundry room.",
            "That works!",
            "Could be a lot of variables."
        ]
    },
    "Just bought a house (built in the 50s) and this is in the entryway. Any guesses what it is?": {
        "title": "Just bought a house (built in the 50s) and this is in the entryway. Any guesses what it is?",
        "score": 238,
        "url": "https://i.redd.it/9njna56nsw7d1.jpeg",
        "content": "",
        "num_comments": 222,
        "comments": [
            "Doorbell.",
            "The amount of posts of people not recognizing a doorbell versus other technologies that have phased out is super interesting.  I would have guessed younger people would be more confused with coax cable or phone lines versus the box that ding dongs and chimes when ever someone comes to the door.",
            "It’s an early AI that plays musical bells when someone is at the door",
            "I have the same one. My house was build in ‘91. Doorbell chime",
            "Ghost vault, you it protects your house from evil ,,,, don't open it.",
            "ding-dong",
            "Looks like an old casing for a doorbell chime.",
            "It’s just a portal to the future.  It won’t work now, since it was designed for the early 2000’s.  Still cool",
            "Doorbell/Portal",
            "Doorbell chime cover.",
            "One of my favorite things about the place im living now is that theres no door bell button outside. it got ripped off at some point and i never have to deal with the witnesses or spectrum cable. \n\nwhen they catch me outside, im nicer to the witnesses than i am the spectrum reps. lol.",
            "Doorbell cover, it'll have the chime inside it.",
            "Doorbell chime",
            "Chimes",
            "I'm 70 years old and  have never seen a funky doorbell like that",
            "Chimney cap. It’s capping off the pipe that lead from the parlor stove that heated that part of the house.",
            "You RAANGG",
            "Contraption to scare you to death in the middle of the day, giving you warning of unwanted people with clipboards or in suits at your front door.",
            "Doorbell",
            "Do they not put door bells in houses anymore? This is a very common question.",
            "It’s a door bell, you ding dong.",
            "Thank you all for your input! It is likely a doorbell, though the doorbell was broken when I moved in so there is no way to test it.\n\nAs for all the older folks who are unreasonably angry that I did not immediately know what this is, no house I have ever lived in has had anything remotely like this.\n\nAlso I did not know your feelings were so deeply attached to a piece of ancient doorbell technology, and for that I am very sorry.",
            "Doorbell. Take the cover off to see the strikers and chimes, plus where the wires from the button and transformer meet.",
            "I would say it is..... Fucking ugly!",
            "The amount of people who have never seen a doorbell in this sub is astoundingly high. Seriously, do most people live in a house with no doorbells? \n\nI know that Ring is a thing, but has it really taken over the world? How does it even work, if someone presses your Ring, and no one in the house has the app, is there just no doorbell?",
            "Two way mirror so you can shoot intruders from bedroom",
            "Someone tried to make a decorative cover for your doorbell. I’m guessing sometime in the 80’s.",
            "Look like a gel tab",
            "Hell they may never had a home phone either",
            "Looks like something you would see hanging on the wall of the Atreides palace on the set of David Lynch's Dune",
            "Some sort of portal",
            "Who are these people?",
            "Light fixture",
            "I was trying to figure out how you fit through that since it’s the entrance….",
            "Doorbell",
            "OP, what's it sound like?  \nDoes it go \"ding-dong\" or is it the fancy \"ding-dong, ding-dong... dong, dong, ding-dong\"? I bet it's the fancy one.",
            "Just saying it's in the entryway SCREAMS doorbell.",
            "I get so mad when people knock on my door… there’s the original illuminated doorbell button and also the Ring. \n\nYet, they still beat on the door like they cops or my girlfriend’s boyfriend.",
            "A bomb shelter.",
            "Asbestos",
            "Doorbell",
            "Doorbell",
            "Art deco doorbell",
            "The door bell chime",
            "doorbell",
            "I can't tell for sure - is that a shiny faceted face reflecting the surrounding room?  Or a glass cover over an empty box?\n\nIf the former - probably doorbell like everyone is saying.\n\nIf the latter - it looks an awful lot like a shadow-box.   Basically a display case in which some miniature diorama would be set up - often something like a fancy Victorian sitting room or something.  Kind of like a \"dollhouse lite\" for collectors to show off their expensive miniatures.",
            "Old doorbell my grandmas had that",
            "It's a door bell ding dong",
            "Is keep it it’s really nice",
            "You put your kid in it so you don’t forget him when you go out",
            "It’s the “chime” part of the doorbell….i think with Ring and other doorbell cameras out there these days, these are fast becoming relics",
            "Doorbell",
            "It's a Fancy doorbell.",
            "🛎️",
            "Dead 💀 people door bells.",
            "What do modern doorbells look like?",
            "Doorbell chime",
            "Doorbell",
            "Looks like a doorbell if you look for wires from it usually in the basement going to a transformer the wires from the transformer also go out to the button outside by the door. Usually easy to fix if wanted mine looks similar to this [https://assets.rjimgs.com/rjimgs/rk/images/dp/wcm/202413/0005/img15o.jpg](https://assets.rjimgs.com/rjimgs/rk/images/dp/wcm/202413/0005/img15o.jpg)",
            "It would be nice if you provided a banana for scale.",
            "It all depends on country ….",
            "My guess a door bell",
            "Door. Bell.",
            "Doorbell",
            "It’s a peephole. Voyeurs use those a lot.",
            "Chime",
            "Door bell",
            "Somebody’s knocking at the door\nSomebody’s ringing the bell…",
            "[https://youtu.be/76WkQMeTEf4](https://youtu.be/76WkQMeTEf4)",
            "Doorbell",
            "Its a doorbell",
            "It's a 1950s YouTube subscriber plaque.",
            "The transformer for the door bell",
            "Doorbell",
            "For some reason I thought it was the size of a giant painting on the wall.... was so confused",
            "a doorbell",
            "Does it say “Ding Dong” with a metallic vibrato like those electronic voice box things that smokers use?",
            "Door bell",
            "Thats your GOD. Kneel. Heathen.",
            "My best guess is a door bell speaker",
            "I have this in my house. Built in 1983. Doorbell!",
            "Watch out for a possible mercury tube tilt switch in there!",
            "Geiger counter?",
            "Fancy doorbell (cover box). If you intended to have a video doorbell (such as Ring), you could potentially use the existing wiring to hardwire it for power, assuming the wiring is still there. That way you don't have to take it off to charge it.",
            "Door bell, lovely one at that.",
            "Doorbell?",
            "Doorbell?",
            "Ding Dong!",
            "this person just asked what doorbell is, congrats on the purchase",
            "You an idiot? It’s a damn doorbell.",
            "What a boomer comment",
            "I got confused because...it's a doorbell. Is there anything else it could be? Had me second guessing everything I know.",
            "Dumb as a door knocker.",
            "I'm stunned people don't ask what stuff is, concerning the biggest purchase of their lives.",
            "This is embarrassing.",
            "I am stunned at the number of people (I'm assuming young people) who have never encountered a door bell.",
            "Ding ding ding! We have a winner.\n\nOr rather, ding dong, we have a winner!",
            "My house was built in 47 and has one.  Only sucks because i cant really hardwire by ring camera into it.  Surprisingly loud",
            "It’s pretty, looks like an art work or sculpture…",
            "Ding dong",
            "I’m guessing same",
            "Door be bussin'.  Not sure why.  Sus.",
            "Ya ding dong",
            "Ding ding ding. Winner winner chicken dinner",
            "Close the thread",
            "Microwave",
            "Dumb as a door knocker.",
            "I think the fact that it looks like it’s the size of a dinnerplate from the photo is contributing to the confusion",
            "I’m always surprised at the monthly query about old school four-pronged telephone jacks.",
            "People still use coax and phone lines for regularly for their modems, whereas a doorbell chime is something placed out of sight.",
            "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^smartobject:\n\n*It’s an early AI*\n\n*That plays musical bells when*\n\n*Someone is at the door*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
            "but the witch aint dead",
            "This",
            "What do you mean by witnesses?  Do you live in a crime scene?",
            "The house I’m renting, built in maybe 2015, does not have a doorbell. Weird. 🤷🏼‍♀️",
            "Never thought about it before, but the younger crowds are now familiar with smart doorbells... No boxes anymore!",
            "Wild, but doorbell makes sense! I spent a good 20 minutes screwing around with it trying to get the cover off but couldn’t manage it. I’ll see if I can jiggle the glass around or maybe it slides out, who knows.",
            "To each their own! I think it's got character.",
            "Doesn’t make any sound actually. We tried the doorbell when we bought it and it doesn’t work.",
            "Depends on whether or not the Ring model and your doorbell transformer are a match, or if you know where your transformer is, can access it, and have the ability to replace it. I have an older Ring model that works with my ancient doorbell, but I wanted to upgrade to a newer model. Fortunately, someone here on reddit warned me of the transformer issues most people encounter in my situation, where the newer models may not work with older transformers, and I've held off for now.",
            "Bro, I’m 50 years old and I’ve never seen a doorbell like that. ",
            "I always wonder what they think of the internals if they open it up and see that there's no speaker to generate the sound. It's just two glockenspiel tone bars (one for the ding and one for the dong) and a \"hammer\" that works with wire-coil electromagnetism.",
            "I immediately knew it was a doorbell but I've never seen that type.",
            "I mean, it's slightly fancier looking, but it ultimately looks exactly like the yellow plastic ones. Not sure why this confuses so many lol",
            "I have replaced countless doorbells in houses of all ages and never seen one that looks like thid",
            "These days they play text, text, ditch.",
            "Right? Me too!",
            "This might be a door bell chime. Not just 'ding dong' but something fancier sounding. \n\nJust a guess.",
            "I work maintenance and an old house in our college town had a manual hand crank on the outside then the metal cover and gears and such on the inside. The young college kids had no idea wtf it was. Then I turned it and they were like “oh, that’s so neat”",
            "looks like a radome to me.  Needs a banana.",
            "I still don't believe him so...",
            "They went from decorations to tiny white boxes hidden away from view. If their house was built in the 80s and on they probably don’t even know where their doorbell is.",
            "to be fair, I've seen a couple of old mirrors shaped like that and they can get that weird patina.  The question is, does it have wiring or is it just hung up?",
            "How is that possible? Surely, most homes have a doorbell.\n\nI think what you mean is that many people of all ages don't pay attention to a doorbell. They're like dogs. They hear a bell ring, and they run to the door.  But many people don't actually care or know where that bell sound is coming from.",
            "Yeah, these idiots are so dumb for not knowing things I know.",
            "For the \"young\" people (basically, under 40 at this point I would guess), if it doesn't have a video camera, a speaker, and a microphone that are all tied to an app, it isn't a doorbell.",
            "My house built in 44 has one and I have an older Ring camera that does work with it. I almost upgraded to a newer model before someone warned me about possible transformer issues if I did.",
            "This. I'm in my 30's and have seen plenty of doorbells but the scale of the photo made it seem like the size of a mirror. \n\nKind of disappointed when I came to the comments lol",
            "Yeah at first glance I assumed it to be about 3 sq ft lol",
            "That one doesn't surprise me as much, those 4-pronged plugs went out in the 1970s. But who doesn't have a doorbell?",
            "25, had one growing up in my parents house. Same shape, different color tho.",
            "This is 6-7-6. This is incorrect.",
            "Jehovah's witnesses",
            "Things change. To be honest this one wasn’t expected. But I get it.",
            "The things you don’t think about disappearing. It’s just always been there. I stopped trimming homes about 8 years ago and they were still being put in then. Makes sense though.",
            "Can you just ring the doorbell to see if it works...?",
            "There may be a little set screw on the bottom",
            "I'm 66 and....\n\nWhat were we talking about?",
            "44 yr old, 12 yr home appraiser, see about 400 homes a year… never seen this style in Central Indiana.",
            "Cool!  You grew up in the 70s and 80s, when doorbells were pretty bland off-yellow colored boxes.\n\nBut in the 50s a lot of tech that was integrated into homes had a retro-future design element to them.  There was something about consumer designs pre-1970s/1980s that often made them stand out.",
            "i agree my first guess was door bell only because of location but this must be a custom enclosure, if it was in the living room lets say, i would have no guesses lol",
            "LOL! I haven’t seen one of these either.",
            "Same.",
            "Well, maybe not exactly like this but you certainly have seen the basic doorbell boxes on wals in homes over the years.",
            "Ok, but a box mounted to the wall near the front door is a good throwaway that it's a door bell. The only exception is.. the thermostat?",
            "Pretty standard in mid century homes",
            "I'm 58 and I HAVE seen these. They were common in the 1950s. They never changed it. But if it works, why bother? A new one does the same thing.",
            "I'm 60 and could figure out that it's a doorbell without ever seeing this. I have logic and common sense, where is yours?",
            "It's actually becoming harder and harder to find those.  They still sell a contractor-grade cheap one at hardware stores, but if you want an old-fashioned doorbell with the multiple bells hanging down, there are few options besides vintage.  I want to find something that plays a little tune, but mechanically.",
            "Did you just say glockenspiel?",
            "It would probably blow their minds to see the style from the era before this one ... the style with two long brass pipes exposed and hanging vertically in a recess built directly into the wall to accommodate it all. Not only were those things LOUD, but they actually had a very cool aesthetic to them.",
            "It's connected to the push button via a wire and a transformer.",
            "What knockers!",
            "Good to know as im probably going to rewire the house soon.  It has wiring that predates knob and tube.  Its a pain to install anytging and probably a fire hazard.  Its copper wires wrapped in a cloth weave in most of the house.  Honestly if it burned down id probably be better off.  Crazy to think this house would now sale for 250k now.  I bought if for 67k in 2011",
            "You should read the bottom quote of this bot reaponse, it's a sokka haiku bot. Whatever that is....",
            "Ah I guess that's ONE benefit for living in Florida as it's too hot for door to door solicitors.  I do remember one time an ex gf let in a jehova's witness on a Saturday morning.  I was like hell no they got to go",
            "that would be too much like right…",
            "The doorbell is actually broken so, no.",
            "😆",
            "I think someone’s at the door?",
            "Winner. We have a winner 🏆",
            "Go to bed, grandma! 😆😜",
            "Soups",
            "💀💀💀",
            "GET OFF MY LAWN!!!!",
            "I'm 76 and . . . . .\n\nwhat was it we were talking about?",
            "😂😂",
            "Them kids riding their darn skateboards on the sidewalk! Rabble rabble rabble!",
            "The first thing to go is your memory and the second thing—- I can’t remember",
            "They’re selling *chocolates*",
            "Yeah..you must have been something before electricity",
            "They were mostly off yellow colored because everyone smoked back then.",
            "The doorbell in the house I grew up in is a smoked plexiglass box through which you can see three resonance tubes. It came with the house, is still there to this day, and the house was built in 1978.\n\nIt was certainly not a ~~bland off-yellow~~ harvest gold colored box.",
            "Yes. Thank you for proving me right and you wrong. You old kermudgeon ",
            "That’s my point. I’ve seen plenty of doorbells and none of them looked like that",
            "Don’t argue with me. Or him. Or whoever. We know doorbells.",
            "I left it at your moms house last night",
            "Look for vintage NUTONE doorbells. You can find these on eBay from time to time. Especially the one your looking for.",
            "It's getting harder to meet a girl that will glocken my spiel.",
            "Yeah. Like a xylophone but made of metal, not the xylum from a tree.",
            "If I can suggest, the Foscam doorbell camera works great with old mechanical style bells - very happy with mine and having an authentic chime sound.\n\nBest of luck with the rewire...in my part of the world it's very tough to even find an electrician at the moment",
            "It's fucking stupid.",
            "It's a joke from Avatar. There is a great description of it here. https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/",
            "Nah sokka’s haiku is 5-7-6. This one probably got confused by AI being two syllables because “ai!” can be an exclamation",
            "Close the door! You’re letting all the wifi out!",
            "I'm 65 and I smell like old people.",
            "Door?",
            "Let me think...\n\n\n\nZzzzzzzzzzzzzz......",
            "No it had to do with the binders in the plastics they used back then.",
            "Yeah my old doorbell is two xylophone plates that are struck by a pin actuated by magnetic field from spooled wire connected to the door bell button.  Pretty neat",
            "My house was built in 1959, but the doorbell had already been replaced by the time we bought it.  Now it’s just a white plastic box.",
            "And I bet you heard it clear as day too",
            "To be fair, if he lived through the 50s, you're still a young person from his point of view.",
            "Curmudgeon",
            "OP wasn't asking if anyone has ever seen this EXACT doorbell......They didn't even know what it was at all.",
            "Yes, WE know doorbells but OP had no idea what it was at all.",
            "Hahaha, cute, my mother died in 2018.",
            "Hahahaha tell me about it",
            "Get some axe body spray and smell like a teen again",
            "It’s called OMS……old man smell,old man strength,I’m 62.Joke em if they can’t take a fuck!😉",
            "This is the answer. If plastic looks yellowed, it's because they didn't use the right kind and/or enough UV stabilizer.\nVery common problem with plastic parts from the 1970's to 1980's.\n\nOne good example are Panasonic radios/boom boxes. It's called Panasonic yellow. Seriously. They made some really beautiful, well performing radios back in the day. But the back panels of these always turn yellow. If it was stored out of the sun it won't show it. But most do. It doesn't affect anything, but it is unsightly.",
            "Most of them are like that inside.",
            "Great user name 😄",
            "Lol",
            "Curmudgeon? Geezer? What’s the difference?",
            "Check the user name",
            "*grave",
            "I'm not sure smelling like a teen is an improvement lol.",
            "That’s only a third of the mix, you need to add gym socks and disappointment.",
            "One has money and one doesn't",
            "Well, her ashes are here in FL with my wife and I."
        ]
    },
    "What to do with bedroom and hallway cubbies that are up 8+ feet high": {
        "title": "What to do with bedroom and hallway cubbies that are up 8+ feet high",
        "score": 4,
        "url": "https://www.reddit.com/gallery/1dln9k6",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Cubby/shelf dimensions are 16\" deep and 22\" to 24\" tall (sloped ceiling). As wide as bedroom and hallway respectively.  I'd have to keep a stepladder or sturdy chair handy if it's used for storing anything or had plants that needed watering.",
            "Christmas tree 🎄 and Christmas box",
            "Action figures 🤺",
            "Since you’re in college line them with all the empty liquor bottles you’ve ever drank. Those are street cred displays.",
            "Fish tank haha jk",
            "Store your luggage",
            "Skip plants, that’s just water damage waiting to happen. I don’t have a good answer though, some kind of sculpture?",
            "How many christmas trees and christmas boxes is too many?",
            "I might catch flack for this, but I might be too old for those! Either way, I don't have any and its an expensive hobby to get into.",
            "I don't drink! Therefore the spaces for them are empty.\n\nThis is also where I'd put my trophy... If I had one!",
            "A fake fish tank would go kinda hard haha",
            "For the small cubby, a piece of art like a statue or sculpture would work, yeah. What about the 15 foot long one though lol",
            "lol I know it’s just a memory that popped up. Kids thought that was the coolest.",
            "Yoo now we talk haha bet 🙌",
            "I’m a woodworker, so I’d conceptualize and implement somewhere there. I’d also probably just leave it. Unused space isn’t a bad thing and keeps a clean looking house.",
            "Haha yeah, nowadays I think its more like monster energy drink can collections",
            "Fair. I've thrown suitcases/luggage up there before since I only use them a couple times per year but they just never made their way back up after",
            "Yeesh"
        ]
    },
    "Vertical crackers above bathroom door, are they serious?": {
        "title": "Vertical crackers above bathroom door, are they serious?",
        "score": 1,
        "url": "https://www.reddit.com/gallery/1dlsdq3",
        "content": "Hi all, I have noticed 2 cracks above my bathroom door, one is inside bathroom wall, the other one is outside. The building is new (2/3 year old) and I was told these are normal as the building is still settling in. I am a bit concerned, do you think these are serious cracks?\n\n1st picture is outside wall.",
        "num_comments": 2,
        "comments": [
            "They are not serious. Most likely caused by drywall being installed with a seam where two pieces meet over the door opening. You can patch it but it will most likely crack again in the exact same place. The proper way to install drywall is by using a whole piece and then cutting out the door opening. But it is only cosmetic and not an indication of a structural problem.",
            "Thanks for the reply! Very informative"
        ]
    },
    "It's always either a door bell, or a phone jack": {
        "title": "It's always either a door bell, or a phone jack",
        "score": 3,
        "url": "https://www.reddit.com/r/Home/comments/1dlmw75/its_always_either_a_door_bell_or_a_phone_jack/",
        "content": "Hi mods! Could you make a collage of doorbells and phone jacks and pin it at the top of this sub? We have so many of those questions.",
        "num_comments": 0,
        "comments": []
    }
}