{
    "Pre-purchase inspector says he found mold in my attic and suggested that the buyers take 10k off the home price.": {
        "title": "Pre-purchase inspector says he found mold in my attic and suggested that the buyers take 10k off the home price.",
        "score": 305,
        "url": "https://www.reddit.com/r/HomeImprovement/comments/1dlckmk/prepurchase_inspector_says_he_found_mold_in_my/",
        "content": "Pics of said mold: [https://imgur.com/a/OKbdcUV](https://imgur.com/a/OKbdcUV)\n\nI'm really looking for a second opinion / anybody's thoughts about this. Is it fair of him to want the asking price reduced by 10k? \n\nEdit: for clarity, I am the seller, and the buyer hired the inspector. He is suggesting to the buyers to lower the offer we had agreed on (it was subject to inspection)",
        "num_comments": 169,
        "comments": [
            "I had mold remediation done in my bathroom a couple years ago and it cost me $5,000. My mold was way worse than this though. If you wanted to fight them on it you could get a air quality/mold presence test done and base your counter off of those results. If the results are within the acceptable range of air quality standards you can just tell them no. If it comes back significantly higher than the outdoor air then they might have a point. \n\nObviously you do have a moisture issue somewhere because there is mold on those sheets and not on others, so something is happening that if you weren't selling I would say is worth looking into why that's happening.",
            "I mean, it's up to you whether you take his advice. But estimate what it would cost to remediate the problem. If i were the buyer, I'd probably go the route of asking the current owner to remediate the issue and provide proof of remediation or an inspection confirming there is no mold anymore. That way it doesn't become the buyers problem to deal with after the sale. \n\nWhen we purchased our house something similar happened, except that it was the banks appraiser that spotted what looked like mold. The bank wouldn't approve our mortgage until it was remediated and there was documented proof of remediation.",
            "How does the inspector tell anyone how much to lower a price? He is there to inspect, not be part of a real estate transaction. That is Resltors job.\nThat said, that attic does not look all that bad. Of course context is important. Is that from a bathroom vent? Lack of attic ventilation? Plumbing vent not going out thru roof? \nSource: inspector for 30 years.",
            "Did he test for mold? I’m a licensed home inspector in Texas and if you don’t test for mold, you never use that word. I’m not saying it’s not mold, but that’s a lawsuit waiting to happen if the inspector says mold without testing. \n\nRealistically there is mold in every home, you just want to avoid harmful types or levels. Also, inspectors should not have any opinion on home prices.",
            "Yeah that's a lot of mold looks like poor ventilation not leaks. Or maybe the bathroom is vented directly into the attic, or kitchen vent. Plywood is going to have to be replaced to really fix it, although you could try chemicals.",
            "I’ve sprayed my attic with a product that completely removed any mold. Of course found out why there’s mold there in the first place. Could be a disconnected bathroom vent fan or poor attic ventilation",
            "That's not a thing inspectors do, you might have mold but knowing how much it'll cost to fix is outside the scope of the 3 weeks inspector certification course",
            "Some of the top comments so far are so Reddit. Attic mold remediation costs like $500, so no do NOT listen to people saying \"yeah dude take $10k off so you don't have to deal with it\" \n\nAlso it was the buyer's inspector suggesting that you drop $10k. The selling price has zero to do with them so what's going on there? My guess is buyer's RE agent is the one who got them to hire their inspector buddy. It's common and sleazy.\n\nGet your attic remediated, don't lower your asking price, provide receipt. I was on the buyer side of this once and that's how we handled it, no problems. I certainly didn't try to knock $10k off like a clown buyer. If they don't agree, then send them on their merry way\n\nTo everyone else reading this wrong: OP is the seller, the buyer's inspector is the one attempting this tactic",
            "Something about this doesn't make sense.\n\nA home inspector should be inspecting the home and providing you a report of their findings.  If he's a great inspector familiar with the market, he might be able to give you some ballpark idea of the fixes that would be needed and a ballpark estimate of the price, but even that would be beyond his responsibilities.\n\nThe inspector giving you negotiating advice seems incredibly suspect.  Is he encouraging you to have mold remediation done by a friend of his?",
            "Not really sure where a home inspector gets off telling the buyer how much to ask off on a price. Their job is to report found issues. Not give pricing advice. Does he or his family own a mold remediation business and did he also push the clients to them? Seems kinda fishy.",
            "21 years as a home inspector here. Your inspector has no business giving you that advice and likely violated several standards in the process. \n\nIt looks like you're in a townhome which is more common for this to occur due to the reduced air flow in the stoic since you're only getting airflow from the front and back. Several other factors can contribute to this. This is generally superficial in nature but you usually have an underlying air flow issue that needs to be addressed. \n\nThat said, due to the way air rises up and through a house and attic this is generally not a health concern. It's very hard to pull that air down into a living space where it can affect occupants. However, in a perfect world you never want organic growth as when you go to sell in the future you might have a buyer with an inspector like yours that over stepped and over alarmed their client. Realistically this can be treated by a GC for less than half what your inspector dreamed up. Have your realtor get you quotes for treatment and make sure they address casual factors and price warranty. If you really are in a townhouse you may need to involve the HOA to properly address.",
            "Home inspectors shouldn't be giving that kind of advice.",
            "Get a price to have the mold remediated and the problem (bathroom fan?) fixed. Offer that as your concession. 10k is their first offer. Counter it with something concrete.",
            "Why is nobody in here talking about the fact your attic looks fine?\n\nIs your living room in the attic or something? Nothing about this looks like a problem",
            "That inspector was in the wrong for suggesting you take 10k off the price. Now the buyer has that price figure in their head and will not be happy with anything less than that. Additionally, if yo do fix the issue and submit a $5k receipt, they’ll think you got the cheapest contractor.\n\nComing from a recent buyer, prepare for the buyers to walk if they don’t get what they want. But don’t lose $10k over this.",
            "Roof sheathing is OSB?!?! My Floridian contractor brain can’t comprehend this",
            "The inspector personally told you that? My assumption is the buyer wants 10,000 off and is using this as leverage so they’re not the bad guy.\n\n“Oh the inspector told me this should be $10k off” sounds better than asking for the reduction outright",
            "Where did you get the idea that the inspector said to take off $10k? Did the buyers or their realtor say that? If so, it doesn't mean anything other than they want a flimsy excuse to knock the price down by $10k. \n\nThat mold could easily be from something that was already fixed, it's doesn't appear to be very significant. The mold discoloration wouldn't go away unless it was cleaned, and most wouldn't bother with something like that if they fixed the moisture intrusion that caused it.",
            "I personally think it's a bit weird, and a bit inappropriate, for the inspector to be telling you anything related to cost.\n\nThe procedure that is most fair and equitable is for your agent to provide the listing agent with the report, and for the two of them to work together to get three quotes from different contractors, average the value, and subtract that from the list price. \n\nThis is assuming the seller is willing to lower the price over the mold, which is not a given.",
            "The proper path is to have a mould remediation company do a site visit and provide a quote. Then negotiate from there. In my area, that's 2-4K unless the sheathing is rotted.",
            "Get an inspection by a mold remediation company. They will be able to tell you what needs to be done and how much it will cost. Then negotiate.",
            "Too bad inspectors aren’t equipped or licensed to properly identify mold. This happened to us when selling years ago. The inspector wrote ‘mold’ and it’s just a trigger, leaving the buyer open to making a request, but that’s all they can do. If they ask for a mold test you can allow it, might give everyone peace of mind. \n\nWanna know what happened when our buyers tried that with us? We paid a restoration company to ‘sand and vacuum’ the spot in the attic. Then they ‘sealed it’. Nothing looks any different. It was caused by a disconnected exhaust vent from the dryer (second story laundry room). The attic looks the same, smells the same, feels the same. Not one mold test performed. The buyers accepted this. Cost us maybe $300.",
            "Just had a deal go south due to the same thing. Not that it had to die, but there were other factors and the mold was the buyer's \"out\". \n\nLooked just like this. It was due to poor air flow. Needed remediation and then the fix to prevent it was just to pull back the insulation and put in more baffles.\n\nThe quote we got came in just under $5k for remediation for about a 1000sqft house (Michigan). It included a night work premium, as the company would not work in an attic in the daytime in the middle of summer. \n\nGood mold remediation companies will probably not just do some kind of quick fix. They want to do their best so that the issue will not reoccur. The buyer should get multiple quotes for the remediation in order to inform the credit/reduction. \n\nTo answer \"whose job is this?\"\n\nInspector: identify any defects in the house, including possible environmental hazards. \n\nMold remediation company: provide a recommendation for remediation and quote the cost.\n\nBuyer's agent: recommend to buyer how to address this with seller (price reduction, credit on close, fix the issue, etc). Communicate with your agent to negotiate.\n\nYour agent: communicate with you. Explain the findings and their implications (difficulties selling if it goes back on the market as-is without remedying, being required to disclose presence of mold if buyer walks). Negotiate on your behalf.",
            "Standard, home inspectors are a negotiating tactic, your real estate agent should have prepped you for this. First step is to decide if you tell the buyer to pound sand or open negotiation. Second is to get your own inspection and quote to fix. Then either decide to fix it yourself before sale or offer the price to remediate to the buyer as a concession and have them deal with after the sale. Simple.",
            "Home inspector with a background in mould remediation. Get a quote from a remediation contractor, fix the moisture / ventilation issue. 10 grand is an arbitrary number the buyers realtor pulled out of their ass.",
            "Some buyers will ask for a price reduction but will not perform repairs and remediation after the purchase - they think they pocketed the money, but in fact, they ignored something that could kill them. \n\nHow much does mold remediation cost around you? You can reduce your price by that much (it’s the money you’ll spend anyways to remediate the mold before the next person sees it if these buyers walk).",
            "I just sold and had mold remidiated in basement and attic. Cost me 3k",
            "10K should be considered to be a ballpark estimate. Tell the seller that you found mold, and tell them that you need some more time for the inspection contingency because of it if they do not want to give you more time on the contingency tell them $10,000, and then schedule some more people to come by to give you a better estimate.",
            "You should ask them to pay for a remediator that you both agree on, and get an estimate from them.  And the seller should accept the deal and pay for the remediation.\n\nAs soon as you tell them, if your deal falls apart, they're legally obligated to disclose it to any future buyers.  They won't. They'll remediate it themselves... at about that price... before they go trying to sell it again.  They'll be right back where they were.\n\nPick a remediator you both agree on (or have your agent do it), otherwise they will get the cheapest, and worst remediator available to do the work.  And you don't want that either.\n\nFurthermore, this moment, with nobody living there, and no furniture in it, and a ready pool of cash waiting to fund fixes, is the BEST POSSIBLE time to do the work.  There's still a bunch of time before you take the keys and move it.  Might as well do it now.\n\nIt's not your fault, and you're not \"asking\" for anything.  The house is worth 10 grand less than everybody thought.   It is what it is.  The 10 grand is going to be paid no matter what, and it's going to come out of the seller's pocket, no matter what.",
            "I don't think it's personally fair for the inspector to suggest a price to knock off. \n\nIf an issue like this is found, I typically would recommend having a mold remediation company or three give a quote on the work, then take those quotes to the negotiation table.",
            "This is BS. There is bad mold and not bad mold. Get a different inspector now.",
            "Counter them with: \"No\"",
            "I would be very suspicious of an \"inspector\" saying something like that.  Is he shilling for business?  Is the $10K gonna go to him for remediation?  Then, he's not an inspector, he's a contractor fishing for work.",
            "It's all business when it comes to buying a house. Has this one been sitting on the market for over a month and yours is the only offer? Hell yeah. The sellers are committed at this point and don't want to have to list it again. Take advantage of this opportunity to save yourself $10k. But if it's a red hot market and they think they can do better than $10k less than your offer if they re-list, they will balk at this.",
            "Idk your state but it in New York, the seller HAS have it remediated, inspected and notarized before they can sell to ANYONE before it can be sold.\n\nOur 2400 sq ft house attic/crawspace ( had to cut access holes, not actually livable just the space above the house) cost 11k. As a heads up.",
            "$10,000?!?!?\n\nYou could hit that with a bottle of bleach in an hour for $5 \n\nA $500 attic fan would eliminate the problem forever",
            "I would recommend getting a different inspector. They only provide an opinion, and should never recommend anything. I took a home inspection course and they say this multiple times within the course.",
            "Any inspector with eyes will find that you have mold in your attic. It will have to be addressed prior to a sale, either through remediation and fixing the source, or knocking the price lower. Your call what's easier.",
            "At least he included it in the report. My inspector said it was \"moisture\" on the report. I had to spray it all with chemicals a few months later",
            "I don’t see the mold on my phone. But it doesn’t matter. If you’re sure, then give them a copy of PART of that inspection and make sure the RE agent selling it gets it. Now (at least where I live) they HAVE TO DISCLOSE, as now they know there is mold. So they legally have to tell anyone else who makes an offer. \n\nBased on where you live, your mileage may vary. But I’d say it’s a strong bargaining position.\n\nEdit: is that gray stuff, all of that gray stuff, mold?  If so, I’d tell them in writing and then run, unless they remove and get it in writing first. No way would I buy into that. Who know where you cannot see it? These are your lungs we’re talking about",
            "The home inspector's job is to come into your home and make you a list of things, such that you can go to the seller and say \"man this place is a deathtrap, we should probably cancel, it's going to take $25k\" and for the seller to say \"I dunno man, it's been working pretty well for us the last 10 years, maybe we could give you $2k to help fix that\" and you say \"man we could never buy this house without $6k\" and they say \"$4k or we walk\" and you get a $4k discount.\n\n  \nSo, the guy says there's $10k of work to be done in the attic.  Tell the seller you want $10k in credit.  They'll offer you half.  Take it.",
            "There's a lot of new building science going on regarding mold. In cold climates, the winter air doesn't hold enough moisture to dry an attic, and one current recommendation is to put a vapor barrier between the attic structure and the drywall below in an unconditioned attic. Also, insulation like Rockwool which doesn't lose it's value when wet. The source of the water is from the house below, either through air leaks or leaky vents, or both. The attic hatch also needs good air and water vapor sealing.\n\nNow, you could just remediate the mold, but it will come back unless the source of the excess water is removed. You aren't going to get the value of fixing the house correctly, and the buyers may be unable to afford to fix it correctly. All houses of the same age will have the same problem in the same climate.\n\nAs far as the price, I expect $5000 would be on the high side, but not by much, based on a sampling, lab test, remediation, and retest estimate from the east coast I saw in the last week. Splitting that cost would also be another possible approach. \n\nIf it's not a cold climate, there would be different possibilities, such as conditioned attics, and possibly a standalone dehumidifier.",
            "so did you hire the inspector or did the purchaser?  if they did, why is he talking to you?  if you did, why is he talking to the purchaser?",
            "What system is up inside that hole in the roof decking?",
            "If I were the buyers, I’d negotiate hard. You legally have to update your seller’s disclosure if they walk away now that you know you have mold. And if you don’t and the next buyer’s eventually find out, you’ll have a significant lawsuit for failure to disclose.",
            "Good luck in this market getting anything for that",
            "Just a side note, when I bought in 2022, I would have been told there would be no price reduction because homes were so in demand. They weren't fixing anything.",
            "Taking 10k off the price doesn’t fix the problem if it’s a problem. Or expect a friend of his can fix the problem after you take possession with a price drop for an unreasonable price .",
            "Make sellers if you can. Taking 10k off your mortgage doesn’t really help you if you have to turn around and spend 10k cash.",
            "Never heard of professional home inspectors suggest anything like this . Only ever experienced a full report and maybe that an issue would be normal wear and tear . A/C unit is 16 yrs . Should be addressed asap. Roof flashing not sealed to chimney.",
            "Tell them to fuck off - they want it believe me.",
            "Is the mold the white areas on the wood?",
            "When I bought my house 15 years ago. The bank insisted on the seller to remediate before they would allow the closing to continue.\nThey didn't have proper ventilation. When I had the roof replaced, I installed a ridge vent.\n\nCheck to see if they are venting the bath or dryer into the attic. If they aren't, then you have an air circulation issue and will need to address. If they are, fix immediately.",
            "As someone who inspects attics daily for energy audits, we aren’t legally allowed to call things mold even when it’s obvious mold. We can only say moisture damage and recommend it get tested. I would pay for the test out of pocket and then use the results at the negotiation table.",
            "Did they do an air test , if I was seller . Be like piss off",
            "I don’t think he should be stating that it’s mold or giving any kind of advice on price reduction.\n\nIn MA we have to call it “mold like substance” and tell them to have it tested to confirm.\nI’m sure it is mold tho.",
            "I had exact same mold problem when my bathroom vent was venting out into attic. Hot moist air vs February cold snap, it was literally raining in the attic. \n\nStep 1: find source of warm air intrusion into attic. Probably bathroom vent. Fix it. \n\nStep 2: remediate the mold. \nI remediated this myself with a respirator and a mix of boron and vinegar. 5 years later no issues.",
            "I say yes. I had mold in my attic, from one end to the other and it was $8k, in 2021, to have it taken care of. Involved the removal and replacement of the insulation and they basically sandblasted the surfaces to remove the mold (it wasn’t sand, more like the consistency of baking soda). We also fixed the venting issue and have had no further problems.",
            "That attic needs to breath. You'll be spending some money doing that",
            "the seller probably wouldn’t fix the root problem",
            "I used to do mold remediation for mortgage companies and the only proof they needed was a picture. Make sure you see for yourself that a proper job is done",
            "No home more than a year or two old is in perfect shape, most homes that come to market have some kind of issue.  In a seller's market - which this surely is - buyers have leeway to put in an eye-popping offer knowing they can knock a few pegs off in the inspection.  It really hardly matters what the inspector found, as he will find something; it's just part of the game as it is played by buyers (and mostly buyers' agents, for that matter.)\n\nThere's no switching buyers to avoid this issue; once their inspector finds it and you hear about it, it becomes something that must be disclosed.",
            "That's why before putting a house up for sale I recommend people get an inspection to know what kinds of problems already exist so that they can take those costs of remediation into account and include that in the price and dickering room. It makes it much easier to know in advance what pushback buyers are going to have.",
            "The ask should be what it will cost to fix the issue causing the mold + the cost of new plywood (basically a new roof)",
            "Hire a mold remediation company and get a quote during your grace period.",
            "I look at as \"who paid the inspector\".  As a buyer, if I pay an inspector and the inspector says \"I found this, it's going to cost 10K to fix, you can ask to lower the price\".... well, that's what I paid him for.\n\nThe SELLER doesn't have to accept my request... hell, seller might have gone \"Yeah, it's an older home, I already included that in the price which is why it's not 10K more\".\n\nAs the seller, you can tell them to pound sand.   If the inspector the BUYER paid for goes \"This place is haunted... don't buy it all\" what's it to you?   You didn't pay for it.    Up to them if they are going to lose out on the house because of it.\n\nNow if its NEWS to you that you got mold, and you think its a fair offer, then accept it and move on.",
            "Laughable",
            "Where I live, if you did this, you 100% would not be getting the home. Most people are waiving inspections. \n\nAlso my attic had this as well and it’s treatable with chemicals. Obviously it will need replacing at some point.",
            "Doesn't hurt to ask. \n\nBut 10k is the price of a new roof, a jug of bleach is $5 and that will kill it. \n\nIf it's a roof leak causing the mold...",
            "Looks like a roof leak to me. 10K sounds like a lot but it probably isn't probably a couple thousand to get it remediated properly + what ever it costs to fix the source. It is possible it is the blow in fiber blocking ventilation holes but due to the somewhat contained location, my bet is a roof leak. Can try for 10k and accept 5k if that is the counter. You can probably can deal with it for that depending on local rates.",
            "Home inspectors are nothing but a negotiating tactic. Your home inspector has supplied you with your negotiation tactic, that's all he was ever going to do, his job is done. Use it or lose it.\n\nIf you want a rational real estate market where sensible people can make fair and informed purchasing decisions that consider meaningful future expectations with realistic values for things, you'll either need a time machine or a miracle.",
            "Yikes. I had mold remediation in my entire basement for $900. But I had a mold specialist do that part of my inspection and it sounds like your issue may have been worse. We didn't have to remove anything except a few randomly placed insulation pieces.",
            "As a buyer I would prefer a price reduction to see remediation. The seller has an incentive to do the fastest, cheapest, minimum job they can get away with. If I do it then I'll pick someone who's going to do quality work.\n\nThe good contractors aren't available within the 30 day closing window.",
            "By a mold remediation company with warranty",
            "As a seller I would take $10k off for it not to be my problem. Home had already skyrocketed in value, why not let the next owner play contractor roulette?",
            "Same. Inspector found mold because bathroom vent had detached from the roof so it was venting into the attic. Seller remediated and fixed the piping.",
            "> I'd probably go the route of asking the current owner to remediate the issue and provide proof of remediation\n\nAs someone who has been burned by doing this. Never do this. \n\nInstead, get an estimate and then a check for the amount to repair the issue cut by the seller at closing. Then you do it with that money. You will have a warranty with that company instead of the previous owner. You will not pick the cheapest possible company to do it.\n\nAlso, if you do a price reduction instead of a check at closing, you the buyer does not automatically have the cash to pay for it.",
            "yeah as a seller, this is 100% why you want to just give someone money. Way easier to say, he's 10k (which was all profit anyway), it's your problem now.",
            "> He is there to inspect, not be part of a real estate transaction. \n\nIt depends on what OP asked for. My house had foundation issues and needed a lot of repair. I specifically asked my inspector to give me what's needed and a ballpark cost, and that really helped me understand what to expect. I had quotes to superficially repair for $7k, to a company tried to squeeze in a full kitchen reno for \"at least $100k\". Settled for actual repairs for $21k.",
            "As an inspector,we were advised against giving any kind of cost estimates, because of liability. While it’s not hard to know what a water heater costs, it’s quite another to give accurate estimates for things like foundation repairs, etc. the reasoning was what if we gave an estimate of say $5k for a given job, but after getting quotes from contractors actually qualified and willing to do the job, the quotes came back in the $15k range.\nAlso telling a client to ask for $10k is getting uncomfortably close to practicing real estate, which is prohibited unless we had a RE license. \nIt’s standard practice for home inspectors to refer clients to qualified and licensed professionals to get quotes, and not just throw numbers out there, or tell clients how to deal with their contracts. The basic requirements for inspector is to be unbiased, and telling a client how much to ask for a defect is definitely not unbiased.",
            "Anyone can ballpark anything if they've got enough knowledge. When I sold my house there was some mold in the attic, and I was able to ballpark the cost of remediation to within $10%. I don't even do remediation professionally, I've just been around it for nearly 20 years.",
            "Realtor's job.    Ha.   Those guys do nothing.  They have one goal;  close the deal as fast as possible.  That means bring the buyer price up as high as you can and bring the seller's price as low as they can.   \n\nI hope there are some Realtors on here.   Lol.  You are leeches.   Big up, big up,   it's a stick up , stick up.",
            "Some inspectors have either the experience, information, or contacts know how much it would take to fix various things in a house but yes that doesn't necessarily equate 1to1 how much someone should put an offer in for.\n\nIf an inspector used to be an insurance claims adjuster they have a pretty good idea how much it takes to fix something and who to go to fix it.",
            "Any inspector that prices home repairs shouldn’t be an inspector. \n\nMy dad was one for almost 40 years and he never once gave an estimate. Just \n\n“These items should be looked at by a licensed contractor due to what the inspector found.”",
            "This is 100% correct.  Those photos are inconclusive to the naked eye, and it may simply be mildew from poor attic circulation and humidity.  After the industry wide mold litigation panic in 2005, it can be very costly to assert the presence of mold if it is not tested.",
            "I think there’s a king of the hill episode about this in tx.",
            "It's definitely a *mold-like substance.*",
            "Mold remediation could be done with chemicals.   I've had a customer treat an entire enclosed, unvented attic with unvented bath fan without replacing plywood. \n\nBlack mold on every inch of the sheathing. Only ran them a few grand.\n\nI added vents for the attic space and directed the bath vent outside, and it was effective.",
            "What product?",
            "It sounds like OP is selling their house and the buyers came to them saying this is what the inspector said. I also read it the other way around at first.",
            "Plenty of much more insurable places than Florida allow this lol.",
            "laughs in purlins and a metal roof in PA, no OSB or sheathing on my house LOL",
            "Nor does my Louisiana brain.",
            "I'm an estimator for a remediation company. I'm also a triple master restorer which means my company does things exactly by the book. \n\nThere's no way this is a 10k job unless this is a ridiculously huge sized attic. Your ballpark is bang on for our pricing in our working area of Chicagoland. We charge an inspection fee, but there's companies that give free estimates and remediate for less than we do as well.",
            "To make completely sure that there is no bias, hire an independent mold inspector, one who ISN’T attached to a remediation company. That way there is less/no motivation for the inspector to upsell a remediation service that may not be needed",
            "I may be reading wrong, but my impression is OP is selling, it's the buyers inspector who found the mold in OPs house",
            "OP is seller and balking at being asked for 10k.",
            "The purchaser’s agent will share this info with the seller’s agent, who will tell the seller.",
            "turtle vent?",
            "It certainly helps. It’s very common to ask a seller to either fix a problem or discount the sales price so the buyer can fix the problem.   Happens everyday.  The seller then decides what they’re willing to do, maybe nothing.",
            "Gray/black.",
            "If you pay for that test, OP, you’ll be paying for your buyer’s negotiating ammo. That fungal growth may be very common and likely not harmful but it’s still fungal growth.\n\nThe $10k number is almost assuredly high. Treatment with an antimicrobial fogger like Concrobium or a fungicidal lacquer based primer like Kilz should be relatively cheap unless you’re in one of the most expensive markets in the country. Do that yourself or get a (cost effective) bid and negotiate down from that fanciful $10k number.\n\nEdit: Paragraph break, fogger not digger.",
            "This does not need new plywood or a new roof… lol",
            "Most people are idiots and are going to be chained to a rotten 400k house at 8%.",
            "OP is the seller",
            "Bleach alone won't work, and doesn't correct the cause, likely a bath vent or improper roof venting",
            "You know what bleach does to mold? Look it up.",
            "10k is the price of the roof LOL",
            "Good point. I'm house hunting now. See what I though would be a really cool house. Took the tour. LOTS of mold and mildew. While we didn't get into any serious discussion about purchasing, the owner said, I kid you not!, \"I gotta guy.\" A post-tour with our agent brought up that very point.  They'll just put lipstick on that pig, so to speak.",
            "Something I was told when I bought my home is “No one is as invested in your home than you.” So assume if you can do it yourself you probably should because you’ll take the care it deserves.",
            "for sure, they are doing it the cheapest way possible. Also, it may only be a few bucks more to fix or upgrade other stuff while you're in there.",
            "maybe where you are. I was on the buyer side of this and it took less than a week, I got the receipt, and I checked the company that did it.\n\n>As a buyer I would prefer a price reduction to see remediation\n\nI'm sure you would! If you asked me to drop my price by 10x or more the cost of remediation, I'd send you away and move onto the next buyer. Buyers who try those kinds of tactics are exactly why I always live in high demand areas.\n\nI had a sale contract that included appliances once around 10 years ago. My oven crapped out 2 weeks before closing so I was forced to either repair it OR replace it with an appliance of equal value. The repair cost was $500. I flat out offered to write a cheque to the buyer for $500 to just forget about it and they said \"Um we feel that oven is worth $2k\" lol it was not, it was a cheapass model you could replace new for less than $1k AND they had already let slip they were going to buy all new appliances anyway.\n\nMy response: \"ok cool, I'll repair it as per the contract bye\". When the morons realized they could've just had $500 in their pocket they tried to accept my offer they initially tried to fuck me on. I waited until after the repair guy finished and went sorreee too late. I'd rather the repair guy have that money than them. I have no patience for dbag buyers because well, I don't have to.",
            "you'd be losing 10x more money from your sale than the cost to remediate. I don't need to explain this further I hope.",
            "My bathroom vent vents into the attic 😬",
            "> I specifically asked my inspector to give me what's needed and a ballpark cost\n\nI asked the same thing and the inspector told me I'd need to consult an expert in the field.\n\nIt feels like the inspector is (close to) stepping out of his lane by attempting to provide that information.",
            "> what if we gave an estimate of say $5k for a given job, but after getting quotes from contractors actually qualified and willing to do the job, the quotes came back in the $15k range. \n\nI don't see how that is your ethical or legal responsibility to offer that. You are an inspector, not a contractor. You aren't doing the work, so how could you possibly know?",
            "Depends on the individual in my experience. First two realtors I worked with were kind of just going through the steps bare minimum, also pushy and frankly not very knowledgeable . Recently I moved for work and the company has a local realtor (buyers agent) who is a fucking shark and saved us a lot of money while reducing her commission.",
            "Yeah... except the inspector is on the hook if it costs more than 10k to fix. \n\nHim saying that like that makes him liable for the issue. \n\nHe should just say mold was found.",
            "Had a very similar experience, no plywood replaced though ours doesn't sound like it was as bad as your example. Few grand.",
            "Once the mold gets into man-made materials it's difficult to get out with chemicals",
            "RMR-86 Pro",
            "That's even more weird that the inspector that the buyer hired is speaking to the seller directly.  Who is this inspector?",
            "Oh I know, but OSB is so flimsy I’d be afraid to walk the roof while sheathing it. It’s always shocking to me to see it used in structural settings like roof sheathing or the webbing in prefab wooden I beams/floor systems",
            "Or hire a reputable remediation company. We're too busy to take on work that isn't needed. We've had three inspections in the last week with people who we told didn't need us. There's plenty of work out there to keep us busy, and when we aren't, it's not worth the risk to our reputation to be unscrupulous and do unnecessary work.",
            "They sold you a house..and presented it in good condition.  It was not in good condition. \n\nI wouldn't get hung up on the actual number.  I would have them commit to fixing it before closing.  And then i costs what it costs.",
            "Yeah. There's no house I need bad enough to waive an inspection. But, I'm also the sort to have my own inspection performed prior to sale and will share it with interested parties. I won't sell a place full of mold.",
            "And I’m a dope. I read it wrong. Thanks !",
            "It kills surface mold/neutralizes it.  If the problem causing the moisture has been fixed and the surface is not physically damaged you can certainly use bleach to kill the surface mold.  Obviously may not be fixed in OP case but yeah.",
            "Just did a small 600 square foot roof and it was 25K and that was the low quote out of 4 quotes. If you can get one done for that you are getting a great deal or live in a low cost location.",
            "> the owner said, I kid you not!, \"I gotta guy.\"\n\nOk, well then call your guy. Why is this still a problem? :p",
            "Buddy, you're an asshole",
            "Depends on how that’s remediated, which requires more inspection than we can do from these photos. Might be a spray and walk away, might be “remove all the wood with mold on it”, which means the entire roof gets redone and maybe some of the rafters. Probably somewhere in between. If I was selling this house I’d be glad to give away $10k to have it be completely someone else’s problem.",
            "Thank you u/BredYourWoman, very insightful.",
            "Pretty common in old houses in my area. 40 years and no mold whatsoever.",
            "So does mine, but a previous owner ran it up to the ridge vents. Just monitor your humidity, get a dehumidifier and do an attic walk-through once a month.",
            "My inspector has an additional paid service that they send the entire report to specialists in each field and they give estimates on repairs for everything called out in the report.",
            "Yeah I mean the inspector may even understand the full repair involved, but to ask them to estimate labor and materials prices that have fluctuated wildly in the last few years is pretty unfair.\n\nI don't think they're stepping out of their lane if specifically asked.",
            "To clarify I asked this specifically when I called them to schedule an inspection... There are foundation issues and if they are experienced enough to provide me a ballpark. Had to pay extra for them to crawl 20 minutes in the mud in my crawlspace but worth it IMO.",
            "If the inspector knows the agent (and/or wants referrals), $10k could be on the very low end or possibly not even cover it. They shouldn’t trust that number at face value and definitely need to get some quotes. \n\nMy inspector was honest when my dad (edit: retired builder) called him up and leveled with him about downplaying the amount of damage, but asked that I not tell my agent.",
            "My point was that inspectors should not be giving cost estimates, and certainly not giving advice on how to negotiate real estate contracts.",
            "Yes, not with surface cleaner like just bleach.  It needs to penetrate the wood as well, which requires some other solution. I.thoight the same and recommended full rip and replacement  before a remediation company came and treated it.\n\nIt may be an inhibitor. I just knew I didn't want to rip and reroof the whole thing nor get that mold all up in my lungs\n\nActually, it's encapsulation",
            "This stuff.  I used it in my attic also.     Washed it away on contact. no scrubbing.  \n\nMy attic got moldy from heated interior air leaking into attic through an unsealed ceiling (stick on tiles over untaped beaverboard)   It had a couple holes in it too.   Hot air into cold air and RH goes to 100%, then condensation.   Notice OPs pic, no ridge vent, or gable vent, and no mold around the box vent.",
            "Googles…\n\nSodium hypochlorite + a few other ingredients…\n\nYou basically used bleach.",
            "3/4 OSB at 16” on center is fine. 1/2” not so much. 24” on center not so much.",
            "You have the situation backwards poster owns this house and wants to sell it",
            "For non-porous surfaces, yes.  Try and remember back to 7th grade science class.  Mold has roots.\n\nYou'd have to literally saturate that plywood in bleach to kill the mold and then you'd just be left with a soggy roof and more mold in a few days because bleach is 90% water.",
            "May I ask state, or major metro area? Also, anything special with the roof? Or did things go buck wild?\n\nWe did 1.8K sqft in Florida with a new chimney surround for $11.2K 2 years ago.\n\nEdit- 11.2 not 112",
            "Because I don't let myself get scammed by assholes? I'm cool with that. Someone's bitter about their situation. I've been on social media long enough to know every single downvote on that comment is from bitters who don't have that option and that's fine. Downvotes don't affect this account but if that click gives them some sense of tapping the cage lever for a food pellet instead of having options, who am I to deny you?",
            "Yea, I mean... if i were the seller, I would also be concerned about this... and would probably just say \"$x and it's your problem buyer\"... but as a buyer, i'd prefer it be remediated, for exactly the same reason... it could cost a lot more than expected, and managing the process / oversight. Luckily for us it was a pretty quick fix, the remediation cost like $1200 and took a few hours. Paperwork arrive the following week, everyone was happy.",
            "You’re right about letting the buying deal with it. But it’s the inspectors job to look at all that. They won’t suggest 10k off of it could turn into a 100k job if whole roof needed replaced.",
            "the odds attic mold being that extreme are incredibly rare. As in near-zero, that's why I didn't bother mentioning it. Lots of people actually have this for years and don't even know about it. As for the photos, no way that's an expensive fix, I disagree with you on that\n\n>If I was selling this house I’d be glad to give away $10k to have it be completely someone else’s problem.\n\nyeah by losing $9k. Not good advice. Reddit can be helpful for some things but the comments here illustrate how bad Reddit can be for advice too",
            "yw :)",
            "It's typically OK until people start filling the attic with junk and it no longer ventilates properly.",
            "Once a month?? Who is regularly going into their attic on a monthly basis?",
            "Heh, I shoot mine up into a nearby turbine vent.  Just a placeholder until I get a new roof with dedicated bathroom fan vent.",
            "...Okay? Yeah he used a product meant for killing and preventing mold. He already told you that.",
            "like 17% bleach vs the stuff at the store which is usually well under 3%.",
            "HA!  so i do.   Ok. well it still stands.  Hes probably going to be on the hook to fix the mold. He still owns the house.",
            "Low slope, torched on roof in the Vancouver area. US prices for comparable roof should be about 20% less I would guess. Ours was completed 15 month ago. Repair included full wood sheeting with 1/2\" plywood, and some rafters had to be replaced due to rot. Four exact units were done with the total bill being 102k.",
            "That’s an upvote from me, dawg",
            "Is u/op the seller or the buyer? It really comes down to how much the seller wants the sale, and how much the buyer wants to purchase the property.",
            "nah. even if you fix it, the buyer can still come back and say nahh, not good enough, i'm walking away. Who knows what this house is worth. Seller could also push back and offer 3 if you think it's only a $1k fix. They could get a contractor to look. If the contractor says its' $1k, offer the buyer 2 with the quote and walk away.\n\nClosing the deal is worth the $10k cost for sure. That's maybe 1% of the value of the house in a lot of areas. \n\nThat's OSB. If it's mold from water damage, you could easily be looking at $25k for roof.",
            "> yeah by losing $9k. Not good advice. Reddit can be helpful for some things but the comments here illustrate how bad Reddit can be for advice too\n\nExactly. The market is hot. Frankly, as the seller I would call bluff and let them walk if it's such a massive problem for them. Surprised they even accepted an offer with an inspection contingency.",
            "Someone who had to move years ago because of mold. It takes 10 minutes. It's honestly crazy that we spend hours a week on our lawn but happily ignore all the things that could go wrong in the attic.",
            "OP is the buyer.\n\nAnd I can go both ways on it from a buyer perspective. \n\nHow much do you trust the seller to do it the right way instead of just enough to say they did? If they didn’t, you *could* go after them, but at minimum you’re paying a lawyer for the chance of getting your due while also dealing with the complications and having mold in your home and having to redo it.\n\nOn the other hand, do you want to risk asking $10k and later finding out it’s going to be $40k for a whole new roof from the OSB up?",
            "If that buyer walks, you better hope your backup offer doesn't wonder why. In a lot of states, you are now required to put that mold on the disclosure docs, which is going to scare off all your potential buyers. Taking the $10k loss is worth it vs losing the sale and finding out the next offer is 50k less.",
            "Agreed entirely.",
            "Let me say this for the people in the back..... every house has mold. Frankly, I would find it strange if it *didn't* have mold. If you have a lot of it, the mold is a symptom of some other problem. From the pictures OP shared, I wouldn't think twice about it. You want a new roof too? What about a microwave allowance since it's a bit scratched? Couple depressions in the driveway.... needs to be resurfaced ASAP as well.",
            "Sold a house last year.  One good offer came in no contingency but the buyer wanted the house tented, parts of the roof redone, and some things repainted to their spec - by me, the seller, prior to closing.\n\nI suspect the buyer didn't know how things are done in my small town, which is to say, late, shoddily, and over budget, usually breaking something else in the process.  I told that buyer to take a walk."
        ]
    },
    "2013 New Build - Loud AC Unit": {
        "title": "2013 New Build - Loud AC Unit",
        "score": 2,
        "url": "https://www.reddit.com/r/HomeImprovement/comments/1dlv7v0/2013_new_build_loud_ac_unit/",
        "content": "Hi - My AC has always sounded loud since I built my home. I don't believe it's the A/C unit but most likely cheap build materials and lack of sound proofing. What's the best way to dampen the noise? Would installing sound proofing into the basement ceiling help?",
        "num_comments": 1,
        "comments": [
            "WHy would insulating the ceiling help?"
        ]
    },
    "If I have a non standard exterior door frame size do I have to replace the frame before buying a new slab?": {
        "title": "If I have a non standard exterior door frame size do I have to replace the frame before buying a new slab?",
        "score": 4,
        "url": "https://www.reddit.com/r/HomeImprovement/comments/1dlr1m8/if_i_have_a_non_standard_exterior_door_frame_size/",
        "content": "I’ve tried researching this and I’m getting so confused. My exterior door frame measures 36 wide by 78 and 5/8ths high. My understanding is this is a non-standard size. Am I better off replacing the entire frame and getting a standard size slab and a professional to install it or should I order a custom slab door and just replace the door itself? I can’t really seem to find where/how to order a custom door that doesn’t also come with installation. From what I’ve looked at online the frame appears to be in fine shape, but the door itself has warped and is more narrow on the bottom than the top leaving large gaps. \n\nI have called a few local places (PNW) and have been quoted $4,000 minimum - which is blowing my mind (way more expensive than I expected) - but that’s how every project goes I guess. \n\nAny advice anyone can offer? ",
        "num_comments": 4,
        "comments": [
            "Why can’t you just buy a 36”x80” door and saw off 1-3/8” off the bottom?",
            "Take a little off the top and bottom of an 80” door. Sometimes there’s not enough solid material to take a whole 1-3/8” off one end.",
            ">  Am I better off replacing the entire frame and getting a standard size slab and a professional to install it or should I order a custom slab door and just replace the door itself? \n\nThe frame is called a jamb. Door slabs are fitted to the jamb. The two together, pre-fitted, are called pre-hung. You don't want to do them separately typically speaking. \n\nHave you pulled the casing off the interior side above the jamb? Do the jack studs run all the way up to the header or is there a filler? As in, how hard would it be to make the opening a standard height. Typical rough out height for a exterior door is 82\", however you can get get away with 80 3/4\" to 81\" depending on brand.",
            "I'd imagine because exterior doors aren't intended to be cut to height. You'd be cutting off the the weather strip mount and most exterior door are just foam for the core."
        ]
    },
    "Dryer not drying ": {
        "title": "Dryer not drying ",
        "score": 2,
        "url": "https://www.reddit.com/r/HomeImprovement/comments/1dlt2l4/dryer_not_drying/",
        "content": "We have an annoying as hell Samsung dryer that on its best days has to go for two cycles to dry a load. Sometimes during the second, its sensors will tell it it’s dry and just turn off again after like 5 mins. Should I just replace this? Or get a repair man out? ",
        "num_comments": 9,
        "comments": [
            "Have you cleaned the dryer vent exhaust? Should be a yearly chore.",
            "Is it getting hot at all? I've had to replace the thermal fuse on our Samsung three times. It could also be a bad heating element, had to replace that twice. Both are available on Amazon cheap and there are plenty of YouTube videos to show you how to test and replace.",
            "We only run our NG Samsung dryer on Timed Dry. As long as our dryer duct is clear and the outside vent grate is clean we don’t seem to have an issue.",
            "Can you set the dryer to sense for a higher level of 'dry'?",
            "Dryer moisture sensors often stop dryers early, in order to get a better energy rating. \n\nYou get around this by running timed dry, or another setting that ignores the moisture sensor.",
            "First, Samsung dryers are garbage.  \n\nListen to the folks here who gave you advice on what items to look for like the fuse and the heating element.  If you are handy at all, you can make the fixes yourself and save money if you can find the parts.  Just unplug the dryer first.  See how often you have to make repairs and what you point is for just replacing it.",
            "You can probably replace all of the dryer parts on your own. The parts are relatively cheap and the biggest hassle is getting to them so I would order a dryer heating element replacement kit and swap everything out. The kit for my Samsung dryer was maybe $30.",
            "Yes we had our plumber clean it out like 2 weeks ago :(",
            "Make sure the grate outside where the vent exhausts to is clear. After cleaning the vent line,  lint that was loosened up can clog that."
        ]
    },
    "Just bought a trailer home on a rural rented lot. Turns out the overgrown lawn is hiding multiple garbage bags full of human feces. ": {
        "title": "Just bought a trailer home on a rural rented lot. Turns out the overgrown lawn is hiding multiple garbage bags full of human feces. ",
        "score": 799,
        "url": "https://www.reddit.com/r/HomeImprovement/comments/1dkt1vf/just_bought_a_trailer_home_on_a_rural_rented_lot/",
        "content": "How the heck do we even start to dispose of this? I’m assuming it’s a biohazard. There are just big black garbage bags half buried in the grass that are full of human excrement in various stages of decomposition. Is there someone we have to call? Do we just take them to the dump? Where do we even start?",
        "num_comments": 375,
        "comments": [
            "Call your local health department and ask for advice on what to do in this situation.",
            "It's a rented lot.  Can't they make the lot owners take care of it?",
            "Why are you doing anything with it? You don’t own the land sounds like that should be on the landowner.",
            "Yeah,  that's a problem for your landlord to take care of.  You reasonably expected to rent a lot without any material dangers to your health/ giant bags of poo, and they need to fix that.",
            "I also want to understand why",
            "You're going to have to remove them from the bags one at a time and hand place them in the toilet and flush for proper disposal.",
            "Yeah,  that's a problem for your landlord to take care of.  You reasonably expected to rent a lot without any material dangers to your health/giant bags of poo, and they need to fix that.",
            "Fun sorta related story:\n\n\nMy uncle purchased property to build a pole barn out in rural Wisconsin. He called me one day and asked me to come check something out with him. \n\nFor context, we were both police officers at one time, but neither anymore. \n\nI showed up to find a few black garbage bags, the tops twisted around and tied in knots, with duct tape around them, and mostly buried with rocks. \n\nObviously we were both thinking we had just found a body or some drugs. We decided instead of poking around, we would call the sheriff to have one of them come help. \n\nIt was diapers. Lots and lots of used diapers. But not what you think. There were also multiple empty bottles of lube and tons of hand towels.",
            "Does the toilet work?  Were they emptying the trailer waste into the bags?\n\nI have no idea how to handle it, but I'm sorry you're having to deal with it.",
            "LL is responsible to clean the lot, since you just bought the trailer. Call your agent and start calling the LL everyday.",
            "Better than multiple garbage bags full of chopped up corpses, I guess. \n\n(Sorry, just started watching Dexter on Netflix last night)",
            "That stinks.",
            "55gal barrel, 5g of diesel fuel, and a match",
            "I say we nuke the site from orbit.",
            "If the landlord insists it is your problem, tell him you will hire a company qualified to safely remove hazardous waste and deduct it from future rent.",
            "Since you rent, call the health department. The landlord will only do this if told to buy the government",
            "Just curious... How are you certain that it's human?",
            "\"Just poop in the field.\"\n\n\"No, I have dignity. I will poop in my house in a (stink) pickle bucket and then transfer it to a contractor grade trash bag and then throw it in a field on a moonless night. I'm not an animal.\"",
            "If the land owner told you use the dumpster I'd take advantage of that. If you call anyone you might end up on the hook for the biohazard. I don't know anything about your finances but I'll assume a few thousand for biohazard wasn't in your budget. Ideally the landowner would handle it but they're clearly not.    \n\n\nSo what the fuck do you do? If you want to DIY it keep reading.       \n\n\nMow or weed eater the grass short so you can see. Wear boots. Not sneakers or sandals, you don't know what's out there, you want coverage. I'd put on long pants and make sure its boots and pants you might not miss if you gotta toss them.    \n\n\nNext you're going to want gloves. I'd put nitrile on under leather work gloves. The type of mental illness that causes bags of shit is not too far from the type that does drugs. You want protection from biohazard and sharp objects. Should consider long sleeves shirts and if you have any type of eyewear that can double for safety you should grab it. Grab a pair of safety glasses from the local home Depot if you don't have anything. Be it feces or trash you don't want it in your eyes. I know people moan about masks but do you want shit in your mouth or nose? No you don't. Mask up, dab peppermint in it if you're sensitive to smells.   \n\n\nYou will need contactor bags for clean up, buy more than you think you need. And cat litter if you believe it's liquid style. A shovel, a shovel you won't miss if you toss it. A trash bin to hold the contractor bags. You may not get the odor out so again, don't buy something you'll miss, if you can repurpose something that's better.    \n\n\nNow that you're geared up, you gotta survey what's out there. Decide a starting point. Half the battle is knowing what you're dealing with. If you got solids line the trash can with a contractor bag and shovel it up. If it's liquid add cat litter and wait a few minutes. You may need to shovel up and dispose of the dirt around the trash bags. Drop it in the contractor bags. Don't over fill the bags. You can double bag them if it's liquid. Toss them in the dumpster like the land owner suggested. Don't let him bitch at you when it smells like a dumpster full of shit.     \n\n\nIf you can strip off all those clothes at the end before entering the house I'd do it. Put em in a contractor bag, either until you wash em or toss em. Wash hands and shower immediately after.    \n\n\nI'm not your doctor and not here to lecture but if you're into vaccines you might want to make sure you're up to date on tetanus and hepatitis. ",
            "First of all, how do you know it's human? Second of all when faced with *multiple* bags half buried in grass why is your instinct to open and investigate them? Thirdly, why? Just why?",
            "Ew. But also, no, not a huge deal. Throw it away and don’t get it on you. If you do get it on you, apply alcohol: isopropyl for external wounds, grain for internal.",
            "Get one of those flamethrowers.",
            "On a rented lot even if you own the trailer the trailer is not a permanent structure. I’d make it his problem. Call health department step 1 and refer them to your land lord. It’s really a shitty situation tbh",
            "I wonder if the local septic cleaning company would come out and suck it up with their equipment. Not a free option, but I'd want that gone so bad. Sorry OP.",
            "Thought this said \"human faces\" at first. So look at the bright side, at least it's not that.",
            "Shitter was full!",
            "I know it sounds really weird.\n\nBut feces is not treated as a biohazard in hospitals.  It all goes in commode or regular trash.  This is OSHA compliant.",
            "Ok but what does the inside of the trailer look like?",
            "Could you just burn it right in the spot where it is?\n\nEdit: just saw its a rented lot. Fuck that. Make the landlord deal with it.",
            "You sure it's just human crap and nothing more sinister? Definitely call the health dept if you aren't sure.",
            "Wellllp I am no longer complaining about the abandoned lots around our rural house with tall grass & snakes living the dream lmao",
            "Damn, I had to pay thousands of dollars to get my lawn fertilized with poop.  Now I can grow anything on it.",
            "get a propane tank and a flame thrower thing and burn up the bags.  throw lye over the poop and it will degrade.",
            "Get the city, county, or state officials involved. This is a rented lot so all that shit belongs to the owner of the lot.\n\nIf you want to take care of it yourself just wear PPE, cut and dump the bags on the ground. Put the empty bags in another bag and toss it. Hit it with the hose and enjoy the green grass that'll grow.",
            "A former jenkem lab?",
            "I hope it's just excrement and not decomposing bodies. I would call the Health department to at least check it out. Why would someone have bags of excrement?\n\nWhy would they dump them on some random rented lot?\n\nAre they hiding something?",
            "Why?",
            "Just think of it as free milorganite.",
            "How do you know it’s human? How big are the bags? I need to know more.",
            "I’m gonna go out on a limb, did you buy the trailer on a foreclosure sale? Sounds like bitter former-tenants leaving “housewarming” gifts.",
            "Rent a skid steer.   Rent a dumpster.   Deposit in dumpster, along with whatever else you need to get rid of.",
            "\"Turns out\"",
            "Takebacksies? :(",
            "Do you have one of those \"Buy Nothing\" groups where you live?",
            "It’s a rented lot so I assume there is a landlord that is responsible ",
            "I was eating when I read this and just reading it almost made me puke. Good luck",
            "Not your land, not your problem. Don't let the landlord take advantage of you. This is 100% his responsibility. Know your rights!",
            "Try ServPro.  They can dress in Bio suits to pick it up.",
            "Sheeeeeeet...",
            "Set up a trail cam and find exactly where the this shitter enters from. Dig a large pit and fill it with the feces. Cover it with a piece of foam covered in sand and grass. Wait until you hear a large plop followed by screams and you will know you have captured your very own shit goblin.",
            "well, you better pick that shit up before dad sees.",
            "I would gown and mask up. Empty bags into lawn and then rent a massive tiller and blend it in then plant grass seed",
            "Might want to call the cops to bring the K9 unit.  Could be otherwise stuff lurking.",
            "\"DO we just take them to the dump\"\n\n\n... no, someone already took a dump.",
            "Get a tractor and just scrape the backyard honestly. Rent a dumpster and dump it in. Plus you’ll get to level the lot and then reseed",
            "Pics or it didn't happen!",
            "Jesus, call the health department. That might not be the only thing buried there. 💀😬",
            "Riding lawnmower...",
            "Get a dumpster. Put the poo in the dumpster. Have dumpster hauled away",
            "Double or triple bag the new found treasure.  It will fit in the landfill.  It is no more a biohazard than other animal feces, for example, cat litter or dog poo from a walk.",
            "How do you know the feces are human? Taste test?",
            "Maybe rent a port o potty .",
            "How do you know it's human poopy?",
            "Can’t you just turn the piles into compost?",
            "Living the dream",
            "This is why you always poo in the loo\nhttps://youtu.be/l01AMCBG0Wk?si=Ns4a7YeUSIyZQHjc",
            "Shanna? Are you back?",
            "That was me sorry",
            "#fire",
            "I’d be making sure your plumbing is 100% in working order.",
            "Was this from the previous owners or do you have shitty neighbors who you can return the bags to?",
            "Uhmm…. What is the state of the plumbing??? Why were they… doing this? Are we sure this isn’t a crime scene bc wtf. I have so many questions!",
            "Can you rent a backhoe and plow it into deep deep holes?",
            "I don't want to ask, but I find myself unable to not: how do you know it's human excrement?",
            "CTRL+F+U is usual response when people do that to others.",
            "Previous owner a composter?",
            "WTAF?? Multiple bags of human feces? Why?\n\nSo sorry you need to deal with this.",
            "LOL...\n\nObviously humans put it in the bag. My speculation would default to picking up dog poop and leaving the baga rather than assuming it's from  the humans. I could be wrong, of course...",
            "dig a hole, pour in diesel, throw in poop, throw more diesel, set on fire.",
            "You pissoff the landlord and he may evict you.  Are you prepared for that?  Is the trailer in good enough shape to be moved?  Talking to a septic pumper seems like a good idea. Even if they can’t suck it all up it will quickly get rid of some.",
            "Just how rural is this property? Rent a backhoe and bury it.\n\nLast thing you need is some Barney Fife turning the property into a hazmat site.",
            "https://youtu.be/pyikYIthkcI?si=0oTTQwiovm50c8hl",
            "Obviously no fire extinguishers near the property? I’d place the trailer on stilts and flood the ground, whatever is left floating can be hoed out.",
            "Please do not contact your local government. \n\nThe scariest thing you will ever hear is \"I'm here from the government, and I'm here to help\".",
            "All y’all talkin’ bout movin’ the shit around are crazy… that don’t start or end good. \nTakes me back to the burn pit days in Iraq… some diesel and a match will go a long way toward solving this problem… of course, if it’s fresh and liquid, ya may have to stir while singing, “I set fiiiire, to the rain” by Adele. \nPro tip: don’t breathe it much.",
            "fire. Do a bonfire on top of each bag. do not get government involved unless you want to pay for a expensive clean up process.",
            "Way of the road, Bubs.",
            "Just dig a hole and bury it.  The trash bags will eventually decompose.  \n\nThat's what they do at a landfill.",
            "Maybe some kind of attempt at making fertilizer?",
            "How do you know they’re from a human?",
            "Maybe they were trying to make jenkem.",
            "What a disgusting fucking nightmare. I have no idea what to do in this situation other than call like the health department or something? I'm so sorry you have to deal with this shit (literally)",
            "Might need to get a lawyer involved",
            "I’d say take care of it yourself instead of opening up a can a worms with an agency.",
            "Buy some septic system bio additive. Sprinkle it on the shit and let the magic happen",
            "Call the local health department, ask for help. Might be worth keeping it anonymous until you are sure you're not just getting slapped with a big fine for trying to do the the right thing",
            "Tyvek suit, over boots, and multiple gloves. It's gonna be gross but doable. You can pull the deployed status, get a metal drum, cut it in half, put Said bags in leaving space for diesel, Pour 5 -10 gallons of diesel, and light it up. Gonna smell so bad. Wouldn't recommend this as buying cheap totes, putting it in said totes, and dumping it in the dumpster is prolly better. You can reuse the totes while hauling the feces. Once done put all nasty stuff in dumpster. Proceed to take multiple showers until you feel clean.\n\n\nThe buring thing came from a different place and time. \n\nGood luck. I don't wish having to clean up poop on anyone.",
            "imo throw that in your can and put it to the road.\n\nmaybe mix in grass clippings to hide it",
            "Step 1: get a blender. Step 2: get some straws. Step 3: invite your new neighbors to come over and properly manage their shit.",
            "Guess you know what you’re doing this weekend!  While you’re at it check to see if you have a septic tank or for that matter plumbing that’s in working order.  Did the well run dry?",
            "Rent a trailer, put on tyvek suit and gloves and a mask and start filling the trailer and take it to the dump.\n\nProbably best to call the local solid waste management group at your municipality and ask them the proper protocol for disposal.",
            "You're going to have to end up calling a hazmat restoration company. Like those that deal with severe mold, water, fire damage and well...sewage. they have the correct equipment, training, and PPE for this. \n\nSorry OP, hope it all comes together for you in the end and you enjoy your new home.",
            "Pile wood over the top and burn it",
            "Dig a hole ffs ..",
            "Call anonymously and seek advice for a relative",
            "just put in the garbage",
            "break/chop open the bags with a shovel, spread several bags of new dirt on top, and plant some fast growing weeds on it. Let nature take it's course",
            "Free fertilizer?",
            "Free fertilizer!",
            "I mean it's just fertilizer... Dump them onto the yard before it's supposed to rain and sprinkle with kitty litter or baking soda if the smell is too gross. Water will wash it away. Or just throw it in the dumpster.",
            "As disgusting as it is, we're talking about natural fertilizer here. Can't OP just leave it a couple months to decompose completely and become soil?",
            "*shituation",
            "Not sure if he's gonna call the health department, but all I can think of is the poor sucker having to empty the nearby porta-potty.",
            "Hear me out. Burning paper bags and lots of porches. Spread the wealth. ",
            "I might be a bit leery of contacting any officials. Sometimes this just makes things harder. Call them and next thing you know you might be on the hook for thousands of dollars in fines, permits, or hazmat cleanup bills.",
            "Naw, don’t get the gov on your back. Ask advice for your “dying uncle’s” property.",
            "Not sure rural towns have a Health Department.",
            "When called, the lot owner kindly directed me towards where he has a dumpster set up.",
            "100% this",
            "Mental illness is my guess.",
            "Me too honestly.",
            "I’m more concerned about what else would be buried around the lot",
            "Guessing plumbing broke and they were too poor to fix it. Residents then used a portable camping toilet for years.",
            "There is no why, only DOO.",
            "Poverty",
            "Fluoridation of the water supply. Obviously.",
            "Everyone needs a hobby",
            "It's legit crazy. Like, just take a dump in a five gallon bucket then toss it into the woods (if there are any nearby). Let nature do it's thing. Or at the least bury it.",
            "They didn't pay the water bill",
            "I’m curious how they know it’s human, would me more likely to be dog poop imo but maybe there’s toilet paper or something else telling in the bags.",
            "By “various stages of decomposition” I mean “generally mostly liquid.”",
            "Stopp lol",
            "Is this a service the Boy Scouts offer?",
            "Hahahaha",
            "Can you just make one long snake?",
            "Nah just rent one o them Industro-Toilets from Home Depot.\n\nSays you can flush a whole human",
            "LMAO!",
            "Fill the bath tubs and have a Waffle stomp party",
            "If they have a septic tank, then they can just open that and pour directly in from the bags versus going through the toilet.",
            "While you probably were joking this actually is the most correct thing to do.  Also recommended for dog poop rather than trash which goes to the landfill which isn't equipped to handle it like the sewage plant.\n\nBut not no but hell no would I do that in this situation.  Gross.",
            "Well now I feel lucky that it’s just poop.",
            "Hahahaha imagine the shame part post-nut, diaper fulla shit, tying off them bags, duct-tape. Or maybe not, some people just don’t give a fuck. I woulda thought body parts for sure though.",
            "I don't get it",
            "The toilet works fine. That’s the most baffling part!!",
            "At least then I’d know who to call!",
            "Maybe, once you get over the shock the cops are going to remove those for you ",
            "Stop watching after season 4. Trust me.",
            "Underrated comment right here.",
            "The US Army method!",
            "Gonna need more than 5 grams!",
            "Open burn pits. You can put in a claim with the VA for that.",
            "Only way to be sure",
            "Must be a Helldiver with that kind of Democratic solution. For Liberty!",
            "Good point, but I’ve seen dogs trying to bag their own shit, and they just can’t manage (no thumbs).",
            "This is the comment I’m looking for. I wouldn’t have thought of cat litter. Thank you.",
            "This is a good response. I bought land with a trashed house and yard full of dumped trash.  I've carted off over 30 yards of trash so far. My recommendations: 1. Get the best tools that you can afford and are willing to throw away. This sounds like a disgusting job - have the right tools. 2. Get a muck shovel for cleaning stalls. 3. If there are trash bags are still solid (haven't disintegrated) start with those and just pick up by hand.  4. Try to avoid holes and  messing with contents. 5. Biohazard suits aren't that expensive on Amazon.",
            "Sounds like you've ran into this very specific poo-related instance before. I respect your game-plan here.",
            "Well, it started when he hit the first one with the weed eater and got sprayed. It definitely has that smell of people poop. None of these bags are sealed, they’re just tied with the bag ties at the top. As for the why, that is also my greatest question.",
            "I think you meant “turdly, why?”",
            "I'd think you'd need to call biowaste or hazmat specialists for bodily fluids/waste, no?",
            "I'd be decked out like Carl Spackler in Caddy Shack doing that.",
            "That’s not a bad idea. Septic or porta potty waste hauler would make quick work of it.",
            "Yeah, but then at least I’d know who to call. Plus they’d probably take them away for me.",
            "Hopefully they were cooked, raw face is just gross",
            "Lmao. Scrolled way too far to find this but I knew it would be here.",
            "if a patient has a bowel movement into a bedside commode, then yes it’s flushed down the toilet just like you would flush one down in your own home.   \n\nIf, however, it’s something like a nurse doing personal hygiene on a patient in a diaper, then the diaper, the wipes used to clean the patient, and the PPE the nurse wore while doing the clean up, all go into a biohazard bag.",
            "Surprisingly not as bad as you would expect for a property with bags of poop in the yard. It’s a 1973 and hasn’t really been updated, but we knew going in that it was gonna take some work updating the plumbing, electrical, etc. The guy we bought it from kinda half flipped it and put on a new roof and made sure the floors were solid which was our selling point. It’s got good bones and we can work with that.",
            "Snakes I’m cool with. I can dig snakes. Human poop, not so much.",
            "Lye. I said that already, but that’s not really safe for the top lawn, just pits",
            "[deleted]",
            "There is no why. There is only DOO.",
            "Congratulations, you're the next contestant on \"Drugs or Mental Illness?\"",
            "They’re black kitchen size garbage bags. We’ve both worked with animals and animal poop long enough to know human poop when you smell it.",
            "We bought it from a guy who did a half flip (put on a roof and a coat of paint with a couple other minor things. Don’t know where he got it, but foreclosure would probably be a safe bet. Either that or squatters.",
            "Well, we may not own the land, but it’s still my yard so yeah, it’s kinda my problem.",
            "Judging by the amount of decomposition, the shitter is long gone, leaving behind only their shit bags.",
            "This is the best idea ever!",
            "Lol... \"shyt goblin!\"",
            "Of all the things I’m doing, voluntarily letting the cops and their dogs onto my property is not ever gonna be one of them.",
            "While that would probably be the best option in the long run, it’s a bit out of our price range at the moment.",
            "We’ll get a much better spray that way.",
            "Well, we’re responsible enough to shit in the toilet and flush it into the septic tank like civilized human beings.",
            "Not when they’re in plastic bags. If there were just piles of shit on the lawn we’d burry them and be done with it, but they’re all in plastic garbage bags.",
            "Homeownership!!! Woo!!",
            "This is rural Montana. Finding this much dog poop in bags might actually be more surprising than the human poop.",
            "I do t really wanna risk my dogs digging that up. Plus we’re gonna be putting in a fence soon.\n\nEdit: plastic doesn’t decompose. That’s kinda the point of (and problem with) plastic.",
            "If that were the case they probably wouldn’t have tied it into plastic bags.",
            "Taste test, obviously",
            "Taste test.",
            "That’s just lye. That’s not safe for ground level or around dogs",
            "Rural = no trash pick up. We barely have cell reception out here.",
            "The septic and cistern are both is working order, and the cistern is even full! Best I can figure is when the electricity got shut off, the cistern pump stopped working and they didn’t know that they could still use the toilet manually.",
            "That’s not how that works",
            "Extension #2",
            "Heard in Sean Connery voice.",
            "This comment killed me...",
            "*puts bags of shit in cardboard box on hood of vehicle*",
            "Oh my God, old man Clemens Hates sh!t \n\n🤣",
            "Welcome to the neighborhood!",
            "So…. Just wing it?\n\nMost officials I have encountered at least make an attempt to be helpful.  OP is con fronted with a situation that they have no idea how to resolve.  Might as well access the people that are paid via our taxes to give some guidance.\n\nETA :  I just noticed that this is on a rented lot.  In what world would OP be responsible for the cleanup?",
            "The *property owner* might. Check the post again: OP bought the trailer house, but put it on rented land. The landowner should be the one who gets the bill.",
            "Unfortunately, this take isn't crazy. Local governments are the most variable and unpredictable of all. I've encountered some city governments that would be completely understanding of this problem, and then I've dealt with others that would get super punitive about it.\n\nThe best thing I can suggest to OP is just throw the bags in with their regular garbage and pray no one notices. It's not a great solution, but it has the benefit of being low-profile.",
            "Yep, biohazard mitigation.",
            "Maybe we can spin this government thing though. \n\nOP, do you happen to be located near North Korea?",
            "The county most certainly has a health department.",
            "That seriously is not your responsibility. Call the health department and give them the owners' number!",
            "I would just let the landowner know that you're going to call the health department and I bet he will change his tune and get that shit off the property pretty quickly. I imagine he would get hit with fines and clean up costs.",
            "Tell him that you can hire someone to take care of it, but you will deduct that from the rent, including a cost for you managing the issue for him.",
            "I'd kindly tell this douche that he will get his rent minus however much it costs you to hire someone to come out and clean up this shit. Watch how quickly their attitude changes",
            "I would kindly direct my lot payments to an escrow account then. The owner can get their money when the owner takes care of it.",
            "He probably knew it was there",
            "More like call your local property maintenance/ code enforcement.",
            "Did you ask him WTF?",
            "Rent a tractor for a day, dig a hole and bury the poop.",
            "Or just laziness coupled with no repercussions. Lack of money could be another factor.",
            "Government ain’t getting any of my shit. They can steal my credit card info based in my digestive code.",
            "Idk if u believe in witchcraft or voodoo but protect urself mate\n💩👻",
            "Step one: be poor. \n\n\nStep three: fill trash bags with poop.\n\n\n\n\nWhat's step two here?",
            "Pooverty",
            "no. That’s impotence",
            "Solo cups then. Blue ones are better.",
            "Yep. Should have stopped reading a few threads up. I knew it.",
            "Crazy shit",
            "oh well in that case all you need is a straw and you're set",
            "Lye?",
            "Maybe one of those nice groups of Mormon kids offering community service help?",
            "I can vouch for that.",
            "exactly how much poop are we talking about here? A family of 9 adults & teenagers over several decades?",
            "Diaper fetish",
            "Just because the toilet flushes doesn’t guarantee the septic system is working. I’d get a septic inspection done ASAP. ",
            "Are you confident it isn’t dog shit?",
            "Turdbusters? 👻",
            "I think they meant gallons",
            "Raccoons then",
            "And I suggest clay style, absorbent clumping for multi cat households.     \n\n\nFor people sized messes it can become a slime, that's why you need gloves, pants, and the shovel. It can get heavy too so shovel slowly until you get a feel of it.   \n\n\nPine and soy work. Pine you could possibly get horse bedding from a tractor supply store for cheap. I find pine to absorb slower, and be clumsier to shovel. Soy gets gross and turns into a sludge fast but it's better than nothing, you won't get the soy sludge out of your shoes though. ",
            "I wish I thought of Amazon biohazard suits.    \n\n\nI had several relatives that were mentally ill so I handled an inordinate amount of feces and hoarding clean up. They're passed now but that would have been so useful. ",
            "Unfortunately I had several family members with mental illnesses and hoarding tendencies. I've cleaned up a lot of weird shit. Some of it was literal shit, all of it was difficult.    \n\n\nSomeone pointed out biohazard suits are available on Amazon and I wish I knew that sooner. Hopefully I don't have anymore shituations but if I do I'm going to Amazon for the suit. ",
            "ok that's enough of this thread",
            "If someone was sprayed with human feces I would most certainly call a doctor or a vet or a priest. \n\nI also think given enough time and heat alot of things decomposing in trash bags baking in the sun might give off that smell. I wouldn't jump to a poop conclusion. Maybe call whatever local health authority you have and they can come test it to find out? If it's just compost there's a very easy solution for you",
            "Well there goes this nights sound sleep.",
            "Oh gawd…",
            "Damnit, I really shit the bed with that opportunity",
            "Although hazardous, it would not be considered hazardous waste. It likely falls under the jurisdictional health code, which would need some input from the local health department. EPA or state-EPA equivalent would be concerned if the waste is making its way to or impacting waterways. \n\nAs for throwing it in the trash, the issue would be on the integrity of the trash bags, which don’t sound like they’re especially in good shape. It would be pretty unkind to have one of those bags break on someone expecting a light bag of household refuse.",
            "Technicalllllllly? I mean…. Realistically? I mean…",
            "Think about all the diapers that people throw away",
            "It is just as dangerous and illegal to throw out trash bags of old human feces as it is to throw away a used disposable diaper. Which is to say, both illegal and dangerous, but also, people do it every day, millions of times a day. ",
            "I unfortunately have a severe phobia of snakes, and it sucks because I like having them around for the environment. They just terrify me. But you are correct - human feces is just… no. My condolences to you lol",
            "🤣",
            "Do the Doo.",
            "Porque no Los dos?",
            "This is the sort of thing that would have needed to be disclosed when you bought the property, yes? If hire a lawyer and get a letter drafted to the seller asap. Give them the opportunity to remove it, and if they don't,  get your own estimate and take them to small claims court to get reimbursed for that cost. It sounds like it was untentionally hidden from you and/or any inspectors who looked at the property prior to sale, and that's not legal, so you should be able to get it taken care of on their dime.",
            "JUST HOW MUCH POO IS THERE?",
            "Obviously it's a problem, but it's not your problem to solve. The way you handle this is tell your landlord to fix it. If they refuse, you go to the proper authorities about it and they can give you guidance and/or force the landlord to fix the situation. I guarantee it's not legal for bags of human shit to be in your yard. That is 100% your landlord's responsibility. Don't let the landlord convince you it's not. The landlord has legal responsibilities, same as tenants do. That's what I mean when I say know your rights. Most landlords suck and will try to pull illegal shit all the time and force you to do things that are NOT your responsibility. Don't let them. You can also see if there is a tenants union in your area that might be able to give more specific advice about the laws in your area.",
            "Ah very good point. I didn't think about the big picture there.  Good call.",
            "I feel ya man. If it helps, bagster is pretty cheap, they sell them at hardware stores. You can rent a machine at a rental center near you, and if you scrape carefully can minimize how much material you are picking up to save space. \n\nIt’s pricey still but DIYing it is probably the cheapest option I can think of.",
            "I just meant to put the stuff in the garbage bags in the port o potty to get rid of it.",
            "> I do t really wanna risk my dogs digging that up.\n\nyou're not thinking of digging deep enough.  An out house hole would be about 5 feet down.",
            "Actually I was thinking of the bio enzyme stuff but lye would certainly take care of the problem too lol",
            "I thought the landlord told you where a dumpster is,  use that.",
            "what do you do with the trash  ???",
            "He called the shit poop!!",
            "Usually the renter is required to maintain the lot in a trailer park.",
            "How do you know it’s human feces?",
            "You're correct, the county most definitely will. Local, to me, means township. My township does not have a health dept. I figured waste would be a township matter.",
            "Yep.  This is not OPs responsibility and might as well get the health department involved.  The landlord might be unhappy, but this clearly is beyond OP picking up a few bags of dog poop and disposing of them properly.",
            "I would call the health department anyway. I wouldn't trust the landlord with it unless he's getting pressure from authorities.",
            "But who would he call?  How is he more equipped than OP to handle it?",
            "Which will inevitably end up in court and OP having to escrow that rent until the court date.. sounds good in theory, don’t shit where you sleep. And U.S. courts are there for them, they will milk money from everyone that walks in their doors, guilty or not, believe dat",
            "Yeah, this is Montana. We’re pretty lax in rental protections around here in general and that’s just gonna lead to a “well then get your trailer off the lot if you don’t like it.”",
            "I dunno about laziness\n\nit's take more effort to fill trash bags in your yard with shit than it does to just use a toilet.\n\nthis is  more like commitment to the bit.",
            "Lazines??",
            "Oh for sure. As soon as I can walk the perimeter of this property there will be wards.",
            "what is poop used for that would have you say that?",
            "Haha. This was the first thing that came to mind because I live out in the desert, this area used to be poverty stricken and isolated, a lot of the houses are patched together, etc. One of my friends bought a house out here, also found bags of poop buried on his property. The house had no working electricity or plumbing.",
            "Um, profit?",
            "Obviously #2",
            "Not have working plumbing?",
            "Step 2: Go outside to poop",
            "Not being able to have the septic emptied and disposed of",
            "Ladle?",
            "how dare you. red is superior.",
            "I wonder if there is a convict that could do it as community service in lieu of serving time.",
            "That’s enough Reddit for me today…",
            "Oh Christ no",
            "Well, best I can figure is that even though the toilet works, since the water was off they thought they couldn’t use the toilet??",
            "I’ve cleaned up more than an average amount of dog shit in my time. This is 100% human.",
            "According to Reddit, the official name is PoopKnife©",
            "Tyvek suits are pretty cheap at home depot as well. Coupled with a full respirator and some good wrap around goggles and you basically have the same thing. Just did our whole house's insulation and managed to stay reasonably not that itchy afterwards.",
            "Just laughed outloud reading that…me too, thank you, I needed that prompt",
            "No shit lol. I can't believe it took this long for someone to ask how he knows it's human.  Reddit 's not the place it used to be",
            "The power of Christ compels you!!!",
            "Didn’t mean to be a party pooper, but it needed to be said.",
            "I wonder if that changes based on if it's residential or business. I know per Bloodborne Pathogen training, any bodily fluids or waste are considered as potentially hazardous waste and they need to be disposed of in the proper biohazard waste containers. Even if OP chooses to clean it up themselves, they should still reach out about proper handling and disposal (including bags).",
            "I mean I get not wanting to be stuck with a bill, but personally I'd call in a team. This is literally the type of shit (pun intended) that spread the, ~~Black plague~~ typhoid.\n\nEdit: got my plagues mixed up.",
            "... Which should still be in proper waste bags, IMHO. But again, I'm looking at this from health/sanitation standpoint. 🤷🏾",
            "Since when was it illegal to throw out diaper?  WTF you suppose to do with them?",
            "People also improperly dispose of needles daily. Doesn't mean you should follow suit.",
            "We paid $15,000 for the whole thing off of Facebook marketplace. There were no inspections beyond us looking at the place and determining that we could probably fix whatever needed fixed. Since it’s in a rural area everything is kinda cobbled together anyway so I doubt there are any kind of permits beyond the initial setup of the septic and cistern (even that’s a maybe.) It’s still the Wild West out here. Hiring a lawyer would cost more than the entire house. We knew there would be issues and we knew there would be a lot of work to do, but this is just one of those WTF scenarios that nobody expects because who the hell expects bags of human poop and knows the best way to clean them up?",
            "Yeah, no. This is Montana. Rental protections are sketchy at best. Putting my foot down is less likely to get the landlord to clean it up and more likely to get the landlord to tell us to get our trailer off the property if we don’t like it. Seeing as how we just moved, and spent all our money buying this trailer I’d rather stay on good terms with the guy renting us the lot, even if it means cleaning the poop ourselves.",
            "Oh. You’re talking a *hole* hole. I’d have to clear that with the guy we’re renting the land from.",
            "Load it in the back of the truck and take it straight to the dump. Obviously I don’t want these bags in the back of my truck though.",
            "“Don’t put it out with your boots, Ted!”\n\n“Don't tell me my business, devil woman!”",
            "Okay, but it was there when they moved in, so not legally their responsibility. I will eat an entire pair of jeans if the landowner isn't responsible for making sure there are no biohazards present before a new tenant moves in, even if they bring their own dwelling.",
            "I'm not saying he's more equipped, I'm saying he owns the land and it's his problem.",
            "I live in a trailer while I build my house , it cost 90$ a month to empty out the black tank. Septic tanks cost thousands to install and manage. People are poor.",
            "assumes a working toilet at the time",
            "It's a trailer, so likely no built in septic like a home, and it can cost a lot to get it emptied regularly.",
            "Bro is casting the poop spell evidently",
            "Create Poop spell requires Poop as a key component.",
            "Different spells require different ingredients",
            "I just can't wrap my head around putting it in plastic bags then burying it. Why put it in something that doesn't degrade? Just dump it in a hole and cover it with dirt. Gotta be a combination of laziness and mental illness.",
            "Slow clap.",
            "Poop knife and ladle. We almost have a full set reddit!",
            "Red is superior for drinking beer in pong ball related games. Blue is superior to excrement related activities.",
            "8th amendment, bro",
            "On second thought, I'll go with the prison option.",
            "I would be wondering why the water is off. Like where is it leaking or what’s wrong that of got shut off ",
            "Dog shit and human shit are mostly different because our food is different. If someone is living like that, they’re feeding the dog the same thing they’re eating. Is there toilet paper in the bags?",
            "The holy laxative?",
            "Health department all the way with that, who typically handle residential sanitary disposal issues. \n\nOSHA has some issues with bodily fluids and sharps, but that’s based on worker safety not regulating disposal.",
            "No it isn't.  The black plague is caused by yersinia infections, which is a bacteria in the feces of fleas that would shit on you while biting your skin and then you'd scratch the bite and get the bacteria into your body.  \n\nThe black plague was caused by flea shit.  Not human shit.",
            "It’s in bags, we don’t sleep with fleas, we should all be up on our vaccinations, and if all else fails just eat Ivermectin and drink bleach like that one guy said.",
            "I’ve been putting dog shit in the trash can for years. Not once have I ever been fined.",
            "What are you supposed to do with them?  Empty the poop into the toilet first.  \n\nWhat do people actually do?  Exactly what you and I do.  Toss them, full.",
            "So you bought the Trailer but you have to Rent the Lot? \n\nStep #1 Determine who is legally responsible for the lot.\n\n(1) Did you assume the prior lease/rent contract from the prior owner and if so what are the Terms of the Lot rental? \n(2) Do you know who owns the lot itself and if it’s free and clear of any liens?( Check County records)\n(3) Who is responsible for cistern and septic system? is that specifically part of the scope you ‘bought’ or by virtue of the fact that it’s ‘attached’ to the property is it possible the landowner owns the septic system and cistern?\n\nIf you’re not sure about above, start by researching the land and ensure you’re actually dealing with the landowner. You can call your county records dept for help ( without disclosing your specific issue.)\n Your legal contracts determine who is responsible for what. \n\nBuying it off Facebook Id be concerned that the people who sold it didn’t even own it. \n\nGrow taller grass for the time being until you sort this all out.",
            "I've had success fighting these things in Idaho, which is just as bad as Montana. However, I understand your fear and not wanting to go through the hassle of all of that. Just know he is probably going to keep pulling this sort of shit if you acquiesce to this wildly unreasonable request. Please reach out to a local tenants union if there is one - I know that's not guaranteed to exist either. They would be able to tell you if there's any chance you could fight this in your state better than I could. If you don't want to fight it, then you still need to reach out to the city/county to find out how they want you to dispose of this since it's a biohazard.",
            "at this point, I don’t think you would need to clear anything you do with your landlord.",
            "The derisive tone and extra breath with which he expels “Devil Woman”, as if the first part of the sentence was just to get to the second part.  She was just trying to be helpful.",
            "This is where it would be really helpful to go read that old lease instead of everybody chiming in on what could be and should be.",
            "> Okay, but it was there when they moved in, so not legally their responsibility.\n\nits the previous owners responsibility.  \n\n>I will eat an entire pair of jeans if the landowner isn't responsible for making sure there are no biohazards present before a new tenant moves in, even if they bring their own dwelling.\n\nusually the lot \"rental\" isn't a rental, its a \"lease\" and its a 99 year lease that gets tied to the ownership of the mobile home put on the lot.  That means that the mobile home owner, in 90% of cases, is responsible for maintaining the lot.  \n\nhttps://dahlelaw.com/minnesota-mobile-homes/minnesota-mobile-home-lot-rentals/\n\nall 6 of the mobile home lot lease agreements that I have seen all said that the park is only responsible for the drive paths and walkways considered public property, and that the lot renter/leasee is responsible for lot maintenance and issues.  without seeing the agreement from OPs trailer home, I would have no way to tell for sure, but its pretty standard to require the homeowner to take care of the lot.",
            "They could say the property is a health risk, deem it uninhabitable and make OP vacate the property which means moving their trailer. \n\nFind a portapotty and toss that shit in.",
            "Yup. My guess was poverty, not laziness.",
            "This is a trailer house not a camper. Like trailer park house not rv park",
            "It’s a mobile home, not an rv. There is most certainly a septic system attached to the house.",
            "It’s *crapioSA*, not crapiosa",
            "kinda like money!",
            "Camping toilets empty into big bags iirc. Or some dry flush (waterless) toilets just are built with bags. Those are honestly pretty cool. https://youtu.be/GMa6yTos38s?si=rQTBTmSdTqMwlpSf\n\nSo it might just be the default \"container\"",
            "Was not expecting the poop knife to appear. Lord of the Cockroaches, yes. Poopknife not so much",
            "Green ones if you want to be more earth friendly. They pollute the same but are more green and have a chipper disposition.",
            "Facts",
            "This guy excrements!!",
            "Community Service is not a punishment. It is reparations to the community for the harm that a person has caused. I'm not sure it would be covered under the 8th.",
            "Name checks out.",
            "It’s on a cistern and the pump was off because the electricity was off.\n\nEdit: we might need a new cistern pump too, but that still doesn’t justify shitting in garbage bags in the yard.",
            "Well. When a man and a women love each other very much but they can’t pay their water bill …",
            "If there was it’s been liquified along with the rest of the contents. I wasn’t about to go digging around in there too much.",
            ">OSHA has some issues with bodily fluids and sharps, but that’s based on worker safety not regulating disposal.\n\nSharps containers are literally for disposal of sharps. There are absolutely guidelines for waste disposal - color coded bags/containers, apparently they just don't regulate the final resting place for your poo. \n\nHowever the CDC and other regulating bodies do have guidelines specifically for handling and disposal of poop - if throwing in regular trash, sealed /double bagged, and use ppe when handling. \n\nOP is free to do what they'd like, but I'd personally err to the side of caution with bodily waste from an unknown source. It says a lot about hygienic practices of someone shitting in bags and leaving them outside.",
            "JFC people, for all of human history up to around 60 years ago manpoo was not big deal. Ever heard of a latrine?  You act like getting someone's shit on you will make your skin rot right off your body.",
            "You're correct. I was confusing bubonic with typhoid.",
            "Fleas that had feasted on black rats, hence the name",
            "The bags most likely are in poor condition from sitting outside. \n\nThis isn't like a toilet that overflowed. This is the shit of the type of people that dump their human waste into bags and toss it out back, never disposing of it, but just continuously adding to the pile, ignoring it. I bet they ignore a lot of things related to their health. Probably not the type of feces you wanna get elbows deep in. \n\nI want to drink bleach just thinking about it.",
            ">we don’t sleep with fleas,\n\nI got bubonic confused with typhoid. While mostly eradicated in the US, people who travel are still at risk. I opted to get vaccinated myself.\n\n\n\n>we should all be up on our vaccinations\n\n*should. \n\n\nAnyway, it's still biohazardous waste. There's a lot of stuff we don't dispose of properly, but I'd err to the side of caution with someone pooping in bags and leaving it to fester for an extended period of time. 🤷🏾",
            "...um nobody said anything about fines. I'm talking about proper disposal. The fees I'm referring to are paying someone to clean up the shit. \n\n\nFucking weird.",
            "Buying the trailer and renting the lot is pretty bog standard as far as mobile homes go. Basically means that he’s responsible for anything below ground, we’re responsible for anything above ground. All the contracts and paperwork reflect that as well. This is a, pardon the use of the term, ahem … sticky … situation because the bags aren’t really entirely in either realm. They exist both above and below ground.",
            "Yes!!! I've been saying this for years!!! He really nailed a 50+ year relationship.",
            "The lease doesn't override the law",
            "Bullshit. Everything you're describing applies to the current lessee of the lot. There is a period of time between lessees where the owner is responsible for the lot. And it's in the owner's best interest to maintain the lot during that time, because otherwise they may have a hard time leasing it to anybody. If OP would've noticed the shit in the yard, OP may not have been inclined to sign the lease agreement. The owner of that lot had some responsibility here. They may no longer be responsible, but they were prior to OP signing that lease.",
            "Or burn it",
            "That was my thought too.  As simple as falling behind on your bills, they eventually shut off your water because you don't reach out and explain the situation (they usually have programs for this), then you're faced with having to drive places to use the bathroom.  Then you get the bright idea to shit in buckets or bags and throw them away.  It's not an overnight thing, just a series of situations that the person probably couldn't handle mentally or financially and they had to find alternatives.\n\nIt's also extremely difficult to ask for help in the best of times when you're not struggling with depression or living in a hoarders situation.",
            "Well sure, if you can find the people who put it there that would count. Little bit risky letting them back on the property but I supposed I'd be willing to take some risk for the hope of not having to fix it myself.",
            "Foreclosure sale?",
            "A real pro would know to use a bucket and some cat litter.",
            "Lol I promise I wasn’t trying to justify yard shits. There’s never an excuse for yard shits.",
            "A lot of things have improved since the 1960s. There are way more people on earth compared to those days, too, and all of those people manpoo on a regular basis. \n\nIt’s not going to make your skin rot off, but there is the potential of some unpleasant effects. It’s also pretty gross.",
            "I guess i miss understood.",
            "So if you bury the waste it becomes the Landlord’s problem?",
            "I said that a lot of time when my finance and then wife would be right about something, and we would both laugh.  Recently, she rewatched the movie and heard the line.  She thought it was just something I made up.  While being both confused, bewildered, and a bit hurt, I knew then she was a keeper.",
            "The lot lease typically stays with the owner of the mobile home.",
            "Half flipped foreclosure sale. But it was cheap!",
            "Right? Like, this is the worst possible way to dispose of poop. I would have rather they just shit in the yard. At least then we could burry it.",
            "found the trucker",
            "Cheap in dollars, expensive in mental health.\n\n\nI'm sorry that I have nothing constructive to offer. Good luck.",
            "Fortunately we’re both pretty crazy already so the house doesn’t have far to drive us."
        ]
    }
}