{
    "Weekly Discussion: Watchlist Wednesday": {
        "title": "Weekly Discussion: Watchlist Wednesday",
        "score": 5,
        "url": "https://www.reddit.com/r/horror/comments/1djilyd/weekly_discussion_watchlist_wednesday/",
        "content": "Welcome to Watchlist Wednesday! \n\nDive into the horror discussions by sharing your top picks of the week, from classics to hidden gems. Explore new titles and swap recommendations with fellow horror enthusiasts. Uncover the next chilling thrill together! \n\nAs always, be sure to use spoiler tags if necessary.",
        "num_comments": 15,
        "comments": [
            "Any recommendation of supernatural horror movie from middle east? I've already watched Under The Shadow, Dhabbe, Siccin.",
            "I watched Arcadia this week. Really enjoyed it, the monster design was really unique and creepy.\n\nAlso watched I Saw the TV Glow. I thought this was going to be more of a horror film than it is, it's really more of an artsy indie vibe exploring escapism and sexuality/gender dysphoria. Not particularly suspenseful but it is a great movie nonetheless.",
            "I saw infested a few days ago, it’s about spiders taking over an apartment building. Honestly pretty solid movie 8.5/10",
            "The Outwaters - this is a found footag Blair Witch wanna be. A group of young folk go out into the desert and cosmic horror strikes. Watchable but weird pacing and barely a story.",
            "I just finished The Witch with Anya Taylor-Joy. Really enjoyed it! Much better than I expected, actually.",
            "I rewatched Friday the 13th Part 2 and 3. Part 2 has the best character of the series: Ginny, and I do wish that she appeared again. The rest of the film is pretty good, but standard. Part 3 I felt nothing, but it was pretty funny to see how cliched the film is. It is ultimately boring tho, which I knew going in, but people convinced me to watch it \"because it has the best final chase in the franchise\". It did not have the best final chase in the franchise.",
            "Anyone else watching the new British series, *Insomnia*? It was slow at first, but now I'm glad I stuck with it. \n\n\nSynopsis:\n>Successful career woman Emma Averill fears that she is losing her mind as her hard-won lifelong dream begins to turn into a nightmare, forcing her to do everything she can to prevent it from collapsing around her.",
            "I watched Saw X and I somehow had high expectations, but more surprisingly it didn't disappoint. Tobin Bell was on screen most of the movie and that's probably the main reason. Minor gripes with minor spoilers:\n\n>!The villains would have been better off getting real jobs. For the amount of effort and the risk, plus the damage they were causing people, it was hard to believe that their scam could have been profitable enough to be worth it. Towards the end the main lady says that she's happy she won't have to split the cash now, she's got a bag of money and it would seem she never paid her associates. I was annoyed that she got the easiest game even though she was the mastermind of the scam.!<",
            "Be My Cat: A Film for Anne - really liked this. Small budget, docu style \"filmed\" by the main character. The writer/director is working on a trilogy and I look forward to watching those. It's just a fun time.\n\nGreat rec if you like Creep (the one with the videographer, not the subway one).",
            "I just watched a found footage movie called the butterfly kisses and I must say my mind was blown. A fairly unique concept around the whole premise of the found footage genre, and with the ambiguity and confusion created to divert the audience is great in the movie and the ending was well done too. Overall a soldi 9/10",
            "check out paranormal,,its a tv show..not very scary but the episodes are good",
            "I just looked up I Saw the TV Glow and I'm going to check it out. I had no idea Phoebe Bridgers was in it! Thanks for the tip!",
            "Part 3 is worth it just for the transition from head sack to hockey mask",
            "You get two different music performances in the film! Hers is very cool.",
            "Not really. I would just rather have hockey mask all of the way through."
        ]
    },
    "Official Dreadit Discussion: \"The Exorcism\" [SPOILERS]": {
        "title": "Official Dreadit Discussion: \"The Exorcism\" [SPOILERS]",
        "score": 9,
        "url": "https://www.reddit.com/r/horror/comments/1dl57vp/official_dreadit_discussion_the_exorcism_spoilers/",
        "content": "**Summary:**\n\nA troubled actor begins to unravel while shooting a horror film. His estranged daughter wonders if he's slipping back into his past addictions or if there's something more sinister at play.\n\n**Director:**\n\n* Joshua John Miller\n\n**Producers:**\n\n* Kevin Williamson\n* Ben Fast\n* Bill Block\n\n**Cast:** \n\n* Russell Crowe as Anthony Miller\n* Sam Worthington as Joe\n* Ryan Simpkins as Lee Miller\n* Chloe Bailey as Blake Holloway\n* David Hyde Pierce as Father Conor\n* Marcenae Lynette as Monica\n* Tracey Bonner as Regina\n* Samantha Mathis as Jennifer Simon\n* Adrian Pasdar as Tom\n* Adam Goldberg as Peter\n\n  \n**-- IMDb:** 4.7/10\n\n**Rotten Tomatoes:** 32%",
        "num_comments": 17,
        "comments": [
            "I watched this a few days before release on Scream Unseen. It started promising but they really did drop the ball in the third act.",
            "Russell Crowe in another exorcism movie? Didn't I just see him on a vespa?",
            "This wasn't very good. Some story elements had potential, but the script never came together in a cohesive way. There was no tension to keep my attention. The actors did their best, but it wasn't enough to salvage this from being a slog. I'd reccommend skipping this one.",
            "This movie made 0 effort to tie anything together cohesively but had a few fun moments. It was not as bad as people are making it out to be if you can turn your brain off during it. The writer wanted to make a movie about alcoholism and used the demon possession stuff to represent how suppressing your feelings and trauma can affect the people around you. Predictable horror movie but worth a watch if you're bored.",
            "I thought the first half of the film was excellent. It wasn't clear what was going to happen, but it was genuinely scary for awhile (although it relied a bit more on jump scares and loud noises than I like). The music was really solid.\n\nI think leaning into the struggling alcoholic trope gave it a cool The Shining sort of vibe. I also liked the meta plot pointing at The Exorcist, which reminded me of Wes Craven's New Nightmare (which I thought was actually pretty scary, for a Nightmare on Elm Street movie).\n\nUnfortunately the plot didn't really pay off or go anywhere interesting. >!The characters didn't react to absurd situations in ways that made any sense (Russell Crowe bent over backwards in an impossible way and smashed his face into a table, then murdered someone, and they...sent him home with his teenager daughter?). I still don't understand the childhood trauma that happened to Russell Crowe either.!<\n\nStill better than The Pope's Exorcist.",
            "Pretty large pile of shit. \n\nLove some schlocky Russell Crowe (See The Pope's Exorcist or Land of Bad) but this was basically irredeemable, some baffling directing choices, very little actual horror. David Hyde Pierce is solid at least and the premise of Crowe's character is interesting but doesn't really pay off in a meaningful way. \n\n1.5/5",
            "I didn't realize that the director is Jason Miller's son (and Jason Patric's half brother).  That makes it a more interesting idea.",
            "It's been a while since I've seen a film this dull. Or this dark. Not in terms of tone. Just in terms of lighting. It's got a dark tone too. I think. Hard to tell. Couldn't really see what was happening on screen about 60% of the time. \n\nI want to blame it being so dull on the fact that it was just being a string of clichés but I don't think that's the root cause. I mean, that's true-- this is a fully derivative film in every respect-- but so are lots of things and they're not as big of a drag as this film is. Scientists should study this, because it really was so dull that it almost crossed the line into being fascinatingly experimental in how phoned in and bland something could be and still technically qualify as a \"film\"... but then... it didn't.\n\nI wish the power of Christ had compelled the writer/director/producers to do something more interesting than this.",
            "Why did the priest sacrifice himself at the end?\n\nAnd who did Adrian Pasdar play?",
            "I love Russell Crowe movies, but this was pretty bad. A lot of the scenes tried building tension, but almost every one of them just went on way too long and delivered little payoff.   \n\nPlus, while the ideas might have been interesting (filming an exorcist horror movie, main lead getting abused/molested[?] in childhood and consequently struggling to face that trauma while filming), the execution of making them into a cohesive plot felt incredibly disjointed.  \n\nAlso, Sam Worthington and Adam Goldberg were insanely underutilized throughout the whole movie. I especially would have loved to see Goldberg’s dickhead producer character get a deserved comeuppance for constantly berating Crowe’s character.  \n\n2/10.  \n\n If I wanted to watch a demonically-belligerent Russell Crowe, I would have watched him sailing around the world on a tugboat finding cancer-ridden children to fight.",
            "Is this a sequel to the popes exorcist or no relation?",
            "It would be dull and forgettable if it weren't so infuriating.  The \"cursed film\" setup has so much potential to be subtle and creepy, but then there's an actual demon and it morphs into an incredibly generic possession movie.  Their in-universe remake of The Exorcist (not mentioned by name but they make it very obvious that's what it is) is also an incredibly generic possession movie, so the levels of mediocrity are a little hard to take. (ed. for clarity)",
            "I stupidly went to see this movie without reading up on it, thinking it was a sequel.\n\nTis was not. It was indeed a pile of shit",
            "Was Land of Bad good and/or so-bad-it's-good? Was tough to get a read based on the trailers on whether it'd be so-bad-it's-good or just a boring slog.",
            "He played the actor who died at the beginning. The one Crowe replaced. \n\nAs for the priest's sacrifice, it was probably intended to be a homage to The Excorcist. The priest in that did the same thing. This movie just didn't set up much reason for the priest to do it other than general  benevolence.",
            "No relationship",
            "Thank you so much, I appreciate it."
        ]
    },
    "Just watched The Autopsy of Jane Doe.....": {
        "title": "Just watched The Autopsy of Jane Doe.....",
        "score": 174,
        "url": "https://youtu.be/mtTAhXuiRTc?si=iLsI7gnj1RFeblFT",
        "content": "I kept hearing it's a very scary film. I enjoyed it's direction, makeup and performances from Brian Cox and Emile Hirsch, but other than that, it wasn't scary, like...at all. Maybe it's just me and anything that can happen in real life scares me. This was a little ridiculous. Thoughts?",
        "num_comments": 56,
        "comments": [
            "It's more of an atmosphere/tension sort of scare I think, instead of a jump or a visual or a concept you can't get out of your head",
            "I love this movie. I love the dread, the tension, the slow build and the gradual reveal of what's truly going on.",
            "Not super scary, but still a fantastic film. It felt like an X-Files episode, which is always a plus in my book.",
            "A great example of straightforward, fairly basic premise elevated through execution. I thought it was great and even my wife enjoyed it.",
            "I thought it was pretty terrifying ngl, especially towards the third act when they found out the truth. Besides that, i think it's more gory and disgusting because it deals with organs, dissection and etc...\nBut this movie still remains as my biggest suprise. 5/5",
            ">!Atmosphere, setting, sadistic manipulation and cruelty, human puppets on strings—everything I look for in a good witchy movie! I really like it.!<\n\n>!A bit like *The Blair Witch Project (1999)*, the events at the centre of *The Autopsy of Jane Doe*, the ones people tend to focus on—the flashing lights, power failure, paranormal activity, corpses re-animated, the \"accidents\" that happen in the funeral home—are all a diversion; the real underlying story—the mystery of the dead woman—is right there on the mortician's slab, hidden in plain sight, and beautiful Jane Doe herself doesn't have to move a muscle to tell it, she enjoys leaving that kind of work to others.!<",
            "I didn’t find it scary but it’s still a great horror movie.",
            "I just watched this for the first time a few days ago. I thought it was cool the way it was like a mystery movie that unraveled into a horror movie.  \n\nI don’t know, trying to say things were or weren’t scary is kind of a subjective mess to deal with and quantify.  I thought it was a good movie, it felt like horror should feel to me.",
            "One of favorites! I first saw it a few years ago during the rona lockdowns, and it was one of the only movies to actually *scare me* in years, and my oft-horror-hating partner loved it. I love how it takes place in a single location and how much spookiness is conveyed by the actress' facial expressions and body manipulations. Plus Emile Hirsch is *so* good. I wish he'd do more horror! Just an awesome movie, glad it has been getting the love it deserves the last few years.",
            "This is actually one of my favourite recent horror films. I think it was beautifully executed and had me in a chokehold throughout the whole film. The atmosphere is so uncomfortable and tense. It was one of those few movies that didn't leave me with a \"Meh, was alright\" but a \"Woah, that was great\". Shame you didn't enjoy it as much :(",
            "I'll watch anything with Hirsch in it.",
            "Was a good horror. I enjoyed it.",
            "Love it. It's athmospheric and creepy, that's what I like. I hate jumpscare bs, doesn't scare me just startles and annoys me",
            "First time I watched it, I thought I was a fun horror. The second viewing, for me reason, terrified me. I felt super uncomfortable. I wanted it to end.\n\nWhat's funny is that the part that scared me was the scenes when the two characters were just examining the dead body and talking to each other. I expected something paranormal to happen but nothing happened so the tension wasn't released.  It kept raising and raising. Well, I guess I just scared myself with my own expectations.\n\nThe actual ghost/paranormal scenes didn't scare me though. They were so typical.",
            "Reminded me a lot of 1408. Great ghost story",
            "I don't mean this insultingly or cruelly, but it will help you if you want to enjoy the horror genre more: work on your suspension of disbelief.",
            "Yep its usually recommended in this sub but I personally founded it pretty mid",
            "It’s pretty solid.",
            "Decent , but it tailed off a bit toward the end.",
            "As someone who has played a bit of Call of Cthulhu in my life, this movie has the feeling of a Call of Cthulhu one shot and I really dig it.",
            "Didn't thought it was going to be much then I watched it and I had to leave my lights on for a couple of days....",
            "Was good, love the isolation due to the storm, the enclosed almost claustrophobic space, the creep atmosphere and overall look and feel of the movie.\n\n Acting was top notch, including the 'witch' lady, and the story had me guessing what was going to happen. It's a good stand alone film and left me wanting more, I would have liked to seen a prequel and sequel.",
            "I just finished watching this 2 hours ago in Netflix, and then suddenly seeing this post in reddit now. What are the odds. Overall this is a good movie and greatly written.",
            "I loved that one. It's a movie, as somebody pointed somewhere, \"with such confidence on itself that relinquises almost completely any chance to drop jumpscares and relies most of the time in its capacity of creating an atmosphere almost for the books\"\n\nAlso, Brian Cox presence always improves any movie. ^^",
            "The movie is definitely great at creating a scary atmosphere, especially in the final act after the main reveal. I've already rewatched it once or twice and still had fun.",
            "Good movie. Had me thinking wtf is going on the whole time",
            "I love that movie. The bell 😃",
            "Great movie.",
            "I liked it, like the actors and it kept me interested but way too many: buildup music RAH LOUD NOISE JUMP SCARE. Like The Nun or some shit but better than that at least.",
            "I liked it. I watched it after playing The Mortician's Assistant on Steam (similar-ish premise). Good tension builder, any time they showed Jane Doe's face I had to brace myself for a jump scare.",
            "love this one",
            "Absolutely love this movie. Watched it like 5 times, and it's intriguing every time.",
            "Well, I thought it was the scariest movie I’ve seen in years…and I’ve been watching horror movies since I was six. Sometimes I’m not sure how young people define “scary” these days. Not necessarily a criticism, just honestly perplexed.",
            "Its just you",
            "If there ever was a movie deeply in need of a prequel, this is it.",
            "I hate posts like these.  Why even make it? Feels so self congratulatory. “Hereditary wasn’t even scary! What’s the big deal” type vibes. You already know people’s thoughts before you made the post.",
            "Great flick. Watched it not expecting much and was very pleasantly surprised.",
            "Cool movie. Not scary though.",
            "The corpse is beautiful",
            "If you’re more frightened of realistic horror scenarios, then yeah, probably not for you. Supernatural stuff scares me much more than grounded things, so it really worked for me. I feel you though. I can’t get scared of/enjoy things like Wolf Creek or August Underground. If I wanted something more plausible, thinking a cadaver got up & walked around might seem goofy to me, too.",
            "Fair assessment. But with movies like this l I’ve started to understand why horror and suspense are often categorized together. This kind of movie gets you do to idea of what is happening, not the in your face macabre. For whatever reason I just watched Hereditary and had a similar feeling. There were gnarly scenes but mostly it was figuring out what was going on that was the horror all along.",
            "I thought it was alright tbh",
            "I was pleasantly surprised. However, Joe Bob's breast count system was called into question. So dead breasts count?  Is it per scene?  The correct answers are yes and no.",
            "A horror masterpiece.  This movie really gave me goosebumps when I watched first.",
            "I'm a huge fan of horror films that show unreliable senses: Seeing/Hearing things that aren't there, seeing/hearing the wrong thing, etc.  That made me really enjoy this.  That's also why Oculus is one of my favorite horror films, it's hard to know if what you're being shown is the truth or not and that to me is pretty horrific.  I also enjoy horror films even if they don't scare me that much, just the philosophy of knowing WHY these things are considered horrifying is interesting to me.  The transition from \"Oh just another autopsy\" to slowly understanding the puzzle behind Jane Doe, eventually realizing they need to leave and then figuring out they are stuck struck a chord with me.",
            "Admittedly, I don't understand how a film can scare you. Disturb you, yes, the picnic scene in The House Jack Built lives now rent free in my head. Jumpscares? Sure, that's an irrational response. But actually being afraid IRL because of a movie? I'm sorry, it just doesn't happen to me, I cannot understand that process.",
            "I think the concept is scary too, subjectively of course. Particularly the scary part is the ending, much like with horrors like The Woman in Black, The Ring, The Grudge, The Haunting of Bly Manor. The concept of a human being that has suffered so much, they become pure pain, a force of nature that can no longer be reasoned or bargained with and yet you still try to. Will it work, or will the pure rage and suffering destroy you too? I loved it, I like this theme in horror.",
            "Even so I don’t really find it scary at all. Haunting of Hill House and The Conjuring did it better.",
            "I agree with you. It started off really well, but the unravelling of the \"mystery\" made ended up being exceptionally bland.",
            "Got too convoluted",
            "The reveal really did call for a prequel or something, digging into the lore! I would’ve loved a follow up about the process of the burial rites alone cuz that all felt very intricate and intentional.",
            "My missus and I both considered it to be pretty fucking boring",
            "Jane Doe was more atmospheric and psychological. It was a more subtle slow burn than a lot of modern horror. Comparing Jane Doe it to Hill House isn’t really fair since that was a series and had 10 episodes to tell the story and set the stage.",
            "it is really not good, everything past the autopsy scenes is full of tropes that make it really uninteresting to watch",
            "Like don’t get me wrong it’s not ground breaking and honestly I don’t think it really has that much going for it but it’s far from the worst I’ve seen.",
            "So? If it’s horror then it should be scary. If it’s not scary then put it as thriller or psychological. You also act as if other horror films can’t be scary and horrifying when it can like The Conjuring, Annabelle etc"
        ]
    },
    "Why some brains like horror movies": {
        "title": "Why some brains like horror movies",
        "score": 240,
        "url": "https://www.verywellmind.com/why-do-people-like-horror-movies-5224447",
        "content": "I recently watched a video and read some articles  that try to explain why some brains are attracted to scary movies and they go from the adrenaline rush (someone called us sedentary adrenaline junkies!) to the sense of accomplishment and survival once it's over. Maybe even morbid curiosity. What do you think is the reason you like horror movies? ",
        "num_comments": 100,
        "comments": [
            "The primary reason I watch horror instead of other genres when given the choice - horror really doesn’t have any rules, and I’ve seen so many fantastic horror movies made on a shoestring budget and are at the very least interesting\n\n But, it’s basically because - if I watch an action movie, more or less, I know what’s going to happen.  A drama or romance etc generally have like 2 or 3 ways they’ll “play out” once you hit Act 2.\n\nA horror movie may not even really show you what is going on until the end of Act 2.  It may change protagonists, it may change location abruptly and other options that typical genre films don’t have\n\nIt’s the unique aspect of horror that gets me to watch more of it than other genres\n\nThen if it manages to be truly unsettling or crazy, then, awesome.  But mainly here for the unique stories that typical genre films just can’t do.",
            "It's an escape mechanism for me. I'm a survivor of CSA and Horror has always been a good way for me to experience positive anxiety, knowing it's not real and will definitely end rather than the actual horror of my memories and the stress associated with it. \n\nIt's also a family thing for me, going back generations. Grandpa, Dad, me and my girls all love nothing more than a great horror movie all together, from gory or scary af, cheesy low budget and ridiculous dialogue or a mindbending psychological scare fest, we love it all.",
            "I have a special interest in death and related topics",
            "I put it down to being a sick fuck",
            "I like seeing what sick twisted shit some producers are capable of imagining.",
            "Honestly I just think the storytelling of other story arc types are boring. Horror has always been the style that actually keeps my attention and makes me want to read/watch it",
            "Seeing people go through the most fucked up stuff in a safe controlled environment makes me feel somewhat ok with (burden to some gift to others) life",
            "I’ve always said I like comedies and horror the best, and I feel like they’re two sides of the same coin, but it wasn’t until Jordan Peele talked about it that I felt like I could really explain it to people. He said the buildup is the same - you do the setup, and then subvert expectations. I thought that was so interesting. I want to be surprised. \n\nI agree with another poster, romance especially is so formulaic, I find it generally boring. I sometimes like drama, but usually I don’t want to feel my heart hurting from sadness because of what I’m watching. \n\nObviously, especially lately, there’s been more horror that digs into trauma and tragedy (Ari Aster for one), and I do enjoy those movies but I still mostly want to enjoy horror movies to be scared. I can be fully engrossed (hard to be half paying attention to horror), have some fun, be surprised if I’m lucky, and hopefully not get my heart beaten to a pulp.\n\nEdit: sorry, I thought it was OP who talked about other genres and their formulas.",
            "I find the controlled fear grounding; it can soothe my anxiety like almost nothing else.",
            "I have such a silly reason: my birthday is very close to Halloween so anything spooky, horror, Fall, Halloween-themed is like comfort food.",
            "I think of it as a creative exercise. What would you do differently from the characters, in order to survive at the end. Also, sometimes I just like indulging my brain in supernatural soup. I like unexplained phenomenon.",
            "I've always wondered why I like horror. I haven't really thought much about it. I just know I like it. But your response is the reason. There's no limits, it's unpredictable, who knows what's going to happen? It's that curiosity. I also like open world games where I can just wander as far as the eye can see, with no idea of what will happen next or what I will discover. Horror is the same for me but in movie format.",
            "A controlled fear and discomfort are fun. I am in no danger nor can i be hurt but i can either rally behind the survivor and hope for their safety or other movies i can sit back and enjoy a good actor playing a charismatic and terrible person. \n\nAlso i love how many risks horror can take, families they show, situations and survivors they celebrate! They feel more diverse than many other movies to me.",
            "Fun topic. \n\nI think horror just provides a safe space to explore the scary feelings that come along with navigating a scary world. I remember my employer hired a mental health professional to discuss resilience and coping during the pandemic. I looked into it after and apparently horror fans have better coping mechanisms in trying times. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7492010/",
            "I heard one element is people watch horror to forget about their own problems—essentially taking your mind off bad things in your life by watching someone experience something even worse. Applies pretty well to me, as well as morbid curiousity",
            "Part of the appeal of horror movies for me is that I feel like you can really enjoy the aspect of filmmaking itself - I don't usually get scared, so I can sit back and admire what they're doing to ramp up the tension, the kinds of shots that are used, stuff like that.",
            "When I was a kid, there was always a sense of terror and doom in my house (scary, drunk father). I never knew what might happen or when, so I was constantly in a state of anticipation.\n\nBut in a lot of horror movies, the \"bad thing\" is ultimately revealed. . . It's like putting a name to your fear. There's something tangible I can focus on and overcome rather than this general dread of not knowing what is going to happen.\n\nSo, for me, maybe a bit of the old childhood trauma nudges me toward the horror genre!",
            "For me it’s, my life sucks so why not watch a movie where everyone dies to make myself feel better.\n\nThat and the story tends to be out the box rather than some lame as$ let’s save the princess bull$hit cookie cutter Disney movie.",
            "I've always liked the horror aesthetic and inclusion of monsters. The genre has the ability to take plot  themes and imagery into unique directions. In most films, the highest consequence is useally death, in horror consequences can be from death, to brutal torture, losing ones humanity in a literal sense and going to hell. \n\nThere is also the benefit that the expectation of  characters to dieing lending greater significance to their choices.",
            "I dunno, just neat and stuff.",
            "They tend to have the best stories with the highest stakes. Also I’m more open to different types of endings with horror. In horror movies you’re prepared for terrible things to happen so tragedy doesn’t hurt as bad when and triumph feels twice as good.",
            "Personally, I like the thrill of danger without the real life consequences. I’m not a big thrill seeker outside of fiction.",
            "Its crazy, can tie in with almost any other genre, gives you a rush like you say, morbid curiosity as well for sure, i think for me it helps my anxiety, and creates some of the most unique and awe inspiring  creative processes you could think of.",
            "I use it as a coping mechanism. I have extreme anger so anytime I watch it each person killed is somebody that I hate and it makes me feel better. \nMy therapist said that's probably not a good idea. But if it helps you get through it, I'm okay with it.",
            "I like a few others am not easily scared. I have always loved how good horror films make me feel. I fell in love with horror when watching psycho at 3 am as a kid on AMC alone and in the dark, I loved it. I also love the genre because it’s a lot to it to just scare someone from a movie on a screen when they don’t feel their life is in danger. it’s the audience who chooses how they want to take it.",
            "I proudly wear the mark of the Sedentary Adrenaline Junkie.",
            "Watching horror movies is my coping mechanism.",
            "I find them to be comforting 🤷‍♀️",
            "I think I might just like the aesthetic, I guess? I do agree about the adrenaline rush when it comes to horror experiences. Like I love going to horror escape rooms for that adrenaline rush. And if I’m watching something spooky with a crowd then I can get giddy from the scares.\n\nEDIT: I think I figured it out! Suspense keeps me engaged. In another genre there has to be a hook to convince me to keep watching, but with horror, I know something spooky is coming so that’s already the hook. \n\nWhen I read books it’s almost exclusively horror because that anticipation of something scary coming is what keeps me reading. And same with movies: I’m always waiting on the edge of my seat to see what the scare will be.\n\n(And I prefer suspense in the form of supernatural horror because suspense that’s about like, realistic crimes usually just makes me depressed about humanity).",
            "I’ve read that the same neurochemicals responsible for loving feelings are also responsible for fear, it’s just that the brain frames them differently. When I feel lonely or upset, horror is very soothing and comforting, so it holds up.",
            "It’s controlled anxiety for me. I can’t manage it too many ways without feeling overwhelmed, but when watching a horror movie I feel like it’s..directed somewhere I don’t have to focus on it.",
            "I remember I had a friend who was a producer who didn’t like many horror films and he was specifically telling me about how he hated the film mother! As he was talking he kept saying the movie was like a nightmare, like a recurring nightmare he had, where he is told to do the same thing repeatedly by some malicious force.\n\nWe kept talking and this guy said he has nightmares like 5 or 6 times a week, and that is why he hates horror films, because he already deals with nightmares, almost every night.\n\nAnyways, I myself have about one nightmare every 3 years. I have nightmares so rarely that I get really excited when I have one. I came to the conclusion that night after that conversation that the reason I like horror films is that it’s like filling a need I have to be scared, something my subconscious won’t do for me in the dream world.",
            "Because I like stories tbh.",
            "I don't like horror, I LOVE horror. Id lust horror if it wasn't weird.",
            "it's the exploration of the \"What if bad things happen\" scenario",
            "The main reason I watch horror is cuz it’s a habit I grew up with horror for close to a decade and I’ve watched most of the horror on Netflix I’d say\n\nAlso most of the time I like horror it’s usually creative and interesting even some horror movies are so bad there good like the leprechaun movies I watch horror usually around Halloween",
            "For me, it all started literally at birth... I was born on Friday the 13th and my name is Jason.  I was born well before the movies though.. So eventually one of my friends I stayed the night with had me watch part 2 or 3 one night, mainly for the bewbs lol.. But I liked being scared, and so from about the age of 10 or so I would watch all the scary movies I could.  Other movies just bore me.. I mean come on \"oh.. The bad guys shot 1000 rounds at the good guy, and he stands up and kills 8 people with a six shooter\".. boring.. Now how about \" oh shit, she is trying to save her friend who is tied to a table, bad guy is coming, she hides under the table and listens to her friend scream as he is carved up like a Thanksgiving turkey \"..",
            "Horror movies haven't scared me in a long while...so none of what you mention refers to me.I think i just like them for the supernatural aspect.And that it goes beyond what others genres avoid.",
            "It could be all of the above for any of us. I don't want to repeat what I've read in the replies so far, so I'll mention that the horror genre has always been the best to take a date with you.",
            "It’s the hardest genre to get *right.* But when it’s right, it’s a completely unique experience.",
            "Horrors stories are, imo, the most varied and out there. \n\nThere's horror movies about damn near everything. It's like the Rule 34 of movie Genres.",
            "I like weird shit. I like being scared.",
            "As someone who also listens to extreme metal, I think it's kinda like enjoying spicy food. It's a controlled, safe form of discomfort. I can be sitting in rush hour traffic, listening to the sound of society imploding.",
            "I was terrified of horror movies as a young kid. My parents wouldn't allow me to watch any of them and the rare moments I could catch a glimpse on a trailer or something, or if I managed to stay late at night and stumble upon one on TV, I was spooked to my bones.\n\nAfter I got like 20-21 years old, I thought to myself that I have to overcome this fear by trying to watch some of the classics and get desensitized of some sort. Movie after movie, the adrenaline rush and the jump scares started being fun instead of spooky and after almost 10 years of watching horror movies, this is the only genre of movies I will consciously watch. I might watch a blockbuster movie of another genre if I stumble upon it, but when I want to relax, horror is my comfort zone.\n\nSo for me, I think it's something you can build up instead of being \"wired\" from the very start.",
            "Because reality is boring and I wish things like this would actually happen sometimes.",
            "Theoretically, werewolves and terminal cancer are equally deadly. Cancer is real, but it’s a fucking bummer. Werewolves are fictional, but they are cool and a vastly preferable way to rage against the dying of the light. Give me werewolves over cancer any day.",
            "I just watch it for the thrill",
            "I have a theory called the \"Caveman\" Theory. Humans have evolved to the point where true fear and terror has become super rare. It's so rare that our brains have forgotten what it's like to experience this. This feeling was key to our survival as hunters and scavengers. When we watch horror movies we trigger that genetic memory of pure terror which gives us that adrenaline rush.",
            "Two reasons for me.\n\n1. Desensitization. Violence, gore, and other \"scary\" things in media don't have the impact they used to. I can recognize when something is scary cognitively but not feel it, if that makes sense. I seek out media to challenge that. Certain video games can still get to me when I'm in the mood. I have to dig for films. I suppose \"sedentary adrenaline junky\" would be apt here, but I can't remember the last time I got a rush from a horror film.\n\n\n2. I prefer experimental art. Horror is a space where cultural transgression can thrive as its purpose is to shock. Pushing boundaries is woven into the genre, thus it's a great way to express sentiments that go against societal standards. Horror is likewise something that can be done on a low budget. Anyone with a cellphone and internet connection has the essentials to shoot and distribute a horror film. Its accessibility makes the genre varied like no other, where alienating the general audience isn't much of a risk compared to other genres.",
            "For me, it's a genre that can seemingly take any other genre or sub-genre and manage to fit it into itself.   \n\nIt can subvert almost anything and make it scary, as someone else said, there are no (or very few) rules.\n\nDepending on my mood, there is always a horror film I can watch, but I need to be in a certain mood for other genres as a whole.",
            "For me it's getting to have feelings I can't get anywhere else. For example \"that scene\" in Exorcist III. Where else in normal life can I get that feeling of holy shit?",
            "I like to live on life’s edges.  Maybe I have a death wish. Who knows?  Maybe cause my parents didn’t approve…🤷🏻‍♀️",
            "I’m kinda gross 👹 that’s why I watch bruddah 🤙🏾",
            "Masochism",
            "I think for me I always found taboo stuff interesting and wanted to see it, and when you’re little one of the most taboo things to watch is a scary movie with death and blood and monsters, so much so that even asking to do it would get you shut down and reprimanded.\n\nSo then being able to watch one meant having to be careful and sneak a video or a DVD away late at night to see what all the fuss was about, and even though it could terrify you and give you nightmares and make you look twice to see what’s in the dark waiting, it’s exhilarating!\n\nHere’s something that makes you feel something raw and genuine, not just a giggle at a joke or a gasp at an exciting explosion, something deep and primal that turns your stomach and makes your hair stand on end and send shivers up your spine. People with shoestring budgets and rubber masks and a can do attitude creating art out of nothing that latches onto your brain like a spider onto a fly and leaves lasting memories to haunt you late at night.\n\nI’ve seen a whole bunch of films from a whole bunch of genres and places and people, but nothing ever compares to a horror film because deep down maybe some of us don’t laugh that much, or some of us don’t weep, or some of us don’t care for action and intrigue, but deep down everyone has something they fear.",
            "I think horror allows an in depth observation of the human condition. Horror movies are capable of pulling back so many layers of humanity in our fears, desires, wishes, hates. I think the horror genre has some of the best takes on being a good human and morality. What people do under distress and how they combat or cope with internal and external forces.",
            "I feel every other emotion often in life. There’s sad times, exciting times, happy times, romantic times, etc. \n\nI almost never feel scared. Which is what I get out of horror movies.",
            "Blood and gore pretty 😊",
            "dovetails nicely with the 24/7 dark industrial drone, 16 hour day, and randomly strobing colored lights I live in. non-horror soundtracks / dialogue don't mesh with my vibe",
            "I like the chaos.",
            "No reason to study why one enjoys horror movies, we just do. Doesn't mean we're any different from someone who enjoys comedy, drama or even musicals. Why must people try to over complicate or explain something that really has no explanation. Not everything can be explained from a small sample size study.",
            "Saw a Stephen King interview where he said essentially the same thing. You never quite know what you’re in for with a horror movie (or book, tv show, etc)\n\nAlso provided this gem of a quote - “the worst horror movie I’ve ever seen was still a great fucking movie.”",
            "That’s the same draw for me. I’ve been a horror fan since seeing Evil Dead 2 at 8 years old, a film that epitomizes the “anything can happen” allure of the genre.",
            "![gif](giphy|3o7aTkjnoAzNaxPes8)",
            "I just had a similar conversation with my partner over The Outwaters and The Beach House, among a couple others. She hated Outwaters, and for extremely justifiable reasons. Same as Skinamarink, I totally understand if people don't like it. But the way I see it, if you're telling a cosmic horror story, why should the things you do end up seeing make any sort of sense? If something beyond mortal ken is involved why does it always do things in a typical narrative fashion? I think any actual encounter with Something would end up looking a lot more like the Outwaters than we think, and that's the thing that's so compelling to me. As someone who tends to prefer cosmic horror over most other types, you can have $5 and a dream and still make a compelling horror movie as long as your idea is good enough. And there will always be a subset of people that enjoy it, because horror is so open to interpretation that most things will resonate with at least someone, so you're rarely going to produce a complete failure. Even something like The Beach House, which I felt was marketed horribly for what it actually turned out to be and was actually fairly disappointed with at the end of, had a solid idea for a good cosmic horror idea and went for it, and I appreciate that immensely. Seems horror directors are much more likely to just full send on a completely batshit idea, like Glorious and their gloryhole Elder God. \n\n\nThis is not a shill for Skinamarink or The Outwaters, they're not good movies for the vast majority of people. I use them here because they really commit to the \"we're not going to show you and you're not going to understand\" and I love that in movies, but it is not to everyone's taste and not everyone enjoyed how these movies portrayed it.",
            "Thanks for that. I don't know that I've ever been able to nail down exactly why I love horror, and I think your words are it",
            "A lot of weird reasons others are listing, like being sick or into dark things, but to each their own.\n\nYou explained why I like it well, it is all about he freedom to do whatever. A lot of movies are formulaic and it makes them stale. Not every story needs to needs a love story or have the 'good guys' winning, let alone have good guys at all. It allows for a much more interesting story.",
            "everything you said is right but whats crazy is horror can also be very predictable but it still has this aura about it that keeps you watching. Ive seen so many horror movies that ive predicted to a T and still got to the end and felt like i watched a great movie. Its like even when we know for sure whats gonna happen the slight chances that we are wrong gives us the urge to keep going.",
            "This is pretty much true for me as well. Horror explores realms of the surreal, fantastical and spiritual, it goes places and does things that other genres don’t. The adrenaline rush is a great bonus, but it’s not why I keep coming back to horror.",
            "> horror really doesn’t have any rules\n\nAnd with Hollywood being always defaulting to tell stories about white men, horror doesn't have to follow any of that.  (btw if you're someone who just had a vein just pop in your temple, the word \"defaulting\" is the issue.  If you're that person, settle down.)\n\nHorror is very inexpensive to make compared to other genres, and audiences are willing to watch for the thrills, instead of for known actors, and filmmakers can tell the stories they want to tell, and with the actors they want to use.  Like Ben in Night of the Living Dead (1968), and then Barbara in Night of the Living Dead (1990).\n\nYou just about cheer when Ginny turns the tables on Jason in Fri 13th Part 2.  Or the triple-twist in The Blob (1988) that results with Shawnee Smith triumphant.\n\nIt leads horror fans to seeing movies that can do anything and go anywhere.  Most often, in a world in which remakes and reboots rule the land, in horror, you can see films you have literally never seen before, and have no idea how they will end.  One movie, is a perfect example of that, A Girl Walks Home Alone at Night (2014).",
            "VERY well said. I was 8 when I saw my first terrifying film. 1963 black and white The Haunting. Every adult we've shown it to has been freaked out. I'm also lucky that my mother weaned me on tv like One Step Beyond, The Veil, Twilight Zone, Outer Limits. Then I found some others: The Invaders, The Addams Family, Bewitched, Shadow Chasers - which I KNOW Chris Carter (X-Files) watched and took notes from. It is a drug though. I went from Bewitched to The Walking Dead and Dexter. But for me, the BEST show nothing. They allow your imagination to take over, and create a sense of dread in your own mind. Jacques Tourneur and Val Lewton were masters at this. Check them out; you won't regret it. Gotta warn you; not gratuitous sex or violence. There is violence, but it isn't slasher or gore.",
            "Preach!",
            "Well said",
            "The “safe fear” aspect has always been huge for me. I’m also a trauma and CSA survivor with a ton of anxiety and general fear. Horror gives me, at least temporarily, a sense of resolution to those feelings. I’m giving myself something concrete and identifiable to be anxious about or scared of, rather than the nebulous sense of dread. I also tend to cope with my anxiety through preparedness, wanting to feel like I’d know what to do or how to survive in all manner of emergency situations. Horror gives me so many opportunities to indulge that.",
            "This is spot on for me, too. I also lived through CSA and have loved horror since I was a kid. It was a great way to channel my fears and anxieties. \n\nAlso, they're just so much fun!",
            "Yup yup. CPTSD crew. “Normal” shit is too hard for me to suspend disbelief with.",
            "Also a CSA survivor and horror has always comforted me. It started with Goosebumps and my love for the genre has just grown and grown.",
            "I am a survivor of child abuse (though not SA) and I feel like I can identify to what is described here. My therapist finds it odd that I am looking for fear in movies. After giving it much thought, I figured that in most horror movies (those with a good ending anyway), the psychological journey of the protagonist is one where he/she goes from being a victim to becoming a survivor.",
            "That's what my therapist said too - horror allows you to go through the anxiety cycle in a healthy manner where you're in control.",
            "As do most people, which is why it's weird that it's taboo.",
            "Not that there's anything wrong with that",
            "Yeah I'm into the sick shit. Don't kink-shame me 😂",
            "Yep, nothing better when you're sick than staying in bed, watching horror movies and fucking.",
            "I think it's this for me, too. Horror films usually aren't as tightly constructed as other types of films and there's an element of uncertainty that allows you to imagine your own response and fear to the situation portrayed. To use a metaphor, a horror film is more a sketch compared to the completed painting of something like a Rohmer film. I don't mean this in a sense of it being lesser, but that it allows you to fill in the gaps in the same way you can imagine a finished product when looking at a sketch.",
            "I've found out a lot of women including my gf love murder mysteries. One explanation I heard was very similar to yours. Basically, learn what evils are lurking out there to better protect yourself in real life.",
            "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^UncleMonkey13:\n\n*I proudly wear the*\n\n*Mark of the Sedentary*\n\n*Adrenaline Junkie.*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
            "Dude, when I have nightmares, they are extremely vivid. I usually wake up and tell my wife about the awesome fucking nightmare I had.",
            "I thought *mother!* was exactly like a nightmare, and that's one of the things that make it so good. It had my stomach in a vise of tension and dread of what could happen next. Afterwards, I was so freaking impressed by it! Some people say the metaphor was heavy handed. Even if that's true, it was so well done it doesn't matter.",
            "I have nightmares every night. Since I was about 6 I think. I had a horrible childhood so for me personally it's not the nightmare thing. I did try and stop watching Horror for a short period because everyone kept telling me that why I was having nightmares. It wasn't and they didn't stop lol. So now I'm back to enjoying the movies I love and just dealing with the nightmares as they come.",
            "I would guess that he was probably taking about *The Shining,* which he loves to hate but knows it's still a masterpiece",
            "I dunno man I've seen like 50 god-awful horror movies",
            "Ah, but that's just the slasher sub-genre, not horror as a whole.",
            "You said exactly what I was thinking about recently. \n\nI’ve watched enough horror movies that now I’m just looking for new and weird ideas instead of high scored movies because most of the time they are cliché. \n\nAnd by doing so it made me realize that, not every horror movie has to resonate with everyone, *ANYTIME*. There are some movies that I never liked before because I just didn’t get the ideas, now give me existential crisis simply of the thoughts they’re provoking. My experience in life has changed my perspective and these movies now resonate with me! How wonderful.",
            "That makes so much sense why I started watching and liking horror movies. I hated em as a kid. \n\nAs young adult, I was living by myself for the first time. In the middle of nowhere, miles away from another human. The ghost on screen has nothing on that weird noise I heard out back!",
            "Same, it's not healthy to pretend it doesn't exist imo. Then again, I'm neurodivergent so why we follow social norms has always been a little mystifying to me personally 💀",
            "r/unexpectedseinfeld",
            "-sanest Human Centipede gooner",
            "Yeah, has this man seen Sledgehammer?"
        ]
    },
    "Best horror movies that a devoted horror fan has probably not yet seen?": {
        "title": "Best horror movies that a devoted horror fan has probably not yet seen?",
        "score": 466,
        "url": "https://www.reddit.com/r/horror/comments/1dl7qhy/best_horror_movies_that_a_devoted_horror_fan_has/",
        "content": "Which movies do you think are, borderline defining, of the horror genre, yet they are the most probable to have slipped from your typical \"horror afficionado\"?\n\nFor example, my favorite subgenre is found-footage, but I only recently discovered \"Hell House LLC\", which I can safely say is a great representative of the genre.\n\nWhat are your picks that you believe are almost unanimously considered great horror films, but have probably evaded many horror fans, due to distribution/release timing/language e.t.c.?",
        "num_comments": 599,
        "comments": [
            "Dead & Buried",
            "I feel like **Dust Devil** doesn't get mentioned nearly as often as it should be, but I don't know if that's because people who have seen it had the misfortune of watching one of the truncated versions rather than the director's cut and so write it off as crappy.\n\nAlso, **Dellamorte Dellamore** aka **Cemetery Man** seems weirdly slept-on.",
            "Absentia!",
            "A personal pick that I think is great and made me stressed is the FF movie “Final Prayer” (or its other name: The Borderlands) from 2013.\n\nEdit: fixing the alternate title.",
            "Not that it’s super unknown, but Frailty (2001) is one that flies under the radar for a lot of horror fans.  Very dark and disturbing, but really well done and Bill Paxton did a great job starring and directing.",
            "November (2017) Kanopy/NightFlight  \n\nMagic (1978) Amazon prime/AMC+/Peacock - an early Anthony Hopkins film.\n\nThe Little Girl Who Lives Down the Lane (1976) Amazon prime/Tubi - an early Jodi Foster film.\n\nBedevilled (2010)  Plex \n\nAutohead (2016) \n\nThe Sentinel (1977) Amazon *rent*\n\nThe Entity (1982)\n\nThe Ninth Configuration (1980) Amazon prime/Tubi/Kanopy",
            "The Pact (2012)",
            "Let's Scare Jessica to Death\n\nScream of Fear\n\nJug Face \n\nGlorious \n\nA Lizard in a Woman's Skin",
            "- Chaser (South Korea) is a cat and mouse movie as the title implies. So much tension from beginning to end\n\n- Mockingbird (pretty sure this is the first film of Bryan Bertino who directed The Strangers and The Dark and the Wicked). It's found footage.\n\n- Crimes of Passion - a Ken Russell film starring Kathleen Turner and Tony Perkins about a killer prostitute. The whole vibe and look of this movie is so cool\n\n- Son - this might have been straight to Shudder but it's great. Different people are trying to abduct a little boy and you spend the movie trying to figure out their motives. Turns what you think you know on its head.\n\n- The Feast - mother nature takes her revenge and it's fucked up\n\n- ATM - 3 friends are trapped in an ATM kiosk late at night with their would be killer standing outside. The walls are glass. What to do?",
            "The nameless.... \nPsychedelic Hooror\n\nand all the alex.de la Iglesia movies :\nEl Dia de la bestia\nAccion Mutante\nBest Fun-Horror like Return of the living dead",
            "Messiah of Evil.",
            "Night of the Demon (1957). I think many younger horror fans may not know of this one or avoid it because of its age. NOTD is a classy, intelligent and spooky film based on a classic short story (Casting the Runes by M R James). Still holds up extremely well.",
            "The Blood on Satan's Claw (1971) and Alice, Sweet Alice (1972)",
            "Hatching (2022) which I think is a Finnish horror is one of my favorite movies. It’s maybe not the scariest but it really struck a chord with me. it’s not one I ever see mentioned either.\n\nHatching is the best depiction of what it’s like to grow up with a narcissist mother. I feel like most narcissists in movies are the most extreme example, where there’s never doubt. So much so that I’d even argue that most are actually beyond just narcissist and are socio/psychopaths. This movie depicts what an everyday or high-functioning narcissist looks like. \n\nIf you are a daughter of a narcissist mother, I think the metaphor will likely strike a chord with you too.",
            "DeathDream aka The Night Andy Came Home.  Bob Clark's spin on The Monkey's Tail.  \n\nThe Last Broadcast.  Got stuck in the glut of found footage, but worth a look.",
            "Giallo in general is criminally overlooked when it was fully responsible for the slasher boom in the 80s \n\nBay Of Blood (1971)\n\nBlood And Black Lace (1964)\n\nTorso (1973)\n\nThe Strange Vice Of Mrs Wardh (1971)\n\nDeep Red (1975)\n\nTenebre (1982)\n\nThe Bird With The Crystal Plumage (1970)",
            "LAMB 🐑 \n\nIts so good and so strange for people who like slow burn type movies. I love it.",
            "Blue my mind (bodyhorror and from switzerland, i dont really see anyone ever talk about it ! It is only bodyhorror tho, not any other kind of horror) and cobweb - i genuinley found it so scary",
            "The Changeling (1980)\nThe Devil's Backbone \nThe Orphanage \nCarnival of Souls\nDead and Buried",
            "Birth/Rebirth needs more love",
            "More horror/comedy, but I loved Beyond the Mask: The Rise of Leslie Vernon. Found footage about a documentary team following a serial killer who agrees to be filmed.",
            "I’d bet a lot of horror fans have never seen the original Frankenstein 1931.  It holds up really well and is worth watching. A true masterpiece of filmmaking.",
            "Butterfly Kisses-found footage",
            "Typically foreign films like Noroi",
            "The Lodge came out, I think, right as the pandemic was hitting, so it was pretty overlooked. It's on MAX.",
            "I may be wrong, but I don’t think Dog Soldiers has had enough love from the more broad horror world.",
            "The Empty Man. Criminally underrated.",
            "I think I understand what you mean, so not necessarily a hidden gem but like something quasi-essential but not seen as much. The McPherson Tape for found footage. Most people more or less will look to Blair Witch as the oldest they're willing to go for found footage but The McPhereson Tape is from 1989 (although a good remake was also made in 1998 that's worth a watch) and is a very effective movie I think. \n\n  \nFor Wes Craven I'd say People Under the Stairs or New Nightmare. The former is very ahead of its time in a lot of ways and has a lot going on, but if you look at Craven films by popularity on letterboxd it isn't in his top 10 most popular despite having an average rating as his third best. Likewise, New Nightmare is in the top 10 of popularity but just barely, but everything he does in Scream has a genesis point in New Nightmare.",
            "I probably need to rewatch it to be sure but I remember Splinter (2008) being well acted with a good monster and I never hear anyone mention it 🤷‍♂️",
            "Really enjoyed Caveat (2020). Very different and odd but creepy throughout.",
            ">Best horror movies that a devoted horror fan has probably not yet seen?\n\nmajor blindspots tend to be foreign horror and older films that aren't recognized for their influence on horror subgenres.\n\nhangover square and the spiral staircase come to mind as thriller/mystery today that were precursors to slasher films. kuroneko and les yeux sans visage are probably more likely to be overlooked by horror fans who just see films in english.",
            "Vuelven and Huesera are really good, but not super mainstream since they're mexican.",
            "Kill list.",
            "Don’t Listen (2020)",
            "The Wretched. I adore this movie and will talk about it every single chance I get!",
            "Sator 2019",
            "A Bay of Blood (1971)",
            "The Pit (1981)",
            "I always suggest Incantation whenever I can. Great found footage horror combined with the whole supernatural / religious cult element.",
            "Night of the Leepus",
            "I like the Spanish horror film, REC, from 2007.\n\n\nThe Spanish horror movie PIGGY, from 2022, was also good, however, it has some triggers, which sensitive people can get upset about, definitely different from other movies.\n\nAnd the Spanish horror film The Platform from 2019, is a must see film.",
            "A Dark Song (2017)",
            "Sublime",
            "Dirty Jersey, 100%. Went completely under the radar but its got really sick practical effects and great acting for unknown actors.",
            "Another heaven (2000)",
            "Strigoi",
            "Below(2002)",
            "Tourist trap, puppet master 1&2 (3 is great but I don’t consider it horror), phantasm 1 and ESPECIALLY 2, southbound, the dark and the wicked",
            "The Manitou",
            "The original Black Christmas was a huge blindspot for me, a lifelong horror fan, until I picked up the Shout 4K a few months back. What a perfect horror film. I found it truly terrifying.",
            "I don't know if it's considered horror, but Pawnshop Chronicles is really good.",
            "Dead Man's Shoes (2004)—a British film.\n\nHarrowing and heartbreaking; awful goings on, in a small town in England. Hurts to watch this one, man.",
            "Murder Party (2007)",
            "the sadness",
            "Starry Eyes - Super awesome and a bit nasty.\n\nThe serpent and the Rainbow - Coll zombie movie with a scary dream sequence.",
            "Nobody ever talks about this (even old guys like me), but the tv movie Don’t Go to Sleep (1982) with Dennis Weaver, Valerie Harper, and Ruth fucking Gordon is so overlooked. It never got an official release on any platform that I’m aware of but it’s on YouTube. You’ll never look at pizza cutters the same way again!",
            "John Dies At the End",
            "Japanese horror is usually uncannily phenomenal. Automatic watch for me if I stumble upon one.\n\nThe Slit Mouthed Woman stuck with me. Just learned there’s a sequel.\n\nhttps://m.imdb.com/title/tt0891520/\n\nBased on a real folk tale.\n\nKuchisake-onna (口裂け女, 'Slit-Mouthed Woman')[1] is a malevolent figure in Japanese urban legends and folklore. Described as the malicious spirit, or onryō, of a woman, she partially covers her face with a mask or other item and carries a pair of scissors, a knife, or some other sharp object. She is most often described as having long, straight, white hands, black hair, pale skin, and otherwise being considered beautiful (except for her scar). She has been described as a contemporary yōkai.[1][2]",
            "The Eyes Of My Mother \nI haven’t known anyone else to have watched this and this movie has stuck with me for many years.",
            "Tucker and Dale vs Evil",
            "I have a list on Letterbox called _Metaphysical Angst Caviar_ with somewhat hidden gems:\n\nSummer\n\nSpring\n\nBad Milo\n\nThe Beach House\n\nPontypool\n\nAwait Further Instructions \n\nPossessor \n\nPossession\n\nThe Block Island Sound\n\n\nhttps://letterboxd.com/sltfilho/list/metaphysical-angst-caviar/",
            "I just watched Deadstream on Shudder and the main dude's acting is on point for the movie. It's a comedy/horror done right. I quite enjoyed it and FF is low on my list of horror subgenres.",
            "Probably silent era and early black and white films. There are some horror fans who outright refuse to watch anything before [insert arbitrarily chosen year here].",
            "Crawl Or Die (2014).  It's the most claustrophobic movie ever!  A group of soldiers are chased through ever decreasingly sized tunnels be a badass alien.  TANK is up there with the best of them.\n\nLowlifes (2024) an unexpected gem this one, go in blind, it's brilliant.\n\n8 Found Dead (2022) a clever movie with two brilliant lead characters.\n\nSummoning The Spirit (2023) got some Midsomer vibes of this, a bereaved couple retreat to an isolated life in the woods and are befriended by a freeliving group that pray  to a forest spirit.   \n\nBlack Mountain Side (2014) brilliant horror series on the Arctic, anyone that enjoyed The Thing must watch this one.",
            "Creep\n\n![gif](giphy|l1J9tsDsEeW5B5C5G|downsized)",
            "Here to extol the wonders of Pyewacket. Not an amazing movie but decent and a lot of people who watch it always ask how that flew under their radar.",
            "I'm a big fan of The Ruins & I think it's definitely one of the more underrated 2000s horror films",
            "Birdboy: The Forgotten Children\n\nIt's not really pure horror, but it has enough horror aspects that I would call it animated horror. Now that subgenre in general is pretty lacking in entries but even when it gets discussed it's always Mad God or The Wolf House (which are both great don't get me wrong). Birdboy gets its horror elements from visual metaphors and it's more depressing than anything, but I'll never miss an opportunity to recommend it as I think it's brilliant. Unicorn Wars is also really good \n\nAnother animated horror film that's even less known is Kill It and Leave This Town, which is the most nightmare-like film I've ever seen, swamped in dream logic and surrealism, and completely devoid of colour. I have a harder time calling it brilliant because it's completely indecipherable, but I do applaud how disturbing and purposely lifeless it is. The film feels completely devoid of joy in the same way that it's devoid of colour, and it has some genuinely shocking moments. I talk about this film all the time, it's so fascinating to me",
            "Dead and Breakfast, OMG We're in a Horror Movie, Slashers (2001 with Sarah Crowder), Deadstream, and Hansel and Gretel Get Baked\n\nDefinitely Lowlifes on Tubi. One of the best horror movies I've seen in a long time.",
            "Angst",
            "Demons",
            "Cemetery Man- not talked about enough and actually better on subsequent views. So many little details and crazy dialogue. Also crazy foreshadowing like the snow globe to appear in the opening credits. \n\nA Field In England \n\nThe Endless \n\nPossession \n\nCalvaire \n\nGlorious",
            "For those who like horror / fantasy and oddball cinema, seek out the Directors Cut of Clive Barker’s Nightbreed (1990). It’s based on his Cabal novella. It’s a campy, surreal love letter to weirdos and demons that haunt the night.",
            "Shallow Ground for sure, and perhaps Scanners and Cronos?  Idk why but I feel like I don’t see many people talk about those two despite them being pretty important movies from very big name directors.  As far as cronenberg, i usually see people talk about videodrome or the fly before Scanners.  But shallow ground is genuinely pretty obscure but very worth watching imo.",
            "Afflicted (2013) for one that hasn’t been mentioned. It is actually a really great ff film that I never see people talking about…",
            "Hellbender",
            "I’m American and I find foreign horror films aren’t really something the casual fan watches, but Gonjiam Haunted Asylum (South Korean film) was the scariest thing I’ve seen in years",
            "Burnt Offerings (1976) doesn't get enough love!!",
            "**Mainstream**\n\nTriangle (2009)\n\nCold Prey (2006)\n\nThe Interview (2015)\n\nCreep (2004)\n\nDon't Look Now\n\nLove Object\n\nPontypool\n\nMay\n\nReeker\n\n**Found Footage/Mockumentary**\n\nHorror in the High Desert\n\nAlien Abduction: The McPherson Tape\n\nThe Poughkeepsie Tapes\n\nNoroi: The Curse\n\nMy Little Eye\n\nSavageland\n\nMortal Remains\n\nThe Borderlands (2013)\n\nAntrum\n\nRorschach (2016)\n\n**Bloody & Violent**\n\nFrontier(s)\n\nCaged (2010) AKA Captifs\n\nMacabre (2009)\n\n**Comedy**\n\nDead Snow\n\nThe Cottage\n\nHatchet\n\nInbred\n\nTucker & Dale vs Evil\n\nFeast\n\n**Some people seem to hate but I like them**\n\nYellowBrickRoad\n\nEvil Things\n\nThe Outwaters\n\nWelcome to the Jungle (2007)\n\n31",
            "Duel (1971)\n\nOld, but damn is it still good.",
            "Not the scariest or most extreme, but for FF and commitment to the medium: Creep and its sequel. The character development, dialogue, the suspense, and (most surprisingly) the humor is just top notch. Laughed and was freaked out through both movies. Pure enjoyment. And was legit still on edge hours later getting a glass of water from the kitchen (much to my embarrassment).",
            "Speak no evil. Only came out a couple of years ago and they're already remaking with James McAvoy",
            "Marebito is very intriguing. Stays with you.",
            "The Vigil is one of the scariest little-known horror movies I’ve ever seen. It actually ranks up there in my top ten of all time- The way it used silence to evoke dread was second to none! Watch it alone with the lights out in a quiet house. Good luck!",
            "Session 9.",
            "Dead girl",
            "#what you wish for",
            "The Johnsons",
            "Prophecy (1979)\n\nThe Horror Show (1989)\n\nThe Ninth Gate (1999)\n\nRec (2007)",
            "The Vanishing (1988)",
            "Contracted \n\nDarkness ( 2002 ) \n\nThe Shrine \n\nYellowbrickroad\n\nThe Ninth Gate \n\nThe various films of the New French Extremity have finally gotten recognition, but if someone avoids foreign films , they  would still be under their radar, so I think films like \"Inside\" , \"Martyrs\", \"Haute Tension\" might count",
            "Deadgirl",
            "Hardware (1990)",
            "I only saw Kiyoshi Kurosawa’s CURE about two years ago, despite being a lifelong fan. Check it out!",
            "The Golden Glove",
            "Anguish",
            "Moon Garden",
            "Dead & Breakfast.  It's like Shaun of the Dead, but doesn't feel like a ripoff just because they are combining zombies and comedy.  It has its own feel to it, it's funny as hell, and just a good zombie movie.",
            "Two evil eyes",
            "As a huge horror fan, watching so much of slasher, monster, supernatural, etc… all I’m looking for is something to introduce my gf into. I mean beside your normal conjuring or insidious etc.. I’ve seen as much as my mind can hold. But what’s starters for her? My original and favorite is “killer klowns from outer space “",
            "DEATHGASM.",
            "Exorcists I was 5 when I first saw it. Technically I snuck viewed it.",
            "Cemetery Man\n\nAnguish\n\nHouse",
            "Stitches, a classic horror / comedy that is not quite B movie territory but delivers. Seen it 6 times lol",
            "Inner Demons! (2015)\n\nIt's a found footage/demon flick and yeah it has a few cliches but I thought it was pretty good for a low budget horror",
            "Case 39\n\nEli (2019)\n\nPopulation 436",
            "Invaders from Mars (the remake)",
            "Begotten (1990)",
            "Brightwood, on Amazon. I can't imagine it ever got a cinematic release as it doesn't feel like the kind of movie that would but it also doesn't feel like a made for TV job. Cracking little microcast Predestination-style horror with a nice slow reveal.",
            "Spoorloos/The Vanishing (1988)",
            "The Orphanage is one of the best horror movies, no, best. movies. period. I've ever seen. But since it's in Spanish, I'd imagine many haven't seen it.",
            "I can think of a bunch but my pick for this thread is The Innocents (2021).",
            "From Beyond (1986)\n\nVirus (1999)\n\nWer (2013)\n\nThe Void (2017)\n\nThe Ritual (2017)",
            "Dead Set. \n\nUK zombie horror comedy tv show set in the big brother house",
            "Iron man (1989)",
            "Zombeavers. Ridiculously good !!!",
            "Rituals (1977)",
            "Here's a scary memory that still sticks with me.\n I had to watch the original night of the living dead when i was 8, with my older siblings and cousins, at my grandmother's house, which was 3 blocks from the Evans City cemetery. That's the location where they filmed the cemetery scene. I still get chills thinking about that.",
            "creepshow 2 mainly the raft and hitchhiker.. \"thanks for the ride lady!\" lol",
            "Haunt (2019) is pretty good! I don't hear it talked about often, but I think it's a fun one. Grand? Probably not, but fun!",
            "A Girl Walks Home Alone at Night (2014)",
            "Rosemary’s Baby hasn’t been mentioned and I feel like that’s a fantastic early occult horror classic. I know ppl have seen it, maybe it’s too main stream, but it’s genuinely terrifying in a satisfying way.",
            "Not enough people have seen 1408",
            "A really excellent movie is ‘Baskin’. Totally weird and unsettling. It’s a movie that will stick with you for a while after you’ve watched it. But I don’t think it got a lot of marketing when it came out, so many of the people I mention it to haven’t seen it!\n\n‘Errementari, the demon blacksmith’… amazing movie. Changes direction once or twice and really keeps you guessing. And it ends with one of the most badass climaxes you’ll ever seen in a movie!!\n\nAlso, ‘Last Shift’, is a good movie. Not amazing but suitably weird and eerie atmosphere. Was recently remade with a bigger budget (Malum) which I haven’t seen yet.\n\nAnd finally, ‘The Void’. Excellent movie. Cosmic horror and a hark back to 80’s effects movies, as opposed to everything being cgi nowadays. Some interesting themes in the movie, along with some horrifying monsters and moments! \n\nhttps://m.imdb.com/title/tt4935418/\n\nhttps://m.imdb.com/title/tt5592878/\n\nhttps://m.imdb.com/title/tt2965466/\n\nhttps://m.imdb.com/title/tt4255304/",
            "Cannibal Holocaust",
            "It's Alive \n\nScanners\n\nThe Serpent and the Rainbow",
            "The Excorcism of Emily rose. The imagery and depictions of possession are so extremely oppressive. I think it came out at a time when the horror genre was over saturated with movies that started with \"The Excorcism of [insert random name here]\" so it probably flew heavily under the radar. I sincerely feel that movie still scares me until this day.",
            "A tale of two sisters it is Korean not sure if people watch too many foreign films.",
            "Haven't read through the comments, but I recommend:\n\nParents (89?)\n\nHenry: Portrait of a Serial Killer \n\nBad Dreams \n\nThe Hitcher (86)\n\nWillow Creek \n\nThe Brood\n\nCarnival of Souls \n\nMartin (G. Romero)\n\nWolfen\n\nNight of the Living Dead '90\n\nLost Highway",
            "The Cook, The Thief, His Wife and Her Lover -- because its not really a horror film but could be considered one",
            "These all have 5.6k or less total votes on IMDB, so I am assuming that most of them are fairly obscure. I don't know if something that almost no one involved in the genre has ever seen can define it, just because it had no opportunity to create the influence, but these were all as good as the genre-defining horrors we usually talk about, IMO.\n\n**Straight Horror**\n\nSuperdeep (2020, Russian, Body-Horror scientists trapped underground movie with some of the best practical monster effects since The Thing)\n\nKandisha (French, 2020, a vengeful spirit from Moroccan folklore is raised to take revenge on a girl's would-be rapist, but once released it begins to kill all the men in the characters' lives)\n\nMonster Party (2018- Thieves pose as caterers meaning to rob a lavish mansion, but they had no idea who was on the guest list, and now they must fight for their lives)\n\nThe End? (Italian, 2017- A man watches in terror through the crack in a stalled elevator door as the world descends into the Zombie Apocalypse)\n\nThe Eighth Night (Korean, 2021 - An evil spirit is released, and an ex priest must return with a new initiate to stop it from unleashing evil on the world)\n\nChiller (1985- A wealthy executive who was frozen at the moment of death thaws out accidentally when the equipment fails, and awakens, but what returns may not be what they laid to rest)\n\nSlotherhouse (2023- This is one of the funniest, silliest horror comedies. If you liked Cocaine Bear, you will like Slotherhouse.)",
            "Bone Tomahawk ,\nAudition,\nLord of Illusions ,\nThe Messengers,\nCemetery man,\nScreamers",
            "Husk",
            "„I‘m just f*cking with you“ - sick, twisted and with super dark humor. Did see it during SXSW, but nowhere else afterwards.",
            "Deadstream.\n\nWhat a fun movie.",
            "Megan is Missing, The Zombie Diaries & The Tunnel Movie. All are some of the best found footage movies I’ve ever seen. \n\nI feel dirty saying it but found footage horror is my fav horror genre 😂 it gets so much hate but they can feel so much more scary if done right !",
            "As I read through all the responses I’m reminded of how IMDb used to be and so many films listed here that used to be discuss on there a lot (before it became a garbage site). Love seeing these discoveries and rediscoveries! \n\nOne that springs to mind for me is the made for tv movie I Saw What You Did and I Know Who You Are remake-ish movie with a very pre-Saw Shawnee Smith and pre-Wishmaster Tammy Lauren. Maybe not the *best* but I wonder who else has seen it? Difficult to believe Lewis Skolnick as a psycho killer but it’s a fun little watch with popcorn.",
            "_The Stuff_ is better than one expects and I rarely see it discussed.",
            "All of the Wolf Creek movies and series",
            "Under the Shadow. Its about a jinn. I rarely see this one mentioned but it has some really creepy scenes.",
            "Lesser-known horror films worth your time:\n- The Most Dangerous Game (1932)\n- The Old Dark House (1932)\n- Island of Lost Souls (1932)\n- The Black Cat (1934)\n- Mad Love (1935)\n- The Devil-Doll (1936)\n- The Body Snatcher (1945)\n- The Queen of Spades (1949)\n- Abbott and Costello Meet the Killer, Boris Karloff (1949)\n- The City of the Dead (1960)\n- Paranoiac (1963)\n- Twice-Told Tales (1963)\n- The Comedy of Terrors (1963)\n- Dream No Evil (1970)\n- Play Misty for Me (1971)\n- Let’s Scare Jessica to Death (1971)\n- Torso (1973)\n- Theater of Blood (1973)\n- Messiah of Evil (1973)\n- Madhouse (1974)\n- The Living Dead at Manchester Morgue (1974)\n- The Witch Who Came from the Sea (1976)\n- Dark August (1976)\n- Burnt Offerings (1976)\n- The Little Girl Who Lives Down the Lane (1976)\n- Magic (1978)\n- Tourist Trap (1979)\n- Alligator (1980)\n- Christmas Evil (1980)\n- The Monster Club (1981)\n- The Burning (1981)\n- Possession (1981)\n- Dead & Buried (1981)\n- Evilspeak (1981)\n- Dark Night of the Scarecrow (1981)\n- Butcher, Baker, Nightmare Maker (1981)\n- Ghost Story (1981)\n\nMore to come later…",
            "Baskin, Gonjiam:Haunted Asylum, I Saw the Devil, Triangle, Coherence, The Orphanage, When Evil Lurks",
            "Spiderbaby",
            "I'm going with Ravenous  \n\n\nand fuck it  \n  \n  \nThe Shining\n\n  \nJust because too many people who love horror have not seen either and well they should",
            "Blood on Satans Claw\n\nFrightmare\n\nMessiah of Evil\n\nLiving dead at the Manchester Morgue.\n\nThe changeleing\n\nZeder\n\nSymptoms\n\nDeath line\n\nFull circle\n\nLate night trains\n\nHorror hospital\n\nTheatre of blood\n\nI saw the devil\n\nPhantasm \n\nAlice sweet Alice\n\nFanny Lye Deliver’d \n\nDolmwatch.",
            "Nope",
            "Well I think for Occult horror - The Autopsy of Jane Doe is about as close to perfect as it gets and I’m always surprised when people haven’t seen it\nFor cosmic horror - The Endless does better than most as well",
            "Triangle (2009)\n\nIt gets recommended in Horror sub a lot, so it's fairly well known. But it's been so absent from streaming services for so long I think a lot of horror fans have probably missed it. It was on Netflix for a short stint many years ago and has just been in rental-only limbo for ages.",
            "Bone Tomahawk",
            "Pitch Black maybe? I’m not sure how popular it was and if it’s even considered horror",
            "The Platform. One of my top 10 favorite horror movies.",
            "Intruder 1989\n\nHigh tension\n\nLords of salem\n\nThe witch \n\nThe lighthouse",
            "Alone (2020) good minimalistic thriller.",
            "I Am a Ghost, 2012",
            "Jack Goes Home",
            "Hour of the Wolf (1968)",
            "Burnt Offerings (1976)",
            "-Lamberto Bava's Demons and Demons 2\n- I Drink Your Blood",
            "‘E tu vivrai nel terrore! L'aldilà’ also known as ‘The Beyond’. Watched it when I was about twelve years old and I’m afraid of spiders ever since :) Also the ending was so bleak that I had nightmares for days after watching the movie :)",
            "“Ravenous” with Guy Pierce",
            "Father's Day (2011)\n\nOne of the most batshit ridiculous and funny Troma horror comedies I've seen.",
            "El Incidente, its a biiit more scifi rather than horror, but its great for anyone who loves mystery timeshenangin movies (similar vibe ones would be triangle or the endless)",
            "One film I *never* see mentioned is The Dead Girl (*not* Dead Girl). A different kind of serial killer movie but the performances are spectacular.",
            "\"Berlin Syndrome\", \"The Green Inferno\"",
            "Padak (otherwise known as swimming to sea) is a BRUTAL korean animated horror movie that flies waaaaaay under the radar. \n\nVisually it looks similar to finding nemo...except in this one its fish in a fish tank at a resteraunt, awaiting their turn to get eaten. It kinda like a...horror prison movie but with a splash of some disney esque stuff, its preety neato",
            "Dead of night (1945)\nNight of the demon (1957)\n\nAny of the Val lewton noir/horror (I loved the 7th victim).\n\nThe tenant by Roman Polanski.\n\nMaybe these are more horror adjacent but I loved them.",
            "Tunnel has earned some chatter since it was added to TUBI.\n\nAustralian found footage that does a lot with a little.",
            "I rarely see Who Could Kill A Child? talked about, especially since I consider it the best killer kids movie I've ever seen.",
            "Right at Your Door",
            "A dark song, and Enemies (Bosnian horror movie, it's on YouTube and it has subtitles. Enjoy)",
            "Burnt offerings works so well. If feels like a subversive idea of how normal people warp when they come upon wealth. But works as folk horror, a haunted house,possession and poltergeist as well as a portal to hell type film. Should be mentioned along haunting and hell house for sure!",
            "That one movie from the \"Amityville Horror\" franchise they used to show on late night television, where the devil's in a floor lamp. (?) I saw it in the early '90s, so I assume it came out either then or in the late '80s.",
            "Burnt Offerings,  Dead Alive, The Burning, American Gothic, The Pit.",
            "One of my favorite random watches was a Finnish movie called Sauna (2008). It seems to come and go from streaming services and may have been re-released under multiple English names (Evil Rising and Filth I think are the alternate names?). Worth a watch if you ever chance across it",
            "Way too many people have not see George A. Romero's MARTIN (1977). It's the best vampire movie you haven't seen.\n\nTHE PROWLER (1981) is an incredible slasher. it also contains Tom Savini's best work next to DAY OF THE DEAD.\n\nNicolas Roeg's work, notably; DON'T LOOK NOW (1973) and THE WITCHES (1990). These two in particular are massively influential on modern horror, especially contemporary arthouse, broadly. Fans of Robert Eggers and Ari Aster and of THE FIRST OMEN would be doing themselves a favor by exploring the genre work of Nicolas Roeg.\n\nWHITE OF THE EYE (1987) is a one of a kind genre movie. The American giallo/serial killer epic no one's seen directed by the infamous Donald Cammell. If Stanley Kubrick collaborated with Dario Argento on a serial killer film written by Oliver Stone it might look like this.\n\nOF UNKNOWN ORIGIN (1983) Man vs. Rat with Peter Weller, directed by Panos Cosmatos' (Mandy) father.\n\nPOSSESSION (1981) is very popular but for many is overlooked.\n\nBUTCHER, BAKER, NIGHTMARE MAKER (1981) *AKA NIGHT WARNING* is the best video nasty that not enough people have watched. Wonderfully demented and featuring Susan Tyrell, Bo Svenson and Bill Paxton in the cast.\n\nPATRICK (1978) and ROADGAMES (1981) are two classic Australian horror films no fan of the genre should miss. \n\nTHE HOUSE WITH THE LAUGHING WINDOWS (1976) The most wonderful, understated giallo no one has seen. \n\nAlso THE ENTITY, THE CHANGELING, BODY PARTS...",
            "Vicious Fun (2020), Anything for Jackson (2020), Antiviral (2012), The Deadly Spawn (1983), Braid (2018), Blood Punch (2014), My Super Psycho Sweet 16 (2009), Black Mountain Side (2014), Bloody Hell (2020), Popcorn (1991)",
            "Burnt Offerings",
            "Necronomicon: Book of the Dead (1993)",
            "Squirm, Incredible Melting Man, Tourist Trap, Fade to Black, Coffin Joe series,  What the Peeper Saw",
            "The Empty Man, Pontypool, Absentia",
            "Phantasm\nKill and go Hide",
            "The Shuttered Room\n\nTourist Trap\n\nLong Weekend\n\nGAIA\n\nHounds of Love\n\nBerberian Sound Studio\n\nThe Painted Bird\n\nFrankensteins Army",
            "I see few mentions of “three extremes” on this sub. if you don’t mind subtitles. It is Korean. If you do mind subtitles and pass on foreign films you are really missing a lot of fantastic work. So give it a shot at least once. I always tell people a few minutes in you totally forget you can’t understand what they are saying. That’s been my experience anyway.",
            "Incantation",
            "I’d say mainly International horror: whether it’s the likes of REC1-2 or The Wailing to Gonjiam Haunted Asylum\n\nUnfortunately even if a movie is like a 9/10 some people won’t give it the time of day if it’s got subtitles (despite scrolling through various social media platforms 24/7 where they’re nonetheless skimming text at a quick rate and processing most of it nonetheless)\n\nIt’s a shame how many great movies I’ve tried recommending to people who won’t give it a chance bc it’s got subtitles.",
            "Burnt Offerings (1976)",
            "The Evil with Richard Crenna!",
            "When a Stranger call with Charles Durning.",
            "Messiah of Evil (1973)",
            "Next of Kin (1982) and Cure (1997) are both great",
            "Watched “Messiah of Evil” from 1974 last night and I’m honestly surprised it doesn’t get talked about more. It’s campy as hell but has the same charm Phantasm has. ",
            "May",
            "Burnt Offerings.",
            "Not sure if it counts as a popular movie of the genre, but I recently watched “The Levenger Tapes” on Prime and really enjoyed it 😁",
            "The Vanishing. The original foreign version.",
            "Someone's Knocking at the Door. I don't know that it would make any lists for \"best\" anything but I have never met a single person who has seen it and it really stuck with me because it's so bizarre.",
            "Street Trash",
            "Has anyone seen the House In Between?",
            "Let's Scare Jessica to Death. Awesome movie with an awesome title that does not at all portend what the movie is actually about. Highly recommended to all fans of \"she might be crazy or it might all be real\" horror like Rosemary's Baby and the Babadook. I think it's actually my favorite horror movie. It's genuinely chilling and scary for a 50+ year old film. Zohra Lampert gives a performance for the ages.",
            "I also really like found footage and watched all the Hell House LLC movies. I also just watched Grave Encounters.",
            "I don’t know why I wrote this movie off but I recently watched V/H/S and enjoyed it. I kept overlooking it and had it in my head that it was something else. Not a perfect movie but I enjoyed it.",
            "Commenting on Best horror movies that a devoted horror fan has probably not yet seen?...",
            "Exhibit A (2007). Fantastic British found footage film.",
            "The Beguiled.  Not marketed as horror but I think it qualifies.  I like both versions including original with Clint Eastwood and remake with Colin Farrel.",
            "clownhouse",
            "Seconds (1966)\n\nPossession (1981)",
            "Not sure if horror comedy counts but Bloodsucking Bastards. Starring the fantastic Pedro Pascal and Fran Kranz",
            "He Never Died\n\nThis is my all-time favorite and the BEST black comedy I’ve ever seen, but I don’t think I’ve ever seen anyone (outside myself) bring it up. Such a good slow burn with deadpan humor and a well written story with the perfect casting of Henry Rollins to bring it all together. A serious under-discussed gem (with a really disappointing sequel).",
            "Sinister 2012!",
            "All of Us Strangers is fantasy and romance but there's a horror element to it. I watched it cause it was recommended here",
            "Green Inferno, Hereditary",
            "When Evil Lurks. By far my favorite horror movie from last year.",
            "Saving this thread for my ever-growing horror movie list",
            "Butcher, Baker, Nightmare Maker. I’m perpetually shocked it isn’t more well known, I feel like it’s a staple of horror with queer elements. And definitely better than the likes of Sleepaway Camp or aNoES 2 with how it handles its content.",
            "Atterados(Terrified).  Not to be confused with Terrifier with the killer clown.\n\nAlso Possessor. Just a heads up, though it is extremely gory and very visceral.   There’s blood in horror movies then there is “Possessor” gore.  Not for the faint of heart.  I’m baffled it maintained an R rating.",
            "Begotten. The only horror movie I’ve ever seen, that I could not finish. Beware",
            "halloween",
            "Black Mountain Side, for the hard cosmic horror",
            "Time Lapse.  More of a thriller but such a cool concept for a movie, you're better not knowing much going in to it.",
            "Where The Dead Go To Die is demented, but amazing.",
            "Rasuto Furankenshutain\n1991\n\n\n<3",
            "I find you can't go wrong with the originals from the j-horror series.. JuOn, Ringu, Dark Water, Kairo (aka Pulse), One Missed Call, Tale of Two Sisters, Shutter",
            "The Others (2002)",
            "Deliver Us From Evil , just watched. Pleasantly surprised.",
            "4bia",
            "Nightbreed\n\nBoxing Helena \n\nSaturday the 14th (for the kids) \n\nFound\n\nNeon Demon \n\nThe Stuff\n\nStreet Trash\n\nVampire Boys (for the over the top, so bad it's good, and campy queer subgenres) \n\nI know there's more but that's what I can think of at the moment. Also, there are a couple of TV series that fit the bill for me. \n\nFriday the 13th the Series\n\nMonsters\n\nFreddy's Nightmares",
            "A Dark Song",
            "I need more people to watch A Dark Song",
            "Pyewacket was a solid, stay with you kind of scary that I really enjoyed and not many people have seen. Definitely recommend for a fun “hangout” kind of horror movie 🍿",
            "Terrified and When Evil Lurks.",
            "Something about Ponty Pool. Maybe it's the opening. It's not a spectacle, the brain twister is compelling enough - it has light moments that seem out of place. I don't know why but I put it on once every year or two. I've seen people try to pull off its trick with more conventional scares and they never manage.\n\nIt was the result of an unexpectedly successful kickstarter for a podcast that got out of hand.",
            "Who can kill a child?",
            "Is Carpenter’s Prince of Darkness too popular? Great cheap horror.",
            "Housebound 2014 🙌🏽",
            "Begotten",
            "I feel lucky my dad showed me this, hellraiser and videodrome as a kid. Perhaps a bit young but 🤣",
            "I've been loving this sub with all these great recommendations. D & B is on Tubi. \nI'm going to watch it now. Besides the commercials, Tubi has a dope selection of horror movies. Thanks!!",
            "Yes! This is my choice, too. I love turning people on to this movie.",
            "I love this movie. Watched it a cpl years ago randomly!",
            "This came up a few times in this thread. I feel like I've never even heard of it. One to check out for sure!",
            "It’s on Amazon Prime now btw…",
            "Welcome to Potters Bluff.",
            "One of the all time best!! Good call!",
            "It’s a classic!",
            "Holy wow!!!!!! What a great movie!!!",
            "Great movie, it's one you end up seeing years after becoming a horror fan and asking yourself \"why did I not watch this sooner? Why did no one tell me about this?\"",
            "I remember reading the book in High School in 82. The movie is still one of my favorites.",
            "LOVE Dellamorte Dellamore - very underrated and influential. Always meant to see Dust Devil, thanks for the reminder - I’ll look for the directors cut.",
            "Dust Devil director's cut is my favorite. Very creepy and unsettling. Also check out the director Richard Stanley's early works, especially Hardware.",
            "Dellamorte Dellamore just happened to be on some cable station late at night while I was living in a fancy hotel in Vegas while working 18 hour days on the expo floor - for *years* I seriously believed I'd hallucinated the whole thing.",
            "Ja.",
            "I really enjoyed this one. Very effective creepiness for the micro budget it was made on.",
            "I'll go to my grave saying that this movie is better than any of Flanagan's other work.",
            "Would love to see this movie get remade with more money. Let Flanagan do it, it seems like there’s some directors lately who like remaking their own movies",
            "I think I rented this back in 2012 just because the cover and synopsis sounded cool, so I feel like a little bit of a Mike Flanagan hipster lol",
            "I think the alt title is The Borderlands, not The Badlands. It is a fun movie.",
            "This one is great. I’ve noticed it’s been gaining slightly more traction lately, hopefully will become a horror cult classic. \n\nExhibit A is another greatly under-appreciated FF movie. \n\nSavageland is FF adjacent, very creepy and I don’t see it mentioned nearly enough.",
            "Agreed! This is one fun found footage.",
            "I saw Frailty in the theaters with my friend when we were about 17. When Paxton rushes into his son’s room in the middle of the night and says, “I need you to help me kill demons,” my friend turns to me and says without missing a beat “I am doing that to my kid one day.” Hopefully he didn’t. His kid seems normal and most of his neighbors are accounted for.",
            "Frailty fucks.",
            "Ok.. I've seen this movie mentioned a zillion times.. Watched 30 seconds of the trailer to confirm I've never seen it.  So... I'm going into this basically blind.\n\nEdit.. Watched it, kinda felt the twist coming, but it was still very damn well done!",
            "The sentinel is an amazing movie. Haven’t watched it in two years but it’s incredible.",
            "I have not seen the little girl who lives down the lane but remember seeing a youtube video about how Jodie was so uncomfortable filming some of the scenes that her sister did them for her..\n\nMade me not wanna watch lol..",
            "Second on Bedevilled. One of the most brutal movies I've seen.",
            "Confirmed, Magic and The Entity rule!",
            "> The Sentinel (1977)\n\nI second 'The Entity'. Just re-watched it the other day. I first saw it as a kid at my friend's house and it's stuck with me all these years!",
            "Anothe LGWLDTL fan!  It's hard to define as a horror film, but man - a personal favorite for decades,",
            "Me and you are like this sub's resident Bedevilled proponents\n\nI need to get around to November I've been meaning to watch it for ages",
            "The Sentinel and The Entity are way underrated, should be up there with Suspiria and Amityville Horror",
            "The Sentinel was on Netflix or Max or something like that for a really long time with a poster that made it look FAR more modern, so I watched it one night, and was like \"wow this really gets the retro vibe-- wait is that BABY JEFF GOLBLUM???\"\n\nthat is a sleeper \"hey it's that guy\" of a horror movie. baby goldblum, baby walken, it's wild!",
            "The Sentinel! Yes.",
            "I loved November. put it on as a double feature with the VVitch and you have a great night of folk horror.",
            "Bedevilled was so good! Also love The Sentinel",
            "Coming through with the streamers! You are a gem!",
            "The Entity was interesting, especially since it was based on a true story. However, that third act where they tried to freeze the entity was pretty stupid, but overall I liked it.",
            "Upvoting for the awesome formatting with release year and streamers. Thank you!",
            "I’ve seen the little girl who lives down the lane! Having young Jodi Foster do a sex scene with an older boy when they both were underage in real life (I think) and in character was weird.",
            "The Little Girl Who Lives Down the Lane is a classic!",
            "The little girl who lived down the lane was so good!!! Thanks for the recommendation",
            "> The Little Girl Who Lives Down the Lane \n\nThis is a cringe movie and no wonder it is isn't well known.  Showing Jodie Foster's ~13 year old naked back side is quite an unfortunate choice to make in a movie especially when the villain is a pedophile predator.\n\nAnyhow, the movie wasn't bad nor was it great. I wouldn't even really consider it horror. More like a thriller.",
            "The Entity is a brilliant metaphor for women’s rights. It wasn’t until recently that if a woman would be raped she wouldn’t be believed.",
            "I saw Magic when I was like 6, and I had nightmares about it for YEARS.",
            "The Setinel (1977) is top 5 all time IMO. 70's creepy at it's finest.",
            "This is such a great movie yet I feel like this is the first time I’ve seen it mentioned on this sub!",
            "This times 1000. It’s my go to movie for horror aficionados because they’ve almost never sent it. It is absolutely great.",
            "I thought Jug Face was remarkable.",
            "I forgot about Jug Face. Excellent.",
            "Let’s scare Jessica to death is amazing. I haven’t seen it since the 70s and have been considering watching it again, but I’m scared!",
            "I appreciate Glorious, but it would have better as a short film.",
            "I’ve never heard of these and will check them out, but I wanted to say Let’s scare Jessica to death is a crazy title and I love that lol",
            "Jug Face x1000 so good",
            "I have Let’s Scare Jessica to Death on vhs because I’m an Old",
            "the lady that played Jessica was the detectives wife in Exorcist III! \n\nfor some reason LSJtD has always held a special place in my heart. fever dream…",
            "Glorius is a glorius suggestion",
            "ATM is really great horror. I'm surprised it's not more popular",
            "I second Feast, there is a whole trilogy, but the first one is the best.",
            "Chaser and I Saw the Devil make a great double feature",
            "'Psychedelic horror'? Consider me sold",
            "Accion mutante is amazing. It used to be extremely hard to find in the states but now has a great severin release.",
            "Seconded",
            "Also commented this (should have checked). It has the same vibe as Phantasm. The theater scene is legitimately creepy! ",
            "It's a great watch, made even better when you know the male lead was half cut for most of the filming",
            "Not to be confused with Night of the Demon (1980) that is very not classy, intelligent, or spooky. But if you're a fan of hilariously bad horror movies, it's great!",
            "My favorite horror movie! The director gave it a hard-boiled, film noir sensibility that serves the story well. One of the first great seance scenes in horror. Remade (well!) as Drag Me to Hell.",
            "seconding alice sweet alice. this movie is severely underappreciated and is a classic of the 70s at the highest level",
            "I love \"The Blood on Satan's Claws\" it gets overshadowed by other English folk horror movies \"The Wicker Man\" and \"Witchfinder General\"",
            "For those having trouble finding it on LB, it's 'The Blood on Satan's Claw' singular",
            "This movie is fantastic!",
            "I loved this one! The creature work was just outstanding.",
            "The cinema I go to played a trailer for that for weeks when it came out but never actually played the film so I still haven’t seen it. I thought it looked good but need to track it down.",
            "What fantastic suggestions to introduce someone to gialli! I'd add a few other Sergio Martino picks that I prefer to 'The Strange Vice...': 'All the Colors of the Dark' and 'Your Vice Is A Locked Room And Only I Have The Key.'",
            "I was sitting there with my mouth hanging to my knees at the end of Lamb. I still think about it from time to time.",
            "Dear god, that hung with me.  Kind of like Jaws when you don't see he full shark until about halfway in.",
            "I love this movie. I think of it more as a really weird love story that turns super weird at the end.",
            "It was so great! I also saw it in a little indie theatre in Lancaster, PA with couches and loveseats for chairs. It really added to the experience. Such an odd and strangely affecting movie",
            "weirdass movie. I liked how it had so much dread hanging over it. I was watching it with a mate and we both got really freaked out the whole way through even though not a lot happens. also, good music video interlude",
            "Ooh where can I watch it? And what is the year so I can find it more easily",
            "Blue My Mind is available on Tubi, FYI.",
            "Cobweb solidified my belief that Antony Starr is the guy Homelander plays when he's not at work.",
            "Cobweb is a great Fall/Halloween vibe movie.  It was released during the summer with little fanfare.  It's now in my Halloween movie rotation.",
            "Blue My Mind sounds really interesting and I've never seen a swiss film, will have to check out",
            "The Changeling for sure. Loved that movie but haven’t seen it since I was a kid",
            "I’ve heard a good bit of people talk about The Orphanage",
            "The Changeling is a great classic haunted house flick.",
            "Haunted house (and adjacent) crew represent!",
            "The Orphanage is one of my all time favorites!",
            "Watched that one just because how much i loved the actress from the dark and the wicked. Both great movies",
            "I thought Judy Reyes' performance was award worthy.",
            "God that movie was fucking awesome",
            "GREAT movie!",
            "This one is probably my favourite of the Universal classics. The sequels are good too.",
            "I personally found it to be highs and lows in terms of aging.\n\nFor example, the town scene with the father carrying his daughter is absolutely brutal and holds up to this day.\n\nBut the old man harrumphing-comic-relief was grating and broke the movie for me whenever he appears.",
            "I love found footage and I hadn't heard of this one - thanks for the recommendation!",
            "Noroi: The Curse is my favourite horror movie of all time and what I’d categorize as the “scariest” and outside of a streaming run on Shudder, I only know people who saw it via bootlegs.",
            "Loved this one! I’m always down for religious horror and this was such a good one.",
            "Love that movie. Always kills me when the werewolf shoves its hand into the door mail slot, and one of the soldiers hits it with a hammer😂",
            "Instantly made its way into my top-ten for werewolf movies ☺️🐺\n\nEdit: should clarify- my top ten *favourite* werewolf movies, not *good* werewolf movies 😆",
            "Absolutely fantastic film. People who know it usually love it, but it’s definitely more niche than it deserves to be.",
            "I enjoyed that one, it was a random watch and it was good.",
            "Used to be on scifi channel all the time would always stop to watch",
            "I love this movie. And The Descent by same director, but that one gets the love.",
            "I rented that film from blockbusters back in the day. They used to have a cracking collection of shitty horrors and my husband and I always got one mainstream and one horror. I think the abyss took me the whole week to watch because I kept falling asleep. Good times",
            "My only memory of this one was being a stoned teen and my friend was like watch this scary movie, but all I could see was obvious sausages being used as guts and the same prosthetic werewolf arm popping up in every scene.\n\nI just couldn't stop laughing and he was right pissed off.",
            "Do a search in r/horror.  That movie was abundantly posted and commented about over the years.",
            "I was going to post this. It's so unfair how this movie got buried, but I'm glad that it seems to be getting a little bit of a second life. I can't wait to see what else David Prior does because he is insanely talented.",
            "Oh,  this was like 3 different horror movies blended into one. I loved it.",
            "Didn't realize it was underrated until these philistines in comments started talking. Top 20 best horrors",
            "I'll be honest, I hated this movie. Most people said that the rest of the movie doesn't live up to the excellent Lovecraftian introduction, and IMO that's true, except for the intro being characterized as excellent. IMO, it's very run of the mill cosmic horror executed well, but nothing outstanding conceptually. Once the intro is done, it's just a slog to get through and never reaches those heights again.\n\nI know most people liked this movie a lot, but man, it did NOT work for me.",
            "People Under the Stairs should be required viewing for any young horror fan. It’s dreamy and creepy and thrilling. Really sticks with you.",
            "People Under the Stairs doesn’t get half the love it should.",
            ">!When the girl would cover her face up- idk why but that part always was super unsettling to me. Being mid fighting for your life, and you are mentally ill to the point you need to physically shut the whole world out and not “exist” for a few. !<",
            "This is my vote as well. Went into it knowing absolutely nothing and it was probably my favorite horror movie over the last 10 years.",
            "Definitely",
            "He's got another movie coming out soon called Oddity.  The Caveat bunny makes a little cameo in the trailer. :)",
            "Caveat is well worth your time.",
            "I really liked Caveat.",
            "Eyes without a face right?\n\nI was way too young when I saw that. Creepy as hell",
            "would you qualify spoorloos as horror?",
            "Huesera was excellent. I’ll have to check out Vuelven.",
            "> Vuelven\n\nNever heard of it.  AND Tenoch Huerta is in it.  Will check it out.",
            "Saw both of them on the same day as part of a marathon screening. After Vuelven, Huesera was underwhelming, I think the former is definitely the better movie. It did some cool things though.",
            "Omg that NOISE she makes in Husera 🦴 ahhhhhh 😱",
            "The midway point between giallo and slasher",
            "Ha! This is so classic",
            "Did you mean Night of the Lepus? The premise seems so silly, but that was the first horror film I ever watched and it scared the hell out of me as a young kid.",
            "REC is very popular, doesn't really fit the prompt imo",
            "The Platform YES!",
            "I’ve seen the short film for Piggy but had no idea there was a full length movie now!",
            "Piggy was so insanely good, it needs to be talked about more! Would definitely recommend digging a bit deeper to find the spanish version for anyone who wants to watch it, the english dub is awful haha",
            "of COURSE",
            "The Platform is one of my top ten favorite movies.",
            "One of my go-tos, along with Anything For Jackson and We Go On.",
            "Learning about the ritual it’s based on is a fantastic rabbithole as well",
            "A Dark Song, to me, is the DEFINITIVE perfectly executed low budget horror. It never looks cheap, and you can tell it was absolutely a labor of love for everyone involved. Great script, Amazing score, amazing editing, great pacing, always moving on to the next incident or event.. absolutely sensational acting. authentically researched and it doesn't try to explain itself for the stupid.  it's so pure in it's intent and delivery. it never reveals too much and always keeps the audience off-balance. just no weak spots right up till the ending. The only gripe I've even ever heard of was about the ending and I actually wholeheartedly disagree with that. I think it was incredible. one of my all-time favorites films, period.\n\nI am not really a person of faith, but watching this movie almost makes you want to be a true believer in SOMETHING.. that is an accomplishment in and of itself.",
            "I personally hated this one, so slow with a disappointing cringe finale",
            "I really didnt like this one. The ending especially was so cheesy in my opinion and the movie as a whole was no where near horror.",
            "Same experience! Billy is now my favorite slasher by a longshot. \"Agnes, it's me Billy...\"",
            "Very good movie. I recommend Down Terrace, and Bull fairly similar British movies.",
            "Criminally underrated and underseen.",
            "Very good very disturbing. Pretty hard to watch.",
            "Pontypool came to my mind too. Unique, odd, effective--I really like it",
            "I bought Bad Milo blind because Gillian Jacobs (because reasons) but boy was that movie.... something.",
            "The Beach House, The Block Island Sound, and Pontypool would make a good triple feature.\n\nAM1200 would be a good thematic addition to your list.",
            "Is that what pontypool is? Eh as good of a subgenre as I’ve found, so pontypool as metaphysical angst caviar checks out",
            "The Block Island Sound is awesome. Small budget cosmic horror done right!",
            "I generally dislike comedy horror (aside from Evil Dead movies) but I loved this one!",
            "I liked it, but the whole time I kept thinking they should’ve cast Henry Zebrowski (Last Podcast on the Left, Your Pretty Face is Going to Hell) as the lead.",
            "I came really close to turning this off after a few minutes.  The streamer stuff was very annoying.  It is a trap.  I'm glad I stuck with it.",
            "Glad to see Black Mountain Side mentioned! I enjoyed it, due for a rewatch one of these evenings.",
            "Creep 2. The Creepening",
            "Was gonna recommend Dead and Breakfast. Fun goofy little zombie comedy with Jeffrey Dean Morgan, Gina Phillips, Ever Caradine, and Jeremy Sisto.",
            "Omg, I totally agree. “Asian” horror is infinitely more realistic and they do NOT fuck around with their plots. I cannot watch Juon to this day.",
            "Both films were really unique to me. They're special",
            "Yeah, while they're not 'scary' in a traditional sense, the relentless feeling of \"this is really fucking uncomfortable\" really hits home and it stuck with me well after the films were over.",
            "God, I despised this movie so much. I get the point but I just thought it was so unbelievable what these characters let the villains do under no threat whatsoever. As soon as the child is involved there is no parent in the world that would have acted like those protagonists. This movie throws suspension of disbelief through the window and spits on it. Hated, hated, hated this movie. Great idea, the beginning is strong but by the end I was fuming.\nPeople shit on Prometheus and Alien Covenant for stupid protagonists and then go on to praise a stupid movie like this one",
            "Hated this one, but also I hate Funny Games and I think they’re very similar concepts. Your mileage may vary if you can suspend your anger at the main characters and appreciate the metaphor.",
            "I have never understood why this one doesn’t get more love.",
            "The Ritual was really good.",
            "Those are lesser-known to Gen Z maybe, but I’ve seen them all and love most of them. Moral of the story: don’t let a 1 at the start of the release date deter you from watching anything.",
            "Burnt Offerings! Oh man I haven’t seen it since I was a kid, but I remember it scared the hell out of me.",
            "Old Dark House is one of my Favorites.\n\nI feel like The Burning has been getting more popular recently",
            "Old Dark House is one of my Favorites.\n\nI feel like The Burning has been getting more popular recently",
            "Passing on the follow up but thanks anyways",
            "I saw Ravenous in the theatre when it came out. Very unique and impressive film. Inspired soundtrack too.",
            "Ravenous was so good",
            "Most Stephen King fans will always be angry at Kubrick for the changes to the source material, but it’s a damn good horror movie. I’m a King fan and love both the book and movie.",
            "The Shining is one of the most popular/well known Horror movies of all time, however? The thread is for lesser known films.",
            "Yes! Yes! I was just about to say Autopsy is a fantastic representation of occult horror. You know what’s funny, every time I come into a post about horror, I legit can’t think of a movie to save my damn life. I draw complete blanks.",
            "I think your picks are great examples in answer to the OP’s question. I love The 7th Victim!",
            "I remember this one but mostly for the sex scene. 🎬",
            "Your dad sounds just like my dad 🤣",
            "Streaming services that you pay out the ass for are doing commercials now unless you want to pay even more so Tubi is great",
            "I hope you like it!",
            "I just watched it and it was awesome, I love this sub too",
            "I have a feeling you won’t be disappointed. It’s an 80’s film but feels pretty timeless and it’s very creepy, especially by the end. Come back and let us know what you thought!",
            "I was super surprised by it. Loved the whole thing. When I found out it was Mike Flanagan’s early work it made it even better.",
            "Same. He was smart and showed very little rather than a CGI suck fest. The monologue at the end by the pregnant sister is actually sad and well written not pretentious and groan worthy.",
            "Agreed",
            "Thank you for to e correction!!",
            ">  most",
            "I saw it.  Was good.  Not scary, but decent movie",
            "Yeah, I suppose it would fit better under the thriller umbrella but it’s so good. Jodie Foster was spectacular in that.",
            "I went in blind for \"Bedevilled\" and, \"November\" is fantastic!",
            "Beverly D'Angelo....",
            "It was even freakier seeing it on a big screen (I'm old).\n\nA very early film for Beverly D'Angelo AND Jeff Goldblum!",
            "I think I mentally blocked the ending. I agree with you on that.  One of the few movies where you can overlook a badly presented ending. \n\nI knew it was based on a \"true story\" (cough).  Grain of salt and all that.",
            "You'll enjoy \"Magic\".  It has a similar feel.",
            "Recently eh?",
            "If you see Larry Fessenden’s name on a movie, it’s probably low budget + high quality. Seems to be all he fucks with.",
            "What are the titles of the other 2? I'd like to check them out",
            "Half cut?",
            "Yes! \n\n\nI rewatch movies a lot but this one ive only watched once and its on my mind more often then the movies ive watched dozens of times. I just randomly start thinking about that tiny little lamb kid and their sweet little family! And then i get sad because well things cant stay happy its a horror movie lol",
            "If you have Peacock or Tubi, The Changeling is on both platforms. Peacock doesn't have the ads, tho.",
            "I went into The Dark and the Wicked knowing nothing about it. I loved it.",
            "So many awesome moments.",
            "It's hilarious \n\n'Sausages!'",
            "Are there even 10 good werewolf movies ?",
            "Can’t say I’ve seen it stoned, but it is awesome. Directed by Neil Marshall who did The Descent. Great story on an, admittedly, tiny budget. Awesome actors too. I would recommend a rewatch.",
            "The one character literally says \"sausages!\" while freaking out when his guts are hanging out.",
            "That’s cool. To each their own. \nCheers!",
            "I'm right there with you.  It did nothing for me.  Couldn't wait for it to end really",
            "I shut it off with 20 minutes left. I usually will leave anything wrap up. Just not this tripe.",
            "I agree with you. I hated it. It was awful. This got recommended to me on this sub a while back. This film is one of the reasons I don’t take recommendations anymore 😂",
            "It's my favorite slasher, it's so good! I never miss an opportunity to name it or hype it up because I think it's a shame so many horror fans haven't seen it lol",
            "Hmmmmm now I am wondering whether I saw the Spanish version. I really can’t recall now! Tough watch.",
            "Anything for Jackson is a trip!",
            "Do you happen to know if We Go On is streaming anywhere? I love the other two films mentioned so now I kind of need to watch this one",
            "Oooh I’m bored in an airport and now I have an excellent google rabbit hole to fall down, thanks!",
            "\"What your mother and I must know is...where did you put the baby *Agnes*?\" Fun fact: Actor Nick Mancuso did the killer's voice.",
            "Thanks, will check them both out.",
            "Requires some stomach, yeah",
            "I just watched The Beach House per your recommendation. I had never heard of it but I thought it was solid cosmic horror. Thanks for the tip!",
            "Right!!! They really nail what (to me) is the scariest thing - humans in the uncanny valley. Creature/demon stuff isn’t scary to me, but a person whose eyes or mouth is a little too big? I’m sleeping with the light on lol",
            "One of the few found footage films that lets the viewer forget that they’re watching a movie. \n\nPEACHFUZZ!!",
            "Agreed. They made me sick. Going back for the bunny was when I checked out. Still more stupid moments after.",
            "Couldn’t agree more.  This movie was disgusting for all the wrong reasons.  I regret having watched it.",
            "Dude I watched it after people were going on and on about it on here. I’ve heard it’s supposed to be a metaphor or something. Honestly, I don’t care. What a shit piece of film that thing is. Just the fucking worst. We’re the parents in on it for fucks sake?",
            "Absolutely hated it as well.",
            "I also hated funny games! Couldn't even finish it",
            "It's not one that people very easily stumble across. I saw it a couple times as a teenager and I still think about it every now and then. Should try to find it in an online store somewhere, see how it hits as an adult.",
            "Agreed. It flew under my radar til just a couple years ago, too; I was pleasantly surprised when I found it",
            "It’s because so many movie names try to rush for the exit and they get caught in the doorway! I have this exact feeling all the time, watched 100s of horror movies, on the spot can barely name one 😂",
            "Here is to dads traumatizing their kids. My first movie memory is child’s play when I was 3-4 thanks dad and older bro",
            "Same.  We saw all the good ones as children.",
            "Was your father Tim Davis too?",
            "My first horror movie was A Nightmare on Elm Street when I was 6",
            "OMG! It was sooooo good. Then the twist at the end!?!?! Stellar!! I'm a huge fan of older horror movies for the practical effects, odd camera angels, and random close-ups that create dramatic effect!! Ugh, so good!!",
            "I watched it recently, and was like, \"damn, *everyone* is in this movie!\"",
            "Adding to my list for tomorrow.  Literally..this was fantastic.",
            "Good point. The movie is a brilliant metaphorical horror, placing the rapist as an invisible entity. This movie deserves more attention.",
            "And what is the kid's life going to be like?  Not good I'm thinking",
            "Thanks, good to know! I’m living abroad right now and my VPN doesn’t always work great, but next time it does I’ll check out Peacock",
            "I hope so. Probably mostly unknown or a bit campy rather than hardcore horror.",
            "I wrote a joke in one of my scripts very much like this.\n\n\"*Come on, when's the last time they made a really good werewolf movie?\"*\n\n*\"Have they ever made a good werewolf movie?\"*",
            "For sure! Its a 100% must watch for any slasher fan",
            "Not right now - it was on Prime. $1.99 on YouTube. It's dissimilar to the othe 2 in so many ways, but has that intimate feel. All about a guy with a death phobia that wants proof of life after death, so he starts consulting a variety of characters. The climax is amazing.\n\nIf you like THAT one, The Exorcism of Michael King has a misleading title but is in the same vein, and also a rewatch for me.",
            "Glad I could help! I enjoy low-fi cosmic horror, but it's so hard to get right. Offseason wasn't a perfect film, but it also had its moments. I also really enjoyed Black Mountain Side for similar reasons.",
            "Omg I had the most frustrating time trying ti watch the beach house. I paid for it on on demand but I finally stopped watching it bc I realized it was not the movie in the description. It just was a totally different plot!",
            "That and the car scene where the violence erupts later on were the final straw. Dreadful movie",
            "Its a metaphore but its done in such a stupid and unbelievable way that just becomes infuriating. That movie and Skinamarink are two movies that people go on and on about here and I just absolutely despise. Both dreadful",
            "Same. The unsettling “old gods of Appalachia” feel to it was satisfying.",
            "Ooh! Mine was American Werewolf in London when I was like 5. Yay horror movie dads!",
            "Oh yeah, I was single digit age when I saw the Texas Chain Saw Massacre, Tourist Trap, all the major slashers and even Eraserhead!",
            "Hey there fellow traumatizee!  My dad and older brother did the same.  I still don’t like sleeping in a room with dolls",
            "Two more come to mind. \n\nLet's Scare Jessica to Death (1971) Hoopla/YouTube *rent*\n\nJessica is a semi Arthousie, semi \"am I going crazy\" Vampire film, or is it?\n\nThe Haunting of Julia (1977)\n\nJulia is about a haunted house/haunted woman, staring Mia Farrow.  Its also difficult to find. It does pop up from time to time.\n\nDamn, I was lucky to be a teen in the 70s.  So many great movies!",
            "Cool! 👌🏽",
            "Couldn’t agree more.",
            "Yeah there is another one that’s a drama I think.\n\nETA: free on Roku Channel, btw",
            "I saw that too as a kid! Permissive dads are the best lol.",
            "Awesome movie!!! Another one he showed me haha. I always thought it was a Stephen king movie for some reason. That jumpscare with the guy in the hospital bed haunted me haha.",
            "Eraserhead rules. I always get my friends who are having kids to watch it",
            "I made my mom throw out my raggedy Anne doll directly after 💀 that I don’t remember but my mom does because she was so pissed at my dad haha",
            "I feel like I blocked out that jumpscare because when I watched it as an adult it still got me! When he's outside the house looking in through the windows, it's such a quick scene, but I still can't have my blinds open on the ground floor when it's dark out hahaha",
            "Haha, that’s evil, in a good way 😂",
            "Vivarium (2020) is also great for this purpose"
        ]
    }
}