{
    "Weekly Discussion Thread📌": {
        "title": "Weekly Discussion Thread📌",
        "score": 19,
        "url": "https://www.reddit.com/r/Howtolooksmax/comments/1901syk/weekly_discussion_thread/",
        "content": "Happy Saturday! Please use this recurring thread for all discussions, questions, and suggestions related to r/HowToLooksmax.",
        "num_comments": 70,
        "comments": [
            "Is there a real life equivalent to looksmaxxing guides? Like some professional advice? After getting my last thread removed by the automod tool it occurred to me I have a lot of money to get my problems addressed by professionals who would have an actual incentive to give me good advice and proper attention. But I'm not sure what that profession would be. Plastic surgeons? Salon stylists? What's the best place to get real life looksmaxxing advice for a fee?",
            "Everytime I scroll through this subreddit, it's always a bit annoying that people generally will only support and suggest conventionally attractive trends.\n\nAnyone with tattoos or unusual piercings are just told to switch their style to something clearly not them",
            "this subreddit is weird. people come here to ask literally how to maximize their look. commenters will say \"no need to change anything\". \n\nor people will say the obvious thing as lose weight. Guys, the OP obviously wanted to ask how to maximize their look with their current weight or face.",
            "Lol just wanted to mention that the posts by men hardly ever get any upvotes and comments",
            "[deleted]",
            "tf why can't i post anything?",
            "How do I know if I'm mewing properly and when will I see results?\n\nIs it supposed to cause some sort of instant change in my face, even if its slight, because I don't see not even a slight difference before/after mewing instantly.",
            "[deleted]",
            "Can there be a rule that if somebody says “except this” that people don’t bombard them with comments saying it, I see this a lot about weight",
            "Does anyone know why my post isn’t getting any activity? I left one up for a couple hours and nothing… so I just reposted.",
            "This subreddit is so filty, it's infested with obvious above average looking person asking for advice to look good. I thought this subreddit was supposed to help those that is not looking as good as they can.",
            "Does anyone have any recommendations on a skin care routine or products to use? \n\nDoes anyone here have any experience using botox long term?",
            "I can’t post a thread anyone know why ? I’m using imgur link ",
            "[removed]",
            "Stumbled on this subreddit by accident. The positivity here is interesting.",
            "Does anyone know why i can't post on here? It just gets instantly removed.",
            "Why does everyone in their “mid-20s” look like they’re in their mid-30s? Is everyone lying? Or are people born in the late 90s/2000s seriously aging faster than everyone else?",
            "Why do my posts keep getting declined?",
            "Why can't I post?",
            "yes, your parents and church",
            "Go to an aesthetician",
            "same same\n\nI post on reddit and it's complete silence",
            "'Unusual'. In general, people aren't attracted to unusual/niché styles. You're on a subreddit that gives advice on how to appear more attractive. It only makes sense that the advice they give conforms to conventional beauty standards, since that makes you more attractive to the rest of society.\n\nOf course if you don't like the advice you can ignore it: no one is forcing you to comply. There's probably people out there who like that particular nose piercing or face tattoo🤷🏾‍♂️.",
            "My post isn't showing up either. Really annoying cuz I need help",
            "Same",
            "Depending on your face and weight you might see minor temporary changes while actively mewwing but long term results you need to mew properly for an extended period of time. YouTube has lots of videos to watch and Dr. Mew made an app recently",
            "Honestly. I came here to get and give advice, not to rate OF. There are enough subs for that",
            "Fr, I'm tired of seeing posts that specifically say they aren't removing any piercings but most of the top comments say to remove them 😑",
            "Y    Try and asxdeauyyyuTo uh In my",
            "Your comment was removed because the automoderator detected it as spam,or a dm request, those things are not allowed here.*If you think this is incorrect please message the mods*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Howtolooksmax) if you have any questions or concerns.*",
            "I have the same question?",
            "I'm having the same issue",
            "same and i post comments frequently but my post itself isnt showing",
            "Mine too and no ones responding…"
        ]
    },
    "42 [F] Other than gym, what should I work on?": {
        "title": "42 [F] Other than gym, what should I work on?",
        "score": 109,
        "url": "https://www.reddit.com/gallery/1d3pvv8",
        "content": "",
        "num_comments": 211,
        "comments": [
            "Greetings Looksmaxxer, We appreciate your contribution! In addition to seeking guidance from fellow looksmaxxers, we suggest exploring our sidebar or to visit howtolooksmax.com for a variety of articles on looksmaxxing. Find valuable guidance, tips, tricks, and more to enrich your looksmaxxing journey.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Howtolooksmax) if you have any questions or concerns.*",
            "Eating habits",
            "Diet probably",
            "Get glasses that better suit your face and put just a little more effort into the clothes.",
            "Do your eyebrows grow any closer?  Eyebrows are meant to start at the beginning of your eyelid tip.. I think longer eyebrows could really change a lot to your face even though you already look great for your age!",
            "Maybe better eyewear and I personally dislike tattoos.",
            "Have to ask \n\nWhy \"other than the gym\"\n\nIf it's a disability... Ok...\n\nOtherwise nothing is going to be better for your looks or health",
            "You look like such a sweet person! I love your smile and your makeup in the last picture looks good! Maybe just try some different makeup looks to make yourself feel confident, you don’t need to change!",
            "Gym… gym. And dentist.",
            "Teeth",
            "I would get in shape and then reevaluate the situation. This can be achieved without the dreaded gym you hate so much. Less food and more walking.",
            "doing your eyebrows",
            "Makeup skills",
            "You have a very sweet smile :)",
            "Keep your smile😊",
            "I would say maybe a different glasses frame?? A bigger one. It helped me a lot",
            "Just being yourself. Never mind what other people think of you because you then will just hyper focus on all the Negatives",
            "New glasses. Those ones look too big for your face",
            "You look great. I would not have guessed that you are 42. Keep up the good work and stay confident in yourself",
            "Your teeth are fine don’t listen to other guy",
            "I think you are cute as hell. You don't need to improve on anything. Just be you",
            "You're very pretty just the way you are!",
            "You glow…just adorable",
            "Loose the glasses",
            "Tattoo removal. Especially the pill bottle. Bad look",
            "Getting more sunlight",
            "[removed]",
            "More gym lol. No jk, starting with a little gym is fine.",
            "maybe a wig",
            "Your attendance to the gym",
            "[removed]",
            "What does being a crazy cat lady of 4 mean?",
            "Indoor running",
            "This BBC 🥷🏾🥷🏾🍆",
            "Everything",
            "What's wrong with you just like you are?",
            "The brows are strange for sure",
            "i'd look into minoxidil for your eyebrows",
            "I get it. Trust me",
            "Everything",
            "😳😬🤮",
            "braces and micro blade ur eyebrows. those two things would be a game changer",
            "You look really young :) that's a good thing",
            "You look half your age.\n\nMaybe some work on your teeth, nothing else",
            "You look great",
            "nothing",
            "Style and how you present yourself. Showing the world the best version of yourself goes a long way",
            "I can tell how nice and sweet you are just from your pictures. I think you look great honestly!",
            "Great eyes and smile",
            "Covid's over, tell your eyes to stop social distancing.",
            "I think you're pretty perfect right now !",
            "Better taste in tattoos",
            "Your tats disturb me.",
            "Emotional intelligence. Everything else is secondary",
            "More feminine eyeglasses",
            "You are a natural beauty, you don't need to change anything or ask for other people's opinions. Love yourself for who you are and the right people will come to you.",
            "Your desires and Fantaces",
            "It’s the eyebrows for me👎🏾",
            "Basically only gym",
            "Wana do video call signal or Google chat",
            "Last pic looks nice but too much make up",
            "Why the gym?",
            "Nothing your perfect x̌",
            "Nothing you are perfect.",
            "A time machine?",
            "Lovely smile and seemingly nice persona. Leave the nose hoop for the 20-somethings and ditch it. You look fine.",
            "Ok. Thank you. Tattoos are not for everyone, I agree. All of mine are cats. It made me like my glow in the dark pale skin more. Haha. =^..^=",
            "Because everyone already knows about the gym. There’s no need to say it to anyone because the person already knows.",
            "Because I already know about the gym. I have a membership, just need to be healthy enough to go.",
            "Agree with this 100%",
            "Simp",
            "I know the gym, yes. What from the dentist? I have a tiny chip in my front tooth, but it they fix it, they will take a much larger chunk out. I know because I broke the other front tooth...a few times.",
            "I actually love the gym. :) I hate cardio, but I do love lifting weights.",
            "They are kid glasses. Hehe. Can't get any smaller, really.",
            "[deleted]",
            "The tattoos have to do with battling depression and being still alive to do so. I love my tattoos. They have all been done within the last 3 years. I would never remove them. I do understand that they are not for everyone though. The pill bottle one is actually my favorite one too. :)",
            "I cannot. I used to tan and then I had to have some skin cancer removed. No more sun tanning for meeeee.",
            "It means I have 4 cats. :)  And I really REALLY love cats.",
            "Thanks.",
            "Thank you!",
            "My tattoos are not for everyone, I know. They are all cats and I LOVE cats. My tattoos make me smile. They tell a story of battling depression.",
            "Your attitude disturbs me",
            "They are not for everyone. I love them. I will continue to get more. I must finish my cat sleeve,",
            "bot",
            "Because I already know that and have a gym membership.",
            "I was assuming that as well … just making sure … because when you assume!!!! Lol",
            "Probably thinks you need a palate expander.",
            "Do you have a very small head compared to the rest of your body?",
            "Oh okay. I see"
        ]
    },
    "29(M) newly single, been a while. How do I look?": {
        "title": "29(M) newly single, been a while. How do I look?",
        "score": 33,
        "url": "https://www.reddit.com/gallery/1d3wbr7",
        "content": "",
        "num_comments": 83,
        "comments": [
            "Greetings Looksmaxxer, We appreciate your contribution! In addition to seeking guidance from fellow looksmaxxers, we suggest exploring our sidebar or to visit howtolooksmax.com for a variety of articles on looksmaxxing. Find valuable guidance, tips, tricks, and more to enrich your looksmaxxing journey.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Howtolooksmax) if you have any questions or concerns.*",
            "[deleted]",
            "I'd recommend trimming or shaving that beard. You look mid 30s.",
            "Brotha just posts the hardest pic in this entire sub as the last one just to flex. He doesn’t need help at all.",
            "What kinda PEDs are you one ,  share the info .",
            "Mid 40s",
            "Not gonna be single for long",
            "“29”",
            "You look like you're about to get some one's girl.",
            "Like a Goober",
            "Alone.",
            "Sir, you’re doing a good job.",
            "Killing it bro.",
            "Frkn weird",
            "lookin strong brother and dont worry youll find the right one",
            "You look great but please only put one - if any - shirtless pics on your dating profile.",
            "Beard",
            "shoulda been seeing the warriors :(",
            "Colour the greys",
            "You’re in great shape. Go to a yoga class or gym and just say hello to people. You’ll be fine. Just be nice and friendly!",
            "Contacts or rimless glasses",
            "I’d highly recommend ditching the greys",
            "Masculine. Completely fine. Work on emotional intelligence and self help areas and youll be completely fine :)",
            "Goooooooooooooooood!!!",
            "You look very fit",
            "Old",
            "Like a douchebag",
            "Yeah yeah you have abs we see them",
            "Handsome!",
            "[deleted]",
            "Glad I could help",
            "More like mid 40s",
            "It’s giving dad, but in a weird way",
            "Haha ayy thanks brotha I appreciate that",
            "Genuinely nothing. Just love the gym and blessed with genetics",
            "At heart yes. But turning 30 soon",
            "Hope you’re right. Time will tell",
            "Lol thanks but nah they’re safe, I’ll find my own",
            "Always been a goober",
            "Yes.",
            "Thanks brotha",
            "Accurate",
            "Appreciate it brotha",
            "Noted.",
            "Indeed.",
            "Will do. Thanks for the advice",
            "Thankssss",
            "I try my best",
            "True",
            "My bad",
            "Thank you!",
            "0-4 on your assumptions",
            "I respect that, same brother",
            "I thought this was r/roastme based on that comment..."
        ]
    },
    "18[M] ahhhhhhhhhh help": {
        "title": "18[M] ahhhhhhhhhh help",
        "score": 6,
        "url": "https://www.reddit.com/gallery/1d3s3pr",
        "content": "",
        "num_comments": 30,
        "comments": [
            "Greetings Looksmaxxer, We appreciate your contribution! In addition to seeking guidance from fellow looksmaxxers, we suggest exploring our sidebar or to visit howtolooksmax.com for a variety of articles on looksmaxxing. Find valuable guidance, tips, tricks, and more to enrich your looksmaxxing journey.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Howtolooksmax) if you have any questions or concerns.*",
            "shave that mustache now",
            "Ur a cutie relaaaax!",
            "Chill af",
            "lose some weight and get those eyebrows done",
            "It’s over for bro",
            "I really don't think that I would look good without it\n\nhttps://preview.redd.it/lnzjpki5oi3d1.jpeg?width=3088&format=pjpg&auto=webp&s=3f66555a62ba2a4f0fe6e98d5495424d1052b133\n\nI mean look at that lmao",
            "Whqt does that even mean?",
            "Bro wym you look better without it",
            "nah u look gorgues",
            "You look fine asf in this pic bro 😭🙏🏼\nYou are better without a moustache fr",
            "he means ur so ugly you can't be saved but just shave the mustache and get ur eyebrows done"
        ]
    },
    "22[M] Guys am I cooked?": {
        "title": "22[M] Guys am I cooked?",
        "score": 10,
        "url": "https://www.reddit.com/gallery/1d3eh8r",
        "content": "",
        "num_comments": 79,
        "comments": [
            "Greetings Looksmaxxer, We appreciate your contribution! In addition to seeking guidance from fellow looksmaxxers, we suggest exploring our sidebar or to visit howtolooksmax.com for a variety of articles on looksmaxxing. Find valuable guidance, tips, tricks, and more to enrich your looksmaxxing journey.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Howtolooksmax) if you have any questions or concerns.*",
            "Deep fried",
            "Get new frames",
            "You look like a Pixar character if that means anything",
            "Peanut haha",
            "![gif](giphy|26gQZRt42KHTIGwSs)",
            "Yah bro you look BAKED haha 🤙🏽",
            "You need different glasses or contacts.",
            "Nah baked like a pot pie lol 😀. I am for sure lmao",
            "[removed]",
            "Yeah",
            "Just love rhetorical questions.",
            "[removed]",
            "Start lifting my bro and get huge, you’ll become irresistable for the women. Gays too, if that’s your swing. 🤝🏼",
            "Cooked how?",
            "Find women that are into Gus Sorola from Rooster Teeth",
            "👌",
            "keto",
            "No, just a little face care and you are all set my friend❤️",
            "A little naked maybe 🤔",
            "Yes",
            "Look like 30s good and bad",
            "Try Gua Sha!",
            "you're cute, better glasses would really help!",
            "Go to the gym. Your face and features are fine. Go get some muscles and be confident. ",
            "I mean I think you look amazing buuuuut that’s just me. 🤗🫶🏼",
            "Yes.",
            "Bro you're definitely a qualified cook",
            "not really, i would get ur eyebrows done and that would change a lotttt",
            "You’re super cute, like a Pixar character.",
            "You're not bad looking, a nicely trimmed beard with it a little longer on the chin would be fire on you though.",
            "I don’t know… are you anti vaxxer and believe in absolute free speech except for anything you don’t agree with? If yes, definitely.",
            "That's positiv right?",
            "Got ranch!!",
            "Yeah been looking into that or getting contacts not that sure rn though.",
            "Second one saying this, idk how but I'll take it aha thanks.",
            "Was* aha",
            "Glad some people feel that way aha thanks.",
            "How do you know he is thin? He didn't show his body in picture",
            "Aha thanks, any particular one that comes to mind?",
            "I think the glasses really suit your face. Personally I like the frames but that’s my own personal opinion. Obviously, if you’d prefer contacts, do them! But I DO think the glasses add character."
        ]
    }
}