{
    "[Crosspost] I turned a passion project about Doctor Who into a publication in Scientific American. AMA!": {
        "title": "[Crosspost] I turned a passion project about Doctor Who into a publication in Scientific American. AMA!",
        "score": 93,
        "url": "https://www.reddit.com/r/IAmA/comments/1dkwk29/crosspost_i_turned_a_passion_project_about_doctor/",
        "content": "[Link to my article](https://www.scientificamerican.com/article/doctor-whos-time-lords-have-two-hearts-heres-how-their-dual-cardiac-system/)\n\n[Link to the AMA](https://www.reddit.com/r/DoctorWhumour/comments/1dknlqe/i_turned_a_passion_project_about_doctor_who_into/)\n\n[Proof - screenshot of me promoting this AMA on my Instagram account](https://imgur.com/a/tZBtc0O)",
        "num_comments": 2,
        "comments": [
            "Hello! Please note that this post is a link to another subreddit, where the AMA is actually taking place. Comments here have been disabled. Please click on the link above to ask your questions in the sponsoring subreddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*",
            "This comment is for moderator recordkeeping. Feel free to downvote.\n\n**u/AmeliaMarvit**\n##[Crosspost] I turned a passion project about Doctor Who into a publication in Scientific American. AMA!\n\n[Link to my article](https://www.scientificamerican.com/article/doctor-whos-time-lords-have-two-hearts-heres-how-their-dual-cardiac-system/)\n\n[Link to the AMA](https://www.reddit.com/r/DoctorWhumour/comments/1dknlqe/i_turned_a_passion_project_about_doctor_who_into/)\n\n[Proof - screenshot of me promoting this AMA on my Instagram account](https://imgur.com/a/tZBtc0O)\n\n-----\n\nhttps://www.reddit.com/r/IAmA/comments/1dkwk29/crosspost_i_turned_a_passion_project_about_doctor/\n\n-----\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*"
        ]
    },
    "I'm Dr. Kevin Robertson, Fire Ecology Research Scientist at Tall Timbers Research Station. Ask me anything about wildland fire in the southeastern US: fire ecology, prescribed fire, wildfire, remote sensing, or air quality!": {
        "title": "I'm Dr. Kevin Robertson, Fire Ecology Research Scientist at Tall Timbers Research Station. Ask me anything about wildland fire in the southeastern US: fire ecology, prescribed fire, wildfire, remote sensing, or air quality!",
        "score": 212,
        "url": "https://www.reddit.com/r/IAmA/comments/1dkehyo/im_dr_kevin_robertson_fire_ecology_research/",
        "content": "Hi Reddit! Dr. Kevin Robertson here, the Fire Ecology Research Scientist at Tall Timbers Research Station in Tallahassee, Florida since 2003. I study ecosystem and plant community ecology of the southeastern US, fire frequency and season effects on plant communities and soils, longleaf pine and shortleaf pine forest ecology, remote sensing of fire and natural communities, and prescribed fire effects on air quality ([see my papers here](https://scholar.google.com/citations?user=5Jb84L4AAAAJ&hl=en)). I have research associations with and advise graduate students from the University of Florida, Florida State University, Florida A&M University, Auburn University, and Louisiana State University.\n\nI'll be here 12:00-1:30pm EST answering your questions live. Ask me anything!\n\n[Proof](https://imgur.com/610QIKI)\n\nThis is an event hosted by the Southern Fire Exchange. [Check out our website](https://southernfireexchange.org/#/) for information about fire science in the Southeast United States! You can also visit [Joint Fire Science Program](https://www.firescience.gov/ords/prd/jf_jfsp/jf_jfsp/r/jfspublic/jfsp-exchanges) website to find the Fire Science Network for other regions of the country.\n\n",
        "num_comments": 36,
        "comments": [
            "Hello, and thank you for doing this AMA.\n\nI have two questions:\n\n1) In the southeastern region of the US that you study, are there any estimates or predictions that have a consensus in the scientific community about how much more frequent wildfires will become in the coming decades?\n\n2) Given that you have associations with and advise graduate students at Florida-based institutions, will [the recent change in Florida state law that effectively scrubs mentions of \"climate change\"](https://www.npr.org/2024/05/16/1251769080/florida-desantis-climate-change-law) from the state code at all impact your or their work?",
            "Hi Dr. Robertson, thanks for doing this AMA.  I'm curious what you might suggest as long-term solutions / remediations for fire danger.  I live in the PNW and the last decade or so at the end of the summer we have \"smoke season\" from wildfires in the West and Canada.\n\nWe obviously need forests for the long term health of our planet, but is there anything we (or specifically timber companies) can do differently to manage AND protect them?",
            "As a Virginian, I was quite surprised by the outbreak of wildfires here and in eastern West Virginia back in March - especially given that it seemed like we got a decent amount of precipitation plus the ever-present humidity.\n\nWas this a sign of things to come or a fairly unique set of conditions?",
            "What is your opinion of Chad Hanson?",
            "What research or technology from the past two decades has most changed the way we manage wildfire?",
            "Is it true there is a job titled “Burn Boss”?",
            "Why do you think that prescribed fire has continued to be so successful in the American South? Are you optimistic about the future of prescribed fire in the US?",
            "I am a undergrad IT student, Is there any way that modern IT solutions could aid your work/field?",
            "Decades after my st Helen's erupted and burned a ton of forest. Is the charcoal and regrowth a net gain for the area?",
            "Is it windier on average this year compared to other years or decades?",
            "Oooh i might have missed this but wanted to ask if the SE USA with its remarkably different and humid climate (plus swamps) has similar mechanisms to how fire affects coniferous forests in the Pacific Northwest, namely that there are certain plants that germinate DUE to having been exposed to a forest fire, meaning that fire is part of a cycle in the biome?",
            "You make an argument for promoting native biodiversity in here. I think that's a good idea so please don't take this as an attack, but in Oregon we're seeing, especially in the south of the state, that we don't have the same weather conditions that led to the growth of our forests in the first place. We're getting dryer and hotter. It doesn't seem possible to recreate that native biodiversity. Should we adopt a policy of trying to recreate central California's native biodiversity? \n\nAlso, I've been reading about the history of the state and was kind of shocked to find in the northern part of the state, the native biodiversity pre 1830s was more more hardwood forests as opposed to the kinds of forest we have now. Apparently the majority of the state's forests are secondary growth. How can we figure out what native biodiversity actually is if we're about 7 to 8ish generations into a pretty new ecology?",
            "When are we getting AI powered firefighting drone swarms?",
            "Hi Kevin,\n\nWhat's your take on the need to diversify the forestry sector in Florida from mostly commercial pine species to long-leaf pine and hardwoods? My understanding is that the pine market has softened while the hardwood market has made it more competitive, and deciduous trees tend to provide some natural resistance to burning, either in mixed forests or hardwood dominant forests.",
            "I heard recently that scientists are advocating when there is a forest fire to just\"let it burn\". Their reasoning was something around that the forest will actually become more resilient when it regrows. \n\nDo you think that's true? How do you feel about such statements?",
            "Hi Dr. Robertson, thank you for participating in this AMA. I’m interested in the application of technology in fire ecology. Can you discuss how tools like those developed by Technosylva are influencing wildfire prediction, particularly in the areas of fire suppression and egress modeling? What are the most significant advancements you’ve seen in these areas?”",
            "Any studies on reversal or loss of potential benefits of Rx fire due to rapid and aggressive cooling and soil mixing during mop-up period post RX fire? Thnx",
            "how long does it take for a longleaf pine forest to recover after becoming devastated by fire?",
            "Do you believe that wildfires in the Western US will continue to increase in frequency/magnitude due in part to effects of climate change?\n\nIf so, what are your thoughts on potential solutions to counteract/repair ecosystems damaged by unnatural wildfire patterns?\n\nAlso, apologies for so many questions, have you had any experience as a fire lookout? Thank you so much!",
            "Can't we just create artificial rain in places with rampant forest fires?",
            "A simple but serious question: why is every board and staff member of your organization, as well as all your visitors (from photos on your web site) white?  Your history says that your property was originally a slave-holding estate, but it is now 2024. The area where you are located is actually minority white. How do you account for this, and why should anyone want to work with you? How do you justify working for an apparently racist institution?",
            "1. I think there is a consensus that weather events will become more extreme, both tropical storms (which bring precipitation that fuels growth of plants and thus fuel for fire) and droughts. The frequency of wildfires, that is, how many individual fires occur, is probably not as big of a concern as how widespread and difficult to control each wildfire is. Given stronger droughts, I am afraid we will see more of what we saw in southeastern Louisiana last year, which was uncontrollable wildfires in long-fire-excluded pine plantations that in the past were not very prone to wildfires. Almost any vegetation type will burn if it is dry enough. Of course prescribed fire (controlled fires applied in careful settings)  is a very effective way of reducing fuel loads and mitigating the effects of wildfires and making them easier to contain.\n\n2. I am not sure who exactly that law applies to, but I am assuming that it is employees of state agencies and not college professors. Assuming that is true, I do not see it directly impacting our research. I am not sure if it will influence what kinds of grants will be available or what will be considered legitimate topics in grant proposals.",
            "It is a tough problem, especially as there has been as much as a century of fuel accumulation in many of the systems. The solutions, to the degree that there are ones, depend on the forest community type. Some forest communities, like lodgepole pines, historically burned with high intensity fires that were not necessarily unnatural. Generally, industrial forestry tries to mimic such fires with clearcuts, which both produces a product and avoids catastrophic crown fires, but we obviously do not want to clearcut everything. Doing patch harvests helps break up the fuels to make the fires more manageable, so that is one approach, as well as forest thinning. It will take some time for the forest industry to figure out the best ways to make the forests more wildfire resilient.",
            "Virginia is interesting, like North Carolina, in that it has mountains, Piedmont, and Coastal Plain ecosystems. In the mountains, wildfires are often more common in the fall during dry conditions. In the Coastal Plain and Piedmont, wildfires can occur throughout the year, but tend to be more common in the spring.  Across the region, including in Virginia, most wildfires are caused by humans - either by accident or intentionally. Climate change impacts on wildland fire in the region may lead to more flash droughts (rapidly developing droughts) and extreme temperature days, both of which may lead to more wildfires. Intense rainfall is also an expected outcome of climate change and that can reduce wildfire occurrence on one hand, while also potentially increasing vegetative fuels, which can lead to more intense fires.  One of the biggest wildfire concerns in the South and across the country is the expansion of the wildland urban interface (WUI) as housing moves into wooded / vegetative areas. This intermix of human development and natural fuels can make for really complicated and difficult wildfire suppression. It is important for folks living in WUI areas to be ready for fire throughout the year and also to understand the importance of practices like prescribed fire for reducing hazardous fuels and wildfire risk. For more information on wildfire safety and mitigation, FireWise USA is a program designed to train homeowners how to prepare for wildfires ([NFPA - Firewise USA®](https://www.nfpa.org/education-and-research/wildfire/firewise-usa)), and the University of Georgia has a course on firescaping, the practice of using landscaping practices to mitigate wildfire risk, for certified master gardeners ([Ready for Advanced Training? Register for Firescaping! | Trellis Blog (uga.edu)](https://site.extension.uga.edu/mgevp/2024/05/ready-for-advanced-training-register-for-firescaping/)).",
            "I’m sorry, I have not read his work. I will check into it.",
            "Drones or UAVs are some of the most impressive technology that we’re seeing involved in fire management right now. They are being used to track and understand the movement of wildfires, to identify hotspots, and to rapidly create maps.  They are also increasingly being used for prescribed fires. In addition to mapping and hotspot identification following prescribed fires, drones are being used as ignition tools. Hardware and software like the Ignis system from Drone Amplified can be programmed to precisely drop small plastic spheres that ignite shortly after hitting the ground. This drone-based system is similar to helicopter-based ignition systems that have been used for decades by agencies to conduct large prescribed fires. This 2023 webinar from the Southern Fire Exchange explores private-contractor examples of drone prescribed fire applications: [https://youtu.be/oWOLTNMi7bc?si=lDW04cYkje0aN02n](https://youtu.be/oWOLTNMi7bc?si=lDW04cYkje0aN02n). In addition, this 2024 Southern Fire Exchange webinar talks about some other technology applications related to prescribed fire in the South: [https://youtu.be/ZrxY1TxOs-E?si=ofiZXaHEWyU2-2kF](https://youtu.be/ZrxY1TxOs-E?si=ofiZXaHEWyU2-2kF).\n\nOther technological advances include near real-time detection of wildfires through satellite remote sensing, as more satellites are launched that have the capability to detect heat. New fire behavior models are in the works that will result in a big step forward in fire behavior prediction, such as FIRETEC. FIRETEC is a 3-dimensional fluid dynamics model that uses extremely detailed 3-D fuel maps, topography, and weather inputs to predict fires in a very realistic way. The 3-D models are created by terrestrial and aerial LIDAR, a laser technology for mapping 3-D objects.  These technologies are moving fuels and fire behavior mapping forward in ways that will likely support prescribed fire and wildfire management.",
            "Yes! Burn Bosses are certified individuals who “call the shots” so to speak on prescribed fires, and they are the ones who take responsibility for the outcome of the burn by signing the authorized prescription. Prescribed fires are controlled fires that we apply to the landscape for a variety of objectives: reducing fuel loads for wildfires (aka uncontrolled fires), promoting specific vegetation for wildlife, or maintaining the aesthetics of a forest. There are lots of factors that go into making sure a fire is “controlled” like humidity, wind direction, smoke, fire behavior, neighboring sensitive areas, existing fuel loads and types, tree density, and more. These factors are described by the written prescription. If the fire becomes out of prescription, then the burn must be discontinued. Burn Bosses are certified by their state agencies to make sure they have the knowledge and experience necessary to feel confident in making the call to start and complete a prescribed burn. Each state and even each agency/organization may have different qualifications for burn bosses, but the commonality is their profound knowledge and experience with applying prescribed fire. As an example, here is a link to the certified burn manager course for Florida [Certified Prescribed Fire — Acreage / Prescribed Fire / Wildland Fire / Forest & Wildfire / Home - Florida Department of Agriculture & Consumer Services (fdacs.gov)](https://www.fdacs.gov/Forest-Wildfire/Wildland-Fire/Prescribed-Fire/Certified-Prescribed-Fire-Acreage) .",
            "There is also a title “mix master” for aerial prescribed fire for heli torching. Pretty good one",
            "yes. it’s a requirement to have a certified burn boss design a burn plan for a lot of prescribed fires.",
            "Prescribed fire has a rich history in the southeastern United States. Southeastern flora and fauna have evolved alongside fire on the landscape; historically, the coastal plain region experienced fire every 1-3 years! These fires were caused by both lightning and cultural burning by indigenous communities prior to European colonization. Indigenous groups used fire to clear forests for travel, herd game animals for hunting, and promote the growth of specific forage plants. Even when colonization occurred, burning was still practiced by settlers to maintain forests and agriculture. It wasn’t until 1910, when the Big Blowup wildfire occurred in the Northwest, that the national conversation about fire and forest management changed. Consequently, the U.S. Forest Service launched a nationwide campaign to reduce or eliminate forest fires altogether (see Smokey Bear and Dixie Crusaders). However, unlike in the West, the fire culture was never eliminated in the South. It was greatly decreased when free range cattle ranching was made illegal, but the recent experience with using fire in the South made it easier to bring it back to public lands in the 1970s or so when the agencies finally recognized the ecological and wildfire mitigation benefits of fire. On many private lands, such as in the northern bobwhite quail hunting region of the Red Hills in northern Florida and southern Georgia, frequent prescribed burning has continued uninterrupted to the current day. In 1990, Florida signed the Prescribed Fire Act, which encouraged prescribed burning by reducing liability for certified prescribed burners, and other southern states followed suit. These are some of the reasons that prescribed fire has continued, and will continue, although with challenges, into the foreseeable future. ",
            "Absolutely. In a broad sense, there is a strong need to connect wildland fire practitioners (firefighters and prescribed burners) with the vast amount of data, information, tools, and research results in ways that can be easily used to make decisions (in the field and in the office).  In the field, there are opportunities to connect firefighters and prescribed burners with realtime remote sensing, location tracking, fire behavior, and weather data. In the office, there are opportunities to connect a wide range of existing datasets from historical fire data, fire permit data, fuels treatments, air quality, archived weather, wildlife habitat, and more to help land managers make decisions about prescribed fire at a wide range of spatial and temporal scales.\n\nIT professionals can support or work in wildland fire in a wide variety of ways. There are positions in GIS, remote sensing, database management,, field communications (radio, resource tracking, and remote networks), social media and website technology, and probably more things that I can’t think of right now. Wildland fire and prescribed fire include so many different tasks, responsibilities, backgrounds, and professions, especially at the federal and state agency levels.",
            "Very much so. Here in Alberta, for example, the government uses AI for a number of functions related to wildfires: https://pivotal-with-hayete-gallot.cohostpodcasting.com/episodes/how-alberta-wildfire-uses-ai-to-suppress-fires-and-save-lives",
            "I'm not with Dr. Roberts but I have made a career out of wildland fire and have stumbled into a position where I'm regularly involved in the management strategy for wildland fire you are asking about. \n\nFrom 1910 to the late 80s, the federal government was really good at putting out fires. This has increased the amount of fuel in the ecosystem as well as decreased the health of fire adapted ecosystems. It has also impacted the severity, size, and frequency. \"Letting fires burn\" is a bit of a misnomer some Land Management Plans allow for Fire for Resource Benefit. However, these fires are still managed with a strategy other than full suppression. If firefighters aren't on the ground engaged in some sort of activity it's typically for safety reasons and not resource reasons. \n\nIn order for natural resource benefit fires to occur, things really need to line up at the local, regional, and even national level for land managers and fire management to consider it as a fire management strategy.",
            "What role does biodiversity have in making forests more fire resilient? In my area I see replanting of commercial timber being very homogeneous and very dense.",
            "You mention:\n\n“In a broad sense, there is a strong need to connect wildland fire practitioners (firefighters and prescribed burners) with the vast amount of data, information, tools, and research results in ways that can be easily used to make decisions (in the field and in the office).”\n\nOutside of participating in fire ecology conferences, webinars or consortiums (which I am all for), in your professional opinion, what else could be an efficient way to connect that lack of communication between researchers & the firefighters who implement the plans?",
            "I think of appropriate fire regimes, which make forests more fire resilient, as promoting native biodiversity, rather than biodiversity making the forests more fire resilient. But they go hand in hand. Most of the terrestrial surface of the earth that we consider to be “forests” was not historically covered with dense forests. Tropical rain forests and bottomland forests are examples of naturally dense forests. But most areas with trees had open canopies and grassy or shrubby understories maintained by periodic fires. For example, most of the upland area of the southeastern U.S. was covered by open-canopy pine savannas, and areas with ponderosa pine and douglas pine were similarly open and park-like because of fire. This forest (or woodland, or savanna) structure lets in light that supports a high level of plant biodiversity and associated insect diversity, as well as habitat for many animals species that depend on that forest structure. The periodic fires that maintain such ecosystem structure also keep the fuel loads low, which makes them resilient to wildfire. Conversely, tree plantations typically have very low biodiversity and are prone to wildfires. There is an argument that having such areas to maximize production of forest products frees up space for other forests to be managed for maximum biodiversity, rather than trying to have forests that strike a compromise between productivity and biodiversity, but that is an open debate. "
        ]
    },
    "Crosspost of an AMA with Dan Clark, politics reporter and newsletter author. He covers New York politics and puts all his reporting in the Capitol Confidential newsletter.": {
        "title": "Crosspost of an AMA with Dan Clark, politics reporter and newsletter author. He covers New York politics and puts all his reporting in the Capitol Confidential newsletter.",
        "score": 7,
        "url": "https://www.reddit.com/r/IAmA/comments/1dkdv9k/crosspost_of_an_ama_with_dan_clark_politics/",
        "content": "Direct link to the AMA: https://www.reddit.com/r/politics/comments/1dkdra0/im_dan_clark_politics_reporter_and_newsletter/",
        "num_comments": 1,
        "comments": [
            "Hello! Please note that this post is a link to another subreddit, where the AMA is actually taking place. Comments here have been disabled. Please click on the link above to ask your questions in the sponsoring subreddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*"
        ]
    },
    "[Crosspost r/RetroNickelodeon] AMA with Crystal Lewis, CCM and Jazz Musician and original cast member of Nickelodeon's SNICK show Roundhouse": {
        "title": "[Crosspost r/RetroNickelodeon] AMA with Crystal Lewis, CCM and Jazz Musician and original cast member of Nickelodeon's SNICK show Roundhouse",
        "score": 8,
        "url": "https://www.reddit.com/r/IAmA/comments/1dkc2rs/crosspost_rretronickelodeon_ama_with_crystal/",
        "content": "[https://www.reddit.com/r/RetroNickelodeon/comments/1dkbzbb/50k\\_ama\\_crystal\\_lewis\\_original\\_cast\\_member\\_of/](https://www.reddit.com/r/RetroNickelodeon/comments/1dkbzbb/50k_ama_crystal_lewis_original_cast_member_of/)",
        "num_comments": 1,
        "comments": [
            "Hello! Please note that this post is a link to another subreddit, where the AMA is actually taking place. Comments here have been disabled. Please click on the link above to ask your questions in the sponsoring subreddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*"
        ]
    },
    "I’m the hacker that brought down North Korea’s Internet For Over A Week. AMA": {
        "title": "I’m the hacker that brought down North Korea’s Internet For Over A Week. AMA",
        "score": 27206,
        "url": "https://www.reddit.com/r/IAmA/comments/1divlp3/im_the_hacker_that_brought_down_north_koreas/",
        "content": "Hey everyone so let’s see if this is interesting for anyone, here’s a link to the [https://www.wired.com/story/p4x-north-korea-internet-hacker-identity-reveal/] that broke the news. Since then it’s been an insane amount of interviews with french, german, south korean, south american, and international news outlets. \n\nRecently I was on NPR’s The World and a bunch of other sh**. Anyway, AMA about the hack, personal stuff, whatever! Happy to answer. I have not yet been murdered or arrested, so that’s pretty good.\n\nProof: https://imgur.com/a/B2hD9OY  + https://www.wired.com/story/p4x-north-korea-internet-hacker-identity-reveal/\n\nMore proof with username: https://imgur.com/a/pih4WWG\n\n##Edit: Holy shit folks, how did this actually get popular? \n\nI expected like 5 upvotes lol. I have to do some actual work but I'll get back to absolutely everyone that asks a question who isn't a dick :). Thanks to everyone for being here, I promise I'll be back and answer everything!\n\nI don't have a PR team unfortunately. But I'll see if my cats are up for answering with mashed keyboard type shit in the meantime.\n\n##\n\nEdit 2: Shameless plug for my twitter https://x.com/_hyp3ri0n but really, I do share everything I do there.\n\nAnyway I'll STILL BE BACK. I can't believe this is at the top. I feel like president Obama. Someone just has to \"an asteroid\" me.\n\n##Edit 3: \n\nI'm intermittently back because holy fuck 6.1k?!? Shit. OK. Time to answer, I made a promise.\n\n##Edit 4: \n\nJust a word of thank you to everyone, no I am NOT leaving, I just wanted to say thanks for coming and asking shit. https://imgur.com/a/6SHKbNT\n\n##Edit 5: I see some bitching about the length of the article. First of all that's Andy Fucking Greenberg, he's a fucking boss so read his shit. Second there's ChatGPT. Third here's my short summary of how i did it: https://x.com/_hyp3ri0n/status/1803195682662051854\n\nEdit 6: i’m going to sleep but keep asking and i’ll get to everyone :).\n\n##\n\nEdit 7 common questions and answers:\n\n- yes i’m single (ok not that many have asked but fuck you it’s my AMA :P\n\n- If you’re intelligence, DoD, or have interesting propositions beyond some vague “you should do x” (those are welcome if they’re unique) you can email me here: pax-ama@opayq.com\n\n- Here’s some semi-technical details of the attack: https://x.com/_hyp3ri0n/status/1803195682662051854\n\n- No civilians were harmed in the attack. Only the elite aka regime have internet access, this was quite targeted. Civilians are unlikely to even know this happened. In fact they probably don’t.\n\n##Edit 648\n\nNext person to tell me i’m an amoral imperialist is going straight to DCSA (DoD investigations)\n\n##How I hack!?\n\nFirst buckle in because it’s a years not weeks or months endeavor to be good. If you’re willing to put in the work anybody can get good. It’s like Ratatouille (or Racacoonie depending on your universe), anyone can hack!\n\nFirst read a fuckton of introductory online resources. Go to securitytube and watch anything by Vivek. Man knows his shit.\n\nFind introductory courses or buy intro books, some recommendations:\n\n- Linux Basics for Hackers\n\n- Metasploit: something somethjng (forget the full title)\n\n- This next one is challenging and dated but an absolute must read: Hacking the Art of exploitation\n\n- I hear Georgia Weismann’s PenTesting book is good and she’s a nice lady. So is her mom. That’s not a mom joke. I actually met her and she’s very sweet.\n\n- Download and learn how to use virtualbox it’s probably the easiest way to start. It’s a virtualization software that you run essentially an operating system within an operating system. It’s open North Korea’s malware on my machine and that’s why it could not spread absolutely anywhere.. it’s useful for learning other operating systems so install Linux on there. I generally recommend Linux mint or Ubuntu. Parallels for MacOS users. If you want to real challenge, install something like freeBSD and learn how to use that.\n\n- The web application hackers handbook is the Bible Web application hacking I always tell people if you read it from cover to cover and do all of the exercises. You’ll absolutely be a really good web app hacker\n\n- Black hat python by Justin is recommended. Justin is a really good dude and does some really amazing projects. I know he knows his shit. In terms of the actual content, the goal is to learn python so don’t worry if you don’t fully understand all of the attacks going on. Although he explains them really well.\n\n- for mobile, hacking I don’t know fuck all about it. So ask somebody smarter than me. Georgia I mentioned earlier I did some work in there so I don’t know fucking ask her.\n\n- If you’re interested in macOS hacking there’s just a little bit of a dated book called the macOS hackers handbook I honestly haven’t read it so I can’t speak to the quality, but is the absolute Jesus of macho ass hacking.\n\n- for more macOS stuff there are some books that are called. I think exploiting the macOS Colonel or maybe it’s just called the macOS Colonel highly suggest those but none of these ones are for the faint of heart.\n\n- Use a lot of resources for courses. Security tube is an amazing resource watch anything by a dude named Vivek know who I’m talking about. He has a bunch of shit on there. If you’re starting out, look for beginners shit, go onto Udemy.\n\n- if you want to pay out the ass, but also get a certification that people actually respect there is OSCP by offensive security, but in my opinion, the shit is a little bit overrated\n\n- For programs, you can literally just download and learn right now and nmap is one of the most important ones for beginners. I think metasploit is really important and there’s a shit ton of material out there on it. Learn how passwords are stored and cracking passwords. Even just knowing what that means is important. So look up hashing and no, it doesn’t have anything to do with smoking hash, though that is an optional step\n\nI did see interest in MacOS so here:\n\n- \n\n\nwill post more soon ",
        "num_comments": 3703,
        "comments": [
            "Once you knew you had access, did you make a point of saying “I’m IN!” out loud, even if no one was in the room with you?",
            "I see that you've mentioned you can take it down at any time.\n\nI know you probably can't answer this in great detail but why hasn't NK put measures in place to prevent you from doing this again? Is it a hardware exploit that can't be patched unless they change their hardware out? Do they not know how you did it? Do they know how you did it and for some reason purposely haven't patched it or they just do not have the knowledge to patch it?\n\nAnytime we identify a vulnerability at work it's priority #1 to resolve the issue, so I'm just curious why NK hasn't done anything about it.",
            "What Consequences do you think you are most likely to suffer, and what are you doing to avoid them?",
            "How do you feel about being called a \"Florida man\" in the Wired article?",
            "Was it hard to take it down?",
            "Could you even hack my profile?",
            "maybe this is off topic but do you have any book recommendations  for someone that is currently studying computer science with specialising in cyber security?",
            "Can you please bring down my internet for a week? I need a break.",
            "I’m curious why you are OK with exposing your personal identity and face after doing this, when just last week on Reddit there was a video circulating of North Koreans leaders stepbrother apparently being assassinated by VX nerve gas/agent in an airport. I really am curious do you not think that there’s any repercussions to your actions? Are you not afraid to look over your shoulder at all times now?",
            "how prepared do you think the US is to defend itself against large scale cyber attacks? or to safeguard the data of its citizens? what should we be doing that we're not currently?",
            "Are you afraid they might want to do something to you in return?",
            "Would it be possible to hack their internet in such a way that you could have opened a pipeline from their limited NK-only intranet to the outside internet?  Or is that so walled off that it wouldn’t be feasible?  Giving citizens access to the outside world would be an interesting thing to see them deal with.",
            "You allegdedly committed a cyber crime, and we've seen \"good hackers\" get punished for their good deeds before.  \nDo you have any concerns that you'll be targeted by authorities?",
            "Was there anything you learned about NK while you were bringing down the house?",
            "Dennis Rodman?",
            "Why did you decide to do it?",
            "Is it true that the American government asked you to reintstate North Korea's internet because you were making their the USA's efforts to spy on NK more difficult? If so, how did that communication take place?",
            "Did you manage to take any screenshots of internal websites to show the public?",
            "Could you, and would you, open their internet to the outside world instead of shutting it down?  \nAnd if they reacted by shutting it down themselves, could you stop them?   \nEssentially, I'm asking if you could take total control of their internet.",
            "bit off topic, more of a general question: \n- do you have any privacy concerns regarding everyday life, and how do you deal with them? \n- what smartphone do you use (manufacturer or platform/OS is fine), or do you use any kind of custom stuff like grapheneOS? \n- what computer OS do you use for everyday life?",
            "How do you feel about having made all three citizens with Internet access in North Korea your enemy?",
            "Did it cause any improvements for those folks?   I hadn’t heard anything about it and I didn’t think NK had that good of propagandists…",
            "I've heard of companies hiring hackers in order to strengthen their own firewalls. Is the DOD doing something similar with you where they're asking you to find gaps in their defense they can solidify?\n\n-from a canadian",
            "What’s the purpose for that? What other information you were able to find?",
            "In the early days of scylla.sh you have me access to your mega drive where I helped upload some databases and all. \n\nRight now I'm in my summer break and have garnered quite the skills in development (primarily rust). \n\nWould you offer me a remote internship?",
            "Do you think you could do it again if you wanted/had to?",
            "For private citizens that want to defend themselves against foreign attackers, what are some obvious things we can do that you find most people out of ignorance/stupidity usually skip?\n\nQuestion goes double for home networks, not just endpoints.",
            "How did you get into that line of work?",
            "Just a little thanks video, no I'm NOT leaving, just wanted to say thanks for asking shit:\n\n[https://imgur.com/a/6SHKbNT](https://imgur.com/a/6SHKbNT)\n\n  \nEdit: And YES I am a crystal gem. Or maybe Steven. Or maybe the mail guy. I don't even know.",
            "At what age did you start in CybSec? What would you recommend to someone in their mid 20s who's barely starting?",
            "What's your favorite thing to do on Friday nights?",
            "Why do you think the U.S. is hesitant to listen to your proposals on p4x? We need to adopt some sort of program that unifies the hackers and subject matter experts in this country. I am sure it is frustrating trying to cut through the bureaucratic red tape that paralyzes our Department of Defense.",
            "Can you erase student loans next?",
            "Can you do the student loan database next please?",
            "How did you learn how to do these things? I’ve been trying to learn with many different online resources but fail everytime..(ie. tryhackme, hackthebox, etc)",
            "Good AMA mate and very brave of you. I have no knowledge of hacking etc but what you do is really interesting!\n\nAre you not scared of publicising yourself so openly? \n\nWhat do you see the future as in terms of hacking being used more frequently as a mechanism against states like you have done.\n\nWill AI proliferate hacking or in general change the face of hacking & cyber security?",
            "why did you want to do that?",
            "What steps have you taken since, to make sure that the North Koreans aren’t able to target you directly again?",
            "- Does the hack utilize tor network at any point?\n\n- Did you use only publicly available software/information, or did you have some specialized/proprietary stuff?",
            "What are your thoughts on \"Anonymous\"?",
            "Is there a write up somewhere that explains how you did it ?",
            "Do you ever think about the repercussions?\nSome or multiple poor souls who were responsible for the IT security were probably executed or forced into labor camps because they failed to keep hackers out.",
            "Have you thought about giving them MORE internet access? Like letting them see the rest of the world",
            "What movies portray hacking the best and the worst? And, what are some of your favorite ones?",
            "how do you feel about the idea that you exposed a vulnerability to NK which a western government was keeping in its back pocket for when they'd need to use it?\n\nNow those issues are patched and cannot be used against them.",
            "Do you know any Korean? Seems like it would be helpful to have a native speaker in your hacker dungeon",
            "What is your education background?",
            "What kind of message do you think you’re sending to others? Blatantly bragging about this online is sure to encourage others to be just like you. Aren’t you concerned that you may be influencing people to commit crimes and cause tension in the international community?\n\nI understand that people are free to do as they please but you’re openly giving advice about how to get into your field and bragging about how easy it is.",
            "Think you can clear student debt? 👀",
            "North Korea is infamous for stealing cryptocurrency from supposedly-secure wallets; how to stop them from doing so? And why do you think they paid so little attention to their own cyberdefenses, given the ease of which you pulled off your own hack?",
            "Silly questions:\nFavorite band, color, and season?\nLeft hand or right?\nAre you a gamer and if so, what?\nBiggest flex other than taking down NKs internet?",
            "Did they try turning it off and back on again?",
            "[deleted]",
            "I am impressed. I am also far from your line of work, but I am impressed that so many people are trying to learn from your experience. \n\nI am starting this chain:\n\nWhat is the first line in your updown.py script? ;)\n\nNow seriously, I am curious on the production on it. \n\n1. How big is this script? \n2. How long did it take you to develop it?\n3. Did you test it in a lab somewhere or you just went on NK?\n4. How many bugs did you have to fix in the script?",
            "CIA allows there employees to give AMA'S ?",
            "Do you feel bad that your actions probably resulted in severe punishments for North Koreans who were held responsible for this breach?",
            "How good are you compared to government funded hackers in China?",
            "Has North Korea attempted to retaliate against you in any way?",
            "Would you consider yourself a script kiddie?",
            "Why not give them internet for a week?",
            "lol, no I only say that during either sex or when I'm able to join a meeting successfully with my microphone and speakers actually working. Both are rare.",
            "most underrated question lol",
            "oh no it's all good i can speak to that. In the end it's just an architectural vulnerability and I don't believe they own some of the infra that I hit lol. Basically it came down to: their internet sucks and is terrible. It's like it's made by a junior engineer, just one. Their ingress-egress routers are not great - those are the ones i don't THINK are owned by them, but not sure. Thing is their internet is small, so they don't really have reason for large ingress-egress. Except for dickheads like me who exploit that.",
            "Probably banned from traveling to NK for vacation",
            "so far the only “consequences” is every DoD entity and intelligence agencies want to know how I did it. I’ve been presenting it to them for a little bit now.\n\nNothing negative yet honestly. Everyone seems to sort of like it but cannot say that officially. Honestly, I expected a LOT more negativity just because that’s the natural order of things.",
            "I’d avoid airports in SE asia",
            "Bro’s gonna get the nerve agent special",
            "Oh but I should mention, I help as much as I can with cyber crimes (and have always in the past) like counter child exploitation and counter human trafficking a lot with DHS. And now my company Hyperion Gray is half owned by a dude who's the Commander of a Major Cyber Crimes Unit (can't say which one unfortunately).\n\n  \nI also have a lot of weapons - i'm a huge hippie so this is weird - and practice with them regularly. Oh and a ton of body armor, some discreet like armored hoodies and some vests and stuff like that.",
            "I love it. I always tell people that agree or disagree with what i did I absolutely did deliver the best “Florida Man” story. Unfortunately I was not on meth nor did I fuck with an alligator.",
            "honestly i’ve been asked this a lot. And I can’t really tell haha. I used to say nah it wasn’t that hard. But then I told people how i did it and they were like “well ok, it wasn’t hard but only because you’re trained in this….”\n\nI would say it was unconventional and maybe creative but not HARD.",
            "Yes",
            "lol i mean - maybe? I don't know man, I don't have time to try though lol.",
            "I doubt it, Reddit is super secure. Like if you type your password in a comment, it auto censors it. See, here's mine *******",
            "so so so many lol:\n\n- Hacking the Art of Exploitation  (more for the fact that it's a piece of history and gives you an idea of what attacks look like, plus it's a good C code primer)\n\n- The Web Application Hackers Handbook\n\n- Windows Internals Rev 7 Parts 1 and 2 are absolutely critical if you want to get into exploit writing. REALLY dense, but read it cover to cover you can read about exploit writing and it's all just cake, sorta. \n\n- Windows Kernel Programming by Pavel Yosifovich. It's all about drivers. After that you can read some stuff about exploiting drivers and it'll make total sense.\n\n- Black Hat Python by Justin Seitz - he's not only a really nice dude, he knows his shit. Really it's mostly just to learn python, but it's more fun when it's hacking :). Just be careful because it's from 2021 and libraries change quickly.\n\n  \n- The Hacker Playbook (there's a few of them)\n\n- Metasploit the Penetration Testers Guide - if you're just starting out you should learn metasploit, as you get more advanced you'll find yourself using it less, but it is powerful and a good tool. \n\n- C++ without fear - I think that's the title. Point is, learn windows C++, C# is helpful but C++ let's you get in the dirty.\n\n- I haven't found great books on it, but it's critical to learn fuzzing so follow whatever this guy is doing: [https://x.com/richinseattle?lang=en](https://x.com/richinseattle?lang=en) his name is Rich and he's THE guy for fuzzing. Teaches great courses, has great content. Literally anything he does, just eat it up.\n\n  \nThis is very focused on Windows and Linux hacking. For MacOS hacking let me know if that's of interest, or mobile hacking. For wifi, just read internet resources, it's fairly easy!\n\n#",
            "lol FBI would come knocking then....",
            "He answered this. Gun next to keyboard.\n\nBut yes I'm curious as to why he wouldn't change is face for this post. Seems like an unnecessary risk. Plus a lot of what he said in this post will surely anger some USG people",
            ">North Koreans leaders stepbrother apparently being assassinated by VX nerve gas/agent in an airport. \n\nThat happened 7 years ago.",
            "I just like exposing myself.",
            "I’m pretty sure this guy updates his Mcafee subscription. He should be safe",
            "The US is completely unprepared and this attack is just one of a TON of examples of that. They can slowly walk past our defenses, if they even exist, even in critical infra. Hell they hit me and a bunch of other security researchers with no consequence and no defense. I held a top secret clearance for over a decade, so not even we get any kind of defense.\n\nIn terms of what to do currently…. let me think on it and i’ll edit this comment!",
            "I'll offer my two cents since none has been offered. Keep in mind I'm not a security researcher or currently work in a cyber security role, but I work in the industry and have had more infosec specific roles in the past, and cyber security is kind of the default posture for folks in my world. \n\nMy personal info has been stolen from the DoD multiple times by foreign entities. That's just the times they made me aware of. My info has appeared in other data leaks that I can't track down. And I'm very careful.\n\nYour data is ultimately yours to protect. Use strong randomized passwords and 2 factor authentication. Change your passwords often. Store data locally wherever possible. Look into the 3 2 1 backup method. Look into how to harden your browser. Don't click on ads. Don't let your phone store location data on your phone. Don't let apps access data on your phone/computer if they don't need it. Take steps to secure your own home network. Beware of what the smart TVs and speakers on your home network are actually doing. Avoid public wifi. Use a good VPN, even if you trust the network. Use email aliases. Avoid signing up for every subscription and rewards program. Don't click unknown links without scrutinizing them. Limit your social media presence so you're not easily socially engineered. Understand how to tell if a web connection is secure or not, and read into the encryption/security of different messaging platforms. Don't give information to people you aren't certain have authority and need to know, and make sure you give that info securely.\n\nThese are all little things I think everyone can do, and there are many more. It may seem like a lot but every little step counts. Data privacy is a process that one develops over time, even a little bit of security is better than none, and there will always be new threats.",
            "yeah that’s definitely been a concern. I have a lot of folks in special operations command though, many intelligence connections, and I hear about any “credible threats” if they come. Of course I do take other precautions. I’m kind of a big hippie but I had to buy a few firearms just for protection. I also have body armor - a lot of it. Everything from hoodies that look reasonably natural to full ski jackets lined with armor to the classic vest type stuff. I do now code with a glock next to my mouse. It’s really weird for me, but hey I chose this life so I can’t complain.",
            "That would be amazing. It’s definitely a huge goal of mine. I’d say it should be possible. But it may be somewhat difficult depending on their setup. From what i’ve seen they aren’t great at setting stuff up, so I’m absolutely going to try!",
            "Actually the US government was far far more a concern than NK. However now I’ve done work in the space of sort of what they called “guerrilla/unconventional warfare” for folks in the DoD because of this. I’m also working with the folks that would be the ones arresting me and they gave me a nice unofficial commendation (a challenge coin if you’re familiar). I suppose there are other entities that could come after me but I think it’s tough to, I don’t know. But will there be a legal case of “North Korea vs P4x”? Who would take that on even!\n\nWe don’t even consider NK a country, they’re a terrorist state officially. So I hit back at a bunch of terrorists that attacked me. I probably broke some international shit but 🤷.",
            "They suck at Internet. Their internet is little sticks and glue. Even better though, I learned they have only two routers of egress and ingress of the Internet. What I eventually ended up doing was focusing a lot of bandwidth on those routers . It took down all routing into and out of the country. Along with conventional DoS like memory exhaustion and just a lot of bandwidth hitting them, when those two routers came down it was game over.\n\nIt wasn’t just a DoS on their infra, it actually took down all routing. The errors people got were “there is no route to host” which was awesome to see honestly!",
            "Yes. Shit you’ve caught me.",
            "\nit’s a good question. First of all - they targeted me in an attack directly. https://www.theregister.com/AMP/2021/01/26/north_korea_targeted_me_0_day/\n\nThat was disconcerting. Even more disconcerting was that the USG has absolutely 0 response. I’m a private citizen. sure i have a lot of ties to the DoD but i’m certainly not a warfighter. Other citizens got hit too, a handful of them.\n\nThe message was sort of 50% to NK and 50% to the US government/DoD. To NK: keep pulling that shit, some of us can have real effect on your country. \n\nFor the USG: If you’re not going to do anything at all except ask some inane questions and then ignore the whole thing then I’m going to do something about it.\n\nI don’t think they’re very happy with me (either party). I think I kinda made the DoD look like little bitches. They have billions and billions of dollars, and my response on a me-sized budget was far more than they have ever done. That’s not a pay on the back to me - it’s pointing out how ineffective they’ve been!",
            "Nah that’s not true. I let their Internet come up because I wanted to. Mainly a couple of things - I wanted this to be a warning, not a huge takedown. I could have kept their internet down indefinitely.\n\nIn terms of operations there absolutely are non and if there are then they suck. People often say at be disrupting this or that, but everything i’ve heard from operators in the USG is that they like my work. If there was an operation then they’re allowing bank robberies, ransomware of hospitals and major critical infrastructure, and now attacks on private citizens. There is no operation, at least I don’t know of one and I have friends in a lot of places. If there is one somewhere that i don’t know about then they really suck and I don’t really care if I disrupt them.",
            "No but that is absolutely a personal goal of mine. Uncover what they call the “Walled Garden” (or something  like that). I want to see their intranet. And I want to show it to everyone.",
            "Just for fun, here’s a website of theirs available on the internet.\n\nhttp://www.cooks.org.kp/kp/",
            "I absolutely would and plan to open things up to the world if I can. Unfortunately I may be able to take control of their internet but they always have the “unplug” option :-/. So they can just unplug and replace whatever I did to take over.",
            "Curious about this too!",
            "LOL. That's great. So yeah regular citizens have 0 access to the internet, only the elite (government). So this was very much targeted as a message to them. From what I've read there's a few hundred of them lol. I know that's not much better but better than 3 random people lol.",
            "They’re amazing at propaganda internally. They’ve very very effectively cutting off their own people from the rest of the world. All they get to see is an intrAnet of propaganda. People are born into it, believe it all because that’s how they grew up, and get indoctrinated. It’s really sad to see.",
            "The DOD definitely does pen testing, like any organization, but I'd imagine they'd hire a company that specializes in that field (and also doesn't post about it on reddit)",
            "I worked doing that for a long time :). It got boring after a while to be honest. They're called Penetration Tests or Red Team Engagements (they have differences but they're not super important to your point). I did it for many many years. The problem is you have a document that says what you are and are not allowed to do. They will always limit you in some way, usually no phishing and no social engineering (tricking people by say, calling them). Then they list assets you can't touch or IP ranges you can't touch. Often those are the ones they know are vulnerable..... you usually get in anyway because the DoD is a massive organization and massive orgs work via policies and procedures which are completely defficient.\n\n  \nAnyway it's just sorta boring, you're the customer's bitch most of the time, and it's a lot of paperwork. I don't want to ever write a fucking report ever again. That said ChatGPT now....",
            "Not much……. yet. The purpose was to send a message to both the USG and NK. The one to Nk was obviously stop fucking around. To the USG I wanted to show them that someone with limited to no budget for it, I was able to do this. It’s not because i’m amazing. it’s because i just tried. did my work and then executed. They can’t seem to do that.",
            "that's sick! Thanks for the help with that, it made a huuuuge difference. Unfortunately I just restarted Hyperion Gray. Shoot me an email though or a twitter message and let me know who you are. It's looking like getting started is going to move quick.",
            "Oh i have a script called updown.py that could do it literally anytime, and it’s shared with others too. Yes, at any time I could. And if they keep stepping out of line their shit may go down for a bit longer….",
            "I was 13 and a little shithead. I hacked my friend and thought it was awesome. I probably watched the movie Hackers to many times even though it's objectively terrible lol. After that I studied math and physics and didn't do much with it. When I got out of college these jobs, where you could hack legally became a thing and i was like oohhh shit. So i started doing them, and reading and reading and reading and on and on. I live for this shit.",
            "I'd say you have plenty of time and it all depends on how much you can dedicate to it. People talk about \"years of experience\" but that's not really something set in stone in terms of time. I ATE BOOKS for breakfast lunch and dinner (instead of actual food most of the time) because I was REALLY into it. I'd say read read read. Start deciding fairly early which discipline you want to go into, exploit writing, network hacking, mobile hacking, and get yourself all the books you can. Don't just buy hacking books, buy books about the internals of the operating system and read ALL about them. Fiddle around a lot. Be prepared for frustration and be ok with it. Know when to take a break. Most of all just go do it. Like NOW. Go eat books, love them, buy too many computers, experiment. Do it all, just fuck around with shit, learn the command line, learn about how memory works, learn it aaaalllllll haha. To do that you can read books or even just google around, see if you can do what they're doing.\n\n  \nLearn programming languages. Absolutely needed. At the very least a scripting language like python but would also recommend a lower-level one like C and/or C++ (the latter if you hate yourself). It's a lot, you'll be overwhelmed. Be ok with being both overwhelmed and lost. I've been doing this since I was 13 and I still get that feeling all the time. I've learned that that just means I'm learning something. Eventually you sink your teeth into it and in no time you realize holy shit i semi know this. It's a Unix system, I KNOW this.\n\n  \nHere's a very incomplete list of books i gave to another poster: [https://www.reddit.com/r/IAmA/comments/1divlp3/comment/l97cjor/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/IAmA/comments/1divlp3/comment/l97cjor/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
            "hack, honestly. These days i'm building up a company and it's all around this kinda tech. I love it. So it's either hack or go out on a date. The dates are usually online dating things, and are usually way less fun/no fun at all lol.",
            "Honestly I think it's just that the DoD is a massive massive organization with old white people at the head. They don't understand and don't like cyber (they probably think it's \"gay\" or something - which to them is an insult). Really though I think they just don't get it - funnyish story, at DARPA who I worked with for over a decade we were NOT allowed to EVER use the word hacking. Like it was prohibited from anything in writing, could get you kicked off teams even and funding cut. However right upstaira and in buildings nearby they're discussing things like autonomous drones, better tanks, how to more effectively and easily kill people, warfighter helping shit like better guns, etc etc. But god forbid we say the word \"hack\"!! How dare we!",
            "you know you're not the first or even second person to ask that lol",
            "my advice to you - keep failing. Read a shitload of books, keep doing all of those, do some crackmes too. Keep failing dude, just seriously keep banging your head against that wall. When you can't anymore read the writeups. Then follow them and do them. Then go for another box. Just seriously keep failing. It's the only way, so much of hacking is just persistence and failing a TON.",
            "Thanks for the kind words :). I was scared, it’s been a few years since i did it. FBI and intelligence agencies knew who i was when I did it back about 3 years ago - they even searched my dropbox that I have not used since 2012, didn’t even know i still had it. But it seemed half hearted and maybe just a warning.\n\nI was way more concerned with the US response than Nk. For NK i had to get a bunch of body armor and weapons (I’m not a gun dude but now have a bunch).",
            "hey sorry i’m getting asked that a lot so im just going  to link to the comment explaining it :). Feel free of course to ask follow ups!\n\nhttps://www.reddit.com/r/IAmA/s/zJvPCxqHtQ",
            "Honestly not much. They didn’t get anything, I opened everything in a totally clean VM (Virtual Machine - totally separate from my real environment). They may have downloaded some pirated software but that’s about it! Business as usual for now, just being as careful as I used to be.",
            "It probably should have but I didn’t care about opsec!",
            "they've always been interesting. I think people have sorta lost interest though. I doubt any real hackers are left that would join an anonymous \"operation\". I prefer to do stuff on my own or with trusted people!",
            "There are in some news stories, but honestly I've lost track. This is the gist of it though:\n\n  \n[https://www.reddit.com/r/IAmA/comments/1divlp3/comment/l976q4k/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/IAmA/comments/1divlp3/comment/l976q4k/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\n  \nAt some point i'll make a longer form thing. Actually most likely at DEF CON this year.",
            "Mr. Robot, i know not a movie, gets it all right. Well mostly. Of course things always take a lot of testing, failing, etc before you get the perfect whatever - exploit, program, etc. But overall they got it all right, just accelerated the timeline by making Elliot so good he never made a syntax error lol.\n\n  \nMr. Robot is my absolute favorite. Second is Hackers, which does fuck all in terms of showing real hacking but is just fun, swordfish was fun but it's hardly a hacking movie to me. I'd say Wargames is my third favorite... and i can't think of any others.",
            "USG didn't know shit about it nor do they have the capability or policy ability to do any of this. They have wonderful hackers, but they basically tie them to a chair with their hands tied behind their backs. If they had the ability to do this why didn't they do it when NK was stealing millions from various banks? Or ransomwaring hospitals? Or attacking US citizens? Or testing nukes?\n\nA huge portion of their country's GDP is literally just stealing. If you really think the gov't is just sitting around watching that and biding their time until they do something worse, you crazy.\n\n  \ni.e. they didn't know shit. Also emphasized by the fact that pretty much EVERY agency came to me to ask how i did it lol. I gave whole ass presentations about it dude.",
            "i know a couple of people that are FROM korea... maybe that counts lol. But no I don't.",
            "My guess is they poured all their funds into attack and they likely don't have a lot of funds. Defense and up to date servers and operating systems take money, they don't really have it. Also defense is just a losing battle right now, if I were running a country and had little money for cyber shit, I'd definitely lopside it towards offense and use it as a deterrent.\n\n  \nIn terms of your crypto, just keep it secret. Keep it safe. No really, just use an offline wallet or a wallet on a computer you don't regularly use. Unless you're trading in millions (aka you're an idiot cryptobro) you're fine. I always have to repeat this to folks: nobody gives a shit about you. So: Nobody gives a shit about you. your crypto is safe because no one cares enough to steal it lol. That's not an insult, it's just facts.",
            "Haha I appreciate silly questions in all these serious ones. Let's see favorite band is tough, depends on the mood, so i'll give you a few:\n\nNOFX, Rage Against the Machine, Grateful Dead, The Misfits, Daft Punk, Nick Drake, The Smiths and Morrissey. lol, sorry no way i could pick just one of those. Honorable mentions to: Beck, M83, Ulrich Schnauss, Radiohead, The Microphones, Milosh, and Casiotone for the Painfully Alone.\n\nThe color is absolutely green. I don't know why, it was when i was younger and I just keep rolling with it.\n\nRight handed, I have a soul.\n\nI used to be up until about Starcraft Brood Wars. After I started working, looking at flashy screens (except for a TV) is kinda tough on my eyes so I don't gave much anymore.\n\nDamn the flex one is a good one: umm, I gave a kidney to my brother is probably the biggest good thing I've done on this earth.\n\nThat was fun :), feel free to keep em coming!",
            "Being able to hack and overload a network doesnt mean being able to do anything what you want to do lol. it’s not like he’s playing a video game and given 4 options to choose from.",
            "Those are two completely different things to do. Just because he can do one doesn't mean he can do the other",
            "here maybe I sum it up better here:\n\n  \nIF there is something to care about. No one has any idea but I'm not going to waste my time thinking about it if that makes sense. IF someone was coerced and IF that person was hurt and IF they were hurt because i took their internet down, then yeah, sure, that does suck and was never my intention. But that's a lot of IFs I'll never know.",
            "the answer is a strong \"maybe\". There has been some funniness I don't know if I should get into, but someone entered my life and was really strangea few months after the attacks. I don't know what to make of it, some people say she's definitely trying to collect info, some say nah. It's a long long story, but honestly I have no way of knowing one way or the other.\n\nNothing else like trying to poison me or anything like that.",
            "I love that you took down an entire country's internet but still struggle with the same mundane tech problems as the resut of us normies\n\nRock on homie",
            "Hahahaha I said that exact phrase as I lost my virginity, having recently watched Superband just days in advance. \n\nIt only recently dawned on me that the first thing she also heard after losing her virginity was a quote by McLovin. And i feel kind of bad about that.",
            "I laughed. I feel like this should be higher.",
            "lol if you’re just pushing routes to them",
            "Banned from r/Pyongyang",
            "Personally addressed special invitation with 1st class tickets, for one, arrive through the door................",
            "Do they show up at your door in trench coats like in the movies? Or do you just get an email and a Team meeting invite?",
            "Are the intelligence agencies paying you to tell them or strong arming you to tell them?",
            "I heard you talking on NPR the other day.\n\nIs this basically just a sophisticated ddos attack on the sole IP address they run everything on?",
            "Are you making any money consulting to the federal agencies?",
            "> ...every DoD entity and intelligence agencies want to know how I did it.\n\n\nIt's genuinely *severely* worrisome that this is the case.\n\n\nOne would *at least* like to believe they were not (or are not) so far behind the curve.\n\n\nOof.",
            "yeah tell me about it. Not going to Malaysia anytime soon and if someone smears something on my face I'm fucking running to a hospital.... not like it'll help much.",
            "nah, tell me they have the balls and capability to come on US soil and murder a US citizen with heavy and really unknown ties to intelligence and DoD. They don't have the capability or will to do it. They don't assassinate people all the time. The last was Kim John Un's brother (er half brother?) because he defected. Before that it was in 1985. They aren't a bunch of psychos, they just play it really well. They will ignore and this will all fade away.",
            "It's still early.",
            "So more advanced than just DDOSing a data centre?",
            "Will you please find and release the Coyote vs ACME movie?",
            "Lol :)",
            "Nicely set up pair of comments. I loled.",
            "You’re every Redditors greatest fear lol",
            "hunter2",
            "************* omg true I never knew that",
            "Thank you! Haven't seen this one in a long time. I miss old reddit.",
            "ILoveBigDicksinMeArse",
            "IputStuffupMyBUTT69",
            "this is amazing, thank you. I appreciate it a lot  😀👍",
            "C++ baby LETTTTTSSS GOOOOOOOOOOOOO",
            "Could you share MacOS the hacking tips?",
            "Sounds like they already have",
            "I work for the DoD so I’ll just take admin leave if my internet mysteriously goes down for a week.",
            "oh it absolutely will, cc u/swim_to_survive .  Frankly after a couple of years of being semi-anonymous (USG knew who i was because my opsec was 0), I got truly sick of their fucking shit, all of the agencies and DoD. I had something that I presented \\*\\*right in front of them\\*\\* that could make for a quick reactionary force that cost little to nothing and would \\*\\*actually protect US citizens\\*\\* from the myriad attacks we are seeing. Literally No one gave a shit. It was so fucking frustrating. Here's a convo between me and some folks at the State Dept.\n\n  \n[https://imgur.com/a/s-lX6inGA](https://imgur.com/a/s-lX6inGA)\n\n  \nThis is after 2.5 years of trying to get the DoD and IC onboard. This was a last ditch effort, there was much more to the convo of me basically saying I'VE FUCKING DONE THAT. And then they ghosted :(.",
            "Yikes! This is very concerning to hear.",
            "“Unplug it and plug it back in again”",
            "I hope you’re actually training with your weapon. Doesn’t do a lot of good if you don’t know how to use it efficiently and under pressure. I appreciate what you’ve done though",
            "Info on the hoodie??",
            "Shouldn't be too hard, I think the entire NK internet runs off a WRT54G",
            "I run a website that’s at least popular in the topic it covers. One day I decided to check how many countries have visited it and lo and behold N. Korea was one of them!  I don’t know/remember how many visits it got (probably low single digits) or if it was vpn of someone not actually in the hermit kingdom (but why?) but more than likely my niche site was seen north of the 38th parallel.",
            "What do you mean they had attacked you?",
            "I'm not at all familiar.\n\n\nWhat's a challenge coin?",
            "What model of router where they using? Was it a bit dated?",
            "For context, how many egress and ingress routers would, say, the UK have? Or france or whatever.",
            "Just to clarify, routing _inside_ NK would still work? So a NK citizen with internet access would still be able to visit websites hosted inside the country?",
            "If they targeted you first, what attracted them to you? \n\nYou seem to not care about opsec, so how do you protect yourself now that they know your name? What keeps them from a complete identity takeover?",
            "One could argue that your actions, although high-profile, inconvenient and embarrassing for NK, were ineffective. What strategic objective did you actually achieve? Some minor disruption and what else?\n\nThey'll presumably now improve their systems as a result of what you did.\n\nOne would assume that the US. has a bunch of these exploits documented, and sitting on them, ready to be used in case a real conflict with NK breaks out.",
            "Here’s the issue that I see.\n\nThey now know it can be done and it’s not an abstract.\n\nNow tthey can now focus on changing and removing that vulnerability(s) so that it’s now harder and perhaps more limited such a effort would be in the future, when it’s actually needed.\n\nThe only way this makes sense is if that vulnerability was already being upgraded and removed - *not planned but actively removed.*\n\nThen the calculation changes so there’s less of a negative spurring them on to be more defensive and you still get to yank their chain a bit.",
            "That'd be awesome",
            "Dude. If you were able to get access to their routers and they were old Cisco boxes, why not compile a custom ios bootloader to give yourself a perpetual back door?",
            "Idk if it’s even helpful but there are versions of their RedStarOS online that could possibly be looked into if that is a possible attack vector.",
            "Surely it can’t be that tough. I mean, the password’s gota be Kim Jung Un’s birthday or like KimJungUn#1, maybe Py0ngyang! \n\nSeriously. There’s not many options. Brute force shouldn’t take that long.",
            "King Jon Un was definitely pissed he couldn't watch porn for a week.",
            "Wouldn't it be a greater challenge than to actually \"give them the internet\"? Take down this intranet blocking everything and give them access to the real thing? lol",
            "> They can’t seem to do that.\n\nCan't? Or don't want to?\n\nAlso, maybe they *have*, and you (or we, or even NK) don't even know about it.\n\nJust needling you a bit...and while I'm not really a blanket unabashed fan of international espionage, I do think what you did was pretty cool.",
            ">They can’t seem to do that.\n\nHave you considered that they \"don't want to do that\" (right now, however)?",
            "\"updown.py\" lol, that's great.  Is Python the language you primarily use to make these scripts?",
            "Post the IP's and ports of the two NK routers. Let the internet do its thing. 😉",
            "what kind of reading? any books/ courses you recommend to start with ?",
            "Are you saying those pen testing jobs aren’t about pens 🖊️? 😳😄",
            "I can imagine on a first date - \"I shut down the entire internet for a whole country.\"\n\n\"pfft, nerd.\"",
            "Agreed. I have had similar experiences trying to convey credible intelligence to every facet of this massive circle jerk and the only thing I have to show for it is advanced persistent debt. Look forward to watching your future endeavors. ",
            "thanks! really means a lot to me :)",
            "Jesus that’s really scary mate! I hope your situation is a little better and safer now! It takes a certain type of courage to do this kind of thing! \n\n\nDo you think you did some good with this operation or any other ones you do, in terms of hindering the control NK has on its people etc? \n\nWould you coordinate any future projects with state intelligence so the outcome and fall-out can be more predictable and safer or do you prefer to do your own thing? Understandable if these questions are too intimate or difficult to answer 😀",
            "How did you know they searched your Dropbox?",
            "> They may have downloaded some pirated software\n\nAnd no porn with Kim Jong Un?! \n\nOK, ok... next time! You promise?",
            "Hey man, just be careful. I get you're enjoying your time in the sun. But remember, it's not hard to kill people, and they got a hell of a lot more resources than you. Be cautious brother",
            "Don’t take any chances.",
            "I love that you refer to sex as a \"mundane tech problem\".",
            "lol well at least she has a story now. And a unique one at that!",
            "That's what it kind of sounds like. Or maybe a DNS or NTP amplification attack but those have been mitigated in the past several years although I don't expect NK to be running the latest Cisco hardware and firmware.",
            "That sub is weird. I’m pretty sure it’s satire but can’t confirm.  People go to great lengths to their posts. It’s both hysterical and disturbing",
            "We actually did it in a basement a couple of times lol. It was super X-Files type shit but also like any normal meeting. Weird dissonance…",
            "ha, asking politely. I have more connections than anyone that could strong arm me unless they’re super high up. So they can try but i’ll just give them one of these🖕",
            "Something like that, but a bit more. I targeted absolutely everything. At first I was just hitting their assets, like their nameservers, vulnerable web servers and such. That required me to write some custom stuff and use things like slow-polling attacks (you request website info veeerrryyy slowly, taking up a lot of time for the web server), n-days (vulnerabilities that don't have an exploit so had to write them), their mail servers and other such things. Then I noticed the same two IPs showing up, so I essentially surrounded the country with servers that I rented (even some in China to see if there was some special routing). And I did a traceroute using them, if you're not familir with that it basically just tells you the route something is taking to get to a location. I noticed that no matter where you come from it always went through the same two routers.\n\n  \nTraceroute isn't a hacking tool it's a really old network admin tool (though I guess many things double as that). Normally when coming from different locations to a country it will take the shortest route possible - like if you're on the northwest of Russia it'll likely take a route into the country on the Northwest of Russia. For NK it was the same two damn routers eeeevery time, no matter where it was from. That's when I knew I had a chokepoint. So I continued to hit inside assets which is why people saw it was intermittently up and down - that's effective but not AS effective as what I did next. Which is what you're describing, I hit the two routers with a shit ton of rented bandwidth. After a while they just went completely down and any attempts to reach the country (in or out) were met with \"no route to host.\" When I saw wthat message come up I was like \"holy fucking shit\" because I knew what it meant - there was no routing to or from NK. Total outage.\n\n  \nSo yeah you got the skeleton of it, there was just a lot that went into it :).",
            "My professor back in college did that by accident in the early 2010s. To N. Korea as well.",
            "so so so much money. I've made exactly negative 80,000 dollars. That's not even a joke, that is literally what it has been. It's been a lot of cost trying to prove the concept to them to show that guerrilla warfare in cyberspace can be very real. Also, possibly most importantly, I have a single script that will very simply stop ANY attack coming out of North Korea. I submitted this to everyone, I told everyone, I contacted congressman, connections in intelligence and all kind of DoD. Absolutely no one gives a shit. \n\n\n\nThe State Department has a thing called \"Rewards for Justice\" and they talk extensively about the NK problem and how we're being hacked all the time. They pay millions for information. I told them \"I don't want any of your money, I want you to know who I am \\[insert wired article here\\] and that I can listerally make any attack coming from the country North Korea stop in its tracks within minutes. Let me grab their response:\n\n  \n[https://imgur.com/a/s-lX6inGA](https://imgur.com/a/s-lX6inGA)\n\n  \nJust be ready to be fucking infuriated. They have a bunch of shit about how we need to take on the NK cyber threat. I literally give them a SOLUTION and they say it's not within their purview, go to other intelligence agencies. I told them I FUCKING DID. No response since.",
            "Just because they want to know how he did it doesn’t mean they dont know themselves \n\nIn computer land there’s multiple ways to solve the same problem and do the same thing. They could be seeing if he has discovered something novel or if he is doing the stuff they already know how to do",
            "They probably already knew about this vulnerability and are pissed that this guy removed a potential hole that could be used against and adversary.",
            "after stuxnet and all the nsa stuff... they arent behind the curve, they are the curve",
            "Run to wash your face properly. He would have survived if he had done that I think.",
            "If that does happen forcefully make out with whoever did it and take them with you",
            "NK infiltrated my wife's employer - Sony Pictures - and exfiltrated some of our data that Sony HR had saved _in a plain text file_ including all of our government identification.  \n\nNothing ever came of it, but I have free identity theft detection for life because of Sonys horrible HR practices.  \n\nThank you for hitting them back :)",
            "This is like an international humiliation. You are certainly on their list. Please take at least some precautions:\nChange name, address, voice, face and skin colour \n  \nPS:Really smart with the photo, is that your highschool bully or wife's partner?",
            "hmm so you're saying I should buy some meth THEN hack north korea. How can I bring the alligator into it though... that's a toughy.",
            "It was. The actual attack - pretty simple and easy. The recon required to know WHAT to attack was the kind of creative part. I'm not a super genius computer hacker like the people below are claiming I'm trying to act like... I'm actually a pretty normal dude. I'm a decent hacker because I fucking love it and live for it, but that's all I can really say about me and my abilities.\n\nSo here's how it went down. At first yep, it was just your basic DoS attack. Not just DDoS, they had outdated nginx servers and I found some CVEs that I could write some n-days for for memory exhaustion. That was nifty. I also hit their web servers with slow polling attacks just for additional instability. Then there was the just mass bandwidth attack (DDoS) that hit their DNS, MX, and other similar things.\n\nHowever the (kind of) unique part was that in additional reconaissance I kept noticing these two IP addresses that would come up. I assumed they were some sort of filter, maybe even a censoring filter? Although that didn't make complete sense because their people don't have access to the Internet, only the elite (aka government). So what I did was I rented a bunch of VPSs surrounding the country and some in China specifically (in case there was some special routing from there). I did a traceroute on all of them with some basic distributed computing tools. Sure enough ANYWHERE I was coming from went through those two assets. They were routers. In other words I found their only two points of egress and ingress to the country.\n\nSo I focused most of my attention on those and brought them down with again, yes, just simple bandwidth exhaustion attacks via some open ports. I made requests that would take up a lot of their bandwidth and not a lot of mine (amplifying attack). It worked, when i saw that \"no route to host\" for literally any host within country I knew I'd taken their routing completely down. It was a bit of a holy shit moment.\n\n  \nThe attack itself was absolutely not complicated. It was definitely far more complicated figuring out WHAT to attack. Most DDoS is just straightforward stupid shit, but if you take the time to understand the shape of the network it makes a huge difference as it did in this case. So nah, not that complicated, just kinda creative IMO. And no that doesn't mean i think I'm some kind of super hacker. Just that I planned well, did recon, and executed.",
            "Idk if they got actually hacked or just hilarious lol",
            "LOL. I mean it'd pretty much be doing recon and phishing. A lot of people post too much about themselves (I'm sure i do over the like 12 years i've had this profile). Get em to click a link and some basic social engineering and then keylog. Boom you have a reddit account. But that's a lot of work for people I have no reason to hack! Also I generally don't hack people, it's kinda creepy.",
            "Thanks.",
            "Lmaooo",
            "How’d you know my password!!!",
            "EngorgedPenis33?!\n\nEdit: lol no it doesn’t",
            "LadyCock!69\n\n\nGuys did it work??",
            "password123",
            "Wtf.\n\nOP: I just want to make sure you understand that what I have here is a way to prevent any and all attacks coming out of NK.\n\nState Dept: Neat but we’re not really interested in that. Maybe some other agency would be interested.",
            "As a former contractor with clearance the bureaucracy is a nightmare. I’d probably do as you, but keep receipts and give it all the the press like carol from WaPo. Let them torch their ineptitude.",
            "You do not have security clearance, why are you assuming they were ignoring you? You would never be told by the US Government if they were going to use your tactics. The flow of information can only go one way in this relationship, anything else could have been viewed as a breach of national security. They would never have led you to believe that they were going to use your information.\n\nThey may have been paying close attention to you and learning from you. But, they may also have already know how to hack the North Koreans. I wouldn’t doubt this for a second. You most likely weren’t telling them anything new. \n\nI don’t think a US citizen should ever target a foreign enemy like this. I think it’s a terrible idea.\n\nThe US government knows how to keep secrets. You may have been lead to believe otherwise, but members of our senior intelligence agency are brilliant and know how to play games. And I say this as the daughter of a former senior intelligence officer. I wouldn’t ever assume anything about our military. They are not idiots.",
            "What if the were monitoring all the traffic going through those two routers and you have now destroyed that?",
            "You didn't even blur the number of a state dept employee?\n\nWild lol",
            "Start a company. Provide \"removal of nation state internet presence\" as a service. 😄",
            "People care, but your responses were not good for the type of people who might find it interesting. Instead of rambling about articles and other nonsense in long paragraphs, just provide them a summary of everything they requested...the 5W format (and a one sentence Bottom Line Upfront prior to the 5W) is common in the community who might want it. Decision makers don't have time to refer to multiple sites, read paragraphs about it, or chat with you. If you need help formatting it like that, then please let me know via DM.",
            "I mean, its unfortunately pretty standard in regards to technology. Security for things comes far after things are developed. Think 9/11 and airport security. Just because the capacity for tragedies to happen exists, does not mean that the precautions will be taken until its too late",
            "Defense is harder than offense and companies change software/hardware/libraries/etc far more often than they do security reviews.\n\nIt works in reverse too, Chinese/NK/Russian companies and govt computers aren't any more secure, its just that there's less reward for breaking in.",
            "yep, I practice with them as often as I can. I'm still not the most amazing shot, but I throw a red dot on there and more than good enough I suppose. I think the part I think about is keeping a cool head if something happens.\n\n  \nHowever these attacks don't happen like in the movies. There's not gonna be a North Korean agent coming to kill me. They'd pay a gang to do a drive by or rob me then kill me. So it's really a matter of taking precautions that most people would take, just taking them more seriously.",
            "I still miss my WRT54GL running DD-WRT",
            "Wrt54g probably more secure than my shit att modem lol",
            "It's described in the article he linked - NK actors attempted to compromise his computer and steal his work.  That's was precipitated his vigilante response.  He reached out to the FBI, who really didn't do anything so he took matters into his own hands.  The wired article linked at the top covers the series of events.",
            "[Was curious myself, looks like OP has already answered.](https://www.reddit.com/r/IAmA/comments/1divlp3/comment/l96m42w/?context=3&share_id=YzAygfSEeNYZIGbBgRGyR&utm_content=1&utm_medium=ios_app&utm_name=ioscss&utm_source=share&utm_term=1)",
            "It’s a physical token issued by a commanding officer or leader to a group that achieved something impressive. Often used at bars instead of a dick measuring contest you have a highest challenge coin contest",
            "Today they're coins, large commemorative coins usually around 2 inches across, that are minted by some group or other, either to commemorate the group itself or some particular event. They're presented to members of the organisation, people involved in the event, and visitors and distinguished guests as a mark of respect.\n\nFor example, some video game companies mint coins with the company's logo on one side, and a particular game's insignia on the other side, and give them to people involved in the project.\n\nIn the clandestine services I expect you can get coins with, say, the NSA logo on one side and a particular department on the other. Perhaps just the department and something important to their work, if it's not official enough to use the agency logo. Since there is no way to get them except from the department, they are a way of showing that someone is held in esteem by that group.\n\nThe origin of the coins has a few different stories but most revolve around military units using such coins as a way to prove their identity in times of war, and a tradition of \"challenging\" other members to produce their coin, which they were supposed to carry at all times. Failure to produce the coin on demand resulted in some informal punishment such as having to buy a drink for the challenger.",
            "It's a coin that usually has your unit/department/agency logo on it.",
            "yeah i don’t remember the exact model to be honest but it was like a medium sized enterprise one (well two actually). They were dated for sure, not by a ton but clearly enough ;-).",
            "There are many routers in many different internet exchanges. Even Amazon has their own dedicated routes between different countries powered by many routers.\n\nhttps://www.internetexchangemap.com/",
            "you’re right about opsec, I had 0 when i did this. In fact when the article about the takedown first came out a few years ago I was going to do this totally publicly.\n\nThe reason for that is that a lot of this is a message to the DoD. “Some random hacker says the DoD needs to change” is very different than “A hacker who has worked for and with the DoD/DARPA for 20 years says there needs to be change” is one people may actually listen to. So yes you’re absolutely right about the opsec, unfortunately it required me to either be open or just have little to no effect on changing the system that is our kinda shitty offensive capabilities.",
            "yeah like identity theft of me. That’s fine, they can try. Good luck to them, I have resources and a lot of scary people on my side.",
            "The motivation was probably easy: zero-days & vector towards whoever he works with. Very attractive for APTs",
            "the routers i hit were, funny enough, not owned by them.",
            "Or access steam to play games.  I swear I saw a log one time where steam in NK had a single connection in Pyongyang.  It’s definitely him lollll",
            "haha yes, i’m working on it. The Internet there is only for the government right now. So this was quite targeted towards them.",
            "But that ruins their narrative!",
            "It is, I use it for everything unless of course I have to use something else (like Windows C++ or C in Linux, C being my second favorite). I've tried a LOT of langs though, and at some point you're just sorta comfortable in whatever, just have to look up syntax. ChatGPT is boss at that though!",
            "Up/down is used in Linux OS when you’re configuring network settings, so I’m pretty sure it’s also joke at that",
            "[here](https://www.reddit.com/r/IAmA/s/QiVTYqPner)",
            "^^",
            "I'm not sure if it made a lick of difference honestly. Hopefully they get that there's someone out there that can hit back.\n\n  \nI did indeed coordinate with intelligence and DoD but predictably it was frustrating and has yet to go anywhere. I'm still trying and have found some people that give a shit. But in general no one cares, they're just ok with the status quo.",
            "I mean any NOC tech 1 should be able to handle basic port assignment and layer-1 connectivity.\n\nThat said if you are insufficiently careful with your session layer, it can be an expensive mistake.",
            "Have you tried turning it off and on again?",
            "He said it was an amplification attack in another comment",
            "my favorite is:\n\nr/kimyojong\n\n>Kim Yo-Jong: The supreme leader of my heart\n\n>The official subreddit for pics of dystopian hottie, Kim Yo-Jong. Just because she wants to kill us all and has probably committed several human rights atrocities doesn't mean she's not a cutie\n\n>Kim Yo-Jong: The supreme leader of my heart",
            "Idk if it’s disturbing. I have this unhealthy draw to North Korea from pure curiosity and absurdity that such state even exists. I try to watch all the documentaries and news about NK. There is no other country on this planet that is like North Korea. I always joke with my wife that my dream travel destination is North Korea, but then I realize how many atrocities are commited upon humans over there and how some tourist were straight up killed for one wrong move and my enthusiasm fades, but the curiosity will not.\n\nEdit: guys it’s not a competition which country is the bigger hell on earth. It’s just my random obsession with NK. I am not a deranged person who loves to see people suffer. It’s not that deep.",
            "Except that it's NOT satire. One of the original mods had it as a goof and was eventually contacted by actual DPRK representatives. He posts about it in his sub. It is a WILD story but the sub is 100% legit, full of DPRK 100% propaganda.",
            "[deleted]",
            "OP: \"I'm actually a pretty normal dude\"\n\nAlso OP: 'I got high level government connections.'",
            "Please write a memoir so it can be turned into a movie  or release a course about hacking so I can enroll lol",
            "You seem like a regular Redditor. Makes you even more awesome",
            "> I have more connections than anyone that could strong arm me \n\nChad right there.",
            "What's your total rented VMs budget?",
            "How do you even get a \"country's\" ip address in the first place?",
            "Story?",
            "Makes me think of Edward Loomis and ThinThread. Whenever someone says “such and such is probably a conspiracy” I’m like no people are just exceptional at being mediocre. You’d have a better chance making money at least as a government contractor teaming up with a retired NSA insider.",
            "Reading your AMA reminds me of a reddit and internet culture from a bygone era. Super interesting stuff man, thanks a lot for posting and being so forthcoming with everything.",
            "Is it possible that they already have what you're offering? But don't say so because that would make public what they have?",
            "This is because politicians love to talk about problems and without problems to cry about solving they have to actually try to solve them, therefore it’s more profitable for them to look the other way.\n\nTalk is free after all.",
            "This isn't anywhere near the level of solution you're acting like it is lol. It'll work a few times and then they'll spin up a bigger pipe into China or some other country they are friendly with and that'll be that. Probably costing NK a lot of money, but hardly a one-button solution to stop every attack from NK ever...",
            "Sounds like bureaucracy is getting in your way. Why not just sell the script?",
            "That phone number isn't blocked out if it's sensitive...",
            "Does NK really launch attacks out of NK? I just assumed they would stage from somewhere else. Seems too simple to just ignore traffic from NK.\n\nI'm sure I'm not understanding something major.\n\nReally appreciate this AMA. Most interesting thing I've read in a while!",
            "yeah there are definitely plenty of people who could have done this in the DoD/IC. They have amazing hackers. Theyre just kept behind a wall of bureaucracy.\n\nExcept the State Dept. they're  just terrible at everything.",
            "Fair point.\n\n\nIncidentally, this is (as I understand it) *also* the reason behind *some* MS/Win bugs never being patched out -- they were too useful to remove.",
            "Yeah they probably know a bunch of vulnerabilities, and wanted to interview him extensively so that they know which of their plans/processes are still under wraps, and which things he found.",
            "The amount of nerve agent to kill someone is so tiny, by the time it's on your face you're already dead if you don't immediately inject atropine or something similar.\n\nA grain of rice could contain something like 200 lethal doses of Novichok, which is Russia's \"easy to use\" agent.",
            "The person that did it didn’t know.  They were told it was part of a prank reality show",
            "I mean, at their core, all databases are just text files.",
            "\"Florida man on meth disables North Korean internet while wrestling alligator\"",
            "Liquid cool your PC from water from your alligator tank. Easy.",
            "An entire country with two routers? Lol",
            "... I don't go by that name anymore \\*pulls out floppies\\* call me Zero Cool",
            "You are still a good hacker. You hacked a country infra. Yeah they had shoddy security but so did equifax.  \n\nThat's what hackers do. Find vulnerability and exploit it. Give yourself more credit.",
            "Lmao realizing that their networking infra has such an insane bottleneck... No wonder it was a holy shit moment.\n\nNice one OP!",
            "I look forward to the movie of this creative endeavour. Which actor would you like to see play your part?",
            "I work in IT, not even high up in this world.\nEverything you just said tracked in my mind. Yea good planning and discovery, basic attacks on key IPs and balls larger than mine would do the trick.",
            "Nice work, the recon and balls to do it are really impressive. I'm guessing you only went as far as renting enough servers with enough bw to choke those egress points after you knew you could do it. Hillarious there are only 2 redundant paths out, must be by design from the rest of the world. Hearing you describe traceroute to find your target is really funny to me as a network architect... no offense meant, its just so simple!",
            "Gonna send this to my dad.  He used to do some consulting work with Kevin Mitnick back in they day so he'll get a kick out of this. \n\n\nGreat idea thinking to dredge the servers in China.",
            "Reminds me of that time in early 2000's I brought down my local gaming forum with an auto clicker. The place had a spam section where you could just post shit, having the most number of post was something to brag about with other spammers. One time I realized that if you clicked fast enough your post would get duplicated. So set up an autoclicker and made a thread for myself and left the auto clicker running over night. Came back the next day to a message on the front page stating the site was down and everyone could thank me(it was a small community of 500 to 3k people maybe even less users that actively posted).\nOf course it wasn't my intention to break the site I just wanted to be the undisputed champion of most post. It went to around 60k post before totally shutting down the site. Prompting to get all my post deleted because of course no database was able to hold that much without massive performance drawback and a 30 second delay before you could make a new post. I got in contact with the site owner and apologized and told him it was not my intention, he told me it was no biggie and that it was his fault because he had to put that 30 secs measure long time ago but that he had to delete all my posts. In the end all I got to show for was a picture he sent me that I ended using as signature in the forum, of my stats in the database before getting deleted. Good old times.",
            "So what I gather, is it like a giant lan party instead of the internet. And everyone is connected to 2 ports?",
            "Damn, Kim Jong Un must have been REALLY upset he couldn't get on league that week.",
            "Thanks for the overview.\n\n\nI made requests that would take up a lot of their bandwidth and not a lot of mine (amplifying attack)\n\n\nSounds like DNS source address spoofing. Send 1000s of requests for a domain with a large response with a fake return address. A few bytes for you, 1000s of kbytes for them per request.",
            ">I made requests that would take up a lot of their bandwidth and not a lot of mine (amplifying attack).\n\nCan you elaborate on this? My guess is that you were sending small requests and asking for large responses. Was this a DNS resolver type of thing?\n\nAnd you are a fantastic hacker btw, it's a great achievement what you did, put that on your cover letter lol.",
            "Men in a black helicopter are either going to kidnap and execute you for disrupting years long surveillance programs and hacking of their own, or offer you a job you pretty much can't say no to, hope it's the latter lol.",
            "Very nice. How much did you spend on the hosting and network traffic? You used some private VPSs, but any cloud providers?",
            ">generally\n\n We are so fucked lol",
            "Alot of people who don't work in this field generally don't understand how much social engineering actually plays into the process. But even then, if your target ends up using a public network without much protection that you have access to, what's stopping you from using a program like Wireshark to simply lift all the shit you need from them?",
            "Yes it does, to you it looks like EngorgedPenis33?! (I copy pasted what you wrote) but to everyone else it looks like *****************, see?",
            "Looks like you wrote all stars.  Is that your password?",
            "Ooohhhh. Not a PDF huh? Well, it’s 4:50pm so I better get going.  ",
            "Welp. An argument can be made that US cyber experts already aware how vulnerable the NK infrastructure, they want to keep that info and only attack them when the moment is critical. On the other hand, an innocent attack in peace time such as this will bring about nothing but only alert the enemy regime of their weakness and thus give them opportunity and valuable time to reinforce their infrastructure. \n\nIt’s surely the NK is frantically upgrading their defense system everything now. Future attack when we really need it (such as when they’re coordinating to launch missiles), will surely be harder.",
            "Every time a vulnerability is exposed, countries are incentivized to fix those vulnerabilities. I'm willing to accept that maybe the state department is just incompetent, I'm always willing to accept that, but it's also possible they don't want to escalate.",
            "haha that's basically what i'm doing, just with more than WaPo! This was done on a tiny fucking budget man. I mean it was maybe 5k for the bandwidth + my time? But the attack was 50% showing them just one person can do this and they have billions of dollars and can't. Basically I'm calling them little bitches with the attack.\n\nI also held a high level clearance, actually my company Hyperion Gray was a cleared contractor so we could issue clearances :). And yes jesus fucking christ the bureaucracy. It's the only reason I didn't renew.",
            "Yeah, seems kinda dumb to \n\n1. Openly attack the critical infrastructure of a foreign nation\n2. Admit to doing it\n3. Assume you are smarter than every intel agency in the US and are doing something they didn’t already know about.",
            "I'm usually not skeptical when it comes to AMAs, but this is just on a different level. I work in NetSec and you just don't post something like this publicly if it's actually true. Between posting \"conversations\" with State Dept from Signal, saying out loud what the government's stance is on NK based on his \"conversations,\" mentioning he's worked for DARPA... if this is true, I feel like OP is saying a bit more than he is probably allowed to say. \n\nIt seems more like OP just  wants attention like \"look at me, I'm Hackerman!\"",
            "Exactly. Guy did some basic network sleuthing as a vigilante without a clearance and expects them to praise him, tell him classified things, and that his finding is original? Hah",
            "Yeah people forget we hacked them after the Sony hack.\n\nhttps://www.bbc.com/news/world-asia-30584093.amp#amp_tf=From%20%251%24s&aoh=17187473679380&referrer=https%3A%2F%2Fwww.google.com",
            "> I don’t think a US citizen should ever target a foreign enemy like this. I think it’s a terrible idea.\n\nSimply saying this for laughs because the thought is amusing, but imagine if OP just used one of the few easy and quick attack vectors the US already had in their back pocket that they were saving as a 'just in case' for the future lol. OP getting so mad the US won't acknowledge them while they've simply been trying to say \"thanks but no thanks, please chill and let it go\".",
            "Why would cyber command ever take down an enemy country's internet? All of our backdoors really like to be online\n\nI would not, personally, call them \"little bitches\" when the DOJ can prosecute you for what you openly admit to doing. And there goes clearance forever",
            "I've often heard a joke that IT pros either connect everything they own to the internet, or become like the old sysadmin who said \"I have one computer at home that I rarely connect to the internet, and a gun right next to it so I can shoot it if it ever starts making funny noises.\"",
            "Classic humans ignoring shit until it goes wrong lol",
            "Please stay safe 🙏",
            "LoL same, an iconic pairing back in early 2000s.",
            "Still got mine in a box in the closet",
            "This is the craziest case of 'fuck around and find out' that I've ever seen",
            "Why does OP think DOD cannot do what he did? Did he not consider that maybe they simply do not want to do it (at this point in time)? Just because a country can hurt an enemy country does not mean they actually do it. Politics don't work like that...",
            "In some circles, the person holding a challenge coin from the highest ranking person drinks for free.",
            "Haha, couldn't have put it better.",
            "awesome explanation!",
            "Challenge coins are also given at military retirement ceremonies, there's a special handshake you do to pass the coin from the official to the retiree without it being seen by the audience. Source: my dad's retirement from the CG",
            "Holy shit this man is a savage 🤣",
            "Were they renting them from xfinity for $10 a month?",
            "you're saying the 2 choke points into NK were routers not owned by NK?  \n\nThis thread is mind blowing, and you're responsiveness to all the comments is amazing.  I appreciate you.",
            "Did not expect this answer lmao",
            "Haha that's funny, no i didn't even think of that. I just thought it was kinda funny that it's a script to take a country down and it's literally just \\`python updown.py\\`. See country go down, see country come up. Just kind of enjoyable.",
            "shut up heathen we will find and nuke you!",
            "That place is so far removed from the rest of the world that it piques my interest as well. What’s true? What’s not? Who really knows?  But I’m not going there to find out and anyone crazy enough to visit, well…",
            "You should read up on Eritrea - very much a similar thing going on there to a lesser degree and minus the generational cult of personality. Had a roommate in college who was a refugee. His grandfather was a major who had him smuggled into Sudan where he spent the next 3 years making his way across the Africa, the Atlantic and up through Mexico before winding up in the States.\n\nIt sits in a weird limbo of being involved in international politics such as the UN and Arab League, INTERPOL, etc, yet it has one of, if not the worst recognized human rights records of listed countries.",
            "Turkmenistan is another one.",
            "Read a pretty good book, \"Nothing to Envy: ordinary lives in North Korea\" that you might like.",
            "I just finished reading the book Nothing to Envy by Barbara Demick.  She interviewed a bunch of defectors who now live in South Korea.  If you read it, it might change your mind.",
            "I'm glad you mentioned Tinder. It's funny because I realized I sorta have to tell people upfront what it is \"I do.\" I'll say \"cybersecurity\" for like a day or two, then I'm like hey so I saaaiiid cybersecurity but it's more stuff like this and send the wired article. Not to brag to anyone but just because a lot of people learn about it and are like wow, I want absolutely nothing to do with you lol. Mostly because of risk, they think NK will be after them.\n\n  \nI constantly reiterate this to colleagues, and now to dates sometimes: No one gives a shit about you. This applies to me too. Yes I did a thing, but no one gives a shit about me in that I'm not over here talking to the Secretary of Defense, NK isn't going to do shit - they won't murder an American tied to the DoD for over 20 years with shady connections who they don't REALLY know who he is (hell I don't even really know at this point). So really, no one gives a shit about me lol. And I remind people of that too. Dates - they think somehow North Korea is following me and by being with me they'll follow them. Nah. NK has very limited capacity in the US and certainly won't do anything here.",
            "> Also OP: I have connections that make high level US government employees think twice\n\nFTFY",
            "My uncle works at the nintendo as well",
            "Yeah I like how he casually slipped that in there haha",
            "I mean these connections could be a lawyer friend that can confidently tell you: \" they cannot do that, but they can try to scare you\"",
            "First step: grow balls of steel",
            "I’d be interested in a hacking course lol. Although I imagine I’ll be on some sort of FBI watch list lol",
            "Hacking is about breaking systems, so you need to enrol in a course that teaches whatever system you're trying to break (e.g. a course of Microsoft OSes). Better yet, fuck around with things and build ad-hoc knowledge as you go.",
            "thank you :). If you notice my account IS like 11 years old haha.",
            "for this one it was 5k, but easily could've been done with half that.",
            "IP addresses aren't actually randomly assigned, they have to be mutually granted. NK has [AS131279](https://bgp.he.net/AS131279#_prefixes) or maybe 1k IPs total",
            "A little different insight than your other replies - most countries would not have a single IP address (or two main IPs that everything routes through, like in this case).\n\nYou can get the IP address of any publicly facing device on the internet. Well, its publicly facing IP anyway. This is necessary because that's how communication works.\n\nThink of it sort of like a telephone number. Which is, by the way, an analogy that works a lot better since mobile phones became a thing.\n\nWhen you want to call or text someone, you find out their phone number. That's like their IP address. You save that with their name. On the internet, domain names are pointed to IP addresses.... you could basically say that just like you sign up for a phone, you put a domain on an IP. Don't worry about the details, it's a bit more complex and not a 1:1 thing, but it's something that is tracked. But on the internet, when your computer or phone needs to find out where a website is so it can request a webpage, it looks up the IP address in DNS.\n\nEDIT: Forgot to explain - once you save their number, you \"text\" their name, not their number, but it's actually using their number. Not their name. THat's the analogy here. You type in reddit.com and in the background, that gets converted to the IP address for reddit)\n\nYou can, for example, use a tool called \"ping\" (among many other tools) to get the IP address of a site. That's handy.\n\nThere's another tool, traceroute, that finds all the hops between you and that site. So when you talk to a web server, your request will go through hops at your local provider, across the internet, to the host's provider, and eventually to the host - the server - the website you're trying to reach.\n\nWhat he noticed was that when he was doing traceroutes to various NK servers, two IP addresses kept popping up in all of the routes. So he was able to figure out that all the traffic was going through just these two devices. Taking them down would take down everything.\n\nI hope that makes sense. :)\n\nI'm glossing over details to try and keep it simple and it already isn't. :)",
            "He built a scanner and fat-fingered the IP. It was to make something similar to Shodan before it became the big engine scraping the web every few days. FBI stopped by for an interview when it became apparent he was DOS'ing North Korea, but they didn't care very much.",
            "this is so incredibly true. Real conspiracies are ridiculously rare and look nothing like what people picture conspiracies to be. Real ones are more just like... people doing shit and they maybe aren't supposed to lol. The ones people picture with long-running goals and stuff - nope. People are just way too mediocre for that as you said. Fucking Sheila from HR or Mike from fucking data entry will blab to their friends and fuck it up within the year.\n\nYou'll see a lot of folks in here saying \"such and such probably have this\" or \"so and so probably had an op running and you ruined it\" type shit. Nope. It's just that simply no one gives a shit. Everyone is convinced there's a room full of people that are really smart solving a problem.",
            "I really appreciate that man, and I know that era well :). It was a beautiful thing, people just putting what they think out there and insulting each others mothers every once in a while. Happy to have reminded you of it, those were some good fucking times. Now it's so.... i dunno - polished maybe? Corporate? I don't even know the right words but it's not the same internet I knew and loved.\n\n  \nI put on my robe and wizard's hat.",
            "This seems highly realistic",
            "well if they have it (1) they haven't used it at all - wtf are they waiting for? More banks to be robbed, hospitals to be taken down, and citizens to be attacked? (2) they don't know what I have because I haven't given it to them so they have nothing to compare to.\n\n  \nThey could definitely replicate it, but they're probably going through the 1 year authorization process it takes to do anything there.",
            "Then I guess we can say goodbye to sir hacker",
            "'wrestling'",
            "I think he should smoke the meth with the alligator before wrestling. The winner gets to disable the internet with their preferred method.",
            "Florida man trains alligator on meth to disable NK internet.",
            "Their capital city is like the only city where everyone has electrcity. There’s probably only a few thousand people that have limited access to the internet lol. Not hard to believe honestly.",
            "incredible right? I mean I'm sure there are countries with similar setups even. They likely don't have heavy internet usage so don't need it. But that sure leaves them open to attack....\n\nTo be fair, they were sort of enterprise routers. Reasonably large and could likely handle a lot. I just had a FUCKTON of bandwidth to play with.",
            "2 border routers, not two routers total.  Commercial routers can handle massive amounts of traffic, on the order of hundreds of gigabits or terabits per second.  \n\nSo this isn't entirely unusual given the population that likely has access to the Internet (military and government only).",
            "Yeah they were on sale at BestBuy.",
            "Hack the planet!!",
            "I did crash 1,507 computers in one day. Which actually isn't very many these days...",
            "Mess with the best, die like the rest",
            "They call me Cereal Killer",
            "thanks dude I appreciate it. I suffer from an extreme case of impostor syndrome :)   (really though). Like when I put this AMA up I was like no one's gonna give a shit... and holy fuck lol.",
            "thanks dude. LOL yeah I just kept seeing these two IPs come up and I was like... no fucking way man.",
            "I want a two people, one keyboard scene ",
            "Danny DeVito of course",
            "Rami Malek 😎",
            "[Whoever this guy is.](https://youtu.be/1uvr7CJazqE)",
            "lol thank you!",
            "lol no no it was fucking funny for sure. I was like... my main tool in this hack was traceroute?? wtaf..... that's a first for me. I actually had soooo much more bandwidth than I needed, at some point I was just like fuck it just throw it all wherever, even when everything was already down. You'll get a kick out of this as a network engineer. The script was basically this: allocate bandwidth towards asset, wait about 5 minutes, check Pingdom with API (LOL) to see if it's up, if up allocate more, repeat. First was the routers, then the internal stuff themselves. But it was all a pingdom-based attack hahaha.",
            "thanks :). Curious on his thoughts on it!",
            "I mean that's kind of just what the Internet is in general",
            "hahaha thank you. I actually did a whole presentation on it when I applied to MIT Lincoln Labs. They did not like it at all LOL. They basically ran me through the rest of the interview and got me outta there. Then never answered me. Dicks.\n\n  \nFor the amplification they had the SNMP \"public\"s string open. It didn't give back much but enough and UDP can go SUPER fast, so it was a nice little amplification thingy.",
            "I wish :-/. A lot of folks think there's some black ops going on in there, but I guarantee you there isn't. First, never heard of one, and I know a lot of folks on the ground so to speak in the NSA who would be doing it. Of course information is segmented and such so I may not hear about it but then think of that surveillance program - they're sitting there watching while a bunch of NK hackers steal enough money for it to be a significant part of NK's GDP, american citizens are being attacked on the reg, NK is testing more and more nuclear weapons, they're now going after hospitals and shit. If there's an operation going on in there then FUCKING GOOD that I disrupted it, if would be a bunch of useless asshats runnning it.\n\n  \nPeople have made the argument \"what if they're looking to get into more important things!\" But like, what motherfucker? You mean there's more important things than stopping direct attacks against US citizens. Mind you several who hold or have held high level clearances!? AND they don't stop attacks that can steal near 100mil per hit. Nah. There's nothing there. We all like to think there's a bunch of smart people in a room, there ain't here.",
            "Watch any interview of Kevin Mitnick, rest in peace, and it becomes quickly apparent that social engineering is usually the best tactic that leads to biggest payoffs with less effort and less of a need for specific knowledge about the targeted systems.",
            "Whats stopping getting info on public networks with wireshark is that https has been the standard for over a decade and you would be hard pressed to find a site that didnt use it these days",
            "jesus fucking christ, that PDF thing almost sent me on a rant to them. Then I was like ok, stay cool..... stay cool.....",
            "Exactly. I am sure someone in some 3 letter agency knew about the existence of those 2 routers being public facing and didn’t expose it so it could be used for other purposes at a later time. Now that’s not possible.",
            "there's really not anywhere to escalate TO. Once you've hit private citizens, banks, massive companies like Sony, even hospitals, where are they even going to escalate?\n\n  \nBut sure I do agree it would need to be done carefully. However wouldn't it be a useful tool in their back pocket!? One thing that didn't make it in the screenshot was that I said: i'm not looking for any money I'll just give it to you as long as you use it.",
            "Guys, I can help explain this. My background is national security stuff.\n\nFirst, the state department doesnt care, it's not in its remit. Not its job, and there are only a few people who might be persuaded to do anything about it there - meaning email the proper people to see if they care. Those few people are that little liason group the DOS has thats involved with NS stuff. It's not a question of competence, it's a question of attitude. Trust me, this attitude is not unknown - I personally have dealt with it in other agencies when I flipped leads to them, and it's entirely understandable. The agency's job is the agency's job - they aren't going to burn bandwidth on speculative stuff, possibilities, or ideas, unless that's their remit. That's just bureaucracy.\n\nSecond, there are two groups of people who would care. One is US CYBERCOM, the military guys who usually handle offensive cyberwarfare. The second is the NSA, who usually plays defense. Part of the NSAs job is to look at ideas and develop cyber defense policy. If OP wanted the government to care, he had to get it in front of them.\n\nThat said, intelligence agencies are very popular in the US, easily getting 100x the resumes they need, and being bombarded with lots of \"cool\" ideas that aren't necessarily the tools that the mission needs at that particular moment. BECAUSE this is a speculative product, meaning without verifiable intelligence in hand or an urgent need, the problem is to make them CARE.\n\nIf OP wants to get this in front of the government, talk to a cyber defense contractor and see if they're interested in a new product.... That agency has the tools to develop it (if it needs it), and the connections to get some attention to be paid. \n\nIn the meantime, the guy at the other end of the chat box just thinks \"another one\", rolls his eyes and goes back to fielding chats.",
            "How do you know they can't? No offense dude but a lot of your comments read our you think you are smarter than a whole infrastructure of incredibly smart and talented people.",
            "Seeing how simple it is and how poor NK infrastructure seems to be, I am convinced most agencies in the world already had a 'nuke NK internet' script sleeping somewhere. Anyway you don't want such an easy target offline, like never.",
            "This dude is a bit off the rails.  Could be very talented at what he does, but he seems to know very little about how the US government works for how he complains.\n\nAs for that whole claim of being able to stop all of NK's hacking attempts with a script and chortling that no one seems interested?  Because it sounds insane.\n\nReally the reason they are so interested in what he did is they need to find out what he messed up and figure out what's changed now.   Like if I was casing a house for a burglary and knew they never locked a certain window, then this guy goes and throws a brick through it and now it's all boarded up.\n\n\nEdit:\n\nI read the wires article.  Yeah, no shit they don't want to do some of that stuff.  Official attacks require official responses.  I'm one of the advocates against some approaches to offensive cyber warfare because it's so damned easy to authorize when it seems like there will be no response.    It's a similar problem to drones.   The cost of attacking gets removed, so the frequency of the authorization for those attacks increases.  Not everything is about what we are able to do, but what we should do in order to effect the change and and achieve our goals.",
            "No didnt you see, he said he DOESNT think he is the super best ultra hacker ever and those IDIOTS at the state department are too dumb to do the amazing things he did!",
            "“I hacked North Korea AmA”.   “Oh wow I only expected 5 upvotes.”",
            "Yeah lmao he didn't tell them anything they didn't already know",
            "but pissing in the wind is so much fun though!! surely nothing will ever go wrong doing this",
            "I used to work on Google home as a software engineer and I’d never have one in my home. \n\nNot because they’re insecure or spying on you (they aren’t), but because I know they had idiots like me working on it.",
            "“Cannot” can account for political inability as well as technical.",
            "Most hackers think they are above the law. This hacker apparently thinks they should decide foreign policy. \n\nIt's actually pretty off putting that rogue hackers like this can freely commit crimes as long as they pick unsympathetic targets.",
            "That's correct! And if you don't have it on you when someone asks, everyone else drinks for free. The folks I know - the whole bar drinks on you :).",
            "\"I know, lets steal the identity of a guy who takes on authoritarian gov'ts solo in his spare time\"",
            "This comment has me rolling. I bet they got them modem/router combos",
            "Bet this is why gov is slow rolling him. Probably dealing with some pissed off good guys who took ages to get that op set up haha.",
            "This is the North Korea MAD agreement. North Korea won’t send nukes because South Korea owns their routes lol",
            "Also, \"py\" could stand for Pyongyang :)",
            "SUPREME LEADER uses Explosion!\n\n...\n\nSUPREME LEADER hurts itself in its confusion!",
            "I live in Vladivostok (far east Russia near Japan and both Koreas) and we have vouchers for children to a North Korean camp. Unimaginable 😁",
            "A guy I knew years ago has been. Which is weird because he worked for the Govt, the type you'd assume they wouldn't come close to ever allowing in.\n\nBut here we are 20 years later, and the one thing I remember him telling me was that of all the places he's been in the world, NK was the most poor by far. Which I guess is subjective (I've been to every continent on Earth, it's hard to say one bad one is worse than another once you've seen enough bad places).\n\nBut the two things I remember him telling me specifically was that the trees all have no bark... because people eat it. And that you see kids that are like 7 or 8 years old that don't know how to walk or speak. Wish I remember how to explain it further, but it was 20 years ago he was telling me this, and those two things stuck in my head, but I don't remember the explanation on the second part.",
            "I have coworkers from Eritrea. Their stories are so sad. The suffering and murder/rape is staggering. \n\nInterestingly, my coworkers supports opposing sides. There can be some intense bickering in the break room.",
            "oh and yes I am single...... as you can imagine ALL the ladies love a good ol' computer nerd who attacks countries.",
            "I'm kind of a big deal -Op Burgundy",
            "Yours will be 9 in Aug. Lying on the internet, definitely a redditor!",
            "I did not but I honestly saw this by chance at work. What you did is heroic, I’m sure enough people have told you that but anything to disrupt someone like Kim Jung is honorable",
            "I love that you just took down an entire country's infrastructure for $5k, and your immediate, natural reaction is to think to yourself, we could have done this with 50% more cost efficiency.\n\nThis is what a true engineer looks like.",
            "Who pays you?",
            "For comparison, Mercedes Benz  the auto company has 16,777,216 addresses lol",
            "I have long realized that when it comes to the global elite, truly the inmates are running the asylum and nobody is in control other than the current rules to play by dictated by the current system that \"does the job the best\". Which use to be plain old capitalism but is now morphing in to a very corrupt version of it.\n\nWho holds the most power? The youtube, facebook and tiktok algos that decide what you fill your brain with. The only purpose of those algos? To make you click more. \n\nIt's that stupid.",
            "Long-running goals and stuff - nope \n\nyeah a logistical lottery for sure. \n\nA room full of people that are really smart solving a problem is my ultimate fantasy.",
            ">I put on my robe and wizard's hat.\n\nA fellow man of culture.",
            "I think the word you’re looking for is “sterilized”. I feel the same.",
            "Yeah, I think polished and corporate describe it well. There's also the weird mob vigilante mentality that Twitter gave rise to that's really changed how people behave. There's a strain of sensationalized harm from written communication that just didn't exist in the 90s and early 2000s. Not to say that things have only gotten worse, but I miss the less homogenized more wild west version of the Internet that I grew up on.",
            ">I put on my robe and wizard's hat.\n\n\"Man I gotta start writing your usernames down or something\"",
            "I think the word I'd pick is \"banal\". The magic is long gone. That whole techno-hippy utopian ethos of how the internet and computers and so on were going to change the world for the better... that all seems so far away now.",
            ">I put on my robe and wizard hat \n\nOh, I like to play dress up",
            "Heavily moderated, thought policing, and the resulting side effect of self-censorship.",
            "They probably monitor it which is more useful then shutting it down.",
            "Why do you assume they haven't already done authorization processes? I'd be shocked if they didn't have assets already to some degree. Plus sometimes those agencies want to see what they're doing and not actually stop it and learn from it. Hard to say with those three letter agencies it could be a lot of things.",
            "oh shit now i have to fuck an alligator while hacking NK. That's gonna be difficult. I mean I presume. I don't think alligators like to be fucked by humans. I don't like it. But i'll consider it....",
            "I like this one.",
            "also depending on the actual model, ther are some pretty hardcore machines out there that can handle a LOT of traffic.\n\nhundreds of terabits per second",
            "One of my favorite Apple sleep screens is from a satellite flying over North and South Korea. I'm certain it's to point out how absolutely dark NK is at night compared to [every other country around it.](https://i.imgur.com/mes1F91.jpeg)\n\nJust amazing.",
            "It is hard to believe considering they have some extremely talented hackers themselves. \n\nThis must be an institutional problem.  A fear of not being able to speak out, never being able to go out of your own lane, or being able to test things. As this might make someone higher than you look bad, and you will be punished.\n\nWhich is why they will always be behind as a country.",
            ">Their capital city is like the only city where everyone has electrcity. There’s probably only a few thousand people that have limited access to the internet lol. Not hard to believe honestly.\n\n\n[60-80% of the population owns a smartphone](https://www.38north.org/2022/11/twenty-years-of-mobile-communications-in-north-korea/). This does not fit the picture you're painting.",
            "Did you take a look at them at all to see if they were vulnerable also? As a network engineer this attach honestly blows my mind in it's simplicity but as in all things network it comes down to the small details. Awesome write up above.",
            "Yeah I’d assume that they would be something like a Huawei NE40E or ZTE ZXR10 M6000-S if new or a Cisco ASR 9000 series or Juniper MX960 if second-hand/smuggled into the country.\n\nMy group at work is high speed network infrastructure focused (200G/400G/800G and higher) and designs this type of stuff. Some of the systems I’ve played with are… wild.",
            "yes, this is correct. They weren't nothing routers. When I say they were medium-sized I mean for Internet backbone type shit.",
            "A fully remote cyber attack is always:\n\n1. Impressive\n\n2. Relies on a vulnerability on the defender's side. \n\nYou found and exploited the vulnerability. A country should have better protection. But just like many corporations, should doesn't mean has...",
            "Bruh. I finished a cyber degree and the first thing I learned is we ALL have imposter syndrome. You're a beast. ",
            "Dude what you did was \"eloquent\" - you kept track of the environment and feedback and figured the two egress points then just hammered them. \n\nSimple and effective. \n\nBravo!",
            "Excited to hear you on Darknet Diaries soon :)",
            "As someone else with severe imposter syndrome: this is the most legit thing I’ve ever seen. \n\nCase from Neuromancer would be like “ok I hate everything but that’s impressive, kid.”",
            "Man, if you are suffering imposter syndrome, then idk what I should be suffering... lol. I see you got a degree in Theoretical Physics and Math in addition to all your other achievements. That is not \"normal dude\" stuff haha. Can't forget president of the tennis club too.",
            "Blue team here, but that's all it takes sometimes. \"Why do I keep seeing X over and over, what's the significance?\" Noticing that pattern and acting on the hunch to research is already huge. Big props to you, you deserve the fame.",
            "like...like a two girls one cup type thing or....?",
            "I would love that. But he'd probably be like no i already played a hacker fuck off.",
            "which guy?",
            "Aren't you worried about potential retaliation (due to opsec issues) when you travel in the future?",
            "> The script was basically this: allocate bandwidth towards asset, wait about 5 minutes, check Pingdom with API (LOL) to see if it's up, if up allocate more, repeat. First was the routers, then the internal stuff themselves. But it was all a pingdom-based attack\n\nno fukin way. omg. ahahahahahaha",
            "Society is just one giant lan party",
            "Yeah Lincoln Labs and the gov in general don't take too kindly to DoS attacks very much lol. Now if you can collect and exfil data, you'll catch some eyes.\n\nAnd shit, they had SNMP open on a border router like that? someones getting fired haha. Good catch.",
            "Do you think its possible they knew about this, but wanted to kind of “save it” in case they ever needed to use it? Like now this exploit is known and fixed; they may have wanted to use it if there was any conflict",
            "Screenshot your text message, paste into word and save as PDF 😂",
            "You shut them down and then don't know where the hackers go or what network they're going to use. Keeping it active is probably far more valuable than shutting it down. ",
            "Out of all the things you could have achieved, you stuck to denial of service. No intrusion, no persistence, no information or intelligence gathered outside of their public facing infrastructure. You didn't escalate anything, you made noise. If anything, you de-escalated DoD efforts. DPRK now goes into remediation mode and patches up far beyond just the public infrastructure you leveraged. Call yourself a hacker, sure, but this is so incredibly short sighted from an operational perspective. Then you went on a tour demonstrating just how you screwed over their ops that you've no business being read into. I bet they shook your hand and took smiling photos.",
            "> Really the reason they are so interested in what he did is they need to find out what he messed up and figure out what's changed now. Like if I was casing a house for a burglary and knew they never locked a certain window, then this guy goes and throws a brick through it and now it's all boarded up.\n\nThat's exactly what I was suspecting. They probably knew of this vulnerability and were keeping it in their back pocket. Now they have to assess how badly this random citizen has spoiled their operations.",
            "I have no idea how my product is stable",
            "Or the ingress and egress points were already compromised and monitored until the attention brought to them caused the local system admins to take notice.",
            "What do you mean by \"vouchers for children to a North Korean camp\"?",
            "Do you know anyone who has ever used a voucher?  I can’t imagine anyone thinking it’s a good idea.",
            "You’re maybe the apex of arguing with people on the internet, for better or worse.",
            "You said countries, there's more?",
            "Don't worry. I'm sure NK won't try to set you up with one of their women to lure you in.",
            "I am married, but I love you",
            "I don't think that's why you're single.\n\nThere are plenty of educated ladies who are into infosec and competitive coding and who would love to date someone smart like you. \n\nBut those educated ladies also understand the dangers of dating a hacker. If you two break up, you could do some damage, and that's a high risk to take.",
            "Nerds are the new Brad Pitt of society! Or that’s at least what I tell them when showing of my warhammer collection and throwing a dice before making any moves.",
            "I mean.... that sounds like a massive plus to me lol\n\nSorry you're straight though! Would likely be a lot easier otherwise. I wish you luck, smart guys like you deserve a good partner :3",
            "Tell them you have really nimble fingers from all the hacking.",
            "Happy brain chemical",
            "I paid roughly $5k for a bunch of snowboard travel this last winter, and any schmuck can and will do the same, year after year. \n\nThis guy spent that one time and will basically have an unlimited supply of work, glory and presumably intimate companionship.  Work smart, not hard.",
            "Yea, IP's were kinda given out really freely, because \"Why would we ever need this many IP's\". My company doesn't really operate outside of the US, and we have 65k public IPs.",
            "I remember Hunter S. Thompson had a line about all this. He spent some time on the campaign trail covering politcs, met Nixon and all the people around him, etc. He said that eventually you realise that there is no hidden, all-knowing elite pulling the strings - the people in power are just regular fuck-ups like everyone else and they just happened to be born in the right place at the right time.",
            "I think that's the flip side of conspiracy theories--if people can really organize around a shared goal and successfully engage in subterfuge to conceal their true actions and intent over a long period of time, well if they can do it for bad then surely we the people can do it for good.  But it's just a ton of short term interests and motivations that people aren't even themselves aware of half the time. I'm fighting for democracy but I'm also running the numbers on my retirement and could use some consulting and lobbying gigs so I just happen, without realizing it, to determine the interests of democracy over the next fiscal year march hand in hand with that of industry x.  It's a game of chess but each piece is independently managed by a bunch of four year olds. If a true blue conspiracy were revealed my faith in humanity would soar. ",
            "The only really tough part is that beforehand you have to find the alligator’s two access points of egress and ingress.",
            "I don't care what anybody says, I'm going to believe it was a pair of good ol' WRT54Gs.",
            "Out there, but definitively not in NK.",
            "definitely, hard agree",
            "They some new pics in 2022.\n\nhttps://www.38north.org/2023/04/a-fresh-look-at-north-korea-at-night/",
            "Many years ago steam put out a world map with dots for every steam user. There was a single dot over Pyongyang. I always wondered if Kim had a steam account.",
            "Now I want to see what a night sky looks like in North Korea.",
            "I think it doesn't matter how talented their hackers are. If there's only two 4 lane highways in/out and you shove 12 lanes of Los Angeles traffic down em shits not gonna work lol. As long as you can keep finding the highways with open ports, you can cripple it.",
            "Hell even my \"basic\" (work) TORs are 3.2 Tb per second (6.4 full duplex), my newest performance TOR pairs are upwards of 51.2Tbps (full duplex) each (though not fair to call them a TOR in the traditional sense, since I also use the same model as my lab cores at work) Shit is insane these days.",
            "hahaha  \n[https://www.youtube.com/watch?v=u8qgehH3kEQ&ab\\_channel=RicardoFigueiredo](https://www.youtube.com/watch?v=u8qgehH3kEQ&ab_channel=RicardoFigueiredo)\n\nthe best of Hollywood",
            "The guy who plays Hackerman in Kung Fury",
            "nah, I never gave them any real details lol. So they have nothing to corroborate it with. They would've asked for details, if it was the same then express non-interest.\n\n  \nAlso they really aren't that smart. You're giving them too much credit lol.",
            "he told them enough by directly telling the government “I can tell you how to stop all traffic from NK internet”. If they knew they had it compromised they wouldn’t have just shrugged him off. If they knew how easy it was for this guy to do it solo they wouldn’t .",
            "Sorry for misleading, I've only found news about \"family\" tours to NK. Aquaparks an Zoo :)  \nBut tour company couldn't sell enough so the tour not gonna happen.  \nHowever I remember there were some thing with kids tour to a NK camp (not a native English speaker obviously, camp like a camping thing)  \nI'll share if I find it",
            "Angry redditor brings down entire countries internet traffic after 12 year old insults his mother\n- r/notheonion, probably",
            "He doesn't even need to, he can just answer with \"😝\" and shut off your internet.",
            "yes, there are a lot of countries! more precisely 195 recognised countries!",
            "er i totally meant country. Totally.",
            "at this point, that's ok. Gotta lower those standards ya know? Like as long as she murders me a bit later and is nice to me in the meantime like, ok.",
            "lol I'll start telling myself that. But then again Brad Pitt is freaking adorable and I'm... not. Well actually I am just not Brad Pitt adorable.",
            "LOL. Hey girl, I'm a hacker. Yeah girl, that means i'm into computers and attack countries. Btw my fingers are nimble.\n\n  \nHm, I think they'd all run away....",
            "A struggle huddle",
            "Underneath someone's desk.",
            "Though likely upgraded with a Linux distro",
            "Wouldn’t have gone down.",
            "Eh, I could see it. NK are the ones who did the Sony hack and actually outsource a lot of technology work. If there was any good they'd have I would think it would be something like that.",
            "Maybe they bought Cisco on the grey market",
            "What? You think a country with nukes doesn’t have basic networking infrastructure?",
            "This is super interesting. Thanks for sharing.",
            "Wow. Still basically a blackhole. It's amazing just how much NK sucks.",
            "Bet he did/does!",
            "Wouldn't surprise me if that was something like a foreign diplomat.",
            "Most likely their de-facto king's immediate younger brother, a known shut-in geek...",
            "[Something like this, probably.](https://i.imgur.com/bYd7flY.png)",
            "Haha true. In fairness though I bet they get a lot of loonies being like “ I can prove te president is a reptile!!” So their first reaction is to dismiss it. Also prolly your first contact was with a low level employee that just wanted to go home",
            "lol, I like it!",
            "And this guy attacked all of them. Goated.",
            "This man knows, I am reasonably certain those old WRT54G's would run till the heat death of the universe if you didn't care about the amount of bandwidth they were able to provide.",
            "Agree with this entirely.",
            "Perhaps but their offensive work seems to be carried out primarily from beyond North Korea itself so this is isn’t necessarily the case",
            "I remember reading about that! https://www.reddit.com/r/television/comments/1cabtla/documents_found_on_a_north_korean_server_suggest/\n\nUS film studios were unknowingly having animation work outsourced to North Korea lol",
            "lol I don't 100% remember but I do actually think they were Cisco.",
            "i’d totally echo this sentiment if I hadn’t brought it down like a fuckin Jenga tower.",
            "Ah yes, the Dear Leader and National Father constellations.",
            "Simba..."
        ]
    }
}