{
    "Meta_iel": {
        "title": "Meta_iel",
        "score": 27,
        "url": "https://www.reddit.com/r/ich_iel/comments/1d57fkr/meta_iel/",
        "content": "Liebe Zuhausis,\n\nHier ist wieder unser monatlicher Metafaden. In diesem Pfosten könnt ihr wie üblich Anregungen, Bemerkungen, konstruktive Kritik, Vorschläge und so weiteres loswerden. \n\n^(Oder einfach **friedlich** miteinander über Gott und die Welt diskutieren.)",
        "num_comments": 32,
        "comments": [
            "\nDanke für deinen Beitrag, Zuhausi. \n\nSchau doch mal auf unserem [Zwietrachtbediener](https://discord.gg/ich-iel-959339186341683270) vorbei! \n\n_______________________________________________________\n\nDu hast eine Frage zu den Regeln? Das [Ich_Iel Wiki](https://www.reddit.com/r/ich_iel/wiki/index) sollte die meisten Fragen abdecken.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ich_iel) if you have any questions or concerns.*",
            "bin vollkommen damit einverstanden dass hier keine politischen Pfosten mehr erlaubt sind, aber gibt es einen deutschen Unter ders erlaubt und nicht ein braunes Ekelparadies ist? will einfach manchmal witzige Meimeis zum Thema sehen. Empfehlungen wären nett.",
            "Hi",
            "\"ich🇩🇪iel\" wird als titel nicht mehr angenommen. Das sollte auf einem deutschen Unter schon möglich sein. Bitte sachaut mal nach wie sich das einrichten lässt. Danke sehr.",
            "Ist Politik wieder erlaubt? Es sind nämlich zwischenzeitlich wieder viele politische Pfosten aufgetaucht, gegen die nichts unternommen wird.",
            "**Könntet ihr bitte eine Änderung für den ich\\_iel-Titelsyntax in Bezug auf Emojis vornehmen?**\n\nIch weiß, warum ihr das Clown-Emoji ausgeschlossen habt, aber es passiert oft mit vielen anderen, die ich gerne verwenden würde, weil sie zum Thema des Beitrags passen würden.\n\nZum Beispiel sind diese derzeit nicht im Titel nicht erlaubt:\n\n⛈️ (Regenwolke)  \n⚓️ (Schiffsanker)  \n⚽️ (Fußball) (Aber 🥅 Fussballtor geht)  \n☔️ (Regenschirm)\n\nEs gibt noch mehr, aber das sind die, die mir in den letzten 2 Tagen aufgefallen sind.\n\n^(PS: Es wäre schön, dass wenn ich das aktuelle Banner schicke, es innerhalb einer Woche auch in den Header kommt.)",
            "Auch wenn es sich nicht zu 100 % vermeiden lässt begrüße ich es wenn ich_iel ein unpolitischer sub ist auf dem shitposts o.ä. lustige Begebenheiten des alltäglichen Lebens gepostet werden.",
            "Hiermit beantrage ich eine Erweiterung der Öffnungszeiten. Es kann ja wohl nicht angehen, dass man als hart arbeitende Person abends ein wenig michmichs betrachten möchte und dann haben die studentischen Hilfskräfte schon wieder Feierabend. Die nutzen den doch eh nur zum saufen!\nHalbes /s",
            "Seit längerer Zeit mal wieder im sub, es sind auffällig viele memes aber nichts politisches. Hat sich was geändert?",
            "Warum lockt ihr alle politischen posts? Wenn überall die Blauen in den Kommentaren wären würde ich das ja verstehen.",
            "Für linke scheißepfosten gibt es r/gekte",
            "Wir haben bei der EDV-Heißlinie angerufen und uns wurde versichert dass sie in naher Zukunft einen Techniker vorbeischicken.",
            "Aufrufe zur Wahl zu gehen werden toleriert, aber jegliche diskussion über parteien wird so gut es geht unterbunden.\n\nAllerdings ist grade auch schönes wetter und die meisten von uns fassen dann doch lieber gras an, als man glauben mag.",
            "Aus accessibility Gründen wäre ich ja eigentlich eh dafür die Titel-Regel ganz abzuschaffen, aber das wird wohl nicht passieren.",
            "Guten Morgen Ente.    \n     \nDie Titelsyntax tut sich manchmal noch schwer mit kombinierten Emojis; wir schrauben aber immer wieder dran, damit die \"allumfassend\" wird und wir nicht jeden neuen Emoji händisch beisteuern müssen. Deshalb - danke für den Hinweis welche nicht gehen. Wenn es klick macht warum die nicht gehen, umfasst die daran angepasste Regel dann nämlich idr gleich wesentlich mehr.    \n   \n Ob wir den Clown wieder zulassen, müssen wir Mal diskutieren. Problematisch an dem ist, dass der in den meisten Fällen von einem unangenehmen Klientel im schwurbeligen oder reißerischen Kontext genutzt wurde.     \n   \nDanke für dein Fütterrück und schönes Wochenende :)",
            "Bestimmte Emojis haben wir bewusst verboten, warum die von dir gelisteten nicht funktionieren kann ich dir aber nicht sagen.",
            "Tatsächlich befinden wir uns in Verhandlungen mit dem neuen modteam, ein paar haben angeboten eine Spätschicht einzulegen \n\nZudem haben wir mitbekommen, dass seit dem Politikverbot auch der Anteil an nächtlicher nazischeiße zurückgegangen ist.\n\nAllerdings wissen wir auch, dass die laseschefs die Öffnungszeiten gar nicht so gern haben, weshalb wir uns ungern davon trennen.",
            "politikverbot",
            "Nur weil du etwas nicht siehst, heißt es nicht, dass es nicht da war.\n\nAbgesehen davon haben wir das politikverbot bisher nicht aufgehoben.",
            "Gras anfassen? Na gut, ist ja inzwischen legal.",
            "Könnte an der Art der Darstellung in Unicode liegen. Die Emojis werden intern als mehrere Zeichen hintereinander dargestellt. Das wird dann vermutlich das Limit der Zeichen sprengen.",
            "Wie wäre es denn mit einem Pfostenverbot, aber Kommentare sind erlaubt? Ich muss ehrlich sagen, dass ich es sehr schön finde Abends nach Ladenschluss einmal reinzuschauen und den Tagesumsatz zu begutachten. Es reglementiert bei mir (gezwungenermaßen) den Tageskonsum etwas, kann ich nur positiv bewerten. Nur die wegfallenden Diskussionen und die unmöglichkeit zu kommentieren stört mich da.",
            "Nice, direkt mal wieder beitreten 👍🏽",
            "Ich find's gut, dass Ihr teilweise so verfahrt, Kommentarsektionen zu blocken, wenns ein populistisches Zerfleischen gibt und die Pfosten stehen zu lassen, sofern der Pfosten nicht selbst populistische Provokation ist. Die Geschehnisse aktuell sind ja kaum auszuhalten, wenn man seinen Gefühlen nichtmal gepflegt mit Memes verarbeiten kann.",
            "Halb richtig. Es liegt nicht am Limit, sondern dass es unterschiedliche Konnektoren für kombinierte Emojis gibt. Kein Plan wieso das so ist. Aber die muss die Titelregel entsprechend auch kennen, damit das funktioniert. Wir sind dran :)",
            "ist auch so im gespräch.\n\nWir haben halt das Problem, dass wirklich sehr, sehr wenige Leute dinge melden und statt dessen alles über filter läuft. Wenn leute mal den Melden knopf drücken würden, statt zurückzubeleidigen, wäre unsere Arbeit viel angenehmer.",
            "Wir haben vorgestern besprochen, dass wir neutrale aufrufe zur wahl stehen lassen möchten, allerdings war heute morgen die ganze Schlange wieder voll mit irgendwelchem rechten Müll. Das hatte zwar größtenteils runterwählies, aber das kann man dann trotzdem noch lesen, weiter befeuern usw.\n\nPolitische Grabenkämpfe bitte woanders austragen.",
            "Wäre eine Sonderregelung für Wochenenden und Feiertage ein Ding? Da ist man ja meist länger auf.",
            "Könnten wir einen jährlichen Preis für den Nutzer mit den meisten erfolgreichen Meldungen einführen? :D",
            "Und der bekommt dann bitte den Flair „Meldehauptmeister“, das wäre so gut!",
            "wir sehen nicht wer was meldet"
        ]
    },
    "ich🕳️iel": {
        "title": "ich🕳️iel",
        "score": 837,
        "url": "https://i.redd.it/mdzgsqiyd38d1.jpeg",
        "content": "",
        "num_comments": 21,
        "comments": [
            "\nDanke für deinen Beitrag, Zuhausi. \n\nSchau doch mal auf unserem [Zwietrachtbediener](https://discord.gg/ich-iel-959339186341683270) vorbei! \n\n_______________________________________________________\n\nDu hast eine Frage zu den Regeln? Das [Ich_Iel Wiki](https://www.reddit.com/r/ich_iel/wiki/index) sollte die meisten Fragen abdecken.\n\nDu willst uns außerhalb der Öffnungszeiten erreichen? Unsere Zweigstelle auf [Feddit/Lemmy](https://discuss.tchncs.de/c/ich_iel@feddit.de) ist umgezogen und hat wieder geöffnet.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ich_iel) if you have any questions or concerns.*",
            "Haha, der erwartungsfrohe und doch leicht besorgte Blick vom Hasen",
            "Hat der Verlag nicht mal versucht gegen diese Art von Uploads vorzugehen? Oder war das bei Conny?",
            "Beste Ausgabe",
            "Den Augsburger Studierenden gefällt das.",
            "Nur weil man es machen *kann*, heißt das nicht, dass man es machen *soll*…",
            "Die Jakob und Conny Bildchen sind einfach genial! Gibt's da ein eigenes unter?",
            "Glorreiches Loch bitte. Das ist mir sonst zu angelsächsisch.",
            "SPRICH",
            "The Glory Jakob and his first invention  🙏👏",
            "Ja. Natürlich.",
            "truthahn der trthahn kommt ja leicht da hin so wie ein schwanz irgendwie zu als man das nie halt erwartet umso drin mal sowie ähnlich aber klar kommen denn warum ned denn immer aufpolieren dicke gurke essen lieber vrauen",
            "https://preview.redd.it/is6912jcu38d1.jpeg?width=453&format=pjpg&auto=webp&s=ea09db4b11cc4d679b3cff7247d0355092f30caa",
            "/r/boeserjakob",
            "Glorreiches Loch",
            "Danke",
            "genau so 👍🏻"
        ]
    },
    "ich🐉iel": {
        "title": "ich🐉iel",
        "score": 264,
        "url": "https://i.redd.it/udvgddb1n38d1.jpeg",
        "content": "",
        "num_comments": 25,
        "comments": [
            "\nDanke für deinen Beitrag, Zuhausi. \n\nSchau doch mal auf unserem [Zwietrachtbediener](https://discord.gg/ich-iel-959339186341683270) vorbei! \n\n_______________________________________________________\n\nDu hast eine Frage zu den Regeln? Das [Ich_Iel Wiki](https://www.reddit.com/r/ich_iel/wiki/index) sollte die meisten Fragen abdecken.\n\nDu willst uns außerhalb der Öffnungszeiten erreichen? Unsere Zweigstelle auf [Feddit/Lemmy](https://discuss.tchncs.de/c/ich_iel@feddit.de) ist umgezogen und hat wieder geöffnet.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ich_iel) if you have any questions or concerns.*",
            "Einmal in Leipzig zum Wechselstrom/Gleichstrom Konzert gewesen und bei Bekannten übernachtet. Nach dem Essen viel auch das Wort \"aufwaschen\". Ich war noch nie so entsetzt. 😅",
            "Aufwachen? Hab ich noch nie gehört... und hätte auch drauf verzichten können.",
            "Geb mia mol dat Spüli do. Eich misst mol ebbes uffwäschen, heer.",
            "Auf diesem Hügel bin ich bereit zu sterben",
            "wegwaschen",
            "Wird von Links nach Rechts oder andersrum gewaschen?",
            "Aufspülen 🥲",
            "Noch nie von Aufwachen gehört? Ich beneide Dich! Schlaf ist einfach die beste Zeit des Tages",
            "Wacht auf ihr Schafe!!!1!!1",
            "\\*greift nach der guten alten Doppelläufigen\n\nEs ist die Aufgabe des Allmächtigen, die Sünder zu strafen\n\n\\*lädt zwei 12 Kaliber Schrotpatronen \n\nund meine sie zu ihm zu schicken.\n\n\\*klappt den Lauf zu",
            "Ich dachte das heißt \"Kannsche ma mo lo des Spüli genn?\"",
            "Nimm meine Axt!",
            "Ist es bei euch Zuhause oder in der Region normal \"aufwaschen\" zu sagen? Brauchst du Hilfe?",
            "Wenn man es als frage formuliert, dann ja.",
            "Und meinen Handgelenksbogen!",
            "aufwachen = Augen auf machen  \nabwaschen = Dreck ab machen  \naufwaschen = …?",
            "Ich kenne es von Menschen aus dem Vogtland, aber die sprechen allgemein kein Deutsch.",
            "Und meinen Aufwaschschwamm.",
            "Auge auf Dreck",
            "aufwaschen = den Boden feucht reinigen",
            "Hängt ihn!",
            "Du meinst feudeln",
            "Ne, eigentlich mein ich rauswischen.",
            "Langsam wird’s ekelig"
        ]
    },
    "ich🫡iel": {
        "title": "ich🫡iel",
        "score": 275,
        "url": "https://i.redd.it/c126kgc9338d1.jpeg",
        "content": "",
        "num_comments": 41,
        "comments": [
            "\nDanke für deinen Beitrag, Zuhausi. \n\nSchau doch mal auf unserem [Zwietrachtbediener](https://discord.gg/ich-iel-959339186341683270) vorbei! \n\n_______________________________________________________\n\nDu hast eine Frage zu den Regeln? Das [Ich_Iel Wiki](https://www.reddit.com/r/ich_iel/wiki/index) sollte die meisten Fragen abdecken.\n\nDu willst uns außerhalb der Öffnungszeiten erreichen? Unsere Zweigstelle auf [Feddit/Lemmy](https://discuss.tchncs.de/c/ich_iel@feddit.de) ist umgezogen und hat wieder geöffnet.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ich_iel) if you have any questions or concerns.*",
            "Sellerie ist ein Allergen, daher sind die Märkte verpflichtet dies zu deklarieren.",
            "Das ist ein normaler Hinweis für Allergiker",
            "Wenn man ganz genau hinsieht, kann man die Sellerie sogar erkennen.",
            "187 ja das ist und bleibt ein Suppenbund",
            "Sellerie enthält Sellerie?!",
            "Naja. Vielleicht weiß ja jemand auch nur, dass er eine Sellerie Allergie hat, hat aber noch nie Sellerie im Reallife gesehen. Ich kenne viele denen du das Gemüse vor die Nase legen könntest und dir nicht sagen können ob es Sellerie oder Pastinake ist.",
            "Gebürtiger siehe Verpakunger 👽",
            "Wenn Du Suppengrün kaufst, kaufst Du auch Sellerie 🙄",
            "Wo Sellerie? Versteckt unter der Petersilie?",
            "Vlt für die Leute die das zusammenschnüren und kein Deutsch können...",
            "Sellerie ....die AFD des Suppengrünes",
            "Danke, wollte genau das gleiche schreiben",
            "Sellerie gehört zu den deklarierungspflichtigen Allergenen in der EU. Aber ja, albern ist es in diesem Fall natürlich schon",
            "Ist mir durchaus bewusst. Glaube jedoch, ein Allergiker erkennt einen solchen Batzen Sellerie auch ohne Hinweis.  \nDeutsche Juristerei halt",
            "Kannst du mir vielleicht etwas genauer erläutern wo?\n\nVielleicht ein Bildausschnitt mit einem roten Kringel um den Sellerie und ein paar Pfeilen die darauf zeigen.",
            "Knollensellerie...",
            "Alles klar du kommst auf die Liste.\n\nSellerie ist super. Schmeckt zu vielen Sachen gut.",
            "Sellerie ist umami pur! Das gibt der Suppe doch erst den richtigen Kick",
            "Lass meinen geliebten Knollensellerie da raus!",
            "Alternative für Dünnpfiff?",
            "du würdest dich wundern wieviele, vor allen dingen jüngere menschen, tatsächlich nicht mehr wissen wie viele gemüse/obst/kräuter arten usw. unverarbeitet aussehen…\nich finde den hinweis gut.\n\naber ja is auch mega lustig wenn mans weis :)) find ich auch!",
            ">laube jedoch, ein Allergiker erkennt einen solchen Batzen Sellerie auch ohne Hinweis\n\nDer Aufwand die genaue Grenze ab wann man es erlennt zu definieren ist doch viel größer als das halt draufzudrucken.",
            "Denkst du. Wer Sellerie aber nur als Pulver kennt, könnte da ein Problem kriegen.",
            "Jep, Recht. An der Stelle geht es nur noch darum Karens und Kevins (haben die auch einen deutschen Namen?) bloszustellen. Hinweis steht drauf, Fall abgeschmettert, Kläger bleibt auf seinen Kosten sitzen.",
            "Aber gerne doch. \n\nhttps://preview.redd.it/ef3l4y2uv38d1.png?width=382&format=png&auto=webp&s=5cc8389c2224c650abec73e141316bfe126ad3a0",
            "Gerieben auch toll als süßer Salat mit Apfel, Honig, und Sahne. Gerne auch mit ein paar Walnüssen. Herzhaft, aber süß.   \nGab's früher, wenn ich mal bei Reformhaus-Nachbarn zu Mittag essen durfte/musste.   \n   \nDanke dafür, Familie Z.",
            "Pastinake und Petersilienwurzel knallen noch besser",
            "Ne ne, Sellerie ist Abschaum also wie die AFD ..",
            "NIEMALS, Sellerie ist unwürdig der Existenz..aber gut du hast Recht es mit der afd zu vergleichen vermag unfair klingen gegenüber der afd ..hahahahahahahahah *manisches Gelächter*",
            "Nicht unbedingt gerade wenn man nen andren kulturellen hintergrund hat.  \nHierzulande ist der Knollensellerie halt die gebräuchliche Variante während in vielen andren Ländern vor allem Staudensellerie genutzt wird. In einigen sogar ausschließlich staudensellerie.\n\nDa ist aussehen oder gar existenz von knollesellerie nicht unbedingt bekannt.\n\nDies ist ein klassischer fall dass du von dir aus automatisch auf alle andren schließt ohne zu berücksichtigen dass menschen tatsächlich unterschiedlich sind und koplett unterschiedliche hintergründe haben können.",
            "Letztens im Supermarkt hat man mich an der Kasse gefragt welche Gemüse ich dabei hatte. Der Kerl hielt sie hoch. Es waren tatsächlich Kartoffel",
            "Oder eben nur staudensellerie kennt.",
            "Wer sich nicht mit seinen Allergien, die ihn vielleicht umbringen können, beschäftigt ist selber schuld.",
            "Ist notiert",
            "Du Knollensellerie blasphemiker kommst auf meine Liste der uncoolen!",
            "ist vorallem bei sehr vielen sachen so\n\nwenn man sich z.B. mal anschaut wie Kiwis in anderen ländern aussehen\n\nhttps://upload.wikimedia.org/wikipedia/commons/0/0a/Actinidia_fruits.jpg",
            "Oh nein, ein Hinweis der kein Aufwand ist zu produzieren, wie schlimm.",
            "Brudi was? Manchmal sind Allergene in so versteckten Sachen drinne, da ist es sehr gut das es drauf steht und fett gekennzeichnet sein muss.",
            "Man kann wirklich nicht jeden retten, manchmal muss die Natur ihr Ding machen",
            "Neiiiiiin !! Nicht nach alldem was wir durchgemacht haben ..... ..\n\n\n\n\n\n\n\n\n\n\nSellerie ist trotzdem scheiße .."
        ]
    },
    "Ich iel": {
        "title": "Ich iel",
        "score": 1896,
        "url": "https://i.redd.it/25hiob01rz7d1.jpeg",
        "content": "",
        "num_comments": 111,
        "comments": [
            "\nDanke für deinen Beitrag, Zuhausi. \n\nSchau doch mal auf unserem [Zwietrachtbediener](https://discord.gg/ich-iel-959339186341683270) vorbei! \n\n_______________________________________________________\n\nDu hast eine Frage zu den Regeln? Das [Ich_Iel Wiki](https://www.reddit.com/r/ich_iel/wiki/index) sollte die meisten Fragen abdecken.\n\nDu willst uns außerhalb der Öffnungszeiten erreichen? Unsere Zweigstelle auf [Feddit/Lemmy](https://discuss.tchncs.de/c/ich_iel@feddit.de) ist umgezogen und hat wieder geöffnet.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ich_iel) if you have any questions or concerns.*",
            "*Ab 10€",
            "In der Nähe von meinem Vater hat ein Dönerladen ein Chinarestaurant vertrieben...\n\nDie nennen sich sogar \"Deluxe\"\n\nInnen ist es scheiße heiß, weil die nicht gegen die Temperatur der 4 Spieße ankühlen im Kundenbereich und die akzeptieren keine Kartenzahlung. \n\nWenn du dich \"Deluxe\" nennst, bringe den Luxus auch.\n\nDie kleine Dönerbude im Dorf meiner Mutter hat Klima, der Döner kostet nur 6 Euro (statt 8 bei dem deluxe) und man kann mit Karte zahlen",
            "kann nur aus Erfahrung sprechen - unter anderem ein Jahr lang Dönerersatz an die Buden im Umkreis ausgeliefert. Bezahlt haben die bar und da war keine Rechnung dabei - so in 80% der Fälle. Die haben beim Anrufen und Bestellen schon die Leier losgelassen \"keine Rechnung\". Und ja, sind keine Cumexer, aber läppert sich halt doch. \n\nBonuspunkte für widerlichstes Paschagehabe mit Misogynie vom Feinsten und die allerbesten waren die, wo Du beim Liefern im hinteren Küchen/Ladenbereich den Dreck und die hygienischen Zustände sehen und kotzen konntest. Natürlich nicht bei allen. \"Not all Dönerverkäufer\". \n\nFür mich hat es sich ausgedönert. Widerliches Typen, widerliche Küchen + Steuerhinterziehung - nee danke behaltet euren Fraß.",
            "Ich lebe den Traum von jedem. Habe 5 Läden bei mir beim Einkaufszentrum. Von Italienisch, zu Türkisch zu Syrien. Alle Restaurant super lecker, alle nehmen Karte. Und das beste: die Preise. Döner 6.50€, Falafel 3.50€, Schawarma 6€ (ne Zeit lang für 3.50€ im Angebot). \n\nUnd wirklich alles ausnahmslos mit Kartenzahlung. Der Italiener offiziell nur ab 10€, inoffiziell aber auch schon knapp darunter.",
            "In Duisburg ist es die große Eisdiele im teuren Ladenlokal. Aber anscheinend akzeptieren es die Leute nur in bar zahlen zu können.",
            "[removed]",
            "Döner mit Karte? JAWOLLO!!1!1!!2!!! ICH WILL MEIN DÖNER MIT MEINER UHR BEZAHLEN \n\n#ICH HASSE BARGELD!!1!1!2",
            "https://preview.redd.it/r6xh7drql28d1.jpeg?width=828&format=pjpg&auto=webp&s=57031824185adcf539d71006dc9e5fa731b5808a",
            "Ich höre das letzte Bild....",
            "\"Turbobuchen möglich\"",
            "Aber dann kann man schwieriger Geld waschen.",
            "Bargeld heißt Freiheit\n\nFreiheit, keine Steuern zahlen zu müssen.\n\nSteuern sind eh nur Raub\n\nJeder, der Steuern hinterzieht, ist ein deutscher Robin Hood\n\nHerzlichst, ihr Franz Josef Wagner",
            "Immer noch ein running gag, dass man verblüfft ist wenn man in einem laden mit karte zahlen kann….\n\nLeute die auf Bargeld schwören haben entweder eine handtasche oder einen dicken klumpen klimper in der Arschtasche",
            "[removed]",
            "[removed]",
            "Auch wenn ich mich als Boomer (I'm Herzen) oute, aber gibt es wirklich so viele Leute die einen Döner mit Karte bezahlen wollen?\n\nOder geht es um das Geschmäckle von befürchteter Steuerhinterziehung die nicht schmeckt.",
            "Aber Geldwäsche...",
            "Ich kaufe aus Prinzip nichts wenn Kartenzahlung nicht möglich ist lol",
            "selbst an der mobilen döner bude kann ich hier mit karte zahlen... ist das irgendwie was besonderes?  \nich hab 3 döner läden im unkreis, alle nehmen karte",
            "Ich hab eine Vogel-Fisch Allergie und ich ab es lange mit \"Kalbsdöner\" probiert, aber nach ein paar Jahren und \"Dönerallergie\" hab ich es dann sein lassen. Da ist überall irgend ein Fleischgepansche drin.....",
            "Bargeld ist Liebe",
            "Amex auch?",
            "Nenn mich altmodisch aber ich vertraue keinem Dönerladen der Kartenzahlung akzeptiert.",
            "*15 :(",
            "Also ein Döner und ... Ah ne passt schon",
            "Das stimmt bei uns in der Stadt gibt es sogar einen der sich der beste in Deutschland nennt. Ich habe noch nie so etwas widerliches matschiges gegessen und die positiven Rezensionen sind definitiv gekauft",
            "Das sind 12 Mark. 24 Ostmark. 240 Ostmark aufm Schwarzmarkt.\n\nSo teuer is det alles jeworden.\n\nVon den bisherigen ich_iel-Pfostierungen hätte man 10,931369 % der DDR entschulden können.\n\n ^War ^ich ^ein ^guter ^Rechenknecht?",
            "Dönerersatz klingt wie Nikotinpflaster nur mit Dönergeschmack... 👀",
            "Krass, kenne das ehrlich gesagt nur, dass der Döner in der Front zubereitet wird und die gar keine Küche haben. Aber da hätte ich auch keinen Bock drauf.",
            "Warum hast du die nicht angezeigt?",
            "In Einkaufszentren läuft meist weniger Schabernack hinter den Kulissen ab.",
            "Wir leben fast bargeldlos und musste leider schon das eine oder andere Mal in Deutschland ein Restaurant wieder verlassen, nachdem wir gesehen haben, dass sie keine Karte nehmen.\n\nEs wäre schön, wenn die meisten einfach Karte und Bargeld akzeptieren. Dann mögen alle bezahlen, wie sie wollen. :)",
            "Based",
            "Kannst du mir das Original verlinken?",
            "Robin Hood solltest du nochmal lesen",
            "Wir nehmen das Geld von den Reichen und verteilenes an die Armen... Nee warte. Also. Die Reichen behalten ihr Geld und es wird nichts an die Armen verteilt.",
            "Wie will man sonst Trink oder Schwarzgeld bekommen :(",
            "Wo sollen sonst all meine Karten hin? Kann ich gleich auch etwas Geld mit reintun",
            "Dein Beitrag wurde entfernt, weil er gegen unsere Inhaltsrichtlinien verstoßen hat. Eine ausführliche Erklärung der Regeln findest du im ich_iel Wiki unter https://www.reddit.com/r/ich_iel/wiki/index",
            "[removed]",
            "dein Beitrag wurde entfernt, weil er gegen **Regel 1: Benehmt euch** verstoßen hat. Bitte beachtet höfliche Umgangsformen und respektvollen Austausch.\n\nEine ausführliche Erklärung der Regeln findest du im ich_iel Wiki unter https://www.reddit.com/r/ich_iel/wiki/index",
            "Es geht hier vor allem darum nicht ständig Bargeld mithaben zu müssen. Heutzutage braucht man ja nicht Mal mehr ne physische Karte, ein Handy reicht da völlig aus um an den Terminals zu zahlen.\n\nJedes Mal extra nur für den Döner Geld abzuheben ist lästig und da verzichte ich halt lieber ganz drauf.",
            "Ich hab quasi nie Bargeld.\n\nMein Dönermann hat sogar mal PayPal genommen, als das Kartengerät defekt war.",
            "Gerade sowas wie Döner mit Karte. Das ist einfach so unfassbar praktisch danach nicht mit ner Tasche voll Kleingeld rumzurennen. Krumme Beträge können dir einfach egal sein.",
            "Ich meide eigentlich zu 99% Läden bei welchen ich nicht mit Karte bezahlen kann. Geht mir dabei nicht um das Thema Steuerhinterziehung, sondern weil es für mich das logischste ist. Ich hatte früher eigentlich schon nie Bargeld und heutzutage dank Apple Pay auch nicht einmal einen Geldbeutel dabei. Leben dabei nach dem Motto wenn du mein Elektronisches Geld nicht haben möchtest; dann gibt es jemand anderen der es haben möchte. Und gerade Dönerläden waren dafür prädestiniert, dass sie keine EC Zahlung annehmen. Deswegen denke ich der Hype. Aber mittlerweile sogar bei einzelnen unserer Dorfdöner angekommen.",
            "Wenn ich nachts um 3 vom Club nach Hause torkle, hab ich sicher kein Bargeld in der Tasche. \n\nWie komm ich dann an meinen Döner?",
            "Ich habe selten Bargeld dabei, und wenn dann nur weil es mir vor kurzem von Großeltern gegeben wurde. Eine Karte oder sogar mein Handy habe ich eigentlich immer bei mir. Wenn ich immer einfach im Vorbeigehen einen Döner holen könnte, ohne erst ins Portemonnaie schauen und über den nächstbesten Geldautomaten nachdenken zu müssen, fänd ich das schon echt geil. Dazu kommt, dass ich entgegen der Aussagen Vieler einen besseren Überblick über meine Finanzen habe, wenn ich nur auf den Kontostand schauen muss anstatt auch noch in das Bargeldfach, zumal ich dann auch nachvollziehen kann wo das Geld hin ist. Bei der Barzahlung im Dönerladen habe ich das nicht, wenn ich mir nicht selbst ne Quittung schreibe",
            "Ich hole mir gerne nen Döner um ihn direkt zu essen oder manchmal habe ich Tüten dabei die ich trage. Dann kriege ich den Döner und Wechselgeld und muss erstmal Platz finden für das Wechselgeld während ich mein Inventar neu sortiere und die ganze Zeit sitzt der Döner vor mir und der Dönermann fragt sich schon ob ich den heute überhaupt noch nehme und so weiter… Mit Karte wäre es einfach bezahlen, Döner nehmen und gehen.",
            "Ich hab ein festes Budget für Essen in Monat. Wenn ich Bargeld mit mir trage, falle ich oft in die Falle mir unterwegs was leckeres (Döner) zu holen, statt zuhause brav gesund und kostengünstig zu essen. Deswegen versuche ich möglichst selten Bargeld mit mir zu tragen. Wenn ich dann aber gezielt Döner holen möchte, muss ich immer erst zum Geldautomaten, weil keiner von den Karte nimmt.",
            "Lotto Toto Laden bei mir ums eck hat seinen Anbieter für Kartenzahlung gewechselt, seit dem heißt es: \"nur noch Girocard\". Ich weiß nicht ob es Susanne mitbekommen hat aber Giro ist ein aussterbendes System. Anbieter für Visa/MasterCard sei ihr zu teuer. Seit dem habe ich einen neuen Lotto Toto Laden meines Vertrauens.",
            "*Kreditkartenzahlung",
            "Unser Dönerladen hat nach dem Ende der Gastronomie-MWSt-Ausnahme seine Preise gleich gelassen, dafür aber sein EC-Terminal abgeschafft…",
            "warum fahren drei mobile dönerbuden um dich herum?",
            "Nicht ein einziger Laden im 20km Umkreis nimmt die Karte",
            "Bei uns in der Umgebung ist nur Barzahlung. Die machen dann immer seltsam komplizierte Eingaben in die Registrierkasse und dann wird das Geld drunter gelegt 😄",
            "Ist tatsächlich besonders. Wir haben ca 15 Döner im Ort. Bisher akzeptiert keiner von denen Kartenzahlung.",
            "Alle unsere lokalen Imbissbuden/ Dönerläden oder Asia Läden nehmen aus Prinzip nur Bargeld. Es ist zum kotzen....",
            "Bei uns auch die wenigsten. Hätte mich nicht gewundert, wenn die hier nur Batzen verlangen.",
            "Schon Vöner probiert ?",
            "Für Weed! Alles Andere mit Karte.",
            "Opa, Zeit für deine Medikamente",
            "Raus hier",
            "Ich liebe es an der Kasse festzustellen dass ich keine Scheine mehr dabei hab 🥰 oder bei Kollegen die Kohle für den Dönermann einzutreiben und nachher rechnen zu müssen wer wie viel zurück bekommt 😍",
            "Sammle deine ZahlZück-Punkte woanders",
            "Wieso nicht?",
            "Das Gegenteil ist dann doch eher der Fall.",
            "Aber du vertraust den Steuerhinterziehungsdönerläden?",
            "Altmodisch? Eher vorurteilsbehaftet",
            "Ich finde der im Dorf ist der beste. Aber das ist mein Geschmack.\nDas Brot wird immer schön knusprig, das Fleisch ist ordentlich gegrillt. Manchmal muss man halt etwas warten. Die schneiden es nur früher, wenn du es explizit willst.\nAlle extrazutaten kann man einzeln bekommen, einen vorgemischten Salat gibt es nicht. \n\nLeider haben die vor 6 Jahren die Pizza aus der Auswahl genommen, aber statt des Pizzaofens konnten die dann einen dritten Spieß anschaffen, der zur Hochsaison läuft.",
            "Welches davon? 4 6 oder 8?",
            "Fleischersatzprodukte sind doch aber in aller Veganer-Munde ;-)",
            "Klar, der Dönerspieß steht vorn, und du guckst zu wie alles in Brot geschaufelt wird, aber es gibt halt meist noch die hinteren Bereiche, die du als Kunde nicht einsehen kannst; wo die Vorräte aufbewahrt werden und Zeugs angerührt, geschnippelt etc.",
            "edith sagt noch: \n\ndie Erfahrungen im sonstigen Umfeld und auf einigen Plattformen (ja, einige unter hier sind auch dabei) hat mir gezeigt, dass meine Erfahrungen nicht nur nicht geglaubt werden sondern mit Bann und Co bestraft werden, weil ich ja eine böse Rassistin bin und Hetze verbreite . wenn dir das schon im Umfeld passiert, haste erst recht keine Lust, damit zu offiziellen Stellen zu gehen - und plötzlich sollst Du Beweise liefern oder bist selbst ganz schnell die Angezeigte und Gearschte.",
            "weil ich mir n neuen Job gesucht habe und mir dann sehr viel Mühe gegeben habe, den neuen Job zu behalten und mein Leben zu verbessern. Und anonym wäre das nicht gewesen: es wäre für alle Beteiligten sehr schnell und einfach gewesen darauf zu schließen, wer da wen angezeigt hat. Und so schön die Vorstellung sein mag, dass da jemand die Zeche zahlen muss - den tatsächlichen Stress und Nerv mit Behörden und Co und dann jemanden anzeigen dafür hatte ich keine Kapazitäten.",
            "Sorry, das hab ich schlecht ausgedrückt! Das ist kein typisches Einkaufszentrum, sondern das <Ortsteil> Center. Man hat nen Kaufland und Aldi, davor ist dann ein großes offenes Gebäude wo die Läden jeweils drin sind. Aber die Läden haben grundsätzlich nichts mit den Center zu tun und sind wie normale Läden. Schwer zu beschreiben.",
            "https://preview.redd.it/kyno8j98248d1.jpeg?width=828&format=pjpg&auto=webp&s=0e169a13eda135e0243f54a0ad1c7c9524430aaa",
            "Trinkgeld kann ich bei meiner Frisören auch per Karte geben",
            "dein Beitrag wurde entfernt, weil er gegen **Regel 1: Benehmt euch** verstoßen hat. Bitte beachtet höfliche Umgangsformen und respektvollen Austausch.\n\nEine ausführliche Erklärung der Regeln findest du im ich_iel Wiki unter https://www.reddit.com/r/ich_iel/wiki/index",
            "*lacht in apfel Uhr*",
            "Ich habe das Problem mit Trinkgeld gelöst.",
            "Immer den Notgroschen im Schuh verstecken.",
            "Gibt auch andere Karten. Girocard zum Beispiel, ist auch das meistverbreiteste Kartensystem deutschlands.",
            "Basiert",
            "hab ich nie gesagt. eins davon ist theoretisch mobil aber immer auf dem selben platz.  \ndie anderen sind tatsächlich in gebäuden.",
            "krass, na da hab ich dann ja glück",
            "Ja ähm hallo hier ist das Fina.. Ähhh ein Dönerliebhaber. Wo genau?",
            "Solange der Döner schmeckt und ich mir keine Lebensmittelvergiftung einfange soll der von mir aus alle Steuern hinterziehen die er will.\n\nDas Finanzamt sollte sich lieber auf die konzentrieren die wirklich Knete am Staat vorbei schaffen. Olafs CumEx-Freunde zB. so viele Döner kann der gar nicht verkaufen um das Volumen zu erreichen.",
            "hab ich ja echt glück hier, weil ich fast nie bargeld dabei habe.\n\nkann mich nicht daran erinnern das mir in den letzten 10 jahren je jemand gesagt hätte das sie keine karte akzeptieren. vielleicht hab ich auch nur ultra glück mit den plätzen wo ich hingehe",
            "Ich vermute das wäre ein Veganer Döner? Hab ich leider noch nirgendwo gesehen…..",
            "Das bekommste bei der Apotheke auch mit Karte ;)",
            "Ich zahle auch gern mit 1 & 2 cent Münzen 😍",
            "Das ist dann der eigenen Dummheit und nicht dem Bargeld verschuldet 🤭",
            "Ja das stimmt allerdings. Der beste Döner, den ich wirklich je gegessen hab ist der in meiner alten Heimat, Nichts extravagantes aber richtig gute Qualität. Man muss aber auch dazu sagen, dass der Dönerladen ein Monopol innerhalb von 20 km ist. Also klar haben die noch einzelne Dönerbuden aber das gehört alles zusammen. Meine Heimat ist über 100 km entfernt und es ist wirklich der einzige Döner, den ich esse und wo ich auch regelmäßig alle paar Monate wieder hinfahre um mir da was richtig Gutes zu essen zu holen. Manchmal sind die unscheinbarsten die besten",
            "https://de.wikipedia.org/wiki/Miroslaw_Strecker\n\n\"Im Jahr nach dem Vorfall musste sich Strecker an der Schulter operieren lassen und war ein Jahr krankgeschrieben. Danach wirkte die Spedition auf ihn ein, selbst zu kündigen. Seine Spedition teilte ihn künftig für schwere Touren ein, mit vielen Ladestopps und hoch gestapelten Paletten. „Man wollte mich kaputtspielen“, sagte Strecker der Zeit. 2011 kündigte seine Firma ihm betriebsbedingt. Strecker kämpfte vor Gericht und erstritt eine Abfindung. Er sagte damals der Süddeutschen Zeitung: „Es ist ein ungeschriebenes Gesetz in der Branche, dass man über Kunden nicht spricht. … Vielleicht hat die Firma Druck bekommen, dass man mich nicht mehr auf dem LKW sehen will.“\"\n\nWenn man den \"Betrieb stört\" ist man immer am Arsch.",
            "Könnte nicht jemand aus dem sub mit Klarnamen anzeigen? Am besten jemand der sich im Ausland abgesetzt hat 😅",
            "Danke",
            "Giro stirbt aber aus und wird bald nicht mehr supportet",
            ">basiert\n\nBasiert auf was?",
            "sitze aufm klo und wollte nur bissl witzig sein. kam leider nur kacke raus, sorry.",
            "Als ob jeder 2. dönerladen in der stadt einzelfall ist. Das hat mindestens genauso system wie cumex",
            "Genau, mit Seitan als Fleischersatz. Ist von der Konsistenz und auch geschmacklich echt so gut. Esse einfach keinen Döner mehr, seitdem wir hier in der Stadt 2-3 Läden haben, die das anbieten.",
            "Da stimm ich dir zu 🤝",
            "ehrlich gesagt fand ich die vorstellung wie 3 dönerwagen um mich herum kreisen, wie so monde um einen planeten schon ziemlich lustig. \n\nkennst du die simpsons folge, wo homer die ganze zeit von dem hotdog verkäufer verfolgt wird? [https://www.youtube.com/watch?v=SwHB7tHirRY](https://www.youtube.com/watch?v=SwHB7tHirRY) so stell ich mir dass vor haha",
            "War der Witz extra?",
            "Lol",
            "ein magier verrät nie seine tricks (durchfall)"
        ]
    }
}