{
    "POS didn’t look before changing lanes [oc] nsfw for language?": {
        "title": "POS didn’t look before changing lanes [oc] nsfw for language?",
        "score": 4300,
        "url": "https://v.redd.it/u60wiungqy7d1",
        "content": "",
        "num_comments": 438,
        "comments": [
            "Hello /u/memeNOTavailable! Please reply to this comment with the following information to confirm the content is OC\n\n* What country or state did this take place in?\n\n* What was the date of the incident?\n\n* Please reconfirm that this is original content \n\nIf you are unable to reply directly to this comment, please leave a standalone comment in your thread with the requested information.  \n\nIf you fail to answer these questions, your post will be removed.\n\n\n \n ------\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IdiotsInCars) if you have any questions or concerns.*",
            "Correction: Didn't Care before changing lanes.  \n  \nAlways drive like everyone else is an idiot.",
            "Need to upgrade to a horn for this type of situation",
            "~~Brake~~ Brace for impact I guess?",
            "That wasn't a \"didn't look\" situation, that was a \"didn't care\"",
            "If you drive long enough, you start to recognize these situations as high risk situations. You have to assume every car you’re around is going to do something stupid. Assume the truck driver doesn’t look over his shoulder and starts moving over. Would he see you if he’s looking forward? Not in his blind spot, no. So you have three options. Accelerate to be in front of him. Coast down so you end up behind him in case he moves over. Or just be ready to hit the brakes if he moves over. After he moved into the first lane, you have to assume he won’t stop. It’s very basic defensive driving. I’ve been driving 15,000 miles a year for about a decade now. Not one accident because at this point these situations are pretty much ingrained in me to stay away from. Part of it is just luck, but I’ve avoided a lot of potential accidents, even if I was completely in the right. Graveyard is full of people who had the right of way. \n\nTake this as a learning moment between the heavy roasts and the experience itself. You weren’t wrong, but you were certainly not right.",
            "You're about to be roasted. Sub is ruthless.",
            "OP, you have the reactions of a sloth.",
            "This is Dallas, isn’t it?",
            "great driver, even applied the horn for 5 seconds and everything!",
            "Cheap car + dashcam = payday",
            "[removed]",
            "Awesome defensive driving OP well done!",
            "most attentive truck driver I've ever seen",
            "There's full 10 seconds where the intentions of the truck driver are very apparent, the OP doesn't react until much later. Two idiots on the video.",
            "You know you have a brake pedal, don't you?",
            "When a vehicle in front of you is changing lanes in your direction, don't remain in their blind spot and definitely don't try to \"hold your ground\" when they're already in your lane and you're literally up against a wall.\n\nYes, truck dude *should have* made sure the lane is clear. The situation is ultimately his fault. But you only have control over your own actions, so your takeaway should be how you could have prevented this. That's defensive driving.",
            "Brakes? never heard of them..",
            "It not that buddy didn't look...it more that your literally in the guys bmind spot and that person cant see you.  It's his fault ultimately, but you should really lean to drive defensively.",
            "He was wrong, for sure, but it also doesn’t look like you tried too hard to brake. You’re both idiots.",
            "No he definitely looked, put on his turn signal, and just didn't care.",
            "Those mirrors of his seem pointed at his own car. He had no idea you were there lmao.",
            "Textbook blind spot mistake. And textbook lack of reaction to traffic \"because I'm right\". Congrats, really fits this sub.",
            "Truckers be truckin'.",
            "Incoming merge lane with popular exit immediately after it, you are in a grayish car at sunset and do not appear to have your headlights on, and you coasted into the blind spot of a large truck with their turn signal on. What they did isn't okay, but not sure what other outcome you expect. I hope I'm wrong and you had your headlights on. If not, you should turn them on so others can see you better.",
            "You could have slowed down, man. You're also an idiot. \n\nI'd rather be wrong and alive and given him/her the lane. It could've ended very badly.",
            "Horn before brakes when a completely obvious bad situation is about to happen is always the answer. /s OP is the bigger idiot",
            "You know that there's a pedal for exactly this kind of situation right?",
            "Did you seriously not see and decide to not brake?",
            "This video shows TWO idiots. Insurance companies will also see the accident could have been avoided if the car in the back SLOWED DOWN. Enjoy your insurance increase.",
            "Ive had this happen, immediately honked and got coal rolled.",
            "Oh he looked",
            "texas doing texas things",
            "His side mirror is way the fuck off. Looks like he can see nothing but his door from inside. ",
            "It’s always big white trucks",
            "Texan here. Look at those side view mirrors. He saw you. He just didn’t care. Fuck that tollway hard core.",
            "I literally just watched the same thing almost happen. \n\nThe worst part, the car it almost hit didn't see it at all.   They only got back in their lane after I honked from behind.  I knew I had nowhere to go to avoid that shit if it happened.",
            "People think you can see blinkers from the side like morons.",
            "Yooo fuck Texas!",
            "If they push me off the road and cause damage to my vehicle, I'm taking them with me, and they can fight the dash cam.",
            "Most skilled truck driver.",
            "Knew it was Dallas 3 seconds in. Worst drivers in Texas. And I live in San Antonio - that’s saying something.",
            "Did look.. but just didn't give a fuck.",
            "Welcome to Dallas 🥲",
            "People make mistakes, this was a stupid one. \n\n  \nMy question is, when you honked, why did he just continue on like nothing was there?",
            "Truck is wrong, but man. \n\n\n-anti defensive driver\n\n-why the fuck are they just coasting with an oncoming vehicle? What do oncoming vehicles typically do? They merge into lanes. A great scenario of an oncoming vehicle merging into other lanes is when said vehicle is paying attention to the road, and sees the other white truck Infront of them is driving slow, so they want to merge into the right lane. Right where you are. Where you decided to camp just out of view. Just casually driving along side of him. \n\n-non defensive, coasting keeping pace with newly merging vehicle, **and** dinking around right in their blind spot. \n\n\nWho's gonna foot the bill for this? The truck. But man, I almost don't blame them. OP is basically a ghost that popped up out of nowhere, an idiot.",
            "Tbh… and I know they gone hate this one.  U wasn’t driving fast enough for me. I assume everyone gonna merge without looking so I make it a point to avoid being on the side of people any chance I get",
            "Pit maneuver is valid here",
            "I already knew it was fuckin' Dallas before the sign came up. 95% of the drivers do this every time.",
            "And of course it’s a pickup truck, not surprising.",
            "OP should have foreseen that his or her vehicle was merging consistently at the blind angle of the truck. Both are at fault here in my book.",
            "Too proud to brake hey OP?\n\nPersonally, I’d rather be in the right and have an in tact vehicle but you do you",
            "You almost showed him, don’t worry you’ll get him next time, probably in a wreck",
            "should've pit maneuvered his ass.",
            "I mean, yeah he was in the wrong, but you could have just as easily slowed down once you saw it.",
            "Makes you wish you were driving something big and ugly that wouldn’t care if it scratched the delicate paint of that pavement princess. Something out of Mad Max with spikes and axes and shit.",
            "OP has a death wish",
            "Both yall stupid. You actively stay in his blind spot.",
            "OP.. like others have said, you’re also an idiot in a car",
            "Probably on their phone",
            "Amazing that this truck just kept coming over and didn’t hear the horn.  Probably didn’t give a fuck and said he already made a mistake so he'd go full send on the mistake.  OP just left there honking the horn while he’s shifting over fully",
            "And that's when the pit maneuver should have come in",
            "Nuke",
            "Pickup trucks with extended cabs are exempt from looking before changing lanes\n\n/s",
            "Too many people are talking about being in the truck's blind spot. [If you properly adjust your mirrors, you can almost entirely eliminate blind spots in most vehicles; Especially large trucks with giant side mirrors and extra blind spot mirrors.](https://www.caranddriver.com/features/a15131074/how-to-adjust-your-mirrors-to-avoid-blind-spots/) \n\nPeople don't properly adjust their mirrors, so you should try not to stay in others blind spots, but people need to learn to properly adjust their mirrors.",
            "*\"yOu'Re In HiS bLiNd SpOt!!1!1!!oNe!11!\"*  \n\n\nThat would apply if OP was in the left lane. They weren't. The moron in the truck had a completely open lane to merge into but that wasn't good enough so they just had to cut across the entire road in one move. This video is an example of why it's illegal to change more than one lane at a time.",
            "Get a real horn dude!",
            "So wait. Is OP the idiot? The guy had his blinker on, and OP tryna prove a point..",
            "Google maps is janky as fuck when trying to navigate streetview on an [elevated express lane...](https://www.google.com/maps/@32.9020096,-96.8984814,3a,75y,184.38h,93.13t/data=!3m10!1e1!3m8!1sa2tC0Bj2P4aYe3UsDXhOOw!2e0!6shttps:%2F%2Fstreetviewpixels-pa.googleapis.com%2Fv1%2Fthumbnail%3Fpanoid%3Da2tC0Bj2P4aYe3UsDXhOOw%26cb_client%3Dmaps_sv.tactile.gps%26w%3D203%26h%3D100%26yaw%3D243.5147%26pitch%3D0%26thumbfov%3D100!7i16384!8i8192!9m2!1b1!2i39?coh=205409&entry=ttu)",
            "Get a louder horn. I think my 5 year old has a louder horn on their tricycle",
            "You really should look into getting a louder horn. You can barely hear it over your tires from inside your own vehicle. No chance that truck driver heard it.",
            "I-35 South Toll. That's a rough area sometimes. Did you lay on the horn?",
            "I would’ve pit maneuvered his ass, hopefully you were able to pass some info along to the cops",
            "“Hey Dale, them beers cold?”",
            "You had plenty of time to back off didn't even try",
            "I think the idiot was trying to do a self pit maneuver.",
            "I love that typically people on this subreddit follow the instict of honk harder and forget you can do anything yourself to prevent an accident.",
            "That is some serious lack of horn and defensive driving. I would have been on that horn for a solid 20 seconds. And hitting the brake. Trying to hold your place when he obviously didn't look (and you end up in his blind spot) is sheer stupidity.",
            "This must be America, some of the fastest and most dangerous drivers I’ve met. He also overtook by driving in the right lane, I don’t know if this is a thing in every country, but in mine at least you have to be on a lane to the left of the car you want to overtake.(I said overtake, don’t know the English word, when you are behind someone and drive faster and come in front of them",
            "OP, the angles suggest you were in the trucks blind spot through no fault of your own, but you did nothing to get out of it, so it's your fault too. **Why do you like playing the victim?** This was avoidable, but you did nothing. All drivers need to do what they can to avoid accidents.",
            "i would take the impact and file an injury claim with their insurance. easy pay day. at least $5K and a years worth of massages.",
            "Bro you gotta watch for moves like that when you see a slow person in the fast lane",
            "Does your horn work? That’s what it’s for.",
            "Side mirrors is for loosers in his opinion",
            "Should’ve pit maneuvered him",
            "Camera car driver is an absolute clown here. You can see what's going to happen, it's being telegraphed the whole way....just brake and yield the space. No sense is almost squishing yourself between a truck and a jersey barrier to prove a point.",
            "Bro fucking use the left pedal. That's on you.",
            "Graveyards are full of people who had right of way.",
            "You’re in his blind spot. Need to have awareness of this and be prepared.",
            "Speed up or slow down to merge into oncoming traffic. Don’t sit in someone’s blind spot or else this happens.",
            "It's not going to kill you if you slow down for other idiots unless you want to become one",
            "Why did it take you three seconds to hit the brakes after it was clear he wasn't stopping? Yes, he is an idiot, but you need to do what you can to prevent an accident.",
            "Your horn must’ve been in the same key that the music he was blasting inside his truck.",
            "I never feel comfortable sitting in the blind spot or next to a car for extended period. They either don't see you or barely glance at the mirrors. This one was changing a lot of lanes. Imma sit it out until he's done. Used to drive a motorcycle and I got used to the feeling of not being seen at all.",
            "this has happened to me a few time always truck drivers half the time their on their phone or infotainment center",
            "Was watching mirror. Side rear and rear window. \n\n\nYou were unfortunately in his blind spot.",
            "ah the old \"I DO NOT GIVE YOU PERMISSION\" crash that i see on a lot of US videos.",
            "Average pick-up driver.",
            "I think stereotypes are stupid and lazy \n\nalthough, \"people with low IQs drive big trucks\" is starting to make more and more sense",
            "Not to say the truck is innocent, but OP was in the blind side, OP should have prepared what might have happened, either speed up or slow down \"just in case\"",
            "Should have pit maneuvered them ",
            "I drive a full sized truck for a living. I average about 1200 miles a week. The amount of people that don’t know where vehicles blind spots are amaze me.\n\nYou need to recognize these blind spots and be aware that the driver may not even be able to see you if they are using their mirrors. \n\nDefensive driving is a must. Expect the worst to avoid the worst. \n\nI would’ve backed off as soon as the truck started moving right. It doesn’t hurt your day to slow down and expect him to do what he did. It hurts your day if you’re proud, in the right, and get launched into the barrier.",
            "Deserved a PIT maneuver tbh",
            "We really need to stop acting like the road bully and the person who refuses to accommodate them are just as bad as one another.\n\nSure, OP could've backed off sooner, but the other driver 100% saw OP, didn't care, and came over anyway. They were using the threat of an accident to get their way. That matters, and pretending like it doesn't just serves to further reward people who throw a tantrum on the roads to get what they want, because everyone blames anyone who doesn't cater to them.",
            "I’d have pitted him.",
            "Should’ve PIT’d him, he would’ve spun out or maybe even rolled and you can damn sure bet he would check his blind spots for the rest of his life if he survived.",
            "You’re in their blind spot, speed or slow down or something.\n\nDefensive driving gets you home in one piece.\n\nIt doesn’t matter if you’re right if you’re dead",
            "I would have just let him hit me",
            "You're too nice, I would have put manoeuvred that fucker",
            "Op was comfortable with the the space he had so chose to honk and didn't panic brake, no need to. He didn't crash, guys (at least i dont think he did). Truck didnt check his blindspot for 3 lanes lol. Shitty drivers everywhere in this sub",
            "Should’ve did the pit maneuver, only way asshats like that learn",
            "Nah that's you.  I'm always paying attending to my sides for this very reason. The moment I see someone switching lanes towards me like this,  I keep an eye out,  for this very reason. You had so much time to slow down. But your ego won't let you. You'd rather \"be right and teach him a lesson\". Sure,  he was wrong for pulling into you,  but you had more than enough time.",
            "This is why you DONT PASS ON THE RIGHT. people aren’t expecting it. Their blindside is larger. And roadways and driving classes are designed for passing on the LEFT.",
            "Op appears to be driving too far to the right already. Were you distracted or were you anticipating this to happen?",
            "I believe he was in the fast lane and you were moving faster than him. So you were trying to move in front of him in a slower lane which doesn't make sense. You should reduce your speed, let him switch to the slow lane then overtake him by switching to the fast lane. It ain't fun to slow down but it is necessary to stay safe.",
            "This sub is fucking dumb.",
            "OP did nothing wrong, fuck the people ITT acting like bad drivers should just always get to go where they want at all times because they suck ass at driving.",
            "In Texas if someone is exiting the freeway you must yield to them. You should have slowed down and let him over all the way. Signal or not. Yield is yield.",
            "He got you",
            "Not trying to roast OP, but am feeling compelled to add to the feedback: OP, this is the perfect scenario for applying the phrase \"drive like others are actively trying to hit you.\" You see a car merging onto the freeway you're already on from the left, assume they don't see you and are about to pull a dumb move like this. If I'm to the right like you were in this scenario I'm letting off the gas to get this guy fully in front of me. There is hardly any traffic here, you have the space to minimize the amount of time someone is directly to your left or right. In all situations you should try to do that (keep a bubble around you), but sometimes traffic won't permit this.\n\nThis situation was totally on him, but there are very clear some things you could've done to minimize your exposure/vulnerability here. As for you reaction once he was clearly going into your lane and already in it...I'll leave that to other folks lol.",
            "So what is the prudent thing to do here? Do you let him tap you or do you hit the wall?",
            "Camera car is quite far right in the lane which can minimize adjacent traffic seeing it in the side view.",
            "You were right in his blind spot, outside the side view and ahead of the rearview. Not your fault but be aware",
            "Exercise defensive driving, this was easily avoidable.\n\nNot your fault obviously, but a wrecked car and injuries don't care who's at fault.",
            "Please learn to drive defensively. I find it strange that people who already went through the investment and effort of installing a dash cam can't drive defensively.\n\nYou saw it changing lanes, you should've backed off, not because he's entitled, but for your own damn safety, if you are 2 lanes over at the angle you are... YOU ARE INVISIBLE!\n\nYes, it's his fault, yes he's an idiot, you're still only in charge of your car, take care of yourself first, fight over some lane ~~later~~ never.",
            "You're sitting off center of the lane, your person is in the middle of the lane, which means you're not visible by his mirrors.\n\nKeep your car in the middle of the lane, not your seat in the middle of the lane.",
            "Whoever is driving had a lot of time to react and avoid that truck.",
            "Great opportunity for the ol' \"pit maneuver\". Ooops",
            "If you're in this situation again... Accelarate! Get out of their blind spot and move up to where you can't be ignored.",
            "Would’ve tried to pit manuver them but then again I usually get a car Length of space in every direction when people see a multicolored Nissan",
            "Obviously was going to come over. Better get in his blind spot and then start honking after is too late.",
            "Language is appropriate.",
            "Horn first, then (possibly) yield the lane.",
            "prob tipsy or drunk.",
            "OP: https://imgur.com/gallery/austin-powers-steamroller-7RM494l",
            "The gnawing urge to PIT",
            "I don't understand you anti defensive driving guys. Are you saying it's the *wrong* move to actively avoid accidents ?",
            "don't you know about zipper merging?!? are you stupid?\n\n/thatguyprobably",
            "Blind spot. Don't be in one",
            "Dude slow down and let the idiot pass.",
            "While he was 100% in the wrong, you could have easily braked but instead made the choice to fight against him, keep your speed up and go into the shoulder.",
            "Whatever happened to defensive driving?",
            "Why didn’t you just slow down?",
            "Not justifying him but You sure as fuck didn’t react …..\nA bit of awareness and a slight brake would’ve avoided all that",
            "You should have just slowed down, bit of awareness would have avoided that",
            "You're in the blind spot of a truck what did you expect?",
            "Should have pitted them",
            "Read the title. Knew it'd be a truck. 'Merica",
            "Not saying you’re at fault but you floated in his blind spot and there nothing from you to say he stop.",
            "Truth be told, you were in his blind spot.",
            "He prolly did look but you were in a location that would require him to turn his head 120 deg which most can't do. He'd have to spin his torso as well to get that kinda angle and he may catch you in his periphery...\n\nUnfortunately you were also outside the range of his sideview mirror so he couldn't see you there either.\n\nIt's very unlikely he would change lanes without looking. You are driving faster than him so you are two lanes over yet overtaking. If he were driving faster than you he would have seen you at a less oblique angle.",
            "Next time.... overtake",
            "Should've taken their side mirrors off since they don't use em.",
            "Is passing on the right allowed in the US? Op is kinda passing on the right, almost causing an accident because hes not letting some space for white truck to merge, and then white truck also passes on the right.",
            "Should’ve let him run you into the sidewall. Make him pay for it. Trash",
            "If you cant see the driver’s face in the window or the mirror they can’t see you. Especially in a truck.",
            "Don't pass on the right",
            "\"My truck is biggers than yours, you'll move\"",
            ">Always drive like everyone else is an idiot\n\nI've been teaching my son this phrase over and over when we are practicing driving.",
            "You’re right, that’s exactly why they ignored the horn. I hate people like that.",
            "Pickup drivers always merge like this. It's so annoying",
            "My instructor told me this when I was on L plates. It always stuck with me, and to this day, I still do it.",
            "This horn sounds like a meek suggestion. You need a command.",
            "like a train horn?",
            "I didn’t even hear the thing at first I had to turn up my volume after reading the comments",
            "I did this for my miata. The stock one was terrible. I upgraded to one that is so loud no one can ignore it.",
            "Yeah an upgraded horn that actually just activates the brakes so OP can avoid accidents while still feeling like a big man",
            "Nah need to upgrade to brakes",
            "There is an upgraded horn for this exact situation. They call it the brake pedal op was just too moronic to use it",
            "Just be sure to not do it where it’s not prohibited with local ordinances otherwise you will get lighted up and a ticket 😂✌️",
            "i seriously want train horn in my car.",
            "I drive an HHR. Laugh all you want, it was affordable and it holds E V E R Y T H I N G. \n\nI replaced the stock horn with a reproduction 69 Roadrunner horn. People move when I honk.",
            "Definitely too busy honking to brake and avoid contact. \n\nI'm pro-horn for idiots, but not at the cost of avoiding a crash.",
            "If only there was a device in OP’s car that could’ve prevented this from happening",
            "It is critical to maintain awareness of other driver's blind spots, especially in a situation they have to merge from left to right. Not my fault argument doesn't apply to the laws of physics. Hopefully OP's spidey senses will kick in next time.",
            "People need to learn to recognize where _other_ people's blind spots are. OP is in this trucks blind spot for this entire clip. It is still the truck's fault for merging into OP, but this is easy to anticipate and mitigate if you learn to recognize it. If you always cruise in people's blind spots when traffic is merging this is going to happen eventually.\n\nI am basically repeating you but to emphasize that this blind spot freeway merge is such a red flag, anyone who doesn't recognize it should learn.",
            "Usually this sub is over critical of the OP, but you framed this situation really well.\n\nMost people on the road are fucking idiots. That’s the mentality you have to have to drive safely. Which means being prepared for anything and everything, even if 99% of the time it doesn’t happen.\n\nTotally agreed. In this situation, OP is in a potential blind spot when this dipshit merges on to the freeway. It’s better to start preparing for the potential you’ll need to avoid someone like this rather than trying to react last second.\n\nOP isn’t wrong, but he could have saved himself the stress by being aware of the possibilities.",
            "Like that video of the teen girls who got hit by the idiots racing around her. \n\n\n\nShe wasnt technically in the wrong, she was just blissfully unaware of the fact she was driving a 2 ton 300hp steel death machine with other idiots doing the same around her.",
            "Pretty much always be cautious around pickups, Subarus, and Mustangs lol. Also the occasional centegenarian in. Cadillac.",
            "OP basically didnt react and didn’t do anything to avoid the collision besides move over *ever so slightly*. \n\nNot blaming OP for the root cause of the problem but like… do something!",
            "To be fair it's Texas, he may actually be the best driver they have.",
            "I feel like this sub wouldn't have any content if people were better at defensive driving or just braking a little.",
            "Teaching lessons to all makes everyone better drivers.",
            "His reactions were pretty fast. His decisions on the other hand...",
            "He was protecting his line, you think he's just going to let some chump pass him on the freeway? He watched days of thunder last night, rubbin is racing baby.",
            "I have a theory that a lot of people who post here drive like idiots so they can later post here for validation. Check out OPs history he has posted on this sub a couple of times already",
            "He had room to avoid hitting him, he just stayed to make a point that the guy fucked up. At no point was a collision unavoidable.",
            "Says the guy watching a video on a sub where he knows shit's gonna go down. Lay off the armchair driving...you weren't there.",
            "tbf it was 7a",
            "[Yes, here](https://www.google.com/maps/@32.9020096,-96.8984814,3a,75y,184.38h,93.13t/data=!3m10!1e1!3m8!1sa2tC0Bj2P4aYe3UsDXhOOw!2e0!6shttps:%2F%2Fstreetviewpixels-pa.googleapis.com%2Fv1%2Fthumbnail%3Fpanoid%3Da2tC0Bj2P4aYe3UsDXhOOw%26cb_client%3Dmaps_sv.tactile.gps%26w%3D203%26h%3D100%26yaw%3D243.5147%26pitch%3D0%26thumbfov%3D100!7i16384!8i8192!9m2!1b1!2i39?coh=205409&entry=ttu)",
            "Lmao I knew it. This place is a shitshow.",
            "Yeah, SB I35E express lanes.",
            "I scrolled far too long for this",
            "That was poor defensive driving. OP gave up their lane so easily. \n\nWeak blocking. No fight or push back. Would be cut so fast if i was the coach.",
            "Op should have sped up to get in front of the truck before the lane ended or slowed down to get behind the truck. They chose to match their speed and stay in the blind spot.",
            "Just another couple of these and they'll be hot shit in the morgue!",
            "[deleted]",
            "The entire video is 16 seconds long, and the truck doesn't even start to go over the line until 8-9s. The intentions of the truck were most definitely not \"very apparent\" until then. Before then, all that could have been assumed was he was signaling to merge lanes.\n\nSure, OP could have hit the brakes (lightly) as soon as the truck started entering his lane, and he should have. But nothing was apparent before then, unless if you're psychic.",
            "How else is he supposed to look in the mirror??? He is driving in the blindspot of the truck what do you expect to happen?",
            "No cause he honked and had the right away and didn't need to use the break.",
            ">OP is the bigger idiot\n\nHow could anyone seriously have this opinion? \n\nTruck almost caused an accident, OP avoided it. \n\nMaybe OP didn't avoid it as well as you think you would have, but they avoided it. Truck is clearly the bigger idiot.",
            "Ah the ol’ two idiots scenario. This sub wouldn’t be entertaining if we didn’t have it.",
            ">\"yOu'Re In HiS bLiNd SpOt!!1!1!!oNe!11!\" \n\n>That would apply if OP was in the left lane.\n\n\nNo...no, trust me. It applies whether it's on your left or your right. I can guarantee you blind spots exist on both sides. Source: I drive. \n\n>The moron in the truck had a completely open lane to merge into \n\nIts a two lane highway. He merged into the lane. Just ahead, there is a truck which appears to be going slow. Rather than slamming on the breaks, the truck decides to move into the right lane....which, actually, **is** the open lane. Or it would have been, if OP wasn't creeping. \n\n\nTruck probably would have chosen to slam on their brakes instead of merging into the right lane, if OP wasn't a complete mouth breather, casually keeping pace with an oncoming truck, getting cozy right inside the blind spot area.",
            "He must’ve missed the “check your blind spot before switching lanes” day in driving school",
            "The truck driver can probably see 80% door out of that misaligned passenger side mirror. ",
            "Nothing like Reddit to remind me why so many people die in stupid and avoidable ways.",
            "The only dummies are the ones that don't know what defensive driving is.",
            "Does that really include both lanes? Not saying OP couldn't have handled it better, but it seems an odd law. In most places it just includes the first lane, then it's up to the people who pulled onto the road to follow the common law and only pull out if safe to do so.",
            "That's why the white truck should've looked in his blind spot before changing lanes....",
            "He was outside of the range of the mirror because the trucks mirrors were totally misaligned. Driver is probably seeing like 80% door out of that passenger mirror. ",
            "Passing on the right is legal in the U.S. It is the responsibility of those changing lanes to make sure the lane is clear before changing.",
            "This is unironically, how 95% of truck owners think",
            "I would get a cheap beater car just so I can pull off a pit maneuver and watch em roll.",
            "I was wondering how big OPs horn was that it alone was going to push the truck back into the correct lane",
            "I'm driving now, good luck everyone",
            "It’s all fun and games until the Prius with nothing to lose PITs the truck",
            "Not me.  I don't want to get peanut butter on my chocolate bar.",
            "my best friend had a dodge daytona in high school, it was the most meep horn ever",
            "my grandad had a little acura integra like 25 years ago he put in a truck airhorn into, people know where he was then!\n\nhe also took off the acura logo on the back and got a few magnets of luxury brands and would swap out the logos to mess with people.",
            "Go big or go home!",
            "4 tone Buick Park Avenue horn would suffice",
            "Get one of those horns that sound like the old car horns. [aarooga](https://youtu.be/679144L9wiA?si=pE1knbPUm7tmPAS8)",
            "You wanna be seen not heard...\n\nSkip the horn and drive where encroaching traffic can see you.",
            "My dad did this to his jeep",
            "[https://youtu.be/lv8wqnk\\_TsA?si=vI0\\_K1rpb8PihVKk&t=259](https://youtu.be/lv8wqnk_TsA?si=vI0_K1rpb8PihVKk&t=259) \n\n4:19",
            "Yeah, and wire it to your brake switch so that next time you’re not also the moron.",
            "If you want a realistic answer, get a louder horn that's plug and play for your car. Don't get a train horn. The installs on those suck.\n\nIdk what kind of car you're driving, but often times, car horns are interchangable between different models from the same manufacturer. \n\nFor example, I drove a Honda fit where my horn was really wimpy and quiet. Worse than yours honestly. I was able to grab a horn from a Honda pilot with a loud ass horn and just swap it out on my car. Mounted the same way and used the same wording harness.\n\nJust get a compatible horn that will plug right in and is much louder. It will be plenty and much easier to install.",
            "You have to in a Miata these days, that and driving like a motorcycle. It's scary out there",
            "Definitely.  Made me laugh because I thought of other scenarios where an automatic brake activation might be needed, and motorcyclists bouncing off the rev limiter came to mind.",
            "Gotta pull the old brake and honk maneuver. It's real easy. Just move your hand and your foot, instead of just your hand",
            "Seriously, why even try holding your ground in a situation like this? Just back off and let the idiot be on their way.",
            "I'm convinced that I've reached age 40 without a driving accident simply because I observe my surroundings and avoid bullshit like this. So many drivers use the \"well it's their fault!\" argument before, during, and after an accident. I'd rather just not get in the accident in the first place.",
            "Right?  Half the posters on here need anger-management classes, and defensive driver training.",
            "If they had someone tailgating them I could see why they wouldn't hard brake",
            "The horn, duh.",
            "I legit get the spidey sense and absolute dread when I'm matching someone's speed in their blind spot. Mind just tells me \"anywhere but here! They could lane change any second!\"  \n  \nI've been driving roads in Fire engines/trucks, rescue rigs, ambulances for over a decade, and the shit you see people do with and without sirens makes you distrust every motherfucker out there.",
            "Nah, not even. In that video everything was caused because the vehicle on her right was speeding up to be beside her as she was trying to move over for the car coming for her ass. She recognized she was going to hit the car on her right so cancelled the lane change but car behind her committed to her changing lanes and he had to correct into the median. They only look wrong cause the car on the right ended up changing another lane over before getting into front view of camera, but you can see it occurring.",
            "My personal experience has been that RAM pickup trucks are SPECIAL.",
            "That’s called honking and believing that the person is going to correct their driving so you don’t have to. When it was obvious enough that they wouldn’t, that’s when OP reacted.",
            "OP avoided a collision. Does that count as, \\*checks notes\\*, \"doing something\"?",
            "Sudden left turn you say?",
            "It's also not beyond shadow of a doubt that (while truck wasn't practicing safe driving) was in his blind spot the entire maneuver. A defensive driver takes into account other people are idiots and avoids being in peoples blind spots, especially when they're already making lane changes.",
            "They were also perfectly situated in that truck's blindspot. \n\nI don't know the backstory to this video so I won't jump to the truck driver's defence, but as someone who drives a GM pickup like the one shown, I can almost guarantee that car was quite hidden from the truck driver's perspective.\n\nThat being said, always plan ahead and only change one lane at a time while pausing to do another shoulder check before moving to avoid this exact thing. \n\nPS: OP is also a dumbass for watching this situation unfold and doing literally nothing to avoid it. Defensive driving people.",
            "Here's what it looks like to me. \n\n\nHe sees the guy encroaching and lets off the gas and puts on his horn. The truck, however, was moving to an exit and also slowing down. The only thing he could have done is brake a little harder while attempting to gauge how much the truck is braking. \n\n\nThe truck is way in the wrong and his mirrors aren't properly aligned.  You shouldn't have to worry about someone flipping three lanes over to cut you off. ",
            "Clearly you don’t drive. 🙄",
            "Well, 7am is “guess I’ll just die” energy.",
            "Get coffee before driving on the freeway. Drowsy driving is about as bad as stoned driving.",
            "Calm down rainbolt!",
            "There’s a reason our car insurance is higher than other areas. Dipshits like this.",
            "He should have pitted him",
            "Lmao",
            "[deleted]",
            "Brace for ramming speed...",
            "It is clearly sarcasm",
            "This entire thing was apparent.  I see this all the time when I'm driving. And I avoid it all the time.  When I'm entering or exiting a freeway, and there is someone next to me/ slightly in front of me,  I'm paying attention, this stuff can be spotted a mile away.  If op was absolutely directly side by side, then yes,  that's very tough to avoid, but he was behind and could clearly see every move of the truck.",
            "WTF is wrong with the people in this sub? How is OP an idiot for maintaining his speed and staying in his own lane?",
            "Yeah. There's being judgmental, and then there's just being a douche, like /u/BleachedPumpkin72. From the timestamps in the video it's clear that the time the truck is entering OP's lane to the time they're \"touched\" is a full 3 seconds.",
            "You adjust your mirror to see blindspots on the side of your car. The trucks mirrors were badly misaligned. ",
            "Brake",
            ">How could anyone seriously have this opinion?\n\nI think because the truck probably made an honest mistake in not checking their blind spot\n\nOP maintains speed when its clear the truck is entering their lane, so they are knowingly making the situation more dangerous.\n\nHonest mistake vs proving a point by staying side-by-side, both idiots of equal splendor imo",
            "Because anyone can see that braking was what a person should have done in that situation. *If* OP did avoid a collision, which I'm not certain of, it was purely through luck and not at all because of skill. They were stubbornly fighting to keep their lane instead of doing the safe thing and braking. \n\nIt doesn't matter that they were in the right, it matters that they were unsafe.",
            "It could be argued the truck driver made a mistake by not looking. Meanwhile, what OP did was intentional and \"my lane\" mentality was in play. \n\nSo who's the bigger idiot: someone making a mistake or someone willing to almost wreck on purpose to keep their lane?",
            "The goal isn’t to be in the right. The goal is to avoid contact at all costs. OP drove like an idiot.",
            "At some point, the other vehicle's behavior doesn't matter. \nOP stubbornly stayed in the same position and their vehicles collided. It's not 50/50, the truck is obviously the perpetrator, but this is absolutely a situation where they share responsibility. \"Defensive Driving basics\" day in driving school.",
            "True",
            "Yes, it includes both lanes, or however many lanes there are. My ex-wife was in the middle lane on a service road and a truck came over on her off an exit. Be sideswiped her and pushed her up and over the curb where she hit a sign and a parked car. She was sure that it wasn’t her fault. Welp, not so much. She even got a ticket for failure to yield the right of way. She was a tad pissed and wanted to take them to court. One of the many reasons I divorced her. She refused to admit that she was mistaken and take her lumps.",
            "Never leave your fate in the hands of another. “They see me!” Famous last words.",
            "And they didnt, like many people dont. Im not crashing my car because Im right. Its a very predictable and easily avoidable maneuver",
            "My friend has a big truck. She was 100% serious when she told me that pedestrians don’t realize she can’t see behind the big A-pillar and should know to avoid walking there. \n\nNo, you have the onus of swaying to the left and right to see around the pillar. If you can’t adequately see out of a vehicle, or are unwilling to, don’t drive it.",
            "Growing up my mom was friends with a woman whose husband drove a big rig. Dude literally said, \"I flash my turn sign 3 times then merge, if you're in my lane, whatever happens is on God.\"\n\nGuess where he ended up?!",
            "95% of truck owners don't think.",
            "Personally, I've seen too many trucks rolled over in similar accidents so I take extra care to be that other 5%",
            "I don't know what's more frustrating, truck driver's that are jerkoffs that don't care, or the ones that can't SEE over their own steering wheel adequately to operate their oversized vehicle.",
            "My father literally says this out loud while doing stupid shit.",
            "Same. It helps that my neck is thin enough to be able to turn my head & check my blind slots.",
            "It's an old reference, but it checks out.",
            "I had a Corvette once. The engine sounds like a bear. The horn sounds like the Roadrunner.\n\nMeanwhile, for some awesome reason, my minivan horn sounds like a fucking train whistle.",
            "But Acura actually was supposed to be a premium brand from the start",
            "Why does this make me smile like an idiot",
            "Not sure why you're getting down voted.\n\n\"Headlights? No thanks, give me a bigger horn instead 🥴\"",
            "I know right? Riding in their blind spot the whole time.",
            "We had a BMW Z4 for about a year and it was terrifying how much bigger 95% of the vehicles are",
            "Because that's just beta behavior. Better to just wreck your vehicle to prove a point. Not sure what the point is, but I'm sure it's something.",
            "I had a real tough time not doing that in my younger years. I was a shithead I guess. Not anymore, I'd rather not be in an accident than be \"right\"",
            "yeah as soon as i saw the truck i was like \"you're in his blind spot speed up so you're alongside him or back off\" not do whatever op was trying to prove here",
            "its bananas how tall of an order \"observe surroundings & avoid bullshit\" is for a lot of folks (especially if theyve never been in a BAD car wreck). at 33 years old (and having been in 4 horrifying wrecks), Ive never wrecked a car and Ive been driving sports cars enthusiastically for well over a decade. Id also prefer to keep my car intact, considering how much time & money Ive put into it. a sketchy situation plus distance equals less sketch",
            "Bunch of neutral-driving posting videos mad at offensive-driving. And the difference between the two is miniscule compared to the difference between neutral-drivers and defensive-drivers. Neutrals are only a tad better than offensives cause they'll buy into their egos.",
            "They didn’t brake at all until too late. Better to be rear ended than pushed into the sidewall.",
            "The brake",
            "Yup, another one that freaks me out is when I need to change lanes on the freeway, and I am either totally parallel to another vehicle, or when my front tires are parallel to their rear. \n\nToo easy for both parties to change into the same lane. So I avoid doing that entirely unless I am clear of the other vehicle.",
            "It was the cancelled lane shift she did that fucked everyone up. \n\n\n\nShe almost hit the jersey wall herself snapping to the left. \n\n\n\nGuess what, insurance company is gonna assign her partial fault too if they have the video. \n\n\n\nGot to be aware of your surroundings, being startled isnt a good excuse for causing a multi car wreck.",
            "As is mentioned many times, cemeteries are full of people who had the right of way.\n\nDrive defensively!",
            "> believing that the person is going to correct their driving so you don’t have to\n\nDon't put your life/expenses in someone else's hands like that. You see it coming, be mad, but make sure you are safe first and foremost.",
            ">That’s called honking and believing that the person is going to correct their driving so you don’t have to.\n\nThat's called being an idiot. Avoid first, communicate after. \n\nPlenty of people ignore the horn. Hell, some bad drivers panic and react unpredictably. Honking in the hope that the bad driver corrects their driving is not a good course of action. Honestly, there's a 50/50 chance the pickup driver was totally aware of what was happening and just figured they would force OP out of the way. If that was the situation, they were never going to \"correct\" their driving, no matter how much they honked.\n\nIn general \"believing\" that a driver will behave correctly, after they *just* showed you that they are bad drivers is pretty stupid.",
            "It was obvious the truck was going to be a moron. All OP needed to do was get off the gas for 3 seconds to avoid an overlap.",
            "Could've just lightly tapped on the brakes and let him have the lane? OH HELL NO!",
            "> OP avoided a collision.\n\nDid you only watch 13 of the 17 seconds?",
            "Yes, if they had just braked a little harder there would be no issue. That's the point.",
            "Clearly you need to go touch grass. OP avoided a collision regardless of how your armchair driving believes you'd handle it \"better\".",
            "\"guess I'll just die energy\" is the best to be honest.",
            "When you're on your way to work, it can feel like that sometimes.",
            "This is Reddit. Stoned driving is totally cool.",
            "The thoughts in his head: \"Me big truck drive. Me now move. You now move.\"",
            "Now that's good defense",
            "Woosh",
            "read the whole comment",
            "Nearly half the nation voted for trump in 2016. They won’t know sarcasm if it hit them in the face!",
            "Surely it’s more sensible in any situation (not only driving) to adjust your position based on what’s happening around you?",
            "Because everyone on the road has the responsibility to avoid crashs even if the roor cause of the problem isn’t their own fault.\n\nIf you see a guy driving recklessly what do you do? Be stubborn and stand your ground which gets you nothing or break for a fraction of a second to avoid the reckless driver?\n\nSeems pretty cut and dry to me.",
            "Yes, since doing so resulted in an avoidable collision. Being in the right won't fix your fender",
            ">How is OP an idiot for maintaining his speed and staying in his own lane?\n\nBecause most of us live in the real world",
            "He stayed in the blind spot of a merging vehicle and maintained the same speed. Just because you are legally correct doesn’t mean you should get into an accident. Not saying OP is an idiot, just that many drivers actively avoid this situation in the first place, rather than react to it.",
            "Because he could have made it far less close of a call. Being a stubborn prick can get other people killed. Just slow down and let him in. Even if the truck is wrong.",
            "The morgues are full of people who had the right of way.\n\n\nThe sensible actions in traffic doesn't always equate to insisting on your right.",
            "One can see the truck moving over from two lanes away. It's very clear what it's doing, it maintains speed and direction. That lasts way longer than 3 seconds. If you can't read the situation, it seems like a you problem. Bye.",
            "Whomever can't recognize that this is a very real possibility at the seven second mark is a bad driver. \n\nIt's obvious this was a possibility that should have been accounted for the *moment* the pick up crossed his own white line.",
            "There is no way to position your mirrors so that you can sufficiently cover your blind spots, even if you move them all the way out. If you think you don't need to look over your shoulder because of how your mirrors are angled, you are eventually going to do what the truck did.",
            "![gif](giphy|enqnZa1B5fRHkPjXtS|downsized)\n\nYou definitely should be getting downvoted for this. The guy you're responding to is an idiot.",
            "Yeah, no that wasn't an honest mistake. The truck had zero intention of changing just one lane at a time like they're supposed to.",
            "Someone making an honest mistake would have aborted their lane change as soon as they heard a horn. The truck fully committed to it because they needed stomp on the pedal to pass the vehicle in front of them at the first moment they could. There is nothing unintentional about what the truck did.",
            "one time i almost got into a car accident. my friend was driving, he wanted to make a left turn because he had right of way. but there was a guy speeding across from us that was obviously going to hit us if he did that.\n\nas we were turning left i yelled at him to stop, the car sped past us super fast, would have hit me directly. when i said \"didn't you see that guy obviously being an idiot?\" he said, \"yeah, but it would have been his fault\"\n\nfuck the dumbass mentality that people like OP have, it's just as dangerous as the shitty drivers.",
            "Interesting, although thinking about it I can't recall any roads I've driven on where people merge from the inside lane. There may be somewhere in the UK, but it's not common sombre we don't really have highways like you do",
            "For me, she and the likes of her shouldn't drive large vehicles at all. A smaller car with better visibility is a better choice.",
            "Your friend shouldn’t be driving any big vehicle, if she has that of mentality, she should get a smaller car like a Sedan or medium sized SUV.",
            "Sounds exactly like one of my co-workers.  She drives a pickup so large she has to actually climb into it. It's covered in dents and scratches from hitting other cars. She just does not care about anyone else on the road.",
            "> Guess where he ended up?!\n\nJail?",
            "probably maybe mostly those who drive one for no reason other than they think it makes them look more manly or tough",
            "That is such a random nonsense percentage.",
            "nobody stops you from getting to soccer practice",
            "I really hope you're joking. Dude didn't do anything to put him self in the guys blind spot. He just continued traveling at the same speed. Someone else got into the lane next to him and put him in their blindspot. \n\nDon't get me wrong though, OP is an idiot for choosing to honk instead of brake lol.",
            "I once saw a pickup swerve and smash into another pickup while getting onto a freeway because neither wanted to let the other go in front 🤣😭 truly fucked up both trucks ... And then neither of them got into the freeway 🤷🏽‍♀️",
            "It's not about safety, it's about teaching a lesson.",
            "Usually a hope insurance will find the not cam car at fault",
            "What you say is right, a defensive driver in this scenario would have braked & eased back as soon as they realised the other driver was doing a double-lane change without seeing there was another vehicle in their blind spot. Instead they tried to maintain their line and let the horn do the work.",
            "*Avoid first, then go about your day.  Honking at someone because you think they’re an idiot accomplishes nothing",
            "Have you ever been on a public street before? The whole thing is predicated on other people following the rules.\n\nThe takes on this sub are wild.\n\nSure idiots exist but you can't predict 1 million idiots, you'd never get anywhere.",
            "The sub name doesn't say which cars.",
            "I wouldn't say it was obvious. The lane the truck was in was ending, OP probably just assumed he was signaling to get in the next lane over. OP didn't expect the drive to come over two lanes. The signal turned on just as OP was passing the truck, so difficult to see.",
            "It was obvious the truck was going to be a moron because you're watching a 16 second video knowing what was going to happen because the post title told you.",
            "It was obvious to you, a person who clicked on a video knowing for a fact something was imminently about to go down.\n\nHow are people not smart enough to realize the difference?",
            "yeah there did seem to be a slight bump there",
            "There already was \"no issue\" according to what you consider an issue. Smooth brained as hell if you think OP's .3 second reaction time was slow",
            "1. Really seems like they bumped\n\n2. It is literally basic driver's ed to go 'Hey, when somebody is pushing you into the shoulder, don't fight for the lane. Just brake and get behind them'. \n\nYou don't have to 'Be there' to understand what OP did was dumb and reckless. You probably have to be there to say there was no collision.",
            "I’m jealous, but I’m really happy for you. That’s my dream too.",
            "And nearly half voted for Biden in 2020 and will do it again. It's not limited to one party 😂😂",
            "You’re right. It should have been more than half.",
            "The truck was merging into the middle lane, then just continued merging into the right lane without even looking or waiting. Being in a blind spot or not doesn't excuse the truck driver's absolute lack of awareness or their apparent refusal to follow the rules of the road. \n\nThe truck was completely in the wrong here, and the only thing OP should have done differently is start to slow down earlier.",
            "[You can almost entirely eliminate blind spots in most cars if you properly adjust your mirrors.](https://www.caranddriver.com/features/a15131074/how-to-adjust-your-mirrors-to-avoid-blind-spots/) Obviously some cars have ridiculously large pillars or tiny rear windows that offer less visibility, but for the average car, you can eliminate or drastically reduce almost all blind spots.",
            "I can see nearly all of the blind spots out of my normal 4 door sedan. Not all cars are the same and yes, you should always shoulder check when getting over to the right. I'm not arguing you shouldn't. \n\n\nTrucks have larger wider mirrors and additional mirrors that would show a lower blind spot you couldn't even see with a shoulder check. Look at the angle of the guys mirror in the video. It's way off. Like it got bumped and he couldn't bother to realign it.  ",
            "Exactly. It takes an idiot to make a mistake, but a whole another level of idiot to willfully wreck themselves because of someone *else's* mistake.",
            "She think pedestrians should avoid her, I didn’t think she’s safe in any vehicle. Entitlement wise not visibility wise.",
            "Visibility doesn't depend on the size of the (modern) car unfortunately. I've seen some mentions that consumers feel safer when they see less. But there still will be a chance that she will notice children above her hood in that case at least.",
            "And then you become the blue car in this video, because some other idiot can't see YOU.",
            "I know a chick that drives in such a position that i think she barely sees an adult pedestrian head  while he's crossing. She'd never see a child.",
            "A civilized country would require special licensing for vehicles like that, but we just let any dumbfuck with a willingness to go $60K into debt buy one of these things.",
            "Ah, right, the Gender Affirming Cars",
            "I'm going to assume that covers about 98% of them overall.",
            "What if there's a woman behind the wheel?",
            "Most trucks arent used as trucks. Id say that sounds close enough",
            ">He just continued traveling at the same speed.\n\nExactly, and ended up in the truck's blind spot, and stayed there instead of speeding up or slowing down in order to not end up in their blind spot. That's defensive driving.",
            "Fuck ‘em, they get what they deserve. \n\nThe only reason I wish it wouldn’t happen is for all the people who got delayed as a result ☹️",
            "That’s tuff",
            "100% True. This is something that I don't see mentioned enough.",
            ">Have you ever been on a public street before? The whole thing is predicated on other people following the rules.\n\nSure, but once a person literally shows you that they do not follow the rules, you got to stop assuming they will follow the rules... *they just proved to you they weren't following them!* You can't predict every idiot, but there's no need to predict here, the dude already showed you he was an idiot. It's not about predicting every idiot, it's about assuming that a proven idiot will continue to be an idiot.\n\nWhen you go around, you work under the assumption that people will follow the law. If someone suddenly takes a gun out and shoots someone else in the face, do you still assume the shooter is going to follow the laws, or do you run for cover?",
            "I've been driving for 40 years and avoided many accidents like that by using my brain instead of the horn, including in some countries that you would not dare driving.",
            "No one's saying that OP should react that early, but go look at the video again and count how long OP insists on staying next to the truck once the truck is literally in OP's lane.",
            "May nit have been obvious, but when OP did react, it was very poorly. They were in the shoulder and speeding up rather than not braking. It's not their fault the other driver is an idiot, but this was a terrible reaction to \"prove a point\"",
            "OP definitely saw it. he reacted by moving slightly to the right. the best reaction would be to slow down. OP has huge ego",
            "I’m sorry, when you’re driving do you need more than 16 seconds to react to someone next to you on the road?",
            "Nah, you should always drive defensively. Relying on other drivers to be aware and responsive is not the safest course of action. I wish it could be, but it just isnt reality. I am not saying OP is an idiot or a bad driver. They could have avoided this situation if they were driving more defensively. We are all learning and adjusting, hopefully OP learns to trust other drivers less.\n\nEdit: just watched it again and OP also hung out in the blind spot of a merging larger vehicle, so there is also that to improve. I would actually classify that as bad driving.",
            "Nope, this is in Dallas, you should always assume this is about to happen. No way in hell I'm going to drive in someone's blind spot, much less a giant truck's blind spot at sunset, when their lane is merging in and there's a popular exit immediately after. This same \"cut off\" scenario happens to me almost daily. Our road planning sucks and there's tons of areas where merging traffic is coming in from both sides and everyone has to intermingle and swap lanes quickly, and folks are so bad about not letting people merge (like they will actively accelerate and block for no reason) that many people have resorted to just changing lanes without regard for anyone else. I'm not saying the merger's behavior is okay, it's just obscenely common and totally predictable - cruising into someone's blind spot when they have their blinker on coming out of a merge lane is asking to get sideswiped, you should not drive in people's blind spots if you can help it. Even giving it some gas earlier and getting ahead of the truck might have looked like a dick move but would've resulted in a much safer outcome for everyone.",
            "Don't bother. Regardless of sub, the average person doesn't understand how to remove bias from their perspective, let alone shift their perspective to one they didn't actively experience.    \n\nYou're 100% correct; but screaming in to the void my guy. More and more the idea of people being NPCs just... fits.",
            "If you can press on the honk you can step on the brake.",
            "Probably because we drive every day and avoid shit like this every day without supposedly needing a video to see it coming",
            "And *your* brain is so smooth that I doubt any amount of explanation will allow you to comprehend that OP should have braked instead of honked.",
            "It really is the fucking wild west out here",
            "The truck was completely in the wrong, but that doesn't mean OP is devoid of responsibility. \n\nIf a child suddenly biked out into the middle of the freeway straight into OP's path, they'd be in the wrong. They'd have the same lack of awareness, the same refusal to follow of the rules of the road. But if OP maintained their lane and ran into the kid, they'd still have fault for the situation. \n\nOP getting into a collision with a truck is far less tragic, but the principle is still the same. They had ample opportunity to do better than what they did, and they stubbornly refused to take that opportunity.",
            "That's for a car, not a truck.",
            "As a pedestrian who doesn't own a vehicle... I automatically assume anyone in an SUV or truck can't see me. And they don't care. A good chunk of the time, I'm right. When the green light comes on, even if I have the right of way, they'll gun it. Hence why I look for the driver's eyes to check if they saw me before crossing.",
            "Which is not supposed to be the case. I believe commercial vehicle driving schools taught drivers to be cautious at all times, especially since their vehicles have a lot of blindspots compared to cars.",
            "> I didn’t think she’s safe in any vehicle.\n\nMobility scooter, Popemobile, or AMC Gremlin.  That's it.",
            "Emotional Support Vehicles",
            "putting the *manly* part did make me second guess it, i suppose *tough* alone would have been sufficient for apparent aggressiveness. then again theres aso ton of gigantic SUVs now as well, so i suppose trucks arent alone in that regard",
            "I said in another post I probably should have left the manly part out because it draws too much focus to something trivial. I just meant it as toughness, or coolness or whatever reason for buying a truck they don't really need.  There's a thousand what if scenarios",
            "My impression is that the average motive differs : guys tend to be 'yeah i feel like the big and prowerful king of th road in my big ass truck' while women are more 'I feel safe and protected and nothing can happen to me in my big ass truck.'\n\nDon't changes much when you're on the on the reciveing end of the idiocy.",
            "Totally agree.  I think I mention it every time I see it - and get downvoted to oblivion.",
            "Agreed man--Canada is the worst.",
            "OP handled it fine, it’s sad people here want to criticize split second reactions to a situation that ended up with no issues.",
            ">It's not their fault the other driver is an idiot\n\nCorrect but it's their fault they are an idiot",
            "The whole video is 16 seconds. For the first half it seems the truck is going to stay in their lane like they're supposed to (and like what happens the vast majority of the time in the real world if you ever venture out there). The last 5 seconds show the truck completely in OP's lane. That leaves 3 seconds to react to the truck trying to run you off the road. I'm no math wizard but 3 doesn't equal 16.",
            "~~161 Northbound? Las Colinas area?~~ On second look, too ghetto. 35E N, Farmer's Branch?",
            "Spot on, Cawffee.",
            "💯 .",
            "That has literally nothing to do with what I said. You must be one of those people.",
            "The amount of people on this subreddit blaming the OP in a lot of these videos is wild. OP did nothing wrong but you guys feel the need to have someone to yell and be angry at for no reason other then to get satisfaction out of feeling like you are better and they are an idiot. I mean I'm doing the same with these comments but that's bc they are fucking stupid and irrational",
            "This is literally how it's being tought in schools here in The Netherlands.\n\nWe have traffic lessons, and this is a part of it that's repeated over and over again.",
            "Good assumption 😂",
            "Aka being responsible for your own safety.",
            "majority of the population hasn't had their driving tested in DECADES.  \n\nJust something to think about.",
            "You can't call 5 seconds a spilt second reaction....",
            "It literally does have things to do with what you said, because you don't need to have foresight to understand that hitting the brakes is necessary in that situation- And that is what you are being told.",
            "You really can though, 5 seconds is not long enough for a human to look process and make the best decision, for really anything.",
            "That is just wrong on everything level, 5 seconds is life and death in many many scenarios",
            "If you can't make a driving decision in under 5 seconds, I'm not sure you should have a driver's license.",
            "It is more than long enough for a human trained at driving to react to someone trying to merge into them.\n\nIf you've driven a car for any length of time you've had someone pull out in front of you, cut you up or do this. Most people manage to slow down.",
            "This is so objectively false it baffles me that you would even think about being on a sub about driving. \n\nIf you freeze up for ***5 seconds*** in an unexpected situation, you should never be behind a steering wheel, because people will die because of you."
        ]
    },
    "Kid forgot how to put the car in “park” and doesn’t leave a note saying he hit my car [oc]": {
        "title": "Kid forgot how to put the car in “park” and doesn’t leave a note saying he hit my car [oc]",
        "score": 629,
        "url": "https://v.redd.it/rq4ad8ldlz7d1",
        "content": "",
        "num_comments": 47,
        "comments": [
            "Hello /u/TristalMeth! Please reply to this comment with the following information to confirm the content is OC\n\n* What country or state did this take place in?\n\n* What was the date of the incident?\n\n* Please reconfirm that this is original content \n\nIf you are unable to reply directly to this comment, please leave a standalone comment in your thread with the requested information.  \n\nIf you fail to answer these questions, your post will be removed.\n\n\n \n ------\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IdiotsInCars) if you have any questions or concerns.*",
            "This reminded me that I don’t have a pad of paper in my glovebox. I’d have to draw my number on their window with my nose grease",
            "I love car parks. On the old Passat I had, there were nicks in the paint all round from shopping trollies. This one has a thicker rubber buffer strip on the doors that stops this.\n\nPeople just don't give a fuck.",
            "Did it cause any visible damage?",
            "If there is no damage, the note is unnecessary.",
            "It would have been HILARIOUS if his door had been locked,,,",
            "That's why I drive sh\\*t cars when going to parking lots.  Scratch on my bumper?  Hey- you gave it more character!",
            "Subaru means ‘Love’. Right.",
            "If you pause just before he gets back in his car, you can see him laughing about it too.",
            "Man, if I saw this and saw no damage who freaking cares.",
            "What if he doesn't have pen & paper?",
            "how did it take him so long to notice the car moving",
            "does anyone anywhere really leave a note tho?",
            "Bold of you to assume kids know how to write on real paper.",
            "I've got 1000 Dunkins napkins in my glovebox, but no pen 😬 guess maybe I should throw a sharpie in there before the situation arises",
            "Screw pen and paper. What if it rains? Use a window marker instead!",
            "People always make fun of me but I always park away from other cars as possible. I end up keeping my cars scratch/ding free and it’s just a little thing that gives me a few extra steps to help me keep in shape. Same as taking the stairs over the elevator. It’s a bit more work but sometimes simple actions have a compounding effect.",
            "Cars typically have 5 mph bumpers realistically should have super minor damage, if any. Surface scuff can be buffed out easily. Walked around downtown Philly once and seemed like cars were parallel parked with about 6” space front and back. They definitely use their bumpers as bumpers there…",
            "Yeah, if there’s no damage then who cares?",
            "Do you have two cars depending on where you are going?  I make sure I only have a shit car. I can’t afford to be swapping out for a nicer one.",
            "Yeah... that is also why I drive a shit car. Yes.",
            "Lesbian love specifically",
            "Scratch her in 😌",
            "\"_people are watching me so i'm writing a note. sucks about your bumper. bye_\"",
            "Absolutely yes.  There are plenty of decent people in the world who do the right thing.  My parked car has been hit four times over the years and I've received two notes.",
            "Someone left a note for me last week. I saw them leave, but didn't see the incident. Apparently they hit the bull bar on my Ranger with their little bubble car. No damage. Even if it wasn't my work car and didn't give a shit anyway, I still wouldn't have cared.",
            "?????????????",
            "You should double check that graveyard of napkins isn’t a house for someone else",
            "I don't have pen either, they never work when it's cold and leaks a lot when it's hot. But I do have blood glucose meter kit, I can use the lancet to get blood out and write out the info in blood.",
            "Just do what Ben does after every divorce and leave a note on the Dunkin napkin with his tears",
            "We used to call that “parking by braille”",
            "USA car testing has low 2.5 MPH bump test last I checked. Plastic covers aren't supposed to be deformed or damaged at low speed but I've seen toddler cause Camry dents just by walking into them.",
            "Someone hit the very corner of my bumper going less than 1 mph. They were maneuvering into a parking space at a snail's pace and caved in/scratched a portion of my bumper. My car didn't noticeably move according to the security camera footage. $1033.99 for repairs. Their bumper was at the perfect angle to hit a portion where 2 pieces of my bumper met. If they hit it square on a flatter portion of my bumper, I suspect the damages would be less.",
            ">Cars typically have 5 mph bumpers\n\nNot since the late-1970s...",
            "What lmao people who care about their car and, as If there isn't at minimum stress marks on the paint.",
            "yeah what an absurd comment\n\n\"oh I need my parking lot car today!\"\n\n\"this is my Wendys Drive Thru car, she has never experienced the rough hands of a Giant Eagle parking lot\"",
            "Could also put a fake cell phone number that's close to yours (like a 9 instead of 8 or 7 instead of 1), just in case you do get caught, so you can plead ignorance.",
            "https://www.boredpanda.com/blog/wp-content/uploads/2015/06/windshield-note-7__605.jpg",
            "Hey guess what, that's called damage\n\nAnd the person you replied to said \"if there's no damage\"",
            "My friend's mother had a \"bar car\". As in, the car she would drive to a bar when she was going to be drinking and driving. Wouldn't want to damage the Q45.",
            "[deleted]",
            "OP drives a nissan"
        ]
    },
    "Whose fault is this? [oc] I cut the video because I turned off the car shorty after to check the front for projectile damage.": {
        "title": "Whose fault is this? [oc] I cut the video because I turned off the car shorty after to check the front for projectile damage.",
        "score": 60,
        "url": "https://v.redd.it/b01s9t3h138d1",
        "content": "",
        "num_comments": 44,
        "comments": [
            "Hello /u/npatel0713! Please reply to this comment with the following information to confirm the content is OC\n\n* What country or state did this take place in?\n\n* What was the date of the incident?\n\n* Please reconfirm that this is original content \n\nIf you are unable to reply directly to this comment, please leave a standalone comment in your thread with the requested information.  \n\nIf you fail to answer these questions, your post will be removed.\n\n\n \n ------\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IdiotsInCars) if you have any questions or concerns.*",
            "Why was the truck with the load still in the passing lane when being passed by vehicles on the right?  At some point you need to drop your ego, slow up, and move over.",
            "Truck driver towing shit in the left lane who intentionally wouldn’t let somebody in front of him after they clearly showed intention.  Why do people have such fragile egos?  Now you got a fragile truck dummy, feel better than that guy you wouldn’t let pass you?",
            "In many states if either party contributed to the accident, then they are liable for the accident.  The Mercedes driver looks to be the one who caused the accident, but it could be argued the truck driver sped up to prevent the merge and wasn't moving forward in the passing lane.  They both could be deemed at fault and liable for damages.  \n\nIMO both were being dicks and paid an unfortunate price.   Worse, they put others at danger too.",
            "Both of them are being idiots",
            "The truck driver at pretty much every moment of that video. He deliberately rammed the white car after it had already fully occupied the lane. His little landscaping business just came to an end.",
            "hard to judge speeds, but it looks to me like the white car was fully in the left lane, and maintaining a constant speed when the truck tried to accelerate around him. I'd argue the white car made a risky decision, but both legally and ethically the truck caused the accident.",
            "I blame the truck that shouldn't have been in the passing lane in the first place.",
            "Id put both at fault, as has been said by others. Truck with small peepee energy not letting the white car get in front but white car for being aggressive in trying to move over",
            "Obviously the white sedan, even though I personally would have let him through because it was absolutely obvious what would happen. They literally announced they'll do something stupid so let them be stupid in a way that doesn't involve a lot of stress.\n\nThey may get a new truck and trailer but it surely won't be worth the pain and paperwork.",
            "Nooooooo, where is the rest of the video? I wanted to see that truck crash & burn!",
            "The white sedan is at fault. The truck driver was a bigger idiot for playing FAFO while camping in the left lane with a trailer.",
            "Mercedes driver is at fault for initiating a turn lane when it’s unsafe to do. \n\nYes the truck speed up to block but the law is clear you cannot initiate a turn while unless it’s safe to do so and it was unsafe to do so. \n\n\nNow. Insurance companies would dictate liability. Without video Mercedes is 100% at fault. With video the insurance companies would off the Mercedes driver would argue 50% fault.",
            "By the damage alone and no witness, the truck woukd be ruled at fault since he hit the sedan in the back at highway speed.   \n\n Not sure what tge truck thinking he owned the highway, did not let the sedan switchlane and then failed to apply brake. Hitting other in the back would be ruled agaist his favour, and the camera video does not help the truck either.\n\nDickhead deserved the wreck himself made.",
            "It's hard to tell for sure based on the angle.  To me, it looked like there was enough room for the white car to merge in but not enough for them to safely do so.   However, the truck driver saw the car trying to change lanes and sped up to prevent them ultimately causing the accident.   \n\nSo \"technically\" I think the truck caused the accident.  But legally, they're probably both at fault.",
            "White car deliberately brake checks the truck as revenge for blocking it. The truck is an idiot, the white car is criminal. \n\nThe car should be 100% liable, but the truck fucked around and found out. Two idiots, one criminal.",
            "Tiny penis syndrome.",
            "Would be 50/50 for me. Mercedes does a reckless maneuver but the truck has no intention of stopping to avoid an accident, he takes the shoulder and ends up colliding.",
            "Stupid left lane camper.  They are always trucks hauling a trailer too.  If you drive a truck and are hauling something in a trailer and left lane camping you're a freaking moron.",
            "Both are idiots, not sure about fault. Truck was blocking that lane and needs to move over. White car was wrong to try and aggressively pass on the right and force it. Looked like the truck refused to let him though, so there was aggression on both sides.",
            "Just some context for this area...The exit sign they pass just before the accident is actually a left exit. Another mile or 2 after that this highway splits, left lane north, right 2 lanes east. \n\nSo in this area some slower traffic is using the left to exit not the right.",
            "Arrested for trash music",
            "They’re both a pair of knobs. Truck hogging the passing lane, the white car trying to merge when it’s not safe to do so, the truck refusing to make room - two dickheads acting like dickheads and working together to cause an accident.",
            "Probably a 70/30 fault on the Mercedese to truck. Truck was speeding up and not letting the Merc in (probably not wanting to be cut off) and did not do anything to evade the crash. \n\nMerc obviously threw himself into the lane with no regard for the other person just because he wanted to get somewhere a little faster.\n\nLegally, it is the Merc's responsability to merge safely and not knowingly take out other cars.",
            "White car forced its way across. Truck could’ve done something to prevent a collision, but it wouldn’t’ve happened at all if the white car showed a bit of patience",
            "I blame society. That rap music sure is offensive! /s",
            "Welcome to Missouri, indeed!",
            "But then the other person wins! /s",
            "This is my take too. Yeah, left lane campers are annoying. That’s no reason to escalate.",
            "but why did the truck start to accelerate?",
            "or if the truck wasn't left lane camping",
            "They have a small penis.",
            "You know why.",
            "Did they start to accelerate? I can't tell if the truck speeds up or if the car slows down.",
            "Hard to tell, they may have still been accelerating, may have been pissed by the mercedes. If you look at the traffic in front of the truck, they get slower and then faster again. \n\nLegally speaking, if you change the lanes and cause an accident you're usually at fault, so the most the truck could get in my view is partial fault.",
            "because the white car made it slow down (you see it lose contact with the car in front and it) and was trying to recover speed",
            "the white sedan pulled alongside the car to his right."
        ]
    },
    "Gotta love Charlotte drivers [oc]": {
        "title": "Gotta love Charlotte drivers [oc]",
        "score": 294,
        "url": "https://v.redd.it/h99k7gq3oz7d1",
        "content": "",
        "num_comments": 41,
        "comments": [
            "Hello /u/Young-Jerm! Please reply to this comment with the following information to confirm the content is OC\n\n* What country or state did this take place in?\n\n* What was the date of the incident?\n\n* Please reconfirm that this is original content \n\nIf you are unable to reply directly to this comment, please leave a standalone comment in your thread with the requested information.  \n\nIf you fail to answer these questions, your post will be removed.\n\n\n \n ------\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IdiotsInCars) if you have any questions or concerns.*",
            "If it's anything like Toronto, they thought you were trying to jump a few spots by using that lane",
            "Wait and see what happens on I-85 till it rains:)",
            "That guy is clearly upper management material.",
            "My guess, people hit that lane and then cut back in, dude is probably tired of it. Saw you driving up, decided to not let it happen to him. Road rage makes people do stupid stuff",
            "Alan Parsons. Nice music, lad.",
            "That driver ought to be retested",
            "Omg, I asked out loud “what the fuck are you doing??” as if I were OP.",
            "Solution:  forward mounted gun turrets.",
            "I have yet to meet anyone from the Carolinas with an IQ above room temp 🤣😂",
            "Independence is truly the Wild West.",
            "Great song.",
            "I was in your beautiful city the other week. One gripe: I noticed a LOT of people don't use their turn signals. Also a tree fell on a power line and knocked out power to my hotel but that can't be helped.",
            "74 is a damn nightmare, i see this type of crap every day. The on ramps to 74 have between 50 feet-5,000 feet of merging lane space, it's insane how inconsistent it is. \n\nI'm about to take this route again tonight, i guarantee i see some shit.",
            "So are Dashcamers now the new Social Media Influencer platform?\n\nPeople with Dashcams always seem to be **On** now, like they're hosting their own Live Stream Reality Show or something.\n\n*\"Someone made a simple driving error, I will narrate this experience and post the footage on the Worldwide 🌐 Web!\"*\n\nBecause no one's GPS ever glitches out; people don't just gets lost or make wrong turns, right?\n\nLet's have an entire Online Community where we scrutinize the petty driving miscalculations of other commuters and drag them over the coals.\n\n🙍‍♂️ ***You have made a Driving error!*** ✊",
            "You are American, why didn't you put a few bullets into his rear quarter panel to learn him a lesson:?",
            "Be easy on the guy, his wife was giving him directions",
            "[deleted]",
            "Cam driver is also a moron.",
            "Who is she?",
            "And they aren't the highway patrol, so they can fuck off trying to govern the roads.",
            "I heard the road markers become more visible the harder it rains!",
            "Yeah, too close for missiles",
            "Celsius or Fahrenheit?",
            "How? I let him in no problem and only honked once he hit is brakes hard to merge back in.",
            "Ironically the cops would ticket them for that.",
            "For newer and well maintained roads, yes.\n\nUnfortunately a big portion of roads in my town (Not in NC) don’t have that ability, which can’t stop people spinning in the rain either……",
            "Kelvin",
            "Rethink",
            "You drive super aggressive and learn what a solid white line means...",
            "What am I missing? He’s asking if it’s 20 or 68? It’s just adding to the joke yeah? Clearly both are hyperbole as they’re both in the mentally disabled zone.",
            "I checked before I merged and you are allowed to cross solid white lines. I was not aggressive, I gave him space to get in as soon as I saw him crossing over.",
            "Exactly, it sores not matter if it’s Celsius or Fahrenheit, both are bad. I said rethink because it’s a stupid question that I didn’t think needed explaining but I guess the Reddit iq sits around room temp",
            "Like I said you drive like a douche canoe. Crossing solid white lines is illegal in most states for a reason. If it didn't matter there wouldn't be a solid white line. People like you are also part of the problem.",
            "It wasn’t a question at all. It was a joke in the form of a question.",
            "It’s not illegal in any state in the entire country. I also checked before I merged and there was nobody. Doesn’t sound like a problem to me."
        ]
    },
    "This exit keeps getting closed off and it’s hard to see til it’s almost too late. Close call. [OC]": {
        "title": "This exit keeps getting closed off and it’s hard to see til it’s almost too late. Close call. [OC]",
        "score": 469,
        "url": "https://v.redd.it/a9hmqtlgry7d1",
        "content": "",
        "num_comments": 52,
        "comments": [
            "Hello /u/No-Understanding-980! Please reply to this comment with the following information to confirm the content is OC\n\n* What country or state did this take place in?\n\n* What was the date of the incident?\n\n* Please reconfirm that this is original content \n\nIf you are unable to reply directly to this comment, please leave a standalone comment in your thread with the requested information.  \n\nIf you fail to answer these questions, your post will be removed.\n\n\n \n ------\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IdiotsInCars) if you have any questions or concerns.*",
            "That's dangerously bad traffic control. Write a complaint email to the State dept of transportation citing lack of \"advanced warning\" for that night closure. But if you want faster results. Post the complaint on the state's dept of transportation Twitter (x) page with this video.",
            "Almost ran over a state trooper one time because of shitty construction signage like this. \n\nThere were no lights at all, except for him standing in the middle of the off-ramp waving his flashlight. Not NEAR ENOUGH lighting to protect him. Super lucky I didn't become a felon that night! 😱",
            "Wow, whoever designed that is really not smart.. But you definitely gave that guy enough room to get back over. He must've REALLY wanted to get off that exit LMAO.",
            "New found glory YouTube binge has been uncorked.",
            "I ran into this in Minnesota. I was super on the ball, unfamiliar area, paying total attention and yet I was caught like this. No room for the merge, wtf, fortunately a trucker with his superior visibility and probably local knowledge saw my problem and slowed way tf down to let me in. I was towing, too. Just piss poor design and no taper to condense the traffic.",
            "So wait, who's the idiot in this situation if the shit is hard to see until you're right on it?",
            "NFG!",
            "I don't understand who's the idiot here. It's just a bunch of people on the road getting caught out by a terribly announced exit closure and getting in each other's way.",
            "Next time, please only include one audio source....\n\nI can't stand this auditory assault",
            "Why the fuck are you screaming",
            "Nice song. Always liked new found glory",
            "New found glory playing in the background",
            "Look at you honking at that car as if you didn't make the same fucking mistake",
            "I'm sorry but are you yelling at the car ahead or the car in the middle lane? Because you really have no right to call the car in from tof you an ahole. You already admitted you were about to take the exit yourself, that it is confusing and hard to see. The guy in front of you tried to get away but for blocked in by the car in the middle lane (and even if he wasn't actually blocked in, seeing those headlights in your mirrors at night makes it look like they're right next to you regardless).\nThen you too proceeded to lock him in that lane.\nThe car in the middle lane had the chance to move over to the left and give him an escape. You had a bit less space with the car passing but still he had nowhere to go.",
            "Gotta love the idiot that takes the exit anyway lol",
            "OP, what are you trying to do? Were you thinking to get off at the exit or trying to pass the car in the middle lane using the right lane?\n\nEdit to add: Obviously the people downvoting me thought I was being snarky. I wasn’t. It was a real question trying to understand what was happening because OP moved to the right lane and seemed to speed up a bit and then was behind the other person that had stopped and was cursing at what seemed like the other car. It’s dark and confusing.",
            "That's not hard to see at all. The giant blinking left arrow sign is clear as day",
            "Was it an emergency closure (that time)? There are flashing blue lights (only emergency vehicles are allowed to have those). As well as it looks like that closure may be in the process of setup. Even then, there are standards and pre warnings that should be down way behind (1500 feet).",
            "Pretty sure they probably cover the traffic on the local news. I had to start watching because there’s always some bs in my city",
            "Yup…bug the state DOT.  They will (hopefully) handle it.  And if they don’t I guess you have yourself a news story to write lol",
            "State DOT are the ones who had to approve the TCP in the first place. If they approved this plan, they’re not doing their job. If this was not the approved design, the contractor is not doing his job, and the state needs to take his license.",
            "I almost tested the reboundability of several [reboundable posts](https://www.trafficsafetystore.com/road-markers/urethane-delineator-posts) in a setup like this. There was no notice, just posts...and then, similar to this, a single flashing sign behind them.\n\nI was driving at night and there was no one else on the highway, which hilariously played into my near-annihilation of the posts. No other headlights, no drivers moving to avoid them. Essentially zero warning. Better than a Jersey barrier, I guess.",
            "It’s a 50/50 for bad design or bad execution.  It’s not possible to tell which went wrong without looking at the traffic control plans.  I’m gonna lean on the side of poor execution. No engineer worth their salt would approve a plan showing what was done here (also the traffic control designs are super modular…it would honestly be hard to screw this one up…all you have to do is pull the right standard detail outta the book).\n\nIf there were to be a serious accident due to this type of design error the EoR would probably be sued into oblivion and could face some serious professional consequences.  The same could be said for the contractor if they aren’t following the design plans.",
            "Pregaming for Riot Fest but that’s another sub lol",
            "🙈 my bad, I didn’t think audio was attached!",
            "They swerved around a barrel and came back onto the roadway. If you check out the bottom half, can see them cut back over after OP drives past them.",
            "I was trying to exit.",
            "Probably should have put the arrow before the cones though",
            "The trucks with the flashing arrows had blue lights on them. There might have been a cop car ahead of them but there are not any emergency vehicles.",
            "I actually work for local news :) (I was on my way home from work at the time) We’re in a big metro area. We don’t cover unless there’s a big fatal crash that completely closes the freeway and causes miles long traffic.",
            "Why were you downvoted? You were expressing distaste with how the govt handled the thing, which im pretty sure everyone here agrees with.",
            "This is absolutely an engineering fuck up. The signage should indicate EXIT ONLY but it doesn’t. Had they done that, they could put a construction orange CLOSED over ONLY resulting in EXIT CLOSED without having to redo the sign. But, they chose not to have the EXIT ONLY in the first place which is bizarre.\n\nNext up is that they should have more digital message board signs earlier indicating the right lane and exit are closed ahead. They also shouldn’t close it so close to the exit, they should give more room, for cases like these. \n\nAnother thing that would help are larger more visible barriers, like these:\n\nhttps://www.awpsafety.com/equipment/barricades-cones-and-drums/\n\nThe largest one there is often placed several in a line, at the point where the exit lane physically departs the roadway so as to “close off” the exit lane. And the tall narrow rectangular ones can and should be placed in a less steep angle, therefore longer and a more gradual taper moving traffic over. Less sparse and more of them too. \n\nThis whole thing reeks of cost savings. I don’t blame the person here.",
            "I can appreciate you were listening to NFG though",
            "Now that I listened to it, it’s actually pretty clean for editing it “deafly”💀gotta give myself props for that lol",
            "Ah, I didn’t see that at the end",
            "But you can't it's closed!",
            "Ah. I was so confused! That’s frustrating. We have an exit near us that’s going to have overnight closures for the next few weeks. I wouldn’t be surprised if we see some of this.",
            "That's not how any lane closures are designed to be though. The arrow board is always behind the barrels, but in this case, there weren't nearly enough barrels or upcoming signage to warn for this",
            "Lol that’s crazy it might end up being one with that poor construction signage",
            "Eh I don’t ask why anymore 😂",
            "How on earth do you think this ever got approved if you’re so certain it’s an engineering mistake? People act like engineers can put anything on a plan and stamp it, and the powers that be will just approve it cause it’s stamped. The state has the final say here, and their permitting process is RIGOROUS. If the state review agency is approving plans like this, it’s time for an audit and a lot of people are going to be finding new jobs elsewhere.",
            "I don’t blame “the person here” (not sure who you are referring to tbh…op is the driver, not a road worker or engineer…they can’t reasonably be at fault).  I’m saying the GC or the design engineer is on the hook for creating an unsafe condition on the road.  It could be either, we can’t know just by looking at the road.  The GC could be doing exactly what the shitty engineer put on the plans. Or the shitty GC could be cutting corners on safety despite the plans calling for more robust safety measures to be used.\n\nThe exit only thing had me confused until I realized you might might be talking about the EXIT OPEN sign that usually comes after the arrow board that is swapped for EXIT CLOSED if the exit is temporarily closed.  I agree…that is yet another sign that is missing from this traffic control scheme. And yeah…the cone taper is way too short for a full lane closure…these are just more logs to put on the fire.  If the plans called for a taper like that the DOT would not approve the plans (unless they fuck up the review too).\n\nWe can’t know for sure who fucked up without looking at the approved design plans…which is a good reason to call the state DOT. They will have the official copy of the approved plans, and they will usually send an inspector out to document and determine out how to make the work zone safe for everyone…which I assume is everyone’s goal here.  I apologize if my jaded opinion on contractor behavior came off as standoffish...got burned pretty bad on a job a few months ago by a devious GC and I’m still salty that I let it happen.",
            "It’s very confusing! It’s open one day then closed the next, never know until I’m feet away! The highway just opened up a couple months ago so I guess they’re still tweaking some things around there.",
            "How rigorous probably depends on the state…but yeah…DOT engineers are quite thorough from my experience…and occasionally painfully slow…but I guess that comes with the task.  Being thorough and fast is a pretty unrealistic ask.",
            "How do I think it’s possible? I know it’s possible. I’ve seen multiple states approve some pretty dumb things. Engineers and engineering managers are people too and make mistakes as well. \n\nBut we have a best practices system to look upon: https://mutcd.fhwa.dot.gov/htm/2003/part2/part2e3.htm\n\nYou can see here at 2E.33.B the EXIT ONLY is required. \n\nBut you’re really going to argue this is safe and compliant with standards? This isn’t matching RIGOROUS, exit only lanes getting EXIT ONLY is basic stuff.",
            "Yeah sure, where did I say it’s safe and compliant with standards? If anything I said explicitly the opposite. You’re trying to blame engineers for this design when I 100% guarantee you the engineers responsible for this followed every best practice and municipal/state requirement they were subjected to. You just don’t get permits without it, full stop. \n\nLook at the regulatory agency if you want someone to blame, because your underpaid civil engineer sure as fuck isn’t trying to endanger people."
        ]
    }
}