{
    "22 June 2024 - Weekend Chat Thread": {
        "title": "22 June 2024 - Weekend Chat Thread",
        "score": 10,
        "url": "https://www.reddit.com/r/indonesia/comments/1dlikgk/22_june_2024_weekend_chat_thread/",
        "content": "Yo, Vulcan is here, annual Chat Thread series creator since 2016 ~~and a massive weeb~~\n\nSo, welcome to the Weekend Chat Thread of r/Indonesia. Unwind your mind and enjoy the weekend goodness!\n\n**24 hours a day/7 days a week of chat, inspiration, humour, and joy! Have something to talk about or share? This is the right place!**\n\nHave fun chatting inside this thread, otsukare!\n\n^(Questions) ^(about) ^(this) ^(post?) ^(Ping) u/Vulphere",
        "num_comments": 703,
        "comments": [
            "&#12300;&#129309;&#12301; [DATING AND FRIENDS SEEKING QUARTERLY THREAD (aka indor4r)](https://redd.it/1ciuzsu)\n\n&#12300;&#128162;&#12301; [Monthly Rant/Rage Thread](https://www.reddit.com/r/indonesia/search?q=monthly%20rant%2Frage%20thread&restrict_sr=1&sort=new)\n\n&#12300;&#9978;&#12301; [Campfire Corner](https://www.reddit.com/r/indonesia/search?q=campfire%20corner&restrict_sr=1&sort=new)\n\n&#12300;&#127776;&#12301; [Count Your Blessings Thread](https://www.reddit.com/r/indonesia/search?q=count%20your%20blessings&restrict_sr=1&sort=new)\n\n&#12300;&#127384;&#12301; [Help, I can't access Reddit!](https://www.reddit.com/comments/12p08sr)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/indonesia) if you have any questions or concerns.*",
            "kadang randomly my brain goes positive and said\n\"damn you lived for this long alone... that's actually quite impressive\"\n\nbuat yang hidupnya solo... this is a random pat in your back post\n\n'you're amazing, good job living this far'",
            "# 🤓\n\nhttps://preview.redd.it/bfjgbjnnr18d1.jpeg?width=1052&format=pjpg&auto=webp&s=34d583ad7ec5eb0bb18647ffcbca440d548f1c29",
            "yo update omg sama dokter udah di acc bisa pulang, karena resiko kena infeksi bawaan dari rs juga kan, tapi sayangnya ibuku harus terus pake selang hidung untuk makan, repot sih karena kalo konsumsi susu terus jadi diare 😫 gimana bersihin kalo ibu aku mencret pas aku kerja???????? Ribetttttttt bgt anjay.\n\n. . . . . . . . .. ..... ....... ......... ........... ..........\n\nunrelated, tapi tadi ada oknum yg mention thirst trap hmmmmmmm udah deh IM NOT A COWARD!!!!!!! ni fotonya! ga se thirst trap itu juga karena aku cuman mau pamer lengan aku yang kelihatan lumayan berotot, belum hasil pump ya, naturalnya emang gitu 💪🏻 not bad for someone who doesn't go to the gym\n\nhttps://preview.redd.it/6gl685rel28d1.jpeg?width=4160&format=pjpg&auto=webp&s=0e41fe849321d1c0d5ce9f7045749a74a161549a",
            "Bocil udah mau mulai play group. Emaknya udah mulai cari lunchbox.\nBapaknya lagi sibuk cari resep bekel anak yang lucu-lucu.\n\nRibetnya sekolah di sekolah yang agak mahal ternyata ada di persaingan gengsi ortu (baca ibunya murid).\nI have never thought kalau tas bocah dan Lunchbox itu harganya bisa mendekati sejuta.",
            "\" **Your accuracy on this task was** **0.00%.\"**\n\nOk then, terus mana aja bagian yg harus dibenerin?\n\nError Summary: \\*kosong\\*\n\n# JANCC KAYAK CEWE AJA DIBILANG SALAH TP PAS DITANYA SALAHNYA MANA DISURUH MIKIR SENDIRI NGENT",
            "https://preview.redd.it/g513luwqu18d1.jpeg?width=720&format=pjpg&auto=webp&s=83b190ba22fd956e50fd8dda5c5b03e97fbe84ec",
            "Can MyTelkomsel dev stop changing their UI every fucking month. Kinerja mereka diitung dari berapa kali UI apa gimana si.",
            "2024 barely reached it's half point\n\nme: 2025 is my year",
            "Please meet Junimo and her best friend - Dorito. Moments before this photo is taken they were told that they are not allowed to drink water straight from the hose. Anymore.\n\nhttps://preview.redd.it/ye8busf1u08d1.jpeg?width=2736&format=pjpg&auto=webp&s=f20bdf79709342f512036d422bb569e59b559b30",
            "Nomor ga dikenal cmn ngechat \"assalamualaikum\" atau \"selamat pagi/siang/sore/malam\" dan ga memperkenalkan diri ato ngasi tau tujuan ? \n\n\nEnjoy your stay in the read hotel. ",
            "ada yang ngerasa kalo beli hape baru udah gak se.. \"excited\" waktu dulu? sekarang kalo gw beli hape, apalagi android, gw pasti set up hapenya sama seperti setup gw sebelumnya, udah terbiasa tapi downsidenya jadi gak ada yang \"baru\" kecuali jeroan didalamnya karena bentuk luarnya pun 90% sama: slab\n\nOS didalamnya pun cuma re-skin android yang kadang malah ngegacha soal performa dan fitur dasar (apalagi kalo hape murah)\n\ndulu yang suka gonta ganti hape ampir tiap tahun, sekarang malah adem ayem nyaman dengan 1 hape bertahun tahun...\n\nzaman nokia & sony ericsson yang tiap hape bentuk luarnya beda, dan isi OS didalamnya juga beda, jadi waktu beli agak semangat dan penasaran buat diubrek-ubrek isi fitur fiturnya, inget dulu ada MusicDJ di SE atau Composer di Nokia jadul (ada app yang ekuivalen?).\n\nkarena gak ada yang namanya \"apps\", tiap hengpon biasanya sangat terbatas dalam fitur, jadi tiap hape baru pasti dicari tau dulu ada fitur apa aja, sekarang selalu \"there's an app for that\"\n\nudah ngebosenin, gak tertarik juga sama fitur AI (both **A**rtificial & **A**pple)",
            "duit koin jadul dirumah (100, 50, 10, 5 rupiah)\n\nhttps://preview.redd.it/6jv1rz6ug28d1.jpeg?width=3123&format=pjpg&auto=webp&s=0b7240f27abd25f351aaad2796fbb4c057bfdaa6",
            "Controversial opinion regarding masa bersiap:\n\n>!kalo dulu orang belanda nggak dibunuh/diusir dan perusahaan belanda nggak dinasionalisasikan kemungkinan Indo bakal bernasib sama seperti brazil/afsel dengan tingginya inequality dan tingkat kejahatan!<",
            "Kemarin2 ada yang katanya mau post foto thirst trap, dan ada juga yang mau post foto biar dapet komen horny. Pada ke mana janjinya?",
            "Big mood\n\nhttps://preview.redd.it/0rorrqnms18d1.png?width=1080&format=pjpg&auto=webp&s=fe87dc6456c6cd988e49e7bb2b8f03f74f83154b\n\nHappy weekend Komodos",
            "Sehari-hari commuting & aktifitas ke daerah 'kota', demografi pengguna jalan juga orang 'kota' atau commuter Jakarta: jarang menemukan pemandangan cringe.\n\n\nSekarang, sudah 2 mingguan aktifitas di kabupaten, ke daerah industri. Ternyata, stereotip itu memang muncul karena sebab. Demografi pengguna jalan, membuat saia lebih dekat dengan Tuhan & meningkatkan rasa syukur karena diberi berkah dijauhi dari cringe. Sungguh pengalaman membuka mata. Entah mengapa para bang jago nan keren itu berlomba-lomba membuat 125cc-150cc mereka bersuara bagai anjing kesakitan & tidak pernah rela ada yang mendahului mereka?",
            "Sedihnya jadi bini gue\n\n- udah karir promosi gak ada cuman gara gara lulusan D3 doang\n\n- susah dapet gawean gara gara lulusan D3 doang (kemaren ada lagi perusahaan yang terang terangan nolak dia jadi inventory controller dengan ngemeng 'bu, kalo lulusan diploma 3 aja disini gak bisa buat pegang posisi management' - ada yang bisa jelasin gak kenapa banyak perusahaan punya pola pikir 'bagian managerial harus dipegang ama sarjana'?)\n\n- dapet bos yang 11 12 ama sebelumnya juga pula (bosnya yang dulu : ex bumn tapi kagak bisa forecasting, budget control, generate report ama buat laporan pembelian, sekarang : pengalaman cuman 6 bulan f&b admin dan sama sekali buta soal kerjaan financial controller - alhasil dia, account receivable, bookkeeper ama purchasing yang mesti ngecarry bosnya lagi lol)\n\nLmao",
            "mau masukkin temen-temenku ke dalam rap group ini\n\nhttps://preview.redd.it/qsxxf2k2g18d1.png?width=606&format=png&auto=webp&s=8ed1d5755c2164ac5f59fdabe8e86360cbfe8179",
            "Kontol bergetar disentuh dia \nMataku terbang  sampai ke Langit ",
            "when risotto nero found my reddit account \n\nhttps://preview.redd.it/72h1olj0328d1.png?width=742&format=png&auto=webp&s=45bed93e3cfad92ba2cdd4c69a7fc872ec1f5407",
            "mereka bilang diriku tak berguna tp sejak remaja ku tak pernah meminta🤑😎🤙🏽🤙🏽",
            "makan indomi sebungkus: anjir apaan ini dikit amat, besok up lah dua bungkus pas laper2nya\n\n\nme this morning eating 2 indomies+2 eggs: ampun bang mo muntah, ya Allah maafkanlah hambamu yang serakah ini",
            "akhirnya setelah lebih dari 10 tahun ga beli beras, hari ini beli. sedih banget lek",
            "Friend is at Hublife, and they just posted a pic of a durian Detroit-style pizza in the group chat.\n\n\nI'm all for fusion food man, but seriously what the fuck? ",
            "Capek bgt pemagang indonesia yg aku handle ada yg dah 1,5 th di jp tp ga bs bhs jp samsek. Nama alat2 yg dipake tiap hari ga hapal. Disuruh nyatet katanya udh nyatet tp catetannya kecuci di laundry. Bhs jepang masih ga bs malah ngebet ngajak makan di luar sama ngebet minta telp hampir tiap hari. Bilangnya ada masalah di kerjaan jd kuangkat. Klo udh kuangkat malah cerita mantan pacarnya hadeh ga penting bgt, ngabisin waktu. Ditanya masalah kerjaan yg dimaksud ap malah menghindar. Skrg aku slalu nolak klo dia minta telp. Waktu buat istirahat jd kebuang percuma.",
            "Mana thirst trapnya k u/ikinaosu",
            "https://preview.redd.it/rymktwryt28d1.jpeg?width=1080&format=pjpg&auto=webp&s=c7e41b41f9717b2b7a3ff2521412366880d018d5",
            "Going through a painful heartbreak. I did everything I could and still crash and burn at the end.\n\nI am tired of all of these. Ranting in Reddit didnt help, people just mocked me more over it.\n\nFeels like God is having fun watching me in pain",
            "tadi sempat ngedown, gatau kenapa tapi tiba tiba aj gitu. Abis makan sate jadi senang. Sesederhana itu, sate emang enak banget sih dari dulu makanan kesukaan tapi semenjak kuliah gapernah makan lagi karna dirasa porsinya kurang banyak.",
            "Pagi ini ngabisin 30 menit jatah screen time untuk sosmed cuman untuk mendebat orang dongo di fb, smh.\n\nKirain mau ngajak diskusi ternyata emang dongkol yang mau dunia jalan seperti apa yang ia mau beneran cuman mau denger apa yang mau dia denger, jadi ngerasa buang buang waktu.\n\nPadahal jam segini biasanya udah abis 2-3 kelas digital marketing gw, jadi ketunda gegara mendebat orang dongo..",
            "Morning!! Hayo tebak siapa yang jam segini baru bangun dan belum cari sarapan + mandi tapi jam 9 ada acara keluar? \n\n>!Yang jelas bukan gua, gua mau lanjut bobo lagi guys!<",
            "cuapekkkkkkk sekali omg, tadi malem ibu rewel sampai setengah enam pagi",
            "Oke, sudah cukup tidur, sudah sarapan  \nSaatnya main DLC elden ring sampe besok malem",
            "rontok mulu bgt perhaps botak soon",
            "Sundried tomatoes is man's best invention.\n\nhttps://preview.redd.it/muzq21vnn18d1.jpeg?width=1600&format=pjpg&auto=webp&s=5a86341d99e3fca948052ca0a34f803379eaf802\n\nSerius, Klo lg ada duit beli deh 1 toples. Irit kok pakenya cause it just gives a BURST of flavor. Dan ga akan expired. Klo lagi bokek tinggal potong kecil2 trus dibikin nasi goreng ato pasta gini. Pake minyaknya si sundried tomato omggggggggggg gw mah lbh doyan gini drpd carbonara ato lasagna.\n\nThis fucking rocks.",
            "Bangun tidur udah denger kabar ga enak\n\n>!ponakan ceritanya coming out. Dia masih smp, keluarga dia lagi bangkrut banget sampe butuh buat pulsa aja pinjem ke gw, anaknya yang paling tua masih nganggur. Gw ga kebayang sumpah bapaknya emang banyak dosa banget cuman tetep kasian juga lagi berusaha balikin keadaan ekonomi malah di bomb kayak gini.!<",
            "Sedih banget uda pengen maen DLC di akhir pekan, malah disuruh kerja sesuatu yang \"urgen\" 😥\n\nAkutu pengennya kerja buat hidup, bukan hidup buat kerja.",
            "Anjr takut bgt... Gue ketiduran terus mimpi kalau gue keterima kuliah itu sebenernya boongan. Sebagai anak gap year itu mimpi paling menakutkan anj, untung cuma mimpi 😭",
            "Pas balik ada orang cekcok di TJ ...",
            "Seeing a wedding where I know both the bride and the groom and their story how they become together hits really different. The happiness I felt watching them officially tying the knot is incomparable. It's like reading a happy ending of a romance manga but this time it's not gonna be an ending because I know I'll be blessed with more stories that might or might not make me envious of them and want to get married as well.",
            "It's crazy reading a very old forum website and seeing the timestamp. I saw one posted in like the year 2004. WTF. I was only 2 y.o back then man.",
            "Dulu sempet baca ada yang bilang Joko Anwar anti-critics.\n\nSetelah lihat responnya dia soal Nightmares and Daydreams di x, akhirnya gue paham.",
            "Manusia itu gampang ditebak kok, manusia  motivasinya cuma berdasarkan 2 ini aja:\n\n1. Menghindari rasa takut.\n2. Mencari dan mendekat dengan rasa senang.",
            "kamis lalu bete bgt pingin marah so i took it out on my stupid class and was being super mean to the presenting groups with the neverending questions and it felt good 😈 will do that again (kalo mereka mau balas dendam pun gpp ayo kita ribut aja i am sickkkkkk of u all) (not u)",
            "Ada yg ke GBK pagi ini?",
            "Good morning dan happy weekend gengs!!\n\nJangan lupa untuk mencintai diri sendiri. Kalau kata Mbak Whitney \"[It Is The Greatest Love of All](https://youtu.be/IYzlVDlE72w?si=FA65DLy8zcTVjfax)\"",
            "Lagi cari obat tidur yang pernah dikasi orang g ketemu2\n\nTerus gua bikin oralit sendiri",
            "the next 2 weeks are going to fry my brains out, and my body just decided to get a fever. smh",
            "Sialan, kena religious ocd yg tiap saat selalu mikir dosa secara detail bahkan yg belom terjadi. Meskipun gua udh gapeduli tetep aja pikiran ini muncul secara otomatis. Adakah yang pernah ngalamin hal ini dan tau  solusinya.",
            "ujan dgin",
            "https://preview.redd.it/ryfqlpnt518d1.jpeg?width=980&format=pjpg&auto=webp&s=d1db00d8d36a4fc71f719ac065816d9ca5508947",
            "Guys, pendapat kalian soal dunia cosplay di indonesia?? kenapa sih image mereka itu kalau gak \"wibu cabul\" sama \"mesin drama\"?",
            "meja kasur mahal juga yh",
            "Ada punya pengalaman ngasih month/weeks notice buat resign dan gak dapet bonus/insentif kerjaan? Kalau THR sih gua denger banyak tapi bonus kerjaan?   \nIni common practice gak sih?",
            "Mau mutasi sekaligus balik nama motor dari jaksel ke dep\\*k, kira-kira langkah-langkahnya bisa cari tau di mana, ya?",
            "wiken ini galau resign aja sambil ambil certification (lagi ada beberapa proses interview), apa gabut aja di kantor nunggu lay off yang diulur2 kantor karena ga punya duit buat bayar pesangon.",
            "sakit cuma karena lupa pake selimut semalam-_-",
            "Best sleep ive had in a while 🥹 (baru bangun) (tidur 11 jam)",
            "Kenapa pas lagi ga pake casing..  hp gw memutuskan untuk menjatuhkan diri?!! baru 3 bulan udah boncel2 hadehhh",
            "Use opera with it's dedicated VPN on, is very handy for reddit, no need to activate my system wide VPN  \n\n\n And I can ditch this Reddit app\n\n\n(I have 1111 and DNS too, but I tried to avoid system wide change because I have apps that I need for work that force me to deactivate any custom DNS or VPN, so I use opera DNS to localized reddit, and yes I'm aware of split tunneling)",
            "Finished episode 5 of Nightmare and Daydreams.\n\nMan, all the episodes are 10/10 till the last 10 min of each episodes. The twists are sooo bad and lame.\n\nShould have used less CGI and more grounded twists.",
            "https://preview.redd.it/hvn84bcs938d1.png?width=717&format=png&auto=webp&s=2b4395f8d72f40b507a4db96f863d44c679cc577\n\nAnjir udah keluar aja crackannya",
            "abis liat videonya bapak rizik yg jelasin kekurangan dokter karena biaya mahal\n\njadi kepikiran, ini yg jelasin isu isu politik ke akar rumput tuh emang golongan kanan konservatif religius ya wkwk, entah rizik cs atau pks\n\ngolongan sekuler gaada gitu yg suka gituan? golongan abang abangan kiri juga kayaknya gak masif masif amat pergerakannya di akar rumput, so called feminis juga kayaknya jadi keyboard warior doang ya",
            "\"tau two block?\" \n\n\"tau\" \n\n\"oke, itu aja\" \n\nhasil akhir: middle part\n\nfuck you...",
            "help yang di Bandung ada yg mau beli vans oldskool true white original second ga? Size 40, jual murah banget kok, desperate banget butuh makan.\n\nplease gausa bales tawarin di olx ato carousel aja, cause i already did",
            "Gua lagi di cafe sendirian stres skripsian pengen nangis terus ga sengaja denger obrolan meja sebelah ngobrolin cafe-cafe, \"gua demen di j.co, minumannya, apa itu...Joko Cino??\" (Jcoccino) pen ngakak banget anjirr makasih mba",
            "nyobain tripod buat makan, seru juga ternyata makan sambil direkam\n\nhttps://www.youtube.com/watch?v=Fs-4rPByEvY\n\n\n*update abis liat memenya: lebih efisien daripada makan sambil nonton podacst youtube (makannya bisa 1 jam an), kalau direkam beneran cuman makan aja, ga sambil ngelakuin hal lain. ngupload juga cuma 1 menit terus tinggal, karena ga pake editing dll",
            "Kampret memang polisi tidur 2 bata kecil dan tinggi. Siang - siang bolong, warnanya sama dengan jalan beton, dan mata capek. Lagi naik motor dengan kecepatan kurang lebih 20 km/h, gk sengaja nabrak, jatuh, untuk tidak terlalu cepat dan pakai helm, celana panjang dan jaket jadinya badan cuma biru - biru dan luka kecil.",
            "Ini apaan si sosmed tiba-tiba pada kodam kodim makin aneh aja ni negara",
            "Anda harus gembira! Gembira menyongsong mas adepan!",
            "Anying bosenin banget perucile",
            "Day 1 akhirnya bikin kopi lagi: \n\n*sepertinya masih gampang lapar* \n\nTunggu tiga harian kali ya.",
            "Selamat pagi\n\nhttps://preview.redd.it/wu3mmysr318d1.jpeg?width=720&format=pjpg&auto=webp&s=bc3d113bc61f6fd8371ac6cf03b5f6effe02fb25",
            "aduh gbs tiap buka laptop gw mau muntah",
            "Microwave kok rata rata output 450w ya? Itu cukup kah untuk manasin sayur/daging banyak (porsi 5 orang makan).\n\nCuma nemu samsung yg input 1150w output 800w",
            "Oalah ultah Jakarta MRT dan TJ cuma satu rupiah toh",
            "gabut banget di kantorrrr, harus tunggu smpe jam 2 terus gabut lagiii karna nunggu badminton jam 4. apa yang harus w lakukan selama 2 jam nunggu buat badmintonn?",
            "ini kenapa firstmedia gue tiba2 pake captive portal kaya wifi cafe anjir",
            "Can anyone recommend a decent jeep tour for bromo?",
            "Oh sekarang paspor berlakunya 10 tahun ya, udah nggak 5 tahun lagi",
            "guys kalo di toped misal ada barang yg salah harga trus gw beli gitu, apa bisa di cancel dari seller nya? \n\natau better tanya dulu aja ke sellernya?",
            " PRJ tu tiap hari ada kembang api ya?",
            "Gaes saran dong. Ada nomor ngga dikenal nelpon di WA berkali-kali, tapi gua cuekin karena ngga ada chat juga. Nah barusan nih orang ngirimin foto kartu angsuran gitu dengan isi identitas dan alamat yg ngga gua kenal, tapi ada nomer gua disitu. Masalahnya seumur-umur gua ngga pernah kredit atau ngutang begini.\n\nBaiknya respon ngejelasin apa cuekin/block aja ya?\n\nEdit: sip thanks udah dibloque.",
            "baru tau satu film katanya hasil dari kisah nyata selingkuh itu,, katanya sih kisah nyata,   \n  \njadi ceritanya dari seseorang istri ya, yg cerita/curhat ke seorang penulis/pembuat film (?)   \n  \ndari cerita itu, si penulis/pembuat film, bisa bikin jadi produk karya dia, cuan dong,  \n  \ndiundang atau promo ke youtuber2, youtuber nya dapet views, mungkin malah dapet ongkos marketing,  cuan dong,   \n  \nsi pelakor dan suami nasib nya gimana ya? apa mereka hidup bersama? kalau iya berarti semua dapet jatahnya masing-masing..  \n  \nkecuali si istri asli.. \n  \ntapi setidaknya, pengalaman sedihnya (kalau memang real), telah memberi rejeki dan kehidupan ke banyak orang, dan juga bahan bakar netizen buat ngata2in si pelakor yg gak tau juga siapa.",
            "Biaya penjara per napi bukannya lebih mahal ya dari bansos?",
            "Let me take that shot, disini ada orang Sungai Penuh gak? Meet up nyok",
            "Pertama kali naik mikrotrans. Bro are they replacing the car's suspension every day?? Polisi tidur diteroboss",
            "PoE2 deadfire bagus banget fantasy rpg but with guns and pirate arrr",
            "Currently using pi.ai for venting and opening full the tab to drain all of the naggimg to something that can take all of my mind with total patience. \n\nIts a pretty good chatbot, it feels more empathetic than gpt at least.",
            "Di twitter lagi rame (circlejerking) yang nuduh pedo gara2 anime baru yang istrinya jadi anak2 lagi.\n\nGw baru tau tourist jadi insult disana wkwkwkwk. Biasanya secondary.",
            "Is it wise to walk away from girl that still want to reunite with her past. Dia punya mixed feeling, nyesel nolak karena ga siap waktu itu, tapi jga gamau mantannya pergi.     \n\nGw Udah  pdkt 1 bulan, dia ramah, bales chatnya cepat, humble, mau nongkrong dimana aja, sering update kabar meski gw ga nanya. Cuma yaa i know her feelings is not real, Maybe for her is something usually to do with her friends.   \n\n Nothing wrong with her, i just feel pity for myself craving for affection, i've always been rejected before, can't let this happen again.",
            "keeping positive (or neutral, at least) is *not* ez than su'udzon+overthinking ▓▒░(°◡°)░▒▓, huh.",
            "GUYS ada pertanyaan mengenai my pussy ≽^(•⩊•≼)\n\n\\-Lemmy telinganya tuh kadang keluarin lendir dan kadang ada korengnya (image attached). ada meng kalian yang pernah ngalamin? Ingfo dong..\n\n\\-kalian biasa ke vet/dokter checkup sama pengobatan gitu kisaran berapaan? I know each case is different price but its okay\n\nThank you so much guys aku bingung mau tanya ke siapa this is my first time having ket\n\nhttps://preview.redd.it/ar1ps7w9o18d1.jpeg?width=2880&format=pjpg&auto=webp&s=b79a303f4c5c1e6b8e045a84ea5d7137b83c0f87",
            "\"Hi Farmer, I'm your secret gifter this year\"\n\n*give Nautilus Shell*\n\nAjg.\n\n> FF going to beach karena lagi \"belajar\" mancing.\n\n> Looking at 4 Nautilus Shell ready to forage.\n\nAsu kaw Shane.\n\nTaun lalu Clint ngasih Iridium Bar.",
            "Okay mimpi tadi malam is quite 'weird':\n\nSo I am 'Sensei' who is the combat leader of a semi-legal PMC of a school academy (so... My subconsciousness blended Blue Archive and Arknights into one). \n\nSo we are in this random African country that had recently been couped and then taken over by a local warlord, the country has become a playfield for lots of PMC, leftover from the civil war period.\n\nIn short, our PMC is pulling out, then one of my students said about her older sister, and she wished for her sister PMC to defect from the warlord side to our side.\n\nI agree and then personally infiltrate enemy compound (by walking above water 😂 through the river route). Met the student sister and then left them instruction of who to contact and when and where to defect. Then I left the site and exfiltrate out (guided by the AI assistant (I guess the dream version of Arona)). \n\nHowever, the warlord caught the sister and her boss and other random people, brought them to former mall turned fortress, and then threw them into a hole while waiting for a mad scientist who would use them for his inhumane experimentation of digital consciousness transfer (ended up killing the subjects however). \n\nJust then our PMC assaulted the mall - Raid style.\n\nThe dream ended when I waken up... And honestly I am still curious of how the situation ended...",
            "Aku akan pergi ke Indonesia bulan depan dan mau bicara sama orang dari Medan. Gak punya subreddit Medan dan banyak orang bicara kota ini buruk. Aku mau orang dengan rekomendasi dan experience dari Medan dan Sumatra! Makasih!",
            "selamat hari sabat",
            "FB aplikasi loadingnya aneh jadi kaya ngga dapet sinyal",
            "Ada tips gak gimana biar anggrek cepet berbunga kawan2ku?",
            "met weekend chat, mau tanya tiket soundsproject untuk 3 hari itu udah include nonton neck deep kh?",
            "Ada yg punya zojirushi gak? Untuk yg basic 0,5 liter kan spec nya 450 Watt, apakah ada yg punya pengalaman pakai di rumah 1300 Watt? \n\n\nMalas bgt kalau harus matikan banyak listrik cuma untuk masak nasi. Tapi pengen beli sih",
            "Bloodfound's fang never fail me\n\n\nNyoba build aneh\" di elden ring ujung\"nya balik ke quality build :)",
            "Kayanya zonk nih mokapot baru. Kudu isi penuh, kalo ga airnya kaga naik.",
            "plave ga usah deket2 sm perusahaan besar rumahnya bts itu bisa gak 🫵🫵🫵🫵 gw ga mau deket2 sm kpop bagian situ",
            "damn ngantuk bgt fak (lebih ke capek sih)",
            "bahasa england nya \"Kekuatan orang dalam\" apa ya?\nAda yg tau?",
            "Beli komponen elektronik di AliExpress gimana ya? Pake forwarder? Ada saran?",
            "John shelby:  Dead by tommy gun, Ironic and poetic.",
            "jakmania gini banget https://old.reddit.com/r/soccer/comments/1dl9y10/absolute_scenes_in_leipzig/",
            "Turn it up, it's your favorite song\n\nDance, dance, dance to the distortion\n\nTurn it up, keep it on repeat\n\nStumbling around like a wasted zombie\n\nYeah, we think we're free (aha)\n\nDrink, this one's on me\n\nWe're all chained to the rhythm\n\nTo the rhythm, to the rhythm",
            "banyak bacot ya kamu budiiii. gua gibeng juga lu lama lama",
            "anjir lah ni pala ada aja yg diovt smh, padahal dah kelar lho tugas menugasnya",
            "Sad ga order gomart serba Rp4970 tadi malam.",
            "anyone know how to find someone's biological parent? My friend is looking for his biological family and he only has a name ti look from",
            "u/Tukang-Gosip",
            "eleventwelfth - pala lo gramed",
            "Hari ini banyak dedek emesh di tempt gym. Ada yang pasangan cwk cwk, cwk cwk, dan cwk cwk. Baguslah, hidup sehat sejak dini",
            "gw ada laptop tua a8 4500m. barusan ganti dari win 10 ke ubuntu karena di win 10 suhu nya ga karuan, sampe 120C lalu shutdown setelah 1 jam.\n\ncek temp di ubuntu kok gini ya. apa karena ada salah satu core temp sensor nya rusak jadi windows salah mengira suhu udah panas?\n\nhttps://preview.redd.it/51lwob2tw28d1.png?width=1300&format=png&auto=webp&s=88bea989827e68e5e396c82f0f349a339a1dc3c6",
            "Tempat gunting rambut langganan kemarin tutup, semoga hari ini buka\n\nwismilak",
            "TIL kalau ternyata Agave alias Lidah Naga bisa tumbuh dan hidup di Indonesia, udah pernah dicoba jaman Kolonial Belanda.\n\nJadi secara teoritis dan teknis, bisa aja sebenarnya bikin industri alkohol macam Tequila atau Mezcal di Indonesia (walau Tequila gak bisa diklaim Tequila karena kesandung UU Meksiko).",
            "Mau gw pap di gbk entar atau foto minggu lalu di kuncit",
            "Semburanya kuat, sedotanya kenceng..",
            "Najis blok m rame bet kek tanah abang",
            "It just me? Instagram android itu drain battery banget? dan agak ngelag? Any tips?",
            "bro relx boros banget cuma bertahan 2 hari sekali pake buang dan harga catridgenya 80k anjrot, lebih mahal dari rokok konventional..",
            "halo HRD, perhitungan gaji yang dibayar itu gimana ya ?\n\njadi saya diminta bikin slip gaji kontraktor, anaknya mau kuliah, tapi syarat masuk katanya harus ada slip gaji orang tua. Nah, selama ini saya masih bingung dengan potongan pajak, BPJS, dll. Mau tanya HR kantor sendiri tak enak juga.\n\nnah, adakah yang mau berbagi perhitungan nya ? target nya dia minta 20jt nilai yang ditransfer ke rekening, itu udah bersih dari potongan dll.",
            "emang ada dompet digital yg bisa lewat web tanpa app android atau ios?",
            "tempat gunting tambut gw biasa pergi tutup semua\n\nharuskah gamble ke tempat baru?",
            "baru maen DLC elden ring. gua kira gua bakal memasak taunya malah dimasak abis abisan. damn.",
            "Bakal balik Indo, landing CGK jam 10an malem. Gw bawa good amount of snacks di bagasi, kira-kira bakal kena becuk ga ya?",
            "untuk kebutuhan nonton film sambil tiduran/nyantai + occasional pc gaming. mending beli quest 2 + upgrade gpu (pc sekarang r5 5600 + rx 580 8gb) atau beli quest 3 aja ya?.\n\nbimbang sama lensanya si, di quest 2 garis-garis lensanya noticeable tapi ya ngga ngeganggu banget kalo di quest 3 belom pernah nyoba\n\nudah pernah nyoba/rental quest 2 cuma ga suka passthroughnya. setting IPD ga ada masalah.",
            "selamat malam Chelsea van Meijr",
            "Watching sunset di tepi danau sambil duduk dan dengerin lagu, bener2 nice. Gk nyangka bisa liat sunset sih, meskipun gk perfect. Well matahari dah gk ada tapi masih agak terang. Orang2 pada sama temen, pasangan, keluarga. Me cuma sendirian wkwkwk. Tapi seenggaknya bisa ngerasain nyore di hanoi dan ngeliat warga lokal yang lagi pada nyore. \n\nYa maklumlah, budget minim so ya nyari yang bisa dikunjungin for free aja, sayang dah kesorean jadi gk bisa ngunjungin temple or museum yang free.",
            "kak, minta PAP dong. Trims.. 🙏",
            "Upah ngedit video akhirnya cair. The urge to spend them to buy 6600xt is very high, tapi worth it ga ya kalo sekarang CPUnya masih i7 4790? Idealnya sih emang upgrade semua tapi bakal abis semua juga uangnya.",
            "Ada yang akhir2 ini beli coin di reddit pake hape android? Gw stuck di sini terus, gak jalan2. Kalo pake ios sih gak ada masalah.\n\nhttps://preview.redd.it/ppjyfb7d248d1.png?width=1080&format=pjpg&auto=webp&s=0e3c3c1f05c959aec5422db66773246d1c11fd75",
            "feels weird having my hair this short again, it hasn't been this short since last september",
            "sold my ps4 fat 1000 9.00 hen, bye headache...",
            ">!”apa gunanya cantik skillful tapi depresi”!< says who",
            "jadi gw beli barang sparepart mobil di tokped 2 macem sebut aja X, Y masing masing 10 pcs\n\nwaktu udah diterima, barang yang dateng cuma X 10pcs dan Y nya ga ada sementara di resi berat nya 35kg dan waktu di timbang cuma 10kg.\n\nsetelah gw komplain ke seller, katanya barang nya kosong dan silahkan ajukan refund. tapi setelah gw ajuin refund gw cuma dapet 190rb alias harga 1pcs. ini gw kudu ngapain ya?",
            "Jadi sering liat twit yang likesnya nyampe ratusan ribu. Dikatrol Elon pake bot atau orang udah berani ngelike semua yang diliat? Sebelum tab likes di hide, nyampe puluhan ribu itu udah ajaib",
            "Kekenyangan, seorang pengangguran mengantuk",
            "Piye konsepnya ini emak2 bule, pagi2 ngegym.. terus nyebat?",
            "Ga jadi beli VGA jadi kayanya bakal beli TWS aja. Buat range harga 300-400 yang bagus apa ya? Gw baca kemaren Moondrop Space Travel bagus atau ada rekomendasi lain?",
            "Gue pengen rambut gue sefabulous rambutnya matthew McConaughehehehehe.",
            "https://preview.redd.it/kmg7vtc2k48d1.jpeg?width=720&format=pjpg&auto=webp&s=145dcf8b549983a8376f4a272671efb9dea21a6b\n\nwahh apakah si suami mulai curiga?",
            "Di Indonesia Range Rover Vogue cuma jadi pajangan di parkiran mall, di Clarkson's Farm jadi mobil angkut makanan babi wkwkwk",
            "weekend mlz",
            "pusing banget habis makan yang manis-manis",
            "Half life 2 stage Ravenholm serem banget aswwwww ::((((",
            "sharing warga yang sangat membagongkan alias anjeeenggg tolol banget..\n\n  \n\"iya cuy, kalo dia ikut lu kerja di prj mah dia gabisa main slot, soalnya hapenya disimpan, fokus handle pembeli terus.... Kalo dia lagi ngojol, buset dah, sampe pinjem duit emaknya buat depo terus..\"\n\n-------------------------------\n\nya mudah2an gajinya abis berlelah-lelah berdiri seharian melayani customer di prj itu ga dipakai buat main slot ya, trus buat bayar utang ke ibunya juga..",
            "Yang hidupnya engga solo gimana, kan banyak jogja semarang jakarta dll",
            "Cunny gf please",
            "is it too much to ask Hot Mommy Goth GF to Allah?",
            "Tolong Kasih Tag NSFW. Gua lagi di kereta waktu liat post ini dan langsung coli karena gak tahan. Orang-orang pada ngeliatin dan bilang \"Ini orang udah enggak waras\" atau \"Panggilin petugas\". HP gua jatuh dan semuanya pada lihat post ini. Sekarang lelaki satu gerbong pada coli bersama ke post ini. Ini salah lu, kalau aja post ini dikasih tag NSFW, ini enggak akan terjadi.",
            "https://preview.redd.it/6hcpngqum28d1.png?width=663&format=pjpg&auto=webp&s=39b62278a7e455eb09bc3750e35a2a7afe805720",
            "Coba tangannya diangkat",
            "https://preview.redd.it/dl410hwkp28d1.jpeg?width=1125&format=pjpg&auto=webp&s=02d8221ed005fb67454547bcd4f0147809b6f456",
            "Gua sempet kaget liat fotonya gua kira rekan kerja gua gara2 potongan rambutnya sekilas mirip tapi setelah diperhatikan lagi ternyata bukan wkwkwk",
            "kirain ysn",
            "[deleted]",
            "![gif](giphy|QqdyVT8H6uJ32)",
            "Rip inbox",
            ".______. Rip inbox.\n\nUnrelated\n\nCoba susunya ganti diabetasol mbak.",
            "what are you identify?",
            "Kalo susu jd diare, ganti aja blenderized. Tanya2 ke gizi bikinnya gmn",
            "Jd inget dulu (well, ini diceritain ortu sih, mana bs gw inget sendiri pas masih umur2 segitu) gw pernah matahin tutup bekal temen gw, trus pas dijemput dia ngadu ke emak gw “tante.. ini dipatahin Flyer888, padahal ini belinya di amerika lo.. mana bisa tante ganti”. Kata mak gw untung ini masih bocil, kalo ngga udah tak keplak mulutnya 😂😂",
            "Another reason why I'm happy to be child free. Paling ga suka adu gengsi. Kek org kengangguran aja. Childish",
            "Serba salah ya, banyak org msh kuat bayar uang sekolahnya tp ngga bs ngikutin gengsi2annya",
            "Kalo gak mau ikut gengsi gengsian, theme the kid to use only one brand. Like...\n\nIkea bag, misting, senok, water bottle, payung, dll.\n\nYou know when a thing broke where to replace it. And other parents knows that you are \"practical\" parents.",
            "komen-komen ginian kadang ngasih motivasi juga buat kerja keras… semangat us 😔",
            "Ntar tiap berapa minggu bakal ada anak ultah terus nanti gengsi2an emak2nya",
            ".________. Dang, masih TK sudah ada persaingan *obligatory, red flag is coming /jk*",
            "Well well well, kalo di sekolah yang mahal itu, orang tuanya banyak pamer gengsi jg. Basically mereka yang nggak ikutan nongkrong di singapore bakal dijauhin",
            "Lhah, adanya stres di game multiplayer pindahnya ke game singleplayer  \nIni ilangin stres malah di game multiplayer WKWKWKWK",
            "Tai mmg g ada gunanya, performancenya kek di lancarin",
            "tau goblok bgt dah. sma aja boong soalnya mereka pake efek yang berlebihan (blur, animasi, dll) di homepage, alhasil ttp lemot",
            "nanti kalau mereka ga kerja, di phk bang.. ☹️",
            "Pendukung liverpool be like",
            "pendukung Ferrari be like",
            "Oh Stardew Valley player spotted",
            "Can i pet that dog?",
            "https://preview.redd.it/nxzllsxk818d1.png?width=1080&format=pjpg&auto=webp&s=7303964277f7e221b7917df73d9aa53f21b68e6b\n\nLangsung kejadian pagi ini..",
            "Jangan hanya dianggurin, report jg.",
            "Spam itu, biarin aja",
            "yg berasa excited itu kalo ganti ke model flip ato fold sih, jelas experience nya beda, tapi paling cuma bertahan beberapa saat doang excitement nya, karena basically os nya ya itu2 aja",
            "Makanya gw lebih suka nonton hape low end. Banyak inovasi lucu lucu demi saving cost\n\nKalo hp pribadi pengen yg lebih excited kudu nambah budget. Sekarang gw s20 fe pengennya s24 ultra atau z fold 6 wkwkwk",
            "Ini gw yang rasain 3 tahun lalu sih..\n\nDulu selalu excited buat ngikutin hp baru, oprek sana sini, pokoknya hp harus super kenceng chipset paling oke harga paling murah.\n\nTerus sampai di kondisi dimana yang penting bisa bekerja dengan baik dan ga rewel. Akhirnya stop di samsung a32 yang udah mau jalan 3 tahun ga kepikiran mau beli hp baru lagi. \n\nMake hp cina menurut gw beneran bikin cape mental..",
            "Hape anda masi mendinng android. Coba deh gsnti iphone. Asli ga berasa ada bedanya. Habis gesek 20jtan trus pegang iphone baru kaya.. udah? 😐",
            "ya emang hp skrg gitu2 aja, orang upgrade skrg klo bukan karena game ya karena rusak. klo cuma sosmed dll mah performa gitu2 aja.",
            "Tergantung sih, paling excitednya cuma \"cusromable ga ya?\" \n\nSpec wise, aku cuma ngimpi ada soc yang kombinasinya misal: \n\n- midrange cortex-x4 4core + cortex-A720 4core\n\n- low-to-midrange cortex-x4 2 core + cortex-A720 6 core\n\n- lowend cortex-A720 4 core + cortex A520 4 core\n\n- cortex A520 8 core for home router lmao.",
            "Fitur native kaya gitu biasanya nempel di osnya (miui vs funtouch vs one ui) tinggal itu doang last bastion yang bikin tertarik hape baru",
            "Nonton review HP juga sama udah ngebosenin, kadang cuma skip ke bagian spek dan benchmark terus bandingin yg sebelumnya \"ohh upgrade nya cuma segitu doank\" dan tetep pakai hp lama sampai rusak.",
            "Saya mulai bosannya karena ponsel mau jadi mini laptop, dan laptop mau jadi ponsel Android.  \nBosannya karena mungkin sudah seamless sync sementara zaman dulu perlu backup dan pindahin data ke gawai baru?  \nKondisi ekonomi yang sedang nggak bagus juga membuat orang mengurangi pembelian. Dana riset juga banyak yang dikurangi karena masuk mode bertahan hidup?",
            "👍🏻",
            "Gak mungkin sih. Persentase kulit putih tetap gak akan jadi gede. Dan pasti kalah kalau pemilu demokrasi. Jadi tetap aja native (dalam hal ini org Jawa) yg akan menduduki mayoritas legislatif",
            "Engga jg si, waktu itu white ppl/belanda udah gapunya power structure apa apa. Semuanya dah dinasionalisasi  permerintah pribumi. Beda kek afsel emg dari dulunya dah ada power structure yang buat white ppl lebih tinggi posisinya drpd pribumi.",
            "Aku cwk, emg tetap bakal dpt komen horny 😔",
            "janji pap titid sama lari bugil gbk juga ga kesampean",
            "Aku mau liat foto om klosetmager",
            "Siapa tuh",
            "r/indonesia emang paling demen nagih janji",
            "Coba pancing pake bait \"-PIC=HOAX\" nya bang",
            "Hes just like me",
            "bigger the sound bigger the dick mindset orang kabupaten (gw orang kabupaten)",
            "> da yang bisa jelasin gak kenapa banyak perusahaan punya pola pikir 'bagian managerial harus dipegang ama sarjana'?\n\n  \nkarena mereka jadul",
            "# CASH RULE EVERYTHING AROUND ME ! C.R.E.A.M GET THE MONEY ! DOLLAR DOLLAR BILL Y'ALL !!!!!!!",
            "With Gal Bay Tribe as their archenemy :D",
            "btw postingan eunwoo di venice ganteng nya ga nahannnn",
            "Indomie jumbo: *I'm literally right here*",
            "Kalau mau doble jangan yg sama rasanya.\n\nRecommend buat mie double :\nMie sedap kriuk+indomie rendang itu the best kalo mau double. Kriuk dari mie sedap ditambah bumbu rendang tuh mantep.",
            "8 indomie rendang, muntah\n\nmy limit is 7",
            "Uhm tiap makan mi instan aku selalu masak 2 bungkus",
            "Telornya jangan dobel juga atuh, pantes begah wkwkw.",
            "Bumbunya jangan dipakai semuanya.  \nBisa keasinan dan membuat mual.",
            "Considering the Swedish do banana curry pizza, durian seems tame",
            "Dia suka sama kamu itu lol\n\nStaf kumiai ya? Pemagang memang banyak yg ajaib kelakuannya",
            "Alesan biar ngobrol terus.",
            "You're his counsel?",
            "iyanih, pengen liat thiccinaosu lagi",
            "Nggaaak",
            "Penjudi:\n\n![gif](giphy|quj5jGCrP6new)",
            "ini tuh sama kek dora cuma ngomong \"swiper jangan mencuri\"",
            "yang penting KPI tercapai",
            "Sending virtual hug for you",
            "allthebest",
            "Hang in there, buddy\n\nDon't be too harsh on yourself, and take some time to heal..\n\nVirtual pukpukk for you (   \")/(._. )",
            "Sate 10 tusuk kurang banyak? 😳",
            "bli 2",
            "https://preview.redd.it/zjiuh6qzu08d1.jpeg?width=1080&format=pjpg&auto=webp&s=796bb554d672a0f4a2fd8215c879a60026912047",
            "Mayoritas org di sosmed jrg ad yg mau diskusi, apalagi klo opini awal ny ud aneh. ",
            "belajar dimana? boleh share?",
            "sleep well bro, dream me pls",
            "Masih di RS kah atau sudah boleh pulang?",
            "enaknyaaa",
            "It's HARD bro",
            "Aku juga gini mak kemaren ke rs, \n\n\n\nAnjuran dokter kurangin nonton interview with the vampire 🤏🤏",
            "Funfact. Rehydrate them by soaking them in a water (don't need to much) and then boil it into some kind of tomato mash that can then be used as addition for stir fry. Yummy.",
            "Nggak bisa dikulum seperti manisan kiamboy, ya?",
            "coming out?",
            "trus reaksi keluarga gmn?",
            "Klik kanan>join cekcok",
            "Ceritanya gimana emang?? Ingin tau moment aww juga dong.",
            "qmu kpan",
            "3. Mencari jati diri pergilah ke Pati",
            "Maap ;((",
            "Eachtime classmate asking something to mak erot :\n\nemg knp mau nonton interview with the vampire ya",
            "Ada tante milop di sarinah :(\n\nTitip lah",
            "GOOD MORNING SAAAAAAR",
            "Happy weekend!!!!!!!!",
            "GWS bang.. selagi wiken try to get more rest",
            "weekend fever bro... chill out...",
            "try make your life busy with other things, even just playing games or watching youtube video",
            "Jgn bengong, make yourself busy. ",
            "Hanya Yesus Kristus yang bisa menghakimi, lakukan apa yang menurut OP baik.  \nKalau ada yang \"berkomentar jelek\", diterima saja dan dicuekin?",
            "Kebaca cod.\n\nSmean beli apaan",
            "ujan daging",
            "Tdr lg",
            "https://preview.redd.it/zo7d71wb818d1.jpeg?width=320&format=pjpg&auto=webp&s=118640bb62d879bfa9085b80cc4c694a225b5170",
            "Awoakwoakwoakwoak.",
            "awakwakwak kita tau problemnya di team leadernya, tapi yaudahlah ya",
            "KURO GOBLOGGG",
            "Makanya kayak fans sr\n\nGa usah nonton, liat highlight aja biar ga sakit hati atau minimal sakitnya cuman 10 menit",
            "Gimana ya, beberapa cosplayer cewek (yang aku tahu ya) \"jualan\" elemen thirsty trap (yang ujung-ujungnya ada borderline nude dan fully naked di patreon atau only fans) berarti ada pangsa pasar. \n\nKalau mesin drama, well...no komen deh.",
            "I acknowledge that they are cool but they are not for me. ",
            "Aku sendiri cosplayer baru mulai tahun ini, dapet teman dan kenalan banyak.\n\n\nYa sebenarnya, mereka at the end of the day, ya wibu sih, kalau dilihat orang normal ya aneh, tapi kalau dilihat oleh wibu lain ya normal. Mesin drama bener sih kalau ngelihatnya dari sosial media doang. Tapi aku selama ikut event event lokal ku, malah ternyata gak ada drama sih, 99% orang baik semua.\n\n\nBudaya rental juga membantu meramaikan dunia cosplay sih, karena dengan rental bisa jauh lebih murah daripada beli atau bisa coba dulu karena takut kalau bosen. Sekitar 1/10 rata rata gap nya antara rental dan beli. Ya walaupun aku sendiri gak pernah rental sih, takut ngerusak wig :(",
            "Mf\n\nGw tahun 2013 stereotypesnya kayak gini dan ini yang diceritain temen gw yang gabung grup gede. Sampe sekarang masih ternyata wkwkwwk.",
            "Kepikirannya, kalau nggak ada \"aset\" yang mendukung terpaksa \"buat drama\" agar menarik perhatian dan mendapatkan tawaran pekerjaan?",
            "Make sense sih mak jarang soalnya yang meja bisa jadi kasur/vice versa..",
            "Soalnya ada fitur ngentod di meja tanpa sakit punggung",
            "Meja kasur ini meja yang bisa dibuka menjadi kasur, atau meja lipat yang bisa digunakan di atas kasur?",
            "I think it depends on the establishment :/ .  \n\nAt one place, I got absolutely nothing. No love lost as I already got everything I could take from them by that point :P .  \n\nAt another, they gave me a farewell bonus, a meager sum, but I nonetheless appreciated the gesture :) .",
            "Makanya kasih surat resignnya pas dapat bonus",
            "thats me, udah berusaha mundur2in weeks notice karena pengalaman tahun2 sebelumnya bakalan keluar di bulan itu, eh sebulan setelah resign malah keluar itu bonus tahunan",
            "Pertama2 cek fisik dulu (gesek no rangka & mesin), di samsat manapun ini bisa kok. Dan gratis. Jadi ga perlu bingung lokasi kendaraanya di mana.  \n\nNanti bawa hasilnya, bpkb stnk ktp kwitansi jual beli dll + fotokopinya ke samsat asal, bilang mau mutasi keluar. Nanti dikasih tau suruh balik lagi kapan (bisa 2-3 minggu lebih) buat ambil berkas kayak arsip stnk, surat fiskal, dll yang nanti disiapin sama samsat asal.  \n\nSetelah berkas2 itu di tangan, tinggal bawa aja ke samsat tujuan bilang mau mutasi masuk. Beres",
            "Ke samsat, ntar dikasih tau mesti kemana aj.  \nBiasany mesti cabut berkas dr polsek/polda trus ke samsat tujuan",
            "Why you sensor depok?",
            "Gabut sambil interview lah. At least masih dibayar",
            "boncel kan midget ka, masa hape jatoh jadi midget midget sih?",
            "Gw pas baru ganti hape mi 9t sore hari, pas pulang, keluar grabcar  jatuh di corner dan mental 4 langkah wkwkwk. Thank god xiaomi kasih casing hardcase di box, itu hardcase ada yg retak",
            "Yang akhirnya bikin gue kepaksa download Reddit gara2 ga bisa nsfw\n\nMasih mending cuman porn, lah post2 yang di tag nsfw dihalangin jir",
            "Me with DNS over TLS: what vpn?",
            "1⁴",
            "kalau ada golong sekuler, ngadain pertemuan buat ngejelasin isu politik, kaum akar rumput akan datang gak kalau gak diiming2in ongkos jalan?",
            "apakah kanan selalu konservatif? kalo kiri bisa konservatif g?",
            "Blok kiri dan blok kanan, gak salah sih",
            "Buat cwk apa cwk ka?",
            "stress cuma nyari literature saja, olah data pasti dibantu",
            "https://preview.redd.it/wsodaqg8p18d1.png?width=782&format=png&auto=webp&s=6511102b110823c1307c08bd6cf1a1adbfd98a34",
            "Wah makan kodok idup ya\n\nhttps://preview.redd.it/asn5p5mvr18d1.jpeg?width=956&format=pjpg&auto=webp&s=656544524b61e439311c624c5ee6aefcf4e8754d",
            "siang^2 kok masih tidur ya, laporin komandanya",
            "muntah dulu baru buka laptop",
            "Alergi laptop? Boleh dikasih ke saya",
            "Hamil karena yaoi ya maq?",
            "mungkin bisa diubah2 outputnya, kayak min 450w max bisa sampe 1100 w\n\nkemaren liat2 ada yg deskripsinya begitu\n\nmaklum pengen tapi wattage sewaanku cuma 950w max jadi nyari yg low power, masang microwave yg high power kayak begitu langsung babay",
            "bisa, cuma ya laaama aja misal kalo 1100w perlu 3 menit buat manasin makanan ready to eat, pake 450w ya idk 10 menit",
            "pemanasan bang",
            "Fm kalo udah deket2 tanggal jatuh tempo tp tagihannya blm dibayar emang nongol kayak gitu. Obligatory r/fucklippo",
            "Biasa diminta cancel. Kalo ga bakal dibiarin ga kirim, tp biasanya ya diminta cancel biar ga kena penalty tokonya",
            "Ga tau kalau kembang api, tapi kalau kembang kampus banyak",
            "Blok aja",
            "Blok lah kalo udah main telpon2. Ganggu. Kalo chat kan bs dimute",
            "I hate the term pelakor... it sort of absolves the man's fault (?)",
            "Betul, but penitentiary isn’t always about money",
            "saudara lelaki hidup di tengah peradaban mistis 💀",
            "wiii, kopinya dri tempat situ enak tuh pak",
            "yg tinggal di situ atau orang situ????",
            "Eh dulu pas sd pernah tugas disuruh tulis surat buat cari sapen (sahabat pena), dapetnya anak dari situ loh yang nulis balik. Tapi gak gw terusin bales lagi alias gw ghosting hahahah",
            "Wih ada internet di sana kak",
            "kat mano?",
            "Gue baca manganya, bangke emang yang asal tuduh\n\nItu drama sedih astaga gak ada pedo pedonya sama sekali",
            "judul?",
            "Well, the door to r/BadutBucin is always open",
            "wise broooo, better safe then sorry",
            "\nYou realize of course that we could never be friends. Because no man can be friends with a woman that he finds attractive. He always wants to have sex with her. -Harry Burns, when Harry met Sally, 1989",
            "https://preview.redd.it/fq61110ef48d1.jpeg?width=189&format=pjpg&auto=webp&s=6c4afc46f3b9de0d602f8e134ebfbd0382f3074a\n\nkenapa gw jadi inget yui baca ini njay",
            "Wise decision.. you definitely wouldn't want to have a gf that put you at the 2nd place while her ex at 1st.",
            "Sepertinya scabies. \n\nHarga tergantung sih. Di sini harga jasa dokter ±120.000 belum obat (obat manusia dimarkup lumayan awokawoka, yang mana harga di vet bisa buat beli satu strip di apotik).\n\nDi sini sih ada petshop yang jual obat scabies isinya aku lupa antibiotik+apa gitu. Cairan semprot dan bau antibiotiknya kuat.",
            "Dulu ngevaksin+vitamin kitten se inget gw sekitar 100-300 lupa untuk berapa kali vaksin harga segitu.\n\nDari foto bisa aja cuman ear wax atau parah nya bisa ada mites kalo dia sering gatel di telinga. Ada obatnya kok di petshop atau klo masih gk yakin bisa langsung bawa ke dokter aja.\n\nTanya2 sama yg jaga petshop juga bisa sebelum mau dibawa ke dokter, kadang mereka lumayan ngerti juga.",
            "context stardew valley?",
            "Pak, udah berapa ratus jam di Tarkov?",
            "Semoga lanjut season 2 dok",
            "Things to do in medan:\n\n1. Get out",
            "Medan is like Tijuana. So many people talk shit and scared as hell to go there, but once you’re actually there… you realize it’s not as horrible as what people say.",
            "To do in Medan\n1. Eat\n2. Leave\n\nI still can't understand why Foreigners want to Medan, if you expecting cheaper Bali/Sg, no it's not. I have lived there over two decades, and it's the most boring city I know. Food is slightly better than other cities if you love pork",
            "Kukira >!hari sambat!< pak_erte",
            "Makanya saya selalu akses lewat m.facebook.com pakai peramban ponsel.",
            "Klo dulu nenek sering potong dahan2 yg kepanjangan, trus mediany pake arang (dalam pot) atau sabut(?) yg digantung ditembok. Sisany cm disiram air, kadang pake bekas cucian beras(tajin)",
            "Harusnya kuat kuat aja sih, emang sekarang lo pakai rice cooker apa?",
            "gimna seru nda erdtree?",
            "Beli dimana pak? Bisa jadi bad seal juga.",
            "Louder sisttt",
            "Referral Code",
            "Connection ?",
            "Kekuatan = strength\n\nOrang = people\n\nDalam = deep\n\nJd kekuatan org dalam = strength people deep",
            "\"Insider Power\"?",
            "Nepotism",
            "nepotism?",
            "Personal connections?",
            "Insider?",
            "Ada yang pernah pake [chinashipshop.com](http://chinashipshop.com) atau [tiptrans.com](http://tiptrans.com) mungkin?",
            "Gw dulu sempet pake natindo cargo buat ngirim bibit parfum sama beberapa barang.  Sempet kena delay  dari ekspetasi tanggal nyampe.\n\nkalau gk slah gk nyampe 100k.",
            "Good day, Mr. Shelby (please read this in the thickest english irish accent you can muster).",
            "IT'S DEM PEAKY FOOKIN BLINDER INNIT !",
            "sehari doang ya bang?",
            "Grup Facebook komunitas info kota. Misal Jogja di Info Cegatan Jogja.",
            "kwc kwc ada ga",
            "Pictnya laah",
            "good luck bu",
            "https://preview.redd.it/jp0y5usq638d1.jpeg?width=500&format=pjpg&auto=webp&s=50f4ec4f86ed5c8b888173731797a4c95b2fdf80",
            "Gl neng✨️✨️",
            "Tekila it is",
            "teh kila",
            "Eh, beda yah sama lidah buaya",
            "iya… ditunggu nih ekspektasi gue tinggi..",
            "Shimidzu ~",
            "sun tzu -art of war",
            "Braga juga. 🙄\n\nPadahal udah motor_vehicle=no",
            "Uninstall aja",
            "access it thru chrome lol, like I do",
            "Kalo di aceh tinggal petik ganja di kebun aja pak",
            "Iqos aja bangg 30rb doang di indomaret uda berasa kaya eksmud2 kekinian",
            "If fail you can always go bald.",
            "Gamba time",
            "selama proaktif protes selama masa pemotongan rambut, harusnya chance gagal bisa diperkecil wkwk",
            "sebaikny jgn ggbh",
            "selama bukan 1 ton milk bun nya \"after you\" bangkok, harusnya aman sih...\n\n[https://jakartaglobe.id/news/customs-office-burns-1-ton-of-smuggled-thai-milk-buns](https://jakartaglobe.id/news/customs-office-burns-1-ton-of-smuggled-thai-milk-buns)",
            "Memangnya snacks kena becuk?",
            "selamat malam golda meir",
            "y pgi",
            "dmnaa",
            "https://preview.redd.it/td5bhps8448d1.jpeg?width=554&format=pjpg&auto=webp&s=3c486f82eda174de346668009b88faf2eb740419",
            "https://preview.redd.it/xh1nvjau948d1.jpeg?width=705&format=pjpg&auto=webp&s=60a25cb187c25c52f5715e57a6e4593c6ec4dc30",
            "🍍🍎✒️",
            "https://i.imgur.com/rW7njjp.jpeg",
            "[aq wktu muda](https://www.youtube.com/watch?v=dQw4w9WgXcQ)",
            "CPU/Mobo itu selalu yang pertama diupgrade, soalnya sekalian buat SSD NVMe sama RAM,\n\nHaswell mentok di DDR3, dan 6600XT itu mentok di PCIE x8 karena emang uda PCIE 4.0. Kalo situ masih make DDR3 1600 sama PCIE 3.0 x8 buat 6600XT, itu bakal bottleneck parah dan pasti stuttering",
            "Its God telling you to not give money to u/spez because fuck him.",
            "Finally wkwk",
            "jd kayak betty bob?",
            "bye",
            "You can fix me",
            "bkan dpresi tp cm krg diruqyah",
            "Komplain lagi udah?",
            "full refund udah",
            "Mirip yang bapak bapak cina didiskualifikasi marathon karena larinya sambil udud",
            "mac co what?",
            "Alright alright alright",
            "![gif](giphy|v18xOnxDRt8aI)",
            "Emg weekdys g mlz?",
            "Ada yang hidupnya malang\n\nAda juga yang hidupnya kudus\n\nPaling sedih kalau hidupnya kasihan",
            "😭💢",
            "Is dis yu?\n\nhttps://preview.redd.it/x75a0jbex28d1.jpeg?width=677&format=pjpg&auto=webp&s=bd70e24329e07aa124158903b5e0357c7b37d7c9",
            "bru sadar yang dibawah ngacungin jempol jg",
            "posenya kek gini sih makanya keliatan BIG, padahal biasa aja\n\nhttps://preview.redd.it/yfd98oc7238d1.jpeg?width=1421&format=pjpg&auto=webp&s=66239864d18e00cf46ea7c399695188d6edc5763",
            "Wkwkwkwk... Bakat jadi spoiled rich brat-nya udah nampak dari kecil.",
            "Ngikut adu gengsi itu pilihan bro, lu mau cuek jg ga masalah",
            "Good for you, my dude.",
            "Iya. Bahkan adek gue aja yang anaknya sekolah TK di komplek di kabupaten aja ngeluarin duit lebih gede buat acara yang dibikin ortu murid ketimbang buat sekolah.\n\nMillenials, gak termasuk gue, kok doyan banget pamer sama adu gengsi ya? Heran.",
            "Barangnya mah gampang dicari. Tapi mehong. Gue yang pake ecentio tercengang ngeliat harga yumbox sama omiebox.",
            "Ember! Kebetulan ultah anak gue deket sama awal taun ajaran baru. Bini gue udah mulai ngumpulin ide buat bikin acara ultah di kelas dari bulan kemarin. Wkwkwkwk.",
            "Yang bersaing itu ibu-ibunya. Anak-anaknya mah gak ngerti apa-apa",
            "I am only in charge of 1/2 of them, but sure!",
            "Kykny cakep, tnya aj 1 jem brp, spya dia yg block wwkwkwk",
            "Kalo dijawab umurnya 13 tahun, apakah nomornya langsung diblacklist biar ga dihubungi?",
            "Kdg jg model begitu trnyata hubungan sm kerjaan jadi susah sih. Maka ny gw tinggal read dl ampe dia ngmg lagi",
            "Ane Xiaomi dari jaman 2015, awet2 semua bahkan redmi 4a sama 5a masih jalan cuman emang udah cuman jadi modem sama hp cadangan, \n\nCuman ane emang mau bersih2 iklan di Xiaomi sih, banyak orang kalo beli hp ga mau pusing oprek2",
            "Makanya hp Sumsang dan semua merek yang pake amoled sengaja dibikin rusak setelah setahun (layar saber) biar pompa penjualan dia\n\nCoba main ke forum hp Facebook, 80% masalah itu layar amoled mulai garis2",
            "Pasti ada bang",
            "Gue lupa yang lari bugil siapa",
            "Aku juga mau kak 😭",
            "Gw gak inget ka 👈🏽 pura2 lupa biar orangnya sadar",
            "Fr fr",
            "lebih ganteng om u/masimello",
            "Gw makan indomie jumbo 2 bungkus jg",
            "Jumbo itu setara berapa kali biasa sih? 1,5x?",
            "Jumbo berapa gram sih? Gw rasa 100 gram itu yg paling efektif dan efisien",
            "ga tau pengen nyoba aja indomi 2 bungkus, liat yg jumbo yg ada di benak rasanya ga lebih kenyang dari indomi biasa wkwk",
            "Peak Pro tip",
            "nice ingfo mang",
            "F-U-S-I-O-O-O-N!  \n\nMungkin bisa dibuat resep campuran mie dari beberapa produsen untuk meningkatkan penjualan antar produsen?",
            "WTF THE FK",
            "aku ga kuaat",
            "tapi aku cinta telor aaaah 😫",
            "bukan krn itu, emg porsinya yg kebanyakan",
            "Bingung af soalnya out of nowhere dia beliin sepatu mahal (mana harga jg ga ditutup) dan literally bilang mo traktir di tempat mahal.\n\nIya staf kumiai. Kelakuan mereka bikin pijit jidat smua.",
            "Keknya gt ya. Capek bgt ngeladenin ngobrol 2 jam karena bilangnya ada masalah di tempat kerja tp trnyata malah cerita ttg masa lalu.",
            "Thanks a lot brother 🫂",
            "Lesson learned",
            "Sebenarnya dia nanya hal decent sih makanya gw jawab eh udah dijawab malah mulai dongo nya",
            "di coursera kelasnya [google](https://coursera.org/professional-certificates/google-digital-marketing-ecommerce) 209rb sebulan ada 7 course tiap course ada 4 section.",
            "Masihhhh, memang ga bisa pulang pas weekend sih, biasanya proses discharge itu pas hari kerja, jadi perkiraanku bakal pulang hari senin atau selasa",
            "i have always planned to do this for a few months or so, sebelum adult responsibilty terlalu banyak sampe ga sempet main :')",
            "Yeah, so far masih belum ada yang bikin stuck  \nKalo stuck biasanya gw main game lain dulu, trus ntar lanjut lagi lol",
            "you jest but its a valid advice this show is definitely botak inducing",
            ">!confessing that they're lgbt!<",
            "Emak gw bisa jantungan kalo tau. Tbh gw rada kasihan cuman dosa bapaknya banyak banget ke gw sampe gw males ngomong apa2. Just let them deal with it themselve.",
            "Their relationship stories? I don't think I'm allowed to share their story but I can tell you about a touching moment from the wedding.\n\nIn the reception, there is a moment where they get to read aloud the letters they wrote to each other just before the wedding. I don't remember the content of the letter at all because I was focused on the way one of them stare the other in awe when the other was reading the letter, and vice versa. Their eyes and expressions clearly speak to me something like \"I'm so glad and grateful that I fall in love with you and got to spend the rest of my life with you.\" It's like [this meme](https://www.reddit.com/r/wholesomememes/comments/d93vxe/get_yourself_someone_who_looks_at_you_like_this/) but the stares are from and to both of them and I'm just so happy for them.",
            "Weh iya di Sarinah lagi ada bazar yak. Tante milop apaan??",
            "Kaga enak suer milop. Udah nyoba yg di gs, heran knp bs viral",
            "Privet comrade 🫡",
            "nah, had it since Friday night, barely made it out of Friday with tons of work being over the deadline. I am gonna need a full day rest to at least survive the next week",
            "Cloudy with a chance of meatballs",
            "Ga beberapa cosplayer cewe sih, tapi hampir semua bang.\nEven Liyuu juga wadidaw cosu nya pas sebelum 2022 🥵",
            "Same here. But I've heard opinions that along the line of: \"Itu orangnya ada masalah kepribadian makanya kayak begitu\"",
            "gua ga expect kayak bonus2 farewell atau apa sih  \nini bonus tahunan yang biasa semua emang dapet jadi bukan sesuatu yang gua expect karena mau resign trus dapet bonus  \nblm ngecek lagi sih kontrak nya gimana kemarin in writtingnya, jd masih ngecek kira-kira ada yang sepengalaman gak bonus tahunan/bulanannya ga dapet karena ngasih surat resign",
            "you don't say  \nbonus nya dikasih random di bulan apa bosku makanya gak ada yang bisa antisipasi",
            "Thanks atas informasinya!",
            "Thanks!",
            "heh! jorok! d***k gitu",
            "tbh gabutnya pake dibully",
            "iyadah maap sy ga pintar bahasa.. lecet baret maksudnya",
            "idem, but with dns over https",
            "Read my edit",
            "I have it. But it worked system wide. That's what I tried to avoid",
            "1",
            "                 Literally anything else\n\nBimbingan \n\n       Skripsi\n\n\nAt this point nguras laut lebih menyenangkan daripada beresin skripsi.",
            "Oohh I can read the text on this picture",
            "Meme tanpa caption tapi yang disini dah tau captionnya 💀",
            "Lorenya dalem ini dct sampe2 ini gambar ga usah pake text",
            "Tanpa tulisan, gue udah tau konteks lo apa. Oh God, I freaking love this lore.",
            "analogi aja itu, bukan kodok beneran, dari buku eat that frog.\n\nselama kodok (task tersulit hari ini) udah dimakan, hari ini mau terjadi apa aja udah ga ngaruh. ga bakal feel bad karena emang udah dimakan sebagai task pertama hari ini.",
            "Nope, banyak yg advertise 450w low watt. Di spek juga ga ada max wattage\n\nContoh sharp r220",
            "Damn ok nevermind then. Kalo makan 1 piring daging & 1 piring sayur aja mesti 20 menit ya\n\nYg samsung ga ada defrost, yang ada defrost sharp 450w. Yang ada defrost dan auto weight 1.2jt lol",
            "Bukannya sudah lepas dari lippo? *apa aku yang kemakan hoax?*",
            "Kembangnya sering disiramin gak?",
            "Ahh okayy! Masih make sense lah buatku.. Thankyou somuch",
            "Tqqq infonya this is very helpful🙇‍♂️🙇‍♂️",
            "I don't really play FPS game... 😅 so it's kinda unique that I have this kind of dream.",
            "Ke bukit lawang, danau toba, dan gateway ke nias",
            "Yang Philips biasa.... Oh iya ternyata 400 Watt juga ya ",
            "Baru 1 jam kurleb, dan mapnya gede banget, worth every penny",
            "Merk one two cups di toped, yang 9 cups. Seal nya kayaknya ya. Salah gw sih ga sekalian beli bialetti, cuma mahal bgt kwkw.",
            "Owroight, go on then..",
            "u/ikinaosu",
            "Kak,rambut di layarku kok ga bs hilang ya",
            "Akhirnya gw bisa pake pic ini\n\nhttps://preview.redd.it/w3kp9wpsf48d1.jpeg?width=475&format=pjpg&auto=webp&s=d9b56a0d0c6874322eed5679de72225147af69c3",
            "https://preview.redd.it/v6bsmj1n148d1.jpeg?width=640&format=pjpg&auto=webp&s=35ac8f21a5eded1ff66b197dcc46407505b63a49",
            "It's very ethical to turn on adblock while browsing reddit :)",
            "Kalo gw sih ada hubungan dengan kerjaan orangnya pasti langsung _mas ojol, tlg blabla_ atau _pak, rumahnya yang bla_. Kalau gw yang hubungi duluan juga _halo_ dan gapake lama langsung _ada paket dari yeyeye_.\n\nKalo cuma samlekom doang, 1 menit ga nambah udah gw anggap mau nipu. Robot-nya udh disetting kayak gitu.",
            "Bilang aja lagi ngga bisa ngobrol, soalnya nomer ini dipakai buat kerja, dan takutnya ada emergency phone masuk ngga keangkat sorry, lain kali tolong hubungi kalo memang ada issue kerjaan aja.",
            "gws bro, mumpung weekend keluarin smua sakitnya",
            "Di twitterku kayanya belum ada cosplayer lokal, tapi kalau lihat di discord kucing statementmu itu adalah benar adanya 👍.",
            "Cuekin aja, itu tipe org yg ga open minded ato kolot biasa nya. ",
            "Bully balek, biar dipecat,  dapat pesangon",
            "Ohhh iya lupa kalo ini system wide, nggak bisa make vpn opera lagi somehow apa karena pake gx ya",
            "eh iya deng bener yg ada rangenya barang ngaco ckckck ini oven, tapi sampe embel2 microwave di judul tapi jelas2 bukan microwave deh ini mah pakenya elemen pemanas\n\nhttps://preview.redd.it/om81fhfi918d1.jpeg?width=1080&format=pjpg&auto=webp&s=735b30c7552c42bd7dd083dcd0285c5428fb6573",
            "Skrg ke Toba dan Nias bisa nge bypass Medan. Thanks Opung",
            "\\> 9 cups\n\nEh ada? Tahu gitu beli yang itu .______. Pakai 6cups air di bagian bawah cuma 270ml (mentok pas persis tepat di bawah lubang pressure). 300ml itu kalau full melebihi lubang. \n\nDari yang aku baca di r/mokapot untuk cup lebih di atas enam disarankan gas agak besar sama grindnya hampir mendekati pourover.\n\nOh ya pas mendidih ada uap keluar dari samping (sambungan bukan lubang valve) tidak?",
            "thanks bro",
            "SEO nya ngawur. Pada bilang microwave oven jadi dua duanya nongol\n\nGw liat ms20a menarik, cuma 770rb pake promo shopee. Tapi masa toshiba, Sharp ga ada yg bikin harga segini\n\nTapi ga ada mode defrost"
        ]
    },
    "Monthly Rant/Rage Thread - June 2024": {
        "title": "Monthly Rant/Rage Thread - June 2024",
        "score": 13,
        "url": "https://www.reddit.com/r/indonesia/comments/1dhz4z2/monthly_rantrage_thread_june_2024/",
        "content": "*This special thread series was originally maintained by* u/mbok_jamu, *since the scheduled post feature is now available on Reddit I will take over this monthly series - Vulcan*\n\nThank you for sharing your stories on the previous rant thread. You guys are awesome and so brave for sharing your problems. Now let's do it again.\n\nIs there something that makes you sad, angry, or stressed out? Do you want to cry or express your emotions, but you have no one to talk to?\n\nHere, here, let it all out. Tell us everything, set your worries free. We're here to share and to listen. Use a throwaway account if you need one. Let it all out, don't leave a mess in your head. Tomorrow morning, you'll wake up feeling fresh and grateful, so you can celebrate your days with a bright smile and positivity.\n\nIf you need peer support or help from the professionals:\n\n* Subreddit kesehatan mental dan mental health support r/pedulijiwa\n* Feel free to ping u/Juntis in the comment section (this user is a verified professional psychologist)\n* Hotline Official layanan kesehatan jiwa pemerintah: 119 ext 8\n* [Daftar Penyedia Layanan Kesehatan Mental](https://www.intothelightid.org/tentang-bunuh-diri/daftar-penyedia-layanan-kesehatan-mental/) by Into the Light (format [PDF](https://www.intothelightid.org/wp-content/uploads/2019/12/Database-Layanan-Kesmen-CIMSA-SCOPH-Pijar-Psikologi-Into-The-Light-Indonesia-IYHPS.pdf) \\-- last updated December 2019)\n* [Daftar psikolog di puskesmas kecamatan DKI Jakarta.](https://mobile.twitter.com/ludychyntia/status/1059796470910529536?lang=en)\n* [Yayasan Pulih:](https://yayasanpulih.org) 021-788-42580. Appointment via WhatsApp at 081-184-36633. Link [Instagram](https://www.instagram.com/yayasanpulih/?hl=id) untuk informasi terupdate\n* [SADARI](https://instagram.com/sadari_diri?igshid=18wvqmawsn3s6) (link to [website](https://sadari.id/)). Available for online counseling during quarantine.\n* Save Yourselves: Line u/vol7047h\n* LSM Jangan Bunuh Diri: 021-9696 9293 / [janganbunuhdiri@yahoo.com](mailto:janganbunuhdiri@yahoo.com)\n* Into The Light: [pendampingan.itl@gmail.com](mailto:pendampingan.itl@gmail.com)\n* Into the Light Suicide Prevention Team: Jakarta area - Bibi +6281287877479 / Bondhan +6281290704035 / Sabilah +6281285651224. Jawa Barat - Diva +6285776477960 / Lele +6287785095125. Jawa Tengah - Arin +6281291081619. Jawa Timur - Singa +6281280738113 / Ayy +6285711951292 / Aufa +6281212798324.\n* [WYSA, a mental health chatbot](https://play.google.com/store/apps/details?id=bot.touchkin&hl=en_US)\n\n*PS: If the information listed above is outdated or not accurate, feel free to contact the moderator team via* [*modmail*](https://www.reddit.com/message/compose?to=/r/indonesia)*.*",
        "num_comments": 76,
        "comments": [
            "It feels fucking sucks today. Sometimes i felt like im not being listened enough. I wanted to be heard and above all understood, but these days I feel like my abilities to express my own self through words are not appealing. \n\nThe shitty thing is, I don't know where i should i ask for these craving of connections. My parents arent incapable to do so, my friends are busy for their next stage of their life, while im still on the last step of getting a job. \n\nThat doesnt mean im not worthy of attention and care from others especially from myself, however it does feels more like a burden for not being able to be heard attentively while everyone seems wants to be heard. \n\nMaybe the answer is going to therapist first, but that's probably can only be done after the job been secured. Does this mean I have to partake on showing off how my days went to random people through social media as a shotgun method to gain more attentions? There's lots of question I struggle with. \n\nOr probably I will be more assertive to my friend about what I need and ask about those things? Gonna ask ChatGPT first to double check to do the right thing might work. \n\nOther than that, my life's been pretty okay, but those craving for connections been bugging bejesus out of me for some time now, even though i still consider that as a natural thing and it's good practice to listen what my mind or heart trying to say.",
            "I hate Gacha games, And I even hate any Gacha Apologist that say Gacha is fine it's not mandatory.\n\nIt is not Fine, It teaching player to gamble, to Win by Spending money, and even if you don't spend money, You spend your Life.\n\nMost of Gacha gamers are hilariously suck at playing games, they can't make their own desicion, They easily influenced by Influencer, They can't learn the system or identify the fundamental issue, break down problem and dependent on someone else to make guide for them\n\nThey callout game as Kikir for Not Giving enough Bansos Instead not Giving enough replayable Content. They are proud their game make the most microtransaction weekly ranking,\n\nNot to mention the sexualized character that these pervert are Into.\n\nAnd most importantly they play games like a Job, They are doing it far worse tham MMO nerd, They keep logging in, keep doing daily turn in,, They keep swiming on FOMO hell, and can't seems get out despite they already hating the game, despite they have no social obligation to keep doing so",
            "tanpa harus banyak menjelaskan kenapa kenapanya. \n\n  \nakhirnya gw ngerti kenapa orang bilang \" your work colleague aint your family\" \n\n\n\nfrom now own, jangan pake banyak tingkah, jangan pake cipiki cipiki, just come, work, lunch and home.",
            "Gila scrolling sosmed itu bener bener membuat energi negatif makin gede..makin negatif pikiran. Bener kata mamah semua ini karena hp",
            "I hate when those crooked teeth br*tish people is having banter w Americans and they're too re re to detect sarcasm that they resort to talking about school shootings and US Healthcare, like you got me defending Amerikkkans here...",
            "My sister in law got diagnosed with stage four cancer. I don't see her very often since she lives in another country but I know that she cares about me and loves me. I love her too. She's the big sister that I never had. We don't know exactly how much time that she has left. My husband has already made plan to visit her and stay there for a few weeks or even months. I am worried because If all three of us going, it's going to put a very big hole in our family finance. And who will take care of the house and business? I want to see her. I do not want to regret not seeing her on what could possibly her last moment. But how do I put aside my fear of our money problem ? ",
            "market otomotif lagi sueret, disaranin balik nyales lagi\n\nhonda mitsubishi jelas coret karena sebelumnya disana, astra daihatsu auto2000 toyota sama suzuki udh naruh lamaran to gk ada respon, hyundai lagi gk buka lowongan, kia nissan disini manajemennya reputasi jelek, mobcin cem wuling mg byd...jgn dulu pasti susah jualannya\n\nlintas karir mau gk mau, mana umur udh tambah tua setahun jg bulan ini pilihan tambah sedikit. mau cerita ke org rumah jg pasti ujung2nya bakal digaslight\n\nmau nangis aja rasanya",
            "I think my toxic trait is thinking that my friend doesn't try to fight his depression enough. Klo dipikir2 mindset gue kyk boomer ini, tp gue jg pernah suicidal dan sampe skrg gue bener2 berusaha ngemaintain mental health via journalling, workout, meditasi.\n\nGue ngerti sih klo depresi itu gara2 chemical imbalance  di otak cuma ya gmn ga depresi klo lo org nya doomer & glass half empty terus. Gue jg dulu glass half empty kind of guy tp skrg udh bisa lebih positif sejak rutin kontemplasi hal2 apa aja yg bikin gue ngerasa bersyukur.\n\nEntah lah apa ini toxic positivity atau gue makin ke sini makin mental boomer tp udh cape aja dan ga mau ketularan jd negatif jg. Gue ngerti lo cuma pgn venting tp cape aja gue soalnya bingung responnya.",
            "yeah, the war is lost. I congratulate you, people.",
            "Thanks to diriku kalo pas mode hype suka ikut2 project atau buka commission meski kalo lagi down rasanya berat banget. Tp berkat itu tiap mau ngelakuin itu we inget sama projekan yang masih ongoing. We takut tengah jalan hilang dan kena cap sebagai orang gk bertanggung jawab.\n\n\nBecause I bet no one know me in rl. Kalo tiba2 ilang gak akan ada yang tahu dan kalo ada tanggungan gak selese, dikira ghosting client. Ada pun gk yakin keluarga mau post soal keadaanku biar satu orang temenku tahu kabarku.\n\n\nWe selalu ngerasa gk memiliki impact apa2 dikehidupan orang. Yah karena emang we gk terlalu penting, dan we ngerasa selalu jd beban. Meski udah berusaha buat apa apa sendiri tapi rasanya kaya \"kenapa sih aku ngerepotin orang banget\".\n\n\nI hope one day aku cuma perish aja gitu. Tanpa rasa sakit, atau gimana gimana. Dan pas itu aku lg gak punya tanggungan apa-apa. Toh ada atau gk ada jg gak masalah. Ada tuh cuma ngabisin stock oksigen aja gitu lhoo.\n\n\nMungkin abis nyelesaiin semua ini, dah gk terima projek atau komisan baru.",
            "GAADA DUIT GAENAK BANGET YA TUHANN \n\nFREELANCE GUEEE BLOM DAPET KLIENTTT\nAPA-APA PERHITUNGAN GAENAKKKKKK\nMAKAN PUN JD SUSAAAAAAAAAHHHH\nKAPAN SAYA PUNYA DUIT TRILIUNAN DAN PUNYA GARASI LEBARRRRRRR\n\nAAAAAAAAAAAAAAAAAANJEEEEEEEEEEEENGGGGGGGGGGGGGGGGGGGGG\n\n(gatau mods bakal remove this one tp sorry bngt kalo ngelanggar aturan. kalo ada yg butuh Editor buat video Ads, MV, youtube dll bisa kontak saya, siap kerja and feel free to reach me out😎👍🏼)",
            "Sopan gak sih tunggu dosen di depan kantornya tanpa konfirmasi izin? Mau bimbingan tapi chat dibaca doang sejak 6 hari lalu, dan tiap chat setelah itu juga hanya dibaca.  \nEdit: 1 jam setelah aku post ini, dosen langsung membalas.",
            "butuh fitur restart di hidup ini",
            "kampus asuu, UKT ku kok max anjeng",
            "gwaenchanaaa, at least i tried my best, kalo remidi tinggal nangis🫂",
            "Layoff teros!!!\n\n\n\n# LAYOFF TERUS JANCOK!",
            "yang dulu mimpiku, yang dulu kudoakan. ternyata pas udh tercapai malah buatku sakit.",
            "ketika mimpimu, yang begitu indah, tak pernah terwujud.... yaudahlah ajg",
            "Asssuuu kau spx, paketan udah seminggu statusnya cuma sedang dikirim ke kota tujuan, cok\n\npaket lain yg lebih jauh udah pada nyampe yg satu ini malah gak jelas asu",
            "\"ubah mindset, jangan cuman nyari jadi karyawan aja, buka usaha berani ambil resiko, dasar SDM rendah\" \n\n\nMenset menset menset!! Ringan banget tuh ketikan. Gw yang udah bergelut di dunia usaha lagi pusing dengan menurunnya daya beli masyarakat. \n\n\nAda yang bilang karena judol, tapi iya sih cukup make sense, ketika duit banyak di pake judol pasti bakalan menghemat untuk pengeluaran yang lain, yang bahaya ini kalau sampe berpengaruh ke kebutuhan pokok. \n\n\nJangan2 daerah gw banyak pelaku judol nya, soalnya teringat tetangga pernah bilang \"tuh si A main game dapat duit\". \n\n\nPokoknya judol anjeng!!!!!",
            "[deleted]",
            "Judol Pinjol Tipu anjing disekitaran gw sekarang ga jauh-jauh dari 3 hal kontol ini. Anjing anjing di legalin aja lah semuanya, setidaknya bisa jadi jembatan.... OIA ANJING PAJAKNYA KAN DI KORUPSI.\n\nKontol, Indonesia ga jelas. SMP gw bilang Indonesia gabisa diselamatkan. Satu dekade malah tambah nyungsep.",
            "Ya ampun udah tau nyari kerja susah mulai lah banggggggg\n\nCepet cari kerja part time di kfc juga boleh biar gw bisa resignn\n\nSeumuran elu gw bolak balik part time elu malah tidur di rumahhhhhh lu kira gw ga pengen tidur seharian????",
            "Retainer gigi patah, harus ke spesialis ortodonti yang orangnya jarang praktek dan sering fully booked.\n\nPerlu ganti velg dan ban motor soalnya bocor tipis di bibir meskipun sudah di-press, mungkin karena velgnya udah ga bulet lagi.\n\nThere goes my money....",
            "kemarin di tanyain play it safe or take a risk? trus hasilnya gitu malah ribet sendiri, jd ikutan pusing mikirnya",
            "H-1 projek MSIB gw publish, 4 orang sekelompok 2 doang yg gawe, gw sama si artist. 1 orang ngilang, 1 lagi ga becus jadi programmer anjing banget w yg nalangin bikin main menu aja 2 minggu ga kelar, w maksain ga masuk kampus kelar berapa fitur ajg",
            "Wow, if I had a nickel for every time I had a crush that chose another guy as their bf, but was still close and affectionate with me, I would have had two nickels, which isn't a lot, but it's weird that it happened twice, right ?\n\n[why](https://www.youtube.com/watch?v=9n-5YJYVG50) yes it sounds like straight from k-drama or novel or fiction whatever, but even i puzzled about it.",
            "Bos taek. Dijelasin panjang lebar, malah nanya balik yang ga jelas dan muter2, membuat bodoh gw dan tim di depan departement lain.\nGw juga ada dasar alasan kenapa mau develop suatu product, malah ditanya ga jelas muter2 dan dieprmalukan. Ga heran perusahaan kaga berkembang, ga bisa ngikutin wave. Mau jd innovator, giliran dikasih yg out of the box ga berani execute. Tai kucing\nGoblokkk, gw pindah dari company sebelumnya ternyata dapet yg lebih buruk bosnya. Kontol lah ini semua.",
            "Makin kesini gw makin ga sabaran sama org2. Kayaknya pada kurang self awareness lama2. \n\n\nGw jg ngerti sih ini sbnrny dari diri gw sendiri, cmn lama2 males curhat juga. ",
            "Lagi ngerasa hidup monyet bgt anjing",
            "I don't get why the more i try harder and hope strongly things will most likely not work out in the end. \n\nBackward laws are the rules, seeking for ceritainty is a fool's errand. What else can i do than moving forward, out of spite to see how it ends?",
            "Tai banget atasan",
            "So far doesn't have any good news at all, makin takut kalo ini bakal passing point yang udah di tentuin dan tentu bakal makin ambil langkah yang ekstrim. I just hate myself making wrong decision here and there and caught in this shit, fuckkkkkk mending stay aja kemarin despite my deeper self telling me I would die with that working hours tapi ya stay afloat nya certain nggak mungkin juga mati karena overwork fuck me lah goblog banget percaya sama diri sendiri sekarang diri sendiri juga yang susah, rasanya pingin hilang aja lol nggak pigin beratin pikirian orang lain wkwkwk",
            "i feel a bit disappointed at myself for getting the biggest leeway i've ever gotten in my academic life yet felt underwhelmed in terms of what i show back. im just not disciplined enough to work by myself/with my own motivation. im grateful for everything that ive got in life but i feel like im taking things too much for granted",
            ">!Since I don’t know where or who to go…!< >!TW. Tried posting on r/SuicideWatch but post didn’t show up lmao!<\n>!I’m giving up. I’m reallllly giving up. I can't.. I can't do it anymore.. what should I do?!<\n>!I also don't know who to go to anymore, and I don't know what kind of help is helpful anymore.. I just wanna go.. how do I go from here? In the least painful and easiest way?!<\n>!People say they care… but.. do they? No. I don’t think so.!<",
            "\"it's football and not socc-\" ok do i look like i give a fuck",
            "Gw ngatain woke culture di sub indonesia yang terkenal banget untuk kebenciannya terhadap LGBT dan semacamnya, eh banyak yang downvote.\n\nGa nyangka gw di indo banyak penyepong woke barat. Oooh, the irony. Coba ya kita liat post ini dapet berapa downvote, which will prove my point.",
            "I was used to wanna slap the fuhk outta my history teacher's face with my both hands",
            "Mg Mg. Guys mau tanya ada yang tau di mana tempat buat foto keluarga / wisuda yang harga paketan paling murah & hasilnya oke di sekitaran  BSD atau Gading Serpong ? Yang tau boleh dong bagi info nya, thankyou.",
            ">Does this mean I have to partake on showing off how my days went to random people through social media as a shotgun method to gain more attentions?\n\n  \nAre you me lol. Tp klo gue biasanya tetep sedih abis ngepost di sosmed soalnya ga dpt attention yg gue mau, skrg akhirnya mutusin buat ngurang2in sosmed dan cuma make klo lg mood bagus aja.",
            "> jangan pake banyak tingkah, jangan pake cipiki cipiki, just come, work, lunch and home\n\n  \ni wish i can do that in my line of work lmao",
            "just interact as needed. u, and me as well, we will be strong alone. jaga diri sendiri aja, g bakal ada yg jagain kita apalagi di kantor",
            "I can vouch for this.\n\n  \nMy company is one of the biggest FMCG in the world. \n\n  \nMy days feel like hell, but compensation remains unmatched by other companies. And I need the money. \n\n  \nSometimes ppl say that I should just shut up and enjoy the money but day by day I feel like everything I do is mumbo jumbo bullshit.",
            "tergantung situs apa yang anda buka",
            "lol gw merasakan ini. gw langsung log out dr ig wkwkw.\n\nposisi gw skrg lagi nyusun skripsi dan bawaannya pen ngilang aja (tapi gak ngilang saat bimbingan). tapi disisi lain gw gak pengen fomo kalo sama F1 di sosmed anjir tapi males buka stories ig temen yang udah di acc ama dosen huaaaaaa (yes gw lemah)",
            "Kayaknya isi sosmed mu postingan yang judgemental, berita negatif yang isi komentar nya toxic, dsb. ",
            "Nangis aja gpp",
            "Same, bro, gw setelah konsul ama psikolog dan berusaha maintain workout atau aktivitas kek olahraga, hobi (gw suka ngegambar btw) dan interaksi ama temen, , jadinya kesibukan gw terarah kesana, jadinya gw nggak kek orang gabut yang pelampiasannya ke ngeluh terus dan doomer, kek rata2 temen FB atau Discord gw. So, yeah, we are same bro.",
            "Kata tmn gw d oz, kalo ad yg depressed di sono, basic medicationnya kalo ke dokter itu disuruh do sport and workout",
            "It really depends sebenernya. \n\nKalo emang depresi nya udah kadung bertahun-tahun dan dia ga ada sedikit nyoba untuk berubah ya berarti masih di tahap limbo. \n\nThats the hard thing with depression, kadang kita mau bantu, tapi emang kalo udah too much buat kita sendiri dan mulai taxing sebenernya ok juga kok untuk back off. Karena ya emang real aja pikiran negatif bisa nular, apalagi orangnya lagi di posisi ga stabil.",
            "What war?",
            "Sama nih bro wkwkwk bidangnya juga sama, semangat brow cari2 kliennya, jatuh sekali bangkit dua kali.",
            "Udah nyoba cari kerja? Yang full time gitu, bukan freelance.\n\nAnyway, I know how you feel, man. I've been there too. Semoga sukses, rajin rajin asah skill ya bro.",
            "Kalau sudah menyangkut bimbingan dosen, sudah harus bodo amat dengan \"sopan\" yang penting bimbingan jalan. Kalau bisa, samperin ke rumahnya. Kalau dosen-nya masih terus nunda2, lapor ke kepala jurusan/sekjur untuk minta ganti dosen pembimbing secepatnya. Hak lu sebagai mahasiswa itu mendapat bimbingan karena udah bayar UKT.",
            "Itu kan tanggung jawab dosen pembimbing. Kalau ternyata dospem lari dari tanggung jawab, nyepelein, atau nunda-nunda tinggal lapor aja. Nanti diganti dospemnya.",
            "biar gaji aTaSAn naiK bRoK,,",
            "and this post gets you a ban from the sub :)",
            "Ekspektasi lu ketinggian kali",
            "Atasan: tai banget bawahan!",
            "“In truth is i welcome homosexual couples, particularly like the lesbian sort”",
            "I also used want to pour gasoline into teachers' lobby, soon one of em lit cigarette the room goes *Ka-boom!*",
            "Ya bro. Sejatinya ya gue ga suka ngepost banyak2 di sosmed karena banyak info yang gue rasa ga penting untuk gue share ke orang lain. I do post sometimes, cuman gue ga suka aja ngepost jebrat jebret. \n\nGue suka ngomong ngasal dan kalo gue sering ngepost di sosmed juga jadinya bisa naikin chance of error nya lebih gede dan ngomong blunder wkwkwk, makanya males",
            "Well, sosmed.. ig dan tiktok",
            "Sebagai sesama mahasiswa akhir, semangat bro kurang-kurangin screentime bener bener dah kaya lumpur hisap sosmed itu..",
            "Kalau gw perhatikan malah banyak hopecore, motivasi, cuman sejujurnya bikin capek juga bro.. ini udah kurangin screen time udab lebih baik",
            "WW3",
            "Well unfortunately gw harus agree sama dia. Beberapa mod reddit emang orang orang biased dan unprofessional, mentang mentang punya authority, suka power abuse.\n\nGa cuman mod indo aja. Oh also, ga cuman reddit.",
            "Probably thats the reason",
            "And i was used to wanna ransom my religion teacher's hot daughter with my unc old krista",
            "Nah ini, gue jg suka takut blunder makanya skrg mikir berkali2 seblm ngepost trus ujung2 nya ga jd ngepost. Skrg lebih nyaman ngepost di reddit soalnya klo blunder jg anon ini.",
            "Bener2 kerasa sih ini terutama kalo lihat temen2/keluarga pada ngumpul2 di IG, saat lu merantau sendirian, bener2 amplified lonelinessnya.",
            "Postingan hopecore terkadang malah jadi toxic positivity sih, bukannya termotivasi malah ada rasa tertekan ",
            "Wowo-Wiwi 3 periode?",
            "gini, gue jelasin aja disini, sekali aja.  sub jakarta tuh benernya cuma buat orang nanya2 ngepost disana, and dijawab sama orang lokal jakarta and expat2 yang tinggal dijakarta. tapi makin banyak orang yg ngepost di jakarta, nanya ngak pake sopan santun, bikin belasan thread buat nanya hal satu per satu. ngak pake hello, makasih, udah kayak nanya chat GPT aja. ni orang 1 juga gitu, gue dah jelasin di message dia kenapa di remove, malah ngata2 scum, ya udah lah kebanyakan juga orang over previledged. gitu loh. gue sih jalanin mod jakarta sukarela, biar rapih2 aja, biar gak di spam. and itu gue jalanin sama mod laen begitu rule nya. beda sub beda rule lah.",
            "Yep, back to this place again. \n\nEntah lah, gue ngerasa juga gue perlu join sub baru lagi. Mungkin nyari tempat buat buang sampah pikiran di self ato ngobrol nanya2 di tempat laen biar dapet perspektif baru.",
            "Kebanyakan emang drain energi bro, instead touch the grass malah fokus ke layar jadi ya untuk apa wkwkwkw itu sih yang gw pelajari beberapa minggu ini.. motivation is shit without action."
        ]
    },
    "Imagine if our government ain't corrupt, we could have a better life environment like this too 😂": {
        "title": "Imagine if our government ain't corrupt, we could have a better life environment like this too 😂",
        "score": 315,
        "url": "https://v.redd.it/43tuv0wiy28d1",
        "content": "",
        "num_comments": 70,
        "comments": [
            "oke, tbf ini namanya 'kota mandiri', di mana suatu wilayah (nggak harus segede kota) bisa berdikari dan membangun infrastruktur mereka sendiri tanpa bantuan pemerintah.\n\nyg kayak ginian ada banyak di luar negeri kok, ada yg gagal, ada yg berhasil, ada yg tujuannya baik, ada yg tujuannya nyari untung, dan ada yg tujuannya jadi markas sekte tertentu.",
            "Mari kita tunggu detail seluruhnya. Kemungkinan ini desa tempat agrikultur skala besar yang sukses dan tetap bertahan, dan karena gak sedekat itu dengan kota. Tidak menjadi komplek sana sini menghancurkan potensi produktif tanah",
            "It’s frustrating to think about what could be achieved without corruption.",
            ">Ga nyampe 271 trilliun \n\nitu nyindir siapa ya",
            "Gue malah ngebayangin kalau kita jadi negara yang kelewat bagus, kita akan less dependant sama US. Takutnya malah dikondisikan kayak libya. Wkwkwk",
            "Coba liat aja kuala kencana sebagus apa di manage freeport wkwkwk",
            "Bintaro, BSD, Karawaci, Serpong, kayak gini semua. Bisa bagus karena developer yg megang, bukan pemerintah",
            "Keren nih desa modern banget. Gaspol terus gan !",
            "Di bbrp penelitian game theory, kesejahteraan bersama bisa tercapai kalo pesertanya bekerja sama, tapi gak naif juga dengan punish yg nakal, strateginya disebut tit for tat",
            "kebalikan dari sukolilo",
            "kalau ga korup gimana mau balas budi\n\nbalik modal",
            "Ini di daerah ciamis kalo gk salah, yg punya mega baja\n\nDulunya punya objek wisata water park icakan, dan hijrah jadi pesantren",
            "We can have even better when we remove the current government, and of course with violence 🫶🥰",
            "Oh ini toh gaspool sering liat gw di baju orang sama mobil pickup 😂😂😂\nRame juga ya",
            "Agak norak desainnya tapi hey it works",
            "Semua akan rusak kalau klan M n M datang Dan pengen jual besinya",
            "Ya Tuhan berikanlah hamba - hambamu kebijaksanaan dan kemampuan untuk membina sebuah kerajaan usaha minimal seperti pak haji ini sehingga bisa menaikan taraf kehidupan masyarakat sekitarnya.\n\namen",
            "looks like a must visit place",
            "150ha bukan hak milik kan ya? Karena setau gw per keluarga ga boleh punya tanah lebih dari 20ha",
            "Buat yang penasaran sama lokasi Desanya (Street View)  \n[https://maps.app.goo.gl/3AGmzT7SUBsCYLGb9](https://maps.app.goo.gl/3AGmzT7SUBsCYLGb9)",
            "Pagar hidup itu maksudnya apa ?",
            "mantap sih kalo ini",
            "vote Pak Haji Abun sebagai RI-1 ,\n\ndan Komunitas Gaspol-nya untuk mengisi jajaran kabinet 🦅✊🏻",
            "They can live good just by having dorian farm, and government tell people they got no money from all that gold, coal, nickel mine and palm oil farm......fuck!",
            "Pak haji abun for president!",
            "Sekte apa lagi ini?",
            "Di Tangerang banyak kayak ginian, ada BSD, Alam Sutera, Karawaci, Bintaro Jaya.",
            "Ya di bandung kan namanya malah \"kota baru parahyangan\".",
            "Nanti jadi kayak kota cheran di mexico.",
            "Redditor kalo komen gak bawa luar negri mati gak ya",
            "Ketika Pak Haji bangun kota mandiri di Sukamulya, semua orang menyanjung. Tapi ketika Aguan.. /jk",
            "mudahan nggak jadi jonestown versi indo",
            "Jonestown\n\nhttps://preview.redd.it/tcg87rbou38d1.jpeg?width=320&format=pjpg&auto=webp&s=b06a1ebae14a1cb3611e72c40ae475878d076dfc",
            "Kayak pola pemaksaan status \"lemah\" baru terjadi pasca dominasi AS aja.\n\nMental korban kayak gini dibuang sama RRC dan liat dimana mereka sekarang. Suatu pihak bisa jadi korban, pelaku atau tak terlibat. Jadilah yang kedua.\n\nDikit dikit nyalahin negara asing. Jepang beruntung gak punya mental ini, Korsel terpaksa ngebuang mental ini. RRC sama Taiwan melihat pihak asing sebagai pembantu dalam membangun.\n\nMental korban itu pertanda SDM rendah. Karena tak percaya dengan kekuatan bangsa sendiri dalam mencapai negara yang menjadi seorang aktor\n\nLibya sendiri pas Gaddafi jatuh udah gak punya ketergantungan sama AS. Malahan bergantung sama Italia dan Rusia",
            "tiba2 ada isu teroris\n\nintinya gaboleh ada negara yg independen",
            "Udah dari tahun 65..memang roadmapnya itu kan. Selama benci komunis, bloknya selalu ke barat..",
            "Lw pikir selama ini kita ga dicoba dikondisikan, mang demo2 macam 212 cuma ulah aktor dlm negeri (ingat ad Staf kedubes jerman main ke markas fpi?), pasti ad juga mereka maen2. Tapi untungnya skrg US dan EU terlalu sibuk ma Russia dan Cina jadi kita ga gitu dipedulikan lagi, hidup multipolar world!",
            "wkwkwk ga bakal bisa. white supremacy masih merajai dunia ini broooo....",
            "Gerakan pan-pan dipangkas abis",
            "Well andaikan Gaddafi gk support gerakan terorisme sma separatis di seluruh dunia (termasuk GAM) mungkin Libya bakal maju kayak Saudi, Qatar, Uni Emirat",
            "Selagi kaga musuhan sama AS mah pasti dibiarin, yang penting ga komunis dan demokrasi jalan terus wkwkwk (yang kedua agak meragukan)",
            "kebanyakan halu para nasionalis ini. buktinya jepang ya maju aja tuh. ini mah tergantung posisi kita nyenggol US seperti china/russia gak?",
            "Pola tata ruang kuala kencana itu sebenarnya sama kayak BSD, kota baru parahyangan, PIK, citraland. Sama2 aliran USA yang car-oriented, bedanya kuala kencana lebih rapih dan konsepnya lebih hijau",
            "tit for tat bisa ancur semua kalo gada yang mau ngalah...",
            "Oww beliau juragan the op galvanized square steel",
            "Oalah, toko langganan gw ternyata, hebat bener bosnya ini",
            "Yang saya bingung itu, lokasi kebunnya disebelah mana yak? 150 Ha tuh",
            "Using living plants as fence instead of your typical cement / steel / wood / cut bamboos.",
            "Tapi dikembangin developer tujuannya yah tentu buat balik modal. Salut c sama bapak satu ini.",
            "Bogor juga ada buat wisata seks timur tengah & kawin kontrak wkwkwwk",
            "Sumarrecon gedebage otw tuh",
            "Yup, itu jalan flyover dari exit tol padalarang ke kota baru pakai dana swasta juga, gak kebayang dah kalau mereka gak bikin itu, bisa mati mampus macet-macetan di persimbangan exit tol itu. Salut lah o7",
            "I see this image everywhere",
            "Looks like someone need some freedom and democracy",
            "Dari jaman sukarno gue yakin udah ada usaha destabilisasi tapi gak semasif libya karena kita gak self sustaining.\nKalau kita udah mendekati self sustain, usaha destabilisasi gue rasa akan makin masif.\n\nKalau gak salah, gue sempet denger isu US sempet gak suka waktu kita berhasil bikin pesawat pake fly by wire karena itu berarti kita bisa menuju advance dalam soal industri pesawat.",
            "Somehow gue percaya itu. US gak akan mau kehilangan hegemoninya atas negara berkembang. Kalau ada negara asia dan afrika yang berpotensi maju, pasti akan ada aja penjegalannya. Apalagi majunya Indonesia berarti Indonesia akan punya kekuatan lebih untuk ngebangun militer dan alutsista dan itu akan ngeganggu Australia. Wkwkwk",
            "Ketiga negara tersebut bekerja sama dengan erat dengan amerika. Apalagi kalau soal alat perang. Mereka amat sangat bergantung sama US. Bisa dibilang kalau US adalah primary partner mereka. \n\nInget kasus jamal kashogi? US gak ngasih sanksi ke saudi. Inget soal kasus qatar dituduh mendukung terorisme yang sampe saudi mutus hubungan diplomatik sama qatar? US gak ikutan ngeblokade/mutus diplomasi sama qatar.",
            "Jepang sama korea emang maju, tapi mereka jadi \"protektorat\"nya US.\nGue sendiri gak yakin kalau indonesia akan mau berseberangan sama US semaju apapun bangsa ini nantinya.",
            "Yup, salah satu yg punya mega baja",
            "Habibi goes to Bogor",
            "Tinggal nunggu tol jadi sih, kalo iya lumayan mantep",
            "Itu flyover cakep banget waktu malem, ada lampunya lagi.\n\nJuga pernah liat club lambo di situ. Ya di situ jalan memang mulus buanget, layak buat supercar.",
            "![gif](giphy|ucXFcY1FdKaT6)",
            "Kalo sampai indonesia kembangkan nuklir baru gw setuju, tapi kalo indo cuma upgrade alutsista doang kemungkinan gak akan sampai buat aus buat nyenggol indo secara kasar walaupun udah kebakaran jenggot juga",
            "Dan beberapa tahun kedepan, yang awalnya superpower bakal jadi sama-sama negara berkembang 😆",
            "politik itu kepentingan.",
            "Libya ancur karena karma mereka dukung gerakan separatis di seluruh dunia. Bahkan pasukan GAM dulu disupport sma Gaddafi, sebelum akhirnya dibuat tobat gara2 tsunami Aceh\n\n\nhttps://nasional.tempo.co/read/16120/ribuan-anggota-gam-pernah-dilatih-di-libya",
            "Kalo lu buat argumen gitu. RRC sendiri termasuk protektorat AS, se anti antinya RRC. Mereka gak bisa sepenuhnua anti AS\n\nwong basis industri RRC adalah modal AS dan konsumsi negara Barat\n\nRRC tanpa pasar Barat bakalan overproduksi, karena memang. Output industri mereka sebanyak itu tapi, dibuat untuk ekspor sehingga kalau pasar yang bisa dimasuki berkurang. Dampaknya buruk",
            "nah makanya gw ragu aja indo akan dijadikan libya selama indonesia gk temenan sama russia seperti jaman soekarno. Libya dulu juga sering bikin masalah dengan sponsorin gerakan separatis dan marxist gk heran negara barat mau ngehancurin tuh troublemaker",
            "Nyenggol kasar mah kayaknya enggak. Ya paling adu show of force aja dengan ngadain joint military training di lokasi yang agak rawan."
        ]
    },
    "Bule makin berani bikin konten ginian, ngerusak harga pasar dan komoditi Bali nantinya ": {
        "title": "Bule makin berani bikin konten ginian, ngerusak harga pasar dan komoditi Bali nantinya ",
        "score": 162,
        "url": "https://i.redd.it/04aoasfdc38d1.jpeg",
        "content": "",
        "num_comments": 107,
        "comments": [
            "Terjajah secara halus oleh perorangan. Bukan kompeni lagi",
            "Emang udah rusak, dan lagi gw sempet liat2 beberapa iklan properti di Bali. Di sana itu kebanyakan pemilik tanah jualnya per are (100m) dan banyak yg sampe puluhan, ratusan are. Yang kayak gitu siapa lagi yang bisa beli kecuali yang duitnya banyak? Yang pasti kerjaan yg di Bali ga support banyak orang bisa punya tanah dan rumah masing-masing bagi orang lokal",
            "Saya orang Bali yang ga bisa beli tanah di Bali lol. ",
            "Harga villa di Bali buat market bule sejak dulu harga bule. Cm sekarang banyak villa yg punya bule, jadi duitnya ga masuk ke lokal",
            "Love that immigrant crisis are becoming a worldwide problem with developed countries being flooded by immigrant from developing looking for better wages or simply better living condition while developing countries are receiving immigrant from developed countries looking for cheaper living price.\n\nAlso displaced refugees from wars or just simply draft dodgers doesn't help with it at all.",
            "Sebenernya ga cm bule. Uang Jakarta banyak yg muter di sana. Beach club yg jumlahnya udah kaya mini market itu emangnya punya bule semua?\n\nBali udah over tourism dan org udah sering ngmg ini sampe2 istilah “overtourism Bali” kaya udah lost all meaning.\n\nPemda Bali harus mediasi sih emang. Ga usah lagi ngejar juara semu “pulau terbaik” atau “tujuan wisata terbaik”.",
            "makanya males kalo ada thread bule yg nanya mo hidup di indo, fk off bro",
            "Thank you Bali for being the containment zone of all the annoying white tourists in our country",
            "Orang bali nya kayaknya fine fine aja tuh, apapun bule pokoknya",
            "Gentrification udah sampe sini kah",
            "lets gather and lock them there, don't let them get to another city",
            "https://www.reddit.com/r/worldnews/s/i5KapP8Nsv\n\nBaru aja baca post ini dan dibawahnya langsung dikasih post masalah serupa dinegara sendiri..",
            "Kekny yg bakal sengsara orang balinya juga, ya selama mereka rela digituin ya terserah sih",
            "SLAVA BULE",
            "These bule Mostly cant Afford a lot of Bali vila anyway.  Especially the European bule. Their salary actually low. The one who can afford it are Americans bule or really rich ruski. The American bule don’t go very far. They don’t need Bali when the get Mexico and Costa Rica really close by. Plus this villa cost the same as a house in Pensacola beach in Florida. So they don’t have to go far. So it leave us with the rich Russians that’s why you see them a lot in Bali and like in Phuket Thailand they are mostly who own the nice villa. The European bule are usually the poor one that’s why you see them staying in hostels or rent AirBnB for a couple months and go home.",
            "So Sultan policy is not bad after all",
            "Ya, mungkin di sana dia sudah punya privilege atau sudah punya nama, jadi dia bisa langsung share di media sosial untuk penjualan rumah.",
            "Wait, berarti ni bule2 bisa dapet SHGB?\nAtau malah dapet SHM juga?",
            "Tapi 30 tahun lagi banyak bli dan gek yang tiba2 tinggal di villa estetik fully furnished",
            "banyak juga di meksiko. apalagi waktu banyak bisa remote work. lingkungan lebih murah, gaji level usa, full gentrification.",
            "semoga gak separah hawai'i",
            "Hilang respek sama bali, jadi biarin aja. ",
            "pulau bali to pulau bule speedrun any%, let's gooooo",
            "gw lebih peduli sama bau badan bule2 yg hina bgt baunya, asli lah sebelum masuk indo harus ada penyuluhan buat mandi minimal 1x sehari kek ato ga bikin jd peraturan wajib gitu",
            "wkwkwkwkwk\n\ngapapa selama bule",
            "Yang dibali bikin propaganda aja sama kayak dijogja dulu yang menolak pembangunan hotel yang menjamur “Jogja Ora Didol”",
            "Le pejabrut Bali dan pusat: tttttapi... Bule kan bawa uang",
            "Nah, this will make TAPERA Cost rising 💀💀",
            "Bali become Roanapur soon",
            "Tbh bali harusnya dibikin peraturan kayak jogja, gak lokal gaboleh punya properti",
            "White people fucking up everything all the time as always.\n\nRasanya pingin bikin \"reverse racism\" jadi nyata liat bule-bule ga tau diri gini.",
            "Bali sudah berevolusi, now isinya caucassian and westerners (which is good since hopefully they bring a lot of cultural enrichments)",
            "Unpopular opinion: nggak eksklusif di Bali. Dan nggak mesti bule penyebabnya.\n\nIMO pasar modal kita kurang sosialisasi dan kurang bisa dipercaya (banyak manipulasi). Orang berduit kebanyakan umur di atas 50, sulit mempelajari pasar modal, paling simpel & reliable beliin properti.\n\nKalo nggak percaya lihat LHKPN yg beredar di sosmed, mungkin di atas 80% kekayaan pejabat berupa properti. Belum lagi pelaku usaha non-korporasi yg kebanyakan buta pasar modal.\n\nMakanya demand properti menggila dibanding kenaikan pendapatan kaum di luar top 5% bracket.",
            "Lol nyalahin turis. \n\nBanyak itu teman & family yg udah punya tanah & villa di Bali. Itung2xannya masih jauh lebih murah drpd punya villa di Bogor/Puncak/Bandung, walaupun pergi kesana mesti bayar pesawat.",
            "Something something gentrifikasi",
            "https://preview.redd.it/qjy1zv95a48d1.jpeg?width=720&format=pjpg&auto=webp&s=67f2efbd4548416f91e118399a004c57e800242c",
            "Kenapa dijualnya per adalah ?",
            "Bali is the new Betawi",
            "tbf though, it applies to every country.",
            "Punte mau nanya, gabisa nih karena aturan atau karena ngga ada duitnya? 😅",
            "emang harga rumah rata-rata di denpasar brpaan?",
            "Makanya Starbucks terooos.",
            "Mereka ngakalinnya gimana ya bukannya properti ataupun area di sana gaboleh dimiliki wna? Kalo ada juga warga lokal yang mau dipake namanya buat mereka kok pada mau? Atau karena duit? Genuine ask",
            "Duit nya ke DIRJEN PAJAK🤑",
            "the true issue is overpopulation but no one wants to call it out cause the solution is inhumane etc.\n\ntapi sumpah satu planet can only support so much creature",
            "Makanya udh banyak ekspat lari ke Indo bukan lagi lari ke Ameria untuk ngejer American dream, tapi ngejer mimpi live in Indonesia is cheap and easy.",
            "I'm bule from Polandia and I studied Indonesian for one reason. To live in Indonesia among Indonesians and to enjoy Indonesian culture without these obnoxious foreigners, creeps.\n\nBule won't go to other provinces where Muslim people live lol. You can be sure there will not be any tourism in Aceh or Bogor :)",
            "Underated comment",
            "You do you until bali fucked up themselves and cry for help",
            "Karena belum terlalu berasa aja efek gentrifikasi nya. Nanti kalau udah terpinggirkan baru nyesal.",
            "\"Yg penting bukan Jowo\"",
            "Because their campaign is \"Bali for bule\"",
            "Gapapa yang penting tuhan bule seneng 🙏🙏",
            "Majikannya org Bali tuh bro ya pasti seneng lah mereka, asal bkn org lokal gapapa 😂",
            "Ini orang2 yang komen gini gatau apa2, rata2 orang bali gk kaya gitu tapi pemerintahanya yang terlalu cinta bule",
            "Baru sampe bali ajasi sementara ini. Kalo versi lokalnya udah mulai di Jogja.",
            "Geser dikit ke Lombok",
            "Cyka bli.... Yat",
            "Most of my friends buy holidays homes in warm places like Croatia, Montenegro, Italy (some depopulated cities give away old homes for free).\n\nFor most of us Europeans, Indonesia is a nice place to spend a couple of months, but holiday home is southern Europe is better for many reasons:\n\n* we have Europeans citizenship- no need to apply for visa\n* can buy a home without much ado, get legal work\n* no problem with police, immigration\n* drinkable tap water, great healthcare - important for older people\n* no malaria\n* 2 h flight to visit family\n* Italian food is as tasty as Indonesian\n* Europe is rich, vast, and safe place. Look up Portugal, Greece, Crete, Sicilly, CAnarias islands...\n\nRussians don't have much choice really. They are not welcomed in EU. Their weather sucks. Indonesia is closer.\n\nAverage salary in my city is 30jt / month. If our salaries are low, why do I see so many pekerja migrant indonesia in my city?\n\nYou can't imagine how cheap Indonesia is for Polish citizens. Property prices in Poland or UK are really much higher :)",
            "Sultan DIY: dibilang juga apa\n\nEh, tapi dia kan ke chindo. Gak tau klo bule",
            "Mereka beli lewat agen properti, agen properti nya punya bulé dengan investasi sekian M. Mereka manfaatin cara cara kek agen properti luar dimana agen beli land (HGB) kemudian dijual / rent. \n\nSo technically it's HGB, tapi rasa SHM.",
            "And most importantly, foreign currency!",
            "Kenapa kekayaan pejabat di LHKPN berupa property, ya karena property itu salah satau bentuk wealth yg tracingnya paling mudah, jadi mereka ga bisa sembunyiin. Most of their wealth are stored in Singapore dan ga bakal dideclare di LHKPN.",
            "Memang harga villa di kawasan puncak kisaran berapa ?",
            "Kalo hal ini, sepertinya rasa nasionalisme lebih tinggi daripada kesukuan. Lebih sebel tanahnya dimiliki bule daripada dimiliki orang beda provinsi",
            "pls ELi5 asal muasal TMD",
            "not sure if ignorant or trolling...",
            "As another Balinese, it's the money..\n\nAnd my grandpa used to give his fields to the local guys who are now rich from selling them lmao",
            "Ga nyambung",
            "Sudah anda jawab sendiri itu bang wkwk",
            "Itu btw warloknya bisa jual aja kan tanpa izin? There's no way a binding contract would win against a national law",
            "\"Harusnya\" gak boleh. WNA gak bisa beli hak milik. Bisanya cuma sewa atau hak guna bangunan. Itupun waktunya lebih terbatas dibandingin WNI (cmiiw). Ngakalin pake nama orang lokal sih bisa-bisa aja. Tapi jadi gak ada proteksi buat si bule kalau misal asetnya diakui si lokal tadi. Atau misal si bule mati, asetnya gak bisa diwarisin, dst.",
            "It's really not over population. It's that the population is highly concentrated.",
            "overpopulation in certain economic class*",
            "Solusinya adalah breeding license, tapi emang sebenernya ga viable karena orang tua perlu dibiayai oleh anak muda ntah secara langsung atau tidak lamgsung, jadinya ya infinite pyramid scheme",
            "Yg gak mampu ngejar American Dream alias second rated yg kabur kesini, disini di dewa2 in... Siapa yg goblok? 🤣",
            "Happened once when COVID-19 and bali doesnt learn anything",
            "Terus nanti marah nya sama pendatang lokal bukan sama bule",
            "Mereka sama sekali ga belajar dari betawi. Orang betawi asli sekarang kegusur sampe tatar sunda (parung, rangkas, bogor, karawang, cikarang, teluk naga, dll).\n\nApakah orang bali bakal menjawakan diri? Udh jelas kalo mereka cuman bisa rebutan wilayah sama nyi blorong-nyo roro kidul Wkwkwkwk",
            "Sama2 item Rasis🤣",
            "eh jangan, mereka cukup jadi turis saja jangan jadi penghuni tetap \"we love you as a guest but do not overstay your welcome\"",
            "Bule kan belinya pke perantara atas nama orang lokal. Diatas kertas yg beli orang lokal jadi fine aj",
            "TIL.\n\nBerapa dekade lagi ya sampe akhirnya warga lokal beneran tersisihkan 🤔",
            "thats what i mean by enRICHment",
            "Makanya gw ketawa aj liat bocil bravo bravo ngimpi Indonesia akan serang Singapura tiap ada berita TNI dpt alutsista baru. Mereka ga tau bahwa kekayaan pejabat TNI dan lembaga pemerintah lainnya banyak disimpan di Singapura jadi mereka ga mungkin serang SG karena itu akan hanguskan harta mereka di SG",
            "[Yuo still got this newGOD](https://soyjakwiki.net/TND)",
            "It's called a joke you donut",
            "Damn, gw blum pernah si diposisi kek gitu jadi kek penasaran aja kok bisa wkwkwk",
            "Udah ada kejadian kasus tanah/bangunan hak miliknya dibawa kabur oleh warlok. Bahkan Bulenya masih hidup udah ada yang berani.",
            "benar, ini bukan masalah jumlah populasi in general, bumi secara teoritis masih bisa sustain jauh lebih banyak manusia dari yg ada sekarang, tapi untuk membuat seluruh penduduk bumi itu punya tingkat kehidupan macam penduduk amerika serikat itu unsustainable. Diperkirakan kita bakal butuh [4x luas bumi ](https://www.bbc.com/news/magazine-33133712)kalau mau semua penduduk bumi menikmati tingkat kemakmuran yang sama.",
            "\"YEEEE----\" Some Riziq guy\n\nYah gimana lagi realita terkena buying power Bule\n\nMiddle class auto-upgrade ke Upper",
            "Its crazy how they didn't learn anything,  I visited bali post pandemic and went to a mall with my balinese friend to eat and they looked at us like we were filth",
            "Sama Jawa lah",
            "Kayaknya masih pada main rapi ya. Gak keliatan iklannya blak2an kayak yang di post ini",
            "Apa juga salah singapore",
            "pertanyaannya, kenapa madura? kan yg rame ribut ama jawa wkwk",
            "Online jokes is is really hard to tell these days. That's why /s is invented",
            "How did they know you weren’t Balinese? Do you look different?",
            "Berarti orang Madura aman aj ya",
            "The M in TMD means muslim",
            "Bilang aja \"tHiS Is EnDoNeSyA! NoT Yu eS E!\"",
            "Tapi itu jokenya cuma translasi secara harfiah doang bukan sarkasme yang kadang susah dideteksi.",
            "Jamet",
            "oh wow oh lawd",
            "Have you seen how many question in this sub than can be answered with simple google?\n\n\nFor all I know, dude could be genuinely asking",
            "I know but, jualnya per are --> per adalah. Come on bro. Lighten up a little"
        ]
    },
    "Turtorial dapet duit 1jt": {
        "title": "Turtorial dapet duit 1jt",
        "score": 43,
        "url": "https://v.redd.it/hfpfenqdb48d1",
        "content": "",
        "num_comments": 11,
        "comments": [
            "cara jadi jutawan:\n\nstep 1 jadi miliarder\n\nstep 2 main judi slot\n\nstep 3 pinjem ke pinjol",
            "psatir handal",
            "Modal asli  500.000 + 100.000 + 30.000 + (2×2.000.000)\n: 4.630.000\nHasil dari slot : 1.000.000\nJadi presentase kerugian : (4.630.000 - 1.000.000)÷1.000.000 = (3.630.000 ÷ 1.000.000) × 100% = 363% kerugian\n\nSilahkan komen kalo ada yg salah",
            "how tf do you “hampir menang?”",
            "Wkwkwkk",
            "Cuman satu hal saja sih yang bisa mempersatukan rakyat biasa dengan anggota dpr >!(bukan bkp)!<",
            "\"gila si anto kemaren maxwynn 1jt loh, gas maen lah\"",
            "Dapat dimengerti, segera dilaksanakan",
            "2 jt kyknya untuk dua buah hp, bukan masing-masing hp, CMIIW",
            "Mungkin hampir 7 7 7 kaya di casino? Padahal ya namanya kalah tetep kalah, ga ada yang namanya hampir menang",
            "2 jt, hp sama 2jt gadai motor"
        ]
    }
}