{
    "I guess we have to codify this: this is a pro-choice subreddit and we will not accept submissions which undermine the right to abortion.": {
        "title": "I guess we have to codify this: this is a pro-choice subreddit and we will not accept submissions which undermine the right to abortion.",
        "score": 18385,
        "url": "https://www.reddit.com/r/insanepeoplefacebook/comments/vy9810/i_guess_we_have_to_codify_this_this_is_a/",
        "content": "This is an expansion on our *No insanity in the comment section* rule.\n\nIf you choose to break this rule you will be banned.",
        "num_comments": 356,
        "comments": [
            "    user reports:\n    1: No insanity in the comment section\n    1: self harm\n\n\n\nPlease note that reports like this break TOS and are reported to the admins with one click.\n\n\nBut wait! There's more:\n\n    1: No hatespeech or personal attacks\n    1: This is spam\n    1: self harm\n\n\nEdit: ~~I'm off to bed so we're locking this up for the night.~~\n\nUnlocked.",
            "Glad the mods pinned this.",
            "Lmao i forget sometimes people think **we’re** the crazy ones for demanding the right to our own bodies.",
            "Good mods",
            "Not that anyone asked for my opinion, but here it is: I'm religious (Catholic). I think abortion is horrific. And I am staunchly pro-choice, because denying women the moral agency to make their own choices is MORE horrific. Declaring dominion over women's bodies is MORE horrific. Thinking you're entitled to impose \"consequences\" on women for having sex is MORE horiffic. Putting people in prison for having/performing/aiding and abetting abortions is MORE horiffic. Forcing girls and women to carry pregnancies conceived through rape is MORE horiffic. Denying women life-saving abortions and miscarriage care is MORE horiffic. Imposing your religious beliefs on other people, to whom God gave free will to follow Him or not, is MORE horiffic. \n\nIf your vision of an \"ideal\" society requires any of the above, don't you DARE position yourself as a moral authority. And don't you DARE claim to have God or humanity at heart. Other people matter besides \"the unborn.\"",
            "But…but…muh FREEDUMBS!!",
            "Now, ironically, the insane people will get mad at this.",
            "Yeah! Ban hammer!\n\nMy work just emailed from the CEO today saying they would pay for people to leave the state to access reproductive health services. I thought this was awesome.",
            "On the user reports, keep sharing this data! This is the kind of stuff users need to see in order to make this a better place.",
            "At least *someone* has our backs.",
            "Thanks mods for this rule, shame it's so controversial and not just common sense",
            "Good. Fuck Pro birthers.",
            "I hope you’re appointed to the Supreme Court soon.",
            "In full support. Thanks for this!",
            "If the argument changes to “Life begins at erection”, then the men can perhaps realize they are just as responsible.",
            "THANK YOU!! 💜💜💜\n\nAlso the “I don’t need congress to pass legislation in this subreddit” response was awesome! Absolutely perfect!",
            "Thank you.",
            "So, I take it \"pro-life\" people have been spouting that decent people protecting basic human rights are insane, and that they are the reasonable ones, thereby being insane themselves?",
            "[removed]",
            "Love you, mods.",
            "Hell yeah.",
            "Awww.....but I like arguing with and mocking zealots.",
            "*sorts* *by* *controversial*\n\nIt's not as bad as I thought...",
            "Thank you for your open and outspoken support.",
            "Oh no, I can’t make children forced birth! Literally 1984!!1!!1!11",
            "Thank you!",
            "Thank you Mods!",
            "Time to sort by controversial! Where’s my popcorn?!",
            "Thank you!",
            "Thank you mods!",
            "My brain had a little fart and i read \"this is not a pro-choice subreddit\" and I just about died. Very glad I read it wrong lol.",
            "Incredibly based. Good on you guys.",
            "English and i find all this un fucking beliveable",
            "Good mods",
            "Thank you.",
            "Thank you!",
            "TY!",
            "That’s why I love this sub.❤️❤️❤️",
            "people actually think this sub supports anti-choice?? man 💀",
            "Bravo mods.",
            "Kind of funny how you managed to codify this instead of relying on precedence",
            "[removed]",
            "Hell yeah!",
            "But… what about freeze peach???!?1!?1?1?1?1?1",
            "[removed]",
            "👏👏👏👏",
            "[removed]",
            "Thank you!",
            "Thank you. I think a lot of people feel rudderless and lost. It’s just unfathomable. Every expression of support is a comfort.",
            "I'm genuinely curious how many other subreddit are asking the opposite stance",
            "Cheers",
            "Based",
            "hunt deer edge encouraging glorious cow shrill homeless provide childlike\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "B-b-b-b-but my freeze peach! How am I supposed to live if I can’t be anti abortion on r/insanepeoplefacebook ! Oh the horror!",
            "Woohoo",
            "Thank you, mods!",
            "Fuck yeah!!",
            "Cheers to that",
            "Thank you! :)",
            "Thank you! I love seeing this.",
            "Some things just need to be spelled out. 👏👏",
            "[removed]",
            "[removed]",
            "[removed]",
            "I see why you did this, but I just downvote those and move on.",
            "[removed]",
            "[removed]",
            "[removed]",
            "I'm pro-choice but your censorship of thought crime is gross and I'm leaving this sub",
            "I support choice but this is just insane.",
            "[removed]",
            "[deleted]",
            "[removed]",
            "Why did this sub turn nsfw?",
            "Good",
            "[removed]",
            "[removed]",
            "[removed]",
            "I didn't realize that no Insanity was allowed in the comment section. Now I'm afraid to post anything. LOL",
            "Then I remember that a boomer literally made a cross with her fingers and hissed at me at a pro choice protest. Like ma'am I am not the antichrist, I will not sizzle or burn, you're just disgustingly embarrassing yourself.",
            "Imagine being a demographic of people that wail for freedom of speech, for freedom of religion (which by the way the country was founded on), that are the type to go around and say BUT THIS IS AMERICAAAA anytime they’re inconvenienced. Imagine being that type of person, the kind who claims to be for freedom and equal rights and what not, then simultaneously wanting to strip women of having rights over their own bodies.\nThere isn’t any fucking consistency there. \nThese peoples religious beliefs that have now  turned into written laws that are infringing on other peoples lives makes it a violation of separation of church and state.\n \nI even believe some people truly feel like its murder in their hearts and arent bad faith actors trying to punish women, but just because a certain sect of bible belt people in America feel that way doesnt mean it should become a law for everyone else. What about everyone else beliefs? What about others religions, points of views, and personal situations? What about that???",
            "[removed]",
            "[removed]",
            "Thank you. Deeply. As an atheist who can genuinely understand a lot of pro-life arguments (at their base, at least), I commend you for your position on this one.",
            "Ooh, don't forget those who are so deeply pro-birth also tend to be against welfare and additional benefits for kids in foster systems or single mothers. Once the kids are born they are on their own with no support. \n\nNot caring for our living is one of the worst things that the pro-birthers are all about and it's just so hypocritical that it's disgusting.",
            "As an atheist, I agree. Abortion is a last resort. I don't think anyone sees it as an easy or good choice. I don't have the moral or religious quandary of whether I think it's a life yet, but it's not something that anyone involved will just shrug off or ever forget. Although I don't class a gestating pre-foetus as a life, it's undeniably potentially one, and that loss of potential will always be felt.\n\nI like to believe that anyone who has an abortion of a healthy pregnancy is avoiding the greater harm of allowing a life to form where it would not be wanted or could not be cared for. Ultimately, people who want children will probably end up having them but probably only two or three at most. Having one of those two or three at the wrong time would probably prevent another one being had later when they were ready to love it and care for it as every child deserves.\n\nHowever, as a man, I don't, and shouldn't, get to control any of that process.",
            "I hate how your outlook is \"unusual\" in this country.\n\nAtheist now, but grew up southern baptist of all things - and I was pretty deep into it. Even then, I was disgusted with the thought of abortion, but never had an ounce of confusion as to whether I had the ability to dictate and monitor other people's lives in a way that makes ME feel comfortable.\n\nWhy is that so uncommon? Weren't we already propogandized to believe we're life liberty and the pursuit of happiness and freedom?\n\nSo crazy to me that adults twice my age who have been \"patriotic\" citizens for decades longer than me, fail to grasp that at even minutely.\n\nRules for thee but not for me.",
            "That's the whole thing about pro-choice.  We each get to make our own decision.  I shouldn't be making it for you and you shouldn't be making it for me.  Thank you for feeling the same way.  Having an abortion is a no-win thing, but not having access when it's needed is even worse.  I feel so sorry for the 10 year old girl who was raped.",
            "Yea not huge fan of the concept of abortion either but nothing is perfect in this world, so you just have to choose the best choice. Besides, when people say they want an abortion ban, what they really mean is that they want an abortion ban that only applies to women who aren't white or deeply Christian. Abortion is only legal for evangelists in a pro-life utopia.",
            "I completely agree as an atheist. Abortion is killing a life before it starts, but an adult’s right to life is more important than a fetuses. (Sorry if i explained it badly)",
            "I was raised Catholic too (I’m not currently practicing). I appreciate you sharing your Honesty here. While I do not agree that abortion is horrific (I don’t believe that life begins at conception, and I don’t believe that a bundle of cells incapable of living outside of the mother, is a person in any sense of the word), I can agree with you that removing another person’s agency because of your own religious beliefs would be much more horrific than any belief that other person may hold. People are free to believe what they like, as are you, but those freedoms of belief should end where they impact another person’s bodily or intellectual autonomy. Just because someone believes something to be true, doesn’t mean you should be able yo impose those beliefs on others. What Christian’s are trying to do with abortion is the literal equivalent of “Muslims are trying to force us to live under sharia law”. It’s literally no different. People shouldn’t be subjected to rules that are based entirely on the religious beliefs of another group of people. Anyway, I’m glad your able to see the danger that this sort of thought poses. Thanks for going against your religious leaders (in some cases, some Catholic leaders don’t see a problem with abortion and have publicly said as much) and pushing for the right thing, regardless of beliefs.",
            "*APPLAUSE*\nI agree.  \nSuch a difficult issue.  As long as abortion isn't the first and only option, or regularly used as birth control, I do believe it is sometimes the least bad choice.  One thing I do wish is that open adoption was 'marketed' a little more in the mainstream.  If it were more accepted and done right I believe abortion would happen less often.  \nI hope my point gets across how I meant.. it's 3am and I can't sleep.",
            "Thank you for this. As a christian myself, I sometimes struggle with this issue but I think you did a wonderful job summarizing my beliefs. Well done.",
            "You might enjoy this essay since you clearly put lots of thought into your position, or to use in other conversations with folks:\n\nhttps://spot.colorado.edu/~heathwoo/Phil160,Fall02/thomson.htm",
            "[removed]",
            "Thank you. You have given me hope in religious folks.",
            "[removed]",
            "[removed]",
            "[removed]",
            "Thank you. That brought tears to my eyes. I forget that there are Christians who actually think like Christians.",
            "It’s an important opinion; thanks for posting it. It’s comforting to know there are religious folk out there who understand that logic can & should prevail over blind faith in situations like this.",
            "Mah freeze peach!",
            "Well at least ya speelin' it right!",
            "Everyone’s focused on personal freedoms but what about economic freedoms? If you can’t afford a place to live, rent and transportation are you even free? \n\nYet to hear the party of ‘freedom’ acknowledge that lmao",
            "muh fIRsT aDmUndum rIGhTs!!",
            "At least we will have more humorous insane people to laugh at",
            "I wouldn’t.",
            "FORCED birthers.",
            "Life begins when the parents are born, don't you know. The potential prospective child(ren) a person might have is/are sacred, I tell you.\n\n/s for clarity.",
            "Unfortunately, if it gets to that point, it will be that life begins at the egg. Or maybe even menstruation because I'm sure they don't understand how biology works based on the stupid pro-birth shit I've seen.",
            "Enough room for that on other subreddits :')",
            "Make some fake accounts and argue with people on r/conservatives then",
            "Mods are doing a phenomenal job at removing the rude comments.",
            "The mods ate it all",
            "Here's the difference: I don't need  congress to pass legislation in a subreddit.",
            "I just bought a bunch of stone fruit mate, I’ll freeze it for ya if you want? It’s a nice peach though, best to eat it fresh.",
            "Now I finally get what that phrase means. Thank you.\n\nI'm so slow",
            "[removed]",
            "There are pro-life and conservative subs. And some of the subs do have a history of maybe not banning pro-choice stuff, but certainly being harsher on it than pro-life stuff.",
            "Thank you, I finally understand what that phrase means. I'm so slow.",
            ">However, refusing submissions from people who are not seems wrong.\n\nThey're staying that they will not accept submissions that are anti-choice nor comments. Not submitters themselves.\n\nAlso, free speech is to protect you from prosecution by government, not to let you say what you want when you want without repercussions.",
            "You have no right to free speech on a privately owned platform. Get that straight.\n\n\nAnd your history of submissions to and participation in right wing subreddits disqualifies you from further participation.",
            "As a mod here I do have the right to make the rules and to run this subreddit in any way we see fit. If you imagine for one second that not allowing anti-abortion trolls to overrun this subreddit has anything to do with free speech then I can only suggest that you go back to high school and take a class on American government, something you very obviously neglected to do the first time around.",
            ">downvoted and reported\n\nYeah. I mean. That's what I did to you.",
            "This happens to be one of those topics people don't discuss, just insult and accuse so I wouldn't mind a break from it. \n\nIt's also already everywhere else, including the discord servers I'm a part of. I've seen too many of the arguments for and against abortion. I know my stance and I know that prolife won't stop caring about a hypothetical baby long enough to care about a woman being in charge of her body... What more is there to discuss?",
            "These are privately run topic-oriented forums, not a democracy. No democracy is being given up by adding content moderation, everyone's free to create their own subreddit with their own content moderation policies (or lack of).",
            "Well, this isn't a subreddit to debate politics.  So, I guess that won't be a problem.  Further, this is Reddit, not the U.S. Government.  Nor is it solely a U.S. service, a large part of the world uses Reddit.",
            "It would be different if the topic wasn’t as dire as it is. This isn’t a situation where we are discussing things like the economy or domestic affairs which are very much more subjective. We’re talking about people’s basic human rights. This isn’t an argument where you can both sides it. Pro life people have their views stemming from a lot of nasty and offensive views towards women.",
            "Racists have opinions too, but they are also not welcome here. People who want to restrict my rights can spew their opinions/poison somewhere else.",
            "Reddit isn’t a democracy I don’t know why you would think that",
            "shush",
            "It isn’t a difference of opinion to selectively segment portions of society based off their race, gender, orientation, etc and then deny them the rights that the others have.  \n \nThat’s a difference of morality.",
            "Try another forum like bodybuilding dot com",
            "Not banning people for having a different opinion. Banning people for portraying reasonable as insane, and insane as reasonable. Which I'm pretty sure goes against the rules of the subreddit, the post even mentioned this.",
            "[removed]",
            "[removed]",
            "[deleted]",
            "This is not the  epic own you imagine it is.",
            "If you think women and little girls are less important than something in their uterus, your opinion is fucked up & absolutely immoral.",
            "[removed]",
            "You've never once participated here",
            "Imagine thinking that advocating for taking people’s rights away and then actually doing it is “thought crime.”",
            "[Oh no!     \nAnyway,](https://youtu.be/UnyBJJI2eqs)",
            "Oh? Why is that? I already have you tagged as an antivaxxer so please explain yourself.",
            "Happy to see you go. Fuck off.\n\nThe guy on who posts on the Crowder sub wants to talk about echo chambers.\nLOL",
            "People have a right not to be subjected to disgusting rhetoric. You can think what you want, but nobody is obliged to let you spout whatever foul things you like.\n\nCall it an 'echo chamber' if you like, but throwing around buzzwords doesn't change the fact that people just don't want to listen to you, and you want to force them to do so.",
            "Oh look, someone who doesn't know what fascism  is.",
            "An opinion is something like 'chocolate is gross' not 'people with uteruses shouldn't be allowed to seek necessary medical care'. \n\nAlso you should really check the definitions of words before using them.",
            "There's always one who thinks he's clever. You're not.",
            "anything that undermines the right to abortion cannot be pro-choice. if you do not accept abortions can be allowed or accept rhetoric that suggests that, then you aren't pro-choice. Pro-choice simply means you believe a person with a uterus has the right to an abortion, not that you will accept everything from pro-choice and pro-birth people. their statement clearly shows they are pro-choice",
            "You cannot possibly be serious.",
            "It's not nsfw, it's over 18.",
            "Pretending that Christianity makes sense is just idiocy",
            "Your ban evasion is painfully obvious.",
            "If you really believed this you'd use your real account.",
            "You don't have to worry about what you're commenting unless you're an insane person w outrageous beliefs :)",
            "If it's clear sarcasm or /s or /j, I would imagine you would be fine.",
            "Yikes on trikes",
            "Not to mention, the moment the words mandatory vaccinations were uttered (which we ALL had to have to go to school), these same people bitched about its \"against their rights to have something they dont want.\" Only religion defines a fetus as a baby, and in America, Christianity specifically.",
            "Its my decision if it comes out of me or not. I could die if i give birth and my body cant have a viable pregnancy. This is what *you nut jobs* get wrong or rather dont think about",
            "It’s kind of like Bill Burr’s stance. I get both arguments(the sane ones at least) and kinda agree with both, but I’m pro-choice because…obviously that’s the one to go with if you have even a scrap of respect for women.",
            "Which is where the \"forced birth\" title comes from. They couldn't care less about life, about whether anyone actually survives. Only whether the birth happens.",
            "Pro lifers are usually all about \"fuck them kids\" as soon as they're out the womb",
            ">However, as a man, I don't, and shouldn't, get to control any of that process.\n\nI'm a woman and I feel like I *should* get to control that process.... but ONLY for myself.  \n\nI don't want any other person (except my immediate family members and medical professionals) to have opinions on my healthcare, and I would never presume to offer opinions about any other person's reproductive choices.",
            "As a Bloke too, I agree with all of the above ☝🏼sentiment around having an abortion. And as an outside observer to the USA’s system of government/justice/executive branches, it’s honestly baffling to observe the rank hypocrisy and sheer lust for power and control coming from the current batch of Republican “conservatives”. They publicly proclaim to want to keep “Big Government” out of the everyday businesses of the individual states and persons, claiming to be staunch constitutionalists. And yet they reach on down to the into the literal  depths of the most private of areas on a persons body, legislating and manipulating the courts to further their agenda, with Abortion, trans-rights and Gay rights etc. Claiming to be upholding the pro-life/pro-family values, yet greedily and glaringly obvious, at least to those of us observing from across the pond, they willingly and eagerly claim that protecting gun rights above the life’s of so many people, so many kids, is enshrined in the untouchable 2nd Amendment! Or continuing to cling to fossil fuels, even if you don’t accept the impact that has on global warming, the byproduct of the dependency on such fuels leads to poor air quality, increased cancer risks for those who live near refineries, or refusing to address the basics of clean water and sanitation, which literally is taking 10yrs or more off the poorer (often effecting more black and Hispanic) communities life spans who are unable to move else where. And yet they claim to be Pro-Life!?\n\n All the while undermining one of the very core principles established in the heart of the constitution, the separation of church and state. It’s not even an amendment added on later, it’s the part the “founding fathers” wrote in it themselves. \n\nFinally, whilst the main discussion is on the right to have an abortion as the largest of the infringement with the undoing of Roe v Wade, it is seriously worth noting the other side effects that that decision impacts. Looking directly at how it would effect my own close family, my brother and his girlfriend fell pregnant and whilst they weren’t exactly planning on the baby, they weren’t looking to terminate either. But unfortunately, the pregnancy was an ectopic and dangerously so, it had seeded outside of her uterus and was attached to the large of the artery supplying the uterus. If the pregnancy was not terminated not only would the eventual progress of the foetus be unviable, but given the position of which it was attached it could have ended up causing catastrophic damage to her bowels/uterus/bladder/ovaries etc, and would have caused life threatening blood loss to girlfriend. In the various states that reverted to the Pre-Roe V Wade laws, now that life saving surgery to rectify it has become illegal, even though the foetus would never have been viable and the life threatening risk to the woman would become a reality. Secondly, my sister who has 2 kids and her husband would also be facing an illegal situation too. Her husband has had a vasectomy, so the issue of falling pregnant is no longer a risk. However she has had to use a slow release hormonal IUD form of contraception, this is because she has mild endometriosis which until the IUD solution was found to work, she had extremely heavy blood loss each and every month during her period, which in her 20s meant she was frequently anaemic and on 3 separate occasions she ended up in the ICU because the blood loss was so severe. She got the IUD eventually, which as a result of its function almost entirely prevents her from having periods in general, and drastically removes the monthly risk of bleeding out. But because her type of IUD can allow an egg to be fertilised, but doesn’t allow the fertilised egg to seed into what would be the wombs lining, which is now totally illegal in I think 16 different states, even though they have a vasectomy and the ONLY use of the IUD is to prevent her cycle from nearly killing her each month. \n\nThose are just 2 personal family examples of why the draconian law changes would have effect my family if we lived in the states. And yet they proclaim to be pro-life. Not to mention the fact that there are millions of women who rely on various medications to control their cycles, or other folks having their medications stopped or changed for a lesser medicine, simply because the laws prevent them as the meds are technically the same as a chemical abortion, but they are used to prevent a ton of various conditions from pain control to rheumatoid and autoimmune conditions, people who are disabled and having a hard enough time getting by day by day are now being told the drugs they’ve relied upon for years is no longer legal. They are legal to men still of course, so men don’t have their lives turned upside down, but the women do, women who already face significantly different treatment by the medical profession, than the average man does. They are frequently brushed off and believed to be “overly dramatic” or “emotional” or “the pain you’re facing isn’t as bad as you say it is” etc etc etc! And if you’re a black woman, that poor treatment is automatically doubled!\n\nWhilst men who have a child like understanding of both biology AND a basic “Sunday School” grasp of the bible, are now Foisting their belief systems onto others without the foggiest clue as to how it is now effecting vast swathes women. It’s sickening to watch and learn about. But it seems to be taking a back seat compared to the main focus on the right specially to have and abortion. \n\n(I know this is a long comment, and I thank you for sticking it out until the very end!)",
            ">However, as a man, I don't, and *shouldn't*, get to control any of that process.\n\nI'm in the same boat. I'm not the one who has to, in the worst-case scenario, carry the fetus to term, so why should I dictate what the one who *does* can or cannot do?\n\nHell, if the roles were reversed, and men gave birth, you can bet your bottom dollar that not only would the SCOTUS predominantly, or even *unanimously*, agree that abortion is a right, it would have been codified *decades* ago.\n\nRepealing Roe v Wade was never about choice. It's about control, through and through.\n\nA nation that claims itself to be free does not actively strip away the rights of half its population.",
            "You do get to control involvement in a child's life as a guy though. So if i accidentally got a woman pregnant but didn't want children yet but she wanted to keep the child, i could opt of raising the kid. \n\nConversely if I want a child but the woman does not, i cannot ask her as a man to birth the child so i can have one because it's not me giving birth even if i dont need her to help raise it. \n\nYou as a man are equally entitled as a woman to not want a child but we as men cant have any control over the physical bodily autonomy of the woman who is pregnant. \n\nI thought id clarify that.",
            "I totally get your point but it's probably good to set as a reminder that abortions are not always about ending life though.\n\nAn abortion, simply put, is removing or expulsing an embryo or fetus. It is not, *necessarily* ending it, while it sometimes does - not always.  Many pregnancies or health related abortions occur without a living entity.\n\nSometimes the life is essentially dead before a formal abortion even happens, by which a lot of these laws are still restricting abortion access for.  It's important to remember because the restrictions imposed here are not only about unintended pregnancies.",
            "Good thing that using abortion as a primary form of birth control is virtually unheard of  then.",
            "You will never address all the issues, because some of the biggest problems are just how much pregnancy damages a woman's body, and the toll it takes on women mentally. Unfortunately, those are issues that will always be there.",
            "&#x200B;\n\nAll those issues you list do need to be addressed but they are not the only reason why a woman would get an abortion.",
            "Do you think you get to decide what other people believe?",
            "Who said anything about killing babies? We're talking about abortion.",
            "SHALL NOT BE IN FRIDGED",
            "Wait…Peach tree dish?",
            "Laughed too much at this",
            "Tree dish",
            "Brain freeze peach tree dish",
            "HURRR I HABS THE FREEDUMBS OF SPEECH TO JUSTIFY TAKING AWAY YOUR BODILY RIGHTSS HURR. KEEP MURICA FREEEEEE \nTHIS IS MURICAH 😎🇺🇸",
            "Cause he gots branes...",
            "I say this so often on Twitter now that my phone has prioritized freedumbs as the preferred autocomplete over freedom whenever I type the the letters \"fre\"",
            "[removed]",
            "Fair point. How about with a cactus?",
            "STATE forced birthers. Same people that say fuck the government.",
            ">don't understand how biology works based on the stupid ~~pro-birth~~ **forced birth** shit I've seen.\n\nFTFY",
            "The other subreddits ban people with opposing opinions. Even if they don't express them in those subreddits.",
            "Not really",
            "You will have to make new accounts every 5 minutes because they ban everyone in that bastion of free speech.",
            "Yeah I figured places like r/maga or r/conservative are obvious, but this sub isn't necessarily political in nature like those ones are. I wonder if like, idk, r/mountainbiking for example is taking like a hard line forced birther stance.",
            "> here are pro-life and conservative subs. \n\nCorrection:\n\n>There are anti-choice and conservative subs.",
            "Booo, it was removed. I was ready to go in on them about how private companies are allowed to censor people because they’re.. private companies.",
            "Looks like yours stuck.",
            "Yes thats true but whats happening is that this will turn into a echo chamber and imo echo chambers are the biggest threat to democracies today",
            "[removed]",
            "It's interesting that all of the *D1SsENtInG 0PiNIoNs* are from accounts with no history in this subreddit. I suggest that you contact the admins and see if this post breaks reddit's terms of service.",
            "Bold of you to think they're here on reddit to change their views.",
            "You have the subreddit r/ whitebeauty in your history. You can bet your dissent is going to be silenced",
            "[removed]",
            "I’m so curious now. Dude didn’t last 7 min.",
            "They don't realize that their threats are empty, and it's trivially easy for mods to check this kind of information.",
            "r/murderedbywords",
            "Well ok one in the same.",
            "Outrageous might be moral to one, and immoral to another, or vice versa. Seems pretty subjective if that was the case.",
            "That's a great saying. I like that!",
            "[removed]",
            "[removed]",
            "[deleted]",
            "If that's the case, then all men should be able to lawfully walk away from the child without any repercussions, if they choose to not be a father.  \n\n\nAlso, a baby is not your body, it's an entirely different human being that you don't hold any sovereignty over. If you think otherwise, then YOU are what's wrong with this world.",
            "I cannot upvote your thoughtful, well-reasoned comment enough, buckyt. Thank you for this. Share it far and wide, please.",
            "Thank you. I so appreciate everything you've said. My personal perspective from a disabled woman's standpoint on this is purely from the abortion viewpoint although I'm almost positive that several of my meds would be taken away from me (pain and anti anxiety in particular) if I were in a state that had gone back to the pre Roe v Wade laws...I'm lucky to live in a fairly liberal state that, even with the hoards of \"conservatives\" upstate, won't be removing a woman's choice...however...I suffer from severe back problems that cause severe chronic pain...if I was to get pregnant, my health problems would get abundantly worse...my pain would drastically increase and I would be forced on bedrest almost immediately. Assuming that I could make it through the pregnancy, how would my health problems and inability to even stand for more than 5 or so minutes affect the child...taking away the affects on my body for a moment and focusing solely on the quality of life of the child, I can barely take care of myself both financially and physically...the life of the child would be drastically effected by my lack of funds as well as my inability to function. I don't think that that is fair to a child. I'm very aware that people choose to have children without financial stability, but I can't personally imagine bringing a child into the world that I wasn't sure I could properly care for and provide the best life possible.\n\nBecause of Roe V Wade being repealed, I'm now having to take a much closer look at having my tubes tied...the birth control that I've been on for about 8 years allows me to not have a period which helps me not suffer increased pain and removes the stress of bleeding from my life...I haven't wanted to get my tubes tied because that means that I'll have to deal with having my period again and I won't have a choice in the matter again...the other potential option of having a hysterectomy would throw me into early menopause which would also increase my health issues...even living in a state that has vowed not to remove my freedom to choose, I am feeling forced to make a choice that I never wanted to for reasons beyond removing my ability to get pregnant. It's all really devastating, honestly.",
            "I know they aren’t.",
            "[removed]",
            "Get me a beer!",
            "Y'all from Georgia?",
            "No, gotta use the correct flag 🇱🇷",
            "> Fair point. How about with a cactus?\n\nWhat did the cactus do to deserve such a cruel punishment?",
            "Preferring a cactus to misogynists.",
            "I wouldn’t do that either.",
            "[removed]",
            "So make more like 30ish fake accounts and be prepared to make more?",
            "I think that depends on the sub. You could try and bring it up in some way which relates to mountain biking.",
            "It was boilerplate, \"but what about free speech?\" Bullshit.",
            "If this was an abortion topic subreddit, then I might be concerned about the echo chamber factor.",
            "Is this going to be one of those \"both sides\" arguments, like Nazis and the Civil War? \n\nA woman owns her bodily autonomy.  Period.  If a clump of cells can't support itself then it's not a living thing, it's a clump of cells.  And, if the woman wants to get rid of that, then that's not up to any religion or individual short of the person dealing with the situation.  You don't live her life, stop trying to.",
            "im sick of discussing. they gaslight and lie, they fake compassion- they play games with the things we hold sacred and laugh in our face about it. fuck them. im done talking with these fascist scumbags.",
            "Well, no.",
            "Just another  anti-abortion account crying because they can't post their shit.",
            "Pretty typical for those who wanna force pregnancies...",
            "Do you know what subreddit you're on bud?",
            "sockpuppet account says what?",
            "Bruh i have health problems *now*. I want kids but ik giving birth will be an enormous health risk",
            "Donate a kidney to your rapist's baby.  Then your opinion will be valid.",
            "Then spread birth control because it's simply not feasible. In a perfect world maybe, but it clearly isn't working without at minimum classes on reproductive help and birth control.",
            "Until you've invested as much as I have bringing unborn life into the world, you can keep your opinion to yourself.",
            "That only works if you can define how early in the stage is it considered an actual baby. During pregnancy, easpecially in the early stages, it is literally living off your nutrients, vitamins, nutrition and antibodies. It's not an entire 'being' to begin with.",
            "I meant to award the comment above yours, but I like yours too! 😅",
            "That's good. The only reason I tried to emphasize it is because many people think abortion is solely about killing an unborn child without realizing it's more than that. Your post didn't indicate it either, so thought I'd spread awareness to others who didn't know.",
            "Spoken like true conspiracy theorist.",
            "Not all catholic people agree with the pope",
            "[deleted]",
            "Womb man!",
            "He knows what he did.",
            "Why are you being downvoted? Sometimes Reddit makes now sense.",
            "I don't think the mod here is cruising conservative subs to find people to ban. I've been banned from a sub for posting in a different sub. Some of the conservative subreddit mods are cruising to find people to ban proactively.",
            "Ah man the boring stuff. Couldn’t they at least try and be original?",
            "[removed]",
            "[removed]",
            "[removed]",
            "I know yours is an oft thankless task so allow me to express my heartfelt gratitude here and now for all you do.  But ***especially*** this part.",
            "I suppose you attempted to make a point here? What would that be?",
            "[removed]",
            "[removed]",
            "No tolerance for the intolerant.",
            "This isn't a democracy, this is Reddit.  It's a privately held company.  The only rights anybody has on Reddit are the ones in the End User Licensing Agreement and the rules set down in the individual subreddits.",
            "*The paradox of tolerance states that if a society is tolerant without limit, its ability to be tolerant is eventually seized or destroyed by the intolerant.*",
            "This sub isn't a democracy, it's owned by the person who made it. They can make the rules up as they go, and we all just gotta accept it or leave. Complaining about it won't change anything",
            "[removed]",
            "So what? Reddit doesn’t owe anyone anything. It’s a private company with their own EULAs. If they banned the discussion about Pizza Hawaii tomorrow there‘d be nothing you can do.",
            "Reddit truly isn't a place for debate, even debate subreddits like r/debateaconservative will ban you if they think your argument is too good or more people in the sub is agreeing with you instead of the narrative the sub wants to portray. This is not a place for free speech and debate, it's a private company and the subs can make whatever rules they want.",
            "There are subreddits other than this one. Fuck sake.",
            "Sorry, I'll put it in smaller words for you. R/insanepeoplefacebook = outrageous beliefs posted on Facebook. Me and other users of R/insanepeoplefacebook = generally in agreement as to what is considered outrageous/not outrageous. Therefore this subreddit exists due to the shared morals between ppl on this subreddit. Lmao hope that helped",
            "I'll take lectures on theology from a redditor when hell freezes over.",
            "So in other words, you think everyone here should or does think the same thing? How would that be defined alternatively?",
            "Refer to \"generally in agreement\". Like minded people tend to group up in the world. I seriously don't even know why you're still on about this 🤦‍♀️",
            "I was pointing out that this is groupthink."
        ]
    },
    "We will not be allowing anymore AI generated images.": {
        "title": "We will not be allowing anymore AI generated images.",
        "score": 832,
        "url": "https://www.reddit.com/r/insanepeoplefacebook/comments/1dc5n4d/we_will_not_be_allowing_anymore_ai_generated/",
        "content": "Yeah they're stupid. Yeah old people and idiots fall for them.  But if you've seen one you've seen them all.",
        "num_comments": 44,
        "comments": [
            "Register and vote:https://www.usa.gov/register-to-vote\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/insanepeoplefacebook) if you have any questions or concerns.*",
            "This is why pictures like that never trend.\n\nHave you considered what this does to the beautiful cabin crew? HAVE YOU?",
            "Thanks!",
            "Thank you for this!  If I had to see more African kid with a soda art installment, I'm going to pull my hair out.",
            "I'm glad this subreddit is putting an end to that nonsense.",
            "Thank god. That weird Cow with Jesus made my hair stood up and gave me bad vibes",
            "Dear GOD thank you.",
            "I don't know, I thought my comment on the Asian lady with the \"baby bouquet motorbike basket\" one was pretty funny. \n\nAre we certain we aren't missing opportunities to prove with absolute certainty that I am indeed as foolish and unfunny as I suspect I may be (deep down in the cock(les)?",
            "Come to r/messAIh if you have any AI jesus pictures you wanna share still!",
            "Thank you!",
            ">A woman has twins, and gives them up for adoption.  One of them goes to a family in Egypt and is named \"Amal.\"  The other goes to a family in Spain; and is named \"Juan.\"  Years later, Juan sends a picture of himself to his mother.  Upon receiving the picture, she tearfully tells her husband that she wishes she also had a picture of Amal. Her husband responds, \"But they are twins! If you've seen Juan, you've seen Amal.\"",
            "Thank god. They were truly bottom of the barrel at this point.",
            "AMEN 🙏",
            "Thank you. I’m so tired of “it’s my birthday blah blah blah” with a kid with too many limbs.",
            "Thank you! I appreciated them at first but it quickly became evident that they needed their own, *separate* sub",
            "THIS is why Im deleting Facebook!! Its becoming two woke!!! There banning my pictures of kids building Jesmus in the sand on the beech!!! If I cant see my Jesmus built out of sand by the subhuman (BLACK) kids then I dont want the app!! who dose this and thinks its a good idea, lets givem the Bud Light treetmint boys!!\n\nif they want to b@n me beecuz of this comment then I’ve been HACK 😉😉😉😉 they’ll never no 🤣🤣🤣",
            "Thank you so much.",
            "Well damn. Am I the only one disappointed by this? I enjoy those posts, but not enough to want to look directly at Facebook. Bummer.",
            "Theres /r/fAIcebook and /r/MessAIh for that now.",
            "The absolutely upsetting and hideous racist anti Indian fecal AI ( I will NEVER TYPE THIS SENTENCE AGAIN ) 🤮 Will not b making me wish I could pour bleach in my eyes . Thank you thank youuu Mods for removing the possibility of this horrific trauma. ♥️",
            "What about AI images of Nick Adams?",
            "But that seems like 99 percent of what Facebook is right now.",
            "This is why pictures like that never trend. Literally 1984.",
            "Thank you!",
            "Probably for the best. It's insane but every instance is the exact same so best to direct them to their own sub rather than being included here.",
            "Well that’s a shame, I personally really enjoyed seeing all those",
            "God I can’t believe reddit mods were the ones stopping my AI Jesus propaganda from spreading on Facebook, how dare they!",
            "🙏🙏🙏",
            "What about a soda bottle kid with a hair art installation?",
            "But what if the OOP just wants to share a beautiful picture to see how many likes it'll get compared to a naked girl",
            "That one was funny but the weird cow gave me the heebie jeebies",
            "Dude some are wild. I saw one today that was a little girl getting eaten by rats while people took pictures.",
            "This sounds like a hilarious thread! 7 fingered 3 legged Jesuses, you say?",
            "grrr",
            "So it's not something in short supply then if you want to go looking for it you say?",
            "It's... INSANE!",
            "You and me could be friends",
            "We are not playing the same game",
            "Yeah that made my skin crawl",
            "And they're always captioned with \"Why Don't Pictures Like These Ever Get Shared?\" followed by a string of emojis whether its a quadriplegic kid that built a complex Harry Potter-looking sandcastle in roaring surf with only his face as a tool or an odd-looking grandmother knitting a quilt with a multiplicity of wrongward-facing American flags on it. \n\nGee, I can't help but wonder why they don't get shared more, except for what we'd use them for here, and while that is indeed a form of perpetuation (sharing), its for straight mockery purposes, which is all they deserve due to their nefarious underpinnings of their creation.",
            "The more horrifying the better, ie. shrimp jesus",
            "For those who haven’t seen Shrimp Jesus \nhttps://www.reddit.com/r/MessAIh/s/gv3dIudNzn"
        ]
    },
    "Help! Help! I’m, “devastated” my adult daughter can think for herself! ": {
        "title": "Help! Help! I’m, “devastated” my adult daughter can think for herself! ",
        "score": 3102,
        "url": "https://www.reddit.com/gallery/1dldj46",
        "content": "",
        "num_comments": 198,
        "comments": [
            "Register and vote:https://www.usa.gov/register-to-vote\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/insanepeoplefacebook) if you have any questions or concerns.*",
            "I would bet that among the many good reasons this woman chose to end her pregnancy was the horror-show of a grannie this lady would surely be. She’d 100% stomp all over her daughter’s parenting boundaries and quote God as an excuse for her behavior the whole time. ",
            "You can still have an abortion even if your overbearing, fruitcake of a mother disagrees. Aid Access provides abortion pills through the mail in all 50 States. \n\nhttps://aidaccess.org/",
            "what a fucking bitch, I hope her daughters park her in a retirement home and never visit.",
            "Hilarious how she wants to control her daughter with religion, while at the same time talking back to her husband and opposing abortion, both things incompatible with the holy book she claims to adhere to.",
            "Good dad",
            "I found the original post and my god the comments are worse than the post. Insanely horrible advice being given to this woman",
            "Sometimes despite all of our best efforts to raise them with our values, children turn out to be decent human beings instead.",
            "Newsflash to mom: You lost your daughters ages ago, you’re just figuring it out now.",
            "I’m gonna say it, your kids don’t need to have any children, you should respect their decision instead of bitching and whining about it on Reddit.",
            "I'd argue they raised their children right, so they could think for themselves.",
            "It's not \"pro-abort\" or even pro-abortion. \n\nIt's pro-CHOICE.",
            "The fact that they came out as pro-rights *after getting an abortion* must really suck for this person.\n\nI'm sure at least a quarter of the arguments they've brainwashed themselves with have to do with how women regret abortions after having them.\n\nOr the aspect that one has to be fully evil to be willing to do it in the first place, let alone them being your own daughters... who, again, had such a positive experience that they \"supposedly\" changed their minds.\n\nMust be very unsettling.",
            "‘Dedicated my life to being a good catholic and a good mother’ … The fact that she put them in that order speaks volumes.",
            ">the decision they made to have sex was consensual\n\nIn the 21st century, saying that having sex is consent to pregnancy is like saying that drinking water is consent to cholera.",
            "“A day in the life of this woman’s husband”\n\n5 am- wake up, get dressed like a ninja, out the door before 5:30 when the witch gets up\n\n6 am - arrive at the office. Don’t have to be in until 7, but enjoys the hour of peace\n\n7 pm - leaves office, drives home slowly. Office hours officially end at 6 but he needs an hour to mentally prepare going home.\n\n7:30 pm - arrives home, hopes to eat dinner quickly… and alone.\n\n8 pm - heads into his den to sit in his chair with a tall glass of scotch and watch the game. He’s become immune to hearing the endless stream up bullshit being spoken to him from outside the room while he’s in his chair.\n\n11 pm - off to bed, the witch will be asleep by now.",
            "“I want to have grandchildren that resent their mother as much as my children resent me” is not a healthy worldview in my humble opinion",
            "Hopefully the dad can get out with the 2 younger daughters.",
            "The updates on that get so much worse.",
            "Her daughter didn't become \"pro-abortion\" she became \"pro-choice\". No one who can get pregnant WANTS to get an abortion.,but sometimes they're necessary so they DO want the ability to CHOOSE if they get one, though. \n\nAssuming this is real, anyway. You never know man - the fact the mother actually would rather her daughter throw her life away for a clump of cells is just so hard for me to fathom being real.",
            "The real MVP of the story is the dad. Sounds like (based on marrying this woman and what she believed they shared in values at the time of the wedding, plus also considering time period) that the dad probably wasn’t pro-choice at all and by raising 4 daughters and supporting them has become pro-woman’s rights and is holding that principle so strongly hes even willing to sacrifice his marriage over it.\n\nDude is a model of what open mindedness, being willing to change through life experience, and sticking to your principles and values looks like.",
            "> l asked my daughter who aborted how she will explain this content to her children in the future...\n\nI and my 3 younger siblings exist because my mother had access to safe abortion services in her youth. She raised me with a comprehensive knowledge of safe sex practices, put me on the pill when I asked for it, and also made sure I understood that, if needed, I had her full support in any choice I made with my own body.\n\nI never needed to make the choice to terminate a pregnancy, but I know if I did, she'd have been by my side every step. I'm now married, have a successful career, and am pregnant with my first, a daughter, and I plan to raise her in exactly the same way that my mother raised me.",
            "lol “being a good catholic and good mother” \nYeah I think being a good mom starts with supporting your child on a MAJOR life decision. Why would you want your daughter to drop out of Ivy League to raise a cheating ex’s whatever",
            "It’s also not like you can’t explain to a child that you had an abortion before them. If my mom told me that she had ended a pregnancy that she wasn’t ready for, for any reason, before she had me it would have no impact on my life. It’s just something you have to handle right, like literally anything else. Not that she has to want kids, that’s just a dumb argument about being open about abortion",
            "It makes me happy when children growing up in homes like these still find their way out of the toxicity and start thinking for themselves.",
            "*your family values\n\nIt sounds like this lady's husband raised strong independent women who know exactly what they want in life. At least one of their parents support them!",
            "\"I've devoted my life to being a good mother\" said no actual good mother",
            "Here's to these girls being free of their christian shackles",
            "It's not your abortion story, it's your daughter's",
            "Every baby is a “sweet baby” until they grow up and make their own choices lmao",
            "If this is an example of a “radical” pro-abort, how do be regular pro-choice? Abortions are ok as long as you regret them?",
            "There is nothing morally wrong about abortion, and sometimes it is the best choice.",
            "Dads a fucking hero. Good on him for not letting his crazy religious wife ruin his kids life.",
            "I hope her husband does leave her….. she doesn’t want her adult children to make their own decisions and have their own beliefs",
            "These people are fucking out of their minds. Nobody is pro abortion! People are prochoice. Jebus Christmas",
            "It's sad that it's very possible her daughter would want kids one day if her experience being one wasn't marred by her mother doing all this shit. At least one of her parents was able to allow her to make her own life changing decisions and support her in them.",
            "Looks like the father did a great job!",
            "Conservatism is a mental disease",
            "The \"end up like me\" thing made me hurt for her but like more because she can't see what that means, for her daughter. ",
            "I'm getting some real Tom Cruise in Born on the Fourth of July vibes. \"Penis, mom, penis! BIG FUCKING ERECT PENIS!\"",
            "I know this conflict would have likely happened regardless, but I can help but think reversing Roe v Wade definitely played a part here. Conservatives don't realize they are pushing for these bans and it's going to backfire on them. There's going to be huge pushback from women all over the country, and they are going to vote blue in November.",
            "Her daughter really said she never wants to become a mother because she doesn’t want to be anything like her. That is what should have devastated her. I find it so strange when people romanticize the notion of a grandkid they could have had while throwing away the relationship with the family they already do.\n\n“[…the dad] doesn’t care”: it seems what he cares about is actually having a relationship with his daughters",
            "She says her daughter brags about \"murdering\" her unborn baby in the post title, then when she describes everything that happened, there's no mention of this supposed bragging...",
            "Mom forcing religion down her throat has failed.👍",
            ">Abandoning our family values\n\nShe unironically says despite the fact that her family doesn't share her values...",
            "Good catholic = good parent 😂.",
            "Oh no, the children you forced to get up on Sunday instead of letting them sleep in hate the church? Whodathunkit",
            "*Oh* they think being relieved/happy with your choice is bragging. So many of those weird ass ideas about people who get abortions acting like whackjobs make more sense now.",
            "It wasn’t a baby or a person yet.  It was a seed in an egg.  And she absolutely had the right to get rid of it.  Not being forever tied to an asshole cheating boy was also a great choice.  \n\nThe farther the posting mom pushes on this issue the worse it will get.  Holy shit.",
            "Thank the non-existent gods that they have such a supportive father.",
            "Soooo...how much are we betting that, if they pregnancy had been a result of a rape, she would still call her daughter selfish and a murderer, and she would paint herself as a martyr for \"understanding\" and \"being willing to give up her precious, precious!, grandbaby to adoption\" or other such bullshit?",
            "Mom, I'm sorry but those are your values. The four girls have their own values.",
            "Oh yeah, if I remember rightly this woman posted on AITA and did not like the result she got.",
            "None of this happened. This is rightist ragebait.",
            "At least their dad is supportive",
            "I'd love to hear the husband side of that story and why he helped his daughters",
            "I don’t know… she communicates fairly coherently for someone like that.",
            "This is a nice reminder to start seriously seeking a tubal. I’m also a pro choice, lapsed Catholic, career woman.",
            "See, this is why you shouldn’t send your daughters to college. They will be radicalized! /s",
            "Poor mother, now how is she going to lament about having to help raise her whore daughter's baby? She just robbed her poor, poor mother of 18 years of non-stop complaining to her friends.",
            "These post used drive me crazy. Fam, if you want another kid but also want to be able to give the kid back just work at a daycare. Talk to your man about adoption, volunteer as a crossing guard, idgaf. But what you’re not going to do is talk out your neck. How about we reflect on your daughter telling you that she doesn’t want to be like you. She put with your ideologies until the day she went to college. Let that hurt go.",
            "Why does this woman think she has any authority over her adult children? Also holy shit that dad is awesome for supporting his children and trying to halt that mother’s religion-fueled psychosis",
            "When I was pregnant with my 3rd child outside of marriage (with a man who wasn't even my \"partner\" at the time)...I firmly decided to have an abortion. As a courtesy, I let my religious relatives know in advance that I was planning to abort & that going forward, I would interpret any \"abortion is murder\" Facebook posts as personal attacks and to act accordingly. They BEGGED me not to abort my baby and promised that if I birthed him, they would do \"any & everything\" to lift the burden that raising 3 children under 5 on my own might pose. So I kept the baby...& moved myself and all 3 kids into their house. We've been living rent free for almost 3 years, I have built-in babysitters and I never have to stress over finances! /s(? You'll never know)",
            "That's too on the nose to be real...",
            "I'm a victim of my daughter's abortion! qqqqqqqq",
            "People like this make me want to go have the weekly preventative abortions they think I must be having anyway.",
            "Am I crazy or is this just far-right fanfiction or foreign psyops? Like, what conservative, middle aged woman is using Reddit?",
            "I would say you’ve wasted your life lady … so clearly the daughters are more intelligent, less deluded by fairytales religion espouses and aware of the realities of the world. Religious zealots are literally terrorists!",
            "Considering the OOP is Catholic, I can already tell the Mom was probably posting a lot of religious stuff and the daughter grew up being Catholic guilted for expressing her own opinion",
            "that tag omg",
            "Ahh, family values, aka dressed up authoritarianism.",
            "The sad thing is this woman believes her nonsense.",
            "What's the problem? I though all you needed was God's love, not a husband, children, a family and friends so surely this isn't a big deal\n\nThere's literally a bible story about God ordering a father to kill his child\n\nJust pray for God to keep you warm at night or to bring you mother's day gifts.\n\nIf you are true to your religion, knowing you did the \"right thing\" should make you feel happy and fulfilled, right?\n\nAnd if you are suffering now? Just remember: \"it's all God's plan but like he totally loves you, trust me bro\"",
            "I wouldn't wanna end up like her either omfg 😭",
            "The daughter may have consented to having sex, but didn't consent to being cheated on.",
            "I know 100% that she is in the wrong. But she doesn't understand why any of it is happening. I hope she finds help, and while working on her trauma she is able to salvage a relationship with her daughters. And I hope the daughters find help from the trauma from the mother and father (who did the right thing in the end).",
            "I'lll take things that never happened for $800 Alex.",
            "I would be more on the mother's side if it was not for the part of the boyfriend cheating and leaving. Yeah she chose to have a baby, but did the mom really want her to raise that child as a single parent, without the father? All while not being able to finish college? \n\nShe chose to have the baby, expecting there to be a father, and stability. Once the father and stability left, the abortion was the choice to make.\n\nAnd don't get me wrong, when I say I'd be more on the mother's side, I just mean that if someone willingly make a baby and got an abortion because they regretted it (I would still be okay with them doing it), I would see that as a bit silly and immature. Although them being immature is kind of a prime candidate of someone that shouldn't have kids.\n\nAlso since when was consensual sex the excuse to force someone to have a baby?? I already know those people want even rape victims to carry, so wtf was that line all about?",
            "Would be great if she was told that directly",
            "Also, daughter did the right thing (because the right thing is whatever she thought was best for her), but if this lady actually cared about her daughter as much as she cared about the pregnancy or her desire to be a grandmother, she would’ve moved to New England instead of suggesting her daughter to drop out of the Ivy League she worked her whole life for and trash her life’s dreams and plans to play house at home with her overbearing mom. Like, abortion is *murder* to her, but apparently it’s too inconvenient to move from Arizona to NE to prevent her daughter from *killing* someone so she can get that Ivy League degree and have a career. I’ve been to Arizona. It’s not *that* great. Her convictions are skin deep. ",
            "Not to mention using her financial situation to assert control over her for the rest of her life.",
            "I’m living this horror story with my son’s girlfriend’s mom. They had their first child 3 years ago and the grandma won’t give mom an inch of room to breathe. She’s always butting into their business citing god at every turn and it’s crushing the girlfriend. It’s a literal nightmare. And the grandma just won’t stay away it’s fked up",
            "For now. Part of project 2025 includes resurrecting the Comstock act from the 1860s to prevent the mailing of anything that can aid an abortion. Vote like your rights depend on it; because they do.",
            "Right! The nerve to use the flair, “my abortion story” is really telling. She thinks she deserves to dictate her adult daughter’s medical decisions. \n\nIt doesn’t sound like her marriage is going to be long term either. lol! I hope they all abandon this moldering tampon, because she stinks.",
            "Why park her in a retirement home when she has god to watch over her. Maybe her bible by the bed will come in useful when she's infirm, alone without family, lying bed, and unable to get up to wipe her ass after shitting the bed.",
            "\"Rules for thee, not for me\" ",
            "Ya, lucky for the daughters she is in a 'christian' marriage where her husband makes all the decisions on whether to keep supporting the girls in university and the mom has zero say in anything important.",
            "For real, Dad sounds like a real good one, and like he needs a goddamn break.",
            "Shareeeee",
            "What sub? I must see",
            "The post makes it sound like the father was doing most of the heavy lifting in that department, the mother just acted as an example of what happens if they never learn critical thinking.",
            "Semantics. Who cares what they call it? I’m pro abortion for those who have chosen, and pro choice for those who want the option to choose.",
            "Very very very few women \"regret\" abortion. Surely some do, but it's a small enough number to be almost imaginary.",
            "Generally with those types of people those two things tend to be synonymous anyway. Which is also somewhat sad in of itself where your entire worth in life is based on whether or not you raised your children correctly.",
            "And somewhere in his mind palace he has a bunch of pictures of his daughters on a sign that says \"do it for them\".",
            "Anyone who lives like this should just fucking divorce already.",
            "This made me sad, mostly with how accurate it probably is",
            "My question is always \"how/why the fuck did they get married in the first place?\"",
            "I hate to ask but links?  Kind of want to see how bad it is",
            "You view it that way because you're rational and understand the science. Religious zealots view it as a \"life\" straightaway because that's what's been fed to them forever and they don't want to question it. But like I tell my kid questioning things is GOOD lol.",
            "The daughter should've stopped to think about how getting an abortion would make Mom look bad with her church friends/community. That's what this rant boils down to. Mom is more pissed about how it affects her social standing than caring about the psychological/financial well-being of her child.",
            "I’m pro abortion.",
            "That was my thought exactly. Everything matches up perfectly with what the right thinks of the left: great upbringing until college then becomes “pro-abort” during college, aborting for what the mom believes are selfish reasons, corrupting other kids, etc.",
            "No need. This was a whole saga. This woman was cut off by her children and was divorced by her husband",
            "In her full post, she mentioned she was *already a grandmother*. \n\nWomen shouldn't get to have sex outside of marriage. That's it, that's all it's about.",
            "Also, she would be dropping out of an Ivy League school to raise her \"cheating ex-boyfriend\"s child. No way.",
            "Look at the comments\n\n\"your parenting isn't done\"\n\"You should get a hold of your youngest daughter before he does\"\n\nThey really think that the parenting isnt done for a 30ish old?",
            "> Vote like your ~~rights~~ **lives** depend on it; because they do.\n\nFTFY. GOP policies will get countless people, including women seeking abortions, killed.",
            "And also reversing the FDA-approval of such drugs to be sold to people.",
            "Oh holy shit I didn’t even notice she’s calling it her story. I’m absolutely doubling down on previous comment, she doesn’t deserve to see her children. If that’s the kind of shit she’ll say publicly I can’t imagine the shit they’ve had to deal with in private.",
            "This is an older post I think.  If I'm remembering right, her husband does leave her.",
            "I don't think any spouse, in a \"Christian\" marriage or otherwise, could do much of anything if their partner decided to accompany their adult child back to college and/or support them through an abortion.",
            "Lmao I love the part where he \"overrules her\" \n\nGotta love Christianity, it's made her miserable in so many different ways \n\nTrad wife losing her progressive kids, no wonder they don't wanna end up like her",
            "[https://www.reddit.com/r/prolife/s/S3mJnKBcv5](https://www.reddit.com/r/prolife/s/S3mJnKBcv5)",
            "Sounds like she functioned as a what-not-to-be, like my Mom, I learned to do the opposite because of what she was like when I grew up. lol  \n I don't smoke or drink and my 20th wedding anniversary is next year.  She'd been divorced 4 times by the time I was 20 lol. The 5th was a few years after lol.",
            "It is and it isn't though, right? This post is making it seem like people throw parties or celebrate abortions as if they're fun.\n\nThey're not, not for anyone. But they should be available, for everyone.\n\nObviously there's crazy people, never say never, etc.",
            "I know several people who’ve had abortions, including a few couples who remained together and had children after they terminated their first pregnancy.\n\nNot a single one of them regrets having the abortion. They all say something similar to aborting that pregnancy basically saved their lives and point out that doing so has enabled them to give their children much better and fulfilling lives than if they had been forced to continue that first pregnancy and raise a child with no income, no education, and little support.\n\nI know one couple who couldn’t have an abortion and ended up having their child. They love their daughter, but also feel that if they were able to have their daughter later, all of their lives would be much better.\n\nI don’t know anyone who’s regretted an abortion, but I know at least two people who have regrets about being forced to continue a pregnancy.",
            "Oh man, I have one of those. Now I have a name for it. But it’s not walls to keep out the wife, but keep out the work.",
            "It isn't always that easy.",
            "Probably because she got pregnant and they 'had to'.",
            "It’s on r/BestOfRedditorUpdates. Idk how to link, but if you go to the sub and search “abortion” it should be one of the top hits.\n\nhttps://www.reddit.com/r/BestofRedditorUpdates/s/uFd9cvFVSH \n\nNvm, found it.",
            "I stand corrected. I just did some digging around and it turns out I am not defining this correctly. According to what I read pro-abortion means more than pro choice. Pro abortion takes a step further to ensure not only that people the choice, but also have the access. So I guess I am also pro abortion, although it sounds a little gross to say that. \n\nSomeone make note of the day and time, that someone admitted they were wrong on Reddit",
            "me too!",
            "And Ivy League, of course.",
            "love a happy ending",
            "I bet she destroyed her own family bc of her own craziness. She didn’t have room for understanding or reasoning. Just her warped world view. Props for dad supporting his daughters.",
            "Wow, you'd think imaginary sky tyrant would have prevented this from happening. Ha.",
            "Oh! Any idea where I can read the rest? Sounds like a refreshing start to the day",
            "That’s exactly it. She as much as admits it in the BORU post. ",
            "Based on the talk about enforcing the Comstock Act the next position they want to take is back to “nobody should have sex for any other reason than procreation”.  There’s also rumblings that they want to make divorce illegal again, too.  \n\nWith Texas making noises about making it a capital offense for a woman to get an abortion and Louisiana mandating the display of the 10 Commandments in all school classrooms I feel like we’re headed back to Puritanism and eventual witch trials.",
            "> Women shouldn't get to have sex outside of marriage.\n\nIt does ultimately come down to that, just different variations if demanding control over the lives of others. And despite what the talking heads say, the loudest demands for control over the lives of women come from other women, not men, just like this crazy lady.",
            "Should have got a shotgun wedding like her mom.",
            "And at this point, if you are willing to believe the GOP (and SCOTUS) when they say that they “aren’t coming for this” or “have no intention of legislating that” or “will leave that matter up to the states,” then that is on you.\n\n[Look up their voting record.](https://www.senate.gov/legislative/Congressional_Records/CR.htm) See how it stacks up against their promises. \n\nWhen someone shows you who they are, believe them. These people are showing you they’re a-ok with letting women bleed out in parking lots, jailing medical professionals, forcing little girls to carry and birth a child that’s resulted from rape or incest, aligning themselves with white supremacists/anti-semites/anti LGBTQ groups/violent extremists. \n\nEroding any progress we’ve made towards equality.\n\nDon’t fall for it. Vote with the people you love in mind.",
            "I agree full throatedly. But if you start there, the un/misinformed might think you hyperbolic ",
            "And her younger 2 daughters say they want to live with their dad.",
            "I mean if the daughter got an abortion and the dad opposed it, the dad would likely cut off her money.... but since it is only the mom opposing it, the mom has zero say in the money.",
            "Yup, but everything else gets the blame for her misery. Classic “why are you hitting yourself” moment",
            "Not trad enough to obey her husband. So much for family values! ​",
            ">Look up narcissism. It sounds like you are surrounded by a bunch of them.\n\nThis is why I roll my eyes every time I hear that word nowadays.",
            "Thanks !!\n\nEdit: been reading through some responses on that subreddit 😬 yikes",
            "I'm pro-abortion. Given how tenuous the right to an abortion is even in America and that so many people around the world still don't have  the right to an abortion, using language that celebrates them is important. Abortion access is critical to the health of birthing persons. They literally save people's lives every day. Beyond that, each and every person has a right to decide when or if they are ready to carry a child. Any reason for ending a pregnancy is valid, and if someone wants to celebrate not taking on the burden of a pregnancy or raising a child, I think that's perfectly reasonable. But I guess that makes me crazy.",
            "Apparently I’d commented twice, sorry lol\n\nBut I guess it comes down to not caring what these people think. They obviously don’t give two seconds to consider any viewpoints beyond their own, so I choose not to be bothered by whatever terminology they choose.\n\nBaby killer? Sure! Doesn’t matter what I say, not going to change their minds, and we all know the truth, so who cares?\n\nIn my very humble keyboard warrior opinion, of course.",
            "One massive thing the mom overlooks is the cost of raising a child. Back in her day the economy was a lot better. You could more easily afford a house and car on a middle income salary. This mom also sounds jealous AF of her daughter going to Yale. She never go to do things like that and was trapped in her life. \n\nI’d suggest the husband take her on a big trip out do the country to experience other places and people and cultures. She wants to feel special. Give her some special to talk about and remember.",
            "Thank you",
            "Thanks",
            "Holy shit! Thanks for linking this!",
            "That makes sense to me. I’m pro abortion in that I think abortions are great and more people should have them.",
            "you get it",
            "Nothing happy about it. It's extremely sad to have to cut off your own mother or wife just to save yourself.",
            "That's not a happy ending. This lady's brainrot led to her losing her entire family. There's no joy in that, it's just sad.",
            "\\- Redditors when a breakup or divorce happens",
            "God's obviously gotten soft. Haven't seen a city get smote in ages",
            "I was way too invested in this saga and read some of the comments on her original posts. One was saying that \"Jesus and the Virgin\" are crying with her over this 🙄",
            "Why on Earth would anyone believe any Supreme Court Justice about this kind of thing at all anymore?!? It’s absurd.\n\nI know these days a lot of people can’t be bothered to watch SCOTUS confirmation hearings, but they’re public, and *every single one* of the Justices that are on the bench were asked extensive questions about their position on abortion rights during their hearings. \n\n*Every single one of them* agreed that they believed Roe v. Wade was “settled law.” It’s the only way that they would pass a confirmation vote, as they all required at least *some* votes from Democrats.\n\nAnd yet, they still did it. They lied to the American people.",
            "Yes, but again (and this is feeling like semantics now): this is celebrating the *right* to be able to *have* an abortion, not the act of the abortion itself. \n\nThat is the distinction, however important that may be. It felt important enough to me to point it out, plus, I feel like it sorta \"puts the onus\" back on the pro-lifers, which, most of us actually all are.\n\nI am pro-life **and** pro having the right to have an abortion. I like life, I like living, as do we all. Much as people should have the right to an abortion, we should have the right to terminate ourselves under medical euthenasia too.",
            "I see what you mean. Yeah. Since they say, and apparently believe, *anything* coming from the \"right person\", it disqualifies their opinion because it's immediately ill-founded from the get go so therefore not even worthy of acknowledging.\n\nYou know, politicians used to be *really good* at simply *ignoring* negative criticism and not giving it air when it didn't warrant it.\n\nWe should get back to that,  and apply it *writ large* to the internet.",
            "That’s a little disturbing",
            "You got a link or something?  I'm way more interested in this story than I should be.",
            "it’s a happy ending that her family no longer has to deal with her. Yes it’s sad, but gotta look on the bright side sometimes.",
            "in this case yeah, they got away from this absolute creature of a mother.",
            "I know! And instead of accountability, they get to continue their lifetime appointments.\n\nI get so angry and appalled with every decision they hand down as they purposely work to dismantle this country that sometimes words fail me. And words never fail me.\n\nEven today’s decision to uphold domestic violence gun restriction has me seeing red because of Thomas’ dissent and his reasoning. But hey, why worry over a woman’s right to choose when her abuser can have a gun and render the point moot? /s \n\nIt is more than time for term limits.",
            "Clarence Thomas didn’t. I watched his hearing back in the day. He literally lied to the committee when he told them he had “never discussed” Roe v Wade with anyone. \n\nOne of the biggest cases in history and he never discussed it? Not even with his fruit loop of a wife?\n\nThat should have disqualified him right there, because he was either lying or so intellectually uncurious he wasn’t worthy of a seat on the court. Or both.",
            "Lmao now you're the one being semantic. \"You're not pro-abortion, you're pro-abortion access.\" Literally what are you even arguing about? I'm pro-all of it, babe. Abortions aren't shameful. Quit acting like they are.",
            "I found it on BORU a while back. It wasn't super recent. Last update was Oct 2023, I think",
            "God dammit. I got way too invested about that whole shebang as well. Spent 10 minutes reading the comments in the thread below.\n\nI ain't no better than those people who keep watching reality TV after all. I just need my itch to be scratched in a different.\n\nDamn her, that forced birth lady! Ignorance was a bliss!",
            "They lost their mom though. And mom obviously did a decent job raising those kids because one managed to drag herself out of a backwater hellhole to attend any Ivy league school, and all are on the right side of history.",
            "I think at this point I'm wondering why I'm up at 2AM grinding 🦄💩 to vape to help ease the back pain enough to go back to sleep so I can be up in four hours to go to work while having a debate about the meaning of words on the internet.",
            "That's a start, thank you internet stranger!",
            "I’m not so sure about that, it sounds like the dad did a lot of the heavy lifting here based on how insane this woman sounds, but what do I know, we’re both strangers on reddit and don’t know anything more than is written",
            "https://www.reddit.com/r/BestofRedditorUpdates/s/S32E2sFwVV in case you didn’t find it",
            "I love how she says she’s pro life and they are pro abortion. No, like most, she’s probably just anti abortion. I live in an area with one of the higher amount of kids in the system. I’m pro choice. And I sometimes volunteer with a charity that helps close the gaps.\n\nMy anti abortion friends celebrated when abortion was made illegal here. None of them have helped in either check or time with any of the charities designed to help families or kids in bad situations, bc it’s not their responsibility. But when you force someone not to have a choice, it kinda is.",
            "The overwhelming amount of times she said I, me, my, mine is very telling. It's not about her daughters, her husband, her son, her faith, or even her \"murdered grandchild\" (aka a clump of cells) no matter how much she says it is. It's about HER and what SHE wants, which is control.",
            "Thank you for finding the link so I didn't have to",
            "I read that thread as purely one thing. It wasn't about \"the sanctity of life\". She wanted another baby, but in the form of one she only needs to care for when she wants to. It was entirely about herself. The need to control her husband, her kids, and any future grandkids. No wonder the daughter didn't want kids.",
            "Great read, thanks!",
            "Damn, she is off her tits...",
            "Doing the lord’s work! Thank you. \n\nAlso how absolutely fucking tragic."
        ]
    },
    "Taking a photo mocking her dead ex is pretty up there": {
        "title": "Taking a photo mocking her dead ex is pretty up there",
        "score": 1429,
        "url": "https://i.redd.it/rmoc5nwk7z7d1.jpeg",
        "content": "",
        "num_comments": 184,
        "comments": [
            "Register and vote:https://www.usa.gov/register-to-vote\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/insanepeoplefacebook) if you have any questions or concerns.*",
            "\"I would live tweet a funeral, take selfies with the deceased\"",
            "Looks like he dodged a bullet. Or didn’t.",
            "So she’s single then…?",
            "Depends. When I found out my sister’s abusive ex died, I couldn’t stop laughing.",
            "Is there anything that indicates the post was made by the person in the photo?",
            "Damn they couldn’t even give my man a belt.",
            "She looks stoned af 😳",
            "I’m not saying this is fake, but I’m saying I’ve never seen a funeral where the deceased was as dressed in such casual clothes and posed so lazily. What’s up with that?\n\n\n\n\nAlso is it hot or cold out. She’s wearing a fleece and sandals.",
            "I mean I wouldn’t take or post it but there would be thoughts. He abused me.",
            "Looks staged",
            "Some people shouldn't wear sandals.",
            "This is the kind of shit aliens are going to see and decide earth isn’t worth saving.",
            "That’s one petty 3.",
            "Maybe the guy would have found it funny and they were on good terms before he passed. At least I hope so 🫠",
            "They could have put some gloves on him. His left hand looks like the blood pooled there before it congealed.",
            "I just wanna know who TOOK it. Geez…",
            "Look at her eyes, she probably cried a lot, they were ex and buddies probably...",
            "To be fair, we don't know if the ex was a POS... perhaps mocking him is appropriate.",
            "He looks at peace. He's cheating on her in the afterlife.",
            "Can we put an nsfw tag on this? Dead bodies, even if they’re embalmed, are a big trigger for me. Not trying to bitch or be a dick",
            "I’d be so pissed if this was my funeral. At least do something with my hands. Gang gestures, flipping off, jerking off. Come on it’s what dead me would want. Hell even just Weekend at Bernie’s me at my funeral.",
            "I'm fucked up by the fur coat and sandals combo....I mean make a choice are you cold or not???!!!",
            "Am I the only one who thinks that the guy in the coffin is just her friend or current bf who got in and posed like this for the picture? It's an amusing caption but it stretches credulity to think that this is *actually* a funeral.\n\nr/untrustworthypoptarts",
            "Alright Frodo, shouldn’t you be on your way back to the Shire\n\nEdit: autocorrect",
            "What if he’s as an abusive ex? Then this is totally justified. Not enough context as it is",
            "And for op, I argue you should take this down out of respect for the heads family, but I'm no one and I will live my life apathetic to it in the end, just saying yoy should do what's decent",
            "Idk he looks pretty chill with it",
            "WOW… 😕",
            "The choice of photos on his casket is definitely great.",
            "I'm pretty sure I have that shirt that dressed him in",
            "Super shitty of her to do.\n\nBut also, what's going on with his shoulders. They're up by his ears.",
            "This girl is a bum",
            "Oh great, a corpse\n\nJust what I needed to see today\n\nFucking Reddit sometimes",
            "She’s got hobbit feet.",
            "Wow and she posted it publicly.",
            "He looks way better than her. How?",
            "She looks like the woman who got arrested and was ranting about her dad being the District Attorney",
            "Wow…. That’s LOW",
            "So he dodged a bullet,  or did he",
            "I’m hoping that, when I pass, if they waste the money on a funeral and casket, they at least have it be funny",
            "Feel like maybe this should be posted to r/trashy maybe, because we don't have enough context to judge it it's insane. It disrespectful to the friends and relatives of the deceased for sure, but I can't call it insane on the face of it.",
            "I mean for all we know he was an abusive asshole and she’s rightfully celebrating his death",
            "Girl, are you hot or are you cold? Make up your mind.",
            "Is she mocking him tho?",
            "Something cool I learned. They use spiked contact lenses to keep their eyes closed.",
            "Maybe she needed the photo to get a discount on her plane ticket.",
            "I could fix her, but I don't want to",
            "So are her shoes, wearing that to a funeral screams hoe",
            "Some people really shouldn't wear sandals omg ",
            "That counts as a confession, right?",
            "r/imatotalpiecesofshit",
            "I have a photo of my stepdaughter in her casket but would I share those? Hell to the no.",
            "Ugly ass feet",
            "This is intense. Plz mark NSFW?",
            "You put holes in your face like that? You’re a bit of a whore regardless.",
            "Banter",
            "This whole thing seems staged. His left hand is awkwardly placed (why aren’t his hands clasped together?) and there’s a photo of him seemingly wiping snot from his face with the back of his hand. I don’t know; this isn’t adding up.",
            "TBH I found this pretty funny.",
            "NGL, I chuckled.",
            "Why do husbands die first?\n\nBecause they *want* to",
            "Is he single?",
            "Nah she's cool",
            "This is completely anecdotal, but anyone I’ve ever met who has little toes longer than their big toes have been whackadoodles.",
            "You're the one being petty and bitter about a dead person\n\nYou're not the one who ended up on top from that relationship",
            "\"Because I'm tackyyyyyy\"",
            "Well he dodged *one* bullet.",
            "Someone dodged a bullet if they see this picture first.",
            "You can fix her",
            "Its fine to feel relief or joy when a bad person is gone, I think that's normal and there's nothing wrong with that\n\nIts important to have standards and enough self-respect not to brag about it in public though, that's what makes it kinda shitty.",
            "I get that honestly, but that's not the same as posing with his corpse and making fun of his death on social media. It only hurts his loved ones too, since he's dead and all.",
            "Yes, I’m friends with her on Facebook. It’s not just some random post",
            "Obviously not. The guy is clearly deceased.",
            "I think it looks like she's been crying, actually. I know my eyes get puffy like that.",
            "Hot outside, cold inside is my guess.",
            "Eh, we just put my brother in his favorite clothes. We considered putting him in his giant Pikachu onesie but we didn’t want to let it go and thought it would be weird to keep something a corpse was wearing. My former teacher died last week and at the funeral they had her dressed like she was every day in the classroom, which was the school’s shirt and a lot of denim.",
            "Don't be so judgemental.\n\nMaybe she's going waterskiing after the funeral.",
            "They look a size too small.",
            "All and all, I'm not impressed with the casualness of this funeral parlor. At least one of them ought to be dressed up.",
            "My thoughts exactly. Such an ugly feet.",
            "That's a pretty generous rating.",
            "I lol’d",
            "Latex ones so he can look like he was a serial killer",
            "But not in this way.",
            "Actually, he's posed really really uncomfortably. What the hell were they thinking?",
            "I’ve only worked at a couple funeral homes but I doubt any one of them would let a guest take out a body (bc I don’t see a way they could get to the casket before the person is put in there) and pose in the casket. Also based on the hand… I’m pretty sure that’s someone who’s been embalmed",
            "FR someone please text Gandalf to send an eagle to this kid.",
            "Happily taking a photo next a dead person and posting it publicly isn’t enough context?",
            "Not like it's gory or anything. Just looks like he's sleeping.",
            "Oof i didnt even think about it.  And yeah i had to leave some of my fave subs bc of the amt of animal stuff i was seeing that was rly fucking me up",
            "Really?",
            "Fucking chill lmaoo, death is a part of everyday life and I’m sorry if that’s hard for you to handle but this isn’t gory or disturbing at all",
            "It’s even her cover photo",
            "This is not intense",
            "?? Facial piercing makes one a bit of a whore? \n\nDoes a belly button piercing make one a full whore?",
            "I’m friends with her on Facebook. She tagged him. I looked at his profile, he’s dead - you’re overthinking it",
            "The one that got him was more respectable",
            "Nah. She got weird toes. No fixing that",
            "Nothing to fix, I like an incredibly petty, mean bitch.",
            "Why?  The guy couldn't have standards to not abuse.  Seems like it's the least she should be allowed.",
            "That’s true.",
            "Ok but the most important question is would the dead dude be ok with it? Cuz if that's his sense of humor then I'd say it could be seen as honoring him in a weird way",
            "Did he abuse her, or is this out of left field?\n\nOne note, I don't believe in respecting the dead just because they're, well, dead.",
            "If he was abusive I can see this!",
            "You mean you're \\*former\\* friends with her on FB.",
            "Wait that’s a real dead body?",
            "Was the guy awful?",
            "I zoomed in, just to give you the benefit of the doubt and double check, but her nose isn’t rubbed raw from tissues. Crying usually wreaks havoc on the nostrils, so I doubt it.",
            "Consider the inside location, I doubt they've got the heater on.",
            "she doesn't even have to use skis, she just balances on her big toes. it's quite impressive",
            "For real. He’s gonna have so much neck pain when he wakes up",
            "Nope, if he raped her, or did some bad shit like that it’s justified as fuck.",
            "I was really wondering if he was deceased, or if this was staged. I'm not in a country with open caskets/embalming, so have no idea what someone would look like!",
            "Watching animal abuse and seeing a man laid to rest peacefully in a coffin are not equivalent",
            "What disturbs someone isn’t for you to decide. Sorry.",
            "What happened to him?",
            "It even had a tiny monocle and a bow tie",
            "What's wrong with her toes?",
            "Bro looks like fuckin Smeagol too. Even if you can get past them dogs she's gonna try to strangle you in your sleep to get her precious back.",
            "Oh you’re one of those guys",
            "Some guys like potato picking toes. And those guys are sketchy af.",
            "Just because two of them have mustaches or beards you think they are weird?\n\nBodies are beautiful, no matter what mustaches they have.",
            "Yeah. Hobo feet. Not happening.",
            "Others being shitty is not a \"you get to be shitty\" pass card, this isn't some sort of game or a contest you need to \"win\" or that you keep a scoreboard of and people really need to learn this.\n\nA reminder that every shitty and abusive person in the world has some sort of excuse they use to justify why they are being shitty and abusive be it addiction, trauma or some other crap.\n\nNone of it is a valid excuse, that's my point and if you start making excuses to start acting shitty you're taking steps towards being more like the person you resent in the first place in which case the whole point of your resentment towards them starts to fall apart... because you can't just go \"I'm angry because this person did shitty things to me which he shouldn't have but its ok if I do shitty things because (insert excuse here)\"\n\nYour gripe is that he didn't have standards\n\nThat implies you believe people SHOULD have standards yet you claim its ok for the woman not to have standards.\n\nYou can't have it both ways, the standards thing is for the sake of the woman, not for the sake of being nice to the guy.\n\nThere are people who don't act shitty and there are people who make excuses why they act shitty.\n\nThe right thing in this case would have been to not show up at the funeral and try to move on with her life and start healing.\n\nDoing this and posting it online isn't going to heal any of the trauma and serves no other purpose than being bitter and spiteful and if anything will make things worse because if the people who liked the guy see this, they will confront/attack the woman who will now be dragged back into this deceased guy's life and past abuse all over again but this time she has to fight multiple people who aren't going to take her side making this whole thing very destructive for the woman.\n\nShe deserves better than that, she deserves closure and peace.\n\nTHAT'S why you don't do stuff like this.",
            "Not knowing any of these people I’m going to go out on a limb and say that, going off into the great hereafter, he never thought “I hope my ex gloats over my corpse.”\n\nAnd btw I kinda suspect that this was a former ex-wife rather than the widower because I don’t think most people would refer to their recently deceased husband as their ex. So it’s not likely she was trying to honor him or whatever.",
            "I would think there has to be a backstory to make a person take a photo like this. I don’t know anything about the relationship though, I don’t know her on a personal level\n\nWhile I 100% agree that if a person was a piece of shit in life, they shouldn’t necessarily be respected after death, but I think there’s a difference between that and whatever this is",
            "She could just be a cunt. You don't need to invent victim blaming hypothetical situations without any evidence just because she's a woman lol.",
            "But also don't disrespect for internet points.. this is a kid, he probably has loved ones too",
            "Same. My mom would 100% do something like this to my abusive dad lol.",
            "You know when you drive past a car wreck, but can’t look away?",
            "Lmao imagine even posting this",
            "Lmao what even",
            "Absolutely on point nostril analysis there",
            "Thank you, detective Lips. I don't know where we'd be without you.",
            "What an awesome response",
            "Could also be on good terms and he had a dark sense of humor and would have found such a joke funny. Also to me her expression honestly looks like she’s more sad than anything",
            "It’s real. You can see it in the colour of his hands and eyelids.",
            "Thats not what i saw but yeah trust me i know",
            "I'm comfortable with death and the dead but even I don't want to be seeing this shit on my time line",
            "If this disturbs you, go outside and touch grass. The real world is much more disturbing than anything in this image",
            "I don’t see any posts about specific causes, but my guess is an OD. He has a lot of Xanax and other drug related posts",
            "It's the big ones.",
            "Her toenails aren't polished.",
            "Not a guy, buddy",
            "I mean, if I was on good terms with my ex and then suddenly died I'd find the same situation funny, which is why I asked. Not everyone hates their exes",
            "I'd be more worried with disrespecting his potentially innocent family than him, since he's dead and won't know about it.",
            "Sure, I can agree with that.",
            "Do you know if she is his widower or if they had broken up before his death? I think it would be the latter.",
            "Its a matter of self-respect, not a matter of respecting that person.\n\nNot being rude is a choice you make for yourself, not for others.\n\nFor example: I have people in my life I really don't like\n\nThat doesn't mean I will go out of my way to be rude to them because I choose to be better than that and those assholes have nothing to do with that decision because its not about them.",
            "You just shouldn't play with certain energies, and this is THE one they talk about. You just shouldn't speak on the dead like that, it creates bad juju.",
            "Did I say it was one way or the other? It was a clarifying question.\n\nJesus Christ.",
            "Are they kids?",
            "Hope you're well now.",
            "See my previous comment. Amazingly you’re not the only person who both uses Reddit and also has a life outside their home. Some people find corpses disturbing and it’s *not down to you to decide they shouldn’t*. End of story.",
            "Is this in South Texas? These ppl look familiar.",
            "They look dirty 😬",
            "oh i think theyre just flexed like from standing like that? either way normal enough for me",
            "Not your buddy, mate!",
            "Oh a woman with a foot thing? That’s a first for me dawg",
            "I was leaning towards this. I have a pretty dark sense of humor and I surround myself with like minded people.\n\nMy old man died in 2016 and my brother and I threw a rager instead of a funeral, while he was still around. Unknowingly both my brother and I told him at different times something akin to \"if you're gonna die can you wait until tomorrow? We put a ton of work into this and it would suck for the guest of honor to flake on his own party.\n\nHe lasted 3 months after. It was an awesome party. My old man was a HS teacher for 40 years and well liked. Some of his old students came from across the country to pay their respects. Everyone had at least one story to tell about my old man that marked them for life in some way.",
            "Also seems weird that she'd be invited to his funeral if they weren't on good terms",
            "I’m on good terms with my exes and would find this hilarious.",
            "If I got along with my ex and they did this to me, I’d find it funny towards me too. But I’m pretty sure my family wouldn’t. Especially if it was posted on social media. I somehow found that is what is going on though. \n\nHe could have been abusive as hell and she only went to know she was safe and it’s still screwed towards his family. And let’s face it, that’s who the funerals are for.",
            "God bless I guess lol, that is incomprehensible to me.\n\nedit: I'm sorry, do the people downvoting really agree that there exist more than a handful of people who would want anyone, their ex or not, to smile over their corpse and take a picture like this?",
            "Yeah I don’t think you call your dead husband your ex? That seems wrong",
            "Most people who have spouses pass during their relationship don't refer to them as ex's, they refer to them as their late (insert title) or deceased (insert title). Since they never actually broke up, one person just died, most people don't find it appropriate to call the other person their ex.",
            "I don't know... I'm old, everyone looks like a kid to me",
            "I am. Thank you!",
            "Dude should see the road kill on my street. It’s far more disturbing than this man who looks like he’s asleep. If you can’t handle an image this tame then just don’t use the internet, and you should probably never go outside or watch the news either.",
            "I can fix that",
            "Not your mate, pal!",
            "Plot twist: I’m the Chola in the picture.",
            "Kinda figured it was",
            "I have zero idea why you’re getting downvoted. Dark humor or not, on good terms or not, that’s a dead person. Why is she smiling?!",
            "Same here, but there are signs that you can look at to get a better idea.\n\nHonestly, figuring out exactly how old younger people are is like spotting AI. Sure, it looks smooth and all, but I see that extra finger.",
            "Kudos to you, you're the best!",
            "You’re not getting it are you? Well done, you’re not disturbed by this image. Neither am I. But other people have every right to be disturbed by whatever they feel is disturbing. \n\nMaybe you should go outside more if you feel so strongly about a random anonymous person’s reaction to a picture of a corpse.",
            "Not your pal, Scoob!",
            "Not your mate, partner",
            "This has truly been a wild ride",
            "My brain has never learned to properly identify/remember faces.. leads to awkward situations.\nBut thank you for your nice comment \nRegardless of age or even the circumstances..  this is pretty trashy behavior imo, especially posting it online.",
            "Hahaha, still the same boat! I often tell people I have partial face blindness because, fuck me, it's basically true.\n\nI can work with someone for 4 years, but if I see you at the store, there's no guarantee that I'll recognize you, lol.\n\nAnyway, I do agree that the original post is trashy unless the dead person was a sex offender or worse. \n\nWhich is the kind of info I was trying to find out in the first place!"
        ]
    },
    "Plan F": {
        "title": "Plan F",
        "score": 64,
        "url": "https://i.redd.it/mqjetvyf948d1.png",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Register and vote:https://www.usa.gov/register-to-vote\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/insanepeoplefacebook) if you have any questions or concerns.*",
            "We all know one of those people.\n\nThey are the people who were semi-normal until they had to wear a mask for 30 minutes while getting groceries at Walmart four years ago and carries the \"trauma\" of that event around like they spent 3 years in a Russia prison.  \n\nNow they latch onto every conspiracy theory that comes across their feed and inbox like they are infected with RFK, Jr brain worms.",
            "If you’re a selfish, entitled, spoiled brat with a massive persecution complex over the age of 40 but with the emotional intelligence of a 9 year old do we have a political party for you! The only drawback is the party is riddled with “kiddie fiddlers” but all you have to do is pretend they aren’t there!",
            "\"im happy to live and let live\". \n\nHas never let anyone who disagrees with them live and peace and actively participates in behavior that harms other people because they decided the science they don't understand must be fake.",
            "You already take orders from kiddie diddlers — thought that was well established by now.",
            "Yeah you will. You will sit there, pay your taxes, do what you are told and do nothing but post angry memes on Facebook.",
            "Plan 'Failed out of high school'.",
            ">I am happy to live and let live until you push me too far\n\nGiven that people you hate existing and being asked to not kill people counts in your head as \"pushing you too far,\" I'm gonna go ahead and say that's a fucking lie.",
            "\"I am happy to live and let live until you  push me too far by being different than me.\"",
            "I believe this is the reasons for conspiracies and ignorance. They feel like they need to be in control because they are scared of the situation and don’t understand it. Covid really did a number on these people.",
            "\"Kiddie fiddlers\" is a new one, haven't seen that",
            "Just wait until bird flu goes to human-human transmission. Whatever’s left of their brains will melt and run out their ears",
            "30 years down the line, assuming there's enough land above water left to continue doing research, we'll find out that some of the effects of long covid are similar to those of lead poisoning",
            "Then the feds show up to arrest them for Jan 6th and they begin weeping openly. What happened to your \"Goin down guns blazin!\" bravado, Wilmer? I swear it was just here a minute ago...",
            "The amount of obsession these guys have with pedophiles is….concerning. You know how often I think of pedophilia in my politicians outside of Reddit conversations in my day-to-day life? None. Not at all. \n\nI’m sure it HAPPENS, but the level of red string conspiracy theories going down in these Qanon circles focused around messing with kids is….just a lot. I feel like it says more about the theorists than it does the politicians. ",
            "You beat me by two minutes."
        ]
    }
}