{
    "Weekly Tech Support Megathread": {
        "title": "Weekly Tech Support Megathread",
        "score": 3,
        "url": "https://www.reddit.com/r/Instagram/comments/1dhvc0v/weekly_tech_support_megathread/",
        "content": "*Please* post all support related issues here. Issues with your feed, account, messages, etc. Everything tech support related outside of this post will be deleted.\n\n&#x200B;\n\n[Link](https://www.reddit.com/r/Instagram/comments/uzp2pk/account_deleteddisabled_megathread/) to the account deleted/disabled megathread.",
        "num_comments": 107,
        "comments": [
            "I want to recover an account.\nMy phone number is not there.\nMy old device, where it was logged in, is not there, and I can't use the device log-in method\nNor code\nNor SmS beacuse I have no number.\nI forgot my password\nI want to die",
            "I can log into my account on chrome but not on the application,when I try to log in on the app it says wrong password and any other form of logging in results in an error message. The Instagram support team never responds",
            "I can't seem to login to instagram web??? It just refreshes\n\nLink to screen recording - [https://jmp.sh/s/FRImT2gyJLJtQfhxfMr8](https://jmp.sh/s/FRImT2gyJLJtQfhxfMr8)\n\nThanks",
            "PLEASE HELP \n\nI made the mistake of following too many people at once because I had no idea that was a restriction on Instagram for this. So my account got suspended twice. Both times I have successfully appealed because I wasn't breaking their rules I was just using the website too much. So I downloaded the app afterwards since I was told it was better to use the app. Then for some reason, I can access my account now, but I can't follow or like anyone's posts. I also checked in my instagram account to see for any restrictions and it said none, but as soon as I try to like or follow it says I'm restricted until the 24th of June. I am running a campaign account so I have to be active on it! Please help!! Do I just wait it out or what do I do? I am so afraid it puts another ban on me right after because that is what happened when I stopped being on instagram for a while and then it just banned me again.",
            "someone requested to follow my instagram, when i click their account it doesnt say accept or deny and when i go to my notifications and hit accept it just refreshes and gives me the option to accept or deny again...anyone know whats going on?",
            "Please help!\nI can't make a Community channel even after having 105k followers and 50 million views",
            "I have one Instagram account connected to a single email (A), And i have another email (B) in my phone. I just don't get it, I've logged to my IG account using email (B) and the same password. Is this normal??? In the account information there's only email (A) which is connected to my IG but i can still use both emails to login what is this??",
            "I went into instagram and inside the app i had a notification for a dm, when I clicked the notification it led me to the message chain but the message itself was deleted by the sender. I was able to read a snippet of the message in the notification window, is there a way for me to see/recover this message/notification?",
            "Hello! I run an instagram for my FT and of course I must not have written down the new password. I've lost track of how many times I have hit the password reset link and nothing is coming to my email. Any help?",
            "I tried creating an instagram account. i added username, phone number and password, followed the step and reached the confirmation phase. i  entered the instagram code immediatly after receiving it and it told me it was outdated, i asqued for annother code and did not receive it, waited 10 minutes and asked again, still not recieved it. i then tried creating a account with my phone and it told me it was already used for an existing account,, and i recieved a text with an istagram code and an username that wasnt mine and after looking up it is an account with 10 picture dozens of followers and over a thousand follows. looking right now my account actually exist as created and i am just confused as to why i received someone else username. do anyone ever had the same problem or an answer ?",
            "Begging for help \n\nDear all\n\nHello. Thank you for reading. \nI'm racked with stress and worry - my instagram account has just been suspended (broke rules....apparently) and I think I did the selfie video correct.\n\nI'm just stressing. There are so many memories on my page of my late wife and late daughter. Most the people I follow and who follow me - we all have some sadness and trauma and we help each other. We shared pics of loved ones lost. Share memories.\n\nSince losing my daughter last year I've used instagram as this incredibly useful tool to kinda help myself and help others.\n\nI know it says 48 hours. I'm just worried as its my main outlet to speak with people - and there may be those who think I've done something 'stupid.'\n\nCan anyone help?\n\n1. Is there a way to fill in a form or speak with someone at instagram?\n2. Also if it does come back and I'm allowed to have my account again will it be as I left it (I.e all my posts and all my followers etc)\n3. Has anyone had this? Where you don't think you've done anything wrong but still suspended?\n4. Has anyone had this and irs been less or more than 48 hours?\n\nThank you. Sorry for the long post or if I've missed someone else talking about this. I'm just crippling sad and worried about it.\n\nThank you",
            "I got locked out of my account on suspicious activity and they want me to reset the password by sending an e-mail. The e-mail address it lists is correct, but the reset e-mail NEVER sends, and I've tried the resend button many many times. It never comes, and no it's not going to spam.\n\nI'm seemingly permanently locked out.",
            "i'm getting feedback\\_required error only on desktop. it's been maybe...weeks? of this and it's extremely frustrating because i need it for my work. totally fine on mobile but i need it on desktop",
            "My secondary account essentially disappeared. I have no idea what happened. I have completed the recovery process. Has anyone else had experience with this? What should I expect?",
            "Hi, I have over 100k followers on Instagram, I get millions of views but i don't have the option to make a community channel. Why?",
            "I tried to make an account for my bird, and even before I could log in to it, Instagram says they deleted it because it violates the ToS. I tried another name, same result. I can't do anything with these accounts because they don't appear on my account center, and if I try to register again it says the name is not avaliable. I assure you it was normal names, nothing ban worthy.\n\n\n I don't want to exhaust all my choices of account name if this is going to keep happening, but I also don't see a way for them to help me. I found a supposed support email, but they are not giving me an answer either.\n\n\nAnyone has any idea? Would the names become available after a certain time has passed at least if that's my only solution?",
            "\n\nLost access to my Instagram account.\n\nI've had 2FA set-up for my account, deleted the authenticator app by mistake and logged out of my account. Now the auth app isn't showing any connected account and Insta won't let me login without the authentication code.  \nAny solution to this one?",
            "I worked on a reel for multiple hours, scheduled it for tomorrow morning and it’s just disappeared. What happened? 😭",
            "Albums issue? \n\nAndroid, insta just wont let me see all the pics in an album, it happens to all of them, sometimes it stops at 3/10, sometimes later, and after that just have the rubberband effect like the album is over. \nIs this a known issue? \n\nBesides that, I cannot see the latest post of my wife (she did not restrict me dont worry), she even dm'd it to me and when i try to open the post, says \"couldnt refresh feed\" and a black screen. If its happening to her, there could be a lot more idk about.",
            "if i post a story for close friends only, then i add a person to the close friends list, will they be able to see it even if it was posted before they were close friends?",
            "Why does instagram enforce an image ratio of 4:5 or more, for vertical or portrait images? Is there a reason? I cannot post my picture without instagram cropping it.\n\nDo people often add black stripes to post vertical images?",
            "You know how you see thread posts while on IG, then click it and you go to that post? Now when I click the thread post it just brings me to my feed. Did I change a setting or something? Help please.",
            "For some reason the grid of photos on my profile is only showing the last 12 pictures. As soon as I add another, the oldest one disappears. I've tried logging in and out, resetting my phone and clearing the cache, but the issue remains. Any ideas?",
            "I can no longer load the majority of the gifs from GIPHY in instagram messages. They just appear as hollow grey circles. I’ve uninstalled and reinstalled. I’ve logged out and in. I’ve cleared my cache. Nothing is fixing the GIPHY issue with gifs in messages.",
            "I have a 2FA Issue\n\nHi I need help getting back into my Instagram account. So what happened was I have Two Factor Authentication on my account and since I need codes to log into my account I used the Authenticator App to receive codes but after I got a new phone so now I can’t receive codes anymore therefore I can’t log into my account. please help me get back into my account I’ve been trying to get back into my account for so long.",
            "I can suddenly no longer post landscape photographs if I want to share more than one at a time. I've tried with photographs I posted a few weeks ago that worked fine then, which now won't stop cropping to square once I try post. Has anyone else had this issue?",
            "I got hacked. They put a 2 step authentication and I'm no longer able to access my account. I tried submitting video selfie but when I click submit it doesn't follow through. Now it says I've been locked out for a day of my account due to suspicious activities on my account before it gets disabled. I hope my hacker is locked out too.\n\nAm I able to save this? I wish I can speak to Instagram and prove to them this is clearly my account.",
            "im trying to login and its saying \"Sorry, your password was incorrect. Please double-check your password.\" when ive used both my username and phone number plus the password to try and login and it has kept saying this over and over again",
            "Hello, Ive been running ads since 2020. the last ad I run stop running like a month ago. However, if I go to \"about this account\" there will be a section that says \"see (....... ) active ads\". I know that Instagram and Facebook has something called \"meta library, and the ads are shown there and cannot be hiden even if they stop running because of a their policy related to \"authenticity\" and \"transparency\" I get that the problem is.\n*My Instagram account as mentioned before has this section that says \"see (......) active ads\" as mentioned before the last ads I run stopped a month ago. Also this is the fifth ad I run and the ONLY one that keep showing on the section. I'm confused.\n• I know other Instagram account that run ads as well and when I click on \" about this account \" there not such section as mine PLEASE HELP I want to hide that section.\nIN CONCLUSION, I know I cannot hide the ads from meta library, I just want to hide the section \" see (....) active ads\" on \"about this account\" PLEAS HELP and PLEASE don't tell me to contact COSTUMER SUPPORT AS IVE ALREADY DONE THAT THANK YOU",
            "Instagram keeps saying I can't log in because the password is wrong, but when I try to reset the password it says I can't use my current password as a new password, which means my password is correct",
            "Reinstalled the app today: i cant edit my messages in dm and also i dont receive any notification when someone wants to follow me or when my request is accepted",
            "I keep getting issues with some stories not being available and posts showing there is 9 pictures but only 4 of 5 will appear. Tried deleting cache and data, uninstall, mobile data/WiFi and still no change.\n\nTried googling the problem but it keeps coming up with solutions for your own gallery not showing when posting.",
            "Why when I crop a photo from my Instagram reel? A black screen appears, and it doesn't work?",
            "Has anyone encountered the same bug as me ? When I want to share a post in a story on Instagram the background is purple and I'm unable to change it. Can someone help me ?",
            "Hello,\n\n  \nSince like a week or so, my account can't share posts in my stories from any account, including my own posts.\n\nAt first, I thought that it was some sort of problem with my account, as my secondary account could add posts to stories without any problem.\n\n  \nHowever, I decided to install Instagram Lite and there, I can add posts to my stories without any problem in both of my accounts.\n\n  \nI tried to reinstall instagram, re-log in my account, deleted cache. Nothing worked and I do not like the lite app at all.\n\n  \nIs there any idea of what I can do to fix this?",
            "Question about Vanish mode, \n\nSay I have vanish mode turned on for person A. My last message with them , before I just now turned vanish mode on , was say 4 weeks ago.\n\nIf i message them, that takes their chat box up to the top of the feed ahead of whoever else I may have been messaging .\n\nOnce they read it, because its on vanish mode, does it send it back down to the 'last reply 4 weeks ago' area? or will it stay on top even though the message itself is gone?",
            "Urgent Help Please \n\nDelete removed stories from account status.\n\nInsta removed one of my story because they were against their policy. I can see those stories under settings > account > account status. Only I can see these removed stories, but I want to delete them so that they do not appear even here. Can I do this?\n\nI want to remove them just any how.",
            "i want to log into my old account on instagram but i completely forgot all my login information like password and email and number, is there still a way for me to log back in? or to somehow get that account back?",
            "i posted a fitness related ad on instagramfor 24 hrs .it paused within 5 hours\n\nthe ad used 15 percent of the budget and rest still  remains and the ad paused on it own \nthe duration set for the ad was one day \nis there something wrong that iam doing ?",
            "My account got hacked and I have no way to ask for support from online tech. Is there anyone that knows how to get my account back? The person changed my email and passwords.",
            "Hey guys can I still get log in alerts into my email if I deactivate?",
            "I'm no longer able to follow people.  i click the follow button and nothing happens.",
            "Hello,\n\n\nI have 2 Instagram accounts and my son have 2 ones\n\n\nOn my secondary (not main) account and on both accounts of my son, I can save reels without any problems, of course if it allow in current reels\n\n\nBut on my main account I can't save any reels, SAVE button just disappeared (((\n\n\nI tried 2 different Samsung phones, I tried to clear cache and data of app, I tried to reinstall and update app, nothing help (((\n\n\nPlease help 🙏 \n\n\nThanks!",
            "Following count won't change after I unfollow....please help",
            "So I got a new phone, and now neither video or voice calls are working. It rings through, but then I just see a black screen where they should be. I can't hear them either, so I know it's not a camera issue. It also happens when they call me, and it's getting very frustrating",
            "My account has reached the max following number of 7500. While I've been slowly and manually trying to unfollow certain accounts, the number seems to constantly change. Is there a way to export my 'following' list to something like Excel/Sheets so that I can actually verify that I am actually following 7500 people and its not some glitch that keeps my following number to 7500?? It seems there's only 2 options I can export to which is HTML and JSON file. Is there a way to export them to a excel table format?",
            "Hi, I'm unable to see all of the carousel pictures on many posts. It just won't let me slide. \n\nStories are also not working properly as many show as unavailable and others are shown to me long after I've viewed them.\n\nI've tried cleaning the cache, reinstalling the app, and I'm not using data saver or anything like that. \n\nI checked the desktop version and the problem persists. Any tips?\nThanks!",
            "Anyone else having issues posting carousel posts with images that are wider than 1:1? Seems like there has been a silent Instagram update that is forcing images to 1:1 in multi image carousel posts?",
            "Urgent Help Please \n\nDelete removed stories from account status.\n\nInsta removed one of my story because they were against their policy. I can see those stories under settings > account > account status. Only I can see these removed stories, but I want to delete them so that they do not appear even here. Can I do this?\n\nI want to remove them just any how.",
            "Hello, I have been trying to log into 2 of my business accounts after some time away. \n\nWhen attempting to login, it says it's sending a confirmation email (for both account attempts). The problem is, no email comes through (after hours of waiting and resending). \n\nI've now tried to login through my desktop, and it just refreshes the login page when I click login. \n\nI'm seeing multiple posts (today especially) about this issue for other users. I really need support to get into these accounts, as they are for a multi-million dollar brand. Help??",
            "I logged out of Instagram without realizing I'd need my old phone number in order to log back in. I went to my previous service provider to see about temporarily reactivating the number, but it has been about 5 months since I switched, and they stated they had \"released\" the number. I tried calling the number, but it makes the \"out of service\" beeping noise, so I imagine that means no one is using it yet. I have backup codes from years ago, but they are invalid, and it does not give me the option to use my email, even though I have access to it!\n\nIt's locked me out of my personal and extra account that I've had for as long as I can remember, and I am desperately seeking advice on how to go about regaining access. If anyone has any tips, I would greatly appreciate it! Thank you for taking the time to read my issue.",
            "I can't login on my account because I always get the challenge thing that say that I have to wait 24 hours and its been I think more than a half a year that this have been going on and I need help please.",
            "Can business accounts access the \"add yours-template\" feature or is that just for personal accounts??",
            "Glitch with deactivated/reactivated profile\n\n\nHi everyone!\n\nI’m experiencing a glitch after a person (not in my following/followers lists) deactivated then reactivated their account.\n\nThis person is a contact I have in common with one of my friends.\n\nAfter reactivating the account, they don’t appear on the following nor followers list of my friend, but if I check out their profile it still says “followed by my friend”.\n\nAt the same time, when I search this person on the search bar, it doesn’t show “followed by my friend”, as it previously (always) did.\n\nSo, I believe there must be a glitch on fckng Instagram (as usual), but…what’s the truth here?!?\n\nMy friend and this person aren’t following each other anymore but it still shows as my friend is following them from the other profile “point of view”, or the glitch is in my friend’s lists because of the deactivation, and they still follow each other?!?!\n\nI don’t know if I have been able to clearly explain this mess…and YES: my friend is my “situationship” and “the other profile” is his ex!!!\n\nBe kind please, I’m just a girl who wants to understand without actually asking THAT question 😩😩😩\n\nI hate dating in 2024 and I hate Instagram 😣\n\nThanks in advance to those who’ll try and help me! 🙏🏻",
            "I have this problem for a couple months now that I sometimes can‘t see my saved media. I have submitted it as an error multiple times but nothing. It‘s not like I haven‘t been able to open them it‘s just sometimes (like %70 of the time) it just doesn‘t want to load. Since I use an Iphone Cache doesn‘t exist. Redownloading doesn‘t work, changing my connection doesn‘t work and there are no updates. What am I supposed to do?",
            "I created an account using an email but when i try to log in, it tells me there is no account accociated to that email…i have it logged in on my phone so the account exists, but when im trying to log in from my pc thats what i get…what can i do",
            "Does anyone have experience with MASS deleting/archiving pictures. I have an old account with thousands of posts, and have already used and broke the \"mass delete\"-function. So I've been deleting posts one by one but it's taking forever... Getting error messages, and deleted posts are popping back up... :)",
            "I cannot log in to my Instagram and it shows \"Your account now has Advanced Protection\" Then when I click \"Choose security method\" it directs me to the Meta Account Center but it is just blank.",
            "Question about lost user profile\n\nI can access a chat with someone and it shows their profile picture and names still. When I click on it, nothing loads or shows no posts or followers. When I search for them, nothing comes up. It doesn’t show the count was deleted or it would say Instagram user or something like that. What does it mean?",
            "Hello ! I'm slowly getting into managing my online presence as a small artist, and I'd like to plan posts/stories. I find the interface on my phone pretty cool, you can mention people and it autofills, add GIFs/stickers, little graphics... It's practical ! I just cannot plan stories/posts from my phone... So I turned to the Meta Business Suite to be able to plan things !\n\nIt works fine for posts, but the UI for stories just lacks all these personalization elements from the app. Anyway I can find these creative options WHILE being able to plan stories ? Thanks in advance !",
            "I have the app set up so it shouldn't save a copy of every post I make to my phone, but it does it anyway. All the solutions I've found on google direct me to the old settings menu. Is this happening to anyone else? Is there any way to stop it from happening?",
            "Hallo for few days my post don't show up on a persons tagged feed if we don't follow eachother. Is their a way to fix this problem? \n\nPlease help!!",
            "Hello! I got logged out of my account and cannot get back in. I have my password, but Instagram keeps asking for a two step authentication code (never set one up with my account) and none of the 8-digit security codes I have saved are working. Has anyone experienced this before? Any help would be greatly appreciated! Thank you!",
            "How do you get verified as a business? Our company has a name and logo, when we request Meta verified they ask a copy of an ID. After uploading we get a message they don't match the Instagram.\n\nDo we actually have to change the business account to my boss's name and change the profile picture to his face? That's sounds very strange and unlikely.",
            "I can't view certain stories (they say \"unavailable\") and i was recently tagged in a post but can't view it. These people did not block me and i don't have any violations. \n\n  \nI tried clearing my cache and unfollowing/following these people, but no luck. I have the most recent version of the app as well (Same issue on computer).",
            "when trying to react to a story, on IG desktop (on edge browser precisely) i get the droplist for \"saved personal info\"... as in a log in",
            "I can’t for the life of me get instagram to give my phone notifications",
            "Does anyone know why my hold to share became ways to share instead of people I can share with now? It just shows “copy link”, “messenger”, “messages” and “share to” instead of my top 4 people?",
            "I recently got logged out my instagram account and have been trying to get back in. I know the password and username and have the phone number, however:\n2FA is on: I cannot access the authorization code app I cannot access my backup codes I cannot access my account on another device to approve\nWhen I try to use the video selfies, they always reply back immediately with a rejection.\nUsing the forgot password method: It sends me back to the above mentioned methods\nUsing sign in with mobile number: It says it sends an sms code to me to verify, but there never is a code. I have made sure sms works on my account and have unblocked number 32665. Other links come from it for the video selfie, but never a code for this option.\nFor email option: I'm afraid I never setup an email with the account\nI have tried everything I could find online, from reinstalling to every other method.\nDoes anyone know any way they can help me, or LITERALLY any way to contact ANYONE for support?\nThe instagram help center is the most useless thing\nI've ever seen.",
            "I just started a new business account for one of my boss’s brands. It’s a biz account and linked to her business FB page but it doesn’t have the feature to schedule posts for some reason. I post a lot of videos that use in app music so 3rd party scheduler isn’t an ideal solution. Any advice on how to fix this problem and get this feature? I have it on my personal account and on her main account so not sure why it isn’t available on the new account… thanks!",
            "In the span of 1 hour, without warning my instagram account was disabled and when i pressed appeal it's been permanently disabled for no explicit or good reason \nCan someone tell me what should i do, i'm a dj while it's not my main job i'm currently growing and this is honestly depressing, i got a gig tomorrow and i can't even communicate on it, i had international contacts that i lost ... yeah  it's not the end of my world but god damn does it feel unfair",
            "I made a post on my FB page and had it shared to Instagram. I soon started seeing I was getting a LOT of likes (for me, anyway) on Instagram. That's great, but the image I posted is only \"half\" there. That is, I can't see it in the list with all my other posts. When I click on one of the \"likes\" the post comes up, and I can see I got a lot of likes, but I get an error message when I click on \"insights\" and it won't show with my other posts. As far as I can tell, I only have one account.",
            "Has Instagram been glitching to others too this week? It hides some random posts from others' feeds from my accounts. I noticed because one of the accounts (Blackpink so nothing that's censored) has been posting sets of three color coordinated posts but now their feed looks disorganised to me because Instagram hid some random posts. It's the same for some other accounts of artists that are definitely legit. If I switch to another account it hides different posts... Cache cleared, the problem still occurs. \n\n\nIt's not a big deal but I wonder if Instagram is cutting posts from feeds deliberately?",
            "A couple days ago got frustrated and tried to upload a reel a couple times as it wasn’t going up. Got an error message and now I can’t post reels, when i try to upload reel, i get an error saying please try again later - we restrict certain activities to protect our community etc.\n\nI have now not been able to post reels for a couple days.\n\nI can post regular photos without a problem, just can’t post reels.\n\nI haven’t broke any community guidelines whatsoever, i don’t spam, i usually post a reel once a day.\n\nHow can i fix this?",
            "Fix the login system!!! the issue has been for over 2 months  \n[https://www.reddit.com/r/Instagram/comments/1dher0d/instagram\\_login\\_issue\\_for\\_2\\_months\\_workaround/](https://www.reddit.com/r/Instagram/comments/1dher0d/instagram_login_issue_for_2_months_workaround/)",
            "My account was disabled a while ago because I needed to verify my age within a 30-day window. Unfortunately, I missed the deadline. Later, I tried to create a new account using the same email, but it says the email already exists. I can't access or recover my old account.\n\nToday, I received an email saying, 'We noticed a login from a device you don't usually use.' When I tried to recover or reset my account, it still says 'No users found.' It seems someone has hacked my account. Can someone please help explain this?\"",
            "So I’m currently in the spring bonus and have 17 days left, but I’m still posting content daily and anything past yesterday stopped monetizing in the bonuses, but it’s still saying I’m eligible and that I’m still earning -\n\nAlthough I see that I’m in fact not",
            "I am unable to follow new public accounts, especially those recommended to me. It keeps telling me that some profiles that are public require approval. You are telling me, that Leo Messi, the most famous soccer player in the world, has to manually accept my follow request on instagram? You kidding me right?\n\nI think I've been shadow banned but I don't know why.",
            "Glitch where even after unblocking they remain blocked and there’s no way to remove it:\n\nso basically a couple of my friends and i have regular issues and it often results in us blocking each other over petty stuff, however essentially the glitch is that they unblock me, but i am still blocked afterwards... when i go to search up their account they don't appear and when they search for mine i don't appear either and its like we have both blocked each other.\nthe accounts seem to simply not exist anymore for either of us and there's no way to fix it...\n\nit's not a case that they have kept me blocked because we have regularly hung out with each other and they have showed me their blocked list and tried searching up my username but still nothing...\n\nit happened about a year ago to one friend but they made a new account anyways so i had forgot about it, but now it's happened again\n\nis there any way to fix this?",
            "Hallo for few days my post don't show up on a persons tagged feed if we don't follow eachother. Is their a way to fix this problem? \n\n\nPlease help!!",
            "Hello! has anyone here ever gotten their disabled account back through meta verified support? I recently had my fanpage disabled for Impersonation and I got meta verified so I was wondering if anyone has had success with this thanks!",
            "Hi guys, will 2fa still be enabled if I deactivate",
            "You probably have to wait it out. Restrictions on Instagram are incredibly, incredibly strict. If you do something that even slightly goes against what they want then you're suspended for a week. I've been suspended from commenting 3 times now and the 2nd and 3rd time I'm 100% certain nothing I posted was out of line. It's a joke honestly",
            "You'll get it back no problem because they can't legally say 48 hours for it to be not 48 hours.\n\nAlso, you can make other accounts, from my knowledge, so you can just make a new account just as long as you remember the sign in to your main account. Use that to then message however many people you need or want to and just say you're suspended for a couple days",
            "your account has restrictions? if yes, this is the poblemn, only work on accounts that have no restrictions",
            "Had a similar thing happen to me. Just after creating the account, I couldn't connect to it and receive an error about violating ToS. I have no advice to offer but I would be glad if you could tell me the email address you've found as I didn't find any actual way to contact them.",
            "same issue here, lmk if you find any help.",
            "I have same issue. it'll let you post one landscape photo but anything more and it'll revert to garbage.",
            "[deleted]",
            "Same here, I also can't like any posts. My account says I should have all features available. doesn't show any violation of the TOS and I basically removed everything except the posts themselves and I still can't do anything. :(",
            "Can you sign up for a cheap phone plan and request your old number, then cancel after a month?",
            "Most likely these people deleted those stories, but you still got the notification.",
            "I'm experiencing that too.",
            "It's clean, no restrictions at all, all features are available.",
            "So frustrating, all my photographs are taken landscape.",
            "Idk if I trust him\nHe has 3000 followers and only recently posted pictures",
            "I keep contacting support but am not getting any replies. I'm so tired...",
            "its a scam don't bother .",
            "Wow people are really horrible. Thanks"
        ]
    },
    "Follow Friday/Follow Chain - Share Your Usernames & Find New People To Follow!": {
        "title": "Follow Friday/Follow Chain - Share Your Usernames & Find New People To Follow!",
        "score": 5,
        "url": "https://www.reddit.com/r/Instagram/comments/1dkuxau/follow_fridayfollow_chain_share_your_usernames/",
        "content": "Basically this is a weekly thread dedicated to expanding your follower base and find new people/content.  Just leave your Instagram username below and if you want accompany it with a little description of what you do.\n\n**This thread is not for F4F. There is no obligation to follow back the people who follow you from this thread.**",
        "num_comments": 55,
        "comments": [
            "Hey everyone,\nWe just started our journey to the beautiful world of photography.\nWe‘re a couple which tries to bring the nature and our beautiful planet closer to the people.\nWe follow the goal to show you that there are many animals and plants that you can discover.\nWe don’t want to earn money, we just want to share our hobby with you.\n\nPlease check us out but remember we just started.\nThank you ❤️\n\nOur Instagram: [https://www.instagram.com/pixelluminary?igsh=cTZydzI5Zm9jendw&utm_source=qr](https://www.instagram.com/pixelluminary?igsh=cTZydzI5Zm9jendw&utm_source=qr)",
            "https://www.instagram.com/ayo_itsmaryjayne?igsh=MTZuZmcwZTE3N2Y0ag%3D%3D&utm_source=qr\n\nMy personal account. I’m an ER nurse living in NE. I try to have as much fun as I can with my time off with my dog. Let me know you are from Reddit and I’ll follow back",
            "www.instagram.com/itsricksung \nFollow me and support me as a content creator!",
            "www.instagram.com/swizznerd\n\n👋🏼I focus on my life in LA through Popculture and just in general more positive, spirited content!✌🏼\n🌆🎮🎬🎧🎡🐶🩵🪩",
            "https://instagram.com/moro_fred\n\nUrban photography mostly around Montreal, New York City and Ireland. Street art, murals, buildings and other things like that",
            "Hi everyone!  I do a lot of nature, landscape and wildlife photography on my Instagram!  It’s also my personal account so I sometimes will put up stories from my daily life.  Don’t mind following back so long as the account is family friendly, just message me on instagram and let me know you’re from Reddit!\n\n[Ejrichvalsky](https://www.instagram.com/ejrichvalsky/)",
            "https://www.instagram.com/ejtemmephotography/\n\nNature and landscape photography!",
            "Hello everyone, I’m just someone who always never had a interest in social media, but wanted to express myself more and find cool people with interesting life goals and activities they are currently doing to influence myself as well. My account is going to be mostly about vlogging my life as I get used to it and would like to have cool peeps to share it with. Just let me know you followed from Reddit and I will add back!\n\nMy instagram: https://www.instagram.com/estbpanda?igsh=MXFjZzdobnZ2MTd5OQ%3D%3D&utm_source=qr",
            "https://www.instagram.com/james._.gry7\n\nJust a personal account that sometimes share experiences.\n\nIf you want, DM me on IG and let me know you’re from here for a follow back. Highly recommend similar content like mine, photography/art/travel and authentic ones.",
            "\nI follow everyone back\n\nhttps://www.instagram.com/tomkuno84",
            "Follow my accounts and DM for a follow back!\n\n[Wyatt Feegrado](https://www.instagram.com/wyattfeegrado?igsh=MTBoZXd0ZHNrOGh6OA%3D%3D&utm_source=qr)\n\n[Doctor Lawyer Comedian](https://www.instagram.com/doctorlawyercomedian?igsh=MW52Z214bWRlenJxcg%3D%3D&utm_source=qr)\n\n[Garam Masala Dating](https://www.instagram.com/garammasaladating?igsh=MWRua3ZjbGNzejM2&utm_source=qr)",
            "https://instagram.com/isteeeeeb\n\nHello! This is my personal/travel account. Give it a follow and message me if you're from Reddit so I can follow you back! :)",
            "https://www.instagram.com/mpppp.97\n\nf4f l4l !! personal blog :))",
            "Hello everybody,\n\nI love fashion  and I post sustainable fashion check it out,   \n[https://www.instagram.com/tatianaandrade.1/](https://www.instagram.com/tatianaandrade.1/)\n\nDM me to follow back❤️",
            "[https://www.instagram.com/avananlohy](https://www.instagram.com/avananlohy)\n\nPersonal account getting a bit of a revival. Fashion, animals, and nature. ✌",
            " Personal account, travel, nature, pretty places & things, etc. DM me, let me know you’re from Reddit and let me know if you want me to follow back. :)\n\n[hottnjayded](https://www.instagram.com/hottnjayded)",
            "\n\nHowdy, check out my film analysis page. Let me know that you're from reddit! \n\nMy Instagram: [https://www.instagram.com/junior\\_stargazer\\_goke2.0/](https://www.instagram.com/junior_stargazer_goke2.0/)",
            "follow my Instagram accounts, will follow back!\n\n[https://www.instagram.com/anon1970](https://www.instagram.com/anon1970)\n\n[https://www.instagram.com/theakwarddogs](https://www.instagram.com/theakwarddogs)\n\n[https://www.instagram.com/rmarco1990](https://www.instagram.com/rmarco1990)",
            "I post drone travel photography from Toronto to west Africa \n\nhttps://www.instagram.com/jo5h_/",
            "I put my name on a thread like this once and people just bugged me for a follow back. *Despite* the fact on the main thread it says it's. *not* f4f.\n\nNot doing that again.",
            "[@tristinflore](https://www.instagram.com/tristinflore/)\n\r \nhttps://www.instagram.com/tristinflore/\r  \n\r  \nMainly fit pics and fashion related stuff\r  \n\r  \nI also follow back",
            "personal account based in SoCal ♥︎\n\nvintage/thrifted fashion, nature, coffee enthusiast, travel\n\nexperimenting with film/digital photography as well ˖ ݁𖥔 ݁˖ ໒꒰ྀི♥︎꒱ྀིა ˖ ݁𖥔 ݁˖\n\n[https://www.instagram.com/sweet.yve](https://www.instagram.com/sweet.yve)",
            "My username is @addielynns & my account is mainly nature photography.\n\nhttps://www.instagram.com/addielynns?igsh=dmloN29lZWlsYnk5",
            "Hello👋Redditiors, If you like Fairies🧚‍♀️🧚‍♀️Mermaids 🧜‍♀️🧜‍♀️and Teapots🫖🫖Give me a follow❤🧡💛💚💙💜🤍Message me and let me know that you are from Reddit.\n\nhttps://instagram.com/i_love_angel_wings.",
            "Hi my name's Rick and I do toy photography at @sithlord2225, I try my hardest taking pictures of tiny plastic guys, if you're into Halo, Star Wars or Transformers consider checking out my stuff, it would mean a lot! \n\n\nwww.Instagram.com/sithlord2225",
            "Personal account with lots of travel and music related things sprinkled in: https://www.instagram.com/brxdb\n\nFollowing all personal accounts back 😊",
            "https://www.instagram.com/bored.analyst?igsh=dDN6OHYxeXd2c3Nn&utm_source=qr \n\n 🚀 Startup Growth and Funding 🚀\nIf you’re looking for grants, AI tools that may help you optimize your business, or simply an honest opinion about life as a startup founder (with insider tips), come visit 🫶🏻",
            "[L4L](https://www.instagram.com/p/C8fhmdmOUcB/?igsh=MTAyMGs4a3ZtbXVkbQ==)\n\nJust posted! Would appreciate showing love and I will return the favor 🫶🏽",
            "Kind of a food/personal/travel account https://www.instagram.com/jjstino?igsh=Y2h4YjJteHpqb2t4&utm_source=qr",
            "\n\n[https://www.instagram.com/allie.asana/](https://www.instagram.com/allie.asana/)\n\nFeel free to follow me if you’re interested in yoga, skateboarding, and travel, and enjoy \\~aesthetic\\~ feeds. I've also been sharing more vegetarian recipes in my stories and highlighting them.\n\nNo need to message me to tell me you’re from Reddit, but I prefer more personal accounts because I like to connect with new people.",
            "Follow for follow , i dont mind the content https://www.instagram.com/kristijankavran please dm me on insta if you are from reddit to follow you back!",
            "This homie's quirky selfie journey through life 😙🤳\n\nAlways grateful for feedback so feel free ✌\n\nwww.instagram.com/selfie_nut\n\n**@selfie_nut**",
            "Hey! ♡ this is my personal account.\n\nI’m a woman, in my 20s and I make music (formerly hard rock & now synthpop / art punk) so y’know: warning, I post about my music, but not in a spammy way.\n\nPlease message me & lmk you’re from Reddit. \nI’m happy to exchange likes. \n\nI’m a real person & read everything, but can be slow to reply at the moment.\n\nhttps://www.instagram.com/qrairie",
            "Hey Redditors! ✨ I do self portraits in artistic style, with a touch of folklore and beauty of nature, and other photography. I also do posts on my culture. If you are interested in such niche, then check me out ☺️ https://www.instagram.com/dabasmeita",
            "Hey everyone! I’m Marty from Canada 🇨🇦 ! :) This is my personal/art/nature page ! I’m looking for active accounts , mainly fellow artists and creatives that we can help each other grow and support each other (not just about me!) ! I follow back but please send me a direct message on Instagram as well so I know that you actually read this :P\n\nInstagram account https://www.instagram.com/martyrolling1/",
            "Hey everyone! I’m an artist and a professor here in NYC. My work is inspired by my connection to nature and just having conversations with her. Also love traveling and the desert! ✨🌙\n\nhttps://www.instagram.com/louisesposito?igsh=ZXY3YTB4ZG0wajcx&utm_source=qr",
            "https://www.instagram.com/allyouglobal A new lifting/streetwear brand looking to find some interesting and friendly people to interact and grow with on instagram. Follow me and I will interact QUICK! :)",
            "happy Friday!\n\n[Personal page](http://www.instagram.com/slightlysemi) - lots of dog pics, memes, and bathroom reviews \n\n-[RitualisticArtisticDesign](http://www.instagram.com/ritualisticartisticdesign) - this is the art page, a $10 monthly sticker club! I don't expect anyone to buy a sticker pack but liking posts will help bring traffic and for that I'm super super grateful\n\nI will like & follow back!",
            "https://www.instagram.com/arseny0x01/\n\nHi! I am an amateur photographer, I do everything from portraits to landscapes. I post rarely, but regular, only what seems to me worthy of your attention.\n\nDM me and i will follow you back and like your photos!\n\nhttps://www.instagram.com/arseny0x01/",
            "Hey reddit! I've deleted my instagram a couple of months ago, because I needed some time off social media, but I created a new account recently! It would be really cool to get some followers - and new people for me to follow! I'll be posting mainly things from my life, and places that I visit and anything interesting that I see in my journey through life!\n\nhttps://www.instagram.com/antoniocmj94/",
            "[instagram.com/zenonfriel/](https://instagram.com/zenonfriel/)\n\nart and music stuffs",
            "Hi follow me @life_of_serj  \n\nI follow back! :3",
            "Hello everybody! I take photos with IPhone 😊\nhttps://www.instagram.com/coshhr",
            "FOLLOW FOR FOLLOW!\n\n  \nHello everybody,\n\nI'm a travel blogger from Italy.\n\n[https://www.instagram.com/viaggiaconele](https://www.instagram.com/viaggiaconele)\n\nInstagram suspended my old account.\n\nCan't wait to connect with you!",
            "I need more friends. http://www.instagram.com/Brittinea",
            "Hi! I'm a support engineer from Ukraine, sharing a little of my work and my clothing options for photo shoots, subscribe if you like it.\n\n[https://www.instagram.com/etozheroma](https://www.instagram.com/etozheroma)",
            "My personal profile. Looking to connect with similar accounts. \n\nhttps://www.instagram.com/chayebert/?hl=en\n\nLet me know you're from Reddit and I will follow back.",
            "Career change coach + nature enthusiast. I mostly post about my puppy & hiking around Chicago.\n\n🌲🌊☀️🌬️🥾🐾\n\nLet me know you’re from Reddit and I’ll follow back :)\n\nhttps://www.instagram.com/altazcoaching",
            "[@jpsfg](https://www.instagram.com/jpsfg)\n\nSports, travel, and city photography. Photos of my life living in Las Vegas. Thanks in advance for checking out my profile!",
            "Music account - http://www.instagram.com/guitarsiren\nI'm a classical guitarist, playing classical and modern pieces. I go busking a lot. Genuine follows only please, I don't f4f on this account. Any likes/shares etc are really appreciated though!\n\nPersonal - http://www.instagram.com/leliavalois\nThrifted fashion, vintage finds, books, theatre, general adventures",
            "Hi all, i follow everyone back\n\n[https://www.instagram.com/manuort182](https://www.instagram.com/manuort182)",
            "Hello! I'm a freelance illustrator and writer. I'm open to meeting new faces and supporting others, especially with how IG is run nowadays. But I'm looking to connect with accounts, not bots. Thus, I can and will follow back (although I'm not a f4f person), but I can be slow about it so please don't take it personally if I don't follow back right away. Oh, and if you’re from Reddit, be sure to let me know. Thanks! With that, here's my account! [https://www.instagram.com/fadartworkpage](https://www.instagram.com/fadartworkpage)",
            "I am creating fun,bright and beautiful makeup looks. Maybe you find some ideas for yourself, ir just entertainment. Fellow beauty lovers are welcome, I do follow back ❤️ @dianasmakeups. ",
            "I love nature and my best friend is a photographer as well! :)"
        ]
    },
    "Whats a terrible song that went viral on instagram reels?": {
        "title": "Whats a terrible song that went viral on instagram reels?",
        "score": 2,
        "url": "https://www.reddit.com/r/Instagram/comments/1dlvbs4/whats_a_terrible_song_that_went_viral_on/",
        "content": "For me its that \"I like the way you kiss me\" song my god fucking hated that shit ",
        "num_comments": 2,
        "comments": [
            "Oh no oh no oh no no no no no. Annoying af. 😂",
            "That too😭😭I had to bring my phones volume all the way down whenever i heard that shit"
        ]
    },
    "Instagram profiles show black images": {
        "title": "Instagram profiles show black images",
        "score": 6,
        "url": "https://www.reddit.com/r/Instagram/comments/1dloy0f/instagram_profiles_show_black_images/",
        "content": "I am having trouble with images loading on Instagram and it makes no sense! Let me explain:\n\nOn my personal account: I can do everything\n\nOn my other account: it’s a professional page (meaning it has the professional dashboard that shows random account statistics)\n\nI am able to scroll through my feed or “for you page” and like posts, share, or comment AND message people\n\nHowever, when I click to my own profile or anybody else’s, the wall of posts are all black! You can click on a post and it shows the little “try again” circle with the arrow type of thing. If I click on a picture it’s black but when I click on a reel, it appears black but opens and plays once I click it whereas the picture stays black. I can also see any accounts reel section and tagged photo section.\n\nAlso, when I log in from my browser on my laptop, there are 0 issues and I can do/see everything.\n\nIt’s been over 24 hours and I’m just wondering if anyone else had dealt with this.\n\nI tried to reset the phone, uninstall Instagram, and all of the basic things but I’m just curious if anyone knows what to do :) Thanks\n",
        "num_comments": 3,
        "comments": [
            "I’m getting exactly this too since the update! Scared to logout as I’ve seen some people can’t log back in 😭",
            "Same for me as well."
        ]
    },
    "Does anyone know if this is a new update? Hold to share isn’t people anymore?": {
        "title": "Does anyone know if this is a new update? Hold to share isn’t people anymore?",
        "score": 4,
        "url": "https://i.redd.it/4877rstb038d1.jpeg",
        "content": "I didn’t do anything it just suddenly became this way when I opened the app?",
        "num_comments": 1,
        "comments": [
            "This is so annoying"
        ]
    }
}