{
    "Trump’s Not ‘Bluffing’: Team MAGA Is Planning an Extreme Second Term": {
        "title": "Trump’s Not ‘Bluffing’: Team MAGA Is Planning an Extreme Second Term",
        "score": 2784,
        "url": "https://www.rollingstone.com/politics/politics-features/trump-not-bluffing-maga-extreme-second-term-1235044464/",
        "content": "",
        "num_comments": 218,
        "comments": [
            "Project 2025. Read it. Vote against it.",
            "Excerpts:\n\n\n\n“Any activists who doubt President Trump’s resolve in the slightest are making a drastic error: Trump will unleash the vast arsenal of federal powers to implement the most spectacular migration crackdown,”....\n\n“During the first Trump term, some of the policies he was dissuaded from — wanting to pull the U.S. out of NATO, family separation, things like that — he was able to be dissuaded from those things, because of some of the personnel around him,” says Sarah Matthews, who served as one of Trump’s deputy White House press secretaries. “In a second Trump term, he is not going to have any of those people around him ,and he’s going to go ahead and move forward with these kinds of controversial policies he wanted to pursue during his first term …",
            "If he gets elected again, it will literally be the end of democracy in the USA. Mark my words.",
            "    Trump and his maga cult are pure evil.",
            "Trump is always telling you what he’s doing and what he wants to do. He just does a reverse Uno and uses Biden’s name and the Democratic parties name in place of his own and the GOP.\n\nBelieve every word that Trump states as far as his actions when and if he becomes president.",
            "They are planning/ planed coup number 2- \n\nBigger, bolder and more dastardly than the first.",
            "Reinstate segregation. Death penalty for women who miscarry. Death penalty for same sex relationships. Establishment of state churches. These are all literally on their agenda. \n\nRead the history of 1930s Germany.",
            "We know! Vote blue or wind up in a concentration camp, the cotton field, or the southern front in the war with Mexico that Trump will start!",
            "Nobody should ever assume he’s bluffing.  Yes, he lies all the time.  But he also believes in retribution for any percieved slight.  In fact retribution appears to be his true religion.",
            "TRUMP WILL RUIN THIS COUNTRY\n\nLOCK HIM UP!",
            "Republicans **HATE** America.\n\nRepublicans want to **DESTROY** America.\n\nVote blue, no matter who. Vote like your life depends on it.\n\nIt very likely does.",
            "I think some of the anti-Biden activists believe that people will rise up against Donald if he becomes too tyrannical. It is a laughably naive belief.\n\nIf the American people elect Donald Trump for a second term after all the terrible things he have done, he will be able to rule with impunity.",
            "These people are absolutely repugnant traitors. And by these people, I mean anyone who even votes for a Republican anywhere down ballot, much less for Trump.\n\nThere are zero good Republicans. None.",
            "I can't believe how mean-spirited and divisive our politics have gotten.\n\nWhen did planning to end democracy and murder your opponents become \"extreme?!\"",
            "I sincerely can’t fathom how anyone can still think the man isn’t serious about any of the monstrous things he says. He has no sense of humor, no humility, no capacity for self-depreciation, nor the introspection to highlight the worst qualities of himself to work on or improve. He says exactly what he wants to do. When he gets applause, he doubles down. When he doesn’t, he finds a middle ground that will get applause, and builds a bridge to where he wants to go. He never backs down or reverses a position, he just waits and gets increasingly violent, angry, and vindictive. \n\nHis election was the very thing the electoral college was created to prevent, but has now been weaponized to ensconce a dictatorship in power against popular will. We should all be very frightened, because even if we beat Trump, the right only has one path forward, and it’s not through playing by the rules…",
            "We're so close to the plot of Civil War. I can't believe people don't understand that movie is a direct allegory to the excesses of Trump.",
            "The way things are shaping up looking at Trump I think this man will have a stroke before election",
            "The crazy amount of people in America  that read at a third grade level are also not bluffing…. And voting.",
            "And you can guarantee day 1 he'll start laying the groundwork of why he deserves a 3rd term. I know you mouth breathing maga cult members think this is what you want, but I can assure you beyond a shadow of a doubt, you don't. This would end very, very badly for everyone.",
            "Why would we think he was joking? He tried lots of his bat-shit insane ideas when he was in office before. It’s just that the safeguards in place stopped some of them because he has no idea of the presidency or any of the government works.\n\nNow that they saw he can get power a bunch of evil maniacs who are actually smart have laid the groundwork to actually do all the fascist plans he wanted in the first place.",
            "Fuck these traitors!",
            "The balance of power in the world will shift to shitty if Trump wins.  It’s not about the US anymore, Russia China Iran will just do what they want and Trump will go on ‘missions’ to his dictator friends and give away other people s land (Kissinger) and call it winning. EU will have to start producing its own weapons and organizing its own defense. In the US any election not going magatards way will be called ‘fake’ and Fox will go Rat.com, Putler style. Trump is somewhat sentient and learning from dictators.",
            "*Permanent Dictatorship",
            "When you're on the extreme RIGHT then everyone is on the LEFT of you.",
            "I believe that",
            "What I do know is, the country will inevitably collapse if he's allowed even near the White House again knowing what happened in 2020 and why we kicked him out in the first place....",
            "They have no qualms about making millions of elderly people virtually homeless by killing Social Security.",
            "Vote \n\nOr Maga votes for you",
            "He’s an absolute madman twisted like Adolf Hitler.",
            "Literally trying to brainwash people into thinking all the promises / stuff he said during the first term was due to other people.\n\nHe’s literally just trying to brainwash people into voting for him.\n\nPeople already know another Trump term is going to be worse than the first. He’s campaigning for his ego, not for the country",
            "Yeah, people need to learn from history",
            "Sounds un-American.",
            "Former Gut can get bent.",
            "The Republican Taliban",
            "Donald Trump shits himself",
            "Wow! Just read through project 2025. What a terrifying time to be alive.\n\nAs a Brit, this, aside from the rest of this absolute rot, terrifies me:\n\n✓Abortion is not health care (it harms women and girls)\r\n✓ Ban Mifepristone and outlaw mailing it\r\n✓ Ban the morning-after pill\r\n✓ Remove all funding from Planned Parenthood\r\n✓ Prevent Medicaid from paying for abortions\r\n✓ Promote the ‘rhythm’ method for contraception (fertility awareness–based methods)\r\n✓ Ban fertility treatments such as three-person embryo creation\r\n✓ Marriage and family should be defined by the Bible",
            "I wish this mother fucker and his moronic cult would spontaneously combust",
            "Yeah there are two parts to dealing with trumpers.  First it's hearing what Trump says he's gonna do and the second is hearing them say he didn't say what he said.",
            "Talk about A Clockwork Orange world.",
            "Yeah, no shit he isn’t bluffing",
            "r/defeat_project_2025",
            "Republican climate change denial should be a crime. At what point are these fkrs held to account for destroying the planet?",
            "He wants to be the Old Testament type of president. Vengeful, spiteful, cruel....",
            "I am so tired of this bullshit rhetoric. Why does he have to be so insane? Even if he does win why can't he just be a normal, boring president who deals with taxes and politics and international affairs in the normal boring way. \n\nDoes he really have to burn the whole goddamn country down? This guy is such a trash fire.",
            "It's always very comforting when an already extreme guy starts throwing around the word'''extreme'' /s",
            "I have a better idea, no second term.\n\nBiden/Harris 2024\n\nBlue all the way through \n\nVote bluuuuuuuuue",
            "Why can’t people, or at least a majority not think this fuck is a complete and utter fool.\n\nThe world will be embarrassed on America’s behalf, if this guy was the election .",
            "A second term would feel tantamount to a tacit agreement, in his and all of the right’s eyes, to go scorched earth.  There’s no reason to think bluffing is in the cards here.",
            "I hate boomers for this",
            "We have always know who he is. We must stop him at the Ballot Box",
            "*all of the lesser of two evils* and *genocide Joe*\n\nNeed to see this. We can convince a tiny bit of republicans but let’s face it they’re not budging. \n\nBlue 2024 lets make this election blue",
            "Sounds delusional.",
            "it will be countered",
            "Putin Puppets",
            "It's scary the power you guys have",
            "My god that’s some scary shit. In more concise terms, do away with our current form of government and replace it with a Christian based dystopia.",
            "The only hope is their incompetence and tendency for infighting. Do not expect the public to vote against this.",
            " Maybe his backers know it might be a while before the next useful idiot comes along",
            "US military personnel take an oath to defend the Constitution against enemies both foreign AND DOMESTIC.  They also are obliged to not carry out an unlawful order.   I believe in professionalism of the US military such that much of what is proposed here would not be well received by the US military despite what the little Miller kid thinks.  It could very likely create a constitutional crisis, but that’s standard fare these days it seems.",
            "Prison term?",
            "And it’s going to happen and I’m here for it. Won’t impact me in a negative way. Can’t wait for all of the “Genocide Joe” college idiots to be rounded up for protesting once Trump gets in.",
            "Trump will kill democracy and start locking up opponents. He and his ilk will be worse than Putin. And gulag's will look like fucking summer camps.",
            "“As we did in the first term, we are prepared to use every tool we have to combat that, including litigation.\"\n\nUnless that tool is a well-armed, trained precise special force to take out these idiots, you're doing nothing but wasting time and making yourself an easy target to be detained indefinitely.",
            "After the whole faked photo thing a couple of years ago, I stopped trusting the rolling stone on anything.",
            "The question is, is he ready for the potential rebellion?\n\nEdit: The question is, is he ready for the potential rebellion AGAINST him?",
            "The thing is Biden has enough to lock chrump up but he’s not doing it.",
            "His handlers won’t let him go too crazy because they will lose congress in the mid terms and then can’t get their tax cuts passed.  It’s all about the money.",
            "I think in the long run trump wining is better.\nWhy u ask, because right now ppl are to complacent, with environment protection, politics, which have divided ppl so much, because theres to many fools running around who is easily manipulated.\nBut when trump enters, its will make picture more \"black and white\", yes theres gone be ppl who dont see any problem with that, but they are few.\nAnd lastly if trump wins, americans have they hands full with their own problems, it means rest of world can take thumbs out of their ass and start making decisions on their own, and hopefuly us cant meddle in that.\nEurope for example want to make decisions regarding own security but always relay to us protective wing.\nCrying stops and hopefuly we spring to action.",
            "Thanks for linking to Project 2025.  Sounds great.  Let's get started!",
            "Thank you for bringing up Project 2025! For those who don’t know about Peojext 2025: These are policies written by people affiliated with the Trump campaign, his previous administration, and other right wing conservatives that was created through the think tank the [Heritage Foundation](https://www.project2025.org/). They have policies in place for Mr Trump to put forth: an entire first 180 days in office playbook, which is described in a [920 pg manifesto](https://static.project2025.org/2025_MandateForLeadership_FULL.pdf). If you want a condensed version, the Heritage Foundation has also put out a 13 pg document “[Five Reasons Leftists Hate Project 2025.](https://www9.heritage.org/rs/824-MHT-304/images/5%20Reasons%20Leftists%20Hate%20Project%202025%20eBook%20THF.pdf)” The website [Stop the Coup 2025](https://www.stopthecoup2025.org) has a [pdf of the key proposals](https://static1.squarespace.com/static/6547d46ce0be13435001c0ad/t/663d101970106d75bbfce2c0/1715277849753/REVISED+12.16+_For+Release_%7B10+pgs%7D_Key+Proposals+of+Project+2025+by+Stop+the+Coup+2025.pdf) from each chapter of the Mandate. You might even take a gander at r/Defeat_Project_2025 for more information.",
            "Heard enough of project 2025 at this point to already know that it literally can't/shouldn't happen.\n\nI didn't like Trump or vote for him the first time he ran for office, really didn't need more convincing, but Project 2025... Did just that.",
            "*'The road to Gilead'*",
            "Trump-turd will lose. Let's get the vote out ....! Register... and vote for Biden",
            "Gonna have to find 8 million votes. Good fucking luck to him.... not a single level headed independent will jump on board with these fascist policies and you best believe most serious independent voters know about this shit.\n\nShow up and vote boys and girls",
            "Project 2025 is how I argue against people saying \"there's no way I'm voting for Biden\". My in-laws expressed this, and I said \"Okay, that's totally fine and within your rights as an American. In that case, you wouldn't be voting *for* Biden, you'd be voting *against* Project 2025. That's your real enemy this November.\" \n\nThen I saw the lights come on as they had no idea what P2025 is and I happily explained as much as I could. They seemed genuinely perturbed and mulled over our conversation.\n\nTo anyone with family that just \"can't bring themselves to vote for Biden\", explain it the way I did and see what happens.",
            "I don't know that it would make any difference at this point, but it's perhaps worth posing the question to any of the fans of this project out there, \"What would you think of it if, once Trump left office, a Democrat stepped in with those same powers?\"\n\nIt's basically an instruction manual on how to turn the USA into an dictatorial fascist state.",
            "Spread the word to all the lefty subs cause god damn they are convincing ppl not to vote",
            "Vote against it now and forever.",
            "Execute order 66",
            "It's Sharia Law: Christian Nationalist Edition.",
            "Namely, ivanka won’t be there to dissuade daddy.",
            "MAGAs don’t know big words like democracy. They know “winning” because like WWE, that’s all that matters",
            "They’re already telling me we don’t live in a democracy. We live in a democratic republic! The debate has just turned beyond fucking dumb.",
            "I think they'll pull another Jan 6th and try a coup",
            "Unfortunately, because of Project 2025, *any* next Republican will be the end of democracy (and more generally legislative control) in the US. Congress needs to wake it's ass up and pass laws preventing Project 2025 (or 2029, 2033, etc.) from ever coming into place. I'm currently in Germany on vacation and, in reading how Hitler took power and parliament lost all of its legislative power, I'm seeing a lot of connections here...\n\nVote y'all.",
            "Re-elect this flog and the putsch will be immediate. You'll have to take up arms to ever vote again.",
            "I don’t even know if the USA will survive, gutting the administrative state is incredibly stupid.",
            "And then we'll have to worry about that fucker again in another 4 years. I fucking hate it so much.",
            "Do not let the dumbs and evils into leadership positions. They will obliterate all trust in our society. Domestic and International alike.",
            "They said it themselves: [https://www.youtube.com/watch?v=oVfA4pkJ8rw](https://www.youtube.com/watch?v=oVfA4pkJ8rw)",
            "Happy Cake Day!",
            "Remind Me! 1 year",
            "It wouldn't be the end of democracy. I'd be the beginning of a new revolution",
            "We don't live in democracy already. Corporations run everything ",
            "Looks more likely that he will win unfortunately. Sad times.",
            "Trump is a puppet. A useful idiot. The people pushing him are evil. The cult aren't evil, just bigoted and ignorant.",
            "Well he didn’t lock her up and didn’t build the Great Wall and didn’t delete Obamacare",
            "FAFO. No holding back the national guard this time",
            ">Bigger, bolder and more dastardly\n\n\nThis new South Park movie's gonna suuuck!",
            "It won’t be possible if he’s not already sitting in the White House. He has no troops to order and the people that are willing to take up arms are disorganized nut jobs who have no command structure. The only reason they made it into the capital the last time was because there was no attempt to actually repel them. Just a shelter in place order and locked doors. An actual active response would have put down that mob in two seconds. The biggest part of them were just milling around after others did the actual breaking in. \n\nIf they would have actually reached any of the important people the guns would have been pulled out and people would have died en masse if they didn’t flee. One woman actually did get shot trying to break into a room and everyone else bailed when the bullets started flying.",
            "When you say “literally,” is it actually literally in the agenda? Total serious question and not at all trying to be a smartass. I saw someone posted a link to the 900 page playbook for project 2025 but simply don’t have the time to actually read all that.",
            "Unfortunately the left in this country doesn't find Biden close enough to the varied niche and specific agendas, if a few 1000 of them stay home across a couple key states... it's Trump time again regardless of how many votes Biden gets in New York and California.\n\nDark days on their way I fear.",
            "Retribution is what made him run for president in 2016. Obamas jokes at him at the White house correspondent dinner made him feel embarrassed in front of all the elites.",
            "Eh, the anti-Biden activists are just privileged kids who don't believe bad stuff will actually happen to them.\n\nThey are ashamed of their social privilege, so they pretend to be leftists as a coping mechanism. But they'll gladly throw people of less privilege under the bus to feel better about themselves, thus proving they aren't leftists at all.",
            "If “the people” rose up against Trump, the anti-Biden camp would be screaming treason, not silently cheering them on. *They* certainly aren’t going to rise up against him when he starts crossing the big lines. They already had the opportunity to and they didn’t take it. They’ve shown their stripes. They just started whining about how the Dems let this all happen, and they are actively opposing a president who actually has their best good in mind.",
            "My wishful thinking self thinks they can rise up against trump but i know that the military also need to act upon this",
            "Trump is a Sociopathic Narcissist- my dad was as well. It's important to remember that these people are sadists; they love to watch others in pain. If they think you're someone who hurt them at some point, then they want to see you suffer immensely; if you're just average, then they want to see you suffer enough so that you'll always be below them; if you're on the same level, watch out; and if you're fighting for them and get hurt they'll practically have an orgasm- but remember, they could care less about who you actually are and even though you fought for them, they will never really acknowledge this or compensate you (they are extremely selfish people). Sociopathic Narcissists see humans as simply objects that move about; to them you're either a stepping stone for yhem to use and abuse, or else you're a stumbling block and can cause them to fall - in this case, watch out.",
            "The more miserable they could make “others” the better they would like it.",
            "Actually homeless.",
            "Please just vote. You may not love Joe Biden or Kamala but if you're young this will impact you and if you're a woman you're completely screwed.",
            "So did Hitler, but we know what he did, don't we?",
            "By what exactly?",
            "Not only “ready” (he isn’t, really), but he’s eager for any excuse to use violence.\n\nHe has spoken about his willingness to use the military against civilians within this country.\n\nSome are convinced that unlawful orders would be ignored or rejected, but if they were unmistakably coming from the Oval Office I really think the “chain of command” mentality would result in devastating crimes being committed during a second Trump Administration.\n\nI’m uneasy about depending upon the military personnel being willing/able to recognize criminal orders, and—even worse—think a statistically significant portion of the troops are MAGA friendly in the first place.\n\nIt’s true, we would hope that professional military people would do the right thing, but couldn’t we say the same thing about Republican Senators, Representatives, and other politicians?\n\nToo many are willing to take “the path of least resistance”—especially if they actually agree with at least some goals.\n\nI do respect the military, but at the same time I don’t trust that they will be a more effective limit on MAGA extremism than Republican Party elders have been.",
            "Biden can't \"lock him up\" any more than Trump could lock Hilary up. He's not a prosecutor, lawyer, judge, cop, any of that. A president that can lock up his political rivals isn't a president, they're a dictator.",
            "His handlers are planning on guaranteeing future election results. They won't have to worry about winning hearts and minds.",
            "Congress? Trump said he intends to replace the Constitution with one he's going to write. There won't be a Congress!",
            "Trump isn’t springing to action on anything that doesn’t benefit him. \nAnd he’s got a vendetta (in his eyes) to settle and that means punishing the left (and some on  the right too). \n\nIt will be a revenge presidency. We don’t need him , he’s an embarrassment and l would hate to know the true story if his 1st time in office. Way more we don’t know versus what we do. . He’s incompetent.",
            "No one on Planet Earth (with the exception of Putin) needs Convicted Felon Donald Trump for anything.  Are you alright?  Suuuuure you are.",
            "That’s a lot of words for wanting to watch the world burn. Sounds insane, but you do you.",
            "Loll nice parody account",
            "Should be titled “5 Reasons ANY REASONABLE HUMAN BEING WHO is NOT an unbelievably  selfish POS” should feel something regarding project 2025 along the lines of “this is literally all that’s standing in the way of the most impressively hot garbage fascist bologna turn-around of a political system in the history of politics and if you are a reasonable human being MAKE SURE YOURE STILL REGISTERED TO VOTE AND MAKE SURE TO ACTUALLY VOTE LIKE THE FREAKING FUTURE OF WORLD POLITICS/SAFETY DEPENDS ON IT BECAUSE IT DOES!!!!!!!!!!”",
            "> Five Reasons Leftists Hate Project 2025\n\n> Outlawing pornography\n\nYeah, what a load of BS they wrote. The porn industry generates *dozens of billions of dollars* of yearly revenue in US alone. That’s a huge market and lots of money. *Lots of interests at stake.*\n\nIf there is one dong GOP is great at gobbling, it’s corporate dong. And corporate interests are at risk here.\n\nBig talk for fringe hillbilly Bible thumpers, but not realistic at all. Corporate knobs can’t be left unpolished like that.\n\nTo go with it would be to *harm the profits of the rich*. And that’s basically heresy to GOP.\n\nI wonder if those Bible thumpers supporting that even realize it.",
            "Boil it it down for ya: TREASON.  Penalty? You all know that endgame. Fun fact: there's a dance at the end.",
            "\"pRoJeCt 2025 wIlL ReJeCt ClImAtE hYsTeRiA\". Are you sure they're a think tank?",
            "Jesus that’s scary",
            "I also want to point out that Trump himself is not necessary for it to be enacted. It's made for any conservative in power to be able to follow through on. The only real way to prevent the fascist takeover is for enough of us to vote blue to turn enough seats in the house and senate for laws to be passed that can prevent the coup.",
            "That is terrifying",
            "Remeber that Project 2025 isn’t Trump, Trump is the current frontman for project 2025. It doesn’t ens with Trump’s defeat this fall.",
            "Keep telling yourself that. We kept telling ourselves that a trump presidency literally couldn't happen, then a bunch of flyover jackasses said \"whats the worst that could happen?\" Now look where we are at. We have I like beer moron, surprisingly competent acb who seems to get it right sometimes, especially when the other conservative judges seem to want to take it  step too far, and I have no opinion on Gorsuch because I just don't follow his opinion much. The other two I have actually seen their opinions.",
            "Yeah…and the scariest part of this? We have to win every election, they only need to win one. I’ve got a terrible feeling about how the rest of my life is going to play out. Please, everyone, VOTE LIKE YOUR LIFE DEPENDS ON IT!!! (Because it actually does)",
            "You forgot the bit where they fix things so no Democrat can ever stand for election again.",
            "I consider myself a lefty, and I think David Sedaris said it best: “I think of being on an airplane. The flight attendant comes down the aisle with her food cart and, eventually, parks it beside my seat. \"Can I interest you in the chicken?\" she asks. \"Or would you prefer the platter of shit with bits of broken glass in it? To be undecided in this election is to pause for a moment and then ask how the chicken is cooked.”",
            "He wouldn't even stop when she told him no come on.",
            "Can't she at least drop by and give him a tension-relieving BJ? Inbreeding is a red-state tradition.",
            "They hate democracy. To them democracy=democrat. That’s why they CONSTANTLY espouse that we aren’t a democracy. They hammer in “we are a constitutional REPUBLIC” because republic=Republican. It’s a flawed semantic argument. We are a Democratic society utilizing a constitutional representative republic. It would be like saying “we aren’t a fruit we are a banana”",
            "#JohnCenaForPresident",
            "In the Netherlands we have a Democratic Republican Party. \n\nThere are many political parties and combinations possible. Meanwhile our Liberals and our Conservatives are in at least two other parties. You Americans just settled on two random ones.",
            "Constitutional Republic another form of democracy. ",
            "My dude!!! I'm with you.",
            "We eat our own so that was bound to happen.",
            "Trump is still evil and self serving 100%. Sure the people pushing him are too but in Trumps mind he thinks he has control here.\n\nTrump is a puppet and a useful idiot but that is not mutually exclusive from his own agenda and evilness. Both can exist at the same time.",
            "Like I said, trump and his cult are pure evil.",
            "True. But he still should just stay away.",
            "He came within one vote of getting rid of the ACA. They will try again.",
            "Problem is a large part of the NG/ Military are Chump loving ass kissers. \n\nMany in the military are made up of people who have immigrated to this country and have no real ties to the national body. They will willfully follow any order given them- that's pretty scary for Americans who might find themselves locked down under the Insurrection Act by a fascist egomaniac like Chump.  A worm that is anted to shoot protesters during the GFP and had to actually be talked down from giving the order. \n\nThere is a lot of information on this subject easily available on the web.",
            "He has an army of loyalists across the country who are going to act in the lead up to, on, and after election day.",
            "lol\n\nAre you even paying attention?",
            "Honestly, you should probably make time. You don't need to read the details. The general theme of the proposal becomes clear rather rapidly. It's mask-off fascism.",
            "\"Death penalty for women who miscarry\" I'm guessing that's not in there",
            "They're a bit put off by the whole genocide thing.",
            "\"...he’s eager for any excuse to use violence.\" I wonder how he'll feel when the violence comes to him.\n\n\"Some are convinced that unlawful orders would be ignored or rejected, but if they were unmistakably coming from the Oval Office I really think the “chain of command” mentality would result in devastating crimes being committed during a second Trump Administration.\" That happens, then a third impeachment is guaranteed, and it'll depend: Third time lucky, or three strikes, you're out.\n\n\"Too many are willing to take “the path of least resistance”—especially if they actually agree with at least some goals.\" And in the case of some people, the path of least resistance means: \"It's better to be on the side of the devil than in his path.\"\n\n\"It’s true, we would hope that professional military people would do the right thing, but couldn’t we say the same thing about Republican Senators, Representatives, and other politicians?\" Any military personnel with sense would easily do the right thing, and they wouldn't follow Trump's orders...and, quite the contrary, THEY would be the biggest group to turn on him if he tries to push them enough (like when a defiant dog bites if you rile it enough). Unfortunately, it's not likely the Republican Party will do the right thing; in fact, they're so much more like Greedpublicans, Abraham Lincoln would be turning in his grave enough to cause a slight tremor in where he's buried.\n\nA civil war could definitely be inevitable: It'll be the military, with Democratic backers and people of sense on one side, and the Greedpublicans and crowds of mobs of stupidity on the other.",
            "Biden should absolutely be a dictator for a day.  Chrump would for 90 days.",
            "11 years, though, that's some real commitment to the bit.",
            "But it’s not fascist! Didn’t you read the 5 reasons? Fascists are socialists and liberal!!! /s",
            "Oh they're redefining what \"pornography\" means as well. It will include anything that isn't cis straight",
            "I'm confused. Mini Mike said he and his son monitor each other's pornography use, did he not? Whatever shall they do? 😱",
            "Yeah, that's exactly what they used to say about abortion...",
            "There’s more porn on X than porn sites",
            "What sort of dance at the end is it though? \n\nSpringtime for Hitler?\n\nSwan Lake?\n\nElectric Chair Shuffle?",
            "Me thinks they are just \"tanks\" at this point...",
            "Well, an organization supported by the oil industry to brainstorm lobbying points.",
            "Very good point!",
            "This needs more upvotes",
            "I think that’s why they said “can’t/shouldn’t” as opposed to just can’t, because they know it is still a possibility despite the fact that it IS still possible (if not straight up probable) DESPITE so many of us knowing how legitimate and crazy beyond freaking dangerous it is…",
            "One of the other two used to be called a handmaid. No lie.",
            "I told my dad I would eat a plastic plate if Trump won in 2016. I’m way past micro plastics in my system thanks to our orange-faced leader.\n\nIt wasn’t just that. I had just assumed there was some sort of mechanism in place that would never allow the Republic to light itself on fire. Kind of like the way Hilary and the party establishment took it from Bernie (thanks for that one Mrs Clinton).\n\nNow I know that chaos and greed ‘Trump’ the security of the State. The political theory of ‘realism’ died for me on that brutal November morning.\n\n[Realism](https://en.m.wikipedia.org/wiki/Realism_(international_relations))",
            "Totally agree, also a leftist but im canadian.\n\nBut the issue is american leftists arent pausing to ask how the chicken is cooked they are screaming that any madman who would eat chicken is soulless",
            "She can, so can Jared",
            "They don’t want to be just any fruit, but a banana specifically.",
            "You are correct. They do not know and will vote like sheep for the fall of our democracy. Do you think they will get it when our country falls?🤦‍♀️",
            "Just ask them to explain what the difference between a Democracy and a Republic is, 99.9% of them would not even try because it's just a line they parrot.",
            "Botanically speaking, a banana is a berry AND a fruit. So it's even better. Just like the US government being a republic AND a democracy.",
            ">not mutually exclusive from his own agenda\n\nFair point.",
            "Ok. Tell me about the military forces that Trump is currently in command of. Explain their logistics and how they will be able to sustain the extended military campaign to track down and kill the current government. They’ll need armor and the ability to support it as well as be able to achieve air superiority. \n\nIt ain’t happening. Especially now that the commander in chief is willing to defend the capital. No unruly mob is going to penetrate a military defense.",
            "I’m not as sure as you are that the military as a whole will refuse illegal orders if Donald took office again.\n\nAll of the Republican officeholders swore an oath to the same Constitution as the military people, but any who actually take that oath seriously are rarities \n\nOur best hope to keep the military out of domestic politics is to win the election.",
            "No dictator is a good dictator.",
            "That'll shut down the good, clean lesbian porn that all Republicans love",
            "besides changing definitions they try to make it sound like a good thing to those that are either religious (Christians), unable to understand the full context of what they doing, with some straight BS, and maybe a few items that make sense but are nothing new like supporting Taiwans independence (while limiting freedoms for Americans).",
            "The Oak Tree Swing is my personal favorite.",
            "Dancing in midair. Also known as a short drop and a sudden stop.",
            "Or they meant their thinking has tanked.",
            "You never know with anyone nowadays. I've had literal arguments against what the orange moron has said knowing he said it, met with he didn't say that. You never know anymore.",
            "\"It wasn’t just that. I had just assumed there was some sort of mechanism in place that would never allow the Republic to light itself on fire.\"\n\n  \nThere *were* such mechanisms in place, and in fact, there still are. The problem is, the people who have the power to prevent \"lighting the Republic on fire\" are the arsonists themselves. \n\nThere's a fundamental rule in security: No system is safe from the people in charge of its safety. People choosing not to do their job, for whatever reason, are always the biggest hole in your defenses. Prison guards smuggle drugs, cops steal, spies sell secrets, judges don't apply the law uniformly, politicians won't impeach the president if he's from their party. It's all the same problem, just with different paint jobs.",
            "Bernie bros really need to get the fuck over it already.\n\nHe was a rank outsider to begin with.  He's way too far left for most Democrats he was never going to beat a well respected insider like Hillary.\n\nI mean I like the guys politics even if he is a touch far right for me but he never had a real chance of getting the nomination.  He doesn't appeal to enough of the democrat base.  He's too far left for them.",
            "It’s more like American leftists are screaming “you’re not giving me filet mignon? I’ll show you “I’M NOT GONNA EAT ANYTHING”.",
            "Jared seems like he'd like to watch instead",
            "They'll look around at the wreckage of America and blame wokeness.",
            "Not if 1984 by George Orwell is any indicator.",
            "They are voting for the fall of our Republic. Country’s not a democracy, it’s a democratic republic. Most of them don’t know this or have a skewed idea of what a republic is.",
            "They're just bigoted.  It's a bit concerning when people forget don't judge maliciousness for what can be explained with stupidity.  When you call even a cult of people evil history shows that's how you get a little gin on the side.",
            "ROFL This is the same kind of stupidity that’s gotten the US into this situation. \n\nTrump and his goons aren’t planning a military takeover. They’re planning a legal takeover where they fuck the election into total chaos, nobody gets to 270 because of what happens in a number of states, and then the corruption in the courts throws this to Congress, which votes for Trump. \n\nThey’re going to put Biden in the position where he’s ratfucked out of office. He’ll have to either concede and leave or call this out, declares the insurrection act himself and locks the country down to protect democracy. Which will of course make him look like the real fascist.\n\nThen, you’ll never have a legit election again. Elections will be like places like Turkey or Hungary, where you’ll vote, but it may not be counted. Opposition leaders will wind up in jail, charged with crimes like fraud and sexual offenses against children. The media won’t be allowed to run stories on anyone running for office who might be threatening to the leader. Same deal with ads for opposition pols.\n\nDemocracy dies a quiet death. The fuckery noted above will result in GOP control of the Senate and Congress. Which will result in major changes such as the elimination of term limits for the presidency and much, much more. Only states seceding will possibly head this off, and that will force another civil war.",
            "I think what the above person is referring to is if Trump wins he would again be commander in chief of the US military again so basically he would run the armed forces of the entire US. Thats what this post is all about. Yes currently he dont have a army but potentially he could get one and its not entirely a low or even zero percent chance of that happening.\n\nThe citizens of this country are fucking stupid, at least a massive amount of them. I cant believe im alive to see this oaf not only once get into office but maybe potentially do it again and if so it would be 10x or more worse cause last time he didnt have anyone really helping him out and no clue what hes doing but now he could have a significant group of people helping him and potentially cause a lot of damage on a greater scale than last time and not just here in the US but literally worldwide.",
            "Oh it won't be an unruly mob this time. Trump already has some of the Circuit Courts under his control, as well as the SCOTUS. In addition, he maintains huge support of the FBI, the military, all the Red State governments and police, and every Autocrat on the planet: Nobody will be stepping in to help us, let alone save us.",
            "**You clearly don't understand the  machinations in play right now**\n\nSo it's not really worth explaining it to you.",
            "So mostly either casual people or traitors. Oh, this country...",
            "What they’ll consider porn is trans people existing, gay people kissing in public, drag queens performing, teachers teaching sex education at school, etc.\n\nWe’re not talking about the actual porn industry here",
            "And then finding out it's not a personal choice, it's a collective, and people have been choosing the shit sll along",
            "Yep….. 😣",
            "😣",
            "Theories like this depend on believing that the military would support the President if he tried to suspend elections and declare himself dictator. People that believe this think the military is full of blood thirsty rednecks out to kill brown people. That is not the case. \n\nThe officer corps is all college educated professionals who for the most part are trying to do the right thing. Of course there are some idiots mixed in but the promotion protocol is intentionally designed to weed those people out and to not allow any individual officer to grow a personal following. They are transferred around a lot on purpose and if they don’t get promoted after a set time they are kicked out. Nobody can sit in the pentagon their whole career building a following or hide in Nebraska doing the same. There are no 80 year old Colonels building their own personal empires like there are in some other countries. You know, the guys you see watching the Soviet parade wearing their 93 medals that go all the way down their legs.",
            "“Trans people existing”\n\nLaughing\n\nCrying",
            "It’s actually part of the plan. He’s not gonna have competent people like Miley, he’s gonna have his lackeys as top brass, and they will enable whatever he wants to happen. Whoever doesn’t want to comply with illegal orders down the chain of command will simply be replaced with someone who does."
        ]
    },
    "Trump Just Revealed How He’ll Attack Biden at Debate—and It’s Vile": {
        "title": "Trump Just Revealed How He’ll Attack Biden at Debate—and It’s Vile",
        "score": 216,
        "url": "https://newrepublic.com/article/182993/trump-biden-debate-attack",
        "content": "",
        "num_comments": 93,
        "comments": [
            "I'm convinced that Trump will bail on the debate using some excuse that the world will find laughable but his sycophants will find totally noble and reasonable.",
            ">The argument is always that Biden’s policies are to blame for these horrors. But at the most obvious level, this is absurd, because immigrants do not commit crimes at higher rates than native-born Americans do.",
            "If he shows am glad they will cut his mic. Will be funny hearing him scream from the side via Bidens mic. Dude is gonna look shit can rat insane.",
            "He'll back out - dude doesn't have the juice to win anyway between Herman Cain award winners and Jan 6th. He doesn't have the shit.",
            "Trump is vile, completely and totally Vile.",
            "You can expect that even though we cannot hear Trump because his mic is off, Biden will be subjected to a stream of vulgar insults intended to rattle him.  \n\nYou can expect that Biden is practicing his debating skills in this environment, and Trump in his rehearsals is practicing his insult streams to see which ones cause the victim to pause, giving the impression of zoning out.",
            "If immigration is so bad, why did they vote against the best solution to date?  So Biden can’t get credit? Sounds like the orange turd has blood on his hands.  That’s what the response should be. Don’t hold back , be aggressive!",
            "Considering his many many many MANY many malfunctions when speaking solo with a teleprompter lately, I'd be absolutely shocked if he shows up. But hell he's managed to barely grit his teeth through a debate in the past by snorting just enough of something to keep his brain focused for at least part of it. It's obvious he's high as a kite when he does it but the network can't say that unfortunately. \n\n\nBut even if he shows and even if he's high enough to not babble about how hard it is to put in pants and which sharks he doesn't want to pet or whatever, Biden is going to be prepared for his basic level debate tactics. Oh no you plan to point out something bad happened during Biden's presidency? Hmm now is there anything bad that happened during convicted felon Trump's presidency? Maybe something that WAS actually a direct result of his decision that led to a million and counting unnecessary American deaths? 🤷‍♀️ If he wants to cherry pick negative consequences I'd be willing to bet Biden can play that game all night. Certainly can play it longer than whatever the felon snorted lasts.",
            "If there’s a god … that god would not waste precious oxygen on this waste of a soul.",
            "Respond that that was a horrible, but also Mr Trump you told Mr Johnson to kill a bipartisan border Bill, not once but twice, your party even said it was the best border deal yet, and you told them “ don’t give Biden a win “ that isn’t making America great that’s your selfishness making it all about you.",
            "The right wing media is in over drive. They know Trump is gonna lose and they’re panicking. The lies are getting bigger and crazier. This just seems to fit in to the narrative. Trump can’t win on policy. He has none. He can’t win on facts, because Biden’s administration is doing amazing things. \n\nOf course he’ll just scratch and yell about things that may evoke emotion. That’s all he has. Browns bad. Biden old. World war 3. So what? It’s all bullshit. It seems the number one concern amongst voters this far out is democracy. \n\nThe people are hearing all about what Trump intends to let Christian evangelicals do if they help get him elected. And they’re afraid. They want to continue America. They don’t want Project 2025, or trumps more stupid version, Agenda 47, which is probably just a lot of doodles in sharpie and names of people he doesn’t like. \n\nIf trump shows up, Biden’s gonna clean his clock. He’ll be talking about successes and policies while Trump does his amphetamine breathing and trying to talk over Biden with a dead mic. Looking forward to the right wing take on how Trump won. The trolls will be out in force the day after. They’ve already ramped up their visibility here on Reddit. Can’t imagine what Facebook and Twitter must be like.",
            "Vile is RepubliKKKlans go to!!",
            "He'll either be a no show or he'll leave before it's over.\nHe is to stupid to debate.",
            "I've already seen the line \"immigrants killing innocent women\" multiple times on FB yesterday. So we know those morons will parrot anything Don Von Shitzinpantz makes up.",
            "Trump can’t handle Joe, or the truth.",
            "Unless the GOP says they want to outlaw the Catholic Church to protect children, I don't want to hear their hyperbole about illegal immigration.",
            "Very smart to make your tactic public, \"stable genius\"",
            "I want Joe to ask him why it was so important for Trump to have his name on the Covid checks",
            "He's not gonna debate Biden.  He's too chickenshit.",
            "Biden needs to find similar deaths of young girls by migrants during Trump's term. Unfortunately it's such an ugly attack it requires a tit-for-tat response.",
            "He is also preparing the ground for a get-out clause “I look forward to seeing him at the Fake debate on Thursday.\".\n\nIf the debate is 'fake', he can ditch it. If he does not and his performance is a train wreck, we it was 'fake'...",
            "I'm guessing that Cheeto Mussolini doesn't show up",
            "Well, he did want to pass laws but Trump didn't want it to happen so.....",
            "T: Biden killed these people!\nB: Why did you have the bipartisan border law killed in the Senate?",
            "He's going to reach in his diaper and throw the contents.",
            "I can't, for the life of me, understand why the Biden campaign is not hammering Big Orange on his scuttling of Lankford's bipartisan border bill. Biden was ready to sign a bill including virtually everything the GOP wanted on the border, but Trump told his flunkies to shoot it down. If I was independent or undecided, this would send me running to vote for Joe",
            "Biden shouldn't respond to anything Trump says because as soon as he does this Trump controls the narrative. He should just speak like Trump wasn't there at all.",
            "Install a slight ramp so Biden can escape.",
            "\nG.  Z $\n\n\n\n  \nYou \nMay",
            "Waiting for the “I’m rubber you’re glue” response",
            "Hope Biden doesn't sh1t himself on stage..",
            "Trump derangement syndrome is real...",
            "The old broken pinky toe, that old chestnut.",
            "I think he’ll blame the gag order.",
            "Biden won't take a drug test, and here Dr. Ronny says Trump passed with flying colors when Dr. Ronny examined him over the phone.",
            "Old bone spurs flailing up",
            "Time to dust off the good ole bone spurs.",
            "Prob he'll say he's a better man and don't want to get into Bidens life to hurt his feelings so he'll step down from debate",
            "\"My diaper needed changing, and my little mushroom head got infected. Sorry!\"",
            "Yea the threat of being deported turns out is a pretty good deterrent.\n\nWho could have possibly imagined that.\n\nWon't stop the xenophobia though.",
            "The response to that being.  \n\n> We had a bill worked out with the most restrictive rules ever to protect our border, negotiated by Republicans and Democrats... And YOU ordered your minions in the House to kill it.  This person, whose death you say is my fault, could still be alive today if not for your interference. \n\n> There is no blood on my hands Donald, but you may want to check your own.",
            "So the plan is to say illegal immigrants killing people is bidens fault...didn't this dipshit campaign on stopping things like this by constructing some sort of structure? Maybe like a wall or something? I must not be remembering things correctly cause if that was the case and he didn't actually do anything, then one could say that illegal immigrants are his fault.",
            "And his followers will think it's \"strength\".",
            "Wish they could have statements fact checked in real time and hold politicians accountable….",
            "This one could very well be a monkey's paw situation. He might come across as actually almost sane and composed if he knows nobody can hear him except for Biden and the moderator(s). I don't know that he can restrain himself for 90 minutes, though.",
            "They won't cut his mic.",
            "Trump? Practice? Please.",
            "I'd be extremely surprised if the convicted felon is bothering to practice at all. He's a narcissist who thinks he is the best at everything, and he's deathly allergic to doing any sort of work.",
            "And why are his wives immigrants?",
            "His Trumplickers will never give Biden credit for anything; that goes against the script.",
            "His handlers dont do anything to leash him, why would they now? I think he's actually gonna be there",
            "There cannot be a god, for he would not forgive this.\n\nDespicable inhuman monster rotten twisted and deformed.\n\nSorry, you reminded me of lyrics I love.",
            "*What?* According to trumpettes, he *is* god.",
            "GOPnik trash.",
            "Leviticus, 19:33-34. The GOP loves Leviticus, except that passage.",
            "Why would he need to? trumps a rambling, shit-filled idiot with mush brain. \n\nBidens gonna destroy that putin dicksucker. \n\nI can't wait.",
            "Brilliant! Trump can’t chase him unless he has someone to hold onto!",
            "P. B %\n\nYou June",
            "Saying you don't like something he says is a syndrome?",
            "Yup. He *is* deranged. So are his minions.",
            "Russian shill confirmed. ",
            "His bone spurs are flaring up again.",
            "Find him on Twitter @ TheNotoriousMAGA",
            "Simple but effective. My first deployment to Iraq saw a bunch of the women in the unit all get pregnant in the months before we left. One woman wasn't that lucky, and three days before we left, she showed up with a medical boot on. Claimed she had kicked her doorframe in the night trying to get to the bathroom. Based on the number of broken bones in her foot, we knew she had gotten desperate enough to do it to herself.",
            "It’s everyone in the room gagging because of Trumps diaper",
            "That was Ronny Johnson",
            "He studied so hard for that test",
            "The biggest shame is we can't deport white supremacists or Nazis if they happen to be citizens. I'd support catapulting them to the middle of the Gobi or Siberia.",
            "Or it’s not “faaaaair.”",
            "Am down for a 5 hour debate were they stop and live fact check",
            "Mic's muted when the other guy is speaking is in the rules",
            "He did spend at least two hours practicing his tough guy face for his mugshot.\n\nThe thing is he won't listen to his advisors. His lawyers probably went crazy trying to advise him",
            "It’ll interrupt “executive time”",
            "Exactly. After all, he's already perfect and will have the perfect debate with wonderful answers, bigly answers and he's a perfect debater who has never lost a debate because he's just so perfect and he knows he's perfect because he said so and Putin just came up to Trump the other day, he said, \"Sir,\" - Putin calls him \"Sir\" - \"Sir, I know you will win this debate because you are the forever President and you are perfect\" and Trump said, \"You know what, you're right.\"\n\n/s",
            "He is a coward at heart so it's really going to be a war in whatever is left of his brain: fear vs narcissism. Because he knows his brain is gone. My favorite is when he glitches and then sighs like he's so tired of not finding the words 🤣 makes me happy to realize he's aware enough to know he's fading fast. \n\nThe other factor is that while he has the final say for some reason (the problem with dictators I guess is no one can say no without getting fired and blacklisted), dementia patients are extremely persuadable. All it would take is someone Wormtongue-ing it up, whispering \"hey remember how you said you were too busy to debate Biden? Should I send that press release out yet?\". Eventually he'll think it's his own idea. \n\nWhether he shows, what excuse he uses, what state he's in, it'll be a fascinating look into who is running the show over there and how far gone he really is.",
            "In a cats world , the mouse thinks the cat is god.",
            "He'll contract a serious case of lumbago",
            "Good comparison😎",
            "Never really seems to have gone away...",
            "Beat me to it.",
            "The gag odor",
            "Dr Rory Jornson!",
            "There were letters talking about a debate Lincoln had where the crowds broke for lunch and then returned to the debate. It was a literal all day affair.",
            "You mean his \"*Never Surrender*\" mugshot, the one where he surrendered to the authorities?       \nI never thought I would see a mugshot of an ex-president. I never thought I would see people who wanted to vote for a convicted felon for President.     \nWe live in some weird, fucked up times.",
            "Wait he actually practiced for that? Only to end up looking like a toddler that just took a bite out of a lemon?",
            "He was filling his diaper. It just happens to look like a Blue Steel face.",
            "Winning the election is the only way for him to stay out of prison.  With his ego he'll think he will win.  But it will go very poorly for him.",
            "Stomach ache from too many quarter pounders.",
            "Dr. \"Roids\" Johnson",
            "Maybe he'll get covid again!🤞🤞🤞"
        ]
    },
    "A GOP Lawmaker Was Arrested After Chasing a Stripper With a Gun in the Middle of the Night": {
        "title": "A GOP Lawmaker Was Arrested After Chasing a Stripper With a Gun in the Middle of the Night",
        "score": 729,
        "url": "https://slate.com/news-and-politics/2024/06/neil-friske-arrest-michigan-representative-gun-adult-dancer-stripper.html",
        "content": "",
        "num_comments": 73,
        "comments": [
            "Let's see <checks list>.....stripper...gun...arrested...\n\nWow, if we find out that this guy used stolen campaign funds to pay her for stripping, he might make it to  the top of Trump's list for VP.",
            "The real problem here is that strippers don't have enough guns.",
            "The stripper was at his house at 2:45 am, and he chased her with a gun.\n\nWhat are the odds this is not the first stripper or sex worker he has assaulted? Sex workers are targeted by serial killers and serial sexual assaulters because they know the cops don’t care about them.",
            "I believe it's called a VP audition.",
            "All good, doesn't break any of the 10 commandments.",
            "Trump: what a guy he’s got my endorsement",
            "Trumps VP. The evangelicals will love this guy.",
            "*checks notes... yep, on par with REPUBLICAN CHRISTIAN VALUES.",
            "r/upliftingnews",
            "The GOP is racing for the bottom as if the prize were something good.",
            "Remember the days where guys would resign in disgrace from this kind of thing?  Now, he was just exercising his second amendment rights and, of course, there’s a conspiracy against him.",
            "I thought this was America",
            "Ok so MAGA of the month for June is all wrapped up.",
            "This guy now has all the necessary qualifications to be the next Republican presidential nominee!",
            "Stop the presses .......trump just found his VP pick.....",
            "Guns are for emergencies. This was a breakdancing stripper emergency.",
            "What a creep.",
            "His PR team blamed the Deep State",
            "New reality show idea: Assholes on parade",
            "So basically a GOO lawmaker following his MAGA internship step by step",
            "Sometimes the strippers get out of hand and you gotta chase em down the street!",
            "“Never happened fake news” just ask Fox News or newsmax they should be straight shooters and tell you what’s what",
            "He’ll go to church, repent, be born again and move up in the GOP ranks.",
            "R/notadragqueen",
            "Wait what?!  So we can't chase strippers with a gun anymore? Thanks Obama.",
            "Congratulations, a GOP member going after women of legal age... Now just learn about consent and lose the gun... Such strides are being made",
            "Thats where alito has been! Lol",
            "I'm sorry, you'll have to be more specific.",
            "Sounds kinky.",
            "Maybe he was justified. Maybe she was a really bad stripper?…",
            "Michigan state lawmaker Neil Friske",
            "Republicans, this is what anarchy starts to looks like, the only law is their law, they are going to see serious push back",
            "When exactly is the Middle of the Night?",
            "In other words, a typical Tuesday for most GOP legislators.",
            "Oh....I thought this was an onion headline. Apparently it's real",
            "All the  highly uneducated white people think I'm a good guy. Like all the rest of the GOPs. 😂🙌",
            "The whole story:  She stole his Christian Family Values and he wanted them back.",
            "My favorite part is that his press release blamed the deep state",
            "Another Christian republican, what a fucking surprise lmao.",
            "Another GOP following God's 10 commandments",
            "You left out \"grandfather was an actual Nazi and served in the Luftwaffe and ran for office as \"a WWII veteran.\"",
            "If he used meth he’d be Hunters best friend",
            "Gold star.",
            "If you make stripping criminal, only criminals will be strippers...",
            "The only thing that can stop a bad man with a gun is a good stripper with a gun.",
            "Stripers need to have weapons in the classrooms....straped or strapless....",
            "Men don't like to be embarrassed.",
            "Plot twist - it was a transgender stripper...",
            "dont forget the ttc in the audition room",
            "The Bible doesn’t say _anything_ about guns or strippers, so it’s all ok with the Big Sky Guy. It’s not like he was hanging around with drag queens or reading books. /s",
            "Another trump favorite was arrested in Michigan and charged with internet crimes against children.  2 in 2 days.  Typical.",
            "All the best people",
            "It’s good for them, just not the rest of the country",
            "America IS a bad reality TV pilot now",
            "Whhhoooooo SUCK IT SOUTHERN STATES MICHIGAN TAKES THE W!!!!🙌🙌🙌🙌🙌🙌🙌🙌",
            "... \nI thought you were joking so I googled it.\n\nChecks out, except it was his father who served in the Luftwaffe during WWII. Not the grandfather. And said Nazi father appears to have held badly racist views consistent with being an actual Nazi, besides really running for office as a \"WWII veteran\" without disclosing what side he fought for.\n\n\nOh, and apparently \"Neil Friske\" is actually named \"Kornelius Wolfram Friske\".",
            "Is that……..is that real!?! 😳",
            "So, you're saying he has a bright future in today's GOP?",
            "And if he used coke he would be trumps and trump Jr's best friend.",
            "The point.<--------------------------------------------> you",
            "Probably.  Who cares?  Personally, I don't give a shit  what or how many  drugs Hunter Biden does because he's not an elected official.  He has zero public responsibility.   The same with Trump's idiot kids.  I don't care if Don Jr pounds a kilo of coke up his nose with a hammer.",
            "Un-concealed carry",
            "Oh for real?",
            "Those Christians values. No Dems get oral or they get Impeached, no trans oral and chase them with a gun like Jesus would have done.",
            "Well there's those annoying lines about coveting and also about adultery...",
            ">running for office as a \"WWII veteran\" without disclosing what side he fought for.\n\nI wasn't ready for how much this made me laugh!",
            "Whenever I read stuff like this it reminds me of the end of the Prince Chappelle Show skit.   \n\nCharlie Murphy:  \"Who the fuck could make up that shit?\"",
            "\"Never let the truth get in the way of a good story!\"\n\nMark Twain.",
            "No, but it would be a great plot twist...",
            "Neither of which can be proven.  He was trying to save the strippers soul and they didn’t have sex because he wouldn’t pay extra"
        ]
    },
    "Justice Samuel Alito absent from Supreme Court session for second day in a row": {
        "title": "Justice Samuel Alito absent from Supreme Court session for second day in a row",
        "score": 5367,
        "url": "https://edition.cnn.com/2024/06/21/politics/samuel-alito-not-present-supreme-court/index.html",
        "content": "",
        "num_comments": 341,
        "comments": [
            "https://www.usa.gov/register-to-vote",
            "Probably taking a free trip somewhere.",
            "Probably busy hanging flags or something.",
            "[removed]",
            "wrenched his back helping Martha Ann hoist her WWG1WGA and Confederate flags for Independence Day",
            "I hope something awful hasn’t befallen him. That’s a big, fat, hairy lie.",
            "It would be EXTREMELY FUNNY if Alito dropped dead while trying to play delay games with the immunity ruling and this ended up not having his vote counted, which could end up deciding it against Trump after all 🤣\n\nI know he's probably fine and just has the vapors from all this flag hanging or whatever treason he's busy with but I mean 🤞🤞",
            ">  Alito’s absence, for which the Supreme Court has not provided an explanation, is unusual because it’s the end of the term and the justices have issued nine opinions over the last two days.",
            "[removed]",
            "Two-day strategy session at Mar-a-Lago.",
            "He should consider making that a permanent arrangement.",
            "He's hiding because there are going to be several rulings released soon that he is going to be on the wrong side of.",
            "I heard that he's still celebrating Juneteenth.",
            "Don't get our hopes up",
            "Tending to confederate flags today?\n\nPerhaps just taking a bribe.\n\nWith a bit of luck? An undisclosed illness.",
            "In the United States, someone has a stroke every 40 seconds. Just puttin that out there.",
            "Hiding from the press...LOL",
            "Anyone check under the window?",
            "[removed]",
            "He is busy preparing the auction for the next set of SCOTUS rulings. \n\n/s",
            "You can only hope",
            "[removed]",
            "[removed]",
            "Desperately needed at Koch HQ for new marching orders",
            "He must be attending the next insurrection meetings.",
            "He’s probably hanging on Elon’s yacht or something.",
            "Perhaps he couldn't get his balls out of his wife's purse in time for court.",
            "He doesn’t need to be present to hear the issues. The heritage foundation already told him what his opinion will be.",
            "Supreme Court seat coming to Joe? 👏🥳🎉",
            "[removed]",
            "Ask his handlers, I’m sure they know where they keep their puppet",
            "Walmart would be sending out a search party, threatening to take your job away, and would be blowing up your line with guilt trips. \n\nFucking Walmart holds their staff to higher accountability than our highest court in the land. \n\nA friendly guy from the neighborhood once told me with great power comes great responsibility. The Supreme Court has great power, maybe they should learn some responsibility.",
            "He's busy taking an all expenses paid trip courtesy of some Right Wing megadonor",
            "Oh it'd be a shame if something happened to him. Lol",
            "Probably enjoying another kickback vacation with those GOP big spenders. LOL 🤣",
            "Would be a shame if he had to retire.",
            "Don’t you just love how you can disappear from your job without explanation or recourse?…/s",
            "He's probably busy sewing a white flag with yellow flames and a dismembered heart or whatever the fuck like some kind a bizarro Betsy Ross.",
            "Zoom meetings with Trump and Putin.",
            "If he did die I hope Biden appoints the most liberal RBG like person he can find (and in honor of Pride month it should be an LGBT person).",
            "Man, nobody wants to work these days. ",
            "Wrenched his neck with the twisted logic he spews?",
            "They’re trying to reverse his wife’s lobotomy. She’s married to a Supreme Court justice and she knows nothing about the first amendment. How pathetic are these people!",
            "Let’s hope it’s nothing trivial",
            "Wherever he is. He can stay there. Permanently.",
            "The crime for betraying the People's trust should be most severe, akin to treason. Not necessarily the death penalty unless their actions and rulings directly lead to the death of a citizen.",
            "[removed]",
            "It probably means he's grumpy about a decision they're making 😤",
            "Priorities. Free cruise? Free house? Getting cash bribery?",
            "Flag shopping.",
            "[removed]",
            "Was there a KKK meeting at the same time?",
            "He ded?",
            "He already knows how his wife wants him to decide, so why bother going in?",
            "A trend I can get behind.",
            "He was there. You just couldn’t see him because he was hiding behind his wife",
            "Probably on a paid vacation by some hidden billionaire 'friend'.\n\nOr maybe turning a few flags upside down for entertainment purposes only of course. There is no way you should doubt in which direction the wind blows with this guy right?",
            "He may be busy with either planning another insurrection, or advising the Trump team on their criminal defenses.",
            "he's at a MAGA rally",
            "He is busy hanging flags upside down.",
            "He's done his duty. He's off for summer vacation.",
            "Maybe he has crippling diarrhea…",
            "Well, that sucks for the comment section at Breitbart. Now there’s only one judge that will reflexively vote the way they want regardless of the law.",
            "Will Russia and North Korea just got a new partnership going. Maybe he was invited to the party.",
            "We wish him all the worst",
            "busy yachting around with his billionaire donors/owners",
            "Absent but not missed.",
            "Probably in mother russia receiving payment",
            "Even Covid has people pulling for it sometimes …..",
            "He is helping his wife with her vergogna flag.",
            "Alito's busy drinking Mojitos with the orange Cheeto and his amigos and other pedos",
            "Attending a neo-Nazi rally.",
            "damn.. i’m fired if i’m a no-show  for 1 day.",
            "Probably some commitment to his primary employer.",
            "Ironing the family flag collection....",
            "It's 'hell week' for the Grandmaster KKK initiation.",
            "Is he TRYING to get fired? Oh wait...",
            "Zoom calls with the Kremlin",
            "Paid vacation no doubt.",
            "Lock him up!\nHere’s a song to sing while we do it….\n\n\n[https://www.instagram.com/reel/C7fKVODAfOx/?igsh=MzRlODBiNWFlZA==](https://www.instagram.com/reel/C7fKVODAfOx/?igsh=MzRlODBiNWFlZA==)",
            "Klan meeting ran long, I guess.",
            "Maybe he passed quietly like Scalia, with a pillow over his head……🙄😓",
            "Locked himself in seclusion after having seen the photos of Kim and Putin in various warm, lustful embraces.",
            "His wife called, said he can’t take the heat.",
            "Take the rest of your life of Sam, and we'll find a reasonable replacement if reasonable people still exist. /s",
            "Gotta sign some closing documents for some newly acquired property near St Pete.",
            "Wouldn’t it be so awful if he was terribly ill? Like unable to return to work kind of ill? 😏",
            "🤞🤞🤞🤞🤞🤞🤞",
            "Check on Clarence Thomas’s yacht.",
            "Thomas missed a few mystery days as well. What a shame if both Alito and Thomas stepped down/died before the end of the year.",
            "What if he has been sequestered bc he's about to write the majority opinion for the Felon McFuckface immunity or the Chevron case and they don't want this dicey opinion leaked like Dobbs was 😨😨😨",
            "He is having meeting with religious fanatics, ultra rich republican donors and buddy Russians.",
            "Hopefully he stays absent.",
            "Hope whatever it is keeps him away.",
            "Dude’s flag got stuck",
            "[removed]",
            "Oh noo, I do hope noting happened to the corrupt, traitorous prick. (FULL SCARSAM INTENDED)",
            "He’s looking to find where he can buy more of those upside down flags.",
            "Dude better have a doctor’s note for return to work after an unexcused absence.",
            "I wish him a speedy recovery and resignation if he is sick.",
            "Nothing to see here. Your honor's Flags can't be put in washer dryer. One day to hand wash and another day to dry and iron. Flags don't hang themselves upside down. He is prepping.",
            "He had to step away for an abortion. ",
            "Well worst case is 🤒😷☠️ and even if that was the case there is no way Biden could get another justice appointed before election.",
            "Fly your flags at half staff",
            "So if he strokes out will Biden get to appoint a new SC Justice?",
            "I hope it's not ass cancer.",
            "Covid without a shot might not end well 🧐",
            "Attending to his flag???",
            "Probably on a gift vacation because the seat would have been empty otherwise",
            "Who’s yacht is he out on?",
            "Out fishing with Harlan Crow",
            "Sounds like a no-call no-show: automatic termination.",
            "Alito is chomping at the bit to retire -- ASAP! Thomas too. Vote! for democracy to hold these bumbling idiots accountable.",
            "He’s sucking his thumb sitting in a corner.",
            "Busy with the flag maker on a chore for his wife.",
            "Probably thinks \"Flag Day\" is a month long holiday so he is out with Clarence Thomas shopping for a new RV",
            "Wife won’t let him out of the house.",
            "Check the congressional lemon party room, while you're there don't forget to feed the Page he hasn't had a proper meal in a few days.",
            "He needs to become permanently absent along with the other fascist, fascist leaning court justices who are no longer unbiased justices, but Trump ass kissing fools.",
            "Can he stay absent until like the sun engulfs the earth",
            "Can't say what I really want too..get well soon  /s",
            "He’s picking up one last case of ration buckets from the Infowars warehouse.",
            "Let’s go for a thousand.",
            "Probably on a nice vacation",
            "Fingers fucking crossed. 🤞🤞🤞🤞",
            "Bet he still gets to cast a vote in their decisions though",
            "Good. keep going.",
            "All for optics; to appease those of us who are upset at his inability to be objective",
            "Us peasants would be fired for two day no show. ",
            "He dead yet?",
            "Oh no, I hope it's serious",
            "Martha Ann had him tied up, upside down in the basement dungeon and is awaiting her discipline for being a bad bad boy.  So I hear.",
            "Maybe he’s sick?",
            "Disgrace",
            "He didn’t get permission from his wife",
            "Not setting foot in there 'til he gets his sugar.",
            "Keep up the streak",
            "Collecting his pay?",
            "He's skipped town.",
            "Bummer, probably at the regional klan meeting.  I’m sure he’s the Grand Wizard.",
            "He is probably out with Thomas joy riding in his RV that he was bribed with.",
            "Off eating shit somewhere no doubt",
            "Now, people, you know perfectly well that Trump’s handlers will never let him anywhere near a debate stage with Biden; if necessary, they’ll tackle & sedate him like a runaway rhino 🦏",
            "Be a shame if anything happened to him!",
            "If he dies, watch the GOP block Biden from nominating someone. Trump can replace RPG in 3 days 2 seconds before an election, but democrats can’t do that shit. There are standards!!!",
            "Dock his pay and also his bribes.",
            "Oh I hope he's not dead.",
            "Don’t tease us :(",
            "Maybe he could just stay away?",
            "lets make it permanent and clarence can go too, disgrace",
            "Be real cool if he just stayed wherever the fuck he is and never came back, just sayin",
            "Probably on a yacht that was a \"gift\"",
            "I hear a Billionaire had an unused private jet seat and he just took it to a private island in the Caribbean.",
            "Picking out a  new flag for the wifey.",
            "They will definitely Weekend at Bernie’s him until after the election.",
            "Giving notice you will be absent is for the poors",
            "At a Nazi/Anarchist/Militia/Fake-Electors meeting?",
            "You never skipped a day? Were that wishes were horses but the most likely reason is a terribly just normal one.he shouldn’t get this level of press.",
            "Probably forget about reporting it.   Only 150grand vacation.",
            "He’s loading the gold bars in the Winnebago.",
            "Maybe he got an offer from John Oliver",
            "Russia?",
            "No you're thinking about corrupt Clarence Thomas.",
            "Or checking his many houses for flags his wife has put up.",
            "I read this as “he’s probably hanging something somewhere” and my laughter made my coworker jump. So, thank you for that (I dislike this particular coworker).",
            "I thought that he was better known for flanging hags?",
            "Or burning crosses",
            "Vexillogists gonna vexillogist",
            "[removed]",
            "From your lips to god’s ear",
            "At a hunting camp in terlingua?  ",
            "Out of his eyes",
            "Blood and Legos",
            "*fake shock* VERGOGNA! \n\nJ/k I hope he’s shitting blood too 🤞",
            "He found Jesus",
            "[removed]",
            "No no no, they were inverting the flag for Juneteenth.",
            "I hope he at least steps on a rake.",
            "The best I can hope for him is that he steps barefoot on a Lego in the middle of the night and then trips and hits his funny bone on an adjacent table.",
            "Fanfic: His wife is hiding his body until a Republican is in office",
            "Can we pray he turns up in a ditch somewhere?",
            "Thought that was supposed to be today. \n  \nWhy the Dems aren’t running ads 247 that says “Trump is arguing that he’s above the law and can assassinate political opponents. This is not normal. This man is the end of democracy.” … is beyond me. Anemic reasonse from the Dems over this absolute nightmare.",
            "I assume he's boycotting deliberation for some petulant reason.",
            "Weird how if i dont show up to work or provide an explanation they either call the cops or fire me.",
            "Sounds like recusal without saying recusal.",
            "[removed]",
            "Exactly this",
            "He’s probably on the shitter at Mar-a-lago casually reading top secret classified material that still wasn’t retrieved by the FBI.",
            "Several rulings that the majority of Americans will be on the wrong side of. Fixed it.",
            "There’s a flag for that… no, wrong one. ⚡️⚡️",
            "A terminal and aggressive one, at that.",
            "With any real luck the illness is past tense and him along with it.",
            "I have never prayed this hard",
            "Didn't he get bribed to show up for work, as well as receive a paycheck from the taxpayers to show up?  He doesn't work for the taxpayers, but still, the optics are pretty bad.  It's not like he is ashamed of his horrible behavior.",
            "Why would he hide from his adoring fans?",
            "Ghoul is prob under the bed",
            "[removed]",
            "And working out the kinks on his next big bribe.",
            "Im not religious but i just said a prayer",
            "🤞🤞",
            "Ill go to church Sunday if that happens. Any church idc",
            "Amen...",
            "Not while McConnell still [hangs from the ceiling ](https://flimflams.com.au/wp-content/uploads/2022/03/XH7338-300x300.jpg)in the Senate.",
            "I just want someone who is going to follow the Constitution.",
            "[removed]",
            "Probably not since mansion and sinema would hold that shit up just to be dick bags",
            "Probably, but it is usual for SCOTUS to make a statement about an absent justice.  \n\nIt is also the end of their session and they are handing down many decisions right now.",
            "For Reagan: 2 days off work without notice = FIRED for air traffic controllers. He was very proud of that and his Stans were, too.\n\nSo no, conservatives think you are less of a person and outright no longer a man if you miss 2 days. 1 day every 10 years is okay, but 2 days is unGodly.",
            "He just used the Exxon black card.   It’s technically another guys.  But his boss said it was cool for him to use anytime he wants.  Just as long as when certain court cases come up he votes along side exxon. He doesn’t have to report it because it was technically the other guy going on the corporate jet to Epstein s island.",
            "Big oil cheating out these days",
            "Into Thomas’s RV that Harlan Crow bought him.  Heading to Mexico and honestly, I wouldn’t mind that at all.",
            "Ironing his white sheet for the KKK meeting. I think Clarence already has his taken care of by his wife.",
            "Witches , you say?",
            "And working forces.",
            "[removed]",
            "[removed]",
            "*whak!* \"Hrrrggrrrr\" - Sideshow Bob",
            "I can imagine the sound and I like it",
            "I did that as a child in the dark in our back yard. It REALLY hurts. Shocked I didn’t get a concussion from it. Anyway, I hope he at least steps on a rake.",
            "I hope you get a paper cut on your tongue\nFrom a razor in a paper cup\nI hope every soda you drink already shaken up\nI hope your dreams dry like raisins in the baking sun\nI hope your titties all saggy in your early 20's\nI hope there's always snow in your driveway\nI hope you never get off Fridays\nAnd you work at Friday's that's always busy on Fridays\nI hope you win the lottery and lose your ticket\nI hope it's Ben and Socrates poop all up in your kitchen\nI hope the zipper on your jacket get stuck\nAnd your headphones short, and your charger don't work\nAnd you spill shit on your shirt",
            "On YouTube I'm seeing a lot of ads with women who have had their health threatened by Texas's abortion policies and tying those policies to Trump",
            "They are.",
            "Had a coworker not show for her shift and asked the sheriff to do a welfare check on her. House had burned down over night and she was found down on the floor dead.😵",
            "Just because they haven't announced the reason to the press doesn't mean he didn't coordinate his absence with the other justices",
            "He participated in the SC deliberations, he just wasn't there for the announcement of the decision. That's a lot different than recusal.",
            "I refuse to recuse but I will play hooky",
            "They're not hearing arguments.  These sessions normally last a few minutes.  The justices come in, they sear in any new attorneys, they announce the decisions and then they leave.  There's really nothing to recuse from.",
            "[removed]",
            "The majority of Americans have been against many of the recent controversial Supreme Court rulings. Roe V Wade, for example. The Supreme Court is not acting in the faith of the American people. The fascist movement is not the majority of Americans",
            "Ginny Thomas is under there.",
            "I'll go to the pub.",
            "Hail Satan",
            "[removed]",
            "They don’t use credit cards anymore that’s traceable. He just enters a coupon code now. His code is Uncle Tom.",
            "I'd chip in 50 bucks",
            "Wonder what type of flag the Mrs. will fly on that RV.",
            "Harlan Crowe- with a name like that, you’re basically guaranteed to be a Texan Scooby Doo villain, complete with giant hat and bolo tie.",
            "ha hope the tacos don't agree with ginny's stomach",
            "Clayton Bigsby.",
            "Let's start a rumour.",
            "whak! \"Hrrrggrrrr\", whak! \"Hrrrggrrrr\", whak! \"Hrrrggrrrr\" , whak! \"Hrrrggrrrr\" \n- Sideshow Bob",
            "You ok? You sound like you’ve had a shit day or two",
            "A salaried co-worker didn't show up for full days. Would pop in for 30 minutes and leave for a few days, then repeat. I once turned his office lights out and when he came back he said to always leave them on because the plants needed light. This absence went on for some weeks, maybe two months, when he just stopped coming in altogether. Then his manager asked me to do a welfare check because i was the closest locally. He wasn't at his apartment but i caught the neighbor and told her to tell him he needs to call his manager. Interestingly, he did NOT get fired because this was a huge corporation and the manager had not recorded the days he was gone. The employee just got probation, had to check in and out every day. While being told, the employee had the gall to ask, if he worked hard Monday thru Thursday, could he not have to come in on Friday? The manager told him that if he worked hard Monday thru Friday, he could be off Saturday and Sunday.",
            "Boss still said, “no excuses, you gotta find someone to  cover”",
            "Hey way to call it in.",
            "Even worse then, contributed an opinion without the fuerte to show up and back it up.",
            "He could do us all a favor and stay gone. Then his wife could be free to be shitty to her neighbors and hang whatever flags she wants in front of their multiple houses.",
            "[removed]",
            "My point was the majority of Americans are not in favor of these rulings but due to this conservative court will be on the wrong side of the rulings.  I believe we’re on the same side of this argument.",
            "I never said i would be sober.",
            "TST puts in the work doing good deeds fr",
            "Wouldn’t that clearly be FRAUD for all us non supreme court members?",
            "He’s borrowing Clarence’s coupon codes?",
            "I’ll do a hundred plus a hundred dollar gift card for Cracker Barrel.",
            "LOL 😂",
            "Not a rumor, a conspiracy theory.",
            "I thought you probably were, but it was a little difficult to tell over text. Never know when a sneaky bastard is trying to passively say something easily misconstrued to show support for their BS lol.\n\nIt could also be construed that you meant the majority of Americans are in favor the rulings (that are wrong). Could just be me, but I’ve always considered the “wrong side” to be the one that is ethically and morally wrong rather just the one that didn’t happen.\n\nAs always, personal biases and experience shape our interpretation of the world around us",
            "The only way to go to church, IMHO.",
            "As long as you don’t report it, it’s not illegal or unethical",
            "Clarence's code is Storefront.",
            "John Oliver...1 million a year gift, to Thomas if he'd step down.",
            "I'll throw in on this. 4 brisket sandwiches and a full tank of diesel from Bucees",
            "Hahahahahahaha",
            "Even Clayton had the ethical standards to divorce his wife when he found out.",
            "Then it's true!",
            "Did you mean *Stormfront*?",
            "tHaTs bRibErY!!",
            "It’s smart for the shows budget: Thomas would never agree to a paltry million a year and that motor coach went back to the dealer after the segment.  John Oliver was in no danger of having to shell out for either.  \n\nIf he wanted to spend some real dough and do a stunt that would get his attention, he’d offer him a chance to disappear from Ginni, like witness protection."
        ]
    },
    "Judge dismisses Nevada ‘fake electors’ case\n": {
        "title": "Judge dismisses Nevada ‘fake electors’ case\n",
        "score": 2124,
        "url": "https://thehill.com/regulation/court-battles/4733915-nevada-fake-electors-case-dismissed/",
        "content": "",
        "num_comments": 268,
        "comments": [
            "https://www.usa.gov/register-to-vote",
            "Literally got away with treason.",
            "The party of law and order my ass.\n\nMore like the party of avoiding law and order.",
            "How much do you think the odds of this happening if it was YOU?\n\nREMEMBER IN NOVEMBER.",
            "Michael McDonald, Jesse Law, Jim DeGraffenreid, Durward James Hindle III, Shawn Meehan and Eileen Rice\n\nLet those names at least go down in history as treasonous fucks that made a lame attempt at a coup.  They are unpatriotic and undeserving of being mentioned in the same breath as any of the rest of us.",
            "Jim DeGraffenreid, Durward James Hindle III, Shawn Meehan and Eileen Rice will definitely be trying again to illegally get Trump elected again. \n\nFake electors all trying to get their orange messiah  back in office",
            "All we can do is Vote Blue up and down the ballot. The courts are corrupt and must be protected from further damage.",
            "So the judge dismissed it because it should have been filed in a closer city. Can’t they just do that, then?",
            "This is most likely going to be a repeat pattern, with some judges being harsh on the fake electors while others simply let them go free. \n\nThese cultists have been working for YEARS to prepare surprise rulings and laws like we've seen recently.\n\nThis is the biggest hidden weapon of the fascists.\nBoth observable and camouflaged cultists are spread far throughout our government, at the local/state/federal levels.\n\nHow many more judges/attorneys/heads of governance do they have in their pocket that can do stuff like this?\n\nWe are at a precipice of \"how much of our leadership is going to need to be removed?\" \n\nFascism can not be tolerated.  \nTheir leaders need to be removed from office \nTheir minions need to be shown how they are outnumbered\nTheir ideology must be challenged at EVERY point with aggression (voting booths/offices/laws)\n\nIt's the only way to purge them and help our systems start to heal and improve.",
            "What fucking dimension are we living in?",
            "Looks like they delayed it long enough so that this case will never be tried.",
            "Voting harder than fuck this election is our only way out of this. It might be the last chance we have. We’ll have to do the same in 2028, 2032, etc.  The RepubliKKKan Party is dying out and will do everything they can to maintain power.",
            "unbelievable",
            "Jesus Christ, \"the wrong venue\"?\n\nOur justice system is so fucked.",
            "Corruption in real time before our very eyes",
            "All the courts are doing this one weird trick to subvert democracy. If people break the law, but you like them and they go to your country club, just you know, don't ever hear the case.",
            "This is the plan. Same thing Fed judge Aileen Cannon is doing in Florida. Delay, delay, delay...then dismiss after it's too late for prosecutors to re-file charges.",
            "add another to the list of those that need to be impeached if this country were to regain its sanity.",
            "Ah cool. The criminals won again. They found some little glitch in the law that lets them worm out of their criminal activity entirely. It's awesome how the legal system works in this country.",
            "[removed]",
            "Fucking traitors should be in prison for life",
            "The day after Inauguration Day in Jan 2021 was when the charges should have begun.Fake documents, that falsely pretended to be offical government documents? It takes a couple of years of stalling before finally beginning legal charges? What could go wrong in a election year with Trump on the ballot...",
            "Republicans probably already have their fake electors lined up in every state for 2024. They’ll try it again.",
            "Vote vote vote, don’t let these assholes poison the justice system anymore !! Don’t let them off the hook ever again. Vote them out. Your children  are watching, remember that !!",
            "Upshot, the judge dismissed the case for being in the wrong city rather than for lack of merit. Defense claimed the case should have been brought in a city closer to where the crime happened.",
            "It's called Sleeper Cells and all terror organizations have them.",
            "Republican governor",
            "Is it going to appeal? No jury attached yet",
            "This wont go the way they think it will and they will pay for it as will their families.",
            "Such total bullshit",
            "Time to throw these treasonous bums off the bench.",
            "\"Just say we won, and we'll take it from there\" signed: the orange slob.",
            "This is miscarriage of justice.",
            "Time for an uprising...vote these people out that appoint these traitors.",
            "Well shoot, looks like you can get away with anything in that district if you swear fealty to Donald Trump. It’s like a little Purge zone.",
            "Republicans are the ones stuffing ballots ffs , Blame Dems",
            "The statute of limitations is up in December, making it difficult (if not impossible) to get a new grand jury to indict in time.\n\nPeople are going to look back in history and see that people didn't move fast enough to save democracy. They just didn't act until it was too late. Wt actual f.",
            "Just because your fraud is too stupid to seem real, doesn’t change the fake that you tried. \n\nWe can’t excuse criminals just because their plan was bad.",
            "They are playing too much with the law. Setting up a terrible precedent for the future.",
            "They will appeal.  Let’s see if a higher court agrees.",
            "This activist MAGA’t judge needs to be investigated and then locked up.",
            "Remember in November might not be enough. They’re willing to do and pay and buy their way in. This does not end well.",
            "Traitors. Every single one of them should be tried for treason.",
            "These are kind of decisions are awfully suspicious.",
            "Please oh please karma, fuck these six assholes up down the line. The corrupt judge and the defense, too. SMH...",
            "Statute of limitation on fucking treason. M'kay",
            "Who maga elects\n\nVote\n\nOr Maga votes for you",
            "Fuck you Nevada",
            "“He can keep getting away with it!”",
            "More fake Christian’s for the anti-law and order party trying to obstruct justice for traitors. Not surprising when you got two clearly corrupt judges on the SCOTUS  that enable this bullshit behavior at the lower courts level…",
            "What a bunch of bullshit",
            "Hmm, seems like there was something to the hot mic moment with Roger Stone talking about judges",
            "No surprises that Nevada's falling for Trump's bribes; it's the Casino State.",
            "…and when your state is run by Republicans, they let you get away with it.",
            "Statute of limitations. Ffs. If you get away with a crime long enough it’s all cool.",
            "Honestly I often wonder what shit is going to pop off if the justice system keeps letting these cultist psychos out and about cheat hundreds of millions of people (many who own military grade weapons of death) out of their most fundamental human rights and drag civil liberties back to the 1800s. While trying to install an incompetent grifter rapist cult figure who will let theocratic fascist destroy what’s left of their country.",
            "Once again proving the greatest threats to the modern legal system are the lawyers themselves.",
            "How many times are we allowing THE SAME treasonous enemies to escape consequences?",
            "This does seem like a real fuck up by the state AG. Nevada’s capital is in Carson City near Reno, and the falsified documents were apparently signed there, so why bring charges hundreds of miles away in Las Vegas?  Most likely to get a more favorable jury in a blue area, but that kind of judge and jury shopping shouldn’t be tolerated from either side. \n\nHopefully the charges can be re-filed in Carson City, despite the statute if limitations, consider it a transfer and jot new charges.",
            "WTF",
            "Nobody is above the law but there are a lot of people beneath it.",
            "Another trump judge or no?",
            "Maybe a change of venue to Wyoming where Trump is viewed as a god???",
            "WTF ??!!",
            "Can new charges be brought again? IANAL",
            "Yet another case of party over morality and ethics.",
            "WTF?!??!!",
            "I hate this piece of shit.",
            "Why is this taking so long if the dems pulled this they would all be in jail",
            "What the fuck!?",
            "this is nothing, will be appealed and take place",
            "How many idiots are going to see this headline and say “SEE, THEY WERE RIGHT ABOUT THE ELECTION BEING STOLEN” and not understand it was dismissed for procedural reasons.",
            "Its going to be appealed.",
            "So disheartening 😞",
            "So when exactly do we take matters into our own hands?",
            "The judge needs to be arrested and charged with obstruction of justice, conspiracy, and treason. \n\n There is absolutely no valid reason for dismissal, and they waited until the statute of limitations was up to do this.",
            "[removed]",
            "They will just appeal or re~file elsewhere…",
            "Who is the judge and what do we know about them?",
            "It’s like we don’t need trails anymore, because judges like to decide things before the court room. We’re no longer worried about guilt and justice, only protocols and technicalities.",
            "What a corrupt scumbag. They should be in jail for treason. I miss the days when criminals were actually punished.",
            "This is the judge that when viral because the guy jumped her desk.  I’m rooting for that guy now.",
            "It’s time for the rest of you a to rise up. This is insanity.",
            "These judges are trying to help diaper don the dictator and need to be purged",
            "Yet another judge whose name needs to be added to a list. I really hope Biden wins and starts targeting all these corrupt judges because they either need to be removed, or subjected to such frequent, comprehensive, and invasive investigations that they decide it is in their best interest to resign.",
            "Dont worry it will be appealed",
            "This is awful",
            "And we're supposed to believe that the prosecuting attorney was unaware of this?\n\nPlease. The fix was in long ago",
            "Cheating republicans, incompetent democrats. We don’t have a chance.",
            "All of you who don’t like this are registered to vote aren’t you? You know lots of judges are elected to their positions don’t you? If we could get people out to vote and pay just a little bit of attention to who is running, we might not have a bunch of wing nuts in office and positions of power. GO VOTE!",
            "Okay, so they'll refile in a different county and have at it again.",
            "That's a pretty amazing outcome.",
            "lol",
            "As it should have.",
            "Haha",
            "Appeal will be placed. \n\nThe pro-Trump electors who were charged were Michael McDonald, Jesse Law, Jim DeGraffenreid, Durward James Hindle III, Shawn Meehan and Eileen Rice.",
            "40 years of court packing. This is why you need to keep Dems in charge of the state & federal government. \n\nTaking over the judiciary is how the Nazis rose to power.",
            "As will Trump.",
            "Not really. They're acting like Biden can't do the same. The second they come back granting presidential immunity, Biden should lock trump up and ditch any sympathizers on the Supreme Court. They should be very careful of their next decision.",
            "Actually forgery and fraud. Figures.",
            "I’d like to make America great again by going back to the times when people who tried to have an actual coup got actual failed coup punishment. Trees. Walls. Shit like that.",
            "Yup",
            "Literally didn’t, you don’t know the definition of treason…….",
            "Laws for us and orders from them",
            "Party of obstruction & lies.",
            "They’re the party of dispensing law and order, not the party of being subjected to law and order.",
            "Party of steal and lie.",
            "Remember, remember, the fifth of November",
            "Us poors would be guilty until proven innocent.",
            "Oh yeah thats gonna happen regardless. Trump will absolutely be remembered and it wont be some great leader. He's the first president to be convicted of a felony and to face all of this insurrection stuff. That doesn't just go away. He's the FIRST. There is no murky waters to that where he's confused for someone else. He will always be remembered as the first president that attempted to overthrow the government. And good riddance it will be when he croaks and dies.",
            "What about the thousands or even millions getting behind Project 2025? \n\nThe part about destroying the deep state is clearly reference to removing any type of an accountability or constitutional governance, so Trump and his disciples can rule as kings indefinitely. It would be the end of the USA as we’ve known it.",
            "Fucking around with the social contract seems like a bad idea.  American patriots tend to notice when you deprive them of their right to vote.",
            "Durward?",
            "Nope. They conveniently let the statute of limitations run out.",
            "Is this a case of a sympathetic judge or sympathetic prosecutors? Shouldn't they know better than to file  in the wrong district? This whole thing smells like a charade. Given the outcome, it might as well be.",
            "Statute of limitations ran out in December.",
            "Don’t think it works like that. Thought you could file it wherever you wanted.",
            "Whoopsie \n\nGosh darn it welp we’ll get the next one fellas",
            "Bear in mind, this is also literally what they are telling their own supporters.  “The left is fascist!  They are taking away your rights and destroying America.  We must stop at nothing to save our country!”.  It’s exhausting people keep falling for it.",
            "pretty sure it's the one from the DOOM franchise. (looks at TX in summer); yup!",
            "This truly is the darkest timeline.",
            "The one where Russian and Chinese money are having fun tearing down your democracy.",
            "Not so fast.  Appellate court may remand.  Inability to refile may play into it.  This dismissal surprises me, but I can't fault the defense.",
            "Just in time for the 2024 election!",
            "Everyone must vote *even if* the polls leading to Election Day show blue candidates leading because gop state legislatures are doing everything they can to suppress dem votes / disenfranchise dem voters. The gop knows it can’t win without cheating and are pulling out all the stops for this election.",
            "Help others vote. Help them register or either mail in their bote or give them a lift to voting venue.\n\nSomeone recommended having a themed party where you also go voting together.\n\nSpeak with Republican women, tell them about what consequences THEY and their daughters will face if Republicans get into power.",
            "Yes vote. But that's not all of the solution here. Voting won't solve the fascist cancer that has metastasized and spread through the world.The justice system in the United States is in a failed state. Not failing, not breaking, it has failed. The supreme court has denied justice for a man running to end democracy. Another judge obstructs justice in a trail where the same man likely sold classified secrets. The justice system is openly embracing treason. It is one of the most egregious deprivation of rights this Country has ever seen. It simply cannot be tolerated by the people.",
            "First time?",
            "I think you mean entirely believable. Almost expected.",
            "Especially since the crime is related to a federal election. The location isn't relevant.",
            "Well dam we will get him on something else lol",
            "That list currently consists of the Republican party writ large, except possibly Arnie\n\nAt least 2 SC justices\n\nA large number of circuit judges\n\nA significant portion of the judiciary",
            "[removed]",
            "Well go get them and lock them up big balls",
            "To be fair you can't investigate and file a case that's going to stand up to court scrutiny in a few days it takes months or years unless the crime is really simple.\n\nThe problem seems to be the case was filed in time but nothing was done until the ruling after oopsie can't refile it time passed.",
            "At least this time it's Kamala Harris that certifies the election; they can't seize power that way until there's a Republican in the WH\n\nThat doesn't mean there aren't other ways of them stealing power",
            "The statute of limitations ran out. They can’t be brought up on the same charges.",
            "It damn well better.",
            "Prosecution is appealing but if the appeal fails that’s it, the statute of limitations has already run out to file new charges in a different district.",
            "In the story, one of the lawyers indicated an appeal will be coming.",
            "And yet trump is the only person to ever bankrupt TWO casinos.",
            "Hard to tell, the judge is elected in a non-partisan election. 🤷‍♂️ And from other articles it sounds like the prosecution might have fucked up not bringing charges in the county where the defendants actually put together and mailed put their bogus materials.",
            "No, if the appeal of the judge’s ruling fails the statute of limitations has already run out to bring new charges in a different district.",
            "Our legal system and government is hopeless corrupt",
            "FYI the charges were brought 5 months ago in December. The statute of limitations is three years, I don’t think it’s the judge’s fault the statute of limitations ran out, the prosectors took too long and then apparently flubbed by not bringing charges in the county where the defendants apparently put together and mailed out their bogus materials (i.e. they apparently didn’t bring the charges where the crime actually occurred.)\n\nWho knows, maybe the appeals court will overturn the ruling and let the judge hear the case after all. But from what I read this sounds more like a prosecution mistake than a blatantly biased judge.",
            "Calm down",
            "The majority of us have voted against Trump twice...",
            "They’re appealing but they won’t be able to refile elsewhere if the appeal fails because the statute of limitations already ran out.",
            "This action kinda tells you all you need to know about them",
            "The prosecution was aware there was an issue with the venue, per other articles the judge specifically asked them for what specific events were alleged to have occurred in her district because the charges are supposed to be filed in the district where the crime actually took place. They gave the judge a list of reasons but the judge apparently didn’t buy it since most of the actual action occurred elsewhere.",
            "They can't, the SOL has run. They have to get the decision flipped on appeal to move forward.",
            "Amazing in a “Coool, we get to slowly watch our democracy crumble…” way, right?",
            "For traitors.",
            "Attempting to overthrow the government is a crime. They all belong in prison for the rest of their lives.",
            "Deplorable",
            "The prosecutor can appeal this? Why did the judge dismiss? I couldn't get the article to open....",
            ">Michael McDonald\n\nWhat a fool believes",
            "Rich people don't face consequences",
            "There won't be a decision until after the election. If Chump wins, yes immunity. If Biden wins, no immunity.",
            "That would open a door we could never close again. I really hope that doesnt happen.",
            "🙏🙏🙏🙏🙏🙏🙏🙏he will",
            "I'm so tired of reading this childish and shortsighted take.  it's not a gotcha at all.   ",
            "The gunpowder treason and plot",
            "Roevember",
            "I hate it, because it’s my birthday and I have to think about this election bullshit and stress about it every time!",
            "That’s exactly what pisses me off the most about these right wing assbags. The one true power we have as citizens and they want to throw it out the window and turn elections over to legislators because they lost an election with absolutely no proof of any wrongdoing by the winning party.",
            "The checks their mouths are writing.  This is the F\\*ck around part.  Can't wait until the Find Out part hits em.",
            "A bunch of them have decided that as long as you let them keep their guns, you can get rid of all the other freedoms",
            "Not the cultists. They think they’re patriots and don’t understand that the Big Steal was their Orange Elderly Felon.",
            "No they don't, they actively try and remove other's right to vote. ",
            "They’re appealing immediately. They’ll still be charged.",
            "Judge all the way down. Crimes are supposed to be tried where the crime occurred, not where the defendants live. \n\n There isn't any legitimate reason it needed to be tried closer to the districts they represented when they committed the crime in that county",
            "I'm going with \"both\"",
            "Did the file after dec?",
            "I guess it’s supposed to be done in or near where it happened. Same reason Frump’s trial was in NYC, instead of some hole in the ground short on IQ points but high on MAGAts.",
            "Wait, movie or game?",
            "Hell yeah even raise the dead from the grave to vote as well",
            "Yes actually. In NV.",
            "It’s a federal election but this specific case was a Nevada criminal charge over events that occurred in the state. And with state charges the venue is supposed to be where the crime took place, but the judge ruled the actual criminal events occurred in other districts.",
            "Help others. Speak with the ones not voting. Help them register and vote. Speak with Republican women, maybe especially young women about the consequences.\n\nAs someone said: \"a rapist will be able to choose the mother of their child\".",
            "[removed]",
            "No, it really doesn’t in this case. Reading articles on the ruling it sounds like this is maybe more of a prosecution flub than a biased judge. The judge said the case needed to be brought in a district where the actual criminal events occurred (e.g. putting together the bogus materials and sending them out). That happened in other counties though, hence the dismissal.\n\nAnd I’m saying that as someone who would love to not see these people get off on technicalities like this. Who knows, maybe the appeals court will reverse the judge and let them hear the case after all, but it’s not a slam dunk.",
            "I can see that most of the action took place over multiple counties so does that mean you face the same answer no matter where you file.\n\nI can just see multiple judges claiming nah not in my county but instead that one over there and that county ruling the same.",
            "Well, shit..",
            "not that slow actually...",
            "Dismissed the charges because they claimed they should've been brought in the county where the defendants lived and not where the crime occurred\n\n Unfortunately, the statute of limitations is appeal. Honestly, charges need to be brought against the judge because this is clear-cut judicial abuse of discretion and conspiracy",
            "A Nevada judge dismissed a case Friday against six so-called fake electors who falsely claimed former President Trump won the state in the 2020 presidential election.\n\nClark County District Judge Mary Kay Holthus ruled that prosecutors with the Nevada attorney general’s office chose the wrong venue in which to file the case, calling off a trial scheduled for January.\n\nNevada Attorney General Aaron Ford (D) brought the case in Clark County, home to Las Vegas, but defense attorneys contended that it should have been filed in a northern Nevada city closer to where the alleged crime occurred.\n\n“We disagree with the judge’s decision and will be appealing immediately,” said John Sadler, a spokesperson for the Nevada attorney general’s office.\n\nFollowing the judge’s decision, defense attorneys told reporters the case is “done” since a three-year statute of limitations on filing charges expired in December, meaning that the state likely could not bring the case to a grand jury in a different venue. \n\nThe pro-Trump electors who were charged were Michael McDonald, Jesse Law, Jim DeGraffenreid, Durward James Hindle III, Shawn Meehan and Eileen Rice. They each faced felony charges of offering a false instrument for filing and uttering a forged document, which carry penalties up to four or five years in prison.\n\nWhen announcing their indictments, the state attorney general’s office said in a statement they posed as “duly qualified” electors to “disrupt the results of a free and fair presidential election.”\n\nThe alternate electors scheme relied on former Vice President Mike Pence to certify slates of Trump-supporting electors in battleground states instead of the true Electoral College votes cast for now-President Biden. Pence declined to do so on Jan. 6, 2021, the day of the election certification, after which a mob of Trump’s supporters stormed the Capitol.\n\nIn addition to Nevada, slates of pro-Trump electors have faced criminal charges in three of those states — Michigan, Georgia and Arizona.\n\nTrump’s lawyers spearheaded the plan, and several face charges in other states in connection with it. Trump himself also faces federal charges and charges in Georgia in connection with efforts to overturn the 2020 presidential election in his favor. He has pleaded not guilty in both cases. \n\nBiden won Nevada by more than 33,000 votes in 2020.\n\nThe Associated Press contributed.",
            "I keep forgetting, they don't love America anymore...\nI keep forgetting (after Jan. 6th), things will never be the same again...\n\nI keep forgetting how they made that so clear...",
            "Hopefully after appeal he will be prison-bound, where he will get Pegged.",
            "Well for now. Eventually, we will want more than cake..",
            "Corrupt Republicans don’t face consequences.",
            "They have no doors",
            "If they grant immunity that door is open whether you choose to acknowledge it or not.",
            "Yes, and it seems extra weird that they called the British election for July 4 and ours is November 5",
            "I can think of no reason,\nThe Gunpowder Treason,\nShould *ever* be forgot!",
            "I know of no reason",
            "But election day isn't always November 5th....\n\n\nIt's the Tuesday following the first Monday of the month.",
            "Well, happy birthday in advance! Maybe volunteer to help get the vote out. A perfect birthday present for you and your country!!",
            "The party working overtime to make sure we’re all armed to the tits is also taking away our votes?  It’s not republicans, it’s Russian stooges.  This shit is intended to create destabilizing violence.  It’s the only way it makes a lick of sense.",
            "Ironic.",
            "These fuckers literally perpetrated it.  They forged election results.  They knew what they were doing, and it’s a testament to our judicial humanity that they weren’t immediately hanged for it.",
            "FYI The judge literally dismissed the case because they said the crime occurred elsewhere. \n\n>”“You have literally, in my opinion, a crime that has occurred in another jurisdiction,” Holthus said. “It’s so appropriately up north and so appropriately not here.”\n\n[The Nevada Independent](https://thenevadaindependent.com/article/judge-dismisses-nevada-fake-electors-case-over-lack-of-jurisdiction)",
            "They filed in time but the judge dismissed it saying that it was filed in the wrong district. Now it’s too late to file elsewhere because the statute of limitations ran out.",
            "I think evil people have gotten away with crimes before on a technicality in Nevada",
            "Trump has never won the popular vote...  lol",
            "By definition more people have voted for Trumps opponents. It's called the popular vote. Trump doesn't win that, like the rest of the Republican president's going back to Reagan.",
            "No, since the level and type of activity in the potentially involved counties aren’t equal there are definitely ones where the judge wouldn’t dismiss based on venue.",
            "“Oh so that murder you committed in New York ? Well we’re actually gonna try you where you live in Texas. “",
            "FYI You got that reversed, the judge dismissed because she said the crimes occurred elsewhere.\n\n>”You have literally, in my opinion, a crime that has occurred in another jurisdiction,” Holthus said. “It’s so appropriately up north and so appropriately not here.”\n\n[Judge dismisses Nevada fake electors case (The Nevada Independentj](https://thenevadaindependent.com/article/judge-dismisses-nevada-fake-electors-case-over-lack-of-jurisdiction)",
            "Judge likes a clean yard",
            "Spoiler, it won’t",
            "That's not how it reads in the article posted. > Clark County District Judge Mary Kay Holthus ruled that prosecutors with the Nevada attorney general’s office chose the wrong venue in which to file the case, calling off a trial scheduled for January. > Nevada Attorney General Aaron Ford (D) brought the case in Clark County, home to Las Vegas, but defense attorneys contended that it should have been filed in a northern Nevada city closer to where the alleged crime occurred. This says the crime occurred elsewhere but the AG chose Vegas for whatever reason, possibly to tip the cards more in their favor with a more liberal county than the one the crime occurred.  \n\n\n That's after this came down the last minute due to the 3 year statute of limitations. How does it come this close for a deadline you are aware of as an AG? It sounds like Ford screwed this case up royally, and I would question their competence as an AG to let thie case fall through ",
            "Prison rape isn't funny, even your terrible pun",
            "No floors either..",
            "I know. I hope they dont.",
            "Yeah we’re kicking our criminal government to the curb on July 4th, polls are placing the Conservatives to get wiped out almost completely. Least you can do is make sure you guys do the same!",
            "It's almost poetic in its irony.",
            "Why the Gunpowder Treason",
            "I know, but it’s around that date.",
            "Someone needs to watch “V for Vendetta”",
            "Thanks! Doing what I can to inform people.",
            "Well yeah those guys too. I was meaning more in the sense that the republican voters, rather than the politicians, seem to be cheering it on while it’s happening. They’re willing to let state legislators decide who wins elections because they think those people will always do what they want, even though history has proven otherwise",
            "Nope. \n\n The crime was falsifying the ballots, not mailing them. Where they were mailed from shouldn't impact the jurisdiction. This was planned beforehand to get them off and guarantee the judge was in on this. \n\n This is like falsifying your taxes going one county over, mailing them, and claiming the crime was when you mailed them.",
            "Not sure that would hold up. The law allows for mistakes as long as a good faith effort has been made. \n\nOf course that will come down to another judge",
            "Because the judge took to long to rule, ergo; the time limit should be extended.",
            "Fraudulent electors ? Must’ve missed that.",
            "That's actually how it works in Germany, up to a certain degree and depending on the case. In cases of criminal prosecution it's most of the time either the court where the crime happened, where the suspect lives or simply which court can deal with the extend and gravity of the case.",
            "I think the bigger issue here is elections are not managed under a federal body. It would stop so much bullshit in your country if it was.\n\nZoning, voting, counting etc. managed by one federal department under a single rule and impartial to any political will.",
            "They signed the false ballots in that jurisdiction and mailed them in from another. \n\n The crime was falsifying election ballots, and the crime occurred when they falsified them, not when they mailed them and the judge is fully aware of this and is only saying this to cover their tracks. I bet somewhere down the line this was done, so when they found the right judge, they could use this cover story.",
            "They broke through the windows...",
            "From what I’ve been hearing the lib dems might end up with more seats than the tories (I’m in the US but follow UK politics because I used to work over there)",
            "It kinda makes me feel like someone is fucking with us. I’m not a conspiracy guy (although I do love to listen and not believe a good conspiracy) but I feel somewhat like I’m in a game",
            "Great! Yeah, make sure friends and family get out and vote!",
            "I replied to this already in a separate comment, but no, most of what happened apparently occurred in other counties. Some of the documents apparently passed through Clark County where the charges were filed, most of the other events occurred elsewhere. So you’ve got the events a bit flipped I think.",
            "So they get a do over ? Should everyone else get the same do over as well ?",
            "But always in germany and when the cases is in the hand of a judge he or she would transfer it immediately or take it on. \n\nThis is just a case of pushing it beyond the election because of the judge’s political beliefs. \n\nThat’s why the election of Judges and prosecutors isn’t the way to get a just system.",
            "Seems Feseral since the U. S. mail was used.",
            "Not according to what I read. Some of the documents apparently passed through Clark County and some of the defendants live there, but most of the other events occurred elsewhere.\n\n> Prosecutors listed 14 reasons why Clark County was the appropriate jurisdiction, including that two of the defendants — Law and McDonald — live in Clark County and that certain mail related to the fake elector scheme passed through the county. Most notably, fraudulent electoral documents were mailed to a federal judge in Las Vegas.",
            "Yep! It will be hilarious to see the Tories turn around and start backing Proportional Representation.",
            "The court filing happened in a reasonable time frame \n\nThe judge sat on the case until the statute of limitations expired then made the ruling that the case lacks standing",
            "It's not a do over. The judge, if I am understanding this correctly, says you have to file somewhere else. \n\nThats not a check mate you took too long. The likely would pass the burden of proof that they did in fact file in time. \n\nAgain the law allows for things like this. Even mistakes, if they are done in good faith, are generally allowed. \n\nThe trick for the defense would be to prove that it was somehow done in bad faith, which I can't honestly see but I guess anything's possible. \n\nSo they will likely refile or appeal.\nThe defense will claim that they have passed the amount of time they had to file. \nThe court will then ask when they files. \nTo which the answer will be for the first filing. \n\nGenerally the legal system doesn't work on \"gotcha\" nonsense that the general public seems to think it should.",
            "This is why the us is not viewed as a full democracy. Theres too many overlaps between the legislative and the judicial.",
            "Maybe, but no one has been able to answer the question ‘why has it taken so long to bring charges?’.  I have yet to hear a reason why charges weren’t brought within 12 months of the alleged crimes.  Even if they took an additional year, the case wouldn’t be in the position it’s in today.  \n\nFor the avoidance of doubt, I 100% agree that this is a politically motivated decision, but all of that should have been anticipated (because that’s the world we now live in) when considering indictments.  This is as much on the DA’s office as is it is on the judge.  The outcome may have been the same, but we’ll never know, will we?",
            "Hmm so what proof do you or anyone have that the judge did it for that reason exactly",
            "Yet how many chances do they get going different places to file a case past its statue of limitations",
            "Yeah don’t tell that to my former countryman. They believe they’re THE democracy",
            "The reasoning is immaterial here\n\nThe facts of the matter are not for debate",
            "Really who decides that oh great one"
        ]
    }
}