{
    "Invincible [Episode Discussions Hub]": {
        "title": "Invincible [Episode Discussions Hub]",
        "score": 58,
        "url": "https://www.reddit.com/r/Invincible/comments/1c461m4/invincible_episode_discussions_hub/",
        "content": "**Season 1 Episode Discussions**\n\n* [Episode 1 - It's About Time](https://www.reddit.com/r/Invincible/comments/mdc1jd/invincible_episode_discussion_s01e0103_its_about/) / [Comic spoilers discussion](https://www.reddit.com/r/Invincible/comments/mdc28y/invincible_comic_spoilers_discussion_s01e0103_its/)\n* [Episode 2 - Here Goes Nothing](https://www.reddit.com/r/Invincible/comments/mdc1jd/invincible_episode_discussion_s01e0103_its_about/) / [Comic spoilers discussion](https://www.reddit.com/r/Invincible/comments/mdc28y/invincible_comic_spoilers_discussion_s01e0103_its/)\n* [Episode 3 - Who You Calling Ugly?](https://www.reddit.com/r/Invincible/comments/mdc1jd/invincible_episode_discussion_s01e0103_its_about/) / [Comic spoilers discussion](https://www.reddit.com/r/Invincible/comments/mdc28y/invincible_comic_spoilers_discussion_s01e0103_its/)\n* [Episode 4 - Neil Armstrong, Eat Your Heart Out](https://www.reddit.com/r/Invincible/comments/mia795/invincible_episode_discussion_s01e04_neil/) / [Comic spoilers discussion](https://www.reddit.com/r/Invincible/comments/mia73o/invincible_comic_spoiler_discussion_s01e04_neil/)\n* [Episode 5 - That Actually Hurt](https://www.reddit.com/r/Invincible/comments/mn50rl/invincible_episode_discussion_s01e05_that/) / [Comic spoilers discussion](https://www.reddit.com/r/Invincible/comments/mn50uv/invincible_comic_spoiler_discussion_s01e05_that/)\n* [Episode 6 - You Look Kinda Dead](https://www.reddit.com/r/Invincible/comments/mrrd1p/invincible_episode_discussion_s01e06_you_look/) / [Comic spoilers discussion](https://www.reddit.com/r/Invincible/comments/mrrd5b/invincible_comic_spoiler_discussion_s01e06_you/)\n* [Episode 7 - We Need to Talk](https://www.reddit.com/r/Invincible/comments/mwidxj/invincible_episode_discussion_s01e07_we_need_to/) / [Comic spoilers discussion](https://www.reddit.com/r/Invincible/comments/mwie0n/invincible_comic_spoiler_discussion_s01e07_we/)\n* [Episode 8 - Where I Really Come From](https://www.reddit.com/r/Invincible/comments/n1htht/invincible_episode_discussion_s01e08_where_i/) / [Comic spoilers discussion](https://www.reddit.com/r/Invincible/comments/n1htk9/invincible_comic_spoiler_discussion_s01e08_where/)\n\n---\n\n**Atom Eve Special Discussion**\n\n* [Invincible: Atom Eve](https://www.reddit.com/r/Invincible/comments/15676ck/invincible_episode_discussion_atom_eve_special/) / [Comic spoilers discussion](https://www.reddit.com/r/Invincible/comments/1567674/invincible_comic_spoiler_discussion_atom_eve/)\n\n---\n**Season 2 Episode Discussions**\n\n* [Episode 1 - A Lesson For Your Next Life](https://www.reddit.com/r/Invincible/comments/17mhqsu/invincible_episode_discussion_s02e01_a_lesson_for/) / [Comic spoilers discussion](https://www.reddit.com/r/Invincible/comments/17mhr56/invincible_comic_spoiler_discussion_s02e01_a/)\n* [Episode 2 - In About Six Hours I Lose My Virginity To A Fish](https://www.reddit.com/r/Invincible/comments/17rr3jk/invincible_episode_discussion_s02e02_in_about_six/) / [Comic spoilers discussion](https://www.reddit.com/r/Invincible/comments/17rr3pa/invincible_comic_spoiler_discussion_s02e02_in/)\n* [Episode 3 - This Missive, This Machination!](https://www.reddit.com/r/Invincible/comments/17x1k3k/invincible_episode_discussion_s02e03_this_missive/) / [Comic spoilers discussion](https://www.reddit.com/r/Invincible/comments/17x1kj2/invincible_comic_spoiler_discussion_s02e03_this/)\n* [Episode 4 - It's Been a While](https://www.reddit.com/r/Invincible/comments/182elxd/invincible_episode_discussion_s02e04_its_been_a/) / [Comic spoilers discussion](https://www.reddit.com/r/Invincible/comments/182elxp/invincible_comic_spoiler_discussion_s02e04_its/)\n* [Episode 5 - This Must Come As A Shock](https://www.reddit.com/r/Invincible/comments/1bef6kq/invincible_episode_discussion_s02e05_this_must/) / [Comic spoilers discussion](https://www.reddit.com/r/Invincible/comments/1bef6l2/invincible_comic_spoiler_discussion_s02e05_this/)\n* [Episode 6 - It's Not That Simple](https://www.reddit.com/r/Invincible/comments/1bk0ii7/invincible_episode_discussion_s02e06_this_must/) / [Comic spoilers discussion](https://www.reddit.com/r/Invincible/comments/1bk0iig/invincible_comic_spoiler_discussion_s02e06_its/)\n* [Episode 7 - I’m Not Going Anywhere](https://www.reddit.com/r/Invincible/comments/1bpp8wa/invincible_episode_discussion_s02e07_im_not_going/) / [Comic spoilers discussion](https://www.reddit.com/r/Invincible/comments/1bpp8wg/invincible_comic_spoiler_discussion_s02e07_im_not/)\n* [Episode 8 - I Thought You Were Stronger](https://www.reddit.com/r/Invincible/comments/1bvgri8/invincible_episode_discussion_s02e08_i_thought/) / [Comic spoilers discussion](https://www.reddit.com/r/Invincible/comments/1bvgxbr/invincible_comic_spoiler_discussion_s02e08_i/)\n\n---\n**User Flair**\n\n* [New User Flair Request](https://www.reddit.com/r/Invincible/comments/1c43v2u/new_user_flairs_have_been_added_user_flair/kzl3tm1/)",
        "num_comments": 0,
        "comments": []
    },
    "[COMIC SPOILERS] Hey! Ryan Ottley here, artist and contributing creator of the Invincible series! AMA!": {
        "title": "[COMIC SPOILERS] Hey! Ryan Ottley here, artist and contributing creator of the Invincible series! AMA!",
        "score": 828,
        "url": "https://www.reddit.com/r/Invincible/comments/1d4a5ed/comic_spoilers_hey_ryan_ottley_here_artist_and/",
        "content": "**THIS POST WILL CONTAIN SPOILERS FOR THE ENTIRE INVINCIBLE COMIC RUN! YOU'VE BEEN WARNED!**\n\n---\n\n**EDIT:** That's it for today, thanks so much for the great questions, everyone! - 💙 the Skybound team\n\n---\n\nHey! Ryan Ottley here, artist and contributing creator of the Invincible series! I became the series' primary artist in the same year that Invincible started back in 2003, and stayed until we concluded the book in 2018 with issue 144. I am an owner and creator of the world of Invincible, co-creating many characters and locations and enjoyed the day to day grind of a monthly series, from my 20’s to my 40’s, Invincible was and is still a huge part of my life. \n\nNow I’m a creative consultant on the Amazon prime show and still love the property more than ever. It will always be my main defining project, the one most important to me. \n\nAfter Invincible I moved on to Marvel and did a run on Amazing Spider-man, and then a run on Hulk. Now I’m back at image comics doing what I love most, creator owned comics!\n\nI’m here to answer your questions, ask away! I’ll do my best! Proof: [https://i.imgur.com/qmugjBE.jpeg](https://i.imgur.com/qmugjBE.jpeg)\n\nR.Ottley\n\n---\n\n**From the Skybound team:** Ryan will begin responding to questions when this post is 1 hour old, at 12PM Pacific! With our limited time today, we'll be focusing on questions related to the comics.\n\nWe also have a handful questions submitted and answered early from our Skybound Insiders members! **New Insiders that sign up before the end of May (so like, tomorrow) are automatically entered to win a pair of Invincible Funko Pop! figures, featuring hand-drawn box art and signatures from Ryan!**\n\n**Full giveaway details:** [https://skybnd.info/4bKvR0w](https://skybnd.info/4bKvR0w)\n\n**Sign up for Insiders:** [https://skybnd.info/3yOgkhg](https://skybnd.info/3yOgkhg)",
        "num_comments": 366,
        "comments": [
            "#This AMA will be HEAVILY focused on the Invincible comics, and the AMA thread **WILL CONTAIN SPOILERS FOR THE ENTIRE INVINCIBLE COMIC RUN.** Consider yourself warned!\n\n---\n\nRyan will begin answering questions at roughly 3PM EST.\n\nSilver+ Insiders and new signups are automatically entered to win this month's Insiders giveaway, **two signed Invincible Funko Pop! figures, seen in the photo above!**\n\n---\n\n**JUST FOR OUR COMMUNITY** you can **score an extra 1K Insiders points** by heading to https://insiders.skybound.com/activities, hitting the \"Secret Codes\" button in the upper right, and entering code `OTTLEYAMA`\n## Sign up for Insiders --> <https://skybnd.info/4bSqzj7>",
            "hi ryan! love your work! any tips for aspiring comic artists regarding composition and communication of what the writer wants for a scene?",
            "Which Character death in Invincible were you most sad/reluctant to draw?",
            "What are some of your favorite current and all-time favorite comic book series?",
            "From Skybound Insiders user kaeman22:\n\n>Huge fan of your artwork! I’m curious, what’s your favorite piece you’ve ever drawn, whether it be related to Image, Marvel, at a con or even a personal piece!",
            "Hi Ryan! What was the most technically difficult panel you created for the comic?",
            "You've mentioned Tech Jacket was your main drive to work with Kirkman, so besides him, who's been the secondary character you've enjoyed drawing the most in Invincible ? Be it Brit, Capes Inc , Wolf-Man or the second roster of the Guardians of the Globe(Best Tiger, Shapesmith, Yeti, etc.)\n\nhttps://preview.redd.it/2lvlwcvpwl3d1.png?width=1600&format=png&auto=webp&s=38b7cb0a5aaf1815e808025169d7769f40aa90bd",
            "Thanks for coming here to answer questions Ryan, and thanks for being part of our favorite comic book series! \n\nWhen taking over art for a comic book that is still new, but has already established a look and feel, how do you tread your own path forward while respecting what came before? Is there anything you would have done differently in the transition to your issues from Cory's with the hindsight and skill you have now?",
            "From Skybound Insiders user Cth42:\n\n>If you were given carte blanche, what crossover/team-up would you like to see happen with INVINCIBLE? Bonus points for any details!",
            "From Skybound Insiders user CamyFumi:\n\n>Hi Ryan, I was wondering how you get yourself into your own zone/mindset for drawing. A specific routine, music, maybe even food? I'd love to know!",
            "What was your favorite battle in the series?",
            "Hi Ryan, huge fan and absolutely adore the series. When you first started working on the series in the early/mid 2000's, did you ever in your wildest dreams see the series becoming such a hit, and when was that moment? How does it feel to see Invincible break into the mainstream and become a huge part of pop culture?",
            "Hi again Ottley! I had a wonderful time meeting you back at FANEXPO, it was amazing getting to talk to you.\n\nI (and I’m sure many others), admire your appreciation for the cosplayers in the fandom. Hours can go behind creating these costumes as well as the amount of love that goes into them.\n\nMy question is, what was it like to see Invincible cosplays break out onto the scene, and the increase of them after the show? I can imagine it can be pretty surreal seeing characters you’ve drawn for over a decade walking around convention halls. What are some of your favorite experiences?\n\nhttps://preview.redd.it/bgc9yuf87m3d1.jpeg?width=1170&format=pjpg&auto=webp&s=a6157a7653c7500c69bd26b54733aa29eb0711bb\n\nThanks again!",
            "which arc are you proudest of art-wise? low hanging fruit but the shot of mark breaking conquest's gauntlet in #64 has to be my favorite panel in the series",
            "Howdy Ryan! Huge fan of your work on Amazing Spider-Man! What was going through your head when Marvel first asked you to work on such an iconic character?",
            "Any word on whether or not Tech Jacket will appear in the show?",
            "https://preview.redd.it/37435v183m3d1.jpeg?width=640&format=pjpg&auto=webp&s=23555f7f50efb0a6dd342181261a60139d5acee0\n\nI know that you like putting little easter eggs and characters from different series in the panels. For example in issue 58 you had a panel with Brock Sampson and Dr. Venture from The Venture Bros.\n\nWere you just able to do whatever for the background characters? Who’s your favorite(s) that you were able to put in?",
            "What would you consider to be your work that you’re most proud of? A lot of people would assume Invincible due to its success but I’m curious if there’s anything you’ve worked on that holds a special place in your heart.",
            "As an aspiring illustrstor, what are some ways you overcome artblocks? It’s been quite difficult coming up with ideas in my head.",
            "From Skybound Insiders user They Live:\n\n>Hi Ryan I got to meet you at LA Comic Con and just wanted to say it was really nice talking to you! How do you feel about seeing the art you drew years ago becoming memes now? Was it a surreal experience? Did you ever think this would happen?",
            "Ryan, I have to ask you the hard question. When you got the script for issue 110 what was your reaction? You already know the moment  I’m talking about. Were you just as shocked as we all were? Did Kirkman talk to you about this beforehand?",
            "Hi Ryan! Thanks so much for your contributions to the greatest comic book ever, a few questions for you:\n\nWith the renewed interest in invincible, do you see any possibilities of exploring more parts of the universe, maybe new ones? I always thought that mini series or small one shots of adventures involving anyone during some of the unseen off panel moments in invincible would be fun to explore, especially since it can be done without ruining that beautiful ending.\n\nAnd for the artist in me what are your secrets! Best tips for practice and learning how to draw like you (not that I’d copy your style but I certainly would love to draw inspiration from it)",
            "1. What do you draw just for fun?\n2. What would be your dream team of collaborators to work with that you haven't worked with already (writer, colorist, letterer)?\n3. Which Invincible character would you have given a different ending? >! I personally adored Shapesmith despite his flaws and it was heartbreaking to see him go. I know his ending helped tell the story but it still hurt. !<\n\nAlso, this Reanimen commission you did is still my favorite comic possession. I loved the D.A. Sinclair and Reanimen subplot!\n\nhttps://preview.redd.it/40ec2m0enm3d1.jpeg?width=2698&format=pjpg&auto=webp&s=4c83ef43df979f0943c25969e4fbef2a9f612584",
            "Favourite comission you've done ? (This is mine)\n\nhttps://preview.redd.it/opfzw7h2yl3d1.png?width=1030&format=png&auto=webp&s=cd3fdef203ae05c0dfe5971bd33dcd088a53a1f3",
            "Hey Ryan, still a huge Allen fan here. How did you go about designing Allen’s progression as he aged/evolved? I believe he’s the only Unopan we ever see in old age.",
            "Hey Ryan! Do you prefer the yellow suit or the blue suit for Mark? Or maybe some of the other alternative versions of his suit? \n\nBtw live your work on the comic, the art is so good!",
            "Throughout the entire run, which character would you say was the most fun for you to design?",
            "What is your favourite music artist/band?",
            "Thanks for doing this AMA, like really.\n\nNow, my question is, out of all the characters you drew for invincible who would you consider the coolest/the one you liked to draw the most?",
            "Thank you for taking the time to do this!\n\nHow did it feel to draw the last issue that you were drawing for Invincible?",
            "Why do some Viltrumites have different uniforms? I realise some don’t have the Viltrumite logo for example Kregg. But Conquest and Anissa do have the logo. Why is this? Personal preference? Or do they indicate rank somehow",
            "Why did you guys not give Best Tiger more time in the main comic? He's so cool, definitely my favorite comic book character, but I was sad to see him so little 🥲",
            "What is your favorite issue of all time and why?",
            "What do you think of Hellboy or the Mignolaverse in general?",
            "Whats Marks and eves favorite fruit",
            "Hey Ryan, thanks for providing this AMA.\n\nMy question is what was your favourite gory moment to illustrate?",
            "Hey Ryan! Super happy you're doing this!\n\nI just wanna take a moment to thank you for all the art you've made for the Invincible comic book.\n\nAfter watching season 1, deciding to read the source material (the comics) and reading all 144 issues... i've became a huge fan of your art! It resonates me on another level, much more than the trendy Anime art style. Which inspired me to be an artist \\[and inspired to draw violence and gore 😬\\]\n\nHere's a recent artwork of mine inspired by your pov stuff:\n\nhttps://preview.redd.it/cizvzgra0m3d1.png?width=3210&format=pjpg&auto=webp&s=89fea548d73af304e6a2d7bc48b3612d6ae00e55\n\nAnyways enough flattery, may i ask, where do you get inspiration for making violence/gore when making Invincible? Is it some Intuitive?\n\nIf its from reference, do you look at real life references, or do you refer to certain media or things for inspiration?",
            "Simple question: which comic issue of Invincible was your favorite to draw and why?",
            "Any future plans for collabs with Erik Larsen? Some of my favorite pieces you’ve done have been The Walking Dead #50 superhero variant cover and the Invincible Returns #1 variant cover, where you worked from Erik’s layouts. \n\nI’d love to see some sequential pages where you work with Erik similarly to how you worked with Greg Capullo on Haunt.\n\nWho are some other artists that you’d like to collaborate with in this way? I love seeing the mash-up of styles!",
            "Thank you for the AMA! If in a alternate universe Invincible was created in a different decade (same characters, stories), who would you have liked to see as the artists? 70s Invincible? 90s Invincible?\n\nAlso, if the Invincible Extended Comic Universe continued, what artists do you think would be cool to add to the stable?",
            "What’s your favorite Invincible moment?",
            "Were there any surprisingly challenging scenes or moments to plan out and illustrate?",
            "Hey Ryan, ever since I was a little kid I have loved creating stories. As I have gotten older it has been my dream to be a comic book writer/creator. I am currently in Highschool and I want to know the best thing I can do to enter the comic book industry after Highschool? What is the best thing I can do to achieve my dream and become a comic book writer who can one day have my favorite story published at Image.",
            "Hello Mr Ottley, Ive always wondered this one question since Ive read issue #106. In your opinion who do you think is stronger: Omni man or Invincible? Who would've won that arm wrestle match?",
            "Will there be an 2nd invincible universe compendium?",
            "Any chance we get more of that Battle Beast spinoff?\n\nAlso, just gotta say, you are definitely one of my favorite comic artists of all time!!",
            "Wow this it’s cool af that the actual artist is here on the subreddit!!",
            "What characters did you enjoy the process of designing the most?",
            "Hi Ryan, was just wondering when it comes to drawing the comic is pretty much everything that you draw written out by Kirkman? For example with the Conquest fight was the part where Mark destroyed Conquest’s arm, and the head butting there? Did Kirkman give you space to add some stuff to it that you wanted?\n\nAlso I know that in the show you’re supposed to be Filip Schaff, creator of Sèance Dog. So in the comic was that supposed to be Cory Walker?",
            "I know you didn’t draw the final issues of Invincible, but why does emperor Mark look so old? Was that a mistake? Viltrumites age slowly and he somehow looks 50 whereas his daughter who’s only 20 ish years younger than him (maybe 15 years younger if he didn’t age during the 5 years he was gone) still looks really young. And 20 years is basically nothing in Viltrumite years.",
            "Absolutely love the show the POPs are amazing will we be getting more Funko versions of other characters?",
            "Does Mark ever form a good relationship with his son?",
            "Hi Ryan,\n\nLove your work! Any exciting upcoming projects?",
            "How did you get so good at drawing and what tips would you give to artists who want to improve their own art?",
            "Will you & Robert Kirkman ever plan to do an Agent spider comic or mini series? Or do anything else with him outside the Amazon show?",
            "will you have a hand in character design for the invincible video game? I know 2d and 3d character design and art is different, but it would feel wrong without the main artist for the source material not being included in the designs at least.",
            "Hey Ryan! First off, thanks for hosting this ama. \n\nMy question is pretty simple: were the meta jokes about comics being published on time a sort of self-deprecation about the Invincible schedule, or was there more to it than that?",
            "Hi Ryan! Who was your favorite character to draw throughout the series?",
            "Who do you consider to be the hottest character in invincible?",
            "Hi Ryan, your work on *Invincible* has been widely praised for its dynamic action scenes and expressive character designs. How do you approach creating such intense and emotionally resonant artwork, and what are some of the biggest challenges you’ve faced in maintaining consistency and quality over the long run of the series?\n\nAlso, any chance you can visit Vancouver BC, Canada to meet your fans?",
            "I desperately just gotta know why Rudy/Rex became a ginger once he got back from the Flaxan dimension even though him and og Rex were brunettes beforehand",
            "I gotta ask when’s the new season of seance dog coming out?",
            "Also do you have a favorite mark costume design or superhero costume design in the Invincible Universe?",
            "What is your favorite issue of invincible? Ily btw your art is amazing",
            "Hey Ryan, ima a huge fan of your work. What do you think the best issue of invincible is?",
            "How true to the comics do you think the Amazon Prime show will stay? Do you think we’ll see any major changes to some characters fates?",
            "Hey Ryan, I love your art! It’s such a detailed and aesthetically pleasing art style to me. But early on in the comics your art style was much different. It also feels like you really improved as an artist over those years. Did you ever do specific practice to get better, or did drawing for a monthly comic over the years naturally improve your artistic ability? \n\nAlso how did you learn how to draw gore so well?",
            "What was your first concert?",
            "Was there any scrapped plans or ideas you wanted to do In the invincible comics but didn’t?",
            "what are mark and nolans fav kind of chips",
            "What are some changes/regrets you made in the comics you would like revamped/changed in the show? Or even positive things you would like to be elaborated on more in the show.",
            "Did being a comic artist for Invincible pay well? How much did you make? And how much do you make from working on the show?",
            "If you could take the place of one of the characters in the series, who would it be?",
            "Are we going to see some events that were only mentioned in the comics get animated?",
            "Also Ryan, I know that during the comic’s run Cory was still helping with some designs. He designed Thragg I think you said. So did you just need help making him? Were there other characters he helped you design?\n\nAnd I think you said that Kirkman also designed some characters. I think you said he made all the Lizard League designs. Did he just have them ready for you? Were there other characters that he designed too?",
            "I might be dumb, but was there a different penciler/inker after the Viltrumite war? I feel like the art was waaaay more airbrushed than it used to be. \nThanks for all you do :)",
            "What was your favourite fight to draw? I loved the compilation panel ones personally!",
            "Is it just me or is Battle Beast stronger than Thragg, all things considered?",
            "why is your art so freaking good like holy shit man",
            "Was there ever any plans to do a Batman & Invincible Crossover Comic?",
            "Is there any part you least wanted to draw? You said to yourself \"this is stupid\" yet still did it?",
            "Any creative choices that you or anyone regrets as far as the story goes?",
            "Was there any page or scene that you drew for the series that was almost too much for you? Like either too graphic, sad, or anything like that?",
            "What is your character design process? I’m not sure which characters you designed and which ones Cory did but I love a lot of the character’s designs. Where do you draw inspiration from? How much reference do you use? I love Battle Beast’s design, black suit Robot, all of Thragg’s outfits and much more. There’s also great monster / alien design like baby monster girl that we never see again.",
            "Who is the biggest inspiration for your art?",
            "What albums would you listen too while illustrating and would the art influence what music it is e.g. sad album-sad scenes?",
            "Did Marky conceived the day Terra was born?",
            "Hey Ryan, huge Allen fan. Do you agree the series should’ve turned into an Allen centric comic after his introduction?",
            "Hi Ryan,\n\nJust saying thanks for sending me a signed copy of Invincible 100 along with a copy *Grizzly Shark vs Sea Bear.*",
            "Hi Ryan, huge fan. \n\nInvincible went from something I never knew about in 2020 to my favorite story ever after reading the entire comic run. \n\nMy question is how does it feel having the show introduce so many people to the world of Invincible and ultimately to pick up the comics (like I did) and fall in love with the story and your art?",
            "Is there a reason why your render lips so thoroughly",
            "Hey Ryan! If you could change 1 thing about any character what would it be?",
            "Do you have any favorite or least favorite questions/comments about you from Invincipals?",
            "Why was the time tentacle monster never expanded upon? I personally felt that whole arc was slightly rushed, amplified by the fact it was never talked about and personally only felt as a plot point for mark to skip forward in time.",
            "hi ryan! what are some of other characters you like drawing aside from invincible?",
            "What’s a character that you had to leave on the cutting room floor that you still think about? Also battle beast comic run PLEASE",
            "Can we get a full Agent Spider run with you and Kirkman?",
            "Thanks for the AMA! When originally drawing for Invincible, was a TV series in the back of your head at all, and would you have drawn anything differently knowing that it would be adapted to TV?",
            "Hi Ryan! Thank you for your work, really fan of your art in Invincible, especially your design of Eve. Could you please tell what is your favorite issue in Invincible comics and why?",
            "Would thragg still win against battle beast if they were both healthy?",
            "Hi Ryan: just a simple question: is there any comics you’re reading right now that you absolutely love? Can be an ongoing series or something from the past, thanks.",
            "Hey Ryan, what are your thoughts on the fan theory about Mark being able to prevail in such difficult situations due to his body producing adrenaline? Is this something you or Robert ever talked about?",
            "How do you come up with all those weird looking alien characters, what's the your favourite one?",
            "First things first, huge fan of your work! Also I was wondering, due to the mature content in the serious, at any point we're you worried you may get some backlash from it?",
            "Ryan I also was curious how did you and Kirkman meet, and what was the process of you taking over  as the main artist of the series?",
            "Any thoughts on an Invincible prequel series for Amazon?",
            "Which Alternate Mark costume design was your favorite to create?",
            "Which version of Mark’s suit was your favorite to draw?",
            "What \"reference\" would you recommend when drawing gory moments ?",
            "Ryan Ottley you’re my new favorite artist since discovering invincible, you’re very talented!!! Are there any future plans for a continuation of the invincible story?",
            "How did the moustaches become such an integral part of the Viltrumite identity?",
            "Which characters did you enjoy drawing the most?",
            "What's your advice to someone stuck in a 9-5 job who wants to be in a creative field? Too scared to break away from the financial security but want to work in film.",
            "How did the moustaches become such an integral part of the Viltrumite identity?",
            "How are you Ryan? Having a good time?",
            "Will there be any storylines from the comics cut out from the show or will everything from the comics just be expanded and more developed from the comics like it has been so far?",
            "How do you feel about the Mark adrenaline theory? The idea that the adrenaline he inherited from his mother makes him stronger in the moment than any viltrumite. Are human-viltrumite hybrids more powerful than pure bred viltrumites if that’s the case?",
            "Is there any particular scene or character from the comics you are hoping/excited to see adapted within the Amazon series?",
            "What are some potential ideas for future stories that you've been considering?  This could be for a sequel, a spin-off series, or something entirely new.",
            "What's your favorite pizza topping?",
            "What’s your favorite thing about mark/invincible?",
            "Hey Ryan your art is amazing and inspired me to start drawing also what  is your favorite compendium out of the 3?",
            "Who is your favorite Invincible character and why is it Conquest?",
            "Hi Ryan! I read through the whole series a few weeks ago and absolutely loved it. Anyway, this sub has turned a lot of panels into memes and such. If you’ve seen them, what’s your favorite?",
            "How freaking cool and fun was Death Grub?!",
            "Hi Ryan! Several colorists worked on your run, with very different styles. They’re all good, but which colorist’s style you think is the definitive Invincible style?",
            "Are you and Robert gonna continue the Battle Beast story from Skybound X?",
            "Hi Mr. Ottley! Thanks for your work in making Invincible the best superhero comic in the universe! What are some of the greatest challenges you’ve found in adapting the comic into an animated series? We’ve seen small changes in pacing, character design, and motivations that some have been critical towards - what were some changes you appreciated or are critical of? Lastly, any fun stories from your involvement in the show production? Like do the animators dread having to animate your painstakingly detailed panels? Thanks for taking the time to read my questions!",
            "What scene/panel was the most difficult (emotionally) for you to create?",
            "Spaghetti and reboot will that be addressed in show",
            "Hey Ryan, do you think there will ever be more invincible content out there? I love the viltrumites and would love to see more stuff about them",
            "Can I be casted as invincible for the live action?",
            "What was your favorite arc to draw?",
            "If you could bring one hero from any other publisher into the invincible universe who would it be and why. Personally spiderman would be a great fit.",
            "If you could draw a comic for any fictional character, who would it be? (Can be someone with a comic series already or someone without!)",
            "I’m on Issue 23 right now and I just want to say how incredibly talented you are! What inspired you to create Invincible?",
            "Where is season 3 William? But seriously, how far will the show go outside the comic source material?",
            "Who‘s the most fun B-tier villain to draw and why?",
            "Whos your favorite voice actor you’ve worked with so far?",
            "What’s a character you’d like to do draw a series/run for next?",
            "Hi Ryan, thanks for doing this. Of the covers you’ve done for the series, which has been your favorite including variant covers (63 ,84, and 97 are some of my all time favorites)",
            "Do you think we could ever get like small filler episodes in the show of different heros like rex,immortal ect ect?",
            "Out of all the characters, which character has your favorite design?",
            "Why does the robot's design have an old steam punk vibe ?   \nAnd do u wish to change any character's design in  animated series?",
            "Hi Ryan! Love your work! Who was your favorite character to draw in invincible and do you prefer things like creatures or more humanoid characters when it comes to your art?",
            "Will you guys release another special episode like the atom eve episode?",
            "Ryan! Question for you, pal. So, how do you draw the poses? Cause that’s one of the things I truly struggle with in my artwork.",
            "Hey! I’m a newer fan of the comics, as I only started reading them a few years ago, and I guess the question I want to ask the most is what scene are you most excited to see get remade for the show? Has it been released yet? Or is it in a later season?",
            "Thank you for being a part of my absolute favorite comic series ever.\n\nI don’t know if this is anything you could discuss or not, but is there any chance we will be seeing more from the invincible universe? Especially interested in exploring some of the little plot thread teasers near the end of the series.",
            "What was Marc’s name orginally gonna be?",
            "What part of the Invincible comics was the most fun to make?",
            "Hey Ryan! I've always loved comics and drawing, especially superheroes. Your work on Invincible is one of my biggest inspirations! Do you have any tips/resources for drawing and character design? Thanks!",
            "I can’t be the only one who sees the similarities between Robot and Mechamaru from JJK right!?",
            "Hey there, would you be interested in exploring the conflict with Angstrom Levy's son?",
            "Do you think battle beast is a cutie patootie??",
            "If you had to pick one, what’s your single favorite frame from all of Invincible? Big fan of your work and love Invincible especially very much!",
            "Hey Ryan! Such a cool opportunity to ask you a question. (even if it doesn’t get answered) My question is, What was your favorite single panel in the entire series to draw?",
            "Who were your favourite colourists and inkers to work with during Invincibles run?",
            "Hey Ryan! \n\nI’m trying to improve my drawing skills and i’m so fascinated about how people can create their own style of art. How long and how was your journey in creating your own style. \n\ni’m btw totally absolutely inlove w everything u make 🫶🏻",
            "If you were to do more invincible spin off comics work, what character  and time frame would you like to do?",
            "did y'all have the whole story mapped out before you finished the series, or did you just figure it out as you went along?",
            "Will you be coming to any Atlanta comic events anytime soon?",
            "Hi Ryan, love your work! I’m wondering how you’re able to achieve such dynamic and interesting poses? Has it always come naturally or is it something you picked up by looking at/studying specific things?",
            "Hey Mr. Ottley, thanks for doing this AMA!\nI was wondering, are there any characters that wish you had designed differently as the comic continued?",
            "Hey Ryan! What was the reason that the viltrumites all have mustaches? is that for recognition?",
            "Have you ever taken inspiration from any manga when drawing? If so which?",
            "Which comic pannels will be animated next season?",
            "Hi Ryan, huge fan from Germany here.\n\nI have some questions and it would be great if you find the time to answer :)\n\n1) What is YOUR favorite Invincible Character?\n\n2) What was your favorite page/sequence, that you drew?\n\n3) Would you ever return for another invincible project? (Still waiting for the follow-up to the Battle Beast stories in Skybound X)\n\n4) Just finished reading the story in the Energon Universe Special. How about drawing an energon universe on-going?\n\nThanks you for this AMA",
            "What issue of the invincible comics was your absolute favourite to make?",
            "When you first started on invincible, did you have any feeling that it would get as big as it did?",
            "Hi Ryan! Thank you for taking the time to answer questions. \n\nMy question: Was the plan to always end the run with reference to Mark’s battle with his father? If not, what were other considerations? Further into the future or closer to the year of the main storyline? \n\nThanks!",
            "RYAN!!!! There’s soo much content in this series—it would take countless seasons to do it all justice.. has there been any discussion internally with Amazon of doing more one-offs, a la Atom Eve special? ..and If I send you a proper storyboard of a baddass Powerplex one-off, would you give it the chance it deserves? \n\nAnother quickie:  I don’t expect you to announce your next independent project whimsically here on my thread.. but is there an eta on when an announcement may be coming?  \n\nYou’re the goat.  Excited for more goat things. Thx!!",
            "Hi Ryan! \n\nTwo questions in one. Is there an arc or plot point which in retrospect you would've done differently?\nIs there a collaboration you wanted for the comic which never happened?",
            "Hi Ryan, when starting the invincible comics had you always had planned from the beginning mark taking over the viltrumite empire, beating Thragg, having his father go from loyal viltrumite to loving father, etc… or was there an other ending planned??? Thank you",
            "Hello!!!! Looking back at your work on Invincible now, is there any changes to character design/artistic style that you wish you could implement? And/or that you would do differently if you got the chance to do it now?",
            "Hi Ryan, do you think William and Rick would ever adopt a child? ",
            "Who was your favorite of the more minor villains from the series? Mine is Tether Tyrant",
            "Hello",
            "Hey Ryan!\n\nWhich character designed by Cory Walker was the most fun to adapt into your own style in the run? And how excited were you when Kirkman let you know about plans to bring Angstrom Levy back looking even more deformed than ever? I know you loove drawing the undead and Angstrom'e design was next level 😉\n\nKeep up the great work, much love!",
            "Ever had any influence from manga/anime? If so which ones??",
            "Hi, Ryan! Will there be an Invincible panel at LA Comic Con this year? Or another panel sometime soon? (If you can't tell us just yet, that's okay, ignore this!)",
            "What's your favorite panel you have ever drawn for Invincible?",
            "With knowing you know now I'm how Invincible has been recieved by the public and its popularity, if you could, would you go back and change anything about the source material, if so why? Also how would you feel about a super crossover with the other amazing Amazon exclusive The Boys? ",
            "Did you enjoy drawing Amazing Spider-Man a few years ago? I really liked your art in that run!",
            "Hi Ryan, what do you think is Mark’s favorite food besides kanslok?",
            "Your artsyle is very recognizable by a lot of people, so I've always wondered, how long did it take you to \"perfect\" your artstyle?",
            "How do you think the Amazon series is going, do you think the changes they make are making the series better than the comic book, and how excited are you with the future arcs being animated?",
            "Hey Ryan! Sorry if this question isn’t so profound, but I was just wondering what keeps you going? What’s something that motivates you (or motivated you) to keep doing what you do?\n\nCheers!",
            "I'll go simple, what's your favourite movies of all time ( and tv shows too)",
            "Ryan could also talk about how you and Kirkman came to the decision to end the series? How did this talk come about? When did you guys know it was time to end it?",
            "In all of the characters you made for the series, who's easily your least favorite? And who is your favorite?",
            "What has been your favorite character to draw",
            "How’d you come up with the idea of Omni man being the bad guy in the first volume?",
            "Hello Ryan, Big fan of the Invincible Comics.\nOne of the parts I find fascinating about the comics is the story Arcs and interactions of Mark and Dinosaurus. I was wondering what the design and story process was leading up to his creation and implementation. Also is there any chance you'd ever come to London Comic-Con? Thanks :)",
            "What is your favorite Invincible panel that you’ve drawn?",
            "Hey Ryan! I actually met you at comic con and you signed a comic for me. Thank you so much for being awesome and super nice. Was just wondering if you think invincible would be able to defeat the justice league?\n\nhttps://preview.redd.it/3ytasy637m3d1.jpeg?width=1131&format=pjpg&auto=webp&s=b9c9ad15ce3e76a8952f1e742b2a1ae24465fd2f",
            "I’ve been trying to work on my own comic for a year or so now, and I really want to start getting my name out there. Do you have any advice?",
            "Hey Ryan, I’m a big fan I reached out to you on insta about coming by in October for your NY event! I got some invincible artwork being done now that I know you gonna love🤘🏽can’t wait to see your art in person! Your work motivates me to right and draw comics😂",
            "Hey Ryan\n\nIs there any particular character or moment from the run that was your favourite to draw and why? Love your work",
            "Hi Ryan, did you have any resistance from the writer’s room when it was decided Mark would be a hero but also be open to killing villains when necessary? For me this is the most unique part of Mark and his character, recognizing the hypocrisy of allowing them to continue hurting innocents",
            "Is it hard to make changes to a property like Invincible when creating a show? Or is it fun getting to make changes to differentiate the show from the comics?",
            "Howdy Ryan!! I was wondering what your favorite food was. (Or what Omni man’s favorite food is, that would be neat to know.)",
            "What is your favorite panel/page for the series you have drawn?",
            "Hey Ryan, I hope you're having a great day and wanted to let you know I'm a big fan of your art style! I recently binged the Invincible comics after the release of season 2 and I loved it, I was wondering what your personal favorite storyline was?",
            "Hello, Ryan! Any advice you could give to aspiring artists?",
            "Mr. Ottley if you could write or do art OR BOTH for any Invincible comic character who would it be and why?",
            "Hey Ryan, thank you for taking your time with this AMA.\n\nWho was the hardest character for you to draw of all the Invincible cast? And so, why was it hard to draw?✍️",
            "Hi Ryan! How did you learn to draw so well? Did you take courses in anatomy and architecture, or was it all just practice n your own? Are there any artists (comics or otherwise) that you look to for inspiration? Thanks for ama-ing!",
            "Obviously we know you have an affinity for the man himself, but aside from Invincible, who's your favorite character to draw?",
            "Hey Mr. Ottley, if you could change any design of a character in invincible who would it be and what would you change.",
            "Hi Ryan, any advice for someone who has a story they want to turn into a comic? LOVE Invinvible, btw. I've read the whole thing 3 times",
            "Is there any of your art in Invincible that you either wish you could draw differently or are extremely proud of",
            "Hey Ryan! Huge fan of the Invincible series. My question is about the Invincible SCRIPTS that Kirkman would send you. Do you have a particular favorite? Something that really moved you while reading it before starting to draw it?",
            "Throughout the entire run, which character did you hate the most?",
            "Plans on any new comics in the invincible universe? 😉 thanks for all the great work you do",
            "Could allen beat superman?",
            "Could Invincible one day meet Spider-Man again?",
            "Would morbius defeat invincible?",
            "Hi Ryan! I'm a huge fan of your art and have been ever since I finished Invincible. How does it feel going from being an artist that posts online to an artistic celebrity within the comic industry? ",
            "Hey Ryan Stoked for the POP giveaway Will there be more Funkos Coming?",
            "Hi Ryan, I absolutely fell in love with your artwork through invincible and loved your run on Spider-Man as well. With you creating many of the characters and locations, and invincible being a sort of play on typical comic book tropes, did you find it difficult to transition from a self-aware comic book to a traditional mainstay like Spider-Man?",
            "What advice/tips or anything would you give to someone 1st getting into comic creation like someone who's never had experience in it and is only now putting pen to paper, and is there anything you would've killed to know starting out or any crucial rules or information new comic creators need to know or stick to ?",
            "Hello!\n\nI finished reading every comic and I must say, what a badass roller coaster! My question for you is, is there anything in the comics that you would tweak or change? And why?\n\nhttps://preview.redd.it/xli0z52pbm3d1.jpeg?width=1379&format=pjpg&auto=webp&s=d476a7db80c2db369f34e8578996a2c00fce221a",
            "Huge fan of your art man, I’d always heard of the comic but bought the first two compendiums after the first season came out. What would you say was your favorite character you’ve drawn and was there anything special that you changed in drawing them over time? Like something you changed in your style over the span of drawing them. Also really enjoy your spiderman series :)",
            "I read Kirkman’s Afterword from the first Ultimate Collection volume where he talked about how important the team was to making Invincible, especially in the early issues. He talked specifically about how when he was writing his script he always thought about how you would draw it out, and as someone who both writes and is currently getting into art, I found that really inspiring. I was wondering how you use your art to tell a story, how you give every panel and character so much life visually. I find it hard to set a tone with stagnant art and you do it super well so it’d be great to hear some advice from the best in the business!",
            "What was your favorite Easter egg you've placed in Invisible?",
            "Given Viltrumite strength, how are Viltrumite prisons able to hold Viltrumites securely?\n\nAre the handcuffs and walls made of some kind of unobtainium? I asked this in this subreddit before, and someone suggested Viltrumite bones--I kinda like that answer.\n\nOr do they just have smart-atom supression fields in their hand cuffs?",
            "After seeing your profile picture I notice that you actually look VERY familiar. Like I swear I’ve seen you somewhere before. Like ACTUALLY in the show itself. Isn’t this you???\n\nhttps://preview.redd.it/g2wgqu9ifm3d1.jpeg?width=308&format=pjpg&auto=webp&s=1cfcc04bb68e398c11f1a4fe7ce6e14a5c0e38bf",
            "Hi Ryan!\nWhat was your inspiration for drawing Grand Regant Thrag?",
            "Oh sooo cool to see you here! Thanks for doing this and for your incredible art!\n\nI’m curious how old you were when you started working on Invincible, and how you came into this gig?",
            "Oh man I didnt know this was happening until just now! I wish I had a good question but I’ll settle for congratulating you on all of your success!",
            "Love your art across the board, I only have one question; should you have had the opportunity, what other Marvel/Dc character would you have crossed invincible over with?",
            "Hey Ryan! \n\nI was wondering how do you make fluent action  sequences and if you have ever done and art for anything evil dead related.\n\nThanks! , DBM",
            "Do you think you’ll work with Kirkman on another ongoing series ever again?",
            "Hi Ryan: I’m a massive fan of the invincible comic series and your artwork in it is my favorite:as someone who’s trying to draw a comic series  the future: what’s some advice  on how I should draw and shading",
            "Any hints on any new stuff you’re working on?",
            "Was there ever any plans on continuing with markus and Terra?",
            "Hey man absolutely massive fan of invincible, just wanted to say thank you for providing such an amazing creative show. It is so refreshing and I just wanted to ask how did you get into the sketching and when did u realise you had a knack for it.",
            "What would you say is your favorite issue of any comic invincible or otherwise you’ve illustrated?  The most fun or challenging to do?",
            "Were there any characters or powers you were interested in adding but couldn't for one reason or another? By the end of the comics there's a pretty ensemble cast of characters but most are relegated to the background because they simply can't keep up in power. Any other big threats you wanted to add that could stand toe to toe with a viltrumite or minor characters you considered making stronger? ",
            "No question, I just wanted to say you are incredible. Your work on conquest made me read enthralled on every page. Plus the double spreadsheets like thragg with all of his children is astounding, I frequently look through the books just to see some of the art. Seriously you are one of artists I’ve ever seen.",
            "What are some dropped threads that were left to, potentially, be picked up later on? The second Viltrumite-Coallition war, Marky’s general life, etc",
            "I got an autograph from you this year at Megacon! Big fan and I love this comic. Do you have a favorite author for novels?",
            "Who is your favourite character in all of Invincible?",
            "If you had a chance to change something, what would it be? What’s something (from comics) that you would think be better now?",
            "Which comic artists have inspired your work the most?",
            "Your art is so awesome. When drawing some of the fights, did you ever listen to music to motivate your feelings into your art? If so, what are some songs you listened to while illustrating?",
            "Who is your favorite character and who is a character you would’ve like to give more of a spotlight?",
            "https://preview.redd.it/krmn93tbvm3d1.jpeg?width=2952&format=pjpg&auto=webp&s=7c7248ac17953df8b94e2415c07e001af56c2f68",
            "Hey Ryan, what do you think was your favourite issue to draw and your hardest to draw?",
            "Thanks for doing this, I love your work! Do you have any tips on improving art skills?",
            "Who had your favorite art style throughout the series",
            "Hey Ryan! Any advice for someone who wants to pitch a comic to image comics?",
            "Great work, Ryan. Now, who’s your least favorite character to draw?",
            "What was your favourite story arc to work on?",
            "Hey, i am an artist but i need help with anatomy, and tips because i am very inspired by the show and the way the muscles are drawn",
            "Hi Ryan! Do you have any tips on creating a great costume design and making a character more fleshed out and unique? I love your work by the way!!!",
            "Hey Ryan I wanna become a comic artists like you but i don’t know how to draw to draw poses and shade drawings do you have any tips for me🙏",
            "Hey Ryan I LOVE your art I wanna become a comic book artist like you and make my own comic but I need help drawing dynamic poses and shading my drawings do you have any tips for me🙏",
            "Don't have a question just want to say sick art",
            "Aw dang, I missed this! Love your art",
            "Who’s your favorite and least favorite character? Who were you happy or least upset to draw the death of? Who were the most upset to draw the death of?",
            "Hi Ryan, seeing as you've worked both as a contributing creator on Invincible but also an artist for Big Two ongoing books like Nick Spencer's Amazing Spider-man and Donny Cates' HULK, what can you say are some differences in working independant vs working for one of the larger publishers that people outside the industry arent really talked about as much?",
            "Your opinion on this comic panel\n\nhttps://preview.redd.it/hl4mzap3dp3d1.jpeg?width=964&format=pjpg&auto=webp&s=bface6abef46f061eb6df009de6209a482120e1c",
            "Hello Ryan. Been a fan since 2011. \n\nmy question is regarding the man(?), the myth, the legend. Space Racer. \n\nWas he intended to be a Lobo spoof? And why is his appearance so unique in that the comic has almost no background on him besides Nolan beat him up 100 years ago?",
            "Hey Ryan! Who’s your favourite superhero? (I know it could be invincible but you never know!)",
            "Hello hello can you give me your autograph! Omg omg",
            "First of all: good character designs. \n\nMy question: why does your artstyle change so much overtime",
            "Hi Ryan, love your amazing drawings, I wanted to ask you who was your favourite character to draw and (if it's not the same) who's your favourite character in general",
            "Hey Ryan! Thanks for all the amazing info, I was wondering how you go about starting backgrounds for alien planets.  The buildings and floating car designs are always so intriguing, I'd love to hear about where your mind's going while structuring these cities and such.",
            "Any chance we can get you to redraw the last few issues? All due respect to Walker as co-creator of the series, but your art style really defines the comic and it was hard to have the dramatic switch in aesthetics at the close.",
            "What was the story of the creature that took invincible 5 years in the past? Was anything that invincible saw even real?",
            "First off the comics are great! Do you think Rex could have killed Omni man like he killed that mark in invincible war?",
            "(I ask this in a joking manner, no offense meant):\n\nWhen you designed Universa, how horny were you?",
            "Why did you choose the name Mark Grayson for the main character? I think the name John Invincible wouldve been better.",
            "Can the SHOW PLS take more inspo from your art style 🕺",
            "If he’s invincible why can I see him?",
            "Hi i love your work my question is  \nhow does one get nolan's fabulous mustache",
            "if hes invincible then why can i see him",
            "https://preview.redd.it/1epf8ajk8m3d1.jpeg?width=3024&format=pjpg&auto=webp&s=24a98759c38c190cf3999745ce8f412d112f8153\n\nBest Invincible villain… CHANGE MY MIND…",
            "Yes! Great question! Remember, an artist has to choose the visuals, and with that, the acting, the lighting, etc. You basically get to act like a director and direct the scene to make it how you want. I recommend to artists to learn some cinematography, by reading about it and simply watching great cinema, and also watching how great artists do compositions for certain scenes. Jack Kirby, Greg Capullo, Erik Larsen, all are extremely good at dynamism and getting the point across in the panel. An artist needs to figure out the best composition for each scene. You have to know when an upshot or down shot, or a close up or a full wide shot with location details is appropriate for what the writer is trying to say. I’d also recommend a book called Framed Ink. Really good composition tips. But basically you’ll find a lot of great ideas within good movies and comics. Just need to be inspired by a lot of quality content to up your game.",
            "Spoilers! >!Nolan. It was so sad to visualize that scene. It’s weird because I was with these characters everyday for decades, so in a weird way they feel like family. So even during the Angstrom scene in issue 33 when he broke Debbie’s arm, it was infuriating to me, I’m drawing this happen and I felt sad and upset which helps fuel the emotion in the art, in my opinion. But Marks parents felt real at those times and I hated putting them through so much pain. I know, it’s silly, it’s lines on paper. But to create those lines I have to go through the emotion of it all and put my anger and sadness on paper in hopes that the readers feel what me and Robert want you to feel. !<",
            "Favorites questions are hard! So I’ll say a few. All time fave: Battle Angel Alita, Akira. Current: Saga. Current Transformers!",
            "That is a difficult question. I’m terrible at choosing favorites of anything. I see problems here and there with things I draw, it’s how I’ve trained myself to become better, so it’s hard to pick a favorite of my own art. Let’s change the question to favorite arcs to create the visuals for. I’d have to say Conquest arc, Viltrumite war arc, and what I’m working on right now are my faves!",
            "Hmmm, difficult to me has always had to do with time. Not actual difficulty in drawing. Because this is a deadline based series, I had to rush everyday to get enough done to meet the deadline, so when a page came along that required lots of figures, it really made things more difficult. So the biggest most difficult pages were in the Viltrumite war with the exploding of Vilturm double page splashes. And then the page of Thragg with his thousands of children. That one took over a week. Which definitely slowed me down. But in the end it was absolutely necessary to get the shock I wanted across.",
            "I’d have to say characters I co- created. The act of creation can be very difficult but so enjoyable once you get the visual down where both of us like the outcome. Battle Beast, Conquest, Dinosaurus, Anissa, Powerplex, Shapesmith, to name a few.",
            "If it was now, I’d simply draw the way I draw. Back then I was hungry and accepted the suggestions to keep my style minimal etc. I’m much more set in my ways now. Back then I did less detail to keep the vibe Cory set. But no one can draw like Cory, he’s skill is intensely strong and style all his own. So I basically did my best to draw like me but with less of the detail I was known for at the time. Then my goal was to grow as an artist and only compare myself to myself.",
            "Oh, definitely Superman. And it would be a gore fest like you wouldn’t believe. Viltrumites would get Batman and Lobo on their side and they’d construct a plan to take down Clark and his entire Kryptonian race. Clark would hire Lex Luther out of desperation to help him survive. Let the bloodbath happen DC, don’t be afraid.",
            "I start doing. I am a firm believer in motivation and creativity always happening in the act of doing, rarely before. Once you get discipline down, you forget to care about how you feel. I could feel completely unmotivated one morning but since I have things planned to get done, I simply start doing and then after some time my motivation kicks in, creativity follows, and I’m in my zone! Music and podcasts, or tv shows that aren’t too visual can help keep me at the table!",
            "Thragg and Battle Beast was beyond fun. I loved Robert’s idea of showing the fight scene every once in a while which implied a months long fight. And the ending was tragic but so impactful.",
            "It’s still beyond surreal. I’ve gone to conventions every year as the Invincible artist for the past twenty years and every time there would be con-goers that would ask what this unknown independent superhero comic is about. Now no one asks! There’s a whole new age group wildly into it and it still blows my mind. I’m not used to it, and probably won’t ever be used to it, but I am enjoying the ride!",
            "Ya know, I don’t think I’ve seen more cosplay since the show came out, it’s about the same. Comic fans loved to cosplay as well. One New York comic Con I went to, had more Invincible cosplay than I’ve ever seen and this was years before there was a show. And I’ve never seen those characters portrayed since. Like Battle beast and Anissa, really cool to see those recreated. These days it’s mostly Nolan, Mark, and Eve. But shortly I bet many other characters will be attending cons. I’ll keep posting them on my Instagram! Always fun to see them!",
            "Why is ur forehead so big  \ncan i build my airport on it?",
            "Conquest arc will always have a warm place in my heart. But I am proud of so many arcs Robert and I created together. I love the flaxan scenes that was portrayed in season 2. Dinosaurus arc was insanely fun. Even as far back as the initial fight with Nolan and Mark, I’m proud of it even though I kinda wish I could draw it all over again. Old art is hard to look back on with admiration.",
            "Well, it was when Invincible was wrapping up. And Marvel heard about us ending our book, so they reached out and asked. And my initial thought was “Oh, well that would be a good next book!” Spiderman is what got me into comics so naturally I always had the desire to draw him someday. Excited! That’s how I felt. In the end I prefer creator owned comics, but it was a fun gig for the time.",
            "Not even Kirkman would answer this lol",
            "Yes, while laying out a scene I like to add little things that amuse me since I’m the one spending so much time drawing the scene, the more ways I can entertain myself while doing it, the better!\n\nThere’s probably so many things I’ve forgotten, I’d have to go through it all to remember them all. I’ve drawn friends in there, comic characters and movie actors, I even put in a lot of religious things because I used to be very religious at the time. I should compile all the Easter eggs. Too many to count!",
            "A lot of people do look at Invincible as one project, but for me it was my full time job for most of my career, so each arc felt like a new project. Credit to Robert for keeping the scripts so interesting and fun for me month in and month out. So there are arcs I’m more proud of than others, so many things hold a special place in my heart, and it’s usually the scenes that are ripping hearts out which is the best definition of irony.",
            "Quit! But only for a little while! Then get back to it. Doesn’t work? Quit again! But only for a little while. Go for a walk, destress. But a lot of the feeling of art block doesn’t go away until you start. So be sure to get back to drawing and a lot of the time creativity and inspiration come back while you are in the act of doing. Rarely before.",
            "Thanks for coming by my booth at LA comic con! Always a great convention! It’s definitely amusing seeing the memes for sure. I’d say the surreal feeling comes from seeing our property expand so much, I never thought it’d become something that would be so pop culture popular. I doubt I’ll ever get used to it! But I love it all!",
            "Man this was such a good one, shame it wasn't answered",
            "Allen’s initial design was by Cory Walker. Amazing design, I love the guy. Robert basically wanted changes throughout the series, especially after Allen got his ass beat. I drew him bigger and buffer after that first fight in issue 23. But then I had to do a couple redesigns throughout the series when he became leader, and Cory did a couple redesigns too. That last redesign took a couple tries since Robert wanted me to draw him with some kind of super strong rock type structure like the Thing. I’d love to see how he’d continue to evolve after a few more beatings. I should do some sketches for fun.",
            "Again, I’m terrible at choosing favorites. I absolutely love classical music, I do love heavy metal like High on Fire, Electric Wizard, and I love rap like Jedi Mind Tricks, Wu Tang, MF DOOM. I have too many favorites that change day to day.",
            "Ottley's final words in the TPBs\n\nhttps://preview.redd.it/n2lv8wru5n3d1.png?width=636&format=png&auto=webp&s=db31de2ed5b2c59c4c2fc12add571078509fb8d5",
            "[The closest he's answered something like that](https://youtu.be/uubsUgShma4?t=473)",
            "[3:12](https://www.reddit.com/r/Invincible/comments/1crr4at/clipped_together_all_of_ryan_ottleys_advice_to/)",
            "Also, Did you have any specific type of metal on mind for Conquest's prosthetic hand? It looks really cool but I'm curious if it's bronze or an entirely exotic Viltrumite Alloy",
            "Yeah, that's supposed to be him. That's the joke. Kinda sad they didn't get him on the mic for his cameo, but whatever. Was still super fun to see.",
            "[0:55](https://www.reddit.com/r/Invincible/comments/1crr4at/clipped_together_all_of_ryan_ottleys_advice_to/)",
            "I don't remember when but he did answer this once. He would listen to accelerating music, rock and stuff, to hype himself up as if *he* was the one in a fight",
            "dawg💀",
            "In case you read this, I absolutely cried my eyes out reading those pages, my grandmother had just passed away and I spent a lot of my time reading and that whole section tore me to pieces. Mark said so many things I wish I could’ve said and that emotion was just palpable, thank you so much.",
            "These are my favourite pages of the whole series!",
            "My Dad had passed away not long before I read this. It felt like him speaking to me too, in a way",
            "*Battle Angel Alita*  is spectacular.  Have you been keeping up with the follow-up Alita stories of *Last Order*  and *Mars Chronicle?*  What did you think of those?",
            "CURRENT TRANSFORMERS! The best thing on shelves right now.",
            "Saga!",
            "I'd definitely buy that!",
            "That's awesome to hear! That's such a good way to look at things and I'm definitely going to try and keep my mind that way for the future. You're awesome Ryan!",
            "I hope that fight last over like 3 episodes in the show",
            "Haha that’s awesome! Thanks for the response Ryan!",
            "(For people that don't get the context, this is a meme from the Discord community about our lovely moderator Mar. You can join the community here: [https://discord.gg/9sXtxz2J3A](https://discord.gg/9sXtxz2J3A))",
            "I think it’s hilarious that everyone, even all the way up, confuses Thraxan and flaxan",
            "Do you like the way the show adapted the Nolan vs guardians fight? The show certainly added a lot to the fight. \nI am a big fan of the comics and the show",
            "I totally understand preferring the creator owned spectrum of that. I’d imagine there’s a lot more creative freedom. Thank you for responding!",
            "Maybe next time",
            "Wow now this scene is even funnier than it already was before. In a way Mark is meeting his creator in the most LITERAL sense possible lol. No wonder he had so much respect and admiration for him",
            "Just imagine it's an entire season lol. Every episode we get like 5-10 minutes of them",
            "Using my forehead for promo! Getting creative I see!",
            "You should really read the comics if you haven't yet. That scene mimics one from the comics where Mark goes to meet the author of his favorite comic, Science Dog."
        ]
    },
    "Mark just cant seem to catch a break :(": {
        "title": "Mark just cant seem to catch a break :(",
        "score": 556,
        "url": "https://v.redd.it/afna31ch408d1",
        "content": "",
        "num_comments": 9,
        "comments": [
            "https://preview.redd.it/sj40n8zz708d1.jpeg?width=777&format=pjpg&auto=webp&s=c1bfb0da1579bce8b5acd0a55d20e2ed79e541d9",
            "This is just one of the reasons why prime Mark is the strongest, he is always on the defensive having to deal with whatever shit situation comes his way. Luckily for him, having to deal with these situations makes him not only stronger but smarter too.",
            "BROS ABOUT TO GET THAT SPIDERMAN CHARACTER DEVELOPMENT \n🗣️🗣️🗣️🔥🔥🔥",
            "Can’t wait for s3 to see this part",
            "With the way this subreddit is hyping up their 1st fight encounter in the comics.\n\nEven I can't wait for it to happen in the show",
            "While it was crappy for Mark, it was fortunate for the people rebuilding the city. Imagine if they had finished when he showed up and just destroyed it all again.",
            "That's why he's the GOAT , THE GOOOOOAAAAAAT",
            "Legit just set the ult collection down and holy shit. He brutalized mark worst than omni man and bodies someone else. Im leaving it there but definitely the best fight so far."
        ]
    },
    "Could there have been any other alternative to dealing with this? #77": {
        "title": "Could there have been any other alternative to dealing with this? #77",
        "score": 101,
        "url": "https://i.redd.it/7qy6do8qp28d1.jpeg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "Off topic, but how would a cigarette effect a viltrumite? Would they get addicted and get lung cancer? Is that a weakness?",
            "Like what? Thragg has dozens of Viltrumites on earth. If Mark and Nolan try to fight him then and there, they'd lose.... badly. And then the kid gloves would come off and earth would become Thragg's breeding camp. \n\n\nInstead Nolan and Mark decided to take the truce. Mark because he didn't want to risk the lives of innocent humans trying to fight off 30+ Viltrumites, and Nolan because he suspected that Viltrumites who lived long enough among humans would come to see us the way he does. \n\n\nThey had to agree to a truce sure, but I think Nolan was the real winner here since he was right. ",
            "https://preview.redd.it/zmsx7opb238d1.jpeg?width=1492&format=pjpg&auto=webp&s=4003a4c665f08dd3a6e3ceac5d9ae5abc9984a24",
            "Letting the Viltrumites stay on earth and start families was not a mistake. As we learned they all became big softies. \n\nI think the real error was how Nolan dealt with Thragg when the Viltrumites turned on him and made Nolan their leader. \n\nThey should have forced Thragg to also go to earth and start a family, and I wager he would have also turned into a more empathetic person. That or kill him. Exiling him was a bad idea.",
            "From Earth's side? Not really.\n\nI mean, what choices do they have? The Viltrumites are clearly monitoring the planet and things coming to it from orbit. If they act against the Viltrumites, the Viltrumites will know, and they will retaliate. There is no force on Earth that can stop them if they decided to attack. They could kill everyone if they wanted to.\n\nYou can't even subtly do it - like  if they had Nolan and Mark going around killing Viltrumites 1 at a time, like only once a week or month - they'd still see that as an attack, because a Viltrumite can't get murdered in the street by some crackhead, so they'd know you were up to something.",
            "Releasing scourge virus",
            "Why couldn't the viltrumites fuck each other a bit too? They had women",
            "Considering most conventional poisons don’t work on them, I’d expect they wouldn’t.",
            "Nah it just makes them look cooler",
            "What if Allen the Alien who is not from Earth or Viltrum, kidnap or take hostage 1 Viltrumite at a time and kill them every week or so. Would the outcome still be same for Earth?",
            "And they have good lungs, cant mark and omni-man keep a breathe in space for months on end?",
            "https://preview.redd.it/aqgnbnh2x38d1.jpeg?width=828&format=pjpg&auto=webp&s=7d8d4bbc075c4e3cbcc18e84205ac6f5a8bd2ca8",
            "Aside from the plague the alliance can’t really stop a troop of viltrumites just running around planet to planet fuckering them real good.",
            "Allen wouldn't be able to pull that off.\n\nPhysically he probably could, but when he >!shows up with the Scourge virus!< Thragg is aware he has arrived. He wouldn't be able to get to Earth undetected, and there's always the chance they would kill/imprison him, assuming they met under different circumstances. \n\nThat aside, I don't see more than one or two Viltrumites being murdered/disappeared before Thragg would be demanding an explanation from Mark/Nolan, under threat of destroying the planet. That's the real problem, even having a way to beat them one at a time doesn't help, because killing a Viltrumite is NOT an easy thing and the vast majority of things on earth simply can't do it. So it happening even once would be suspicious, but twice? That's a problem for Thragg. If Thragg has a problem, so does alllll of humanity.",
            "Yes, Viltrumites can hold their breath for months which lets them travel between planets.",
            "2 weeks\\*, but that's still impressive"
        ]
    },
    "The comics do a great job of showing how op [SPOILER] is. Can’t wait until this happens in the show": {
        "title": "The comics do a great job of showing how op [SPOILER] is. Can’t wait until this happens in the show",
        "score": 1387,
        "url": "https://i.redd.it/5inesum2ux7d1.jpeg",
        "content": "",
        "num_comments": 73,
        "comments": [
            "Nolan telling Mark that he always loved him when he thinks that they’re about to die hits pretty hard as well. The Viltrumite war is going to be amazing when we get it in 50 years.",
            "Thragg is one of my favorite OP characters in fiction. He's so scary. He's the strongest force in this universe, but he'll also negotiate with you if it's convenient for him. But those negotiations have this looming feeling of threat to them, since he has resting mad dog face and very well might get annoyed and kill you.\n\n\nThe scariest moments are when he controls himself, like when he resisted the urge to pop Ursaal's head. He's clearly has an emormous rage problem, but he also has such will that he can actually stifle it completely, and does so almost all the time. It's like sharing a room with a T-Rex that's visibly shaking from how badly it wants to bite you.",
            "Right before {spoiler} {spoiler} Nolan",
            "\"we can't\"\n\nnolan's certainty in his words and the defeated look on his face, as if him and mark were already dead, is perfection to me. even thragg's expression shows a lot. one of my favorite moments in the series.",
            "Yeah, Thragg IIRC via Kirkman was said to be the strongest character in the verse Pre time skip and it’s relatively obvious off statements and feats alone.\n\n-He effortlessly stomped the shit outta both Mark and Nolan 2v1. \n\n-Killed Nolan in their 3rd fight.\n\n-Utterly left Conquest and (after several Zenkai boosts) Allen in fear of engaging him in combat, as well as shredded Thadeus who was matching Kregg and Anissa punch for punch. \n\n-Killed multiple Ragnars with his bare hands (who’re the only race powerful enough to kill a some of the strongest Viltrumite like Anissa and brutally injured Conquest).\n\n-And fought The Scourge of the Twin Galaxies in Battle Beast for weeks on end without tiring and was the only opponent Thokk deemed as\n“a worthy adversary”.\n\nThe only showing close to an anti-feat for Thragg was when he got beat down by 6 viltrumites and lost to Mark in the “End of all Things” when they were in the Sun.\n\nBut it’s easy to say that Viltrumites only did that because they had the “numbers” advantage not because they were “stronger”, because individually they’d get their asses beat by Thragg otherwise without massive help. \n\nAnd Mark (even after Eve making him a little stronger after reviving him from death) didn’t really overpower Thragg, and needed help from Robot to put him down. \n \nSo in conclusion, if the show so far is good at  showcasing how strong Nolan is so far, they’ll do justice to Thragg.👍🏽",
            "This was honestly one of the most intense fights I’ve ever seen in a comic book. I think I’m the only one excited for the Viltrumite War more than the Invincible War. 🥲",
            "Freddie Mercury truly is op",
            "and then battle beast fights the same mf for days with a cut stomach",
            "Hey, what about using the power of friendship?  Would that work?",
            "I can’t get over how Thragg was “educated in all manner of combat” and then it turns out he just has like a 50% strength buff compared to everyone else",
            "Nolan’s Thragg skin in MK1 made me very excited",
            "I can’t wait to hear who will voice him\n\nhttps://preview.redd.it/ym2iwyntf08d1.jpeg?width=295&format=pjpg&auto=webp&s=05c3de74778ce8cfc2831397abf901c0b9deae2b",
            "This Thragg dude seems pretty OP.",
            "I hope they don’t tone him down like they did with Nolan. I don’t really understand why they made the guardians of the globe do so much more damage to Nolan in the show.",
            "I thought u we’re stronger was kinda a let down so \n\nFingers crossed 🐱",
            "In the show they’re going to blast some cringey sad song over this scene just like how they did in S2 with Mark’s mental breakdown and Omni Man’s blackhole scene… and the scene where Allen got his ass beat.\n\nGod the music choices in this show are butt. And not only that, sad music isn’t always needed. That omni man scene wouldve been much more impactful if it was just ambient sounds of space.",
            "Viltrumites will have invaded us by that time..\n\nhttps://preview.redd.it/7k5kciuwzx7d1.png?width=1080&format=pjpg&auto=webp&s=53b52d398ada57b1b9947ae6f476f44aacab7ede",
            "Realistically what season would this happen in? 5 or 6?",
            "that sounds like way too few time",
            "Like Homelander if he was actually competent, which is somehow scarier.",
            "Kinda like Homelander, but with the opposite temperament.",
            "{spoiler) {spoiler} but {spoiler} {spoiler} {spoiler}",
            "Mark needed a fucking star, robot just helped him tank the star",
            "> Yeah, Thragg IIRC via Kirkman was said to be the strongest character in the verse Pre time skip and it’s relatively obvious off statements and feats alone.\n\nWait a sec... does that mean the ENTIRE image-verse? Including stuff like Spawn, Savage Dragon, Supreme, etc.",
            "Now I don't doubt that Ragnarrs couldn't injure or kill Conquest, but he was still experiencing the aftereffects of the scourge virus when he was sent to Savage Planet to take care of the job that Nolan failed to do. Pretty sure the only Viltrumites that could take on and out Ragnarrs toe to toe are Thragg, Conquest, and Nolan. Also, that scene where Thragg literally oneshots a bunch of Ragnarrs was years after the Viltrumite War where he drastically gained stregth.",
            "Invincible War is a small taste of what the Viltrumite will LOOK like",
            "Freddie Mercury vs J.Jonah Jameson",
            "https://preview.redd.it/wp8dgijziy7d1.jpeg?width=750&format=pjpg&auto=webp&s=09d7b8a9c60eb55e1fff9fe02edb20662a51eaa4",
            "*insert Conquest \"ARE YOU CRAZY?!?\"*",
            "I feel like his strength cannot be measured or compared against someone like Nolan or any viltrumite. Thragg might be off the charts with how easily he pummels Mark and Nolan in space",
            "The one who voiced DCEU Darkseid",
            "https://preview.redd.it/0nv5gv8c208d1.jpeg?width=750&format=pjpg&auto=webp&s=fd477dc30ac3f93401cb53ce11465b4563556f1d\n\nOp in fact",
            "That was likely done for dramatic effects. We already saw how Nolan no-diffed the Immortal in an alternate universe and I just can't visualize how he'd struggle with the rest of the OG Guardians.",
            "With knowledge of the attack a few minutes beforehand thru mark the guardians managed to defeat Nolan p handily in the comics so I don’t think he was THAT toned down.",
            "“Ambient sounds of space” lol",
            "What are you smoking lol. The song choices last season were great.",
            "Well, it's a good thing everyone agrees that your opinion is trash",
            "1)Educate yourself on how animated shows work.\n\n2)I have a playlist, 44 of the songs are purely from the Invincible series. For context, there are only around 54 songs that have ever been used in the animated series.\n\n3)Never let yourself cook",
            "everyone's entitled to an opinion, but you shouldn't be.",
            "Awful take. Don't eat dinner tonight.",
            "[deleted]",
            "Can I just point out how fucking LARGE thraggs hands are lmfao",
            "I think 5 would be appropriate just because it should be around 10 seasons if they’re trynna explain the end arc when mark is the big man",
            "Honestly I could see it sometime in season 4… maybe the END of season 4, but sometime",
            "Ooooouu I loved that part",
            "I guess only invincible universe",
            "Yes, when they crossover. The higher archery puts them lower than thragg. \n\nThis might not apply to the gods, and different spawn forms.",
            "Bro doesn’t know black holes and planets make noise 💀",
            "Bold and Thrash",
            "Bro admitted to listening to garbage",
            "Nothing you say will change my mind. The show would be so much more raw without half of the music choices",
            "Holy shit Thragg is a Street Fighter character??????",
            "Grand Regent “Kawhi” Thragg",
            "Don’t spoil it!",
            "Spawn is part of the invincible universe tho",
            "Bro doesn't know sound can't travel in the vacuum of space 💀💀💀",
            "And through what medium are the sound waves travelling lol?",
            "Bro apparently missed the day in science class where they explained sound can't travel in a vacuum",
            "Not a nice noise lol",
            "Not sure if anyone wants to listen to an annoying celestial hum in the background of all the space dialogue...",
            "L take nerd",
            "Thinking something is trash only because you dislike it is very childish. Take another L.",
            " Bro loses and chooses to keep losing",
            "Space Zangief",
            "Yeah I know but I mean I would imagine the statement only implies to invincible characters",
            "in what reality does superheroes exist? Yeah.. its fiction. So give me those juicy space sounds.",
            "i would love to. Sets the scene and is much better than hearing some billie eilish esque music",
            "In the first season we see Allen the alien talking with mark trough his thoughts because they literally can’t talk out in space….",
            "Just take your well deserved L and move on. You showed how lacking you are in this topic"
        ]
    }
}