{
    "Show your Homescreen/Lockscren /Control Settings iOS Thread": {
        "title": "Show your Homescreen/Lockscren /Control Settings iOS Thread",
        "score": 0,
        "url": "https://www.reddit.com/r/ios/comments/1dl2amt/show_your_homescreenlockscren_control_settings/",
        "content": "Welcome to the weekly Show your Homescreen/Lockscren /Control Settings iOS support thread for /r/iOS. [Join our partnered Discord server!](https://discord.gg/iphone)\n\n**Note: Comments are sorted by /new for your convenience.**",
        "num_comments": 3,
        "comments": [
            "https://preview.redd.it/9j37sc4x0x7d1.jpeg?width=1290&format=pjpg&auto=webp&s=b3f67c9a0ec1d6437280bf7d39039f5ebc941756",
            "https://preview.redd.it/umqbff3p1x7d1.png?width=1242&format=png&auto=webp&s=f5f03cd46567287e832f7172dcfddd7f0686dddb",
            "[My DnD setup](https://i.imgur.com/HFVwYXP.jpeg)"
        ]
    },
    "Weekly iOS Battery Support Megathread": {
        "title": "Weekly iOS Battery Support Megathread",
        "score": 5,
        "url": "https://www.reddit.com/r/ios/comments/1dh3jff/weekly_ios_battery_support_megathread/",
        "content": " \n\n**General advice for those concerned about their battery from the Support FAQ Wiki:**\n\n**Battery health**\n\nBattery health depends on usage and a variety of other factors. It is normal to see a decrease in battery health by 7-10% per year, resulting in a battery health of 80-85% after 2 years. This number can fluctuate, remain the same, or decrease quickly over a small period and should not cause undue concern.\n\nApple recommend battery replacement when your device falls below 80% battery health if you notice reduced battery life. If it falls below 80% within the first year you may be eligable for a free battery replacement. It fails after your warranty, it's a $69-$89 USD replacement cost for a battery. Contact Apple Support [here](https://getsupport.apple.com/solutions).\n\nYou can find more information about battery health and performance from Apple [here](https://support.apple.com/en-gb/HT208387).\n\nYou can check the cycles count with [Coconut Battery for Mac](https://coconut-flavour.com/coconutbattery/) or [iCopyBot for Windows](https://www.icopybot.com/download.htm).\n\n​\n\n**Battery life**\n\nIssues relating to battery life can be categorised in three ways:\n\n1. Normal battery life that is to be expected due to use\n2. Reduced battery life caused by a recent update, iOS indexing, an iOS bug, or a third-party application\n3. Reduced battery life, or other abnormalities such as overheating or sudden power-off, caused by device or battery aging\n\nIf you experience issues with your battery:\n\n1. Check your battery health. If it is below 80% or you are experiencing issues you suspect are related to device or battery age, see [Apple Support](https://support.apple.com/).\n2. If you have a new or recently updated/restored device, wait a number of days for background process to complete. If you continue to have issues, wait for a further iOS update. If you are on iOS Beta, you can expect to have a decreased battery life.\n3. Review the advice below on [maximising battery life](https://www.apple.com/uk/batteries/maximizing-performance)\n4. Consider restoring your device.\n5. If issues persist, contact [Apple Support](https://support.apple.com/).\n\n​\n\n[Maximising battery life](https://www.apple.com/uk/batteries/maximizing-performance) \\- the amount of time your device runs before it needs to be recharged.\n\n* Use low power mode (This reduces mail fetch, turns off background app refresh and increases the auto lock timer)\n* Remove apps from background app refresh\n* Ensure auto lock is on\n* Turn off auto brightness and manually reduce brightness\n* Use dark mode if your device has an OLED display\n* Clearing background apps from the app switcher does not improve battery life\n\n​\n\n[Maximising battery lifespan](https://www.apple.com/uk/batteries/maximizing-performance/) \\- the amount of time your battery lasts until it needs to be replaced.\n\n* Avoid extreme temperatures\n* If you notice that your iPhone gets hot when charging, remove it from its case\n* Store your iPhone in a cool place, switched off, and half-charged if not using it for long periods - and charge it every 6 months when in storage",
        "num_comments": 6,
        "comments": [
            "https://preview.redd.it/wi2ikhmhix6d1.jpeg?width=945&format=pjpg&auto=webp&s=938a5866058fb9697312f9d6bcd3bbc8d750edac\n\nis this normal? My Active Screen Time is estimated 6hrs and yet the battery is 39% percent already. Last charged to 100% on June 15 (10:10 PM), then it is already 39% on June 16 (8:24 PM). iOs is 17.3.1, and I activated this new device on June 15.\n\nFeatures are off such as Always on Display and other settings like Background App Refresh, Location Services, and even limit it to 60 hz. I only do social media scrolling, safari browsing searching about this issue, and exploring settings.",
            "I’ve disabled Find My and location services. Why does it continue to drain my battery when my phone is on standby?\n\nhttps://i.imgur.com/KTbncaR.jpeg",
            "Tips to save battery and fix the issue with the clock not working.\n\nTurn off: \n1)Auto brightness (this feature uses ALL the time the sensors of the device resulting to all time active sensors, even when the screen is off and this drains the battery faster)\n2)True tone (optional), (same as auto brightness it just uses the sensors but only when the screen is active)\n3)System services (location services), turn ALL off except these 3 ones 1) Emergency Calls - SOS, 2) Find iPhone, 3) Mobile-Wireless Networks (optional, i suggest leaving it on if you have airtags). ALL the other turn them off they are just DRAINING battery, and Important locations and delete the history too (optional), because this records all your locations and saves them there wherever you go, and lastly on the \"Product Improvement\" section turn all 3 off, and one optional setting to turn on, is Status Icon that whenever a service uses the location services you will see an indicator at top left or dynamic island.\nIf you dont care about location services just turn them off, and of course check which apps use your location.\n4)Siri And Search, all the toggles that are on turn them OFF, and if you scroll down you will see all the apps and if you press them there are a bunch of turned on toggles that i HIGHLY suggest you turn them all of them for all the apps. Just unnecessary battery draining.\n5)Analytics and improvements, no need to explain why this has to be turned off, battery draining sending diagnostics to apple, turn it off. \n6)Background refresh: Just turn it off, it runs apps on the background using your battery.\n7)Apps Detection (the section below the location services), no just no, who wants their activity to be watched? Turn off the asking so all the requests will be automatic denied and turn off the access on the apps that you have let (OPTIONAL)\n8)Movement and sport: It tracks your every movement and this is battery draining (optional but i have it off)\n9)Sensor data and use in research: just battery draining , turn it off. \n10)Airplay and handoff, if you dont have other iPhone to your iCloud or apple vision pro or homepod turn all the toggles off, now about the auto airplay, if you have tv or device with airplay leave it to question, otherwise turn it off. \n11)Standby (optional), it just heats up your phone while charging and this will cause faster wear to your battery. \n12)AOD (Always On Display), if you dont use it turn it off.\n13)Keybord Haptics, (optional) yes it may feel good but it will drain your battery faster. Same with haptics. \n14)Mail Push: if you dont use mail just do these: Settings > Mail > Accounts > New Data > Push=OFF > Transfer=Manually > iCloud and all other options set to Manually. \n15)Optimized Charging (not 80% limit), this thing to work need GPS services. It needs 1) Important Locations 2)System Customization. The batteries are SMARTER than us. Battery wont overcharge. And by default your device will automatically will slow down its charging after it reaches to 80% and after it reaches 100% it wont take any power, and no using high wattage wont ruin your battery because the battery draw how much power it needs, the thing that are the battery worse enemy is high temperatures (More than 35° Celsius) and this also lowers the bh. \n16) Charge it without case\n17)Do not use it while it charges if its possible\n18)Avoid MagSafe Charging especially with Case On. \n19)Attention Aware Features, it uses the sensors while you use the iPhone, which will drain your battery\n20)Auto-Lock, set it to 30 seconds, if its not convinient set it to 1 min, avoid leaving your screen too much time on, and also avoid, high times until auto lock or never to auto lock.\n\nThings to turn ON: \n1)Dark Mode (FOR OLED PANELS for iPhone 12 and later models, and XS and XS MAX too.) \nLow power mode when the battery is low. \n\nHow to fix clock issue: \nTurn off attention Aware Features, because if you put your iPhone with the screen down, the sensors will think that your device is in dark place and with that way the clock alarm will either not play or play at low volumes. And even if the screen is looking up if the room is dark its the same. \n\nFor iOS 17.",
            "Disabling Bluetooth fixed it"
        ]
    },
    "Apple Intelligence Features Not Coming to Europe at Launch Due to DMA": {
        "title": "Apple Intelligence Features Not Coming to Europe at Launch Due to DMA",
        "score": 456,
        "url": "https://www.macrumors.com/2024/06/21/apple-intelligence-europe-delay/",
        "content": "",
        "num_comments": 235,
        "comments": [
            "Basically all the exciting features…",
            "At least we can make our icons ugly",
            "How is iPhone Mirroring mixed together with Apple Intelligence? That's really the main feature I was looking forward to",
            "So is the UK getting it? The article mentions European customers but also the EU….",
            "Could somebody explain to me how iPhone mirroring has _anything_ to do with the DMA? That doesn't make the tiniest bit of sense to me",
            "Post is misleading. The article states European Union. Non member ~~EU~~ countries aren’t included.",
            "Apple is seemingly trying to guilt the EU here but it’s kinda smells like bogus. Not having iPhone Mirror or screen sharing improvements feels very suspicious as for the others, Apple Intelligence is only for US English at launch. Sure, you can (and many do) set your iPhone to US English while in the EU but the absolute majority doesn’t. \n\nSo it was features not coming to most anyways and now they are trying to shift the blame to the EU. Easy to see through and quite silly if you ask me.",
            "so next beta, on monday, which will already have the iphone mirroring working, does this mean they will have different betas for EU developers?\n\nThere were already limited incentives for developers to adopt the new features of IOS 18 due to the significantly reduced device compatibility list. Removing support for 27 countries further diminishes its appeal, making it unlikely that developers will put in the resources to build upon this just for the USA market and for such a limited number of devices, so everybody will be affected by this, not just EU users.",
            "Europe or European Union? (Genuine question as I’m in Europe but not EU)",
            "Due to DMA? Due to the fact Apple cannot manage this properly. Current AppStore thing from Apple do not comply with the DMA, and they know it. This seems just punishment and laziness.",
            "So what’s actually *left* in iOS 18? The way they described Apple Intelligence at WWDC it touches basically every aspect of the OS, so does that mean we’re getting absolutely nothing in Europe?",
            "All the people who pumped the stock for this bs…",
            "Guys, they said at Launch? Europe will get it, just later",
            "I'm from the EU and I support this decision, even though it affects me. DMA and other EU BS laws were invented especially in the past legislature by MPs (Members of the EU Parliament) for reasons that they could not fully understand. The same with EU laws on environment (EU Green deal a.o.) that will now be reopen for further analysis and possible changes in the new legislature.\n\nAs an iphone user that has credit cards, debit cards, payment options and a lot of other sensitive information om my phone I just want to have a secure OS and a secure UX. This is the reason I went with Apple. I don't want sensitive information to be available to ALL apps (cause EU wants so). I want these information to bbe \"seen\" only by Apple, so if a data breach occurs, I can narrow down the \"culprit\". And I guess here are others like me...",
            "Vaffanculo!",
            "Not a fan of AI so good for me 😅",
            "so your telling me to buy my next iphone from europe",
            "So will this be available in the UK? Not being in the eu now",
            "Is Apple Intelligence, which requires an iPhone 15 Pro or Pro Ultra a requirement for the Siri improvements? Couldn’t find this anywhere",
            "So why do I want iOS 18?",
            "Europe or EU?",
            "Can someone tell me please. When EU made Apple allow installing apps outside of App Store on iPhone, did that also come to the UK?",
            "👏🏼",
            "So, how do I get the US update in Europe?",
            "Bit of a shame, but this’ll only really impact a teeny tiny subset of iPhone users; namely those whose phones would support Apple Intelligence in the first place.",
            "And why is mirroring allowed only from iPhone to Mac/Apple TV by dma?",
            "What does this mean,only miroring is not going to be allowed or all new siri features?like gpt and on device processing?",
            "I've always been pro-latest-tech. But this AI thing (especially the integration with ChatGPT) may have many reluctant on upgrading their iphones",
            "F the EU",
            "I don't understand why they're not allowing the iPhone mirroring. I already use another app to view peoples iPhones and iPads to help them out remotely. How come those apps are allowed but Apple's version isn't?",
            "Man fuck the EU",
            "Fuck the EU",
            "Not even iPhone mirroring in\nthe EU. \n\nEU is good at overregulating but bad at anything else.",
            "Why the eff can’t I have an opt-in for this. Let me take the data privacy or whatever the eff risk!",
            "Thanks EU for protecting us!",
            "OK. I'll buy Samsung next.",
            "This is the best news I have heard today. Now I can safely upgrade to the new versions without worrying about this AI-shit.\n\nBut seriously. Apple now says it isn't rolling out AI, iPhone mirroring, etc. because they \"fear\" consequences from the DMA. As if they bothered about it in the past. Lmao. No, it's just a revenge from Apple being forced by the EU for accepting third party app stores, etc.",
            "So who will get these features? EU no, China no...",
            "Honest question. How much market share does Apple have in the EU? I suspect it’s much less than EU folks think it is.",
            "Classic",
            "https://preview.redd.it/6rhpwtac138d1.jpeg?width=1170&format=pjpg&auto=webp&s=ef4c43c7cff6d5020302da72697ad817860ec605\n\nWith 30% of Apple revenue, you'll bet that it'll work in the EU on release.",
            "Hopefully the EU will fall someday. It’s time the USA intervenes and ends the EU to free the countries from it. Make Germany here or the other countries into US colonies to prevent any new EU from coming up after that.",
            "man, apple cannot be more childish… give them back the lightning port so they stop crying",
            "Fuck apple",
            "Sound unpleasant at first but at least some global force is carrying about private Data. \n\nEU shall tame the tech-bros!",
            "Apple thinks they can undermine EU law like this.  No chance.",
            "Bullshit. They're just trying to spur people on against the EU.",
            "Good. I don't wanna be a guinea pig for AI technologies, nor do I want my personal computers to record all of my activities either locally or on someone's cloud.",
            "Classic Europe lmao they don't get anything good because of their shitty rules. America #1",
            "They gonna comply or they gonna bankrupt eventually. \n\nGood luck with withdrawing from EU market xD",
            "They won’t take too long.\n\nDiscriminating against EU citizens by not offering functionality is prohibited under EU law. Thats why you can’t just block EU customers, you have to update your product to comply or remove from all global markets.\n\nIf Apple drags their feet too long they’ll open an investigation and want to see why, and that could put Apple’s IP secrets in public view, something they don’t want.",
            "Downgrading iOS 18 to iOS 17.8. ",
            "[removed]",
            "Sorry EU law prohibits ugly icons.",
            "Lol",
            "You will still get it but you have to use an actual physical mirror placed beside your computer with your iPhone propped up behind you",
            "Does this mean they will remove side car functionality as well? SHould be the same under the gatekeeper thing, the purpose is to prevent apple from having features that only work with other Apple products right? This is nonsense.",
            "So iPhone mirroring isn’t coming to eu?",
            "My assumption is, that the argument is simply: if iPhone can do it, other phones should be able to do it, too.\n\nAnd at heart I think this is a good thing. It would be great for these kind of features to be implemented in an API-style fashion that others could use.\n\nHowever, in reality this argument is probably too much to ask for some features (like mirroring) and it would be a shame, if features would be removed because of this line of thinking.",
            "It is not. However apple would have to open this Feature to other apps. Just like the 3rd party app stores or the option to choose the mail/browser app",
            "Just use Vysor for screen mirroring to PC and Mac. The drawback is the free version only supports 720p mirroring, but it works pretty well with iOS 17.",
            "It’s funny to see how some guys from the EU complain about a missing feature being locked because of their region and without any  “logical” reason. \n\nLook, in my country we don’t have Visual Lookup (that thing that when you take a picture, you can see the type of the animal, labels of the laundry, type of plant/tree) \n\nAnd we don’t have advanced Spotlight search (that thing when you look for an app directly from your iPhone’s Spotlight and install it without having to enter the App Store) \n\nI get it, it’s frustrating. But keep in mind WWDC and any Apple event is targeted to the USA. Not the entire world and that’s why the small asterisks exist. “Some features are available depending on your device or region” \n\nIn my country we don’t have any laws or restrictions that would affect Apple but we don’t get those software features. And that’s okay. Live with it (or… without it :) ) \n\nThat said, luckily I don’t live in the EU so I’m gonna be enjoying iPhone notifications on Mac and iPhone mirroring.",
            "Yep UK will get it. Probably the only positive about brexit :/",
            "Yes. We are. The article was written by someone who assumes that Europe = EU.",
            "Use of Private APIs. Doing so would force apple to give the same access to other vendors, which could open up security holes. Same with the screen sharing/control. Apple doesn’t want to deal with the red tape and possible legal ramifications of the DMA",
            "Because they have to allow third parties to use these new APIs, for example on device processing for other AIs or an “open source” version of screen mirroring.\n\nThey are even getting investigated for the Apple Watch because it’s not compatible with other phones.\n\nNothing but lobby trash and government overreach",
            "Article headline is misleading as the quote from apple sates EU",
            "How about Norway?",
            "There’s no such thing as a non member EU country. Either you’re one of the 27 members of the EU or you’re not.\n\nEdit: comment above me was edited but originally referred to EU countries that are not members of the EU, n which isn’t a thing, hence my reply.",
            "The EU has a law that says if Apple want to allow mirroring of iPhone to macOS via secure handshake that they’d also have to then allow access to any other os and device too and develop and open API for it. \n\nApple don’t want to for security. So they can’t release the feature because of the EU law. Simple. \n\nEU can’t get any features anymore where Apple gatekeep access to anything. So sold private cloud compute? Nope. ChatGPT via Siri? Nope. Apple only local AI? Nope. \n\nNext I expect them to not release Apple Watch 10 in the EU because it only works with iPhone and that’s illegal too…\n\nI mean it sticks but the law is the law. Can’t have someone like Sony making an App Store for PlayStation and nobody else being allowed… oh wait no you can because Sony yeah. No I don’t get it.",
            "No iPhone mirroring is bs. There already is screen mirroring ONLY for apple devices",
            "Just switch region on your apple id?",
            "i guess European union",
            "You should get it",
            "It’s a matter of law so it’s EU",
            "If they provide such features, Google could immediately sue to demand android mirroring APIs or Gemini Nano APIs to replace Siri.  The same way they’re currently being investigated for the Apple Watch.",
            "You’ll get the customization stuff.",
            "the vaccine entries in the wallet was also USA only at launch. EU got it towards the end of the pandemic, which was maybe 1.5 years later",
            "Yeah, but it just sucks as it's already getting released later than iOS 18 if Im not mistaken.",
            "Maybe. Trimmed down.",
            "iOS 19 at the earliest .",
            "Are people just now realising that maybe Apple had a point trying to not let the DMA/governments fuck with its customer's shit?",
            "They literally have a permission api built into the os already. That's how these features are locked to apple only.",
            "It is. Quite sadly so.",
            "ugly black icons",
            "Because it’s an upgrade over iOS 17 🤷‍♂️",
            "security updates…?",
            "Didn’t uk vote themselves out of the EU lol.",
            "No, apparently the only good thing to come from leaving the EU, is us not losing features going forward. However I do believe the UK are in talks about a version of the DMA. So maybe we too will end up losing Apple Intelligence but gaining third party stores. For me personally though, I’d rather have Apple Intelligence over third party stores.",
            "Not yet. We did have retained and some future EU legislation rolled into ours but the DMA was not one. Unfortunately, we did have our own DMA in the works and I can’t see Labour not carrying that on once they enter.",
            "I doubt you can, just like you can’t get the EU update for third party stores in the US. They use a few tricks so that it can’t be fooled via VPN’s etc. I just can’t remember what it was they use to geofence it.",
            "What do you use? I spend a lot of time trying help elderly people using ipads and iphones.",
            "iPhone Mirroring is only native to Apple devices which violates DMA's interoperability requirements.",
            "You can opt in or out of Apple Intelligence (unless you’re in Europe) it’s not about data privacy, it’s about the DMA vague rules and requests. For instance iPhone mirroring breaks the DMA because it only works with Apple products, Apple intelligence will need work before it gets to the EU because if it learns to prioritise Apple’s services like Mail, Music etc, it then breaks the digital marketing act and pulls a hefty fine. To be honest it wasn’t coming to Europe or any country until a later date, only supporting English US to begin with.",
            "Yeah, because a room of executives and board of directors care about \"revenge\", nice projection 🙄",
            "“In the first quarter of 2024, Apple obtained 25 percent of the European smartphone market based on shipments. Historically have Apple's sales been very cyclical, peaking in the fourth quarter each year.” - [Satista.com](https://www.statista.com/statistics/1232268/apple-smartphone-market-share-in-europe/#:~:text=In%20the%20first%20quarter%20of,the%20fourth%20quarter%20each%20year)",
            "Weird though that arguably, when we see and verify it, the most private AI won’t be able to launch in the EU. So the EU will still have server side Siri. I mean… call that a win if you want. Less stress on Apple private cloud compute.",
            "Then buy a dumb phone.",
            "All your devices already do that",
            "If you have an iPhone or a device running Android, then they already do that.",
            "\nYou think the people are enthusiastic because they don’t understand what they’re giving up. We’re enthusiastic because we know how locked down and secure some of these things are.  \n\nThe less people know about how these work, the more they spout randomness about how they think they work. The windows recall system has been pushed to “maybe someday if it’s secure” because the enthusiast people looked at it and screamed that it’s bad and needs redone entirely.\n\nThe new Apple system is the most private version of these that has ever been shown to the public. To the point that some people barely believed it when announced because nobody else has thought of some of the security features until now. But now customers are demanding OpenAI and Google implement some of these lockdowns.",
            "Welp. Our kids don’t know what an active shooter is. \n\nHealthcare. \n\nSeparation of church and state \n\nDecent public transport \n\nReal freedom. \n\nThe list goes on and on…",
            "*<cries over my sideloaded apps>*",
            "Apple bankrupt?? Yeah okay keep dreaming. It’s nice to dream from time to time.",
            "The EU is only 8-10% of their revenue. There is no way they’re going to open iPhone mirroring etc to support Samsung, Google and the hundreds of other Android OEM’s 😂",
            "Maybe so, but in practice that’ll still mean they could keep dragging their feet for *years*. These “investigations” take forever and are mostly a joke anyway.",
            "Apple would welcome the move to proceed to investigate them for not releasing a feature; because they’d then use that as a legal defence of that same feature going forward. The EU would be forced to declare the feature as compliant with DMA to proceed down that route. \n\nAnd they’re not DMA compliant. So they’re not legal in the EU. So the EU won’t say they are and so can’t press for them to be released. \n\nApple made a secure API between iOS and macOS for notification mirroring and remote screen access and it doesn’t work with windows or Linux or any other provider. Nobody else can use it. It’s baked in to the OS. Private, secure, locked down. That’s against EU law. They’d be forced to open it up to Microsoft and everyone in the EU. They don’t want to. So they won’t I guess.",
            "That's...... never mind bro",
            "Common EU W",
            "*We think you're gonna love it*",
            "It’s quite different from sidecar, but even then it seems like they are restricting it to newer phones for no reason other than to entice people to upgrade ",
            "Just read the article, please don’t downvote me.\n\nI didn’t like eu before and this made me dislike it even more.",
            "IMO it’s stupid that any one consumer tech company should support third party products. It’s probably not forbidden by Apple to release an app like that for Android, right? I imagine there would be no issues with syncing notifications or remote control of Androids.",
            "We have a dozen standard apis and protocols for mirroring. We've had them for 40 years now. Being interoperable just doesn't make money.",
            "Use [https://github.com/Genymobile/scrcpy](https://github.com/Genymobile/scrcpy)",
            "Does that work remotely? Because I need to fix my grandma’s phone every now and then",
            "> And we don’t have advanced Spotlight search (that thing when you look for an app directly from your iPhone’s Spotlight and install it without having to enter the App Store)\n\nThis is one of the best features they ever introduced",
            "You got a source? I want to make sure before I start apologising to this guy I’ve been ripping into for the last 4 years.",
            "I wouldn’t be surprised if it’s just North America to start with. Might get it working if we switch to English (US)",
            "My thoughts exactly - the single positive from Brexit!",
            "It’s insane to think about even today. What the hell happened there man …",
            "But how is this any different from let's say AirDrop? Or the complete NFC interface of iPhones? Those features are extremely locked down and only usable by first party apps or have such high hurdles that basically no third party app uses them",
            "Isn’t universal control the same?",
            ">Doing so would force apple to give the same access to other vendors, which could open up security holes\n\nThat is not true. The DMA has a clause which allows gatekeepers to keep an API private if it would cause security problems.\n\nAlso, opening up the API would not be a security risk as long as the key generation is still handled by the OS. The only difference would be that the key would be shared with the other device through the third party app using the API, instead of through iCloud.\n\nBut that would not be more of a security risk than Apple's current implementation already is. A local administrator/virus on a Mac can already read the key and transfer it to another system, which could then hijack the connection and imitate the other Mac to control the iPhone. So letting the key be handled by a third party app would not be less secure. Though to be clear, the attacker would need local access to the Mac and be physical close by to the iPhone for this attack to work.",
            ">They are even getting investigated for the Apple Watch because it’s not compatible with other phones.\n\nThat's not the EU doing that. That investigation is handled by the US DOJ.",
            "Headline says Europe. Norway, Switzerland, Iceland and the UK is Europe, but not EU.",
            "What are you talking about??",
            "Are people opposed to opening up the playstation app store?",
            "Isn’t screen mirroring already working on other phones?",
            "No. Sharing your iPhone screen only to Mac and Apple TV is already a thing. This is bs",
            "They’ve had functions in these devices for a while that actually check gps location and bind to that, not the Apple Account’s location. \n\nAnd no a VPN won’t do anything, because VPNs are for external servers to not know where your phone is.. not to trick your phone into not knowing where it is.",
            "The allow other store feature, exclusive to EU, doesn't work if you change region, it actively checks the location to make sure. Might be the case here.",
            ">Google could immediately sue to demand android mirroring APIs or Gemini Nano APIs to replace Siri\n\nThat is simply not true. Google already has the ability to create an App for the Mac allowing mirroring of Android devices. Therefor, they would have no grounds to sue in this regard.\n\nIn regards to Gemini Nano. Apple does allow third parties to integrate their own AI, a integration for Gemini is already announced.",
            "I think the customization stuff is kinda lame and the new control Centre actually just annoys me",
            "Thanks for your feedback. No clue why you are being downvoted. Siri is quite bad compared to Google Assistant. Will be getting an iPhone 14 as a corporate device soon (currently on an iPhone 12) and would really have liked some Siri improvements",
            "and even uglier tinted icons.",
            "God no!",
            "What’s new except Apple intelligence stuff?",
            "17 will get those too.   I say this as someone who will be running 18 in July.",
            "Wouldn’t be possible to go to a non-EU country and update iOS from there? Surely it’s less expensive than going to the US, as there are some countries here and there in Europe outside of the EU.",
            "Splashtop SOS. It lets you view an iPhone or Android screen (no control) and full control of Mac or Windows.",
            "Mirroring your iPhone screen to Apple TV and Mac only is already a thing. This is bullshit",
            "What a bullshit. I think that’s ridiculous. It’s like forcing TV ads to say “hey, you don’t have to buy our product, there are a lot of other alternatives too! Here’s a list:”.",
            "Healthcare? Please stop saying healthcare, there are countries in EU where healthcare is worsening day after day.",
            "Yawn 🥱 \n\nCome at me when you guys learn how to make bbq.",
            "25",
            "It’s not the EU’s position to declare a feature compliant only non compliant. There’s no certification.",
            "read this in tim cook's voice.",
            "How is that different? I don’t understand what privacy issues coming from the EU regulation could affect this feature. You can do this with android and windows in the EU, I can mirrir my pihone or my mac to my apple tv, just can’y control it. What is the difference? this is very frustrating. Hopefully setting region to USA and use a VPN will enable it",
            "I’m aware of this project. But I thought it was Android only.",
            "No, it only supports mirroring via cable.",
            "Shouldn’t need a source. DMA came after Brexit, it is not part of UK law.",
            "I hope it’s not AppStore region dependent. But sideloading already is.",
            "It isn’t, that’s the point. Just like iMessage isn’t regulated under DMA, as it is not considered a gatekeeper. It’s just Apple bullshitting it’s uninformed customers and trying to stir things up. Let’s see how the EU reacts.",
            "They were released before DMA.",
            "Norway, Iceland and Switzerland are still under EU regulations. I don’t know how this will affect them.",
            "Usually when people talk about EU in this context they mean European Union not Europe itself",
            "All the countries outside the EU were deleted from the world. So either you’re living in one of the EU countries or… you’re dead or something.\n\nThere’s no such thing as a non-EU member country anymore, according to him.\n\nDidn’t you get the memo?",
            "Sony are. And thus far only Apple has been targeted. Not Sony or Microsoft or Nintendo for the sane thing. This whole “don’t tell me what I can do with my own device” stops at companies that can remotely ban the whole device from using any online service, install protective measures that prevent components being swapped out ands prevent you from using any software that isn’t sourced from them. Sounds a lot like iPhone no? But who cares? I don’t see posts about it or fines or investigations in the news or anything. \n\nYou can’t publish an Xbox app without Microsoft saying so, and can’t sell it without Microsoft taking a 30% cut.\n\nRight now it just looks like singling out Apple probably because someone slept with someone’s wife. Until my consoles can do whatever I want with them and the cost as much as a PC as a result; I won’t be happy\n\nEdit; I guess you meant consumers. Then no, nobody is against it. But EU target Apple where there are people against forcing a company to open up parts of the platform which make it secure. \n\nPeople don’t do super personal stuff on a game console. Make that open I’d celebrate. Force more open APIs on my device with all my life secrets? No thanks I’m fine locked in. I really am. If I don’t like it I’ll switch device. \n\nI can’t switch from Ps to Xbox without loss. I can’t switch from Xbox to switch without loss. Force those companies to have no edge over the others",
            "Secure notification mirroring and remote access with a locked screen. Maybe. The DMA doesn’t need the feature to be available to **another phone**. The DMA needs the feature on iPhone to work with devices other than just macOS or Apple gatekeeper devices",
            "No it’s not. I can share my screen to other devices. I can share it to my TV and I don’t have an Apple TV box in this house. Don’t need one. What I can’t do is this new notification mirroring and remote screen access whilst the phone stays locked. That’s different.\n\nPlus the EU won’t go after Apple with DMA for such an obscure feature like simply casting your screen. Too many defences like the open availability to implement AirPlay 2, and the availability of competing apps which enable this feature anyway\n\nI had a reply but it’s gone: you very much can share your screen to a non Apple device from iPhone. Not only is AirPlay 2 implementable by other manufacturers (see LG WebOS TV’s) but there are 3rd party apps that can do this plain mirror. But **not** remote control with locked screen.",
            "This feature is quite a bit more than just screen *mirroring*.\n\nFor one thing, it works with a locked iPhone. Is there an Android app that can do that?",
            "Isn’t it the other way round? They’d need to allow iPhone to mirror to windows and Linux etc. iPhone is the host in this case. \n\nI thought that’s why they were holding back because the notification sync and mirror is macOS only.",
            "> the new control Centre actually just annoys me\n\nHow does other people having the option to customise it, and having the option to put third-party apps there, annoy you. You are free to leave it exactly the way it was in iOS 17 if you want. I don't get redditors bitching sometimes man",
            "Tim cooked.",
            "If you’re in Europe you wouldn’t have gotten them anyway with this news",
            "Non-updated icons drop paint on existing icons.  It’s now/soon a requirement for app devs to offer easy-tinted apps in their future app updates, the same way they have to provide all the sizes. \n\nYou’re judging them based on the “I’m just gonna make your icon ugly until you update”. \n\nhttps://www.threads.net/@justmedevin/post/C8aBaKly-BH/",
            "There’s a ton of stuff to the point where the keynote presentation was super fast paced to jam everything in. You can find the details on Apple’s website.",
            "iOS 18 is absolutely massive upgrade, Control Center redesign, Photos app redesign, icon theming and free positioning...",
            "No. Old iOS versions only get security updates for phones that don’t get iOS 18. always has been like that (except maybe 1-2 months after release of 18)",
            "I don’t think so. Here’s how they control 3rd party stores in Europe. It appears it’ll check your geolocation, so I imagine once you went back to you normal Apple ID it would disable the features. - here’s the [link](https://www.techradar.com/computing/software/no-third-party-iphone-app-stores-wont-work-outside-europe-even-with-a-vpn)",
            "I’m just going off articles. Calm your tits 🤡😂",
            "I know right.",
            "If that’s your only retort lol",
            "Have you got a source for that? My source - [here](https://world.hey.com/dhh/could-apple-leave-europe-76441933#:~:text=Well%2C%20Apple%20could%20quit%20Europe,8%2D10%25%20of%20revenue)",
            "Exactly. But if what this commenter is suggesting is true, and the EU can come after you for withholding a feature from EU users; then they’d only be able to do that for a feature which wasn’t against EU regulations and laws. \n\nSo they don’t certify, but if they were to try to fine you for not enabling a feature, the answer is to just enable the feature and use the fact that the EU itself demanded the feature as defence if it tried to investigate that feature for breaking DMA. \n\nYou want it, in its current form? You got it! \n\nCurrent form it breaks DMA so there’s no way they’d go after Apple for not enabling it in EU. EU just has to suck it up now. \n\nIt’s a free nice to have feature in each case. Apple make no extra money from it. So unless sales are impacted enough… or the EU backs down… and I see neither happening: EU just won’t get these features until maybe a year later at least when a secure open API is created for other platforms to integrate and use, not Apple’s own ones only.",
            "It’s different, the way DMA is written they’d need to allow anyone (any PC, App Store, computer in the world) to mirror your phone. They’d essentially need to give anyone access you your phone (not only you, while you’re signed into iCloud on both your devices, which makes it secure). Which opens up a huge can of worms in terms of security.",
            "Sidecar is not the same as the new iPhone mirroring. Different functionality ",
            "You must be joking right? What’s the purpose then",
            "Although the UK has just passed their DMCC bill in to law which could end up with the same issues for apple",
            "Uh, what could the EU possibly do here? It's not as if they can fine Apple for not releasing these features in Europe.",
            "How would you like the EU to react? Force them to offer services that they don’t want to? It’s always been very common for some services to be restricted in some parts of the world.",
            "I’m not in the EU, but all these examples would fall under ex post facto, no? Hence why it’s the new features not coming to the EU?",
            "Right, because a trillion dollar company would risk losing a ton shit of money and customers by not including these features just to stir things up over hurt feelings with the EU.",
            "Yes and no. They accept some thing. The recent iOS changes due to the EU did not affect those countries. They don't get third party app stores for example, so they could perhaps be unaffected by this.\n\nI believe they will be affected by this though as it's likely due to their corrupt AI laws.",
            "That’s not at all what I meant and I’m fairly sure you know that. The comment I replied to referred to non member EU countries, implying there were counties in the EU that weren’t members of the EU - which isn’t a thing, you’re either a member or you’re not.\n\nTurns out they’ve edited their comment as well.",
            "You can’t share any other device than apples to Apple TV or mac officially",
            "I am pretty sure Windows Phone Link with Samsung smartphones can do that. But it does not really matter when talking about the DMA. It is not apple blocking that functionality for other developers who want to program an Android to macOS screen mirroring",
            "Apple could also improve Siri without certain other aspects. The EU isn’t blocking Google Assistant improvements either.",
            "For me it’s all good with the icons and control center or photos today. Just hope that RCS is a worldwide launch and no US only.\nApple inteligente for me would be the biggest upgrade value.",
            "You’d think so, but the Photos app is redesigned by having Apple Intelligence integrated deeply into the code, so we’re not getting it. Siri? That’s basically the avatar for Apple Intelligence, so it’ll not get anything — possibly not even the new look. The control center’s neat but doesn’t actually add anything, and icons? Come on.\n\nAs for the other stuff:\n- reminders and calendar integration? *maybe* we’ll be able to see reminders in calendar, but none of the other features will work because, you guessed it, Apple Intelligence.\n- new calculator and math notes? Nope, Apple Intelligence.\n- call recording and transcripts? Nopeity-nope.\n- mail? Nope.\n- hiking trails? They were us-only for now anyway.\n- AirPods and hands-free Siri? Response-less Siri? Nope, that needs Apple Intelligence too.\n- the new reduce interruption focus? Nope.\n- priority notifications, hell nah.\n- type to Siri? Probably not.\n- health integration & journal? Probably not.\n- the assistive features for Apple TV? Needs the AI.\n- enhance dialogue? Nope.\n\n\n… which leaves us with:\n- “improved privacy”\n- Bluetooth functionality \n- maybe new text message features?\n- highlighting\n- game mode\n- passwords app\n- icons and control center\n- and anything they forgot to list at WWDC.\n\nThat’s… not a whole lot.\n\nAnd if all those features are actually available at launch (or at least concurrently with the U.S.), I’ll gladly eat my words.",
            "If Apple will ship normal iOS features to countries like Switzerland or UK, it might be doable (going on a trip, using a prepaid card and a fake address), but it's far from convenient. Then we have to see how much Apple checks GPS location afterwards. Time to move to Switzerland, I guess…",
            "It's the only one necessary. Europeans have shitty bbq and they also smell awful for some reason. I'm still investigating that so stay tuned.",
            "The burden to comply with all laws is on the company not the EU. If they conflict than the feature needs to be pulled from all markets, not just discrimination against EU citizens.\n\nApple isn’t stupid. They have a plan here.",
            "It depends on its content, and if it will even come into force. It's still TBD.",
            "They could probably just put out a statement saying it’s not in violation of the DMA(assuming it isn’t), and throw it back at Apple to justify the exclusion to their user base. I’m sure there’s going to be plenty more attempts like this by Apple",
            "I really don’t know and honestly you are totally right, I don’t see legal grounds to do so. But I don’t think the EU will idly sit there and take the blame. We will have to wait and see how it all plays out in the end, I guess this is only the first round of a long battle. A shame really.",
            "I mean it's in the company's interest to offer best product possible to be competitive on the market. IOS is currently lacking on AI features quite a bit. Siri is crap and missing AI image editing tools is quite visible now. Should Apple continue with cutting off features in the EU, it can begin to lose customers in the end. \n\nYou can push it only so much until it makes sense to switch to the alternative.",
            "Why would the eu intervene on apple shooting themselves in the foot? Malicious compliance is still compliance and only hurts apple's customers. Maybe this could be the wake-up call for a few apple owners to jump ship.",
            "Honestly I don’t know but I could see an angle where denying an extensive user base integral new features of your software based explicitly on regulations put in place by the EU that very possibly don’t apply here (especially mirroring) could at least down the road lead to an even closer look and fines for anti consumer behavior. But really that’s just pure speculation and I might totally in the wrong here! I just wish Apple wouldn’t try to bullshit us and bring stuff like mirroring to EU users.",
            "I am no expert in this but afaik only services big enough to be considered a gatekeeper are regulated and have to be opened up under EU DMA. I don’t see that applying in this case, neither before it even launches nor after it. Especially iPhone Mirroring or Screen Sharing. Apple Intelligence is a whole different story though imo.",
            "You completely misunderstood the comment you replied to. No one said anything about a country being in the EU while not being a member.\n\nAnd I just made a joke about it.",
            "On a locked *iPhone*.\n\nNo one is arguing that you can’t do it with Android, and that wouldn’t be an Apple violation of EU laws anyway.",
            "True, and yet here we are. (All the announced Siri improvements run on Apple Intelligence, possibly even the new look).",
            "Troll or the least ignorant American",
            "\nThere’s a list of Apple and Google and MS features which are region locked due to local laws longer than all my arms and legs. \n\nEU won’t do crap about just another feature which is blocked due to local laws. If they do; imagine the response to the EU trying to internationally block private local AI usage by people in USA. Hilarity would ensue, surely. \n\nThis game would play out for years. “Sorry we can’t enable the feature in the EU because we don’t have any servers for private cloud compute there yet”. \n\nIf the outcome of this is that Apple is forced to allow other AI cloud vendors to take over from Siri, or that Apple is forced to pull AI worldwide then I’ll eat my hat. I’ll bookmark this and video me eating my hat if it happens.",
            "Absolutely. Apple Inc. is the definition of petty.",
            "iPhone mirroring allows you access your iPhone when it is locked and nearby on your Mac, that feature requires T2 chip on the Mac. They don’t think it is secure for others have same level of access. \nUnless that is something can help them make more profit, Apple is unlikely to bring a new feature and make it comply with DMA. EU people may not get this feature at all considering most iPhone user uses a Windows laptop, losing this feature will not affect them getting an iPhone.",
            "Yep, no AI photo editing, no smart Siri, cutting off non DMCA features, I am grabbing a Samsung S25 or Google Pixel for sure after selling this trash 15 PM\n\nFirst time I tried an iPhone after having Google or Lg or Samsung phone, due to USB C adoption and I am already regretting it.\n\nEspecially lack of Norwegian translation and some other EU languages like it’s early 2010s. Meanwhile Samsung and Google had AI features for a year now and also works on older phones.",
            "Do you really think Apple's board would allow them to act against their self-interest? C'mon.",
            "Apple has already run the numbers. They make more money this way, and they don’t expect Europeans to stop buying iPhones just because they can’t use some features which they have never been able to use anyway.",
            "New features aren’t integral. You didn’t know you wanted them two weeks ago.\n\nIntegral would be like syncing or running apps at all.",
            "For real always tying to go the hard way instead of just cave in and comply to whatever it is that’s blocking the deal. Such a greedy stubborn company, one of the reasons I’ll make the switch to android when my iPhone gives up",
            "Thanks for the clarity.",
            "They literally used the term “non member EU country” implying they’re an EU country that is a non member, which doesn’t exist.",
            "If you look at the performance of the CPUs used in the iPhone 14 and 15, I can’t think of a good reason why they aren’t sufficient to release *most* of the new Intelligent features for these phones. They are capable enough. The main motivation will probably be to promote sales of Pro and Pro Ultra devices, which from Apple’s perspective makes sense.",
            "As an American, we don’t claim him. Disavowed.",
            "[removed]",
            "The EU can and will.\n\nAlso remember: EU law applies to the citizen not the country or region.  An EU citizen in the US is entitled to EU protections as if they were in the EU.\n\nThat’s why GDPR prompts don’t just use your IP to only prompt depending on your location.",
            "It's going to have the same problems, buddy.\n\n[https://www.theverge.com/2024/5/1/24146123/google-gemini-is-global-but-not-in-the-eu-or-uk](https://www.theverge.com/2024/5/1/24146123/google-gemini-is-global-but-not-in-the-eu-or-uk)",
            "Same here. My first iPhone ever (because USB C) and I know for sure I will eventually switch back to Android. It simply just doesn’t justify the price for the amount of missing features. \n\nOn the other hand it’s not EUs fault if Apple, unlike other phone manufacturers, chooses to block features for the European customers rather than up their game and find solutions. They try to pressure EU but they are like little bitches every time EU brings out new legislative proposals which affects them.",
            "What? Apple's shareholders interest is to make money. To multiply the revenue. And you won't get that by cutting off features and consequently losing your customers for not being competitive. \n\nIt's good thing to remind - Apple is not charity, nor it is one man's fight against EU. It's massive company which just wants to make money and there's quite some money in the EU customers pockets. And you won't get their money by offering subpar product.",
            "Or you know, you could blame the EU….",
            "And your Android phone will have the same problem, RIP\n\n[https://www.theverge.com/2024/5/1/24146123/google-gemini-is-global-but-not-in-the-eu-or-uk](https://www.theverge.com/2024/5/1/24146123/google-gemini-is-global-but-not-in-the-eu-or-uk)",
            "Countries that aren’t members of the EU.\n\nThey were correcting the wrong information in the title, and they’re correct.",
            "If you read the article, not releasing ai in Europe is not at all related to their technical capabilities.\n\nQuite apart from that, it seems like only the A17 Pro Chip matches the M-series for power, and since A17Pro/M1 is what it takes to run the SLMs on-device, older iPhones aren’t supported. Which admittedly sucks, but we’re not getting it in Europe regardless so it’s a moot point.\n\nWe don’t even know *if* Apple intelligence will release in Europe, let alone *when*.",
            "Tell me you never been to Europe without telling me you never been to Europe.",
            "Yep; which is why Apple ask you set your region on your device properly. So EU citizens in the USA can have access to alternate app stores by region, last time I checked, but I could stand to be corrected. \n\nSo anyone who is EU region will get alternate App Store wherever they are in the world. And no AI. Boom, solved. If the citizen lies then the citizen lies about their region. \n\nI have a hat picked out. It’s not gonna get eaten. EU will either get the feature as is after some delay or not at all. \n\n“Incremental international rollout”. That’s the excuse. Just like tap to cash, and all the other things. International incremental rollout. How long are they allowed to rollout for? Guess what the EU law doesn’t state that. Just as long as Apple say “yet”. \n\nUK still doesn’t have Apple Cash due to local finance laws. Even when it was an EU member state no shits were given. \n\nSo; my hat is staying in one piece.",
            "I’m in the EU and Chat with Gemini is available. The article is almost 2 months old to be fair. \n\nBack on the subject, is Apple Intelligence that incredible that we can’t do without for 6 months? It looks really cool on a Mac as it’s nicely integrated, but I’m gonna guess more people have iPhones than Macs.",
            "I don’t blame the EU because they already imposed Apple important changes like the type-C charger and alternative app markets. I believe that they know what they are doing but these companies always trying to bash heads for some more € gets me more upset then the strictness of EU",
            "For putting the customer first?",
            "Well fuck this wouldn’t slide for the consumer something will change in the meanwhile for sure",
            "And it read as EU countries that are not members (of the EU), which is why I even commented in the first place."
        ]
    },
    "Option to add a number row on top of the keyboard": {
        "title": "Option to add a number row on top of the keyboard",
        "score": 2,
        "url": "https://www.reddit.com/r/ios/comments/1dlunr5/option_to_add_a_number_row_on_top_of_the_keyboard/",
        "content": "Hello everyone,\n\nIt is all in the title, and I know what everybody -including Apple- thinks : « we don’t always type digits, so why bother add a number row for such a rare use ? »\n\nBut hear me out 😁\n\nLet’s consider the Arabic language. There are more or less 7 letters that cannot be pronounced in latin letters. \nNow let’s consider Arab countries: most of these got English and/or French as one of their official languages.\nHence they do not use the Arabic keyboard on daily basis. I know because I come from one of these countries.\nSo in order for one to be able to type in its dialect while using the English/French keyboard, we tend to replace these unpronounceable letters in digits, which make digits a part of almost every single word in a sentence.\n\nI am not asking for sticking the number row and forcing it on everyone. I just find it fair to give the end-user the option to enable or disable it. \nAnd it is not a lot of work to implement, because the iOS SDK has such feature already available for app developers (Waze, for instance, has a number row added to the keyboard to make it easier to type addresses). \n\nTo give some order of importance to this feature request, below some countries that I can think of, that would be interested in such a thing: \nTunisia 🇹🇳, Algeria 🇩🇿, Morocco 🇲🇦, Egypt 🇪🇬, Lebanon 🇱🇧 …\n\nIf you also think that feature request is legit, an upvote would be more than appreciated.\n\nThanks 😁",
        "num_comments": 0,
        "comments": []
    },
    "Is there a way to see when an app was re-downloaded most recently?": {
        "title": "Is there a way to see when an app was re-downloaded most recently?",
        "score": 1,
        "url": "https://www.reddit.com/r/ios/comments/1dlvig9/is_there_a_way_to_see_when_an_app_was/",
        "content": "I’m not talking about the purchase history, but instead if an app was deleted and then redownloaded, is there a way to see the most recent download date?",
        "num_comments": 0,
        "comments": []
    }
}