{
    "Welcome to /r/JapanTravelTips! If you're new to the subreddit, start here.": {
        "title": "Welcome to /r/JapanTravelTips! If you're new to the subreddit, start here.",
        "score": 70,
        "url": "https://www.reddit.com/r/JapanTravelTips/comments/19cfb5s/welcome_to_rjapantraveltips_if_youre_new_to_the/",
        "content": "Hello! Welcome! We are the sibling subreddit of /r/JapanTravel. While /r/JapanTravel is for detailed and researched posts, /r/JapanTravelTips is for more unstructured questions and advice. We welcome posts of (almost) all kinds, especially advice for fellow travelers and questions meant to generate discussion.\n\n**This subreddit is intended for questions and discussion about traveling _within_ Japan.** If you have more general travel questions about topics like flights/airfare/hotels/clothing/packing/etc., please direct those to subreddits such as /r/flights, /r/travel, /r/solotravel, /r/awardtravel, /r/onebag, /r/hotels, /r/airbnb, or similar (as applicable).\n\nIf you are just starting your Japan travel planning, make sure to check out /r/JapanTravel’s [wiki](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel/) and [resources page](https://www.reddit.com/r/JapanTravel/wiki/resources/). The wiki includes a bunch of information about common topics such as:\n\n* [Immigration and Customs](https://www.reddit.com/r/JapanTravel/wiki/advice/airportimmigration/)\n* [Internet/SIM Cards/Pocket WiFi](https://www.reddit.com/r/JapanTravel/wiki/advice/technology/internet/)\n* [Budgeting](https://www.reddit.com/r/JapanTravel/wiki/advice/budget/budgeting/)\n* [Luggage Forwarding](https://www.reddit.com/r/JapanTravel/wiki/advice/luggage/storageandforwarding/)\n* [Exchanging Currency](https://www.reddit.com/r/JapanTravel/wiki/advice/currencyandpayment/)\n* [IC Cards](https://www.reddit.com/r/JapanTravel/wiki/advice/transport/iccards/)\n* [JR Passes](https://www.reddit.com/r/JapanTravel/wiki/advice/transport/jrpass/)\n* [Onsen and Onsen Towns](https://www.reddit.com/r/JapanTravel/wiki/advice/culture/onsen/)\n* [Prescription Medication](https://www.reddit.com/r/JapanTravel/wiki/advice/health/prescriptions/)\n\nPlease be sure to abide by the rules, keep things on-topic, and stay civil.",
        "num_comments": 0,
        "comments": []
    },
    "Do you have a JR Pass or IC Card (Suica/Pasmo/etc.) question? Start here! (Monthly Thread - June 01, 2024)": {
        "title": "Do you have a JR Pass or IC Card (Suica/Pasmo/etc.) question? Start here! (Monthly Thread - June 01, 2024)",
        "score": 3,
        "url": "https://www.reddit.com/r/JapanTravelTips/comments/1d5jnlx/do_you_have_a_jr_pass_or_ic_card_suicapasmoetc/",
        "content": "Got a question about JR Passes or IC cards (Suica/Pasmo/ICOCA/etc)? Read through the information below and feel free to ask additional questions in this thread! Please [see here](https://www.reddit.com/r/JapanTravelTips/search/?q=%22Do%20you%20have%20a%20JR%20Pass%20or%20IC%20Card%20(Suica%2FPasmo%2Fetc.)%20question%3F%22&restrict_sr=1&sort=new) for old versions of this megathread.\n\n## JR Pass Info\n\nThe nationwide JR Pass is a travel pass that allows train and bus travel for a fixed cost over a certain period of days on Japan Railways (JR) services. For a comprehensive source of information on the pass, check out [our wiki page](https://www.reddit.com/r/JapanTravel/wiki/advice/transport/jrpass/) or [Japan Guide’s JR Pass page](https://www.japan-guide.com/e/e2361.html).\n\nThe JR Pass can be purchased in one of two ways:\n* Online at the [official site](https://japanrailpass.net/en/)\n* Online from an authorized retailer (also often called a \"third-party seller\")\n\nThere is no way to be certain if a JR Pass will be valuable for you without knowing your exact itinerary and doing the math out. If you are trying to work out whether a JR Pass is the right choice for you, here are some calculators:\n* [JRPass.com’s calculator](https://www.jrpass.com/farecalculator)\n* [Japan Guide’s calculator](https://www.japan-guide.com/railpass/)\n* [Daisuki calculator](https://www.daisuki.com.br/jrpass_calculator.html)\n\n**As of October 1, 2023, the nationwide JR Pass and regional JR Passes have increased in price significantly.** The price increase makes it so that there are _very few itineraries_ that the nationwide JR Pass will be worth it for. For more information and discussion on the price increase, see [this search result of prior discussion threads](https://www.reddit.com/r/JapanTravel/search/?q=jr+pass+increase).\n\n## IC Card Info (Suica, Pasmo, ICOCA, etc.)\n\n### General Information\n\nAn IC card is a stored-value card used to pay for transportation in Japan. That means you can load the card with money and use the card to pay for trains, buses, etc by tapping the card at train station gates or fare readers. Even if you have a JR Pass or other travel pass, an IC card is recommended because it can be used across transportation systems operated by many different transit companies, as well as for payment at convenience stores, restaurants, shops, vending machines, and other locations.\n\nFor tourism purposes, there are nine major IC cards and all of them are completely interchangeable and usable in each other's regions, so it doesn’t really matter which one you get. Where you start your travels in Japan often dictates what IC card you get, since different IC cards originate in different regions, but then you'll be able to use it during most of your traveling, even if you move to a different region. For general information on IC cards, see [our wiki](https://www.reddit.com/r/JapanTravel/wiki/advice/transport/iccards/) or [Japan Guide’s IC card page](https://www.japan-guide.com/e/e2359_003.html).\n\n## Physical IC Cards\n\nCurrently, sales of regular Suica, named Suica, regular Pasmo, and named Pasmo cards [are _technically_ suspended due to a semiconductor shortage](https://www.timeout.com/tokyo/news/sale-of-pasmo-and-suica-cards-suspended-except-those-for-tourists-080223) (except children's versions and commuter versions). That said, there have been recent reports in early 2024 of people getting regular Suica cards at some stations in Tokyo.\n\n**If you are landing in/starting your trip in Tokyo,** tourists can still get:\n\n* A [Welcome Suica](https://www.jreast.co.jp/multi/en/welcomesuica/welcomesuica.html) at Haneda Airport (HND) or a [Pasmo Passport](https://www.pasmo.co.jp/visitors/en/) at both Tokyo airports (HND and NRT) (**Note:** Pasmo Passport will be discontinued in August 2024, and may be subject to limited availability before then, based on supply)\n* _Possibly_ a regular Suica at some major JR East stations in Tokyo (subject to limited availability)\n* _Possibly_ a [Toica IC card](https://global.jr-central.co.jp/en/tickets/buy/toica/) at the JR Central portions of Tokyo Station (Yaesu North Exit) and Shinagawa Station (Shinkansen North Exit) (subject to limited availability)\n* A  digital IC card (see next section for more information)\n\nA Welcome Suica or Pasmo Passport acts exactly like a regular IC card, with two exceptions: it is only valid for 28 days, and it cannot be refunded. Please see [this thread and its top comment](https://www.reddit.com/r/JapanTravel/comments/15ebhwb/issuing_of_personalized_suica_and_pasmo_cards_is/) for information.\n\n**If you are starting your trip in another region** (e.g., Kansai, Kyushu, etc.), sales of their regional IC cards are unaffected by Suica and Pasmo shortages. Please see [this page](https://www.japan-guide.com/e/e2359_003.html) to identify which card you'll get, and it should be available at airports and train stations in those regions.\n\n### Digital IC Cards\n\nIf you are looking to get a digital IC card, please note that digital Suica, Pasmo, and ICOCA cards can only be used on iPhones, Apple Watches, or *Japanese* Android phones (this means the phone was purchased in Japan). For instructions on how to get a digital IC card in Apple Wallet, see [here](https://support.apple.com/en-us/HT207155). You _do not_ need the Suica or Pasmo apps (which are all in Japanese) in order to get a digital IC card. It can be loaded and used entirely through Apple Wallet.\n\nPlease note that not all credit cards work to load a digital IC card. Amex cards seem to have the highest success rate, but Mastercards and Visas can be flaky. Although Visa previously didn't work at all, as of December 2023, loading a digital Suica with some Visa credits cards seems to work, although not all of them. See this [At A Distance blog post](https://atadistance.net/all-about-apple-pay-suica-recharge/) for more info and updates. It is not uncommon to not have any of your cards work to load a digital IC card, and if that happens, you might need to stick with a physical IC card.\n\nKeep in mind that digital IC cards cannot be refunded (that requires a Japanese bank account), so you will need to burn down whatever value you’ve loaded onto them before the end of your trip.\n\n### IC Card FAQ\n\n**I have an old IC card from a previous trip. Can I use it on my upcoming trip?**\n\n> IC cards are valid for ten years after their last date of use, so if you received the card and/or used the card in/after 2014, it’ll work.\n\n**Can more than one person use the same IC card for travel?**\n\n> No. All travelers who want to use IC cards on transit need to have their own card. Most transit in Japan is distance-based, and the card is “keeping track” of your journey, and it can only keep track of one at a time.\n\n**Are there children’s IC cards? How do I get one for my child?**\n\n> Children under six years old can ride transit for free. If your child is between the ages of six and eleven, you can get a children’s IC card from JR offices by presenting the child’s passport for proof of age. There are also Welcome Suica and Pasmo Passport versions for children. If you are getting IC cards at the airport, they are able to provide children’s cards.\n\n**Can I load money onto a physical IC card with a credit card?**\n\n> No. Physical IC cards can only be loaded with cash, which can be done at ticket machines in train stations, convenience stores, and 7-Eleven ATMs. \n\n**I have a physical IC card and I want to transfer it to my phone. If I do that, can I still use the physical card?**\n\n> No. Once you “move” the physical card to your phone and turn it into a digital card, the physical card becomes invalid. It cannot be used or reactivated.\n\n**I’m landing in Tokyo, but then I’m going to Osaka and Kyoto. Do I need a suica in Tokyo and then an ICOCA in Osaka/Kyoto?**\n\n> No. Once you have one of the major IC cards, it can be used pretty much anywhere. There are some exceptions to this, but they are mostly on individual lines or in specific rural regions. If you are traveling to major tourism cities such as Tokyo, Kyoto, Osaka, Hiroshima, Fukuoka, etc., you are likely fine with whatever IC card you originally received upon arrival.\n\n**Should I buy an IC card online before arriving in Japan?**\n\n> If you want to get an IC card online from a reputable vendor, there’s nothing wrong with that. Some of the authorized JR Pass website (as well as other websites targeted at tourists) will sell them bundled with other purchases. That said, there isn’t really any reason to get your card ahead of time. If you’re landing in Tokyo, the 28-day Welcome Suica or Pasmo Passport is good enough for most tourists. And if you do end up in the country for longer than 28 days, you can simply get an IC card from another region once you’re in one (such as the ICOCA from Kansai).\n\n**Help! I tried to load my digital IC card through Apple Wallet and the transaction didn't go through! What do I do?**\n\n> To start, did you attempt to create it/load it overnight in Japan? The digital system goes down for maintenance from about 1am to 5am JST, so try again during Japan's daytime hours. Beyond that, Visa cards often cannot be used to load digital IC cards. Mastercards sometimes have issues too, depending on the issuing bank. Unfortunately, if you can't find a digital card + credit card combo that works for you, you may not be able to use digital IC cards.\n\n### Recent IC Card Threads\n\nTo see some recent discussion on IC cards, check out [the following threads from our search results here](https://www.reddit.com/r/JapanTravelTips/search/?q=IC+card).",
        "num_comments": 127,
        "comments": [
            "Regular Suica (green) avaliable at JR East office @ Narita as of June 07 2024.  Cash only. One person goes in to buy for whole group. 2000 yen only option. \n\n\nEDIT: Terminal 2",
            "[deleted]",
            "For those traveling soon, I was able to get Suica cards at Narita Terminal 1 today.",
            "Landed at NRT on 6/17. Suica was available in both T1 and T2.",
            "I can confirm from last week that you can indeed get Suica cards again. I got mine and my daughters childrens one at Tokyo station and a friend got one at Ikebukuro.",
            "I understand each person needs their own IC card but if you're reserving seats or paying a supplement (e.g. for Nozomi or other express train) does each person need to do it individually or can one person do it for the group?",
            "I saw a notice that SUICA card sales will be suspended on June 8 on their website. Does anyone know more about this?",
            "So just to clarify, assuming I want to avoid the JR Pass - if I want to travel across regions (Tokyo > Kyoto > Hiroshima, etc), I have to get an individual JR ticket for the trip (either regular train or Shinkansen)? Then, within any region, IC cards are good for most travel (unless trying to use a JR specific train line)?",
            "As of 6/21 at Narita Terminal 2, Pasmo Passport at the Skyliner and Keisei info center and regular Suica at the JR East travel center both available for purchase.",
            "# Can I buy a JR pass for me and my husband with my credit card, or do we both need to use separate credit card?\n\n  \nI understand from reading other posts that the official place to buy the JR Pass is [https://japanrailpass.net/](https://japanrailpass.net/). Is this correct?\n\nWe are planning several long distance trips during our stay in Japan and believe the JR pass will be worth it for us.\n\nI also understand that if we buy the JR pass from the official website, when we get to Japan, we will need to present our passports with the temporary visitor stamp, the numbers in the reservation code sent to our email, and \\*the same credit card used to purchase the JR pass, in the same name as the traveler.\\*\n\nAs per the website, it says \"Payment can only be made with a credit card. The credit card must be in the purchaser's name. For children who do not have their own credit cards, the JAPAN RAIL PASS can be purchased if the itinerary is the same as that of the person who is making the payment.\"\n\nIt specifically mentions children, but would it be okay for me to also pay for a JR pass for my husband using my credit card?\n\nAnother complicating factor is that I have a US passport and he has a Colombian passport. I don't know if that makes any difference.\n\nI hope my question makes sense, and I really appreciate any help you can give me!",
            "I will be heading to Japan soon, and our first stop is in Sapporo. Is there any particular IC card we should get? I know there are options for Suica and Pasmo cards on Apple Wallet, but I also know there's the Pasmo Passport and Welcome Suica cards, and I was just wondering which one is more worth it.",
            "I was at Narita today. They had no Pasmo cards, but they did have Suica cards. I grabbed one from the JR office/store looking place.",
            "Travelling from Tokyo to Mt Fuji and Osaka, will the IC card work on the JR line?",
            "I'm looking to get the Kansai Hiroshima Area Pass (17,000yen):\n\nDay 1 Kyoto to Kinosaki onsen - limited express\n\nDay 2 Kinosaki onsen to Osaka - limited express\n\nDay 3 Osaka to Onomichi - shinkansen + local\n\nDay 4 Onomichi to Miyajima - local + shinkansen (running total so far 22,000yen and then seat reservations extra...)\n\nDay 5 Miyajima all the way back to Tokyo (Shinkansen Hiroshima to Tokyo)\n\nI understand the shinkansen segment from Shin-Osaka to Tokyo Station on Day 5 is NOT covered by the Kansai Hiroshima Area Pass. I can buy a separate ticket and seat reservations for that portion of my journey (approx 14,000yen), but my question is can I buy that separate ticket for the exact train and same seat for my planned Miyajima to Shin-Osaka segment covered by the pass, and stay on the same train all the way through to Tokyo?\n\nOr do I need to get off the train and \"scan in\" the new ticket at Shin-Osaka and get a subsequent train to complete my trip to Tokyo - thanks!\n\nI ask because I can save costs by only buying the Osaka-Tokyo segment 14,000yen vs the whole Miyajima-Tokyo segment 18,500yen.",
            "I finally got the felica chip on my Pixel working and was able to create a digital suica card, but apparently it doesn't like 3 of my dirty foreigner cards. Can I top it up at stations or any other solutions?",
            "I want to book a ticket for the Yufuin no Mori train out of Fukuoka (Hakata) for November. Do I need a JR Pass (either the national one or the Kyushu pass) to book seats in advance for this train? Or can I just book tickets in advance without the pass? I know this is a popular destination so I just want to be prepared to buy tickets a month in advance.",
            "Bought the Suica card from my iPhone wallet for me and my husband but we are taking our 11 year old grandson along. He will have an iPhone, but since he is a minor, not able to get it for him with our card.   Will I be able to get him one at Haneda?",
            "I am currently planning a trip to Western Japan and plan on buying a 7 day JR Sanyo Sanin Area Pass with the intention of using it from July 13th onwards. The official website [https://www.westjr.co.jp/global/en/ticket/overview/](https://www.westjr.co.jp/global/en/ticket/overview/) says that we can't buy a pass until up to one month prior. However, I have also read and heard that I should buy the JR pass well in advance because they need to mail it to my house.\n\nDoes the official website give an eTicket? Is that why I can only book up to a month prior or will it get mailed I'm just a bit confused.\n\nAlternatively there is also other websites like [https://www.jrpass.com/regional-passes/sanyo-sanin-area-pass#regional\\_pass\\_type](https://www.jrpass.com/regional-passes/sanyo-sanin-area-pass#regional_pass_type) to buy it from where it also offers an eTicket. This doesn't include the condition of buying it from exactly up to one month prior.\n\nIs there any benefits of a physical copy and what is the difference between these websites? Is there also a significant reason as to why we can only buy it from the official website from up to one month prior? \n\nThank you for your help in advance!!",
            "How would I know if paying via IC Card(tap in, tap out) is enough or I have to buy another ticket on top of the IC Card? Last trip, an inspector would ask to pay addtl' fee while on the train. I couldn't understand the reason why since the inspector is speaking in Japanese.",
            "I saw that the Pasmo Passport will be discontinued in Aug 24. My family will be going to Japan in Sep 24 (entering through Haneda Airport), what IC card should we be getting? \n\nI really liked the convenience of the pasmo passport when I went in May but I doubt my entire family would be using their cards as much, would it be better to be purchasing individual tickets/using cash when commuting for those who're less likely to use the card instead?",
            "I'm doing Tokyo-Shizuoka-Osaka-Nagoya-Tokyo, would the 7day JRPass save me money or should i be better off just paying individually?",
            "My family is in the middle of our trip in Japan and I think we've mis-planned our rail transfers. Help! \n\nOn arrival, on Saturday afternoon, we activated our 72-hour Tokyo subway passes. They expire on Tuesday evening. We were planning on activating a 7-day JR pass on Tuesday afternoon. \n\nHowever, in order to get from our hotel in Roppongi to Tokyo Station to get on the Shinkansen to Kyoto, it looks like we'd still need to ride a Tokyo Metro line on Wednesday morning. \n\nWe have Android phones and did not buy a Suica or any other IC card at the airport. I don't think we'll have a lot of Tokyo Metro rides other than the one on  Wednesday morning. \n\nWhat's the best way to fix our problem here? Taxi from the hotel to a JR station? We will not have a lot of bags -- we're using the luggage-transfer service.",
            "We are going to Tokyo in October. My GF has an iPhone so she's all set there, but I have a pixel. We are flying into Narita and have vouchers for the Skyliner to get to Ueno. What should I do if I can't get a physical IC card in either Narita or Ueno?",
            "I will be going to Narita in August and plan to get the N'EX Round Trip Ticket. How do I get my return ticket if I plan to go from Narita to Shinjuku on my first leg and then from Tokyo Station to Narita on my return leg?",
            "[deleted]",
            "Hi!  I will be in Japan for 48 hours and mainly staying in Shinjuku/Shibuya area. I'm looking at getting the Keisei Skyliner & Tokyo Subway Ticket for 48 hours. Does anyone have any experience with it? Is it worth it to get it in advance or is it better to buy the skyliner tickets individually and then use pasmo/suica?\n\nThanks!",
            "I have a question regarding a JR West pass. When I purchased the pass online, I was able to make some reservations online directly after buying it. After picking up the pass and those tickets yesterday, I am now unable to book any additional trains online. Is that normal? You can only make additional reservations at the station once you've picked up the pass?",
            "Hi, We're around Ueno and are not capable of getting digital cards. Would there be IC's at ueno station's ticket offices? I saw a post regarding buying an IC card together with a pass, we'll only be here for another 4 days. Some advice would be nice :))",
            "Have seen that it’s possible to personalize a suica card, is that a thing again now?",
            "So, If I'm understanding this correctly...I should go to the JR East travel center in Narita T1 when I arrive. Maybe, but just maybe I can get a Suica from there? My family and I leave this coming Sunday from LAX.",
            "Do IC cards expire? I have a Pasmo from when I lived in Tokyo in 2018 and I'm heading back soon - my phone NFC can still read it and I have 180 yen left on it. Will it still work?",
            "Does anyone know of they have Suica (not welcome card) at Narita T1? \n\nThanks!",
            "I have a jr rail pass, and will be traveling to Tokyo, osaka and kyoto, kobe and nara primarily will I be able to use most of the public transport services with just the pass, or is it critical to get an IC card in additional?",
            "We spent nearly 2 weeks in Tokyo without an IC/Suica/Passmo card, and I'm honestly kinda glad we didn't mess with it. We just bought the tickets as needed and didn't need to worry about balance tracking and spending any overage before leaving. It was also a nice way to spend the change jingling around in my pocket. \n\nI'm sure if I were a resident, it would be much more convenient to have, sort of like a toll tag, but visiting I don't think there is a real need.",
            "I got the Suica app on my phone but it’s in Japanese so I can’t read it. Is there a way to switch the app to English?",
            "How far in advance can I buy the jr pass from the japanrailpass.net website & are jr pass prices the same across the official agencies/websites? TIA",
            "I have an Android phone so I know that I have to use cash to reload my physical Suica card. However can I also add my physical card onto my brother's iphone wallet (separate from his own digital Suica) and reload money into it via credit card, and still use my physical card to tap in with the new balance?",
            "I am travelling to Japan on 10th July and I decided that it's cheaper without the JR Pass, although I will use the trains (Narita-Tokyo-Kyoto-Osaka-Narita). But now I am scared that I might not find seats on the trains, because I read that only with the Pass you can book the seats in advance and the trains are always crowded. Is there any possibility that I cand buy tickets online in advance and maybe book the seats? Also, if we travel with 2 suitcases of 25 kg, will there be any problem with the trains or even with the metro - I understand there is not enough room to travel with big luggage, is that true?\n\nThank you!",
            "Which terminal were you at?",
            "Can confirm brought a regular Suica card at the JR East Travel Center yesterday (June 14th 2024) at Narita Terminal 2. Two options available JPY1,000 (500 balance, 500 card deposit) and JPY2,000 (1,500 balance, 500 card deposit). \n\nOffice hours are 08:30am till 08:00pm.",
            "Basically any semi-modern smartphone has NFC-F support, which implements the same contactless technology used in all Japanese IC cards (Felica). This allows them to read the cards no problem.\n\nWhat nearly all Android phones not intended for sale in Japan are missing is...\n\n* Provisioned Felica - this needs to be installed into the Secure Element of the phone during manufacturing and includes data necessary to actually make transactions with Felica (cryptographic keys, etc.).\n\nI imagine most of this is due to licensing costs - Felica costs money to license/implement. Additionally, to actually use IC cards in Japan you have to license Osaifu Keitai, which is the specific platform for using Felica in moble payments.\n\nAnd considering how narrow the support for this combination is (as in...literally Japan-only) most phone manufacturers probably don't want to pay extra as the majority of their users will never care about this.",
            "Any app that you recommend particularly downloading to read the balance on the IC cards for android?",
            "Awesomeee! I needed thos for my parents :)",
            "If you're buying shinkansen tickets or limited express tickets (either at a physical window/machine or through an online system like SmartEX or Ekinet), one person can do all the purchasing for multiple people. You'll either receive physical tickets, or you'll be able to assign tickets purchased via a website/app to people's IC cards or give them individual QR codes to scan.",
            "That warning has been up for a year now.  It’s referring to June 8th, 2023.  The info in the body of this thread is up to date.  Basically it’s a hit or miss on its availability.",
            "It's just the regular suica cards that won't be sold anymore due to the chip shortage. There will still be Welcome Suicas and Pasmo Passports still available for tourists.",
            "For simplicity's sake, that's a good way to think of it, but I'll try to explain in way too much detail below!\n\nIt is possible to use IC cards on some shinkansen routes, but it requires registration beforehand. You can use any IC card on any regular JR train route though, provided the train doesn't travel into a different service area. If this happens, it's no big deal-the gates just won't let you leave, so you'll need to give the station attendant your card and pay the fare in cash or have it taken from the card manually. \n\nThere are actually three components to a shinkansen ticket- the base fare (what you would pay to travel the same distance on normal trains), the limited express fare (what you pay for going fast), and the seat reservation (what you pay to have your desired seat-mandatory on some routes, optional on others).  \n\nOn paper tickets, the seat reservation is almost always combined with the limited express fare ticket, which is then *sometimes* combined with the base fare ticket. A paper base fare ticket often is for city \"zone\", meaning you can get on at any station in that zone, travel to the shinkansen station, and go from there (putting in both your base fare and limited express fare tickets into the gate), and this can save a bit of money in some cases where you would otherwise need to pay to travel to the shinkansen departure station. \n\nIf you just put where you are traveling from and where you are going to in a machine (or at a service desk), you will get the paper tickets you need, so I recommend this for long-distance travel.",
            "THISSSS IVE BEEN LOOKING FOR AN ANSWER FOR THIS",
            "Yes you're right.\n\nThe fancy trains (shinkansen, limited express trains, Narita express, etc...) have supplimental fees in addition to the base fare. So you can purchase just the additional fare ticket, and use your IC card for the base fare. Or you can purchase both the ticket and the supplimental ticket in one go and then not use the IC card at all for that route. \n\nEverything else you can just use your IC card without supplemental fees.\n\nBasically the ticket gates always take base fares, the supplimental fares and seat reservations are not used unless they are being checked by an attendant on the train just to ensure you have one.",
            "Can confirm, was able to get a regular green Suica card from the JR east ticket counter at Narita T2, despite the signs they had up that said Suica sales were suspended. I think it is only for travellers though",
            "That is the correct official website, yes.\n\nYou can pay for all the JR Passes on the same credit card. When you pick them up, you'll need to present a passport for every person to prove you are all tourists. What passport you have doesn't make a difference, as long as you're all tourists with a \"temporary visitor\" sticker.",
            "There is no difference between the IC card companies.  The normal pasmo or Suica has a longer term expiry (10 years) while the tourist versions expire in a month.\n\nIf you can get a digital one, then do it.  It’ll save you time.  If you can’t, the IC card available in Sapporo, Kitaca, can be used anywhere other IC cards are accepted.\n\nThere is no “worth it” since you’re not purchasing these.  They’re simply a payment method.  I suggest reading the body of the thread.",
            "They are all the same functionally and will work wherever an IC card is supported. Welcome Suica and Pasmo Passport are just tourist versions of the same cards that expire after 28 days. Pasmo Passport also gives you special discounts at certain places.",
            "Did you get the welcome suica card or the regular penguin card?",
            "Did you go to the Skyliner and Keisei office and they told you they were sold out of Pasmo cards or did you just go to the JR office? Just wondering bc I’m hoping to get the Pasmo Passport for the cute design lol.",
            "IC card does not work natively on the Shinkansen.  It kind of does but that’s only if you buy online, connect your card, etc…\n\nIf you’re talking about local lines in Tokyo and Osaka, yes, it works on all JR owned lines and the other companies as well.",
            "Tokyo -> Mt. Fuji can mean a lot of things - are you riding the train to Shizuoka/Fuji-shi? Are you going to Kawaguchiko via Fuji Excursion train?\n\nMeanwhile, getting to Osaka is a Shinkansen ticket, so you will need to buy that separately.",
            "You can buy Shin-Osaka to Tokyo on exact same train and seats and stay there for the whole journey. Note that you may need to exit via manned gate at Tokyo station.",
            "A digital IC card can be reloaded with cash at some train station machines (there are ones with little platforms for a phone), any convenience store, and 7-Eleven ATMs. So you should theoretically be able to do that, although hopefully the jailbreaking didn't mess anything up in that regard.",
            "They have a [website](https://www.jrkyushu.co.jp/english/train/yufuin_no_mori.html) to book tickets.",
            "I'd also wondering this because the Pasmo site only lists Narita now (I thought they had Haneda listed at one time when I previously looked into it). So maybe for our kids the best option at Haneda is now Welcome Suica.",
            "The JR West link is for the official site. The official site will send you an email confirmation, and you'll use that and your credit card and passport to pick up the JR Pass once you're in Japan. They do not mail you an exchange voucher. And it's correct that you cannot buy it until 30 days in advance—that's just how things are done in Japan. It's the same for train tickets/bus tickets/etc.\n\nThird-party sites like jrpass.com are the ones that will typically mail you an exchange voucher. Historically, it was cheaper to buy JR Passes through third-party sites (although not anymore since October 2023), so that's why you'll likely see a lot of old advice to buy from a third-party and get an exchange voucher mailed to you.\n\nThese days, there is basically no reason to buy from anywhere other than the official website.",
            "Pretty much anything named \"Limited Express\" or \"Shinkansen\" requires an additional limited express supplement. Google Maps will tell you if the train is a limited express, and it usually also says it on signage on the platform.",
            "If it’s a limited express train, those generally come with an additional fare.",
            "This early, it is hard to tell what the card situation will look like by then. There will likely still be some sort of IC card available that you can get somewhere when you get there. IC cards just makes everything simpler when using transit, but if you have members who don't mind knowing exactly where they're going and using the signage to determine their fares for the trip, then tickets should be fine. If they have iphones, see if they can setup an IC card on it.",
            "There’s a link to a rail pass calculator at the top of this thread.",
            "Spoiler: no, you won't save any money with a JR Pass. You'll probably end up wasting ~20K yen instead.",
            "Buy a paper subway  ticket for the trip - or just get suicas from a JR East ticket office, because you will want IC cards in Kyoto for the bus and subway anyway",
            "You're probably going to get something - October is pretty far off that it's really not useful to ask right now, considering stock fluctuates heavily and by the time you arrive, the Pasmo Passport will also have been gone for over a month.\n\nAlso, if you really can't get anything - individual tickets are a thing.",
            "You get a voucher/exchange ticket that you can bring to any JR East ticket office or seat reservation machine to get your reservation for the return trip.",
            "This is all within 7 calendar days? Because that's the only timespan that would justify a JR Pass.",
            "Tokyo Subway Ticket is only good for the Tokyo Metro and Toei Subway which make up only some of the train lines available in Tokyo.  It is not good for the JR lines.  With the pass you will have to plan to make sure you’re only taking those lines.  Sometimes it’s not the most efficient way to get from point a to point b.  If you’d rather not deal with what company runs what train line then an IC card is easier.  It can also be used on the Keisei Skyliner.",
            "Yes, you need to make them at a ticket machine or ticket office once you pick up the pass. ",
            "Check at the JR East travel service centre inside Ueno station for Suica cards",
            "Likely not considering we're in a time of an IC card shortage. Don't want to draw attention and popularity to a product in short supply.",
            "Someone two days ago on this thread reported they were available.  Availability seems to change with the wind but also appears to be more consistently available?",
            "10 years from last use.",
            "This is literally the first question in the FAQ above",
            "If that is your itinerary even a 7 day JR Pass will cost almost ¥20k more than buying the tickets individually. And you will still need an IC card for all non JR trains, the Tokyo subways, Osaka subways, and Kyoto subways and buses. ",
            "JR Pass only works on JR lines, so if you can pick up an IC Card, it will likely help you out a lot. Otherwise, any time you're riding on a non-JR line, you'll need to pay for a paper ticket.",
            "I believe most people would be better off tracking balance than looking up correct fare every time, and hoping they use correct transfer gate if they need to transfer outside of paid area.",
            "It's not _required_, sure, but it does really make things a lot easier, especially if you tend to run late for stuff or are trying to make tight connections between different operators and so on. It's also nice to be able to pay for stuff in konbini and some restaurants with them, and generally just not have to plan as much in advance.\n\nDespite all the horrible communication and confusion, it's really not hard at all to get an IC card:\n\n- Arriving in Tokyo @ Haneda? Get a Welcome Suica at the Terminal 3 station TVM.\n- Arriving in Tokyo @ Narita? Get a PASMO PASSPORT at the Skyliner/Keisei desk.\n- Missed getting one at either of the Tokyo airports, e.g. if you arrived after hours, or if you're here for over a month? Get a regular green Suica from a JR East Travel Service Center near you. \n- Arriving anywhere else that's not Tokyo? Even easier, get your local variant (ICOCA, manaca, SUGOCA, Kitaca, etc.) from a TVM at train station.",
            "One other very minor consideration is that the fare using an IC card is (usually) a couple of yen cheaper than paper tickets, and this does add up, especially if you have to switch lines a lot during your travels.",
            "I think it saves time to have a form of IC card, just been there and the amount of times I had to top it up was maybe 3 or 4 times? Loaded it with 3000 yen each time I think. With an IC card you don't have to worry about getting tickets and be on time. Also, you can top it up right in front of the entrance/exit if access is denied.\n\noh and you can use it literally everywhere, on pretty much every bus so yeah, give it a go next time. No hassle in purchasing tickets and keeping those around.",
            "ive lost my card several times and having the apple watch with suica has been soo nice",
            "You don't need the app. Just add the card directly through Apple Wallet.",
            "One month in advance. The website you mentioned is the official one which allows you to reserve online in advance of getting to Japan.  The others give you an exchange voucher which you have to then exchange at a JR office for the actual pass.  \n\nThe price is ¥50,000/¥80,000/¥100,000 for 7-,14-,21-days respectively. If sites say differently then they’re charging you more.  Be sure to use a JR rail pass calculator to put in your itinerary to see if a pass is actually right for you.  For the majority, it isn’t.",
            "If you transfer the suica to the phone, the physical card becomes unusable and it's a non-reversable process",
            "Not possible. Moving a physical card to a digital card invalidates the physical card. To add to the other comment, an IC card can only be in one \"place\" at the same time, because the value is stored locally on that card (whether it's phyical or on a phone). So there's no such thing as remotely loading an IC card or similar.",
            "> because I read that only with the Pass you can book the seats in advance\n\nI'm not sure where you got the idea that only the JR Pass can make advanced reservations. How would normal Japanese people buy tickets, then? Of course you can buy tickets in advance if you want.\n\nShinkansen tickets can be booked up to 30 days in advance, either in person or online through [SmartEX](https://smart-ex.jp/en/index.php) (for your route). So you can book ahead online or even days/hours ahead in person.\n\nOn the route you're taking from Tokyo to Osaka/Kyoto, there are like 6-10 trains per hour. Aside from national holiday weeks (like Golden Week, New Year's, etc.), they don't sell out. You can buy them minutes in advance at the station. The airport trains don't really sell out, either, and there are multiple ways to get from Narita into Tokyo.\n\n> the trains are always crowded\n\nFor shinkansen, this isn't really true outside of holidays. For regular local trains, of course those can get crowded, especially during rush hour.\n\n> Also, if we travel with 2 suitcases of 25 kg, will there be any problem with the trains or even with the metro - I understand there is not enough room to travel with big luggage, is that true?\n\nFor the shinkansen, it's size that matters more than weight. [Oversized luggage](https://global.jr-central.co.jp/en/info/oversized-baggage/) needs special reservations so that it can go in the special storage areas of the train car. Anything smaller can fit overhead (if you can lift it) or sit at your feet (there's a lot of room on shinkansen trains).\n\nThere aren't really limits on the luggage you can take on the metro/local lines. That said, trains/stations in cities do get crowded, so you might find it's hard to navigate with your luggage or squish into train cars with other people during busy times of day. There are also a lot of stairs/escalators in stations and fewer elevators, so you might spend extra time trying to find elevators if you aren't comfortable lugging your bags around.",
            "2. ",
            "Got it! Thanks for the details",
            "Thanks for the clarification!",
            "Thank you so much for all of your help!",
            "Penguin card. Does that mean it has no expiry?",
            "I only went to the information station by skyliner. She said they were temporarily out. You may be in luck.",
            "thank you so much!! you are so helpful.",
            "Thank you! I'll check the card situation closer to Sep :D",
            "This.  That JR pass isn’t going to do much more work in Kyoto.",
            "Thanks, we had to go to a JR East office to activate the passes anyway, so picking up a Suica was really straightforward. Whew!",
            "Yep I know about pasmo passport expiring. I think that I have to go to the JR east travel center in Narita first for my luck then can try Ueno. If I have to get individual tickets every time it would ruin the travel experience for us lol",
            "Thank you!",
            "Thanks!",
            "will do! pretty similar answers ive been seeing, good to know its still the same advice 2 months later.",
            "I checked tokyo and the guy there said no IC cards in all stations so it kind of spooked me",
            "Strange. I appear to be having an unreasonable amount of anxiety around getting one. I mean, it's not like I can't use the transit system or buy anything without one. Just seems convenient.",
            "Hot diggity. Thank you!",
            "Thanks for pointing that out after someone already kindly answered, I did realise afterwards and just didn't see it. Unsure what you're trying to achieve by commenting",
            "I see what a shame, thought only the pass need. Thanks for the answer! 😀",
            "Understandable. The ticket machine was easy to use, and I didn't need to calculate anything. You can search by destination and it'll tell you the cost. The ticket itself was just for the amount, and didn't actually say the destination chosen.",
            "And if you're me... I pay for (literally) almost everything with my IC card. Did you know there's actually a daily limit to how much you can add to a digital ICOCA? I didn't... until I found out, haha. \n\nI also like the flexibility of changing my plans mid-trip. I might, for instance, decide that a train is too crowded and hop off a stop early and walk or whatever. Could I do fare adjustment on a paper ticket I bought? Sure, but it's easier to not have to, especially since I don't carry a lot of cash at all.",
            "My flight arrives at 22.235 at haneda, will it be to late to buy one ?",
            "JR East Travel Service Center at Narita Terminal 2 has the standard green Suica cards available yesterday (Friday 14th June, 2024).",
            "Yeah, worked this out",
            "But I will still have to exchange for the physical pass once I touched down into Japan, right? \nYea, I calculated my trip and it cost 3x the pass if I were to buy individual tickets.",
            "dang it. plan fouled. thanks for the response!",
            "10-year expiry from last use.",
            "Sort of crazy. I was just in Osaka and you can just get icoca cards from the self sevice machines no problem. I picked up 2 for my sister and her husband who will be going to Japan soon. It's weird how it's fine in Osaka but just so hard in Tokyo.\n\nYesterday I also mentioned how it's hard to get a suica card to a friend and she had no idea about the limitation",
            "i would still check Ueno JR East Travel service center, you never know..",
            "Correct.  It may take a few more minutes to get your paper ticket than just showing up and tapping in/out.\n\nIt’s one of the things that Japan does that doesn’t quite make sense but that’s the way it is.  There’s a few others.  You just kinda roll with it and do what you need to do.",
            "What's the daily limit?! I know it's a max load of 200,000 but I didn't think there was a maximum you could put on per day. Maybe you could override that by having a station attendant do it manually? Very interesting!\n\nAnd yes, very much agreed on that point as well, I do it regularly too! The flexibility it provides is just invaluable.",
            "By the time you get through customs and everything, there's a good chance it'll be past the time the last train/monorail leaves from the airport, which means the station'll be closed. In that case, you can buy a normal green one the following day.",
            "Yes, you still have to pick it up.\n\n3x?! Wow.",
            "Are you planning on just being on trains every day? 3x is crazy :o",
            "Thanks. I was exhausted after the plane.",
            "Yeah am planning on getting a taxi just in-case, thanks.",
            "Yes, taking trains every day, basically doing whole japan agn, went in 2018 for 23 days but didn't cover some cities"
        ]
    },
    "What time do you end your days?": {
        "title": "What time do you end your days?",
        "score": 10,
        "url": "https://www.reddit.com/r/JapanTravelTips/comments/1dlr8kq/what_time_do_you_end_your_days/",
        "content": "I started my days around 6 am and get back to my hotel around 5:30. I'm dead tired after that but it also feels like I'm wasting the evening. What time do you usually start/end your days. (Note that's only been 2 days so far and they included some of the only morning activities)",
        "num_comments": 41,
        "comments": [
            "You should rest in the middle of the day so that you go out and enjoy the lights.",
            "Start around 8, go back to hotel around 3 or 4 and take a break so I can go out in the evening",
            "Japan is really safe and it’s a joy to walk around at night. Definitely spend a few nights just exploring.\n\nYou start early to avoid the crowds and you can also stay out later to avoid the crowds.",
            "My last trip I stayed in Dormy Inn hotels which all have onsen that opens at 3pm. Generally my days out were 8-3 then back to the hotel for an onsen (great for tired sore feet) and chill out before heading out again about 6 for dinner and to experience a place at night.",
            "City:\n\n\nI get up around 7-8a and eat breakfast. Shower and get ready. Get on transportation (or start walking) around 10a. Break for lunch/snack around 2-3p and chill or head back to hotel for at least an hour or two (especially in summer this is mandatory). When the sun starts setting get ready to head back out... have a beer from Lawson's or in the station then head towards the location dinner will be at. I budget 2 hours for dinner and drinks. Head out for drinks/coffee or to the karaoke bar. Back to hotel for a soak in the tub/onsen.\n\n\nStaying at a ryokan is much different because you're usually locked into a breakfast and dinner. Plus being out in the countryside is much more sleepy and relaxing. I usually try to pick the latest dinner time. Eat and then hit the public bath (unless I've splurged for a suite with private onsen).",
            "Question: what can you even do at 6 am???",
            "Aren't most things closed that early in the day? Most museums open at 9 or 10, what are you doing until then?",
            "How the hell do you have my dream sleeping schedule on vacation!?",
            "Depends on the way you travel and your individual fitness level. For my initial trip it was enough to wake up around 8 in the morning, just loosely explore a specific area, stopping at a shop or café inbetween. So it was no problem then to stay up until midnight, especially if I went to eat something proper in the evening. Also I believe that me not following a tight schedule or visiting places that weren‘t of my interest helped to stay mentally awake.",
            "I never structure my trips",
            "I'd usually do similar, start between 6 and 8 AM, back around 5-6 PM, but I'd make sure to plan the odd day where I'd take a break around noon and go out late (for example this year I went out drinking in Golden-gai one night, and went to the Skytree and a small restaurant I like another night)",
            "Start around 8 and finish around 10 which typically coincides with my second dinner (omakase seating) or supper",
            "we were pretty much back in the hotel by 8/9.",
            "There's no set time, it depends on where I am. In most onsen resort towns, **everything** will close at around 5, so heading back to your ryokan at 5:30 is not merely ok, but expected. On the other hand, if you're in a big city you can comfortably stay out to midnight; or after depending on whether your hotel is walking distance or not.",
            "The first two days we went 8am-11pm, then it became shorter 9am-8pm and soon from 11/noon-8pm\n\nI found most things weren’t open morning, so every day our time for going out slowly adjusted to later! Haha",
            "I know that feeling. During my last trip, I would start returning to Shibuya (my home base) at around 6-7, and just wouldn’t have the energy to go out. One evening, I finally did, but that just amounted to a single drink in a pub lol.\n\nIf you’re super busy during the day, you’re going to be tired at night. So, if you’re particularly interested in the nightlife, it might be worth marking out a day where you’ll be able to take things easier, to preserve your energy for the evening?",
            "For sightseeing go whenever time allows, as for now nighttime is much cooler and I have seen so many families and kids late at night without any worries. Only thing I can worry about being late out is the subway system. But to answer your question, late morning around 9-10 and then back whenever my body feels tired 😂",
            "Start at 6am, end about 11:30 pm. Unless it is a ryokan with a private onsen day. Then kaiseki is when ever scheduled and it is an evening of soaking until 10pmish. Maybe one night ends about 3am, but these aging bones can’t take that often.",
            "I usually go out in the morning returning in the middle of the day (hottest time) and go out around 5pm to look around for dinner and see stuff.",
            "You have to pace yourself and give yourself breaks in between all these touring. This can be via a cafe break or chilling at a park doing nothing or my secret trick is when i am using train passes, i will use the longer journeys to rest. \n\nYou can also go back to hotel and rest around 3pm . Then go out around 5pm or 6 for a night of attractions/ dinner.",
            "Most days started around 11:00, came back around 10:30. I was annoyed by some work I needed to do remotely in the morning but also felt like I was reaching my limit anyways - 20k-30k steps a day. I was solo so did not spend much time with long dinners but that would be nice actually to wind down but still enjoy Tokyo.",
            "In tokyo my days started around 8am and ended at 8 - 9 PM. Usually I'd go to bed at 11 though since there was always something to do, Laundry, talk to the family, watch a little youtube...etc.\n\n\nThe trick is to rest midday, just relax in a park or on a long train ride, as well as use food pauses as mini breaks throughout the day.",
            "What do you possibly do at 6am in Japan?  10 to 10 is Japan time.",
            "It was the same for me in Japan. I would be up by 6 or 6:30 and exhausted by like 6-7 pm. After maybe like day 3, I started going back  to the hotel around 3, staying for a couple hours, then going back out at like 5 or so for dinner and any activities",
            "Typically I’m out the door by 8:30am, and back in the hotel by 7:00pm. I have no interest in most night life, so this works for me.",
            "I always seemed to end up on top of a mountain at sunset, walking down in the dark.  But maybe because I was there mid winter.  Itsukushima Jinja shrine deserted at night on the way back past was kind of cool.  Empty Nara temples too.",
            "Most all the touristy stuff is closed at night so unless you plan on going drinking you aren't wasting the day.",
            "I usually leave around 6-7 and go sleep around 2 lol",
            "Really reccomend a siesta, then go out for the evening. I split up my days into 2 parts and it was ideal",
            "9am-11 pm usually",
            "this is what we did",
            "Kiyomizudera opens at 6AM, Fushimi Inari and Arashiyama Bamboo Forest is open 24 hours I believe, and Philosopher’s Path would be a nice chill walk (not sure if there’d be light at that time here though so research that) :)",
            "I was heading to the first shinkansen for my day trips.  (This was before the JR Pass price got jacked up.)  Was often rolling out of Tokyo Station 6:30sih.",
            "Apart from hikes, temples etc., you’re 100% right. Most shops, museums, other attractions don’t open until 10. I generally went out from 9.30ish, came back for a rest around 3pm, then went back out at 5 or 6 (most shops are open until at least 8pm, some until 10pm).",
            "Hikes/parks and a day trip to Kamakura",
            "About the same here. Sleeping in japan is overrated. I can sleep when I'm back home. 6am is a great time to start to see sun rising and \"empty\" syreets and parks.",
            "Kiyomizudera was the only time I was at a site at 6am. Then walked to Gion. It was great and was back at my hotel at 9ish to nap until lunch. lol.",
            "There was light at about 4:30 every morning last month when we were there.",
            "Fine. But isn't Kiyomizudera also about seeing the street and the shops that lead to it? I also liked to see locals in traditional clothes (not the tourists), I believe they were there for a coming of age thing, I saw some sensei with their pupils (looked like some martial arts theme), begging soto zen monks or just everyday people dropping by, how they purify themselves etc. I would assume 6am would be soulless."
        ]
    },
    "Rainy day in Kyoto tomorrow": {
        "title": "Rainy day in Kyoto tomorrow",
        "score": 3,
        "url": "https://www.reddit.com/r/JapanTravelTips/comments/1dlv6k2/rainy_day_in_kyoto_tomorrow/",
        "content": "How would you suggest to best enjoy the time without getting too wet? Any special events?",
        "num_comments": 0,
        "comments": []
    },
    "Solo experience so far. Don't stress": {
        "title": "Solo experience so far. Don't stress",
        "score": 5,
        "url": "https://www.reddit.com/r/JapanTravelTips/comments/1dlsg21/solo_experience_so_far_dont_stress/",
        "content": "I'm having a great time so far. It's my first solo trip and first overseas trip in general. Didn't make a super detailed itenirary but made a general list of areas to visit. Speaking as someone that barely leaves the house, don't stress about solo traveling if I can do it anyone can",
        "num_comments": 5,
        "comments": [
            "There's no a place easier to visit by yourself than Japan and I say this as someone who has been traveling solo and working remotely for the last 2 years from many countries\n\nJapan is basically made for people to do shit by themselves",
            "Traveling solo here as well. Im kinda going with the flow and weather for itinerary. No stress as well, maybe when I get a menu with no pictures and all in Japanese. But it’s adventurous to try out new and unusual things",
            "Are you visiting Tokyo? I'm here solo and need a couple things to do for the last couple days!",
            "First time solo traveler also, i've been in japan forbthe mast twelves day and having a real blast. You may exprerience some anxiety soing rhings for the first time, but once you do it, it will feel natural ! Really loving it so far :)"
        ]
    }
}