{
    "Question Thread": {
        "title": "Question Thread",
        "score": 18,
        "url": "https://www.reddit.com/r/Jujutsushi/comments/1dk72mi/question_thread/",
        "content": "This sub is catered to quality, in-depth manga discussion, so please post questions that have simple manga answers here. If you don't have 500 comment karma yet, you can post here too.\n\n# Hot Topics:\n\n**Where can I read leaks?**\n\n>Read Rule #3 on the sidebar for where and when to find leaks on Twitter, Discord, and fanscan sites (TCB and Shishiso scans). DON'T post leaks outside of the pre-release megathread when you find them. Don't post them in this thread.\n\n**Where can I read the official Fanbook/Databook?**\n\n>Scans and translations [here](https://imgur.com/a/HGmL2zu) and searchable text [here](https://docs.google.com/document/d/1FCbQq3YSqQkCuO1UitrlEXKEtjV8aepWgykeyjAe_ZE/edit). Also on the sidebar and sub wiki.\n\n**What is Uraume's gender?**\n\n>Uraume's gender is currently unconfirmed.\n\n**What would happen if Yuji ate another Sukuna finger?**\n\n>We don't know since the manga hasn't answered that question. Sukuna's fingers are Cursed Objects containing pieces of his soul so make of that what you will.\n\n**Is Gojo really dead?**\n\n>Yep, looks like he is.\n\n**What is Kenjaku's plan with the Culling Game?**\n\n>In short, he's using the Culling Games to produce a lot of Cursed Energy within its Barriers, with which he plans to use to evolve the human race. He wants to create a new golden age of Jujutsu. Kenjaku has apparently not revealed all his plans, Yuki cast suspicion on Tengen (the Culling Game plan infodumper) before they fought, and Kenjaku called Tengen his \"friend\", so it's unclear if Tengen was entirely truthful. We don't yet know how Sukuna fits into this plan, even though he and Kenjaku have been cooperating.\n\n**What is Ijichi's Cursed Technique?**\n\n>How naive of you to ask. He wouldn't cheat by giving it away.",
        "num_comments": 41,
        "comments": [
            "What is the significance of Sukuna using the Unlimited Void hand sign for his domain? I noticed it in the most recent chapter but I don’t remember it ever being mentioned why it’s different from what he used previously",
            "What exactly is Heavenly Restriction? \n\nI find it confusing that Maki and Toji have no CE, so they can't create curses like other non-sorcerers, but it's not like they don't have the emotions that would create CE. And they didn't choose the restriction unlike other Vows.",
            "Can someone with a simple domain use domain amplification?",
            "In the Shibuya arc, why did Gojo not even attempt to blitz Choso, Jogo, or Mahito after he popped his .2 second domain? It does state that the cursed spirits could've awakened at any moment. Gojo still likely would have had 10 solid seconds to try to dispatch one of them. \nWhy target the transfigured humans that likely would've been out of commission for a very long time after experiencing Infinite Void?",
            "How old are the disaster curses? \n\nMahito is the youngest at couple months, and Dagon is a bit older, but still relatively young.\n\nJogo and Hanami might be around Gojo’s age since curses were getting stronger to balance out his birth. Maybe even younger because they didn’t seem to know who Gojo was. They must not be around that long since they didn’t make any big moves to further their goal of replacing humans. At least, moves that would’ve gotten them registered by jujutsu society.",
            "why did multiple important members of jujutsu high not know that Sukuna could use an open barrier domain? This seems like an actual plot hole/gege forgot moment\n\nChoso knows kenjaku could do it, Itadori has the memories of it + Inumaki was inside of it \n\nThese two things together should at least prompt jujutsu high to be aware of the possibility instead of being completely befuddled.\n\nI find it hard to believe that they didn't discuss this during the month-long preparation considering their plans' depth.",
            "With the military guys, will the people that got captured ever be returned back? It wouldn't matter too much if they didn't, but just wondering what will become of them",
            "He doesn’t have enough hands to do his normal hand sign",
            "I coukd be wrong but it's apparently cuz of all the binding vows he did + the lack of his other hands",
            "we don’t know what it means in effect, but symbolically it shows Sukuna’s resilience\n\nThe reason Sukuna is so strong is not only because he can make Binding Vows, but because he has so much, he can easily adapt to any disadvantages he faces\n\nHe was weakened in his fights against Maki and Higu (i think it was them) who cut off two of his hands respectively. He adapts to this by stealing what he “learned” from Gojo and using his domain symbol\n\nSukuna will steal whatever he can from whoever he can, and abuse it until he is literally forced by the power system to stop, only for him to trade it for something better. Him stealing Gojo’s domain hand sign because he can’t use his own is a perfect example of this",
            "We don't know, but it probably has something to do with only having to use one hand for a domain",
            ">What exactly is Heavenly Restriction? \n\nIt's a binding vow that is forced upon the body when they are born.\n\nNanami-says translation of Mechamaru's explanation of Heavenly Restriction\n\n>It’s different from a standard ‘binding’ that you self-inflict upon yourself. It’s a binding that’s enforced upon your body by birth”\n\n>I find it confusing that Maki and Toji have no CE, so they can create curses like other non-sorcerers, but it's not like they don't have the emotions that would create CE.\n\nThey don't contribute to the birth of cursed spirit, like non-sorcerers. They have 0 CE, so they don't leak any CE that would lead to the creation of cursed spirits. Yuki says that everyone having this type of Heavenly Restriction would lead to no cursed spirits forming.\n\n>And they didn't choose the restriction unlike other Vows.\n\nThat's what Heavenly Restriction is.",
            "A pact forced on you from the moment you are born, it sacrifices CE and CT usage for a strong physical body. Mechamaru's does the opposite",
            "Every skilled enough sorcerer can use domain amplification and simple domain. DA is harder to use than simple domain that's y there r only a few DA users. Even kusakabe ,who's probably the best ever SD user , can't use DA.",
            "I believe not because every person with DA have DE. And Kusakabe outright said he can't do that.",
            "Kusakabe specifically said that he can't, and he is the best simple domain user we've seen. Also, we've only really seen DA used by people who already have Domain Expansions, but could just bea coincidence",
            "Sure, SD isn't a CT after all.",
            "If he tries to go after any of the disaster curses for any reason and they wake up and start killing people again before he can dispatch them, that makes the whole endeavor worthless. He can’t risk popping his domain again and permanently mentally damaging the citizens, and if the transfigured humans wake up in the meantime then way more people die since there’s so many of them. He gauged the transfigured humans as the more severe threat, but ended up getting caught off guard by Kenjaku",
            "Gojo had to decide in an instant and focused on saving lives. \n\nHe also couldn't have known how long all the CSs would stay stunned, and knew he could beat the disaster curses.",
            "Gojo can’t do *everything* so if he went after the Disaster Curses in that moment, he risked the transfigured humans killing the normal ones. \n\nHe didn’t know how anyone would be effected by .2 seconds of his domain. If he could at least kill the transfigured humans there would be no one left to go after the regular humans since the disasters would be too occupied with him",
            "Because he didn't know how long it would take for them to wake up, this is literally stated.\n\nIf they woke up when he went to kill them, he would have to focus them, meaning the Transfigured Humans could wake up and continue their spree",
            "This is a really interesting question.  I didn’t give it much thought before.  It’s a wild idea that the sheer level of curses rose because the counterbalance was just that strong.  I knew that was the case for (some) sorcerers, but the idea that curses evolved too is crazy.",
            "Jogo is probably hundreds of years old, he seems like a very old man, set in his ideals\n\nHanami is definitely younger, but she seems pretty old as well\n\nTechnically Dagon is the youngest, only being around a few minutes old by the time of his death \n\nMahito is a few months old I believe, the anime makes it seem like he was born in the theatre, but that isn't actually true",
            "Yuji probably doesn't see it as anything special, his first ever domain was Sukuna vs Finger Bearer, then he saw Jogo's, then Gojo's, then Mahito's, and then once again, Sukuna's, basically, Yuji doesn't understand why it's special.\n\nInumaki wouldn't know that it was a DE\n\nChoso saw KENJAKU do it, not Sukuna",
            "Yuji only sees what Sukuna sees. He doesn’t have any knowledge past that. He probably didn’t even recognize the domain as having no barriers since the range was so big and it was only activated for a matter of minutes, if not seconds. \n\n Similarly Inumaki was only in the domain briefly. He immediately fled and was focused more on his arm/helping civilians rather than Sukuna’s domain\n\nFrom there, even if they knew Open Domains existed from Kenjaku, they wouldn’t know for a fact that Sukuna could do the same. \n\nI don’t remember JJK high being shocked at Sukuna using an open domain, more so curious how it would effect a normal domain, but that might come down to translations",
            "I don't think they were surprised by the open barrier domain, they were surprised that it bypassed the barrier of Gojos domain and was able to attack it from outside. \n\n\n\n\nThey knew it existed, they did not know how it mechanically interacted with other domains.\n\n\n\n\nI might be misremembering though.",
            "That is a good question. If Gegenever mentions them again we can probably assume that the military actually succeeded in their mission. This would mean that some jujutsu sorcerers would now be test subjects, which is quite scary to think about. Especially since they would need to examine the brain in particular. My guess is that they either died or escaped before the Shinjuku showdown. We saw the bomb dude attack the military, so perhaps some got freed or killed there? Otherwise Kenjaku may have killed them. Since we have no further info this is all I can come up with.",
            "They are already dead most likely, because they haven't killed anyone.",
            "Ah, should’ve guessed that lol",
            "Okay, thank you for that explanation! I was thinking about the plotline introduced in Hidden Inventory where Yuki explains to Geto about the possibilities for ridding the world of curses by getting rid of CE and if that was possible in the story in the near term. The options she mentioned were:\n\n(1) was \"eradicate Cursed Energy\" with Toji being the model, but if they're unable to choose to be Heavenly Restricted, it doesn't seem to be a viable solution (but then again she said she needed to study him.)\n\n(2) Teach humans how to control their cursed energy - kind of like the situation at present in the wider world, with curses being public knowledge and growing, then \"survival rests on adapting to a jujutsu-sorcerer based society\" but it's not like non-sorcerers can learn jujutsu so this doesn't seem to work either. Other than it being a slow Darwinian version of Geto's plan.",
            "It might also be separate skillsets, Kusakabe has managed to develop Simple Domain into an aggressive offensive option rather than being primarily defensive/reactive, so he would have less incentive to try and divide his focus between perfecting simple domain, and also learning Domain Amplification on the side, since DA's obvious advantage is that it allows you to go on the offensive with pure physical attacks.",
            "To be fair it's possible DA requires a DE, or at least all DA users we have seen have had a DE.",
            "The disaster curses are gonna wake up regardless and start killing people. Offing one of the disaster curses is easily more of a priority than a catatonic transfigurred human that got 6 months of info dumped into their distorted brain in 0.2 seconds.",
            "Fair point, but there was still a lot collateral damage of normal people dying when it was just Jogo, Hanami, and Choso fighting Gojo. One disaster curses is easily worth 1000 transfigured humans.",
            "I would post the screenshots of the chapter but i can't, its 225 if you wanna go re-read it.\n\nFor most of this I'm just quoting Choso who brings up the possibility during the fight instead of before the fight who uses his experience fighting Kenjaku and Itadori's+Inumaki's info",
            "i would post screenshots of the chapter but can't so ill recap it (its 225 if you want to look at it)\n\n1.Choso intuits based on yuki+yuji's info that sukuna could do a open domain\n\n2. Cue next page of everyone being shocked\n\nmy qualm is that choso comes up with this possibility only during the actual fight and not during the preparation.",
            "I have no idea how to post images in comments. But in 225 Choso mentions an open-barrier domain and Kusakabe, Yuta, Hakari, and Kashimo are shocked.",
            "Gojo clearly didn’t think so. He can easily take the disaster curses and he knows it, so he figured it was better to thin out the enemy ranks and then deal with the others once there’s only like 3 of them left",
            "Honestly not that many people die in B5. They kill a few people before hand but while fighting Gojo not that many civilians die\n\nThat’s because it’s hard for the Disaster Spirits to kill humans while also dealing with Gojo. The whole point of the Transfigured humans was to attack humans while Gojo was distracted with the disasters so Kenny could catch him off guard\n\nThe disasters have no reason to kill humans themselves, since if they did it would give Gojo an opening to kill them. It was safest for the civilians to eliminate the transfigured humans first",
            "I just reread it, and you’re kinda right. \n\nBest answer I can give you is Choso is a dick. No one else would know that open barrier domains are a thing. He’s the only one that saw Kenjaku do it\n\nI stand by my point that neither Yuji nor Inumaki’s would know it’s barrier less, however they both clearly noticed something was up, since Choso mentions them giving information about the domain\n\nWhat likely happened is Yuji mentioned the domain being large, Inumaki mentioned not noticing the barrier or something, and everyone assumed his domain was just super fast and large until Choso faced Kenjaku and learned that Open Domains are a thing\n\nIdk why he didn’t put that info together at any point between fighting Kenny and the Sukuna fight"
        ]
    },
    "Ijichi's Colosseum: Powerscaling Megathread": {
        "title": "Ijichi's Colosseum: Powerscaling Megathread",
        "score": 4,
        "url": "https://www.reddit.com/r/Jujutsushi/comments/1dihbr0/ijichis_colosseum_powerscaling_megathread/",
        "content": "Welcome to Ijichi's Colosseum, the [r/Jujutsushi](https://www.reddit.com/r/Jujutsushi/) bloodbath curse pit where  sorcerers can throw hands over hypothetical Jujutsu matchups! We've moved the thread back to Tuesday as per user feedback.\n\nIs Toji stronger than Ijichi? Would Sukuna beat Ijichi in a fight? Compared to Ijichi, is Kenjaku really a Special Grade threat?\n\nSate your powerscaling urges here!",
        "num_comments": 1,
        "comments": [
            "Reminder:\n\n- **DO NOT POST CHAPTER LEAKS** outside the pre-release leaks megathread. Officials are free range. See the sidebar for info on leaks.\n- Powerscaling should stay in the designated Tuesday Colosseum thread.\n- Repetitive or low-effort topics will be removed.\n- Questions that can be answered by reading the manga more closely should be posted in the FAQ.\n\n[Fanbook & Other Canon Material](https://www.reddit.com/r/Jujutsushi/wiki/canon)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Jujutsushi) if you have any questions or concerns.*"
        ]
    },
    "In order for the fight to be entertaining Sukuna HAD to use Mahoraga ": {
        "title": "In order for the fight to be entertaining Sukuna HAD to use Mahoraga ",
        "score": 106,
        "url": "https://www.reddit.com/r/Jujutsushi/comments/1dlqbp9/in_order_for_the_fight_to_be_entertaining_sukuna/",
        "content": "Gojo’s limitless really limits any creative fight unless you have a direct counter, you can’t touch him, he can touch you, so he pretty much beats you up. In Sukuna’s case (without Mahoraga) the only ways he has to combat Gojo are the Domajn techniques amplification and expansion. The fight without Mahoraga would be really short because it’s all decided by the first few domain battles, if Sukuna loses his domain or gets hit by unlimited void he has no other way to win. It limits the fight to an extraordinary length and takes away many of the planning and interesting parts we see of the fight because how limited Sukuna’s abilities are at countering limitless. ",
        "num_comments": 111,
        "comments": [
            "Reminder:\n\n- **DO NOT POST CHAPTER LEAKS** outside the pre-release leaks megathread. Officials are free range. See the sidebar for info on leaks.\n- Powerscaling should stay in the designated Tuesday Colosseum thread.\n- Repetitive or low-effort topics will be removed.\n- Questions that can be answered by reading the manga more closely should be posted in the FAQ.\n\n[Fanbook & Other Canon Material](https://www.reddit.com/r/Jujutsushi/wiki/canon)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Jujutsushi) if you have any questions or concerns.*",
            " Yeah, it’s weird that people call shrine boring but wanted Gojo vs Sukuna to not have 10S…like in what world is Shrine vs Infinity better than Shrine + 10S and infinity? Round 1 of the fight is almost how a Sukuna mostly using shrine would fight the battle, but without DE, he couldn’t really do nothing. Sukuna having a cursed tool or application of shrine that somehow can bypass Gojos hyper specific hax would be critiqued anyway",
            "Agreed. People act like Sukuna using Mahoraga is fraudulent but without Mahoraga, the fight wouldn't even last 6 chapters and would be pretty boring. Mahoraga or rather the Adaptation process is one of the key factors as to why Gojo vs Sukuna is so entertaining",
            "Yea the fight would definitely not be as long or fun if not for the shadows.",
            "Fax if there were no 10s the fight would've been finished at the domains.",
            "Sukuna's ultimate motive was to overcome the limitless CT as a whole by making his own CT even better thus Mahoraga and Gojo were really a means to achieve that\n\nRemember when Sukuna called Gojo \"painfully ordinary\" we all laughed at it but looking back it may have been more to it than him simply mocking Gojo cz by that time Gojo hadnt pushed sukuna far enough to  really force and upgrade on his CT\n\nAnd in 236 he remarked how happy he was and he wld never forget Gojo right after improving his CT and finally overcoming the limitless",
            "No matter which way Sukuna won, people (Gojo fans) will always be mad about it. If he was in yuji (let's imagine Megumi didn't exist, a 19 finger yujikuna in this instance) and the fight got to a point where they both didn't have their domains, then Gege gives Gojo 5 more chapters of him styling on Sukuna before Sukuna figuring out the WS then one shotting him, people will still be this mad and question why Sukuna is so smart in the first place. Gege knowing killing Gojo will make his fandom seethe and rage for years to come decided 'Hey, if they are going to be mad, let me find a way to maximize their rage!'. hence we had Gojo seemingly winning for so many chapters, feeding the narrative that he was so much stronger than Sukuna. Then the agenda also raised the egos of Gojo fans, making them even more sure that Gege would never give Gojo the direct L in that fight. They pretty much expected kenny to swoop in and take sukuna and run away or sum like he did with mahito. So when reality (236) hit, it was like a tidal wave came crashing on their perception of the fight. Egos were hurt, minds were bruised, hopes were dashed, and we haven't heard the end of it till now 😖\n\n  \nI imagine if Sukuna had the 10S and didn't use it to fight but still won, there will be crazy agendas like 'the limitless is so complex, even Sukuna knew and couldn't use the 10S to deal with it' and we'll start seeing some absurd infinity+UV scaling cross verse, and no one will be able to provide a good counter argument. But with what happened, it just showed us limitless is still a CT, no matter how complex it is, Maho just needed 4 spins to adapt fully to it. Kinda omega busted.",
            "I feel like  the fight would have been received a lot better if there was just a small extra thing to show gojos Death, Honestly if they had cut kusakabes speech bubble in half while he said gojo wins it would have been better, or the entire manga page having a line through it, (as he cut the world)",
            "I agree. Does that mean mahoraga was made specifically for Sukuna to fight Gojo on down the road?",
            "And yet the fight was still massively underwhelming because it ended out of nowhere. An unsatisfying conclusion sours the whole thing.\n\nThe middle part of the battle where Gojo was fighting against both Sukuna and Mahoraga was fluid and interesting. The problems arise in that, after the climax of the fight where a cool move puts the whole thing in Gojo's favour, we don't restart the momentum with the multiple gamechanging moves in Sukuna's arsenal we just cut to Gojo dead. Sukuna's can now bypass Infinity but he's effectively lost the ten shadows, they're both domainless and Sukuna still has a reincarnation in reserve that should be the start of the second cllimax of the fight, not the abrupt end. If Sukuna's way to bypass infinity which didn't instantly kill and let the fight continue to a more satisfying death for Gojo there would be 1000x less complaints.",
            "Hien sukuna without 10S would still beat gojo.",
            "Of course, HOWEVER, I expected Sukuna to have something in his own arsenal that could possibly bypass the limitless and Gege could have done that easily. \n\nWe never knew anything about Sukuna’s CT aside from the slashing and the fire, Gege literally had the freedom to add another power to Sukuna’s arsenal and it wouldn’t be asspull. Also we never knew what Kamutoke and Hiten were supposed to do, so either of these tools could’ve been a counter to the infinity. I always thought that Sukuna might had a CT or even cursed tool to bypass the limitless himself.",
            "big facts",
            "Well, yeah, and Gojo would've won.",
            "Heian Sukuna would have just won the fight in the domain battles.",
            "My best argument was always this:\n\n1- Gojo with his ultimate defense technique is slightly stronger than Sukuna just because of Hax. If we take the fight to the end, most probably the DE battles would have been the same, with exception to the first two where Sukuna could have burned Gojo, but that doesn’t necessarily means he wins. \n\nThen if both of them lose their DEs, then the fight still continues the same, Gojo chases Sukuna, Sukuna fights back with DA and RCT, until the battle of attrition turns into a case where either Infinity is very easily suppressed, cannot be controlled automatically but still stays on (can’t block everything essentially, since that’s how it works by identifying different things and blocking accordingly automatically), or Gojo has to keep switching between Neutral, Blue, Red, and Purple. \n\nIn this specific scenario, the fight is essentially the same, given that in a DE Sukuna still can’t use his CT to hit Gojo, since his Neutral would have been on, and post-DE, since Gojo kept chasing Sukuna and couldn’t do excessive damage before the adaptation, then it would have likely continued like this forever, until fatigue strikes both fighters, and then the fight becomes on an equal scale. \n\n2- Sukuna with his ultimate attack is slightly stronger than Gojo - unless it is used abruptly with a BV that helps in making it hit; in this case Sukuna is massively stronger, because really if you have an attack that can bypass the strongest defense, then naturally that Hax overrules yours, and puts you on a lower scale. In this scenario, and let’s imagine Gojo does not get ambushed, and while the attack does appear to be excessively hard to do anything against, it has pre-requisites and can be seen by Gojo. So in case he can avoid it once, then the scale goes back from Sukuna massively stronger than Gojo, to only slightly. \n\nBut even with all that, imo Gojo still remains slightly stronger than the King of Curses given the fact that this ultimate attack is non-existent in scenarios without the TS. Meaning we go back to ground zero, where if both lose their DE, it becomes a battle of attrition and luck, and where one wins the DE, then that battle was a battle of luck mixed with ultimate skill…\n\nHope that makes sense. But tbh, with all that’s happening, I think it’s all to point out just how massively strong both Sukuna and Gojo are. Any person that is considered at the top of the power scale, or the strongest of strongest, regardless of who we are talking about, they are always a grade or two lower than the enlightened ones.",
            "No Sukuna was not trying holding back even tough he had to run a gauntlet, why would u hold back if you're running a gauntlet ? He obviously wanted to upgrade his CT cuz it's within his character to almost die mid fight like an idiot even tough Sukuna's plan ended in 230 when he got brain damadge and had to improvise with Mahoraga",
            "True. It's just a bit unsatisfying that we never really got to see if gojo was right when he said \"nah I'd win\". Because that statement was about Sukuna without Mahoraga. Alll we can do now is speculating.",
            "\n\n\nTRULY hilarious thing is how Gojo agenda is literally \n\n\"NOOO YOU CAN'T INCREASE YOUR STRENGTH, YOU HAVE TO BE OP FROM BIRTH WITH PRETTY EYES AND STUPID HAX\"",
            "I understand what you are trying to say. Gege had huge expectations to fill for the final fight and ending the battle with just domains seems reasonable but boring. Since domain is the peak of jujutsu and it makes sense you defeat anyone with it alone mostly. So using ten shadows spiced up the fight and kept it interesting. In that sense it is logical.\n\nMy personal opinion is that the ending of the fight was disappointing. As a sukuna fan, WCS was a huge power up and it definitely didn't suit the power system. It can't be properly defended and causes a lot of inconsistency. An alternative way for bypassing the limitless would have been better in my opinion. Like a modified domain amplification that diverts the CT that it comes in contact with instead of simply bypassing it. This technique is customised for only the neutral infinity, thus a binding vow is formed. \n\nThis would extend the fight a little further, ending with sukuna using this special type of domain amplification which he learned from mahoraga's first adaptation which he then modified to be able to use it himself. Sukuna can use his CT while keeping it active and pass through neutral infinity and defeat gojo. Though it can divert neutral infinity, it can't divert red or blue. This makes it balanced and interesting to use and end the fight with.",
            "> People act like Sukuna using Mahoraga is fraudulent\n\nPeople are just biased in general, same with Malenia using Scarlet Aeonia, as if Radahn would actually call her a cheater or some shit. \n\nIts a deathmatch baby, you should use every tool at your disposal.",
            "they never apply this consistently and call people like yuta or kenny frauds for doing the exact same shit in different fonts either.",
            "\"Mahoraga is necessary to make the fight entertaining\" and \"Sukuna is a fraud because he had to steal Mahoraga to stand a chance\" are not contradicary statements.\n\nOne is about how an action is good for the narrative the other is about how an action changes the perception of a character. It doesn't even make Sukuna weak it makes him smart but that is a change in his overwhelming portrayal.",
            "I don't know how anyone expected Gojo to win, for the story to move forward and Yuji to eventually beat Sukuna's ass (unless Gege's fucks that up), Gojo had to lose. Kenjaku jumping in and saving Sukuna, which wouldn't be plausible as Gojo could just beat him quickly as well, wouldn't serve any good purpose",
            "Holy shit keep cooking",
            "Megukuna without 10s would've won against gojo. Actually every form of sukuna would've won against gojo. \n\nGojo managed to damage megukuna without DA enough in 3min to have a stalemate. Because of all the damage he managed to hit megukuna with UV. \n\nMegukuna without DA = punching bag for Gojo ( megukuna can't touch gojo BC of infinity)\n\nMegukuna with DA is equal to gojo h2h( meaning gojo will need way longer than 3min to damage sukuna enough to destroy his domain) but sukuna already destroys Gojo domain in 3min . So gojo loses every domain, and won't be able to hit sukuna with UV. \n\nIf gojo managed to survive all those domains he lost ( which I doubt) he will be finished when his brain is damaged from RCT in 230.",
            "Now that's a proper joke!",
            "Sure",
            "Do any of you actually read posts?",
            "I mean that depends. The latest manga chapter shows us that Gojo's condensed domain can withstand malevolent shrine striking from the outside for 3 minutes. Would Sukuna survive 3 minutes of unlimited void? probably not.",
            "Sukuna was absolutely holding back with the intention of upgrading himself. However his plan backfired and that's why those near death situations happen. If his plan had worked the fight would have been over by ch 230, but sukuna would not have had brain damage, would have mahoraga and the 10S and the space slash on top.",
            "when you're told by multiple people, even your GOAT, but then you say that's not the case, is that delulu or..? To say Gojo is stronger than Sukuna is fine, it's your opinion, no one's gonna change your mind, even your Gojo and Gege tried and couldn't do that lol, but to say Sukuna isn't holding back, or hasn't been, is kinda crazy 🤷‍♂️",
            "I will say tho, he said nah I’d win again in front of Sukuna even knowing he had the 10S and Mahoraga",
            "Sukuna using Mahoraga to produce a model he could replicate is better than him just learning how to kill Gojo out of nowhere\n\nAlso DA working on your CT would be way more broken",
            "And the funny thing is, it's a top tier showcase of skill from Sukuna, turning himself into a cursed object I mean. He waited to take over Megumi(after analysing Ten Shadows) from the beginning and after witnessing Mahoraga, taking over Megumi became even more of a wet dream for Sukuna. \n\nIt's sad that the skill showcased by Sukuna is overlooked by people calling him fraudulent for taking over Megumi.",
            "Actually Malenia hated doing that shit. It was described as something abandoning her honor or some shit. She did that cuz she was overcome with despair or something cuz she wanted to help her brother, Miquella.\n\nHell, Radahn and Malenia were both honorable since Radahn didn't attack while her prosthetic arm was knocked off, and Malenia didn't attack Radahn while he was picking up his swords.\n\nAlso considering Leonard didn't die or get hurt, I'd like to think she didn't attack him cuz of honor and shit.",
            "Well the reason ppl dog on Malenia for using it is because she still lost Lmao, one of her subordinates had to literally drag her off as Rahdan dealt with the side effects of insanity, he was capable of fighting and she was not.",
            "This is my biggest problem with the fight. Gojo never stood a chance narrative wise.",
            "There are ways to write around this. Gojo could've defeated Sukuna and still ended up dead, incapacitated or heavily nerfed (maybe due to binding vow?), so he's not able to full solve everything. \n\nThe conditions for the merger could've been different for it to seem more attainable by Kenjaku and make him seem as much of a threat as Sukuna for the rest of the cast to deal with. Heck, maybe even now there could be a loophole that allows it to happen without having to kill everyone, so maybe not even that would have to be done. \n\nAnd I'm not saying that this is necessarily better, it's just that I disagree with the idea that Gojo had to lose for the story to still be tense and exciting.",
            "I still think it's cheap we weren't shown how Gojo lost. \n\nI accept he had to lose to move the story forward, but I would have preferred to *actually see* Sukuna beat him and not just be told \"it's done, w/e\".\n\nGege probably wanted us and him to have the cake and eat it too. Let the fans believe for a sweet moment their favorite character pulled out a victory.... and then move the story forward.",
            "Keep in mind, Sukuna was holding a hostage just by being inside Megumi. The fight could have played with a more emotional angle, make Gojo reminisce a bit about his adoptive son (and not forget about him in the midst of battle). Instead of Sukuna eyeballing OP techniques it'd be him negotiating with Gojo for Mebumi's release through an equivalent binding vow.",
            "Not even joking. Hien sukuna would have won the domain clash. I could explain it if u are interested in knowing how. You are welcome to refute it",
            "I’m dying of laughter",
            "Sukuna cannot survive for 3 minutes if exposed to UV but could Gojo manage to break Sukuna's domain before the 3 minutes? Fyi, Sukuna was literally a milli second(0.01 second) away from victory even though he HAD to get beaten up for the adaptation process.",
            "Are you seriously comparing this f’d up sukuna who has killed Gojo and run the gauntlet nonstop, lost his tongue and arms, a damaged brain & significantly reduced CE to a fully healthy heian body sukuna.. just delete your comment and try again",
            "His plan was never to improve, he wanted Mahoraga to disable UV so he could then trap Gojo in a Barriered MS which was his plan up until 230. Until 🧠💥",
            "And what did my Goat say exactly, quote him",
            "There’s two “Nah, I’d win”’s. The infamous one is post-Megkuna, yes, but the first time is early in the series when Yuji asks him would he lose if he fought a full-powered Sukuna.",
            "That's right. But I still want to know if he was right at first.",
            "Sukuna learned this a bit from seeing how mahoraga's adaptation interacts with neutral infinity and how neutral infinity interacts with other things during the fight.\n\nWell a DA that works on only neutral infinity is powerful but it is also vulnerable to red and blue, even weak ones. Once gojo realizes this, he would create some distance and start launching red and blue or close in and start spamming blue reinforced punches. So it is reasonable in that sense besides neutral infinity it doesn't block any other CT or extensions of the same CT.",
            "To add another thing, Sukuna also saw the potential of the reincarnation to be used as a full body heal by not completing the process. Gojo's undeniably strong because he is a genius combined with having the completely busted combination of Six Eyes + Limitless, but there's something more... satisfying in Sukuna's strength. He has a mid CT, but it's his understanding of jujutsu, his thinking outside the box and creativity that makes him a complete menace.\n\nSukuna's domain is the perfect example. The sure-hit is very basic, but it's the King of Curses' skill in barrier techniques that makes Malevolent Shrine almost impossible to overcome in a normal domain clash. Sukuna's domain barrier is not only open (called an impossible feat, a divine technique), but he also adds the targetting system to it as well having Dismantle attack anything with no CE while Cleave kills anything with cursed energy. Compare that to Gojo's... who literally has a seperate special attack he can only use inside his domain that at minimum can stun someone... and at maximum could makes your brain into a mush. Satoru himself commented when he lost the 1st domain clash and got sliced up that his sure-hit is much better than Sukuna's.\n\nAnother interesting thing to compare is Gojo and Sukuna's ultimate attacks. Gojo only has to combine Red and Blue to produce the insanely powerful Hollow Purple. Sukuna on the other hand has the fire arrow that had incredible firepower, but is slow and has small range, so he improved it with a binding vow. On top of that he combines it with his domain, displays his skill in barrier techniques once again by closing his domain to anything but humans and creates an air tight space. Then he charges the debree with an explosive-like CE and explodes everything by releasing the fire arrow, creating series of explosions, shock waves, compression and decompression that annihilates anything in range. I mean... if people can't see how that attack is a testimant on what level Sukuna's brain works on when it comes to jujutsu... I don't know what to say.\n\nAnd as to the main point of the TS technqiue... for me it was an obvious display of how skilled Sukuna is. People always look at it the wrong way. I always see it from the angle that Sukuna took over Megumi and in just a month of having TS pushed it to its maximum potential (as far as we know) and competed with the strongest Six Eyes + Limitless user who's mastered his CT to near perfection. I always say this... if TS is soooo busted and Sukuna got so very carried by it then give it to Kenjaku, Yuta or Yuki and throw them against Gojo, surely they'd do as good as Sukuna, no? I can guarantee you they wouldn't last a minute. People just have a hard time accepting that yes, TS has great potential, but it was because Sukuna was the one wielding it that it was possible to realize said potential. Mahoraga was just a suicide move for a TS user before Sukuna for a reason.",
            "Put the part where some how sukuna could hurt yuji is top tier bs though",
            "No proof he was immediately capable of fighting after the bomb. Also he completely lost all sense of self. In no way is that a win",
            "And Radahn was too insane to finish her off, making it a perfect draw. Being technically capable of fighting doesnt mean shit if youre too stupid to actually kill your enemy. \n\nAnd unlike Radahn, Malenia actually got even stronger after that fight.",
            "A scene where Gojo and Sukuna agree to some sort of binding vow where Megumi is free but Sukuna gets his full body would be great, if it involved Gojo being outsmarted somehow. Much more satisfying than the narrator simply telling us all of Sukuna’s vows ",
            "Please explain.",
            ">but could Gojo manage to break Sukuna's domain before the 3 minutes?\n\nNobody can break Sukuna's open domain since there's no barrier to break. For the domain to 'crumble' Gojo had to fight Sukuna and injure/hurt him to an extent that he couldn't maintain his domain.",
            "That’s incorrect. Sukuna didn’t need to get beaten up, he just needed time to pass for Mahoraga’s adaptation through Megumi’s soul ",
            "True that's fair.",
            "Not really. The adaptation was on megumi. He didnt need to get beaten up, he just needed to use domain amp enough to stop getting beaten up, and even that proved very difficult",
            "Not exactly. He wanted to adapt thats why even after Gojo's supposed defeat he still went for mahoraga adaption to infinity. Mahoraga adapting to UV was removing cards from the hand, but not the goal of mahoraga.",
            "You Goat said the king of curses DIDN'T give it all he had, not COULDN'T. He said, even after fighting him for 13 chapters, after getting his back in the corner multiple times, with 3 clear cut chances to win, he still CAN'T envision himself winning against a king of Curses who had no Megumi, a humbling statement that left even his best friend shocked. I don't know how you read that and thought Gojo said Sukuna definitely went all out. But hey, that's just my perception, Gege,Gojo and I might be wrong, who knows 🤷‍♂️",
            "You mean one of Itadori’s defining character traits is bullshit?",
            "Radahn was literally still able to give us a good fight however many untold years later with the scarlet rot eating away at his brain all that time. He would definitely have dealt with (eaten perhaps) the unconscious Malenia. He can clearly recognise threats and fight.There was a reason she needed to be emergency carried across the continent while unconscious for that whole time.",
            "Im stealing the guys role here but eh, basically heres the deal.\n\nIn the original fight, the domain clashes ended in a draw. Gojo couldnt use his domain anymore because he restored it too often with RCT. Sukuna on the other hand couldnt use it because he was hit by Unlimited Void. Meaning if Sukuna was never hit by Unlimited Void, he could open his domain, close his barrier and trap Gojo inside. It was stated multiple times in the fight that Gojo cant survive for a long time in MS, only for a short period.\n\nNow, how did Gojo hit Unlimited Void? Simple, he damaged Sukuna to a point he couldnt maintain his domain, then, while Sukuna was busy healing himself from his injuries, Gojo opened up his domain, giving him the advantage.\n\nAgainst Heian Era Sukuna this never happens. Heian Sukuna \n\n1. Isnt playing defensively during the clashes for Mahoragas adaptation -> he always uses DA\n\n2. He is physically more capable than Meguna\n\n3. He has 4 arms for Hand to hand\n\nGojo BARELY managed to break Megunas domain in 3 minutes, against Heian Era Sukuna with these conditions, he will never pull it off. Sukuna will always break Gojos domain first. This will end with Gojo being surprised by the sudden wave of slashes, giving Sukuna the time to heal up all his injuries, putting Gojo back to square one.\n\nThe fight goes on like the original, Gojo loses his ability to use DE after the fifth clash. Sukuna keeps it and the scenario I presented takes place.",
            "We cant be certain how it would play out but sukuna Wouldnt had need To tank and heal several of gojos attacks if it wasnt to make mahoraga adapt hence he Wouldnt have been late in activating his domain",
            "Read my comment above, I explained it. Comment if you don't agree with it.",
            "Yeah I should have phrased it better",
            "It's not very difficult to beat even Heain Sukuna within 3 minutes since Gojo would be using his full CT, and Sukuna would not be since he has to use DA to even get a shot in.",
            "You are misunderstanding my point. For the Adaptation process, Sukuna needs to keep the usage of Damp to a minimum so that the process of adaptation is faster. In order to hasten the process of Adaptation, Sukuna has no choice but to use Damp to a minimum which leads to him getting beaten up.",
            "No if sukuna turns on domain amplification mahoraga can't adapt even with megumi. he has to turn off and on domain amplification multiple times to adapt to UV. Read chapter 230",
            "He still went for adaptation cuz he couldn't effectivly bypass infinity after losing his domain to brain damadge",
            "Removing cards was Sukuna's only purpose for Mahoraga. Since after Maho disabled UV sukuna had no problem with killing Gojo in his domain",
            "I still would have preferred for Gege not to say Sukuna was scared or generally keep things more plain. This is as little flaw for me. It's also kinda related that we don't know don't even know what is Sukuna sacrifing for his BV. Like what, now he can't eat cereals but can use his DE with only one hand sign? Cool, but at least lmk.",
            "The issue with that statement about Sukuna not going all out is that it makes no sense from what we where shown, which was Sukuna straining his powers so badly that he gave himself literal brain damage, very nearly dying more then once, and then after the battle he was in such a bad shape that he's been getting whittled down and more then likely soon to be beaten by sorcerers far weaker then him\n\nI can respect the narrative idea of making sukuna the real strongest and making him all badass and cool \"Hes so awesome he doesn't have to go all out even against the strongest sorcerer of the modern age\" but Gege could at least have tried showing that a bit better in the actual fight instead of just making gojo randomly say it at the very end. so i cant really blame people for arguing about it after so long",
            "The reading comprehension strikes again",
            "That's assuming, that Radahn was still conscious (if you can even call it that) and in fighting condition right after getting nuked. It would probably take a significant amount of time for his Great Rune to burn at the rot long enough for it to be managable. If Radahn was in a condition to just go up and still be capable of fighting and finishing off Malenia, why didn't he just kill Finlay, when she was taking her away? The two must have been in close proximity after all, since Malenia nuked Radahn, while basically standing on him, according to that one trailer, so it's not like Finlay was picking her up at some safe distance, with Radahn too far away to do anything.",
            "> Radahn was literally still able to give us a good fight however many untold years later with the scarlet rot eating away at his brain all that time.\n\nMalenia was affected by it for way longer, and did the same. \n\n> He would definitely have dealt with (eaten perhaps) the unconscious Malenia. He can clearly recognise threats and fight.\n\nYeah, and unconscious people arent considered threats. \n\n> There was a reason she needed to be emergency carried across the continent while unconscious for that whole time.\n\nBecause they were in enemy territory during a war, not to mention she just turned the place into hell. Who knows when the Kindred of Rot popped up either. \n\nEven if she did get killed, she might've just bloomed again anyway, like she did in our fight.",
            "Dude what are you talking about? \n\nGojo was using his full CT against a Meguna who was literally unable to use DA much because he was passively using 10S to get Mahoraga to adapt and Gojo STILL only survived by 0.01 seconds. Gojo was basically beating up someone with no CT, who literally couldn't touch him and still needed 3 mins to do significant damage.\n\nHeian Sukuna has far greater stats, 4 Arms and 2 mouth and would be able to use his CT inside the domain as he's not worried about 10S anymore. He can also use Hollow Wicker Basket while still having arms to fight.\n\nGojo literally wonders why Sukuna didn't blow apart Gojo's new domain from the inside with dismantle and it's because he was using 10S which he wouldn't be here. So he would be able to break the domain apart from inside and out.\n\nHeian Sukuna with DA is simply going to outlast the 3 mins every single time and just mince Gojo afterwards.",
            "Gojo barely pulled it off in 3 minutes against a Meguna who played defensively for Mahoragas adaptation. How do you expect Gojo pulling it off against Heian Sukuna with 4 arms who isnt playing defensively",
            "He didnt know his domain was disabled.\n\nHe litteraly said now i will adapt to your infinity while i carve you to pieces. He tried to open his domain and it didn't work.",
            "And still he wanted to adapt to infinity, that was the ultimate goal. Everything else was a perk.",
            "that statement alone cause majority of the Gojo fandom to cream their pants. Their GOAT had the advantage, and was 'beating' fear into the so called 'strongest sorcerer in history'? what more could they ask for? In hindsight, yes, people will be mad about anything, but if you go back and ask a gojo fan if he'll ever like gege to put that statement into the fight, the answer will be unanimous: Yes. Sukuna seemingly scared was a perfect way to hype up Gojo, and as a sukuna fan, I want that over any other iteration of their fight. At least in this version of the fight, Gojo fans have an infinite (just 13 lol) chapters of slander and memes to get at sukuna fans, Sukuna fans have one chapter to clap back, just like infinity vs WS, a perfect balance. \n\n  \nWe know what he sacrificed. To miantain shibuya level domain in range on top of being incomplete, his domain could only last 99 seconds. Now against yuta, he doesn't need to maintain the range, erasing the bindig vow of a time limit. Remember, on top of being an open barrier domain Sukuna maximizes his advanatage by making binding vows to increase shrines output past it's peak (at 200 metres), whenever he shrinks the domain. So if his domain has it's highest output at 200 metres, it goes higher, whenever he shrinks his domain. The binding vow is just to take advantage of the fact that he CAN shrink his domain, it (binding vow) doesn't shrink it for him.\n\n  \nThe modified hand sign wasn't included as part of the binding vow Sukuna made, till it will be specifically stated at least. The main assumption will just be of his ability to copy any application of Jujutsu he's theoretically capable of doing himself, since he's capable of modifying his hand signs, he did, after seeing Gojo's own. How far back as to when he might have copied it, we don't know. He might have even copied it when Gojo purposefully showed him everything about his domain against Jogo.",
            "But that wouldn't have created the hype around Gojo losing as much as it would have. Gege had the option of feeding Gojo fans what they wanted-Gojo looking like the G.O.D of JJK in that fight-because he always had the option of saying Sukuna wasn't going all out in his back pocket, and he took it. Not only did that create so much strong positive emotions in the minds of Gojo fans (till 236), but it prepared the stage for those strong emotions to turn to pure hate, which Gege wanted.\n\nIf Gege had made it fair battle, and Sukuna defeated him by overpowering him, Gojo will lose A LOT of fans, and I mean a lot. 'We are loved because we are strong': Sukuna, he was also talking about the fans to. Granted Gojo is more than just his strength, but the core of it all is still his strength. Gege understood the likes and dislikes of the fanbase of his most popular character, and he COOKED them a 10 star buffet.\n\nBut ultimately, Gege needed to continue his train of treating villians bad. He treated Mahito dirty, he treated Kenny dirty, and he's prepping the stage to treat Sukuna the dirtiest, and he's taken the first step: Garner enough hatred on him so that when he's taken out, it will only be pure hate and slander he receives. There are no redeeming arcs for villians in JJK, they all get treated like shit, and all we have for them after their death is slander. I must say, I haven't seen it any other type of manga, this is the first for me.\n\nI always imagine it like a football game. I am going to play the best player of this gen, + 10+ people, and finally an AI specifically created by the devs to wipe the floor with any human being. And after every match, my health bar stays the same way it is, everyone else has the chance to have fresh health bars against me.\n\nI have the advantage of having a star player (messi) on my team, the best player has (best keeper), and only God knows what players the AI has.\n\nWe begin playing and ronaldo hits the crossbar 3 times in the match, scaring me on the third one, as the match only remains 5 minutes. , At the last minute, With all my defenses stripped, when he's on the counter, I find the whole in his defense I've been looking for all game, and I scored with messi through that just before the final whistle.\n\nBut then fans of the best player watching the match say I cheated, I shouldn't have had messi, it's not fair that the best player had the most possession, hit the bar3 times and still lost, but then he (the best player), says I was holding back and he frankly doesn't think he would have won even if I didn't have Messi. Obviously his fans will disagree because they watched the game from a particular lens, but the best player played the game, and understood the intricacies of the game and the real quality of the game at which I played at that the fans couldn't see or feel.\n\nThere goes me ranting again 😖",
            ">It would probably take a significant amount of time for his Great Rune to burn at the rot long enough for it to be managable.\n\nWhere did that come from? It's never manageable for him and he's just getting worse afterwards.\n\nI presume Radahn took a little bit to get up and going again but definitely not a significant amount of time. In this time Finlay took Malenia and fled. Malenia was then in a coma for a huge amount of time, from the whole journey and even afterwards. Radahn would definitely have recovered first.",
            "Malenia never mentally crumbled to the rot like Radahn but her body did. Radahn lost his mind but his body held up. He's also still capable enough to be using his sorcery to not only hold back the stars but to also use Leonard the whole time.\n\nYeah unconscious Malenia wasn't a threat but she was also literally on top of him with a sword plunged into him. She would be one of the first he eats given she was literally stabbing him.\n\nFinlay is the MVP by coming in and saving Malenia.",
            "By using blue and red, which Sukuna has zero counter to ",
            "I hate to break it to you buddy, but in the japanse chapter, Sukuna used the kanji 無限の when talking about adapting, which is only used when talking about the Limitless-Technique, NOT infinity by itself, so what it actually said is that Sukuna will adapt to limitless while he carves Gojo to pieces",
            "No riding Gojo of UV was his first priority.",
            "As a \" \"Gojo fan\" \" I don't like that statement. You can't be scared and still have some things to use. Realistically it doesn't make sense. But maybe that's just me. Again, keep things plain. He could have said anything else. For me that just doesn't make it. Again, maybe that's me.\n\nAgain, he optimizes shrines output by binding vows. How do they work? Are they explained? No. You literally can't form an opinion on it. You just have to accept it.\n\nBtw i was referring to the part against maki and Yuji and Yuta. He does some stuff that can only be explained by him making continous binding vows. But since they are not stated, that's it.\n\nOn top of that, afawk, Sukuna can do that bc he is Sukuna. Nothing more, nothing less. Ik we will know why he is so strong, but that time must be near, bc it's becoming frustrating.\n\n\nAt the end for me it feels like Gege is pushing it to sell more copies. It's probably not even their fault, it's how the market works, but damn",
            "I don't find it farfetched, how right after being nuked, he would enter into a critical condition, which would be rapidly deteriorating, until his Great Rune kicked in, halted the rot's advance and gave him leeway to (eventually) stabilize.\n\nHis rune's description states: \"The Great Rune burns, to resist the encroachment of the scarlet rot.\", so it's not like he's just left there to be devoured from inside by the rot, but it's actively being suppresed by his rune.",
            "And you think Gojo just didnt use those AT ALL in the domain clashes, the same domain clashes we barely even saw? \n\nHe had no reason to hold them back what makes you think he didnt use them? \n\nEven then, Gojo hit Red on Sukuna only when he either caught him off guard or from behind a pillar. His chance to him them again like that is extremely low, and if he does get hit, Heian Sukuna is physically more durable than Meguna and is permanently using DA, he can reduce the damage of Red to some extent. Gojo gave his all to beat up a Meguna who played defensively for Mahoraga and he took 3 minutes. This is a fact shown clearly in the fight. Against a Heian Sukuna who is\n\nA. Not playing defensively for Mahoraga (meaning he uses DA all the time)\n\nB. Is physically more capable \n\nC. Has 4 arms for Hand To Hand combat\n\nHe just wont be able to pull it off",
            "TLDR: 無限 refers to \"Infinity\", which is the neutral form of Limitless. Go back to Satoru's first fight with Jogo and you'd see that that's how he explains \"Infinity\". The word used for Satoru's Cursed Technique, Limitless, is 無下限, so your interpretation in that specific line isn't correct.\n\nShishiso's(previous members of TCB) translator's note regarding the use of 無限:\n\nT/N: “Neutral Limitless” is Gojo’s inviolable space “Infinity”. “Blue” is a reinforced “Infinity”.    \n  \nSide Note: Actually, the term 無限 (infinity) is used in JJK either as a synonym/short for Gojo’s 無下限呪術 (limitless) or to refer to the concept of infinity itself. 無限 (infinity) is not an established term in JJK nomenclature that refers to Gojo's inviolable space or neutral “limitless”. Jogo used to call Gojo's inviolability “infinity”, in which case it falls under the first category of being a synonym/short for “(neutral) limitless”. In the same sense, 不可侵 (inviolability) is also not an established term in JJK nomenclature. Both “inviolability” and “infinity” are just common nouns that can be used to refer to Gojo's neutral “limitless” depending on how they are phrased. These are some of the occasions where the term “infinity” were used:  \n  \n(1) The inviolable space created with the power of “infinity”. (In the Fanbook)  \n  \n(2) The barrier that manifests infinity and prevents contact. (In the Fanbook)  \n  \n(3) I just bring infinity into reality. (During Jogo vs Gojo)  \n  \n(4) The “infinity” between you and me. (During Jogo vs Gojo)  \n  \nBut none of the above indicates that “infinity” is an established JJK term, especially since many of them are not put under quotation marks. It's just used as a common noun (with some emphasis on some using quotation marks) here to refer to the concept of infinity that Gojo can bring forth into reality.  \n  \nBut since the English Fandom is already treating “infinity” as an established JJK term referring to Gojo’s neutral “limitless” or inviolable space, then we're just going to do the same too.",
            "Show me the scan.",
            "Adapting to infinity was the ultimate goal, adapting maho to UV was the first step as it makes the rest easier.",
            ">His rune's description states: \"The Great Rune burns, to resist the encroachment of the scarlet rot.\", so it's not like he's just left there to be devoured from inside by the rot, but it's actively being suppresed by his rune\n\nI don't think the Great Rune protects him from the rot at all. It's more likely protecting itself to not end up like Malenia's Great Rune which is rotted. Or alternatively he's protecting it himself and making it burn to keep it safe.\n\n>his Great Rune kicked in,\n\nGreat Runes are usually vulnerable to the rot shown by again the state of Malenia's. Again it seems more likely that he was what was causing it to burn. Flame of the Redmanes and all. His troops did know to use fire to hold off the Rot so maybe Radahn taught them that.",
            "I mean, he was? He used them in all the domain clashes we saw, and he landed a red prior to the pillar...Sukuna is just Sukuna and was still able to last but eventually Gojo outplayed him  \n  \nI'm not sure if 4-arm Sukuna would 100% beat Gojo in H2H, but Gojo definitely can still win with just blue and red\n\nSlight side note: Sukuna was using DA the entire time inside the domain, it was only outside that he would pause the adaptation",
            "What am i supposed to take from this ?",
            "How lol ?",
            "Where do you get the whole \"it was the ultimate goal\" from lol.",
            "1. Yeah he landed a red because Sukuna didnt know Gojo could restore his CT that fast, he caught him off guard with it. In a domain where there are no objects Gojo wont be able to catch him off guard.\n\n2. You just stated yourself he used them in the clashes. I dont get how you think he will take the same time to beat Meguna in the clashes compared to Heiankuna when Heiankuna is leagues above him, especially considering the conditions I just described.\n\nYour side note is false, Sukuna didnt use DA all the time inside the domains. The manga outright stated that Sukuna didnt target himself with his sure hit effect so Megumis soul would always get hit by UV and speed up Mahoragas adaptation (since he put the wheel/the burden of adaptation onto him). It outright says so in the manga. He played defensively. There is a reason Gojo magically started whooping him inside the domains but not on the outside.",
            "How am i supposed to believe what you are saying without the scan in Japanese. I would like to check.",
            "After specifically comparing the Kanji, its specifically INFINITY, not limitless the thing in question.",
            "His ultimate intend was always to adapt to infinity as stated in ch 230 and 236, and implied in ch 224."
        ]
    },
    "No, Higuruma could not have known his technique would confiscate Cursed Tools first.": {
        "title": "No, Higuruma could not have known his technique would confiscate Cursed Tools first.",
        "score": 359,
        "url": "https://www.reddit.com/r/Jujutsushi/comments/1dl6ds4/no_higuruma_could_not_have_known_his_technique/",
        "content": "A common line in other subreddits is \"I refuse to believe that Higuruma didn't encounter at least one cursed tool user\" or \"How did Higuruma not train with at least one cursed tool user during the month timeskip?\" \n\nHowever, I find this pretty easy to believe, based on the following pieces of evidence:\n\n1. There are very few existing cursed tools that already existed within the Culling Game barriers.\n -  No Culling Game colonies were created over the locations of known Cursed Tool stockpiles. \n - Kenjaku lost control of Juzo Kimiya's stockpile, as [Maki was able to access the workshop and take a tool from it.](https://i.imgur.com/0NUVSpu.png)\n - [The Zenin clan has a stockpile of cursed tools, and it was destroyed by Zenin Ogi in Perfect Preparation.](https://i.imgur.com/0NUVSpu.png)\n - Jujutsu High has a stockpile of Cursed Objects in general, due to Jujutsu Society wanting to centralise all cursed objects for safeguarding. This stockpile [may be tied to the Kamo clan](https://i.imgur.com/zTFCqo6.png), due to the fact that the Death Painting Wombs were likely property of the Kamo clan, but are stored in the Jujutsu High stockpile.\n - No colony was created in these locations.\n - Cursed tools worth their while are rare, and expensive as a result: Playful Cloud costs [500 million yen in 2018](https://i.imgur.com/gcpSj1Q.png), which is 4,560,600USD ($5,701,321.82 today, accounting for inflation of USD), at a bare minimum. This is a cursed tool that does not have a cursed technique. \n -  Even though Kenjaku has control of the Kamo clan stockpile, Kenjaku does not have any reason to distribute weapons to the Culling Game players. This achieves nothing. \n - Of the confirmed Cursed Tools that originate in the Colonies, two are part of the operation of a Cursed Technique: [Charles' staff fills with ink as his technique progresses, and is used to initiate his technique.](https://i.imgur.com/rnoKnhE.png) Higuruma's Mallet [is created by his technique](https://i.imgur.com/iZiYo2c.png), and becomes the Executioner's Sword. Kashimo's staff is a religious object, and isn't confirmed to be a Cursed Tool, and shows no indication of being one.\n - If a Cursed Tool is part of a Cursed Technique, then confiscating either the Cursed Tool or Cursed Technique would have the same result, and may in fact be the same thing. \n - Unlike the reincarnated sorcerers, the Cursed Spirits are not reincarnated into human bodies, but had formed contracts with Kenjaku, and retained their possessions. Kurorushi pulls a sword out of his body. It may be part of Kurorushi's Cursed Technique, but if it isn't, then it has retained it from prior to the start of the Culling Game.\n - Reincarnated sorcerers are incarnated into the bodies of ordinary people, who do not have Cursed Tools.\n2. Cursed tools are not easy to create.\n - We've only seen three people explicitly capable of creating Cursed Tools that extend beyond repeated use: [Juzo Kimiya](https://i.imgur.com/mGnI2im.png), [Zenin Mai](https://i.imgur.com/Ze086zC.png), and [Yorozu](https://i.imgur.com/CJqHc5I.png). Note that the last two individuals were only able to create high tier Cursed Tools by sacrificing their life.\n - Tools created via repeated use take more than several years to create: In Miwa vs Maki, Gege notes that Miwa's sword is a ['sorta-cursed tool' created from repeated cursed energy infusion](https://i.imgur.com/oYzIn4E.png). Miwa's sword is broken by Kenjaku with his bare hands. Nanami's Cleaver is another example of a cursed tool created through repeated use, over a longer period of time than Miwa, [but it was only a cursed tool after his death.](https://i.imgur.com/8hphe6G.png)\n4. For many sorcerers, there are reasons not to use Cursed Tools.\n - Modern Jujutsu society has a taboo against the use of weapons overall, which extends to Cursed Tools: Part of the reason for the heavy discrimination against Toji and Maki was because they *needed* to use Cursed Tools. [Naoya looks down on the other Zenin clan members for needing weapons, while pointing this fact out.](https://i.imgur.com/02Bwf45.png) The re-incarnated sorcerers are believed to have [a mindset that revolves around strength and battle.\n](https://i.imgur.com/EqqhHkd.png) It's likely they may have a similar form of taboo.\n - Cursed Tools require weapon training to use effectively, and most Jujutsu High sorcerers involved in the Culling Games only appear to have rudimentary weapons training at best.\n - Many have fighting styles that a weapon is unaccommodating to, such as Yuji and Todo. Using a Cursed Tool would require a total change in how they operate.\n - [Naoya's reasoning behind the taboo is sound: if you disarm a sorcerer who is wholly reliant on their weapon, or break their weapon, they will be helpless.](https://i.imgur.com/QdDnIqr.png)\n - [Against a Cursed Spirit of a significantly lower power than Sukuna, a blow from a Grade 1 sorcerer using a powerful Special Grade Cursed Tool on a weak spot was not sufficient to kill it.](https://i.imgur.com/coTGD7G.png) Even if the tool is worthwhile to use generally, it may not be useful enough to use against Sukuna.\n\n4. Higuruma has no reason to use his domain on a Cursed Tool or weapons user during the timeskip.\n - Maki is immune to his Domain.\n - There's no real training Higuruma can do with Ino, beyond casual sparring, Using his Domain on Ino would not achieve anything.\n - Mei Mei is a weapons user, but it's unknown if her weapon is a Cursed Tool, and she isn't the type to casually spar. Her contribution to training has been enabling switch training.\n - Yuta's sword likely isn't a Cursed Tool, given that he frequently breaks it. His other Cursed Tools aren't relevant to the plan, so he has no need to train with them.\n - Kashimo's staff probably isn't a Cursed Tool, and Higuruma has nothing to gain from training with Kashimo. Kashimo doesn't seem like the type to particularly participate in the training.\n - Kusakabe's sword likely isn't a Cursed Tool. The school of which he is a student is focused on allowing sorcerers who are disadvantage to succeed ('A domain for the weak'). It makes no sense for him to be reliant on a Cursed Tool, and he is able to respond [to his sword breaking by the use of one of his school's techniques.](https://i.imgur.com/XDQdDMO.png)\n - The other sorcerers who don't use weapons already have no reason to start to do so. Their time is better spent refining their skills or overcoming their weaknesses, rather than trying to pick up the effective use of a weapon (a skill that can take several years).\n\nSo, given that Cursed Tools are rare and mostly monopolised by Jujutsu society, it is unlikely that among the 20 sorcerers that Higuruma fought to gain 100 points, any of them had a Cursed Tool. Even if he did fight a Cursed Tool user, it may be that he did not need to use his Domain against them, as the type of sorcerer who is overly reliant on their Cursed Tool is likely one insufficiently skilled to take on Higuruma. During the 1 month time skip, he had no real reason to use his Domain on anyone who uses a Cursed Tool. In addition, sorcerers do not inherently know how their technique works. As of such, it is very easy for Higuruma to have never encountered anyone with a Cursed Tool, and not know this oddity of his technique, given how few battles he has fought, and the conditions they took place in.",
        "num_comments": 204,
        "comments": [
            "Reminder:\n\n- **DO NOT POST CHAPTER LEAKS** outside the pre-release leaks megathread. Officials are free range. See the sidebar for info on leaks.\n- Powerscaling should stay in the designated Tuesday Colosseum thread.\n- Repetitive or low-effort topics will be removed.\n- Questions that can be answered by reading the manga more closely should be posted in the FAQ.\n\n[Fanbook & Other Canon Material](https://www.reddit.com/r/Jujutsushi/wiki/canon)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Jujutsushi) if you have any questions or concerns.*",
            "Most people in disagreement can’t provide an argument against it, they just don’t like how convenient it is for Sukuna.",
            "Honestly all it would've taken to make the convenience of the plot point better was to show Sukuna actually planning things out.\n\nCurrently Sukuna feels very passive in that encounter, i.e. it felt like he had no agency in what was confiscated and lucked into a situation that neither he nor Higuruma expected.\n\nIf instead Sukuna had monologued about how he saw the domain from inside Yuji, speculated about what would happen if there were multiple cursed techniques in the domain during the confiscation, figured out a Cursed Weapon with a CT imbued would count as a valid target for confiscation, and asked Uraume to drop off Kamutoke after his battle with Gojo, then it would play much better.\n\nWe'd have bought it. He's shown to be obsessive about figuring out the limits of CTs and he has shown himself to be unparalleled in Jujutsu knowledge with the exception of maybe Gojo.\n\nYou could maybe even throw some banter about Yorozu and her love being worthless in there as he sacrifices the cursed weapon.\n\nWithout agency the situation feels contrived because you can almost see the hand of the author carve a path for Sukuna to overcome specific situations.",
            "Sorry, I probably missed it, but I thought Ogi just emptied the storeroom before maki got there so as to set up a trap without her being able to use any of those tools to fight back. I tried to click the hyperlink you put for it, but it just brings me to the juzo kamiya evidence.",
            "Good post but there’s one thing I saw your confused about. In general, a cursed tool is just any weapon that has been infused with cursed energy consistently. Which means that any weapon a prominent sorcerer is wielding is most definitely a cursed tool. Nanami’s blunt blade (while he was alive), Mei Mei’s axe, Yuta’s katana’s are all cursed tools because cursed tools are literally just tools imbued with CE for a while\n\nAnything Maki wields before her power up is also most definitely a cursed tool, since she isnt capable of controlling cursed energy in the first place, all her weapons have been imbued with a decent amount of CE. This means that there are probably dozens if not more of readily available cursed tools for sorcerers to use in the storehouse",
            "I don't care. I just wanted to see sukuna beat everyone without his technique and show them that it doesn't matter what tricks they pull he's still leagues above them. Besides even if higuruman did take his technique ad whip the executioners sword you know with sukuna wouldn't lose. He'd kill higuruma and get it right back because he's him.",
            "The fact that Higurama only found out during his fight with Yuji that he can also confiscate Cursed Energy should have prompted him to experiment with Domain Expansion more. The sorcerers should clearly be aware that not even Higurama knows the true workings of his CT so they should have started thinking what else his domain was capable of and trying it during the preparations.",
            "Good legwork dude. Great read. Agree with you. When I first read the chapter where it doesn't take sukunas technique, I was surprised yeah, but it kinda made sense at the same time. You confiscate objects ya know? Would make sense it takes precident. Didn't think that before hand so I'm definitely not blaming higu for it",
            "You do not need to break it down for the sub, it'll always end with 'I REFUSE to believe.....' so facts don't matter to what you WANT to believe. It's what makes us human. We believe in things we WANT to, not NEED to.",
            "OP, I get what you're trying to do here, and I hope this doesn't come across badly, but if I get a character setting of a \"genius lawyer\" who graduated from Toudai who's known for his intelligence, then I would really expect him to, I don't know, plan a little better? Unless he got his degree from [wish.com](http://wish.com), of course.\n\nThe HS group spent over a month making plans B, C, D in the event of Gojo's death (I have so many comments to say on this, but not the point here), but it's very...telling how most of these plans BCD just, naturally made a bunch of assumptions that they really shouldn't have made if you looked at things logically. Higuruma assuming that his CT would automatically take away inherent qualities such as CT or CE away from the judged, is really quite a huge reach, especially if, as you say, he's a new sorcerer who's supposed to be really really smart, who should've been aware of the limits of his knowledge regarding his own abilities. In fact, we see Higuruma planning for all the different crimes that they can use to charge Sukuna so they can get a definite conviction, but not his thinking about the limitations of his abilities. If he can have doubts about whether they can charge Sukuna successfully, shouldn't he have at least tested his own abilities then before assuming that this will be a surefire success?\n\nI'm sorry but it just doesn't really match up with the character setting. But like I said in a comment above, there's also not much I can do to complain against it, since Gege actually never said explicitly what Judgeman would take away. So of course he's free to fill in the blanks however he wishes, no matter how unsatisfying it can feel to the audience.\n\nEDIT: You also really shouldn't be using Playful Cloud as a basis of estimating the average cost of Cursed Tools, that's also a flawed assumption. We know that it's a Special Grade tool, but not every Cursed Tool is Special Grade. So assuming that all Cursed Tools, or the average cost of Cursed Tools, are all in the same ballpark of Playful Cloud doesn't really make much sense. \n\nAt the same time, I'm not sure why you're assuming that only \"worthwhile\" Cursed Tools would be confiscated. Based on what we know at this point, if used on Zenin Mai, it could very well confiscate one of her bullets. \"Worthwhile\" or not doesn't really, and shouldn't really factor into the equation.",
            "I think confiscating cursed tools is a 'hole' in Higuruma's cursed technique,a neccessary one.\n\nIf you think about it every cursed technique needs to have a weakness of some sort.\n\nTen Shadows-isolate and destroy the shikigami *pernamently*\nLimitless-insane CE consumption(without 6E),lots of destruction,hard to fight alongside others\nRestless Gambler-can kill the user in the domain,can take advantage of the punch and kick heal merchant state depending on your abilities\nCopy-5 minutes time limit for Yuta,low cursed technique count(without Rika)\nBlood manipulation-water,user needs constant refills of blood\n\nThis seems to be the case for Higuruma too,cursed tools are a way to fight against his CT.",
            "Thanks for this, I feel like I'm losing my mind every time people talk about the confiscation on Jujutsufolk. I could never fathom why people were so fucking worked up about it. It's not like the trial failed in any way, he still got the ES and the death penalty from his domain. Did they just want him to one shot Sukuna and end the fight right there with zero stakes whatsoever? We all knew Sukuna wasn't going down that easily, I was stoked to see Gege subverting the expectation of how it would happen (considering the popular fan theory at the time was Sukuna out-lawyering them at the trial somehow and ass-pulling his way out of the death penalty). Not to mention they would have been fucking COOKED if he still had Kamutoke since they had no way of countering that like Kashimo. I also couldn't care less that we never really got to see it in action, I'd much rather see the Sukuna we know and love using C/D than some lightning tool that just showed up. \n\nReading comprehension/awareness of good writing curse strikes again",
            "Agree with everything you say but also want to point out: why does everyone act like Sukuna losing his cursed tool is a bad thing? Yeah he’s a badass without it but we would not be where we’re at right now if he still had that thing. Getting punched down by Yuji? He could just lightning bolt him to death easily, it was VITAL that Sukuna loses that cursed tool. Higaruma didn’t fail, he made Sukuna weaker and gave the ability for everyone else to continue fighting, it just didn’t go the way he thought it would",
            "This is probably my least favorite thing people complain about:\n\n- It’s largely irrelevant to the flow / outcome of the plot. Sukuna is killing Higuruma whether he takes Mizushi, 10S, Kamutoke, or all his CE. Say Higuruma does know beforehand, what changes in their plan?\n\n- Doesn’t even really convenience or help Sukuna like people argue. Permanently losing Kamutoke is worse than temporarily losing Mizushi.\n\n- It doesn’t require some back bending theory to justify as you’ve wrote out.",
            "the fact that people would be happy with sukuna losing to the sword is lame af. \n\ngreat post, shame it’s necessary that you had to post it",
            "THANK YOU!",
            "Post is pretty rock solid. \n\nBest counterpoint I can make is that someone with a technique should've just held makis weapon for experimental purposes.\n\nBut obviously nobody in the cast knew about sukunas cursed tools coming back from the grave",
            "Your post would have been good but you glossed over the fact that Nanami's cleaver was turned into a cursed tool. That fact alone means they STILL have the capabilities to create cursed tools post Shibuya and should have been able to test it with Higuruma's domain.",
            "TL;DR not having anyone to test on is a good reason not to know for certain. Not having any of our smart and experienced group consider the possibility when they have had nothing else to focus on for a month is the oart (at least for me) that seems like a stretch.\n\nI think the best argument is that they wouldnt know that Sukuna might have a tool, but given they had a month and nothing else to ponder on i find it hard to believe that they didnt consider the possibility.\n\nOn your first two points (scarcity and taboo) taboo was irrelevant at the skip as they all knowingly had the elders killed. Between Gojo and Ui Ui they had high level teleporters , theres very few locations they couldnt have reached. They did not need a powerful item, just any given cursed tool.\n\nYour third point is valid, not having someone available they *could* test on is a good reason not to know. They still could have discussed the possibility however - they have a large mix of extremely experienced and knowledgable sorcerers and a month to ask questions about abilities. \n\nTo believe the suprise at the cursed tool, we'd need to believe that no one in the group was curious enough or paranoid enough to ask Higurama about how his technique interacts with cursed tools. For me, that just doesnt seem likely that there wasnt at least the question.",
            "I don't even think Gege knew it could do that til he pulled it out his ass. ",
            "My only problem is that they don’t even acknowledge the possibility even after Sukuna gets a cursed tool, in fact they don’t even mention it. It feels like a cop out because Sukuna does so little with the tool it feels like the tool’s purpose was just to counter higurama. This coming off Sukuna being able to make a lightning quick binding vow for a move he just made up and never used just wasn’t satisfying to read, it just felt like a bailout on a technicality.",
            "Also I will note if sukuna kept the CT he’d be able to one shot EVERYONE spending 0 cursed energy",
            "Not to mention a lot of the fight has been about actively wearing Sukuna down. So far he has:  \n1.) Effectively lost 10 shadows, as Mahoraga and most of the other shikigami are dead and effectively useless  \n2.) Forced to use his one-time full heal (his bodily reincarnation)  \n3.) Had to permanently hard nerf his newest, strongest ability just to be able to win against Gojo, making it much easier for fighters to see coming and actively avoid.  \n4.) Has lost both left arms making it effectively impossible to cast his domain normally, along with use the WCS at all.  \n5.) Is unable to heal at all as, even though he found the RCT circuit in his brain that Gojo used at the end of their fight, Yuji's punches and black flash rush made it more or less impossible for him.  \n6.) When casting a domain he had to limit its uptime just to maintain its damage output.\n\nAnd of course, while it happened much earlier, he did lose his cursed tool that aided him significantly against Kashimo (even though Kashimo gets low-diffed even without it). Like the whole fight is about trying to reduce what Sukuna is capable of.",
            "insane thread great work",
            "Well, hey, you actually convinced me. I figured it was reasonable that he didn’t encounter a cursed tool during the culling games, but I thought he would have definitely been able to try to confiscate a cursed tool over the timeskip. I guess I just forget how insanely rare cursed tools are\n\nHonestly, though, I still wish judgeman would have just confiscated all his techniques + the cursed tool",
            "when Gojo killed the higher ups not a single one had a cursed tool?",
            "I never really got this complaint.\n\nWe already knew that Deadly Sentencing has arbitrary rules that prioritise the confiscation of a CT over the confiscation of the ability to use CE.\n\nThe latter is far more useful since removing the ability to use CE would also make a sorcerer incapable of using their CT and basically render them as helpless as a normal human.\n\nAnd yet, Deadly Sentencing doesn't default to that, if there's a CT, it will only confiscate that. Only when there's no CT will it confiscate the ability to use CE.\n\nGoing from that to the idea that Deadly Sentencing would prioritise Cursed Tools over CTs isn't unbelievable in the slightest and actually makes a lot of sense considering that Cursed Tools with a CT imbued literally allow a sorcerer to use a CT without spending their own CE, without using hand signs and chants, and the tool's efficiency isn't reduced even if the sorcerers output is lowered.\n\nAnd like, if anything what's convenient is the fact that Sukuna deliberately let's them pull him into Higurima's domain and confesses the crimes because he wants to see the executioner's sword.\n\nSukuna could have simply blitzed them all and donuted Higuruma the way he did Choso, avoiding the sword, and keeping his CT as well as Kamutoke.\n\nEven if Higuruma had confiscated Shrine Sukuna would have still folded them all, killed Higuruma, thus recovering Shrine, and then proceeded to keep folding everyone, this time wielding both Shrine and Kamutoke. And people then would complain about Higuruma doing nothing and Sukuna being too strong.",
            "I really would like this trend of \"this is logically consistent and that's why it's good\" to stop.\n\nThis is still a story to entertain, the issue with Sukuna during that stretch of the story was that he just got the best result out of every single tactic used by other character without him (seemingly) doing much.  \nIt may be logically consistent, but it's boring.  \nAnd that was the big criticism, everything else doesn't really matter and even that criticism is a matter of taste.\n\nLogically consistent storywriting is really not that important in the grand scheme of things, as long as a story is entertaining and interesting, an author can bend their fictional reality in canon-breaking ways without much trouble. Those things only matter when the story sucks.",
            "Hard to disagree with anything here, good job.",
            "I totally agree with your overall points, but some nitpicks I wanted to throw out there while going over everything: \n\n- Ogi didn’t destroy the Zen’in cursed tools, he just had them removed. Where he put them we still don’t know, and presumably there was nothing in there better for Maki than SSK (which is easy enough to believe). \n\n- Kashimo’s staff is almost certainly a cursed tool. It allows him to charge his CE into it and can be a source of a lighting bolt when he needs to make a connection between something other than his opponent to generate a charge. Kashimo didn’t seem capable of just charging other items, I do believe strongly that this is an aspect of the staff that is a result of it being a cursed tool. Either way, it would be silly to think Higuruma would train against Kashimo of all people, so there’s still no reason he would’ve known about how his technique interacts with tools just yet.",
            "Literally read this and scrolled down twice to see a post in jujutsufolk that is about this exactly. And as you might guess it’s filled with people agreeing about how much of an asspull it is",
            "I genuinely still don't think you refuted the case that Higuruma was clueless.  Most of your points are *entirely* based on assumptions, some of them far and above more unlikely that others.  You're deciding several loose guesses prove their point entirely without any proper evidence. \n\nHiguruma's Deadly Sentecing probably wouldn't like this post",
            "Higuruma couldn't know that\n\nBut Sukuna could know the 10 shadows in and out in a month.\n\nBu-bu-but it's Sukuna.",
            "There's no in-universe reason for the majority of what Sukuna does. For that matter, there isn't reason given for why Gojo could heal his own RCT or how Sukuna could also do it just by seeing it's possible.\n\nI think the real underpining point is that there was no reason in the story Higu's domain had to have worked that way. It didn't matter for how the story progressed at all, on retrospect it just looks like an easy way to write out the cursed tool he now had without the cast having to deal with it. It was a variable in all this that blipped in and out of existence  for Sukuna to reincarnate, and even that's not been explained. Narratively, what was the point of it besides Giving sukuna so far unexplained outs? I'll take 'em if they come but there's no mystery or suspense in it.",
            "We aren't really able to make assumptions about people actually reading the manga and so I wouldn't put such high expectations on the content analysis skills for that same group: cursed tools are indeed rare and Higu was only recently a sorcerer. If Higu was to learn about his DE's interaction with cursed tools, who would have helped? Who would have been \"OK. Lemme see what happens when we try Higu DE with some rare cursed tool from the chest the Zenin clan hid away before getting wiped by Maki.\" Yeah, they probably also lost that reserve of cursed tools cause I doubt Maki added another chore when she was busy cleaning house.\n\nAgree with your arguments. I'll be waiting for your next ted talk.",
            "1. Just because things are written consistently, doesn't mean they don't feel shit to read.",
            "On top of all this, no one knew Sukuna had a cursed tool either, and even if they could have known before hand this was STILL their best course of action.",
            "To be fair it was amidst of a pile of conveniences for Sukuna. I understand why people would be upset and think it's silly and maybe start saying things like he should have know what his domain does, etc etc.\n\nAnd to be even more fair, all of those conveniences really haven't stopped for big S lol.",
            "Exactly, the problem isn't that it's a plot hole, it's just that it's an extremely convenient cop-out",
            ">they just don’t like how convenient it is for Sukuna.\n\nwhich is a valid complaint. \n\nespecially since the only thing kamutoke accomplished was saving sukuna's curse technique from confiscation, and the only thing higurama accomplished was taking kamutoke.",
            "I don't particularly appreciate how convenient it is for Sukuna but I don't have to blame my feelings on how the writer is objectively \"bad\"\n\nI can ignore it and continue with the story because I don't think it is that big of an impediment to the story.\n\nLike, if it only took a slight modification to a few chapters, it's sort of just a nitpick and it can be presented in a different way but it does not change anything: Gojo still gets cut in half, Sukina still beats Kashimo, and Sukuna still has an upper hand versus Higu and Yuji. I honestly think the whole Higu DE was specifically to give the heroes and fans a single win condition only to subvert it to surprise the fans. In other words, Gege likes to troll us readers.",
            "50-50 is pretty good odds!",
            "True, and the fact that he just found his CT also. Idk if that was stated above. (Too much reading even for me)",
            "His CT works based on a courtroom, and hes a fucking lawyer",
            "It’s not even convenient for Sukuna. Permanently erasing Kamutoke is wayyyy worse for him than temporarily taking Mizushi. He would have just killed Higuruma and then had both at his disposal later.",
            "It literally makes for a worse story if Sukuna's CT is just whisked away.\n\nPeople who complained probably don't even read the manga, they just watch TikTok summaries and shit-post.",
            "You know what, yeah, that’s fair. I always assume some level of subtext when it comes to things like this, but it definitely would’ve elevated the moment if we were explicitly told that Sukuna planned for this.",
            "Sukuna wasn't worried at all, he was down to throw hands without his Cursed Technique.",
            "Yeah, this shit would be really goddamn genius. You cooked",
            "The thing is sukuna doesn't need to worry or plan this out in advance, he just knew he was stronger than everybody else without a technique or tool. This is shown by him just admitting to the crime plainly.",
            "Whoops. I copied and pasted the wrong link there. https://i.imgur.com/d6e3Cza.png\n\nHere's the panel where Ogi says he 'disposed of them'. I doubt there's anything significant enough in there to be useful, though, so it doesn't really make a difference if the Zenin stockpile was just hidden, or actually destroyed - Maki went there to get powerful Cursed Tools, and she got the only one she really needs.",
            ">a cursed tool is just any weapon that has been infused with cursed energy consistently.\n\nI don't remember this being explicitly stated.",
            "I think the defintion of a cursed tool varies throughout the story and isn't particularly consistent - it's not black and white whether something is a cursed tool. Miwa's katana is described as a psuedo Cursed Tool, but also a cursed tool. We later see the language switch to 'special' cursed tools. IE, Yuta starts to worry about Yuji having a 'special' cursed tool, Yorozu is capable of creating 'special' cursed tools. It's probably items that carry a technique that are 'special cursed tools'. \n\n> This means that there are probably dozens if not more of readily available cursed tools for sorcerers to use in the storehouse\n\nOh, absolutely, there was, up until Gojo was sealed. Then Kamo and Zenin repossessed them (I link the panel a few times), and Zenin destroys their stockpile and Kamo's stockpile is under Kenjaku's control.",
            "You can't just use it for a while. Yuta's sword was broken by yuji, miwa's sword was broken from hittinh hanami, and kusakabe's sword was broken from hitting sukuna. On the other hand, megumi's sword (which was a legitimate cursed tool) didn't break from hitting hanami.\n\nMiwa at that time has used her sword for at least 2 years, and it was still just a \"pseudo cursed tool\" as stated by gege. That means that you need to imbue your weapon a lot to actually make it into a cursed tool.\n\nKenjaku says that the \"ritual\" of creating curse tools from the bath involves submerging toold into a solution of cursed energy for 10 months. That's 10 months of continuous imbueing with curse energy, when a sorcerer would imbue their weapon only while fighting (hence why nanami's tool is a cursed tool since he used it for about 12 years)",
            "but most of these common cursed tools wouldn’t have techniques to confiscate, they’re just charged with cursed energy — so even if higuruma tested it out, presumably mei mei’s halberd wouldn’t register for confiscation, for example",
            "Just here to say i love ur pfp lol",
            "We did get him one shotting choso without using his ct so that's that",
            "I think a good analogy for this, is this - you wouldn't take someone to the electric chair, with the gun they used to commit mass murder still in their pocket.",
            "This is a good statement towards the underpining reason why people get the misconception that Higuruma knew or should know how his domain works. It doesn't make any sense for him to not spend time thinking about that over a month while he does spend time thinking about which crimes to use for his 'case'. Especially not when he's such a legal prodigy. It's not just his intelligence but what he's intelligent in, this dude should and would be thinking of minor details obsessively.\n\nThe misconception and assumption is Higuruma knowing things intuitively. The reason people reach that conclusion is because it was a very unsatisfying sequence of events that ultimately lead to the unsatisfying end of Higu's story. There really was never an overall arc for him and his growth and death didn't do anything to propel characters or the story forward. His death had the same intention/feeling of Nanami's in passing things onto Yuji to finish, but none of the weight.\n\nA prodigy lawyer not even considering the limitations of his own understanding of his domain is out of character. That he discussed the Japanese legal system with everyone for planning but not one person questioned the specifics of his domain or asked to test anything is stupid.",
            "> At the same time, I'm not sure why you're assuming that only \"worthwhile\" Cursed Tools would be confiscated. Based on what we know at this point, if used on Zenin Mai, it could very well confiscate one of her bullets. \"Worthwhile\" or not doesn't really, and shouldn't really factor into the equation.\n\nI'm not. Worthwhile is a factor used to determine whether it is worth using. For many of the sorcerers we have, the difficulties that come with using a weapon aren't outweighed by the benefits that the weapon would bring, even if it's a cursed tool. \n\nI'm not using Playful Cloud as a basis for cursed tools as a whole. I'd use Demon Slaughter for that. It wasn't a big deal that Demon Slaughter went missing. It also isn't very powerful, which is why Gojo gave it to Yuji, so that he wouldn't grow reliant on it's power. \n\n> But if I get a character setting of a \"genius lawyer\" who graduated from Toudai who's known for his intelligence, then I would really expect him to, I don't know, plan a little better? Unless he got his degree from wish.com, of course.\n\nI think the point of this sequence is to show that intelligence and experience are a different ballgame. He has the raw talent of Gojo, and is smart to boot, but lacks experience, and that's why he fails. In fact, he literally says this: https://i.imgur.com/mwuhB6x.png\n\nThis is also a pretty common theme in Jujutsu Kaisen: people assume things, and they're wrong. Reggie Vs Megumi, Kenjaku vs Yuki (in this one, Kenjaku explicitly calls out experience, too: https://i.imgur.com/kmIKi3G.png). Higuruma is also shown not knowing the limits of his technique quite literally in his introduction.",
            "The point of the entire post isn't to establish the mechanisms of confiscation, but rather to determine the situations that Higuruma would be in.",
            "I mean I think having a tool that sole purpose was to tank the confiscation felt a lil bad. Feels fair to Be annoyed by that",
            "People would be happy to see Sukuna get beat literally anything tho. Remember, he's Satorou's killer, who has a chokehold on 97% of the fanbase. Any opportunity that ends in Sukuna coming out on top, even if well explained, makes them rage and they HAVE to call it an asspull to feel good (I don't know why tho) 🤷‍♂️",
            "Every time I visit another Jujutsu Kaisen subreddit, I see misconceptions like this repeated dozens of times and I have to stop myself from writing a post like this again.",
            "It'd be sick if Sukuna got hit with the sword, figured out how it worked in the process, and survived",
            "We don’t know how Nanami’s cleaver was made into a CT, could go either way tbh",
            "Nanami used his cursed tool for way longer and to imply they could achieve the same results less than 3 months is quite presumptuous",
            "I didn't.\n\n> Nanami's Cleaver is another example of a cursed tool created through repeated use, over a longer period of time than Miwa, but it was only a cursed tool after his death.\n\nhttps://i.imgur.com/8hphe6G.png\n\nThe panel I link here (and in the post) is Sukuna being surprised that the cleaver is a cursed tool. He is a very reliable observer. He would have noticed if it was a cursed tool while he was inside Yuji. \n\nIn the following chapter, we also get this sequence:\n\nhttps://i.imgur.com/a8Hq8mu.png\n\nThis theme is kinda present throughout this entire fight - go south, Namami's cleaver, that sequence there, and now Gojo's body. Things being passed along after death.\n\n\nAlso, Miwa and Namami have been using their tools for a *really* long time, which is what that header focuses on.",
            "> On your first two points (scarcity and taboo) taboo was irrelevant at the skip as they all knowingly had the elders killed\n\nThey were to illustrate that he couldn't have encountered one during the Culling Games.",
            "> when they have had nothing else to focus on for a month is the oart (at least for me) that seems like a stretch.\n\nWell, in this case they did have things to focus on: switch training and getting the fundamentals down. Knowing how to survive the deadliest Domain ever is a high priority for them, and mastering Simple Domain and RCT still wasn't easy, even for a genius. Higuruma never managed to get RCT in the timeskip, so probably more time was spent practising that than exploring the limits of his technique.",
            "Because Sukuna crushed Kashimo very quickly and then they deployed to fight - they had no way of knowing a tool would impact their plans and the dude gets an auto-target lightning bolt weapon. Even though it thwarted their plan, it was one of the accumulating acts to weaken Sukuna which has been the theme of this long fight of attrition.\n\nI don't want to start a discussion about Sukunas World Slash but several things were established well before Gojo's execution;\n\n1.) He is a Jujutsu Savant and can identify and replicate many feats through observation and trials  \n2.) His entire plan while fighting Gojo was using Mahoraga to develop a move to bypass infinity.  \n3.) Binding Vows can be created at a moments notice\n\nI just don't see how this could possibly be a technical bailout when it was the entire result of Sukunas plan and result of his improvisation. Gojo developed Hollow Purple with less contributing factors and it's still cool.",
            "I reread the Shinjuku Showdown recently, and the pace around that part is *incredibly* fast. It's chaos, and it's fun. They call the retrial mere moments after they hit the ground and get Sukuna in range, and they have to fight to reach that possibility. The trial is very short, and Sukuna immediately rushes Higuruma before anyone has the chance to realise that their plan had partially failed. I think it'll work much better when adapted into anime, but the flow was pretty good in the manga when you read it back to back.",
            "They're less insanely rare, and moreso they're either really damn good, or not worth using.",
            "Higuruma didn't fight the higher ups.",
            "The staff can generate lighting because of his cursed energy he imbues",
            "> Kashimo didn’t seem capable of just charging other items\n\nHe charges Hakari's face. \n\n> Ogi didn’t destroy the Zen’in cursed tools, he just had them removed. Where he put them we still don’t know, and presumably there was nothing in there better for Maki than SSK (which is easy enough to believe). \n\nTCB has it as the below: https://i.imgur.com/d6e3Cza.png, which to me implies more they're destroyed, but it could be either way.\n\nEither way, the points about that stockpile not being in the colonies, and the general lack of reasons to use Cursed Tools apply.",
            "Not making an argument about the quality of the writing. This is an argument against 'Higuruma should've known', not 'it's bad writing that Higuruma didn't know'.",
            "Yeah, but convenient for just sukuna? As far as I see, sukuna not having kamutoke with an attack power that doesn't rely on his own cursed energy or output and can seemingly shoot it's attacks without being aimed is a plus for the sorcerers. I think they've only got as far as they have because they're facing a sukuna whose attacks are limited by his output. I don't just think actually, I know, because yuta pretty much said so. \n\nThe low output nerf to sukuna would be petty much useless if sukuna kept kamutoke.  Sukuna didn't even care if shrine was taken away in the first place. He was ready to throw down without it. He  was capable of outspeeding a piercing blood and donutting choso before he even realised he disappeared. He avoided Yuji's  swing of the executioners blade at point blank range. And was even dominating Maki. Half of the gauntlet has been sukuna playing with his food, and he didn't even begin riling up his cursed energy until Maki.",
            "Both sides have gotten real convenience in this battle, based on our understanding of the students coming into this battle they should all be dead, Sukuna was different gravy compared to them yet here they stand.",
            "It also doesn't help that kamutoke was introduced into the plot only to be used against someone it was completely ineffective against, and then deleted from the plot. It's hard to not feel like its inclusion felt like a completely contrived reason just to screw over Higuruma.",
            "Yes. A lot of people want what they think to be bad writing to be a story inconsistency, so it's not just an opinion, but something the author got objectively wrong, a contradiction.",
            "I disagree, Sukuna would’ve still folded the students without a CT and regained it after killing Higuruma anyways. At which point the outcry of the community would’ve been even worse than it was then.",
            "If we don’t see it, it’s headcanon",
            "The fact he doesn't need to doesn't mean it wouldn't have made for a more enjoyable read",
            "Gege states it in the fanbook in regards to Miwa’s cursed tool. \n\nThe ritual Kenjaku and Uraume discussed describes this exact process.",
            "If your definition of cursed tools is that they’re indestructible, how did Toji sharpen and eventually break the chains of Playful Cloud, probably the most famous one in the series?",
            "Why does it matter that they broke? Cursed tools can break. \n\nMiwa is weak as hell. Why are u using her as a benchmark for people infinitely more powerful than her?\n\nWhat does the ritual have to do with anything? Cursed tools can be ready made, hence all of preawakened Maki’s cursed tools",
            "Higuruma's domain targetting Cursed Tools because they have CTs is a complete headcanon and doesn't even make sense because the technique confiscates the whole cursed tool not just the technique within it.",
            "This analogy doesnt even work though, he committed the Shibuya massacre with his domain, but it confiscated his tool instead.\n\nThis is more like somebody who's taken to the chair having his pocket knife confiscated, but getting to keep walking around with the assault rifle he used to commit the mass murder.",
            "Yes, thank you, it's really the character setting that's really bothering me, which is why I'm kind of laughing at how Higuruma may have obtained his Toudai degree here (sorry). We've seen from his encounter with Yuji that he didn't know the limits of his technique, be aware of his lack of understanding of his technique, but then in this trial, just not consider it entirely. Did he learn absolutely nothing at all from his meeting with Yuji?\n\nI would really hope that a genius lawyer would spend more time preparing for the events of failure for his arguments, no matter how remote they may be. But he just didn't seem to have considered it entirely.\n\nDefinitely agree about Gege's trying to recreate the feeling of Nanami's death here. I think another part of why his death didn't hit as hard for me, is the fact that Higuruma had so little to do with any of the cast but Yuji, and even his interactions with Yuji were really limited and didn't really show us much of a bond. Meanwhile, Nanami's death for me hit harder, because Nanami is shown to have connections with other people in Jujutsu society (e.g. Ino, Shouko, Gojo, etc) so we can fill in the blanks on our own more of how his death may have impacted other people.",
            "But if Playful Cloud's cost isn't the average, and \"common\" Cursed Tools like Demon Slaughter are the norm, wouldn't there be more free floater Cursed Tools around? There's no reason to assume that the vast majority of Cursed Tools are only at stockpile locations, right? \n\nI get what you're trying to say here, with regards to experience v. intelligence, but like you said, which I also referred to, Higuruma knew from the very beginning of his appearance and from his encounter with Yuji to not be aware of the limits of his own technique. So why would he then repeat his mistake of keep assuming that he knows everything there is to know, especially since we see him planning with the HS school and not assuming that the crime they charge against Sukuna will surely work with Judgeman? \n\nIt just doesn't make any sense. Because you basically have people, not just Higuruma here, repeating their own mistakes again and again and not learning a single thing from them (see: Yuji). It becomes jarring when I'm being told as a reader that Higuruma is supposed to be intelligent and we see him plan for occasions when his technique doesn't work as he assumes, but then miss this spot completely when he was shown to have a similar experience with Yuji before? I would hope a Toudai lawyer would prepare more for his trials than Higuruma did here.  \n\nI just find it to be very poor planning on Gege's part. In addition, it brings up the issue of how Sukuna would know the limitations of Higuruma's technique, since he didn't seem worried about it at all. If he didn't know, then he was just operating on luck, which quite diminishes the claim of Sukuna's overwhelming intelligence. But there's also no evidence or thought process depicting how Sukuna knew about this. \n\nI hope what I'm rambling about makes sense. I do appreciate your explanation about Cursed Tools a lot, it is very clear and logical.",
            "Yeah, I get what you're saying. The thing is, Gege really never explicitly told us the mechanisms of confiscation, so honestly whatever he writes for it, isn't really something that I can complain about (it's definitely a bit irritating how he keeps it deliberately obscured though imo).",
            "I’m sure you’d like another 900 chapters of Sukuna dog walking the cast… I’d personally be fine with Yuji getting his final sword duel with Sukuna there with the EB \n\nYou can chalk it all up to “grrr Gojo fans bad” all you want.",
            "8 hour days, not all could be spent physically due to exhaustion, 30 day month (roughly).\n\nAssuming that they talked to each other about their CTs at all in the month, not one of them thought to ask \"what happens if they have multiple CT? What about a cursed tool?\"? Even as curiosity?\n\nThere were so many characters involved in the planning and not all (like Mei Mei) seem to have switched.\n\nAt the time, i thought it was weird that it caught them all by surprise rather than them being disappointed, given how extensive their contingencies have been elsewise.",
            "Gojo did and could have brought it back right?",
            "Right, but my impression is that he can’t just use any object that same way, which is why I believe it’s a cursed tool. It’s possible it isn’t, but I would think he would charge other things too instead of just his opponent and the staff.",
            "Hakari’s face is a valid target that already has CE for him to affect with his own, and “charge”. I personally think it’s different, and don’t see how it’s not a staff ability from the one time we see him using it, but it could go either way. I just don’t think he can charge other “regular” inanimate objects, at least probably not in the heat of battle at once. It just reads as much more of a special property of the staff, to me. \n\nHonestly I would still read that TCB translation as just moving them. It’s quite nonsensical for him to destroy all those tools that are a valuable resource for his own house. \n\nLike I said, you’re totally right and I agree with your overall points, just wanted to throw out some opposing opinions on a few of the details",
            "It feels disappointing because we didn't get to see how dangerous his tool was, if he had used it to it's max potential, then the tool confiscation would have felt like a victory, even if a minor one.",
            "I think you are right on point, anyone except Gojo, Kashimo, or Hakari In Immortal Mode (and let’s say maybe Maki) would probably receive massive damage from it…\n\nBut I guess it would have been easier to dodge than Normal Dismantle, World Slash Dismantle ? \nBut even so, I think it packed a very serious punch let’s say at least half the strength of a Lapse or Reversal from Gojo, that also stuns you for a couple of seconds right?\n\nAnd ofc Yuji and Yuta wouldn’t be that hindered from it, while Higuruma and Kusakabe could have protected themselves with Domain Amplification and Simple Domain, respectively. But even so, why give an already over-powered Sorcerer that was in danger on a one-on-one with Gojo, more than any other one-on-ones/tag teams that he faced, as his strength kept declining ever since he finished the most taxing part of it all? \nI would argue, that even if they have good defenses, that does not deny that him not having Kamutoke is a godsend.",
            "If Sukunas CT got confiscated it would've ended the fight right there, he wouldnt have been able to punch all of them to death. \n\nA dissatisfactory ending of course, but he really should've just gotten Ten Shadows confiscated from him, it would've made perfect sense without being an asspull, wouldnt even restrict Megumi from using it since Judgeman targets specific souls, and it would avoid Sukuna breaking character. \n\nGiven what was at risk and his ability to absolutely fight back against domains or finding loopholes in other peoples techniques, it makes no sense for Sukuna to risk having his CT removed forever just to speed up the trial.",
            "You can literally erase Kamutoke, Higuruma and Kashimo from the sukuna fight and barely anything changes. There were like 3 months worth of filler/nothing chapters after Gojo died.",
            "Honestly, it would’ve been an interesting way to see whether or not Higgy’s CT would persist after death if Sukuna managed to kill him without Shrine and then immediately got it back. \n\nWait. Hold on. I had a thought mid-comment. But now I need to stir with it. I think I just realized why Gege elected for Higuruma’s CT to prioritize Sukuna’s cursed tool rather than Shrine. And it all circles back to Higuruma is alive cope (the agenda never dies)",
            "Yes but Higuruma's CT fading after his death at least makes modicum of sense. Why did the effects of confiscation persist, but the executioner sword didnt? Make it make sense ( hint: you cant ). \n\nThis crap only hapened because Gaygay wrote this bullshit tool into the story and didnt know what to do with it. Thats it.",
            "My guy quite literally welcomed the Confiscation and Death Penalty whilst already having information on Higuruma’s domain from Yuji.\n\nHe knew the ramifications of what he was doing and he was still willing to go through with it even if it meant losing his cursed technique temporarily.\n\nThe context is there for you, pay attention to it.",
            "It would be like Kenjaku pre-gaming an encounter with Maki. There would just be no need to. \n\nLike imagine 2-3 pages of Sukuna's thinking deeply of how to counter Higuruma's technique only to show  him speed blitzing the fuck out of everyone in the next page. Imo that could make for a worse read and at least is a waste of pages.",
            "yeah i guess i was operating under the assumption that cursed tools ARE a manifestation of their imbued technique in some way",
            "But Higuruma was also worried it wouldve taken 10 shadows instead",
            "That’s not right either. Since his domain is a part of his soul. Essentially it’s just his hands, not a weapon. So taking away his cursed tool as opposed to his shrine. Is like taking a gun away instead of handcuff in him",
            "Nanami's death was also followed by a satisfying conclusion where Higuruma's was just another event in the midst of everything else.\n\nI really don't think Gege meant for anything to solely move the story forward, but a lot of things ultimately ended that way. Who Higuruma is or what his story was ultimately didn't matter, he could have been any kind of lawyer and fought for any other reason and things would have been the same. His own character never really drove his story, he was just in the wings waiting for Gege to give him purpose.\n\nSame thing with Kamutoke. Swap in any other explanation for how sukuna reincarnated and the story doesn't change. Make any other excuse for the confiscation missing MS and nothing changes. There wasn't any setup or expectation, save for us assuming about Higu's domain as much as he was.\n\nThat's why I mostly read just to see how my baby boy Yuji is doing. I hope his suffering ends soon.\n\nEdit: Same thing with Kashimo now that I'm thinking about it. Ultimately he existed to give a narrative reason Hakari chose to fight Uraume and to give Sukuna more screen time. There was no narrative purpose to the character of Kashimo Hajime at all; rename him Ser Gregory Gregor, a knight from England with the power of water and nothing really changes.",
            "> But if Playful Cloud's cost isn't the average, and \"common\" Cursed Tools like Demon Slaughter are the norm, wouldn't there be more free floater Cursed Tools around? There's no reason to assume that the vast majority of Cursed Tools are only at stockpile locations, right? \n\nKinda. I think we forget that a Cursed Tool is a cursed object, and cursed objects contain curses and attract curses. There appear to be two kinds of missions in Jujutsu Kaisen before Shibuya, which is to retrieve Cursed Objects, and to exorcise Cursed Spirits (the very first chapters and the detention centre respectively). \n\nIf we get a Cursed Tool that isn't sufficiently cursed to attract curses enough to attract Jujutsu society's attention, then it probably also isn't going to be that useful in a fight. \n\n> Wouldn't there be more free floater Cursed Tools around?\n\nFactions within Jujutsu society have it in their best interests to accumulate stockpiles: Jujutsu High, the 3 clans, the religious groups, etc. Combine all of these facts, and I think it paints a pretty good picture of why Cursed Tools are somewhat less common than maybe they could be.",
            "Me when I strawman",
            "why stop there? why not have kashimo beat him lol",
            "Well, there's not a whole lot of things to charge in the vicinity. The metal boxes are strong conductors, and are touching the ground (so the charge would instantly dissipate). He also charges the water, uncontrollably, because it's a strong conductor. \n\nThe staff looks like it's part metal and part wood, so the logic here could be that it can hold a charge because even if you stick the wooden part into the ground, it isn't grounded - wood is an insulator.",
            "> Honestly I would still read that TCB translation as just moving them. It’s quite nonsensical for him to destroy all those tools that are a valuable resource for his own house. \n\nYea, probably. Makes no difference.",
            "This is definitely another factor as to why maybe people were upset because we had no idea the full potential of Kamutoke. I mean, as funny as the baby rattle memes are it basically was just a baby rattle lmao.\n\nIt felt like we were lead to believe with Sukuna holding his cursed tools that when we got to see one it would be devastating but it wasn't and we barely saw him use it and it was confiscated so like...great. Now, imagine if he blasted someone with it and maybe even killed them and THEN Higuruma confiscated it then it would be like oh shit okay well it's a good thing he got rid of that then.",
            "Tbf. Given everything said above, it’s always felt like a victory. The fact we ain’t see its full potential always highlighted this for me.",
            "That or Kamutoke fried everyone one shot",
            ">he wouldn’t have been able to pubch all of then to death\n\nYes he absolutely could lol. A CTless sukuna coulf still at least beat Higaruma, which likely means getting gis CT back. Maybe him losing his ct would mean getting to see what kamutoke could actually do.",
            "Why would it take Ten Shadows from him though? Wouldn't that need Fushiguro Megumi's original body since from what we know CT are engraved on physical bodies (according to Gojo at least)? But by the end of 237, Megumi's physical body is dead because Sukuna's Heian form incarnated fully. That's not Megumi's body anymore, so there's no Ten Shadows to take, it's gone permanently.\n\nIf we go by Gege's explanations of incarnations on Choso and Yorozu, once the sorcerer incarnates fully, the original person and their physical form is dead, correct?\n\nI get people's issue with this particular development however. I'm sorry, but people can write all the defenses for it they want, it doesn't change the fact it reads like an \"asspull\". CE and CT are both inherent possessions while a Cursed Tool is something completely external. There wasn't actually much clearly stated explanations for Higuruma's CT really, so I think it's very natural for most of the audience to assume that Judgeman would end up confiscating inherent qualities from the one being judged (This is actually one of my peeves with Gege, as he deliberately keeps things vague, so he can really write whatever development he wants to, and there's not many arguments/complaints you can make against it afterwards).",
            "... Guys contribution to a fight, even this one at the end of the series, isn't what defines a character or tool. Kashimo and Higurama BOTH had compelling characterization that was explored through the narratives.\n\nFailing doesn't mean there was no narrative purpose IMO. Sure, Kamutoke was deleted before it could be used against people who weren't immune but that single use gave a clear insight into how Sukuna could annihilate entire elite squads by himself. It's a point of characterization in how the apex of sorcery had no qualms about using a tool while modern jujutsu families looked down upon it with disdain.",
            "Executioner Sword is a far more potent ability and thus has an implicit drawback to it, like most techniques, in that it doesn't persist after death. For all the bitching about Gege \"telling not showing\" with Kamutoke, you people sure suck at understanding what he's showing you!",
            "Okay then by that logic cut out the entire shinjuku showdown post gojo",
            "Aren't Cursed Tools distinct from Cursed Objects though? I might be remembering this wrong but aren't Cursed Tools just weapons that's been constantly infused with Curse Energy, but Cursed Objects are usually remnants of historical sorcerers which are a kind of poison and contain a large amount of Curse Energy?",
            "1) people would be happy to see Sukuna lose to anything- \n\nMy response: yes, I’d be fine with watching him lose to executioners blade since never-ending Sukuna Kaisen is boring to watch \n\n2) Satoru’s killer, chokehold on 97% of the fandom \n\nMy response: “grr Gojo fans bad” was my response, which shows yeah, you can chalk it up to that if you’d like. Doesn’t mean anything though. \n\nWhat am I straw manning? Or is that a term to be thrown around whenever someone disagrees with you?",
            "The staff was also touching the ground, and I don’t think it’s necessarily insulated in wood. That sure doesn’t look it is from the design, to me. Part of the whole staff was shoved in the ground, and that definitely included metal bits. This is why I strongly think it’s related more to CE to be able to pull off the full lightning bolt effect - he could of course shock whatever he’s touching in a given moment to make it electrical like he did the water, but I don’t see that as the same as his use of the lightning bolts at range between himself and the object.",
            "In story telling there's usually a rule called \"show, don't tell\". It doesn't matter how amazing this tool is. Why should I care if even the author doesn't?",
            "Tell don't show",
            "We already know what Kamutoke can do, and we know that confiscation doesnt release upon Higurumas death. \n\nSukuna also couldnt even stop Yuji from punching him, even though he *did* use his CT against him as well.",
            "Well yeah, because most creators don’t build a story around their audience making arguments and complaints about them afterwards. The idea was to give the reader the same amount of information Higaruma himself actually had, not to trick the reader to make them feel stupid. I also wanna be clear that the process your describing is something pretty much every mangaka does, plenty of authors have talked about going back and reading further into something they initially did not plan. But the evidence to support that something like that happened here is entirely non-existent. There is nothing to suggest that Gege did not have this planned out the power thought out the whole time, not that he suddenly just made up a new power on the fly because he didn’t know what to write there. Pretty much everything that has happened in the fight so far has been set up beforehand, whether it be Yuji developing Shrine and eating the other Blood wombs, Mahoragas constant adaptation allowing for continuous evolution in Shibuya, Megumis Soul being crushed vs , The possibility of switch training being shown by Itadori in Kusakabes body, etc. When you factor in that the creation of a manga is not just one persons will but the collective work of a team supporting an authors vision, it’s likely that the entirety of this fight has been plotted out with at least one editor for over a year now.",
            "Oh don't get me wrong I love higuruma and kasHIMo. It's kinda why I find it particularly lame that their stories are undercut (pun intended) by anticlimactic and contrived endings.",
            "I guess headcanon is one way to explain all this bs",
            "the entire shinjuku showdown post-gojo isnt sukuna's inner thoughts :)",
            ">people would be happy to see Sukuna lose to anything- \n\n>My response: yes, I’d be fine with watching him lose to executioners blade since never-ending Sukuna Kaisen is boring to watch \n\nBut it's not, it is the literal definition of a thriller when people are hooked onto it to see what happens next, Yuta and Yuji vs Sukuna was peak, Maki got her moments, everytime Yuji is on screen it is peak, and Wanting that him to die to Executioner's sword is actually a shit take man, for it being boring, ofcourse people will chalk it up to Gojo fans being mad about Sukuna still alive because No other fans of any characters, well Kashimo fans aswell I guess, would want that to happen, Yuji doesn't get a big moment against Sukuna, Maki doesn't do anything, Yuta doesn't do anything and one shotted Kenjaku aswell wow so great, and everything ends happily.\n\nLike even then I know Gojo fans that still are sensible enough to see the flaw of it wouldn't want Sukuna going out just like that.",
            "> I’m sure you’d like another 900 chapters of Sukuna dog walking the cast…\n\nThis part my dawg",
            "\"never ending Sukuna kaisen\" this is the end game, at most Sukuna starts the merger, but we are at the final leg dealing with the big bad that was set up from the very first chapter, anything that doesn't end with Yuji beating Sukuna with his own strength would be boring to watch, so no, I wouldn't be fine with watching him lose to executioners blade.",
            "If the decorated bit is the metal bit and is touching only wood, then the charge would accumulate only in the metal bit. This is how tesla coils work, roughly.\n\nEither way, we can't fully know what's going on, but also Kashimo killed 40 sorcerers or cursed spirits. If one of them on the off chance had a cursed tool (such as a cursed spirit having acquired it in past), it's possible he could've acquired it then, or it could just be a random object he found.",
            "If anything, Gege did a \"show, don't tell\" where the opposite was done.\n\nThe main characters were caught completely off guard by kamutoke being confiscated and seemed underwhelmed by this. No character acted like this was the best outcome, so why should we? This just wasn't portrayed as a win. \n\nIt's hard to not feel like it existed just to nerf Higuruma for this battle.",
            "Who’s to say the author doesn’t? This might just be matter of perspective but the fact that Yazoru ready Kamutoke in the first place, Sukuna held off on using it till he knew he was gonna get jumped, it being taken off the field so quickly, and Kusakabe still considering it a win despite that fact let me know just how crucial that tool is. Showed me that the Gege cared enough to get it out the way to make an easier chance for his heroes. \n \nBecause as the fight went along and they made note of him losing output due the Gojo fight + Yuji’s attack, that lack of a curse tool becomes ever so apparent to be an MVP moment for Higurama.",
            "There is no way a CT would be permanently confiscated imo, but that’s a hard point to argue I just don’t see it it as kamutoke was a physical tool.",
            "Did you seriously just downvote me because I said Gege deliberately hiding things is my pet peeve? I didn't realise having pet peeves against creators while giving them hundreds of dollars is considered a crime now.\n\nIf he was truly trying to keep true to Higuruma's character, then Higuruma of all people, should've considered the possibility that Judgeman would confiscate extrinsic things as well as inherent qualities. Especially since we literally see him being surprised that his CT confiscated Yuji's CE, and admitting that he didn't know the limitations of his own abilities. So did that encounter just fly out of his mind very conveniently, so that he wouldn't make smart decisions on the most important battle here? When we see him being unsure of what crimes to charge Sukuna, since he's not sure which charges will actually stick?\n\nYou say that there's nothing to suggest Gege did not have this planned out ahead of time, but absence of evidence isn't evidence of absence here. You have no proof that he did plan it out properly either. In fact, plenty of mangakas also talk about having to think of things on the fly for reasons such as their manga ranking lowly and in danger of being cancelled. See Hori cutting short Kamino Arc, Tsukushi adding in Nanashi, etc. Planning out details a year in advance is extremely unlikely for any weekly mangaka just by the grueling schedule alone. Audience reaction, such as being enjoued, also is a large factor that any mangaka needs to consider. This is a commercial magazine, you thinking that audience reaction doesn't matter to creators is incredibly naive. \n\nI can buy Gege planning to have Higuruma's technique fail, but you really can't convince me that he planned much in advance this particular instance of having Judgeman confiscate an external tool such as Kamutoke here. If that were the case, then we should've seen Higuruma at least consider this as a possibility, the same way that we see Yuta consider the failure of him picking out Jacob's Ladder in his domain. That occasion is clearly to have been planned. But this one? Sorry, no.\n\nIn fact, Gege actually said in his own fanbook that he doesn't plan out the details ahead of time. He said that he has the general gist of the story and plot points in his mind, but what gets him from point a to b is usually left blank, and he likes to go with the \"what is the most interesting way things will play out?\" technique.",
            "I'm saying that in response to you saying they should cut out him blitzing people. He's currently gapping these jobbers but it's still a fun read",
            "That’s not straw-manning, that’s an exaggerated response to the EB claim showing why people would rather Sukuna die there",
            "His own strength? We’re long past that. He used soul swap to “cheat” as Yuta called it and learn SD and RCT \n\nThis is a genocidal child killer. There’s no need for his own strength. Just winning is the priority",
            "If Gege cared so much, *why not show it*? We literally have just statements to judge its power because the only time it was used was against the character that is immune to it. How lame is that? No matter how much backstory, statements or author comments it gets, in the actual story, it's an afterthought. As things stand, it just exists to give Higuruma something to do.",
            "Yes and no, I believe the confiscation *would* last forever, but theres always the option of appealing, which is actually fairer than it seems because eventually Judgeman will accuse you of something you havent done, or can at least argue your way out of.\n\nI dont know how high the range of an appeal is though, it might just break all rules and work from anywhere, since Higuruma didnt need to recast his domain.",
            "Definitely didn’t downvote you bud. There are other people who may disagree with your opinion.\n\nI think it’s been shown and emphasized since Higarumas entrance that he has a great gap of experience, that being his largest flaw. In the chapter before the incident in question, they spend about half of it going over various areas of knowledge Higaruma is unsure on, particularly about the degree to which actual legality plays into the outcome. The idea that he did not know the full depths of his technique were for sure set up. I would agree with a critique of the actual narrative consequence, as I would’ve liked to gain greater understanding of Kamutoke, but I remember reading the chapter where they go over the plan thinking “Hm, I know there’s something I’m not considering here”.\n\nYour absence of evidence point doesn’t really make sense because your view, the one which was initially challenged, is the one that lacks evidence. You’re making a claim, but the claim has no evidence to back it up. The idea that the author is “deliberately” writing in the way you say has nothing to show that degree of deliberation.\n\nI also disagree that my points don’t have evidence. The evidence is the plethora of other plot beats that have happened in close proximity to this one which have been set up well in advance. We can prove that because we can see that the chapters that set those plot points up were written years ago. Plot points being something that are set up happens with regularity. I don’t disagree that Gege probably writes some shit simply because he thinks it’d be interesting. But he clearly finds it interesting because he really likes the battle system he’s created. That’s why he spends so much time dropping information about it. The rules of the system itself are interwoven with the actual themes of the series. I have good faith that he’s not breaking the rules because I can point to a lot of times he was extremely consistent with these rules. And he clearly has put a lot of stock in these rules as he hinges a lot of important narrative weight onto them. That’s why he sets up many of the big technique lore drops in advance and reveals some as the characters discover it. Like he literally made the system. The narrative that he is always withholding information is not real, withholding information is just a real narrative storytelling tool that a ton of authors use. It’s ONE way he delivers information. And it’s not near the most frequently used one in this series.\n\nI haven’t seen that quote from the fan book, but if you have an image you could share I’d love to see it.\n\nI only push back on this so much because a lot of people say everything that’s happened in this fight has been an asspull or bad writing, and it’s just not true. And if we’re all being real, this only really became a problem after Gojo v Sukuna. This community has been so overly critical, while offering critique that defies basic reading comprehension. Maybe it’s a vocal minority, but it gets tiring. If this isn’t you, feel free to ignore.",
            "im saying the waste of pages would be from him thinking deeply about how to counter higuruma's techinque",
            "What’s the definition of strawman in your eyes?",
            "You are taking it too seriously brother, it's a manga, a piece of entertainment, I want to see the main character display his full potential, not save imaginary lives or get twisted because the bad is a genocidal child killer and the author is refusing to write that he got a heart attack and died to put a stop to the imaginary killings, sukuna can rape a baby in the manga for what I care, as long as the story is entertaining and satisfying to read through.",
            "There would be complaints either way. There would have been arguments on why Deadly Sentencing could have been used before Kamutoke killed off X character. Even more complaints on how chapter/chapters were spent on Gege glazing Sukuna. \n\nIn my opinion, Gege really spent *a lot* of time on handling why these what if scenarios wouldn't work. I can understand a lot of people feeling burned out about it but it’s one of the few series that takes the peoples opinion of “If *character x* did this then the fight would be over” and proves that it wouldn't be the case the more chapters we read.\n\nOther than the super vague binding vow card being played for Sukuna’s problems, this entire plan of taking Sukuna down has been really crazy to break down once you re-read through its steps.",
            "I guess we’ll never know",
            "That's kind of hilarious because I'm not sure what exactly offended them. Was it me saying Megumi is dead, or that I have a pet peeve against Gege? LOL.\n\nI get the point about lack of experience. The problem with this particular development is that he already has experience with regards to how he didn't know the exact limitations of his own technique. He admitted to it, was surprised by it during the Yuji trial, so theoretically, he should've gained experience from this, right? But his experience with Yuji conveniently just didn't factor into his mind at all.\n\nIf say for example, Gege didn't show things this way, that Higuruma had already had a similar experience with Yuji of being surprised by his own CT, then I can buy him overestimating himself and assuming that Judgeman would confiscate only internal qualities. But once Gege actually demonstrated Higuruma's admission of him not understanding his technique well before the Shinjuku, then it becomes a lot less convincing why Higuruma, legal prodigy, appears to have learned nothing at all from his experience which was explicitly shown to the reader.\n\nI actually think my claim (that Gege deliberately keeps things vague, so he can more easily fill in plot points afterwards with the readers not able to complain against his logic for JJK world) has quite a bit of evidence to back it up. For instance, the Kenjaku vs Yuki fight, which was ended with the Anti-gravity technique that Itadori Kaori conveniently owned. We had no foreshadowing, no warning at all that Kaori ever had a technique like this beforehand. But conveniently enough it worked to cancel out Yuki's last stand (I'm not going to complain about the physics aspect here, I think that's been done to death already, it's not as a big deal to me tbh).\n\nThere's also the issue of how Yorozu wasn't able to have a full heal, but Sukuna was, which Gege put in as an author's comment later on after 237. This plot point regarding how incarnations work was also kept deliberately vague until the revelation of Sukuna's Heian body.\n\nThe other issue is Gojo's motivations. I've been doing a lot of thinking about this one, and I realised that Gege had actually intentionally kept Gojo's morality and motivations in the dark. Even though there's Hidden Inventory, there's actually precious little illustrating things from Gojo's POV. This one is long planned however, the more I think about it. But the point stands still that I think he kept this in the dark deliberately, so that the shock factor would be greater.\n\nThe quote actually comes from the afterword of JJK 0, my mistake. Unfortunately I can't find the previous parts, but here's a partial quote:\n\n私はマンガを描く時 “テーマ” （主義主張？）を決めてなくて「こういう展開面白いかもなー」「こういう人物（キャラ）いいなー」「こうしたらアツいのかなー」みたいな “なんとなく” の連続で描いています（その結果テーマが生まれることはありますが...）\n\nなので他のマンガでやろうとしていたけど叶わなかった “なんとなく” のストックを呪術にいっぱい盛り込むぜ！って感じで企画を作ったので、それはもうノリノリです。\n\nThe relevant part is at the top, when he says he draws he doesn't decide on a theme, but rather \"this development is interesting!' \"this character is really nice!\" \"this really can rile people up!\" and things just end up being played by the ear as he draws during serialization.\n\nI mean, I guess I can see what you're saying for the last part. But for my part, I had been having some issues with his storytelling for a while during the Culling Games, it's really 236 that gave me huge problems, which is why I started posting here. I'm guessing a lot of the complainers were the same way. For what it's worth, I do agree about how a fair amount of the complaints are just being nitpicky. But also, from what I remember, there were complaints for a long time during the Culling Games, they just pretty much all got downvoted and shouted down.",
            "I never said you weren't",
            "Arguement 1: “The manga shouldn’t end at executioners blade, that would be stupid!” \n\nArguement 2: “well of course it seems stupid because Gojo died in 236 and that wasn’t supposed to happen. \n\nArgument 1A: “kenjaku’s death was horrible!” \n\nArguement 2A: “well you only think that way because Yuki died to the black hole when she should’ve gotten Kenny too, that would’ve been a much better death” \n\nStraw manning is, by definition, arguing against something that’s not the main topic of the discussion",
            "You’re mentioning that Higaruma should’ve learned from the experience, but the issue is not that Higaruma does not learn from experiences. We see him learn and adapt on the fly after Judgeman does not work as intended. It’s that his lack of experience creates gaps in his knowledge which cannot be bridged in a short amount of time no matter what because they are things that are gained with experience. Nothing from his experience with Yuji would give him cause to expect this. He’s a prodigy because he’s been able to advance this far in this amount of time with little knowledge of the strict ways in which the rules interact. And as the OP outlines, there are a myriad of reasons it would be extremely difficult to even lab this situation out, combined with the fact that this interaction is not the obvious outcome. This is not something most people would think to lab out, particularly when there are strict fundamentals he could be working on in that time frame. \n\nAs for Antigravity system, the fact that Kenjaku had a gravity based CT was already shown earlier in this same fight. He could have just as easily had said he was using RCT on the gravity technique, but neither outcome changes the fact that he already had a gravity based technique active the whole fight. The fact that said technique came from Itadoris mom is like an interesting piece of information but it’s not as though the operable technique being used was pulled out at the last moment. He used an ability we already saw him using via RCT which we already know can be done to produce the inverse effect of what the technique was. Who gave him the technique is the only real new information revealed in that chapter, which doesn’t actually impact the fact that he’s been using the gravity technique the whole fight.\n\nNot really sure what you’re referring to as far as the Yorozu fight. Also not really sure what you mean about keeping Gojos motivations in the dark. I’ve been pretty clear on what his motivations are the whole series. \nI don’t know if this thread is the best place to really get into it but I think Gojo is a superbly written tragic hero throughout the entirety of the series.\n\nI also just pulled out my copy of JJK 0 and you’re taking that quote completely out of context. Gege is talking about how when he starts a series he doesn’t have a particular theme in mind and how there are a ton of ideas from past projects that got cut that he fuses together. He talking in particular reference to the fact that he didn’t force JJK to start, he wrote a One Shot and thought it was pretty interesting and so he decided to pursue the idea further. To use this as evidence that in the late game he’s doing the same when he starts the sentence with “When I start a Manga series” seems improper, especially when all of this was written in 2020 since the volume of JJK 0 came out in January of 2021. That’s at least two whole years before even the start of the fight between Gojo and Sukuna and I think literally before Higaruma had even been introduced into the series. His process for “coming up with a series” before its even hit publication just doesn’t make sense here.\n\nTo be Frank, most of the criticisms regarding Geges actual writing ability fall flat to me. I’ve read a lot of manga of very varied qualities and this certainly is not bad writing. If you don’t like the writing of the series thats you’re prerogative, but I challenge you to consider what the author is trying to say to you as opposed to what you want them to be saying. Because Gege Akutami actually has some extremely interesting thoughts on society that I think are worth delving into.",
            "special-grade gaslighting going on",
            "Could you provide me a citation for that definition? I can’t seem to find it anywhere but perhaps I’m not being broad enough in my search.\n\nNvm, got the Wikipedia definition. My fault for not checking the obvious pedia first :skull:"
        ]
    },
    "Why isn't the Japanese military getting involved?": {
        "title": "Why isn't the Japanese military getting involved?",
        "score": 323,
        "url": "https://www.reddit.com/r/Jujutsushi/comments/1dl6q80/why_isnt_the_japanese_military_getting_involved/",
        "content": "[\\\\\"It's wise to use conventional weapons when attacking a sorcerer.\\\\\"](https://preview.redd.it/h9gprgcgzx7d1.png?width=1067&format=png&auto=webp&s=3d7bf8c78923802901f18accbe1c8e8920cddd01)\n\nSo you're telling me that one of, if not THE most knowledgeable sorcerers of all time says that it is smart to use conventional weapons against sorcerers... but we literally have yet to see anyone do that since this moment?!?\n\nWouldn't it be a pretty good idea for some of the sorcerers to be armed with guns? The only people we have seen with weapons are the US military guys who are regular ass people... why have we not seen any gunslinging sorcerers yet?\n\nAlso what the fuck could the Japanese government/military possibly be doing at this point in time? I would imagine that Jujutsu society is probably linked in some way to the Japanese government... did they just come to an agreement to have no military intervention for some reason?\n\nI mean don't you think at least throwing some military snipers around the city to take some shots at Sukuna here & there would be a smart idea? Wouldn't it be a smart idea to just hit Sukuna with a fucking missile or something? Or even just bomb the fuck out of the area or something... you'd think they would see all this destruction & be like alright fuck everyone in that general area & just drop a bomb.\n\nIdk what do you think? Should Yuji have a blicky? Should the military get involved?   ",
        "num_comments": 146,
        "comments": [
            "Reminder:\n\n- **DO NOT POST CHAPTER LEAKS** outside the pre-release leaks megathread. Officials are free range. See the sidebar for info on leaks.\n- Powerscaling should stay in the designated Tuesday Colosseum thread.\n- Repetitive or low-effort topics will be removed.\n- Questions that can be answered by reading the manga more closely should be posted in the FAQ.\n\n[Fanbook & Other Canon Material](https://www.reddit.com/r/Jujutsushi/wiki/canon)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Jujutsushi) if you have any questions or concerns.*",
            "This was basically the point of the very short military invasion and the reminder that killing sorcerers without using cursed energy can result in them coming back as a curse with Maki.",
            "Non-sorcerers doing it would be pointless. Unless you can add on Cursed Energy or kill the curse a sorcerer can become, you’re only making the situation worse.\n\nAs for conventional weapons for sorcerers? It depends on the character. Ancient sorcerers just don’t know how they work and probably don’t want to learn based on their mentalities. The Gojo squad more or less picks weapons they like for various reasons. And modern sorcerers… are (reasonably) scared to. There’s always the factor of “increasing gun use will increase emotions associated with guns will increase curses”. You stick with the tried and true methods cause any change could be disastrous.",
            "It's pointless. Vengeful curse spirits would come back and kill them and the normal curse spirits would kill them all at night. You need sorcerers.",
            "Kenjaku said it’s smart but that’s because 90% of sorcerers are average. You didn’t see Kenjaku get hit did you? Neither did I.\n\nConventional weapons are cool and all and probably effective but they’re like an agreement between HQ and the government on interventions as those weapons aren’t infused with cursed energy meaning they’d just make the problem worse.",
            "Japan doesn’t have a military for WW2 reasons…Defense force is probably pissing themselves and hiding though",
            "Gege did a horrible job explaining. But yes the leaders of the Japanese government, and the emperor are apart of the jujutsu shenanigans and helped keeping it covered up. The guy who angel and the others save in 209 or 210 (I can't remember) gives a vagueish explanation on why they aren't getting involved and why they haven't in the past. And also kenjaku having a seat at the table is another big reason. He essentially assured that no one would interrupt what is going on. \n\nAlso, despite kenjaku saying this, he later contradicts himself by saying the military never stood a chance against sorcerers and cursed spirits. Proven by the fact that grenades and snipers werent even enough to damage the helicopter head sorcerer (I'm assuming he was around grade 2)\n\nI'd love to give a less paraphrased and more detailed answer to your questions but then I'd have to re-read. \n\nAs for what Japanese military, or defense forces have been doing since shibuya, they've probably been working tirelessly for the population in making evacuation shelters and defending the citezens. Think about the scale of what just happened and how long it would take to make things right. They'd need longer than a month. Most nations in real life could barely deal with covid. They're probably leaving the jujutsu stuff to jujutsu sorcerers",
            "The US military got stomped pretty quickly. Everyone forgot about them🤣👍🏻",
            "Because JuJutsu sorcerers must only be killed with cursed energy attacks or cursed weapons. If not then they will come back as vengeful spirits.\n\nIt was whole reason Kenjaku fooled the US to send their army into the culling games so that it would result in more cursed spirits being spawned.",
            "On the point of having sorcerers with guns, in universe, a lot of them are still minors, so gun laws probably still apply to them (even though they're technically like soldiers). Even if that wasn't the case or we didn't apply that logic, out of universe, it'd be kinda boring if everyone just had a gun, especially if it made things too easy in certain cases, plus it doesn't really fit the aesthetic of jujutsu sorcerers. Their society I'd also ruled by conservative oldheads who may see conventional weapons like that as beng beneath them, like with what Naoya said about those who rely on Cursed tools, so it probably wouldn't be encouraged.\n\nOn the point of using this weaponry on Sukuna, there's two reasons why that isn't a great idea:\n\n1.) Sorcerers and Cursed Spirits can't truly be neutralized without Cursed energy. In the case of sorcerers, they turn into vengeful Cursed spirits, and in Naoya's case, it only seemed to make him stronger, so you could imagine how terrifying that would be in Sukuna's case.\n\n2.) Snipers would have to be situated within Shinjuku in order to keep Sukuna in range (according to the two second research i did confirm the farthest recorded shot of a sniper and the size of Shinjuku) which would obviously put them in danger of getting in his line of fire. He could easily send off an insta-kill slash in their direction the moment they start firing.\n\nAlso, given how Maki was able to dodge a point blank range shot even before her awakening as well as Kenjaku being able to react to a sniper shot as in the panel you've shown, I've no doubt that Sukuna may very well be able to react to the shot before it ever hits him.",
            "Naoya came back like several times more powerful because he was killed without CE. It's a pretty bad Idea especially vs Sukuna the range on his slashes and the lack of CE from regular humans means he'd kill them in one shot. He could literally slice the buildings the snipers are hiding in and they get squashed by the debris.",
            "Toji likes this idea",
            "Special grades are capable of taking out nuclear armed militaries,I don't think they'd be helpful.",
            "A military did get involved in the culling games, and you saw what happend. \n\nI don't think there's much more to say about that one. \n\nA few sorcerers will die sure. But how many soldiers do you think are capable of killing Sukuna? I'd say a fat zero. \n\nDoesn't help that Mai isn't remotely as useful as she'd be IF she was in Maki's shoes. \"It's wise to use conventional weapons when attacking a sorcerer\" but even Toji didn't bother using his Gun to shoot Geto when he easily could've dispatched him right there before shooting the Star Plasma Vessel. \n\nI think Kenjaku was mocking Mai.\n\nI mean... He caught the bullet while saying it... It doesn't get much more patronizing than that.",
            "I don’t think the government involves itself in Jujutsu related incidents. That’s more the job of the Jujutsu Society. Same goes for a lot of anime, governments never actually involve their selves into supernatural events, they always leave it to the sorcerers (JJK), devil hunters (CSM), hunters (Solo Leveling), heroes (OPM).",
            "The military intervention in the culling game makes it clear that while firearms are effective against sorcerers, there is a level where their efficacy drops off. Carpet bombing may not be enough to stop Sukuna, and if he were to die from conventional weapons, you risk creating a curse stronger than he is, which effectively destroys the world.",
            "Imagine Sukuna coming back as a curse... ",
            "They're busy edging",
            "Gun Devil vs Jujustu verse (the Gun Devil wins)",
            "A glock might not be very effective with Sukuna's speed and flying slashes, but an air strike or carpet bombing could give anybody trouble.",
            "I'd say he meant against typical sorcerers, I don't think that any Special Grade sorcerer and a lot of 1st Grade Sorcerers would at all be threatened by conventional weapons if they were on alert",
            "You forget Mai?",
            "for what? Todo could wipe his dick with the military",
            "What could the Japanese military even do? Just killing the sorcerers ain’t gonna do much when literal spirits are killing everyone",
            "well wouldn’t the sorcerers be moving way faster than the military or any normal person would really be able to see?",
            "I’ve been said they should just nuke the place",
            "It's straight up said that shotguns, tanks and cluster bombs are hardly useful after grade 3",
            "Because the US military tried and that failed",
            "Because it's called Jujutsu Kaisen... not America.",
            "Well if it goes off real life basis I'd ask \"what military?\"   But I'm sure this question has allready been mentioned surely...",
            "Can't, got their hand full from all the shelter. And with all the 10 millions curses running around they are nothing but fodder.",
            "Sukuna at ANY given situation except after a domain could have deflected the bullets with dosmantle and the way he's moving is too fast for regular people to even see.",
            "If you want to read that kind of story, go read Kaiju No. 8\n\nIt's really good and they use guns on the kaiju. But JJK should be about sorcery.",
            "I think part of it is explained with Hakari being shunned from Jujutsu High based on the modernity of his cursed technique. Modern = bad, and they have enough influence to make sure the military doesn't intervene. \n\n If I was a higher up there's no way I wouldn't start a \"cursed tool\" ammunition factory so squads of non-sorcerers could get rid of small curses (maybe Grade 2 and below) and free up working sorcerers. But it also sounds like higher society is also slightly dismissive of non-sorcerers in a less extreme version of Geto. \n\nThe government actually is responsible for the budget of the high schools; comes from prefectural taxes. They got into it in the fanbook and light novel (Yuji has to follow Ijichi around and see him apply for traffic and encroachment permits to exorcise stuff that would need to be closed off)",
            "The Japanese government does not have a military after World War II.  Part of the constitution they made was to be a pacifist nation gave up their rights to a military Just the Japanese defense force, JDF.   I’m not sure what rules apply to the defense force versus a normal military but every time I see them, they always have to get 186 levels of permission. They don’t seem very  well equipped to handle anything other than post kaiju relief aid, standing by waiting for things to happen, and internal Japanese struggles.  \n         I do wonder though about the whole guns thing. Sure regular bullets would not be a good way to kill a sorcerer, but a couple shots to the leg will really slow you down.  Also can’t any competent sorcerer imbue things with cursed energy at least temporarily. So if they have bullets with cursed energy, shouldn’t firearms be effective??",
            "Its smart for sorcerers to use conventional weapons against sorcerers, without CE enhancement for the bullets even a pretty mid grade 2 sorcerer could tank machine gun fire.",
            "Let me just say this\n\nEven grade 2 level fighters are immune to bullets",
            "Because they don't have one.",
            "It would be a good idea if their goal was to make the situation even worse by creating an army of vengeful curses\n\nAnd that’s even if they stood a chance against the curse spirits and sorcerers.",
            "that is a good point what the fuck is sukuna going to do against a barrage of JDAMs or the entire JASDF. CE reinforcement is powerful but high explosives and overpressure doesnt realky care what youre made of. Not to mention that fighters and bombers are dropping high explosives at BVR.\n\nI always thought that theyre fighting in a a completely unoccupied area and that the military literally has no idea that this is happening",
            "Simple explanation: Gege forgor\n\nBut I don't see what would be the point of Japan military to engage. Their presence would change nothing. Just another chapter or two how sorcerers absolutely wreck non-sorcerers.\n\nSorcerers with guns wouldn't be as effective to watch as fighting hand to hand with techniques only.",
            "Yeah if the military would intervene it would be more harm than good at this point. They probably told the. To hold off unless all of them die",
            "the military did well against the human awakened and incarnated sorcerors but got rekt by curses which they cant shoot or kill with conventional weapons.\n\nAlso the military invasion was meant to neutralize and capture in an urban setting which is one of the worst mission environments ever. If they wanted to kill the sorcerors theyd drop bombs and shell the entire culling game area.",
            "Its much harder but shloting to wound is a thing. Even then, a lot of the culling games players are quite resilient or have RCT.\n\nOpening a fight by having your military personnel unleash a volley of fire or hit them with precision strikes from a distance *then* letting 1-2 sorcerers move into melee and have their normal foghts with a wounded enemy would be more effective.\n\nOverall, i feel it was more a dropped plot point or an area Gege may have decided was no longer worth exploring in the context of the main plot.",
            "Give the sorcerers guns & have them imbue some CE into the bullets just like they do with swords, hammers & whatever tf else lol. Or just have em bomb Sukuna & deal the finishing blow wit CE.",
            "The incarnated sorcs might know how guns work as they have the knowledge of their hosts. It is prob their mentalities as you mention. I mean kashimo to me would seem like a gun guy if he didnt have lightning powers lol",
            "This thread makes me think of the Hunter x Hunter nen bullets that emitter types have. Would have been kinda cool to see powered up cursed energy bullets that go through sorcerers defenses",
            "I don't think anyone right now is worried about dealing with the emotions of people to reduce curses lmao... I think they're mainly worried about killing Sukuna & preventing the merger. Ancient sorcerers gain the memories of the bodies the take over so they would know about guns.\n\nIdk I feel like they could easily imbue bullets with CE just like how they can literally imbue anything else.",
            "Not if the sorcerers imbue the bullets with CE...",
            "Idk I'm not saying some military sniper should one tap Sukuna lol I think Sukuna would survive multiple gunshots. Just start firing some shots at him to give the sorcerers openings or have a sorcerer imbue some bullets with CE or something idk... or at least explain why the military is completely uninvolved.",
            "The JSDF is literally just a regular military pretending to be not.",
            "It's not a contradiction. Conventional weapons can be really useful, but not used by the military. Toji used a normal katana and a normal gun to stab gojo and kill riko because sorcerers taken by surprise are pretty much normal humans. However, fighting a sorcerer straight on with a normal weapon would be useless as even haba (helicopter dude who was probably grade 2) was bulletproof. Mai in that scene used a surprise attack with a sniper (which failed miserably), but it was still a surprise attack\n\nThousands of soldiers getting decimated in the colonies was the answer for why the military doesn't really get involved. Nothing short of cluster bombing can damage a grade 1 sorcerer, and the threats are wsy above that.",
            "We didn't, Greg did",
            "A battalion from the US military got stomped, the US military has barely intervened.",
            "They literally fought the military equipment of someone’s pinky toe. A US military that knows what’s going on and doesn’t care about collateral damage is the death sentence for any sorcerer, bar none.",
            "Vengeful spirits are not guaranteed. When not killed by curse energy, not every sorcerer comes back as a vengeful spirit.",
            "1.) You can imbue bullets with CE.\n\n2.) You usually put your life in danger as a soldier when your country is at risk. Knowing Sukuna he could tank sniper shots but shoot him in the legs or something to allow for a sorcerer to finish him off. \n\nSukuna could probably dodge bullets & what not but why not keep him on his toes?",
            "I don't think Sukuna would die to a singular bullet but if he was being shot at from far away while also having to deal with the sorcerers it could be a good help. Yeah the soldiers would put their lives in serious danger but considering the stakes of the scenario isn't that what they're there for?",
            "Taking over a country doesn’t mean the country has nukes. And no sorcerer is beating a nuke except Gojo and maaayyyyybe Kenjaku with some hyper specialized barrier. Also Ui Ui.",
            ">A military did get involved in the culling games, and you saw what happend.\n\nThat was a single battalion aimlessly rushing into the culling games lol... I'd kind of expect a more strategic task force plan for dealing with a single target... Sukuna. I just figured maybe after watching their country go to shit on a livestream broadcasted by magical crows they might try & assist.\n\n>Doesn't help that Mai isn't remotely as useful as she'd be IF she was in Maki's shoes. \"It's wise to use conventional weapons when attacking a sorcerer\" but even Toji didn't bother using his Gun to shoot Geto when he easily could've dispatched him right there before shooting the Star Plasma Vessel.\n\nToji didn't kill Geto on purpose because he didn't want to deal with the cursed spirits that would be ejected from his dead body.",
            "I think if it gets to something this scale they probably should get involved...",
            "Country is in turmoil and the streets run red with blood? The sorcerers (who have been shown to NOT be capable of handling it) will handle it.",
            "Cursed tool bullets",
            "Gojo or Sukuna beat it, but everyone else gets low diff'd",
            "Ichiji says \n\n\n\nGrade 4 easy with a wooden bat\n\n\n\nGrade 3 should be good with a pistol\n\n\n\nGrade 2 calling it close with a shotgun \n\n\n\nGrade 1 even a tank might be useless \n\n\n\nSpecial Grade carpeting explosives such as a cluster bomb  might work",
            "Because arms development stopped after cluster bombs.",
            "With some dudes and APCs, clearly the peak of military might.",
            "Also, let’s be honest, Japan and the US are on good enough terms that Japan LITERALLY had a Shinto ritual with US-supplied jets, so there’s no way the US gov. wouldn’t know about curses and CE. And knowing the MIC, they would’ve realistically already been producing munitions and armored vehicles that function similarly to cursed tools with the unparalleled industrial might they have.",
            "I doubt the government is going to care when jujutsu society has proved itself incapable of doing its literal job.",
            "Gege would probably say something like “uuuuhhhhhh they’re focusing on humanitarian stuff” while Jujutsu Satan is literally killing the last good fighters left.",
            "The military absolutely did not do well against the culling game sorcerers. It took an entire squad to take out Helicopter Man, who got entirely no-diffed by an Itadori striking the hardest part of his body. All of the soldiers in the culling games couldve been wiped out by one Incarnated Sorcerer like Ryu, Uro, or Kashimo. Hell, probably Higuruma. They just wouldn't have the firepower to meaningfully hurt them.\n\n\n\n\nEven weak sorcerers are practically bullet-proof. In the prison arc, Megumi gets thrown through a goddamn building by Sukuna and hes mildly injured.",
            ">shloting to wound is a thing.\n\nIt's really not, sadly.",
            "That’s a good idea in theory but keep in mind sorcerers are a rare commodity, and the ones who are actually combatants are probably more effective using their own unique fighting style / cursed technique anyways over the use of CE imbued firearms.",
            "Cursed tools are different than weapons imbued with CE.\n\nOutside of death, no sorcerer has been able to create a weapon imbued with cursed energy that retains its effect outside of that sorcerer’s hands. I guess Yaga technically could, but he’s dead now and I don’t know if you want a living gun lol.\n\nSo even if they had a sorcerer imbue a gun with CE, the gun wouldn’t retain that CE outside of that sorcerer’s hands",
            "Yah but if someone pops a bullet into Sukuna he’ll just come back as a Vengeful Curse and no one wants that",
            "no clue if that's how it works. mai's work as they're literally made our of ce. just imbuing it? idk. I guess kusakabe exists so maybe you're right. just how would the military use cursed energy/jujutsu anyway.",
            "Because it wouldn't do anything. This is like saying you should jump him with professional boxers.",
            "Nuke the area. Shinjuku is destroyed either way.",
            "Doesnt matter, Grade 2 Sorcerers can deal with most US army combatants. Grade 1 or Special Grades can fucking Hiroshima the US military in a few days.",
            "Someone as strong as Sukuna 1000000% would",
            "Yeah but only a sorcerer can putting a low grade sorcerer wouldn't be able kill sukuna and would just reveal the parties involved \n\nYes soldier do risk their lives in general but you are just seeing them as means to an end there legit people like yuji, todo and yuta who would be very against this plan\n\nBecause if shit hits the fan they die and nothing would be able to save them not counting domain sukuna could easily sense curse energy of bullets as you said source he looked directly at meimei during her crow attack",
            "That would do 0 damage\n\nEven fucking grade 2s can tank bullets\n\nIf anything a bullet would help sukuna because he’d be able to use it somehow, like detonating it with fuga",
            "Jackpot Hakari no diffs the nuke",
            "Don't gotta kill someone to completely stop them. \n\nI understand the idea that if Toji kneecapped Geto or something, he'd just heal with RCT and fight back. But with Geto's speed and maneuverability, I feel like a kneecapping and a swift follow up to just take him out of the equation isn't outside of Toji's realm of possibility. I mean he had literally just killed Gojo, he must've felt like anything was possible at that point.\n\nI really don't think traditional weaponry is actually all that useful against sorcerers. Especially higher grade sorcerers",
            "no amount of arguing can bring back logic to gege defenders.",
            "Look I agree that the government should be involved, but that’s just not how anime works",
            "Idek if sukuna beats it, he might just lose to raw fire power. No answer for Gojo though, he wins.",
            "No! Ijichi gave an ANALOGY for \n\n***IF***\n\nCONVENTIONAL WEAPONS WERE EFFECTIVE against **cursed spirits**.\n\nWhich has nothing at all to do with the topic of fighting human sorcerers with conventional weapons. Haba, the Grade ~2 Sorcerer with helicopter hair, was completely immune to Sniper rounds, grenades, etc. Even a carpet bomb isn't scratching Sukuna, and they aren't gonna nuke their own city.",
            "I did find the \"the US government has no idea about cursed energy\" to require a little suspension of disbelief. They would Area 51 the first suspicious US sorcerer/proof of CE in a heartbeat and find out that way even if for some reason Japan didn't tell them.",
            "That's fair, the government more or less already relies on sorcerers and don't really have the ability to do much more if they're not let in on planning",
            "Megumi getting thrown through a building is largely anime only. In the manga he was shielded by Nue for both the attack and the impact into concrete.",
            "Actually the majority sorcerers are really only able to reinforce parts of their body as opposed to their body as a whole. Essentially, anyone who isn’t like grade 2 and above would get shredded by three people with assault rifles unless they can do some shenanigans like rapidly swapping where they reinforce.\n\nEven then, you can easily just make a gun into cursed tool. The only reason why sorcerers aren’t just running around with sub machine guns that and essentially shred fodder curses (or even grade 2s if the tool is strong enough) is because the Jujutsu higher ups are super traditionalist and despises modernity, compounded with Japan’s already strict firearm laws and it’s practically impossible to get a gun to make a cursed tool in the first place, and no one else can really make cursed guns because of Bumgen’s barrier keeping CT in Japan.\n\nObviously top-tiers, most grade 1s, and people with specific techniques or skills to deflect bullets (New Shadow is a great example. Automatically attacking anything that enters an area basically means you’re immune to most ranged attacks) are able to counter bullets.",
            "The spelling curse got me, apologies\n\nAlternatively, you can rely on the fact that sorcerers are more survivable and just attack centre mass. Given the kinds of attacks the cast regularly take, normal anti-personnel tactics shouldnt kill outright",
            "I mean it does work. You just have to do it a specific way. After you kill them. Stab their head with a cursed tool a bunch.",
            "Well clearly the sorcerers using their own unique fighting styles isn't working out so well...",
            "Juzo was able to have an entire cursed tool workshop, he even made a Special-Grade tool, though we do not know the exact mechanism behind his craft. Miwas sword is \"kind of a cursed tool\" due to prolonged exposure to CE. \n\n\n\n\nI dont think it requires death, it just requires time and energy, and maybe a ritual like the bath Uraume prepared. ",
            "Just because we haven’t seen it doesn’t mean it’s impossible.",
            "It also takes at least months to make one cursed object worth a damn, and no mere semi-second grade bum can pull off a decent blade, let a rifle that shoots CE infused bullets",
            "Japan doesn’t have nukes, and I have this strange feeling they might be a itsy bit disinclined to ask the U.S or someone send an ICBM to drop a nuclear weapon on themselves if it’s at all avoidable. Plus, it’s not like it would be a fast process to convince a foreign power to nuke a city, and for right now the magic special forces have things covered",
            "& let a sorcerer hug the bomb before to give it some CE.",
            "And then have to deal with vengeful curse spirit sukuna, sure",
            "That’s not how tactics or doctrine work though. No military is just going to gather all the assets in one location to be obliterated altogether. They will spread out with overlapping engagement zones and adding their kill chains to the battlesphere.\n\nOnly special grade Sorcerers could tackle something as massive as the US military in any effective way. Grade 1’s could do some incredible damage in an isolated circumstance but it wouldn’t last long before they are pinned down and overwhelmed unless they can teleport away or hide within a barrier technique strong enough to resist a modern nuke.",
            "drop a nuke and be done with it maybe even two",
            "I don't even want to *think* about it ahahaha",
            "…and? Why does the objections of some teenagers matter when the strongest sorcerer is on the loose? Put discretionary spending towards production of cursed munitions and the Marine Corps suddenly becomes the biggest sorcery clan in the world.",
            "Just get CE bullets duh",
            "Geto didn't have RCT at that time... also Kenjaku openly says its smart to use conventional weapons... you can say it was sarcasm or a dig but it likely wasn't. Sorcerers are used to dealing with CE attacks so to have a bullet with no CE sent at them is like a changeup.",
            "That’s because you aren’t thinking creatively. There’s a lot of possibilities with modern weaponry that a single groups of soldiers with APCs can’t use exploit.",
            "I love the series, I just expect the military to get involved or have an explanation as to why they didn't get involved.",
            "Yeah to be fair it depends on a lot of factors, distance and etc. if it's close up Sukuna wins, if it's far away gun devil wins",
            "> he might just lose to raw fire power\n\nLong range, high power attacks? Absolutely. It's why he shot down the crow(s).",
            "So uh I fully agree with you. Kind of the point I was trying to make because sorcerers of a rank are supposed to be stronger than cursed spirits of the same rank. There is also the fact that for special grade it only says might work. I probably should have been a bit more clear about that but I was eating and it was like 5 minutes before I walked into work so time wasn't an abundant resource",
            "Just put some CE\n\n*IN THE CONVENTIONAL WEAPONS*\n\n**LIKE EVERY GOOD SORCERER DOES**",
            "American sorcerers are canonically a thing too, so that’s another option.",
            "I just find it kind of weird that they wouldn’t find it even a bit insufficient to have no backup plan when some dysfunctional adults and messed up children aren’t able to protect an entire nation from invisible monsters.",
            "This is canon imo, have someone stationed at an ammo depot infusing bullets and ordnance with CE. Then start dropping the nukes.",
            "We dont know the exact processes and ways by which you can make cursed tools, since weve only ever seen it done by Construction users putting their all into a final item.\n\n\n\n\nBut you definitely cant \"easily\" make guns into cursed tools considering how expensive we know cursed tools are, how valuable stockpiles of tools are treated, and how many characters choose to use a mundane weapon instead of turning that mundane weapon into a cursed tool.\n\n\n\n\nThe process of making a cursed gun would likely require a strong sorcerer and be too slow for mass production.",
            "Basically the author has no interest in telling the story you’re getting at",
            "and sorcerers not using their imbued cursed techniques would work out even worse",
            "\"Sorcerer Slim Pickens, we got a job for ya...!\"",
            "Put CE in the bomb",
            "Kenjaku literally blocked it, while looking at and talking to someone else, that to me doesn't sound like conventional weapons are all that smart to use. \n\nKenjaku is a genius, a very common personality trait within people that smart, is a condescending attitude. It's not their fault, just everyone is so much dumber than them. It's not completely absurd that he could have been mocking the girl that may as well not even be a real person, that's trying to shoot him with a gun.",
            "Or I know nothing more about military arms than the fact that everything is some form of kinetic damage being inflicted on the person effected. \n\nJujutsu on the other hand, has a series of effects that can damage an opponent in may different ways. \n\nUraume can freeze an entire Platoon on His own. \n\nSukuna can literally burn as many people that are in his Domain. \n\nKashimo can use electricity... \n\nGeto can summon a whole army of cursed spirits provided he had that many on his squad. \n\nYuki can create a black hole. \n\nGojo can activate his domain and dismantle a large group with relative ease. \n\nToji isn't even a sorcerer and he's a whole problem in and of himself. \n\nGroup of APCs or not... That was 6 sorcerers and Toji. If they EVER were able to get along, the only thing that MIGHT stop them is a Nuke. \n\nEven then, Sukuna has so many binding vows he probably has a way to counter that too........\n\nLet's not even start with the fact that Kenjaku would be able to completely take out a military from the inside if he so chose. \n\nI don't think this has to do with \"thinking creatively\".. I think maybe people have too big of a hard on for the military, when in reality, they're just normal people like us, being forced to fight a battle that back in the day, would've been fought by the leaders of their respective territories....\n\nIf you don't have heavenly restriction.. with no CE, you're gonna be useless.",
            "military arc was a failure , nothing more .",
            "They’re pretty evenly matched tbh. But as I said, gun devil has no answer for gojo.",
            "Yep, and the gun devil is throwing out hundreds of attacks like that. I think gun devil cooks him tbh.",
            "You're good, I was ending my work day myself and came off too aggressive. It's a misconception I've seen a lot where people think Ijichi was being literal, and it makes me insane. Not your intention, my b. \n\nSorry for the intense formatting.     :v",
            "The thing that bothers me about this whole post is that **conventional weapons imbued with ce would be *even less effective* than what they're already doing.**\n\nEvery bit of sorcery they have is more deadly. Like they already tried EMR blasts, an instakill sword, a soul cutting katana, angelic beams of light, poison blood, a fucking dragon, and soul shaking punches with 7 Black Flashes to boot. And he's still not going down. \n\nHow do some CE bullets/a carpet bomb make a difference compared to that? Anything they could do with a conventional weapon would be less deadly than something that instantly kills your soul if it pierces your skin. Especially to Sukuna, who could dodge all this shit and Kamino Fuga every soldier into bloody vapor. Or just Dismantle the building they're in and crush them. \n\nIt's like asking why we don't send a mall cop with a taser to arrest a heavily armed mass murderer. Wtaf do you think he's gonna do? And don't say \"create an opening for the Gojo squad\" because those guys trained for this and still can not find that opening without pulling every trick in their book.",
            "The best I can figure for a half-decent in-world explanation is that the Clans have been puppetting the government since the Heian era and making sure they don't mess around. But yeah that's also a bit of a stretch.\n\nI'd expect more tension between the non-sorcerer government and the Jujutsu higher up arrangements. They should have their own aims too and cook up something else.  Like a secret jujutsu R&D lab for the Japanese government, or a special JSDF squad or...something. \n\nHonestly just the idea that Jujutsu High gave just Gojo and Geto, two high school aged boys, the Star Vessel assignment to make sure the world isn't set on a path to destruction and then gave them like ... zero logistical support, or any working adult sorcerers to help them, is also pretty ridiculous. Sure, Gojo is fated to help but I'd be a little less relaxed about it. These people are canonically poor planners.",
            "The story implies that the creation of cursed tools requires a lot of time, effort, skill, or a combination of all three, or they wouldnt be ass fuck expensive. Probably too slow for mass production.\n\n\n\n\nI also should not need to explain why any country, especially america, is going to find it politically impossible to drop nukes on japan.\n\n\n\n\n\"Trust us bro we had to do it, they had fuckin wizards, it justifies violating however many dozens of treaties and war crimes.\"",
            "Cursed tools are NOT that hard to make, they just take a lot of time and constant exposure.\n\nA “cursed tool” is essentially just a weapon imbued with a curse for a specific purpose, which can be accomplished by having a user constantly imbued their cursed energy into the weapon, and over time it’ll just turn into cursed tool. Obviously, the strength of the curse, the speed of which the weapon becomes cursed, and if the user’s cursed technique will become infused into the weapon.\n\nVaults of decent or good cursed tools are valuable, not cursed tools itself. Any half-decent sorcerer will be able to make a cursed tool just over time if they constantly imbue a weapon with cursed energy, it’s literally something anyone can do. Weapons like Playful Cloud and Inverted Spear are among the top percentages of cursed weapons. \n\nMore likely than not, most cursed weapons the average Sorcerer has is probably gonna be around Slaughter Demon or Miwa Sword level.\n\nSo yeah, its not HARD to make, but I agree that its hard to mass produce. Thats not to say you wouldn’t be able to make a cursed gun though since you just need to imbue a bunch of bullets with CE.",
            "Its not like I'm trying to deviate the story lol I just want an explanation on why Japan's military is just watching its country get fucked...",
            "Whatever agree to disagree, I think it is smart to use both jujutsu & conventional weapons if you look at how sorcerers typically track attacks. That coupled with Kenjaku saying that about Mai's sniper shot kinda confirms it for me... also in the anime it didn't sound like a sarcastic response.",
            "This implies that they would even get anywhere close to sorcerers of that level, when lots of modern battle doctrine is from protracted distances. Good luck trying to get rest when you randomly get airstriked with chemical munitions out of nowhere.\n\nThe point is that they aren’t just going to sit by and twiddle their thumbs when the literal worst case scenario is happening.",
            "That was Kenjaku literally baiting the US military to send guys into the culling games... I'm talking about Japan's military not being involved when their country is getting destroyed lol.",
            "Yeah I wouldn’t trust two squabbling teenagers with the key to stopping the literal apocalypse unless they have a whole intelligence network taking down the assassination requests as well as monitoring for all sorts of hostiles.",
            "I think you have to go back to the military meeting chapter",
            "Couple it with CE and I'll agree with you. As a bullet imbued with CE would most definitely be effective, but there are too many ways for a sorcerer to avoid physical damage by ordinary means. \n\nAgain if normal Guns are useful against sorcerers, and Geto didn't have RCT at the time. Why didn't Toji just kneecap him to save himself time? He already had the Star Plasma Vessel in front of him. Killing her would've been no issue had he done it first, or after shooting Geto. \n\nI need to know how many Sorcerers Toji has just outright shot, before I can fully take Kenjaku's word as him not just being a patronizing asshole. Cuz if the man that's dubbed as the Sorcerer Killer isn't out here just shooting sorcerers, maybe it's for good reason. \n\nAll sorcerers don't become vengeful spirits after all.",
            "that's not how military works,  your bunch of soldiers get's slaughtered and your country is doing nothing , even a country like united states.\n\n If this was close to real , US commanders would have sniffed out information about curses and ce from japanese government's ass.",
            "That was the US military... who went to invade to take sorcerers for energy. I'm talking about Japan's military who is absent while their country is getting destroyed.",
            "I'm not arguing that a military sniper or a sorcerer with a gun would just easily & outright one tap Sukuna or anyone else. Sorcerers are very powerful & can see things at high speeds just as Kenjaku was seen blocking a bullet.\n\nBut I do think if Sukuna were surrounded by snipers as well as the sorcerers he would have more to worry about & the situation would be harder for him. \n\n>I need to know how many Sorcerers Toji has just outright shot, before I can fully take Kenjaku's word as him not just being a patronizing asshole. Cuz if the man that's dubbed as the Sorcerer Killer isn't out here just shooting sorcerers, maybe it's for good reason.\n\nToji is likely faster than a bullet as Maki was able to keep up with a mach 3 Naoya where a bullet is typically mach 1-3 but could be faster depending on the weapon. So it is more lethal for Toji to use blades & against Geto it was probably smarter to use the SSK because of the cursed spirits that bullets wouldn't do anything against...",
            "If this was real, the Pentagon would’ve already known about CE and curses long before Kenjaku contacted him (US and Japan are on good terms) and the MIC would’ve already had manufacturing of CE-infused munitions going on for a while thanks to discretionary spending. You mean to tell me the US military wouldn’t have already known about something as serious as this if sorcerers are in contact with the Japanese government? This might be one of the worse potholes in the series.",
            "Because they know what's gonna happen? If the US couldn't do shit, Japan can't do shit either.\n\nThe Japanese government knows about sorcerers and shit.",
            "What do you expect the Japanese Military to do that the fuckin US couldn't?",
            "What do you expect the Japanese Military to do that the fuckin US couldn't?",
            "Sure, provided Geto knew the attack was coming. He clearly didn't, cuz the S.P.V died in front of him. He wouldn't be able to summon a cursed spirit in time to block the bullet, had Toji attacked him first. And considering Toji made light work of every spirit Geto threw at him... I don't think it mattered anyways. \n\nAt this point in the debate, it feels less like Toji didn't want to shoot Geto, and more like he just enjoys the feeling of a hunt, and shooting him would've been too easy."
        ]
    }
}