{
    "¥$, Ye, Ty Dolla $ign - CARNIVAL ft. Playboi Carti & Rich Da Kid": {
        "title": "¥$, Ye, Ty Dolla $ign - CARNIVAL ft. Playboi Carti & Rich Da Kid",
        "score": 195,
        "url": "https://youtu.be/pEskP0ulPlA?si=gRMhoh2WoFSeSZ0i",
        "content": "",
        "num_comments": 55,
        "comments": [
            "Wild ass visuals",
            "the mixing is way better here",
            "Why does it sound like there’s someone talking in the background of carti’s verse",
            "Left the fan sample in there lol",
            "Lol the images are ChatGPT or other AI generated 😂😂😂\nI guess, that’s how you produce cheap music videos nowadays",
            "Sounds great and I enjoyed the visual nothing else really looks like this",
            "Not to take anything away from the music video, but interesting to see Adidas clothing in the video knowing how he feels about Adidas at the moment.",
            "I am disappointed of this video, waited so long for something like this.. nah man ye didn’t delivered this time",
            "The AI stuff is awful man.",
            "Interesting choice to feature skinhead hooligans in this vid, but not as weird as having free Adidas product placement with the track pants.",
            "Y puro pinche Carnival y no mamadas",
            "Kanye doesn't seem to know what Carnival even is his verse and this music video don't fit anything else about the song at all. It's a song about sex lmao. ",
            "Really like the mix on this would love if the streaming was updated",
            "good",
            "music video is fire 🔥🔥 love how its all bout football hooligans since  the inter ultras did the chorus",
            "Ye's mob of [Kulture](https://www.merriam-webster.com/dictionary/blackfishing) [Vultures](https://www.urbandictionary.com/define.php?term=culture+vulture) never loses.",
            "I'm obsessed with this shit now. It was one of my least favorites on first listen and now it's on repeat.",
            "I hate the fact that whenever I visit this sub it's always this post pinned.\n\nYE DROP THE ALBUM OR SOMETHING BRO",
            "3 days pinned and 36 comments. No one gives a shit about this sad excuse of a music video.",
            "If you wanna hear what this song would be like as a smooth jam instead check this out https://youtu.be/rFdMAmW2beo",
            "kanye sounds like shit in this one. He must be wearing his titanium **teef.**",
            "how do you make it so you can watch the youtube viceo directly from reddit and not click the link? someone help pleazs ",
            "check out da yt yfm hy hy fs fs hy yfm \n\n[https://youtu.be/sFWLPEllcNE?si=v8HCu340wTqeV9DC](https://youtu.be/sFWLPEllcNE?si=v8HCu340wTqeV9DC)",
            "Does everybody know Carti's new album I AM MUSIC will have a YE-featured track?",
            "whatever you say about ye dude has his finger on the pulse, never looked at one of his vids and thought \"i've seen this before\" & if i look up the people who made the vid it's always some tastemaker",
            "AI",
            "Yeah I guess it's cool that the fixed it... After selling physical and digital copies.",
            "I wonder if he will update it on streaming platforms like he did with Donda Deluxe",
            "Yeah but the synths on Cartis part are weirdly silent mixed now",
            "thats crazy to hear, what i noticed is that the song is just mono now... the whole song sound flat now. play this next to the track on spotify and you will hear how tame this version sounds. the only thing good is that the vocals are louder because its mono.",
            "Whats different?",
            "He mixed Razor da Blazer too",
            "at the end it doe sound like someone is talking lmao",
            "what's the original clip?",
            "It looks atrocious.",
            "It‘s because it’s AI generated 😂 Still good though. It’s the future. Kanye living in the future",
            "just because of that fan we'll be able to even think about getting shows in Mexico thanks to him, real gang",
            "Which is really in tune with the effort he put into the album.",
            "dy know which songs on donda he changed?",
            "I’d be a lot cooler if he got it right the first time.",
            "Doubt its intentionally in mono but surprised nobody else is hearing this... maybe the mix is cleaner but its in mono which makes it significantly worse.",
            "also heard like a ping pong ball loll",
            "If he does, you can bet your ass there will be a TikTok saying \"gracias a este wey Kanye vino a México, entérate porque\"",
            "Most notably Come to Life with Tyler vocals, New Again has the choir and a moment with a noticeable autotune from Kanye, Jesus Lord also has a very subtle change that is almost unnoticeable u think when the voice says \"Jesuuus Looord\". Those are the changes I've noticed.\n\nEdit: Also, Kanye sings the intro of Keep my Spirit Alive now because it's more personal that way, and in pt 2, it's KayCyy like in the original",
            "Carti's verse was recorded on the 15th of December in the middle of the YesJulz livestream where they were having a party. I'm pretty sure it's the same place where ye rerecorded his aswell.",
            "thanks",
            "Really didn’t like that Jesus Lord change, I gotta make sure to preserve these day 1 releases just in case. New Again was also better with Chris brown",
            "Kanyes methods are perplexing."
        ]
    },
    "Waited all year for two left YZY Pods. ": {
        "title": "Waited all year for two left YZY Pods. ",
        "score": 491,
        "url": "https://www.reddit.com/gallery/1dlmctj",
        "content": "",
        "num_comments": 66,
        "comments": [
            "Everytime a girl posts on this sub their house look expensive",
            "You’ll be in my prayers",
            "Same picture but with the pods off?",
            "this entire subreddit should be shot",
            "Even the dog is confused here “👀🐩🤔”",
            "👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃👃",
            "Tell Ye. He's very easy to talk to.😐",
            "Bianca ahh fit 😭",
            "Looks like they have excess left pods",
            "Are your pods at least comfy?",
            "Take them goofy shoes off 😈😈",
            "You look like some 80s x-men in that shirt lol",
            "First time I've ever actually seen someone look good in them. So there's that at least.",
            "You’re gorgeous. And I love your house 🥹",
            "Are those doors massive or are you just really short? Or both?",
            "The customer service is terrible! My package was returned to their warehouse, and they haven't responded to my email about a refund (it's been months). I'm glad some people are getting their orders, but I was scammed.",
            "Walk on me.",
            "Did many people actually get the pods? I cancelled mine after 3 months of radio silence.",
            "Gotta wait another for the right one",
            "high ass doors",
            "what the dawg doing",
            "I bought the t shirts and trousers and shoes, and all I got were the shoes.... Went to my old address in a different city",
            "Ay what size did u get?",
            "[ Removed by Reddit ]",
            "You washed",
            "Bruh... ye help ya girl out",
            "you mean you bought 2 pairs and put 2 left feet together to pretend this happened for internet numbers",
            "[ Removed by Reddit ]",
            "Hey, at least you didn’t get sexually assaulted. \n\nConsider yourself lucky.",
            "Yeezy re-upholstered my settee.",
            "Not the monogrammed bench thing in the middle right of frame that I am too poor to describe",
            "Wood floors in a new apartment",
            "The only thing that I pray is that me feet don't fail me now. 🦶🪽",
            " I sent this bitch a picture of my dick 📸🍑",
            "You’re better than this bro",
            "📦👟⬅️🦶👟⬅️🦶😂🚫🧢",
            "Organizational skills are legendary…",
            "Yes love them. Not sure how well they’ll hold up outside but emailed asking for a right shoe.",
            "[https://yeezy.com/products/one-box-t](https://yeezy.com/products/one-box-t)",
            "Coming from a girl *",
            "5’6”. 19 foot ceilings.",
            "Call your credit card/bank and tell them to issue a refund.",
            "I have a two year old and am 14 weeks pregnant with another so I’m well passed washed.",
            "Found ye",
            "do you think you are changing something? does making comments like this make you feel morally superior?",
            "Where’s the sweet and sour sauce",
            "And i ont think there s nothing i could do now to right my wrongs",
            "Damn! You rich af",
            "I don't know what it is with females",
            "Can I see?",
            "That’s Professor X right there.",
            "Glad you clarified I was absolutely scared",
            "hnngg",
            "I don’t think I want to get this.",
            "i wanna talk to god but i’m afraid cuz we ain’t spoke in so long 💯💯🗣️🔥",
            "At least you know that's what I'm good at",
            "Yes! Google “free robux no virus” and click the first link you see in order to get the photos!",
            "Age check ",
            "Don’t listen to “I’m in it” on Yeezus",
            "Just tell your boss you need an extra hour off",
            "That's right I'm innnn it!",
            "SO LONGG",
            "but I'm not too good at that shit?\n\nedit: yea double checked",
            "so long…….\n\n(beat revives)\n\nto the hustlers, killers, murderers, drug dealers, even the scrippers…",
            "JESUS WALKS FOR THEM 🗣️🔥🔥‼️‼️⁉️⁉️💯💯"
        ]
    },
    "Yeezus is the best album ever created.": {
        "title": "Yeezus is the best album ever created.",
        "score": 68,
        "url": "https://www.reddit.com/r/Kanye/comments/1dlon3i/yeezus_is_the_best_album_ever_created/",
        "content": "Y’all are just too closed minded to realize and accept it. And I don’t wanna hear your “tpab”s or your “kid a”s. Those are boring. TPAB makes me want to learn how to play solitaire, Yeezus makes me want to shoot my little sister in the leg. Its energy is just so raw and unmatched. If you don’t like Yeezus, grow up.",
        "num_comments": 46,
        "comments": [
            "i love yeezus",
            "i think you just gotta listen to more music. all 3 albums you mentioned are good no need to put either down, that's dumb. you seem like the closed minded one.",
            "I was just listening to Yeezus again the other day for the first time in a minute and it could have dropped yesterday and still been straight fucking heat. IM IN IT AND I CANT GET OUT",
            "Yeesh talk about rage bait",
            "Yeezus can be a great album whilst other albums are also great my guy.",
            "Least obvious rage bait",
            "you are the most whitest person on earth sir please have your white people award and your lifetime supply of coleslaw and boiled hotdogs, we also got you a 600$ wholefoods gift card so you can pick yourself up a crate of la croix for the road.",
            "Yeah I just finished listening to Yeezus for the 4th time in a row and went straight out the door and murdered my landlord for knocking on my door constantly for, and I quote \"not paying rent\".. pff killed him ON SIGHT",
            "Amen.",
            "Fax",
            "Respectfully no.\n\n\nCurrents is ehehehehehehehe 😎",
            "What is kid as",
            "Bro chill",
            "I really love Yeezus and it's energy is crazy, but there are times when I don't want the shooting my little sister in the leg energy. Also if you sit long enough on it and listen to some other music too, you'll realize that there are many albums that are just better",
            "Feel like I have to do the opposite of growing up in order to enjoy Yeezus. I gotta set my brain back. \n\nAnd as a Kendrick fan sure TPAB has great meaning behind it but damn man imagine if you had Ye mixing it up on those soulful beats and maybe relaxed the anger a bit but that’s the point of it. \n\nAs I get older I’m getting more phased out of things that bring negative energy such as horror movies. Comedy is a million times better with its effects on your brain than horror.",
            "#Obviously",
            "It’s my favourite album of all time but not the best",
            "boo this man\n\nbooooooooo",
            "Easily in the top 50 albums ever made",
            "You’ll get downvoted by the college glazers, but you’re 100% correct",
            "How delusional you gotta be",
            "Whatever you think bud",
            "I think it’s a top 3 album of all time and it’s not hyperbole or fandom",
            "Yeezus is a great album, my fav Kanye album. But your post doesn't make any sense. TPAB is great, only guys with low attention span find TPAB boring tbh. Look many great albums can co-exist, you don't have to put them down",
            "Wait till dude discovers metal",
            "Boring? No. These albums are called the best for a reason. Yes, yeezus is top 10 but it is no where near the best ever created.",
            "It grew off of me lmao. It was top 6 ye now it’s bottom 3.",
            "You need to listen in English class and learn how to make a convincing argument.",
            "Yeezus kinda overrated imo it can be a bit plain at parts",
            "Not even Kamyes best album",
            "You just don’t have an enough IQ to understand tpab. Yeezus is great, but it’s not better than mbdtf. It’s not the greatest.",
            "Shut up. You haven’t opened yourself up enough to yeezus. It changed my life. What are you talking about.",
            "Not rage bait just fax",
            "You see the video of the dude who said it’s not a glizzy anymore it’s a hot burger and cut it half and put it between a bun 🤣",
            "ON SIGHT",
            "Tame Imp- Tame Impala\n\nTame Imp-, still outside\n\nAnd I'm still outside, still outside",
            "The Radiohead album \"Kid A\" but plural",
            "You need to listen to more music",
            "Yea yeezus changed my life too brah. Still…. Chill. Albums been out for 11 years, ur not the first to realize how great it is",
            "On sight",
            "you really should listen to music. this is getting sad. if yeezus is the only album that makes you feel this way then damn...",
            "Average yeezus enjoyer",
            "Alright man",
            "This is a bait post"
        ]
    },
    "Do you guys think Kanye fw Doki Doki Literature Club": {
        "title": "Do you guys think Kanye fw Doki Doki Literature Club",
        "score": 89,
        "url": "https://www.reddit.com/gallery/1dlk1vc",
        "content": "Im thinking yes",
        "num_comments": 29,
        "comments": [
            "If he played it he probably didn't even finish the game and just jerked off to r34 of the characters",
            "If you edit his lyrics enough in \"Champion\" he clearly says be likes DDLC so I think it's safe to say he likes it !",
            "No he only likes Mario",
            "Wait are those photos real???",
            "What is that",
            "Obviously yes",
            "I don’t see why not",
            "Probably thinks its a hentai",
            "Too much reading",
            "Ion think he fw games",
            "When he was at E3 years ago he was proudly rocking a pass with Risette from P4G.\n\nOnly reason I have to think the he doesn't fw DDLC is that I genuinely think he'd bond with Monika.",
            "Nah",
            "Get this Weeabo garbage outta here.",
            "True",
            "Yes",
            "Get it it’s free on steam",
            "Kanye loves anime",
            "doki doki literature club is more than that",
            "I just googled it it looks cool but I don’t have a pc is it on ps5?",
            "Preach",
            "It’s a warm-hearted game just like omori.",
            "Yep but it’s 15$ \nWorth it tho",
            "They don’t understand like we do 😔",
            "The hanging made me shit myself😂",
            "devious ahh\n\ntry oyasumi punpun too bro one of the most lighthearted romance mangas",
            "They never will",
            "spoiling ahh bum",
            "If they cant get how great it is, then that's on them.",
            "Try omori it’s worse than ddlc with its trauma"
        ]
    },
    "So this was just a bit right guys… right?": {
        "title": "So this was just a bit right guys… right?",
        "score": 157,
        "url": "https://www.reddit.com/gallery/1dldk9o",
        "content": "",
        "num_comments": 18,
        "comments": [
            "ye likes it up the ass confirmed?????",
            "i could take the antisemitism but this is too much",
            "𝒻𝓇ℯ𝒶𝓀ye west",
            "That underwear ready to drop it whenever he want it on tha spot 🫣",
            "He always been a freak bro. Does no one remember the “ did she put her fingers in your booty?” Meme",
            "WTF",
            "Exhibitionism is killing the world",
            "i put the hooks in my butthole oh yeees it feels so goood",
            "They not ok",
            "Kanye isnxhangi g his name to.Mr Peg",
            "like a ventriloquist",
            "been confirmed. remember amber rose said “fingersinthebootyassbitch” at kanye like 8 years ago",
            "my goat is an antisemitic butt boy 😭😭😭",
            "ong bro keep that shit behind closed doors",
            "Ye peg",
            "Didn’t she come out some time ago and said she made that up because she was mad at him.",
            "She probably made that up because she wasn’t mad at him anymore"
        ]
    }
}