{
    "Any tips for professional cook level 1 exam in bc?": {
        "title": "Any tips for professional cook level 1 exam in bc?",
        "score": 20,
        "url": "https://www.reddit.com/r/KitchenConfidential/comments/1dawq01/any_tips_for_professional_cook_level_1_exam_in_bc/",
        "content": "Hello Hello,\n\nJust looking for some help or tips from fellow industry people about professional cook level 1 exam. I've been working in the kitchen for 3 years now at the same place. You know how everything becomes less challenging when you work in the same kitchen 5 days a week for 10-12 hours!\n\nI haven't done culinary school, just dived right in. and its been good so far, learnt a lot of things.\n\nI am planning on challenging professional cook level 1 exam next month. But have absolutely zero clue where to start studying!!!!!!\n\nAs I mentioned, I have no schooling in cooking but am a good learner and learnt to work on all stations and prep in my restaurant within a year and a half!\n\nAny help would be much much appreciated. Any books, websites, anything is appreciated.\n\nAlso, just out of curiosity, how does the whole thing works? I know there's a written exam and a practical. But things like what kind of questions are there in written exam, how many questions, etc. any help pls!!",
        "num_comments": 6,
        "comments": [
            "I pinned the post cause i know how these exams can be and its best to try and get answers from someone who's been through it. You might wanna include your country or state if your in the U.S. so people can help you best. \n\nIn my experience exams like these are usually vocab test. Theyll ask you to explain or demonstrate what this term means and you'll do it.  Next there gonna test you on base skills of cooking. Can you flip, can you cook something without burning, knife skills ect.  They will also ask you history question on the industry. Make sure you know your key players. \n\nTry and see if you have a rubric on what youll be graded on. Thats the best way to prepare. \n\n  \nGOOD LUCK!!!",
            "Hey i just passed the level 1 exam with a 94/100. I think i spent about 15 minutes on it, but I've always been a very fast test taker. Most of the questions are honestly common sense for anybody who has a good amount of professional AND/OR amateur cooking experience. If you are confident in whipping something up from scratch, then I think you will pass without studying.\n\nThat said, I did study a bit and what i studied were mother sauces and their deriatives and stocks. These were not intuitive to me as i have been vegan for almost half my life. I have a ton of sample questions/answers that are almost verbatim to the test. If you would like me to send you anything, lmk.\n\nAlso this is just general advice for multi choice tests, but I will say it in case you don't know: NEVER dwell on a question you don't know. Skip it and come back to it later. Sometimes other questions will even have answers for previous questions!\n\nEDIT: just reread your post and noted you did not go to culinary school at all, this test is VERY by the book. It's also gonna focus on french cooking. As well as terms that may or may not matter in most restaurants. Do you know what a capon is for example.",
            "I suspect from the title that OP is in British Columbia Canada :). And that the exam they are asking about is this one: https://skilledtradesbc.ca/professional-cook-1\n\nAnd also, for the OP: https://skilledtradesbc.ca/sites/default/files/2023-01/professional-cook-1-program-outline-july-2020.pdf\n\nThe assessment criteria is on page 96 or 98, depending on your browser/phone :)."
        ]
    },
    "We lost a good one yesterday. ": {
        "title": "We lost a good one yesterday. ",
        "score": 6991,
        "url": "https://i.redd.it/r432xhfyrx7d1.png",
        "content": "Yesterday this young chef was taken from the world. She was an amazing passionate chef with a love for this world that couldn't be matched. A student up in Chicago training at multiple Michelin star kitchens and coming to work with me in a brand new restaurant. Chloe was 21 and had the potential to do great things in this industry and world. I just want to make sure she gets known for how amazing she truly was. Rest easy chef. ",
        "num_comments": 224,
        "comments": [
            "Chicago chef here. I'm sorry to hear about this. \n\nI do regular popups and farmers markets for charity and donate 10% to a charity of my choosing or someone else's choosing. \n\nWhat would Chloe want me to donate to?",
            "I'd like to add this to this post. I have seen people talking about drugs and stuff And it wasn't that which took Chloe away from this world  I should have made that clear I apologize for that.",
            "Sorry about your friend",
            "Damn, we also lost one yesterday. My condolences 🙏",
            "Chloe was taken from this world too soon. She had so much more to show the world and a hell of a lot of potential in the culinary world. \n\nI'm glad I got to see her a couple weeks ago and give her and Brennan a hug before they left my restaurant. \n\nShe will be missed by all.",
            "21 is so young and the fact that she was taken in a completely random accident is heartbreaking. God, irs so cliche to say but you really dont know how long you or the people you love have on this earth. I hope nothing but peace and healing for the people who loved her",
            "thats far too young.  sorry for your  loss.",
            "RIP Chloe you were a wonderful person and I still can't believe you're gone.",
            "I'm sorry for your loss.\n\n\nWhen I close up tonight I'll give her a clack clack of my tongs in salute.",
            "Rest in peace, girl. Cook for the angels.",
            "I no longer work in the kitchens, but I do work in funeral service. If there’s somewhere to donate to her memory or help out with her family’s expenses, please drop a link and let us know if we can help. \n\nI don’t get to experience the magic of healing people through food much anymore, but instead I work with families on their worst days. The hardest cases are ones like these, beautiful young souls that had their whole lives ahead of them, that left the world too soon. Chloe’s memory gets to live on through her friends, family, and the meals you’ll cook when you remember her. I hope you all can have a family dinner and make something she loved to make, and share the beautiful memories that you had with her while she was on the line with you. \n\n\nShe’s up there throwing down in the kitchen, and next time I smoke on a milk crate behind the funeral home and feel like I’m in the kitchen again, I’ll light one for Chloe. 🫡",
            "Sending all the pots and pans of love to u guys ♥️♥️♥️♥️♥️",
            "RIP Chef Chloe, may your knives always be sharp where you are. I’ll make sure my mirepoix is perfectly cut to exact matching size for tomorrow’s cook.",
            "21? That’s so sad. I’m sorry for your loss chef.",
            "So sorry to hear this, buddy. The next time there’s a gremlin in the ticket printer, you’ll know who it is sending love.",
            "🫗",
            "TOO young. All that passion and potential and love. So sad man.",
            "I commented on another post, but I didn't know this was in Chicago. When I go to brunch in the city tomorrow I'm gonna tip extra, just for Chloe. I know it's not much but I want to show the love to the chef and staff that she might have wanted.",
            "Sorry for your loss",
            "Be safe out there folks, get checkups if you can, don't touch them pills or powders. Seeing a lot of loss on here lately. RIP",
            "Rest well, chef.",
            "I read about her last night and thought about her today at work. I don't know her but my heart feels for everyone. Very tragic and sudden losses are the worst. Too young to go. Rest In Peace Chloe.",
            "I am so deeply sorry for this terrible loss. Is there a gofundme page for her at all?❤️",
            "💔",
            "All the love to you guys. ❤️",
            "Damn, seeing this post and the other one makes me sad. young chef both makes it sound like they were and had good people around them. Only a year older than I am. Rest in peace.",
            "Godspeed Chef. RIP, very sad.",
            "Wishing you and you all the very best. From both this and the other post, she sounded truly special - a deeply felt loss for all involved =[\n\nShe will live on through stories, so please never forget to tell people about Chloe",
            "Sorry for your loss chef. It sounds like she was a great person.",
            "It's so unfair that she was the passenger and passed while the driver of the CTS is fine. RIP",
            "So sad. I think about my close coworkers passing and can barely stand the thought without feeling emotional. I can't imagine what you guys must feel right now. rip",
            "I'm sorry for your loss OP. Thankyou for posting this showing how much you cared and letting her memory live on through the minds of all of those who read this, I always say the brightest candles burn the shortest sometimes and it seems she has touched a lot of hearts in such a tragically short life, strong stop and don't be afraid to reach out to those you love and love you for support don't grieve alone. May she rest in peace and rise in glory.",
            "I’m very sorry for your loss. May Chloe live on through your heartfelt expression of caring and love. My condolences",
            "Rest in Peace Chloe.",
            "She just looks like someone I would like to be friends with.",
            "this chole ???https://www.reddit.com/r/KitchenConfidential/comments/1dkpiwr/we_lost_a_good_one_today/",
            "Just had a sip for your friend. Too many times in my thirty years in this business have I said goodbye too early. Big love from NY",
            "Tragic to lose someone so young.  Very sorry for your loss.",
            "Sorry for the loss to you personally and your team.",
            "Raising a glass in Ohio to Chloe and her work!",
            "pouring one out for chef chloe tonight",
            "Breaks my heart, so tragic. Also had a moment of panic and weird confusion because I live in a town named Sandpoint and seeing her jacket I momentarily thought she was someone I know. I’m going to have to get my friend something nice.",
            "21 is so young to return to glory.  I'm so sorry for your loss.  She must have been wonderful in culinary terms.  All the love to you and the family.",
            "♥️♥️♥️♥️♥️♥️♥️♥️♥️",
            "Life isn’t fair. I just don’t get it.",
            "Sorry for your loss",
            "GNU Chelsea",
            "Rest in peace beautiful angel ❤️",
            "So sorry for your loss. Rest easy Chef.",
            "Breaks my heart. Rip young lady",
            "Condolences. Life of a cook isn’t easy. I wish you the best",
            "🙏👩‍🍳✨✨✨✨✨🌟🖤",
            "Such a tragedy, I’m glad you shared Chloe with us, so we can know who she was",
            "Damn.  Sorry, friend.  Rest easy, Chloe.",
            "Condolences, my friend",
            "You can do everything right and still lose. Dying so young to something completely out of their control just sucks. I'm sorry for your loss.",
            "💛",
            "She sounds like a really special person and a passionate and promising talent, so sorry for your (and your community’s) loss 💔",
            "RIP ✊🏼",
            "Gods Damnit.",
            "I am sorry she has passed. Thank you for telling us that Chloe lived and that she made a difference in this world.",
            "So sad to hear this … I’ve lost 6 fellow line cooks over the years, and I’m not even 40 …. Damn … RIP homie",
            "sorry for ur loss so young",
            "Sorry for your loss chef! Passion and true talent and integrity are hard to come by in a chef! I'm truly sorry you lost a friend and a chef! Skull cap over our hearts! 🙏🏼",
            "I saw the post another coworker posted about Chloe this morning. I've had her in the back of my mind all day. She was obviously loved by many, my heart aches for all who loved her. Rest easy Chloe 💔",
            "I have no words good enough to honor this special soul. My condolences to you and those who knew her. I'll keep her in my mind when I see someone in need, and do what I can to make sure they're fed. The world will be a little less bright without you, Chloe. ❤️",
            "Ffs….\n\nWhat happened to this sweet young lady???",
            "RIP Chef",
            "rest in peace chloe ❤️ she looks like the sweetest kindest soul 💌",
            "R.I.P.",
            "Sous at 21 what a boss RIP",
            "Man I was just checking Reddit while taking a shit and now im crying in the bathroom. \n\nBut in all seriousness, sorry for your loss and thanks for sharing. \n\nIn a weird way, this helps remind us all how lucky we are to be here and to cherish everyone we have while we can",
            "Click click",
            "RIP 86’d heard",
            "Man we don’t even know how much we’ve lost in talent and life from this shit. Im 31 and I can count 23 of my fucking friends died from this fucking shit all of them more talented than my hack ass. \n\nSafe travels chef.",
            "F",
            "Rest in peace chef",
            "Rest in paradise queen .",
            "So sorry to hear this.  I send my condolences.  Bummed to hear this news.",
            "Im bummed for you, shit is all it is...",
            "She sounds like a legend of a person. We’ll always remember you, Chloe.",
            "Oui Chef Chloe 🫡",
            "Food truck owner/operator here. Wife is the chef. Our condolences from California.",
            "Sorry for your loss chef 🙏🏻",
            "Thank you Chloe for giving the world what you could. Rest in Power friend. P",
            "I’ll cook for Chloe today.",
            "Would be useful to state the cause if you’re bothered by people asking if it was drugs. Especially in a industry like this. RIP",
            "She looks amazing, sorry for your loss",
            "RIP young chef, take it easy up there.",
            "I do not care what motivations one has, BS about confidentiality, privacy, the absolute bare minimum is to provide information on how that person died, the bare minimum infos (say cardiac arrest and the reason, drunk driver and frontal crash, whatever it is), that's a duty to prevent other potential deaths.",
            "Oh benevolent God of the hearth. Except your patron into yours kitchen may great food we tasted and may good service be not wasted. Let your patrons passion spread to each of our souls hail holy hot sauce. Amen",
            "Keep posting and simping over the loss. We will take another picture of an irrelevant figure",
            "Oh man that's a tough one. Anything that has to do with people getting the chance to learn in culinary. Making sure they all learn the skills to be in kitchens. She also helped a lot with making sure the homeless were taken care of. Anything like that would be great. She'd love. Thank you so much for doing that.",
            "Do you take stages or interns?",
            "Was this the same Chloe?  https://www.reddit.com/r/KitchenConfidential/s/BEtkr8WSYG\n\nSounds like a wonderful person.",
            "Casual observer here. I note you point this out, as I note folks are quick to think the worst. Not in a bad way though, just that drug abuse, heck, mental abuse is far too common in the industry. \n\nI'd think no less of this young lady if such did occur. Food service should not be as stressful as it's become.\n\nRIP Chloe.",
            "Gotta admit, something related to drug or alcohol use was my first thought, given her age and the industry.  The fact that I felt relieved to learn that she was a passenger in a horrific car accident... made me question some things about myself and my beliefs.  \n\nTragedy is tragedy, whether our lives drove us to seek it for whatever reason, or whether it finds us accidentally.",
            "I wasn't implying your friend passed due to drug use I was just making a general PSA regarding death in the industry and cut my examples off at the top three most common ways I've seen colleagues and cohorts pass from.",
            "She was murdered?",
            "Thank you I appreciate it.",
            "My condolences to you and all their loved ones as well.",
            "I'll be reaching out to the family at some point to see if they are going to set up a gofubdme or not. I'll make sure to post a link if they do. \n\nShe was a very special person and the amount of love she has is unbelievable even from strangers on here. You do great work in making sure families are comfortable.",
            "Blanch the fries  😉",
            "Pan-Seared duck breast with a cherry gas, streak, vegetable, risotto and Chard asparagus",
            "This was in Nebraska where this happened, but she did her training and studied there, but she loved that city so much.",
            "She wasn't taken by pills or powders or any of that, but yes that's a good point.",
            "Guys this woman died in a car accident.",
            "Maybe if working in restaurants wasn’t so stressful and toxic, workers wouldn’t turn so quickly to substance abuse.",
            "Not yet, but I'm definitely thinking about setting one up once I get word from her family.",
            "It's tough. I remember coming in I was told NEVER make your coworkers your friend because they'll leave and someone else will fill that spot. \n\nI'm so glad I never listened to that because I've made some amazing friends in this career. Chloe wasnt just my sous she was my best friend. I loved her so much and would have done anything for her.",
            "100% she loved everyone and was so easy to get along with.",
            "Yes that is Chloe as well. She started working for a catering company before her passing. That is one of her coworkers there.",
            "♥️ thank you for keeping her on your mind. She was truly such an amazing person. Seeing all this love for her would truly make her so happy. Would make her cry because it would overwhelm her to see all this.",
            "♥️",
            "She was driving to work and got hit by a guy who ran a red light at top speed and she unfortunately passed away at the hospital.",
            "click click",
            "Fuck that. No it isn't. You don't have the right to know about someone else. This person mattered enough that OP cared and others cared. That's all you need or deserve to know. \n\nNone of us are owed the details of anyone else's grief. Those that share can help, yes, but it is not owed. Get out of here with this shit.",
            "> the absolute bare minimum is to provide information on how that person died\n\nno it isn't",
            "Hey dip shit. This was my friend, and I'll tell you how she died if you wanna know. DM ME.\n\nThere is no absolute minimum on information YOU need about this. This is r/kitchenconfidential\n\nWe are grieving.",
            "Tread lightly. The internet allows you to place yourself into situations and say things you would otherwise get slapped in the mouth for. You wouldn't pester a grieving person for details in person, so remember decorum and have some decency.",
            "Imagine not only thinking this but also following through, writing it, and posting it.",
            "Sorry you feel this way and for the message you decided to try to insult me and her. I feel sorry for you and that you are the way that you are especially on a throw away account. You got the attention you needed and I feel truly truly bad for you. I hope you get the help you need to be a better person.",
            "I've got 443 bucks going to Daisy's Foundation Culinary Initiative for Chicago Teens and Students. Footnote, for Chloe. Hopefully, that takes care of the boat man. \n\nBe safe, chef.",
            "I’m doing a farmers market next week around where some vagrants live around. I’ll feed some for Chloe.",
            "I’ve got $100 for NoKidHungry.",
            "If you're in chicago, I can point you in the right direction. We pay our stages. I gave up the old school stuff a while ago. If you dm me your resume I can do something.",
            "Yep that was Chloe. The person who posted that has the perfect words to describe her. She was such a sweet innocent soul. That was taken way too early.",
            "man a pal of mine got tboned a couple weeks ago in Chicago, he JUST left the hospital with some raging broken bones.  And he was in a big modern vehicle.  I was back home a few months ago and I saw some otherwordly bad driving.",
            "Man that's fucking sad",
            "I didn't think twice about how she died. A fellow chef has left the line. I've seen it before and I will certainly see it again. This life is rather rough.",
            "Yeah, I'm sorry about that I know I should have been more clear about it all. It's been a rough couple days and I just wanted to celebrate her, but I understand.",
            "No I understand no worries I just want to get ahead and make sure it was known is all.",
            "Guy blew through a red light and crashed into the side of the car she was on. The damage done on the car really shows how fast the guy had to be moving.",
            "I’m so sorry for your loss.  Chloe sounds like a wonderful soul. Sending you and the rest of your crew tons of love.",
            "Duck is the #1 protein.",
            "Thank you for the clarification, and I'm so sorry for the loss. Regardless, I'm a high tipper anyway but I will tip extra in her honor. The world is better with chefs like her in it, and Chicago will miss her too.",
            "The reason I cared so much about this is because you said Chicago. We are a tight knit group of chefs in chicago. We take care of our own. We help eachother when shit gets tight. I get a call from my friend at 10pm on a Monday night telling me he needs hands. Fine. Fuck it. I'm working for beer and fun. We take care of our own, and if Chloe left a spark in chicago, then we accept her as ours. Chicago claims Chloe.",
            "Never implied she did just trying to cover all the usual bases. The first thing I mentioned was to be safe and if you can get health checkups.",
            "OP being so evasive is the only reason why people assume drugs. Very strange to think this was going to be the one and only time people weren't going to be curious how someone died.",
            "Some of them are too dirty now. If you're gonna use hard shit get some fentanyl tests off Amazon and test a pinch. They're cheap and you're worth it.",
            "We didn't lose her to substance abuse, but yeah, there should be more free therapy and psychological help for all of the stressful jobs out there.",
            "Most definitely. Would love to donate or contribute somehow. Sending good vibes & prayers to you/your team & her family💕",
            "Through and through, fuck that advice. you see the same faces every day, youre bound to find good friends through that. I have people I work with that I consider brothers and sisters, and them leaving our job wouldnt change that.\n\nShe sounded like such a beautiful person. The world deserves a million more Chloes.",
            "…and now I’m crying. I’m so sorry.",
            "Shiiiiiiet…..\nWhy does bad shit always happen to good people?\nUgh..",
            "You have no idea what that means truly. I don't know who you are, but if there is anyway I can say thank you or anything please please let me know.",
            "Fellow Chicago Chef here. I’ll match it.",
            "Your kindness and good soul just made me cry. What a beautiful gesture.",
            "Didn't feel like upvoting this post quite conveyed how awesome I thought this was, so I upvoted every post I could get to from your account. Karma is a useless, pointless representation, but I couldn't upvote just once.",
            "this is such a sweet gesture, as someone in culinary i genuinely thank you",
            "Such an amazing human. My faith in humanity has never slipped nor felt the need to be restored because of people like you, you keep it alive.",
            "Make that two donations to Daisie Foundation (daisiefoundation.org). Let’s send her in style. \n\nBless you for starting this and u/wicked_smiler402 for sharing her story.",
            "He's a good man, Savannah",
            "Oh chef..",
            "You're awesome.",
            "You‘re awesome!",
            "This made me cry, and it’s only 7 in the morning",
            "She would love that. Thank you so so much anything to keep her memory going. She loved Chicago.",
            "What farmers market? Maybe we could collab?",
            "That'd be amazing ♥️♥️",
            "I’m so, so sorry OP. She sounded like a wonderful person. :(",
            "No no, my point was even if it'd been drugs or alcohol, she still should be celebrated for what she brought to the world while she was in it.\n\nI assumed personal demons, and it's on me that I assumed that.  I shouldn't have assumed that, but even if it HAD been that, the loss carries the same weight, and I'm ashamed of my own brain thinking \"well at least it wasn't the demons.\"\n\nI'm very sorry for the loss of your friend.  I hope you're doing as well as you can be, and that you have the support you need.",
            "100%",
            "Yes you implied it. What a twisted thing to say.",
            "I'm a paramedic, only in this sub because I love cooking at home and there's tons of good advice from y'all in here (and cool stories and cool people).\n\nOverdoses usually come in waves, supply is generally limited to a handful of dealers at any time. If you see one or two go down, be prepared and aware. I always tell anyone I help on an OD that they need to make their friends aware and check in on them too.",
            "There was a scary ass story a few years back where basically the entire staff ODed because they all shared bad coke during a shift. I can’t imagine how terrifying that was.  \n\nGlad I got sober at the right time.",
            "Preach it. \nI'm all for cutting loose and having a good time but the drugs aren't \"safe\" anymore.",
            "I'm donating to Daisy's Foundation in chicago for her. It's a really good organization that help young kids learn culinary skills and let's them explore other opportunities to.",
            "The world definitely does.",
            "It's what I've been asking myself these last couple days now.",
            "No thanks needed. Take care of your team. Blanch your fries. And if you have a chance to do something good. Take it.",
            "If i had more in my budget, I would have given more. But I'm just now learning about this amazing charity foundation and plan to do more with them in the future!",
            "I don't need updoots to hang with yall. But thanks lol.",
            "♥️♥️ thank you so much. I'm collecting all these to make sure her family sees all this.",
            "Hell yeah! Letsss gooooooooo you rock!",
            "Did she have a favorite dish or cuisine? I'm helping with a catering event in two weeks and the least I could do is try to throw in a splash of her here in KC.",
            "Hudson? It would be much easier for me to collab because I do spice’s normally and my plan is to roll out a portable black stone and cook some burgers for them on the side. I just don’t see many vagrants outside these markets.\n\nEdit: \n\nAren’t you in Chicago? I’m in a totally different state.",
            "Already done. Not sure how to post pic in comment",
            "I hope I didn't come off as an asshole there. I've been told I talk too much like a chef even over text and it makes people think I'm mad or something. I appreciate your concern. I truly do. Thank you truly. I've been really lost these last 48 hours.",
            "Not trying to tell you how to feel, but it's quite uncommon to not mention the cause of death unless it's suicide or drug overdose, so I don't think you should feel bad for making the same assumption that many people would make in this context (I did too). You're clearly a good human being.",
            "Usually, when this happens to a chef, it suicide. I walked into a 2 time Michelin star chef hanging from a ceiling. Never forgot it. He was so happy about opening his new brewery the night before. It's justifiable to think this. You've done no wrong.",
            "The first thing I said was be safe out there. Stop trying to stir up drama.",
            "They were giving generic advice. Reading comprehension is a thing, but I guess if 10th grade was a struggle you probably don't have it.",
            "I got certified to use Narcan and usually carry a dose in my bag when I'm at work, along with a pack of CBD gummies in case a coworker greens out on shift. They all know I've got it, just like everybody knows the bartender has her concealed carry pistol. Plan A is always 'nothing goes wrong'; we are Plan. B. Plan C is call the cops because whatever went wrong is way above our pay grade.",
            "Absolute fucking tragedy. \nRemember her always",
            "I’m not a chef.  I’ve never worked in kitchens.  I did one very brief stint in retail food. I have no idea why Reddit recommended me this sub.  All that said… I think this is my new life motto.  Thank you, Chef.",
            "I’m weeping over this short but, incredibly deep and touching exchange. Your advice is well taken. Thank you, chef.",
            "Heard Chef!",
            "We need more chefs like you in the world.",
            "Goddammit Chef! Why didn't you tell me french onion soup was back on the menu?\nI'm bloody weeping here!\n\nSeriously though, you're a good person.\n\nRest easy Chloe. We'll all be joining you some day in the great Michelin in the sky.",
            "You are a true G.",
            "It's the gesture rather than the amount which moved me. I wish you all the best in future. Good deserves good. The world sorely needs people with good souls.",
            "She was very much in love with French food, but she loved growing her pallet and trying new things. \n\nMy favorite dish she ever made was for her stage. \n\nPan seared duck breast, with a vegetable risotto (sauteed fennel, morel mushrooms) with a cherry gastric and charred asparagus. \n\nShe was so nervous to present that dish to me and the owners of the restaurant and it was unbelievable. \n\nI was so proud of her. I couldn't keep the smile off my face especially when the owners were like this is so good it's going in the menu and she puppy eyed. \n\nShe was such a sweet soul.",
            "I'm at Beverly Farmers Market next week.  Hudson is too far, lol. I would say I could source some beef for you, but that's a drive.",
            "Yeah I figured you were in chicago. Then I looked it up. Dm me your venmo and I'll try and put something in it after my next Farmers Market. Most of my proceeds are going to the foundation for Autism Awareness next week but if I have a good weekend I'll see what I have left in my budget.",
            "Thank you so much 🥲",
            "Oh fuck no, man.  I speak fluent kitchen asshole, and you weren't speaking it just then.  Text makes meaning more difficult than it should be sometimes.  I was hoping I hadn't offended *you*!\n\nTake care of you and yours, my friend.",
            "We all had our assumptions. We just didn't care about how or why. A chef has left the line. Nothing more need be said.",
            "https://www.wcnc.com/article/news/local/overdose-reported-carolina-ale-house-charlotte-waverly-nc/275-bcdf9725-1f5b-49a3-82a3-bad4fe409b8a\n\nEveryone should have some.",
            "Being a chef is a tough career choice. It means total devotion to something you love. You miss birthdays, weddings, and funerals. But most of the people in this sub subscribe to an unsaid fraternity of professional chefs who dish out the dirt on what it's like to live our lives. We ask for help. We help others. It's a nice sub, glad your here, chef.",
            "This^ I work in a deli part time, that’s about as adjacent as you can get from a real kitchen, these folks are putting in 200% on a daily and im just coasting frying chicken, I can’t begin to imagine the pressure each day brings but I believe in every one of y’all. Tomorrow can promise a brighter better day, you just gotta be there to see it through❤️",
            "I got a star for her when I get there.",
            "Heard, we'll do our best to honor that dish for both of you.",
            "Looks like I'm making risotto tomorrow and calling my mushroom guy. Damn.",
            "This might be a longshot, but my chef partner and I started a small urban market farm with the hopes of her eventually making food at farmers markets. Long term we want land and a brick and mortar for retail and small plates. We're actually selling eggs and produce in two suburban markets this season already. If you don't mind, if you had any resources you'd recommend for us learning how to make our shit roll, what would they be?",
            "Nah I got it bro. It won’t cost me much and Chloe will get to feed more people haha. Put whatever you were gonna give me into whatever you do in her honor.",
            "I signed up for an online course that sent me a box of six doses for free after I finished the training. I only got qualified a few months ago and haven't needed to use any yet, but supposedly, i can just send them an email if I need more, and they'll just send me another box. I don't have the site address handy but I'll make a note to myself to come back and post it here once I get a chance to pull it up.",
            "Can confirm. I left the industry a few months ago and I could never replace the lessons, love, and comradery a kitchen has. This sub really does embody the best parts of the industry.",
            "Well, we gotta pick each other up when they fall down. Part time or 80 hours a week.",
            "♥️♥️",
            "I'll be honest with you. You need a restaurant to buy in to your company. You will also need licenses if your selling food. You don't need a license for jarred goods. But you will have to have a manager servsafe to sell. Anything cooked on spot will have to have a company, with an inspection. That's why people sell jarred stuff and candles, and fresh vegetables at farmers markets.",
            "Right on. Will do, chef.",
            "That would be great, thank you!"
        ]
    },
    "Chef Mike on his way to work": {
        "title": "Chef Mike on his way to work",
        "score": 1172,
        "url": "https://v.redd.it/rbwjz2qzbz7d1",
        "content": "Chef Mike gives some helpful advice!",
        "num_comments": 38,
        "comments": [
            "Heard.",
            "Imma sample this shit outta this. I'll never make anything of it but it will be dope at jam sessions.",
            "That guy makes the best corn knobs",
            "This dude preaches the real gospel",
            "Just said yes to a new gig, definitely needed this video.",
            "Heard chef! Love the way he closes that door w no hands lol",
            "The hero we need\n\nEdit: chef mic the life coach not any maga piece of shit lol",
            "This gave me enough motivation for 15 years.",
            "Heard, Chef Mike, can I get a all day",
            "I have a few questions",
            "I really appreciate when people tell you just how stupid they are with nothing more than a username.",
            "[https://www.youtube.com/watch?v=CH66Vz7u6HQ](https://www.youtube.com/watch?v=CH66Vz7u6HQ)",
            "Word",
            "Yes chef!",
            "Heard chef!",
            "...thanks chef",
            "OP needed to hear this after Trump lost in 2020",
            "Fuck off, antivaxxer",
            "Single tear rolling down my cheek: \"Thank you Chef Mike.\"",
            "Link it",
            "Imagine giving a shit about a politician of any kind. Lmao. ",
            "Chef Mike is deep with his knowledge!",
            "[removed]",
            "Wow, I love the music video!",
            "OmG TrUmP aND StUfF PleAsE GiVe Me UpDooTs.",
            "Lol you're awesome!",
            "I mean these are the people in control of your government. So like it or not it has an impact on your life and the lives of your family, neighbors, and loved ones so I think it’s worth caring about. But I can respect not everyone feels like that even if I don’t agree that completely ignoring politics is going to help anything or anyone. I don’t feel that either side gives a shit about anyone’s interests but their own currently and I think part of the solution has to be a complete reset of who is in office and get some people in there that will be alive to see the effects of the policy decisions they are making. And preferably don’t have to get their grandson to help them check an email. I also recognize that’s not going to happen any time soon. And it’s not going to happen if people just ignore the issue and don’t vote. So we will be stuck in this late stage capitalist hellscape until the heat death of the universe lol.",
            "[removed]",
            "You have my axe",
            "[removed]",
            "[removed]",
            "LMAO you responded to MY comment! I don’t care where you’re from or what you think of me, my point remains the same. \n\n“Your consomé is cloudy as fuck” = my dad can beat up your dad \n\nClown!",
            "Amen"
        ]
    },
    "Vegan goes to Morton’s.": {
        "title": "Vegan goes to Morton’s.",
        "score": 921,
        "url": "https://www.reddit.com/r/KitchenConfidential/comments/1dlb3s1/vegan_goes_to_mortons/",
        "content": "Our friends invited us to Morton’s Steak House for supper. My wife and I love steaks, so we thought this is going to be great! Get there and our hosts are already seated. After looking over the menu we ask them what they are having. The reply was “we are vegan and don’t like mushrooms, sprouts or carrots”. Wife and I look at each other with the WTF are we doing here look. It was a really rough night as they don’t drink either, I felt really bad for the servers that had to try and accommodate them with what they could muster from the kitchen. To cap off the night they said what they ate wasn’t very tasty or good ! At that stage I kinda went blank, maybe it was the wine, but needless to say it’s the last time we will ever have dinner with them again.",
        "num_comments": 198,
        "comments": [
            "I wouldn't be able to get past them inviting me to a steak house with steak house in it's name.  I'd rather go to a vegan restaurant with them, try new stuff and all of us have a good experience than sit through their struggle, while I guzzle crab cocktail and manhattans, the whole time wondering why I'm even hanging out with people that are this stupid.",
            "Can’t imagine going to a steak house as a vegan then being upset that nothing they like is on the menu. How odd.",
            "Yikes. Vegans who hate mushrooms lol. Vegetarian myself, can’t imagine remaining such without mushrooms",
            "Sounds like their plan all along was an uncomfortable and unenjoyable night. \n\nThat or they are literally stupid. And I say that as someone who was raised vegan ( no longer but that’s besides the point).",
            "What vegan invites their friends to an explicitly *as far from vegan restaurant as possible?* I love taking my non-vegan friends to our fav vegan spots, they always love it!",
            "I'd return the favor and invite them to a Brazilian steak house.",
            "I go to Chinese restaurants and expect them to make me pizza, so I get it. I am that important",
            "The funniest part is that steak houses are super easy to find food as a vegan. Last time I went to Morton’s I had a huge baked potato with sautéed onions and veg ( I was going to skip cuz butter but the server insisted they would use oil) minced garlic, I can’t even remember all the veg sides they brought out (in oil again) salad with balsamic, I was stuffed. \n\nA lot of vegans only look for items listed as vegan options instead of ordering sides and using their brains. It helps of course that half our party were regulars and huge tippers, but I can find something decent to eat everywhere. Managing expectations is key, vegans have to be more excited about visiting with friends than what any restaurant will create for them. Sorry you had such a bummer night at such a great place.",
            ">it’s the last time we will ever have dinner with them again. \n\nWell yeah. Problem solved",
            "\"Why aren't you solving this problem I created and that only affects me?!\"",
            "Like going to an Asian place with a soy allergy. Makes no damn sense",
            "Nice creative writing exercise.",
            "Did you not know your friends were vegan until you asked them what they were having? This is a weird post.",
            "I'm vegetarian (not vegan) and I'm perfectly happy to go to a steak house. They almost always have great appetizers, sides and salads. I've never left one hungry. Bring on the potatoes, fries, creamed spinach, broccoli, asparagus, mushrooms, onion rings, Caesar salads, garlic bread, etc.!",
            "Chef here….Morton’s…the house that MEAT built,and you decide to take your meatless self to a steak house? You want trouble,you want a conflict of some kind because YOU’RE IN A HOUSE OF STEAK!!! I can’t stand people like this….hey I’m lactose intolerant…let’s go to a dairy farm!!!!",
            "I'm moderately anaphylactic to dairy and pineapple and going out to places that are heavy on butter or cheese isn't fun for me and I don't understand people with dietary restrictions who don't look ahead and plan accordingly or speak up \n\nyesterday my friends went to dinner before another thing and that place had a menu loaded with Chihuahua cheese and pineapple so I met them at the thing",
            "So your friends pick a restaurant where they know they will not like anything on the menu.....",
            "I was once at a sushi place with sushi in the name, watched the woman at the table next to ours get mad at her date for inviting her to sushi when she's allergic to fish. He asked why she didn't tell him that when they made the plans instead of just now. They left.",
            "These “friends” sound selfish. Why make such a headache for themselves, you, your wife, the staff, and kitchen? \n\nAlso, imagine being vegan, not liking mushrooms, sprouts, or carrots and finding a partner with the exact same tastes! I call bullshit on that. \n\nThese “friends” should eat at home. A restaurant of any kind is just not a place they will do well in.",
            "I was friend's with a chef who owned in Austin which specialized in upscale causal food like chicken and burgers.  \nA office party booked at his location and he was asked to provide an alternative to the burgers so he came up with a really nice portabello mushroom option only to have the one vegetarian in the party throw a tantrum because he didn't like mushrooms and he didn't want a salad. Some people are impossible to please. I say a hearty fuck 'em.",
            "A.I already making posts for upvotes",
            "As a vegan, I’d just have to classify them as just stupid.    \n\nMost restaurants will try to accommodate most dietary requests, but ESPECIALLY if you contact them ahead of time.",
            "They must have had gift cards or a coupon to use, otherwise why did they go there?",
            "One time I accidentally took a vegetarian to a steakhouse for a date.  We left and went for Mexican when I realized.  She was gonna just cope with a sad salad.  I can’t imagine doing it on purpose.",
            "If they made the invite, why did they pick a steakhouse?",
            "Did they choose rhe place for YOU?\nif so, gotta hand it to them they didn't take you to a vegan place",
            "Vegan inviting to a steakhouse to be fancy, but have the pallete of a 4 year old 😅",
            "Out of all the food cultures in this world, why would you go to a fucking steakhouse as a vegan. Honestly. So many people have been eating amazing vegetarian and vegan food for that many hundreds of years, for religious or otherwise reasons that they’ve got it down to an art. Looking at you South East Asia.\n\nWhy would you go somewhere where your choices are making a meal out of the sides.\n\nAnd like, I fucking love me some mash potato but I don’t want to eat somewhere where that’s all I can eat. I will absolutely go to town on some sautéed carrots with garlic and toasted almonds and some fresh parsley. But even combined with the mash potato that’s not dinner. That’s just a bunch of sides.",
            "My Vegetarian partner and I thoroughly enjoy Texas Roadhouse. His parents were baffled when we asked for a gift card there when asked where we wanted to go. Our reply was \"They have great appetizers!\". \nSounds like your avoidance solution is a solid one.",
            "I'm vegan and I go to steakhouses. A lot of them have surprisingly tasty vegan options, not just sides. Had a cauliflower steak at a Steakhouse the other day. Laundry's restaurants are not on the list of chains with lots of vegan options and Morton's is owned by them.",
            "WHAT. THE. F——\n\nIt should be an established rule that if you are going to be vegan you HAVE to like ALL vegetables! Like grow the fuck up. Don’t like mushrooms or carrots?!?! GTFOH!",
            "This is why I rarely hang out with vegans, and I'm a vegan. They're so irritating.",
            "Great choice of restaurants. Makes no sense, but great choice nonetheless.",
            "Didn't they see \"Steakhouse\" right below the name? It's on the damn building",
            "i mean, every restaurant has their menu online. any fool could look at it prior if they have dietary restrictions of any sort",
            "Well that's very odd. Why would they ever go there??? Was there an explication about why they picked that restaurant??",
            "Sos they have a gift card they wanted to use, or are they just daft?",
            "Don’t like mushrooms sprouts or carrots????",
            "\"Friends\"",
            "Oooooooof. I work at a steakhouse and we sometimes get vegan requests. I assume it’s someone who got dragged in with a larger party and i always feel bad for them, because if they’re a strict vegan they’re pretty much going to be eating plain romaine lettuce for dinner (since we don’t designate a fryer for just fries and even the bread has animal fat…). I can’t imagine a vegan choosing to go to a steakhouse!",
            "I don't know how old you are but you're too old to mince words. And you don't have to be friends with people who are difficult.",
            "I worked at Morton’s from 03-13, we’d give the vegans every vegetable on the menu that didn’t have dairy on a single plate and charge them $45 for it. Back then it was a baked potato, steamed broccoli and asparagus, sautéed mushrooms (in oil) and tomatoes. Yeah they’re were annoying but we had them covered. God knows what Tillman has done now.",
            "For years I have been questioning the intelligence of vegans, and this post confirms my suspicions.",
            "I honestly would have got my phone and found the nearest veggie friendly spot, make a res, finished the drinks and 86 myself. Why would you or the couple in the party put yourself through that?",
            "Had  a customer allergic to garlic and onions yesterday. Took a good 30 minutes of running around and talking to the chefs to find something she could eat that would be palatable and wont kill her",
            "Sure, Jan.",
            "They sound like royal pains in the asses honestly. I've had plenty of vegan friends take me to steak houses for special occasions and they all had a blast. Besides, a good joint can accommodate just about anyone within reason.",
            "We have a friend-couple like this. She has a million made-up allergies & health issues, and he eats what she will eat to keep the peace. She's an absolute abomination to go out with because she's so rude about it. Our whole friend group has kind of put them on ice because you can't go anywhere that will make her happy.",
            "This is the exact reason why I bring extra cash in my wallet to up and hand the server/staff because, unless the friends/family industry or aware, the fear of this happening is so real. \n\nI had a lady come in the other day and throw a fit because she was allergic to tree nuts, dairy, and gluten. That is a horrendous amount of allergies but I’m so willing to accommodate. Except when the smoked pork that used a gluten bbq sauce was okay as long as more wasn’t added and she lost it on a poor server because I refused to serve her fucking pesto. Pesto. Like that is more than half of your allergies in one go. I offered to talk to her but I ended up making her a salad from the walk in, from fresh bags, with fresh gloves, and fresh cookware because of how allergic she was. She ended up telling said server that I didn’t need to do that because it wasn’t THAT big of an issue. Like woman, I had a screen full of orders.",
            "It’s been a rough week in the kitchen.  Reading this story has made me feel far more awful.",
            "I feel like a ‘nice’ restaurant to some people is only ‘these’ types of restaurants. Mostly because they don’t go out much and are uneducated.\n\nThe invite was probably more for the social interaction and they didn’t want to “impose,” so they defaulted to what they thought was “nice.”\n\n.02$ paid.",
            "Vegan and not drink as well? May as shoot me cause why live otherwise? Food and drink is what makes the world go round!  Foodie here :-)",
            "Vegans who also don’t like vegetables fucking annoy me.",
            "My experience with a vegan friend was about the same, though the rule was we could only go to vegan-only eateries. Which is insanely expensive for food that's supposed to look and taste like the 'real thing'. Which always confuses me. Isn't eating something that's trying to be meat also sorta  against the vegan 'thing'? \n\nThe only reason vegan chicken tasted fine was they drowned it in sauce. Everything else had weird aftertastes. By the third day both my boyfriend and I had throbbing migraines. When they left we had a normal meal and the migraines sorta vanished. I figured by then we were starved for nutrients and protein. My mood also quickly improved. \n\nWe'll never host them again. At least, they wont be staying in our apartment again. Neither showered despite given accommodations and urgings because they reeked. Still good friends though.",
            "Mmhm. Like, why not just go out for Indian food? Or Ethiopian, or Thai, or Vietnamese? Morton's is like... the _last_ place I'd end up if I was a vegan.",
            "Yeah that's where I'm stuck on this right now. What were they thinking?",
            "My guess is there was a coupon or gift certificate involved.",
            "My wife has a vegan friend and she loves going out to eat with her. The vegan always picks the restaurant (much easier that way) and my wife gets to try interesting new dishes. If it all goes horribly wrong there's always KFC on the way home but so far, so good!",
            "crab cocktail and manhattans??? Move over and count me in!!!",
            "I recall Bourdain calling vegans the vegetarian Hezbollah splinter group",
            "The ultimate virtue signaling flex. I went to a steak house and ate plants!",
            "Steak houses are one of the easier places to eat as a vegan. Lots of potato options, from mashed to steak fries to baked, and all you have to do is ask to substitute butter for oil. There's usually a good range of big salads, staple veggies like green beans, mushrooms (not for OP's friends), and steamed broccoli. Anything with bread or breading will almost always not be compatible with a vegan diet but occasionally you'll find a place that does onion rings, fried pickles, fried mushrooms, etc without dairy/eggs in the batter.\n\nOne of my good friends is vegan so I've had to learn all the places we can get lunch or dinner over the years.",
            "My SIL is a vegan who hates mushrooms. She actually doesn't really like food at all, but every family event has to cater to her, which is super annoying as someone that really loves food.",
            "I eat everything and I can’t imagine not eating mushrooms they’re great",
            "Yeah, it really does limit options. I’m a vegetarian who doesn’t really like mushrooms. I used to travel a ton for work and dedicated a year to trying different mushroom dishes at restaurants across the US in an attempt to like them. Hakkasan in Vegas won, with this amazing shiitake moo shu dish. I’ve never eaten mushrooms that tasted so amazing. I try not to ever dismiss any foods without at least trying them a few times prepared different ways. I would 100% order that dish again.",
            "I'm a vegan who hates mushrooms, and I manage!! I'm picky overall, though. I'm also too anxious to ever ask for modifications on meals, I'd rather eat nothing at all than bother staff.",
            "My partner is vegetarian and doesn't like mushrooms. Tofu does a lot of the leg work. But she LOVES most other veggies.",
            "Mushrooms are closer to animals than they are to plants.",
            "I can't eat mushrooms because they trigger my sulfite allergy, and it's a huge impediment to eating more vegetarian and vegan options.",
            "Tbf, a mushroom isn’t a plant.",
            "How does anyone hate mushrooms? They're one of the best things on the planet.",
            "Mmhm, sounds premeditated. Like, maybe you make a res at Perry's and find out it's a steakhouse when you get there. But Morton's is like, the Ur Steakhouse.",
            "They don’t like mushrooms, carrots, or sprouts. I’d be a bit forgiving of any single one as a distaste but all three is giving vibes of undiagnosed ARFID that they’re making everyone else’s problem, or the dietary preferences of a young child\n\nEdit: specifically I’d only forgive a distaste for cooked carrots. If you don’t like raw carrots it better be because of allergies or insensitivity of some reason",
            "Probably newbie vegans who don't know how to order or where to eat.",
            "Yeah that's, the thing.  A vegan going to a steak house is going to be a hassle.  A non-vegan going to a place that is vegan, or just has a lot of vegan options usually isn't a hassle.  Presumably, the vegan places make somewhat decent vegan food otherwise they wouldn't remain in business.",
            "Who is friends with someone and doesn’t know they’re vegan? Not even in a mocking way, they had to have brought it up at some point, right?",
            "I was just being polite since my wife dragged me here tbh",
            "At least they could enjoy an absolutely diabetic amount of that pineapple",
            "I haven't been to Fogo in a minute, but that Market Table was insane the last time I went. No problem finding great vegan options there.",
            "At least the salad bars at those places are usually amazing!",
            "Actually, Those are good options for at least vegetarians because of the buffet and you can pay just for that. Lots of salads and veggie done in different ways.",
            "My Brazilian Steakhouse has a kickass salad bar though.",
            "Joke's on you, we ordered a surplus of fortune cookies last year and were just sitting on them til you came long. We don't even remove the fortunes before we reconstitute them into pizza dough.  \n\nRemember that time you called us to complain that the last pizza tasted \"lottery number-y?\" Yeah that should've been a tip off.",
            "I don’t eat red meat but my family does, so I rely on sides at most steak houses. occasionally there are good fish or chicken dishes, but the sides are where it’s at! A good baked potato makes me very happy.",
            "Took a good vegetarian friend to a steakhouse. His meal was fantastic. Each vegetable had its own flavor. He had more than he could eat. The server was amazing and recommended a few ways he could get a really good meal.",
            "I wouldn't say most. Newbie vegans maybe.",
            "I run an Italian place.  The number of garlic, onion, tomato and gluten allergies are insane",
            "Seriously. They're usually not at all shy about it. Also, did the vegans not understand that they were going to a steak house? Even the air is meaty there.",
            "Yeah these people could have had an amazing salad with some tasty steakhouse vinaigrette and a baked potato loaded with whatever they wanted. They are just dumb.",
            "A steakhouse Ceaser should not be vegetarian, tho.",
            "Caesar isn't vegetarian... the dressing has anchovies",
            "I have bad news for your Caesar Salad intake…",
            "I know people mentioned anchovies in the Caesar dressing but heads up that parmesan cheese isn't vegetarian either if it's made with animal rennet. \n\nI've had problems with some steak houses frying things in beef tallow too. Ugh.",
            "to be fair if you know anyone who is lactose intolerant when was that the last time that stopped them from eating dairy. They just always say it was worth the price or od on lactaid",
            "I think this is a bs post.",
            "seems like the perfect time to regift or sell a gift card to me",
            "Palate. Palettes are for painting.",
            "MashED potato probably has butter too so the vegans can’t even eat that!",
            "Indian food is GOATED and I'm not even vegan. It's one of the few types of resturants where I'll willingly avoid meat.",
            "They’re the baseline veggies as well, your standard line-up before the Big Boys come out.",
            "And cigars!",
            "Vegans aren't against the taste of meat. They're against meat being animals. So fake meat satisfies the meat craving without the animal part.",
            "Thai and Vietnamese also not great choices to my knowledge fish sauce or shrimp paste in literally everything.",
            "Indian probably isn’t a great choice for vegans - basically everything is cooked in ghee. It’s an awesome vegetarian choice",
            "And not drinking?\n\nNice Steakhouses are known for wine, whisky, and steaks. Almost every dish has a shitload of butter in it. \n\nI can’t even imagine",
            "At the very worst you're gone get some fries or well cooked side veggies.   It's not all faux stuff.",
            "Not one single restaurant, ever, is making someone special vegan mashed potatoes unless it's already on the menu.",
            "\"hunny!   Let's go eat $24 asparagus sides with garlic and butter!",
            "My SIL tells everyone she is vegan and then orders branzino at restaurants but doesn’t want it finished at the table because “it’s gross”",
            "She should buy Huel and just bring that to the family gatherings. It’s perfect for people who don’t like to eat.",
            "I've know more a few people that seem to use veganism and/or food allergies to hide an eating disorder.",
            "My BIL is vegan and also considerate enough to bring his own foods to family gatherings.  My extended family’s general lack of food knowledge told him a stuffing made with butter was vegan and no he doesn’t take any chances.",
            "Stop consenting to put up with that.  I just wouldn't go.",
            "Despise that person too. Commented earlier about being vegetarian well before it was common. Never made a scene or asked for anything special. I honestly feel people should pack their own meal if they are so picky.",
            "I used to be someone who hates mushrooms because I only ever had the sweaty soggy grey kind. They're a food that can be miserable if prepared badly, in my opinion.",
            "I despised mushrooms as a child.  I wouldn’t even eat dinner if mushrooms had been cooked in the kitchen near the meal.  Now I would be happy as a clam to just eat a whole bowl of sautéed mushrooms.  So good.",
            "mushrooms is one of those things I *want* to like but the mushroom flavor itself is just so off putting. Ive had em prepared poorly as well as seared in butter, blended into a nice sauce, grilled, etc. I just cant stand the mushroom flavor (although i will eat it if its mixed into other foods a la omelet, its just not preferred)",
            "What's with the mushroom hate?  Is it a texture thing?\n\nI'm not their biggest fan, but my complaint about most mushrooms is that they're fairly bland and don't really taste like anything. (Maybe truffles are amazing, but I'm not rich enough to waste money trying to find out.)\n\nLike if'm splitting a pizza with friends and discussing toppings, I'm going to object on the grounds that I don't want to pay for a topping that doesn't really add anything.  Same with black olives.  But if someone else is paying, then ok whatever.",
            "Have you tried making seitan. You can get some textures that tofu struggles to provide.",
            "Cool to know. My rule is don’t eat things that had a face.",
            "Which is why I've moved away from them even though I previously loved them. I got in my head about it and now I just can't do it",
            "Texture. I can't put my finger on it exactly, but the answer is texture.",
            "I don't like raw carrots. Cooked are awesome, completely soft, though, no crunch.",
            "I always take my dad to a vegan restaurant and it's always great food. Means that he and I can eat everything on the menu. \n\nAs a vegan I would not feel comfortable inviting friends to do something where they support non vegan activities. But I guess that's a bit more of a personal choice.",
            "I'm guessing they don't enjoy anything much, but really like complaining. They'd probably have a great time, lol",
            "Lobster Mac and cheese tho.",
            "I will murder an entire field of brussels from pretty much any given steakhouse",
            "Fair. I should have said most vegans complaining on the internet. The population sample and selection bias really winnows down the data to an unrealistic representation.",
            "They don't want to go somewhere that fits their dietary restriction. They want to be indignant about the things and places that dont",
            "Oh gosh I can’t imagine being allergic to 4 of the best foods on earth!",
            "I work at a pizza joint. We sometimes get celiacs where even cross contamination is an issue for them. Like, what? There’s flour and dough flying all around this kitchen.",
            "This whole post just reeks of BS",
            "Not to mention they picked the place according to OP's story!",
            "Right. If a steakhouse offers a Caesar salad, it’s safe to assume it’s house made with anchovies. You do you though.",
            "Yes, I’m aware that they’re traditionally made with anchovies. Many places don’t or can leave them out.",
            "Yeah this is just ragebait lol",
            "What if I just like paint?",
            "You can use margarine for making mashed potatoes. Margarine is vegetable oil.",
            "But why make the fake meat taste so weird and bland. I feel like there's vegan dishes Ive had that just taste better flat out. Without a bunch of fake meat stuffed in. \n\nAnd the fake chicken was almost twenty bucks per sandwich.",
            "A lot of them use vegetable \"ghee\", it's cheaper at about half the price and vegan. Not as good obviously but it is a thing.",
            "no restaurant is a good choice for vegans unless it's a vegan restaurant",
            "Been a vegetarian for 30+ years. Well before restaurants starting having choices for us. I was always fine with a salad, lots of bread and 3 or 4 cocktails.",
            "Status. Partially related but I have a theory that well done steak would not exist (well, 99% of well done steaks, health issues and similar will always exist) if it wasn't for the fact that steak is a status symbol. There's no reason I can fathom why someone would want a well done steak when there's so many cuts of cow that are best made braised/smoked/similar beyond they wanna be able to say \"I had a steak\".",
            "My favorite vegetarian and vegan dishes are the ones that aren’t imitating a meat dish. The ones that focus on how good the VEG is are my absolute favorite. The fake meats sometimes make me feel a bit sick, ironically",
            "[deleted]",
            "Wait a minute why order a good fish if done right and as a vegan then complain that’s why I call some vegans fake vegans not all but some",
            "lol I think the word she is looking for is “omnivore”",
            "Huel seems like the human version of kibble.",
            "Oh yeah, they’ll be vegan/gluten-free/“clean” as well as not liking this or that grain/fruit/vegetable, and then  excuse themselves for not eating much of anything.\n\nMore and more people are waking up to orthorexia’s existence and it’ll be interesting to see how it’s discussed with regards to fad diets.",
            "I was just about to say, that the people in the OP just sound like they're mentally ill.",
            "I like him! I love cooking for people and would probably have main meat dish, and a small/individual vegan main for him with all the sides made vegan if possible. If not, I'd at least try to make 1 main and 1 side vegan just to accommodate... But cooking is my love language",
            "That earthy mushroom flavor is what I like haha",
            "Another mushroom averse vegan checking in… most people suck ass at making mushrooms. Pizza places just throw them on, and in dishes designed to appeal to alternative dietary needs they are usually just so over the top with the quantity for me that I can’t stand it. They are great accents, but not a basis for a meal to me. I think it really is just texture - and sometimes honestly I think mushrooms that aren’t seasoned remind me of dirt in the same way that beet juice does. \n\nNow, go to a good restaurant that fries them up or uses something that isn’t portobello/white mushrooms or whatever? Yeah dude, give me that lions mane shredded up and slathered in Carolina gold.",
            "It's texture for me. I can't stand slimy foods. I do really like truffles, even raw! I'm just a very picky eater. The list of things I refuse to eat is very, very long.",
            "I have not. I've been trying to master tofu mostly before moving to other stuff. I'm good at steak and all that jam but tofu is a different breed. So far I've had success with pressing it, freezing it, thawing it, and then pressing it again with extra firm. It works for my partner. She loves it.\n\nI'll have to look into that though. I've heard good things about jackfruit too",
            "One of the best Indian dishes I've eaten was some kind of buttery carrot. Man oh man, I could have eaten a popcorn bowl full of that stuff.",
            "Unforgivable",
            "So good. They’ll also just bring you whole lobster tails with melted butter. I could eat those as a main.",
            "Not vegan, but vegetarian and most steakhouse creamed spinach could be it's own meal.",
            "I've been vegan for almost a decade and every vegan I know can navigate a menu like minesweeper. You have to know a lot more than the average diner when you have dietary restrictions, of any kind. You can't rely on servers to be able to know anything or help you find options. Saying to a server \"what do you have that's vegan?\" Is really embarrassing and a sign of a newbie imo",
            "the dumbest in any given group are usually the loudest so this tracks",
            "Do they expect you to decontaminate your ovens of a thousand pies worth of gluten do bake the gf one?",
            "I had a regular at an old job who would order a Caeser salad sub lemon vinaigrette OTS.  \n\nYou can maybe argue that maybe it's not a real Caeser salad without the dressing.",
            "Some places yes, some no, some will make special.",
            "Huh, TIL, thanks.",
            "Yeah I decided to splurge on a steak dinner once as a teenager to celebrate an accomplishment and realized like halfway into it there’s a hundred foods I like more than a mid steak and a baked potato that are also way cheaper. \n\nI was just doing it because I was like 17 years old and treating myself to a steak seemed like something adults did to celebrate adult things. \n\nI felt like two kids disguised in a trench coat pretending the steak was worth it, knowing I would have been happier sitting at the park with a pizza and beer",
            "Correct. My MIL buys filet mignon, and then beats them to death to 1/8 inch, then cooks them like they have the plague. I wanna cry.",
            "that would make a lot of sense! Ive never understood ordering a steak out when I can make it to my preferances way better at home...",
            "Agreed. Their often gross and just as processed and sht for you as eating a hot dog. ",
            "Same here! I have a vegan friend I have lunch with occasionally. We go to vegan restaurants obviously. She's always getting vegan pepperoni pizza or vegan chili cheeseburger or something. Which... Yeah, I get it. Those things are probably delicious. But gimme that hummus salad with falafel and olives or Egyptian fava beans (ful something?) with flatbread or gnocchi with spinach pesto.",
            "I've had that discussion with a surprising amount of non-omnivores (I am an omnivore, but heavily leaning vegetarian in my day-to-day). I don't get the need for replacing any meat in a dish, when there's way better tasting things, and importantly things with a way better texture.\nNot into meat but craving a lasagna? Get a veggie Parmigiana instead. If you're vegan, you probably want to forego the cheese on it ... toasted (vegan) breadcrumbs for the texture and some vegan creamy thing that complements the taste and can in that sense \"replace\" the cheese - it doesn't have to be a one-to-one vegan cheese though.",
            "And you would be the exception not anywhere near the the rule. Nothing you said, in either this comment or your original one, makes any real sense. I have personally peeled boiled and mashed over a tonne of potatoes. Which now that I say it is criminally underweight. I worked at a place that did 2000kg of wings a week. There’s a fair chance that I’ve peeled boiled and mashed 10000kg of potatoes in my life. And in that time, which is over 30 years, I’ve worked at one place that didn’t premake mash potato. And that was a 5 star boutique hotel, where everything. EVERYTHING. Was made by hand. I mean apart from the base protein. And even in this boutique, 5 star hotel, we weren’t expected to have a la minute vegan mash.",
            "She is a fake vegan. I have to look away when she tells people.",
            "Pescatarian?",
            "Bachelor chow from futurama",
            "Or the human version of Soylent Green!",
            "Fair enough.  There's a lot of vegetables that just kind of taste like dirt. \n\nWas visiting my sister when she was serving her children cauliflower, and the kids were excited.  \n\nI was like WTF kind of cult is this where the kids are excited about cauliflower?  \n\nTurned out she had smeared the cauliflower in olive oil, then covered it in salt and pepper and put it in the oven at 400 for a few minutes.  \n\nOk that was actually delicious.",
            "Truffles should always be raw",
            "Agree and same. I’ve had great success in asking how a dish is made, or what the ingredients are if it’s something questionable. Flat out asking if it’s vegan will put them on the spot and get you questionable answers. I view the limited options as a small sacrifice for the animals. I can cook amazing shit at home. Finding delicious viable options out in the wild is a fun suprise, but never expected.\n\nEdit; I missed the part about *vegans you know*, I don’t know any lmao. Small rural Alaska town, I could be the only one 🤣",
            "At one place I worked at, we made the dressings in house.  \n\nWhich meant me being there several hours before we opened to make the damned dressings.  So yes I knew what was in every damned dressing.  \n\nHad the area manager quiz me about this.  So the Caeser wasn't vegetarian, (SMH that most vegetarians don't know this) but the ranch was vegetarian, but not vegan.",
            "We don’t even have a gluten free dough! Granted, we have lots of gluten free (and vegetarian/vegan) small plate options but there’s flour all over the kitchen. We bake two types of bread on top of it and have gluten in the fryer.\n\nEdited to add it’s a TINY kitchen. Cross contamination is impossible to avoid.",
            "This is blasphemy! (But it IS a mil thing… so I unfortunately understand.)",
            "[deleted]",
            "I only call them fake vegans as I used to help a friend out at his banquet hall when his cooks didn’t show up we would make a stirfry with only vegetables for them. Stay they ordered 15 only max 5 would go out I go there goes the fake vegans again",
            "Usually when someone calls themselves a vegan, but “only eats fish” that’s code for they eat lots of vegetables and a little of everything else. Not that it matters that much but I do get a chuckle out of it.",
            "Now with flavour!",
            "\"Makes its own gravy!\"",
            "Isn’t Soylent Green already a human version?",
            "I know, I'm commenting on the fact that I enjoy the texture despite it being raw mushroom...",
            "I've been a vegan for almost 10 years and a chef for over 20. You wouldn't believe how many servers and *cooks* were confused when I said that vegetarians couldn't eat panna cotta. A vegan diner (or gluten free or whatever) needs to be educated about they food because the staff don't know shit",
            "We had to buy a case of ass nasty cauliflower pizza shells that one regular vegetable is to get for her which proceeded to sit in freezer and freezerburn",
            "It is well known in medical circles that trichinosis, schistosomiasis, and hookworm abound in underdone steak; This is merely an act of self-preservation. These deadly parasitical infections can also be found in underdone eggs, vegetables that still retain a trace of color after boiling in salt water, and fresh fruit. Canned vegetables and fruit, however, are just fine if carefully coated in a layer of gelatin or aspic.",
            "20+ years in the industry. Over 10 restaurants (at least!) Never, have I ever, heard it done the way you are describing. Can you tell me in which area of the US you've done this? And what restaurant(s)?",
            "How many places have you worked? This is definitely the exception.",
            "That’s the joke it’s humans.. *for* humans! “Soylent Green is people!l lol",
            "Ha! Reminds me of a time years ago when a roommate and I moved in together and decided to check out the neighborhood ice house. For those unfamiliar, an ice house in Texas is a divey open-air joint that only serves beer. My roommate told the bartender, “You should get X beer because that’s what I like.”\n\nWe didn’t go back for another month but the second we walked in the bartender recognized us and said, “Hey, we got your beer!” This was a place that keeps their beer on ice instead of in coolers (not unusual for an ice house) so we had to power through an entire case of canned beer that had just been re-iced every day for a month. It was skunky but they did that for her, so we were obligated. It became our regular hangout after that.",
            "Abound? How about a source for that.",
            "But: canned goods can contain botulisms, so i'd recommend one stays away from these as well",
            "Co-signed. 26 years in restaurants and I have never worked anywhere that would make mashed potatoes from scratch for any reason. If something on our menu doesn’t meet your dietary requirements as is then you would need to order something that does.",
            "By people, for people"
        ]
    },
    "I see you've played knifey sinky before": {
        "title": "I see you've played knifey sinky before",
        "score": 897,
        "url": "https://v.redd.it/v7vx74qmry7d1",
        "content": "",
        "num_comments": 37,
        "comments": [
            "When I was still a dishie, kitchen never did it, but servers would just throw knives into the water where I couldn’t see them. I used to thrust my hand in as hard as I could to see if I could get a day off.",
            "I don't have this problem anymore. I have had it in the past for sure, but when I implemented a \"you must wash your own knife\" policy, the problem stopped.\n\nMy current battle is the fucking mandolin. I just switched up the menu and it calls for the mandolin a lot. The fucking guys will leave the blade 'open', like not wind the mandolin closed, so the blade sits proud on the sliding/ramp surface, and plop it in the tank. It drives me nuts. \n\nThe thing is, when grab the thing in the tank, it doesn't feel like a knife, it feels like a cambro or something. So, you just grab the bastard and cut yourself. Drives me insane.",
            "When I was a dishie, I must've been a bit extra cause I'd wear two layers of gloves. Didn't feel like burning myself on hot pans off the line or the hot water or the knives. Fuck it I was armored. I also wore two pairs of socks with a plastic between them to keep my feet from making contact with any nasty water that would drip on my shoes or into my shoes. ",
            "This is fucking hilarious. \n\nThread title kills it too.",
            "I yelled at someone for this (manger why are you yelling?) Then she took over the yelling. 🤣",
            "I let my staff know when they are hired the fastest way to tender their resignation is to leave a knife in the sink. Just once. No discussion needed. Off the schedule immediately.",
            "The ‘ol grabby/stabby.",
            "Classic game of shark bite! Throw those fingers in for the handle, watch out for the shark!",
            "I don’t know why this is so funny but it is.",
            "I have worked in many kitchens in my life. Nothing major. Mostly cafe and brunch. Now I’m working in a gas station with a full service kitchen with teenagers. 🙄 god save me. They’re so f*cking stupid. They spray caustic chemicals on porous cook surfaces, dump knives into sinks full of dirty dish water, and can’t be trusted to pick something up that fell on the floor and take it to be washed. The knives aren’t sharp or particularly dangerous but I don’t want to unknowingly grab a dull knife with wet, slick hands. The holding oven is dangerous enough to clean nightly.",
            "I toss mine from across the room into the soap water.",
            "That’s what pisses me off about AM and why I bring my own knife",
            "I got poked once by a knife. Didn’t get any days off tho.",
            "Same scenario earned me a set of 3 scars across the front of my knuckles. Years later, when I find a knife in water out comes the story of them scars to get people to stop. ",
            "I also make them clean the mandolin if they use it. Basically if you use anything sharp, you're responsible for cleaning it. I think I speak for everyone when I call mandolins \"sneaky fuckers\"",
            "Is there any way to make them wash it themselves too? Clearly they can’t be trusted to have the dishie do it :/",
            "I would bring the soapy mandolin back to that line cook- set it sudsy and all right on his cutting board.  He will quit putting it in your sinks after enough times of this.  Gotta do this kinda stuff in kitchens when nobody will listen/change & you know you are absolutely right.",
            "Definitely extra. Someone correct me, but isn't the plastic thing just a recipe for trench foot?",
            "Very, very rarely will I ever raise my voice at work (I think literally only this one time), or give people instructions or orders/put people in their place, as I'm not a boss or don't get paid to care like one... but when I stumbled upon a knife in the filled sink you better believe I went down the line yelling at every single cook asking who tf did it.",
            "Similarly, dropping a Cambro off at the dish pit without using a spatula first is also grounds for immeadiate termination. As well as leaving a pathetic portion left in the oversized container without downsizing.",
            "If that’s an ongoing problem with everyone it sounds like you need to train them better",
            "OMG IS IT KWIKTRIP DO YOU ALSO WORK AT KWIK TRIP",
            "Felt that, broke my right hand one night mid rush and had to finish out the shift, as well as come in early the next day",
            "My coworker was either a dumbass or really wanted time off, he was “sharpening” a knife. He held the sharpener stationary and dragged a knife across his knuckles. He hit 2 tendons",
            "Yeaaaah I was a bit of an idiot for it and thank god I got lucky and never hurt myself, was just an idiot high schooler doing way too many drugs at the time lol",
            "Yeah iunno probably but I was only part time",
            "It would only be an issue if the inner sock got wet",
            "Wearing two socks in general is actually a way to combat trench foot, wool socks specifically, the outer layer wicks the bottom layer’s moisture off. The plastic would stop the moisture from getting on the inner sock I guess.",
            "I had a ding dong put a tomato slicer ON TOP of a colander. I stared \"that's gonna fall\" 3seconds later it fell blades first on my hand and had 5 perfect slices across the inside my right hand. Same kitchen......yelling 😆 I yell over safety stuff. The issue is I do care, and I've had to emotionally disconnect or I'll have a stroke. Lol",
            "If I hear “I forgot” one more time I’m going to need a bigger walk into scream in.",
            "*spit snort* yes.",
            "What. How did they expect you to work with a broken hand?!\n\nPs.: sound exactly like the kind of bs that a manager would pull.",
            "Well, that’s one way to ask for vacations.",
            "Or they act like it's the first time they ever heard this...",
            "let's fucking gooooo\n\nyeah kwik trip kitchen is/was the fucking worst. No one did dishes well. Always a bombshell. 16 year olds being put on chicken were the worst. Wild shit.",
            "By putting me on the fryer instead of the grill lmao, got slid a lil extra cash after the fact so I chilled about it but I was pretty upset initially",
            "I’m lucky to work in a store with mostly older people but when I fill in around the metro, it’s random and aggravating."
        ]
    }
}