{
    "Tired of your content here getting removed? Use our new affiliate & sister sub r/LowEffortLeague for (almost entirely) unrestricted content": {
        "title": "Tired of your content here getting removed? Use our new affiliate & sister sub r/LowEffortLeague for (almost entirely) unrestricted content",
        "score": 594,
        "url": "https://www.reddit.com/r/LeagueOfMemes/comments/tivzor/tired_of_your_content_here_getting_removed_use/",
        "content": "The subreddit r/LeagueOfMemes has, over time, received more and more content that doesn't quite fit any other sub. Sometimes it's casual discussion, low tier gameplay, general questions, bad memes, and similar things of this nature. The main sub r/leagueoflegends has strict content regulation and r/LeagueOfMemes keeps things strictly to memes/humor content. Rather than bend the rules here, we've decided it best to create a sister sub that does not (for the most part) regulate content. \n\nSo, with that in mind, we're happy to introduce r/LowEffortLeague!  **On this sub, you're free to post your bad memes, bad takes on the game, simple questions you could answer on your own by googling it, \"comment your main and I'll tell you X\" posts, etc--whatever your heart desires!**\n\nHowever, there are a few things that won't be allowed:\n\n1. Racism, sexism, homophobia, and other forms of bigotry\n2. NSFW/NSFL content (including porn.... this is NOT a porn sub)\n3. Stolen content\n4. Giveaways, and other content that could fall into potentially scamming users\n5. Spam\n6. TOS breaking content\n\nA few more notes:\n\nYou are allowed to promote your streams and channels **if you have less than 50,000 subscribers and/or followers.** However, you are only allowed to do so by contributing something to the sub. For example, posting \"Watch me live at <this time>!\" would not be allowed. However, posting a gameplay clip and then promoting your channel in that post is fine. If you have more than 50k subscribers/followers and would like to post, simply message the mod team ahead of time to receive approval. \n\nIf you want to promote a discord server or find people to play with, in the interest of safety of the community please message the moderators first and receive prior approval before posting outbound links. Otherwise, they will be blocked by automod.\n\n---\n\nAs time goes forward we will likely have to adjust these, but hopefully this serves as a good starting point for the sub.\n\nHave fun everyone, hope to see you over at r/LowEffortLeague!",
        "num_comments": 86,
        "comments": [
            "[deleted]",
            "i love reddit because you can get into a hobby and go check if theres a sub and find out the main sub is run by a control freak and so is every other sub about the hobby so you have to follow 3+ subs just to get the full experience",
            "Finally,\n\n# shitposting",
            "I like this\n\nHaving a sub for basically everything League related is something i wanted for quite some time",
            "> bad takes on the game, \n\nSo same as this sub?",
            "Why no nsfw",
            "Thanks again for this, really glad you're here! One question, you mentioned in a post that it was possible to remove some flairs. I'm really tired of seeing those draw 6 champions posts. How can I remove them?",
            "Hey there , my posts aren't being removed. I have an issue with just trying to post a meme. I've tried a few times tonight. You hit to create the post, it spins for a long time, then takes me back to the subreddit like I did nothing. Just wondering if that's happening to others?",
            "Could it be named 'Lag of Legends' in honour of our fallen comrades?",
            "Can I still post tierlist memes here?",
            "[removed]",
            "Okay, now remove the posts that aren't memes",
            "Anyone want to play the game by talking to me?  I'm a good sup gamer.  If you want to be a friend, you can add",
            "Goan",
            "[removed]",
            "[removed]",
            "[removed]",
            "Can I put TFT stuff here?",
            "Al",
            "Lol the top post of this week is literally a meme with 1 line changed...",
            "https://www.youtube.com/watch?v=BTpYzAhuEp0",
            "[removed]",
            "[removed]",
            "💥💥",
            "Sometimes low effort is just what we need for a good laugh. Cheers to the new sub, let the memes flow!",
            "nice",
            "can the admins check something? i think i am getting downvote brigaded by bots. my posts are downvoted on the low effort sub too. i know admins are the only one that can check who downvotes me i think",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "You can post all that in there if you want! The idea is to let it get filtered out naturally in /new. Might have to add restrictions one day down the line but for now, just want people to start using it ❤️",
            "[removed]",
            ">sub is run by a control freak\n\nSuch a golden statement",
            "If they're in meme format :)",
            "Well for one, there are plenty of league related porn subs out there, this doesn't need to turn into one. Outside of porn content -- what kind of NSFW content do you want to post/see?? The rule is more so that it's there if we need to enforce it, if we have to.",
            "Porn here is kinda cringe ngl and I legit just started doing OF lul but the full on porn is special",
            "Your UI  will be a little bit different cuz I have the mod view, but [this is where you can filter posts by flair](https://imgur.com/a/u1VNKm8). It only works with new reddit and some apps.",
            "Ok well I waited 5 million years for someone to help me. Guess I'll never get to post here again. \\*sigh\\*",
            "For now, yes. Just flair them as such",
            "It's a gradual transition my dude, but that's the plan",
            "Your comment has been removed because you have less than 0 comment karma. This indicates that you are likely either a bot or a regularly toxic user. Please contribute more to reddit by posting and commenting to get around this low threshold.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "Your comment has been removed because you have less than 0 comment karma. This indicates that you are likely either a bot or a regularly toxic user. Please contribute more to reddit by posting and commenting to get around this low threshold.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "fuck theres a rule against that",
            "Yes",
            "Your comment has been removed because you have less than 0 comment karma. This indicates that you are likely either a bot or a regularly toxic user. Please contribute more to reddit by posting and commenting to get around this low threshold.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "Your comment has been removed because you have less than 0 comment karma. This indicates that you are likely either a bot or a regularly toxic user. Please contribute more to reddit by posting and commenting to get around this low threshold.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "This has been removed because your account is less than 2 days old. This is in place to prevent spam and bot accounts.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "This has been removed because your account is less than 2 days old. This is in place to prevent spam and bot accounts.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "This has been removed because your account is less than 2 days old. This is in place to prevent spam and bot accounts.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "This has been removed because your account is less than 2 days old. This is in place to prevent spam and bot accounts.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "This has been removed because your account is less than 2 days old. This is in place to prevent spam and bot accounts.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "This has been removed because your account is less than 2 days old. This is in place to prevent spam and bot accounts.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "This has been removed because your account is less than 2 days old. This is in place to prevent spam and bot accounts.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "This has been removed because your account is less than 2 days old. This is in place to prevent spam and bot accounts.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "This has been removed because your account is less than 2 days old. This is in place to prevent spam and bot accounts.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "This has been removed because your account is less than 2 days old. This is in place to prevent spam and bot accounts.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "This has been removed because your account is less than 2 days old. This is in place to prevent spam and bot accounts.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "This has been removed because your account is less than 2 days old. This is in place to prevent spam and bot accounts.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "This has been removed because your account is less than 2 days old. This is in place to prevent spam and bot accounts.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "[deleted]",
            "[removed]",
            "Hey there so sorry to bother but I commented yesterday as well. Just wondering why I can't post anything? I've tried for a few days now. It just spins on the submit button, then takes me right back to the subreddit like I did nothing. I miss posting here. I turned off my browser extensions to check for issues. Any advice please?",
            "This has been removed because your account is less than 2 days old. This is in place to prevent spam and bot accounts.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "Thanks, but I'm not sure you can access this part through the phone app :(",
            "Yeah, doubt that.",
            "Lol we actually talked a little about if we should allow esports crap or not because most of us feel the same way about how it ruins the main sub.",
            "This has been removed because your account is less than 2 days old. This is in place to prevent spam and bot accounts.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "Well, the long-term solution is even better! We made r/LowEffortLeague which should maintain a low bar for post quality. Whatever random crap you wanna submit there, go for it\n\nHopefully, eventually, the sub will become active enough that it's comparable to this sub. When that happens, we can disallow posts that aren't memes here and move them all over there. :)",
            "So 5 months later and the main sub is still just flooded with esports.. I guess it was decided to keep it?\n\nSeems weird that the esport stuff doesn't have its own subreddit.. Everything else is so stringent, but for some reason the game and the sport are mixed together.",
            "I think you replied to the wrong person?",
            "No, I just wasn't clear enough! For now, the solution is to filter out things that aren't really memes with the flairs. I'm sorry if you don't use Reddit desktop and can't utilize this future, but in the long-term you hopefully won't have to worry about it because we'll be able to remove that content and send it to our new sub."
        ]
    },
    "Welcome to r/leaguediscussion!": {
        "title": "Welcome to r/leaguediscussion!",
        "score": 36,
        "url": "/r/leaguediscussion/comments/1d5anfd/welcome_to_rleaguediscussion/",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Question for visibility here: who is the moderation team of the new sub? Are these all established accounts with a paper trail and accountability, or sock puppets for existing mods the community acknowledges as bad actors, punitive enforcers? \n\n\n I am all for the existence of a discussion sub, particularly given how heavily moderated non-esports content is on the main subreddit, but I do not want to jump from XYZ mod who suffers no disagreement to XYZ2 mod account of the same person under a different name...",
            "forsen",
            "We, r/leagueofmemes mods moderate the new discussion sub. We encourage all kinds of discussion topics about league, and are not affiliated with the main sub in any way, shape or form.",
            "The mod team is the entirety of the current leagueofmemes mod team. I have been \"running\" this sub for a while now and pretty thoroughly vet new mods, I have no concerns. As the new discussion sub picks up, I'm happy to discuss any individual concerns."
        ]
    },
    "Stole the format from the TF2 sub": {
        "title": "Stole the format from the TF2 sub",
        "score": 1419,
        "url": "https://i.redd.it/l8kgnbh1x08d1.png",
        "content": "",
        "num_comments": 258,
        "comments": [
            "I love how gragas is taking up two numbers",
            "Are you telling me I get Draven commentary on Garen and Katarina joining the mile high club for no additional charge",
            "2.\nJax is cool and giving Dad-Vibes. \nPretty Chill 😎",
            "7 \n\n20 hours of Shuriman History lessons from Nasus and constant retorts and interrupts by Renekton shitting on him while he remains serious.",
            "8 vayne probably will smell the least but I’d be hesitant to ask illaoi to stand up so I can use the bathroom",
            "6 is the best spot, Gragor is probably nice to sit next too, if you aren’t offended by belching",
            "I'm sitting my ass next to rumble and waiting for the plane to go down",
            "2. It’s window seat, I like window seats. The only other window seat is 8, and I’d rather not be in a 3 man row. Super inconvenient if you need to piss.",
            "If we are taking canonical power level and not just casual plane flight, mord kills everyone and only Galio, Renekton, and Nasus have a chance of survival.\n\n\nIf we are talking just a casual plane ride without risk of a massive fight breaking out (but still having people be dangerous):\n2 is a trap, effectively the same as sitting between renekton and nasus but both are actively hating on each other rather than just one being absolutely bloodthirsty and the other trying to compromise, even if only for the flight. Even with Jax and Katarina around to keep garen and Sylas in line there is a likely chance sylas might decide to end garen and you would be caught between them.\n\n5 is my choice, Zed isn’t inherently evil just misguided, Katarina has Garen to keep company, Kassadin isn’t entirely insane, and illaoi will keep anyone in line who starts picking fights. If kayn turns to Rhaast he would atleast have the decency to wait till the flight was over before trying to slaughter everyone, and considering mord and Renekton of all champs are on the flight Rhaast is the least of my worries.\n\n4 is inadvisable. Kassadin isn’t the issue, mord is. He would likely accidentally kill you just by sheer power of his soul magic over the flight. Unless you want to be a soulless husk, do not sit with the tin can.\n\n8 is also a pretty good spot, out of reach of Renekton and Nasus isn’t gonna hurt you. You also are far enough away from any potential passive threats like mord.\nThough if Renekton chooses to beat on his brother you are likely in for a bumpy ride.",
            "1 Draven is fun",
            "2, 3 and 6 are the only ways I dont die instantly, so those probably. 5, 8 and 1 are places where I MIGHT live, and 4 and 7 kill u instantly.",
            "7 isn't quite what I meant when I said I wanted to be sandwiched between Nasus and Renekton, but I'll take it.\n\nHappy 6/21 btw",
            "5.  \nNeither Zed nor Kayne need to ask me to get up to go to the bathroom.  Most likely to have the window down so I can sleep as well. \n\nI can be smart enough to not engage in any flirting coming from the hot redhead to my left because her significant other is absolutely MASSIVE.  \n\nIllaoi is unlikely to be the type to kick the seat in front of her. Kassadin is unlikely to be that guy to lean his chair all the way back. \n\nHow I'm boarding I don't have to worry about Gragas squeezing down the aisle. I will be deboarded before him so it's not my problem. \n\nIf Sylas decides he wants to hijack the flight his babysitter Galio will handle it or...Jax will probably handle it, he doesn't even need a REAL weapon.",
            "😳7",
            "How did morde make it through the metal detector?",
            "  5 ain’t so bad as long as you aren’t Noxian",
            "Please can we move 5 to between Zed and Kayn 💦",
            "Honestly, I think after 20 hours without his \"liquids\" Gragas is the most dangerous person on this Flight.",
            "Number 6 cus i will out drink him",
            "How the hell is Galio fitting on a plane?",
            "Jax. We’d ramble on about eggs like Bubba talks about shrimp",
            "2, I'm over 18 so I should be fine",
            "Its good to see how OP gave Gragas 2 seats \n\nAnd 6 cause i ll sit behind massive mommy Illaoi \n\nParty with Gragas\n\nGalio just being a silent dummy like he is\n\nRenekton busy fighting with Nasus for who gets control of middle seat",
            "8 I wanna sit with my edgelord buddies.",
            "6 and 2 seem solid.",
            "5 must feel like a pyramid scheme meeting pushing you into shadow magic",
            "8. I get to sit next to vayne, huff gragas' burp fumes, and give kayn reach around all flight? What's the downside?",
            "3 is the absolute best, renek will be busy with nasus and sylas with garen, so you'll just chill with rumble and galio",
            "6",
            "Six. Graga👍",
            "6 because... BOMBA!",
            "6 gragas would just be that chill fat uncle that will ask you to drink with him",
            "6 Gragas has enough to drink and you can go to the toilet. Start running when he throws his drinks though",
            "6\n\nBoth Galio and Gragas might be pretty nice to talk to\n\nRenekton might be kicking the seat but I can live with that; can always make fun of Nasus to convince him to stop",
            "6 and I bring beer with me to drink with gragas",
            "If i want to play it safe 6. If i want to have fun 1",
            "6, gragas seems considerate getting two seats for himself. \n\n\n1-4,7,8 are all illaoi tentacles by the time the flight takes off. \n\n\nI'm not sitting between two assassins.",
            "next to gragas, I'm sure he'll have a lot of fun things to say",
            "there is no good answer, this plane is gonna crash the second either Nasus and Renekton start fighting or   \nRumbles mech malfunctions.  \n  \nOr Gragas gets mad because they took his bear.  \n  \nOr Sylas is going to suck out all of the magic out of Galio and explode.\n\nOr Mordekaiser death aura is gonna kill the pilot\n\nOr Draven is gonna bore the pilot to death\n\nAlthough Galio could save you on 3",
            "2 and 8 are the most comfortable choices but Susan and Renek can sandwich me if they want 🤭",
            "I don't think the plane will make it back down with sylas and garren on the plane.",
            "8 so I can bother kayn and also listen to him whine at zed constantly",
            "I'm pretty sure whereever i'm going i won't arrive if i sit on 7 so let's go with that",
            "4 or 2",
            "2, easily",
            "6 because i like Gragas, hes nice guy",
            "8",
            "5 they are actually normal people with shadow power and heavy duties",
            "4 İ love mordekaiser",
            "4 for sure. I will ignore Kassadin and let my gay ass drool because I sit between Morde, Zed AND Kayn lmao. Also I wanna hear Morde yap about his story, that would be awesome.",
            "Seat numbers 4 unitonically, as someone that has been in a couple of 20h flights being inbetween two mostly quiet people that wont brother you too much is a blessing, the bad part IS maybe Zed and Kayn may Talk during the beggining but a couple of hours later both would be silent and you can sleep most of the flight away",
            "Draven is on board so the plane is probably going down anyways so it doesn't really matter.",
            "Nowhere near Sylas, the stench would be unbearable.",
            "The answer is always the window seat. I'll take the one next to Jax over the one next to Vayne.",
            "Imagine being in 4",
            "1",
            "5 cuz we can talk about metal bands and go full edgelord schizo together ~~(also kayn is hot)~~",
            "Fighting between 7 and 8, I like window seats, and Vayne seems to be cool, but Nasus and Renekton must have extremely cool stories to tell. They are pretty old, and Nasus is a wise demigod.",
            "5, I wanna touch the scythe to see if rhaast even is that strong. I feel like I'd win.",
            "I feel like 4 is the most reasonable seat",
            "7 cause \"they're really nice, they don't bite\"",
            "Putting sylas and galio together is kinda funny since I feel like they would just cancel each other out.",
            "1",
            "7\n\n\nI'll die but it'll be straight to Valhalla",
            "I get why all of these are bad, but what’s wrong with 3? What am I missing about rumble?",
            "4 all day every day daddy kaiser can bonk me all day",
            "1",
            "I'm sitting at 7. And No I'm not explaining myself",
            "Uh why can't I sit next to kat?",
            "1 and 3 are definitely nonstop yapping the whole ride. Draven about himself, rumble about random shit",
            "SEVEN SEVEN SEVEN SEVEN SEVEN 7 7 7 7 SEVEN SVEBNSUFJAJCNSBRJ UAAAGHHDHDH... \n\nI may have feelings towards 7+ ft tall oversized demigods that could snap me like a twig...\n\n\nbark bark bark",
            "I like that gallio takes up less space than gragas",
            "jax(i need to pay college debt)",
            "FOUR",
            "realistically this flight ain't going to arrive at it's destination",
            "2. I like my window seats and I'm not 12 years old so I have nothing to fear.",
            "2. Gotta keep an eye on him.",
            "1. ask draven for autograph",
            "Ofc im sitting next to gragor",
            "even with the stupid joke jax is cursed with, he would genuinely be good company, i hate how one of the nicest and coolest guys on runeterra got his reputation stained by some subhuman trash streamers. jax is really nice he would give you boiled eggs and tell nice stories. having to deal with sylas spouting propaganda and trying to take galio's magic in the seats behind me might be annoying. as a bonus i get to watch garen and katarina try to either hide their obvious feelings or be innept at doing relationship stuff cuz they got no experience. nice 8/10 seat",
            "I'm gonna sit in 8 and ask vayne to move so I can sit next to my muscle mommy",
            "2 or 3. Draven is too unpredictable for my tastes, and the right side is essentially suicide.",
            "3, if I can't get a waterbottle through tsa rumble isn't getting his death robot. I would have plenty of room.",
            "Probably 2, jax seems cool. He would bonk the guys in front of us if they start doing something frisky and also keep making funny jokes with galio which would keep sylas silent and distand.",
            "Beside Morde (we're talking about architecture all flight)",
            "Wait, what's that stretched out on the front-back line?",
            "Definitely 2. Yes, I am sitting between Garen and Sylas, but honestly, how much do you typically interact with the seat two rows in front of you? Nit at all. None of the people next to me is actively psychotic and Jax does usually seem to be a pretty swell guy",
            "5 for sure talking to my main mid and my main jgl also they seam the most normal 2",
            "8",
            "3, unless gragas has the troll ai voicelines, then 1.",
            "6 ofc wdym",
            "Based of the comics 5 is pretty chill",
            "Am I the only one thinking that sitting next to Draven is the best one with Gragas a close second ?\n\nI mean, Draven is super talkative, I know the way to not get killed is just to listen to him and his stories for the whole flight, letting him explain why he is better and having him just gossiping on Garen trying to hit on Katarina will be so fun. \n\nIt is better than sitting between Kain, Vayne and Zed who are just going down full edgy inquisitor mod.",
            "Lemme sit next to Illaoi and Vayne. Seems chill enough. Sitting in front of gragas could be annoying though. Definitely not reclining my chair.",
            "4 looks cool",
            "8 without a doubt",
            " Next to Nasus and Renekton. Gotta keep the bros from fighting eachother…",
            "8 or 3.\n\nAt this point, theres no safe place, so you should look for someone to protect you (galio, obviously; vayne if the striker is a beast/witch and Gragas, if youre drinking with him).",
            "How BIG is that plane?",
            "4 and 8 are probably the most silent ones",
            "4.\n\nduh.",
            "Bro Gragas would be chill you would Just get beer all and Drink with gragas",
            "This plane is not landing, yo",
            "8",
            "5",
            "easily. i take the 7 and then team up with renekton against nasus",
            "3. Everywhere else looks friggin miserable.\n\n1 will have you sit next to Draven, which is already enough said, but also gives Kat ample opportunity to literally back stab you for fun.\n\nSitting between the two constantly fighting siblings Nasus and Renekton is just asking for losing your mind.\n\nGragas seems like the dude who pressures you into drinking with him, even if you don't wanna.\n\nJax would be chill, but you would also have to deal woth Sylas trying to convert you to the great rebellion.\n\nAs I see it, sitting next to Rumble is the only safe option and at Galio is the nicest dude on this plane (however he fits inside to begin with).",
            "the hell kind of plane is this that can ferry around mord and galio?",
            "2 or 6, I feel safer to the side of the guy with a lamp or the petricite colossus and the drunkard",
            "5. I would block illaoi from kassadin’s line of sight and therefore stop him from spouting racial slurs all flight.",
            "Rumble is a bless & I’ll discuss rebellious & philosophical ideas with sylas",
            "Behind garen, I can talk to jax about his glorious battles while watching garen and katarina make out ——-> 10/10",
            "I want 8. Vayne seems the type to put some head phones in and ignore every one. And Illaoi... I just think Illaoi is hot",
            "Along side hax duh!\n\n\n\nSafest option",
            "3",
            "Jax, Rumble or Gragas would probably be really funny",
            "since i’m over the age of 18 I’ll go ahead and take 2, I feel like I’m in no danger there",
            "8",
            "6 100%\n\nGalio is there to protect me or fly me down (ult) if the plane crashes AND I can get some grog off graggy? \n\n6",
            "2 since I am not a minor, 4 cuz MORDEKAISER or 5 - just two cool anti-hero cool guys",
            "3 seems like the least annoying one.",
            "Depends... is kassadin wearing a burger king crown?",
            "2. Wouldn’t be sure I survive, but at least I am entertained",
            "2 is good, and I think maybe 8 is fine.  Vayne is a psycho, but she won’t have anything against me since I’m not a supernatural creature.",
            "Seat #1 and you'll hear enough slurs to last you a lifetime",
            "6 or 7 IMO, Grag might be a fun guy and I'm really interested in talking to Nasus and Renek about the Shuriman empire",
            "2 just to make sure no child sits there",
            "2 because I'm not a child",
            "5\n\ni’ll play rock paper scissors with zed.\nbros chill",
            "5 probably.",
            "definitely next to master zed and his best student kayn, maybe even i will talk him into taking me as him student.",
            "Next to two egdelords while in headphones to block Illaoi whispering into my ear. Entertain myself by watching Kata giving Garen a stealth bj.",
            "6 obv\n\nMaybe 3\n\nDefinitely not 7",
            "I'd definetely sit next to Jax I get a window seat and I bet Jax is a pretty chill quiet dude",
            "6 or 2 are the only correct option gragas might leave you needing a new liver but you'd have fun and Jax is just gonna offer you some eggs, then tell you stories about his battles, free food and free entertainment",
            "I'm assuming gragas is gonna offer me something to drink and then probably pass out drunk. I think could be very fun! :)",
            "8. Vayne is a racist mf, but she chill. Idk about getting impregnated by gragas tho, just hope he's got no cdr",
            "Next gragor :)",
            "8 probably, hoping Vayne will keep Gragas quiet and the shadowboys will be whispering",
            "[removed]",
            "5 obv. 2 hotties 🥹",
            "If we consider everyone shrunken to proper size. Because Galio is like a skyscraper tall. I would saaay 7. Look if they can board a plane it means they passed the security check. I'll probably be fine. Plus they are among my favorite champs so yeah I am biased",
            "There is no good choice here",
            "As any respectable toplaner, I would have to seize the opportunity to try and garrote the vayne while gragas is at the bathroom. Seat 6 it is.",
            "And what would happen if I went for 4 just because being surrounded by those masked champions kinda 𝓯𝓻𝓮𝓪𝓴𝔂...",
            "I am a minor so 1&2 is not possible \nI think i would sit between the two brothers renekton and nasus and hope they can keep it calm",
            "Yes 4 gonna feel right at home there",
            "6 or 5 probably",
            "Getting drunk on grog with gragas",
            "seat number 4 pls. 20 hours to refine my racism skills",
            "3 because they won’t let rumble bring his robot on board so I’d just be sitting beside a small ass Yordle",
            "2 seems uh okay compared to the other ones.",
            "Im a minor so i sit at 2\n\n\nNah honestly rumble seems the most chill",
            "8 or 2, I want to have a window seat :3",
            "2 looks good because you’ll be besides jax but the you have to look at the cringiest couple ever in front of you.\n6 is tempting because I can maybe speak to galio but honestly gragas might be a problem.\n3 looks perfect, rumble seems like a decent guy and he can maybe teach me something about making machines",
            "1",
            "Im giving rumble a handjob",
            "2, I’m not under the age of 18 so I’m probably safe",
            "4 I am racist and a draven main so we should be friends real quick",
            "can i take vaynes seat?",
            "[deleted]",
            "me and kassadin cooking up slurs that don't even exist yet for mordekaiser's ass",
            "Honestly very considerate of him to buy two seats ",
            "Takes up more space than a 40 foot tall statue and giant suit of living armor",
            "One is for his BARREL",
            "Meanwhile the petricite GIANT Galio only takes up one",
            "Straight up. Plus you know you're getting on it if you sit with him. So im with Grag for sure.",
            "Didn't even think of that, this is the best one",
            "Yes  \nBut you'll have to handle Draven's stink.\n\nCause you KNOW his ass don't bathe. He's going to smell like a god damn Smash player.",
            "Nice ~~map~~ seat movement !",
            "Sylas and garen shouting and fighting over your head whole flight tho",
            "As long as you’re over 18",
            "Vibes like my step-dad",
            "I’m an underage girl. Is 2 okay for me?",
            "Bro they would throw hands immediately",
            "7 cause I wanna be collateral damage (crushed between them) when they inevitably go at each other.",
            "You forgot the first rule of League: do not stand between Vayne and a wall",
            "Vayne’s gotta smell unwashed, her lore has her fucking around in the middle of nowhere for a long while",
            "Asking illaoi to move is like asking the sun to shine",
            "If you truly desire to go to the bathroom, Illaoi will make you fight for it",
            "\"MOVE\"",
            "I feel like Illaoi should be fine with standing for a bit considering she's priestess of Nagakeboros the god of motion.",
            "You would not pass her test.",
            "Dude illaoi would be super chill... If you don't die after being tested. which let's face it, non of is are in motion we play league so much we go onto a league subreddit",
            "I mean, lore wise Illaoi is kinda nice so I think its one of the better options.\n\n\nNow you may end up with a broken bone or two but worth it",
            "gragas would smell and hes right behind u so idk 2 seems most chill",
            "Illaoi would stand up and walk around the moment the seatbelt sign disappears, maybe even before. Must be in motion.",
            "Dude's pounding drinks and so am I.",
            "He was nice enough to buy 2 seats, he's definitely a great dude!",
            "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^Outrageous-Elk-5392:\n\n*I'm sitting my ass*\n\n*Next to rumble and waiting*\n\n*For the plane to go down*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
            "Yo me too",
            "Ye, galio be my daddy.\n\nAlso Rumble is a cool inventor.\n\nAlso ur far away from morde, like the fathest possible.\n\nAlso I can peek at Sylas ❤️",
            "Prepare to be grossed out by… you know… pdfs..",
            "No sitting next to grag daddy pounding drinks while nasus and renek kick the back of your seat?",
            "As far as the fighting goes, Jax had taken down ascended before, he either stands a chance alongside the animal brothers, or they're all 3 screwed\n\nEdit: that was all wrong. Please ignore me",
            "While your analysis is probably correct, may I give some alternative reasonings:\n6 to drink beer throughout the flight and get shitfaced with Gragas\n8 because its sittin next to two dommy mommies. Sure, Illaoi can strangle me, but little does she know, I'm into that shit.",
            "Thoughts about 1 and 3?",
            "Wait wasn't Jax actually the strongest being ever, so much that he is prohibited to use a real weapon in the summoner's land, or else there would be no fight at all",
            "You gonna listen to him speak for 20 hours",
            "2 should be put in \"might live\" you are sitting between Garen and Sylas, you are not getting out of that flight in one piece",
            "Wai what",
            "FRRRR",
            "Logical analysis of this kind gives me a massive erection.",
            "same for the exact same reason girlie",
            "If they start fighting, they'd probably kill you by accident 😂",
            "He crashed it",
            "His tail gonna kill you",
            " No they can't, I thought this was QoL fgfgds",
            "One is a normal person with shadow powers and heavy duties, the other is a schizo.",
            "I just thought he’d be really annoying always tapping about his inventions while you just wanna chill",
            "Your comment has been removed because you have less than 0 comment karma. This indicates that you are likely either a bot or a regularly toxic user. Please contribute more to reddit by posting and commenting to get around this low threshold.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "nah jax is a bro",
            "With beer, i know where i am sitting.",
            "Homeboy probably dual wields cans of Axe body spray instead of showering and claims no one can tell the difference.",
            "Garen’s gonna be too busy making out with Kata to do anything else",
            "Sylas throwing chains at him over your seat trying to steal his ultimate",
            "i guess you should be fine as long as you are not less than 12",
            "Honestly probably the safest seat for you, just don't go to 6",
            "I’ll just ask the flight attendant to calm them down, should be fine",
            "Nah the flight attendant would ask whose pets these are then put them in the back with the rest of the pets",
            "Why ? Afraid mommy Vayne will push you up against a wall ?",
            "what if i want to though?",
            "That;s the good part",
            "Normally I would write a shitty horny story about the smell of sweat in the overalls being perfect etc. but I'm sleepy.",
            "Couldn’t stop her from taking a good bath after mission tho 💀",
            "It wasn't that urgent anyway...\n\n*shits himself*",
            "Nah she'd probably turn it into some sort of test to see if you're worthy or some shit",
            "Me and gragas are gonna empty the planes alcohol supply",
            "Good bot",
            "Yes, but ascended aren't all equal.\n\nKai'sa had killed many Voidborn, but we saw what happened when she tried with Bel'veth.\n\nNow, I'm not saying that Jax is weak, he may even be  able to fight off both brothers, but that's not confirmed.\n\nNasus and Renekton are pretty high on the Ascended power tier list as far as I remember, so defeating any ascended is not going to put you at the same level as them \n\n\nThat being said, it doesn't matter that much as all three are dead if Morde decides that the room is a little too crowded.",
            "Jax has no chance against that metal guy",
            "Main issue with 6 is just the fact I don’t want to be within arms reach of a insane bloodthirsty demigod with only a airline seat and the expectation of civility between me and eating my airline pretzels through a tube in my stomach. Which is either a blessing or curse depending on how long the recovery time is and how particularly bad the pretzels are.",
            "1: Are you seriously suggesting I sit between Draven and Kassadin? The incessant flamer/egotist and the supreme racist?\n\nReal talk Draven would be annoying AF to sit next to, and since he can’t pester the guy in front of him since there isn’t anyone… Kassadin would be fine, at the very worst he would be inanely rambling about the void and his family lost to it at best he would be a normal person. So overall probably* safe but not the best place to sit for an enjoyable flight. (*So long as Mord doesn’t do anything spooky)\n\n3: I’m not sitting where I have direct contact with an insane bloodthirsty crocodile demigod. Same goes for 6 and it’s probably worse there since I would be in arms reach. \nRumble could either be good conversation, or trying to tinker with something that as soon as turbulence hits something is exploding something. whether that something is the thing he is holding or the person across the aisle… oh wait that’s the immortal bloodthirsty crocodile demigod and now he has a vendetta against the people who just blew him up across the aisle.\nEven if Renekton wasn’t the major issue here it’s still a 50/50 as to whether the flight goes great or I have to spent half the flight picking shrapnel out of my leg and blowing soot out of my nose.",
            "Well thats the good part",
            "if it gets too tedious ill give him a mirror so he can distract himself",
            "My hope is that TSA took away their weapons, so they’d just be angry men unless sylas decides to go wizard mode",
            "When have you ever looked at who’s two rows behind you on a plane, though?  As long as you don’t draw attention to it, should be fine.",
            "Not a furry just have good taste in (animal-headed demigod) men.",
            "Down bad much?",
            "What's GP and Gragas' favorite color?  \n\n\nThat's right. Beryl. ",
            "Sylas’s gonna be too busy making out with ~~Galio~~ Galio’s magic to do anything else",
            "Unless you're a living beer bottle, you're safe around Gragas",
            "Long as they don't give him any honey fruit",
            "Where the zoo keeper",
            "Normaly i would be excited to pushed to a wall by a girl but my years of toplane experience made me see vayne anything other than a woman man fuck that champ",
            "Rest up king",
            "Pls write your story and update us after your sleep",
            "Because Vayne often goes on long trips, there are times when she cannot shower for long periods of time. When she was hunting, the somersaults she did and the recoils of her crosbow made her sweat and caused her pussy to move. The sexual fluids and sweat flowing from her vagina were flowing down her legs and covering her in the overalls. Considering that she has been hunting like this for days, she marinates the muscular plump legs, perfectly round hips and young firm breasts in that overalls with vaginal fluid and sweat. Touching and smelling the skin of Vayne, who has just come out of her overalls, is like the combination of India's finest silk fabrics with the scent of heaven. Her vagina, which has become heated due to long hunts, is already flowing fluid constantly like a wet and calm stream, and the vaginal muscles developed during her difficult hunts will milk you during sex and make you moan like a horse. The scent of Vayne, who has just returned from hunting, has a sensuality that can be described in legends.",
            "Nah, Renek can have my pretzels. And my ass if he wishes.",
            "I kind of assumed that the Front-back line indicated a dividing line, or at least some empty space.",
            "[removed]",
            "Wait so galio absorbs magic and sylas also absorbs magic. How does that work? Do they go into infinite loop or both of them have to throw hands",
            "I rested and wrote, my friend.",
            "I woke up and did it.",
            "Ain’t no way Draven isn’t sitting where everyone can see him lol. But yeah I just presumed it would be the front of the plane or empty space.",
            "Your comment has been removed because you have less than 0 comment karma. This indicates that you are likely either a bot or a regularly toxic user. Please contribute more to reddit by posting and commenting to get around this low threshold.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeagueOfMemes) if you have any questions or concerns.*",
            "Yes",
            "*hold hands",
            "I imagine they would quickly reach equilibrium \n\nMy logic being that if petricite couldn't do this, it would be an unreasonable material to work with, as the point of first contact would be destroyed before it dispersed into the rest of the structure. \n\nOf course, nullifying Sylas' petricite would probably make him throw hands anyway but that's neither here nor there"
        ]
    },
    "There's like 170 champions and this game, and we're getting a second battle bunny MF?": {
        "title": "There's like 170 champions and this game, and we're getting a second battle bunny MF?",
        "score": 2412,
        "url": "https://i.redd.it/kpwzbslsgy7d1.png",
        "content": "",
        "num_comments": 98,
        "comments": [
            "Idk wtf is happening in RIOT but for the past 6 month everything seems to be about making more money. Obv it's always the main thing a company wants to do but things are getting really absurd recently.",
            "this new 200$ skin looks exactly like the first splash but at a different angle and pose, at least the other ones changed the skin even if it was only a little",
            "RIOT only pays its bills thanks to SIMPs who play sexy champions and spend money on them. I'm sure they don't make billions of dollars, they just had to do such a dishonorable act to make ends meet.",
            "riot be like when they run out of skin ideas but in spite of this they must make the 72528th mf skin cause this is where most of their money mainly comes from lmao",
            "Isn't it the $200 mythic scam thing again?",
            "When will we ever get something as amazing as Space Groove Blitz again?",
            "The original looks so much better, I don't see the point...",
            "my boy Ryze about to hit the 1000 day club let's goooo",
            "Whales need the $200 ~~Chroma~~ Version. duh",
            "What even is the skin",
            "![gif](giphy|SOmjomEnNHsrK|downsized)\n\nRiot:",
            "Why does this look exactly like the other skin she has.\nPrestige Broken Covenant Miss Fortune",
            "Are we getting a pve event? If not, I sleep",
            "Vote with your wallet",
            "Rito can't catch a break huh?",
            "They make skins that people would buy. That’s it.",
            "I know this skinline is a long excuse so they never have to make any more skins related to vanilla Battle Bunny Riven, but I really would like them to make more Battle Bunny skins like vanilla Battle Bunny Riven.",
            "where my battle bunny bard mfs",
            "i mean, the first battle bunny mf, was kinda ass, most people didnt even realize it was a legendary. \n\nbut i guess we now know what the release skin for aurora is gonna be",
            "And I am gonna buy it like every previous gacha. Somebody needs support the game so you can keep playing for free.",
            "I have a theory that they need more themes for tft so they don't have to recycle as much so it just leads to rushed bullshit.",
            "gotta pay somehow for the leadership bonuses, layoffs werent enough.",
            "Hey Risoto is a small indie company, got to pay rent somehow",
            "Only the past 6 months? It's been like this for the past 3 years at minimum.",
            "Coincidentally 6 months ago i stopped spending money on the game as i reached over 1000 skins and even more chromas around that time, maybe they need new sources of income now that im not bankrolling them anymore (sidenote im joking im well aware im not in the 0.1% that they seem to be targetting as of late)",
            "As a current finance student, all college preaches right now is that profit is #1 goal above all else. Which, sure, but when a bunch of MBAs get involved in industries they personally don't care much about, you get the decisions riot makes where the fans are simply livestock to be milked for their income.",
            "Yup, new Seraphine legendary. Zilean still has less polygons than one of Dravens axes",
            "Everyting went to shit after the Spirit Blossom.",
            "First time?",
            "It's been that way for years, you just haven't noticed until now.",
            "I really wonder, is this greed money, or are they trying to make up for costs of Arcane, the MMO, and whatever is “changing league forever 2025” early?\n\nBecause while it could be greed, all those projects gotta be expensive as shit right?",
            "Thats because NA is so bad in e-sports, their whole e-sport marketing is breaking apart and they need more money for e-sport.   \nThats basicly it.",
            "They are making a whole new PVE event though. I get hating on Rito but they do some good stuff",
            "If onlywe have someone to keep them in check (Tencent doesn't give a shit, they're the master at predatory tactics).",
            "We're getting skins for bel'veth, rek'sai, and briar. Ignoring the faker ahri skin fiasco, I feel like they have a pretty good balance between trying to make money and making things that people enjoy. Look at how much work they've put into arena and this new pve mode. I think there's a limit they should put on prices for cosmetics, but I'm glad that they're able to get the funds to make cool content like they've been doing.",
            "Yeah, with every piece of new content I am more disappointed. I was playing, took a break, saw this post and decided thats enough of my time for this shitty company for the day",
            "U gotta face it, why listen to us enjoying a free to play game when Korea be like: oh that ahri though. money talks u know. I'd listen to my sugar daddy too if i had one",
            "Only for the past 6 months? Feels like it's been down that spiral further and further for the last 6 years",
            "Gotta fund the MMO that they canceled and are redoing.",
            "Late stage capitalism smth smth",
            "Massive losses from 2020-2021 across the entire company. Riot isn’t the only company who made business decisions during the pandemic that has not made back its investments which has led to more corporate greed and panic.",
            "with addition of ears that look like tiny tina",
            "They might as well make more 500$ skins, fuck it at this point.",
            "I am one of them. Tryharded the eve battlepass for thé prestige like one week before she got nerfed to thé ground",
            "But like have you looked at urgot?",
            "How dare they use sound marketing strategies ?...",
            "Not really a scam when you are getting and are aware of exactly what you are paying for.\n\nIt's ripoff for sure, but scam would imply illegality when in reality it's just annoying.",
            "Yes",
            "when we will fucking buy them more than sexy bunny outfits",
            "Or space groove gragas",
            "Simps",
            "We are getting a PvE event ",
            "this implies you either only play/seen gun goddess or you've never played miss fortune\n\nthe animation difference between base fortune and battle bunny is leagues apart",
            "yes so the second one is 200usd, line up lil pay piggies! 😏",
            "Underrated comment",
            "i doubt it considering they're more than willing to just straight up make their own models/characters for tft.",
            "Considering TFT is willing to make models and take Themes from LoR Cards I doubt that. Set 13 is already set in stones anyways and Mort also confirmed they're working till set 15.",
            "not a theory, it’s been like this since shortly after TFT launch, when they started releasing skinlines with 4-5 champions per batch consistently.\n\nthere is a mort post somewhere saying they NEED that for TFT",
            "And for the sexual harassment lawsuits haha",
            "Ever since riot was sold to tencent",
            "A happy cow produce more and better milk than a starved sad one. \n\nhttps://www.allaboutfeed.net/home/happy-cows-produce-more-milk/\n\nSpoiler alert: this also applies to consumers. I dont know if they teach that at your MBAs but they should.",
            "Sad but true 😔",
            "Of course they would be expensive but the main costs would still most likely be in the pockets of higher ups and not actually going into content",
            "Yeah, and it will be in the game for like 3 weeks. The shitty mtx are here forever.",
            "Let's be real, you namedropped the 3 hottest ladies in league",
            "All I'm hoping is they're using it in the mmo",
            "Also Seraphine Legendary is a bit meh, since she has a ultimate skin, but since she has not legendary it's comprehensive, and Aatrox legendary literally everyone wanted that shit so it's a big W.\n\nThey gave legendary skins to champs without legendary, it's good enough, although giving prestiges to Yuumi and Leona that already have while there's champs in the skinline without a single prestige it's lackluster.",
            "Who said they wouldn't?",
            "Samesies. One of my bigger monetary regrets in gaming. I loved Eve and was so excited for a prestige. It even got me playing jungle more. Now she’s trash.",
            "i would be a good employee in the sales team",
            "Well if we really want to get technical then if it's that gacha bullshit again then it's technically illegal in my country as they would have to comply with all laws regarding gambling, which they obviously don't do. That being said all other gacha games are breaking the law here as well, the government just doesn't care.",
            "Ok yes but it's a scam",
            "This is mega cope, it’s a scam.",
            "It literally is illegal in a lot of countries they're doing it in.",
            "The common simp doesn't have the taste in skins for such masterpieces as space groove blitz and crank, or perhaps moo cow Alistair... Or, by jove, even corporate mundo",
            "hey im not saying the skin is below standard, like samira. \n\nbut between the myriad of skins mf has, and the 3 coloured gungoddes that  strikes a similar scy-fi vibe than battlebunny \n\nshe didnt get that much attention.",
            "They did 2 nonplayable characters this set, Kabuko and Alune. Most times it is one character, but not every set. And I have to assume they existed somewhere before TFT. It's still a lot easier to use existing character models.",
            "I mean \"themes\" more in terms of in-game character models they can just pluck. They can't just takes models from LoR and put them in TFT for obvious reasons.",
            "So 2011?",
            "Nah not really. The ideal pin point in fair competition without price collusion is where consumer surplus is at a sweetspot and so is producer surplus... AKA consumers aren't fully drained of all income for maximum profit, yet this is still overshadowed by the maximum profit mantra",
            "I mean, if everyone buys mf skins and no one buys ivern skins, what would make the cows happier, a new mf skin or a new ivern skin?",
            "What's so shitty about a mf skin? Or is it one of those 200€ chromas?",
            "2/3 of those champs don’t even have feet, no way riot makes money off this batch of skins",
            "Honestly seraphine's ultimate skin isn't that good imo. The only ultimate thing about it is that there's 3 different versions of it; each individual skin is alright but not amazing. I'd have to see the legendary before passing judgement on it, although I'd agree based on splash that it doesn't look amazing or anything.",
            "Isn't it banned in Belgium?",
            "Just to play devils advocate, it's not actually. \n\nLeague's system ensures that after X amount of capsules, you will guarantee get a specific reward, you just also have a chance at a reward sooner rather than that specific X amount. This makes it so that, by technicality, it's not \"true\" gambling. It's scummy, but it's objectively different than lotteries and pure gambling which are guaranteed to make the player not gain anything in the long run. It's essentially advertised as a 200$ item with a chance to get it for less.\n\nAs well, lootboxes are a decade and a half old now starting with TF2 and it's unusuals and crates. Unless Valve, Ubisoft, Supercell, Blizzard or literally any other video game company has action taken against it, Riot won't either, especially considering Riot somehow has the least predatory version of lootboxes due to the guaranteed reward.",
            "Fair but to say you couldnt tell it was a legendary made it sound like you thought it was worse than her base animations",
            "Kabuko was brand new for tft I believe, idk if the alune model was from somewhere",
            "2015.",
            "Pretty sure it is a mythic variant yes.",
            "Reksai has feet and they are the best in the game. ",
            "As far as I’m aware it’s just completely random lootboxes that are banned like with Fifa. Stuff like this that has a pity system (you get the skin at 30 capsules) are considered fair game and the cost of the 30 capsules are just considered the price, the potential to get it earlier is just a nice little price cut.",
            "I believe it technically is in most EU countries they just don't enforce it.",
            "It was 2011",
            "Bro, maybe get your facts right.",
            "Rip",
            "If only they did fk that",
            "Few years ago there were talks about banning the gacha practices in the EU as a whole but apparently the EP is more concerned about spying on its own citizens (looks at the new chat control law they are considering) than protecting them."
        ]
    },
    "When professor rito accidently added extra ingredients to the new champion's kit": {
        "title": "When professor rito accidently added extra ingredients to the new champion's kit",
        "score": 97,
        "url": "https://i.redd.it/rnmydm8l638d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Don't forget cooldown reset/reduction on kills !",
            "She and galio Will be very fun together",
            "Place yer bets place yer bets! Will it be absolutely broken on release and 2 months after it gets hard nerfed to be a forgotten champion or is this Riot's new favorite and be strong in the upcoming 2 years? Place your bets ladies and gentleman!",
            "When you think about it then her W is pretty much Kha'zix' R.\n\nBut with resets.",
            "a fucking stealth reset ughhhhhhh"
        ]
    }
}