{
    "Patch 14.12 Bug Megathread": {
        "title": "Patch 14.12 Bug Megathread",
        "score": 38,
        "url": "https://www.reddit.com/r/leagueoflegends/comments/1de336v/patch_1412_bug_megathread/",
        "content": "Greetings Summoners!\n\nWith every new patch Riot introduces to balance out champions and items there are some unforeseen issues that creep up and cause disruption during gameplay. We have noticed that these issues which eventually get fixed clutter up the subreddit immediately following the patch.\n\nWe want to avoid this by having a single Megathread which will be posted after every patch so that you guys can report the various issues in one place. This allows Riot to easily keep track of the bugs by providing a central hub and also allows other users to confirm that they might have encountered.\n\n**Note only bugs caused by the** [14.12](https://www.leagueoflegends.com/en-gb/news/game-updates/patch-14-12-notes/) **Patch should be reported below.**\n\nPrerequisites to be noted before reporting a bug\n\n***\n\n1. A bug will ideally be accompanied with a screenshot or a video. This provides credibility to your report.\n2. Steps to recreate the bugs should be submitted if possible. This helps Rioters recreate the bug and helps them find the cause behind it.\n3. The bug must have been caused by the latest patch.\n\n***\n\n**Format when reporting a bug:** When reporting a bug, please provide as much information as you can about your computer.\n\n• **Server**: The server you encountered the bug (NA, EUW, EUNE, TR, RU, BR, LAS, LAN etc)\n\n• **Type of Bug**: Client Bug, In Game Bug etc\n\n• **Description**: Describe what was the bug that occurred.\n\n• **Video / Screenshot**: Insert screenshot (F12 in game) or Video of the bug occurring.\n\n• **Steps to reproduce**: Provide the steps necessary if someone else had to reproduce the bug.\n\n• **Expected result**: What should have been the result when you follow the steps mentioned above.\n\n• **Observed result**: What was the result you obtained when you followed the steps mentioned above?\n\n• **Reproduction rate**:  If you try to recreate the bug how successful are you in causing it to occur? (1/10: Occurs once every 10 tries, 5/10: Occurs 5 times out of 10, 10/10: Happens every single time)\n\n• **System specs**: Processor, Video card, Ram, HDD/SSD, everything you can provide, even drivers.\n\n***\n\n**Example Bug**:\n\n• Server: EUW\n\n• Type of Bug: In-Game Bug etc\n\n• Description: Zed's R (Death Mark) does not apply secondary damage\n\n• Insert Video / Screenshot of the incident\n\n• Reproduction rate: 2/10 (happened 2 out of 10 times)\n\n• Steps to reproduce:\n\nLaunch a game after selecting Zed as your champion. Attempt to use Death Mark. Observe the result.\n\n• Expected result: The damage should apply after a short delay, amplified by damage dealt during the effect.\n\n• Observed result: The damage will not apply properly.\n\n• System Specs: Intel i5 Processor, Windows 7, Nvidia Graphics card (insert model number) etc.\n\n***\n\n[**If you don't know how to format comments on Reddit click here**](http://www.reddit.com/r/leagueoflegends/wiki/formatting)\n\n***\n\n    - **Server:**   \n    - **Type of Bug:**   \n    - **Description:**   \n    - **Video / Screenshot:**   \n    - **Steps to reproduce:**   \n    - **Expected result:**   \n    - **Observed result:**   \n    - **Reproduction rate:**   \n    - **System specs:**  \n\nCopy paste the above code and fill in your details.\n\n***\n\nFrom this Megathread the list of bugs will not be summarized and put up in the main body of the thread, however, note that many Rioters are going through every single comment so don't worry if you post the 1500th or 3000th comment, every reply will be read over the next few days.",
        "num_comments": 132,
        "comments": [
            "- **Server:** EUW  \n- **Type of Bug:** Game Client/Website   \n- **Description:**   When trying to look at the patch notes either in the in-game tab or on the website, it switches to Czech language instead of my native english. I have checked my IP address location which is also it britain and any other website is fine, additionally the rest of the client is in english.\n- **Video / Screenshot:** https://prnt.sc/O6E4hUMylR0w Google Result for the patch notes webpage showing english text.\nhttps://prnt.sc/VxQxIYt9l4mI official patch notes webpage in czech\nhttps://prnt.sc/86QDrx8vwaLi in game tab in Czech, rest of the client in english   \n- **Steps to reproduce:** Access the website version from the UK or the tab in the client   \n- **Expected result:** The patch notes to be displayed in English   \n- **Observed result:** The patch notes being displayed in Czech   \n- **Reproduction rate:** 100%   \n- **System specs:** Ryzen 5 2500u, 20gb DDR4 RAM, 1TB HDD, Win10",
            "- **Server:**  NA  \n- **Type of Bug:** Game Client   \n- **Description:**  After end of each game, the client begins to slow down. After each game there is a cumulative increase in load times for: end game screen, from end game screen to rest of the client(home/matchmaking/store/etc..., future champ selects start to lagg. The lagg in champ selects after 3-5 games accumulates the lagg that it can take as long as 5-15 seconds when switching your ban picks or champ select picks, also it effects the load times for switching summoners spells and opening up rune page to edit them. Given how one has only 30 seconds to pick a ban, if you mistakenly wait too long it will be impossible to ban a champ. Also, this lagg effects the input for 'lock in' champ which can boot you out of the lobby because due to late champ selection the game cannot receive the input for 'lock in.' Another note: while observing in champ select lobby, and you're lagging, when switching between champ picks/bans very fast ( 0.25 - 0.5 seconds or faster, normal type for switching) the game client will provide an error message of some sorts that says along the lines of \"could't load or couldn't connect or couldn't complete action.\" I observed the best temporary solution is to close client and re-logg between games. This is an ongoing problem since 14.11 and is still an issue on 14.12. The problem is exactly the same as it was in 14.11.  \n- **Video / Screenshot:**   \n- **Steps to reproduce:**  Play 1 matchmaking, observe. Don't log off, play 2nd matchamking game, observe. Don't log off. Repeat until the lagg is impossible to deal with.  \n- **Expected result:**    No lagg in the above mentioned scenarios/menus\n- **Observed result: Compounded lagg**   \n- **Reproduction rate:** 100% but it takes a lot of time to reproduce (assuming 5+ games and not re-logging between them.)   \n- **System specs:** WIN 10.0.19045 Build 19045 Pro N,  B760 AORUS Elite AX, i7-13700k, UHD Graphics 770, NVIDIA Geforece GTX 1080.",
            "Server: NA\n\n  \nType of Bug: Vanguard, Can't load into game\n\n  \n I've been getting vanguard event errors for about 2 weeks now. It's the exact same thing. **Vanguard Event: You need to have vanguard running to play.** I've gone through Riot Support, but not only have they offered me no solution, but the solutions that they have been offering me are just a timeline of solutions they've offered other players. \n\n  \nScreenshot: [https://prnt.sc/VxEx\\_\\_OUdRoR](https://prnt.sc/VxEx__OUdRoR)\n\nSteps to re - produce: Unknown.  This happens randomly. A few things that have been known to cause this issue for me is to leave my client open for an extended period of time, or to disconnect while waiting to join a game,\n\n\n\nExpected result: Load into game without any issues.\n\nObserved result: Am given that error code as soon as I load into the game, causing me to have to restart my computer. By the time i've rejoined, the game has already been remade & I have been given a penalty. \n\nSystem specs: Geforce GTX 1080 (GPU), AMD RYZEN 5 5600X 6 - Core Procceser (CPU)",
            "    - **Server:**  OCE  \n    - **Type of Bug:**   Dodging champ select/client being extremely slow/disconnecting\n    - **Description:**   The client keeps being extremely laggy/slow and then I get force disconnected when I get into champ select. Sometimes it gets stuck on 'match accepted' then I get force dodged and the client exits. Wtf is going on?\n    - **Video / Screenshot:**   \n    https://imgur.com/a/rEre34v\n    \n    - **Steps to reproduce:**   \n    I have no idea it just happened ever since the latest patch\n    - **Expected result:**   \n    Getting into a game normally and not having the client disconnect every 5 seconds\n    - **Observed result:** \n    ?  \n    - **Reproduction rate:**  \n    100% \n    - **System specs:**  \n    Ryzen 5600X, GTX 3070, 32GB Ram, 1 TB SSD, etc",
            "• **Server**: OCE\n\n• **Type of Bug**: Client and Game Functionality (especially for ARAM mode)\n\n• **Description**: The client does not load as it should. Even if the client does launch normally, I could get stuck at the ready-check page after accepting the game. We are unable to enter the champion select lobby, although the system seems to think we are in the game, as it proceeds to launch after the champion select countdown ends. Also the game frequently freezes at the champion select screen. Specifically, in ARAM champion select lobbies, we are unable to swap champions, select runes, or edit summoner spells.\n\n• **Steps to reproduce**: launch the client and queue up for an Aram game in Sydney Australia using the Optus internet\n\n• **Expected result**: being able to launch the LoL client and play the game with no issues \n\n• **Observed result**: stuck at the ready-check screen, after I restart my computer I was able to get into the champ select lobby however, there was a prompt says\"lost connection to server\" which resulted me being unable to swap/pick champions on bench and edit runes/summoner spells \n\n• **Reproduction rate**: 10/10 happens to every ARAM game\n\n• **System specs**: Ryzen 7 2700X eight-core processor, 16gb, Nividia Gforece RTX 2060, Win10",
            "Vanguard is fucking pissing me off. Not only does it not start sometimes, and on accident I queue game and I do not load in, suffered 5 games of -LP this time, Riot's leaverbuster solving the greatest problem of this game, it also does not show anywhere it is not loaded. So i have to start practice game in hope that game works.\n\nBut this fucking time it kicked me right out of the game. Derpaderp Vanguard is not running derpaderp. Anus program.",
            "- \\*\\*Server:\\*\\*   OCE\n\n- \\*\\*Type of Bug:\\*\\* Client does not load, shows spinners\n\n- \\*\\*Description:\\*\\*  \n\n- \\*\\*Video / Screenshot:\\*\\*   [https://pasteboard.co/kaeAPu9jTg9I.png](https://pasteboard.co/kaeAPu9jTg9I.png)\n\n- \\*\\*Steps to reproduce:\\*\\*   Run League\n\n- \\*\\*Expected result:\\*\\*   \n\n- \\*\\*Observed result:\\*\\*   \n\n- \\*\\*Reproduction rate:\\*\\*   Always\n\n- \\*\\*System specs:\\*\\*  12600K, RTX 3080, 32 GB RAM.",
            "- \\*\\*Server:\\*ANY SERVER/EUW\\*   \n\n- \\*\\*Type of Bug:\\*INGAME\\*   \n\n- \\*\\*Description:\\*Lulu knockup is affected by tenacity\\*   \n\n- \\*\\*Video / Screenshot:\\*https://www.youtube.com/watch?v=qoR7PqxEakA\\*   \n\n- \\*\\*Steps to reproduce:\\*Buy tenacity> lulu ults > u dont get knocked up by the full duration\\*   \n\n- \\*\\*Expected result:\\*Be knocked up for 1 sec because its a knock up\\*   \n\n- \\*\\*Observed result:\\*Not knocked up for 1 sec because its affected by tenacity\\*   \n\n- \\*\\*Reproduction rate:\\*10/10\\*   \n\n- \\*\\*System specs:\\*N/A\\*",
            "Server: Vietnam 2\n\nType of bug: Reconnect Bug\n\nDescription: Launch League everything looks good. You queue a game land in champion select pick/ban choose your runes and when the game goes to launch you land at a reconnect window. No matter how many time you smash the reconnect button you are now in the reconnect loop.\n\nScreenshot: [download\\_1.jpg (319×158) (discordapp.com)](https://cdn.discordapp.com/attachments/929711119998804033/1243928855773708298/download_1.jpg?ex=66534286&is=6651f106&hm=d6676311a44b2ad05969038757969c9b18adaae76c1ca805c593b2b7c5bbd365&)\n\n**Steps to reproduce**: Install vanguard, play any type of game (aram, normal or even custom game)\n\n• **Expected result**: The actual game launching after champion selection.\n\n• **Observed result**: The game doesn't launch at all, I lose LP and get panalties.\n\n• **Reproduction rate**: 10/10",
            "• **Server**: EUNE\n\n• **Type of Bug**: Client Bug\n\n• **Description**: Hall of Legends - Claiming a reward, trying to watch the next rewards, literally anytihng my client goes black \n\n• **Video / Screenshot**: [https://www.imgshare.pl/img/SJBb](https://www.imgshare.pl/img/SJBb)\n\n• **Steps to reproduce**: Open the client - Goes to Hall of LEgends , tryto check the rewards, and its gone \n\n• **Expected result**: To see the reward list, to claim the ones i have, and then peacefully try to play the game without the need of restarting the client ? \n\n• **Observed result**: Darkneesssssssss\n\n• **Reproduction rate**: 10/10, would recreate is anytime of the day \n\n• **System specs**: R5 5600x, 3060Ti, DDR4 32gb, 1TB SSD, Latest Win 11",
            "- \\*\\*Server:\\*ALL SERVERS EUNE/EUW/NA/OCE ect.\\*   \n\n- \\*\\*Type of Bug:\\*INGAME\\*   \n\n- \\*\\*Description:\\*Lulu ult doesn't cc if an enemy dash has been canceled\\*   \n\n- \\*\\*Video / Screenshot:\\*https://www.youtube.com/watch?v=ekG72pyIQyA\\*   \n\n- \\*\\*Steps to reproduce:\\*Cancel a incoming dash with Lulus ultimate\\*   \n\n- \\*\\*Expected result:\\*Dash is canceled enemy CANT move or cast abilities\\*   \n\n- \\*\\*Observed result:\\*Dash is canceled but enemy CAN move and cast abilities\\*   \n\n- \\*\\*Reproduction rate:\\*10/10 works with every dash in the game\\*   \n\n- \\*\\*System specs:\\*N/A\\*",
            "    - **Server:** EUW/Any server \n    - **Type of Bug:** In-Game Bug\n    - **Description:** Ryze's Q and E sometimes disappear. The cooldown is updated, the Q/E shoots but disappear mid-air. The E sometimes also does not spread correctly, same for the Q if the target is fluxed. More info in the r/RyzeMains subreddit.\n    - **Video / Screenshot:** https://clips.twitch.tv/SarcasticWanderingLardMikeHogu-I5OtQpzO7cdmOZLS (not mine, also more in r/RyzeMains)\n    - **Steps to reproduce:** Pick Ryze and use Q/E, as well as Q a fluxed ennemy.\n    - **Expected result:**   They should be damaged by Q/E, be fluxed if E'd, the E should spread and the Q should be spread if the target is E'd. It happens only sometimes, but fairly often in some games.\n    - **Observed result:** Ryze's Q and E sometimes disappear. The cooldown is updated, the Q/E shoots but disappear mid-air. The E sometimes also does not spread correctly, same for the Q if the target is fluxed. More info in the r/RyzeMains subreddit.\n    - **Reproduction rate:** 1/10?\n    - **System specs:** R9 270x/Ryzen 2200g (should be irrelevant?)",
            "**Server:** EUW\n\n**Type of Bug:** Client\n\n**Description:** Client stuck on \"game still in progress\" after exiting arena game \n\n**Video / Screenshot:** N/A\n\n**Steps to reproduce:** Exit Arena game \n\n**Expected result:** Access to client and ability to requeue \n\n**Observed result: **  Client unusable because \"game still in progress\". Have to reboot client \n\n**Reproduction rate:** 5/10 games\n\n**System specs:** Windows 10 AMD Ryzen 5",
            "There's this bug where every single game has someone smurfing or someone cheating. It's been going on for like 12+ seasons now. Would be cool if you guys worked on this bug because I'm starting to think you guys think of it as a feature.",
            "* **Server:** EUW\n* **Type of Bug:** Game Client/Game\n* **Description:** After champ select, the game takes a bit longer to show the loading screen than usual since last week (time of writing this, 17/6/2024), by the time it shows the loading screen everyone is like at 90% of loading into the game. The problem lays when many times it doesn't even open the game even tho i have the  app \"open\" in the task bar. If i hover my mouse over the game it will not show any screen just as if its bugged with the title of the app with no image. It forces me to open task manager and force end the game, and to do that i basically need to force end every single league related apps, including the client, and for some reason i have like more than 4 same apps of league open in the task manager ( idk if that is normal but i never notice it before) [https://prnt.sc/oXQeS3AzFR46](https://prnt.sc/oXQeS3AzFR46) ; [https://prnt.sc/5sKrKVwtiem1](https://prnt.sc/5sKrKVwtiem1) ( idk if has any relation to it). \n* The game loads in for everyone else but not for me, i am marked as AFK and many times they remake and i get penalized for it. I had a ban of 24 hours from playing the game because of it just three days ago. \n* **Video / Screenshot:**  Not had the ability to record it nor take a print screen yet but will update this post eventually if anyone will need actual preview of what is happening. It happens randomly unfortunately and i can't control it.\n* **Steps to reproduce:** Game randomly does it going in to loading screen.\n* **Expected result:** Game doesn't load up or show image (screen is non existent many times and sometimes the screen is just black with a loading window mouse icon showing)\n* **Observed result:** I had downloaded porofessor two weeks ago to use it but eventually swapped for blitz app, after having blitz installed thats when everything started to bug out. But when i had blitz installed everything was worse, i had a black screen the whole time of the loading screen and i would hear the game enter and all of the sounds of the game but there was no image. Force ending the game and reconnecting would not work. Eventually i deleted the app and the issue that i originally mentioned above started to happen. \n* **Reproduction rate:** Random times, but i would say 3/10 games it happens.\n* **System specs:** Ryzen 7 3700X ; DDR4 16GB ; RTX3600 Ti",
            "**Server:** EUW\n\n**Type of Bug:** Client\n\n**Description:** Can't select champion in Arena, get booted and receive leaver penalty \n\n**Video / Screenshot:** N/A\n\n**Steps to reproduce:** Try ban champ in Arena, doesn't work, client freezes on ban screen until booted from game \n\n**Expected result:** Ban champ and not receive a leaver penalty \n\n**Observed result: **  Get progressively worse leaver penalties and can't play the game.......\n\n**Reproduction rate:** 2/10 games\n\n**System specs:** Windows 10 AMD Ryzen 5",
            "• **Server**: EUW/EUNE\n\n• **Type of Bug**: LOADING SCREEN\n\n• **Description**: RANKED BORDERS DON'T WORK IN ARAM OR NORMAL 5V5 GAMES\n\n• **Video / Screenshot**: NOPE\n\n• **Steps to reproduce**: GO INTO LOADING SCREEN IN ANY BUT RANKED GAMES\n\n• **Expected result**: RANKED BORDERS/BANNERS WORK\n\n• **Observed result**: NOBODY HAS BORDERS SHOWN\n\n• **Reproduction rate**: 10/10\n\n• **System specs**: IRRELEVANT\n\nBEEN OVER A MONTH NOW. CMON",
            "● server: EUW\n● Type of bug: vangaurd related\n● Description: after i got into a game 1 second after loading the following message poped up: you need to have vangaurd running, i kept on Dissconecting and reconnecting but it did'nt fix the issue, i had vangaurd on my laptop since it release mounths ago and this is the first time i run into an issue with it",
            "• **Server**: EUW\n\n• **Type of Bug**: Client Bug\n\n• **Description**: Mythic shop wont update\n\n• **Video / Screenshot**: [https://prnt.sc/1Lqx8TDDj-6e](https://prnt.sc/1Lqx8TDDj-6e)\n\n• **Reproduction rate**: 10/10: Happens every single time)\n\n• **System specs**: I7-14700KF, RTX 4070 Ti, 32GB 5600mz DDR5 RAM, KIngston KF556C36-16",
            "• Server: EUW\n\n• Type of Bug: Game Client\n\n• Description: Unable to reclaim all the items after purchasing 100 level of event pass\n\n• Insert Video / Screenshot of the incident\n\n• Reproduction rate: 10/10 Continue to occur\n\n• Steps to reproduce:\n\nBuy the signature ahri bundle and proceed to the event pass section, then click on the button to reclaim all prizes.\n\n• Expected result: Receiving all items.\n\n• Observed result: Only receiving 9 items from the event, unable to click any further.\n\n• System Specs: \\*N/A\\*",
            "    - **Server:**   NA\n    - **Type of Bug:**  Unable to join game and punished as a result   \n    - **Description:**  Loading the game it says Vanguard must be running to play League, I restart the client and it then tells me I must restart my PC. By the time I've done this, the game has been forfeited due to me being AFK\n    - **Video / Screenshot:**   \n    - **Steps to reproduce:** Attempt to play\n    - **Expected result:**   \n    - **Observed result:**   \n    - **Reproduction rate:**   \n    - **System specs:**",
            "    - **Server:** EUW\n    - **Type of Bug:** Item-champ interaction\n    - **Description:** Udyr procs Hexplate on his basic UNEMPOWERED ability casts, rather than only the empowered ones as it should (and as it used to do a for a couple of patches)  \n    - **Steps to reproduce:** Load into game as udyr. Buy hexplate. Use any abiliy, WITHOUT empowering it\n    - **Expected result:** Hexplate does NOT trigger and does NOT go on CD or apply its effect\n    - **Observed result:** Hexplate triggers, applies its effect and goes on CD\n    - **Reproduction rate:** 100%",
            "Server all  \nclient bug  \nCan´t login due to hcaptcha but whenever i try to fulfill it either doesn´t load and autofails or loads i fulfill one and then it autofail. (Always a message we failed to verify hcaptcha)  \nCan´t login to multiple accounts  \nExpected results: being able to log in to my account  \nObserved results: hcaptcha keeps failing.  \nReproduction rate 10/10",
            "    - **Server:** SG\n    - **Type of Bug:** In-game bug\n    - **Description:** 300+ms from patch 14.10. Ping is A-OK on EUW server, i.e. 170ms avg. All my friends have this issue, different ISPs. Haven't been able to play league on my main account for a month now, and now I am gonna miss the Faker event because of this high ping issue. I don't want to greif people with this ping. Please Riot, fix this issue. Regards.\n    - **Steps to reproduce:** Start Riot client. Put in credentials. Start a practice tool game or normal game.\n    - **Expected result:** 120ms avg\n    - **Observed result:** 300+ms avg\n    - **Reproduction rate:** 100%\n    - **System specs:** Intel Core i5-13400, Windows 10 ver 22H2, Palax Nvidia Geforce RTX 4060Ti 8GB, 32 GB RAM, Game is installed on Sata SSD.",
            "Noticed a pattern:\n\n* **Server:** EUNE\n* **Type of Bug:** Game Client\n* **Description:** Everytime I ban Ahri in the post-game lobby I get stuck at \"Skip waiting for stats\" screen.\n* **Video / Screenshot:** dont have can provide though\n* **Steps to reproduce:** Ban ahri, play game - wait for the end and you will be stuck at \"Skip waiting for stats\" screen\n* **Expected result:** Ablel to access post-game lobby\n* **Observed result:** Can´t get to post-game lobby\n* **Reproduction rate:** 100%\n* **System specs:** i7, RTX 2070, 32 gb RAM, 1T SSD, Win 10H",
            "Heartsteel displays random number for 5 patches or more",
            "• Server: NA\n\n• Type of Bug: In-Game Bug \n\n• Description: input delay and abilities not being used in the direction they were cast\n\n• Insert Video / Screenshot of the incident: [https://youtu.be/mkHkp6I6-Rg](https://youtu.be/mkHkp6I6-Rg)\n\n• Reproduction rate: 2/10 \n\n• Steps to reproduce: Not exactly sure when, but during moments when multiple abilities are pressed in quick succession and/or with high cursor speed\n\n• Expected result: Abilities should be casted and used in the direction of the cursor\n\n• Observed result: Abilities goes in a direction direction that my cursor was previous at\n\n• System Specs: Intel i7 Processor, Windows 11, Nvidia Graphics card RTX 4060 Laptop GPU",
            "• **Server**: Every server (I'm playing on EUNE, EUW)\n\n• **Type of Bug**: In Game Bug\n\n• **Description**: Game is stuttering and lagging. It feels like 15 fps despite saying 150 fps or more. Also fps is locked to 60 without v-sync on. Sometimes ALT + Tab helps to fix it for a minute or two, but then goes back to locked 60, and when it will hit something above, for example 70 it starts to lag a lot. It's happening for a really long time, I would say that about a year. I formatted my PC twice already.\n\n• **Steps to reproduce**: Just play the game.\n\n• **Expected result**: Game working normally, without any lags.\n\n• **Observed result**: Game lagging despite high fps.\n\n• **Reproduction rate**: 10/10 happens every time\n\n• **System specs**: Ryzen 5 2600x, GTX 1070, 16GB DDR4, Game installed on SSD, newest Nvidia drivers",
            "    - **Server:**              EUW \n    - **Type of Bug:**          vanguard \n    - **Description:**         keep getting van 84 error even after restarting and re installing vanguard\n    - **Video / Screenshot:**   https://prnt.sc/XMspq0dl4oyY",
            "    - **Server:**   NA\n    - **Type of Bug:**   Augment Bug\n    - **Description:**   Leona q cd not reduced by mystic punch\n    - **Video / Screenshot:**   n/a\n    - **Steps to reproduce:**   take mystic punch (had it as first augment)\n    - **Expected result:**   Pressing q, then autoing should reduce the q cd with mystic punch\n    - **Observed result:**   autoing with mystic punch does not reduce the q cd (neither normal autos or the q proc auto)\n    - **Reproduction rate:**   100% of the times in the single game we had it\n    - **System specs:**  n/a",
            "* **Server:** NA\n* **Type of Bug:** Augment-Champion Interaction\n* **Description:** The Vulnerability Augment doesn't proc anymore on Smolder's Q 225 Stacks True DMG DoT.\n* **Video / Screenshot:** None right now, will try to get one, but its visible in the LOLalytics app under recommended augments, from patch 14.11 to 14.12 it has gone down a lot.\n* **Steps to reproduce:** Select Silver Vulnerability Augment on Smolder and have at least 225 Stacks of his passive.\n* **Expected result:** Critical Strikes of his true dmg burn \n* **Observed result:** No critical strikes on his true dmg burn\n* **Reproduction rate:** 100%\n* **System specs:**",
            "- **Server:** NA   \n- **Type of Bug:** Loading Screen\n- **Description:** Upon loading into any form of the game, a solid 60% of the time I get a critical error. Tried every step from Riot Support. Even tried reinstalling Windows. Nada. Sometimes I can restart my computer and have a successful load in before I get a leaver buster, been losing a lot of lp though.   \n- **Video / Screenshot:** Windows error  \n- **Steps to reproduce:** Go through champion select -> A critical error has occurred.   \n- **Expected result:** Load into game with no crashes \n- **Observed result:** Can not load into game. Critical error appears. \n- **Reproduction rate:** 60%ish   \n- **System specs:** Ryzen 7 3700X, 32gb DDR4, RTX 3070, 1TB SSD, Windows 11",
            "grammar error, missing quotation on hide on bush ward in the pass.",
            "- \\*\\*Server: EUNE\n\n- \\*\\*Type of Bug: In Game Bug   \n\n- \\*\\*Description: When playing Arena if you play with Viego and you have the item \"Talisman of Ascension\" on cooldown, if the round ends and you are currently a different champion using your passive, the \"Talisman of Ascension\" cooldown does not reset.\n\n- \\*\\*Video / Screenshot: None\n\n- \\*\\*Steps to reproduce: Pick Viego, have Talisman on cooldwon, and when the round ends and you return to the carusel just be another champion you killed.\n\n- \\*\\*Expected result: Reset it\n\n- \\*\\*Observed result: Doesn't reset it\n\n- \\*\\*Reproduction rate: 10/10\n\n- \\*\\*System specs: I highly doubt it matters.",
            " **Server**: NA\n\n• **Type of Bug**: Arena augment\n\n• **Description**: Skilled Sniper only refunds the cooldown of long range abilities once per round.\n\n• **Video / Screenshot**: [https://medal.tv/games/league-of-legends/clips/i3wNIyLfWhZmh\\_hQ8/d1337r88ht0v?invite=cr-MSxETm4sMjA1NzIzMDI4LA](https://medal.tv/games/league-of-legends/clips/i3wNIyLfWhZmh_hQ8/d1337r88ht0v?invite=cr-MSxETm4sMjA1NzIzMDI4LA)\n\n• **Steps to reproduce**: Select Skilled Sniper as an augment. Land an ability at > 700 range twice. The first cast will refund as it should. The 2nd cast will not.\n\n• **Expected result**: All abilities that land at a range of over 700 should either be set to a 0.5 second or 3 second cooldown depending on if it is a damage over time ability.\n\n• **Observed result**: The second cast did not get refunded at all.\n\n• **Reproduction rate**: It worked properly in the first round, but after I purchased Blackfire Torch, it never worked again. 100% reproduction rate after Blackfire purchase.\n\n• **System specs**: Intel(R) Core(TM) i7-10700K CPU @ 3.80GHz, 3792 Mhz, 8 Core(s), 16 Logical Processor(s), Nvidia RTX 3080, 16 GB RAM, SSD",
            "*  **Server:** EUNE\n* **Type of Bug:** In game bug on Arena\n* **Description:** Warwick's W cooldown is not reduced by plants\n* **Steps to reproduce:** Pick Warwick on arena, have W on cooldown and hit a plant\n* **Expected result:** W's cooldown is reduced\n* **Observed result:** W's cooldown is not reduced\n* **Reproduction rate:** 100%",
            "- \\*\\*Server:\\*\\*   Any  \n- \\*\\*Type of Bug:\\*\\*   In Game  \n- \\*\\*Description:\\*\\*     \n  \nIn Dragon Form, when hitting multiple champions with Twin Bite (Q), Press the Attack does not work as a player would expect.  \n\n\n- \\*\\*Video / Screenshot:\\*\\*   [https://www.reddit.com/r/shyvanamains/comments/1cxgkb2/so\\_q\\_still\\_counts\\_between\\_02\\_times\\_for\\_pta/](https://www.reddit.com/r/shyvanamains/comments/1cxgkb2/so_q_still_counts_between_02_times_for_pta/)  \n- \\*\\*Steps to reproduce:\\*\\*   \n\nSet up multiple target dummies very close to each other in practice tool. Be Shyvana. Try Dragon form Q on the clump of target dummies with various numbers of PTA stacks on them.\n\n- \\*\\*Expected result:\\*\\*   \n\nI would expect PTA to work with Dragon Q exactly as it would with Human form Q and apply 2 stacks of PTA to the primary target if they are a champion in all cases.\n\n- \\*\\*Observed result:\\*\\*   \n\n  \nAs far as I can tell, it such cases it applies one stack to the primary target of your basic attack if it is a champion. It then applies stacks to all other champions hit in an order that cannot be observed. At the end it then applies one stack to the primary target again.\n\n\n\nSo if the primary target is a champion with 2 stacks of PTA on them, you proc PTA. In all other cases, the primary target ends up with one stack.\n\n- \\*\\*Reproduction rate:\\*\\*   100%\n\n---\n\nIn the latest patch notes it was mentioned some other champions with issues related to PTA and hitting multiple targets had their issue(s) sorted, so I thought it would be good to point out Shyvana needs fixes for a similar situation still.",
            "* **Server:** VN\n* **Type of Bug:** In Game Bug\n* **Description:** Using Refillable Potion at fountain then sell and revert it back, mana goes to zero and freeze until champion dies. Can not use any button like items or (B) back, even exit game and reconnect.\n* **Video / Screenshot:** [https://streamable.com/s03wxe](https://streamable.com/s03wxe)\n* **Steps to reproduce:**  Using Refillable Potion at fountain then sell and revert it back.\n* **Expected result:** mana goes to zero and freeze until champion dies, can not using anything skills (include zero mana cost skill) or back fuction.\n* **Observed result:** mana goes to zero and freeze until champion dies, can not using anything skills (include zero mana cost skill) or back fuction.\n* **Reproduction rate:** tried once but nothing happens.\n* **System specs:** I7 4720hq, gtx860m ver536.99 , win10 22h2 19045.4412",
            "SERVER IS DOWN FOR ME CAN\"T CONNECT 3:05AM Central TIME NA SERVER!",
            "* Server: EUW\n* Type: In-game bug\n*Description: In Arena, Hold Very Still does not prevent Aurelion Sol from gaining the invisibility after Q channel has started (without W flight). This effectively means he can hit you and gain Stardust stacks from you and kill you, while invisible.\n* Expected result: If Aurelion Sol possesses Hold Very Still, he will not gain its stealth during his Q channel even if he is not moving.\n* Observed result: Aurelion Sol gains stealth 1.5 seconds into the Q channel.\n* Reproduction rate: Always\n* Specs: N/A\n\nQuite possible other channels could be bugged with it. A good one to test would be Katarina's R since it lasts for 2.5 seconds for example (= it is within the Hold Very Still timer), but I have not met any users other than Aurelion Sol and he seems like the most egregious to me.",
            "Server: EUW\n\nType of Bug: Game Client / champ select\n\nDescription: can't change summoner spells in champ select, the popup is just completely blank, doesnt show anything and theres no way to change\n\nExpected result: i should be able to change my summs\n\nObserved result: i can't",
            "-**Server:** EUW\n\n• **Type of Bug:** Client Bug\n\n• **Description:** When i try to open the client, the window pops up for a short second and disappears.\nI have Riot Client Autostart disabled. Even after a Restart, trying to uninstall LoL as the first action, it tells me that the Client is running, thus i cannot uninstall LoL (and the client is not found in the Apps list)\ntldr: i cannot play LoL at all\n\n\n• **Video / Screenshot:** https://imgur.com/MnrHkgp\nalso apparently my LoL is 4TB (https://imgur.com/nWcYz0X)\n\n• **Steps to reproduce:** try to open my version of the client\n\n• **Expected result:** CLient opens, i can select LoL\n\n• **Observed result:** client opens shortly, shuts down, is now visible in the Task Manager\n\n• **Reproduction rate:** 10/10\n• **System specs:** i5-13600K, 7900XTX, MSI Z790-A Pro, 32GB DDR5 6400 RAM\n\nMaybe it has to do with Vanguard detecting my Skyrim / Kingdoms of Amalur/ESO mods?",
            "* **Server:**  EUNE\n* **Type of Bug:**   Ingame\n* **Description:**  Global Xayah E (I get damage for no reason when respawning and it plays the Xayah E sound effect, can knock homeguards as well in mid/late game)\n* **Video / Screenshot:**   N/A\n* **Steps to reproduce:**  Have an enemy Xayah, die and respawn. It's random\n* **Expected result:**  To not be damaged by a global Xayah E in my own fountain\n* **Observed result:**   In the description\n* **Reproduction rate:**   It's random, but it has happened in the 2/2 games I've played against an enemy Xayah and only once per game.\n* **System specs:**  N/A",
            "    - **Server:**   NA\n    - **Type of Bug:**   INGAME\n    - **Description:**   New Custom Game AI jungle bots will start glitching when trying to take a decision on if they should take an objective or not, will stop objectives at half-health to get a kill in a lane or will not farm in jungle at all.\n    - **Video / Screenshot:**   Can't screenshot that\n    - **Steps to reproduce:**   Launch a custom game with a full bot team (1 ai bot in the jungle position)\n    - **Expected result:**   Bot will fight objectives (drake, grubs, herald) without bugging or constantly switching decisions\n    - **Observed result:**   Bot will not do objectives or will get stuck trying to decide\n    - **Reproduction rate:**   100%\n    - **System specs:**  GTX 1650, 8gb RAM, Win 11",
            "    - **Server: PH2\n    - **Type of Bug: Game Client \n    - **Description: When trying to ban, clicking does not highlight the champion. Tehn, eventually disconnects.\n    - **Video / Screenshot: Can't. I did screenshot it but I copied this so it got replaced on the clipboard\n    - **Steps to reproduce: Open game, queue up for arena\n    - **Expected result: To ban a champion.\n    - **Observed result: Game disconnects.\n    - **Reproduction rate: 100% ( 2/2)\n    - **System specs: Intel i5 4th gen, 16gb ram, 1tb hdd, 120gbssd, Win10",
            "For anyone wanting to test this one themselves, I highly recommend using Rell W (Crash Down) as it has the most obvious animations to show what is going on. I've been wanting this setting so badly for so long but it's near unusable on champions affected by the bug.\n\n- **Server:**   NA\n\n- **Type of Bug:**   In-Game Bug\n\n- **Description:**   \"Clamp cast target location within max range\" setting causes **many** spells cast immediately after flashing to be cast at what would be the max range **before** flashing\n\n- **Video / Screenshot:**   https://imgur.com/a/Fqqt4Bw Note: when testing it is possible to cast the spell and then flash immediately after which would produce a similar result, but it would be intended that way. By using Rell, a champion that can't flash during her W (Crash Down) it is clear that the flash happened before the start of the spell cast.\n\n- **Steps to reproduce:**   Enable  \"Clamp cast target location within max range\" setting, set cursor far enough away from your champion so that after you flash it is still past the max range of the spell, flash, then immediately cast one of many spells that are affected at max range (spells include Rell W (Crash Down), Annie R, Orianna Q etc)\n\n- **Expected result:**   Champion flashes and then casts spell at max range from new location after flash\n\n- **Observed result:**   Champion flashes and then casts spell at what would have been the max range from the **original location before flash**\n\n- **Reproduction rate:**   100% as long as you cast flash and the chosen spell quick enough\n\n- **System specs:**  Not important",
            "• Server: NA\n\n• Type of Bug: In-Game Bug \n\n• Description: Targetting the Sett Cameo in Arena with Sylas ultimate causes Sylas to steal an unusable ult. The button becomes black and you cannot do anything with it.",
            "• Server: EUW\n\n• Type of Bug: Game Client\n\n• Description: Unable to finish hall of legends pass when Vs AI\n\n• Insert Video / Screenshot of the incident\n\n• Reproduction rate: 10/10 Continue to occur\n\n• Steps to reproduce:\n\nPlay VS A.I. intermediate, get triple kill/200jungle farm, etc. \n\n• Expected result: finishing relevant Mission\n\n• Observed result: getting only the points portion of the challenge \n\n• System Specs: \\*N/A\\*",
            "    - **Server:** All\n    - **Type of Bug:** Visual  \n    - **Description:** Alignment of the border on Immortalized Legend Ahri isn't centered on the frame\n    - **Video / Screenshot:**   \n    - **Steps to reproduce:** Purchase the skin and view in Collection\n    - **Expected result:** Centered frame\n    - **Observed result:** Uncentered frame\n    - **Reproduction rate:** 100%\n    - **System specs:** AMD Ryzen 5800x3d, 4060ti 8gb, 64GB of ram // Also happens on MacBook Pro 16\" M3Pro",
            "- **Type of Bug:** In game bug   \n\n--\n- **Description:**   Ryze Q disappears before traveling its full distance.    \nOn one occasion, Ryze Q collides with a minion inflicted by Spell Flux (killing it) but does not spread to surrounding Fluxed enemies.\n\n--\n\n- **Video / Screenshot:**  https://streamable.com/nb749y \n\n--\n\n- **Steps to reproduce:**   Presumably, play Ryze against Azir. Throw a Q through an Azir soldier. Azir soldiers might need to be in the middle of an attack.  \n\n--\n\n- **Expected result:**   Ryze Q hits target + triggers Overload on surrounding Fluxed units.\n\n--\n- **Observed result:**   Ryze Q either disappears entirely or only damages the first target hit.",
            "* **Server:** SEA\n* **Type of Bug:** Arena Augment Bug\n* **Description:** Stackosaurus rex affects the whole lobby instead of just the holder of stackosaurus rex. Playing as ASol twice, once my teammate Kindred had stackosaurus but I also benefitted from it, another an enemy Senna had stackosaurus and I also benefitted from it. Unsure if it's the whole lobby or just ASol as in both games there  were no other stacking champions other than the ones stated. Playing as BelVeth, enemy Cho Gath had stackosaurus but I also benefitted from it.\n* **Steps to reproduce:** Have someone else take Stackosaurus Rex while you are playing a champion with some kind of stacking mechanic.\n* **Expected result:** Stackosaurus Rex only affects the holder.\n* **Observed result:** Stackosaurus affects other stacking champions as well.\n* **Reproduction rate:** 100%",
            "Server: NA\n• Type of Bug: Client Bug\n\n• Description: Can't uninstall or update League. When I open the Riot Client I am prompted to update the game but it just sits there forever and never updates. I tried to use the repair tool but it said everything was fine. I then tried to uninstall League but I got a prompt saying it can't be uninstalled because League was running. I checked my task manager, it wasn't. Just to be sure I restarted my pc and tried to uninstall League without ever opening it or the client and I still got told there was an instance of League open preventing uninstall. I have no idea what to do. \n\n• Video / Screenshot: https://snipboard.io/mYGkoR.jpg https://snipboard.io/udwXzW.jpg (That riot client running in the 1st ss is just that prompt telling me something is running)\n\n• Steps to reproduce: I don't know. It just happens every time I try to update or uninstall League\n\n• Expected result: I am able to either update or uninstall League.\n\n• Observed result: League is unable to be uninstalled or updated\n\n• Reproduction rate: 10/10\n\n• System specs: Intel Core i7 14700KF, RTX 4070 Super, 32gb DDR5, 2 2TB SSD",
            "• **Server**: NA\n\n• **Type of Bug**: In Game (first 60 sec)\n\n• **Description**: between 7 and 15 seconds on in-game timer, game visuals will freeze for any amount of time (usually between 15 and 40 seconds). Sound continues to play. Eventually it will unfreeze, with you on the fountain and game warning about AFK. In some rare cases it will not unfreeze at all, instead locking up the game and forcing you to kill it from Task Manager\n\n• **Steps to reproduce**: Load the game and try to buy and leave fountain \n\n• **Expected result**: Before the patch I could buy item and leave fountain without freezing\n\n• **Observed result**: Now much of the first minute is spent guessing whether it will unfreeze\n\n• **Reproduction rate**: Around 20% in my case. \n\n• **System specs**: i7-11400, AMD 7900XT, 96  GIG RAM , m.2 SSD, Windows 11 enterprise with latest updates.",
            "Server: EUW\n\nType: Client bug\n\nDescription: instead of showing the RP and EB owned, it just shows 0.\n\nStep to reproduce: open the lol client\n\nExpected result: the number of RP and EB owned is shown\n\nObserved result: it’s shown 0. Upon spending any RP or EB to buy content, the correct number of RP or EB is shown \n\nReproduction rate: always",
            "    - **Server:** NA  \n    - **Type of Bug:** Vanguard Error  \n    - **Description:** Two players on my team DC'ed randomly in Ranked, and kept \"Reconnecting\" then \"Disconnected\" repeatedly for minutes, then I got hit with an error message of \"Vanguard must be running to play\" and then it kicked me out and sent me into a loop where I couldn't reconnect. I didn't do anything out of the ordinary, I haven't had any issues with vanguard since its implementation until this incident.   \n    - **Video / Screenshot:**   https://youtube.com/shorts/BqPcKGT6I2c?feature=share",
            "* **Server:** EUW\n* **Type of Bug:** In game bug on aphelios weapons\n* **Description:** In the early game everything worked normal and i had the blue weapon on the first cycle but then out of nowhere it just disappeared and even after hovering over the champ information Severum was shown twice but no Infernum.\n* **Video / Screenshot:** [Bug Video](https://www.youtube.com/watch?v=pfLFszVI3oY) , [Ingame Information Screen](https://imgur.com/a/hIrWZRg)",
            "**Taric q dosnt reset with moonflare spellblade**:\n\n• Server: EUW\n\n• Type of Bug: In-Game Bug \n\n• Description: getting moonflare disables tarics passive interaction with q\n\n• do not have video evidence\n\n• Reproduction rate: 10/10\n\n• Steps to reproduce:\n\nplay taric in arena, get moonflare spellblade, use any ability and attack a target with bravado\n\n• Expected result: taric gains 1 charge of q, and further reduces the cooldown of the next charge by 0,5 seconds\n\n• Observed result: taric only gets 0,5 seconds of of the individual charge cooldown.",
            "• Server: SEA (Vietnam)\n\n• Type of Bug: In-Game Item Bug\n\n• Description: Spear of Shojin's damage amp passive stacks on normal attack if Terminus is bought\n\n• Video / Screenshot of the incident: [https://drive.google.com/file/d/1800UWvqA6r7tOqnovpGgMTcjDw\\_nV9KH/view?usp=sharing](https://drive.google.com/file/d/1800UWvqA6r7tOqnovpGgMTcjDw_nV9KH/view?usp=sharing)\n\n• Steps to reproduce:\n\n* Any champions.\n* Buy Spear of Shojin and Terminus, normal attacks will now stack Shojin's damage amp passive.\n\n• Expected result: Shojin's damage amp passive should not stack on normal attacks.\n\n• Observed result: Shojin's damage amp passive stacks on normal attacks.\n\n• Reproduction rate: 10/10, 100%\n\n• System Specs: Intel(R) Core(TM) i5-7300HQ CPU @ 2.50GHz   2.50 GHz, Windows 10 Education, Nvidia Graphics card GTX 1050.",
            "As if Riot cares about bug fixing? They're too busy sucking Faker's dick to fixthe plethora of bugs that have been plaguing their garbage client for years",
            "Vanguard error 68 keeps closing client right after i launch\n\nthis is still happening after a day and i cant find any news or updates on it\n\nedit: turns out vanguard just doesnt initialize with server with my vpn on now all of a sudden? never had this issue before, and riot client + league of legends + league client are all set to bypass my vpn",
            "• Server: EUW\n\n• Type of Bug: In-Game bug\n\n• Description: \nGame 1: Be dead on the 'Ancestral Woods' map. Randomly get teleported off the map on the bottom left.\n\nGame 2: Be dead on the 'Koi Pond' map, get revived, get instantly teleported off the map to the bottom left of the 'Ancestral Woods' Map.\n\n• Video / Screenshot: Insert screenshot (F12 in game) or Video of the bug occurring.\n\n• Steps to reproduce: Play Ryze on Arena and die (?)\n\n• Expected result: to not get teleported\n\n• Observed result: Get teleported\n\n• Reproduction rate: No idea what causes the bug\n\n• System specs: Should be irrelevant but Ryzen 5 2600, RTX 2060\n\n\nExtra note: This never happened to be on the previous patch, but has happened twice in a row so far on this patch.",
            "    - **Server:**   TW\n    - **Type of Bug:**   No mitigated LP LOSS\n    - **Description:**   Several games with players DC for more than 5 minutes; no LP mitigated loss after losing the game\n    - **Video / Screenshot:**   \n    - **Steps to reproduce:**   have a player DC in your ranked game and enjoy a free lose\n    - **Expected result:**   lose less LP since player DC during min 24 to min 32\n    - **Observed result:**   lose 28LP\n    - **Reproduction rate:**   100%\n    - **System specs:**  Who cares ?",
            "bug, ranked matchmaking. I average an A after 160 ranked games, demoted down to iron 4, I check op.gg. 95% of matches say team disparity, resilient, ace, mvp, or excellent.  every day I log in I get 3 or more confirmed bans from reports of griefers... How is this possible. Statistically?",
            "• **Server**: EUW\n\n• **Type of Bug**: In Game Bug\n\n• **Description**: Shaco invisibility does not work when marked with Xin Zhao Challenged status\n\n• **Video / Screenshot**: [https://www.reddit.com/r/shacomains/comments/1dj1wpz/](https://www.reddit.com/r/shacomains/comments/1dj1wpz/)\n\n• **Steps to reproduce**: As shaco get marked with challanged by Xin Zhao, use Q to go invisible.\n\n• **Expected result**: You are invisible and no one in enemy team can see you.\n\n• **Observed result**: The whole enemy team will still be able to see you while invisible and close to Xin. (It seems that invi will work when outside xin ult circle)\n\n• **Reproduction rate**: 100%\n\n• **System specs**: Does not apply.",
            "Thought I would give LoL another try because ARAM. Got twice kicked from a game \"vanguard not running\", vanguard was running in tray. Forced me to go afk as I couldn't rejoin game. Got a penalty which is Riot's fault. Nothing unique about my setup. 100% Riot's buggy vanguard issue. fix your broken game, Riot. I'll be playing DoTa2 until then. Uninstalled.",
            "I don't know if it's a bug or not, but the shop doesn't stay pinned?",
            "Aram\nfiery glob from smolder Achooo! is invisible to opponent.\nonly his team can see the fiery glob",
            "- **Server:**   EUW\n- **Type of Bug:**   Gamebreaking bug\n- **Description:**   Me and Smolder beat a Nunu and Sion in Arena and after Sion died he killed us. It says we won but we still lost team health. I'm going to assume this is unintended.\n- **Video / Screenshot:**   -\n- **Steps to reproduce:**   Win an Arena round\n- **Expected result:**   Don't lost Team Health\n- **Observed result:**   Lose Team Health\n- **Reproduction rate:**   No idea\n- **System specs:**  Not relevant",
            "so uhh Blackfire Torch sells for 1750 gold, all other legendary item sells for 1250. wassup with that tho",
            "• **Server**: EUW\n\n• **Type of Bug**: In Game\n\n• **Description**: Both Zeke's Convergense as Experimental Hexplate trigger on Udyr regular abilties\n\n• **Video / Screenshot**: \n\n• **Steps to reproduce**: Just buy the items and they will trigger without using empowered abilites.\n\n• **Expected result**: These Items should only trigger on empowered ability use.\n\n• **Observed result**: \n\n• **Reproduction rate**: 10/10\n\n• **System specs**:",
            "- **Server:**   NA\n- **Type of Bug:**   Game bug\n- **Description:**   Leaverbuster doesn't know teemo can go invisible, and counts you AFK if you run to lane for an ambush but it takes too long\n- **Video / Screenshot:**   [uh](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhFQxGAi6Njb0c1LYu7y_a6XUEAASq9tTs2GYR4Z_T56hOwp5hGUmEfF4k8uXOdZWexwmCpPGENKmPT7Z2rLpr75s8XGwPX6J_tMrNlQK06kUdDLhRUWwAVm6WFdpp2ztJhonedXfQ52ytj/s1600/teemodance.jpg)\n- **Steps to reproduce:**   Play as teemo, run to middle of top lane as soon as possible, then do not move until the FF vote comes up. You will get 5 vote options, and you can vote yourself AFK\n- **Expected result:**   The leaverbuster system erronously marks you AFK when you are just hiding\n- **Observed result:**   The leaverbuster system erronously marks you AFK when you are just hiding\n- **Reproduction rate:**   100%\n- **System specs:**  observed on 4 different machines",
            "https://www.op.gg/summoners/na/Viyori-NA1\nyou guys think boosting or smurfing. 37W - 1L",
            "• **Server**: EUW\n\n• **Type of Bug**: Client Bug\n\n• **Description**: When logging in, my Blue Essence and RP are shown as zero. Occasionally it corrects itself to show the correct amount though.\n\n• **Video / Screenshot**:\n\n• **Steps to reproduce**: see above\n\n• **Expected result**: Just show the correct numbers.\n\n• **Observed result**: Shows zero\n\n• **Reproduction rate**: Inconsistent, but regularly showing zero.\n\n• **System specs**: AMD Ryzen 7 2700X Eight-Core Processor 3.70 GHz, RX580 8GB, 16,0 GB Ram, SSD, AMD 24.1.1 drivers, Win10pro 64bit",
            "The client is still not working and you know it, stop using the community as software testers. They don't answer anything, everything is a mystery. If you do it so that the LOL stops walking on computers with so many years, communicate it.",
            "    - **Server:any server /EUW\n    - **Type of Bug:In Game  \n    - **Description:Stackosaurus doesn't give aurelion sol 75% extra stardust during the matches (only 75% between each round)  \n    - **Video / Screenshot:**   \n    - **Steps to reproduce:play aurelion sol with stackosaurus silver augment, use Q and E or R on enemies.  \n    - **Expected result:Aurelion sol gets 75% more stardust   \n    - **Observed result: Aurelion gets 0% extra stardust\n    - **Reproduction rate:100%\n    - **System specs:ANY",
            "- **Server:** NA\n- **Type of Bug:** Loading Screen\n- **Description:**  Titles get shifted off frame when looking at mastery.\n- **Video / Screenshot:**   [Picture](https://cdn.discordapp.com/attachments/969356579633762314/1250430664059256852/image.png?ex=666ae9ce&is=6669984e&hm=ede84f9e11eb94b905a335e98ebf0b5144563b0729efecbc340f6b18e3fbf700&)\n- **Steps to reproduce:**   Click to mastery page in loading\n- **Expected result:**   The title stays in the same place\n- **Observed result:**   The title shifts downwards to overlap with the border\n- **Reproduction rate:**   10/10\n- **System specs:**  irrelevant",
            "* **Server:** NA (probably all)\n* **Type of Bug:** In-game/Interface + Champion\n* **Description:** Center Camera on Champion hotkey is broken by several champion spells.\n* **Video / Screenshot:** [https://youtu.be/yhE-A7BwD2A](https://youtu.be/yhE-A7BwD2A) || [https://youtu.be/10hGcgCST1g](https://youtu.be/10hGcgCST1g)\n* **Steps to reproduce:** Hold spacebar, press E on Skarner, recast to let it end early or hit an enemy or just let it end, notice your camera stops following your character even though you are still holding spacebar.\n* **Expected result:** Camera should continue following champion if spacebar is held down, regardless of what else might be happening.\n* **Observed result:** Camera stops following champion and will not start following again until spacebar is released and pressed. During the offending movement, releasing and pressing the spacebar might not actually fully tether it back to your character either. Some spells like K'Sante's ult create a longer dead period than others, so it's actually harder to get your camera centered again. You end up mashing the spacebar until you're sure the camera is actually following you. It's super distracting and disorienting.\n* **Reproduction rate:** 100% - I can reproduce all of these very reliably.\n\nOther examples of where this happens:  \n• Sion R when recasting to end the charge early  \n• Nunu W when recasting to release the snowball early  \n• Ending Jhin R -- the camera approaches where your cursor is at for some reason, not where Jhin is  \n• Ending Xerath R -- just unlocks your camera every time  \n• K'Sante R breaks camera lock for both caster and receiver  \n• Poppy R (receiving the knockup - meaning someone else can fuck your camera up)  \n• Vex R the moment when you land after recasting to approach  \n• Skarner E - all varieties of it ending, doesn't matter if you hit someone or not",
            "* **Server:** EUW (Confident can be replicable on all servers)\n* **Type of Bug:** In game bug (Item & Champ interaction)\n* **Description:** When using Navori Flickerblade on Taric, bravado attacks do not refresh Starlights Touch (Q)CD\n* **Steps to reproduce:** Try normal Taric combo with Navori Flickerblade in inventory\n* **Expected result:** Bravado attack(P) should fully reset Starlights Touch (Q)\n* **Observed result:** Starlights Touch (Q) goes on full CD and gets reduced by Flickerblades passive but not by Bravado Attacks (P)\n* **Reproduction rate:** 100%\n* **System specs:** Win 11,Ryzen 7 5800x,Nivida Graphics card 3060",
            "It's not only ongoing but for me it significantly worsened in this patch. After just 2 games, the delay is so big that it is impossible to ban and pick. If I don't remember to restart the client after each game and start a new one I always end up unintentionally dodging the select due to the delay and getting penalized for it. It is absolutely unbearable and it is beyond me that they not only haven't fixed it yet but somehow made it even worse. It forced me to doge 4 times within the last 24 hours.",
            "yep, me and my friends are constantly having to wait out dodge timers and restart clients to try to fix the slowness, wish they'd just fix this -\\_-",
            "+1, though it's generally only after every game or two. Me and my usual playgroup all need to constantly restart the client or else be unable to load the post-game screen, falsely get put into a que, or get forced to dodge due to being unable to select a champion.",
            "I believe that might also be what is happening for me. All around extremely slow and very strange bugs. Disconnecting in champ select, telling me I didn't accept, when my party went into the game, failing to create practice tool game, etc.",
            "This is same for me, on a rtx 2060 (started around hearth home ornn event,)",
            "Have the same issue — won’t be cheating though lol",
            "Having this one too. Played 3 arams, went into the 4th and got the message. Had to restart the computer despite vanguard running.",
            "Vanguard just caused like 7/10 players to DC in my game. I dc'd afterwards as well so it might have been all of us idk, when reconnecting it said \"must have Vanguard installed to play league\". Wtf?",
            "exactly what i was about to post happened litteraly just after the windows update came on too",
            "same here since 1 june 2024  vanguard event when in late or mid game tried uninstall and reinstall vanguard not fix it something block vanguard when i do not have anti virus and windows def off firewall off too",
            "This has happened to me twice today during the middle of ARAM games, for multiple players in-game.",
            "i had the exact same thing happen to 7 players in my last game",
            "I had this happen earlier. made me so mad the game treated it as a leaver since we won champ select hard. it was the first game of the day after leaving client open overnight.",
            "Lol I can't even open the fucking client because of Vanguard",
            "SAME!!!!!!",
            "I am losing my fucking mind. \n\nI am the same, have you found a solution to this?",
            "SAME!!!!!",
            "When will they fix this...ffs",
            "Exact same issue, thanks for writing report :)",
            "I thought I am the only one who has this. Thanks for the report",
            "BOOST!! Thought I was crazy having this issue\nEdit: Working now",
            "I'm having the same issue",
            "I'm sorry bro you get perma *. Some players had the same issue and supports said that",
            "Do you have any updates on this issue? Was it truly a permanent ban?\"",
            "Both this and the other issue you posted are fixed in 14.13. Appreciate the report",
            "Have the exact same issue. Would love to see this fixed since Riot support could not solve this issue after 1.5 weeks of troubleshooting. \n\nThey are even trying to blame it on an ISP issue instead of troubleshooting Vanguard lol...",
            "i was looking for this. Cant see pass rewards due to it fading to black as soon as i scroll or click on the scroll icons.",
            "same thing here, its weird because yesterday it was working",
            "Noted on your other post that this is fixed in 14.13",
            "This was reported by Vandiril on his channel, there are 2 bugs. E not spreading onto Cannon minions and Q having half its range.",
            "pls guys tell me its not just me and my friends having this issue.",
            "Same issue, except after loosing that game and getting a penality I cant even enter the client now. Van:84 problem.",
            "Yeah that’s normal, it updates 20 or 22:00. like store updates. It’s not a bug",
            "Ist Patch 14.12 alrdy live? I think not",
            "[deleted]",
            "same here. Game became unplayable since 14.10 due to ping issues",
            "I just got out of an aram where EVERYONE started dropping like flies. I closed my client, restarted my whole computer and it doesn't matter. Game is currently 100% broken.",
            "So you're going to tell me I'm Top 0.6% in 2024 getting S ranks. But your matchmaking brings me down to Iron 4. Again getting 3-5 per day confirmed ban notifications from reports on team griefers, in 160 ranked games, I've received 153 notifications of bans from reports IN ALL RANKED GAMES .",
            "I had this issue on my old gtx980ti pc, after building a new PC, no issues. It seems this is an issue on older hardware. (or, newer hardware is fast enough to compensate for whatever the spaghetti is cooking)",
            "yeah i think i was in that game lol i was playing jinx and everyone DCed except 3 people",
            "Yes, if you use a VPN it should fix it. I think it's because I'm on Optus internet in Australia. I'm not sure what the issue is, but using a VPN fixed the client issues for me. Just use a VPN to get through champion select/manoeuvre the client so u dont get dc-ed and then once you're in game you can turn the VPN off so ur back on normal ping.",
            "Ok, I\"ll contact their support. Thanks!",
            "No. I created a ticket at Riot support three days ago, they have not replied yet. I'll update when they do.",
            "OMG THANK YOU SO MUCH I HAVE BEEN WAITING FOR SO LONG<3333",
            " Now it's even worse, I cant even go to the event anymore, just clicking on the icon on top will end in the same result lol",
            "i have this issue since yesterday",
            "It's live. \"V14.12\" to the bottom right of the client when logged in.",
            "I also received 9",
            "I know right! It's soo frustrating that I can't even explain it. I have ruled out everything I can on my end, ISP, internet load, DNS settings, VPN, my account, and more. Riot is not allowing the correct routing for SG server for us. And I know for a fact that the routing for SG server specifically is not correct as I am getting even lower ping than usual on EUW server. Their are players with their normal ping in SG, mostly singapore players themselves. Only we are suffering for god knows what reason. And Riot refuses to acknowledge and fix this.",
            "The spaghetti do be strong like that. Though my pc can play Elden Ring and such so they must be making enough spaghetti for a whole week,\n\n  \nEdit: oddly enough it doesn't show up as taking up memory or anything like a memory leak in task manager, so I can only imagine what kind of spaghetti they made.",
            "Thanks heaps for replying dude.\n\nTried this morning, it just works but you're spot on, I'm also on Optus. That's quite a fuck around but I'll keep it in mind",
            "me too since yestarday",
            "But it wasnt two hours ago"
        ]
    },
    "Realized my account was compromised, recovered it, notice it was probably sold to someone else, see my skin collection": {
        "title": "Realized my account was compromised, recovered it, notice it was probably sold to someone else, see my skin collection",
        "score": 1458,
        "url": "https://www.reddit.com/r/leagueoflegends/comments/1dlqjn5/realized_my_account_was_compromised_recovered_it/",
        "content": "https://preview.redd.it/i3veotv8x28d1.png?width=808&format=png&auto=webp&s=97168276435f3b1987dc7811866b27ece3d630ad\n\nI havent played since 2022, looks like I will have to use Ahri, thanks whoever random that bought my account lol",
        "num_comments": 124,
        "comments": [
            "you have to be really fucking special to drop 500 usd on a stolen account",
            "Stolen card probably so gl when it gets a chargeback",
            "that has to be all your luck for your entire life.",
            "I noticed and recovered my stolen account after I hadn't played league for a while and I now forever have an account that went to platinum.... a stain on my perfect unranked/bronze career...",
            "OP bought the skin but wants us to think he's not a weirdo.",
            "inb4 op just tries to make it out like his account was compromised but he actually bought the skin, lmaaao",
            "i refuse to believe this post lmao",
            "Me when i lie",
            "When this happened to my bf they just used his mythic essence to buy the Piss yellow true damage Yasuo.",
            "This is what they get for buying an account",
            "Damn, I am both glad you got your account back and feel sorry for the random dude who spent $500 for exclusive content just to lose it. Even if we joke on people who buy the skin, he most likely really thought he bought the account from the OG owner and was all good just to find he was scammed",
            "op sells the account recovers couple years later makes this post lol",
            "I’m reading all these comments about people buying accounts without email access and having it reclaimed after a while.\n\nI’m going to repeatedly sell my own account as a “cracked account” and then a week later the account will have been “reclaimed” by its owner (whoever that guy is 👀) \n\nThen do it again",
            "God same kind of thing happened to me. I stopped playing for years and when I got back into it I had to recover the account. \n\n\nBut to my shame whoever has it was a bronze try hard and played tryndamere. How do you get stuck in Bronze on Tryndamere?!?! Anyway I have a lot of skins I'll never use.",
            "Please let them browse this Reddit it would be so fucking funny",
            "I'm 95% sure that OP sold the account then opened a ticket with Riot support to get it back when he saw what skins the guy got.",
            "Something similar happened to me. I took a 3 year break from the game and when I came back I noticed I had a bunch of skins I never bought and mastery on champs that released after I stopped playing. Changed passwords and have never had a problem since.",
            "Someone got into my account a few years ago and he gifted another account a skin but weirdly played one game as one of my main champs.",
            "Now sell it yourself for insane value, lol.",
            "I want you to know even when you use the skin people will still bully you",
            "+500 EZ",
            "Anyone have any idea how i can recover my old leag account? I played before riot accounts were a thing so i dont have that #1234 thingy for recovery and the email that was used for the account no longer exists. Or is my account with 800€ worth of skins just gone?",
            "And Mecha sett? Damn you are lucky!",
            "y'all believe anything",
            "Bro bought the pass, wanted to flex but didint want get smoke for supporting this scam company.",
            "free skin so if it were me I won't complain",
            "How long did it take to realize it’s stolen?",
            "a similar thing happened to me, but instead of buying skins, the person won all my solo queue placements and now i'm plat without having to play any games",
            "I remember a few years back I stopped playing league for a few months and came back to my account being on the Russian server lmao",
            "Idk why people buy stolen accounts let alone buy stuff for it \n\nI bought a diamond account when I was new to experience a higher elo never bought anything on it lol. Still own it though",
            "My account had 280 ish skins so I also wonder how much it was sold for",
            "My likely guess is that the stolen account got sold and the person who bought the account there just thought it was the account of someone who quit League and is now selling it (which is a classic on those account sites).",
            "It was probably stolen too",
            "the type of person that buys the ahri skin",
            "They probably used a stolen cc",
            "Probably a stolen card",
            "500 USD on a free to play game on a stolen account that you also bought.",
            "Ding ding ding. Probably not his money and probably to re-sell the account.",
            "I don't think the person who bought it thought it was stolen",
            "drug money",
            "I read up on this specific case and worst case scenario I will lose the skins and atleast have had a good laugh, but it seems the rp/skins were bought as gifts from his friend's accounts or alts, so I wonder what will happen",
            "Yep my card was stolen, don’t know how, thankfully I only lost like 75 dollars which I got back. Got a new one now, got to talk to a lovely lady who helped me out a ton, wish I could have personally thanked her after that.",
            "Wish I had this luck while opening pokemon card packs",
            "Man I'd be so stoked and excited if all the luck of my life was me gettting the $500 Ahri skin",
            "I stopped playing league and ended up grinding to master anyways because my account got compromised and someone went 0-12 playing janna and got the acc put in silver lmao",
            "the plot thickens!",
            "I don't even have that much money in my bank account ![gif](emote|free_emotes_pack|cry)",
            "You feel sorry for someone who broke the TOS and bought a stolen account?\n\nNah, I don't feel sorry for someone who is that much of an idiot lmao.\n\nEven if you're buying through an OG owner, you still run the risk of getting banned and/or getting the account retaken.",
            "Its all fun and games until it gets bought by one of those guys who deliberately gets perma'd.",
            "Im from Latin American North, they spoke Spanish meaning that sadly the chances are low :(",
            "<< Idk why people buy stolen accounts\n\n<<explains why he bought a maybe stolen account himself\n\nnever change reddit",
            "Since it's a cracked account (login details are known from a breach, but no access to the email to change details), it's generally sold for cheap since the seller knows you can recover it, most often for a price where it's instantly sold",
            "my friend bought an acc a few years ago with a ton of skins and og pax jax for like 9 quid but a bunch of other people used it too lol, two weeks later the account is banned",
            "Probably about tree fiddy.",
            "Probably not more then 50€",
            "it rly depends on the seller, i bought acc with 200 skins for 40 euros, if they dont have access to email adress to change password its rly rly cheap but very risky to buy\n\n\nedit : downvoted for speaking the truth",
            "Still if you don't have email access it's silly to just hope they won't claim it back.",
            "According to Riot support they ban both accounts until someone pays out the money\n\nhttps://support-leagueoflegends.riotgames.com/hc/en-us/articles/4403733573011-Chargebacks\n\nhoping that's not the case for you, a girl I know got her shit cooked when an upset guy charge backed the ahri skin he gifted her 💀",
            "hate to break it to you homie but common practice is to ban the account until the balance is positive again. Stuff isn't revoked the account gets banned.",
            "You could be good in that regard if the gifting accounts are level 10, since those use Amazon Prime RP",
            "if this works just like in gatcha games then the moment chargeback happens your account get permabanned unless you charge your account with.... 500$ RP aka bring back balance to 0",
            "At least for the battlepass gift, charging back just removes the item, no ban. That seems a bit excessive haha",
            "I've been searching for the Moonbreon since ES dropped...so sad",
            "not anymore :p",
            "Time for the account to get \"stolen\" again then",
            "This is such a reddit line of thinking, morality isn't a flowchart with easy yes/no answers.\n\nPersonally, yes, I can even feel bad for someone who committed the horrible crime of breaking riot's TOS. There's a decent chance they didn't know it was a stolen account and thought they were just buying from a broker, in which case where's the harm? \n\nIf they did know, it's objectively funny that they lost the account after dropping $500, but it still sucks for them. Both can be true at the same time.",
            "when overwatch first came out, everyone thought it would kill league of legends. my cousin got caught up in the hype and bought an overwatch account for €40, but we didn’t really like the game. so he traded that overwatch account for a league account that had €1,400 worth of stuff on it.\n\nnow, years later, my cousin still has that league account. the original owner even reached out recently, trying to trade back, but my cousin said no, and the guy didn’t push it. it’s funny because the guy could have probably just reported it and gotten his account back, but he didn’t.",
            "Most likely stolen card then, gl",
            "I bought it from a friend though who made it  so no not the same",
            "And yet they dropped 500g on it. Holy shit. Some people.",
            "I used to buy cheap accounts so I can play with my friends who were lower skilled in norms. \n\n  \nIt has Silver Kayle, Pax TF and Pax Sivir??? I still have the account to this day.",
            "your friend is stupid, and you know what they say tell me who your friends are ill tell you who you are",
            "Free tiddy",
            "No, you got downvoted because you're an asshole for buying an account. You are part of the problem.",
            "Account Buyer: \"They haven't recovered it after X months, surely they won't recover it *now*.\"\n\n**TWO WEEKS LATER...**",
            "So you can ban people you don't like by befriending them, gifting and chargeback?",
            "Exactly what happened with my first account when I was 14 years old, I'm pushing 27 now. My older friend used it to test some sort of RP purchase scheme with gift cards and it got banned, so Riot told me that I needed to pay $120 to get it back which I (a 14 yo from Eastern Europe) didn't have.",
            "\"If you’ve lost access to your account due to someone making purchases from it, submit a ticket and we’ll do what we can to help.\"\n\nSeems like there's a semblance of hope at least.",
            "E dater pain will never not make me laugh",
            "Yeah guys we totally don't need to regulate internet media including games, let them make up whatever rules they feel like, and then be the ones who supervises its compliance.\n\n\"If a single Riot Account has multiple chargebacks, Riot has the right to perma-ban that account\" like you can't perma-ban everyone for nothing right now. Imagine internet media had legal obligations to follow own terms.",
            "For a stolen account, unlikely.",
            "Only people who buy accounts are smurfs or dingdongs who got banned, fuck 'em",
            "Who the fuck thought OW kills League? They aren't even competitors.",
            "Might have been stolen CC",
            "The seller didn't, just whichever idiot bought it lol.",
            "Grass.\n\nNow.",
            "Calling the friend of someone you dont know stupid and then having the negative respect to actually insult them too.\n\nYou dont happen to be a....gid forbid but you dont happen to be stupid do you???",
            "How old are you lmao",
            "thats a bit stupid tho, im explaining how it works.\n\nand yeah i know its bad etc, but tbh now you get instant banned for 14 days so riot is kinda forcing us to buy accounts.\n\nthere is no point leveling a new acc, when i can buy an acc with 100/200 skins for 40 euros, play on it 6 months, or a year.",
            "lol this is what happened.",
            "That’ll teach my botlane",
            "You'd also ban yourself, so do it from a burner acc lol",
            "but thats not exactly what happened to you. you fucked around and found out.",
            "If it was the case, why wouldn't they just write \"we will just remove the skin\", cause it's the only logical option i see, to begin with.",
            "Hard to prove it was stolen though, right?",
            "way too many people here on the sub.",
            "well, it was during the glory days back in 2016-2017. People underestimate how much were going into OWL and their world tournaments.\n\nTheir esport scene rivaled that of CSGO and their players rivaled league's on a weekly basis, some times even overtaking them. And here's the kicker, they had both competitive and casual audience balanced to a tea. Streamers also joined their competitive scene and made for great personality on and off stage.\n\nBut you know how the story ended. Good old bilzzard.",
            "It was a pretty common take back then.\n\nPersonally while I agreed it was stupid to think of it as a lol killer, I assumed it may take a small amount of the playerbase who are less invested into lol. You know  the gamers who just float between the new hottest game to be released.\n\nAlso ow was hyped up as shit for years before it even released.",
            "plenty of people lol",
            "Probably the same stolen CC they bought the account with. Hence the not caring about any of it.",
            "Yea like is this not an obvious stolen cc.",
            "What are you doing to get banned? I've been playing for 4 years and I've been banned once for 2 weeks because admittedly I said some shit \n\nIf that's a frequent problem for you I hope you're doing okay",
            "Riot could probably see the account was accessed from a different IP and there’s enough of a paper trail with OP recovering the account I don’t think it would be that hard",
            "I mean, if the ip address was drastically changed for 2 years, probably not?",
            "\n>their players rivaled league's on a weekly basis, some times even overtaking them\n\nThat was only the case in South Korea. A place where overwatch was free from the beginning.",
            "This is the first time I hear that take and at OW release I was playing both League and OW and legit never heard anyone say that this will Kneecap League. \n\nMaybe it was a pretty Hot Take on Reddit.",
            "Yeah and if there is a chargeback, riot will take that skin away for sure lol",
            "Maybe yeah",
            "They probably could, but would they go through the trouble? I feel like they would just ignore your plea.",
            "I guess I was thinking more along the lines of if the account hadn’t been stolen for long (no way to tell given the current information that it was immediately stolen after OP stopped playing 2022) and even if the IP address was different is that not also hard to prove that it wasn’t just account sharing or OP accessing the account from a different location?",
            "Yeah I remember it at the time on Reddit, during season 6 people were really over tank meta and all claimed they would migrate to ow",
            "Pretty sure Riot will ban your account if you do a chargeback",
            "no, riot support usually helps in these cases if you reply to the same ticket as long you get a human response. this way they filter out some rage kiddies and idiots that just write a single ticket to let the frustation out.\n\nin such cases you just say you had no access to the account from that moment and you should be goodd, maybe they remove the stuff bought in that timeframe.",
            "They do, but I think if he can prove it was done by the people who stole his acct they will probably just take the skin away. Just my guess"
        ]
    },
    "Low-level games are getting out of hand episode 1542 : BDS Adam's mom got banned for \"intentional feeding\"": {
        "title": "Low-level games are getting out of hand episode 1542 : BDS Adam's mom got banned for \"intentional feeding\"",
        "score": 785,
        "url": "https://www.reddit.com/r/leagueoflegends/comments/1dls84e/lowlevel_games_are_getting_out_of_hand_episode/",
        "content": "[https://x.com/Ricadam\\_lol/status/1804445457680105669](https://x.com/Ricadam_lol/status/1804445457680105669)\n\nBasically, Adam's mom wanted to get to know her son's passion a bit better so she downloaded the game and started playing it on a fresh account. She got a 14 day suspension for inting after being reported by teammates. How is this even possible that a new player, discovering the game and its mechanics, get banned because she probably got reported by smurfs?\n\nIsn't there anything to be done to save new players from getting stomped and reported by smurfs?",
        "num_comments": 108,
        "comments": [
            "Free my girl, she ain't do nothing wrong",
            "Aw hell nah not Mama Adam\n\nThat's so sweet of her tho",
            "I (largely) enjoy LoL but never recommend it to new players anymore. Just a really hostile game for beginners.",
            "It happened to one person that I also introduced to the game, the intentional feeding automated system is quite aggressive even for new players. Specially in the first games that they can get matched with a smurf or so. Fortunately I found the support to be quite responsive in their case and they lifted the ban once they saw it was not actually running down intentional feeding but just playing quite bad and being abused by a smurf. But I can see how this could put off new players that wouldnt even bother contacting support and just quit the game.",
            "I don't think there ever was a game that tries so hard to prevent you from playing it. You cannot speak in chat anymore, you cannot be bad at the game anymore, while on the other side, smurfing has never been that easy and encouraged.\n\nA shame.",
            "this game has a smurf problem but it won't be address",
            "Play too good, you're a smurf\n\nPlay like a beginner, 14 days",
            "thank god dota has an option to report smurfing",
            "Crazy how riot still refuses to shut down smurfing despite it literally kneecapping the future. \n\nThere's a lot of inertia that will keep the game going, but it will run out one day",
            "Well when you do literally NOTHING about smurfing. They tend to rule the game at just about every ranking imaginable.\n\nIn low Diamond I get under level 40 accounts all day long. Challenger/GM/Master players just smurfing/boosting/account-selling and being the most obnoxious toxic pieces of shit imaginable. \n\nThey aren't doing anything about it.",
            "Its pathetic how people who smurf to play in low elo, get mad because the players in low elo are bad.",
            "That is unlucky, the new player experience needs some looking at to make sure actually new players get matched against the same and not smurfs. We all had bad games when we started.\n\nOn a side note, I am curious what champs Adam's mom played, if she was practicing some GODS or toplane like her son",
            "lol classic new player experience. The game gets more and more difficult every year and I think it’s only a matter of time before riot introduces some some kind of “wild” and “standard” mode equivalent from hearthstone where only a select amount of champions can be played in ranked that season, but you can play any champion in a “wild” mode.",
            "You get people going \"how come I get banned for telling someone to do horrible things to themselves through chat but you can int unpunished\", the narrative isn't challenged, this happens.\n\nThe League community is unable to understand losing a game despite trying. Theyll rather enter the conspiracy that everyone, everywhere is constantly inting. \n\nSmurfs aren't the problem. Its the community interpreting someone being bad at the game as a personal offense. If smurfs taught new players it would be different.",
            "I want to take a moment to shift part of the blame on the community and pros for making people believe that every bad play or 3+ deaths is \"inting\".\n\nI know language evolves and all that crap, but **intentionally feeding** and **inting** used to mean exactly that - you purposefully fed kills to the enemy. But no. People had to slowly start calling every single god damn mistake an \"int\". Miss 3 creeps? Inted phase lane. Botched a tower dive? Inted the game. Failed to secure an objective? Inted etc. People are allowed to be bad at the game and have 1/17/2 games, they'll eventually fall into the bracket they belong, especially new players.\n\n\nPros also have a huge impact by saying they inted the draft, the invade, the flip, the everything. **Making mistakes doesn't mean you int for fuck's sake** , just admit the blunder and move on.  \nNot to mention the community inveting idiotic new terms that mean absolutely nothing, what the fuck is *soft inting* even supposed to look like. If I ask 10 people what it is, I'll get 10 different answers.\n\nSo, of course, after years of all of the above, and more, people will report everything for inting, and we have situations like these. You can blame Riot all you want (and rightfully so), but the blame is on the community as well",
            "oof",
            "Wow an actual punishment for \"intentional feeding\"??? That exists??? \n\nHear me out, no punishments for low level - low games players instead after certain amount of losses make them play the bots games. \n\nWhen can we expect the intentional feeding detection in ranked? Next patch?",
            "Yes, force new players to play against bots for much longer. Or at least make it quite hard to get into pvp.",
            "I wish I could comment 🥰",
            "This post makes me worry that I just don’t remember how bad I used to be when I started playing. Don’t get me wrong…I’m still not good and belong in low elo (though probably not as low as Iron 2 where I currently am). But I was in a game last night where we FF’d at 15 minutes because the team went 1-25. I play support and got the only kill with Seraphine while my ADC was dead for the 6th time. We had at least one clear smurf and possibly a second on the enemy team, and my ADC was bad enough that I reported them for inting. For me to report someone for inting…it takes a lot. But when they’re standing under tower not even trying to farm, standing completely still for 3-4 seconds while getting double teamed under tower…it’s tough out there, folks!",
            "How does this lady get banned and not the people who throw a fit when I don't abandon lane to protect them, then they go afk for 3+ minutes, then rejoin, call me a slur, and run it down mid",
            "And then you see riot being surprised there's less new players",
            "Kinda hypocrit that riot is now noticing a decline in new players coming in and at the same time having such a strict punishment system. 200 years strikes once again",
            "I played a normal game the other day on my main account (E2), just to clarify I wasn’t ranked banned, just wanted to play a normal before ranked as I’d lost a bit too much lp.\n\nI was placed against iron players and a level 11 Tristana. I played another and got more iron players.\n\nI guess it’s cause I don’t play normals at all and my mmr isn’t matching up right but it wasn’t really a fair matchup - that kind of match making will also contribute to the bad experience players have when they join.",
            "The problem about this issue is hard to tackle, because a new account playing poorly could be an actual new player, or it could be a bot to lvl up new account to lvl 30,and for the system is hard to differentiate the two.\n\nsolution like preventing reports to new account are not possible because they would lead to a lot of other problem, both with bots and real player abusing this to ruin games with new account without punishments.\n\nYou can only hope that the nine people in the lobby are understanding of you being a new player and not report you, which sadly it's unlikely.",
            "This is why you don't cater to low elo. It's a shit fest, because it's bad or new players getting to grips with a game that over the years has become complicated as hell with little to no framework in place to guide these players. Ignore whining low elo players, embrace the fact that they're wild at heart and just let them vibe.",
            "Riot hasn't believed anyone new started playing for years now. Coupled with the fact they heavily encourage smurfing to re-sell the same items to a player multiple times, the system basically assumes every new account is a smurf and judges them accordingly.\n\nNow, you might think that actively discouraging new people from trying the game is bad for its health in the long term (and you'd be right), but it *does* make them a few more bucks this accounting quarter, so nothing will change.",
            "show game stats? maybe it was actually an int game?",
            "Smurf aren't the problem, the problem is a system that gives out bans only from report feedbacks",
            "guy complains about this but in the meantime you have almost every popular league streamer including former pro players and academy players across all regions advertise:\n\n1v9 WEBSITE BUY CHEAP SMURF ACCOUNTS, CHEAP ELO BOOSTING, CHEAP RANKED ACCOUNTS USE CODE XYZ (streamer name) FOR DISCOUNT\n\nand then they are surprised the game looks like this lmao",
            "Riots reporting and banning system is what’s out of hand. In their absolute failure to curb toxicity, they ban people because enough people reported them, not because they actually did anything wrong. It’s a true democracy TBH.",
            "This is bs, let new players learn the game in peace and get these ego-boosting smurfs out of there",
            "There are 4 types of lol players now\n\nMentally ill people\n\nWhales who like buying skins\n\nWannabe pro players/ streamers \n\nThe casual friends players (minority)\n\nNormal people are playing newer games or better games. Like imagine all the new stuff coming out recently like elden ring dlc, wuthering waves , FGXIV dawntrail and list goes on. Why would someone play this",
            "The game is just super hard for people that never played a video game. Or even people that never played a moba. You actually have to put time in to learn.",
            "The other side of the coin is that if you are lenient on new accounts, then people who create new accounts to troll would also be less likely to be banned. It's a tough balance.",
            "No one starts playing lol in 2k24, only the one who are mentally jailed play it",
            "does it show which account she used. because depending on if it was her own new account, or if she used adams account, the system will see it differently\n\nthere is no point in saying: \"how to save new player\", when the new player in on a challenger account",
            "[Riot put nan in the cage](https://i.redd.it/yu91ufp2w7m71.jpg)",
            "Loved your flair",
            "This. Take notes😤\n\n(Bro I love your flair too XD)",
            "I (largely) enjoy LoL but never recommend it to new players anymore. Just a really hostile game ~~for beginners.~~",
            "Riot must pray we'll still love league when we're pushing 40.",
            "It's not bad if they want to play it and you have a 5 man to teach them",
            "It does make me sad that people don't have the experience I had starting out with 4 friends figuring everything out together and facing off against 5 people who were pretty much the same",
            "Yeah...my introduction to this wasn't a good start. But now I'm loving it so it's worth the wait. Patience is key to endurance tbh",
            "I think I'd recommend it to new players, just not new **gamers**. If you've played a bunch of RTS or other MOBAs, you can probably pick it up fine. There's just so much baseline mechanics you need that starting with LoL is like learning to rebuild an engine without having changed your oil.",
            "Daily reminder that in soon 16 years a company earning billions never managed to pull out a decent tutorial for their game which retained the same gameplay loop for 16 years.",
            ">But I can see how this could put off new players that wouldnt even bother contacting support and just quit the game.\n\nIt's without a doubt a safe bet the overwhelming majority of players this happens to will never even think about contacting support and just write the game off completely because the fact it can happen at all makes the game look like a joke.",
            "Baus too. He is litterally playing on a smurf because in his main account he is always banned for inting, when in reality it's just his strat.",
            "Die too many times?  Straight to jail  \n\nType too much in chat?  Straight to jail  \n\nDon't type in chat?  Jail  \n\nDon't play perfectly in your first game?  Believe it or not, straight to jail  \n\nWe have the best playerbase in the world, because of jail",
            "You know what's even funnier? A game that seems to cater to players that already know the game and are high enough elo to smurf YET they have a larger % of balance changes catering to low elo fucking up alot of high elo balance",
            ">You cannot speak in chat anymore\n\nMaybe try to speak something else than insults",
            "The problem is the playerbase not letting it die lol. Move on and these pricks will sink in their greed.",
            "this is what happens when riot tries to adhere towards the vocal loudmouths complaining about how uncomfortable other  players  made them feel, to the point where league is being regulated with strict oversight that's worse than traditional sport itself. Being sensitive and compassionate  towards anti-bullying is one thing,  but completely go to the extreme and discourage your community from ever interacting with one another  is a form of modern online gaming trend I will never understand. Most people should be playing single player games, but they rather force themselves to suffer in an online platform whilst begging and pleading to play alone at the same time.",
            "Dota actually has no smurfing policy unlike lol. This means streamers included. You can check pretty much any lol streamer now who will have like 20 accounts which people mimic.",
            "Because without Smurf-accounts, you can't tell your investors that your game still has a growing player base.",
            "Given the type of people that usually make accounts to play below their acutal rank, I wouldn't be surprised if those people smurf in low elo with the sole purpose of stomping worse players to report them and get them banned.",
            "playing against bots won't save them from eventually having to queue up against normal humans and being stomped",
            ">Or at least make it quite hard to get into pvp.\n\nWhy, they literally have an entire MMR system for every single queue type for this reason. Leagues playerbase is so monstrous that there's absolutely lobbies/MMR of this persons skill level. The biggest problem has always been that **fresh accounts start way too high**. It takes far too long for new accounts to 'drop' to reasonable MMR, even in norms. Consider that even the average bronze player has years of experience and thousands of games accumulated. Truly new players have no chance against them.",
            "I prefer they hardware lock PCs to a single account (or very limited number of them) using Vanguard, and tell smurfs to get fucked.\n\nThey can find another solution for countries where internet cafe's are more popular like in east asia.",
            "Why that ?\n\nWe could play pvp and feed as fuck and learn better and faster basics of the game than we would in a bot game when we started the game (and arguably it's also funnier and it feels better to finally win against real people than stomping bots).\n\nBut since our community is so shit instead of improving our community or preventing it from being shit to new people we just don't want new player to experience the same thing we used to do ?",
            "Do redditors think before even commenting.\n\nWhy do you think he would give challenger account with good mmr (even in normal games) to his mom and make her face good players?? Like?",
            ">she downloaded the game and started playing it on a fresh account\n\nwhy are you piping up when you didn't take literally 2 seconds to read the first sentence of the post? \n\nyou seriously just read the title and didn't bother to read the post because you couldn't wait to vomit out your \"opinion\" lol",
            "You don't even try mate like cmon.",
            "Plot twist: Adam’s mom is Vocorvo\n\nBut yeah this comment doesn’t make sense.  Why would Adam give his mom a challenger account, and it says on the post that it’s a new account",
            "Come on now, we've known for a long time Adam has some kind of mental deficiency but that's reaching even for him",
            "I (largely) enjoy LoL but never recommend it to new players anymore.",
            "It's fine if you just mute chat. Riot should just leave it off for new gamers by default",
            "Nah I've watched baus legit run it down and that man doesn't get banned",
            "Dying a lot because of a strat is one thing. Dying for the sole purpose of dying to entertain his stream is inting, Baus does the latter a lot. I have nothing against the Baus and his strat arguably is succesful on certain champs, but he also does things like AP Irelia where he has like 30% winrate. I don't think this is what you would consider a strat, at least not a good one.",
            "You cannot win as riot, no matter what you do.",
            "Even worse, they ping-pong between low elo and Pro Play with balance changes, literally the 2 extreme points where you *don't* balance for. It's impressive how bad they can fuck up honestly.",
            "The people who enjoy and actually play the game aren't on reddit whining. It will never die..",
            "> this is what happens when riot tries to adhere towards the vocal loudmouths complaining about how uncomfortable other players made them feel\n\nin a thread about being banned for intentional feeding\n\nI don't even know what to say atp",
            "exactly, like i dont get riot's logic on why they allow smurfing",
            "They should be able to detect smurfs just from bot games though.\nA lot of data that you can pull from that can easily tell if someone is a Smurf unless the Smurf tries really hard to game the system.\n\nSo if you force people to play vs bots and have proper Smurf detection in place there, you can filter them before they start pvp and increase the likelihood for new players to be matched together.",
            "As long as riots profit isnt getting touched they wont move a finger to stop smurfs saddly :/ my friend wanted to try it, got stomped 5 games in pvp in a row and then quit, he even watched some guides and played vs bots",
            "it'd improve the quality of the games a lot but from riot's point of view they won't make nearly as much money this way",
            "Most don't.",
            "bro is restarted 💀",
            "how would i know? i dont speak french... maybe mom just asked to try a round, and he gave her the account",
            "I (largely) enjoy LoL but never recommend it",
            "They already do though?",
            "Its not. I mute the chat every game from the start and ppl are just running it down after they died the first time. You can easily also go to high elo streams and watch the same thing happen. Muting doesnt help with ppl running it down on purpose. Funnily those guys never get banned and as you can see normal ppl who try and just arent that good at the game and die more often ll get a suspension. We can just openly admit here that Riot doesnt give a single fuck. We are all just here to get milked. At this point Riot is at the attitude to take everything but not giving the slightest shit back to the community. They are an absolute shitshow of a company and thats a fact. I am so proud I didnt pay a single cent since season 3.",
            "Because people don't report him in that account. In his main he gets reported basically every game.",
            "yeah dude, half his games are him doing dumb shit and calling it bausen's law just because he gets a bit back. Even his good games are full of shit deaths",
            "He doesn't play AP Irelia anymore. Those are his last Irelia games and it's AD: https://imgur.com/QjSeoKP",
            "Riot had chances years ago to prevent a lot of this behaviour, yet they didn't.\n\nThey unbanned and straight-up promoted (by inviting him to events and even finals), one of the most toxic players to play this game.  \nThey refused to create a prison-island style queue for toxic players.  \nThey refused to address the smurf situation.  \nThey refused to add ways to verify who plays from an account and ban account sharing.  \nAnd many more.\n\nBut I understand why they did that. Because at the end of the day, they are a business, and for all the PR talk they've done over the years (and still do), they want to make a good profit.  \nBan the toxic people and their bald messiah, and they'll stop playing. Put all the toxic folks in the same queue, they might stop playing. People with more accounts spend more money than people with one account.\n\n*Edit.  \nCleared for typos",
            "I should've included the pro play part aswell you're 100% correct. Good job for making azir zeri aphelios and other champs terrible in soloq unless you're a strict one trick simply because of pro play. Seriously they should have different formats for different types of play, low elo, high elo, and pro play. \n\nWith the amount of employees they fired and bank they made off the ahri scam, pretty sure they have the budget to afford such.",
            "The bigger question to me is not why they allow smurfing, but why they don't permaban streamers who openly admit to playing on bought accounts and promote the selling of accounts. Even if smurfing is not against the rules, selling accounts definitely is and one would think that someone promoting this or streaming themselves doing it would be a pretty easy ban, but for whatever reason the support disagrees.",
            "So they can jerk themselves off with misleading stats.\n\n\"We have [x number] active accounts playing the game!\"",
            "That's not necessarily true for bot games. I have friends that can penta kill the bots 5 times in a game, but lose lane to iron players and then get solo killed on repeat. New player experience is just really hard in this game. \n\nOn one hand, you have an aging player base that day by day is getting better at the game and on the other hand you have the 160+ champions staring you in the face, and this is not even taking into account the nuances the actual game itself has. \n\nTo get into this game nowadays, you need someone else to guide you. But then we have another issue. If an average gold player, tries to help their friends by duoing on their main account, then that friend might get blasted to kingdom come due to how matchmaking works. And if they make a new account, then they just contribute to the problem themselves as they blast their newbie lane opponent to next week. So we are stuck with a dilemma. Do you ruin a random's game or your friend's game? And the answer to that question, to most people, is unsurprisingly simple. \n\nOr just play ARAM. Actually, just play ARAM anyway.",
            "Think for a second, why tf would he give his mom a challenger account? How is she supposed to find any fun in that?",
            "He said it in his tweet, I said it in my post too",
            "There's a translate tweet button which most of the time is good enough to get the point across",
            "So? It’s a strat, good or bad, he’s never intentionally trying to lose.\n\nSince he constantly plays like this (it’s not a random int after a tilt), the only judge should be his elo.",
            "That is why he got Chal many times right. He plays like dogshit but gets carried by teammates right. Hmm meybe he knows something about the game more than we do. Oh wow how does he have more gold than his opponent while he died 5 times. Still funny to me how random Redditors always shit on Baus while he is millionare that reached Chal many times and even in Korea doing the exact thing you guys critizise",
            "they removed the tribunal which could with some adjustments reward well behaved people and punish toxic people at the same time",
            "Garen won a pro LCS game? Better nerf him into the ground!\n\nMeanwhile when Yuumi with a 25% win rate solo Q: This is fine",
            "mb then... ._.",
            "He’s not going to let you suck his dick, calm down. He’s definitely a great player, albeit with a selfish playstyle, but you can’t deny that when he’s playing on his masters account he just sprints it for content.",
            "Wait he's a millionaire?! How much does he get from my prime sub?",
            ">reward well behaved people\n\nI genuinely never ever understood this argument, not in this community or any other. Why would you need an incentive to be a normal person. In real life, you don't get a raise just because you didn't sexual harras Janice from HR or you didn't call the 3 black guys in IT slurs, because that's normal behaviour.\n\nYou get ostracised, fired, and maybe a lawsuit if you're lucky, but in a video game, you just get your privileges (aka playing the game) cut, which you would deserve for that kind of behaviour",
            "While i agree overall, 25% win rate yuumi is a good thing.",
            "Yeah even Nemesis said that he was playing in Masters so he can actually stream. Nemesis plays in Chal and gets like 15 min Que times. Sprinting it is a bit much tho. If he can stay in Masters cpnsistantly than isn’t he just like an avarage hardstuck Master player that stomps one game and ints the other. I am Silver so I do not know jack shit. I just know that what he does work and he makes a lot of money while doing it. He ain’t in my games so I cannot judge or decide what he is doing.",
            "His net worth is close to a million he makes 6 figures a year as far as I know. 8-10 k a month or smth."
        ]
    },
    "Ambition on soloq": {
        "title": "Ambition on soloq",
        "score": 203,
        "url": "https://www.reddit.com/r/leagueoflegends/comments/1dlqyrb/ambition_on_soloq/",
        "content": "\"Your rank denotes your true skill level.\"\n\n&#x200B;\n\nThat used to hold true, but now I don't feel like it does.\n\nIt used to be that way, so there was motivation to climb. \n\nFor the past five years I've been streaming, I've always aimed for challenger.\n\nThat's because you can only get to challenger if you deserve it.\n\nBut now I say it's the same in challenger as it's in master or grandmaster. \n\nWhy? Because I did hit challenger, and found that it wasn't what I imagined it would be like.\n\nEven in challenger bad players are still bad, good players are still good, just like in master and grandmaster.\n\nSoloq rank is no longer an effective quantifier for a person's skill level. \n\nAnd that's an unsolvable problem. \n\n\"new account-low rank duo\" has already seen to that, by mixing up all the players. \n\nExcept for the very top where the pros are, the rank doesn't matter. \n\nI don't know what started it, but some of the factors were:\n\n\"new account mmr boosting- low rank duo\" and \"gambling sites betting on soloq games\" and \"wintrading\".\n\n&#x200B;\n\nBut the single biggest factor is where the game has been nudged toward in the recent years. \n\nYou pick overpowered champs, and basically run it down until you can kill everyone.\n\nThat's how the game state has been for far too long, and now people don't know any macro. \n\nThey don't know how to teamfight. \n\nFor example, carries need to know when they should prioritize the front line, or when they should dive the squishies.\n\nBut nowadays you just whale on the thing in front of you, and they melt because there's no real tank in today's game.\n\nYou pick an overpowered champ, target the carries and then it's over. \n\nAnd so your mechanics improve but your knowledge of the game deteriorates.\n\nNow when you fall behind, you don't know how to bide your time and recover. \n\nInstead you do the same thing you always do, you target the carries, but then get killed and say \"oh well\"\n\nYou're basically a Pachycephalosaurus.\n\nThat's what it's been like for the past 2, 3 years. You forget the macro.\n\nThe only ones that have retained the macro knowhow are the pros. \n\nThe soloq players who try to play through macro get tired of all these Pachycephalosaurus ramming their heads. \n\nJax jumps in, spins the thing, and you're like \"wtf is he doing\"\n\nThen he gets a triple kill and then a quadra. You're like \"is that how the game should be played?\"\n\nBut if the same player goes up against a better player, he goes 0/7.\n\nEvery game you ram your skull into the other Pachycephalosaurus.\n\nIf his skull breaks, you win. If yours breaks, he wins. \n\nThat decides the entire game for all the other players, and the ones trying to play normally get frustrated because the game's out of their hands. \n\nThis in turn mixes up all the players of varying skill levels.\n\nSo good players can end up in lower ranks while bad players can end up in higher ranks, depending on luck.\n\nWhen I hit challenger and high GM, it didn't really feel like they were much better.\n\nThere were so many OTPs. If top lost, it was the jungler's fault. People didn't take champion matchups into consideration.\n\nAnd the bizarre thing is, in other games if you get banned on one account, all your other accounts in that game get banned or suspended\n\nBut that's not the case in league. Why is that?\n\n&#x200B;\n\nAmbition is a retired pro, S7 Worlds winner and of 2013 All-Stars fame. He now streams full time.\n\n&#x200B;\n\nsource: https://www.youtube.com/watch?v=be3hsaXP-Eg",
        "num_comments": 78,
        "comments": [
            "Cloudtemplar also recently made a video on SoloQ(which is currently a trend in korean youtube) although that one is mostly about trolls in soloQ. And Cloudtemplar played since S1 famously playing 6-8 matches everyday skipping [some] classes in college. \n\n\nRight now it seems Korea are very unsatisfied with the current state of League.",
            "you can even see this at low elo, people micro has gotten shockingly good but the macro has gotten noticeably worse (relative to their elo), if you have any macro knowledge you can go jg and collect freelo",
            "He's right, and IMHO the issue is the game has become too heavily focused around mechanics & fancy micro.\n\nPlayers it seems to me at least, have developed a kind of *distaste* for having to do proper fundamental macro, and they rely too much on their hands to win. If it works, they win. If not, they lose.\n\nOr least that's how I currently view it, for whatever it's worth.",
            "Thanks riot games for turning this game into smashing keys untill something happens. No brain required",
            ">Jax jumps in, spins the thing, and you're like \"wtf is he doing\"\n\n>Then he gets a triple kill and then a quadra. You're like \"is that how the game should played?\"\n\n>But if the same player goes up against a better player, he goes 0/7.\n\nAs a returning player who quit back in S4, this is so true. I'm still struggling to get comfortable with the game when it comes to mechanics and overall feel of the champions. Many of the ones I used to play changed, etc...\n\nBut the amount of times in SoloQ I see some Sett, Sylas, Jax, w/e, go in 1v3 and think to myself that the guy is griefing but he ends up with a triple is staggering. So much so that I feel my biggest struggle currently is to know when to or not to fight. Sometimes I would not help because in my mind, no way we win that 2v4. But in fact we did...\n\nBut then the next game I say fuck it and I do go for the 2v4, then we get destroyed. It's quite frustrating.\n\nThat being said, as a mechanical player, I do prefer the current state of the game compared to how it was. The only issue with it is that it makes it much harder for a new player to get good. You can learn macro relatively quickly, especially with how much amazing resources is available nowadays. Knowing when you can 1v2/3/4 takes MUCH longer, assuming you even get there.\n\nI somewhat dread the assassins changes though, as champions like LB are already stupidly strong, it will make midlane a coinflip every game.",
            "After reading this I have more questions than answers. What the hell is \"Pachycephalosaurus\" :D.",
            "But the single biggest factor is where the game has been nudged toward in the recent years.\n\n**You pick overpowered champs, and basically run it down until you can kill everyone.**\n\n**That's how the game state has been for far too long, and now people don't know any macro.**\n\nthis is by far the biggest reason why SoloQ feels so bad to play nowadays. And i absolutely agree that SoloQ for sure doesn't feel good anymore to play. D1 up to Master 400LP there is barely any difference, at 600LP it's gm already. I have never been GM but managed to reach as far as 450LP master, but i can tell you in the past i could feel a massive difference between 100LP master and 300LP master. Hell even between d1 and d3, you could clearly feel a big difference in the game. But Now? hardly.\n\nSometimes you have better players, and sometimes worse. Every 3-game you feel like you play with absolute Boosted Players ingame and you literally refuse to believe that they got into x Elo on their own just because by how bad they Play that Game but then you check their op:gg and it's a legit account and you are literally life questioning how this is even possible when they play that bad.\n\nAnyways:\n\nA very big problem is that nowadays you can just win lane, get some plates, a few solo Kills early-game and now you can oompa loompa urself entire mid/lategame with coinflip rng engages aram mid fights, and playing sidelane is unneeded. I see so many adc players barely hitting 200Cs in 30Minutes nowadays while back in the Day everybody got flamed as an Ebay Player that didn't had at least 200CS and it was super rare to see also. I still have the same opinion that i had after season 9. \"When riot decided to increase gold generation with the invention of Tower Plates, they also fcked up the entire strategy part of the Game\". The biggest problem is that plates are a massive Gold Boost, so massive, they accelerate you so hard, that playing Side-lanes properly after the laning-phase is just not needet anymore, they push you easely into 1-shot range when you win Lane, and then all you have to do, is to perma flip and hope it works in your favor. While back in the day, it was too risky, to go aram mid, because 1 wrong engage, could literally mean, \"you will not be able to kill the enemy anymore for the next 5+minutes because now you got pushed out of 1-shot range and ur main gold generation was from minions, so now you lost a certain amount of minions and it was just super hard to get back into 1-shot range, because you can't just randomly get a 600Gold bounty, or a 700Gold tower, that would be able to push you back into 1-shot range.\n\nSo the guy playing sidelane macro would have completely taking over the Game. Playing side-lanes in old league generally had the effect that the entire game, gets slowed down as a whole, and is more about strategy, while nowadays it just feels like, it's 80-90% about mechanics and perma fighting trying to kill the enemies before they kill you. it's so sad how this game has changed. But it's w.e i said this a million times, that i hate the plate system, that it ruins mid-game build up, and that it is just unhealthy as a whole for SoloQ and the Game in general, and should have been removed or nerft massively a long time ago, but every time i say smth about this, people on reddit usually downvote me and tell me \"this is not true, you have no clue about the game yada yada yada\" even tho i'm high elo since 8+ Years (diamond since s7) - (master since s9) and play this game since season 4. What can i even do at this point? riot isn't listening, community never listens, and whatever i say is apparently always wrong.",
            "Imo the game got balanced towards making you feel like the \"main character\". It makes sense, players like feeling good, and it's one of the reason why league is so popular. But the macro side of things has really taken a toll because of this, and not everyone can be the main character, so you either destroy them or get destroyed.",
            "i think the balancing recently has been really shit. because playing meta at a high level is far too important. like this start of season was beyond disgusting with just corki, trist, brand and whatever else was flavor of month. like u go to top of ladder on opgg and EVERYONE is playing these champs. what the fuck? i wish game was less meta dependant somehow.",
            "World Champion basically saying \"Champ Diff\" and I agree. Some champions are main characters, the rest of us are just background extras for them to punch down.",
            "Yeah I notice that a lot from certain players. Macro wins games sure but the reality of it is just bashing ur micro into the enemy and if urs is better, u turn bad fights and win. It's really frustrating as support but I guess that's what u sign up for as the role?",
            "Yes. Yeeeees. The biggest fail was that fake ass \"durabity patch\" that only scratched the surface of having too much damage in the game and immediately after they started buffing the game again to the same levels or even higher than before. It's actually so cancerous. And yes, it does remove skill from the game.",
            "I think he struggles a bit to get His point across but he is right. It was especially bad when eclipse and sundered had not been nerfed yet. Sooooo many games you just Had 1 or 2 champs on each team who could abuse these items to perma fight like briar, xin, camille Support etc. \n\nAnd the games really just came down to These players on their broken champs permanently smashing their head into enemy Team. Either it worked and they went 17/4 or they failed to get a lead early and went 3/14. \n\n\nIts better now but the problem is a lot of these players are only good at this playstyle and perma stuck in dia, emerald or low master whatever. And they completely refuse to learn any other aspect of the game but the Problem is they warp the game entirely around them because its usually junglers. You HAVE to play around them most of the time if you want to win. They drag you down into their monkey play style. \n\n\nI lost so many games where i had score of like 2/1, 30 cs lead top lane but still lost at 20 mins because the team score was like 12/30 at 20 mins. And i Wonder should i have Just given up on playing correctly and just say \"fuck it i am not catching my waves top, i am going with my team currently fighting with a 4k gold deficit over a ward in sidelane brush?\n\nThose games are only fun for the monkeys playing their dumb perma fighting champs. \n\n\nSeriously i have a friend who has been playing league for years only playing Like this. He is not getting any better at the game. If briar, poppy is strong on current patch and he gets lucky with his games he can go up to plat in soloq and sometimes carry a game in emerald. Stick him on any other champ that cant just braindead walk into 3 people with item disadvantage and kill 1, and his skill level is maybe bronze probably iron.",
            "It's literally demotivating how riot is catering to low elos and making your visual rank influence your matchmaking instead of it being purely based on MMR just bc little timmy is complaining that he's platinum with shit MMR playing with silvers",
            "below gm/challenger redditors will read this and think it applies to them, unlucky.",
            "I fully agree on this one. ",
            "I dont really like playing league anymore because a team game doesnt really feels like a team game. A 5v5 game where it doesnt have a 5v5 queue feels weird, since flex queue is just a \"casual ranked\". League doesnt feel competitive enough, soloq players dont want to win by playing around map and objetictives, most of the time they just want to play a champion, kill and see their skills flying and autopilot. Wish there mas more incentive on Clash...",
            "I don't disagree with the idea he's trying to get across, but this is so out of touch with more than 98% of people who play this game.",
            "i'm so happy to read this post as I've been saying this for years. Now, what allows these broken champions to run down everyone is ITEMS !!\n\nItems have been broken for a while, and have way too much agency where they basically takeover games and eliminate outplay potential. An extreme example of this is modes like Arena, where items are so overtuned that they completely overshadow strategic play. Whenever teams reach 3 items+, it becomes all about champions and items. Even a bronze player with the correct build and better champion could easily beat a challenger player.",
            "Please contextualize that this is the Korean server, which is famously very bloodthirsty below high challenger. Some people advocate this bloodthirsty-ness mechanics first gameplay, because they are of the opinion that macro can be taught in pro play. \n\nOf course, expectations are different on EUW or on NA. Ambition is focused on Korean SoloQ here. Much like how when we talk about SoloQ, we mostly mean NA / EUW.",
            "jokes on Ambition, but most league players have always played the game with a selfish main character  mindset for more than three years. The issue  comes when more  egregious champions keep getting  released and their  solo carry potential grows alongside it, giving players more agency to be the main character they want to be even more. This isn't even just Challenger, GM, Masters or w/e, as this is prevalent in all ranks now. Back in the days, gold and below players had little to no ego as they strive  to work together and achieve victory far more often then platinum and diamond players, and that's because  plats and diamonds tend to develop an ego which their skill cannot handle. Now even silvers have an ego consistently trying to parrot pro players and believing no one else is above how they should play, which leads to less coordination. Every year League feels worse than before, and just when you think the game can't devolve into  more degeneracy, the game and its community manage to surprise you even further. Forget toxicity, League players are simply entitled to no end.",
            "B-but reddit told me 2024 soloQ players are all macro gods and a random team of 5 NA challengers of today would beat any PRO TEAM from before 2017\n\nHow come Ambition thinks they're headless monkeys and macro knowledge has gone worse?",
            "kinda summed up my problem with soloq atm quite well, though i'm not a challenger level player ive had the same sentiments about people just butting heads and hoping for the best and how bad players can ascend ranks",
            "League's reaching the tipping point. \n\nYears of power creep and years of insane champ design. We have gotten to the point where the most effective strategy is to lock in a Z tier champ, build the current most busted items, and just faceroll your keyboard.\n\nBack in the day this wouldn't get you very far. At some point you had to get good. But the gap in power between the best champs and the rest of the roster is such a fking joke. \n\nIt's like HoB corki last patch. Man, that was such complete nonsense. Level 2 he valks into your face and deletes 80% of your HP in a single second. You could have a monkey piloting him and it wouldn't make a difference. \n\nIt honestly has gotten to the point where SoloQ feels like Arena/URF. In Arena you have like 20-30 good champs and the rest are varying degrees of garbage. You lock in Vi, Sylas, or Zed and you feel like an unkillable god. \n\nI play Azir and Ryze. This split has been horrible for me so far. I decided to say screw it, i'm playing the Z tiers instead. I started playing Tristana, Corki, Hwei every game. It's legit the most mindless braindead shit ever. The champs are just SOOOOO much stronger. You put in 1/5th the effort for 200% reward.",
            "No shit what most people on the sub have been saying since 5 years",
            "My approach is to keep going, deaths are just mistakes/unlucky and the enemy will have their moments of bad plays too. When playing right , it takes much effort to take me down so that it almost isnt worth it.",
            "I mean meta certainly affects things like having a really good OTP whose champ is completely gutted, but saying that climbing is luck is complete cope.\n\nAdditionally, at least in EUW, I am certain that the macro has improved from the years past.  The player complaining about this is literally a worlds winning jungler, this doesn't apply to more than 10 people in the world.\n\nThese players he faced simply do something better than the players in master or GM. they aren't Faker (or maybe they are xD) and will make macro mistakes. maybe this guy in challenger knows when to go sidelane but otherways plays identically to the GM player, or maybe they know better when they can 1v2, or just space better in-lane",
            "Git gud quit yappin",
            "> 6-8 matches everyday skipping classes in college.\n\nwat\n\nIf you're skipping school to play League, I don't know how you can justify that when you aren't even breaking double digits. Not saying it's healthy or anything, but if you're fully neeting it you should be hitting a lot more than ~ 4-5 hours of play per day.",
            "Played in both NA and KR before and after 2018. I think 'modern league' started in 2018 with the ward changes, which led to a LCK slump after their dominance prior. This led to younger Korean solo q players playing more like the players in Chinese servers where micro and outplaying is far more valued than macro. Ironically, this adaptation of solo q culture, for better or worse, led to LCK being on top again in recent years in pro-play. \n\nThe pace of this game is only going to get faster and about who can react in a fight better with micro because now they are taking account of Chinese data for balance.\n\nAs for NA, it feels like they have been stuck in the past. People NEVER ff, play non-meta champs like nasus, and they never stray from their macro plans like 1-3-1, even if variance calls to group up. I wish there was a mix of both NA and KR/CN tbh.\n\nAlso riot, please add voice comms FFS, it will only improve macro by people being on the same page.",
            "i actually have that one ready to post. i'll upload some time later, maybe tomorrow",
            "cuz proper macro is boring, constant fighting is fun and if you get ahead enough (which isnt hard) you become a raidboss who can go in 1v3 and win, most players are chasing dopamine hits not wins",
            "I think this is true yeah. I was a gold player for several years (I take loooooooongg breaks, and just played casually). Last season I was like, Ok I want to hit plat. I did all the things they tell you to climb, I mained 1 or 2 champions, avoided tilt, blah blah. And I did it! I reached plat by playing Asol, Syndra and sometimes Ahri if I needed to mix it up. I actually performed extremely well on Syndra, I think I had like a 60% WR at one point with her, eventually reaching Emerald. \n\nBut here's the thing. As soon as I landed in Emerald, it was like a whole different world. The micro that everyone had was \\*DRAMATICALLY\\* better than me. Like it wasn't even close. But the macro didn't change at all. Only the flaming got worse and worse. It was such a stark difference that it actually turned me off from the game again pretty quickly. I was losing more than I was winning, and in neither case was I really enjoying myself.",
            "I agree 100% also a returning player. I was diamond in 2020 and surprisingly my mechanics have stayed mostly consistent on older champions even though I just started playing again. Right now in gold 1/plat 5 just from outplaying mechanically my opponent in mid over and over to get gigafed despite not knowing the current macro and objective timings, new champ power and item spikes, etc. my games are either I’m 1-9 from getting out played by a better player and not knowing how to play from behind since I just returned or 10-2 in lane or something from just champ/hand difference I guess.\n\nEdit: gold 1/plat 4 also was diamond in S5, plat S6 I guess I misremembered my old ranks since I only played to get gold for the skins since early seasons where I grinded. Edited since another user pointed out my lies",
            "I would argue that knowing when you can 1v2/3/4 is mostly macro. Micro is what is required to pull that off once you established through macro that you can win the skirmish if you play it well.",
            ">I somewhat dread the assassins changes though\n\nI'm worried that its going to feel like the Skirmisher meta from a couple years ago.  Certain classes are pure PVP classes, they don't really contribute for sieging, neutral objectives, etc, and I think it negatively impacts the game by turning it into team deathmatch.  Its one thing to have one or two champs who are pure PVP, but if you get 5-6 assassin lockins the way we did with the fighter/skirmisher thing a couple years ago the game just isn't going to be fun to play.",
            "Well, to be fair.. knowing when and when not to fight has ALWAYS been a huge (and underrated) knowledge point for league players. It applies to all states of the game. Can you fight a Darius at level 1 as Irelia? What about as Sett? Trundle? Can Asol take a teamfight at level 5 around drake? \n\nKnowing when and when not to fight is really a question of champion breakpoints (yours and your opponents), and the map state. Jax should never be able to 1v3.. because if he's strong enough to 1v3 everyone on the map should know it, and avoid that position. Or at least, they need to try REAL hard to avoid it. But most people don't.. they just ooga booga and take the losing teamfight for that 3rd drake.",
            "Those dinosaurs that have a hard head and all they do is slam their heads as hard as they can at each other.\n\nIt's quite accurate",
            "Head butting dinosaur",
            "> Pachycephalosaurus\n\nhttps://imgur.com/gallery/pachycephalosaurus-TWLvGAL",
            "cranidos",
            "Yugioh players' least favorite dinosaur",
            "OP went the extra mile but the original Korean term is 박치기 공룡 which translated literally is headbutting dinosaur",
            "gap between power picks and none power picks has gotten ridiculous",
            "Durability patch is what removes skill from the game, not the other way around. Champions should not have 1k hp and so much free resistances at early game. That should come with higher levels/items. One of the reasons the game is so unbalanced right now is because the insane amount of free stats u get just from the start which makes the early game not feel like early game. Game has become too forgiving for people who has no clue at how the game works.",
            ">Its better now but the problem is a lot of these players are only good at this playstyle and perma stuck in dia, emerald or low master whatever.\n\nI assure you, the situation is the same below gold. Every game, almost without fail, has a bruiser hard carrying or going 1/9.\n\n>I lost so many games where i had score of like 2/1, 30 cs lead top lane but still lost at 20 mins because the team score was like 12/30 at 20 mins. And i Wonder should i have Just given up on playing correctly and just say \"fuck it i am not catching my waves top, i am going with my team currently fighting with a 4k gold deficit over a ward in sidelane brush?\n\nI talked about that in my other post up in this thread, but this has been my biggest struggle as a returning player. I won and lost games doing both things (as in I lost and won games helping the team, and won and lost not helping) and it makes so confused as to what is the right play. Back when I played in S2/3/4, things felt a lot more clear-cut. Either it was a stupid move or it was the right one. No it seems so much more random.",
            "That's the most hilarious thing in league. There is a not insignificant portion of the playerbase that gets to a rank they don't belong by abusing a certain champ or strat and then are just a liability to their teams if they don't get to play said champ or strategy. This also applies to the people who got the idiotic advice to one trick a champ to climb. Because in theory, they can master the champ and then focus on learning the game. Except they never even master the champ, let alone learn the game. So you even have one tricks in diamond and master that, once you ban their champ, they're legit emerald at best.",
            "A lot of his sentiments apply to more than just under GM.\n\nIt's just that he's specifically commenting on how bad his ranked experience is. It's not unfathomable that other people share his feelings. A lot of it is relatable to my experience, albeit at a lower rank.",
            "While I get your sentiment. Even Ambition in the quoted text included masters which is under gm/chal.",
            "fr lmao and it's also on the Korean server which is notorious for being ridiculously scrappy and having random fights.",
            "An School dropouts like you will make stupid comments",
            "I dont really agree with that. Back in the day it was a lot easier to get people to follow macro calls. Of course you had some idiot once in a while who still went in 24/7. Now I am a returning player who still knows fundamentals, yet my mechanics are kinda ass.\n\nThe amount of times I see ppl mindlessly take fights while being outnumbered after get back pinged 10 times, just because they think they play some dumb op champ is staggering. It happens more than 10 times a game to the point where I am sick of playing soloq and only flex with my friends.\n\nAnd lets not get started by the huge amount of main character syndrome andies who die 3 times and decide the game is lost. They used to still try, but nowadays they just border line run it down because they only know how to fight...",
            "He was mainly referring to high elo.",
            "Learning good macro is more difficult because it requires you to think about what your allies and enemies are thinking and doing and will do and consider League as a 5v5 experience. \n\nMeanwhile learning good mechanics mostly requires you to just be good at your champ and pay much less attention to the team game aspect and long-term strategy and game changes, focusing instead on moment-to-moment stuff. \n\nConsidering other changes Riot has been doing they clearly have a preference for players who prefer playing League as much of a solo experience as possible.",
            "I played in both KR last year and EUW this year, at a similar Elo, which is much lower than Masters, and what he says holds true for both in my experience. The biggest difference in KR compared to EUW, was the average mechanical level was much higher. But people in EUW, at least in lower elos (no idea when it comes to master+) people fight quite a lot. Maybe less, but not that much.",
            "he didn't skip everday only some and I think he was also working part time during that",
            "If you can I think you should also post other videos like these:\n\nP.S. lol :https://www.youtube.com/watch?v=RqzXtoXHJGE\n\nDestiny(Korean Support): https://www.youtube.com/watch?v=bqFRcXH9ZKk",
            "At the cost of design integrity and alienating older players. It's all about money ofc.",
            "Pretty much similar to you, although at a lower elo. I have games where I absolutely stomp mid, to then go on 2/9 the next game. And honestly, it doesn't feel like I played much different between those.\n\nBut maybe that skillshot I dodged the first game allowed me to get first blood and snowball the lane whereas I didn't dodge the second game and got stomped. Situations like those are quite easy to learn from. Sometimes though, it feels so random. It really depends on the champions you face I imagine.\n\nI love playing against mages, because unless you massively fuck up, the lane is quite safe. Assassins on the other hand, you never know if you face a guy with 3 games on the champion that will mostly play passive or just poorly, or a person with thousands of hours on that champion with electrocute/ignite and that will all-in you lvl 3, but are stuck at low elo because they have no brain past the laning phase.\n\nLike, I've played a lot of Yone recently (I know...), and I can safely say, I'm still confused about the Akali matchup. I know it's Akali favoured, but more than anything, I feel I have almost no agency. If they bring fleet/tp, it's pretty free. If they bring elec/ignite, it's terrible. But you never know which they'll take before champ select.\n\nAlso the number of games I lost because people refused to take free barons instead of diving 3v5 at their T2 is driving me insane.",
            ">Right now in gold 1/plat 5 \n\nWhy would you go on the internet just to tell lies? There is no plat5 anymore, there hasn't been for years.",
            "I guess it's both? Like maybe you shouldn't be able to, but because you're better than them you can. But I see your point. It still takes a lot of time to get it right, however. Because to be able to know that, you need to spend hours limit testing, and propably feeding, to know for certain when you can win those situations.\n\nUltimately, I feel it's one of the many aspects that allow high elo players to completely destroy low elo players. I was watching midbeast the last few days, and there many times where he went and won a 1v2/3 and my first thought was: \"I would never go for that play\", not even from a lack of mechanical confidence, but because I would think I would just die, when in fact I would be fine.\n\nSo I guess, I kind of agree with you in the end, lol? I just think it's one of the rare macro aspects that can't really be taught.",
            "To be fair, the durability patch should not have been giving a bunch of champs more HP, it should always have been reducing the damage output across the board by a good 20-30%, still increasing the effective HP but not the total amount. I agree that too little damage can be just as bad as too much damage, both of which benefit bad players more than they do good players, however I'd argue that we are well into the \"too much damage\" territory.",
            "oh because in EUW every body is a nice guy t dont contest objective in inferiority , or force objective with no prio on lanes? wow such gentlemen",
            "im retired for the foreseeable future lol. wbu?",
            "I notice it a lot as an ADC player. I will get fed and nobody gives a shit. Nobody peels, nobody plays for me (maybe my support will but that's about it), everyone just wants to side-lane splitpush, or just randomly fight in the jungle when I'm not there.\n\nThere is very little understanding of team-play or macro anymore. But other things have become a hyper fixation. Like wave-states, small skirmishes, and split pushing. \n\nAnecdote from a recent game. I was up 3 kills, and 20cs on my opponent. We had a dragon and took about 3-4 plates on bot lane. My top laner was 0/3. He was complaining that \"every lane was losing\" and pointed out that the enemy ADC had 1 more level than me (because his support was roaming and he was getting solo exp). Basically they were just so fed up with the game because they were losing individually, that they completely shut off any understanding of the game-state or what's going on.\n\nMost people are just not willing to drop the ego, and everyone has to be a carry these days.\n\nIt doesn't help that they are continually isolating the playerbase and we have to communicate exclusively through pings and emotes (if we're lucky, and they're not deafened to that as well). So then you just have to discent what other players want through body language and then you suddenly get baited into a fight because they feign an engage and don't fully commit and so on. Everyone's ego is way too big and I say that as an ADC main. Which should show how fucking bad it's become. (I do support secondary though, so maybe that helps).\n\nJust my 2cents as someone who's played in all season. Low diamond rank.",
            "I agree with you. I'd win games just by wrangling my teammates around because they didnt know what to do(I barely did but I knew enough). Now? It feels like half the people are muted or everyone is too prideful to where they don't listen",
            "And the thing that irks me is more players seem to genuinely dislike doing any macro beyond the basics. It's odd.",
            "Eh, it's more the fact that mechanics are the foundation. It makes it easier to pick up new champions, and more importantly, it makes executing macro plays a lot easier. If you have bad mechanics, you know that you were supposed to all-in there but you got outplayed and died. I also think it's much harder to teach mechanics than to teach macro.",
            "IMO there is a decent balance between macro and micro in EUW. From what I've seen, NA is very scaling-oriented because of ping, and KR is much more coinflippy, but yeah they understand better the micro stuff like proper CC chains.",
            "Games need updates and that will always alienate players. Literally every live service game alienates older players, because change is uncomfortable.Eg Wow, destiny, RS6, Runescape, fortinite, eve have all had this issue.\n\nGames that don't update will have natural attrtition.",
            "My bad plat 4? Like I said just came back I can link op.gg if you care that much lol",
            "Yeah the point isn’t the result, it’s that players will coinflip plays without caring if it was the best way to win. When everyone plays like this, it just becomes a fighting game and not a team strategy game.\n\nRiot has done a lot in the past 5 years to change the nature of the game and this is where we are. Players don’t want to play 40 min strategic vision control snooze fests.",
            "Back in the days it felt like a psychiatrist sometimes trying to call teammates down so we could win.\n\nNowadays you need a fucking phd lmfao",
            "Because they want to play fighter games, except they're too bad for fighter games. They don't want to use their brains (both for learning the game and actually applying it to their matches), they want to hit their heads into their keyboards, do combos and feel like gods from doing no work.",
            "Maybe at higher elos, which does seem to be true from the challengers streamers I watch from both EU and KR. But at lower elos, EU players have no idea of macro."
        ]
    },
    "faker when asked why didn’t you use your hol ahri skin?\n": {
        "title": "faker when asked why didn’t you use your hol ahri skin?\n",
        "score": 2937,
        "url": "https://www.reddit.com/r/leagueoflegends/comments/1dl8w31/faker_when_asked_why_didnt_you_use_your_hol_ahri/",
        "content": "Q: Why didn’t you use your HoL Ahri skin?  \n  \n[Faker](https://x.com/hashtag/Faker?src=hashtag_click): Uhh I was focusing on the game & I’ve never used a skin before, so I’m not used to it. That’s why I didn’t think of \\[using\\] it. I hope the fans will use it a lot.  \n\n\n[https://x.com/jadetokky/status/1804145442977902975?s=46&t=dPD9H7y4MPvNHHAszk8-2w](https://x.com/jadetokky/status/1804145442977902975?s=46&t=dPD9H7y4MPvNHHAszk8-2w)",
        "num_comments": 325,
        "comments": [
            "If he never uses skins why would he start now.",
            "Yeah this is common news, he's said it before that he doesn't use skins because they can change animations and how the champ feels, so its just easier to use the base skin.",
            "Redditors just fell to their knees in Wallmart",
            "> I hope the fans will use it a lot.\n\nr/leagueoflegends personal 9/11",
            "I still believe Ahri HoL should have been classic Ahri simply with Faker’s glasses.",
            "I thought he had used skins on very rare occasions, like two or three times?",
            "What is that last sentence? Reddit told he was making a statement by not using the skin. What is the meaning of this?",
            "He forgor",
            "They really put him on the spot huh?",
            "Just want to clarify that \"I hope the fans will use it a lot\" doesn't sound the same in Korean. In English it has a lot of emphasis, in Korean it's like saying 'have a good day', something you'd say to anynone in certain situations without actually meaning much.",
            "The baller move isn't having a $500 skin, it's having one and still not using it.",
            "braindead redditors actually expected faker to be on their side of the protests xd",
            "Still funny how people are salty about this. Don't want to see this skin - ban Ahri.\n\nYes, this is scummy as hell. Yes, this skin is not worth even 250$, let alone 500$. Yeah, people are paying over 20$ for a legendary tier skin, idiots will buy anything shiny. What's new? If you really hate this skin, pray for enemy to pick Ahri with it and make her not enjoy the game by camping, whatever works.",
            "Inb4 Riot makes it so they can change the skin via the broadcast :)",
            "why is this even a thing lol",
            "Riot Games punching the air rn",
            "he probably signed something and is not allowed to say anything",
            "haha they will use it just not in my games. lol",
            "You can't really expect him to say \"Because fuck Riot, that is why!\"",
            "Incredible",
            "Based",
            "I remember when Fortnite went through this same scenario with one of their pro players who prided himself on being a default skin. They just shoved a bunch of skins on his account.",
            "When faker plays ahri. Headlines. Fakers the goat",
            "How are they going to use it when I'm banning/dodging this shit from now on?",
            "Maybe one day hes gonna play Rumble and he has to use a skin for sure .Copium",
            "Riot should do an update to the Ahri visuals, give it more flare. Then sell the OG Ahri skin for a premium. Faker will have to buy the OG skin because that’s what he’s used to, which will influence others to buy it.",
            "Saw someone using it today. Name of account. \n\nHide on bush",
            "Should of made a $500 base ahri skin",
            "Actually not a bad reason. I recently got an Ahri skin from the mastery chests and it is kinda hard to tell when her passive is up since I'm not used to it.",
            "Buy the sen bundle but LoL version",
            "Ironic that Faker has the most eyes on him, so he is the best potential marketing tool and him using skins would be the most vaulable for Riot, and he just doesn't use them and no-one gets to see skins used by him.\n\nThough idk, has anyone ever watched an esport game and then thought \"what skin is this? I need to buy this\". Me, I think never. At most I have a seen a skin IN-GAME that I liked or in a preview video, back when there were only a few new skins, not 10 per patch. There is just too much to pay attention to in a competitive match.",
            "Pulsefire ezreal??",
            "Ironically enough, the best skin for faker would be a 975-level skin or lower. Where it doesn’t change any of the base animations or effects lol.\n\nThey’d never make it, but it’d be cool to get a nice looking skin like that, with none of the flair.",
            "> I hope the fans will use it a lot\n\nSo turns out Faker wasn't your ally and he's not boycotting Riot awww",
            "“I hope the fans will use it a lot” = Endorsement of the skin = Faker gives his seal of approval to the predatory and greedy practices of Riot Games \n\nWe must continue the resistance and boycott Faker now. No more watching T1 games allowed. Who’s with me fellow Redditors?",
            "But the fans won’t use the skin a lot because normal people can’t even afford it.",
            "At the end of the day he's a pro player, and one of the top mid laners in the lck, he isn't gonna do something that can hurt his chances of loosing a game just to please the fans or riot.",
            "lol... i hope fans use it a lot. reddit been telling me faker was kidnaped and forced to sign his name so riot can take all the profit against fakers will...\n\nmaybe reddit should stop using faker to push your own addenda, you know the thing reddit is claiming riot is doing..",
            "Hear that? He wants us to use it. Boycotters keep taking L's",
            "idk why people expect him to? Kinda cringe to use something dedicated to yourself anyway",
            "He will use it on The Grand Finals in Worlds",
            "Riot hq FUMING",
            "He literally isn't allowed to say anything but this. RIOT would come down on him so hard if he said anything otherwise.",
            "> I hope the fans will use it a lot. \n\n\nlmao, yeah, he really loves the game guys! he just wants people to waste $500 on a single skin!",
            "Greed ruined my idol",
            "I hope the fans will use it a lot…\n\nUse… what? 😂\n\nA minus 400+ € out of their wallets for some coloured pixels that in the end \n\nWe Don’t Even Own After purchasing online since an Online Service game Can be put down in the future?(possibility exists) but money flowing keeps the service alive and working\n\nEven so the skin is beautiful \n\nShame it doesn’t cost a little bit more than an Ultimate\n\nI think people would be okay with it costing 10$/€ + MAX  \n\nOf the Ultimate Skin Price Tag \n\nsince they added a ton of more animations even when the game loads e.t.c",
            "Or maybe he's a guy with solid morals and doesn't want to promote a 500 bucks visual skin for a game that makes billions in revenue?",
            "Faker being boring as always. The personality of a rock. So sad this is the face of comp LoL.",
            "Couldn’t care less. Boy faker could have come out and said I want this skin to be 975rp or you ain’t getting my name. But nah. He signed off that shit.\n\nSame bullshit with Taylor swift and the dynamic pricing tickets. Couldn’t care less about any celebrity. I like fakers skill and Taylor has catchy music. But they could fall off the face of the earth and I my life wouldn’t change a bit.",
            "\"I hope the fans will use it a lot\" \n\n  \nRare Faker L",
            "i hope  the fans will use it  : greedy shit company: ahh we do to",
            "This has to be Riots worst nightmare. Their undisputed best pro player ever never uses skins and that has to affect a % of the player base to also only use base skins.",
            "He used it in that one Ryze game at 2016 worlds",
            "Because he’s the first player inducted to the Hall of Legends, and the first player to have a skin made exclusively about him.\n\nSo yeah, chances were he would still not use it, but let’s not pretend it’s like any other occasion.",
            "Because it's giving him a delicious extra payment check at the end of the month, that's the only reason he might use it at some point (Riot talking to him over it too).",
            "Especially with skins becoming \"worse\" due to becoming more overloaded and all.\n\nEspecially with champs with projectiles a different skin can make the auto attack *feel* different cause the projectile looks different\n\nIf you're used to that Ahri skin for like a decade...why change it?",
            "Because this is the first skin dedicated to league of legends pro player that is not tied to a specific org. Many people assumed he would use it, so him refusing to is a bigger statement than people seem to think and not obvious at all.",
            "wasn't there a game he used skins. I thought he started using skins recently",
            "Exactly this. If Razer releases a Faker mouse, why would he change his ways and switch to it just cuz it has his name?\n\nIf anything, he will switch to it cuz he will do that PR bluff of \"I believe in this product so much that I entrusted my name to it\" and even then, there is no reason at all to use an ingame skin lol.",
            ">If he never uses skins why would he start now.\n\nBecause it was created specifically for him and in his honor? \n\nFuck riot and their dumb pricing but if anyone should be using the skin it's the guy whose name is on it that gets it for free.",
            "Faker is a liar he once used a skin for fun smh",
            "Because he used... But people always fall for every BS they create around him.\n\nAnd I'm not talking about the time  a Rioter changed it, I'm talking about the time he deliberated picked it...\n\n If you don't know, don't waste your time answering me, do a proper research.\n\n☠️",
            "Thought it was because he'd rather buy fried chicken/hotpot.",
            "Some champs drastically improve with skins; looking at you Ashe. Such a playable champ with two skins.",
            "Nah, it's definitely his schtick at this point. Don't get me wrong it's a cool schtick",
            "befor vanguard,i used modskin to put all 10champ default skin,game was so clean,now without it and the garbage infinite animation/color skins i dont even bother playing 5v5,was playable when 975rp skin were norm not in 2024 ",
            "Korean advice maxxxed",
            "Reddit users when they realise faker isn't in on the protest and actually just doesn't like using skins",
            "Absolutely destroyed.",
            "Thank fucking god, the reddit circlejerk on the \"Faker doesn't use the skin so he's not endorsing and supporting our wholesome chungus banahri protest\" was so lame",
            "he was held at gunpoint to say that",
            "My GOAT is now uzi",
            "that's at least worth $1000",
            "one was a complete accident from the refs in practice tool, the other is i think he used his worlds zed skin once when it came out because it was his first skin that he won",
            "most of them on accident, except for a couple of times he played his own (mostly as a team to showcase) and once for Pulsefire Ezreal",
            "i think he used the uncle sam ryze skin once",
            "Faker himself TOLD ME to buy the skin, proof is right there",
            "He never said that, nor made a statement about it",
            "lul, the other thread on this was full of people saying \"reddit said this\" than anyone actually saying \"he's making a statement\".",
            "he forgor to tell em to mind their own business,clown question ",
            "Yeah. It was more like just sentence to finish his answer",
            "What are you talking about? He says \"많이 써졌으면 좋겠습니다\" literally translating to \"if used, it would be good\" Or in English grammar \"I hope it gets used alot.\"",
            "No it’s not. It literally means he hopes his fans will use it a lot.",
            "It's literally nothing like saying 'have a good day'\n\nNot even close. \n\nQuite a stretch to make this claim.",
            "Why do that when you can actually protest in a way Riot cares about aka not playing the fucking game during the event? seeing low players numbers during an event actually puts pressure on them\n\nBut no, that actually requires sacrifice and forward-thinking, instead of just bullying whales, which is easier",
            "Why do that when I can just use the ban button so they never get to enjoy their $500 toy that will only encourage Riot to make more cosmetics like it because they bought it?",
            "People want the skin, but cannot afford due to high price tag. I don’t get how hard is it to understand. You say it’s scummy and not worth and you say “still funny how people are salty about this”. Maybe stop talking nonsense",
            "Unironically could be done to Spectator mode if they put in the dev work.",
            "Scummy but genius, probably not even that hard to implement",
            "[removed]",
            "Fortunately, not every game of League of Legends involves you.",
            "Lol",
            "Why is this downvoted, it's hilarious & obvious satire (I hope)",
            "fr",
            "It's a premium product designed to divert money from rich people to League of Legends, and I'm here for it.",
            "losing*. Loose is how a shirt fits or a knot is tied.",
            "Yeah, like he can say anything else lmao",
            "but if you ask him if you should buy it with the average person's income level he will probably say no.",
            "Kinda weird to defend predatory monetization...",
            "Actions speak louder than words, especially in his situation",
            "why its cringe",
            "No I think he just doesn’t like using skins as he literally said himself",
            "Wtf you want him to say/do?",
            "So sad the face of Comp LoL is a 4 time world champ, 2 time MSI Champ, 10 Korean league champion and veteran player who has 0 scandals and just loves to play the game at the highest level possible? \n\nI'm sad i had to read your comment, tbh but here we are.",
            "Better to be just a plain good player than some weirdo who eventually gets exposed for something bad. I'm not here for Faker to cause some insane drama, I just want to see him perform and maybe play up the role of the villain",
            "It’s very ironic from someone likely riding team China and the best they got is they’re good. And if it’s European, idk doesn’t read like a euro",
            "To be the best at anything, it needs to be your everything. It weird when a champion actually has a personality outside their thing.",
            "Do you really think a player has that much power over a multi-billion dollar corporation?",
            "Couldn’t care but decides to comment on it 🤔",
            "It's more about the lost opportunity, he using skins will induce players to buy them, but as he doesn't, they will not feel the effects of that effective and extra publicity.",
            "> that has to affect a % of the player base to also only use base skins.\n\nI don't know about this. But definitely would be the case that if he used skins on all the champs he played, people would see that and undoubtedly be influenced to buy said skins.",
            "I'm sure it has a negative effect on sales but Riot's worst nightmare? Faker is an undisputed GOAT who's as respectful and noncontroversial as you can get. He's so beloved that he brings in way more money than he costs them by not using skins. I'd take a worst nightmare like that every single night",
            "That got lucky enough that he's a wholesome, kind, and driven individual who is the exemplar of sportsmanship.  Bummer that he's also not a salesman, I guess, but I'd say they picked out big time on who Faker turned out to be. \n\nNothing against Tyler1 personally, but can you imagine if he ended up being the unofficial face of league?",
            "i doubt it has any bearing whatsoever, someone that can afford a 500 dollar skin isn't gonna go ''ah fuck Faker didn't use it so now i cant''\n\nI know this sub has a boner to just shit on Riot and the Ahri skin but the theories and claims about Riot in relation to the Ahri skin are so fucking stupid",
            "I wonder if they've ever offered him money to start using skins. As a marketing strategy.",
            "> worst nightmare\n\nKappachungusdeluxe maximus",
            "It gives your competitive game a lot of legitimacy when your best player doesn't participate in microtransactions. I don't think it dissuades anybody from buying skins that they're interested in.",
            "In my opinion, using a skin can easily affect your gameplay if you're practiced on hearing certain audio queues and seeing certain animations and projectiles.\n\nBy only using base, he guarantees his gameplay is identical from game to game.",
            "Only if you compare Faker to some hypothetical player who has all of Faker's other qualities + uses skins. But that player doesn't exist. The real comparison is between Faker vs No Faker, and they'd choose Faker every time.",
            "You know Faker advertises A LOT of products that he himself probably doesn’t use ..? And he has also promoted this skin in Korea already. He made YouTube videos with multiple famous Korean YouTubers just to promote the event and the skin release. Also gave interview to multiple news channels about his HoL event. \n\nHe has been promoting the event and the skin release well. Just because he himself doesn’t use it, doesn’t mean people won’t buy it. \n\nBig Korean streamers have also bought the skin and already made videos. \n\nKanavi, Bulldog, Peanut and Viper have bought the skin and showed it to their fans during their live streams. Viper even said during his stream that he is paying money to Riot and advertising the skin, instead of getting paid by Riot to advertise.\n\nJust watching Pray’s video of him buying the skin and using it and seeing the chat reactions to it (he also did it on his stream) will let you see how much people are interested in this skin.",
            "I hope for the sake of humanity that % is super low lol, tho it would make sense if certain skins were used more if he used them",
            "When you're faker, you don't give a shit. 99% of players are into it",
            "Why would it affect other people?",
            "I have never met a person like that lol. Also he said he hopes his fans use it. If you just blindly do what he said you will buy it.",
            "hasnt so far why would it now",
            "If you think this is a corporation's worst nightmare, you mustn't have been around capitalism for long...",
            "they could simply give players a share of the revenue they create from using skins. honestly if i was a pro, i wouldnt use a skin either unless riot paid me to.",
            "Fairly sure the only time he has deliberately used a skin is once for each of his worlds skins. Plus a handful of times when clients bugged and he ended up with a skin.",
            "This just goes to show you're very, very low level lol.  \n  \nUsing a different skin after using the same one for ages is detrimental to one's game play. He's not protesting his own skin, he's doing what he's always done and playing to win.",
            "Yes. Iirc it was 5 times that he used skin. Out of how many games? Google says 1344. 0.004% of games played. So it's better to assume that he's not using skins at all. And if you answer: Duh, so he used skins before...\nYeah, but it's closer to never than sometimes",
            "He has all cosmetics unlocked on his account coz of LPP",
            "They have all skins unlocked on the tournament client, plus he has partner Programm.\nHe doesn't have to pay to have skins.",
            "What about broccoli?",
            "Before the rework Udyr was literally unplayable without Spirit Guard",
            "Nightbringer Yasuo. Base animations feel shit compared to the legendary. For Yone, I'd argue his base is the cleanest.",
            "Coven and project?",
            "Do you really think that even if Faker were against it that he would say that and ruin everything he's built? This isn't his hill to die on, even if he hates it, which he almost certainly does.",
            "he? why would a protest be lame? that's what happens in democracy my dude, grow the f up.",
            "[deleted]",
            "Or he’s financially related to it. I’m sure he’s getting some cut of sales",
            "Faker is just riots bitch in this entire Hall of Legends thing",
            "He used the T1 Zed Skin *deliberately* since it was T1 vs FNC at like, all stars(?) and T1's team comp was the 2013 skin line.\n\n\nOutside of pro, he bought Frost Queen Janna so people wouldn't judge him if he was playing base skin support bot lane.",
            "He used it when they played full skt skin comp in 2014 all stars (basically msi)",
            "He also used his Azir skin at 2023 Red Bull Cup against NNO",
            "With Ezreal skin, what I've learned today is... He used this exact skin because In his opinion, auto attacks felt better than base. Which is kinda weird, because we humans playing Ezreal, have completely opposite feeling. No judging. That was just funny for me to learn",
            "That's not what Reddit thought",
            "I think he's saying that there was very little weight to Faker's words. He's not saying, \"I deeply wish for the playerbase to use this skin frequently.\" I think your initial translation is spot on. \"if used, it would be good\". Very non-chalant. Very impersonal. Very light. Very PR friendly.",
            "Of course the meaning is different. What I meant to say is that saying 'have a good day' in English doesn't equal 'it is my desire that you're happy today'. Similarly, the phrase Faker used here doesn't really carry much meaning.",
            "Because, do you HONESTLY, in all sincerety, believe, that if this whole subreddit, the active part of it, of course, stopped playing the game for the whole event, something would change? That's massive copium\n\nReminder for you. Reddit is the vocal minority of the playerbase. Asian community has no issues with this skin, especially considering the good sales. The majority of people that don't use social medias also, in fact, do not care. \n\nThe whole protest is a damn joke. Ahri's banrate started to go down ALREADY. \n\nSo yeah, Riot doesn't care. They made a lot of money on that skin already, will call it \"successful\" and will release more of that stuff in the future. So might as well laugh and bully the whales that support this stuff. Because no matter what you think, you won't pressure Riot with your actions.",
            "Because there might be a chance that someone on your team would want to play Ahri and will just run it down the game if you ban her. I mean, if you are up for it, then go ahead, king.",
            "I want a yacht, but I’m not gonna spend all day pissing and moaning about not being able to afford one. Move on with your life. ",
            "Just don't care about this skin then? It's not the best Ahri skin, thematically it's boring as hell and Spirit Blossom is still better and cheaper. \n\nI don't support the shit that Riot does, but it's clear that they WON'T back out no matter what, so it's best to just forget about that.",
            "One big thing about faker is that he doesn’t cause controversies.",
            "it gives him tons of money so why would he care",
            "Contracts exist. You think Riot made a Faker skin and would just let Faker trash the skin?",
            "He didn't put /s so it went over their heads",
            "It's a fake premium product designed to lure poor people into thinking they can afford designer goods. 500 bucks isn't that much and the only people who think it's exclusive are those who can barely afford it. \n\nRich people have better things to do than spend money on LoL.",
            "Shit talking your employer effectively typically doesn't work out well, even when you're such a big name part in its success.",
            "The cope is unreal \n\nHe can just not say anything at all, he could have left it at I'm not used to using skins",
            "Why can't he?",
            "Don't need the average person's income level tacked on. Faker will likely say no regardless of your financial status.",
            "Fellas, is it cringe to wear the scarf that my grandma made for me???",
            "That's literally the point but ok.",
            "Everyone who does not fully agree with me and repeat right after me has the personality of a rock, obviously. /s",
            "yes, clearly faker was sitting right with the financial teams that were working out the pricing as they were doing it, that's how companies work, right?",
            "https://en.wikipedia.org/wiki/Personality_rights",
            "Faker not using skins is the exact reason I think the Ahri cash grab is fucking stupid.",
            "This is also valid, however its all but guaranteed that some players who idolize faker probably also refuse to use skins. It comes down to % and it could be super small or a somewhat decent chunk of his fanbase.",
            "He has long said he wants to show you don’t need to spend any money on the game.",
            "I Disagree to some extent. The opportunity hadn't existed for the past 5+ years where its just been cemented he never uses skins.\n\nAlso its faker so shit does sell",
            "Imagine buying skins just because someone else plays with them and not because you really like it",
            "If it works that way it would also work the way i said…. Its really more a matter of what % than whether or not it has any affect at all.",
            ">Every single night\n\nHUH",
            "They'd make so much more money if the goat was an interesting person that plays skins.",
            "Isn't Tyler1 already the unofficial face for the non-pro side of league?",
            "Not shitting on Riot at all, and this is not specific to just the HOL Ahri skin. Its a fact people imitate their idols and Faker being the undisputed biggest idol in league and only using base skins definitely causes some % of his fans to also only use base skins.",
            "Sorta, but if a football player didn't wear his jersey, priced it as may be, less people would buy it.",
            "We did it reddit we are Riot's worst nightmare keep the boycott going",
            "It doesn't dissuade but it misses out on the potential skins that were bought by players because \"faker used it\". Its obviously not as simple and direct as \"faker used it so I use it\", but there definitely an underlying impact he has on the playerbase. He may not turn someone from not buying a sking to buying one, but moreso push someone who was 50% convinced to buy the skin to follow through and buy it.",
            "IIRC once due to a mistake he ended up playing a Diana skin that after the game got like triple numbers in sale",
            "You will say with certainty that zero fans of Fakers use base skins only because thats what faker also prefers? Trippin.",
            "How do we know? As far as probability goes at least 1 faker fan out there does not use skins because faker doesnt use skins.",
            "Its kind of a meme but also ironic that a game that makes the majority of its revenue on cosmetics has their most iconic player prefer to use base skins. No doubt his preference for base skins also affects some of his fans.",
            "I don't think he has ever chosen SKT Syndra",
            "Huh? You think faker couldn't perform with a skin? Maybe that's the secret for his success",
            "You KNOWS I'm correct, but you're childish and can't accept it, because you idolize the dude and fell from the Propaganda.\n\nDownvote at will Kids!",
            "Only zero matter. \n\nIf you cheated once, you cheater. If you fucked once, you can claim being a virgin because others fucked 5 times or 1344 times... Eh...?!\n\nThe difference from  0 times to 1 time is infinity... The difference from 1 time to 5 times is not. If he used it. .  .\n\nI mean, he used it? Yes Or No?\n\nDon't use never then.",
            "Pretty sure this isn't true for his Hide on Bush account. iirc he had to buy his worlds skins himself .",
            "Plus, he's a multi millionaire. Who is very, very likely getting a FAT chuck of this event. I think he can afford some take out for the next 200 years.",
            "I’m pretty sure faker could ask riot for anything and it will be given free to him",
            "Nightbringer yasuo is absolutely top tier. I will say the prestige inkshadow to me is equally as smooth and I can play either without noticing any change but if I go to base skin or heaven forbid project yasuo, it feels worse",
            "Project and High Noon. Coven is an epic skin, so it uses base Ashe animations, that suck a lot.\n\nBoth Project and High Noon are easier to play and kite with. Same with High Noon Lucian. Makes Lucian feel like a whole another champion",
            "I don't care what Faker thinks honestly, what I'm pissed off about is this and other socials attitude about the whole Ahri skin fiasco. It's fucking embarrassing honestly \n\nYou guys wanted to protest so bad so what did you do? The meekest thing possible. \"Oh let's ban Ahri, surely that will teach Riot a lesson\" while the only thing that did was bully whales and annoy Ahri players. Good job, literally players fighting amongst themselves\n\nIf you wanted to hit Riot, people should've stopped playing for the duration of the event. Player numbers dropping and review bombing are the only effective ways of protesting against live service games, especially those as big as League. But that would require actual effort and actually not giving into the league addiction, so I understand why no one even proposed that",
            "I wish I was, believe me",
            "He is getting a cut, but I'm fairly certain that's not why he said that. \n\nBecause, first, Faker has a *lot* of money and doesn't come across as the guy who really, really wants more (and well, it's a fact that he declined massive offers from a bunch of other teams). \n\nSecond, that guy's just sweet. It's like saying \"I wish my fans to have fun and have a good time\" - he would say that and mean it. \"There's something new in the game that's nice and I hope many people can have fun with it\" is the same thing.",
            "He bought SKT T1 Ryze like years ago when it was in his shop\n\nhttps://m.twitch.tv/clip/FriendlyRefinedConsoleNomNom",
            "The Frost Queen Janna thing is fucking hilarious lol.",
            "He also bought the K/DA Ahri skins because he liked the MVs.",
            "He also played with Skin at a RedBull tournament some months ago",
            "Azir isnt his, he has zed, ryze and syndra.",
            "That aint his skin",
            "He used Easyhoons Azir, not his own.",
            "It was at the time no? I remember when Pulsefire came out, some people called it p2w because his autos were so much better. Same for skillshots.",
            "no it was just funny lol\n\nfaker has legit never used skins it’s just funny to think of riot making a $500 skin for him and spending a month marketing it and him not using it ",
            "true, but actual fans of faker know his stance on skins and laughed at reddit clowns.",
            "The only valid protest would be not buying it. Anything else Riot will shrug it off. And since the whales will buy it anyway no protest will work and it will be back next year. *Maybe* if they're feeling really generous they will make the next one $400 to pretend they care and value the feedback.",
            "If they run it down b/c they didn't get ahri that says enough about their mentality that I wouldn't trust them in game anyways",
            "Running it down is a reportable offense. Banning a champion isn't.",
            "Nice analogy, only if most yachts cost 20 while the brand new with new engine cost 500.\n\nPeople are just complaining on a forum, and you’re acting like they’re spending a lot of time thinking about it.",
            "[removed]",
            "Why would he sign the contract if he couldn't disparage a practice he would otherwise disparage if he felt that strongly about it?\n\nThis savior complex around Faker especially around this manufactured skin drama is insane.",
            "a yes/no direct purchase of a video game cosmetic at a high price point. what a cunning ruse, the target market of poor people will never know what hit them\n\n🤔",
            "LOL have you seen the things that some rich people buy?",
            "The commentators of league esports constantly take the piss at bad balance and they're infinitely less popular than faker. Stop coping",
            "yes youre now disowned from your family",
            "just wear your grandma ",
            "Nothing to do with the ahri skin though. He’s never used skins even before the ahri skin didn’t exist, so saying he’s not using the skin to not promote something is outright wrong",
            "I waited 10 years for SKT Ahri and this is what I get",
            "It's insulting to the community and Faker in many ways, it should be something all could show celebration, not a segregation event of who can spare 500 dollars or not.",
            "Riot has given away [free](https://cdn.vox-cdn.com/thumbor/saIvF5aF8YUGjYi5kWFF524P8JY=/0x0:1980x1114/1200x800/filters:focal(846x347:1162x663)/cdn.vox-cdn.com/uploads/chorus_image/image/65478904/annieversary_final_1.0.jpg) [skins](https://static.wikia.nocookie.net/leagueoflegends/images/c/c4/Jayce_ArcaneSkin.jpg/revision/latest?cb=20211019203059) before for celebrating events. . . I'm not saying the $500 Ahri skin should've been free, but they **could have** given everyone a free skin instead.",
            "Also in my opinion the Leblanc skin feels nicer to use even with the outdated model.",
            "Or somebody sees Faker play Ahri , make it look super easy. Newbie buys Ahri, sucks. Thinks well maybe if I buy this skin I’ll feel inclined to learn the champ. Give up on champ and now you have skin for champ you suck at.  Repeat.\n\nStreamer effect.",
            "Even controversial people can make way more money to an extent, granted there's definitely a line on how controversial you can be, before youre a detriment to your own value.",
            "They'd also make more money if they had a private forest where all the trees grow money instead of leaves. There will always be an infinite number of counterfactuals where a company could make more money if they were true.",
            "I hope not and don't think. Personnally I don't want raged inducing buffon like Tyler 1 , Dante, Kesha ,etc to be the face of League. I know their just online personna but it gives such bad image and model for the player base. Also Tyler1 is mostly know in the west go east and very little know him.",
            "Yep. It normalizes that skillful and accomplished players don't always use skins.\n\nThink about other games - for example Valorant or CS:GO. If the streamer is in-between games picking out which skin chat would like them to play - well certainly people will see that and go - people who spend a lot of time on this game also usually buy skins to support it and it's another fun part of the game.\n\nIf Faker is constantly talking about skin meta and which skins look coolest to him or which ones he feels makes him hit his skillshots best or whatever... that obviously pushes skin sales. It's just obvious.",
            "To reinforce this:\n\nFormer H2K owner Rich said on his show that it was common for Riot staff to suggest to their EU LCS team to use newly released skins in EU LCS matches.",
            "Probably but that player has to wear that jersey in order to be able to play for his club? Faker doesn't have to use skins and doesn't have to in order to play for SKT or whatever",
            "Wow what a nuanced and thoughtful take, wonder how many downvotes it gets.",
            "I dont say that but i think its not a problem for riot that people buy a skin for 400€ and use it or that a lot of people buy a skin for 400€ and some are not like its always the case. The question is not  how many faker dont buy skins its how many buy skins for riot. In the end its 400€ and i saw a lot already. They will for sure make a lot of money and its for sure not nightmare for riot. If it was a nightmare they would reduce the price ans you are trippin if you think they will do this",
            "because they report record profits every year, so whoever isnt using a skin is already unlikely to buy or use, people who are likely to use or buy skins will do so even when its to buy a faker skin that he himself wont use",
            "I refuse to believe a sane guy with reading comprehension skills replied this. It's either a troll or it's a edgy teenager who thinks he is too cool arguing like this",
            "He didn’t get skt ryze until it was in his Your Shop on sale. ",
            "AFAIK, you can still buy skins or champs, but technically don't need to coz it'll be unlocked for you.\n\nIf the account loses LPP status, you still have the skins you bought before or during your LPP status.",
            "Multi millionaires don’t stay multi millionaires by spending $500 easily /s",
            "SKT gets 30%of the profits, and after taking their cut Faker gets the rest.",
            "High Noon feels like a completely different champ, I use whatever at this point but when I need a win First picking Ashe and locking High Noon usually gets me there.",
            "The people who would have proposed that aren't there lmfao, they already left the moment Riot unveiled the BS. The people on the **league of legends subreddit**, surprise surprise like league of legends and don't want to stop playing it.\n\nThe same thing happened with Vanguard, the people who would have said something had already packed their bags and left, not stuck around for god knows what. \n\nRegardless, \"boycott\" movements for PvP games might as well be a myth. It has **never** worked. The communities fostered via the \"competitive spirit\" are too uncoordinated to do something like that.",
            "nuance? in my league subreddit? get outta here",
            "Not to mention it would probably make him look ungrateful as hell which would look really bad for him",
            "How do you have a clip of this on hand?",
            "That's super funny lol",
            "i'm a little confused ,why does he have frost queen janna",
            "The vast majority of people in that thread were clowning on the OP of that thread for seeing it as some sort of statement.",
            "True, but it's still a waste of time imo.",
            "a cheap boat is pretty inexpensive compared to an actual yacht\n\nif $20 skin = cheap boat and $500 skin = yacht i think the analogy is pretty fine\n\nyou can buy a cheap boat without pissing and moaning about not being able to afford the yacht",
            "Considering people were banning Ahri and were so quick to project their opinion on Faker yesterday, yes a lot of dorks are thinking about it every day.",
            "You know what's better than 2 millions? 3 millions.",
            "okay",
            "Faker is going to the EWC, that says enough.",
            "Has Louis Vuitton ever released an infinite number of unregistered photographs of their bags for 500 bucks each?",
            "What are you so mad about lmao",
            "Its a rule he applies to all skins, why do you think Ahri would be different?",
            "I mean the lowest tier isn't that expensive if you wanted to buy the pass too, it's just when you want the huge versions",
            "Side note: the one time I had the $500 skin in my lobby they preceeded to be above fault and referred to everyone as brokie",
            "The saddest thing is, I probably would have paid them a lot for this skin. I definitely would have paid like $20-25 for it which is, in my opinion, a very high price for a skin. There's even a good chance I would have gone slightly higher into the $30-40 range. But they had to go off the absolute fucking deep end into insanity levels of expensive for it. There's no way anyone in their right mind is spending that kind of money on one skin unless they're using mommy's credit card or just so rich that $500 is literally nothing to them. Even if I had a spare $500 there's no way I could justify spending it on a skin...",
            "Oh woah another ocelot",
            "ya, the point to honour an esports legend is so everyone can do it, not this stupid $500 greed.\n\nand to the ppl who go \"oh don't buy it\", dude it's also $500 for a skin.. how fcking off the deep end are people who defend or excuse that? are we really at a place that people think $500 for a skin is okay? god I miss gaming during the 00s, when you got full games at the full price you paid and it was just expansion packs to get more content for another single price.",
            "I don’t get where you believe you are entitled to this? \n\nFaker is cemented into league forever, in esports and in game, he got a documentary, he gets a portion of the revenue generated from the skin. How is this not celebrating faker? Oh right, you’re too broke for the skin. Guess what, his skin is a 50 usd skin, it’s affordable if you’re willing to spend it. If you really want to honor faker, you can buy his merch for example his jersey to celebrate him. People who are willing to spend will spend this money, and if your don’t, you’re not in the group they are targeting. \n\nThis is already a lot of respect given by riot to honor faker. Whether you buy it or not is up to you, how you celebrate fakers legacy is up to you, nobody forces you to buy that skin. \n\nI have zero clue why players think they are entitled to anything and that anybody owes them anything",
            "Sell the two Ahri Skins for Legendary and Ultimate Prices respectively (+ usual Bundlerate on top) and that shit would make more money than now... plus it would have been less of a PR/Rep. Nightmare.",
            "yeah of course but anyone with more of a personality would sell way more.",
            "What's the point of this comment.",
            "Dude I want to to think the same way you do but at least in the West, the big toxic names are the unofficial faces of League besides the gigantic names like doublelift\n\nNo idea about China, but I'm assuming there's some super toxic players who are mega celebrities there",
            "I'm guessing Korea knows about them since they've climbed their ladders (or tried, I don't follow them to know how it actually went)",
            "For sure, its not a direct parallel but im saying a player's representation of an field/on screen attire carries weight no matter what.  Think about it like this, what if Faker ONLY used the Ahri skin going forward?  It would definitely shoot up in sales.",
            "This is the coldest shit I’ve ever read about Faker. The man is a serious class act, idk how he isn’t MORE famous. He’s one of the few famous people I think everyone should know, because he is generally a great fucking guy.",
            "[deleted]",
            "On the other hand, playing Mecha Kingdoms Jax is awkward after his ASU. The skin is still my favourite aesthetically, but it doesn't feel as smooth as base Jax imo.\n\nSame with Omega Squad Teemo. Awkward auto animations. Surprisingly, since Teemo is old as hell and his animations are trash, but his autos feel good on base skin",
            "Boycotting league skins by banning a champ but still playing the game that gives riot money is like boycotting McDonald's by refusing to order the iced tea. They still get the money but you get the added benefit of looking silly for insisting otherwise.",
            ">\"boycott\" movements for PvP games might as well be a myth\n\nGranted it's not pvp, but the HD2 boycott worked fucking wonders\n\n>The people who would have proposed that aren't there lmfao, they already left the moment Riot unveiled the BS. The people on the league of legends subreddit, surprise surprise like league of legends and don't want to stop playing it.\n\nYeah no shit. I also like League. I'm not proposing dropping the game entirely of course, that's stupid. Just stop playing for the duration of the event to fuck with Riot's analytics of the event's success. If the player numbers drop, then Riot has less of a reason to do it again. What's that, like three weeks? Surely we could've made it through for three weeks without league. Or is the commitment to protest this so low?",
            "[it's a well known clip.](https://www.reddit.com/r/leagueoflegends/comments/83l16o/faker_gets_a_surprise_in_his_shop/)",
            "iirc he said it's his favorite skin",
            "Yet it's still going to get 10k upvotes or so.",
            "It's more like $500 skin is the same cheap boat but with a new coat of paint. Like the skin is great, but it's on the same level as Spirit Blossom. Which is how it should have been priced. And leave all the signature stuff for the $500 version.\n\nThe real fuck up IMHO is the $300 or w/e bundle, not the $500 one. Even though I'm still against the practice of having cosmetics cost so much, but at least, it would have been logical and please everyone.\n\nAlso, people would probably complain a lot less if it were not Faker's HoF's skin. Which Riot used as a milk grab.",
            "It’s not fine if u add that yachts are real and tangible and skins aren’t. You took the point without thinking further than what I said.",
            "Yeah I mean if you take a whole forum as one person. I mean bro are you like baiting or some shit",
            "I'm not?",
            "You’re the one saying it’s different",
            "\\#JustCSGOthings",
            "I’ll do you one better. I had someone call the lobby brokie AND when asked about watching the esport or knowing who the skin is for, the response was, ‘Should I care?’",
            "you know why right. when everyone calls you out for a cosmetic in a game and your harassed for no reason cept jealously or unwanted hate. and this happens constantly every game. you build up defense mechanisms. you really think thats how he would act if people instead complimented him or just no comment? im sure faker would be proud",
            "That's right, is not about being free, but 500 to spare in a cosmetic skin inside a game? Motherfucker, i can get 7 new games of full price of 70 dollars per game and have 10 to spare with that much money\n\nI can buy all Halo games and Bioshock series and i would still have money to spare! (That's the comparison i do in my mind thinking of my favorite games).\n\nThe price is just crazy!\n\nI'm a lol player who buys skins, in my nearly 10 years i have spent 600 dollars, giving me hundreds of skins, chormas, icons etc.\n\nRiot expects me to spend what nearly could be all the money i have ever used in the game, in ONE fucking skin? No ones asked for those extra skins into the package, who even cares about that.\n\nThe lowest tier of the skin cost almost 50 dollars, Riot is on crack!",
            "I would have gotten the $50 pack no problem if it was the $250 version of the skin. The fact that they made a gimped transformation-less version that alone costs about as much as an ultimate skin is stupid af and pushed me away from spending at all.",
            "I would've paid 50 bucks for it plus pass. Bought the RP too but the quality and features just don't make any sense for the 50 bucks version so I just got the pass. Pretty sad tbh but I'm glad the pass is crazy good. Wish passes could be even 50% of this pass and I'd buy every pass. Plus not grind heavy like passes generally are.",
            "You know you can get the skin for $50 right … Not the blonde Ahri but the brunette Ahri, which is also Faker’s skin …",
            "I give a fuck what you think.",
            "Nah, they are testing the waters this shit probably has made them a lot of money and it will get implemented again 100%",
            "Dude there is an opportunity for a YouTube comedic short where it's a satirical behind the scenes mockumentary on t1 training camp except faker is completely aggro and constantly berates and abuses the rest of the team.\n\nLike gumayusi goes negative in a game and faker stands there screaming and insulting him, hands him a blonde pigtail wig and a school girl skirt and tells him he's going to wear it the next time they practice, guma says if faker makes him wear it he'll quit the team. Immediately cuts to the team practicing and guma wearing the skirt and wig with a black eye and a bandage on his nose.\n\nIdk man if faker was willing to play a Brock Lesnar esque attitude character I think there's a LOT of potential for that to be hilarious given the irony of how laid back and humble and underspoken he is irl",
            "No I agree with you.  I do love me some humble faker though.",
            "Seriously. Faker has been relevant for over 10 freaking years in an eSports game, where most players stop after 2-3 years... There has been like 5 or 6 generations of pro players going in n out and that dude is still on the top of them all.\n\nHe is and will always be the GOAT of LoL",
            "> the frist thing you lern in economy classes is not to waste money on brands \n\nNo it isn't, what are you talking about, that's not even what economics classes are for",
            "Look everyone, a Sucker.",
            "Yeah ..? Where and when did I disagree lmfao.",
            ">Granted it's not pvp\n\nThat's why I *specifically* said PvP, and then went on to explain why I thought PvP boycotts were impossible.....\n\nAnd yes, the commitment to protest is that low. For a various number of reasons, but point being, yes it *is* that low. The only thing that might actually make people come together is a LoL 2 where all player cosmetics are left behind. Even then, looking at Smite 2, the outcry is pathetically minute.",
            "fakoomer",
            "tangible or not, if you want a \"luxury\" item (500 isn't luxury) and can't afford it, that's nobody's fault than your own\n\nif you want another digital example, csgo knives go for multiple thousands in some cases, they are luxury items and if you cant afford one you buy a $50 knife, not piss and moan about not being able to afford the expensive ones",
            "Literally nothing of my statement was \"coping\" nor did I even mention balance of the game. Yet you're coming sideways about \"stop coping\". It's much worse if the most idolized player of the game talked negatively in a public setting such as a pro-game post interview about a skin dedicated to him than a commentator taking jabs at game balance.",
            "You do what everyone smart playing league does. You pretend you're in a bot game and no other players exist. If they were not prepared for that, they shouldn't buy a 500$ bragging right.",
            "Instead of purchasing the faker skin, please go support Mr. Miyazaki and his insatiable lust for poison swamps by buying Shadow of the Erdtree",
            "You can get a fucking console for that much money",
            "If the full version were $50 I MIGHT have considered it but that's still a crazy amount for one skin, that's double what the ultimate skins cost. It's at least in the realm of being close to a sane price, were it the full skin. At this point though, it's not the full version and they've made me mad with their pricing so what would have been a borderline maybe is now a hard no.",
            "Tbh - Riot has the data on my acct so theyll know though i doubt it matters.\n\n\nI have bought basically every single pass thats ever came out - i think theres been like 2-3 i missed because i legitimately wasnt able to game those months.\n\n\nWould have easily bought the $50.00 option if there was no others.\n\n\nAfter the $500 cash grab of faker. Fuck em. Not spending a penny on this shit. \n\n\nMy lifetime cash value on this account is like 3-4k last i looked",
            "Risen Ahri is a gimped ass skin that costs about as much as an ultimate skin with none of the features. It’s a rip off. Literally the only decent deal is the battle pass, but given the sheer fuckery of the rest of the “event” why would you even want to buy in?",
            "yeah, its a guess. But im guessing it wont have made as much money in the west vs selling it at like 50.\n\n\nBut im betting China/Korea are making up the sales.",
            "yep he seems like such a nice person and being humble is good too",
            "My friends started playing League long before me, then I started, then they stopped playing, then I'm about to stop playing (still watch esports), since then he was and still is one of the best player in the game and just won another World",
            "I love his relationship to T1, and I know he’s like a partial owner nowadays. But I hope before he retires he attempts to take a team from a different region to at least World finals",
            "bro thinks elon musk is a billionare becuase he buys store brand cereal and not keloggs",
            "Who said I was arguing with you? I just added on to what you said",
            ">That's why I specifically said PvP, and then went on to explain why I thought PvP boycotts were impossible.....\n\nI have to say, I don't really understand why you think PvP games in particular are that different in that regard, HD2 was super popular and they still managed to organize a killer protest\n\n>And yes, the commitment to protest is that low.\n\nI'm not super surpised you think that, but I find it fucking baffling that no one even dared propose it. Like if people on this sub are that addicted, I guess Riot can just do whatever the fuck they want, because the #banahri shit did nothing. It was the League equivalent of \"Leave a like if you cared\". \n\nI'll be happy when this whole thing is over so I don't have to see people crying about their supposed \"activism\" in regards to the Ahri skin",
            "Things being tangible holds more sentimental value than not. 500 is not luxury, but is expensive for most. Especially for a skin. Can you resell ahri skin like it’s on steam market? No. Knives are RNG based, that is why it sells for a lot, ahri skin is bought.",
            ">Literally nothing of my statement was \"coping\"\n\nMaking up new reasons to justify why someone said something is the definition of coping\n\n>nor did I even mention balance of the game\n\nWhen did I say you did?\n\n>It's much worse if the most idolized player of the game talked negatively in a public setting such as a pro-game post interview about a skin dedicated to him\n\nIt's also much harder to do anything about that than it is when a commentator says it",
            "Is it really bragging rights if no one is impressed?",
            "I don't.\n\nI want him to retire with his dignity and legacy intact. Not even Faker could take NA or EU to a world championship and all it'll do is tarnish his final season(s). Going to China would just be a sidegrade from Korea, so there's no point in that either.",
            "I didn't say you were arguing with me... What kind of back and forth is this lmfao.",
            "They’re not bragging. They’re confessing to being consumer zombies.",
            "If we were in one of the earlier seasons I could see him dragging NA to a world's title, but that's more because of the ability to completely run away with a game from the mid lane that doesn't exist like it used to"
        ]
    }
}