{
    "Daily Thread: simple questions, comments that don't need their own posts, and first time posters go here (June 22, 2024)": {
        "title": "Daily Thread: simple questions, comments that don't need their own posts, and first time posters go here (June 22, 2024)",
        "score": 5,
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1dlig2a/daily_thread_simple_questions_comments_that_dont/",
        "content": "This thread is for all simple questions, beginner questions, and comments that don't need their own post.\n\n# Welcome to /r/LearnJapanese!\n\n* New to Japanese? Read our [Starter's Guide](https://www.reddit.com/r/LearnJapanese/wiki/index/startersguide) and [FAQ](https://www.reddit.com/r/LearnJapanese/wiki/index/faq)\n\n* New to the subreddit? Read the [rules](https://www.reddit.com/r/LearnJapanese/wiki/subredditrules)!\n\nPlease make sure if your post has been addressed by checking the wiki or searching the subreddit before posting or it might get removed. \n\nIf you have any simple questions, please comment them here instead of making a post. \n\n**This does not include translation requests, which belong in /r/translator.**\n\nIf you are looking for a study buddy or would just like to introduce yourself, please join and use the *\\# introductions* channel in [the Discord here!](https://discord.gg/yZQKZYdBSw) \n\n\\---\n\n\\---\n\n[Seven Day Archive](https://www.reddit.com/r/LearnJapanese/search?q=Daily+thread%3A&restrict_sr=on&include_over_18=on&sort=new&t=week) of previous threads.  Consider browsing the previous day or two for unanswered questions.",
        "num_comments": 69,
        "comments": [
            "\n#Question Etiquette Guidelines:\n\n* **1** Provide the **CONTEXT** of the grammar, vocabulary or sentence you are having trouble with as much as possible. Provide the sentence or paragraph that you saw it in. Make your questions as specific as possible.\n\n>Ｘ What is the difference between の and が ?\n\n>◯ I saw a book called 日本人の知らない日本語 , why is の used there instead of が ? [(the answer)](https://japanese.stackexchange.com/questions/68336/difference-between-%E3%81%8C-%E3%81%AE-and-no-particle)\n\n* **2** When asking for a translation or how to say something, it's best to try to **attempt it yourself** first, even if you are not confident about it. Or ask r/translator if you have no idea. We are also not here to do your homework for you. \n\n>Ｘ What does this mean?\n\n>◯ I am having trouble with this part of this sentence from NHK Easy News. I think it means (*attempt here*), but I am not sure.\n\n\n* **3** Questions based on DeepL and Google Translate and other machine learning applications are discouraged, [these are not beginner learning tools](https://old.reddit.com/r/LearnJapanese/comments/stepqf/deeplgoogle_translate_are_not_learning_tools/) and often make mistakes.\n\n* **4** When asking about differences between words, try to explain the situations in which you've seen them or are trying to use them. If you just post a list of synonyms you got from looking something up in a E-J dictionary, people might be disinclined to answer your question because it's low-effort. Remember that Google Image Search is also a great resource for visualizing the difference between similar words.\n\n>Ｘ What's the difference between 一致 同意 賛成 納得 合意?\n\n>◯ Jisho says 一致 同意 賛成 納得 合意 all seem to mean \"agreement\". I'm trying to say something like \"I completely agree with your opinion\". Does 全く同感です。 work? Or is one of the other words better?\n\n* **5** It is always nice to (but not required to) try to search for the answer to something yourself first. Especially for beginner questions or questions that are very broad. For example, asking about [the difference between は and が ](https://www.tofugu.com/japanese/wa-and-ga/) or [why you often can't hear the \"u\" sound in \"desu\"](https://en.wikipedia.org/wiki/Japanese_phonology#Devoicing).\n\n* **6** Remember that everyone answering questions here is an unpaid volunteer doing this out of the goodness of their own heart, so try to show appreciation and not be too presumptuous/defensive/offended if the answer you get isn't exactly what you wanted.\n\n---------------------\n\nUseful Japanese teaching symbols:\n\n✘ incorrect (ＮＧ)\n\n△ strange/ unnatural / unclear\n\n○ correct\n \n≒ nearly equal\n\n---------------------\n\n#NEWS (Updated 3/07):\n\nAdded a section on symbols. If it's unnecessary clutter I can always remove it later. Have a nice day!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LearnJapanese) if you have any questions or concerns.*",
            "I learned that (笑) is like lol in Japanese! I didn’t know this until I texted someone. \n\nIt’s very different reading what someone who is a native speaker writes than what textbooks and learning materials have. It’s interesting! \n\nI’m still a beginner and have to look up soooo many words, but it was nice learning something small like that!",
            "Doing quartet 1 chapter 1 workbook excercises  \n1.ホストマザー : 遅かったね。電話もないから、心配したんだよ。\n\n学生:すみません。図書館で勉強していたんです。\n\nホストマザー :帰るのが遅くなる時は、連絡するようにしてね。\n\nI understand 電話もないから as \"because you dont have a phone\", but does it mean that, or is it saying \"you didnt call\"?  \ndoes 帰るのが遅くなる時 mean \"when coming (home) late\"?\n\n2. A: 駅の前に新しいビルが建てられていますね。  \n B : ええ。駅員さんによると、お店の入ったオフィスビルができるそうですよ  \nThe お店の入ったオフィスビル is confusing me. Is the sentence saying \"an office bulding inside a store is being made\"?",
            "Could someone explain the meaning of omataseshimashita?\n\n\n\nGenerally you hear this quite often in Japan, etc on the bus or train.\n\nThe general meaning seems to be  \"Sorry to have kept you waiting \"\n\nHowever, the stem form is 待つ。 and 待たせる mean to make/let someone wait. \n\nEg: 私は田中さんを待たせた。= I made Tanaka-san wait.\n\nSo doesn't お待たせしました just mean \"Made you wait?\" Where does the \"Sorry\" come in?\n\nIs there a story of the full sentence or how this came to be?",
            "I need help with this sentence: The context is in Doraemon. After Doraemon in hiding said to Nobita about his future. Nobita said: \"だれだ、へなこというやつは。”.What do the \"やつは” mean, is it a grammar ? I knew the translation is roughly: \"Who is that, saying something weird like that.\" But can't figure out what the \"やつは” mean.",
            "I've always thought that が is used for specific subjects and は for general topics, but recently I watched a YouTuber's shorts video that seemed to suggest otherwise, and now I'm confused.\n\nThe YouTuber mentioned that in the sentences \"HIKARIちゃん 料理は上手だね\" and \"HIKARIちゃん 料理が上手だね,\" using は implies that Hikari is particularly good ONLY at cooking, which suggests she might not be good at other things.\n\nOn the other hand, using が supposedly emphasizes that she is good at cooking and possibly other things she might be good at. Please clarify\n\n[Shorts](https://youtube.com/shorts/uUMO3T5nb5c?si=vkKNyWm1it-x_9MO)",
            "Does anyone have suggestions for listening practices to distinguish す and つ?  I'm having a hard time searching as all the material is based on pronunciation, not on listening exercises to distinguish words like すき and つき.",
            "In conversational Japanese, are there situations where you would use のは / のが instead of just は / が? Been spending most of my time reading to pick up vocabulary and grammar. Admittedly, sometimes it's difficult to get a feel for what is literary and what isn't.",
            "> 昔、奥さんの職場で自転車通勤してた外国から来た女の子に、大雨のため自転車を置いて帰ることになったため、運んで欲しいと頼まれた。ずぶ濡れになりながら車に上げ下げをして彼女のアパートまで運んだあと、一度、部屋から顔を出してサンキューと一言だけいわれ、土砂降りの中、濡れながら自転車を下ろして最後に手を振って帰ろうとしたら、とっとと部屋に戻っていた。\n\nAny idea on what 車に上げ下げをして means? I think it means to carry a bicycle on back. I am not sure about に.",
            "Why is 澁 (渋) the preferred form over 澀?",
            "\n\nSo this might be a basic question but anyone can tell me how to say “=“ in Japanese\n\nLike for example \n\nDouble C = -4;\n\nHow to say “ put “=“ in between C and -4” in Japanese",
            "Any advice or strategies for a plateau? I've been studying Japanese for a long time and have lived in Japan for the past two years. I'm somewhere between N3 and N2, but I feel like I've been stuck here without making much progress. I don't know why, but I feel like I've hit a wall, and I thought living in Japan would be the most beneficial thing for me (and it many ways it has), but I'm always constantly reminded of how much I don't know and I lose faith that I'll ever be able to move beyond my current level.\n\nAny suggestions?",
            "In a drama, a character said (I'm pretty sure)\n\nすべてに落ちた\n\nShe was talking about how her job interviews went andit obviously means she failed them all. I am wondering why に was used with すべて. I thought すべて itself served as an adverb and に was not necessary. How would the meaning have changed if she had just said すべて落ちた?\n\nThanks",
            "I’m doing Duolingo and it asked “Who is the Chinese Teacher?” My response was 誰は中国語の先生ですか？ however it says that the answer should be 中国語の先生は誰ですか？ is someone able to shed some light on why this is the case?",
            "Hiya - would someone be able to explain the difference between のぞみます and ねがいます to me? Thanks in advance!",
            "I am frustrated after reading the past JLPT N4 exams and realizing how much N3 vocabulary and kanji were included. First, they are not in the Minna no Nihongo N4 list. Second, upon checking their level in dictionaries such as Takoboto or Jisho, they are indeed N3 level. Are we supposed to study one level ahead before taking our target level exam?😢",
            "As far as I know, there isn't any exact translation for this Kanji. I know it's similar to \"love\" in Chinese, but i was hoping some of you may have some insight! \n\nIts part of a riddle, so I imagine there might be some meaning in the components of this Kanji, even if it doesn't exactly make sense when put together.\n[picture](https://imgur.com/a/AmC6X8K)",
            "That to me is the original way to show that the person is laughing, which actually has been in use for print media for quite a few decades, and it's been evolved in many forms to accomodate for easier typing on electronic devices in recent decades. I bet someone has a write-up for all different kinds from that to just \"w\" (for Warai) and then \"wwwwww\" turning into 大草原 then to 草 etc\n\nI just do like そうですね笑, some still does it old-school ways like you've found, some goes the mid way like そうですね（笑 or そうですね。笑\n\nSo I think you'll start picking up on weird end of sentences, especially online. You can see some of that in Japanese community on Reddit as well. (I left some links on r/ja if you were interested)",
            "Communication is often a lot more interesting and fun than textbook studying. You may run into other forms of 笑 written as \"w\" appended to end of something or multiple \"wwww\" meaning laughing a lot (this is a lot more casual in it's usage). You may also see 草 (grass; because lots of Ws look like grass growing) as another form of laughing (also casual in it's usage).",
            "Just wanna add something:\n\nIn standard Japanese, の can replace が in simple relative clauses (e.g., clauses without an を). This の is not the possessive の; it is a subject marker like が.\n\nAlso, just as an fyi, this の is not restricted to relative clauses in all dialects. Check out [this comment](https://www.reddit.com/r/LearnJapanese/s/O0sDKqLmmN) for some examples if you're curious.",
            "電話 can mean \"phone,\" but in this case it means \"call.\"\n\nTo be super pedantic, if you needed to be certain to refer specifically to a telephone, you could use 電話機　でんわき",
            "1\\) yes, yes \n\n2\\) this is something you’ll see a lot. When using a verbal phrase as an adjective, it’s common for を to be swapped with の. You can see that the sentence still makes sense if you swap those. But you have it backwards, “an office building with a shop in it”",
            "There is no \"sorry\" in the sentence.\n\nBut, putting the お at the front, then using the -masu stem and ending it with the する verb makes the whole construction 謙譲語 (けんじょうご), or humble language.\n\nSo, by the speaker lowering his status with humble language, it kind of implies the \"sorry.\"",
            "I'm not sure what the correct term for this, but Nobita is speaking in \"broken\" or jumbled sentences. This is something you'll find a lot in spoken language, but not in formal writing.\n\nIn standard word order, it would be\n\n変なことをいうやつは、だれだ？\n\nSo the やつ means something like \"guy.\" The は is the grammatical topic/subject particle.",
            "やつ in this context is 奴 which is usually a derogatory for third person (and also objects), and tends to be used to a guy. You should be able to find it on dictionary with that Kanji.\n\nSo when translating, you may want to add some harsher tone on this person he's referring to, like \"Who is that fool\" or something rather than plain expression. It shows that Nobita is mad about this person.\n\nEdit: See also: こいつ and そいつ, and these too are rather rough expression for third person or objects.",
            "I recommend watching [this video](https://youtu.be/FknmUij6ZIk) from Misa.",
            "https://jlptbootcamp.com/2012/02/japanese-particles-the-contrastive-wa",
            "Hmmm, go on [forvo.com](http://forvo.com) and find a few words that start with す and a few that start with つ that are similar enough. Download all the sounds and then create a new deck in Anki and just have them be blank on the front but audio play on those cards for the front side, with the answer what it is on the back of the card. If you can add, maybe 10-15 words total it should be random enough where you have to distinguish by listening alone.\n\nOtherwise I honestly wouldn't worry about it. Not everyone is going to pronounce them perfectly to begin with and most of the time when you listen enough and you're experienced enough, you won't often confuse the words that use thees two just based off of context and usage. Even if there is overlap in usage, when you listen enough you'll be able to tell them apart with enough hours spent listening to Japanese.",
            "You need to use のは/のが whenever something needs to be nominalized. For example, 本を読むのが好き would be incorrect with just が. While は and が are frequently dropped, the nominalizing の is much less commonly dropped, even in casual spoken Japanese. So the sentence I wrote above would be 本読むの好き in spoken Japanese.",
            "車 is car. They loaded and unloaded (上げ下げ, literally \"to do raising and lowering of the bike\") the 自転車 onto (に) the car.",
            "Where did you get that information from?",
            "Neither of these will hardly ever be used in Japanese, it's virtually always 渋い. 澁 and 澀 are so rare they don't even appear on the 漢検一級. I don't think it makes sense to say that one is \"preferred\" over the other when both are virtually nonexistent outside of a few family names.",
            "Generally, it's gonna イコール, but with simple math like 3 + 5 = 8, it'll be read as the は particle (さん たす ご は はち).\n\nEdit: Forgot to answer the last question. The base sentence would be something like Cと-4の間にイコール(記号)を入れる. (-4 is read as マイナスよん.)",
            "イコール \n\nIf reading a formula aloud, は is commonly used (like `1 + 1 = 2` -> いち たす いち は に)",
            "Keep going",
            "How do you study?",
            "It's also a noun\n\nThis に isn't adverbial but means \"at\"\n\nすべて落ちた would mean \"everything fell\"",
            "誰は... is rarely used. は is a topic marker, so it should come after the topic, which is 中国語の先生, not 誰.",
            "To desire/hope vs to pray/beg.. You ねがう that your のぞみ come true.",
            "There are no official lists for where a word or kanji belongs to in the JLPT, no matter what your textbooks or jisho tells you. \n\n\nJust accept it, JLPT is already catering to you a lot and part if learning a language is to learn how to deal with stuff you don't know and how to fill in the blanks.",
            "It looks like a very crudely drawn 愛, but I'm honestly confused as to what's actually being asked here.",
            "I think I'm probably in the middle of writing the kanji \"安\".\n\nThe upper part of the kanji is the outer frame of the brush.\n\n  \nIf you trace the lower part with a brush, the kanji called \"安\" of the line typeface will be completed.\n\nHowever, I thought the horizontal line part a little below was short.Maybe the person who wrote it made a mistake in the middle of writing.\n\nHowever, it grasps the characteristics of kanji correctly, and it is very wonderful. I'm sure the person who wrote this will improve in writing kanji soon.",
            "I did not know that was the old school way! That makes sense for his personality tbh lol but thank you so much! I am very interested so I will check it out!",
            "You’re right it is way more fun than my textbooks lol and it makes me more motivated to learn too! \n\nI love that grass is used as well that is hilarious! 😆  thank you for sharing that with me! I would def be confused if I just saw that by itself",
            "And the switcheroo goes both ways, が can replace の as a possessive, like in 我が家",
            "It's が that's being swapped with の.",
            "So it means something like:\n\n1. \"I made you wait\" (humble)\n2. \"I let you wait\" (humble)\n\n?",
            "The English term for the 倒置法 is inversion/word inversion. I think linguistically it's referred to as an anastrophe.  \nu/speedko24",
            "[Wiktionary](https://en.wiktionary.org/wiki/澀), also how Shibuya in kyujitai is 澁谷 instead of 澀谷",
            "渋 is 澁. Wondering why Japanese used 澁 instead of 澀",
            "I do wanikani almost everyday. I've been using 新完全マスター N2 reading and vocab books for the past few months. I bought a book recently and I've been trying to read that, but the amount of words I don't know is sometimes overwhelming and I spend more time looking up words and kanji than anything else.",
            "Ah, I see. Thanks for clarifying :)",
            "> rarely \n\nMore like never. In question words like 何, どこ, 誰, etc は cannot be used because it makes no sense. There are some very specific set phrases as exceptions (like 何はともあれ) but I can't recall one with 誰 (although not saying it doesn't exist either...).",
            "But can't you のぞむ your ねがい comes true ?",
            "Right? I'm not even sure what to ask 😅 maybe we're looking to much into it.",
            "[https://ameblo.jp/online-shodo/entry-12754209661.html](https://ameblo.jp/online-shodo/entry-12754209661.html)",
            "Yeah I don't think it immediately means the person using it is old (though nearing my 40s, I don't know how younger generations feels about them).\n\nI have been in online discussion among adults about \"what should be the proper way to do this without looking too childish but with adequate amount of relaxing vibes\" (which was on Quora) and it seemed like そうですね。笑 got the most vote for that, as in probably I can use it to my boss for private text chat or something like that. (I have never seen that in my real connection but there it is lol) Anyways, yeah I think it does reflect the personality to some extent, but it also has to do with what sort of online community they were attached to. Or at least so I thought..\n\nThose who are not really attached to online media like SNS started to use more relaxed version but that confuses me because it doesn't match the preconception of the associated characteristics.. (The shock when my mom and nephew started using \"w\" which I associated with rather scummy end of online culture space lol - they're popular enough that my stereotype is simply not relevant.) So in the end I think there's not a lot of use in learning which one is what lol",
            "Yes to number 1.  Or, if I might take the liberty to add in words that are not explicitly stated, but implied by the humble grammar: \"I, the humble cretin that I am, made you wait.\"\n\n\"Let,\" in English, has the sense of having power or authority over the object (in this case, \"you\") as well as implying a desirable outcome, so 2 doesn't really apply here.\n\nEdit: As to what I think you are asking, yes, the causative させる form of verbs can be translated as either \"make\" or \"let.\" The meaning is usually apparent from the context, as well as there often being \"giving\" verbs like くれる or もらう after it, or it being put into the \"suffering passive\" form.",
            "https://goforit-stringer.com/%E6%BE%81%E8%B0%B7%E3%81%AE%E6%BC%A2%E5%AD%97%E3%81%AE%E7%94%B1%E6%9D%A5/\n\n> 「澁」は澀の止の1つを日本で省略した字。\n\n> 常用漢字「渋」は近代さらにそれを略した形。\n\n> 「渋」や「澁」は中国や台湾では存在しないようです。\n\nThey're all originally 澀, but it was simplified in Japan many years ago into 澁 and then 渋.\n\nOther sources seem to corroborate this: https://ameblo.jp/khanczy/entry-12661047945.html\n\nBut both of the other variants are quite rare in Japan, and you'll only really see 渋, aside from a few family names.",
            "You aren't gonna get anywhere doing just WaniKani and JLPT test prep. The only things you really need to get better at Japanese is some content you enjoy and a way to look up words and grammar you don't understand. SRS like Anki is great, and even WaniKani isn't that bad, but even those are optional.\n\nTry to force yourself through that book. Yeah it'll suck, you'll be looking up so much, it'll take fucking ages, but we all have to do it. Just find something to immerse in where your enjoyment outweighs that feeling of being overwhelmed.",
            "I recommend reading books with yomitan. If you have an epub of a book, you can upload it to reader ttsu and then be able to yomitan any words you don't know.",
            "well, you can... I guess that my last sentence was pointless.",
            "One interesting anecdote is I watch a lot of streams and that occurs no both Twitch and YouTube. It's interesting because 草 is the dominant form of expressing laughter on YouTube chat while on Twitch chat it's 'wwww'. With some streamers even having their own version of it like 茶葉. Places like Discord are also mixed just depending on the server alone too. Also, your comments about the feeling of each help me confirm that my own feelings on it are appropriate; that feels good to know.",
            "Oh wow that is really interesting! There seems to be a lot that you could look into there! I know I’d def watch a video essay about it lol \n\nAlso the jump from online community slang to being popular enough your mom uses it is very funny to me, I love that!",
            "茶葉 is definitely new to me. I like the aroma coming off of that phrase lol\n\nI suppose, like any slangs, new things springs up everyday and some stays within community, and if that streamer gets notoriously popular then probably my mom start using it in our family chatroom too lol\n\nThe thing is, I don't use them a lot between my real-life friends, which might be a tad different from 'lol'????? I don't discuss about this but I intentionally suppress the use not only to my colleagues and whatnot but just everywhere outside online relationships. It can be generational or just my circles, but I never really discussed this so I wonder how it is for other natives of various age ranges.",
            "I had wrote in anoter comment that I don't use most of these in my real life friends - perhaps I'm trying to avoid being judged like my mom because I don't know what kind of online world they're exposed to.\n\nAnyways, I think the rule of thumb here is just to stick with the convention in your circle, be it online or real life, and I think you'll start feel comfortable with expressions. (Same for any language though just saying - I made cringe mistakes in English and my palm is sweating just by remembering that lol) Some must be hard to pick up when there's tricks involved (like 藁 which intentional mistype of 笑 as in わら of 笑い), but I'm sure many here, especially natives can tell you quite quickly\n\nedit: details",
            "Oh I see! That does seem like a good rule to follow and hopefully I can get more comfortable with it! \n\nI also get nervous about mistakes. I’m just now putting myself out there more so I am sure I will make a lot more, but oh well lol",
            "Oh yeah definitely! I was actually worried a bit about my last comment encouraging to be risk averse, so glad you mentioned that - because I attribute where I'm at by being open for mistakes too! I think my previous advice is more for native speakers.\n\nHave fun with the jorney on relaxed languages! Maybe it won't help you much with Japanese exams but it's very useful in communication!",
            "Thank you! Communication is what interest me the most so I will have lots of fun! ✨"
        ]
    },
    "Weekly Thread: Meme Friday! This weekend you can share your memes, funny videos etc while this post is stickied (June 21, 2024)": {
        "title": "Weekly Thread: Meme Friday! This weekend you can share your memes, funny videos etc while this post is stickied (June 21, 2024)",
        "score": 3,
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1dl3gil/weekly_thread_meme_friday_this_weekend_you_can/",
        "content": "Happy Friday!\n\nEvery Friday, share your memes! Your funny videos! Have some Fun! Posts don't need to be so academic while this is in effect. It's recommended you put \\[Weekend Meme\\] in the title of your post though. Enjoy your weekend!\n\n(rules applying to hostility, slurs etc. are still in effect... keep it light hearted)\n\nWeekly Thread changes daily at 9:00 EST:\n\nMondays - Writing Practice\n\nTuesdays - Study Buddy and Self-Intros\n\nWednesdays - Materials and Self-Promotions\n\nThursdays - Victory day, Share your achievements\n\nFridays - Memes, videos, free talk",
        "num_comments": 1,
        "comments": [
            "Middle schooler wearing short sleeves and shorts does not feel cold despite snowing XD\n\nI like watching videos like this since the grammar is easy to understand and their usually funny\n\n[https://www.youtube.com/watch?v=aQpT1BfQ8Pc](https://www.youtube.com/watch?v=aQpT1BfQ8Pc)"
        ]
    },
    "The second opening for the Frieren anime is titled 晴る (はる) (sunny), but I have never seen this used before. Can someone explain this to me?": {
        "title": "The second opening for the Frieren anime is titled 晴る (はる) (sunny), but I have never seen this used before. Can someone explain this to me?",
        "score": 68,
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1dlkaii/the_second_opening_for_the_frieren_anime_is/",
        "content": "It gets translated into English by other sources as \"Sunny\", but I thought that was 晴れ? To get sunny is 晴れる. So what the heck is 晴る? It clearly isn't 春 (also はる), since that is \"spring\", like the season. Yorushika (the artist), seems to have either made up a new word, or I'm missing something here.",
        "num_comments": 27,
        "comments": [
            "晴る (はる) is the archaic form of 晴れる.",
            "So in Classical Japanese, verbs had an adnominal form and a \"conclusive\" form, the former used in adnominal clauses and the latter when the verb was the predicate of a main clause or otherwise ends the sentence.\n\nThe ichidan (monograde) verbs (also called -ru verbs or Group II verbs) now only show one vowel as their stem but in Classical Japanese, they had -u in the \"conclusive” form (which is why they were called nidan (bigrade) verbs):\n\n晴れる was used in adnominal clauses and  晴る as conclusive form. In modern Japanese, the adnominal form took over the function of the conclusive form and the \"ichidan\" verb was born.\n\nYou can find remnants of the old system in written speech, so that's probably what happened here.",
            "Songs very commonly will get creative with spellings like this, in lyrics and titles. Maybe yorushika in particular too",
            "How a Japanese would search for the song? If I type はる I only get 春, so I have to type 晴れる and then delete the れ.",
            "I guess you could think of 晴れる as the passive form of 晴る, right? Nothing is causing the weather to be sunny, so it just is sunny.",
            "Does this apply to 暮れる too? ",
            "Definitely a yorushika thing. They use a lot of flowery language and references to old poetry in their songs.",
            "as a Japanese I would do the exactly same",
            "h a r e <space> (until 晴れ is chosen) <enter> <backspace> r u <enter>\n\nYou are correct. This is the instinctive way to create weird kanji combinations.\n\nMy wife's kanji are weird and I'm too lazy to add an IME dictionary entry for it, so I just take the most common words that use those kanji and delete all the extra stuff to get my wife's name when needed.\n\nI accidentally called her by the two words I use to type her name once. It made her burst into laughter.",
            "You can still type はれ and the kanji for 晴 can come out without the れ, so just select that. And then add る.",
            "All Japanese people do this",
            "Welcome to Japanese... Anyway on my keyboard I get 晴 as one of my top result instead of 春. It's because I've been using the kanji more frequently with 晴れる maybe? Or my phone keyboard just to rocks? I dunno",
            "Both 晴れる and 晴る are intransitive, and both of them mean \"to clear up\"/\"to get sunny\". In order to get the \"be sunny\" meaning, it'd need to be 晴れている. (In kobun, I think it'd 晴れたり, but I'm not sure since I'm not an expert on that).",
            "No, they're the same form.\n\nThe old one was 晴れない 晴れます 晴る 晴るるとき 晴るれば 晴れよ\n\nThe new one is 晴れない 晴れます 晴れる 晴れるとき 晴れれば 晴れろ",
            "I think you mean “intransitive”, but 晴れる is already intransitive.",
            "Yeah, 暮る (くる) is the archaic form of 暮れる.",
            "So Japanese people don't know a better way too to say input names of people than to just type in random other words that contain the appropriate characters and then delete parts?",
            "if you add her name to a contact with the reading, it should memorise it",
            "Or 晴るれり.",
            "Just a completely random thought, but\n\n晴れよ sounds like \"Oh heavens, please grant us a sunny day\"\n\n晴れろ sounds like \"Piss off, go make the day sunny or something\"",
            "I mean, it’s not exactly their fault lol.",
            "If it's an uncommon word but that is common-enough for you that you need to use it often, if it doesn't exist in the IME you can usually just add it. Most IMEs have a personalized dictionary or something. This is common for names for example.",
            "For phones, sure.",
            "you can't use り like that, it only attaches to 四段 or す",
            "PC has the exact same thing.\n\nTry right clicking on the IME icon in the tray and seeing what options there are, or maybe even reading the manual. \n\nOr if that sounds too nerdy for you, just google \"Japanese IME pro tips\" and you should find a hip article or a dozen.",
            "Ah, so it is.",
            "I mentioned the IME dictionary in my original post.\n\nI am aware of it."
        ]
    },
    "\"Overtourism\"=Disheartening to studies?": {
        "title": "\"Overtourism\"=Disheartening to studies?",
        "score": 80,
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1dlg59t/overtourismdisheartening_to_studies/",
        "content": "I keep hearing/reading about overtourism in Japan right now, and as someone who's been self-studying for a little over a year and hoping to visit some time in the future, it's becoming sort of disheartening. I want to visit in order to experience all of Japan and learn as much as I can and talk to people, and there's this annoying thought in the back of my head that by the time I get there I'm going to be perceived at this annoying tourist regardless of what I do. I totally get it...if there were a bunch of visitors acting like a\\*\\*es where I lived (although literally no one wants to visit where I live LOL), I'd tend towards feeling that way too. Is anyone else experiencing this sort of thought/feeling? ",
        "num_comments": 101,
        "comments": [
            "If you can speak Japanese you won't be that annoying tourist in the first place.\n\nThe ones who are annoying are the ones who know nothing about Japanese culture or customs and don't respect it.",
            "The annoying tourists are the ones who lack any awareness and/or willingness to conform to the customs of those around them. eg. the tourists who talk super loudly on the subway or that video of some lady blocking the path of the geisha in Kyoto because she wanted to get photo of her like she was a circus animal.",
            "You are thinking too much about this. Just go there, be polite and talk to people. As long as you act like a decent human being you're gonna have a great time, for sure",
            "There is a lot of Japan that is not Tokyo, Osaka, Kyoto and Nara. It's easy enough to avoid \"Japan as theme park\". Most people in Japan appreciate someone who shows genuine interest in the language and culture; more so if in a place not awash in foreign tourists.   \n  \nTottori, Matsue, Onomichi, etc. etc. are all lovely.",
            "I agree with the sentiment to avoid the touristy places to a certain extent.\n\nBut it's not like those places are popular by accident. They're noteworthy and more likely than not worth your time. Definitely think about where you'd like to go and what you'd like to experience before blindly following someone else's itinerary. And yes, there's so much more to explore than the Golden Triangle of cities as well.\n\n  \nNow where nihonjin can definitely get annoyed is when you're going off the beaten path and armed with a gopro to \"eXpLoRe REAL JaPaNggG\" imposing yourself in spaces where you could be a burden, like a local sunakku and forcing them to give you turns singing karaoke, which I read someone on one of those subs did until he was kicked out. When I read it I thought, \"Like how did you not realize that they didn't want you there? Or did you just not care?\" No matter, some tourists like this one treat the whole country as an amusement park and even the most xenophobic nihonjin is justified in not wanting to put up with that kind of tourist.\n\nOP, you'll be fine there. Most will appreciate and even praise their effort; a couple will be annoyed or just not give a shit. But don't take it personally, they might not even want to put up with other Japanese that day. I learned to accept that the most conscientious tourist is still a tourist and does require some level of grace and patience from the locals; just be grateful for it. No use getting anxious or discouraged by it.",
            "You will not be lumped in with the selfish tourists who did no research on how to present themselves. I’ve been twice in the last 8 months and I’m awful at Japanese but every Japanese person I’ve met that can speak English, has thanked me 10 times for trying to learn Japanese. Enjoy your visit when you go",
            "Controversial and I am sure unpopular suggestion: go and read r/japantravel for a bit. Note down the itineraries there and then \\*don't\\* go to any of those places. \n\nThat's a bit extreme, but there is a lot more to Japan than fairly well-trodden tourist routes. If you want to meet and talk to Japanese people you will have at least a different set of opportunities in less \"you must go here\" sorts of places.\n\nOf course \"all of Japan\" does include Tokyo, Kyoto and so on, but there's a lot more to Japan than that. Shikoku - an entire home island - rarely seems much by way of foreign tourism (sometimes people go to Naoshima which is technically in Kagawa, but...). Lots to see there, though easier if you can drive and rent a car. \n\nBut as others will point out better than I, even in the really tourist dense areas, you will surely find people to talk to - that was my experience - and if you go even a hair's breadth off the very beaten track you will find all sorts of experiences. Obviously if your time is limited you will miss out on seeing the key tourist spots, but you might enjoy yourself more. Life isn't a tick box.\n\nWell, that's my thought. I rather enjoy wandering around the towns and cities of Japan, as well as in the countryside.\n\nThe other people commenting are making more conventional points, but they are all good ones. Don't overthink, be friendly and polite and so on. All good.\n\nSome places it seems easier to get into conversation with locals than others. Some places it is hard to get a konnichiwa out of anyone but in others people do come and chat (even when they aren't Jehovah's Witnesses).",
            "if anything, you'll know better what and what not to do when you're there. none of my japanese friends there give a shit about overtourism.",
            "I wouldn't worry about it, but I get mistaken for Japanese so they wouldn't care about me. \n\nBut while I was living there during the pandemic, it got to the point where business owners and such kept admitting that they need tourists to keep their business afloat. So if anything, a lot of them probably have a new appreciation for tourists.",
            "Anyone who will view a stranger like that likely isn't going to be your friend to begin with. There are plenty of people there who don't care about that.",
            "Being quite honest, overtourism isn't your problem. Japanese citizens need to make their thoughts on tourism crowds clear. Be respectful to people and you'll be fine.",
            "I wouldn't worry too much about over tourism in the big picture sense.  There are places like Kyoto where it's really bad because the town can't accommodate the influx of tourists because of geography, infrastructure, and a commitment to maintaining a kind of architectural style.  On the other hand, Tokyo and Osaka are mega cities that easily absorb the tourists.  There's plenty of places in Japan to visit.\n\n\nAs far as manners / attitudes go, Japanese locals are of course irritated by poorly behaved tourists and bothered by inconveniences in places where the infrastructure can't accommodate the volume of tourists.  But with respect to a single, relatively well behaved individual tourist, the average local Japanese person in the big cities really doesn't care.  You're just another person in a crowd. Japanese people in the tourist industry are very happy to have customers and while locals might not be happy about overcrowding in some places, shop owners are very happy to have plenty of customers.\n\n\nSo don't over think it, it you have a chance to go, go for it ",
            "Just visit the less tourist heavy places.",
            "Similar situation. I studied for a year and went to japan for two weeks last April. A few things to unpack:\n\nI accepted that I was a tourist and was going to be treated as such no matter fluency or cultural competence.  Once I did this, it was freeing, and I enjoyed my time there.\n\n\nAlso, halfway through my studies, I had to make an honest assessment and ask myself why I am learning japanese. I settled on this: I am learning for myself for my own enrichment.\n\n\nI had some lovely conversations long and short, but also some pretty hostile encounters.\n\nNice encounters: \n\n A 20 year old who was studying English noticed I said お邪魔します and 失礼します on the plane, and we talked for hours and exchanged LINE information. \n\nIn Kanazawa, the restaurant staff was amazed and got 上手 quite a bit. Same in Gero Onsen and other small and mid-sized cities. They really appreciated the effort.\n\nBad encounters: \n\nTokyo was no different than most American East Coast cities. The problem really is kyoto. It was  not very nice because you can tell they are fed up, and they are also very stuck up. Fuck em.\n\n Osaka was more friendly and fun, but also they were very happy to get your money. \n\nOverall: \n\nI enjoyed my trip and am already planning to go again. Do things for yourself, and you won't be disappointed, and the people worthwhile will be there.",
            "I live here. Just don't treat the country like your personal playground, follow basic human decency norms and you should be fine.\n\nMaybe it's because of the region I live in, the worst I get is sometimes when I fumble a bit trying to say longer sentences, the other person will cut me off to try to get things moving.\n\nNote, I'm talking about *actually talking to people*, not a transactional interaction with a worker where time is of the essence.",
            "I'll tell a little story. Of way back in... early February of this year.\n\nThere was a freak blizzard in Shinjuku. I cancelled my day trip to Nikko and ended up drinking at a little bar in Golden Guy with 2 Japanese guys and the lovely bartender. Zero English was used by anyone.\n\nThe discussion turned to how before Last Train, Golden Gai is like 70% tourist. Not even really a negative way, more just an observation. I joking played up a mock feeling unwelcome, and the bartender immediately was like \"Nah, don't go home, you're basically Japanese.\"\n\nMy secret? I spoke Japanese and didn't act like an asswipe.",
            "Tourists all go to the same handful of places. Just go explore Tohoku or something instead.",
            "I have the same feeling. There has been so much negativity lately, I don't want to be yet another unwanted annoying foreigner so lately I have been feeling a bit discouraged as well.\n\n\n\n\nOn the other hand if you're worried about that kind of stuff you're probably not the type of person that the locals hate. ",
            "Go to the countryside lol Then you’ll really need to practice",
            "You can’t control how other people perceive you and it’s not worth worrying about that much. Attitudes to tourists wax and wane.",
            "Just shout ’日本が大好きです’ And you’ll be fine. ",
            "I have gone to Japan quite a few times and often go outside of the touristy places due to my other hobby (And I had been to Kyoto, Osaka, Tokyo in my first trip there years ago), sometimes to far flung places that few Japanese have even heard of. Tourists mainly annoy  Japanese and Japanese business owners by\n\n\\* eating while walking on the street. Either you take the food back to hotel or eat right outside of the food stall that sell the street food so the smell of your food or the food itself doesn’t get onto other pedestrians\n\n\\* ordering the amount of food less than  the number of servings of people in the group. For example, ordering 2 sets of lunch for a group of 3 and then share or even one of the person not eating. That’s a big no-no. Order the exact number of sets of food for the number of people in the group. if you are in an izakaya, you need to order at least one drink per person.  if you finish your drink, some izakaya expect you to order a new one\n\n\\* littering.  Take  trash back to hotel. I usually keep a plastic bag in my bag just to keep all the trash throughout the day.  You can use the trash cans outside the convenience store but only if the trash comes from products you bought at the store from what I heard.   You can also use the trash cans at train station platforms. Also put the trash in the right trash can (combustible vs newspaper vs cans and bottles,etc) . Never litter.\n\n\\* using cash when riding bus and holding up the bus while fumbling how much to pay on the way out. Use transit cards like suica or pasmo card when riding buses. Tap the card on the way in and tap the card on the way out, and the machine will figure out the fare and deduct the right amount so easy for everyone.\n\n\\* Being loud on train or bus.  Japanese can tolerate a lot on a train (I had seen a woman laying a dozen makeup things out on the window sill and put a full makeup on during the ride) but one thing they don’t like is noise. Some teenagers may get loud on a train but you are an adult and they expect you to act like one. Turn your phone to silent mode. Bonus:  if you are a man on a crowed train, keep your hands up on a pole or something so they are above your shoulder and visible for all to see, just so no one can claim you get handsy on anyone.\n\nIf you want to talk with local, izakaya outside of major cities are your  best bet because they see far fewer tourists. But even they usually get fully booked or extremely busy on Friday nights.  Also, only talk with them when they are open to talk.  Not everyone wants be your free japanese practice partner",
            "Every time I went to Japan it was pretty clear that the only annoying tourists were the Americans and the Chinese.",
            "I think you’re overthinking this. I went to Japan twice last year in January and December 2023 and plan to go again this year. I had no issues as a singular woman  who speaks Japanese. The people they have problems with are large groups of people that take up all the space. In the case of my friend that I went with in January (who couldn’t speak much Japanese) people weren’t bothered by her either. We didn’t talk loudly and observed Japanese etiquette based on what we were seeing around us. You’re already learning Japanese and planning to do this too, so you’re off to a great start. Heck, you made this post, that shows you care.\n\nMy advice is choose to avoid areas that are super crowded or if you must go, go at non peak hours. There are plenty of amazing activities that you can do that most tourists aren’t doing. There are also awesome cities that no one is visiting. One of the cities I went to was so unwell known that a few Japanese people I met struggled with the kanji. I went to an area where I and two other guys (who live in Japan) were the only non Japanese people were visiting (we were in a hiking group, which was awesome for my Japanese practise).\n\nThere are some awesome etiquette videos online and do’s and don’t’s. I’m sure you can find some.",
            "I guarantee you that you're thinking about this more than the average Japanese citizen. Just follow the golden rule of 'don't be an asshole' and you can make a better impression than others have.",
            "So I kept hearing this and I’m in Japan right now. I’m white, blonde hair, blue eyes—obviously a foreigner. Just remember, Japanese ppl want to provide the best service to you. I only had one incident where the Japanese server at a restaurant got someone else who could speak English to take my order. I ordered in Japanese still. He prolly went back and told them I can speak Japanese bc after that she would talk to me. I went there again a few days later and that same lady talked to me in Japanese. So they aren’t being rude, they just want to provide the best service so don’t be disheartened and speak it. \n\nAlso, I’ve been studying for 2 years. Just go. As long as you are not loud or obnoxious, you’ll be fine. And don’t believe everything you hear on TikTok. A lot of it is bs. \n\nAs I said I stick out like a sore thumb but I’ve never felt more at home. I even had a kid come up to me and ask me in Japanese what time it was. He could’ve picked the other Japanese ppl standing there but he picked me. I answered him in Japanese. Maybe he just wanted to talk to a foreigner but I was super glad he felt comfortable to approach me and ask in Japanese. It made my day.",
            "If you go anywhere even slightly outside of the main tourist destinations, it's much more comfortable. You don't even have to go far: you can be a twenty-minute train ride from the center of Tokyo and not see a single tourist; you can be in the middle of Nagoya and not see a single tourist. Even in Kyoto, the over-touristed areas are very specific.",
            "I will say it's a bit disheartening, seeing people with no JP either have more fun than me or shit up the place. But at the end of the day my studying is mainly just reading or watching what I want in Japanese. Even if I was banned from visiting Japan, I wouldn't stop what I'm doing because I still want to read or watch those things",
            "No they’re not suffering from “overtourism”. Places like Kyoto isn’t being managed effectively and blame over tourism to save face. Smaller areas where the population are significantly smaller and are all grey hairs, yeah they got issues.",
            "My wife and I hate disrespectful and downright idiotic tourists. \n\nDon’t be a part of the latter group and you’ll be fine. If Japanese people see you trying to make an effort to be respectful as well as trying to speak the language, 9/10 will assist you.",
            "It's the same as any other place, \"Don't be an asshole and most people will have no problem with you\". I live near, often visit and used to work in NYC and I rarely had issues being around tourists as long as they just acted like a normal person (no matter what state or country they were visiting from).",
            "You're not going to experience \"all of Japan.\"  There's too much, across too many contexts, and too many places. But that's good, because most of that over-tourism you keep hearing about is in, like, less than half a dozen places. If you're really *that* worried about being another tourist in the fishbowl, then just go somewhere else in Japan.\n\nContrary to popular belief, Japan is huge. You don't have to just go to Tokyo and Kyoto. Go to Kagoshima. I'm always telling people to go there and no one does. But you should--black vinegar cuisine, best wagyu, endless shochu, and an eerie, well-worn, well-loved, former-glory vibe. Or go rent a car in Okayama (place by the station has great rates) and drive around Shikoku on a wild narrow-road adventure. Read some Dazai and then spend some time traipsing around Aomori.\n\nI guarantee you will not see *any* over-tourism in those places. You might not even see another non-Asian tourist.\n\nAlso, as a heads up: It's almost as cringey to be an overly self-effacing tourist as it is to be a thoughtless one. Not quite, but almost. An ounce of common sense will benefit you immensely. Just be normal and Japanese people--like people anywhere--literally won't give two shits about you.",
            "As a tour guide and an Airbnb host, I'm loving all the work.\n\nI am also working with the Japanese government to plan tours to areas in Japan that international tourists don't know about. I'll be in Ehime next month.",
            "Don't go to the touristy areas if you're worried. :p",
            "I've spent about 4 years in Japan, 1 year studying in Kyoto, half a year in Tokyo and half a year in a little hot spring town in Kyushu. Being able to hold the most basic conversation in Japanese will set you apart from tourists and lead you to places tourists simply won't know about. That being said, if you don't blend in with the crowd, it takes a bit of work to get past the *gaijin kabe* (foreigner wall) to get to the conversation, and that gets harder depending on where you go.\n\nIt's hardest in Kyoto where the locals are fatigued by wide-eyed tourists clogging up public services and turning their local neighbourhood shrine into a superficial photo opportunity. If you go to bars and izakayas anywhere outside of Shijo Kawaramachi and Gion, though, you'll get to meet locals in a more conducive environment.\n\nLiving in the countryside makes you more of a curiosity - there are definitely places that still rarely get foreign visitors and that can turn you into a bit of a spectacle. If you speak even a little Japanese there, people tend to be blown away. That being said, unless you're making a life there, there might not be enough common ground to get over the *gaijin kabe* and have a proper conversation.\n\nTokyo has been the most comfortable for me. People here are simply used to foreigners, so there's less wrangling with the *gaijin kabe*, and the city is large enough that there isn't really \"over tourism\" like there is in Kyoto. Tourists tend to cluster in niche neighbourhoods and sightseeing spots like Asakusa or Akihabara. Wandering down nightlife streets in Shinjuku, it's not hard to find a small izakaya where the owner chats with the customers while serving.\n\nUltimately, you will get out what you put in. If you hit all the tourist spots, constantly taking pictures and shoving Google Translate in people's faces, you will be treated like a tourist. If you demonstrate you have learned more than \"konnichiwa\" and \"arigato\", and treat locals like any other human being, you will be treated in kind. That is to say, I have N2 in Japanese and still have to convince people that I am in fact capable of conversing with them in their language on a regular basis. My advice is to not be afraid of going off the beaten path! People will more often than not reward you for it. If you really want to immerse yourself, consider joining the WWOOF programme as I first did going to Japan. You get to skip right over the tourist boundary and live with the locals. Whatever you do, best of luck!",
            "Just don’t be annoying, it’s not that complicated.",
            "I recently traveled back to Japan for 2 weeks after having lived there for 12 years as a child (my Japanese is embarrassingly *very* rough). I felt the overtourism that people talk about in only two places: Dotonbori in Osaka and Shinjuku/Shibuya/Asakusa in Tokyo. My brother and I traveled to lesser-known places like Onomichi, Okayama, Shizuoka, Takamatsu, and Kisogawa near Nagoya and the disparity between tourists there and in a few concentrated locations of Tokyo was stunning (I think we saw \\~8 foreign tourists in our whole day in Takamatsu). Travel somewhere a little lesser-known!",
            "Like was said here, if you know at least a little bit of the language and respect the customs you won’t be perceived as one of those shitty tourists. I just got back from a two week trip and I had great interactions all around apart from a few awkward stares here and there. All I mostly said was すみません、ありがとう、and これをください and people were excited to talk to me and ask where I was from.\n\nIf anything, someone like you has an obligation to go and help out the reputation of western tourists that’s getting destroyed by influencers and disrespectful idiots alike.",
            "Don't let the media and online discourse dishearten you. It's mostly (semi-racist) finger-pointing. They ban alcohol on the streets because of some misbehaved tourists in Shibuya but anybody who did a pub crawl in Shinbashi or Yurakucho on a Friday night knows that Japanese salary men are not an ounce more behaved when drunk on the street. \n\nIn reality, only very few places in Japan experience actual over-tourism, and most of them are in Kyoto. For your own sake, stay clear of the \"beaten path\" as much as possible. Don't visit the big spots in Kyoto that are overrun by tourists, it's just not worth it. The reason why those places became famous in the first place is their unique architecture and atmosphere. But with thousands of people around, it all feels like a theme park. There are many places in Japan where you can still have old houses and a nice atmosphere without the tourist masses. \n\nDon't visit places just because they are on a list, visit them because you want to. I am often in Akihabara to shop and in my experience 40-60% of the tourists there are not even that interested in Anime and Manga or to buy anything, they are just there to see the \"Otaku theme park\".",
            "I don't live in Japan so idk what it's like year round. But when I visited Tokyo, osaka, and kyoto, I occasionally saw white people but it was genuinely rare. Mind you, this was mid fall. So idk if there's actually overtourism since I barely even saw any. I think like 1 or 2 per day.",
            "When I visited pre-pandemic, it was astonoshing the amount of places that banned selfie sticks, that were kind of a trend at that time among certain tourists.\n\nThere were also issues related to trash in Okinawa for example, in 2017 ([link](https://www.newsweek.com/okinawa-islands-struggle-deal-tourist-waste-visitor-numbers-boom-608114)).  \n\n\nJapense people being annoyed because of disrispectful tourists is something that happened since ever. \n\nYou will have no problems if you behave like an average human being with basic manners.\n\nStill, since you like Japan more than the average tourist (to the extent of even learning their language!), it's likely that you will enjoy lot of not-so-touristy areas that casual travelers usually skip. On those areas, it's unlikely someone would have experienced disrespectful tourism first hand to begin with",
            "If you come here and respect the culture, the people, and the unwritten social rules, you’ll be fine. Don’t let what you hear sway you. Yes, there are a lot of people here right now, but we’re really only annoyed by the idiots who can’t act civilized",
            "The Japanese are xenophobic, but are happy to take your money as they're poor now.",
            "When I went to Japan last august, tourism was never really brought up as an issue. To be honest, I knew no Japanese whatsoever and I had to basically \"Learn by seeing/doing\"\n\nSo how did I manage? Very nicely thank you. I think I sat in the wrong place in the onsen, but nobody really got mad and scolded me about it. It's about behaving yourself, being polite, and when you mess up, admit up to it and try to avoid doing it again.",
            "you would have been perceived as annoying tourist even if you would come before overtourism. that’s just how society works there. if you are not thick skinned enough to live with it you better don’t come.\n\novertourism is making it harsher though. even i being non japanese would like to punch in face quite a number of tourists ",
            "Over tourism is mostly a problem in the places where all foreign tourist go. Went to Toyama this year and had a bunch of people ask me why I decide to go, that show how foreign tourists are not that frequent.\n\nWould say it’s easy to avoid the area that are full of these tourist you want to avoid.",
            "Go to other places in Japan. Avoid Tokyo and Kyoto. Too many tourists there.",
            "Japanese has been oversaturated for a while now. You are no longer special for learning it.",
            "Thought Japan is dying out. So is it dying out or getting overpopulated? Can they make up their minds?\n\n> there's this annoying thought in the back of my head that by the time I get there I'm going to be perceived at this annoying tourist regardless of what I do\n\nThat will most likely be the case.",
            "While that's true, it won't stop the overcrowding, the new restrictions, or Japanese people's attitudes toward visibly foreign individuals. I've seen enough fluent long-term residents say that they have noticed a difference in how they've been treated over the past few years to understand that this is a legitimate concern, even if you aren't actually a shitty tourist.",
            "Came here to say this. Same boat for me, but knowing that your passion and effort to learn/understand the culture is leaps and bounds above the annoying tourists, you’ll do good.",
            "honestly you can just erase the middle-->  the ones who are annoying are the ones who don't respect it. \n\npeople who know nothing about a place's culture can still be respectful and careful and apologetic if they do something wrong.  the people causing issues are the people who leave dream vacation beaches full of rotting trash, and a lot of them.",
            "Yup. Saw this first hand at the local Yakitori. Young Korean tourist was making her best effort to order and chat with the staff and everyone loved her... she was also adorable. So that helped. ",
            "Yeah, my shrine liked having tourists. But then you has the tourists who smoked inside the shrine area and threw their cigarettes on the gravel...",
            "Aka passport bros.",
            "Exactly this can happen with any country! Even if there isn’t a lot of tourism if someone visits a place and is rude/annoying then people will see them as rude/annoying that is all there is to it lol\n\nIf someone does judge you just based on you being a tourist then that’s fine. That’s their problem tbh",
            "Also shouting out that visiting Izu peninsula, which was a big highlight of my recent trip. Atami-- a big beach and resort/hotsprings town-- is like 40 min from Tokyo Station by Shinkansen, but not crowded. We stayed further south in Ito to stay at ryokan and walk along the Jogasaki coastline (breathtaking!). Everyone was super kind and helpful, and I'll even admit that my Japanese was much worse at the time (though I knew a bit, and at least tried to use it).\n\nI think that experience made me really want to learn more Japanese: just the knowledge that a better grasp of the language would open much more possibilities of places to go. OP, as a 日本語 の学生, I encourage you to make great use of it and travel to places off the usual set of tourist spots! Those were generally my favorite. c:\n(But hey, if you're going to a popular shrine/temple, go before 10am)",
            "The thing is you don't need to do any research on how to present yourself. It's just a matter of being considerate and polite and reading the room. Simple things that unfortunately a lot of tourists fail at",
            "I traveled all over the country for work and leisure while I lived there and my 10-day solo trip around Shikoku was the highlight of my entire Japanese experience. I honestly think the most interesting journey through Japan is one that is mostly off the beaten path (although Nara should be a must).",
            "Shikoku is my goal to visit. I’m worried it’s going to be over saturated with tourists by the time I can actually make it there though.",
            "We have a similar issue with over-tourism in some parts of Spain and I wouldn't blame the tourists (at least not the ones who can behave), it's on local policy to counteract over-tourism.",
            "The overtourism of Kyoto is like when all the tourists coming to Florida flock to Miami or WDW and overlook the other nice places.",
            "This; if you know some Japanese you should be able to explore areas that don't get as many foreign tourists.",
            "Hold on lemme write that down...",
            ">if you are in an isekai, you need to order at least one drink per person. if you finish your drink, some isekai expect you to order a new one \n\nIn an isekai!? Damn this trip is taking a wild turn, haha. Good advice!",
            "Yup. Regarding the customer service aspect, it’s just to make sure your experience is as smooth as possible and not “this idiot foreigner let me dumb it down for them.” Most Japanese people do not expect foreigners, especially western ones, to know much or any Japanese at all, so they do kind gestures like pointing at the pictures on the counter at the konbini, or offering English menus. But once you show that you know a bit of Japanese or are at least trying, they appreciate it. People have to remember that if you’re interacting with someone at a restaurant or store, you are part of their job. Put yourself in their shoes. They want to get the job done and make sure their customer is satisfied.\n\nI always go Japanese first when approaching anybody here and I’ve yet to have a bad experience because of it in the almost 9 months of living here.",
            "I will say that the tourist areas are famous for a reason, though. Yeah sure you can ride a few stations over from a tourist hotspot in Tokyo and see nobody. But in the case of Tokyo, I find that a lot of those neighborhoods are no different than any random neighborhood in any random city here. I live in Sendai — which isn’t particularly known for anything and I have been in neighborhoods in Tokyo that if you dropped me off blindfolded, I wouldn’t be able to tell the difference from some random Sendai neighborhood.",
            "The Japanese are much like the Koreans in that they are not as internationalized as people in Western countries that at one time had vast colonial overseas empires. They appreciate foreigners who are sincerely interested in Japanese culture and language, but otherwise never insist on seeing them. So I would not call it xenophobia.",
            "I don't have any special interest in Tokyo and Kyoto dialect is something I like, so I'd go to Kyoto for that. \n\nMaybe I should try going to Wakayama Prefecture if Osaka and Nara are too crowded.",
            "The issue is that while yes, the population of the country on a. *whole* is declining, the population centers (I.e. Tokyo) are growing in population as more people leave the inaka. It just so happens that those are the places the mass surge of tourists is flocking into as well. And that’s how we’ve ended up in an overtourism crisis.\n\nI live in Tohoku, but the last time I was down in Tokyo, there were areas that had just as many, if not more, foreigners to actual Japanese people. I have never seen it like that before.",
            "idk, I've been in Japan for 6 years and haven't noticed a change. Maybe if you go often to tourist areas you'll feel it, but outside of those you'd barely notice the tourism boom.\n\nPart of the overcrowding problem is that all tourists are sent to the same handful of places. If you want to really be appreciated as a tourist, head to underserved regions like Tohoku or far west Japan/Kyushu. Even within Tokyo, there are [rich cultural spots that haven't made it to the travel guides](https://www.reddit.com/r/JapanTravel/comments/14sum76/how_to_access_live_music_in_japan_and_why_it/).",
            "> new restrictions \n\nTiny part of the Gion district. \n\nA lawsons you can’t take pictures of anymore. (Kind of) \n\nThat’s it really",
            "Yeah being one of those foreign Youtuber's during covid that spoke Japanese must have been amazing. I don't remember ever seeing anyone but Japanese people in those videos.",
            "Now I don't KNOW, but \"xenophobia is heavy in Japan\" is a sentiment I hear a lot.",
            "I mean them too but frankly a lot of other cultures aren’t used to how quiet the locals are. A lot of families are just as loud.",
            "Iseji is also fantastic and overlooked",
            "It did not seem to be the last time I was there, but that may have changed recently I suppose. While I was there a month or so ago, I mostly wandered around Kagawa and took a trip to Matsuyama. That seemed fine. I haven't been to Kochi since late last year.",
            "I'm not sure if I agree.  Kyoto is unique so I understand why everyone wants to go there.  But I agree that there's tons of other spots in the country that are wonderful tourist destinations.  I went to Kyoto once and I totally understand the appeal.  I probably wouldn't go back, just because of the over crowding, though.",
            "Even Japanese tourists don’t go to Tohoku",
            "With a little headband that says 日本世界一",
            "Say it to everyone you meet man. Japanese people don’t get annoyed at tourists, they get annoyed at people who don’t appreciate their country. I live here and have seen proof of this so many times. \n\nYou’ll be really popular with everyone you meet over here as long as the only words you learn are positive ones about Japan. ",
            "Lol, typo fixed now",
            "I’ve only been here for 3 years and I absolutely agree with this\n\nI like great views and odd stories. I don’t cope well with crowds and especially (fing) lines. As a result, I tend to go to very out of the way places\n\nPeople are much friendlier (And often much less stress or tired seeming) than in major tourist areas. Particularly if you take an interest in the area and can communicate it a little - not just there to encroach on public space to get content vids (Which has caused many places to ban things like selfies sticks and loud voices!)\n\nI went to Matsue because it’s the “City of ghost stories”. The hotel clerk was outwardly surprised I was staying around for 5 days (It’s cheap, very close to Itsumo and near the origin place of sake (Which is near a cheap and uncrowded onsen)) then was happy to help me find a bunch of cool places to visit\n\nIf you go - not only is Matsue castle beautiful but it’s new mascot is a local elderly and adorable Shiba Inu \\*O.O\\*",
            "Oooh that's a cool idea...I'd love to go to live music in Japan! \n\nIt's just a weird trip to prepare for...in general, I'm the kind of person that wants to get out of the tourist areas anywhere else and just hang out where people actually \"do life\", it's taken me so long to get to Japan that it's might be one and done for me so I don't want to miss anything I actually care about. Maybe I just need to stay for a month rather than a couple of weeks.",
            "Really because I have noticed a difference in the past few months since Sakura.\n\nDuring the week dressed up corporate to go to work I am treated normally. In the weekends when I’m dressed casually I am treated noticeably different and people seem irritated by my presence.\n\nThis years Spring time tourist season has recalled strained people’s tolerance for Gajin.",
            "I've noticed more foreign tourists in Fukuoka now than even Tokyo 5 years ago. It's certainly growing.",
            "I've never been to Japan (😭😭😭😭) and so I'm honestly, truly, utterly baffled that people want a photo of the Lawson's in the first place lmfao I would want a photo of Fuji-san, not a convenience store haha.",
            "Don't forget that Tokyo restaurant asking tourists to pay more and the city of Himeji discussing tripling the entrance fee to its famous castle, again only for foreign tourists.",
            "This is a sensitive topic so I’ll preface this by saying I was a poc migrant to Australia where I was subject to and then worked as an Australian lawyer in migrant and citizenship policies during some of the country’s most recent conservative years\n\nI was surprised to recently consider that I prefer and understand the discrimination in Japan more than in Australia (For now)\n\nMuch like Australia, yes there is a sense of exceptionalism based on country of birth which lends to a sense of superiority of one race over others\n\nHowever, while xenophobia is definitely a thing in Japan, I think a big part of it comes from CRIPPLING shyness and sense of reservedness. I cannot convey how strong and prevalent it is - so much so that it lends itself to actions and behaviours which seem xenophobic\n\nA common example is people moving away from you on the train. Often Ive heard this complaint from Australians and Americans who talk loudly on the train. You don’t do that here and so it makes people uncomfortable\n\nMore than once, Ive also had a Japanese people tell me that that they’re worried about being spoken to in English and not being able to understand or help. As a result they limit contact with foreigners.\n\nSpeaking as a terrible Japanese speaker (For now!), even trying to speak a little bit of polite Japanese results in a noticeable butt-unclenching effect in the vicinity\n\nimo though, the one exception is probably Osaka folk. I swear, hell itself could come to that city and the people there would put up their fists while making a loud lewd joke (It rocks)",
            "That’s really great to hear. I might be able to go in like…5 years or so, fingers crossed then.",
            "Tōhoku is what Japanese people think of when they think of _inaka_ (田舎) places. It's Japan's version of the Deep South or the more rural US Midwestern States. It's a region of Japan with many nice things to offer, but its reputation within Japan as a backward-ass rural region means that most Japanese tourists don't go there as a first choice. Most of the popular spots are west and south of Tōkyō.\n\nRemember that the Yamato kingdom never conquered the region north of the Kantō Plain, but instead assimilated it culturally. Tōhoku is very mountainous and cold in the winter, so despite trying hard the Yamato kingdom didn't conquer it militarily like it did everything west of the Kinki (近畿) region. The Kantō region became politically and culturally important towards the end of the Heian Period and early during the Kamakura Shogunate. In time it would become as heavily urbanized as the Kinki region, eventually becoming the most populous part of Japan by the middle of the Edo Period.",
            "If you can stay months, do it! There is so much to see outside the major tourist route (Tokyo - Kyoto - Hiroshima). It’s a really magical experience to go somewhere a little off that well beaten path. Abroad in Japan has a lot of videos about visiting Tohoku in particular.",
            "> Oooh that's a cool idea...I'd love to go to live music in Japan!\n\nYea, he's just using this post to promote his own shit.",
            "If you speak Japanese just head to the deep areas. \n\nWalk on the darkest and somewhat sus (but not filled with boys in suits) area in town, head to a small place where you can't see inside, and just mingle.",
            "I live in Tohoku (Sendai), so nothing has changed up here because barely any foreigners come up here. But man, when I go down to Tokyo, I can 100% see the difference between before and now. In both the sheer volume of foreigners…everywhere, and the way the locals seem to be getting sick and tired of seeing them.",
            "Pfft no! \nIt’s not the photo of the Lawson that they want, but the juxtaposition of a Kombini and Fuji-san in the background. Two of Japan’s most iconic images. And that’s what tourism is all about now, touring icons and clichés. The whole country is a theme park to them.",
            "I used this as a speaking exercise for my Japanese students and the SASS XD\n\n”It’s a big mountain. There’s plenty of Lawsons. Go find another one. Or do something better”\n\nThe idea that this is called “The most Japanese photo“ is BAFFLING to them",
            "This. I'm sure old fashioned racism exists somewhere, but whenever my foreignness comes up (East Asian background so many can't immediately tell from face), it sparks interest, not fear/distaste. \n\nHad one person who pegged me for a foreigner though, but like you said, being able to speak the language loosens up a lot of tensions.",
            "Good luck! It is lovely. For family reasons I am on Amami, but my home is technically still in Kagawa and it is an absolute pleasure to be there.",
            "I know, I lived there",
            "I know lol but like, it's still just a Lawsons haha. It's like every person that does the \"holding up the leaning Tower of Pisa\" haha. There's a million of those photos man, yours ain't any different XD"
        ]
    },
    "Forgetting things and dealing with frustration": {
        "title": "Forgetting things and dealing with frustration",
        "score": 5,
        "url": "https://www.reddit.com/r/LearnJapanese/comments/1dlslve/forgetting_things_and_dealing_with_frustration/",
        "content": "There are days where I literally forget so much stuff (Vocab and grammar) and sentences I usually understand suddenly isn't understandable anymore, It easily frustrates me cause I then have to search up the grammar points I'm already supposed to know and should be comfortable with, I am halfway with quartet book 1 and there are genki 2 grammar I still forget. I want to be consistent but this is hindering me.\n\nI take breaks when these stuff happen, but after getting frustrated and taking a break my motivation just dies.\n\nthese stuff are most likely normal and part of the process, but it's driving me insane... How do you guys deal with this??",
        "num_comments": 12,
        "comments": [
            "I think it’s all part of the learning journey. Also when I get tired my Japanese language ability completely tanks. I notice even in my native language in have my good days and bad days, of course it’s not as noticeable as it is in my still rudimentary Japanese.",
            "I just tell myself that there are good days and bad days and I don’t really deal with it 🤷🏻‍♀️. Not sure if it’s a good solution though. \n\nBut yeah, some days I forget the most basic kanjis and think I have Alzheimer's, and other days I feel like I’m a genius of memorization, so it balances out I guess",
            "Take a small break when you're feeling super burnt out, not when you're simply forgetting things.\n\nStart by removing the \"most likely normal\" part first and fully internalize that's literally what learning is. The idea that you'd remember something by only seeing it once or even multiple times and it's somehow going to be there locked in forever with perfect recall is silly.\n\nSeparate your own ego from the situation and realize that forgetting something isn't a negative reflection of your ability. You're probably forgetting information all the time on other things in your daily life, but you've not tied those things to your ego. You ever forget where your car keys or cell phone are? Is that a reflection on you? Do you curse life and have to take a break to recover from such an embarrassing mistake?\n\nI also want to highlight something very important you wrote\n\n>I am halfway with quartet book 1 and there are genki 2 grammar I still forget.\n\nProgress is a like a staircase with broken steps than a straight line, you'll always stumble but eventually you get to the top floor. If you keep at it, eventually you're gonna find yourself thinking\n\n>I am halfway with quartet book 2 and there are quartet 1 grammar I still forget.\n\nAnd then\n\n>I am halfway with Shin Kanzen Master N1 and there are quartet book 2 grammar I still forget.\n\nAnd then finally\n\n>あーやばい！またその言葉を忘れちゃった！\n\nI'm know I sound very pseudo-self help guru with this advice lol, but in dealing with the exact same frustrations, I realized it wasn't just coming from learning Japanese and came from other deeper insecurities that were revealed to me when I started learning a new challenging skill.",
            "I started learning for about 3 months now and still have days where I completely forget the basics of hiragana and other days where there is no problems at all. As others have said we have good days and bad days. You’ll wake up day and look at this with no problems at all!",
            "It really takes weeks for your brain to be able to process new information. It's not like I already learned this kanji, okay my brain already learned it. It could take weeks or months, because some topics are just easier to understand. And that's okay, you're not a machine.\n\nYou can take a break from learning Japanese and start enjoying it. Read for the sake of reading, watch series for the sake of watching, don't try to understand everything. And if you forget something, it's okay, you'll eventually learn it.\n\n\n\nI learned English without learning English. I spent years in an institute where I learned nothing. NOTHING. And wanting to watch faster animes was the reason I started immersion. And not six hours a day, I didn't have time for that. 5 years later I can already read, speak, understand. The same can happen with all languages.\n\n\n\nDon't overdo it",
            "Language acquisition is not a linear process.",
            "If you're early in the process, perhaps stop trying to learn about the language (i.e., grammar).\n\nDo a search for Stephen Krashen. His talks on language acquisition are very informative. \n\nThen find some more enjoyable source material.",
            "Yeah it's definitely part of the learning process, but man I haven't learned anything this hard, so it feels frustrating to me when I feel like I'm getting pulled back. \n\nI'm also the same when I'm tired, so I don't study when I'm tired.",
            ">some days I forget the most basic kanjis and think I have Alzheimer's, and other days I feel like I’m a genius of memorization\n\nOh man, this is exactly me... Somewhat glad to see I'm not alone",
            "This is actually helpful, When I posted this I was thinking that people also get frustrated when they forget like me. However it seems people just see it differently than me.\n\n>I realized it wasn't just coming from learning Japanese and came from other deeper insecurities that were revealed to me when I started learning a new challenging skill.\n\nVery insightful actually since I'm probably dealing with this aswell which is causing me to have too high expectations of myself. Maybe I should switch to a childs perspective who doesn't care if they forget at all lmao. Man I now sound like a self-help guru aswell haha",
            "I'm learning since a few weeks or months and me too sometimes I forget about something. But repeating things again works for me",
            "Japanese is so freaking hard and I can’t believe I’ve invested so much of my time over the last few years learning it. But, it’s a lot of fun too and it’s indescribably wonderful when I can understand some dialogue or get my point across to someone in Japanese. I’m in it for the long haul, I use the toggle app to track my time in the language, I think I have a 1500 hours or something, I have so long to go but I’m ok with it. There’s no easy way to learn it and it makes the reward that much sweeter."
        ]
    }
}