{
    "Profile Swap Megathread (June 2024)": {
        "title": "Profile Swap Megathread (June 2024)",
        "score": 96,
        "url": "https://www.reddit.com/r/Letterboxd/comments/1d74aq2/profile_swap_megathread_june_2024/",
        "content": "Happy June, Letterboxd community! \n\nPlease go ahead and share your profile down below in the comments along with anything else that you'd like to include about yourself. How long have you been using the site? What kind of films do you usually log? What are some of your favourite flicks? Tell us all about yourself.\n\nFavourite first-time watches of June 2024? What're your current four favourites on your profile?\n",
        "num_comments": 664,
        "comments": [
            "I feel like I’ve met a ton of great people thru this monthly profile share, so going again for June!\n\n[https://boxd.it/5Vsrp](https://boxd.it/5Vsrp)\n\nI try to watch at least three movies per week, and write a review for every movie I watch (some long some short depending on vibes). Last month, I changed up my four faves to be the most recent 4.5+ watches (new or rewatch) so that’s been fun. I love scrolling thru reviews after I watch a movie, so I tend to be pretty engaging with other accounts.",
            "I think I've been using letterboxd for over a year now, and my watching habits are a bit sporadic but currently my top four are:\n\nFellowship of the Ring (2001)\n\nTwister (1996)\n\nJoyland (2019)\n\nThe Harder They Fall (2021)\n\nAs for June First Watches, I watched Brokeback Mountain for the first time, and Saving Face just yesterday, both where really good but in my personally opinion I enjoyed Saving Face more. \n\nI try to write long reviews but sometimes I just don't have much to say so it'll fall into a quip (usually with movies i've seen before)  but for others i can talk a lot. So if that's something you're into follow me? I guess?\n\n[https://boxd.it/5EgPZ](https://boxd.it/5EgPZ)",
            "Howdy, [here's my profile](https://letterboxd.com/chupakaibra/)! I'm a cartoonist and I tend to watch animated films, horror movies, and whatever else strikes my fancy. I prefer lighter movies so you'll usually see me log family films, campy/comedy-focused horror, and stuff that's in cinemas.\n\nI've been busy so haven't had too much time to log a ton of movies in the last few months but my favorite first-time watch of 2024 right now is probably *Ghostwatch* or *Late Night With The Devil*.\n\nI almost always follow back!\n\nRight now my Top 4 is just some random top favorites of mine:\n\n* *Small Soldiers*\n* *Who Framed Roger Rabbit?*\n* *Theater Camp*\n* *Malignant*",
            "Just a heads up, there is someone down voting a bunch of people, about 40-50 roughly have been form what I can see, including myself. I assume so there comment appears higher. Best thing to do is vote up any comments you see with no upvotes to counter it. I have done so. It is pretty silly really, someone is down voting people to begin with.",
            "https://preview.redd.it/96dv6xvxfo4d1.jpeg?width=828&format=pjpg&auto=webp&s=a2f5973bed97f4b4495e4943477108861671eeaf\n\n[https://boxd.it/1MAAZ](https://boxd.it/1MAAZ)\n\nLooking to expand my Letterboxd network, share my film opinions, and discover new films! Oh and I also Co-Host a film podcast called “Scoreboard Cinema” where we talk movies + sports, sort of like our own version of The Ringers “The Rewatchables”. Check us out on Spotify, Apple Podcasts, YouTube, and Instagram.",
            "https://boxd.it/34SE1\n\nCurrent four favorites are Near Dark, Jaws, Bloodsport, and Pan’s Labyrinth.\n\nI’d say I like a wide variety of movies but I need to watch some more older movies, like pre-1960.\n\nAlways follow back!",
            "https://boxd.it/4mvZZ\n\nPlease help me get to 200 followers, i will always follow back",
            "My profile: https://boxd.it/6Wrcf (will follow back)\n\nSucker for a good horror/thriller, I love girlhood and friendship centred movies, psychological dramas and and genuinely good comedies. I’m trying to get more into romance and action as genres and expand my list of classic/cult movies, so I’d love mutuals that have as wide and random a taste as mine. I’m active with reading/liking reviews because I love to add movies to my watchlist and take about 3 months to watch them. I also now have a lot more time to get through my watchlist after finally graduating!\n\nMy reviews are short/average length as I try and always do them spoiler free and essentially just brain dump what I thought (I take the “diary” very literally). My star ratings tend to be very subjective, even if I thought the movie was very well done from a technical standpoint, I will rate based on my enjoyment whilst watching. \n\nWould love to follow other active users who just bring good vibes and thoughts to my feed! My only request is please don’t follow me just to unfollow me as soon I return it so your ratio is really high :)",
            "Hello everyone! I have been ramping up my Letterboxd use lately and was hoping to find some new people to follow! I really just use Letterboxd as a movie diary so you're not going to find any philosophical life-altering reviews but hopefully you'll enjoy my rambling! Here's my profile https://boxd.it/1caIV. \n\nRecently saw \"I Saw The TV Glow\" and was overwhelmed with how much it made me feel. Would definitely recommend that!",
            "hi, im manad. my top4 are frances ha, magnolia, still walking, yi yi. im a big sucker for slice of life movies and documentaries.\n\nheres my profile: [https://letterboxd.com/whydontboyscry/](https://letterboxd.com/whydontboyscry/)",
            "Hello all! I'm kinda new to Letterboxd but I'm really enjoying using the platform—I especially like scrolling through other reviews after watching something 😊\n\nhttps://boxd.it/3YHY7\n\nI tend to watch the general fare—random movies everyone likes or watches, or more apocalyptic stuff (love Day After Tomorrow), thriller or suspenseful movies. I've been getting into the Monsterverse lately. \n\nI'm also a global news journalist, and I enjoy documentaries—so many of them. Please send your recommendations! I also enjoy films that tackle important issues or societal subjects like inequality, privilege, war, climate, and so on.",
            "I have terrible taste. Follow me. \n\nI mostly do reviews that are around 2-5 sentences, as I don’t know enough about film in order to do a full analysis. I’m currently going through a little pride month kick where I watch as many LGBT films as I can. Aside from that, I love horror and hopeless cinema. I’ve also been told I have one of the weirder top 4s out there. \n\nI always follow back!\n\nhttps://boxd.it/7OfPn",
            "[https://boxd.it/4pmQF](https://boxd.it/4pmQF)\n\nI can't say I do many reviews, and neither are my opinions very interesting or out there, *BUT*, I'll follow you back if you follow me",
            "Hey guys!!!\n\n[https://boxd.it/4tMeF](https://boxd.it/4tMeF)\n\nFollow me on LB I follow back!\n\nTry and be as active as possible as its my first full year logging… on the road to 3000 films 🕺\n\nSee my profile below and thanks if you decide to follow!😃\n\nhttps://preview.redd.it/ea06kvjlfs4d1.jpeg?width=1170&format=pjpg&auto=webp&s=eb46de7dc078836080d2b404a8bc88fd2b337fbd\n\n[https://boxd.it/4tMeF](https://boxd.it/4tMeF)",
            "[https://letterboxd.com/vince2k/](https://letterboxd.com/vince2k/)\n\nI try writing semi-long-form reviews for the stuff I watch.",
            "Hey all, I'm [frieswelldone](https://boxd.it/4ATtr) and I've been using Letterboxd for about two years in order to remember all of the documentaries I've seen over the years. Speaking of, I'm a huge documentary nerd and love to watch as many as I can. Some of my favorite documentaries are *Enron: The Smartest Guys in the Room*, *Jesus Camp*, and *Apollo 11.*\n\nI'd love to find some new followers - I follow back!",
            "Hi everyone!\n\n[https://boxd.it/BHXP](https://boxd.it/BHXP)\n\nOkay have to admit, I'm a big fan of cheesy b-movies. Would be great to connect with people with a similar taste and get some recommendations. Will of course follow back!\n\n  \nCheck out my top 4 below!\n\nhttps://preview.redd.it/ukf7cx94oe5d1.png?width=801&format=png&auto=webp&s=9ef35180039284f60bdbe04465af239e3cac8d63",
            "\nHey everyone! I’ve had Letterboxd since late last year, but I’ve recently become a lot more active on it and have really come to enjoy it! I don’t have a ton of IRL friends who use it, so looking to increase my following. It’s kind of boring seeing the same 3 people logging movies, lol. \n\nMy taste is somewhat eccentric. My current top 4 are Aftersun, Blue Valentine, Call Me by Your Name, and Jennifer’s Body (every now and then I swipe this out for Pride and Prejudice). Movies that make you “yearn” are my favorites. I love horror, especially campy horror, and 90s/2000s teen romcoms. I’ve also been getting more into American classics - I’m a big Humphrey Bogart fan, and just recently watched my first Marilyn Monroe movie. I’ve been reading a biography on Marlon Brando, so I’m seeing a lot of his movies for the first time, also. Criterion is one of my favorite streaming services, so lots of movies from there, too. \n\nI log pretty much everything I watch. I do write reviews, but they usually are either short and quippy, a quote from the movie that stuck with me, or an anecdote about my feelings/relation to the movie. \n\nI’ll follow back! https://boxd.it/5g3wx",
            "[Hello everyone, it's me again, Giraffe_Monster](https://letterboxd.com/giraffe_monster/), happy to follow back as always!\n\n\nFollowed a ton of people this past month and it's been great seeing everyone's different tastes, I even got to find out the title for a film I thought I'd never remember ever again thanks to one of you (\"Ham on Rye\").\n***\nCurrently recovering from watching 20 films at a film festival (working on last 2 reviews).\n\n\nAllow me to gush about one in particular, [\"Steppenwolf\"](https://letterboxd.com/film/steppenwolf-2024/):\n\n\nIf you are into extremely violent and bleak stories that also possess a very, very warped sense of humor, you absolutely must check this one out.\n\n\nI had no idea what I was getting into and loved every second of it, it's the perfect film to watch with a big crowd seeing how wild, unconventional and unpredictable it is.\n\n\nIf you can catch a screening, don't miss it, would love to hear back!\n***\nOther than that I'm doing the same as always, discovering new films and trying to meaningfully review everything I watch.\n\n\nSee you on LB!",
            "im somehow finding time to watch movies without neglecting uni. have a lot of classics and stuff left to watch. I love pretty much every genre. i got rid of a rating system besides 5 star. Its so mucb more convenient because i enjoy most movie, and overthink ratings.\n\nhttps://boxd.it/37M4H",
            "If you’re reading this, you are the resistance. \n\nhttps://boxd.it/3CDs3",
            "\nhttps://boxd.it/2iM4F\n\nHello fellow movie lovers,\n\nI’m from Philadelphia and enjoy rating and writing about movies for my own personal pleasure. Which is totally normal ! Haha. I’m not a huge social media person but I discovered letterboxd years ago and have been into it ever since. I got a few of my friends (who also love film) into it as well. My reviews vary from humorous to some more serious. I have a common theme in my profile where my top 4 are always “My top 4 favorites of the previous month.”  So for example, my top 4 from April are listed below.\n\n-Furiosa: A Mad Max Saga \n-Manhunter \n-Light Sleeper \n-Shot Caller \n \n\nThanks for the follow and enjoy your next film everyone !",
            "Hey everyone I'm a big fan of film. In my small town, I host a radio show about movies with my twin brother. I usually log horror movies and Animated films. \nhttps://boxd.it/3uEpX",
            "Always trying to make new friends with Letterboxd accounts and just found this subreddit!!! Here is me: [https://boxd.it/4IKgz](https://boxd.it/4IKgz)\n\nhttps://preview.redd.it/huekvnh6b35d1.jpeg?width=1290&format=pjpg&auto=webp&s=00afc10ef085d48e13ca3fcce61ee53b06d640c1",
            "hello! I’ve been using letterboxd for 3 years now 🖤 I love horror movies and would love to find some new accounts to interact with over on there :) \n\nhere’s my account: \nhttps://boxd.it/3Zw8h",
            "My profile on Letterboxd https://boxd.it/5clbp\n\nHello! I'm from New Jersey and recently started using Letterboxd often. Had it for a year or 2 but the past couple months I've REALLY started to use it, making sure to log everything, review most. I'm no movie critic or creative writer so don't expect in depth fancy reviews. Just usually give my quick thoughts. Love horror but watch everything. AMC A List subscriber. Looking to build out my letterboxd profile and friends to help find new movies, read lists, etc. Will follow back those who follow me.",
            "Hi guys! I follow back everyone!\n\n[https://letterboxd.com/berams108/](https://letterboxd.com/berams108/)",
            "Many of the films I like center around comedy. (I also log stand up comedy specials, which I didn’t realize was controversial until I browsed this sub.) I love many British and Korean films. Also French and Japanese films. Among American films, I have a particular interest in Asian Am and African Am films. I love shorts. \n\nI like making film lists, for example: \n- Iconic Accents - Fargo, Strange Brew, Trainspotting\n- Interracial couples of color (I could only come up with 11!) - Romeo Must Die, Harold and Kumar, Bottoms\n- Friend Ensembles (real life friends play a group of friends) - Peter’s Friends, the Anniversary Party, Wine Country\n- World of Jane Austen - Clueless, Austenland, Fire Island\n- Fashion montages - The Sweetest Thing, The Royal Tailor, Down With Love\n- Well I Liked It (poorly rated films I loved) - Heartbreakers, all of the Barbershop films, I Give it a Year\n\nhttps://boxd.it/AgdN",
            "Hoping to watch every film put to screen -- got a lot of catching up to do.\n\n[https://letterboxd.com/Quintenrankin/](https://letterboxd.com/Quintenrankin/)",
            "My profile on Letterboxd https://boxd.it/5aizf\n\nI've been using letterboxd for almost a year now! I absolutely love it, I've watched more movies, and having a place to put my thoughts down! I try to put thought into my reviews, but I'll admit sometimes I don't have much to say so I'll just put a quip.\n\nI haven't been able to watch too much this month so far, but the best new movie (new to me at least) has definitely been fury road. That movie is awesome. \n\nMy top 4\nReturn of the King\nBladerunner\nAkira\nBirdman",
            "Started this year with a friend aiming to hit 365+ films this year and could really use some more inspiration for my really unfunny reviews <3\n\nBasically watch anything and everything, big interest in asian cinema as of late and I've watched Challengers way too many times since it came out\n\n[https://letterboxd.com/kjrd/](https://letterboxd.com/kjrd/)",
            "https://boxd.it/9WxOL\n\nI have been using Letterboxd for about a month now, and it has slowly taken over my life (in a good way)! My husband and I have created a movie “Wheel of Fortune”, and we spin it every day to decide what movie to watch. I think we’ve watched close to 200 films we would have never agreed on had we not started spinning.\n\nI am currently in an 80’s obscure horror vibe, but my watching habits are all over the place. Currently, my top 4 are:\n\nRequiem for a Dream\n\n21 Grams\n\nMulholland Drive\n\nLake Mungo\n\nI am still learning the ins and outs of the app, but I am about to sign up for Patron. \n\nSide Note: Naomi Watts is my favorite actress. If you enjoy her films, send a follow my way. 😊",
            "My profile: [https://letterboxd.com/cbsmooth/](https://letterboxd.com/cbsmooth/)\n\nI try and write a review of everything I watch; I'm basically using LB to force myself to write more. I will follow anyone back who is also into reviewing. I enjoy all the classics but this year I'm going to be focusing on Japanese cinema and paranoia thrillers, and I'll be reviewing horrors for October and noirs for Noirvember.",
            "https://boxd.it/4RrMz\n\nMy top four are: Portrait of a lady on fire, Monster (2023), Close and Dogtooth. Honorary mention to Marcel the shell with shoes on 🥹",
            "Howdy folks - [here is my profile](https://boxd.it/ih0z). I'm an active LB user currently working through the Sight & Sound 250, but I've been slacking off this past week ever since the remake of Paper Mario: The Thousand Year Door was released. Just 100%'d the game last night so should be back into the swing of things now!",
            "hi! [here's my profile :)](https://boxd.it/4Keut) and here's my top 4. I'm happy to follow back anyone, especially if i like your favorites 😋\n\nhttps://preview.redd.it/xcbq45t1yl4d1.png?width=652&format=png&auto=webp&s=cd91584a0d6978aa07f004420229eea2288a9e1a",
            "I'm kinda new to film and don't have many reviews yet, but mine is [stuffyduck](https://letterboxd.com/stuffyduck/). My favorite movie rn has got to be Submarine by Richard Ayoede. Also, what should you put in the bio?",
            "\"D'artagnan mother-fuckers!\"\n\n https://boxd.it/4nFVF",
            "Ello everyone!\n\nCurrently very slowly trudging my way through 2024 films and ranking them, as well as catching up on films I've missed throughout the years. [https://letterboxd.com/NahRumph/](https://letterboxd.com/NahRumph/)\n\nCurrently The First Omen is my favourite. Really wasn't expecting it but it genuinely blew me away. Loved it.",
            "Hello everyone, hope you are all keeping well! I plan to write more reviews and make full use of the service, like lists. For now, you're more than welcome to stalk my profile and laugh at how wrong I've rated some films! Hope to connect with you lovely folks!\nhttps://boxd.it/5Dotb",
            "Here's my silly [profile.](https://letterboxd.com/ChooChooish/)\n\nI don't really have much of a rhyme or reason as to what I watch, just sort of playing pick-up sticks and grabbing whatever happens to surface. Always finding myself enjoying clean decapitations, empty fields of strong longing and bittersweet conversations that end a little too abruptly.\n\nIf you don't mind hopeless descriptive yapping, please don't hesitate to drop a line.",
            "[https://boxd.it/7uBLn](https://boxd.it/7uBLn)\n\nHello Letterboxrs! I'm Seth!\n\nI'm a chronic introvert who went full-recluse during the pandemic, but I got onto Letterboxd after watching a bunch of stuff in October '23, and I'd like to expand into getting other people's opinions and reviews beyond my humble little circle. Back in the MySpace days I used to let my friends control my Netflix queue to watch 100 new-to-me movies a year, and I'd like to think I'm even more open to suggestions now.\n\nMy list is generally horror movies, because there's such variety to them, and because that's the community I've currently found myself in. I've recently found a joy in revisiting entire franchises; going through the Mad Max films leading into Furiosa was just delightful.\n\nI know I have \"The Menu\" listed as a favorite film, but I've kept my favorites to the three 5-stars I've watched since starting the account, and HEAR ME OUT. The Menu was pivotal in knocking me out of a slump of only seeing established-IP blockbusters in favor of smaller movies with tighter scripts.\n\nLet's watch some dang films!",
            "[https://letterboxd.com/TyWebb64/](https://letterboxd.com/TyWebb64/)\n\nProbably an \"old\" on this site (will be 60 in a couple weeks). I don't do reviews often, but have started \"tagging\" movies for future discussion to help with things like \"top five\" lists of random topics.  My \"top four\" are representative of the types of movies I like:\n\nDark Comedies\n\nNoir\n\nHorror/Comedy (genre blending)\n\nMy ratings are based somewhat on Ebert thing I read once:\n\nRate movies based on if they are accomplishing what they intend to do (is a comedy funny?, is horror scary?, action movie have good action with the story (but not JUST action))\n\nIs the story engaging and interesting and moves along?  I like a slow burn, but don't care for movies that \"stop the story\" to show panoramas for extending periods of time (or go off topic like Tree of Life?).\n\nPoints for great acting obviously\n\nDid I personally enjoy the movie is the final and most important factor.  Could have great acting, great script, beautiful cinematography, but if it didn't click, it didn't click.",
            "Lately , i have found myself spending time almost daily on letterboxd. I watch almost all kinds of films though any good film from subcontinent is always a treat, also write reviews for most of them . Lets meet each other through our shared love for cinema and story telling \n\nhttps://boxd.it/5hUXX",
            "Hi everyone!\n\nThis community has been a lot of fun for me. I've always enjoyed watching movies, but recently, I realized how few I've actually seen. I've missed a lot of great ones over the years, so I decided to embark on a quest to watch some of the best films out there. Now, I'm pretty much obsessed. I've been learning more about the industry through videos and podcasts, and I've really enjoyed being a part of this community.\n\nI started writing reviews in March. They're a bit longer (journalism major turned teacher, sorry), and my ratings might be skewed towards the 5 star range right now since I'm watching classic after classic, focusing on the best films of the last 40 years, but I’m anxious to see where this new hobby takes me. \n\nMy profile is:\nhttps://boxd.it/9sRqT\n\nHappy to follow back anyone",
            "Hello everyone! I'm Zon, and I'm looking for more friends in the community. I often write long reviews especially when i found the movie great. My love language is liking a letterboxd review and adding a user's top 4 to my watchlist. \n\nI hope we can share our cinematic experiences together! \n\nhttps://boxd.it/6aO6X",
            "Hello! ive been sharing my profile every few months so here we go again! \n\n[https://boxd.it/53Wsp](https://boxd.it/53Wsp)\n\nJust recently got out of a movie funk and I have been watching some cool movies recently like In a Lonely Place & The Swimmer. My top 4 usually rotates but All That Jazz and Mikey & Nicky usually stay in the top 4",
            "https://preview.redd.it/82pp187nss5d1.jpeg?width=828&format=pjpg&auto=webp&s=6aaa894aba838828e898eb587a55e55b530715d8\n\n[My Letterboxd](https://boxd.it/qy4z)\n\nBeen a while since I’ve done one of these, but would be nice to see some new faces on my feed! I watch an assortment of things and am not picky about what others watch, I just like to read and interact with reviews.",
            "https://boxd.it/d92x\n\nHello, mostly watch horror but branch out into sci-fi and documentaries regularly.\n\nMy top 4 movies\n- A Nightmare on Elm Street \n- Pandorum\n- Jurassic Park \n- Let the Right One In",
            "https://preview.redd.it/cofz74thlx5d1.png?width=968&format=png&auto=webp&s=2cd9e0520ed5524bf239af9ccabd0a535f69d889\n\n[https://boxd.it/7idqV](https://boxd.it/7idqV)\n\nHi there!\n\nThis is my first full year logging on Letterboxd! I've been logging very consistently and I'm really just hoping to gain some followers with similar movie interest as me.\n\nI'm not a deep film critic who post really detailed reviews (it's totally fine if you do!) so don't expect that from me if you follow. I'm just a casual film enjoyer who likes to log what I've watched and give simple (even sometimes goofy) reviews.\n\nI follow back anyone who follows me!",
            "hi!!!\n\n my top 4 films are The Florida Project, My Neighbor Totoro, Silver Linings Playbook & Gia!\n\n[https://boxd.it/1h5C9](https://boxd.it/1h5C9)",
            "Hey guys this is my letterbox down below:\n\nhttps://boxd.it/4CSyp\n\nI’m on a quest to do a movie a day (sometimes more, sometimes none at all). My reviews are always pretty short, like 2 sentences but sometimes if I really have a lot of thoughts on a movie I’ll say like a paraphrase. If you wanna discuss a movie please feel free to dm me because I feel like I kinda watch more movies than most my friends and yeah! I also def have some controversial ratings so yeah I’m up to debate if you’d like :) thank you!\n\nEdir: if you want me to follow back please reply with ur username bc I never check notifications on letterbox lol",
            "https://boxd.it/6NJ0j\n\nWill follow everybody back!\n\nStarted getting into movies in 2024, so I am catching up on a lot of classics. My top 4 rotates often, and I’m starting to get into reviews.",
            "Hello Everyone! I’ve been watching my favorite films lately so I haven’t gone out of my way to watch stuff I haven’t seen yet. I would like more mutuals to read their reviews on stuff they might enjoy or some nice recs! [Myyyy Letterboxd](https://boxd.it/1hEuJ)",
            "https://letterboxd.com/INFEDnoX/\n\nHey! Big fan of slow cinema and currently working my way through all the slow cinema masters from around the world, but I love a bit of anything. I try and write detailed reviews for every good film I watch. Happy to follow back :)\n\n[My fave four](https://i.imgur.com/TK2UxkX.png)",
            "I don't know how to start a conversation with people but reviewing is another thing. I have an average taste.    \nHere is my monthly profile share. I am reviewing every movie that I watch.   \n[https://boxd.it/9Hpzt](https://boxd.it/9Hpzt)",
            "[https://boxd.it/1AZMx](https://boxd.it/1AZMx)\n\nCurrently doing an unofficial run through of the James Bond films and alternating between those and various Disney and Pixar movies that I've either never seen or not since I was a kid. This operates as a pallet cleanser both directions.",
            "Hey all. I’ve been using the app for a little over a year now, I’m very consistent, I log everything I watch, and I watch on average 4-5 movies a week. I love reading other people’s thoughts. I mostly watch some of the more popular movies because I’m trying to get through a lot of the classics.  \n\nMy [Profile](https://boxd.it/5UZCt)",
            "[https://letterboxd.com/danieljserra/](https://letterboxd.com/danieljserra/)\n\n  \nI watch a lot of questionable things, and my rating system (in bio) is pretty much based on how entertained I was. Favorite genres are usually action and/or comedy heavy, like bad horror movies, samurai, ninja, kaiju, westerns, etc. My goal is to watch most of the \"essential\" or unique films in categories like that. We have a toddler though so only watch a few movies a week right now. I'm also trying to get a better critical eye for things which has been fun. I can pretty much find something to enjoy in anything I watch, plus I tend to know what I'll like, so lower-than-average ratings are rare",
            "I been using Letterboxd for about 11 months and I usually watch 3-5 movies daily. I usually watch films that are releasing, doing a marathon on, or just feel like watching. I love engaging with other accounts, when I am done with watching a movie I like everyone’s reviews to it. \n\n[https://letterboxd.com/noahfanofmovies/](https://letterboxd.com/noahfanofmovies/)",
            "[https://boxd.it/4iSWB](https://boxd.it/4iSWB)\n\n  \nmy watchlist is always growing, follow me and we can discuss movies. peak cinema.",
            "I’ve been using Letterboxd since the start of the year, and I absolutely love it!\n\nI love this community and hope to connect with other moviegoers to find new film recommendations.\n\nFeel free to give me a follow and recommend some great films!\n\nhttps://boxd.it/88ABL",
            "Hello! My name is Angelo - [https://letterboxd.com/angeloedades/](https://letterboxd.com/angeloedades/) - based in London usually loiter around Cineworld/BFI.\n\nStill thinking about that new release film called STING - not sure if its good or bad and I am very excited about the LOTR extendeds coming back in the next couple of weeks.",
            "Hello There! Here is my [profile](https://boxd.it/73Kkr). I have been using Letterboxd since November 2023. I usually log summer movies, favorites, sci-fi movies, American films, A24 movies, art that made me dream, and George Lucas films. Some of my favorite flicks are Equalizer 3 (2023), The Graduate (1967), Taxi Driver (1976), Poor Things (2023), The Terminator (1984), Abandon Ship (1957), Fury (2014), and Star Wars (1977). I also enjoy reading other’s reviews, no matter how long or short.",
            "I just started using letterboxd and have been logging movies a lot recently (a lot of them are really shitty Christmas rom coms but its just a phase-- i have good taste i swear). I love almost every genre and my watchlist seems to be growing everyday. Most of my reviews are just bad one liners because I don't know  much about film to do a full analysis on it, but despite my awful taste I'm slowly learning to enjoy the finer points of cinema!!\n\n  \n[https://boxd.it/9ohNf](https://boxd.it/9ohNf)",
            "Hello! I am a college student studying cultural anthropology, so film (something I never had much of an interest in or knowledge of) has become a real passion. I made a letterboxd late last year, and have consumed a steady diet of melodrama, b-movie noir, and pulpy horror since then. \n\nI’m hoping to find people who have similar taste to mine, and would most like recommendations for accounts to follow that tend to watch 1910s-1960s women’s pictures and “bad” movies. My favorite movie ever is Daisy Kenyon, starring Joan Crawford, which I consider massively underrated (like Crawford herself). \n\n[My account!](https://boxd.it/7Zs71)",
            "[https://boxd.it/25XGz](https://boxd.it/25XGz)\n\nfilms r cool\n\nmy favourite atm is pink flamingos",
            "[Hey there, I'm Swurd on Letterboxd,](https://boxd.it/399C5)\n\nI've been using Letterboxd for the past few years and I'm hoping to connect with other film enthusiast! My go-to genres are sci-fi/dystopian, thrillers, historical dramas, and crime fiction.\n\n**Top 4:**\n\n* Interstellar\n* The Dark Knight\n* Whiplash\n* Nightcrawler\n\nFollow me, and I'll be sure to follow back. Looking forward to sharing recommendations and reviews!",
            "https://boxd.it/5B1Kf\n\nI'm a prolific logger with a loooong watchlist who's trying to watch at least two movies a week off it. I've been using the site for around a year now, I generally log horror, martial arts and sci-fi.\n\nMy top four and other movies I love are included in my [Favourites list](https://letterboxd.com/holgast/list/favourites-all-time/).",
            "Hello Everyone, I would love to know about fellow community members and their movies taste and recommendation. Its really fun.\n\n LB:  [https://boxd.it/7jdlj](https://boxd.it/7jdlj)\n\nI would love to see your movie taste and get to know u.",
            "Hi all! \n\nI'm working on writing more long form reviews so any feedback is greatly appreciated. I've been using the site for about a year and a half now and I find that the site is an excellent way to catalogue the growing list of films I see throughout the year.\n\nhttps://preview.redd.it/t1olb2hwgs6d1.jpeg?width=1170&format=pjpg&auto=webp&s=dc05fc3e03e7d31a6d736842ee2e5168e56dcb86",
            "https://preview.redd.it/1nred76jxu6d1.jpeg?width=828&format=pjpg&auto=webp&s=22e39483de78395b5a866de06fb3389d09a9cf2f\n\n[My Letterboxd profile!](https://boxd.it/nheB)\n\nwas a Criticker devotee for years until finally joining Letterboxd in 2021, although i didn’t start actively logging movies until 2022, when i finally broke up w/ Criticker for good.\n\ni’ve included the image of my top Themes & Nanogenres so far this year as a lil peek into what kinda nonsense i be getting myself into recently",
            "My favorite movie is Oppenheimer, some of my other favorites are The Pianist, LoTR Return of the King, and LoTR Fellowship of the Ring. I like seeing others opinions so I’ll typically follow back! \n\nhttps://boxd.it/6SHBH",
            "User: [Jameusmooney](https://letterboxd.com/jameusmooney/). \n\nI log pretty much anything and everything. I work in media so I like to have as well rounded a watch history as possible.\n\nOne of my favorite things about my profile is my top pinned list features what I consider to be the two best films of every year dating back to 1924. I have a lot of fun considering that and love updating it as I watch more things.",
            "Hi! \nI’ve been on Letterboxd for just under a year, but I’ve only really started to get back into it! I’m trying to make new friends and came across this subreddit \n\nhttps://boxd.it/6XiAp",
            "There the link to my profile [https://boxd.it/BHn3](https://boxd.it/BHn3) i am into Superhero huge Batman Fan favorite directors : Christopher Nolan And Zack Snyder also i love James Wan and M. Night Shyamalan i am into Superheroes movies as you might have been guess DC And Marvel Fan i love Star Wars too. And I love Horror and Since-Fictions too i like drama,psychological thrillers and drama also some time a bit of comedies but not that much.And I like Animation too! My favorite movies are : The Dark Knight,Watchmen,Man Of Steel and Batman V Superman! Also Toy Story! I love blockbuster movies disturbing movies and animation ! Feels free to follow much love ! ❤️",
            "https://letterboxd.com/salrodriguez/\nwanting to meet more people who love films, none of my friends care about movies lol",
            "[https://boxd.it/3DBIF](https://boxd.it/3DBIF)\n\nHey everyone! I know we're already half way through June but thought I'd share my profile. This is my first post on this reddit and hoping to create some mutuals. Thanks to the Letterboxd frenzy, I’ve watched more movies in the past six months than ever before in my life and its been such a blast!",
            "[https://letterboxd.com/rschoene/](https://letterboxd.com/rschoene/)\n\nhello!! I have only been using letterboxd for a year but I love it. I started using it to keep track of a film project my brother and i did together in 2023, but since then I've just loved tracking and reading reviews of movies. Mostly just personal feelings towards film, nothing transformative in my reviews but i just have fun with it. I don't have a ton of friends on there so I was looking for some here! I just started watching complete filmographies of my fave actors/actresses and directors, but as of now I have only done Ryan Gosling lol. Just love to see other people's taste in movies they are so interesting!",
            "Hi everyone! My name is Alex :) I’ve been actively using Letterboxd for about two years now. My favorite first-time watches of June 2024 would be Made in Hong Kong and The Face of Another. Current four favorites are Perfect Blue, In the Mood for Love, Bound and Funeral Parade of Roses. I do the odd review but words are hard. I watch a lot of movies by myself so it would be nice to make friends.\n\nhttps://boxd.it/2fsgF",
            "My profile on Letterboxd https://boxd.it/HYfn\n\nI always follow back!",
            "Hey everyone! I’m a fellow letterboxd’er and I love it to pieces. I’m some what new and I’m just trying to get 300 hundred followers this month. I’m happy to follow any one and everyone. I mostly do horror films 😜 \n\nhttps://boxd.it/4P3S5",
            "Hello there.  \nMy profile: [https://letterboxd.com/David1MA/](https://letterboxd.com/David1MA/)\n\nI don't really do a lot of reviews, I have a couple but only in spanish. Although one of my future objectives is starting to do more. And in english too!\n\nMy main genres are horror, fantasy or action, but I watch every genre. I think this year is the one I've been watchting a lot more. Almost 100, and close to 1000 total!\n\nAlso as a spaniard I've been working on a list of horror movies from Spain in case anyone is interested: [https://boxd.it/whZEu](https://boxd.it/whZEu)",
            "Sharing for June: \n\nhttps://letterboxd.com/DSmithImages/\n\nI do a scattershot approach to what I watch. Whatever catches my fancy - new and old. \n\nMy top 4 will always remain my top 4 - Dazed and Confused, Jaws, The Goonies, and Airplane! \n\nFavorite first-time watches for June would be Evil Does Not Exist and Hundreds of Beavers.",
            "Just finished watching all 601 Best Picture nominees ever - ended on a classic: Grand Illusion! Here's my review and thoughts on my journey through the Oscar's best movies. What movie watching challenge should I do next? [https://boxd.it/6HDY1V](https://boxd.it/6HDY1V)",
            "https://boxd.it/3U0Hf\n\nAbove is my account!\n\nI'll start off with a weird an unexpected premise and very weird premise,\n\nI'd love to get recommendations on a **movie that can finally get me to cry**! My top 4 of all time currently are:\n\n1. Jojo Rabbit;\n2. Close;\n3. Nimona;\n4. Spider-Man: Across The Spider-Verse\n\nI don't think I've cried watching a movie before, even proven tearjerkers that would get people immediately bawling by the end or by a specific scene. I'm not exactly super proud of this, so I'd love to cry watching a movie for once!\n\nParticular ones I didn't cry to include (from movies and TV shows):\n\n1. The Last of Us (Game and TV show): >!Sarah!<'s death;\n2. How to Make Millions Before Grandma Dies: Through whole movie, essentially. Some of my friends broke down near the end.\n3. Inside Out 1 & 2\n4. A Monster Calls\n\nAnd many more I can't recall. \n\nI have a soft spot for kids in tearjerking movies (hence Close and Jojo Rabbit being on my top 4) and parenting dramas too (I'm not even a parent?), but none have gotten me in tears yet unfortunately... So if you know any movies you think can get me to bawl (even if they don't fit the criteria), feel free to recommend! :D \n\nI'm not stingy with the stars I give, and so even many mediocre movies get a 2.5 or 3 from me. I've only given 0 stars to Madame Web. I also explore a lot and am open to films from other countries provided they're interesting premise wise; you'll see Persian, Japanese, Korean, Thai, Chinese, American, Italian... essentially a lot of countries in my watchlist lol.",
            "Hello everyone!!! I feel like i’m super late to this so I don’t know how much exposure it’s gonna get, but I’d really love to meet some new people and make some letterboxd friends!\n\nhttps://boxd.it/BNZH\n\nI mostly watch horror, but I’ve been doing the Criterion Challenge to switch things up, so I’ve been branching out! Always down to chat about movies, so feel free to dm me as well!",
            "Heyyy i like sitting in front of a screen and watching pictures move for funsies!\n\n[https://boxd.it/9QZvP](https://boxd.it/9QZvP)\n\nhttps://preview.redd.it/o1ps0uub0d4d1.jpeg?width=1170&format=pjpg&auto=webp&s=af9471083b5d42d355cf60d55500cbf9824f42d9",
            "https://preview.redd.it/9tdqivdoqe4d1.jpeg?width=750&format=pjpg&auto=webp&s=b27cda29827f0c70fd274791999d2367b1cb7263\n\nMy name is Richard. I am 22 years old and I am a pretty casual movie enjoyer (you can probably tell by my top 4). I would say I have the average taste of a Gen Z guy. I love biopics, drama, action, sports movies, etc.\n\nI’ve had this account for about a year and I log all my movies, I like looking back at my diary and seeing where I was at with watching films in a particular month. I recently just finished a Michael Bay marathon and I like to rank stuff in my lists.\n\n[https://boxd.it/6hkzJ](https://boxd.it/6hkzJ)",
            "Hello, I thought I would try posting in one of these. Here's my [profile.](https://letterboxd.com/BeatOnTheBrat/)\n\nI can't say I log a movie every day or write a review for every movie I log. If I write a review, it consists of notes on or impressions of a movie I was especially taken with for whatever reason. Some of my favorite directors are Straub-Huillet, Alanis Obomsawin, Chris Marker, Sergio Corbucci, Peter Watkins, and Jess Franco. I don't discriminate: I like sleaze, formalism, B-list horror, westerns, documentaries (specifically vérité-style stuff). Lately, though, I've been watching a bunch of noir. When it comes to film, I'm most interested in the relation between representation and the political, the way an art object might agitate or propagandize and the historical ways in which political movements adopted or produced representations of themselves. If any of that sounds interesting, great! But Letterboxd is the best for simply collecting recommendations on what to watch, of which I'd be happy to get/share.",
            "Hi everyone! [here is my profile](https://boxd.it/3FMaN). Looking forward to seeing your profiles & following folks back.\n\nMy goal for 2024 was to watch 104 movies (2 a week) & write at least a short review for each one. Right now I am at 99 watched for the year, so I might try bumping the goal up to 208. In which case, I’ll definitely take some recommendations. \n\nI love seeing what other people are watching & see how other people feel about the movies that I have seen too!",
            "Hi! I'm [SkeletonGrimm67](https://boxd.it/4eiPh). I absolutely adore the horror genre. Some movies that I recently watched were Late Night with the Devil which I absolutely loved,  Furiosa and Your Name. I also love writing and reading reviews.\n\nIf want you to talk about movies then follow my profile, I will probably follow back. I'm excited to read your reviews and see what you think about films:)",
            "middle aged bipolar library associate here who watches WAY more than he reads \n\nlooking to have a fun time with people who also love movies\n\nalways happy to get new recs and check out new hot takes\n\nposts/comments WILDLY vary between jokey and serious so sorry if thats a problem\n\n[https://boxd.it/14BUt](https://boxd.it/14BUt)",
            "[https://boxd.it/4SV7N](https://boxd.it/4SV7N) Hii there this is Ying ! I log everything and usually write pretty intuitively just how I feel about them. I’ll watch everything and anything, and particularly love crime, thriller, and slow burns. Would love to make some LB friends and maybe we can watch something together!\n\nhttps://preview.redd.it/j3awbrb91m4d1.jpeg?width=1290&format=pjpg&auto=webp&s=a2a8130329814d618d1134b18279c05a3dd9c0a7",
            "As [my profile](https://letterboxd.com/dannersan/) states: Millennial dad that loves Star Wars, the MCU, LOTR, nostalgia, and most nerdy thing. Mostly non-serious reviews. Ratings and rankings based off a non-scientific mix of film appreciation and enjoyment level.\n\nI've been working my way through many of the \"classics\" that I haven't seen, but definitely tend to skew more recent. I also live walking distance from an Alamo Drafthouse, so I'm able to go to the theater pretty regularly for both new releases and when Alamo does showings of older movies.",
            "Hey y'all. If you'd like to follow my goal of hitting 365 watched movies over the course of 2024, give me a follow! And I'll follow back if you seem like a cool chap! :-)\n\n  \n[https://letterboxd.com/johnmathews/](https://letterboxd.com/johnmathews/)",
            "[https://boxd.it/5jmEr](https://boxd.it/5jmEr)\n\nHi! Love doing these monthly profile shares! I’m a casual movie enjoyer and always leave short reviews for everything I watch. I know that’s not everyone’s thing but they amuse me and I’m no film critic :) so pls don’t judge my possible bad taste haha\n\nI usually watch dramas, thrillers, and sci-fi. I also love studio ghibli!\n\nRecent (new to me) films that I enjoyed recently:\n\n* La La Land\n* The Florida Project\n* Nolan’s Batman movies\n* Heathers\n\nLooking forward to finding more mutuals and people to follow!\n\nhttps://preview.redd.it/cdlyqfhkim4d1.jpeg?width=1179&format=pjpg&auto=webp&s=4e904a906dc96658cee7240669a3884491aa7157",
            "I'm pretty active on Letterboxd and I always follow back.\n\nhttps://boxd.it/5glb",
            "Hi!  I'm a college student who spends way too much time on this site.  My watching patterns are extremely random, but I write a review for every film that I watch.  I've been trying to make an effort to watch more indie movies lately, and I welcome any suggestions!\n\nSome of my recent favorites: Pitch Perfect, Camp X-Ray, After Yang, Crimes of the Future\n\n[https://boxd.it/7t9GH](https://boxd.it/7t9GH)",
            "[https://letterboxd.com/nicktmurphy/](https://letterboxd.com/nicktmurphy/) I just started using Letterbox at the beginning of this year. I usually log new films coming out, and animated movies are the main ones mixed with other random movies. It’s a beautiful day—Mad Max Fury Road, the Lego movie, and Oldboy, just to name a few favorites.\n\nhttps://preview.redd.it/l3kg862x7o4d1.jpeg?width=828&format=pjpg&auto=webp&s=c7f2f4d48e5131b4d1f33de16fdd6240f25f91d2\n\nMy 4 favorites might change\n\nFuriosa, The Mad Max Saga, and Mad Max Fury Road are my favorite first watches so far. It’s June 4th of me typing this, and I’ve only seen 4 movies this month so far.",
            "https://boxd.it/3yWTp\n\nLast month I focused on the films of actor Ryuhei Matsuda. This month for pride I will be doing Japanese LGBTQ+ films.",
            "[https://letterboxd.com/lumumbista/](https://letterboxd.com/lumumbista/)\n\nThough there's been a bit of a lull lately due to grad school work, I'm a semi-regular reviewer of political films, and I try to incorporate a Marxist perspective whenever I can. [Here](https://letterboxd.com/lumumbista/film/soundtrack-to-a-coup-detat/)'s my most recently lengthy/nerdy review.",
            "[TheyMostlyComeAtNight](https://letterboxd.com/Marcus74/)\n\nI aim to watch a horror movie each day and then do a short write-up afterwards.   \n\nFeel free to add, I always add back!",
            "Hey all, been on LB for a couple years now. I try to watch a movie a day if possible. I don't really over think the review process and try to keep it simple. I dont write novels or the one line zingers.\n\nMy profile on Letterboxd https://boxd.it/39WqR\n\nSince I started using LB I've been expanding my film palette and enjoy discovering new films I'd never even heard of. I'm ashamed to say that it was only several years ago that I'd never even heard of Barry Lyndon and now it's one of my all time favorite movies.\n\nHappy to follow back!",
            "[letterboxd account](https://boxd.it/4HIqF)\n\nI'm Dawson, I watch a lot of movies. My job lets me watch a lot. I don't have one genre I stick to, I'll watch most kinds of movies. I tend to try and complete \"collection\" and rank them. In the previous few months I went through Oscar best picture winners and all the Scooby-Doo movies. Trying the find this months, thinking maybe Scorsese movies but if you have any idea let me know. I try to stay on top of new releases watching at least one a week but hopefully more.\n\nI review most movies I watch (rate everything), some I just don't have much to say about. The reviews range from a couple of sentences to more in depth about my thoughts at times. Don't really know if they much appeal to others but thought I'd put my profile out there. My rating skew higher because I tend to watch what I know I'll enjoy.\n\nhttps://preview.redd.it/i1uv7m424t4d1.png?width=720&format=pjpg&auto=webp&s=d84301bbe656b9098c507895fe42c112b42db60c",
            "https://boxd.it/1VX41\n\nI use Letterboxd a lot, and I want to connect with more people on it. I've been connecting with some great people from these threads! My reviews range from long in-depth writeups, to a few quick thoughts, to just a quote I like. I watch a movie just about every day if I have time. I watch a huge variety of films; new and old, popular or not so much. I just love movies!\n\nSome of my favorites I've seen from the past month:\n\n1. Snack Shack\n2. I Saw the TV Glow\n3. Conquest of the Planet of the Apes\n4. Io Capitano\n5. The Wages of Fear\n6. Hundreds of Beavers",
            "https://letterboxd.com/anjjk/\n\n\nMy favorite first-time watches last month were: \n\n\n2046 (Wong Kar-Wai)\nThe Gleaners and I (Varda)\nLe Cercle Rouge (Melville)\nFURIOSA (Miller)",
            "Hey ya'll, just throwing my profile out there: [https://boxd.it/8npW9](https://boxd.it/8npW9) \n\nI review every movie I watch and and try to follow back all. Mostly into US movies from the 70s through 2000s but always looking to expand my horizons. Hope to see you out there, cheers!",
            "[https://boxd.it/DhTh](https://boxd.it/DhTh)\n\nI love '70s-'90s slashers (and horror from those decades in general), camp, actresses/films led by women, queer stories, '90s-'00s comedies, Bob Fosse musicals, nearly everything Hitchcock did from 1954 to 1960, Yorgos Lanthimos, Greta Gerwig, John Waters, John Carpenter, De Palma's thrillers, and everything about Clue (1986). Still making my way through the classics, even though I usually watch a movie every day I still feel like there isn't enough time to see everything I want to! But I'm willing to give anything a fair shot. Hope to meet and follow others with similar tastes!\n\nCurrent four faves: Poor Things (2023), Serial Mom (1994), Rosemary's Baby (1968) & Rebecca (1940).",
            "I've been on Letterbox for a little over a year now and I log everything I watch (as long as it's on LB.) \n\nMy 4 favorites are Her (2013), Whiplash (2014), Lady Bird (2017), and Moonlight (2016.) And my favorite first-time watch of this month is definitely The Shape of Water. \n\n[https://boxd.it/4hcSP](https://boxd.it/4hcSP)",
            "https://boxd.it/7buEr\n\nI’m currently a film student at university. I am on Letterboxd to find people who love film as much as I do. I follow everyone back who follows me because no matter what films people are into it’s nice to be a part of a community who shares love for the same thing",
            "https://boxd.it/1m1AX\n\nHi all! \n\nI’ve been enjoying the profile swap, if you would like to swap profiles feel free to message me here! I’ve been using letterboxd for 4 years now and I’ve been watching more movies this year than ever thanks to being out of college. My goal is to see all of Cronenberg’s movies this year, 7 down so far",
            "Let’s be Letterboxd homies.\n\nhttps://letterboxd.com/whimpy/",
            "[https://letterboxd.com/apeterson13/](https://letterboxd.com/apeterson13/)\n\nComing up on a year of movie watching, but I only really got serious about 3 months ago. I watch pretty much any type of movie, and always write something for it. I've been watching 3-4 movies a week so far this year and might start doing daily movies this summer. I usually pick something from my watchlist but when someone recommends something I usually listen to them.",
            "Pretty new to the sub but would love to be mutuals!\n\n[https://boxd.it/45qRH](https://boxd.it/45qRH)\n\nHave been slowly getting thru my watchlist but can't help it to do small detours or rewatch a favorite. Best way to hold myself accountable to watch a new movie is opening the movie's page in a new tab and keeping it there until i watch it. Hate to keep the browser too busy so it's like a mini checklist. Usually average 9-10 movies a month so hopefully i can keep pace. I always prefer quality > quantity. And i feel that if i watch too many movies back to back they'll all just blend together. Better to let em breathe a bit \n\nJune should be a great month i already have 4 logged in the first week. But it's also a HUGE month for tv premieres so probably will be another detour lol",
            "Greetings, All! Just joined Letterboxd in January. I've recently become funemployed, so I'm making the most of my time by trying to watch at least 1 movie a day.\n\n[https://letterboxd.com/sctisdale](https://letterboxd.com/sctisdale)\n\nRight now, I'm trying to fill in all the gaps in my stats chart with at least two films from each year going all the way back to 1920, it's been quite the journey. Some of my favorites along the way have been Häxan (1921), The Lady Vanishes (1938), Sawdust and Tinsel (1953), Z (1969), and The Vanishing (1988).  \n  \nMy favorite first watch for June so far has to be Black Narcissus (1947).  \n  \nPlease add me!",
            "My profile on Letterboxd https://boxd.it/7XWOb\n\nI've been using letterboxd since December 2023. I've  came across it on reddit. I'm a non English speaker , I like to watch films. I like to watch all kinds of genres. I've been on a streak this year to watch atleast one film a day. I've watched over 350 films as of now this year. I've started with watching popular movies I haven't watched then I moved on to popular directors filmography. I want to explore different filmmakers and some classic movies. Hope you enjoy my profile.",
            "[https://boxd.it/4MUiX](https://boxd.it/4MUiX)\n\nHorror fan here, looking for other people who mostly watch horror to follow",
            "[My Profile](https://letterboxd.com/Jason_Voorhees/)\n\nJust trying to find other horror film lovers out there! If you love horror give me a follow so I can follow you back!",
            "Two movies I loved I watched this june that are great and underrated are \n\n  \nBurn after reading - With brad pitt and clooney so fucking funny and so fucking good\n\nOut of the Furnace  - Christian bale and whole bunch of great actors - maybe one of bales best movies \n\nAlso here is my profile!\n\nSome people love my reviews  and some people hate them. Some people think my reviews are hilarious, others think my reviews go to far. At the end of the day if you want something interesting my profile might interest you.\n\n[https://boxd.it/5s5vv](https://boxd.it/5s5vv)",
            "I love thrillers, horror, and really almost all types of movies! I am constantly watching and reviewing. Please give me a follow! [My account](https://boxd.it/2ZmLJ)",
            "Hi everyone! This is my profile: https://boxd.it/528p9\n\nI like to watch a little bit of everything and leave my reviews short and sweet, about 1-3 sentences. Most of the time they just help me remember what I thought about it so I don’t trick myself into giving a one star movie another try 😂\n\nAlways happy to follow back! I love seeing what people watch and what they think about it.",
            "I host a pop culture focused show with a national company & LOVE talking movies, series, music & technology. \n\nI’m making a concerted effort to log all my movie watches this year, because I’ve been lax in the past. Hoping to find new fellow pop culture buffs :)\n\n[Kyle McMahon’s Letterboxd](https://boxd.it/HGUd)",
            "[https://boxd.it/4azXJ](https://boxd.it/4azXJ)\n\n  \nCurrent top:\n\nInland Empire  \nAlien  \nGalaxy Quest  \nFunny Games (2007)\n\nCurrently going through the Halloween, Tromaville, Roger Corman and Universal Classic Monsters watch-throughs, occasionally watching other cool and weird movies.\n\nI'll follow back (eventually).",
            "I'm sure that most of people in this thread watched more movies than me. So, I'm open for recommendations.\n\n[https://boxd.it/5jY1n](https://boxd.it/5jY1n)",
            "https://boxd.it/1N6vd \n\nmostly watch horror movies and love reading peoples reviews, though i haven’t been able to watch much recently because of exams",
            "Been on Letterboxd for over 10 years, most of those as Patron.\n\nI work for an international film festival. Love to watch movies with dream logic and bizarre narrative hoops, but I'll watch anything. \n\nBest film of 2024: Ibelin\n\nBest film of the 2020s so far: The Blind Man Who Did Not Want to See Titanic\n\n\n[My profile](https://letterboxd.com/choekaas/)",
            "I try to watch a lot of different things. I generally try to average out to a film a day throughout the year. \n\nThe past few years have been putting in my diary, rating, and reviewing (with at least a sentence, sometimes a small essay) every single film.\n\nOne year (covid19 times), I set myself the challenge of watching 1000 films (made a list of them) - was a stupid idea, I don't recommend. \n\nI encourage everyone to watch ALL of the films that have ever been made.\n\nFilm is life.\n\nAnyway, give me a follow if you want: https://boxd.it/gk0D",
            "37/Married/Florida USA / dog dad to a corgi \n\nhttps://boxd.it/lz5X\n\nBeen on the site since 2019. \nPro for one year and will never change \n\nMy wife and I have been doing a lot of rewatching. So my only first time viewing this month is South Park: The Obesity Special. Loved it. \n\nI could go all day with the rest of the questions. \n\nSo I won’t\n\nTop Four currently \nMaster and Commander \nThe Last of the Mohicans \nTerminator 2 \nPorco Rosso",
            "Here is my [profile](https://boxd.it/4ILkn)! I like sharing my reviews and watches, and always like seeing the same for other folks!",
            "i probably haven't watched that many movies like other people on here but i love letterboxd and i'd love to meet some new people on here!  https://boxd.it/6cDNP",
            "[https://boxd.it/7GYZL](https://boxd.it/7GYZL)\n\nCurrent top 4: The Guest, Phantom of the Paradise, The Crow, Yaji & Kita.\n\nI try to go to the cinema every week, but I usually watch an older one if that doesn't happen. My favourite films recently have been Abigail and Challengers.\n\nI tend to rate according to how much I liked it, which tends to result in puzzlingly high scores for some films. You've got to be okay with that.",
            "I know I’m a little late but I just want to find cool people to follow and such. I try to watch as much as I can. Been using Letterboxd for a little over a year now. I aim for horror and action stuff but you’ll probably find me watching a whole lot of variety. I’ll follow back whoever follows me 😄👍\n\nhttps://boxd.it/5Yipf",
            "I started using Letterboxd around October 2022 and since then I basically use it everyday. I watch basically anything from the basic stuff, horror, but not a lot of new releases as I dont have much time to go to the cinema. I sometimes write long reviews but I try to do it more because I lack writing skills. \nMy 4 favorites right now:\nMulholland Drive\nParis, Texas\nLa Haine\nPerfect Blue (strongly hesitating with In The Mood for Love)\nFollow me pls\nhttps://boxd.it/4RgNV",
            "I make really crappy joke reviews in the hopes that at least one person finds them funny. I’m trying to best my record of 200 last year, which I’m on track to do so. I love going through new profiles and finding new lists and movies, so follow me for a follow back!! [My user is _tayo](https://boxd.it/3E7kP)",
            "Movies are nice. [I like movies. ](https://boxd.it/1lpXJ)",
            "https://boxd.it/1G4uD\n\nHello! I’m codeinecrim! I’m fairly new to letterboxd but i am getting more into film as of late. I follow back, just looking to get exposed to as many films as possible :)",
            "[AnEclecticMess](https://letterboxd.com/aneclecticmess/)\n\nI’ll watch mostly anything these days, but 80s/90s action movies will always be my sweet spot. Well, that and John Carpenter movies in general…",
            "hello! trying to get followers and follow people that have the same taste in film as me!! i am basically a wannabe film critic who thinks their reviews are amazing—despite them being ridden with grammatical errors and misspellings… anyways, follow me if you want!! \n\nhttps://boxd.it/6zFHZ",
            "I just finished backlogging! Now looking for more peeps to follow so I see more what everyone's watching and rating. I don't write a lot of reviews, only if I feel the need to say something about the movie.🤷\n\n[https://boxd.it/9Ls89](https://l.facebook.com/l.php?u=https%3A%2F%2Fboxd.it%2F9Ls89%3Ffbclid%3DIwZXh0bgNhZW0CMTAAAR3ysLmepbr4NIbUwPLAiWu3lXprSacFhD2C_E5SKOJoyZVf8h01Ng7qHC4_aem_ZmFrZWR1bW15MTZieXRlcw&h=AT1qP8AzUXc7yWJu_x5jj6Fg4h5mhtoykAbHUP89QhR1_vNpBUNFin-mFbGeQOIOJSv7Jn1atKsUXuQYzUroAFmH7iiLRB55hEZMRzubHMWoFq2Sx2WirMqrBHhFT0GUqg&__tn__=-UK-R&c[0]=AT0kCeuv8Qzx2QsAOQt73tfBcIu_cRDnaErhkostyRLHc995ZdgoxwgcFRFmajbWXuiOvC2ZCyI0NqoFIYuKUPp8d-jBjQt1Vxz6sJqgUmUUit0X8XbkjtPXkdg_1bzh4xXqY3IdwEFV9Df0qBtbDZpvOJCnR-YTaZfqUqDEF0pfrEdA7BFqFIqKlwHD2-nl) (grungezombie)\n\nI watch a lot of horror, old and new; sci-fi, action, mystery/thriller, monsters...  \nEvery year in October I have a Horrorthon and try to watch as many horror movies as I can (Horrorthons 2018-2023 are recorded in my profile's Lists).\n\nI'm still figuring out all the LB features, but I'm really liking LISTS and how I can fade-out films I've already seen and it shows me a percentage of the list I've watched.",
            "New to Letterboxd but not new to loving to watch movies. Fav films include LOTRs, Jurassic Park, Pirates, Scream, The Mummy 1 & 2. Watching something new just about every weekend.\n\n[https://boxd.it/9RBOP](https://boxd.it/9RBOP)",
            "Hi guys Im not new into watching movies but im new to letterboxd so i want to have friends from that community to discuss with all of you about my shitty taste in movies so i will be glad to follow you also\n\nhttps://preview.redd.it/zbrzcwdtin5d1.png?width=720&format=pjpg&auto=webp&s=d6244fd8821e3109e4aa9b99667d0e40cacbb506\n\n[follow me](https://boxd.it/a2PiF)",
            "[https://letterboxd.com/elviraaa13/](https://letterboxd.com/elviraaa13/)\n\nHow long have you been using the site? What kind of films do you usually log? What are some of your favourite flicks? Tell us all about yourself.\n\n-- I've been using the site for a few years now. I usually watch movies based on my mood and what I'm looking to feel. Some of my favorites, other than my top 4, are Constantine, Carrie, Nosferatu, What We Do In The Shadows. I work in the accounting sector for an IP law firm and if I'm not working then I'm probably watching a movie.\n\nFavourite first-time watches of June 2024? What're your current four favourites on your profile?\n\n-- I recently watched Everybody Wants Some!! and that was really good. I watched the Exorcist and it was so fucking hilarious. \n\n-- My top 4: \n\n1. Only Lovers Left Alive\n\n2. Suspiria (2018)\n\n3. Beetlejuice\n\n4. The Exorcist (replaced Bones and All today)",
            "Hey guys this is my letterbox down below: \n\nhttps://boxd.it/4CSyp\n\nI’m on a quest to do a movie a day (sometimes more, sometimes none at all). My reviews are always pretty short, like 2 sentences but sometimes if I really have a lot of thoughts on a movie I’ll say like a paraphrase. If you wanna discuss a movie please feel free to dm me because I feel like I kinda watch more movies than most my friends and yeah! I also def have some controversial ratings so yeah I’m up to debate if you’d like :) thank you!\n\nEdir: if you want me to follow back please reply with ur username bc I never check notifications on letterbox lol",
            "Hi guys, \n\n  \nI'm into weird, obscure horror stuff (especially 60s - 80s), but like all types of films. Feel free to add me: [https://letterboxd.com/Gruftgal/](https://letterboxd.com/Gruftgal/)",
            "I’ve been using letterboxd for about a year now and love reading everyone’s reviews and thoughts on movies.  \n\nI goto the movies about once a week and love having this an outlet to post my thoughts! \nMy top four out:\nStar Wars Episode 3: Revenge of the Sith\nStarship Troopers\nJaws\nHereditary\n\nWould love to meet new people! \n[my page](https://boxd.it/6X8NN)",
            "[https://boxd.it/7mU1](https://boxd.it/7mU1)\n\nBeen using Letterboxd for almost a decade. I tend to write a few paragraphs on films I think deserve it, and a sentence on those I'm either rewatching or that don't inspire as much. Have a lot of love for a lot of genres, but a general preference for the weird, subversive, and metatextual. \n\nRatings and reviews have been almost solely for my own benefit for 10 years, but it couldn't hurt to have a few more people to follow!",
            "My Profile [Here](https://boxd.it/2Awyb)\n\nHey everyone! Follow along with my film journey as I rate and review every film I watch. I follow everyone back as long as they write actual reviews (I'm not a fan of one-liner joke reviews, but no offense to anyone who enjoys them or likes to write them)",
            "Would love to make some movie friends! \n\n[https://boxd.it/47QYt](https://boxd.it/47QYt)",
            "18 days in and people still responding, yay!\n\n[https://boxd.it/1mdmN](https://boxd.it/1mdmN)\n\nMy top 4 is the four movies I most want to talk about at any given point.\n\nI live in a city connected with Hollywood so I see most every film weeks in advance, I never spoil. With 2 bitchy reviews in my near 2k logs, everything is positive and focused on my love for cinema and storytelling.\n\nI like philosophical provocation from film so definitely stay away if \"smart talk\" pisses you off =\\]",
            "https://boxd.it/pJyj\n\ni’ll follow you back! and if you send me a rec or have an interesting top 4 ill probably watch them :) everything ive been watching has been so boring lately .. help!",
            "Hi, I'd really like to make new friends that're into movies because none of my irl friends seem to be as into it as I am. Not anything serious or critical, is just like to see other perspectives and thoughts of the same movie please!!! I'd appreciate it (:\n\nhttps://boxd.it/4RjlZ",
            "Hey everyone! The name is [Armando Arrojo](https://boxd.it/1aENx) \n\nHuge movie geek here, 26M, from Madrid, Spain. I follow back everyone, feel free to add.\n\nI love every genre but horror and action are mostly my thing!",
            "Hi all. Here’s my [Profile](https://boxd.it/WHQL)\n\nI’ve been on Letterboxd since 2019 but only started using it in earnest a little under a year ago. I’m also brand new to posting on Reddit. \n\nI generally watch about 3 movies a week and try to go to the theatre at least once a month depending on what’s out. I make a ton of lists: actor and director top 10s, year top 10s, niche genres, and then random stuff like movies directed by ex-stuntmen.",
            "I'm loureviews on Letterboxd  \n[https://boxd.it/2uLh](https://boxd.it/2uLh)\n\nI try to log everything I have seen that is on the site, so films, filmed theatre, TV, shorts, music. I watch several films a week and have reviewed over 6k. I joined LB just over ten years ago and have met some really great people there.\n\nMy four favourite films rarely change - Napoleon (1927), The Innocents (1961), Gone With The Wind (1939) and The Devils (1971). I generally watch US and UK titles although am spreading out into Europe, Japan and beyond.",
            "https://boxd.it/4s3rH",
            "my first time doing this   \nlesssgoooo\n\n[https://boxd.it/3chk5](https://boxd.it/3chk5)",
            "omg first time i've done this\n\n[https://letterboxd.com/idiotaculiao/](https://letterboxd.com/idiotaculiao/)\n\nthat's my profile. i haven't logged much lately cause im very busy with my thesis, but one of the last films i've seen was Election (2005) and omg what a masterpiece.\n\nmy top four are:\n\nAshes and Diamonds (1958)\n\nI am Cuba (1964)\n\nThe Spook Who Sat By The Door (1973)\n\nInvasion (1969)\n\ndo with that what you will",
            "It’s been about a year since the last time I commented on one of profile swaps, so I figured it was time for another!  My profile is [here](https://boxd.it/6djJP) :)\n\nI’ll watch just about anything that strikes my fancy, but I particularly love historical dramas/romances and thrillers.  I’m not terribly consistent about watching films, but I try to watch 1 or 2 movies a week, when I have the time.  I love reading reviews and am always looking for new recommendations!  \n\nSo far this week, I’ve watched Juno (2007), Les enfants du siécle (1999), and Eating Raoul (1982).\n\nMy top 4 are: Oldboy (2003), The Big Lebowski (1998), La reine Margot (1994), and The Piano Teacher (2001).",
            "Hi everyone! I love watching films and reviewing them :) I am sort of new to letterboxd and would love to share my reviews with others. My username is @marsg84\n\n\n https://boxd.it/8J3YV",
            "Hi everyone! :) I am fairly new to letterboxd and would love to create a community with other letterboxd users! \n\nhttps://boxd.it/8J3YV",
            "I had the pleasure of watching two amazing movies this month -  [Missing (1982)](https://boxd.it/6HecUX) and [Leon the professional (1994)](https://boxd.it/6Gt1fb)\n\n  \nI watch movies as and when I am in the mood. I am very selective when it comes to movies. I might decide to add a movie to the watchlist but end up not watching at all.",
            "Hi everyone, I’m looking to find new friends on Letterboxd and will follow everyone back!\n\nhttps://boxd.it/4x9DJ",
            "Hello,\n\nI love a good film, I don’t post big reviews (don’t find the time) I’ll occasionally find something funny to say. I’m starting to delve into more international film recently, Thankyou Mubi. I 100% follow back, I’m looking forward to adding everyone’s favourites films to my watchlist.\n\nhttps://preview.redd.it/f0r78ljv6z7d1.jpeg?width=1179&format=pjpg&auto=webp&s=0e59b99d8a7cba0d58196ea4b46d977f865fc478",
            "Coming back to letterboxd after a very long break and looking to meet new people to interact with. (https://boxd.it/3TA8D)\nMy top four right now is:\n\nLord of the rings RoTK (2003)\n\nThe matrix (1999)\n\nDune part 2 (2024)\n\nBefore Sunrise (1995)",
            "https://preview.redd.it/6djqz51k5d4d1.jpeg?width=1170&format=pjpg&auto=webp&s=3f971b41be2ff89f7032a3091beb907f02f94d5f\n\nHi there! I’m doing my best to work through the They Shoot Pictures, Don’t They? list of the 1000 greatest movies of all time, as well as the Letterboxd Top 250. Progress has been slow this year, but I’m picking up the pace again. I’m also making an attempt to watch movies from 52 different countries this year.",
            "Hey y’all! I love horror, but pretty much watch anything and everything. I try to leave reviews for everything I watch these days; sometimes funny, sometimes more in depth. I like reading reviews of other like-minded people! I’ve been getting into making lists lately, starting with ranked horror movies for each decade I’ve been alive. I follow back as well.  \n\nProfile: https://boxd.it/2vJY7",
            "hi here’s my [profile](https://boxd.it/86nU7)! i follow back everyone and only give 5 stars to movies that make me cry so give me sad recommendations pls lol\n\nhttps://preview.redd.it/hxmaw7j2hg4d1.jpeg?width=828&format=pjpg&auto=webp&s=f9cd5050953f953696ea2d5e60e0da2d0d9712e4",
            "https://letterboxd.com/MattLamb/\nJust a small town guy filling his empty existence with movies. If you're looking for in-depth analytical reviews I'm not your guy, I just watch movies and type out my dumb thoughts. I like to think my taste is pretty varied. I love old Hollywood films, enjoy silent films, art and indie movies and big dumb stupid shit. My heart and joy is genre films and B-movies. I love diving through Tubi's trash. Some of my favorite filmmakers include Brian de Palma, Walter Hill, Sam Raimi, David Lynch, Abel Ferrara, George Romero, and Michael Mann. I'm the kind of maniac who loves Michael Bay and thinks Paul W.S Anderson makes fun movies. Last I checked Jean Claude Van Damme and Scott Adkins are my most watched actors and Albert Pyun my most watched director. If you like trash or find my weird interests compelling feel free to follow. https://letterboxd.com/MattLamb/",
            "Made my account sometime in COVID and my favorites are Last Crusade, Spider-Verse, Arrival, and MI: Fallout. During the summer is where my movie watching stays constant. \n\n  https://boxd.it/4xOAL\n\nSeeing Challengers again today. Probably keeping its spot at #1 for the year for me.",
            "hi im caleb, and i love movies and meeting new people!\n\n[**https://boxd.it/32uDf**](https://boxd.it/32uDf) \n\nhttps://preview.redd.it/pzlrhfjfoe4d1.png?width=807&format=png&auto=webp&s=fba8e850a13e69d7981e36da540e1ce53ef64b17",
            "hey all — been a letterboxd user for a couple years. latest activity has been full of the planet of the apes movies because my roommate and i have been binging them lol\n\n[https://boxd.it/1AW9R](https://boxd.it/1AW9R)\n\nhttps://preview.redd.it/k9l3ifgkoe4d1.jpeg?width=1170&format=pjpg&auto=webp&s=5dff80224186dacd89b5984baa6d6ca32f1c45a6",
            "Hey everyone!  \n  \nThis is me: [https://letterboxd.com/digital\\_dust/](https://letterboxd.com/digital_dust/) I joined Letterboxd this year, and still tuning my antennas to everything from classics to cult favorites, especially imaginative and thought-provoking ones. My reviews are usually short and sweet.  \n  \nCurrent faves:\n\n* 2001: A Space Odyssey\n* Princess Mononoke\n* Triangle of Sadness\n* Poor Things \n\nLooking forward to sharing thoughts, and maybe a few \"I can't believe I just watched that\" moments with you all!🍿🎬",
            "https://preview.redd.it/0ts7lge5pe4d1.png?width=1080&format=pjpg&auto=webp&s=ff154d61679076b38afaf602d2e14b5caef2e57c\n\n[https://boxd.it/6wScz](https://boxd.it/6wScz)\n\nI like movies, music and memes. In that order.\n\nI normally write short but sweet reviews, but if I really like something I'll write something longer",
            "Hello! I’m Dylan \n\nhttps://boxd.it/3tpjj\n\nI’m trying to return to the one movie per day average being just 11 movies short of that (9 after today). I give thoughtful reviews on every single movie I see. As an AMC A-List member, I keep up with most new release movies, and I work through my watchlist in the days between. \n\nMy favorite first time watches for the month of May included The Name of the Rose (1986), Furiosa (2024), The Crow (1994), and Hereditary (2018).\n\nI also work on lists such as 2024 and 2023 Ranked, The Definitive Ed Harris performance ranking (76 films so far), and my catalogue of every movie I see in theaters with information regarding attendance.\n\nI love movies, and I’m excited to find others who do too.",
            "DBJfilm:  https://boxd.it/2wmfP\n\nI'm big on anything horror, and classic films (the black and white ones mostly), and try to keep up with modern films as well.\n\nI work in film (I'm directing a short *this weekend*), and I love analysis, so my reviews often go in depth. Except when they don't. It depends on my mood, but I always leave *some* review.\n\nI also have a horror analysis podcast [Cadaver Dogs](https://open.spotify.com/show/0iDAh7F1NIBxkSxd2dyXuB?si=hm6iGywZS_KVdFKhNMZG8A), and [my previous horror short \"Pillow Talk\" is available on YouTube](https://youtu.be/xKdTu1l9keA?si=hidQGi3jN-VwKxHd) (and has [its own Letterboxd page](https://boxd.it/LjD0) too).",
            "user: queenbi\n\nhttps://preview.redd.it/0uouv8llr57d1.jpeg?width=1170&format=pjpg&auto=webp&s=0f26b2bcb4bb2b23c8e628af959dd7d42e8b6a40\n\nonly been on letterboxd since march but i love it.\n\nI’m most proud of my fight club review so if you wanna check it out and let me know what you think that’d be cool.\n\nmy top first time watches of the last couple months are society of the snow. a must watch. so so so good. & fall guy bc im a total fangirl for ryan gosling. bodies bodies bodies was also surprisingly good as well. rachel sennott is fucking awesome.",
            "Hello, everybody! I'm Creasy007 and I'm always looking for new followers because I use my Activity Page for everyone's reviews that turn me onto other great films. I try to watch one film a day, every day, and I'll watch just about everything. \n\nhttps://letterboxd.com/creasy007/",
            "Hi! I'm Juan 28M, I'm from Argentina and here's my [letterboxd profile ](https://boxd.it/jAal). I like to review every film I watch and I'm kinda using this as a way to keep my English writing on point. I follow back and I usually read my friends' reviews at work on the activity tab lol.",
            "Hey everyone! I'm large\\_fern. Find me here: [https://boxd.it/6jsB](https://boxd.it/6jsB)\n\nYou'll find that I watch a ton of horror, but I typically watch just about anything and will often catch up on many classics as well (especially since so much is being restored.)\n\nI try to follow every active account that follows me.\n\nI usually watch 2-5 per day, except for this weekend since I was away. A few favorites that I’ve seen recently for the first time or rewatched are:\n\n* Possession \n* Come and See \n* After Hours \n* Thief \n* Blow Out \n* In a Violent Nature \n* Paris Texas\n* Ms 45",
            "[https://boxd.it/2CwXf](https://boxd.it/2CwXf) hi, i'm anja!!!! (@anjaarv)\n\nim a huge horror movie girlie, but also adore the coming-of-age genre and anything 80s. all i REALLY look for in a movie is to have fun watching it, though, and bonus points if there's hot ppl and a good aesthetic.\n\ni rate and review every single movie i watch— my reviews r usually pretty short and dumb, but i sprinkle in some thoughtful dissertation-level ones every once in a while for good measure. i actually have a list of my fav reviews i've done pinned to my profile, to give u an idea of how i write them (and the type of movies i gravitate towards in general).\n\nletterboxd is my fav social media and i'll take any excuse to spend even more time on it, so let's be mutuals!! i'm just looking for good movie recs and reviews that i can laugh at and/or relate to <3\n\nhttps://preview.redd.it/1focyolb7e4d1.jpeg?width=750&format=pjpg&auto=webp&s=b5cc93c56b46001a362d503045dcf99b9a5e384f",
            "[Here is me!](https://boxd.it/1HIMp).  \nI am working on LB top 250, as well as movies around the world.  I review everything I write(from a sentence to a novel..) and love to follow people who write reviews often\n\nhttps://preview.redd.it/s765frmeyc4d1.jpeg?width=1284&format=pjpg&auto=webp&s=6aa5f60e043113af392b22c60b43ac9c2138eb10",
            "Hellooooo, everybody! Happy Pride Month! I’m [Tristan](https://boxd.it/ybSn)!\n\nMay was an exciting month. I was lucky enough to be a guest on Amy Hensarling’s Watch This List podcast for a second time to discuss my favorite 2010s blockbuster, *The Last Jedi*! I also revisited the *Apes* prequel trilogy in anticipation of *Kingdom*, which I enjoyed. And, of course, I experienced my fair share of 1910s/20s avant-garde and comedy classics, including some early Chaplin shorts I’d never seen.\n\nI’m looking for followers that enjoy in-depth reviews and who are writers themselves. I’m active on the app and like/comment on the reviews of people I follow.\n\nSome of my favorite mutuals: [Jeff A](https://boxd.it/4ha0L), [Micah Webber](https://boxd.it/ivEj), [Amy Hensarling](https://boxd.it/8cF3), [Tom](https://boxd.it/1ETKj), [MirroredIrony](https://boxd.it/24cqx), [nohalmos](https://boxd.it/5Xel7)\n\nCiao!\n\nhttps://preview.redd.it/9abol0ydyc4d1.jpeg?width=1170&format=pjpg&auto=webp&s=a1e9b3f4c96fd4970150c2482f017cccee7e48d5",
            "Hello, my profile came be found here: [https://boxd.it/6ROJ7](https://boxd.it/6ROJ7)\n\nI tend to like science fiction and horror, mainly. But I am also open to watching things, outside of what I would typically see. I like films with an emphasis on mood, and deal with interesting themes/questions. David Lynch, Terrence Malick and John Carpenter are some of my favourite directors.\n\nhttps://preview.redd.it/au142ugwfd4d1.png?width=1080&format=pjpg&auto=webp&s=5f49ed3ce5372b24e5a3675ac5f84bcc99b16b7c",
            "My top 4\n\nhttps://preview.redd.it/mak5af3qld4d1.png?width=663&format=png&auto=webp&s=cab922dda0512705883a49e2ee48f68046e3a6e0\n\nI'm at [https://letterboxd.com/mrinalmech/](https://letterboxd.com/mrinalmech/)\n\nI like all genres from all over the world and am a big physical collector (Criterion, Arrow, Eureka etc).\n\nFavourite first time watches of last month - *Body Double* and *Furiosa*\n\nNowadays I am really digging gritty 70's thrillers/neo-noir",
            "I'm [DubiousLegacy](https://boxd.it/24dqX): [https://boxd.it/24dqX](https://boxd.it/24dqX)\n\nI just finished up [Ani-May](https://boxd.it/vf4TO), where I watched a ridiculous 57 animated movies (and a bunch of [shorts](https://boxd.it/vNZny)) over the course of a month.  My focus this year was movies with robots in them.  I'm working on a project about movies and philosophy of AI, so I'm slowly trying to watch every movie about AI.\n\nI'll go back to knocking out [classics I haven't seen](https://boxd.it/uTW00) in June, I think.  That was a lot of pretty crummy sci-fi cartoons logged by fewer than 1000 people.",
            "[https://letterboxd.com/Funez/](https://letterboxd.com/Funez/)\n\nI love J-Horror or Asian Horror in general, so you'll find a lot of movies like that in my profile. I started watching movies this year, because i realized that there are a lot of classic movies that i know but i never watched",
            "Any Norwegians? I would love to follow you - esp if you write some thoughts on the movies you watch :) [Here's my profile](https://boxd.it/7eOr9), I write my reviews in Norwegian.",
            "https://boxd.it/83vgt\n\nI've recently become a cinephile and have been a member of letterboxd since December last year. My favourites are in to particular order, and I love them all equally.",
            "[‎IntakeCinema’s profile • Letterboxd](https://letterboxd.com/IntakeCinema/)\n\nI watch a lot of Japanese films, I usually write a short paragraph or two. If you're interested in Japanese films at all, then check me out (and the people I follow).",
            "howdy! im [kirby](https://boxd.it/3Pd8n)! ive followed some awesome folks from past threads, so figured i should add my LB here again!\n\nim trying to watch (at least) a movie a day this year, and im at 195 so far! my favorite genres right now are horror and cheesy early 2000s, even better is a combo of both. if you have any recs i would love to add them to my watchlist :-)",
            "I’m a great Letterboxd user. I’ve met so many great people through this app and subreddit. https://boxd.it/RVYT this is my profile. I’ve been watching some great deep cuts these last few days. Beware of a Holy Whore the Fassbinder film (starting pride month right) and also John Ford’s Mister Roberts (starting Pride month wrong)",
            "https://boxd.it/30jsV\n\nFollow me if you wanna!",
            "[Hey there!](https://boxd.it/1trXn)\n\nhttps://preview.redd.it/9iz5a7jeme4d1.jpeg?width=1440&format=pjpg&auto=webp&s=d08da050da672505de77c482b241d5dff831e1ba\n\nI'm currently a film student who's catching up on movies that I didn't have the time to watch during last semester!",
            "Hi, I'm [Danna ](https://boxd.it/47Ft5):) \n\nI can't say I watch a lot of interesting things, and will say I am behind on others, but I've set myself to watch 2-3 films a week to get all what I've missed out on. I don't have any specific genre I watch as I'm just trying to broaden my horizons atm. I follow back anyone who follows me as well.",
            "https://preview.redd.it/0dbicga5re4d1.jpeg?width=1290&format=pjpg&auto=webp&s=7463a4f92ea2190a64af824ebdf123931e29b1e6\n\n[me profile](https://boxd.it/5aUY3)\n\nI watch way too many movies and i (controversial) LIKE when people post funny haha reviews. Sometimes i write real thoughts but usually i just write something dumb",
            "Like to take a lighter side to LB and not take things too seriously \n\nHave developed my own metric called Smoothness \n\nhttps://boxd.it/54KMT",
            "https://boxd.it/83bt\n\nHi guys! I’m Sam, 29 from Australia. I’ve been using Letterboxd since 2017 and have been using it a lot (almost chronically tbh) in the past few years. My favourite genres are horror, animation and musicals. I’m open to pretty much anything but am also a basic bitch when it comes to movie taste!",
            "Hi everyone! Here’s [my profile](https://boxd.it/60cud)\n\nI’m a big Star Wars nerd and also just love action/sci fi movies in general. I’m trying to be a bit more active on LB - I’ve seen a good amount of films, but have only been uploading my ratings/reviews upon fresh rewatches. Been on the app for a little over a year. I’m probably more favorable than critical of films. Feel free to follow; I’d love to follow back!",
            "Ladies, my [wife](https://boxd.it/I2c3) is looking for more women to follow on Letterboxd. She’s a casual film watcher and she said she’s tired of seeing a bunch of men’s perspectives on the films she watches.",
            "https://preview.redd.it/ifhrhupvte4d1.jpeg?width=1179&format=pjpg&auto=webp&s=69dc3004443fb480789dfe9b74b5ce6d7a086daf\n\nHey folks - lots of horror stuff, lots of 70s & 80s stuff. Varied taste. Always try to write a review. Often think I don’t watch many recent films but my stats tell me different.\n\n[https://letterboxd.com/alterego666/](https://letterboxd.com/alterego666/)",
            "I've been using Letterboxd since January 1st. Before that I used IMDB for 10+ years. Letterboxd has helped me to fall in love with watching movies all again. This year I've already seen 230+ movies. Feel free to follow my journey towards 2000 total logs. \n\n[https://letterboxd.com/MikkesMovies/](https://letterboxd.com/MikkesMovies/)",
            "Hey I’ve just broken through the 3000 mark. Enjoy all sorts of films and try to keep a yearly list of my top 12 (12 rather than 10 because it looks nicer on the app). [https://boxd.it/3KyDL](https://boxd.it/3KyDL)\n\nhttps://preview.redd.it/f08iyokvxe4d1.jpeg?width=1290&format=pjpg&auto=webp&s=e2632d36a4aabd36ee66c9c2540fd5f00f49557c",
            "Hi I’m Chloe and I’m 15:)\n\nI joined letterboxd last year and Ive become really obsessed with reading and writing reviews, right now I’m trying to find what kinds of movies I like, check out my letterboxd profile: https://boxd.it/6R8NL\n\nI follow back:)",
            "Hi, I’m [Jordan](https://boxd.it/918tz)!\n\nI was introduced to Letterboxd by a good friend of mine in February, and I’ve been using it every single day. I’m a lifelong film enthusiast and I love having a place to not only document in detail but share my thoughts and opinions on films of all kinds!\n\nSo far I’ve used old movie tickets, photos, memory, and my physical/digital copies to document every movie I’ve seen, and since downloading the app I’ve reviewed every movie I’ve watched. I tend to give my full thoughts in a detailed review for everything I see. I do add in little jokes here and there when fitting.\n\nI love action, comedy, and horror films, but I’m open to anything and everything.\n\nMy current four favorites on my profile are Godzilla Minus One, Sam Raimi’s Spider-Man, Kill Bill, and Superbad.\n\nI’m just trying to grow on Letterboxd, find new people, and discover more movies! Please check out my profile, give your thoughts, and follow if you’re interested! Thanks!",
            "Hi everyone! I've become a huge fan of Letterboxd over the past couple years. Beyond new releases, I love logging everything from horror to pop culture CGI fests to niche romcoms. I love it all. My current fav four are Hereditary, When Harry Met Sally, Soul, and Sky High. Just logging to become more connected with the Letterboxd community.\n\nYou can find me [here](https://boxd.it/5hVrt)",
            "https://boxd.it/4lg2V\n\nHello again Letterboxd’ers! I’m usually watching 8-10 movies a week, whatever floats my fancy but usually 70s-90s genre flicks.\n\nCrime, horror, thriller, neo-noir, action, sci-fi.\n\nCome say hi!",
            "Handcrafted reviews posted fresh daily! Movie collector since the '80s, mostly older films, many genres, except perhaps not a lot of horror. There's plenty of people posting on those though.\n\n \"The idea that a film should be seen only once is an extension of our traditional conception of film as entertainment rather than art\"\n- Stanley Kubrick\n\nhttps://boxd.it/7umcH",
            "https://boxd.it/3NL3d\nTrying to Watch a movie every day for 2024‼️\nReally would appreciate discussion and support.\nSometimes it seems like an obligation rather than watching for fun.",
            "Hi there I’m Griffin, I’m currently on a quest to watch and rank every single movie that comes out in 2024 (~70 deep so far). I’m by no means an expert reviewer and am learning to evaluate movies more holistically as I go. I usually just drop my candid thoughts on the movie in a stream-of-consciousness style shortly after I get out of the theater/finish streaming it\n\nhttps://boxd.it/4AQQH",
            "[https://boxd.it/HsYF](https://boxd.it/HsYF)\n\nNot gonna lie its been hard to watch movies as of late ( 2 jobs and school yay!!).  Even though I haven't been as active lately,  I do my best to try and watch something new once a week and write a review.  I do still like to read your reviews every now and then even if I am not writing myself.  So if you also write reviews you're most likely getting a follow back.  Anyway, I love horror and sci-fi, but I watch almost anything, even if I know it will be bad.",
            "https://boxd.it/4sUH9\n\nAbove average free time, below average movie taste \n\nReally love cult movies and what movies are new. Frequent children’s movie view for my kid. \n\nMost recent movie I saw was Godzilla Minus One. Holy shit why did I wait this long\n\nHappy to follow you back",
            "Hey everyone I’ve been on the site since 2022 and I log all kinds of movies from every genre. Just watched the classic masterpiece Alvin and the chipmunks which is a fave of mine \n\nFollow me [here](https://boxd.it/3UsoF)\nI follow back! Can’t wait to meet y’all!!",
            "https://letterboxd.com/ReallyStupid/",
            "hi everyone! i’ve been using letterboxd for about 2 years and i’m looking for more people to follow\n\ni watch pretty much everything but my favorite genres are romance, sci fi, and horror, and my 4 favorites are la la land, call me by your name, fallen angels, and before sunrise\n\ni usually write one liner reviews but occasionally will write longer more in depth ones\n\nhttps://boxd.it/4SQAl",
            "Hi I’m Jessica! I’ve loved getting to meet people and find new movies through the monthly swaps, so if you’ve seen me before sorry lol My profile is [https://boxd.it/80nuB](https://boxd.it/80nuB).\n\nI go to a lot of advanced screenings and mystery movies so if you follow me you might get a sneak peek review into some new movies.\n\nI LOVE horror movies! Every night in October leading up to Halloween I watch a scary movie I’ve never seen and rate it whether it be good or bad. I’ve been doing it since 2016 on Facebook but now that I have Letterboxd I plan on doing the reviews there.\n\nI try to watch movies as much as I can, I write a review on every one I watch! Happy to be a part of the Letterboxd community!\n\nhttps://preview.redd.it/09rijrvspg4d1.jpeg?width=1170&format=pjpg&auto=webp&s=f31c6f5d4a31ecee3b8e7e3fd47d0f6544462877",
            "https://boxd.it/4Tzi7\n\n\nI watch a variety of stuff, and tend to rate things on the higher side. I review most movies and most of those reviews give my honest thoughts of the movie (with a couple joke reviews sprinkled in)",
            "https://boxd.it/4kLbd\n\nHey everyone! I’ve been watching movies more frequently as a way to get through a rough patch, so I apologize if my profile comes off a bit edgy. \n\nI love mind-bending movies but I watch a bit of everything. I love a great animated movie too, especially if it’s got a unique art style. My latest goal has been finishing all the top 250 narrative feature films before the end of this year! \n\nLooking for mutuals to share movie recs and thoughts! I follow back!",
            "My profile on Letterboxd: https://boxd.it/3XYr\n\nHi! I'm trying to grow my Letterboxd and have been logging movies pretty consistently. Just upgraded to Patron and I use AMC A List, so I try to see new movies as much as possible and also rotating through my Watchlist. I like all genres of movies, especially horror and would love to make some Letterboxd friends. Happy to follow back!\n\nRecents: In A Violent Nature, Babes, Knocked Up, I Saw The TV Glow",
            "[My Profile](https://boxd.it/6s9b9)\n\nHi everyone, my name is Joelle and as of right now I have zero followers..but maybe this will change that lol. I absolutely love watching movies, but none of my closest friends seem to feel quite as strongly about it as I do. So I made this account with the hopes that I can meet others who feel this way, or that can at least possibly appreciate the few reviews I leave for the movies I’ve seen. I did also start attending film festivals as of last year so that’s been pretty neat :)\n\nEdit: I had zero followers when I posted this and now have more than 10. You guys made my day thank you :) Also always open to hearing movie suggestions and giving them as well for anyone interested!\n\nhttps://preview.redd.it/c48874jigh4d1.jpeg?width=1284&format=pjpg&auto=webp&s=d019056ebb71e7ef83ee55474cdb64b8577f529c",
            "I watch anywhere from 20-50 films a month depending on how busy I am (busy right now due to studying for finals) I review everything I watch, half of them serious reviews the other half are (failed) attempts at being witty and I follow everyone back!\n\n[https://boxd.it/86iLT](https://boxd.it/86iLT)\n\nhttps://preview.redd.it/qjwpktqs2j4d1.png?width=1164&format=png&auto=webp&s=e0f1cf5d632f322dfb4bb6e4999dc6008d9d262f",
            "https://boxd.it/9XQz\n\nI mostly write longer reviews but will follow back. My favorite directors are Spielberg, Lucas, Cameron, Miller, Scorsese, DePalma, Nolan, Hitchcock, Fincher, Safdies, Wachowskis and Tarantino.",
            ">Once again, I'm [MetheSupreme1](https://boxd.it/6KTmX) on Letterboxd.\n\nI'm a writer who's been making long-form movie reviews for this app for almost a year now (one month away from a year!!). The account's progress has really been so rapid that it's almost overwhelming, and I have you all to thank for that!  \nIf you follow me (an action that would be well-rewarded), it's reasonable to expect a review every 3-6 days. I try my best to watch a wide variety of films - something that's become easier to do because of this app and the great number of films I've discovered through it! I love interacting with people I follow, commenting liking, etc., you know the drill. All my reviews are invitations to discussion, so don't feel hindered to leave a comment!\n\nSo if you're interested in reading (or just skimming through) my reviews, pls consider following.  \n[My favorite films](https://boxd.it/oA5Ea)\n\nhttps://preview.redd.it/9plsdzt49i4d1.png?width=218&format=png&auto=webp&s=1b6461726abbe0412eb8ad576655292c5414c1bf",
            "Hey Ya’ll \n\nI love this community, and I love Letterboxd! If you'd like to come along with me and share in my movie experiences, follow my profile https://boxd.it/6OasJ \n\nI'm currently 101 movies in on the Rotten Tomatoes Best of 2023 Certified Fresh List. I watch at least a movie a day and review each one. On the weekends, I either watch Godzilla, or I do a few random wheel spins to determine what movie to watch. I watched 11 movies last week, and the best one of last week was Joyland! \n\nLove to hear from you, and I follow back with everyone who follows me",
            "Here's my profile: [https://boxd.it/3RJeV](https://boxd.it/3RJeV). I've currently logged 273 films. I'm exploring classics from the 1950s and foreign films. I particularly enjoy action and thrillers. I might finish watching Tarkovsky and Jodorowsky films by the end of June. I write reviews for all the films I watch, and even if I love everything about a film, I try to mention aspects that I particularly didn't connect with to challenge myself. I write about a paragraph long.",
            "Hi, I’m Marek from Czechia, here’s my [lb profile](https://boxd.it/3fxMb). I watched a lot films this year already but not reviewed most of them and I’m trying to work on that. \n\nI watched a lot of slashers lately (which is my favorite horror sub-genre), but i watch a bit of everything. Currently checking out some films for pride month, so feel free to recommend me some. \n\nI love reading all my friend’s reviews. Feel free to give me a follow, I’ll happily follow back.",
            "I have some horrible views on movies but they're only opinions. I like a little bit of everything, dark comedies, intense action, fucked up horror, real romance and sometimes just sometimes a good limited series.\n\n https://boxd.it/5WsA9",
            "[https://boxd.it/Vaub](https://boxd.it/Vaub)\n\nHey I'm Derick, I'm a film critic for places like [Film Threat](https://filmthreat.com/author/derickmcduff/) and a writer for [WatchMojo](https://youtube.com/playlist?list=PLM-IN2wOJRbUK7jrgwtrH6V6o42s54W2V&si=9azPNNG2fjyNf5AS). I also host a podcast about film called [Underrated](https://tr.ee/NxViBCaGkn) as well as co-host a second called [Midnight Film Society](https://open.spotify.com/show/7aIc283FQv0CPOUTQlJn7G?si=14a986b9510541a9).\n\nI'm a pretty avid user of LB, logging everything I write and frequently making lists that amuse mostly just me. A couple of my more long form reviews have reposted there but I'll mostly just post short witty reviews.\n\nCurrently my top 4 are; \"The Lord of the Rings: The Two Towers,\" \"Princess Mononoke,\" \"The Princess Bride,\" and \"The Red Shoes\"",
            "https://preview.redd.it/mcre0oioni4d1.jpeg?width=1125&format=pjpg&auto=webp&s=ad190b20aa71e1282388352ce67835699368f0eb\n\nMy profile is [Brandon Bombay](https://letterboxd.com/BrandonBombay/) — same across all platforms.   \nI'm a professional writer with a NSFW movie podcast called [Degen Cinema](https://linktr.ee/DegenCinema).   \nTop 4 right now are some of my favorite summer movies.   \nI watch a lot of genre (70s/80s) and try to make succinct write ups.",
            "https://preview.redd.it/7itfzvzppi4d1.jpeg?width=1125&format=pjpg&auto=webp&s=3f2a2eae632f69d77886427439a41ee8edd0258f\n\nHey! This is [my profile](https://boxd.it/2EXTX)\n\nMy fav watches of May:\n\n1. My Little Loves (1974)\n2. Clash By Night (1952)\n3. Out of the Past (1947)\n4. Our Daily Bread (1934)\n5. Furiosa: A Mad Max Saga (2024)",
            "https://preview.redd.it/vh6igvwqui4d1.jpeg?width=1174&format=pjpg&auto=webp&s=4b3ca1a4d4ad3260dbfd0344a40e548799e9e66f\n\n[My profile](https://boxd.it/3dAKD) and my current top four and most recent watches.\n\nI’m a big horror, sci-fi, kaiju and crime thriller fan. Particularly if they came from Italy during the seventies or Hong Kong during the eighties. But I do try to balance it out with some more high brow fare.\n\nSome reviews of mine:\n\n[The Last Blood](https://boxd.it/6z3Y7b) (dir: Wong Jing, 1990, Hong Kongj\n\n[Psychomania](https://boxd.it/5di1Yz) (dir: Don Sharp, 1973, U.K.)\n\n[Ghidorah, the Three-Headed Monster](https://boxd.it/4VceEX) (dir: Ishirō Honda, 1964, Japan)\n\n[A Year in a Field](https://boxd.it/4T6dQt) (dir: Christopher Morris, 2023, U.K.)",
            "My profile - [https://boxd.it/7BY3d](https://boxd.it/7BY3d) \n\nHappy to follow back, Looking forward to connecting!",
            "My profile on Letterboxd https://boxd.it/8LzVD\n\n\nI'm looking for people who actually write reviews and not shitty quips and the like. \n\n\nIt doesn't have to be a long or in depth review btw. As long as you express your thoughts to what you feel is sufficient, that's more than good enough. I just want to read people's actual thoughts. Here are three reviews I wrote. If someone else wrote them, I'd find them all equally acceptable. \n\n\nhttps://imgur.com/a/hp6tix1\n\n\nI also don't care if we have similar movie tastes. I'm not looking for an Echo chamber, I care as much about dissenting opinions as similar ones. You also don't have to write a review for every movie you watch or something. Just whenever you have thoughts to share.\n\n\nAs for me, I don't have a favorite movie genre or something. As long as it's not horror/shovelware garbage, I'll watch it. My 3 favorite movies are: 3 Idiots, Spotlight and DBZ: Broly. Latest Best Movie: LA Confidential and Palm Springs.",
            "https://preview.redd.it/gxmeeh3mxk4d1.jpeg?width=828&format=pjpg&auto=webp&s=d1aec2e51abb900b79f6578e4e1cad8dce279223\n\nMy username is KianM18, all information you need to know is in the image",
            "Hello everyone! I’m a film student and basically just soend as much free time as I can offer to watch movies. I really don’t watch in a specific order but love to hear recommendations from anybody who has them? I also love music recommendations and would love to hear them as well! Would be curious to see what music you think I listen to based off my four favorites lol! I follow everyone back!\n\n[https://boxd.it/1HcFB](https://boxd.it/1HcFB)\n\nhttps://preview.redd.it/5cm1lsw42d4d1.jpeg?width=1170&format=pjpg&auto=webp&s=49a2c19f7fe1bb3e4346670d02b1b5c81d1bd5cd",
            "Hello guys! I use the app for 3 years now. I log any films I like to watch because I want to catch up with my friends and the current popular trend. My 4 favorite films are: Interstellar (2014), Manila in the Claws of Light (1975), Casablanca (1942), and Babylon (2022). I like historical, drama, superhero, crime, and mystery film genre. I watched 165 films for 2023, way past my set goal of 150 films. Just like the previous years, my goal for this year is 150 films. My favorite first-watches of May are: \n\n\nBlood Diamond (2006) \nThe Game (1997) \nDark Waters (2019) \nMaster and Commander: Far Side of the World (2003) \nSaltburn (2023) \nGood Will Hunting (1997) \nWhiplash (2014) \nKadaisi Vivasayi (2021) \nThe Shop Around The Corner (1940) \nDune (2021) \nThe Hateful Eight (2015) \nAir (2023) \nPriscilla (2023) \n\n\nSee you in the movies!! Let's follow each other! Here's my profile link: https://boxd.it/420j9",
            "Hello everyone, here’s my profile! https://letterboxd.com/patriciaxo123/\n\nI’ve only seriously started using Letterboxd since the beginning of this year, but I’m trying to build up my profile. I generally enjoy watching all types of movies, not very picky. \n\nI do follow back and love looking at what others are watching to get recommendations!",
            "My reviews and personal ratings span a wide range of genres and eras. Whether you're looking for personal reviews or simply searching for your next movie night pick, let's exchange them! Plus, I'm on the lookout for some good summery watches—recommendations are welcome! Join me in exploring the world of film at [my Letterboxd profile](https://boxd.it/nqWH).",
            "Met a lot of awesome users during last month's profile share , so thought I'd share again!\n\n[https://boxd.it/9Eghp](https://boxd.it/9Eghp)\n\nI didn't grow up watching many movies so I've been delving deeper into the medium the past few years. I've only been on the platform for about a month, and so far it has been really fun. I love to make lists, and I pretty much watch any genre under the sun. But, I really enjoy classic horror, animation, martial arts, and long adventure epics. Everything recommended to me I will watch and give an in depth review, don't hold back because I enjoy trying new experiences!\n\n**Favorite Flicks:** The Thing, Magnolia, The Big Lebowski, Taxi Driver",
            "https://boxd.it/5mzfb\n\nHello! My top 4 movies changes frequently but for now:\n\n1) In the Mood for Love\n2) Minari\n3) What a Way to Go!\n4) La Haine\n\nI've been using Letterboxd for a few years now but I'm finally starting to write reviews for the films I'm watching. Some of my favorite genres are comedy, drama, slice-of-life/coming-of-age, and musical films, but honestly I'll watch any movie to broaden my scope of genres. I'd love to find more mutuals to connect and see what other people are watching :)",
            "Hello everyone! Here is [my profile!](https://boxd.it/6ufSH)\n\nI try to watch one (or more) movies a day if it’s possible. I discovered my love for cinema just over  year ago now, and I’ve been loving my journey. My 4 favorite films of all time are:\n1. Aftersun\n2. Her\n3. Paterson\n4. The Banshees of Inisherin\n\nMy top 4 on my account are my favorite first-time watches from the previous month. My top four on my profile is currently:\n1. Portrait of a Lady on Fire\n2. Cinema Paradiso\n3. Ferris Bueller’s Day Off\n4. Boogie Nights\n\nAlso, I will follow back anyone who follows me!",
            "Hola LB'ders! Here's my profile - [https://boxd.it/2IEp](https://boxd.it/2IEp)\n\nI have been using it since 2015 or 2016, but I have only switched from Pro to Patron recently so I can take advantage of different posters for fun. :D\n\nI am a VFX artist and while it's an enormous honour to work on shows with awesome colleagues, most of the films are big blockbuster films and we do have to skim through sequences quite repetitively. It has led me to witnessing my watching movie experience has slightly changed upon watching heavy CGI movies. Nowadays I'd watch with a bit of dread or anxiety, or even with OCD. It's not always like this, though I assure you! However, resultantly, I have shifted to watching more of arthouse/slice of life films where I appreciate the beauty in mundanity. (Favourites: Her, Perfect Days, Manchester by the Sea, Drive). I am a huge fan of Cannes films, and I hope to immerse myself in Criterion Collection work as well. I watched Love Likes Bleeding in March and I thought it was kickass especially in theatres.\n\nOn the other hand, I do watch movies with heavy CGI/VFX work once in a while, especially to support my colleagues' work.\n\nFeel free to follow me, and I'll do the same!",
            "https://boxd.it/2tsX\n\nI run a physical media shop. I put too many movies in my watchlist. I type out 1-3 sentence reviews. \n\nMy taste ranges from trash to high art. I will bring home any dvd and watch it. I am a mess.",
            "Hey everyone, I’m Matěj, a 22-year-old guy from Czechia, and [here’s my profile](https://boxd.it/CFX)!\n\nI enjoy movies and TV of all kinds and I tend to find something good in most movies, even in the worse ones.\n\nI write something about everything, sometimes it’s multiple paragraphs, sometimes just a line or two, depending on how inspired I feel. I’m always looking for recommmendations and I’m always happy to recommend.\n\nI always follow back and I try to be active, I read and like reviews etc.\n\nMy favorite first-time watches in May were Furiosa, Kingdom of the Planet of the Apes, Gladiator and Hundreds of Beavers.",
            "Here's my profile: [Greenshirt39](https://letterboxd.com/Greenshirt39/)\n\nI've been using Letterboxd for almost a year now, and I've been really enjoying it. I generally log animated films, but I don't always. I've been starting to get into Studio Ghibli, and I want to finish every Pixar movie at some point. I write a review for almost every movie I watch, but they're usually short one liners, instead of an in-depth review. I wasn't able to watch much last month, AP Exams took up a ton of time for me\n\nSome of my favorite films that I've seen recently include:\n\nGodzilla Minus One\n\nSchool of Rock\n\nMy four favorites of all time are:\n\nPrince of Egypt\n\nLion King (1994)\n\nShawshank Redemption\n\n12 Angry Men.",
            "https://preview.redd.it/8u8pw80a2d4d1.jpeg?width=750&format=pjpg&auto=webp&s=2fba53d3185d58e3f83420c6277db67a34b0a4b7\n\n[https://boxd.it/3lDUd](https://boxd.it/3lDUd)\n\nHi all!\n\nMy favourite first-time watch from May was Belle de Jour.\n\nLately I’m trying to watch more films from 30s and 70s, as I don’t have that many of them logged.\n\nAlso throughout the year I’m filling in my Letterboxd map and turning those grey countries into green! Would love to receive some suggestions from Kazakhstan, Kyrgyzstan, Uzbekistan and Turkmenistan!",
            "Hi I'm Marcie, I love movies and chatting about them. I tend to rate on my vibe with the movie rather than anything critical or technical .... so my ratings prob skew high. Love scifi and horror. \n\n[https://boxd.it/8PJen](https://boxd.it/8PJen)\n\nhttps://preview.redd.it/c41tx9loed4d1.png?width=1277&format=png&auto=webp&s=27ca5dd4159f7720244ceb1d0dc979081b2de88a",
            "[deleted]",
            "hallo I like east asian kino\n\n  \n[https://letterboxd.com/fiveeasypieces0/](https://letterboxd.com/fiveeasypieces0/)",
            "TheRiddler51\n\nI enjoy every genre, but I mainly watch horror movies. I made a new account after getting sober and I can already tell my opinions will be drastically different. \n\nWill follow back and be active.",
            "sup, you may know me from my award-winning review of masters of the air (2024) which is currently pushing 500 likes but like no big deal.\n\nI'm Shaun, and I've only relatively recently become a member in the cinephile community. im tryna go back and watch or rewatch a lot of popular movies to fill in my gaps cause i dont wanna log stuff from when i was super young.\n\nit's been pretty lucrative so far: all four of my top 4 faves are movies i first watched this year (one i even just watched earlier this week).\n\n[https://letterboxd.com/downinkokomo/](https://letterboxd.com/downinkokomo/)\n\nfyi i dont even like kokomo that great lol",
            "Hey, guys! \n\nHere's my [profile](http://Letterboxd https://boxd.it/qRXD), I love to find new movies and experimenting. I'll follow back too!",
            "[https://letterboxd.com/Boredom64/](https://letterboxd.com/Boredom64/)\n\nfilm student, bilingual(Spanish/English) i mostly like to watch entire filmographys from specific directors, Michel Hanneke was the more recent director i finished, i usually enjoy films that are either political or really slow. haven’t been watching much lately but i will soon. i also rarely write long reviews\n\nfav directors: Luis Bunuel, Pier Paolo Pasolini, Pedro Costa, Pedro Almodovar, Robert Bresson\n\nhttps://preview.redd.it/bohrnwd9zc4d1.png?width=320&format=png&auto=webp&s=498293d3801d50eaff842e4509db5465a3902af4",
            "[https://boxd.it/emDnO](https://boxd.it/emDnO)\n\nHey folks! My name is Varun and I’m from Canada. I’m a huge movie buff and love writing medium to long sized reviews for almost every movie I watch (done 86 reviews so far). I enjoy keeping up with the latest discourse on films by reading magazines like Sight & Sound, Little White Lies and following various YouTube channels and social media accounts for recommendations. I enjoy watching both high quality masterpieces as well as pop culture entertaining films. I also try my best to watch foreign films and older classics on MUBI and Criterion Channel. I’m always aiming to expand my tastes while also engaging in guilty pleasures like superhero, action and horror movies. I’m proud of my Good Movies list which I update regularly and feel free to check out the rest of my profile :)\n\nhttps://preview.redd.it/tkfxypb73d4d1.jpeg?width=750&format=pjpg&auto=webp&s=a3c449d8a9ebd560d58fb1b8e98f24cbb3794f3e",
            "Hi, I started “logging movies” on my own since 2016, mostly posting them on Twitter just to track what movies I watched. I was hesitant on joining letterboxd since I find it hassling to essentially transfer everything to the site. For some reason last year, around the time of Barbenheimer, I just had a burst of energy and did it. My small movie reviews that I put in tweets didn’t survive—I didn’t transfer them to letterboxd—but I rated them all and put in lists. I also included a lot of the movies I remember watching prior to the year 2016, since that’s when I started logging on my own.\n\nI’m not a cinephile by any means. I barely watched any movie in the 2000s and even much less before that. I was born in the late 90s and as someone from a “developing” Asian country never really gravitated towards a lot of movies until I was in high school in like 2010. Aside from a few movies I watched when I was young, the true gateway movie/franchise that got me into movies (and books) was Harry Potter. I watched Chamber of Secrets in theaters when I was really young. I don’t remember much but I remember simultaneously liking it and being scared of it. I started watching all the movies before Half-Blood Prince came out and read the books before Deathly Hallows came out so it will always have a place in my heart (and a place in my Top 4). I really love fantasy because of that foundation, but really I’m up for anything. A third of my watchlist are classic movies from the 20th century so feel free to suggest more from that time period. I’m also not a very harsh critic/rater so I only have like less than 250 movies in the 2 1/2 stars and below range, so feel free to suggest terrible movies too, I guess. Hahaha.\n\nhttps://preview.redd.it/u8vu24fq1d4d1.jpeg?width=1150&format=pjpg&auto=webp&s=75956a6666697c1c5f920b63587f66388a3ad1ff\n\nHope to get to know more people by the movies they’ll log into letterboxd! :)\n\n[https://boxd.it/5nrFn](https://boxd.it/5nrFn)",
            "Horror enthusiast!! I use my account to keep track of horror, so follow me if you're curious about my thoughts :)\n\nhttps://preview.redd.it/k2gz7qqp6d4d1.jpeg?width=1179&format=pjpg&auto=webp&s=e635596e0b523e3d587c06a3770aad140dd57e83",
            "Happy pride month!!  Can’t wait to dig into films from LGBTQ+ directors and actors this month. \n\nProfile: https://boxd.it/2tjlp",
            "https://preview.redd.it/1ut7hctf1d4d1.jpeg?width=1312&format=pjpg&auto=webp&s=bae22d88dc690e24a707dba5397770e1ada5e94a\n\n[https://letterboxd.com/DCGillespie/](https://letterboxd.com/DCGillespie/)\n\nHey all. I've been watching a bunch of Japanese films lately (mostly horror), and will be diving into LGBTQ+ movies soon for pride month. I've been making an effort to expand into genres I normally don't watch, writing at least a paragraph on each as I go. Recommendations would be greatly appreciated.",
            "Howdy! Here’s my [profile](https://boxd.it/5EgUZ)\n\nI’ve been using letterbox for about a year and I’ve become obsessed with it. My top 4 right now are The Last Crusade, Lost in Translation, Fellowship of the Ring and Francis Ha. I love seeing what everyone is watching and liking reviews!",
            "Happy Pride month everyone, here’s my [profile](https://boxd.it/lnwx)! I’ve been a consistent user for 2.5 years now. I finished school in late April so I was able to really amp up my watches in May, including starting the Criterion Challenge roughly 2 weeks ago. My favorite genres include coming of age as well as horror, I’m also very into Terminator and A24. I will watch anything at least once so feel free to recommend stuff!\n\nhttps://preview.redd.it/zeinojj33d4d1.jpeg?width=1242&format=pjpg&auto=webp&s=e00e3571d4a78dbc1c2e68412d204d9c07715497",
            "My [profile](https://boxd.it/1n7VJ)!\n\nCurrently going through the Bond series for the first time (the second Dalton is next) as well as my other blindspots!\n\nhttps://preview.redd.it/ij2yv5joed4d1.jpeg?width=1080&format=pjpg&auto=webp&s=cc3851a51b339f2c65ff16b75868e4f572520492",
            "heyo!!! my name’s [mae](https://boxd.it/8dIRH), and im pretty new to letterboxd in the grand scheme of things. i only have about 80 movies logged, but im working to get that number higher! \nill watch pretty much anything, but im a big fan of horror, or really anything weird. \n\nmy 4 favourites arent my 4 favs of *all time*, just my 4 favourites at the moment, since i am chronically indecisive.\n\nthx!!!",
            "[https://boxd.it/7brvL](https://boxd.it/7brvL)\n\nI'm back again and so will be going through all the info\n\nMy current top 4 is:\n\nWhiplash\n\nInception\n\nPaddington 2\n\nThe Darjeeling Limited\n\nMy favourite first time watch in May was Furiosa, and through the upcoming months I'm hoping to have logged more 2024 movies. \n\nI don't really have genre preferences, so I'll watch basically anything but most of what I watch is on Disney+ simply because I find it the most convenient.\n\nI review everything I watch and I am attempting to watch 2 movies per week.\n\nI am usually pretty positive so most of my reviews are on the upper ends of the ratings.\n\nNot much else",
            "Hey! I’m [Brydon](https://boxd.it/7uAtH)\n\nI’ve been on here since October of last year and have logged 349 films in my diary so far. I work overnight alone so I tend to watch a movie during any free time I can get.\n\nI like a bit of everything but I gravitate to horror films the most. I’m also a fan of kaiju and anime, I’m super hyped that Godzilla Minus One is finally on Netflix! It’s probably the film I’ve been recommending the most to people.\n\nMy reviews are just whatever I felt right after watching a movie, some are long and some are short. But I usually write something for most films I log.\n\nI’ve been wanting to follow more people and discover more movies so I’m happy for this megathread!\n\nhttps://preview.redd.it/6qmwpel12d4d1.jpeg?width=1284&format=pjpg&auto=webp&s=9117efdb41e4791ce5334a2d7e05a238a96252a5",
            "Follow a gay one for pride month 🤞🏾🏳️‍🌈\n\nhttps://boxd.it/4T3cV",
            "Reckon I’ll share mine: [https://boxd.it/1e8hx](https://boxd.it/1e8hx)\n\nhttps://preview.redd.it/49ll560r1d4d1.jpeg?width=828&format=pjpg&auto=webp&s=6e9395955d24e2dfabaa1231315061c909f76214\n\nI just joined the sub a couple months ago, but I’ve been using Letterboxd for a couple years now. I pretty much watch whatever random movie strikes my fancy.",
            "https://preview.redd.it/3067nooe1d4d1.jpeg?width=828&format=pjpg&auto=webp&s=eebc0add776e3d3717b030075116b3cae4a86508\n\n[https://boxd.it/6uXJ5](https://boxd.it/6uXJ5)\n\nhi! i’m malak & i love watching “bad” movies! i write my honest opinions.. sometimes short form/sometimes long form. down to chat, always!",
            "https://boxd.it/1njDR\n\nI try to watch a wide variety of genres of films from across the world, and I try to mix things up. If I watch a martial arts movie one day, then maybe I'll follow it up with a heady drama. I don't watch a ton of new releases, and generally prefer doing deep dives into lesser known or more obsure movies.\n\nMy favorite genres are action(particularly Hong Kong movies from directors John Woo and Ringo Lam) and sports(especially unconventional genre mashups). My favorite countries to watch are Hong Kong, Australia, South Korea, Japan, and the Philippines.\n\nThis year I've been on a Soviet movie kick this year, but focused on the movies that were popular with general audiences rather than arthouse fare. Some examples of recent watches was the first Soviet action movie with martial arts( https://letterboxd.com/odiearbuckle/film/pirates-of-the-20th-century/ ) , or a depressing drama about alcoholism that includes a magical talking dog ( https://letterboxd.com/odiearbuckle/film/friend-1988/ ).",
            "https://boxd.it/cA7d (connor64)\n\nMy top four favorite movies are:\n\n1.\t⁠Good Will Hunting\n2.\t⁠Perks of Being a Wallflower\n3.\t⁠Back to the Future\n4.\t⁠Empire Strikes Back\n\nHey guys! I’ve had Letterboxd for a few years now, but only used it to keep track of my movie rankings. Started actually using it as intended a couple of months ago ago, logging and reviewing movies. I have no specific type of film I log, it is literally just whatever I feel like watching but my taste is pretty diverse. I like Star Wars and Marvel and such, but also love seeking older movies or lesser known ones! Currently doing an MCU rewatch. I follow back!",
            "[This is me.](https://letterboxd.com/masterstroke/)\n\n[My 50 favourites.](https://letterboxd.com/masterstroke/list/50-favourites/)\n\nBeen Letterboxd'ing for a little over a year now. Can't say I'm much of a cinephile these days, but I've been into movies for 7,5 years as of now.\n\nFave directors: Allen, Scorsese, Lynch, Kubrick.\n\nI love various dramas, horrors, thrillers, mostly from the 20th century.\n\nAlso, my fave actress these days is Ana de Armas :)\n\nhttps://preview.redd.it/44acipqded4d1.jpeg?width=816&format=pjpg&auto=webp&s=069c1b8c7658f97d86d508abbe3979e10c0f7bef",
            "https://boxd.it/4gjCn\n\nHappy pride month everyone! \n\nHi I’m Carley :) been using the site for about two years! I’ll watch anything but i love horror and thriller.Along with watching many older films and classics, I also watch a lot of new releases and currently have a Ranked 2024 list. I try to watch a film every day. This month i plan to extend my film watching even further. My current favorites on my profile are Alien, Wall-E, Back to the Future, and Freaks. Also—random but I’m a nurse so if there’s any other healthcare people out there “)",
            "Hello I’m a film student from Australia who’s always keen for new movie friends! I’m currently working my way through Emily Blunt’s filmography as well as preparing for a panel I’m hosting at Oz comic-con! \n\nhttps://boxd.it/5hwJx",
            "https://preview.redd.it/0c2p4sia5d4d1.jpeg?width=1179&format=pjpg&auto=webp&s=4ad78819ce7bcd6c29022cc8993c4dad93dbb5bd\n\n[https://boxd.it/2syM9](https://boxd.it/2syM9)\n\nI love Letterboxd, has allowed me to find so many films I never would have. Have just started writing reviews.",
            "Hey guys\n\nI’m from Australia and in my 20’s.\n\nhttps://boxd.it/a2uUN\n\nJust started using Letterboxd and only logging movies I’ve watched since starting out on the app. Don’t know anyone who uses it so I’m sitting at 0 followers and 0 following haha. Just looking to find some people with some cool opinions on movies, and get some fun suggestions. Jaws is the best movie ever made though, that’s undebatable.\n\nI’m into pretty much anything, but partial to thrillers.\n\nHave a good one!",
            "Hey all! I've been logging films on Letterboxd for about a year and a half now but I was with IMDB for about a decade before that. I try to write at least something for everything I watch. My favourites typically rotate based on a recent watch that I enjoyed.\n\nI'm always interested in having more mutuals as I love having more avenues of finding new movies.\n\nBig into speculative fiction /Sci fi/horror. I'm in agreement with the general A24 hype of recent years. I always have time for a Nicolas Cage movie and think he's put out some of his best work in the last few years (Pig/Mandy)\n\nSome of my favourite newer films would probably be Aftersun, Past Lives, Hundreds of Beavers, All of us Strangers, Saint Maud etc. I know Everywhere all at once is considered overrated by many now but it made me cry and laugh in equal measure when I saw it.\n\nThis year I'm trying to fill in some blanks by exploring more movies pre-1950s and world cinema I've missed! On the flip side I'm currently watching the Fast and Furious franchise for the first time.\n\nMy profile on Letterboxd [https://boxd.it/5iF6L](https://boxd.it/5iF6L)\n\nhttps://preview.redd.it/up6gynewcd4d1.jpeg?width=1080&format=pjpg&auto=webp&s=639fa951df700a698d414b81b8f438a49df40611",
            "https://boxd.it/L4Vv",
            "[My Profile ](https://boxd.it/7Hm1b)\n\nI log and review 1 or 2 movies daily. I've sort of taken a break from following new people because I try to read every review of a movie when I review it, and it's getting a bit too much now.\n\nBut I do want to find people who write interesting reviews. So if you do decide to follow me and engage with my reviews, I'll 100% check out yours.",
            "Hey, hoping to meet some cool people with different tastes :)\n\nhttps://boxd.it/6fmrD",
            "Hi everyone!\n\nMy favourites range from Who Framed Roger Rabbit? to Melancholia so I'm consistently inconsistent! Followed some great people last time I did this a year ago so hopeful to collect a few more cinematic chums!\n\n\n\n[https://letterboxd.com/jordan9246/](https://letterboxd.com/jordan9246/)\n\n\n\nCheers!",
            "My profile on Letterboxd is https://boxd.it/55v53\n\nI don't really have anything to say really except movies cool I guess",
            "https://letterboxd.com/jimmy_the_scumb/\n\nHi, I tend to write in-depth reviews for movies that I particularly like, admire, or find interesting for whatever reasons. Last month was a drought for me review-wise because of... personal reasons. I'll hopefully get back into the swing of things soon, but in the meantime, I've got a fairly expensive back catalogue of reviews. If you're interested in what I write, or what I like, consider following.",
            "https://boxd.it/4qAvX",
            "Hello, you can call me [corrodedking](https://boxd.it/19eBD)\n\nBeen using the site since 2020 but really got into in 2022. My top four doesn’t change much, Forgetting Sarah Marshall and Zodiac have never left and probably never will. I review about 85% of what I watch and am pretty active.\n\nhttps://preview.redd.it/g7x86sikad4d1.jpeg?width=1170&format=pjpg&auto=webp&s=7ba0a4d00c05ddb6b850e8fd5a22d9e9276c441c",
            "https://letterboxd.com/moviegoddess21/ \n\nHey! I'm Mandi. :) From Portland, OR. I love Horror movies but I watch everything. I love spending time on LB and watching movies. I follow back!",
            "I'm always looking for people to chat too about films!! I am currently working through Nicolas Cages filmography, with some breaks in between so I don't go insane. I also put movie and book recommendations at the end of each of my reviews ☺️\n\n https://boxd.it/ZZcP",
            "Hey all, I’m [David](https://boxd.it/19XQ9)!\n\nI’ve been trying to watch three movies a week in theaters this whole year since I have AMC A-List. I also like to watch plenty of movies at home including films from The Criterion Channel. I like to review the movies I see in theaters as well as movies I haven’t seen before!\n\nhttps://preview.redd.it/qlml90c7cd4d1.jpeg?width=1290&format=pjpg&auto=webp&s=44fd6b4642f710cf4201fccaad2b5945abd18f5d",
            "Hey y’allll - I like coming of age (dazed and confused, suburbia), mundane cinema (Paterson, yi yi), and 80s insane anti-cgi, and body horror.\n\nLove just scanning the site and liking reviews\n\n[https://boxd.it/ADD5](https://boxd.it/ADD5)\n\nhttps://preview.redd.it/2r6u8uosbd4d1.jpeg?width=1179&format=pjpg&auto=webp&s=22b2e5530e03ed34ffae5dc7ceda51497a7ce348",
            "[https://letterboxd.com/hitoshinohara5/](https://letterboxd.com/hitoshinohara5/)\n\nHad a blast catching up with all the Mad Max and George Miller movies before Furiosa this month.",
            "Hello, Yall, my name is Vladimir. I recently just graduated high school, so i got more time in my, but idk. i like all types of films and have been trying to expend my taste, but I don't have many streaming services. I got Disney plus hulu and tubi. I don't really review much, but I'm trying to get better at it hard for me. idk how to write my thoughts out. \nI also want to find some mutuals and connect with people. \n\nThis is my profile \nMy profile on Letterboxd  https://boxd.it/3Nclh",
            "[https://letterboxd.com/splizh/](https://letterboxd.com/splizh/)\n\nHello, I joined Letterboxd back in April 2023, and I've got a real soft spot for big blockbusters. They're kind of like core memories for me, especially since I always catch them with my dad. But lately, I've been wanting to dive into more indie and short films. I'm hoping you all can point me towards some hidden gems—I've already found a few thanks to your recommendations! \n\nFeel free to give me a follow, and I'll gladly follow you back.",
            "https://boxd.it/7r7Ix\n\nheyyy! may was a great month for first time watches for me, hope it was for you too. i follow everyone back and i review each film i watch :’) love growing my letterboxd page, makes it so much more fun \n\nsome may favourites: pulp fiction, hot fuzz, rope, mother! \n\ncurrent top 4: a streetcar named desire, before sunrise, death becomes her, days of heaven \n\ni’m a completionist by nature so this month i watched a lot of wes anderson and edgar wright to rectify my blindspots in their filmographies. now sort of moving on to do the same with miyazaki and aronofsky. also gonna try to make my way through my bucket list blindspots and a few more hitchcock \n\nif you’re interested shoot a follow :’) much love xx",
            "https://preview.redd.it/9k4n877ndd4d1.jpeg?width=750&format=pjpg&auto=webp&s=e210550a7071869ef9639bda14d2b72e36a6fb88\n\nHi!\n\nI’m Mathias and I’m from Peru!\n\nI’m using LB since 2023. I try to watch a movie everyday and I enjoy watching different movies of different type.\n\nMy favorite first-watches of May: Dr Strangelove, The Prestige, Monster, City Of God (all of them are 5)",
            "Hello everyone,\n\nhttps://boxd.it/6EZnv\n\nMy name is Michael and I’m a very social movie watcher. I write reviews for every movie I watch and I love reading other people’s reviews! I often like to leave comments on people’s reviews if I have something to say just because I like talking about movies so much. I’m also a fan of cool list ideas so if you have some list ideas you’d like to share, I’d love to hear them.\n\nMy favorite first-time watches from this past month were:\nThe Sixth Sense (1999), \nClimax (2018), \nMillion Dollar Baby (2004), \nand Game Night (2018)\n\nI’d love to follow active users who use the app in a similar way to myself!",
            "[Here is my profile](https://boxd.it/2QvQZ)\n\n  \nI love this profile swap. Added a bunch of cool movies last month to my watchlist and followed a bunch of people\n\nLove watching movies. I try to watch at least 4 a week. I usually write short little reviews, just for fun nothing too seroius.",
            "Hello! My Letterboxd link is https://boxd.it/68gpH\nMy 4 favourite movies are \n\n12 Angry Men\nHigh and Low\nAvengers : Infinity War\nParasite \n\nI like to watch thrillers , epics and action films . I’ve been using the site for the past 1 year. Usually before using the site , I just watch some superhero movies and blockbusters but after installing the app , I began to watch many old classics and international movies . Now, some of my favorite movies are these old classic great films",
            "Hey, my names Josh, I made my account earlier this year. I like horror and weird films but I watch a lot of different stuff. I’ll follow back.\n\nhttps://boxd.it/2L8ph",
            "[My Profile](http://boxd.it/vQN)\n\n\nHi all, I've been logging on Letterboxd for a minute. Favorite genres are horror, giallo, film noir, and action. I watch A LOT of movies and try to review most of them, mainly for myself as marijuana affects the memory. The app has introduced me to a ton of great films and people, so I'm always down to follow like-minded film geeks!",
            "[Salutations, fellas!](https://letterboxd.com/DavidJohnsonVG/)\n\nI would say my film experience is varied, I've watched a good mix of films from various genres and cultures, and I do go the theater as often as I can. I log everything I watch, but I don't review often simply because I'm worried about saturating people's feed and because I feel like there's not much I can add as commentary. \n\nThat being said, I do indulge in film discussion as much as I can, but I find myself to be infinitely more active on film subreddits like this one and r/movies.\n\nEvery once in a while, I do franchise marathons. These are indicated by titles which are puns on a specific entry except using the terms \"mara\" and \"thon\" substituted in. Last year, in preparation for Spider-Verse, I did a specific Spider-Man marathon, and I'm on my second one now (A Mad Max Marathon). I have them planned out until 2026 or so, and I'll definitely publish reviews for each one, so stay tuned!\n\nI also do lists! Here's [every film I saw this year for the first time](https://letterboxd.com/davidjohnsonvg/list/every-film-i-saw-in-2024/) and here's [2024 releases ranked](https://letterboxd.com/davidjohnsonvg/list/2024-ranked/).\n\nSee you at the movies!",
            "[here’s my profile](https://boxd.it/7jUQz) I’m about to watch my 100th movie of the year. Any suggestions appreciated!",
            "Hey everyone I'm Ryan!\n\nhttps://boxd.it/4xFDr\n\nI log all kinds of stuff from different genres and directors. I tend to write reviews that feel more like essays, but that's the style I most enjoy. If you enjoy reviews that are more in-depth than average then check out my profile!\n\nMy current top 4 on my profile:\n- A Brighter Summer Day (Edward Yang, 1991)\n- Parasite (Bong Joon-ho, 2019)\n- Children of Men (Alfonso Cuarón, 2006)\n- Love Exposure (Sion Sono, 2008)",
            "Hey all! I’ve been using Letterboxd for about 8 months, and always love to find folks who share common interests. I tend to rotate between horror, sci-fi, romantic dramas, and Asian dramas. Some of my all-time favorite films include:\n\n* Melancholia\n* Sinister\n* Titanic\n* Inception\n* Crimson Peak\n* Fresh\n* Little Shop of Horrors\n* Tales From the Crypt: Demon Knight\n* The Martian\n* Dirty Dancing\n\n[https://boxd.it/6b5YH](https://boxd.it/6b5YH)\n\nPictured are my 3.5-5 star watches from May!\n\nhttps://preview.redd.it/kcntwgv7qd4d1.jpeg?width=1936&format=pjpg&auto=webp&s=93865beb4dfca5b1185b07981052842073a6cd65",
            "https://preview.redd.it/u8k8dvj7zd4d1.jpeg?width=1170&format=pjpg&auto=webp&s=b75cc370ec81dc7db84bc68f256da30eaf5418cf\n\n[https://boxd.it/4SWZV](https://boxd.it/4SWZV)\n\nI try to leave a review, comment(ary), joke, quip, or factoid on everything I log. I welcome comments…don’t be a dick",
            "[https://boxd.it/872YJ](https://boxd.it/872YJ)\n\nMy name is Sam and I started logging and rating films on Letterboxd at the beginning of this year and have been logging reviews as well since April!\n\nMy best friend and I have a film club & I follow the film podcast Blank Check, so there is always tons of variety and a handful of films each week.\n\nIn May I watched by far the most films I’ve ever logged in a month (partly due to an apparently never ending sinus infection) with a total of 28 movies. I rewatched some of my absolute favorites including Heat and Inception and had some first time watches I really, really enjoyed with films like Ferrari, Furiosa & Challengers. I also recently watched all the Predator films & all the Mad Max films. There are a handful of Alien films I haven’t seen yet so I’m thinking that franchise may be next up!\n\nI’ve been really getting into logging films on the app, particularly over the past few months, and love seeing the films people I follow log so I can keep my watchlist growing! Happy to follow back!\n\nhttps://preview.redd.it/k3xb7ewb0e4d1.png?width=1170&format=png&auto=webp&s=8e52e5e90546818d1e367bd1461c97da234804c9",
            "Happy June! Here's my [profile](https://letterboxd.com/osaj/) - I'll follow back.\n\nI've always been a big cinephile, but Letterboxd put a lot of movies on my radar that I would've never considered watching prior. Lately I've been trying to watch more classic movies, i.e. Criterion Collection, but my tastes vary wildly and I'm generally open to watching anything. It's always fun to read other people's reviews. \n\nThe last 4 movies I \"liked\":\n\n1. Battle of Algiers (1966)\n2. Bringing up Baby (1938)\n3. High and Low (1963)\n4. Paddington (2014)",
            "[My Letterboxd](https://letterboxd.com/Horrorfan03/)\n\nI love bad Movies and easily reviled sequels, My 4 film favorites currently are Friday the 13th: The Final Chapter (1984), A Nightmare On Elm Street (1984), Halloween (2007) and Scream 4 (2011)\n\nMy favorite first watch of June so far is Texas Chainsaw Massacre\n\n  \nI usually log Horror Films as Horror is my favorite Genre, but I occasionally log other stuff, I've been using the site since 2021",
            "Hey y’all, it’s [Kit](https://boxd.it/4iIGN)!\n\nhttps://preview.redd.it/mfzzhtv39e4d1.jpeg?width=828&format=pjpg&auto=webp&s=153bbdf1581258662ca14dd23789eb3cd48c63bb\n\nThe films I like tend to be innovative and enthralling, especially ones that capture my attention completely while watching, and have me admiring them once they finish. I especially love if they blend in strong, well thought out themes. On the other hand I tend to hate films that are basic and generic, ones that are boring and have me braindead. I’m not a big fan of typical “Genre films” (action, adventure, sci-fi, etc). I only like these kind of films when they break from the mold or take proper advantage of their tropes.\n\nI’ve just been watching whatever I feel like cause I’ve recently finished a huge challenge.",
            "Hi, my name is Caiden! I downloaded Letterboxd a couple of years ago but only started using it frequently around last year. I love all kinds of films, and since I'm only 18, I have a lot to experience and watch. I also follow back and love active mutuals, so check me out here:\n\n[https://boxd.it/1pwU1](https://boxd.it/1pwU1) \n\nRight now, my Letterboxd is filled mostly with modern films. As I navigate through time, I actively try to watch more and more older movies since I am basically playing catch-up with the plethora of amazing films throughout history.\n\nI usually write medium to long-sized reviews for all movies I am super interested in. I think film is highly subjective, and there is a lot of toxicity among \"movie fans\" who insist you have to like a certain type of movie, have at least one foreign film, or include a film from the '60s in your top four. I think that's all a bit silly. Don't worry about your own taste; being unique and being yourself is what I love to see.\n\nMy current top four is Normal People—not technically a film, but I have to flaunt it in the top four because it's one of the most influential pieces of media in my life. Second is The Batman—I adore the movie in every way. Comic book films, while I'm very critical of them now, were my jumpstart as a child into my love for filmmaking, so The Batman left a big mark on me as a kind of merger between the comics of my childhood and my admiration for filmmaking in the present. Lastly, Dune Part Two and Good Time—which I will spare you from explaining.\n\nThanks again if you made it this far! Give me a follow if you want an active mutual. I follow everyone back and love commenting on and liking great reviews. Have a blessed day.\n\nhttps://preview.redd.it/erwx3c6nae4d1.jpeg?width=828&format=pjpg&auto=webp&s=fdeb91ec350544d96a2b5e5c3882fe2355296359",
            "[My profile](https://boxd.it/1uQvP)\n\nI found some solid recommendations through other people that I linked up with in the last thread, so I'm back for round two.\n\nI watch a lot of movies. A lot a lot. I'm recovering from a spine injury so movies pass the time very well, and I've been *eating*. I've started writing reviews for everything I watch and I generally keep them pretty short unless a movie really grabbed me.\n\nI also have a list of recommendations [right here just for you (and you)](https://boxd.it/vgyQM). I watch everything from criterion classics to shitty wornout VHS tapes, and I cast a pretty wide net for the types of movies I watch. I'm currently working through my watchlist which, if I don't add anything else, I should finish in roughly five years. Looking forward to adding new movie pals and making my watchlist even longer!",
            "Hey! I'm Caitlin, I'm 31 from Scotland 🏴󠁧󠁢󠁳󠁣󠁴󠁿 and recently I have been totally addicted to films! [https://boxd.it/9f4Sj](https://boxd.it/9f4Sj)\n\nhttps://preview.redd.it/kqm0ukhede4d1.jpeg?width=1080&format=pjpg&auto=webp&s=13ff24af7b199f01d03d8794ee8d721678126d05\n\nI was never a big fan of watching films because I have a shite attention span, but this app has helped me to find films I really love and I've been trying to watch a few a week since! Met some class people and it's definitely inspired me to watch more. Will follow back! I have been writing reviews for the ones I've watched recently and I'm really enjoying getting through my watch list 😁",
            "Hi everyone! My name is Mikaila and I’ve been using Letterboxd for a couple of years. I write both longer and one-liner reviews depending on my mood lol. [my account](https://boxd.it/30fjZ)\n\nhttps://preview.redd.it/ks0l3l5qee4d1.jpeg?width=828&format=pjpg&auto=webp&s=185b963aa45fb8f3af985477e2ea15d3a5770049",
            "Here’s mine - https://boxd.it/AufD\n\nAlways happy to gain new mutuals. I watch and review a lot, usually one movie per day. Love love love to read others reviews of films I just watched, a variety of perspectives really is the best for reading and discussing movies.",
            "Hello, I am here. [https://letterboxd.com/trblach/](https://letterboxd.com/trblach/)\n\n  \nI like Ozu and movies that punch me in the face. \n\nSomehow I hadn't seen Some Like it Hot until the other night (in a theater, I am blessed) and I think it's the funniest thing I've ever seen. \n\nhttps://preview.redd.it/n7o7rpn5fe4d1.png?width=1080&format=png&auto=webp&s=341065d005a23e8197a71307e2eb53a495bd4ede",
            "My goal is to watch 100 new movies by the end of the year! I’m at 67 already!\nI also [would love some recommendations and have a list specifically for people to submit them](https://boxd.it/vRp7M)\n\nHere’s my profile :) https://boxd.it/3wa8r",
            "Hey, I'm Alan! (Thirstyturtle): [Profile](https://boxd.it/3RTbR)\n\nI've been working for Sundance Film Fest the last few years but just got on Letterboxd a year ago.\n\nI get pre-screenings often and might drop a review a week or two early. Review-wise I might actually try to get analytical OR its gonna be a silly-goose review, depends on how much candy I ate.\n\n**Top 4** - *Sunshine, Pans Labyrinth, Blade Runner 2049, Paddington*\n\nhttps://preview.redd.it/m79scd1cme4d1.png?width=1352&format=png&auto=webp&s=aef02f0fcce9d86c1e912c3fdb1c21bc704f5f2a\n\nI’m looking to build a bigger pool of buddies on the app, and will follow you back! Cheers!",
            " https://boxd.it/232ql\n\n\nI'm very active on the site. I usually watch about four films a week. I usually go to the cinema about three times a week and since I work at one, I get free movies.\n\nI'm also gonna start writing more in depth longer reviews more often since I've been quite busy with other stuff lately.\n\nI'll happily follow anybody back!",
            "hi everyone! my name is [starr](https://boxd.it/55Bxn) :3 i am a horror movie freak and i tend to rewatch a lot of them all hear round! im also such a sucker for coming of age and queer cinema! open to finding mutuals :]",
            "I write a review after every movie I watch and always follow back anyone who follows me!\n\nhttps://boxd.it/4q0bd",
            "Happy Pride to those who celebrate! I'll follow back if you are active and/or promise to liven up the activity feed hehe. Check out my fave films and latest logs for a vibe check. --> https://boxd.it/5idrL",
            "https://boxd.it/xXzV\n\nI'm Dylan, I'm from Brazil, and I'm trying to watch a movie everyday (I'm failing miserably).",
            "Hey all! I was recommended Letterboxd back in December of 2022 by my film teacher and have been having a lot of fun with it. I went through and logged all the movies that I remembered seeing and I think I have an interesting mix. Just watched Ex Machina for the first time last week and followed it up by rewatching Blade Runner, reviews posted for both.\n\nSome of my favorites are:\n\nThe Dark Knight\n\nSeven Samurai\n\nThe 13th Warrior\n\nThe Good, the Bad, and the Ugly\n\nOnce Upon a Time in the West\n\nCinema Paradiso\n\nOppenheimer\n\n[My Profile](https://boxd.it/5lObV), I’ll follow back",
            "Hey guys, this is me [Aldair](https://boxd.it/5r9NL).\n\nUnless I'm drowning with work, I watch 3-5 films a week… and I'm quite active on LB. It's my favorite social since I started using it back in 2022. I really don't understand how I couldn't possibly know about its existence before. Anyway, I was thinking it'd be nice to meet some cool people through film, and that's why I'm here. In terms of what I like, I can watch (not necessarily enjoy) pretty much anything… but I do have a preference for tragedies, which I curiously don't watch that often.\nLet's connect: \n[https://boxd.it/5r9NL](https://boxd.it/5r9NL)",
            "https://boxd.it/50bDT\n\n\nI write reviews for every movie I watch, they can vary in length depending on how much I have to say. I try to follow everyone who follows me, if I missed you let me know.",
            "[deleted]",
            "https://boxd.it/5AzeF\n\nHey guys, I’ve been using letterboxd for about a year and a half. My goal this year has been to try and watch at least ten movies I haven’t seen before each month. I usually leave reviews for everything I watch, some being actual reviews with some thought behind them, and some just being brain rot depending on how I’m feeling lol. \n\nMy four favorites are León: The Professional, Fellowship of the Ring (lotr is my favorite franchise), Prisoners, and Mad Max: Fury Road.",
            "[Here I am](https://boxd.it/3Mxud)\n\nI’m in Toronto and started logging consistently last year during TIFF 2023! Currently catching up on my own list of classics that I still somehow haven’t seen, and slowly making my way through the top 250!\n\nhttps://preview.redd.it/1dapjbgfgd4d1.jpeg?width=828&format=pjpg&auto=webp&s=9a48d8a7e123ca8a860467b4b3112606dbe41538",
            "[https://boxd.it/7Nj6z](https://boxd.it/7Nj6z)\n\nDo you like to cry during movies? Have you ever thought about using the world of cinema as your therapist? Do you see movies as a potential way out of your mental illness(es)? You don't have to wait any longer, because for the small and simple price of just following me, you get to witness my depressing life in shambles, as I'm trying to figure out what is wrong with me via movies. Daddy issues? You bet! Social anxiety and loneliness? Absolutely! Hiding my pain behind humor and jokes? Duh, there is a reason Spider-Man is my favorite superhero.  \n  \nWhile I still find entertainment in the world of franchise films and big-budgeted crowd pleasers, I have developed a bigger interest in smaller, more serious, definitely more personal storytelling. If you want to know me, I have a list of [my 100 most important films](https://boxd.it/qx1yO). My future pride of Letterboxd lists will be the currently expanding, and soon want to go through, list of [movies with mental illnesses](https://boxd.it/vqF88). When TV shows get officially added, expect walls of texts about every single episode I'm watching.",
            "https://boxd.it/2jkNp\n\nRecommend me the weirdest films you’ve seen. I just watched The Boxer’s Omen and I wanna keep on this track.",
            "Hi all 🥳 I absolutely adore Letterboxd and use it pretty much every single day since I first started back in January 2022.\n\nI've logged 265 films so far this year and I try to watch on average two films a day (one rewatch, one new) as often as I can 😁 My four favourites are (perpetually) The Dark Knight, 12 Angry Men, Back to the Future, and Monster's Inc. If I could add a fifth it would be Manchester by the Sea!\n\nMy four favourite watches for May 2024 were Challengers (2024), A League of Their Own (1992), Sicko (2007), and V for Vendetta (2005) 😁\n\nhttps://boxd.it/3JLuZ",
            "Hello from Denmark\n\nWhen I was young I watched tons of movies, all kinds of things. Then somehow I got other interests, job, family etc. During the pandemic I rediscovered my interest in movies, and now there is this new thing called streaming combined with the fact, that I actually can afford to buy dvd's, so suddenly I have so much more possibility to watch movies I find interesting than before. Deciding what to watch is the hard part.\n\nMy profile on Letterboxd https://boxd.it/3Ar6Z",
            "Hi! I’ve logged all 3k or so movies I’ve seen. I’ll watch anything that’s supposed to be any good; old/new, blockbuster/indie, etc. But I’d say my specialty are movies in the Dadcore trio — crime/spy/war. My reviews are short and sarcastic. \n\nhttps://boxd.it/p2Yt",
            "I’m totally open for anybody to come on down! Opinions welcome! I’m really positive about movies myself personally \n\n[Jorfin (profile name)](https://boxd.it/4uV6d)",
            "Trying for 365 in 2024 despite only actively using the app since March, and not logging past watches. \n   \nMy profile on Letterboxd :) https://boxd.it/6c0Ht",
            "[https://boxd.it/6dCRN](https://boxd.it/6dCRN)\n\nalways looking for new mutuals! i do unserious / one sentence reviews cause i never have anything insightful to say. heres my top 4 lmao\n\nhttps://preview.redd.it/29crqaftkd4d1.jpeg?width=750&format=pjpg&auto=webp&s=33f02e2c7e29f559702977a864f1847038e328c6",
            "Hey gang, \n\nThe monthly swap has been helpful so here I am again: \n\n[I watch](https://boxd.it/7FHpT) a bit of everything, Letterboxd has been a huge help in discovering a lot of old classics I would have never otherwise heard of or watched.\n\nI typically write at least a little something for every movie I watch, and occasionally write longer, [extended thoughts](https://boxd.it/ubdLM).\n\nWould love to gain some mutuals, read your reviews, and expand my already ridiculous watchlist. Cheers!",
            "My profile: [https://letterboxd.com/DavidFitzgerald/](https://letterboxd.com/DavidFitzgerald/)\n\nI enjoy completing director filmographies, so you may see me watch a bunch of a films from the same director in a row. I most recently completed the filmography of Brian De Palma.",
            "[this is me](https://boxd.it/16R5v)\n\nhttps://preview.redd.it/4lol8sb8md4d1.jpeg?width=1125&format=pjpg&auto=webp&s=35f61e46c9ef457491a14baade1f2254049ac22e",
            "Hey y’all! I did the profile swap for the first time last month and loved getting to see what other people are watching and what people think of the movies I’ve been watching.\n\n[here’s my profile](https://boxd.it/4X18v)\n\nhttps://preview.redd.it/5w8gxajxmd4d1.jpeg?width=1179&format=pjpg&auto=webp&s=515b798dc5bce9698f9d80f062e70f01a00ec881",
            "Wow low rating for minus one. All good 👍 though I just followed you",
            "You sound very similar to me! I also write a review for every movie I watch and I love commenting on people’s reviews when I’ve seen a movie or just have something to say in general. I look forward to seeing your movie selections and reviews!",
            "Nice top 4. The harder they fall is super underrated 💪 ",
            "Just followed you here’s me https://boxd.it/4P3S5\n\nMalignant was awesome but still gotta see small soldiers ",
            "I love the loosely \"sh ppl can't handle it no more\" Month themed top four lol immediate follow",
            "Just letting everybody who reads this know that Katie is da 🐐",
            "The downvote users have been an odd plague on this sub for months now, it's entirely discouraged quality participation and left every post with a complaint or a joke or an insult at the top. Not sure if it's because this sub took off super fast or something, but it definitely caught a bug in these new and negative lurkers.\n\nAgreed on the upvote train though. I also find the block button has become effective after using it continuously for months.",
            "Just followed you. Angel heart in top four 💪 that movie has grown on me",
            "Yo just followed, looks like you’re a fellow horror lover \nhttps://boxd.it/4P3S5",
            "Followed :) https://boxd.it/5g3wx",
            "A fellow A24 fan I see! I followed you :) my profile is https://boxd.it/4RrMz",
            "Just followed \nHere’s me https://boxd.it/4P3S5\n\nLooks like you love horror too 💪 ",
            "Fellow horror fan? automatic follow",
            "Followed! Here is mine. https://boxd.it/5g3wx",
            "hi! i’m a few days late but i will be following you. 🎀in the name of girlhood🎀",
            "Wow you LOVED I saw the tv glow! I gotta see it now…. https://boxd.it/4P3S5 I just followed you :)",
            "The Insider in top 4 is based",
            "Followed! I’m a big ISTTG fan, too. https://boxd.it/5g3wx",
            "Love 3/4 of your top 4 think I’ll need to watch magnolia next",
            "My friend have you watched The Perfect Days yet?",
            "me too, scrolling through reviews and liking some of them is one of my favorite things to do.",
            "I'm doing a similar Pride Month thing with the HBO (Max) Pride folder on the streaming app too! \"All the Beauty and the Bloodshed\" was beautiful and heartwrenching.",
            "I don’t think you have terrible taste. Followed!",
            "Oh hell yeah you liked Lisa Frankenstein too!\nHere’s me. https://boxd.it/4P3S5 I just followed you ",
            "Gurl i have bad taste, i followed haha Im Spooky :)",
            "followed 🗣️🗣️🗣️🗣️",
            "Followed :) https://boxd.it/5g3wx",
            "Followed paul 🫡",
            "very interesting top 4",
            "Just followed \nhttps://boxd.it/4P3S5\n\nNice long reviews:)",
            "very interesting top 4 and nice reviews",
            "Followed :) I enjoy your reviews! And Aftersun!!! \nhttps://boxd.it/5g3wx",
            "Nice!\nJust followed you \nhttps://boxd.it/4P3S5",
            "Today I watched Maximum Overdrive, Cellar Dweller and Death Spa. Cheesy B-Movie fans unite!! \n\nhttps://boxd.it/9WxOL",
            "Nice! I still need to watch Stalker!\n\nhttps://boxd.it/4P3S5 I just followed you",
            "Followed :) https://boxd.it/5g3wx",
            "We’re already mutuals but I just want to plug your account for anyone else. Your writing is excellent and I strongly recommend anyone following this account if you like in-depth reviews",
            "Scream in the top movies is an auto follow",
            "You sold me with The Lighthouse in your top 4!",
            "You had me at Candyman. One of my all time favorites!\n\nhttps://boxd.it/9WxOL",
            "Gave you a follow - Glad to hear you're getting back into it!",
            "Saw we lived in the same town, followed!",
            "Right on! I gave you a follow.",
            "YES to Challengers!! Instant follow.",
            "Followed. Even just the poster for Close makes me want to start sobbing again.",
            "I saw Windy City Heat was in your top 4 and had to follow.",
            "Followed for Lady Bird :)",
            "Followed! Also a horror fan who is old enough to have been on MySpace 🙌🏻",
            "lol, yep, MySpace generation here, too. Remember Tripod and Angelfire?! 😂",
            "nice! I am interested in seeing all the Apes movies soon. I caught Battle on cable once and barely remember it.",
            "I followed you solely on the bio, with Amelie on top 4 as added bonus, very based.",
            "Ford V Ferrari spoilers in your review that isn't even spoiler-tagged btw. Just letting you know that you spoiled it for me and probably others since you didn't spoiler-tag it. Also warning anyone else who reads this so they don't look 😭",
            "you were not joking when saying you like slow cinema, those are some masterpieces over there.",
            "Training Day I see huh? My maaan!",
            "that's a bit sad :( but also your top 4 is difficult to swallow by average Andys. :P",
            "Followed!\n\nI’m not sure what topics specifically would be more likely to make you cry, but here are some that made me cry (if not absolutely sob).\n- Everything Everywhere All At Once\n- Brokeback Mountain\n- Dear Zachary\n- Steel Magnolias\n- Terms of Endearment\n- Tous les matins du monde",
            "Heathers as one of your favorites is an instant follow. Here’s my [profile](https://boxd.it/6XTIl)",
            "to be honest, this is why Letterboxd goes hard. Users like you are very unique and open up many different paths to cinema. I don't even literally know 10% of the films you've logged. Followed and looking for more.",
            "Followed! I LOVE your top 4",
            "I've also been trying to put more work recently into making better lists and tags.",
            "best rating system I have come across.",
            "Just followed you! I literally just watched a walk to remember for the first time today!!!",
            "small town guy?\n\nFILLING HIS EMPTY EXISTENCE?\n\nMOVIES?!?!\n\nmy kind of guy",
            "Drive and Thief top 4? Ferrara too? Lemme click that follow button. Also those are pretty much the same movie done in two different styles :)",
            "Matador on top 4 is based. We share one film in top 4 as well, the Great Beauty. I also started the year thinking one a day would make the doctor go away but it's very hard following through. Followed.",
            "Love your profile! Gave you a follow.",
            "Wanted to echo that fern is a great add and I've found a lot of good shit through their reviews 👍",
            "watch movies and cook? You mean the perfect existence? Also are you based in Paris? because 3 out of your top 4 take place in Paris :3",
            "Some other worthwhile mutuals worth checking out: [Anya Tailored-JOI](https://boxd.it/48tE3), [Adam T](https://boxd.it/1FHav), [mcsil](https://boxd.it/4auxV), [taralundrigan](https://boxd.it/ZZcP)\n\nI’ll add more if I think of more! Lotta talented writers on this platform!",
            "very interesting top 4 :)",
            "A Japanese cinema specialist are we?",
            "ope i forgot to include my top four!\n\nhttps://preview.redd.it/6vrw1bykhe4d1.jpeg?width=1284&format=pjpg&auto=webp&s=20edcd29b52e21d1f49c4f6e73073639fdec04fb",
            "just followed you! hope to interact on the platform:)",
            "you have more than 0 followers now yay!",
            "instant follow after seeing your fave four",
            "I do like your pros and cons setup on your Hateful Eight review. I write reviews and I can recommend some others that I follow since I'm also not crazy on one liners or jokes. Gave you a follow",
            "you have a very unique top 4",
            "I love *What a Way to Go!* It's such a fun movie and deserves to be more well known! If you liked Shirley MacLaine, I recommend *Gambit* (1966).  MacLaine is paired with Michael Caine who is making his American film debut.  In this film, MacLaine and Caine are trying to pull off a heist of an expensive statue.",
            "The Silence (1988)",
            "just finished my much belated bond marathon earlier this year myself - not without its ups and downs but what a fun time! hope you enjoy it",
            "If Paddington 3 is as good or close, its one of the greatest trilogies of all time. No joke.",
            "not just for pride but for a very solid top 4",
            "alien and walle would be such a good double feature lol",
            "Followed! I’m actually making a list of films I’m seeing through A-List and how much money I’m saving on tickets each month [AMC Stubs A-List](https://boxd.it/uBaPe)",
            "You think _Interstellar_ is better than _Oppenheimer_?! I finally found you: the one person I’ve met anywhere who agrees with me on this!\n\nI’m an active user myself, and will definitely give you a follow.",
            "You've earned yourself a follow mate. I use the app similarly to you although I don't comment on reviews much.",
            "Can’t ignore a profile with those favorites! Gave you a follow.",
            "seconding kit for everyone: good attitude, active user, someone who I found from these threads and who I think stands out on my feed. Give him a follow!",
            "I took a look at your profile.  I was also at the same screening of *Some Like it Hot.*  I'd actually seen it in the theater before and this is one of my favorite films.  It was still so much fun--especially in a packed house.  My only complaint is that the woman behind me was singing \"Runnin' Wild\" at full volume.  I gave her a dirty look and she sang very very quietly for the subsequent Marilyn songs--still annoying, but not as annoying.\n\nI'm a member of that theater and will be there next weekend too. I'm making my husband go to a double feature of *Dirty Dancing* (which I love) and *The Bad Seed* (which I've never seen).",
            "It's such fun and the effects still hold up amazingly.",
            "Just followed, here’s mine!\nI enjoy all types of genres and I’m really enjoying reviewing! https://boxd.it/78ybx",
            "LMFAO thank you, I try and throw some curveballs in there that you don't typically see on peoples profiles when I change my top 4 (hence Small Soldiers, which I will defend to hell and back and holds a special place in my heart as a toy collector)",
            ":D",
            "Hell yeah. Angel Heart is such an underrated classic. Love Mickey rourke & DeNiro in it. An underviewed classic for sure",
            "followed back!",
            "I sure do one of the most complex genres",
            "Actually going to see X again tonight in theaters",
            "Thanks. Changes by the hour tbf haha",
            "Followed back!",
            "Thanks I really appreciate the kind words, especially with how self-conscious I am, I always inevitably think whether I'm actually adding something or not!",
            "it’s perfect! 🗯️ & I’m loving your profile !",
            "Same! It seems I just love films that absolutely break my heart",
            "masterpiece! followed ya back!",
            "followed back!! your profile is the cutest :)",
            "Ha, appreciate it!",
            "Damn I didn’t even think about it lol sorry. Fixing that now",
            "Will follow back as soon as I log back on :D\n\nI've seen Dear Zachary and it more so HORRIFIED me (but it was still incredibly heartwrenching), it's sad that even somethings this tragic couldn't get me to break down.\n\nI'll get to EEAAO soon and try the rest of these movies since I have the whole summer break for cinema :D",
            "LOVE yours too!",
            "haha thank you! i truly only love movies that make me feel something which only results in tears lol",
            "followed you back! and omg no way! did you cry? it was the first movie to ever make me cry so instantly became one of my favorites lmao",
            "Thank you so much! And absolutely, some days are easier than others. I’ve said it before but I don’t know how those people who watch four a day, every day for years, keep up with it.",
            "Thanks! Love yours too!",
            "That’s so awesome to hear! I love the letterboxd community so much.",
            "I wish I was based in Paris, but no I guess I just love it as a setting",
            "Thx",
            "Thanks for the follow. I would say though, the pros and cons thing was kinda a one-off for that review cause it had been a while since I watched it. Glad you liked it ha ha.",
            "In a good or bad way? haha",
            "Thanks for the rec, that sounds intriguing! And I totally agree, What a Way to Go! is an amazing film and basically rewired my brain 😆 I accidentally binged several of her movies a few weeks ago (a happy coincidence since they were movies I've never seen) and she's probably one of my favorite actresses now.",
            "Yes! I have a whole spreadsheet showing how much I’ve saved and it’s insane",
            "Interstellar will always have my heart. I’ll never get tired of that movie. I think my opinion of Oppenheimer would raise slightly on a rewatch but it’s hard to bring myself to rewatch it just with how long it is lol. I’ve only seen six Nolan films so far, but it’s funny that our top 4 for him at the moment are the exact same: Interstellar, The Prestige, Oppenheimer, and Inception",
            "haha were you towards the back row? The women next to me was singing pretty loudly during that!",
            "followed",
            "in a good way of course. It's a rare combination for sure. I liked Empire Records a lot. Such a nostalgic movie.",
            "That’s awesome! I did rewatch _Oppenheimer_, so I’ve seen it twice, and I actually did like it better the second time around. However, it only moved up to surpass _Inception_ for me. It’s an incredible film, but _Interstellar_ is just perfection. And I have a soft spot for _The Presitige_.",
            "Haha I was second to the back row.  That is my favorite row to sit in.  It's very possible you were sitting behind my husband or behind me!",
            "lol oh my god, what a small world! Thank you for getting her to be quiet(er)!",
            "Haha I doubt you remember who was sitting around you; but I was wearing my bright red hoodie with the Hollywood Theatre on the back.\n\nI hate it when people have audible conversations in the theater.  If you want to talk, watch the movie at home.  But it's an even bigger pet peeve of mine when people sing the music outloud.  If the movie isn't advertised as a sing-a-long, thus I won't be there, then shut up! Sing at home. I had to give her a dirty look because it was so annoying. I'm there to hear Marilyn sing, not her.  I tried not to be a total wet blanket by telling her to be quiet, because I didn't want to ruin her night; but ugh. She also annoyed me with her constant \"oh my gosh\" statements. Lady, obviously you've seen the movie before. Why are you surprised at what's happening? \n\nI'm just glad she took a hint and was a little quieter.  She was annoying my husband and my family too. I was at the movie with my husband, my parents and my sister--because we all wanted to see *Some Like it Hot*.",
            "I had the exact same conversation with my partner. She seemed very shocked for a person that must've seen the movie a bunch! \n\nShe wasn't as bad as the person at Purple Rain a few month back.  Coincidentally it was almost the exact same spot. But during the performance of the song Purple Rain, she took out her phone and held it up like a lighter at concert. Bizarre behavior! \n\nAlso I totally do remember, because I've been clocking those new colored hollywood hoodies. I was on the aisle seat in my movie madness hoodie (I think. That's my usually uniform).",
            "Lol.  For the most part the Hollywood crowd is pretty good. There was a woman last year at *It Happened One Night* that kept loudly gasping at the film.  I assumed that she and her friends weren't avid classic film goers and probably went on a lark.  The one lady kept gasping at anything that happened that was even remotely not okay by today's standards--like when Clark Gable slaps Claudette Colbert.  It was really annoying. She was so annoying in fact that someone actually went to get the Hollywood Theatre staff to talk to her.\n\nAnother time, I went to see *To Be or Not to Be* alone and this woman brought her child who was probably like 9 and 10.  I always sit in the second to back row.  She sat right behind me (I seem to attract the annoying people) and proceeded to explain every single scene at a loud whisper to her child.  That movie's plot can be convoluted to even me, an adult who has seen A LOT of classic films. Why she thought a child would enjoy that film is beyond me.  But her constant explanations were so annoying, I actually got up and moved to the other end of the aisle. I don't normally move during a film, even when someone is annoying; but I couldn't take it anymore.\n\nAt *Gentlemen Prefer Blondes*, this guy in front of me got his phone out and the guy next to him told him to put it away.  The guy with the phone actually swore very angrily at the guy who told him to put it away.  Even though I was behind them, it still felt awkward, because I thought they were going to start fighting.\n\nOn the flipside though, last year we saw a sold out showing of *Barbarella* and that was awesome. The entire audience was into it and captivated by the craziness on screen. The screening of *Red-Headed Woman* last summer was also really awesome. I love when 90-year old films can still captivate the audience.\n\nIf you were on the aisle, you were sitting behind my parents! Lol! I was annoyed that someone at the other end of my aisle was wearing my same red hoodie."
        ]
    },
    "Top 4/Recents/Favorites (June 2024)": {
        "title": "Top 4/Recents/Favorites (June 2024)",
        "score": 30,
        "url": "https://www.reddit.com/r/Letterboxd/comments/1d74dw0/top_4recentsfavorites_june_2024/",
        "content": "Use this megathread to post your top 4, or 4 recents, ask for suggestions based on them, or what they say about you or similar types of questions.    \n  \n  \n(Threads that duplicate this will be deleted and referred back here)",
        "num_comments": 108,
        "comments": [
            "Kurosawa Kiyoshi I owe you my life\n\nhttps://preview.redd.it/rl9hlsgqad4d1.jpeg?width=828&format=pjpg&auto=webp&s=4abf2c5ece20af8856418536c6f56563743eacb9\n\nWould love any recs! Always looking for more great Japanese films but open to just about anything",
            "https://preview.redd.it/ykefun16pd4d1.jpeg?width=1125&format=pjpg&auto=webp&s=e6c460520067f9d055d86f5e9fbedfc4a276453a\n\nWatched the worst movie I’ve ever seen last night :/",
            "https://preview.redd.it/v3e2gmp42j4d1.png?width=651&format=png&auto=webp&s=a90efe5334ca64d3f4ad7f6560690ac24cfd60db\n\nVery good start to the month, Magnolia is proably my favourite first time watch in years. I unfortunately didn't like No Country For Old Men as much as i thought i would.",
            "https://preview.redd.it/uxsqcx9yyc4d1.jpeg?width=1284&format=pjpg&auto=webp&s=58ff4e30cda23b1a37bd07a767fa3c0cfc3ec927\n\nI have been on a short film around the world kick, so that’s the back half of my recents.",
            "https://preview.redd.it/dr9ca0fofd4d1.jpeg?width=1080&format=pjpg&auto=webp&s=7f34266485840b196fbf31cc033c6a07c5a4ef18\n\nMinus One is on Netflix in the US now! If you haven't gotten the chance to see it, I can't recommend it enough. Honestly, it's a perfect introduction to the series.",
            "https://preview.redd.it/dl5lr74iue6d1.jpeg?width=1290&format=pjpg&auto=webp&s=dc64070f8a6b70fb244461a2d4912e290cf3ed67\n\nwould you guess that i am an annoying 22 year old woman based off my top 4",
            "https://preview.redd.it/h1fcw1a02d4d1.jpeg?width=750&format=pjpg&auto=webp&s=65a2ae9d4f3205c818f0682a178bf66189dabfed",
            "https://preview.redd.it/fh56nbhnfd4d1.jpeg?width=1080&format=pjpg&auto=webp&s=497b056d7e89dbd057fa03237380b902f90554c8\n\nRecs?",
            "https://preview.redd.it/ygla0mxiud4d1.jpeg?width=1170&format=pjpg&auto=webp&s=77305e84f76d5bb439f787cefa8321e807a98217\n\nSlowly making my way through the Top 250 Most Fans list. Only got about 100 more movies to go, so hoping to be done with it by September",
            "Hey everyone!\n\nMy name is Jack, I’m 27 & I’m from Ireland. I logged 277 films last year, which for me is an achievement given I also juggle a full time job and other responsibilities. Trying to beat it this time!\n\nI try to watch a different genre with each diary entry, and I always give my thoughts on everything I log. My goal this year is to fill in some of the gaps in my cinematic education.\n\nI always follow back as I’ve found some great mutuals and great films that wouldn’t otherwise be on my radar through these threads!\n\nThanks ♥️ j4ckwalsh - [https://boxd.it/2Wj2v](https://boxd.it/2Wj2v)\n\nhttps://preview.redd.it/51cty1feal4d1.jpeg?width=1290&format=pjpg&auto=webp&s=49ba97d4417aa72f2c4801557733228bebe23dad",
            "https://preview.redd.it/xlzgf8wa2d4d1.png?width=828&format=png&auto=webp&s=65f729fe1ae5e7771f964f8c4ec5118dc3e1ed1f\n\nI welcome any recommendations based on this",
            "- Ecstasy (1933) - masterpiece \n- A Simple Case (1932) - masterpiece\n- The Life of Matsu the Untamed (1943) - amazing\n- Cain & Abel (1982) - amazing",
            "https://preview.redd.it/d6t4zx41hd4d1.jpeg?width=828&format=pjpg&auto=webp&s=f25b9a11fd793962e2395ae5f0f02364b2767f2c\n\nhere to give emoji movie the recognition it deserves!",
            "https://preview.redd.it/mgw44rhh4e4d1.jpeg?width=1179&format=pjpg&auto=webp&s=7996aff16d4c4bda98af8b36a1ac97c61e3a5d3f\n\nHad a really fun Mad Max and Mad Max 2 day with some friends on Saturday, inspired after watching Furiosa earlier in the week. Loved Furiosa BTW.",
            "Change my top 4 every month, this month is LGBT films and characters. Always happy to take recommendations based on favorites and recent watches.\n\nhttps://preview.redd.it/r968lk2ife4d1.jpeg?width=1290&format=pjpg&auto=webp&s=090f33ac771d175bee4e0c5a4e2d5eeaf01b9f55",
            "I feel insane\n\nhttps://preview.redd.it/3dwued2m216d1.png?width=823&format=png&auto=webp&s=0fa87416f10fb711a770fe9f40e2a62758670f4e",
            "https://preview.redd.it/o63cxegz4d4d1.jpeg?width=1080&format=pjpg&auto=webp&s=624572bc9d2f438a25da2bb82d28e7fa9c68b60c",
            "https://preview.redd.it/t3xju2h15d4d1.jpeg?width=1170&format=pjpg&auto=webp&s=5b7f381c9cc4b3418a267790c6be4426514e20ea\n\nI tried my best to make my favorites representative of my taste overall, but I think there’s still too many similarities between Madame de… and Le Notti Bianche.\n\nAs for recent activity, I’ve only just started to get back into ticking movies off the They Shoot Pictures, Don’t They? list of the 1000 greatest movies of all time. I took a few months off from that to focus on rewatches and taking recommendations from a colleague.",
            "These are the four best first-watches from my last month:\n\nTargets (1968)\n\nDreadnaught (1981)\n\nGo (1999)\n\nFuriosa (2024)",
            "https://preview.redd.it/o6ua5g0w6d4d1.jpeg?width=1284&format=pjpg&auto=webp&s=95bb1d783fe6386101643a4185e96e0bc704a2bf\n\nLittle fun fact about me is that I only just watched Alien for the first time last December. Hard to believe I’ve never seen it before, but better late than never I guess!",
            "https://preview.redd.it/b6qnvm997d4d1.jpeg?width=1179&format=pjpg&auto=webp&s=47ee4dfaf78abc1b83b0e5ba3b8518f52269ed8f\n\nAbsolutely loved Columbus",
            "https://preview.redd.it/yc3m2iol7d4d1.jpeg?width=1080&format=pjpg&auto=webp&s=5612bd6ec53a232082ff13376ab1ffd4d87e29ab",
            "https://preview.redd.it/1po4l6q68d4d1.jpeg?width=1080&format=pjpg&auto=webp&s=6f7e464b7959feceb558180ca6fc79f7e3d527ff",
            "https://preview.redd.it/iha3rv8vad4d1.jpeg?width=1179&format=pjpg&auto=webp&s=dcc0ab9f941a44fcd22d2f03298276d435c9a348",
            "https://preview.redd.it/hauizjbobd4d1.jpeg?width=1170&format=pjpg&auto=webp&s=1d539cbf52bc95ccb3da52b8a8bf78d3a00b3772",
            "https://preview.redd.it/ay2yfdafcd4d1.jpeg?width=1170&format=pjpg&auto=webp&s=02cc72aff6e410152c9dc62413fe46d445566183\n\nI rewatched The Thing for the first time and liked it even more the second time around, so I added it into my top 4 favourites.",
            "https://preview.redd.it/z4wpqx80fd4d1.jpeg?width=1170&format=pjpg&auto=webp&s=2112c36888c67db9d713ad91ddc08afdd1c5d9e0",
            "https://preview.redd.it/ltfz7xx2fd4d1.jpeg?width=1080&format=pjpg&auto=webp&s=72a98a4e341583c04a5529fd363fad08c9811960\n\nRecs plz",
            "https://preview.redd.it/63atit0igd4d1.jpeg?width=1179&format=pjpg&auto=webp&s=befb1f2190ffe49475f45bc4abaf6160a128739a\n\nAny recommendations based on these are welcome . Preferably looking for some epic action films like Furiosa and Mad Max fury road and Lord of the Rings .\n\nAlready watched Harry Potter , Planet of the Apes , Lord of the Rings etc",
            "https://preview.redd.it/sk63tdwrgd4d1.jpeg?width=828&format=pjpg&auto=webp&s=fb61cd7ec596b1a0117bf0dbbd5c37df74259489",
            "https://preview.redd.it/lz772ciqgd4d1.jpeg?width=1661&format=pjpg&auto=webp&s=b7d42e4ee1c6342cecc7c6a2fc4719a2f39c29d5\n\nSend along some recs! The more obscure, the better.",
            "https://preview.redd.it/hpfqnuwvjd4d1.png?width=1222&format=png&auto=webp&s=124a966fab88359128ae50de48277aa10cfd03df\n\nI saw \"Watchmen\" as part of a re-screening, everything else I saw on streaming.",
            "[favorites are more or less random](https://i.imgur.com/g2IWaFP.png) films from my Top 50, picked for their amazing posters",
            "https://preview.redd.it/1rok3vrtld4d1.jpeg?width=1242&format=pjpg&auto=webp&s=3cb4ed265096259f0ec41239ab6f45647e3b1667\n\nI would like recommendations.",
            "https://preview.redd.it/15l7w09iud4d1.jpeg?width=1170&format=pjpg&auto=webp&s=5dd30cadc3d332d7de588abb915c0983e2926789\n\nRecs please",
            "https://preview.redd.it/qs26gt2pud4d1.jpeg?width=1179&format=pjpg&auto=webp&s=e3562ba9aea7d9d3cc37d996771040409c3b766e\n\nBeen a slow period for me after a busy few weeks but I’m planning on seeing Furiosa and watching the older Mad Max films this week.",
            "https://preview.redd.it/uz7o1267de4d1.jpeg?width=1170&format=pjpg&auto=webp&s=dcb13cb1a9329ae1811984082f2c78b383a8ca24\n\nMy top 4 currently!",
            "https://preview.redd.it/imkx4n56ee4d1.jpeg?width=1080&format=pjpg&auto=webp&s=1c1b445a99ce0968d30a843cb1aba462cb596441\n\nIt's been aight",
            "On a good run and would love to continue it\n\nhttps://preview.redd.it/xkg1rw1pge4d1.png?width=1080&format=pjpg&auto=webp&s=98a1cec55fc1033d15f439273e42d681153e69ee",
            "Have a “serious” dilemna regarding Coma and year-end lists because it’s a VERY 2022 film that just got a US release.\n\nhttps://preview.redd.it/tmnsf6tlle4d1.jpeg?width=1242&format=pjpg&auto=webp&s=da8fb183ecb8a8ca3802394ea8601905b2b40f7f",
            "https://preview.redd.it/pn4tugz3qe4d1.jpeg?width=1170&format=pjpg&auto=webp&s=f31e878c7ec1094c9769e161595638e5cde631f6",
            "https://preview.redd.it/6hpyy4f3re4d1.jpeg?width=750&format=pjpg&auto=webp&s=d3c1f789ca756fce12218384a5b59a2db5f3b867",
            "https://preview.redd.it/c40sha238f4d1.png?width=1080&format=pjpg&auto=webp&s=4d3021f7062b9a385a3ec84d3687a55123ce046b\n\nOn an absolute heater right now with the quality of movies lately.",
            "https://preview.redd.it/vhcm6pg4nf4d1.png?width=1169&format=png&auto=webp&s=2fed8f21ee68328b0d3c00e6497a8f42ec765daf\n\nFeaturing just one fave atm, but here are my most recent watches/rewatches.",
            "https://preview.redd.it/z2rs2tw7sf4d1.jpeg?width=1125&format=pjpg&auto=webp&s=9580ce9acd7b487954feeed1bde8c84d19c9abcb\n\nHere’s mine!",
            "https://preview.redd.it/o6lmqziesf4d1.png?width=864&format=pjpg&auto=webp&s=f852c50bb3347e945eb8041e138d65a44ae3bfd0",
            "https://preview.redd.it/bfbhb4p64g4d1.jpeg?width=1284&format=pjpg&auto=webp&s=f9ae7253b88a4b87975c15a43a65f51194ed0041\n\nI’d love to get some recommendations! The second most recent watch was The First Omen.",
            "https://preview.redd.it/l48o2qjoah4d1.jpeg?width=1170&format=pjpg&auto=webp&s=c685235179c08847a1dba8586e9f6441a58ae136\n\nThere are so many more that can go into favorites I just picked randomly for the last two",
            "[Comments? Takes? Opinions? Criticisms? Additions? Words?](https://boxd.it/oA5Ea)\n\nhttps://preview.redd.it/f5e61vpiai4d1.png?width=701&format=png&auto=webp&s=41c2d64937270ef4f2e40d82be7eebb066c47511",
            "https://preview.redd.it/88ogqmoymi4d1.jpeg?width=1125&format=pjpg&auto=webp&s=4f6ef76a3b101ec907701741c627a66773593425\n\nJumping right into school's out/summer movie season.   \nAll due respect to Superbad (which I really like) but Adventureland is my favorite Greg Mottola summer comedy",
            "https://preview.redd.it/20llr7bdqi4d1.jpeg?width=1125&format=pjpg&auto=webp&s=dc5ea591ec153dd8037e5700fc1e5ffef2c78d73",
            "https://preview.redd.it/aiuhprsiwi4d1.png?width=651&format=png&auto=webp&s=e6104a62a06fa170fae958a3769ac7641467e66d\n\nDecided to binge these four yesterday. They work nicely as a dive into the slice-of-life aspect of the series, but pale in comparison to The First Slam Dunk.",
            "This is real, this is me. \nhttps://i.imgur.com/3iLQVxx.jpeg",
            "https://preview.redd.it/rwpvsgiq3k4d1.jpeg?width=1080&format=pjpg&auto=webp&s=bbc0a1a563fb3eaef7db6b9d8db6c81da34ff9e2\n\nI've been mostly going through Jean-Paul Belmondo's filmography and planning on watching more Mario Bava and giallos. This week was a divergence.",
            "plz roast my top 4\n\nhttps://preview.redd.it/htvoki5gbk4d1.png?width=1368&format=png&auto=webp&s=b7ce79e19cae9bc5142dbaad955eb6ea81f95659",
            "https://preview.redd.it/o4357pnhdk4d1.jpeg?width=652&format=pjpg&auto=webp&s=75d470cb3815939a3f7aad19754625888f209e71\n\nHorror reccomendations always welcome.",
            "https://preview.redd.it/lf40ydi97l4d1.jpeg?width=1242&format=pjpg&auto=webp&s=c4ebbf726887ad298776e288037d27e7073cbbe2",
            "https://preview.redd.it/g393fka6ll4d1.png?width=1314&format=png&auto=webp&s=26cc507336069f85f663f3b36b20b1180684d1c9",
            "Hello friends! ₊˚⊹♡ [https://boxd.it/huiJ](https://boxd.it/huiJ) Anyone have recommendations for my never ending watchlist? I love anything whimsical and thought provoking really, but mostly a huge horror fan :)\n\nhttps://preview.redd.it/j6vgsmlzdo4d1.jpeg?width=1290&format=pjpg&auto=webp&s=ea1d9c48992897a5b7a80019ce5d03dbd030dd3b",
            "https://preview.redd.it/h3ylxlswku4d1.jpeg?width=1080&format=pjpg&auto=webp&s=2380be4f65b25adcca0d53de0059dfe30d1079c8",
            "https://preview.redd.it/7mn58qa97w4d1.jpeg?width=1284&format=pjpg&auto=webp&s=ccf5702551943766c704e51a99000a1b6d561535",
            "https://preview.redd.it/x9cez6e8025d1.png?width=950&format=png&auto=webp&s=77eb486720956db7c1a4a181d13e5a607ae4953e\n\nBo Burnham is a very new addition to my 4 faves but that might be cause of recency bias",
            "SwizzNerd is my letterbox name https://boxd.it/OMij I’m generally a huge nerd for things like Disney, DC, Marvel, SciFi, Horror stuff but also indulge in the occasional smaller scale dramas. All depends on what I’m mentally up for and I made it a thing to do written reviews for everything watched since last year which has been really fun. So far I’m 100+ reviews in! 🏰🌌✨🎞️",
            "https://preview.redd.it/dpu2l0o7vb5d1.png?width=812&format=png&auto=webp&s=9b44a14b6e22fcbb1e67ac0098d28016decf2f1a\n\nI love Three Colours: Blue so much",
            "https://preview.redd.it/nqfy2wv40d5d1.jpeg?width=1179&format=pjpg&auto=webp&s=d17c522147dca60067ffc93a2aa6aa657cf6770f\n\nNext movie is either Hit Man or a 10 Things I Hate About You rewatch\n\nAnd would love to follow people back!\n\n[https://boxd.it/45qRH](https://boxd.it/45qRH)",
            "Can you guess the type of film I like? \n\n[https://letterboxd.com/TrashOnTape/](https://letterboxd.com/TrashOnTape/)\n\nhttps://preview.redd.it/cbxhzysboe5d1.png?width=801&format=png&auto=webp&s=667f3d667d5d29757941a4f515d66c407f421f18",
            "https://preview.redd.it/stnc47k16g5d1.jpeg?width=1179&format=pjpg&auto=webp&s=72f2e2052b720e82e5dee3e01f53d6ee62c638ed\n\nReally need to watch more Peter Greenaway",
            "https://preview.redd.it/nzlbpbczug5d1.png?width=678&format=png&auto=webp&s=32f9279f8ead835ec9e3c794676f5b03792a6f39",
            "https://preview.redd.it/vj26xi5n156d1.png?width=1330&format=png&auto=webp&s=003c88be007b352ebfbbdfef7241f37ad4e5d5b7\n\nWatched Promised Land in the cinema and was blown away on how the movie climaxed around potatoes.",
            "i would actually appreciate a decent rec. i have been filling my brain with garbage\n\nhttps://preview.redd.it/vpl3s2ss156d1.jpeg?width=1170&format=pjpg&auto=webp&s=d4e79d6ba928788344287f4e73b360aadb77bb4b",
            "https://preview.redd.it/ahmiq8nnn66d1.jpeg?width=1170&format=pjpg&auto=webp&s=4b45e086efe9297dce21c82b2e639e7d94be336a",
            "https://preview.redd.it/0h9uuxeb8c6d1.png?width=660&format=png&auto=webp&s=c798f30534ee3428a153c1bb8852512b46db6ba4\n\nrecent <3",
            "https://preview.redd.it/r6d66rfphe6d1.png?width=693&format=png&auto=webp&s=577b79265a16629e7c4134b5e4213f7d0430c863\n\nDo prioritize style too much?",
            "[deleted]",
            "https://preview.redd.it/u0bnsb0jbl6d1.jpeg?width=1179&format=pjpg&auto=webp&s=08ff59a8d7cc427a5c5a41f4cdb8967bf4e19123",
            "Among new watches, they are Quo Vadis, Aida? (4.5 stars), Pacifiction (4.5 stars), Furiosa (4 stars), and Candyman (the original) (4 stars).\n\n  \nAmong rewatches, they are The Zone of Interest (4.5 -> 5 stars), Perfect Days (4 -> 5 stars), May December (4 -> 4.5 stars), and Palm Springs (4 -> 4 stars).",
            "https://preview.redd.it/2mo558l7ur6d1.jpeg?width=1080&format=pjpg&auto=webp&s=ea066efbb81d63cc09e9f88c457a64662e893ac0\n\nHit Man did the opposite of live up to the hype",
            "https://preview.redd.it/odv885mtxy6d1.png?width=821&format=png&auto=webp&s=ae8149248d2b5821c78922eada5397dbd6e23d5e\n\nfinally been watching some movies from my watchlist!! 🖤",
            "https://preview.redd.it/evkem66q5z6d1.png?width=1169&format=png&auto=webp&s=fd900400bfe2db4d383b48b439598fda29ef31ac\n\nMy account is brendon1822, I follow back 🤗🎥",
            "https://preview.redd.it/r98rwodbj57d1.jpeg?width=1170&format=pjpg&auto=webp&s=38ede2a24e287fcb4326764b77df448348dd781a",
            "https://preview.redd.it/cwqym9cbj67d1.png?width=1003&format=png&auto=webp&s=555b4cfb19a2e8c9f701f7842e2061f98b597bd9\n\nthese days I'm trying to marathon watch the oldest films in history",
            "Been watching older works lately and so far so good!\n\nhttps://preview.redd.it/ob73gv29ce7d1.jpeg?width=1024&format=pjpg&auto=webp&s=941879cd2cba42a5c6f60a6faf08e086de563e0e",
            "My top 4 are:\n\n1) Life is Beautiful \n2) Amelie\n3) Shrek 2\n4) Alien\n\nI would love to interact with you on my letterboxd account :) https://boxd.it/8J3YV",
            "https://preview.redd.it/o5fwpmcx828d1.png?width=652&format=png&auto=webp&s=d369676a3921e4e2609d16834cf3e2a23f693d58",
            "https://preview.redd.it/btdt7l4hbh6d1.jpeg?width=1179&format=pjpg&auto=webp&s=9d454c81c745c8c2b2e189a6d9cba3dae40b2713\n\nMy #1 is never gonna change.",
            "nice, am in the middle of a Kiyoshi Kurosawa binge too",
            "Have you seen Maborosi or A Bride for Rip Van Winkle?",
            "chime is great",
            "Re: Kiyoshi Kurosawa, would recommend *To the Ends of the Earth* if you haven't seen it.",
            "I don't know how far you like to stray into arthouse territory, but I can highly recommend \"Survive Style +5\" and \"Hazard.\" It might be tricky to get hold of them in decent quality though.",
            "if you wanna see something worse watch Dracula’s Angel",
            "you should check out “short cuts” i really loved it and imo it’s slightly better then magnolia",
            "No Country for Old Men might be one of those flicks that works better upon rewatch.",
            "Awesome favorites!! ₊˚⊹♡\n\nI would recommend: The Tree of Life, Ex Machina, Lost in Translation, Mr. Nobody, Annihilation, High Life, Comet, Big Fish, and Eternal Sunshine of the Spotless Mind",
            "Apocalypse Now based on Fellowship and 1917 being favorites",
            "Maya Deren's At Land is notable for having a very, very similar opening to Inception. Meshes of the Afternoon from the same director is probably an influence too. Both are short (15 min) and available on YouTube. I recommend watching without any sound on. Meshes is my favorite of the two.",
            "That alien cover is gnarly. Agreed on it being a perfect movie.",
            "The Red Shoes is an excellent ballet movie with similar themes to Black Swan. The main actress is a professional ballerina and has some incredible dance sequences.",
            "I didn't actually watch love Simon recently, I just remembered I watched it and it was OK, the film before Juno is it follows",
            "I’m checking out Serpent’s Path tonight, really excited. It makes me super happy when a director I end up loving is so prolific. What’s your favorite by him so far?",
            "Neither! Koreeda and Iwai are both pretty big blind spots for me. I’ll check them both out this week, appreciate it.",
            "Just finished watching it and wow, you weren’t kidding. I’m going to be thinking about that for a while. Genuinely evil movie lol",
            "Just watched Survive Style, and I can’t thank you enough for the rec. Obnoxious maximalism at its finest and some of the coolest costumes + sets + music ever. I loved Vinnie Jones and his translator haha\n\nI’ll definitely check out Hazard sooner rather than later. I’m still forming an opinion on Sion Sono so I’m super curious about this one.",
            "Yeah I’m definitely going to give it a rewatch. I’d been meaning to watch it for years and don’t get me wrong it was a good film but I didnt enjoy it as much as I thought I would.",
            "That sounds very interesting. Thank you.",
            "so far, Cure and Tokyo Sonata are my faves, Pulse and Creepy are good too",
            "Ah, in that case for Iwai, I would definitely start with All About Lily Chou Chou if you haven't seen it yet. I think it would be a much better starting point for his body of work. The pacing of Rip Van Winkle is a bit more languid (not necessarily in a bad way) while Lily Chou Chou is really tightly paced IMO.\n\nAnd Maborosi, while being one of my favorites from Koreeda, is pretty unrepresentative of his work as a whole. Regardless I think it would be a good starting point as you can see both his influences from Ozu and his career as a documentarian the strongest. This one is also is told in a very passive/slow manner, which may not be your thing but let me know your thoughts if you get the chance to see it!",
            "glad you liked it :)",
            "I have seen Monster and Shoplifters, and really enjoyed both, I’ve just been waiting for the mood to strike to get deeper into Koreeda’s filmography (I think Tokyo Sonata might’ve done that for me—it almost felt like Kurosawa’s very aggressive take on the type of stories I have seen from Koreeda, and now I’m longing for more)… but somehow still haven’t seen Lily Chou Chou or anything else Iwai 😅\n\nThis is all very helpful, thank you so much!",
            "Shoplifters was my first Koreeda and I fell in love. It's constantly battling between Maborosi, and Still Walking to be my favorite. Excited for you to experience these films!"
        ]
    },
    "r/letterboxd’s favorite movie of each genre — Day 15: Science Fiction": {
        "title": "r/letterboxd’s favorite movie of each genre — Day 15: Science Fiction",
        "score": 202,
        "url": "https://i.redd.it/0acanvrfw38d1.jpeg",
        "content": "",
        "num_comments": 143,
        "comments": [
            "Alien",
            "2001: A Space Odyssey",
            "Star Wars Episode V: The Empire strikes back",
            "Back to the Future",
            "Blade Runner",
            "Arrival",
            "The Matrix",
            "Children of Men",
            "Interstellar",
            "https://preview.redd.it/5w740w4my38d1.jpeg?width=600&format=pjpg&auto=webp&s=01aff0ef58e132328a56653d98d56c9756d284e3",
            "Ex Machina",
            "Blade Runner 2049",
            "Under the Skin",
            "Star Wars Episode IV: A new Hope",
            "Sunshine (2007)",
            "Stalker(1979)",
            "Dune part 2",
            "Children of Men",
            "Star Trek: Wrath of Khan",
            "Solaris by Tarkovsky",
            "Ghost in the Shell",
            "Jurassic Park?",
            "Blade Runner",
            "Metropolis",
            "Gattaca",
            "2001 is probably going to win but my vote will go to The Matrix.",
            "total recall",
            "Inception (2010)",
            "The Matrix",
            "Contact",
            "2001: A Space Odyssey",
            "The Fifth Element",
            "A.I. Artificial Intelligence",
            "Everything Everywhere All At Once\n\n![gif](giphy|TejmLnMKgnmPInMQjV)",
            "Arrival",
            "Her",
            "Metropolis",
            "Interstellar",
            "Gotta be 2001",
            "WALL-E",
            "As if the Western war of yesterday wasn't enough, now we have science fiction lol",
            "2001 A Space Odyssey, no contest",
            "ex-machina",
            "Moon",
            "Interstellar",
            "Blade Runner",
            "Donnie Darko",
            "![gif](giphy|l41YsxKKVYnucStag)",
            "Interstellar, and it’s not even close.",
            "Eternal Sunshine of the Spotless Mind",
            "Dune II",
            "Back to the Future",
            "Blade runner 2049",
            "Balc To The Future",
            "Blade runner 2049",
            "I mean, it’s gotta be 2001, right? It’s not my favorite, but I would say it’s an easy contender for the best one.",
            "The Terminator",
            "Interstellar",
            "Interstellar!!!!!",
            "Edge of Tomorrow aka Live Die Repeat aka All You Need is Kill. The title sucks but the movie is great.",
            "Planet of the Apes",
            "*Eternal Sunshine of the Spotless Mind*",
            "Brazil",
            "Blade Runner 2049",
            "Melancholia",
            "The Manchurian Candidate",
            "The Abyss",
            "Gattaca",
            "AI Artificial Intelligence",
            "Paprika (2006)",
            "Jurassic Park",
            "Does Interstellar count?",
            "Lucy",
            "Metropolis.",
            "2001: A Space Odyssey",
            "2001",
            "Arrival",
            "Dune 2\n\nDon’t care how recent it is",
            "Everything Everywhere All at Once",
            "I'm just here to upvote all bladerunner comments",
            "Poor Things",
            "Arrival",
            "Poor Things",
            "Arrival",
            "Star Wars",
            "Interstellar",
            "Primer",
            "#2001.",
            "Avatar",
            "Dune(2021)",
            "Masters of the Universe",
            "Empire",
            "2001",
            "It’s 2001 no competition",
            "2001",
            "It’s gotta be 2001",
            "My vote would be Revenge of the Sith.\n\nBut I'm happy with either A New Hope or Empire Strikes Back winning.",
            "Empire Strikes Back",
            "Star Wars (1977)",
            "Megamind",
            "The Martian",
            "The Web",
            "The Martian",
            "A Clockwork Orange",
            "Guardians of the Galaxy Vol. 3",
            "SW is not Sf, for those are writing that. Ill vote for Blade Runner",
            "People are gonna say 2001, but Empire Strikes Back is iconic. You gotta choose it.",
            "If this loses I say we take off and nuke the entire site from orbit.",
            "Aliens is just better,,,",
            "It has to be 2001: A Space Odyssey (1968), it changed the whole game. And to this day, still holds up flawlessly.",
            "Is there Gen X here in this sub? What was your feeling watching this in 60s or 70s? Thanks for the insight",
            "It Has To Be This",
            "Unfortunate that this is going to win. Surely even the people voting for this understand that it's boring, right? Are you just voting for it because you think you are supposed to?",
            "The “world building” is my favourite part of sci-fi and the weakest part of 2001.",
            "oh the hipster choice, please don't let this subreddit do this. Anything else.",
            "Much like how Fellowship stands in for all 3 LOTR movies in the fantasy category, I feel comfortable with Blade Runner representing both the original and 2049. Both capture a sci fi universe like no other.",
            "If this doesn't win the whole thing is rigged",
            "Never wouldve thought of that but good catch!",
            "![gif](giphy|l3vR4CdLInXOhr3rO)\n\nMy reaction when this wasn‘t the top comment",
            "NON SIBI SED PATRIAE [X2]",
            "I personally do think this should win. If there’s any movie that encapsulates the sheer conceptual and emotional highs of the science fiction genre, while also being beautifully shot and very relevant to the modern age, it’s this one.",
            "Pls win pls win pls win\nI don't care if it's a relatively new movie, it's just really beautiful.",
            "Let's go!\n\n![gif](giphy|nopqz91prOyvS)",
            "Yess. Please make it win.",
            "Good call, but if Network didn't win for Fox News Documentary then Matrix (Beta Version) won't win",
            "2001 is absolutely iconic. The opening theme and HAL dialog alone are still instantly recognizable",
            "That would be Aliens, though...",
            "It feels like an acquired taste tbh. I've shown that movie to 5 different ppl and they end up zoning out bc they get bored. Such a shame bc it's one of my favorites",
            "If millions of people think it’s one of the best movies ever made, and you’d rather believe that people fake their enjoyment of it instead of recognizing that it brings genuine joy, have you ever considered that maybe it’s *you* who just doesn’t have the capacity to appreciate its genius? You’re the aberration here",
            "Found the iPad kid",
            "I totally agree.",
            "Yeah not sure another genre would fit better",
            "Fuck yeah",
            "I know, and I really like the movie, but it just feels so boring.",
            "Gotta see it in a theater",
            "I agree. I saw it when I was 17 on 70MM in theaters and thought it was the most confoundingly boring shit. Could not have run farther opposite with my opinion as I’ve gotten older. It just ages beautifully.",
            "That isn't what this list is fyi. Things like \"for its time\" or \"it's well crafted\" don't really apply for a list about \"favorite films\". A film can be way ahead of its time and also very boring or way too slow paced. Are you seriously going to sit there and try to convince anyone that this film isn't extremely slow paced?  \n\n\nAlso, using your own argument about consensus, it is also widely considered to be boring. I also don't doubt for a second that you understand this. Yet somehow you will inexplicably both think it's impossible for people to not understand it's brilliance, while also knowing full well that it's pacing is very methodical and many scenes are drawn out while serving no purpose.",
            "Uh huh... You really wouldn't use the descriptor \"slow\" for the pacing for this film?",
            "Thats not going to help for a lot of people. My mother watches low quality netflix romcoms ona  daily basis, and finishes modt movies she watches, even if she doesnt like them, yet she couldnt get psst the first 30 minutes of La La Land, wich is a lot more accesible than 2001",
            "Slow and boring aren’t the same thing. Plenty of fast paced films are boring AF. If 2001 is so boring, why have I seen it multiple times?\n\n>Are you just voting for it because you think you are supposed to?\n\n“I didn’t like this so no one else is allowed to, either.”",
            "Well yea. Lots of people have shit taste and no attention span whatcha gonna do?",
            "Force them to sit through fantasia 10 times with their phones in another room. No food, one glass of water, lots of brooms"
        ]
    },
    "This shot of Robert De Niro in Heat (1995) is truly incredible. ": {
        "title": "This shot of Robert De Niro in Heat (1995) is truly incredible. ",
        "score": 1031,
        "url": "https://i.redd.it/g5ng7s8q008d1.jpeg",
        "content": "",
        "num_comments": 113,
        "comments": [
            "https://preview.redd.it/cdus9n7is08d1.jpeg?width=1440&format=pjpg&auto=webp&s=4ba82faa7b594ecc572ec95ec33d2de16f6c72d6\n\nThis shot of Robert De Niro in Meet the Fockers (2004) is truly incredible.",
            "r/okbuddycinephile",
            "they would love this at r/moviescirclejerk",
            "This shot of My Cat in Heat(2024) is truly incredible.\n\nhttps://preview.redd.it/cyvywxmr618d1.jpeg?width=1170&format=pjpg&auto=webp&s=af48ef2633a889cf16bac98f41351885071942a3",
            "This subreddit is getting dangerously close to Facebook. It's fucking awful.",
            "I haven’t seen Heat but what makes this shot so good exactly",
            "I don’t know why people are hating? This shot is such a strong mood piece when he returns to his balcony overlooking Los Angeles. And the song that’s playing in the scene is either “Mystery Man” or “Last Nite” by Terje Rypdal, really complimenting the vibe.\n\nOP isn’t even referring to some “random” shot, this shot was purposefully made by Mann inspired by this painting:\n\nhttps://preview.redd.it/c8l8iimi218d1.png?width=1135&format=png&auto=webp&s=bf48d2f14af8fb0e8f9e029e13b76b4ebcf0e43b",
            "Think he took some inspiration from one of Alex Colvilles painting. https://www.aci-iac.ca/art-books/alex-colville/key-works/pacific/",
            "Yeah, I'd buy that cologne and/or vodka",
            "so much hate in the comments but that shot is wonderful",
            "It's a great shot, but I stand by the best shot being Easy and Neil standing by the side of the road at night.",
            "Same energy\n\nhttps://preview.redd.it/thmql1qim18d1.jpeg?width=3058&format=pjpg&auto=webp&s=6c15875f21a83d980989341583d7cbc7fd44ba6c",
            "What's good about it? Genuinely asking. I mean moody silhouette shots are a dime a dozen and not super hard to compose.",
            "I goddamn hate Waingro and hate how the entire movie hinges on them letting him get away",
            "God whenever I see this scene I just have to pull down my trousers and start jerking it, that is if I haven’t already creamed myself before I could get em off, truly cinema",
            "everybody in the comments acting like they’re too good for Heat gtfo",
            "![gif](giphy|d5mI2F3MxCTJu)",
            "Just a fuckin banger of a movie start to stop",
            "Cool, but the hand holding at the end is one of the best shots in cinema",
            "https://preview.redd.it/5vlmiemws28d1.jpeg?width=1170&format=pjpg&auto=webp&s=6eec450ac8c4f6eb69471120f9d0135fe7915892",
            "The painting it was inspired by is much morre interesting though this is a fine moody shot. Just don’t think it justifies a post to Letterboxd if I’m being frank 🧍🏻‍♂️",
            "Amazing!",
            "Rober de niro in heat",
            "https://www.aci-iac.ca/art-books/alex-colville/key-works/pacific/",
            "everything about that film is incredible",
            "That is some storytelling right there. And they didn't use one shred of computer generated graphics!",
            "It’s from a painting.",
            "Is it? It's a pretty bland shot.",
            "Indeed. I loved the color of that scene",
            ">rule of thirds\n\n>INCREDIBLE!!",
            "Ehh",
            "I won’t lie. I watched Heat last weekend and it was boring for me.",
            "Why?",
            "WOWOWOW a guy shot in silhouette leaning on a door frame so effing magical 💦💦",
            "Ah yes, a lone De Niro seeking a mate during estrus.  His egg has released from his ovary and his thickened uterine lining is ready for implantation.",
            "Meh",
            "Y’all gotta be posting this so it can get cross posted on r/okbuddycinephile",
            "Lots of pretentious film snobs in this sub. How can you hate on a film that’s so satisfying?",
            "What? This is shockingly mid cinemtography? It's not ugly, but it's hardly \"truly incredible\"",
            "Hyperbole",
            "Amazing. A silhouette.",
            "https://preview.redd.it/itofqw40w08d1.jpeg?width=225&format=pjpg&auto=webp&s=23d6dd090dd0b2405f840786a8828a57766ef230",
            "https://preview.redd.it/vt46goi4q18d1.jpeg?width=1080&format=pjpg&auto=webp&s=50e47e5cc9647bb41a03a5acba3b9bc25a57eb81",
            "Now he can be milked!",
            "It’s breathtaking. ",
            "Literally thought this post was from that sub, not the Letterboxd one",
            "i literally thought the joke was that he was \"in heat\" and jerkin it",
            "That’s like 50% of the posts on this sub tbh",
            "Lol",
            "We spayed our cat so she won't be in Heat 2.",
            "Jesus Christ. \n\nThis sub is a place to talk and discuss movies. We can’t even talk about our favourite shots in a movie we like now?",
            "it's shot in a way that makes the light hit the lens such that an image appears that looks like the back of robert deniro standing in front of large windows, perfectly encapsulating the imagery of the scene",
            "why the fuck are you living and breathing on this earth of ours without having seen Heat? Go fix it.",
            "You're asking the wrong question. \n\nA shot must be assessed within the context of the film, and this shot in the context of the film is indeed incredible. \n\nOverall, shots are meaningless outside of their context, as Roger Deakins would tell you people mistake pretty cinematography as great cinematography.\n\nAnd do yourself a favor and watch Heat. A Masterpiece.",
            "Is it a mistake to assume letterboxd is still a place for solid film discourse lol?   \n\nWhile it’s not the directors best movie IMO, it’s still one of the best of its kind.  \n\nAs for the shot, I always interpreted this as De Niro’s character realising the jig may be up, but still unwilling to face it (us, the audience) despite being at the centre of it all. The parallel lines could be cell bars and this gorgeous blue could be at 4am or 9pm but it’s uncertain and reflective.  \n\nThe copypasta that guy said was funny though",
            "Yeah I’m honestly confused. Is this sub not for discussing film? It’s like in certain instrument subs they will get mad at you for talking about making music",
            "Yeah honestly it’s fucking bullshit. For all we know OP is a young person just getting into movies and has no idea that Heat has become a cliche and a meme in this circle. They came to a community built around loving movies and posted something that they love about a legitimately great movie. And what does r/Letterboxd do? Welcome this person with open arms? No, we ridicule them because their taste isn’t as refined as ours. \n\nIt’s stupid. This movie rocks. This shot is very cool. And if you think the shot isn’t cool, maybe chime in and say why and tell us about some shots you do like. Don’t just ridicule a person who is just trying to engage with the community.",
            "With Moby god moving over the face of the water - timeless",
            "You're asking the wrong question.\n\nA shot must be assessed within the context of the film, and this shot in the context of the film is indeed incredible.\n\nOverall, shots are meaningless outside of their context, as Roger Deakins would tell you people mistake pretty cinematography as great cinematography.\n\nAnd do yourself a favor and watch Heat. A Masterpiece.",
            "He had to get it on, man!",
            "OP did not even explain why. Just posted a movie still, like what the fuck?",
            "Also, Heat is hella overrated",
            "I agree with you Frank",
            "Do you enjoy t he scent of your farts?",
            "Have a downvote",
            "https://preview.redd.it/o7shtuybr18d1.jpeg?width=1170&format=pjpg&auto=webp&s=4a7ae1bf03278bdfb81376f0e3f29e07b1f13d23",
            "You take Reddit too seriously dog 😂",
            "https://preview.redd.it/zrtwtp2kf28d1.jpeg?width=828&format=pjpg&auto=webp&s=3133afe8833f56d83cd0809d2c3323d54767247c",
            "This is such an amazing shot. He's all alone, empty space, nothing to compare him too - and still he looks so huge. If any movie ever deserved an Oscar for CGI, this movie does.",
            "Shut the fuck up. Bravo!!",
            "What is incredible about this shot?",
            "Oh fuck off",
            "> You're asking the wrong question.\n> \n> A shot must be assessed within the context of the film, and this shot in the context of the film is indeed incredible.\n> \n> Overall, shots are meaningless outside of their context, as Roger Deakins would tell you people mistake pretty cinematography as great cinematography.\n> \n> And do yourself a favor and watch Heat. A Masterpiece.\n\nnew copypasta dropped",
            "Shut upppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppp",
            "I just came and shidded so fucking hard bro",
            "i dont even see how this is should be downvoted, he was very polite",
            "Why are you being downvoted, because of the first and last sentence? \nEverything in between is just true",
            "Masterpiece my ass",
            "Ok so uh…  what makes this shot so good?",
            "https://preview.redd.it/rq5cm9z6t28d1.jpeg?width=1170&format=pjpg&auto=webp&s=14d795b4975e32fec608697132fe3ca9350094ab",
            "no it's for asking other people how they rate movies so you know if you like it or not",
            "Anyone who thinks Heat is cliche or a meme can get fucked. You're not edgy for hating on a masterpiece.",
            "I’m 23 and got a Letterboxd account like 6 months ago. I thought this place was a place to discuss our favourite things about movies we like.",
            "the letterboxd community is certainly not the best. in short pretentious mfs",
            "why are you getting downvoted lol you have a point",
            "big time",
            "[deleted]",
            "You can suck on a downvote yourself",
            "Just because he's alone, doesn't mean that he's lonely...",
            "It captures the whole ethos of the character. He’s a powerful man looking over his city but he’s deeply lonely and sad. \n\nBlue being the loneliest colour etc etc is on the nose but it captures what the whole character is about. Masculine, brooding, powerful but still unsatisfied and sad.",
            "I like blue",
            "You are deeply unhappy with your life and I’d suggest you go get some help before it’s too late.",
            "It is a masterpiece, yourass.",
            "Good reference for sure but I think they built on it well rather than just cut and pasting the shot!",
            "I liked the movie but I didn’t think it’s a masterpiece. Solid 4 star movie imo",
            "Unfortunately pal, letterboxd isn’t actually used for that, it’s used for making copy paste one liner reviews about a film that refer to whatever the funny meme topic of the week is at the time, and this sub is used so bot accounts can karma farm",
            "Even if he has a point, you can tell bro was Dutch ovening himself whilst writing that out",
            "You guys are delusional, but appreciate the honesty",
            "Whatever do you mean?",
            "Fair enough that's a pretty good take OP",
            "hes looking at the beach, no?",
            "The whole film back be inspired from this one image, it’s so powerful.",
            "https://preview.redd.it/q4lv7t8a148d1.jpeg?width=600&format=pjpg&auto=webp&s=7cbd5f11da56b41d5763079b04d596e15aca5a2c\n\nEven down to the shot of the gun on the table",
            "That's fine. 4-5, whatever. Cliche and meme movie? No, sir. Heat/Collateral are the one-two punch good time roll to me. Plus, any movie that has an ending scene with this song is always going to be worthy of praise - [https://www.youtube.com/watch?v=3tI1pu5rfZw](https://www.youtube.com/watch?v=3tI1pu5rfZw)",
            "what does dutch ovening mean? sorry",
            "pacing, action and the dialogue are all pretty below average to me. the development of the characters is laughable and so is the attempt to make de niro come off as a criminal mastermind ??? EVERY one of his plans go wrong in this and we never see him do anything right so the whole cat and mouse game between masterminds trope isnt even explored here",
            "I see the influence but I don’t see how it relates to Heat at all other than the shot! Thanks for sharing",
            "[removed]",
            "That's... the point of the character. Sure, he's presented that way at first, but his whole character arc is about how he unravels as he makes increasingly emotional and impulsive decisions. He markedly *does not* follow his own advice, (\"never get attached to anything you can't drop in 30 seconds flat,\") and the book he's reading when he meets his love interest foreshadows this (*Stress Fractures in Titanium*). He is a tragic deconstruction of the criminal mastermind archetype who is undone by his human attachments.",
            "Apparently he used the same shot in his film manhunter as well.",
            "We've deemed your post or comment to be in violation of Rule 1. Having all activity in the sub be respectful is an important priority for us, whilst still allowing for healthy opposition in discussion. Please abide by this rule in the future, as if you continue to violate the rules, harsher punishment will have to be carried out.",
            "i feel like they needed to actually show some well executed criminal activity to make the deconstruction make sense as well as actually have anything with him matter in the first place",
            "• The armoured car heist goes well. It's well-planned and McCauley escapes with the bearer-bonds. The only complication is Waingro, but McCauley gives the go-ahead to execute the remaining guards in order to get away clean. He almost succeeds in killing Waingro as well (who spends the rest of the film terrified and hiding from McCauley). The only thing tying him to the heist is the nickname \"Slick\" used by Churrito (which honestly shouldn't be a workable angle, but Hanna is just that good).\n\n• Selling back the bearer-bonds to Van Zandt (the money launderer) should have been a slam-dunk. McCauley is initially against it (he correctly intuits Van Zandt will double-cross him, but his fixer gives him bad advice).\n\n• The precious metals heist should also have been a cakewalk. It's only because Hanna is so good that it fails--and even then, McCauley's catlike awareness both saves his crew from arrest and turns him onto the police surveillance.\n\n• The bank heist is where things really go off the rails. McCauley relies on someone else's research, not his own. Van Zandt's thug somehow learns about it and tips off the police. He knows about the police surveillance, but he goes ahead anyway, motivated by dreams of running away to New Zealand with Eady. Pretty much the entire LAPD shows up to apprehend him, and yet *he somehow manages to kill a dozen cops, get the money, and get away anyway.* This one *shouldn't* work out, but his superior training carries the day when his planning fails him.\n\n• It's after the bank heist that McCauley runs out of plans. He becomes reactive and fixated on revenge. He even admits to Eady after chasing her, \"I don't know what I'm doing anymore.\" Ultimately, after the trauma of spending a decade in solitary confinement, the fleeting taste of intimacy is too strong a temptation. He succumbs to his human impulses. He loses the discipline."
        ]
    },
    "A movie really that mediocre?": {
        "title": "A movie really that mediocre?",
        "score": 140,
        "url": "https://i.redd.it/mwxx8o26s18d1.jpeg",
        "content": "I’ve never seen a movie with such mid ratings. Like did everybody just agree it’s meh.. Guess the movie!",
        "num_comments": 95,
        "comments": [
            "Since everybody in this thread is just debating what 'mediocre' means and no one is answering OPs question (aside from two lunatics who said Top Gun: Maverick and Oppenheimer), let me be the first to actually answer the question lmao.\n\nA lot of marvel films would fit here: Thor, First Avenger, Eternals. These are perfectly average movies.\n\nBut for something original: Now You See Me. Maybe one of the most mediocre films ever made. Forgettable but not offensive. Enjoyable enough to have on at a party, but I've never heard anyone say \"that was great\" about it.\n\nTl;Dr: Now You See Me",
            "i just watched private benjamin\n\nhttps://preview.redd.it/hn5xt317j28d1.jpeg?width=500&format=pjpg&auto=webp&s=d0a187b83cefc05f371df87e0011c87b391cdac7",
            "* Indiana Jones and the Dial of Destiny \n* Don't Worry Darling\n* Flash",
            "Pretty much anything Kenneth Branagh has directed (with the exception of his Hamlet; that’s quite an excellent film). They’re too good to be bad, too bad to be good.",
            "For everyone debating whether a 3.1 average or a 2.5 average rating is “mediocre”, I’d like you to know that individual ratings and average ratings differ in definitions. For example, if I give a film a 2.5, I’d say that’s an average film, however a film with a 2.5 average rating I’d consider to be, according to the average, “bad”, because out of every single person that has given that film a rating, more people tended towards a bad rating. I mean, often times for a 2.5 average film the most given scores are 3 (6/10) and 2 (4/10), with the next most given score then actually being 2.5 (5/10). Meaning a lot more people have to dislike a film for it to have a generally lower average rating. What that means for me, is that the definitions of my personal ratings I give are completely different from the average score, though they don’t vary vastly. A 3.1 average score, for example, I’d think of as mediocre, whilst a 3/5 score that I give a film would mean I thought of it as enjoyable.",
            "2.5 is mediocre imo",
            "Is 3.1 a mediocre movie?",
            "I’m expecting you to be crushed by responses from the people on here who think 3/5 is a good rating. That’s 6/10. Tell your wife/girlfriend she’s a “solid 6” and see how that works out for you. Average is bad when it comes to art.",
            "Is a 3 even mediocre? I give 3’s to films I find decent or solid",
            "Are you kidding? I’ve seen much wirse",
            "3 to me is \"the film is okay\", I wouldn't quite call it mediocre.",
            "At first I was thinking a movie that is controversial, due to thing that haven’t aged great or representations that some people don’t like, but than I thought and I’m gonna guess the original Cars. I’ve seen some 5 star reviews and some very low ones.",
            "https://preview.redd.it/u6c3r80uq28d1.jpeg?width=1080&format=pjpg&auto=webp&s=b4085649d9c1cf1879ddc510895e695a00efe249",
            "Is this “AM I OK?” ? I’ve been meaning to watch it but the okay (ironic) scores/reviews have kinda drawn me away",
            "The Last Voyage of the Demeter",
            "Guy Ritchie is the king of mediocre fun dad movies",
            "Ghostbusters Frozen empire. I love Ghostbusters and I'm a defender of afterlife, however the latest sequel was very meh.",
            "Licorice Pizza",
            "Samurai Cop has a 2.6 rating",
            "The Post",
            "Gigi ?",
            "Average",
            "benjamin button movie",
            "Oppenheimer?",
            "2.5 is half of 5 thus 2.5 is right in the middle. It's \"a movie\" or movies that have equal good and bad elements",
            "Top Gun Maverick",
            "Titanic",
            "3 is above average. 2.5 would be actually mid. Seen many good movies at 3.0, 3.1, etc. And going through my 2.5's, I can't find much that's exactly mediocre, a lot are just kind of interesting, but also flawed to me. Except one very good example that is indeed very mediocre, well produced but also very forgettable.\n\nhttps://preview.redd.it/auux916a538d1.jpeg?width=233&format=pjpg&auto=webp&s=3023bd78b592abd3acec6271d7cac72c019b2744\n\nAlso; the word 'mediocre' means 'average', not 'bad'.",
            "3.4 is actually the average rating on letterboxd, so this is below mediocre.",
            "You’re actually so amazing. The actual movie was Freaky Friday (1976). The original now you see has 3.3 surprisingly. Most people rate it 3,4(1/2), and 4.",
            "My dad loves \"Now You See Me\" 1 & 2 so much 😂",
            "We interviewed someone for a new position at work and we always ask what their favorite movie is and someone said “Now You See Me 2”. We ended up hiring them and they’ve said they were embarrassed to say that but it was just the first movie they thought of.",
            "The First Avenger is a 5 star movie and I won’t hear otherwise",
            "Good explanation but I personally disagree with Now you see me. Avengers is debatable if you’re only considering the movie itself with absolutely no previous attachment to characters which I think is impossible",
            "Good explanation but I personally disagree with Now you see me. Avengers is debatable if you’re only considering the movie itself with absolutely no previous attachment to characters which I think is impossible",
            "Similar but it was freaky Friday (1976)",
            "I feel like Letterboxd is giving me the middle finger",
            "Don't Worry Darling was definitely my guess. Or a mid superhero movie.",
            "after i got out of indiana jones, the only thing i could think of is how it was the most okay movie ive ever seen. if 5/10 was a movie. if meh was a movie. 68 degree weather movie.",
            "I think don't worry darling was bang average but I enjoyed indiana jones a fair bit, even if it was mostly because it was indiana jones and it was just a fun romp.",
            "Got a Flash poster, I honestly loved it so much",
            "I don't think Flash fits this discussion at all. I thought it was a surprisingly pretty good movie all things considered but that's because I sort of overlook or don't care too much about some of the major issues the movie has. If anything the Flash is a potentially 7-8/10 movie that is potentially bogged down to a meh due to strange choices, unfinished CGI or other flaws; but for me the discussion is much more complicated and polarising than just an agreed \"meh\" or \"It's okay\".",
            "Dial is straight up bad if you start paying attention lol",
            "I thought the first two Poirot films were thoroughly mediocre, but I was really pleasantly surprised by A Haunting in Venice.",
            "Belfast was pretty great too in my opinion.",
            "with the exception of Thor; that's quite a piece of shit",
            "Exactly! When I rate a movie 2.5, it means it's not worse than an average movie. But when I see that a movie has a 2.5 rating, it means that a lot of people think it's worse than an average movie.",
            "That’s awful, lol. With the score inflation on Letterboxd, 3.5 is around the average.",
            "if we go by your logic any and every mean rating is considered mediocre; but reality is that there's a degree of  subjective skewness in all things that go by ratings. \n\nFor example the colloquial meaning of a 5/10 guy and a 5/10 girl are neither 'average' nor equivalent.",
            "For me 3 is just a good enough/solid film but nothing spectacular",
            "The short range of the reviews show that it’s just a consistently mediocre film",
            "Yeah that's a mediocre score all things considered. Some underrated gems! But mostly just meh films",
            "Yes, the vast majority of films with 3.1 or lower on letterboxd I would say are average to subpar",
            "If most people agree with a movie being 3 I’d argue that it is rather mid because it wasn’t bad but it wasn’t like wow. 3 is the middle number.",
            "Yes. 3.1 is below average.",
            "If we’re using the significant other scale then anything less than a 10 is a critical failure",
            "Eh 6/10 is a good enough rating for me lol,it's not something that is great but not something that is bad or average either...it's just good but i probably will forget about it.I guess you have high expectations lol.For me 5/10 or 2.5 is the mid or average.",
            "6/10 has always been \"good\" in my opinion, not average. 5/10 is average imo",
            "6 is just a tiny bit above sufficiency in my school grading system, definetely NOT a good grade, it's the definition of mediocre",
            "I’d say a lot of art doesn’t even scrape average if we’re being honest.",
            "I guarantee you’re not with a 10, despite what you say they are or think they are. you’re just lying to yourself and to them….  I don’t need to lie about movies.  A 6 out of 10 is a good movie.",
            "Its a passing grade, but barely",
            "Not necessarily \"good\", but decent. Has its obvious issues, but it's enjoyable and the movie rather works than not",
            "A movie that’s a six isn’t worth watching outside of an airplane",
            "To me those words are the same",
            "It was the og freaky Friday (1976)",
            "yes",
            "On a 1-10 scale, 5.5 is usually the passing grade. I consider mediocre to be a movie that's not bad, but far from great, meaning is just about passes with a 6/10 (3/5).",
            "Never said it was bad I said meh. I’m using the median.",
            "Thought it was the equalizer 2. Looking at it, they're incredibly similar graphs",
            "I get it tbh. I mean, they’re definitely \"average\", but sometimes I love mindless fun movies. Give me some silly, often nonsensical magic tricks and I’m fine for 2 hours.",
            "tbh I felt the same about all the Indiana Jones movies, they all place around 6/10 for me",
            "I don't think there's really anything inherently bad about it. The story is on par for most indy stuff, just a mcguffin he desperately needs to find for whatever reason. The acting is good throughout. Dialogue writing is about average for an indy film. The de-aged scene is a little weird but I actually think it works really well for the plot, and the fact that the artefact is in 2 pieces is a novel spin on a normal indy film. The villains are kinda forgettable but the supporting characters are some of the best we've had. The elephant in the room is really that mental >!time travel scene!< but I think it's goofy enough that you can just suspend your disbelief. We've had aliens, whatever. It's not groundbreaking but it's really an enjoyable experience in my opinion.",
            "Yeah my rating is anything below 2.5 is bad but 2s are still not that bad just kinda bad, and everything above a 3 for me are actually pretty good films",
            "Lol, 3.5 is not the average. Pick 100 random movies and most are gonna be under 3.5. If you only look at very popular or good films, you gonna see a lot of them over 3.5, but is not the average on the site.",
            "I think the average person just doesn't intentionally waste their time on movies they don't think will be above average.\nIf forced to watch every movie ever, 2.5 would probably be above the average.",
            "Kinda depends on what people are watching too. If you’re like me and watch movies that are old and we’ll reviewed there’s likely going to be less variance than newer films. \n\nMy average grade is like a 3.75 but I also don’t know if I’ve watched much that’d be considered “bad” anyways.",
            "Ya because nobody watches anything under a 2 for the most part so it seems like that💀. Most 3.5’s are pretty solid for sure above ageraheu",
            "Average*",
            "Like the other person replying to you said, it mostly depends on the genre and sample size of people who rated the movie in question",
            "3.5 is above average",
            "\"Well, they didn't fuck it up enough to rate it 2.5 so let's call it a 3.\"\n\nhttps://preview.redd.it/2egjdvuhr28d1.jpeg?width=1080&format=pjpg&auto=webp&s=7d7f7a4fe6920f47780fdf1ac9645e4e626512ce",
            "Exactly",
            ">3 is the middle number\n\nWell 2.5 and 3 are equally mid, but yeah either way it's not good",
            "Pro tip, tell her she's an 11",
            "That person is simply wrong. 5/10 is *literally* average. 6 is above average. Doesn’t matter if you’re rating a movie or a person, not that I’ve ever been a big fan of assigning numerical scores to people",
            "Yeah, I use it as my “I’d definitely recommend this but it’s not a favorite/must-see” rating. \n\nTwo is my “meh” rating (I don’t use half-stars). Not my thing but not offensive. ",
            "100%!",
            "10- Perfect\n9- Excellent\n8- Great\n7- Good\n6- Above average\n5- average\n4- below average \n3- bad\n2- terrible\n1- irredeemable \n\nThis is the scale I’ve always used",
            "Most art being bad just lowers the average",
            "It’s also a bit of a silly strawman argument to compare movies to people. That’s like trying to rate a film for the film itself & also combine what the weather was like on that day & how the cinema toilets were into a Letterbox score",
            "Makes sense tbh",
            "I was just saying that in general. I wanted to emphasize that being mediocre isn't inherently negative, I think a lot of people associate negativity with it when it's really just 'okay'",
            "For real. If I watch a 2/5 I'm fucking pissed. It's not the worst thing I've ever seen but that's still 2 hours I'm never getting back.",
            "When I told my girl that she said “Yay! Now we’re a perfect 20/20!” \n\nI don’t know how to feel"
        ]
    }
}