{
    "LPT –Avoid “Smart” Appliances and/or those with Touch Screens. They are a recipe for disaster and prone to fail.": {
        "title": "LPT –Avoid “Smart” Appliances and/or those with Touch Screens. They are a recipe for disaster and prone to fail.",
        "score": 2027,
        "url": "https://www.reddit.com/r/LifeProTips/comments/1dlebi0/lpt_avoid_smart_appliances_andor_those_with_touch/",
        "content": "",
        "num_comments": 145,
        "comments": [
            "### This post has been marked as safe. Upvoting/downvoting this comment will have no effect.\n\n---\n\nHello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "I definitely chose fridge, washer, dryer, dishwasher, range, and microwave specifically to NOT be internet connected. No thanks LG.",
            "Absolutely. A new pump installed on my 1994 White washing machine last year ($85 including installation) and it's chugging right along. \n\nWhat? I can't turn the washer on from some remote location or see if it's done yet? How will I ever survive? /s",
            "Pretty much all new smart appliances and things with touch screens have a designed lifetime. The manufacturer wants them to just be trouble-free just long enough. How do you think they get more sales. TVs, cellphones, stoves, laundry machines, etc.",
            "And never, EVER, trust smart devices to your physical security. They're way easier to get into.",
            "What, you don't want an intetnet enabled Juicero bag squeezer?",
            "Yes.  Choose brands that don't flex as technology companies.  Whirlpool and Maytag come to mind. Just do the one thing I need well.",
            "Good luck with that. \nWe bought a new house about 5 years ago. Almost everything on the market then, and even more now, are connected. It’s called the [Internet of Things (IOT)](https://en.m.wikipedia.org/wiki/Internet_of_things) and it’s not going away anytime soon. \n\nI tried to reverse the direction of my ceiling fan and couldn’t do it without downloading an app and signing up for an account. It SUCKS!\n\nI don’t use 90% of the features available. Why do I need to remotely turn on my microwave?!  Is it really that hard to stay in the kitchen for the 3 minutes it takes for my popcorn to finish so I need it to send me a notification on my phone?\n\nBuilt in obsolescence in a throwaway economy is lining the pockets of the rich at the expense of the common man.",
            "As a huge geek that's been writing code since the mid 90s and loves technology, I 100% agree.\n\n\nThere's a lot of really amazing useful tech out there, but major appliances that you want to last 20 years aren't the place for it.\n\n\nUnnecesary tech not just a failure point. It's also often plain harder to use and virtually anything that connects to the internet or requires an app is almost certainly collecting data on you needlessly, but also creates more surface area for hackers.\n\n\nI love my bluetooth noise cancelling headphones. I don't want to have to trobleshoot my blootooth connection to make coffee.\n\n\nSamsung doesn't need to know what's in my fridge.\n\n\nAmazon doesn't need to know whats happening in my bedroom.\n\n\nI don't want to replace my toaster because the touchscreen died.\n\n\nJust because its newer doesn't mean its better.\n\n\nSometimes a thing just needs to be a heating element and a switch in a housing.",
            "Yeah fuck my fridge it went nuts on me until I changed the filter would not ducking stop. Tried leaving it off for a minute did not work so I went to work with it going nuts beeping away about how filter needs changed. Dumb ass shit next old fridge I see at a garage or moving sale I'm buying it.",
            "Avoid \"smart\" anything like it's broken before you purchase it. It basically comes pre broken",
            "\"The more pieces it has the more reasons it has to fail.\"  \n  \nmy Grandfather",
            "its a racket. cars are going the same way. you can best be guaranteed that flashy touch center console will fail just outside of the warranty period. and you'll fork over the 2.5k to get it fixed just so you can turn on ur a/c again",
            "Our toaste died about a month ago and my spouse was looking at new toasters at Walmart. All of them had digital displays, and some had wifi. Why the heck you need wifi on toaster makes no sense to me. We ended up getting an $8 toaster from the thrift store with good old fashioned knobs and I couldn't be happier with it.",
            "I would get a smart appliance if I could change the OS it's running to something open sourced that I can add it to my offline home network.",
            "I don’t need a smart refrigerator or a smart toaster or a smart coffee maker or a smart….  The more whistles and bells the more things there are that will break.",
            "Problem is that they are cheaper to make than many of their analogy cousins :( we've reached a point where making a digital touchscreen costs far less than a knob and the components that go with it. So avoiding them will be nigh impossible soon. Welcome to the future. It sucks lol",
            "If you have one a surge protector is mandatory if you want it to last at least a year",
            "Understand that most consumer appliances are prone to premature failure these days. Companies can't keep selling you products if they never break.\n\nBuy smart enabled devices if it really makes sense and if you'll genuinely benefit from that functionality. If it'll  be an occasionalky used gimmick, don't bother. More importantly, just do your research on what products are reliable and what brands have good CS. There are lemons everywhere.",
            "Even the more mundane smart devices in my home seem to be getting dumber and dumber. Google Home thinks I’m trying to cancel an alarm every time I ask it about the weather, smart plugs randomly stop working, and wi-fi/bluetooth connected outdoor hose timers take an hour to troubleshoot during setup and randomly stop working.",
            "100% yes to this.  I'm a house cleaner. I have a client that had a like 3 year old oven with a touch screen and the thing was already dying. \n\n  \nQuite honestly, I'd avoid ANY touch button appliances that are ran by microchips.  The chip goes out and you have to buy a new appliance instead of a new part.   Sadly, I think it's becoming really hard to avoid them",
            "I run my LG while returning from work, clothes are dry when I reach home.. Simple drying them saves lot of time",
            "I bought a dumb oven, but all the buttons are on a touch display. I spend way more time screaming at the oven when trying to choose the function than anyone should ever. \nAnd then when I open the door, the vapor comes out of the oven and presses the forking buttons. I hate it with all my heart.",
            "Washer and Dyer - Get a Speed Queen. \n\nYou will thank me later.",
            "This is how I feel about Smart TVs. Now they're unavoidable. Everything I plug into my TV has all the apps the TV is advertised as having, and 100% of the time they run the apps better than the TV does. \n\nHaving said that, I'm totally interested in smart appliances but them being prone to failure totally sucks. Why does it feel like the better technology gets, the less reliable it becomes?",
            "Indeed they are. Also ice makers in the door suck",
            "This is why I bought a used car.  I don't want a huge touch screen controlling my volume or HVAC.",
            "im dreading buying my next car for this very reason .. do they even still sell good analog cars ?? 😭",
            "What a coincidence.\n\nI have a air fry with touch screen, the touch screen just failed today.",
            "I use smart aircons jsut so I can turn them on before getting home but everything else is still the good old dumb style of appliance",
            "*Juicero flashbacks*",
            "My washer has internet capability, but i never set it up.",
            "Just wandering in here. Do not, under any circumstances get an EcoBee thermostat. It's so awesome when you wake up and it's 100 degrees inside because your fucking thermostat crashed. Yes that happens, no you won't notice that it isn't working (other than the obvious extremes) because it's still displaying a temperature, but the temperature is wrong. And then when you tap the control surface it spends the next ten minutes resetting.\n\nSo, yeah. This is a good sentiment in general but a great one when it comes to that brand in particular.",
            "I had a Bluetooth kettle but I'd always forget to put water in it before bed, so I couldn't get the advantage of having it.",
            "Great advice. Dont buy appliances from tech companies, just like wouldn't buy tech from an appliance company.",
            "My dishwasher has a wifi thing on it but I never set it up.  I'm not sure why I'd ever need it.  I'm sure there are people who could get use from that kind of feature, but I sure am not one of them.",
            "Not just \"smart\" stuff, but also touch stuff pisses me off. My new kitchen has the light controls as touch. No chance toggling the lights without looking to hit the precise spot the touch control is at. Controlling the stove top with wet hands? No chance. Putting a platic bag or a pan on top of the touch controls and they go crazy. It pisses me off so much, but the catalog was full of this shit and there were no alternatives. Just questioning the salesman about that made him look at me like I am out of my mind wanting such retro shit like physical control panels.",
            "It heavily depends on the appliance in question. Some things are just better when you can control the over the internet. Others don't make sense. And avoiding touchscreens is getting harder and harder every day.",
            "Too bad it is almost impossible to buy a car that is not connected and has a screen in the dash.  I know there are some exceptions.",
            "Whilst I agree with the sentiment - this isn’t a life pro tip, it’s just an opinion.",
            "My toaster is wifi connected. I can adjust the level, timer, and start it from anywhere in the world. The fact that I'm not there to put the bread into the toaster apparently was not a concern for the designer.\n\nThe factory set password is \"toast\" and cannot be changed. The springs are so tight that the bread and crumbs always bounce out onto the top. The glass view on one side to watch the bread toast gets so hot I'm it will explode at somepoint to offer more crunchy bread. The person who gifted me the toaster clearly hates me.",
            "I thought that was obvious. I really like my basic appliances. Run like champs, no failures and cheap to replace.",
            "You've learned the concept of SPOF: Single Point of Failure.",
            "Can I get a new car with just knobs and buttons please?!",
            "My washing machine has wifi capability.  I am not when I would need to start my washing machine from another room when I would ned to be there to load the damn thing.",
            "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*",
            "Basically any Samsung appliance",
            "Someone bought a defective appliance.",
            "Personally? I love my Thermador suite and find the WiFi very helpful. ",
            "Or if you cannot avoid, do the extended warranty",
            "I brought my neighbor, who was an appliance repair guy, with me to buy my washer. He talked me in to one with a dial because the touch screens on the one I liked were $400. He later died of a heroin overdose.",
            "Honestly the family hub from Samsung has lasted the longest out of all the ones we've had. It is the only refrigerator I've owned (multiple brands over the last 15 years) that has outlasted the warranty.",
            "Totally with you on that. Why on earth would my washing machine need Internet access? I have to be physically in front of it to load and unload it. I'm capable of figuring out when a cycle should be done on my own. What is the benefit? Same for all the other things too. I appreciate HE washers and ovens that turn off at the end of a cook timer but that's all the fancy I need.",
            "I have a bunch of air purifiers.  They're wi-fi connected.  I can start/stop them from a remote.   The app also tells me when it's time to replace the filter and other nifty features.\n\nBut they updated the app with anti-privacy conditions that you had to accept to continue to use the app.  They wanted tons of information.\n\nI deleted the app.  Now I walk to the air purifiers to turn them on or off.\n\nFuck 'em.",
            "Until my fridge can tell me with at least 99% accuracy what's in it, it has no business being \"smart\".",
            "My aunt has a perfectly good washing machine, but it's not working since the motherboard on it crapped out. If it was an old-fashioned one, the controls would be been simpler to fix.",
            "Its so weird, cause like....you can. Not like you need to, and it's not exactly a beginner electronics project, but it's not particularly difficult or expensive to break the controls out, wire them into some kind of little microcontroller, and get that communicating with a remote or another computer or whatever. Like...$50 and 8 hours.\n\nThe ones **now** though? The ones that are \"\"\"smart\"\"? Way harder, less flexibility, more difficult to repair to boot.",
            "Agreed. Bought a used AEG for €50 when we moved, just to avoid a month of laundromats costing more than that. \n\nTurned out to be a great machine and we still have it 4 years later.",
            "And if you get a smart tv and the vendor stops releasing updates causing it to fail\n\nSlap a roku or similar on it",
            "You'd think free market economy would create such a competitive market that ONE company would want to build a \"smart appliance\" reputation built on actual quality.",
            "This is literally the biggest reason I use an iPhone. I know Android is usually ahead of the curve but knowing my device will continue to receive major OS updates for at least five years plus at least two years of security updates makes all the difference for me.",
            "[deleted]",
            "Locks are all easy to get into. See YouTube “LockPickingLawyer” \n\nLocks, mechanical or electrical, keep honest people honest. They don’t prevent dishonest people from being dishonest. ",
            "My friend converted his home into a \"smart\" home and while it was neat it made everything take longer. Instead of just putting the key in the door and walking in you had to wait for the phone to connect to the lock and then use the app to unlock it, then you had to stand in complete darkness and be quiet so he can tell Alexa to turn the living room lights on.",
            "As far as I can tell, they are not even useful in the way that they are meant to be. My refrigerator just died and it has an online diagnostic system that still says everything is fine after the compressor dropped working.",
            "About 2% of breakins are due to picking/bumping or whatever other method of bypassing the lock.",
            "Like cars?  All the new security \"features\" actually make them easier to steal for someone that takes the time to learn how.  A hard key is the best.",
            "All locks are bad, physical or digital. In most cases it doesn't matter, because windows are even easier to break than locks.",
            "I just want my Cornballer hot and ready when I get back from doing magic illusions.",
            "This bag squeezer was the most hilarious appliance I’ve ever seen.  Thank you for reminding me about it!\n\n[Juicero](https://youtu.be/_o0RyR7CIAY?si=8Y-RZOTjP87sLvRk)",
            "Keeps track of how much sealife has eaten the plastic for you.",
            "And yet this company raised 200 or 300 MILLION DOLLARS ??  \n\nthe juice bags had a code in them so you couldn't use them if out of there 7 day shelf life. \n\nGreat idea!!!! 👍 NOT",
            "Got an old Maytag washer, and Frigidaire dryer and they were 10+ years old at least when I was gifted them 6 years ago. I have had to replace the drum bearing for the dryer, but other than that, all good.",
            "You can also just go buy a “dumb” fan at a hardware store and ditch the app needing one. Someone will buy it for a small loss.",
            "The internet enabled microwave is the one single appliance I can’t understand the use case for lmao. Most of the time, the reasons are stupid but I can understand the utility to some degree. But for a microwave it just doesn’t make any damn sense at all",
            "Had someone from the military's technology group come talk to us in college. Part of their talk was about the horrible security of IoT devices. They are able to use some IoT devices to start fires really easily. One example was a crock pot they hacked.",
            "Exactly. Just because you can doesn't mean you should.",
            "Woah.  Even toasters?  \n\nMine is over 100 years old this year.  Love it.\nMy husband loves high tech everything, but I love manual or at least really old and repairable appliances.  Most of my stuff is around a hundred years old, and we replaced literally all of his stuff a few times in the past 14 years.",
            "Home Assistant and a PFSense firewall. \n\n\nI have an IP range set aside for IoT devices and my firewall blocks them from connecting to the internet.",
            "I had someone trying to how I would know when my load of wash was done if not through a push notification to an app running on my phone all the time. I told them \"mine beeps\"",
            ">What is the benefit?\n\nSo you can download the app and ~~sell your data~~ ~~give your data~~ get timely reminders when your load is done and when to buy more Tide ^TM",
            "There is ONE benefit. If you have e a time of use energy tariff then your washing machine can run itself at the cheapest time of day. This might only save you pennies per cycle but it does add up over time. \n\nMy main problem with this is most smart washing machines don’t even have this functionality!",
            ">Why on earth would my washing machine need Internet access?\n\nThe surveillance, metadata and advertising economies use convenience to get customers in the front door, while they're silently taking all of their shit and going out the back door to pawn to third parties.\n\nThey do it because it works. The vast majority of people really do get swayed by the novelty of push notifications for their dryer while they're at work.\n\nComputers got good enough to do the necessary things long ago. everything since then has just been dangling convenience features in front of people and monetizing their personal infomation.",
            "There's stuff you can do if you care about carbon emissions, where you set up your washer to run when the grid is relatively low-carbon. Not everybody cares about that but that information does need a connection.",
            "In it's defense, i use the wifi features a lot\n\n1. Downloading newer cycles optimized for certain types of clothing or bedding. My blankets feels cleaner on the downloaded blanket setting compared to standard wash\n\n2. Putting it in and having remote start enabled before i leave. Helps to start the laundry from outside so it's ready for drying when I'm back home\n\n3. Energy details, like i know how much my washer is pulling in different cycles",
            "I have a remote start for mine. I can set it on the machine or with the app. Or start it early on the app. Also tells me when a load is done if I’m away. If both washer and dryer are connected it takes the settings for what kind of load over to the dryer. \n\nNot a big deal but I do use the remote start a lot to start a load on my way home from work.",
            "Serious question, now you just do it manually in retrospect did the app a lot of value?",
            "Better yet, disconnect the smart TV from the internet as soon as you get it and run all your services through a roku stick/apple tv/ nvidia shield or even a mini pc. They only want you connected to the web to serve you ads.",
            "I wouldn't be throwing the brand Roku out there as a substitute for broken smart tvs. They are currently in a firestorm of controversy over their most recent update and how it permanently enabled unwanted options.",
            "I'm yet to see a smart tv fail because it didn't get an update.",
            "The latest Samsung phones are getting seven years of updates/security patches.",
            "That's BS. Design products that can be serviced by the user, publish docs on old products, and this becomes a non issue. \n\nHow small transistors are is irrelevant. The only reason you can't change out the processor or screen in a fridge is because they're designed to prevent you from doing that.",
            "To be fair his skill level and knowledge is pretty damn good, he's not exactly representative",
            "They do though. Locks also prevent dishonest people who don’t have the patience to break your lock.",
            "Stupid cornballing piece of...",
            "Theoretically you could have the microwave send a notification to your phone, and that would be *marginally* useful, but doesn't require an internet connection. Remotely controlling a microwave has basically no legitimate use cases. It's certainly not worth the extra $50-100. \n\nThe **real** use case is giving the company data on when and how you use your microwave, so they can show their investors they're getting \"big data\", so they can get more money, so they can integrate the next buzzword into their product.",
            "Niche but there are people with audio sensitivity disorder where being able to control a microwave from a different room would be a huge aid. But other than that I agree",
            "Seriously I **love** most tech but some of it is so silly. And have appliances with wifi even been a thing long enough for people that use them not to know how we survived before?",
            "Mine beeps but it’s in the garage so I can’t hear it from inside.",
            "That said I genuinely love that my apartment's laundry room has an app for non-coin payment (didn't take card either until they added the app hardware), and it has a built in timer of when my load is done, and in theory tells me if the washer/dryer are in use (that one only works when they're active, not when a neighbor hasn't gone to get their laundry for 3 hours).\n\nBut yeah, an in-home or in-apt one?  No app needed.",
            "Pfft my Samsung plays  Franz Schubert's, 'Die Forelle,' which is German for 'the trout' apparently.\nIt's yet to perform in concert with the  oven, fridge freezer and toaster though.",
            "Or set a timer",
            "To be fair as someone who can't stand sounds I love that I can just get a notification on my phone instead of the incessant ringing from something finishing.\n\nI know I have issues though. My bf hates that my phone is always on vibrate but having the notification sound makes me so anxious.",
            "Mine makes a really loud spinny noise for twenty minutes then goes quiet.",
            "So you can give the multi billion dollar corp a generous donation of your data and some helpful hints for targeted ads. Wouldn't want to deprive them.",
            "Do you know of a way to just find out for yourself? I work from home so I can just go start it if I know the best time",
            "It's often around the same time of day, just set a delay start if you're not able to start it then.  You'll still need to be around when it finishes to switch it over",
            "Oh that's a good thought, but I wonder if I can check that through the power company? I WFH so I can just go turn the washer on myself.",
            "Does your washing machine have a delayed start? Mine doesn't have any remote functions but I load and set it the night before and just set a delayed start for eight or nine hours so it's done when I wake up and I can hang it before work.",
            "I feel like the manufacturer should have just given you all the settings up front lol. \n\nI do see how number two would be handy if I didn't WFH though. And I'd enjoy #3 just cause it's neat. Not enough to deal with a washer like a spaceship though. Fortunately my washer is pretty new and my dryer seems to be eternal, so once I'm in a house again and get them out of storage (no hookups at current place) I can just continue to live in the dark ages for years to come lol.",
            "My first Roku broke after a year and a half. I contacted tech support, and they informed me the warranty was up and closed the ticket. IIRC, it would turn on, but it wouldn't connect. ",
            "I mean hence the similar to it\n\nApple tv, Nvidia shield, Chromecast whatever \n\nSecondary smart TV platform",
            "To be fair a crowbar works to open nearly any door or window and a moving company van (or a locksmith van) can keep neighbors eyes averted long enough for you to get in and out of a house. \n\nAlso, if I’m a thief or a cat burglar I’d be working on my craft. I bet most know hour to pitch a lock, it’s a skill of their trade. ",
            "I learnt how to pick a lock in like 10 minutes. A colleague bought a practice lock with transparent body and a very basic lockpick tool online to our workplace. Practice lock is constructed exactly like actual locks, it just has transparent body so you can see what you're doing. I did that, then done it again with covering the body, twice, to prove it's not coincidence all in the space of that 5-10 minutes. \n\n\nTo be fair, I had already known the mechanics of how to pick a lock as I had come across a few LockPickingLawyer videos, I'm not a regular viewer, but that's the first time I got my hands on actual lock picking tool. ",
            "Agreed.  Even super shitty locks will prevent people from crimes of opportunity.",
            "Windows don’t exist in your universe? Easy to break, can be done in places that are less likely to be seen, and can be fine fairly quietly. ",
            "¡Soy loco por Los Cornballs!",
            "Most microwaves you can turn the beeps off, it's usually just a specific series if button presses you need to find in the owners' manual.",
            "I had to run a tight washing machine schedule on time and suspected the machine needs longer than the timer says. Also it doesn't beep or I can't hear it.\nPerfect time to test my newly bought akku powered security cams and test their quality.\nI occasionally checked the cam to see when it was ready.\nI now know it takes about 10-15% longer than shown.\nAnd that's why I just set a timer accordingly on phone or clock. Nothing more.\nI don't want government or tech firm know/tell me when I fogot my laundry.",
            "Sometimes I set an alarm on my phone if I'm going to be outside or in the garage. Mine have approximate times for each cycle on a digital display. Makes it pretty easy.",
            "Oh yeah, I'm currently in an apartment with a portable washer so I have to take my blankets and towels to the Laundromat and I LOVE that app. It saves me a stop to get cash and means I can reasonably walk to the Laundromat and then get some more steps while the washer is running and still make sure I'm there when it's done. Not being forced to wait in the building is really great when you have to use a public one.",
            "I'd like to turn off the beeper on my machine. I don't need the beeping, I can see when the cycle is done (door lock indicator is off)",
            "You're paying with your personal data though. \n\nhttps://theconversation.com/smart-devices-spy-on-you-2-computer-scientists-explain-how-the-internet-of-things-can-violate-your-privacy-174579",
            "This is going to vary based on your country and energy provider. I have an app which shows the price for the next 24 hour period, I’m in the UK with octopus energy. \n\nThe regular cheapest time of day is usually either the middle of the night, due to low consumption, or early afternoon, due to solar. Again, that’ll depend on where you live.",
            "Depends on if you care about saving money (in which case it doesn't really matter unless you're on a time-of-use rate) or about reducing emissions, in which case it'll depend on where you are. You don't really need to get that information from the utility directly, since it'll be similar-ish between times of day so if you can just find some averages, especially averages by season, that's enough to be a good starting point.",
            "Yes, mine does",
            "Ad revenue is worth getting any way you thry can",
            "I've spent quite a bit of time messing around with lock picking and those transparent locks are really easy. They aren't built with the tolerances of a real lock and being able to do it seeing the tumblers makes repeat attempts much easier.\n\nI'm not saying picking a consumer grade lock isn't easy but they're all much harder than those practice locks.",
            "\"Ahh, a lock. Finally an opportunity to use my lockpicking kit I bought from covert instruments.\"",
            "\"You don't have to be faster than the bear; you just have to be faster than the guy next to you.\" Ultimately, all security isn't about keeping people out; it's about being a harder target.",
            "I think it's much easier to pick a lock than to climb 4 floors on outside walls and break my window.",
            "I have NFC cards for the usual settings for the washer/dryer and dishwasher so I start it and scan the card. Similar principle, and it makes it so easy!",
            "Thanks!",
            "I care about both. I'm not seeing much info through the Delmarva app. I'll probably try again when it's relevant though. Right now I'm in an apartment and my washer is in storage 😭",
            "And a locked smart lock is harder to open than an unlocked dumb lock. "
        ]
    },
    "LPT if you press and hold the spacebar during a YouTube video, it goes twice as fast... I have found this is a great way to get around the YouTubers voice over sponsor ad... And get back to the regular programming quicker...": {
        "title": "LPT if you press and hold the spacebar during a YouTube video, it goes twice as fast... I have found this is a great way to get around the YouTubers voice over sponsor ad... And get back to the regular programming quicker...",
        "score": 268,
        "url": "https://www.reddit.com/r/LifeProTips/comments/1dlo41q/lpt_if_you_press_and_hold_the_spacebar_during_a/",
        "content": "",
        "num_comments": 54,
        "comments": [
            "### This post has been marked as safe. Upvoting/downvoting this comment will have no effect.\n\n---\n\nHello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "I've always just tapped arrow key right 2-3 times. Most ad reads are 30sec to 1min.",
            "Or just install sponserblock?",
            "Or just install sponsor block.",
            "If you click and hold on the video it will do the same thing as well.\n\nI actually made a chrome extension to extend this functionality. While you are holding the click down, you can drag right for faster speeds, or drag left for slower speeds.\n\nIt also auto-skips all the ads for you, but personally I see the speed control as the main feature. I honestly can't watch videos without it now.\n\nHere's a 1 min [demo vid](https://www.youtube.com/watch?v=nX92I6gE-mA) and the [extension page](https://chrome.google.com/webstore/detail/lmcggcabhocpfkbddekmconplfjmmgmn) if anybody is interested. It's not monetized or anything just made it for fun",
            "In case somebody missed it: sponsorblock is the real solution here.",
            "Just use SponsorBlock and you don’t need to skip anything.",
            "I don't think some of you realize that OP is talking about the ads that Youtubers themselves are advertising.  \n\nBrave browser and plug-ins won't work because the Youtuber actually filmed themselves advertising their sponsor's product.\n\n\"Before we continue with so and so, I would like to thank my sponsor for today's video... Use my code to get __% off! And now, back to my video.\"",
            "Thanks. I didn't know what's the shortcut for pc. I knew it works on mobile when you long press on the video while it's playing.\nBut for the PC, I added a Chrome extension that marks the sections of sponsors and other annoying stuff like interaction reminders, and it lets you skip these parts manually or automatically.",
            "Also useful: press a number key to jump forward or back to the relevant percentage that number represents. Want to hit half way point? Press 5. Want to go ten percent in? Press 1",
            "THANK YOU SO MUCH ! I use scripts on Linux to manage my windows and jump between programs and I couldn’t figure out why this happened when losing focus on YouTube.. Now I know!",
            " What’s the equivalent of sponsor block for YouTube app on iPad and iPhone?\n\nEdit: I do have YouTube premium. Not worried about skipping ads but looking to skip past built in sponsor content",
            "I'm going to disagree here, if you have a keyboard, use the arrow keys to skip forward and backward.\n\nIf you're on mobile, double tap to the right to skip and double tap left to go back.\n\nIf you want to actually change playback speed just change it in the video settings.",
            "The real goats are the YouTubers who do in the in video ad, but have chapters in their videos so you can easily jus fast forward past it lol",
            "Just hit the L button on your keyboard 3 times for a 30 second ad, 6 times for a minute long ad or 12 times for a 2 minute long ad.\n\nL  skips forward 10 sec\nk pauses\nJ rewinds 10 sec",
            "Guys stop living under a rock. Install ublock origin",
            "LPT: go take a shit and it'll skip the sponsor segment.",
            "You know you can just scrub the video right?",
            "Does no one use the mouse? I just click ahead a bit and it’s sorted. One click. Watching at double speed still takes 30 seconds if they waffle on for a minute.",
            "The right Arrow key does it quicker",
            "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*",
            "Just sideload the app and be done with it",
            "Or just use Brave browser.",
            "This is the real way to actually skip them",
            "Pro tips always in the comments.",
            "Why isn't this the top comment? Instead the top comments are these crazy convoluted measures. I think people are just scared of it or something.\n\nPeople, with sponsorblock the video just plays normally and magically doesn't include the annoying parts. It flows so well I even sometimes forget my favorite channels have sponsored segments that it's jarring when one makes it through.",
            "Sponsor block, uBlock Origin and a few Tampermonkey scripts makes YouTube usable. No ads, no sponsors, no shorts or recommended playlists just videos and that's it.",
            "Use sponsorblock then",
            "Sponsorblock extension for browsers and mobile is the solution for this. It is community based where users have timestamped various types of annoyances, as well as higlights, Eg the actual meat of videos. You can set it to skip any type automatically or with a button press.",
            "Sideload uYou+",
            "What side loaded app gets around a section of the Youtuber's recording of the sponsored SurfShark advertisement?  Does it know when the Youtuber is temporarily changing topics?\n\nYou know, its one of those \"before I continue talking about today's video topic, let me tell you about today's sponsor\" and proceed to do the advertisement, then they finish it off with, \"use my code for __% off your subscription! And now, back to the video.\"\n\nThat's what OP was talking about.",
            "On a PC?",
            "Doesn't get you past baked in ad skits from the video itself, which is what OP is talking about.",
            "On its own is not a solution. Install Sponsorblock.",
            "use L, it skips 10s instead of 5",
            "Almost. But you're still thinking way too small, man. Just install an extension to block all that shit for you automatically for ever.",
            "Thanks , do you have a link for it please ?",
            "I used to not care about sponsor messages because they were relatively quick 20-30 seconds. Now they are sometimes getting to 5 minutes. \n\nWhy are you explaining a vpn to me for 5 minutes? I already have a vpn anyway. Mention it and move on, we all know what they do by now.",
            "There we go.  This is something different 👍",
            "Yeah. It really does. You can change the settings and I have mine to skip the intro and mid ads. Here you can see the green portion of the timeline being auto skipped. You are also prompted if you wish to go back. 1/20 is an error.\n\nUYou 3.0.4\n\nhttps://preview.redd.it/ouy2p5iea28d1.jpeg?width=1284&format=pjpg&auto=webp&s=0c36310b384e502469614be78c1ee13e893037d5",
            "chrome/firefox with sponsorblock extension",
            "Real ones use J and L and then have to use the arrow keys because they went too far by accident.",
            "You’re on the internet, just search for it",
            "Sure! https://sponsor.ajay.app/",
            "What browser are you using?",
            "What if I told you that you could watch Japanese Netflix without having to live in Japan?",
            "The only good sponsor messages over 5 minutes are those that LazerPig makes. ",
            "I'll definitely be looking this one up!  Thanks!",
            "Thank you kind stranger.",
            "NO WAY! \nTell me more!"
        ]
    },
    "LPT if you’re packing up a slice of cake in a piece of Tupperware, flip the container over and place the cake on the lid and use the container as the lid so it works like a cake display. Makes it easier to serve the cake later.": {
        "title": "LPT if you’re packing up a slice of cake in a piece of Tupperware, flip the container over and place the cake on the lid and use the container as the lid so it works like a cake display. Makes it easier to serve the cake later.",
        "score": 403,
        "url": "https://www.reddit.com/r/LifeProTips/comments/1dlkpzd/lpt_if_youre_packing_up_a_slice_of_cake_in_a/",
        "content": "Had friends/family over for a get together and a ton of left over cake.  I bought some containers knowing I would be sending cake home with guests.\n",
        "num_comments": 16,
        "comments": [
            "### This post has been marked as safe. Upvoting/downvoting this comment will have no effect.\n\n---\n\nHello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "I will eat cake regardless of how well it has travelled.",
            "Seconded, this is a good one, I've been doing this for a few years.",
            "*Proceeds to flip Tupperware back over out of habit* Fuck",
            "Don't know why I never thought of that. I always just end up with icing stuck to the lid.",
            "Upside down to-go cups work really well for single cupcakes, too.",
            "So simple, yet so useful!",
            "But - do you want someone cutting on your lid? Add parchment or wax paper to make it easier to transfer to a serving tray",
            "Don't you dare serve me a cake on a tupperware lid. I have standards.",
            "What is this tomfoolery, an actual useful LPT? BURN THE WITCH!",
            "This is why I internet",
            "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*",
            "This tip just made me shiver with joy 🤩 🥰😘",
            "![gif](giphy|V0IdVIIW1y5d6)",
            "For cake we lose all standards"
        ]
    },
    "LPT - Join social sports to make friends as an adult": {
        "title": "LPT - Join social sports to make friends as an adult",
        "score": 933,
        "url": "https://www.reddit.com/r/LifeProTips/comments/1dl9phe/lpt_join_social_sports_to_make_friends_as_an_adult/",
        "content": "Making friends as an adult can be awkward and challenging. Here is what helps,\n\n- Join social sports like Running, Trekking, Pickleball, Rock climbing, Bowling, Softball etc. \n\n- Join local meetup or community groups\n\n- Join a gym/exercise class\n\n- Volunteer ",
        "num_comments": 87,
        "comments": [
            "### This post has been marked as safe. Upvoting/downvoting this comment will have no effect.\n\n---\n\nHello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "I joined a recreational kickball league at the end of 2020, and it's been one of the best decisions of my adult life. I met my best friend there who was the captain of our team, I became co-captain, and through our team, we've met many new people. Our current friend group was formed through this league, and we regularly hang out outside of it. Our current team has been mostly the same members for a while now, but we occasionally bring on new free agents when people take seasons off or find a new direction in life, so we still meet fresh faces. The added benefit is you get some exercise as well.\n\nI know it's not easy for some to just sign up for activities and go meet new people, but the juice is worth the squeeze. My friends and I always agree that joining our kickball league was one of the best decisions we've individually made for our social lives.",
            "https://preview.redd.it/0mnh39bduz7d1.jpeg?width=2160&format=pjpg&auto=webp&s=fa5f879e822f511331dda722cb997dd9f304aa40\n\nBe cautious picking soccer, lol! Definitely worth the friends I made though",
            "Disc golf is another good one",
            "For those living in certain areas , Volo is an app that helps you with this. You can join “leagues” for certain sports or there’s just scheduled activities in general. They do cost money however, and I’m not sure how many areas it’s in.",
            "The key is to also join the post-activity socials. You will meet people by doing the activity, but not necessarily befriend them. Having some downtime where the activity isn't the current focus is where the friendship is built. ",
            "Cycling clubs are great.   There are generally a lot of varieties - road cyclists, trail cyclists, touring groups, mountain cycling clubs, racing, etc. \n\nI belong to several which I would call, “Eating clubs with a cycling problem”.   These clubs go out for rides on a regular basis, followed by lunch/beers at a local restaurant.",
            "Sand volleyball is the one that got me. Can definitely recommend",
            "Jiu jitsu would be fastest friend making place. All backgrounds",
            "Show up. Make a couple nice comments. Be a good time, people will like you",
            "I’d love to find and join a movie and film club.",
            "Adult ed classes in general",
            "Only do this if you are athletic to begin with. If you suck, no one wants you on their team, trust me.",
            "How do you find them to begin with?",
            "Gym is really good suggestion? I hardly see people talking to anyone. Everyone wears their headset and minds their own business. It’s rare to see people interacting with others u less they already know them before. There are many days I finish my whole workout without saying a word to anyone.",
            "Bouldering is perfect for meeting people.\n\nBetween climbs people are always chatting about their routes and how to handle a climb. It’s actually encouraged to interact with strangers in the gyms",
            "Tried this. Got into a bowling league. Everyone stayed in their friend group they signed up with and didn’t talk to anyone else. This advice is shit",
            "Yea this feels like the best way to meet new people who have something in common with you.\n\nIf anyone reading this lives in Toronto and is looking for new friends. We have a get active discord, dm for an invite (:",
            "I never thought about this being a LPT. I met my friends in the last city I lived in because I joined an ultimate frisbee meetup after meeting one of the members at a hiking meetup. Good tip!",
            "I’m looking for a good stitch-n-bit** at the library or community centre. Very unathletic and noncompetative",
            "only a couple of issues with that plan:\n\n1 - sports\n\n2- people",
            "Absolutely, I had trouble making friends outside work ever since moving for university. I joined a local football (soccer) league and met up with some of the guys on Sundays for pickup games and we’ve been friends for years. Meeting up for drinks, smoking weed, etc",
            "Basically everyone I (44m) hang out with is someone I met through swing dance. I can go to any major city and find a dance event, and instantly have a place to meet people. It's one of the best life skills I've learned.",
            "Adding to this sailing and any sort of art collective in your town (ceramics studio, painting, woodworking, metal, glass, etc. )",
            "Jiu Jitsu helped me socially when I moved to NYC not knowing anyone.",
            "Me trying to figure out how you guys even have time for these things when everyone I know is working overtime or two jobs just to survive. I literally have no energy after working and my legs cannot handle standing anymore after standing for 8 hours...",
            "Rugby. Obviously not for everyone, but it has the best sports culture of them all.\n\n\nEdit: I should add that almost every major city has a club that is totally open to newcomers.",
            "LPT: Drink water to stay hydrated.",
            "recommend - late 20’s couple now settled in our area, recently joined a 11aside women’s team that started from a random 5 aside league with girls that shared a common interest…training sessions and socials help both me and my partner",
            "If you have kids, joining a weekend sport like soccer, little league baseball, basketball, etc. is another way to make new friends. You see them regularly and there's no pressure to socialize if you don't really want to but if you hit things off it's great.",
            "This is a great tip. The meetup app is a good place to start. FB groups in your local area too",
            "Ultimate frisbee is a great social sport! Most areas have pick up and leagues that are usually very beginner friendly!",
            "Disc golf. I’ve made over 100 friends from disc golf. It’s the perfect activity to make friends. Especially if you participate in weekly competitions.",
            "Pin this post to share with the \"I have no friends and I feel stuck\" posts",
            "I volunteer at an animal shelter and I am involved in my church.  I have made the best friends from both groups.",
            "I tried bouldering and cycling and thought most of the people were douchey. Reminded me of skaters back in HS. Not super welcoming, and they'll do the project/ trick you're working on in front of you as a flex. Didn't exactly make friends, more like acquitances. Maybe cause I'm a male? I'm sure my experience would have been different if I were a girl. They got more attention and friendly advice depending on their attractiveness. People suck around here. I'm in SoCal",
            "Under the blanket of “community group”, I’d mention church. In smaller towns where I don’t have access to most of these other options, it has been a great place for me socially.",
            "If you're not afraid of a little contact, your local rugby club is a great place to meet folks from all walks and make friends that'll have your back when you need it.",
            "Met my wife of now 20 years at a sport and social club.  Just had our youngest graduate HS.  YMMV",
            "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*",
            "Have you met other adults though? I've found that it is exponentially more difficult to make friends as an adult if you are an intellectual because we are a minority. Just so many dumb as rocks people out there that you get tired of either correcting them all the time or having to placate their fragile egos.",
            "That's wonderful. Sounds like a fun group, enjoy!",
            "You sound like the captain for my team lol\n\nAgree 10 fold",
            "Just dislocated both forearm bones falling backwards but yeah, worth it for the friendships made lol",
            "Yup been there twice lol certainly not 18 anymore!",
            "Friend's wife played in highschool. Decided to join an adult league for fun. First game, playing goalie, she got kicked in the head. Concussion and the end of her season.",
            "Very generous of you to give away Free Feet",
            "Just started a few weeks ago I’m in love",
            "I was about to say this! Been lucky enough to have met a solid group of people over the last few years I’ve been playing and it’s been really nice being social while doing something that keeps my mind busy.",
            "Came here to say this! I have made so many friends through the sport",
            "Nice. Will try sometime. Thanks for sharing.",
            "I work as a host part time and get to play in leagues for free! Saves me thousands a year",
            "+1",
            "Yup any kind of martial art I’ve found. There’s really something about hitting someone repeatedly that just takes the edge off",
            "I started this last year and while I haven’t made any “friends” that I’m trying to hang out with outside of training it’s nice to get some buddied that’s you’re stoked to see and train with.",
            "Be there reliably ",
            "You could start one. \n\n\nI'm definitely not very outgoing but while I was in a university town I was able to start a group on fb to organize pickup soccer that way out-grew me.",
            "Love my cardio kickboxing classes at our local community college.   It’s a loose group with lots of different capabilities and it’s an absolute great way to get/stay in shape.",
            "If a group takes it THAT seriously I wouldn’t even want to join",
            "You meet them at the thing ",
            "Yes, I've heard a lot of stories where people made friends Bouldering.",
            "3- disabled",
            "Genius. Thanks for sharing it. \n\nYou sure know how to make friends...",
            "I was warned away from joining cycling groups for exactly what you describe. So it probably is a thing.",
            "Maybe you're just not fun to be around. Always making things about gender, and blaming other people.",
            "Read that again, honey. Might help you with developing some self awareness.",
            "Many. Mainly because I'm here to make friends and other I'm kind of a person who ALWAYS 'looks for positive' in things and in people.",
            "Is your team's name Sour Patch Kicks? 😉",
            "Ouch, sorry to hear that! Hope you recover quickly.\n\nI have to ask. Is your mom around to help?",
            "Oh no, that's rough. Funny enough, two weeks before a torn ACL, I got a concussion playing goalie. The block with my face saved the game though!",
            "Anytime",
            "What’s her name ",
            "Low barrier for entry, can grab some used discs for like $5-6 and most courses are free to play",
            "Honestly, depending on your area, more seasoned players often have too many discs they don’t throw anymore and are happy to give them away to a newer player.",
            "No I mean like how do I find adult soccer for example?",
            "He’s the guy keeping everyone hydrated at social gatherings, of course he makes friends easily.",
            "Lol, good one! You know I'm right. Girls have more support and get more attention than guys. It's not rocket science. Just stating facts",
            "Self-awareness is strong. I give people the benefit of the doubt and then, once they feel comfortable, they bring up some conspiracy theory or they support Trump or say some dumb shit that is impossible to ignore. I wish it were me because then I could make some changes, but, it isn't.",
            "He started a few weeks ago so the name is probably Star Destroyer.",
            "Did you just assume gender??",
            "Look up adult soccer leagues in whatever city or town u live in ?",
            "Waterboys are universally adored.",
            "Stop talking to Trump people about politics, talk about something else. Also, how you decide to be affected by someone else’s point of view is absolutely on you. I advise practicing finding alternate things to talk about when you have difference in opinions, especially political. I also would advise you to not lead with political conversations when trying to cultivate friendships. Current political climate has made it a much larger part of our personality than it should be. Politics is important, but it shouldn’t define our ability to get along with each other.",
            "Mine's Valkyrie ❤️"
        ]
    },
    "LPT - the first pancake is not the problem, your pan is not hot enough": {
        "title": "LPT - the first pancake is not the problem, your pan is not hot enough",
        "score": 2866,
        "url": "https://www.reddit.com/r/LifeProTips/comments/1dl03pk/lpt_the_first_pancake_is_not_the_problem_your_pan/",
        "content": "A lot of people say the first pancake/crepe is always a reject. The pancake is not the problem, your pan is not hot enough.   \n  \nHeat up the pan properly. Enjoy the first pancake.  ",
        "num_comments": 253,
        "comments": [
            "### This post has been marked as safe. Upvoting/downvoting this comment will have no effect.\n\n---\n\nHello and welcome to r/LifeProTips!\n\nPlease help us decide if this post is a good fit for the subreddit by upvoting or downvoting this comment.\n\nIf you think that this is great advice to improve your life, please upvote. If you think this doesn't help you in any way, please downvote. If you don't care, leave it for the others to decide.",
            "My problem is that the pan is usually too hot for the first one. Takes a couple to dial in all the variables.",
            "I wet my hand and flick water on the pan to test the temp. If the water dances, it’s time to pancake.",
            "In my experience, the first pancake is actually the best one.",
            "It’s not much of a tip tho is it if you don’t explain how to properly heat the pan",
            "No. The pan requires its sacrifice. Pancake for pan god",
            "You overestimate both my patience for pan heating and my standards for pancakes. The first pancake is the best because it is ready first. Joking thanks for the tip.",
            "I use an IR thermometer in my kitchen every day. For pancakes I get my cast iron up to 375 then lower it a bit",
            "The number of people that don't preheat their cookware and ruin food as a result is too damn high.",
            "The first pancake is my gauge to see if I need to dial the heat down. It's still good, but might be a bit more cooked than the others.",
            "Saw an article on this. The first pancake evens up the temp. You can get a similar effect by sprinkling the hot pan or griddle with water before the first pancake. Ideally, you do this anyway to check if it’s hot enough; just use a bit more.",
            "Get yourself a cheap laser thermometer off Amazon, and use it to measure your pan until it’s around 300-330F and use butter instead of oil",
            "LPT: if you're cooking pancakes just tell people the first one is garbage, that way you get to eat the first one while they're all waiting",
            "I would also like to point out that pancake batter produces better pancakes if it's allowed to \"rest\" a bit before using. I worked in a restaurant some years ago, and the pancake batter was always one of the first things made, in a large batch, so that it would (and could, for service) rest a bit before using. At home, I usually make the batter and let it sit while I'm frying bacon or cooking sausage (about 15-20 minutes). My first pancake is great every time.",
            "The first cake is the deepest ",
            "If you immediately know the candle light is fire then the meal was cooked a long time ago.",
            "Hm. Set burner on 4, place pan, PAM pan, wait abt 7-8 min. Pour batter. Works every time. Not rocket science methinks.",
            "Why are you monsters using oil to cook pancakes instead of butter?",
            "You also have too much oil.",
            "Omg this makes me think of the show Review on Comedy Central! Review eating 40 pancakes. Ends up being rated lower than divorce before eating 80 more. Funny stuff.",
            "The best pancakes I make are on medium heat with butter or oil spread with a paper towel.",
            "Stop holding pans to impossible beauty standards.",
            "I though this was just a metaphor for failing and trying again lol",
            "And if you are making a second batch, turn DOWN the heat! Lot of people make that mistake.",
            "Usually it’s a reject because we don’t watch it closely enough and it teaches us a lesson, in my adhd household at least",
            "[Introducing LPT REQUEST FRIDAYS](https://www.reddit.com/r/LifeProTips/comments/16w0n2s/introducing_request_post_fridays/)\n\nWe determine \"Friday\" as beginning at 12am Eastern Time (EST: UTC/GMT -5, EDT: UTC/GMT -4)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LifeProTips) if you have any questions or concerns.*",
            "I have great success with pancakes. I test the temperature by getting my fingers wet and flicking drops onto the griddle. If it sizzles, it's hot enough.\n\nedit: I'm keeping the idiom though.",
            "Maybe the issue isn't the pan being hot enough, and it's the pan taking it's sweet ass time heating up.",
            "I gave up with the pan on a gas stove, we use an electric griddle now and they’re all beautiful",
            "I used to try to make pancakes but had this and other problems.  So I bought a waffle iron, took away all the guesswork and I enjoy it as much as a good pancake.",
            "My first pancake always ends up looking like Shrek but I just eat it anyway",
            "Just put a tiny amount of batter in the pan when you think it’s hot enough and if it comes out like a mini pancake you’re good to go",
            "Every pancake can be just right if you've got a $15 infrared thermometer.",
            "But if we as a society start to get it right, I can no longer use \"you always throw out the first pancake\" as an idiom to mean \"you'll never be perfect at something the first time you try\"",
            "You make a bold assumption that I don't enjoy the reject pancake. The only bad pancake is burned pancake, and if you add enough syrup, it's still an okay pancake.",
            "That's funny. My first pancake is always the best of the batch.",
            "I've only ever said this in regards to my older brother.",
            "My first one always comes out the best. I can't nail down the timing on any of the subsequent ones",
            "My first one is usually the best and then I get diminishing returns afterwards.",
            "As s pansexual, I think the pan is hot",
            "First pancake goes to the hen that laid the egg for it",
            "Another tip for perfect pancakes on top of this one, put your oil/grease etc onto a paper towel and apply evenly to the pan. Perfectly browned, no spots.",
            "Thank you, I've been saying this for years! I put the pan on the stove before I even start making the batter. Oh, and the secret to making batter without lumps is to start with very little milk (but all the eggs) and wisk it while it's thick, like cupcake batter. The friction will tear all the lumps apart in just a few seconds. Then gently keep adding milk until it's thin enough. ",
            "No one does a test pancake? Make a half dollar sized one as a test.",
            "I make the first pancake extra tiny to get the ‘bad one’ out the way",
            "Is a \"cold\" pan really why all my pancakes lack fluff and come out with the texture of a rubber shoe sole?",
            "Very true. This is why you need a kitchen thermometer. I have three: one for making candy, one for puncture or immersion (pointy tip), and one with the gun grip and nifty laser pointer. I use the latter for checking my pan temperature when making pancakes.",
            "Get a big outdoor griddle. I have a 36 inch Blackstone. Cook a pound of bacon first, get it nice and greasy, then do the pancakes, you'll get them all done in one or two batches.",
            "If it's hot enough for the first one, it's too hot for the next ones.",
            "The timing of this popping on my feed is magical.   I was just wondering why the pancakes I made this morning weren't perfect.  Frustrating morning.",
            "Are y'all not cooking sausage in the pan/on the griddle first to make sure it's greased up? Pancakes don't even hit the surface till the sausage is at least on it's flip side.",
            "Why does the first pancake need butter and come out like shit but all subsequent pancakes you don't need butter and turn out fine lol",
            "BPT: Breakfast Pro Tip",
            "The first one is usually the problem one because its the one you use to calibrate readjust everything. It’s intentional if not unintentional\n\nAdd more flour, add more water, stir more, lower the heat, raise the heat",
            "Oh, duh that makes sense. I always wondered why the first one was shit. IDK what I thought, but it wasn't as obvious as this. I'm oblivious to the obvious.",
            "The only way to enjoy the first pancake is for it to be a mess, so you have a proper excuse to eat it immediately",
            "you have no idea how many pancakes i have destroyed :(",
            "Thank you! Always struggle with that one",
            "If your pancakes are all bubbly and dark brown, your pan is too hot. They shouldn't look like they've been fried to hell. Use some patience and cook them on medium-high. The trick is that they should mostly cook on the first side and you'll know when to flip them because the edges will turn translucent then you'll start seeing bubbles across the pancake. Once that happens, it's time to flip for a short time just to brown the second side. It should only take a minute. If it splats when you flip it, you need to wait a little longer.\n\nEnjoy your fluffy, not burned, un-pockmarked, golden pancakes.",
            "Took me far too many years to figure this out.",
            "But then what's the dog supposed to eat? Le premier est pour le chien.",
            "My first pancake always burns, your LPT is not helpful",
            "As one of six kids… we call our oldest brother the first pancake cos he’s a little fucked up 😂😂😂",
            "only time i’ve ever burnt pancakes is when i actually preheated the griddle lol",
            "For me it's the 2nd one which I sometimes burn because I forget to turn it down a notch",
            "Not the pan, the batter. The baking soda in the batter needs time to properly react with the liquid ingredients to produce enough air bubbles to make a fluffy pancake.\n\nAfter you mix up the batter, set it aside for 5-10 minutes to let the baking soda activate.\n\nFor extra fluffy pancake add a little lemon juice to the batter. The acid will react more with the baking soda and produce a lot of air bubbles.",
            "Or the heat isn't spread around enough (if you're using an electric griddle), or it's too hot as others have noted. I also use the first couple to make sure the flavors are good, so cook quality isn't as important.",
            "I rarely even get to the first pancake 😔",
            "The first pancake is mine.  Nothing to do with the pan.",
            "Marriage is like pancakes.\n\nIt’s fine to throw that first one out.",
            "I keep an infrared thermometer gun in the kitchen drawer and I check pan temp all the time.",
            "The first pancake is a sacrifice. This is the ritual of pancakes.",
            "I’m just not prepared to give the metaphor up. How else would we insult the oldest sibling?",
            "The first pancake will tell you if the pan isn't hot enough but also:\nIf the batter needs more flour, butter, liquid, egg etc.. depending on how the batter reacts to being poured and it's consistency.",
            "I loooove the first pancake - - so buttery and delicious! We have a rule in my house rgsg the chef gets the first one because everyone wants it!",
            "My problem is that only the first one is perfect, the pan keeps getting hotter after each one",
            "I've changed my family recipe - added extra eggs. It goes: 500 ml milk, 200g flour, 40g sugar, a dash of salt and 1-2 eggs, depending on their size. Googling recipes on Russian bliny, I've discovered three medium-sized eggs were recommended, I did it and now even the first pancake is perfect.",
            "I enjoy the first pancake either way. But it's hard to know if you have the correct temperature until you've placed the first pancake. It let's you know if the pan is too hot/cold and if you've used too much butter.\n\n\n\n\nAlso, this isn't a life pro tip. Everyone that has ever cooked pancakes knows this and the reasoning behind this.",
            "Do people not know the leidenfrost test? Just sprinkle some water on it from your fingers and if it beads up, it's hot",
            "Hot pan, cold oil.",
            "Thank you! This is so true.",
            "Step 1. Pan nice and hot. \nStep 2. In with the canola oil. \nStep 3. Wipe oil carefully with kitchen paper. \nStep 4. Add 1st pancake with new canola oil.",
            "Equipped with this knowledge I’m now ready to conquer the world",
            "That messed up first pancake gives me confidence and a guaranteed yummy leftover that everyone else leaves behind. If it ain’t broke.",
            "My first one is usually the best. Comes out looking just right and the rest come out black",
            "Huh?  It's because the pan is TOO hot.",
            "The first batch of pancakes is by far the best. Y'all aren't using nearly enough butter.",
            "Eh, I mean it's moreso just that the first pancake is a test of if the pan is too hot/too cold to begin with.\n\nNot everyone is some magical expert at getting the pan to the exact perfect temperature every time lol, so it's totally fine and normal to have the first pancake not turn out perfect, and then make the adjustment and have the rest turn out okay.",
            "Yeah this is usually my issue, this is horrible advice for me lmao",
            "Yepp its either too hot or too cold, then it finds its equilibrium and they become perfect",
            "Laser thermometer fixes that. 375F on the cast iron is perfect for pancakes.",
            "get the pan hot but then cool it down just a bit by boiling off a bit of water and lowering the temp a touch if the water boils off too violently.  then make your pancake.",
            "This is why I start at a lower heat and then turn it up. On my stove I start on a 4 and turn it up to a 6 when batter hits the pan.",
            "Yeah, I don't think anyone *actually* thinks the issue is with the pancake itself, not the pan's heat",
            "My work around is to pour a half dollar sized one to check the pan. By the time I’m done with that one the pan is ready",
            "Heat Pan\nGet butter straight from fridge and put desired amount in pan\nmelt butter but don't let it start sizzling or brown (the best you can)\nOnce melted, add pancake batter\n\nIf the butter melts lightning fast, decrease heat a bit\nif it melts really damn slow, increase a bit",
            "Heat up the pan then drop a little water on it.  The water should move and bounce around like it's ice skating.  If it instantly evaporates it's too hot, if it just sits there it's too cold.  \n\nOnce you warm up the pan, get some butter on a paper towel and buff it into the pan like you're waxing your car.  This way you'll get those nice uniform brown pancakes.",
            "A cheap IR thermometer solved this issue for me.  Perfect first pancake every time now.",
            "I marked the dial where I use it most commonly and start from there.",
            "It’s confusing to me that people don’t know their stoves well enough to set the desired temperature. You use the same setting every time you make the same dish after all. Or are people just winging it every time they cook?",
            "OP is right, you have to set the correct heat that you could in theory make \"infinite\" pancakes on without needing to change temperature, then *wait* for the pan to get to that temperature before starting. The impatience of setting the heat too high, then backing it off is why they come out all wonky. \n\nPancakes are dead simple if you're doing it on the same equipment each time.",
            "Yeah, this is sometimes an issue when you make pancake!",
            "Infrared heat gun on Amazon is like $20USD and is a game changer for skillets/pizza ovens/frying pans when temps are important (always)",
            "Yeah. But i think i mastered how to go about it\n\nSo what i do is, i get the pan as hot as a non stick can go. Then i have a bowl with ice water and paper towel folder and dunked in that.\n\nWhen the pan is rippppping hot, a tongs to hold the paper and circular motion on the pan until it stops sizzling\n\nThen heat till it's dry, spray on pan, and pour in the batter\n\nPerfect even brown beauties everytime",
            "This is the real LPT on the subject.",
            "Leidenfrost effect. This also lets you know when stainless steel pans are ready.",
            "I drop a dot of batter to see if it instantly firms up",
            "I thought everyone does this but apparently not.",
            "This is how they taught us in Culinary School",
            "It’s pancaking time.",
            "Water?!?!?",
            "It soaks up the butter!",
            "The first pancake gets shoved into my mouth whole while my breakfast guests can't see me.  So it's the best yes.",
            "My grandmother always, always, always gave me the first pancake. This was a woman who was taught, lived, and breathed the rhetoric that the man of the house gets the biggest piece of chicken and the first and last piece of cake. Pancakes are my second favorite food so this was always a special little wink between us.\n\nWhen she started declining, I had been on the opposite coast for almost a decade. When I'd visit, I'd take her to all of her appointments and favorite restaurants. Her oldest son (my dad) lived literally across the street in a house that she had bought but completely neglected her.\n\nOne time while she went to use the restroom, her doctor pulled me aside and told me he could always tell when I was in town because all of her vitals and general mood would improve so much.\n\nShe offered, towards the end, to teach me how to make her pancakes but I realized how much she would perk up when I would ask her to make her amazing pancakes for me and that she needed to be needed and valued.\n\nI still make the world's shittiest pancakes, but the first one always makes me smile.",
            "If the pan is hot enough, yes it is. Especially in a cast iron.",
            "Same here! My second batch is my correction batch if it starts getting too burny too quick",
            "Agreed. All the other ones after the first one get placed low in the stack.",
            "Mine too!",
            "Right? I was wondering what felt off about it. All I thought was ok? This just sounds like an opinion",
            "LPT: Don’t do stuff the wrong way",
            "I don't know if this is the best way but I always get a couple of fingers wet and then fling a few drops onto the pan.  If it sizzles, it's hot enough.",
            "infrared thermometer is the simple way.\n\nit also doubles as a laser toy if you have a playful cat.",
            "Step 1: set the pan on the hob\n\nStep 2: turn on the hob",
            "LPT: Heat things up to cook them.",
            "You keep it on the heat longer. It's not complicated.",
            "It's not hot enough",
            "surface should be around 375-400F, use an IR thermometer.",
            "I use my stove to heat my pans, usually.",
            "That's the whole point of the first pancake.\n\nSet the heat, wait, make first pancake, adjust.",
            "This is the way.",
            "People don’t understand that it isn’t just about adjusting cooking time - it’s about which actual reactions are happening and when. If you cook stuff too cool, it’ll set on the inside but be undercooked on the outside. It will be dry.\n\nIt’s also about consistency. When you preheat all the way up to temperature, it means your food cooks the exact same way every time, which gives you a chance to build up skill and experience. If you don’t preheat, you’re always winging it, you won’t achieve consistency, you won’t improve anywhere near what you could with a little patience.",
            "I’ve found the main issue with this is actually the oil/butter. You think you need it nice and slick to release the batter, but in reality there’s oil in the batter so when the oily batter meets the oily pan it just quickly burns. The first pancake lifts that oil layer off the pan so the next one doesn’t have the same issue. \n\nNext time put a tiny amount of oil in the pan and once it’s warm wipe it off with a paper towel so there’s only a slight residue and the pan is almost dry. I bet your first pancake will be better regardless of how perfect your temp is.",
            "You can tell how hot the pan is based on what the butter is doing. ",
            "Yep, an inexpensive temp gun takes out a lot of guesswork and improves consistency for all your cooking.",
            "*Infrared Thermometer",
            "Personally I find 375-400F to be perfect.",
            "This is the correct answer. \n\nYou can preheat correctly every time, but you will still have issues if you don't let the batter rest. \n\nBesides, nobody makes pancakes without preheating lol",
            "Butter burns at too low of a heat, and to me the perfect pancake shouldn't be cooked in any oil/butter anyway. \n\n\nAdd the butter after it's done. The oils actually degrade the quality of the exterior if they're used directly in the pan",
            "I use nothing. Just a non-stick pan. Gives that super uniform brown color with no spots.",
            "Bacon grease is the best thing to use for pancakes.",
            "OIL???",
            "a bit of extra olive oil is how I get a nice crust on the pancakes, its delicious",
            "Great show and Andy Daly should be a household name",
            "Ironically enough because the pan is probably too hot for those. OP's advice is garbage.",
            "OP apparently thinks that people believe in some kind of first pancake voodoo magic. Like no shit it's about the pan temp, and usually you don't care that every pancake is absolutely perfect, so you use the first one to dial it in instead of busting out a laser thermometer for one of the simplest and cheapest meals you can make.",
            "If your pan passes that test, it is way to hot for pancakes",
            "I came here to say this. I've been eating pancakes this way for my life.",
            "Wait are you giving advice? Or are you saying cold oil is a problem?",
            "This sub usually is now adays, all the true LPT's are all bured in top/All time.\n\nHow many daily posts since 2005 can there be until things start rehashing or just silly/stupid advice gets posted, let alone profound ones.",
            "Get your hand wet and flick drops on the pan. When the drops sizzle, it is hot enough. If they instantly evaporate, too hot.",
            "Fahrenheit \n\n#Laughs in Celsius\n\nEdit: apparently this joke fell flat. I can honestly say I’ve never measured the temperature of a frying pan. \n\nCooked meat yes - frying pan: not so much.",
            "It’s not a “laser” thermometer. It’s infrared temperature sensor; the laser just makes aiming it easier.\n\nAlso it’ll be reading the air coming off the pan, so it’s not exactly reading the pans temperature.",
            "Not that simple. Pancakes are a heatsink. The ideal temperature set point on the dial changes depending on how big and how many pancakes you are cooking at once. \nYou could make the perfect half dollar pancake, but the temp will be too low for a larger pancake. Opposite is also true. You could burn the small trial one and think your pan is too hot, when it's actually the perfect set point.\n\nIt's all about timing and heat loss.",
            "Americans will use anything but the metric system, but it's the first time I see \"half dollar sized\" 😂",
            "What would be the ideal temperature for the pan?",
            "No. Certain things I have it dialed in like that. Things that I make daily like fried eggs and quesadillas for the kiddos. Pancakes are like a few times a year. Sometimes I use my stove. Sometimes it's on a griddle. There's just not enough repetition on pancakes for me.",
            "I think there’s a little more variability with a gas stove.\n\nIt takes a bit of fine tuning each time to get it just right.",
            "There's even a comment specifically saying its too hot when this happens. Another talking about getting a non-stick pan \"ripping hot\" - everyone's lost their minds.",
            "I put more butter in the pan between cakes.",
            "It soaks up all the teflon in my case",
            "It soaks up the bacon grease, next one only gets butter.",
            "You guys put butter in the pan with pancakes?\n\nNo wonder people are so fat.",
            "That \"one\" belongs to my youngest.",
            "You should check if your pan hot enough",
            "I'm not as obsessed with cast iron as a lot of people are (I use them, but only sometimes) but for pancakes, cast iron is the objectively superior tool. A++ 👌",
            "Like the “tip” identifies the problem and then offers no solution other than “do it right next time”",
            "Sizzles, and the drops kinda \"dance\" on the surface of the pan (Leidenfrost effect).",
            "NGL you had me in the first half lol but thank you the real LPT is always in the comments",
            "Buy once cry once",
            "And then your first pancake sucks because the pan is too hot. There's no tip here; it's an observation that the first pancake usually isn't great because the pan needs to be at the right temperature. \n\nOnce you've sacrificed the first pancake to find out how close the pan is to that temperature (in either direction) it's easy to dial in. Supposedly, OP wants a different method (to avoid sacrificing the first pancake) but doesn’t actually give one.",
            "Totally agree. For that perfect pancake exterior, you want just pan and batter, essentially",
            "That first one is still my test. I don't put much butter anyway exactly because they are better when there is barely any.",
            "Yes, my bad lol",
            "Maybe they 'brown' their meat before preheating too...",
            "![gif](giphy|F3G8ymQkOkbII)",
            "Or butter, in the pan.",
            "Yuck, olive oil is nu good with pancakes. (My opinion)\n\nJust microwave some butter and use a basting brush to apply it to your pan. \nMy silicone basting brush magically applies just the right amount of butter. I use a cast iron pan next to a Teflon pan and it puts way less butter on the Teflon. ",
            "This is the rule of thumb and i find it works pretty well for me",
            "Depends on the type of pancake. Works great with Northern European pancakes",
            "Not the person who commented, but advice. Once the pan is hot enough add the cold oil and the food sticks less to the pan. Do it the other way and everything will stick more.",
            "What the other guy said :)",
            "Have you not heard the old adage, “the real LPT is always in the comments”?",
            "Could you translate this into English for me? Thank you.",
            "And if they float around like frictionless beads, then it's WAY too hot",
            "I don't get the joke",
            "What a weird thing to focus in on rather than the point of using an infrared thermometer to get a pan exactly as hot as it needs to be?\n\nThey can easily flip between C and F anyway just by pressing a button anyway.\n\nOh, sorry, I just realized you were trying to feel superior, not add to the conversation.",
            "Fahrenheit is more precise if you use whole numbers only.",
            "Why wouldn't it be reading the pan's temperature? Air is transparent to infrared and cast iron isn't super reflective like stainless steel.",
            "It’s just to keep people from rushing and letting the pan heat up",
            "If it helps it make more sense, a half-dollar/50 cent piece is a large coin, bigger than a quarter. It’s not like saying half the size of a dollar bill.",
            "Are you getting out the scale for each pancake?",
            "I start cooking when the pan is between 350-375 in mulitple spots between the centre and outside edges.   I use lodge cast iron griddle pans, I heat them slowly so that the heat can spread evenly.",
            "That’s fair. I think I’m realizing I make pancakes more than the average person lol",
            "Poetry",
            "Damn right you do.",
            "If I didn't, I'd have pancake stuck to my pan and ruin my breakfast lol.",
            "I do it between flips. Curse your arteries.",
            "You can put butter between my cakes, big boy ",
            "Ah shit. Game changer.",
            "That’s what he said.",
            "This sounds great in theory, but to me it actually creates a far less appealing exterior for the pancakes. And I don't think anything is lost by just putting it on after they're done\n\n\nI also feel like the pan should probably be too hot for butter to cook them right",
            "I haven't used non-stick in decades.  For pancakes, cast iron flat top is perfect.",
            "I've used every kind of pan, griddle, great source, temperature, sifting ingredients, recipes, etc. I just can't get a good pancake to save my life.\n\nI got closer than ever on my last batch two weeks ago and  realized I've actually been needing to turn my heat down a couple clicks. \n\nIt's the ONE thing I just can't seem to cook right.",
            ">“Add more heat, unless there’s too much heat. Then add less”\n\nIdk what ppl expect out of OP. They’re likely using a wildly different stovetop and pan than you are. How are they supposed to give you those instructions?\n\nIf it’s not working for you, try not pouring in a full pancake on the first one. Pour a mini pancake and you’ll be able to see if you need to turn up the heat or let the pan cool.",
            "Hot enough for the leidenfrost effect is usually too hot for pancakes",
            "To be fair they do come with a free laser pointer. Just make sure your cat can’t see it when you are measuring the temp of a skillet.",
            "Oh I put butter on them too!\n\nAlways get compliments on the pancakes, they have a nice golden crust and then I put butter in between each when serving them.  I use a room temp dish so it spreads easy.\n\nThe key is like OP says to get the pan and oil nice and hot.  Then fry the pancake to nice a golden brown and its great.\n\nUsing stainless pans over here",
            "You make pancakes at almost 200 C / 400 F?",
            "Awesome, I'm gonna go make some cheddar cheese blueberry pancakes now. Thank you.",
            "Ah yes, I believe that quote originated from Aristotle",
            "I think he’s saying that we ran out of LPTs a while ago. Now there is reposting and crap. See all time top posts for real LPTs.",
            "Is English not your first language? Just wondering",
            "Nah - that's the leidenfrost effect, happens at about 380F.  It's cooler than the temp when dropleta instantly boil off.\n\nIt's the temp I look for when cooking my pancakes.",
            "what if they detonate with a small fireball upon contact and cause pitting on the bottom?",
            "There isn't, they just wanted to laugh at Fahrenheit for some reason. It only really works when imperial measurements are confusing, though (like conversions or talking about the degree water freezes or boils). \n\n375°F is pretty straightforward, so it falls flat",
            "You see, they carefully planned to be born in a metric nation and they should be congratulated for it.",
            "Yes, precision is needed because that pancake will never get done at 374 F and burn to a crisp at 376 F.\n\nSeriously, Americans bring this up every time, yet no one needs that level of precision except scientists, who ironically use centigrade.",
            "Especially since most thermometers only measure Celsius in half degrees. ",
            "iknowrite. Some chef needs to get it down to milicelsius and It's so difficult to teach us decimals.",
            "[deleted]",
            "And why tf would I do that?",
            "It still doesn’t make sense that we use currency to measure size…..",
            "It's a good idea to if you want consistency, I use a ladle to get the same volume of batter per pancake. Makes it all neater, consistent size for the stack and same cooking time, and makes it easier to pour in one spot so they ought to be the same shape.",
            "You mean the banana?",
            "Damn right.",
            "The others are not as refined as you and I.",
            "I do too, but only if I didn't use enough in the preliminaries.",
            "Hell yeah, after the first flip I cut up little bits of butter and spread them on top like chocolate chips. Full butter coverage.",
            "Hanky pankycakes",
            "Other than the maillard reaction.",
            "Laser temperature read the pan. It should be 365°F\n\n\nhttps://www.americastestkitchen.com/cooksillustrated/articles/7079-cooking-temperatures-infrared-thermometer",
            "Maybe one shouldn’t give advice if the advice isn’t actually advice, just an unhelpful generalization.",
            "My bad, i thought the leidenfrost point was like 320f. More like if the water sizzles it's hot enough",
            "LPT right there.",
            "There is a lot of truth there, I guess you're right, it was too much for me to decipher.",
            "Instructions unclear pan is now glowing red.",
            "And do we really think chefs are adjusting the temp of their pans within half a degree Celsius? This is a ridiculous argument for using Fahrenheit.",
            "No it isn't.  It's the same as Celsius but with 273 degree offset",
            "No it isn’t.  It’s exactly as precise as Celsius",
            "?",
            "Why not? It’s an extremely standard, perfectly round object with varying sizes. People have held thousands of Pennie’s or quarters in there hands (half dollars, not so much). They know innately how big that is. Unlike, 1.25 inches. Or .75 inches. Or 3 centimeters. These are not solid things that you have tactile experience with. It’s why we use fruits and sports balls for measuring size as well.",
            "But a coin is a fixed size that everyone (who uses that type of coin) can easily visualize. It makes perfect sense to me.",
            "Last I heard, \"ladle\" isn't part of the metric system ",
            "huskycakes",
            "Ah yes\n\nNow here’s a practical solution that anyone can employ…",
            "Chefs? Yes.\n\nCooks? No.\n\nFoodies/enthusiasts? Yes.\n\nThere's plenty of BBQ forums, sous vide forums, coffee forums, and a bunch of other places that get pretty picky about temps. And yeah, they'll get on you about a 2°F variance.\n\nBut the dudes making pancakes and eggs? Probably not.",
            "I mean, we even have a style of pancakes called 'silver dollar pancakes'.\n\nThey're not literally the size of a silver dollar coin, it's just a common name for tiny pancakes.",
            "Sacrifice one pancake, get the vibes right on feeling temperatures by hovering your hand, or buy a $30 laser pointer from Amazon. It is your choice"
        ]
    }
}