{
    "Please do not delete your posts in this subreddit": {
        "title": "Please do not delete your posts in this subreddit",
        "score": 2226,
        "url": "https://www.reddit.com/r/linuxquestions/comments/ou5cma/please_do_not_delete_your_posts_in_this_subreddit/",
        "content": "I try to help people often with their technical issues in this subreddit.  It feels good to help.  I also know I'm not just helping that person, but anyone else that may run across it in the future from a search.\n\nBut often, the questions are deleted by the OP, leaving me disappointed and frustrated.  I'm less and less motivated to help as it happens.\n\nPlease.  Give back in the most minimal way possible to this subreddit, and avoid deleting your posts if they've been upvoted and answered.\n\n(I'm not a mod, btw)",
        "num_comments": 245,
        "comments": [
            "The obly posts that should be removed are post asking for help with windows.",
            "I not only keep my posts, I actually make the title as if I were googling it, so it shows up for others when they Google a similar issue.",
            "[deleted]",
            "Waiting for OP to delete this thread...\n\nFrustration is understandable. This should go into the sidebar. If you're asking for someone's help, you're bound not to be an asshole and delete information that helped you, as in \"I've got mine so F you all\".\n\nBut you're neglecting social media dynamics. Some might get really uncomfortable when being down voted, for their further questions or the way they stated the thread. You just need one persistent a-hole to keep pushing it, and the thread will most likely end up deleted.\n\nMaybe having more mechanisms involved would help here, but you can't undo bad character with technology.\n\nAnd these reddit posts do end up in search machine results, so it can help others.",
            "I agree. I wish people would not delete. Oh well.\n\n[Obligatory xkcd](https://xkcd.com/979/)",
            "The /r/zfs sub-reddit was [having the same problem](https://old.reddit.com/r/zfs/comments/o6hqx2/warning_deleting_posts_instaban/) and has made removing comments/posts a *banning* offense.",
            "I am equally frustrated by this when searching for **answers**.  Sometimes the top-posted ANSWER has been deleted - it's madness.\n\nCorollary: WHY do posts get deleted?  Did the OP get mad, banned, sell their account for profit...???  What is actually happening here?  confused...\n\n[A perfect example](https://www.reddit.com/r/GIMP/comments/d9dcxk/best_way_to_remove_every_color_except_one/)",
            "[deleted]",
            "https://www.reddit.com/r/linuxquestions/comments/s1vhth/whats_a_good_file_explorer/\nhttps://www.reddit.com/r/linuxquestions/comments/s1us4v/looking_for_a_nice_terminal/\nhttps://www.reddit.com/r/linuxquestions/comments/s1yikg/issues_with_user_access/\n\nAnd these are only the cases of the last few hours where I answered. \n\nEven though it won't change anything and probably has little impact, I will probably stop helping here soon.",
            "Deleting a post is even worse than the guys that tell you “search for it, it’s everywhere.” When in fact that very post was the first result in your search. It’s just not helpful what so ever in both cases.",
            "What bugs me. People need help to switch to Linux. We all give them the best help we can. But I never see that OP come back with a specific Linux question afterwards. Like did they ever go through with it or their good on their own. It's like we are wasting our breath, trying to get Windows user to become Linux users.",
            "and until they heed your advice you should archive those threads on archive.today hopefully some search engine will start indexing that too",
            "I'll never understand why people just remove this kind of post. If there's some leaked info or something, you could always just edit it.",
            "The mods should add this as a rule.",
            "Time to delete posts from here.\n\nThe moderators have lost the battle and the war.",
            "I often google \" 'linux question' + reddit\" and find things here. its nice to get my reddit answers + w/e google throws my way.",
            "Would it be feasible to add a Reddit bot that copy-and-pastes the OP post as a comment, while censoring any usernames?",
            "Some people seem to think deleting improves their privacy.  But it doesn't help your privacy much.  The \"deleted\" info still will reside in reddit's servers, in archives, and in any govt agency that scrapes reddit regularly.  And agencies will just assume the \"deleted\" things are the ones to focus on.\n\nJust don't post private info in the first place.",
            "There are cehtainly times when I have to ask Reddit to find what to search for, or to filter the varied results that I have gotten. Like you said, having other threads to go through can easily be the difference between finding lore vs having to ask the same question for the umpteenth time for myself.",
            "Does anyone actively mod this sub? They could make the automod copy the user’s question to a comment so it can’t be lost. They do that on r/aita or whatever am I the asshole is called.",
            "Hello noob here,. Recently have bee n doing HTB machines, in the command line I typed: rm .ovpn *\nNow when I try and download any .ovpn files they don't appear in downloads folder. How can I fix this",
            "I think some people feel embarrassed perhaps?",
            "Sorry, deleted a post because the facts presented in the initial post changed because not enough scientific process or work on the issue had occurred before posting. Mea culpa.   \n\n\nNo replies had been posted.   \n\n\nWill repost when more due scientific process is complete.   \n\n\nCheers - Doki.",
            "/r/ZFS [rightfully blocks users who remove posts.](https://i.reddit.com/r/zfs/comments/o6hqx2/warning_deleting_posts_instaban/)\n\nHonestly, if someone just misused my time by removing their own post after me answering, I would just repost with both question and answer.\n\nTake this, dirty deleters.",
            "I know this is a year old thread but thanks for posting this. I legit posted some issue  I had (It's a long, so it's intimidating to read) in some subs before this one not long after writing this, and I instantly got 1 down vote on the other subs. \nAnd maybe I'm being overly sensitive and need to grow thicker skin and not take it seriously but man I instantly felt like an idiot after posting it, worse is that i didn't get an explanation.\n\nSo anyway i find this post reassuring no matter how dumb of a post i made.",
            "I’ll happily delete my post if I start getting demeaned for not thinking to look online for something simple when I was already being helped by you on a related issue.\n\nWant that to change?  Change your behavior towards questions.(not directed at op)",
            "Will do. I'm glad there are helpful people like you. I'm new to reddit and linux and happy there is a place to where people are happy to help.",
            "I was going to ask my first question but i dont have enough karma to post on r/linuxquestions. How can i gain karma if i cannot post? The question is quite urgent, too...",
            "thank you op :)",
            "Why does it say that I can’t post here?",
            "u/aperson Can you pin this pls?",
            "Totally agree. And you didn't even mention the other important impact: it removes the ability to reference your posts in new posts.\n\nIf someone (be it yourself or another user) gives a really thorough answer with helpful descriptions, walkthroughs, hyperlinks, etc. then it's great to reference in answers to other questions. Even if users won't search before posting, you could just link to the previous answer and/or expand upon it. Very useful indeed.",
            "> (I'm not a mod, btw)\n\n... but do you at least use Arch?",
            "It cuts both ways, though. Bugs me to no end sometimes when I come across some obscure kernel tuning parameter that seems to address a weird problem, only to look at the top of the page and see a posting date of 2002. Having archival data to fall back on is nice, but damn if it's not a PITA sometimes.",
            "Even if they are downvoted because its a stupid question, it might help a newbie out.\n\nOn the same vein, use the search bar first to find other posts that might answer your question, instead of posting a new question",
            "Hey I've got a question regarding wireless adapter. I've got alpa wireless adapter (AWUS036H) WITH REALTEK 8087 chipset. When it put it to monitor mode it shows mode=monitor but it does not create wlan0mon\n\nAm I doing something wrong or is it that my wireless adapter does not support monitor?\n\nWhen I do\nSudo airodumb-ng wlan0\nI see bunch of BSSIDs\n\nCan anyone help?",
            "Ive tried hours searching into how to fix my issue before posting but have not even found the solution.  \nhttps://www.reddit.com/r/linuxquestions/comments/p5ba1b/dock\\_issue\\_with\\_dashtopanel\\_and\\_arcmenu/?utm\\_source=share&utm\\_medium=web2x&context=3",
            "I wonder how many of the deleted questions are deleted when the user runs one of those scripts to wipe their account history before deleting the account.",
            "hilarious coming from the gatekeepers who delete peoples posts for the silliest of reasons literally all the time\n\n&#x200B;\n\nguy said russia? auto deleted and temporarily shadow banned, eat my shorts hypocrites",
            "It's because they don't want downvotes.",
            "I can't post to this subreddit anyways because of elitist bullshit so that doesn't even matter",
            "Those deleted questions are propaganda pushing an agenda, the users should be banned. Look them up in the archive if you can't find their username.\n\nYou may question what if they are just selfish assholes and to that I reply why let them grow in corruption to one day post propaganda pushing an agenda. Strike them down now while they are still weak.\n\nApathy is your enemy, don't be a bystander get involved.",
            "[deleted]",
            "Hello there, im about to take the LPIC-1 test and i have a doubt. This test consists on two exams 101 and a 102. After completing 101 how much time do i have before taking 102?",
            "How to I post on here ????",
            "I need help safely getting on dark web from my iPhone 12 Pro where do I start",
            "Help how do I get on dark web?",
            "Linux is marked for dead dude, it doesn't generate money",
            "One solution would be doing something similar to /r/legaladvice’s /u/LocationBot. Said bot reposts the OP and title of every thread in the comments… at least if it works.\n\nNo idea how much effort implementing a (copy of?) said bot would take, though.",
            "I only delete things that I post where I sound like an ass after a long work week.",
            "A deleted post should equal and instant ban.",
            "These linux questions need to move to stackoverflow tbh.",
            "Can I delete my post that sounds stupid?",
            "A member of this community, reddit user Full-Slack-Developer, makes jokes about pedophilia and raping children. Careful of this person.",
            "Ah yes, the Stackoverflow goodbye.",
            "I need help with  a system installed on my phone from play store hacked bad af I have a android 11 that has daviks software and Linux as my OS. In play store the vunabilty is a missingsplint . I've been going through this 2 yrs with no money stolen just spying know who it is he sent message from his shell that my Sim card picked up and stored. This so twisted just a remote connection and my wifi that has loopbacks random IP address . I found a portmapper open port at 22 back to 32450 . I've learned Linux to try and get it off my phone with no luck running  kali on a Droid.",
            "[deleted]",
            "Obviously people are going to be embarrassed by how lazy and uninitiated some of their questions are.",
            "ok",
            "What if I ask a question and get an answer.  Then, a few months later, facing the same issue again, I forget that I already asked the question, and post it again.  Then, after posting it, I suddenly remember I already asked a few months ago, and suddenly remember the answer.  I assume I should delete that second post of the same question.  Assuming the 2nd post has no answers because I posted it a few minutes ago.  Right?",
            "People here are very ride to new Linux peeps tryna learn so I'm no surprised so many people deleted their questions",
            "Ultra Chad user:",
            "Fair enough, I'd only delete a post anyway if I posted something in the wrong place. Even if someone posted a rather dumb question they should not need to fear being flamed. It's a good learning experience for them and any others in this sub.",
            "I have a question-  \nI am a Gamer who is using windows 10  \nI kinda have an... OK.... Hardware and my windows settings optimized  \nI'm considering changing to Linux.  \nI want to know the main advantages and disadvantages and I'm also worried about the fact that will I find the games I play on windows on Linux??  \nLinux seems smoother so seems better to me. Other than that what version/type of Linux should I install??",
            "depends most of times i delete stuffs cause people answer arrogantly(that's why i usually ask to see each other in Skype, i dont have problems) ... i mean, if it is happening there's a motivation(or just i did some mistake)",
            "Hey guys , i need some help on how to find the flag that is stored in the root.txt file., do i use the dirb command?",
            "What if I posted a question so absolutely idiotic that it gives people migraines?  Can I delete it then?",
            "Why do people even delete it?",
            "We get told to mark our posts Resolved, yet the mods have disabled changing flair.",
            "[deleted]",
            "Relevant xkcd\n\nhttps://imgs.xkcd.com/comics/wisdom\\_of\\_the\\_ancients.png",
            "How  can i initiate  hashtag high jacking or Trend Jacking and Watering Hole Attack  via kalo linux would be helpful if tools are suggested or way",
            "How do I flatten all files in a subdirectory, if conflict, give it a spammy extra amount of file name?\n\nI got the answer from ChatGPT, but my computer so hosed, I don't have a copy/paste functionality now. If anyone needs this ask in reply,I'll dig it out.",
            "Does that include people who have tried Linux and borked their bootloader and can't get back to Window?",
            "Yeah.  That's why I ended with \"... if they've been upvoted and answered.\", which implies they aren't Windows questions (but not necessarily).",
            "i think we should just leave one and for all users who come across it to downvote /s... kind of",
            "That's very nice of you <3",
            "This is something I never thought of doing but will endeavor to adopt.",
            "That's something that I too often do! I should do it more often, I think.",
            "That's true, but Reddit is indexed by many search engines. I am constantly redirected to Reddit from Google when I do my researches.",
            "> To be fair, based on so many posts I've seen here, nobody uses the search function anyways. \n\nI can see how you're counting the people that ask repeating questions, but how are you counting the people that *do* use the search to solve their problem?",
            "Personally, I do ```site:reddit.com [error number/problem description] [software name]``` rather than use the reddit search function. It's mostly garbage, in my experience.",
            "In the past week I've been redirected here from Google and DuckDuckGo at least 5 times",
            "You're absolutely right in that nobody appears to search at all before they post.  My gosh, if I had a nickel for every single \"Can you recommend a Linux distro for a new user\" post that pops up multiple times a day, every day, I'd be sunning myself on my own private island.",
            "I agree.",
            "The ones who use the search bar, you don't hear from though.",
            "Google search is better though than reddit search.",
            "That downvoting is a serious issue. It never bothers me honestly, as I don't really care about a \"digital pat on the back\" or the opposite. I still don't get why some people feel the need to downvote someone for a question they think not to their level of \"intelligence\". If it's \"too stupid\" for you, just keep scrolling. We don't want to leave a bad taste in new comers' mouths.",
            "As a newcomer to this subreddit and to Linux, I have to agree that down voting and rude comments because you worded something non-conventionally really does push a person to delete the entire thread \n\n\nIn a general sense though, I've only ever deleted windows related threads if I've been so frustrated at everyone copy pasting irrelevant crap from other forums because no one knows how to fix the niche problem so a solution is never found anyway",
            "One of the many, many, many reasons voting based sites are shit.\n\nNot one good reason for it.",
            "Or even better, the forum post with a single response. That response is posted by the author of the thread and simply states, hauntingly:\n\n*Never mind, I figured it out.*",
            "Why do I know which comic it is before even clicking the link haha. But really people shouldn't delete their post, I have find many clues from Google linking to this subreddit from time to time.",
            "Obligatory [How To Ask Questions The Smart Way: Follow up with a brief note on the solution](http://www.catb.org/~esr/faqs/smart-questions.html#followup).",
            "Unfortunately, this will not improve the situation much in my opinion. Because often people delete not only their posts as soon as they have received a reply but also their user account.\n\nAnd because you can easily create a new user account 24/7 on platforms like Reddit, a user account is simply a throwaway item for many. In the past, the registration of various forums was only open a few times a year, making a user account more valuable. Somehow I miss those days a bit.",
            "As does /r/learnjava :\n\n> **Do not delete your posts!** Deleting is selfish and will deprive others of existing solutions. There might be other people with similar problems who could profit from the discussion in the thread.",
            "Easy just rm rf your post instead. If they didn’t snapshot it, that’s on them. /s",
            "Anyone have any insight into why people do this (deleting solved questions)?\n\nI don't understand it at all.",
            "Thank you, I never thought to try [deleted]",
            "hi, I clicked on the Relay link by mistake, is that a harmful link? (I am not joking, just scared of links with malware)",
            ">https://www.reddit.com/r/linuxquestions/comments/s2xa0d/add_calamares_to_archiso/\n\nAnd again another egoist.",
            "It's not only this sub, but I agree that it's annoying. Why should I take time to write a well formulated and sourced answer when the OP will just delete the post?\n\nBut I think that might be more of a reddit problem in general to be honest.",
            "I had a fear of missing out on my Windows stuff and would duel boot. After a while i just learned i dont need it. It may just take quite a while for others too",
            ">It's like we are wasting our breath, trying to get Windows user to become Linux users.\n\nI want Windows users to stay on Windows until they're ready to upgrade. Such people will read better sources of information than this. This is a crappy place for newbs to start. Have you spoken with an arch accolyte, the Westboro Linux branch?\n\nPeople tend to sort themselves better w/o external meddling. The hubris, emotional thinking, and dictatorial tendencies that drive Person-A to try and convince Person-B to do a thing because Person-A believes it's in Person-B's best interest is how most of history's most tragic and horrifying stories began. Resist that urge! Discourage it in others!\n\nEdit: that it bothers you a lot is an opportunity for self-reflection.",
            "> It's like we are wasting our breath, trying to get Windows user to become Linux users.\n\nHa ha do you know how pathetic and juvenile you sound? Why would you even care what operating system people use much less trying to get them to switch to Linux? It's their choice and their business, they will choose whichever operating system fits their purpose. This sub is about answering specific questions people (not just Windows users) may have while using Linux, not to shill for Linux. Linux users don't need to do that.",
            "Tip: This gets a more precise result: `lorem ipsum? site:reddit.com/r/subreddit`",
            "People seem to be missing the central issue here. I mentioned it lower down but deleted my post to wind OP up :P Reddit's ToS includes the rights of users to delete their posts and account. Even bots that auto-repost include an option for the user being quoted to delete the bot's post. Individual subreddits can't contravene reddit's overarching ToS. Like someone else mentioned, subs can choose to ban users who delete their posts, but they can't prevent that deletion in the first place. Like it or not, reddit users have the right to delete posts. It's a big part of what makes reddit what it is. There are wikis, docs, hell even man pages for people to contribute to if they prefer helping the community as a whole rather than individuals. But reddit is not intended to be a repository of knowledge. You wouldn't complain about the lack of upvote functionality on wikipedia, or the lack of youtube videos on sci-hub, because those are clearly not the intended purpose of those sites. There's nothing stopping anyone here from making a wiki, informing the mods, and opening it for contributions from users. Why is complaining about the nature of reddit and suggesting turning this into a closed draconian community a better option?",
            "It has happened to me very often that I simply answered a question (for example, by stating the solution to the problem directly or by referring to a Wiki entry, for example). And shortly after that the post of the questioner was deleted (sometimes also the user account). In such cases there was nothing embarrassing at all.\n\nAnd even if one has written a embarrassing contribution as a questioner, then that' s just the way it is. Has also happened to me in the last decades. So what?",
            ":)  It's all about respecting others' time.  I don't see anything wrong with that.",
            "That's a good idea.   I'll start doing that, with the top answer appended to the post and with links to the original deleted post and my comments(s).",
            "Sure, why not.",
            "That's true of everything (except maybe archwiki) such as stackoverflow et al, blogs, articles, etc.  I'd rather have a few bad answers mixed with a few good answers than zero bad answers and zero good answers.",
            "Can generally also filter search results by when last updated.",
            "Voat is gone so probably not many. Then again I've seen some paranoid redditors that delete all their content constantly. I contacted one to let one know that the user was shadowbanned or something and the user acted all CIA about privacy.",
            ">Please. Give back in the most minimal way possible to this subreddit, and avoid deleting your posts ***if they've been upvoted*** and answered.",
            ">Those deleted questions are propaganda pushing an agenda\n\nUhm ... but are those mostly OP deleting their own post?  Or mostly moderators deleting more-or-less spam posts?  The latter being deleted probably isn't an issue in it being deleted.",
            "Then be transparent and let us know you may delete the post.  Otherwise, go ask on one of the stackoverflow sites or a support forum.   I consider it somewhat dishonest and selfish to lure us into giving up our assistance and time for free and then screwing us over by effectively deleting our content.\n\nGiven your comment, I agree with others ITT that it should be against the subreddit rules (to delete an upvoted post).  But sadly, it also makes me want to no longer help people.\n\nUPDATE: the user that wrote the above deleted comment said that he sometimes deletes old posts periodically as a clean up process.",
            "Throw it in the ocean. Should be dark enough down there.",
            "Open source focuses on what the users really want, not what will make profit for the developers. That's what makes Linux great.",
            "Red Hat, Canonical, and whoever owns SUSE these days seem to generate money.",
            "The intent is to keep around posts that have received useful answers.\n\nupdate: if your post was poorly worded and hasn't gotten any useful answers, go ahead and delete it.  It won't hurt anybody.\n\nI posted this because I'll spend a lot of my free time helping others, in the expectation that my work will be helpful to possibly more than just the OP.  When my work is deleted, it's frustrating.",
            "Don't bring your baby mama drama into this",
            "The point was to not lose a record of solutions and suggestions.  No solution, no problem (to delete).",
            "> Please.  Give back in the most minimal way possible to this subreddit, and avoid deleting your posts **if they've been upvoted and answered**.",
            "Did you mean to write rude? If so, which post in https://www.reddit.com/r/linuxquestions/comments/sc5hek/arch_installation_wont_boot_after_update/ do you think is rude?\n\nEdit: Or what is the problem with the answers at https://www.reddit.com/r/linuxquestions/comments/scf8ht/can_i_use_protonvpn_on_damn_small_linux/?\n\nThe problem is rather that far too many users are simply selfish. And that nowadays even a reference to [smart questions](http://www.catb.org/~esr/faqs/smart-questions.html) is considered bullying, rude or something similar. But it isn't. A support forum is not a one-way street.",
            "Please instead ask that question in a post:\n\nhttps://www.reddit.com/r/linuxquestions/submit",
            ">  Give back in the most minimal way possible to this subreddit, and avoid deleting your posts **if they've been upvoted and answered**.\n\nI would assume if it was a bad question it wouldn't be upvoted.",
            "That's been well discussed ITT.  People have said that it's sometimes because people don't want low karma comments in their comment history.\n\nBut I said in my post \"void deleting your posts if they've been **upvoted** and answered\", which you would think would handle that case most of the time.",
            "> It's almost painful to see Linux users behave like immature children especially if you say ANYTHING bad at all about Linux or if you compare something to Windows. \n\nYou think it is Linux community that has that problem?\n\nThis is common in reddit community. When you gather people together, you will pull 20% of it that are causing trouble to rest too. \n\nWhy you will see across the reddit that when someone does something good or honest, they can be attacked by group that will just downvote regardless what.\n\nIt is life... When you challenge the group stupidity by any means, you get attacked by someone and others will follow.",
            "Those people have been forcably helped.",
            "Wow dude you are fckd up.",
            "We have to help each other 😄",
            "Thank you",
            "I fully agree, for some reason when posting, I think in terms of a \"good title\" rather than the question I've been googling the last few days, finally giving up and asking a question here..",
            "That's the way to do it.",
            "[deleted]",
            "Maybe we should require the question to be posted on Stack Overflow and then linked here. I feel questions tend to stay there and it seems to land on search engines more so than any reddit.",
            "That’s exactly why I’m here",
            "Honestly, half the time I just \"x problem Reddit\"",
            "More frequently now. I remember never ending up here but more and more now.",
            "[deleted]",
            "That s the (fake) power of a keyboard warrior.",
            "If you see those that have been downvoted for no logical reason, upvote them to try restore balance in the force.",
            "Real talk yo",
            "Sites like ServerFault and StackExchange do properly use user-voting for solutions given for problems or questions the poster posed to the community and it's the best solution that's accepted get the most upvotes on such sites.",
            "Yes, followup with solved and solution or at least [pointer to such](https://www.reddit.com/r/linuxquestions/comments/ou5cma/please_do_not_delete_your_posts_in_this_subreddit/h70yba5/) would be good.",
            "Reply: Did you try the solutions [here](https://www.nvidia.com/en-us/geforce/forums/discover/) or [here](https://arstechnica.com/civis/viewtopic.php?f=6&t=14754323) or [this video?](https://youtu.be/Cu3R5it4cQs)\n\nOP: wow thanks that worked!",
            "I posted a question about find command and scripting in r/linuxadmin and didn't really get much response.  Also when I updated that I went about the solution in a different way I also posted the entire script I wrote to handle the problem so I feel like that's kind of a win.",
            "Instead of that, they should say \"I figured it out. Here's how I fixed mine...\" and then explain without going into unnecessary detail. Someone else might have the same issue tomorrow.\n\nSu\n\nRm compiz",
            "Unpopular opinion: While this is good practical advice for avoiding unpleasantness and getting better answers, a lot of it is a cop out to excuse impatience and frustration. RTFM is normalized in \"hacker\" culture but it's not normal in most other contexts (where many question askers come from).\n\nExample: If a stranger approaches me on the street and asks how to get to the zoo, and I respond \"Look it up on Google Maps\" I'm unequivocally being a dick. Either I give the stranger the benefit of the doubt and provide directions or I say \"I don't know\" and end the discussion. Most anything else is making a conscious effort to be antisocial. (If the stranger gets mad at me for not acting like I'm his personal unpaid  travel agent, that might be another story).\n\nI get how frustrating it can be to be asked bad questions. Besides providing support on Linux forums, I'm also a teacher. Getting paid to answer the bad questions only makes it slightly less frustrating. But frustration shouldn't be a license to use internet anonymity to express that frustration in ways we wouldn't in real life.\n\n/rant",
            "Dang :(",
            "I think I asked the same question in that post and the theory was they’re trying to leave a clean/empty digital footprint.",
            "> But I think that might be more of a reddit problem in general to be honest.\n\nIt's not a reddit problem *per se* it's a problem with allowing self-editing and revisionism. If you give users the ability to make what they post impermanent, they will take advantage of that, usually selfishly with no consideration of how it affects others.  I've seen old internet stuff, like early webcomics, essays, prose, rants, etc. just disappear completely because the author decides they're ashamed of the old work, or they \"can do better now\" so they wipe out the old work completely for a reboot.  The history gets removed even if people liked that original work, and sometimes the new work is inferior or never gets completed at all. \n\nIt can happen outside of internet content, too.  Look what happened to the original Star Wars trilogy over the years: countless re-releases with tweaks and changes, and the deliberate obsolescence of old versions by not moving them to newer formats, making the replacement the only obtainable version.  \n\nVideo games have gone in this direction as well, thanks to Steam.  In the past you had access to a snapshot of the old game versions in the form of the release media and any standalone patches, but with Steam's update mechanism, you're forced into the newest version at all times with no way for people to just go \"nope, don't like this\" and stick to old versions and play the game with other people that feel the same way. Devs will completely upend their game design on a whim now, because what are you going to do about it?  You already paid and it's not like you can play the old version.\n\nAnyway, back to the original point:  if you let people edit/remove their content, it will happen, because some people don't give a fuck once they get what they want, and others just endlessly want to tinker and tweak and edit.  Other than blocking removal/editing completely (e.g. the Slashdot solution, which sucks for its own reasons), the only real protection against that kind of revisionism is to either provide some kind of version history of changes, or only allow changes within a short window of creation.  Like maybe you can edit your post or comment for an hour after posting it, in case you need to fix errors or catch a typo, but once that time is up it's set in stone, barring admin interaction (for possible legal reasons).",
            ">duel boot\n\n[Duel](https://en.wikipedia.org/wiki/Duel) ... like when Microsoft Windows challenges Linux and tries to kill it.  Hate getting slapped in the face with a Microsoft glove.\n\nBut Linux, not so violent, survives and does better anyway.\n\nAnd also, rather than such violence, many instead go the way of the [dual](https://www.google.com/search?q=define%3Adual) boot and try to not have either operating system kill the other.\n\n;-)",
            "I don't care what OS people use. But when a Windows user, said they like to switch to Linux. And you guide them to the water hole. But they never take a drink out of it. That's the part that bugs the crap out of me. 100th time or more and don't see or hear from them again. It's like they are curious, but afraid to take that first leap. I'm trying to help them to get what they ask for. They ask, I tell, then they turn around and forget what they ask for. Why ask for something you have no attention to do the deed at all?",
            "Hey thanks!",
            "Some people cope with embarrassment better than others.",
            "The ones that really drive me up the wall are the years old posts that exactly detail the problem you're researching, which abruptly end with, \"Never mind, I fixed it.\" Good for you.... HOW?",
            "Even if the post was spam, the comments were legitimate. Proper procedure would be a thread lock. This would be a sure sign of negligence among the moderation to delete. Or at the very least a character flaw capable of privilege escalation. Again are you going to wait until the problem occurs.",
            "Lol what? In a Linux sub of all places? No sorry, if you expect ownership of people's posts in exchange for advice you need to state that upfront because I would not agree to those terms of service. Expecting control and ownership of things I create isn't dishonest.\n\n\nYou can still access your replies to deleted posts. Backing up your data is your responsibility. And there are tools for overcoming this problem. The onus shouldn't be on the user to make up for others not using those tools.\n\n\nIf you feel \"lured in\" to giving advice maybe reassess why you're doing it. the point is to help someone, not to be immortalised on reddit. If you want to contribute to some sort of lasting repository of knowledge, there are tools for that, and reddit is not it. Sticky a thread or make a wiki or something like other subs do.",
            "Open source focuses on what the narrow minded developers want.  They couldn't care less what the users want.  This is proven thousands of times over the last decade.",
            "[deleted]",
            "I'm sorry but windows actually works and Linux needs a PhD just to grand yourself permission to modify the source.list",
            "[deleted]",
            "Good tip though you can drop the www in the dork, it’s not needed",
            "You can send this next time https://letmegooglethat.com/?q=hello+world",
            "Not the same poster, but, usually, no.",
            "I see so many keyboard warriors all over the place on Reddit as well as on forums and it makes me so angry. Why do people get to hammering their keyboards while cussing and yelling at the screen ( while wearing their battle uniform!). It's just to stroke their own egos and perhaps people should not respond to them as they'll either slink away or be banned/muted.",
            "That is literally what I do all the time. Some people just make it their mission to go out and spread negativity around for no reason.",
            "Here's a sneak peek of /r/linuxadmin using the [top posts](https://np.reddit.com/r/linuxadmin/top/?sort=top&t=year) of the year!\n\n\\#1: [30 years ago....on this day.....this is how Linux started. Rest is history! Happy bday #linux](https://i.redd.it/7pt2pnpgvij71.png) | [62 comments](https://np.reddit.com/r/linuxadmin/comments/pbdjby/30_years_agoon_this_daythis_is_how_linux_started/)  \n\\#2: [Maybe we should update how we code parent and child functions lol....](https://i.redd.it/gd6j8vjcksg71.jpg) | [71 comments](https://np.reddit.com/r/linuxadmin/comments/p2wh8l/maybe_we_should_update_how_we_code_parent_and/)  \n\\#3: [Merry Christmas to all.](https://i.redd.it/qyojfprx3n781.gif) | [18 comments](https://np.reddit.com/r/linuxadmin/comments/ro4wpi/merry_christmas_to_all/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
            "I didn't say \"RTFM\\*\" (not that I don't ever, but that's another topic), I provided a quite descriptive link to relevant information.\n\nThis is 2021, not 1921.  Folks are mostly reasonably literate, there's The Internet, and folks should well be able to read how a link is described, and follow it if they want the relevant details of that information, or not if they'd rather not see or be bothered with those details or maybe they're already thoroughly familiar with those details and following the link would be highly redundant for them and a waste of their time.\n\nI'm not lecturing in front of a class of 100, or publishing a chapter in a book here in a required class in 1921.  Sure, I could lecture/type on about the details and information and explain ... and have everyone sit and listen/read through that ... but that would take up everyone's time and resources, even if it's not relevant or useful to them or they're not interested.  Likewise I could type up such a descriptive text here - but again, that would oft be relatively wasteful of many folks time/attention, when a link would do quite nicely and concisely - and they could follow it for more information if they wanted/needed - or skip it if they already well know and are familiar with it, or just aren't interested.  I'm also not in situation where I've got even 25 students that are stuck in classroom having to listen to me whether they want to or not - we're here, they don't have to read *whatever* or follow links, or even come to the replies on this post, or this subreddit, or Reddit, or heck, even The Internet.  So not good to put a bunch of text up that may be of little to zero interest to some or maybe even many.  In lots of cases some relevant link(s) or the like, and much less text (or merely good description/text of the link itself) will quite well suffice and is often the much better alternative.\n\n\\*And even often/typically when I do, it's typically accompanied by link and/or reference(s) to the relevant man page(s).  So it's not like someone's asking how to get to the local zoo and I'm dropping them off in the maps section of the local library - it's more like I'm handing 'em a link to a map thats shows them where they are, where the zoo is, and gives detailed directions on how to get from where they are to where the local zoo is.  And, with doing that and semi-regularly encouraging that, many will also well learn how to be able to do that themselves and learn how to look it up themselves and get the rather to quite readily available information for themselves.  And yes, sure, folks need to learn stuff and be taught stuff ... but one of those key skills is being able to well look up and fine readily available information, and to utilize and learn from that.  And also in that way, more limited teaching/mentoring etc. resources can well be applied to additional/more critical things ... like well covering things that can't just be looked up.",
            "go to quora or create your own forum... why do you use reddit? 🤷🏻‍♂️",
            "It might be possible that they have read over the advice they've been given, thought about it (or maybe tried a Live USB) and realized that it may not be for them.  That's still perfectly fine.\n\nIt's kind of like buying a car - you go to the dealership, ask questions about a car, maybe test drive it but it just doesn't feel like it's for you.  The salesperson will try and say how amazing the car is but if you don't feel it, you don't feel it.  No amount of convincing will work.\n\nJust because it appears like they haven't even tried the advice they've been given, doesn't mean they never did or they don't appreciate the help.\n\nOr maybe they did switch and are enjoying using a new OS.  It's impossible for us to know without some sort of update from that person.\n\nI find it less frustrating when I look at it from this perspective whenever I help someone on any support forum.",
            "RedditOverflow... https://m.xkcd.com/979/",
            "I almost spit out my coffee.  LOL, funny and sad at same time.",
            "What if it's nothing but total spam - and doesn't even have any comments yet.",
            "> Expecting control and ownership of things I create isn't dishonest.\n\nThen never contribute to an open source project.  Similarly, you can't delete your merged git commits in a community GPL project.  I suppose FOSS projects are being dishonest in your view.\n\n> In a Linux sub of all places?\n\nAbsolutely.  I support FOSS, the GPL, and creative commons for similar reasons.   I also admire the ArchWiki.\n\n> the point is to help someone, not to be immortalised on reddit.\n\nNo, the point *for me* is to help THE COMMUNITY.  (btw, I'm anonymous here and I don't use this alias anywhere else.) I realize there are possible better ways to do that, and so I may very well take your advice and help people here less.  Good job.",
            "Why are you whining about Linux on a Linux sub",
            "You have not then not seen much of the discussion panels...",
            ">I'm sorry but windows actually works \n\nHahaha, nice one.",
            "it is so hard to type sudo rather than interacting with GUI and prompts every 5 seconds.",
            "nice joke,i have been running linux mint for like 4 months now and it far exceeds windows in usability",
            ">\"Google, find me that dress I saw last week, that the girl at the bus stop had on that looked nice\"\n\n[Fount it!](https://www.youtube.com/watch?v=It75wQ0JypA) ;-)\n\n... of course most wouldn't find it and would be off in the land of [find me that dress I saw last week, that the girl at the bus stop had on that looked nice](https://www.google.com/search?q=find+me+that+dress+I+saw+last+week%2C+that+the+girl+at+the+bus+stop+had+on+that+looked+nice) ... but not to worry ... after enough time they'd find and loudly declare they found the answer as: [find me that dress I saw last week, that the girl at the bus stop had on that looked nice](https://www.reddit.com/r/linuxquestions/comments/ou5cma/please_do_not_delete_your_posts_in_this_subreddit/h70qfvg/) ... and maybe even much later, some might finally get pointed to and find, well, ... [find(1)](https://manpages.debian.org/stable/findutils/find.1.en.html).",
            "> Formulating a proper search query to get what they want\n\nOne of the things I find as I'm learning in a new topic is I get better at constructing a useful query. At first you just don't know enough to even select keywords. \n\nIn a new subject area most web searches will end up on the most SEOed sites that are money-making via direct sales, affiliate codes, memberships, services, scamming, ads, or whatever.  Like the other day I was trying to learn about LED light strips but could not find anything that wasn't a sales pitch even though I'm sure there is piles of info existing. Somewhere. \n\nIf you are looking for really basic info, sometimes it's so rudimentary that few people cover it. I am reminded of the first time I was using a Ruby program and the instructions required adding something to a gemfile. I was tearing my hair out trying to find out what is a gemfile and where is it located. The info I had to search with was too broad and results were totally random. I did hilariously find a stackoverflow question where someone else *who was following the same documentation as I was* had the *exact* same problem but all the responses were just arguing about whether adding to the gemfile was really the best way to go about accomplishing the task. And they were suggesting alternative ways. OP was responding with \"I am just trying to follow the instructions as written\" but neither of us got the answer in the end. \n\nI have also recently noticed a clever kind of top search engine hit where a tutorial-style article is presented but once you get to the bottom you find out it's an ad for a company wanting to sell you a service. So say you search for info about keeping backups, there is an article about various programs that will subtly emphasize the complexities of them. Then at the bottom it says, \"But if that sounds like too much trouble, pay us to do it.\" Sometimes these are helpful as springboards. \n\n> And nearly everyone would be dumbstruck at the idea that Google takes operators like site:, and would have no ckue how to use them effectively.\n\nI was talking to someone recently with a recent journalism degree and mentioned doing a `site:` search casually but they had no idea what I was talking about. Then on questioning it turns out they had never heard anything about any 'google fu' or non-basic searching. I incorrectly assumed that would be the kind of thing would be included in 4 years of training in a profession of finding information.",
            "> \"Google, find me that dress I saw last week, that the girl at the bus stop had on that looked nice\"\n\nMaybe that's why Google made Google Lens",
            "Oh there's a reason, it's just not obvious. Maybe they hate themselves so much that the only thing that makes them feel anything is to spread the negativity.",
            "Some people live (not just love) to f*** up anything they can.",
            "My comment was related to the content of this occasionally posted article, which does reference and partially justify RTFM-type interactions. It has nothing to do with your posting of it.\n\nEDIT: For the record, I have nothing against posting links as responses to queries. In most cases, some information is better than nothing. Often a nudge is the best solution.\n\nEDIT TO THE EDIT: I should probably note that my objection is to the tenor of the entire piece, not specifically the tagged section. I see the source of the disconnect.",
            "Simultaneously Flag it, Log it, and then Ban it twice over.",
            "The point you're missing in your blind sarcasm is TERMS OF SERVICE. In your hypothetical situations, I would familiarize myself with them before contributing. Which is what people should do. If you don't understand Reddit's ToS and don't respect people's right to delete their posts, then no, as you said yourself, you shouldn't contribute. If you want to help the community and not individuals, contribute to wikis, github docs, or any of the other tools intended for that purpose. You'd indirectly be helping people here too because then we could just link to your documents. If you no longer want to contribute because people disagree with you, it's a shame, but you have that right.",
            "Why do you stick up for the fanboys lies?",
            "[deleted]",
            "Don't have to code or spend hours googling issues just to do basic shit windows has done with style for the past couple decades \n\nBut no no of course windows sucks and Linux is the best, that's why it's so mainstream and popular amongst paid professionals",
            "windows is actually the best os ever made, just don't connect it to the internet",
            "Oh my god!  The second link in the query you posted is a story about a girl set on fire on a bus.  That is unequivocally **not** the kind of hot dress I had in mind.",
            "Amen to that. Just sad",
            "Yeah, but ... [your comment](https://www.reddit.com/r/linuxquestions/comments/ou5cma/please_do_not_delete_your_posts_in_this_subreddit/hn7tnjy/) was made in reply to [my comment](https://www.reddit.com/r/linuxquestions/comments/ou5cma/comment/h70yba5/), not to [the original post (OP)](https://www.reddit.com/r/linuxquestions/comments/ou5cma/please_do_not_delete_your_posts_in_this_subreddit/).  Context matters.  :-)",
            "Why would someone who you aren't paying prioritize what you want over what they believe it's optimal.\n\nThem putting in 100% gives them that privilege.",
            ">I don't care, just act your fucking age.\n\nHow about acting like a civilized human being, regardless the age?\n\nPs. Did you notice what you just did?\n\nEdit: as you (username DarkAeonX) wanted to make my case, by you replying to this post and calling me retarded. Only you to realize finally that you did what you accused others, and so you felt need to delete your post in shame to be one of toxic persons in communities by not being able handle your emotions like civilized person. And I have screenshot as evidence for that...\n\nSo delete your posts as you can't stand behind your word.",
            "\"Don't have to code or spend hours googling issues just to do basic shit windows has done with style for the past couple decades:\"\n\nThat's not necessarily true and you probably know it.",
            "\"But no no of course windows sucks and Linux is the best\" \n\nWhere did you see that said? Ahh, you made it up huh? Never spent time trying to fix your windows box, googling for commands? I think you're straight lying or never used windows for much of anything.",
            "is having 9 3rd party background programs running to fix simple problems really doing basic s\\* in style?",
            "For you it's hours, you just figure out how to fix them the more you us it.  Stop whining about some operating system, if it works, it's usable.",
            "Windows does suck and so does Linux, just in different ways.",
            "Linux isn't preinstalled on large numbers of PCs, unlike MS's lock (which is a near-monopoly).",
            "Warning! Troll detected. For sake of your sanity, ignore him.",
            "[removed]",
            "Oh sh\\*t.  Yeah, folks do unintelligent queries and ... well, search engines aren't *that* smart\\* - mostly just pretty dang fast and have access to [about 200 terabytes of searchable data](https://www.webafrica.co.za/blog/general-knowledge/how-much-of-the-internet-do-you-actually-see/).\n\n\\*looked nice, girl, synonymous: hot girl ... what could go wrong, oh, *that* ...",
            "I mean, it was in response to and referencing the content of the link you posted. I.e., your comment by proxy. But you are right that it was off-topic with regards to OP. So yeah, your final conclusion is still right. ;)",
            "You're hopeless.  That's not how great projects are built.  Ego driven developers are why there are projects named GIMP.",
            "[deleted]",
            "For real, they then went straight to hyperbolic statements in a half-assed attempt to make their point.",
            "so googling in net and looking down the registry ,finally after finding it says your policy doesn't allow you to edit it ,while in linux you just uncomment the setting you desire",
            "It is. I currently try to fix an issue that makes my system unbootable just so I can play games without my system freezing just because Linux has terrible Vega Graphics support.",
            "huh? you're hurt in the rectal cavity from my hyperbolic statement? Huh? Huh? Huh? are ya? are ya? huh? butttttttt huuurrrttttt",
            "Look at our likes \nRealise you taken the L",
            "Suk Ur daddy dik",
            "[removed]",
            "ኃጢአተኛ ነፍስህ ከመዳን በላይ ናት እናም ሰላምን ወይም ሥቃይን አታውቅም ፣ የንስሐ ቅዝቃዜ ብቻ አብቅቷል ፣ ምክንያቱም ኃጢአቶችህ ከማንኛውም ተልእኮ የላቀ ስለሆነ ፣ መጨረሻው ቀርቧል ፣ የኃጢአት መርከቦች",
            "Yahaha. I highly doubt it’s only 200tb.",
            "Well, the link I provided has anchor tag, so mostly refers to one specific section of that web page.  But yeah, sure, too, there's lots more stuff also on that web page ... and too, e.g. some noobs, might get confused, or miss that detail.",
            ">\"Only to realize finally that you did what you accused others\" first;\nlearn grammar and second; you have no clue what you are talking about. I\ndeleted my posts because immature sensitive brain dead Linux users\ncan't take that you are talking down on Linux or compare it to Windows\nso I'mma speak my mind no matter how toxic it is and if you find that\noffensive in ANY way then you need to grow the fuck up. Instead of\nsitting at home on your virgin throne taking screenshots (genuinely\nbeing a creep, I can smell the pedo on you) go out and touch grass, get a\nfriend or two, kiss a female/male and stop sitting at home feeling\nsorry for your pathetic self.\n\nThank you for providing evidence being that you accuse others of.",
            "Laughing as I sit by my machine with an Nvidia a brand that has worked well for me on Linux for 20 years",
            "> you're hurt in the rectal cavity \n\nI see you immediately think of rectal cavities when you read stuff, says more about you than anything.",
            "you could not have said this in a cringier way",
            "exact, mă doare fix în c*r",
            "Ahh, the dignified response of the true gentleman.  Quite debonair. I tip my hat to you, sir.",
            "Lmao your other replies are so childish\nEach OS has its place and I think the other users have said this better than I",
            "Isn't it weird that you think that relative number of likes in a meaningful measure of quality. Is that why you have multiple sock puppets upvote your posts so you can feel victorious?",
            "Suk bezzos big bald cock, Jeff bazos's ass sniffing basment dweller.",
            "ጸጋው ሁሉ ከምሕረት ይፈልቃል፣ የመጨረሻው ሰዓትም ምሕረትን ያብዛልን። የእግዚአብሔርን ቸርነት ማንም አይጠራጠር; የሰው ኃጢአት እንደ ሌሊት ጨለማ ቢሆን፣ የእግዚአብሔር ምሕረት ከመከራችን የበለጠ ብርቱ ነው።",
            "I hear you (see the edit to the in my first response). I just viscerally react to that page, it seems. Lots of good information throughout including the area you mention, but scattered apologia for the things that make noobs (rightly) find things like Stack Exchange or the Arch forums inhospitable. It's not everyone (or even most people, it don't think). But we're kidding ourselves if we think our community isn't occasionally toxic to outsiders.\n\nIn any event, I'm sorry if my comment came across as \"going after\" you in any way.",
            "[deleted]",
            "[removed]",
            "Take the L",
            "I've lmao reading all the replys!! Sometimes the banter is just that, and sometimes it can get very ugly.",
            "Linux is only for Linux programmers...\n\nFor everything else, there's windows",
            "Why are you so in love with Jeff bazos? You love him fucking your ass so much? Bet you call him daddy bazos you Sik fuk go kys",
            ">Arch forums inhospitable\n\nAh, Arch, yeah, there's a fair bit 'o \"I run Arch so I *must* be cool - I *am* cool\" elitism out there ... not that other distros, etc. are immune from such.  Egad, Arch, ... mighty fine wiki ... but annoyingly high bar to be able to edit/fix it.  Even if there's something very clearly incorrect - typo, misspelling, some incorrect technical information - *whatever* \\- if you can't essentially pass the \"Arch magic handshake\", you don't get to edit the Arch wiki.  Oh well, you wanna make it that hard, fine, I won't help y'all fix your booboos - you can do it all yourselves.  I mean, geez, ... editing Wikipedia, Debian's wiki, etc. - which I not uncommonly do - comparatively pretty dang easy to get the relevant access to be able to edit ... but Arch, oh no, not for anyone that doesn't pass the Arch secret handshake.",
            ">(Little the person know that more than a month had passed, it's incredible how dumb people are allowed to be.)\n\nSay You, u/DarkAeonX, who after a month came back to insult unknown people on internet..\n\nEdit, then when you get enough insults out, you delete your posts hoping that no one would ever know your actions."
        ]
    },
    "Which Distro should you choose? Ask in this thread": {
        "title": "Which Distro should you choose? Ask in this thread",
        "score": 17,
        "url": "https://www.reddit.com/r/linuxquestions/comments/1dfozjj/which_distro_should_you_choose_ask_in_this_thread/",
        "content": "To prevent having multiple daily threads repeating variations on this same question, we are asking everyone seeking help in choosing a distribution to ask in this thread, or at  r/DistroHopping or r/FindMeALinuxDistro. \n\nEach response to this post should be a question asking for assistance. Each comment in reply to those should be helpful. All other comments will be removed.",
        "num_comments": 58,
        "comments": [
            "hi im looking for a good distro for gaming on a modern pc. i really like hyprland so its instantly locked to a few distros. i also use fedora for school already but im not sure if its good for gaming. so fedora, nixos or a arch distro?  \nor are there completely other distros i could consider?",
            "I'm using ubuntu right now i was wondering if there was anything else better for performance and gaming and that stuff or should i stay with ubuntu.",
            "[https://distrowatch.com](https://distrowatch.com) helps chosing the distribution that fits your needs and favor.",
            "Hi I'm looking for a distro that's able to run pretty much any windows apps and works similar to the steam deck (almost everything working fine and polished and pretty much everything just ''works'') Thanks in advance.\n\nI mainly use Adobe software and Clip Studio Paint + steam games",
            "hi i have a lenovo ideapad 114igl05 that i use for school work and very very light gaming (risk of rain 1) what would be a distro thats light  to put on it to replace windows 11 as i already know it will begin to slow down",
            "Is there a windows like Linux os that is easy for beginners?\n\nI'm very used to windows and the way it handles programs and files, and I would like a Linux os that is very similar.\n\nI heard about Windows 11 Microsoft recall, which feels very unsecure. It's opt in for now, but they'll likely activate on Windows update in the near future and I don't want it.",
            "I ran a server on the internet: apache, mariadb, php, postfix (with dkim, dmarc, tls, rspamd), shorewall, munin for monitoring, vsftp (I know, I know…), Bind, fail2ban, dovecot.\nSo what distro should I pick?",
            "Recommendations for a distro for my Alienware laptop?\n\nIn 2019 I bought a Alienware 17 R5 i9-8950HK, QHD, GTX 1080OC, 32GB RAM, 256GB SSD+1TB HDD. For $3000 USD. I hate it. I wanted it to be an everything laptop. Games, SteamVR, and the WSL (Windows Subsystem for Linux). Bad idea. Laptops aren't that expensive. I now wish I'd bought a few cheaper systems for their own purpose. But here I have this expensive ol' thing with pretty OK specs. It's full of Alienware everything. Almost like half Windows 10 Pro, half Alienware. I wanted it to power my Steam VR games with my old Vive Pro. But now I use the Meta Quest 3 and have a desktop that can power Steam VR both on my old timey Vive and on my Quest.  I'm a 20 year developer who existed mostly in the B2B space as CTO of a small company of 10 people. We sold to private equity a couple years ago and I'm now doing a startup. I had an Ubuntu laptop as my main daily computer for about 3 years, and tragically it was stolen about 5 years ago. I seriously think about that laptop a lot. The simplicity. The no BS performance. Living on the command line. Not Windows. Especially not Windows 11.  \nMy usage/wishlist would be:\n\n1. Lots of cloud infrastructure design and building. AWS, Azure, etc. Automation scripts. Nothing performance heavy.\n2. Code reviews. Administrative oversight. Approving merge requests. No Microsoft software except VSCode. For Azure I have a secondary Windows box to do PowerShell and MSSQL if we ever choose to use those. Emails, documents, correspondence.\n3. Steam VR that I occasionally pipe to my Meta Quest via Steam Link. It's fairly supported on Ubuntu. ( [https://help.steampowered.com/en/faqs/view/18A4-1E10-8A94-3DDA](https://help.steampowered.com/en/faqs/view/18A4-1E10-8A94-3DDA) )\n4. I would love to utilize my video card and specs because I love to toy with 3D modeling and audio/video production. I have a separate tower computer for these things, but I dream of going open source completely.\n\nI love this sub so I figured I'd ask here. Yes. That's a velvet painting of E.T. with a Coors.\n\nhttps://preview.redd.it/fe8v22dyef7d1.jpeg?width=2087&format=pjpg&auto=webp&s=9b0a3cd8c4ae7cb1dd69482226bb06aa7d103e61",
            "Admin if you are listening, please un-archive older posts. Linux related answers are quite debate worthy and I get extremely frustrated when I know a answer or have some contribution that I can make only to realize that the post is archived!!\n\n  \nPlease turn off auto archive by default!!! ASAP!",
            "A friend of mine has an Intel Celeron N3010 Dual Core 1.04 GHz notebook, with 4GB of RAM and a 32GB SSD. I tried installing Lubuntu 24.04, but it ran significantly slower than Windows 10. However, Windows 10 takes over half of the SSD.\n\nI'll be trying a minimal NixOS install with XFCE. Does anyone have more distro and desktop environment suggestions?",
            "Hi everyone,\n\nI have an old Dell laptop with the following specs:\n\n* Dual-core Celeron CPU\n* 4GB RAM\n* 128GB SSD\n\nI want to repurpose this laptop into a portable DVD player for my 90-year-old grandpa. He loves borrowing DVD movies from the library and watching them. Despite his age, he's quite tech-savvy, but I want to make this as simple as possible for him.\n\nIdeally, the laptop should:\n\n1. Boot directly into a DVD player software when a DVD is inserted.\n2. Be easy to shut down and reboot, returning to the DVD player mode each time it starts up.\n\nCould you please recommend:\n\n1. A lightweight Linux distribution suitable for this old hardware?\n2. DVD player software that can auto-play DVDs on boot and is user-friendly?\n3. Any additional tips or tricks to streamline this setup for an elderly user?\n\nThanks in advance for your help!",
            "Hi everyone. I want to install linux on a couple of computers. One is a modern laptop with 12-gen intel processor (12700h) and nvidia 3050ti for laptop. The other one is a desktop with i7-9700 and nvidia 1050. I would like to have the same configuration on both. I have used linux for decades, but cannot say I am expert. I want a lightweight distro  with good batery life, that does not come with a ton of preinstallated software. I can accept to spend some time during the installation process, I prefer to have a trouble-free life after that. Here is the list of proprietary applications I will use\n\n-Chrome Browser\n\n-VsCode\n\n-Mathematica\n\n-Dropbox\n\n-Outline (VPN)\n\nThe rest should be well supported on any distro: some installation of python, jupyterlab, texlive, calibre. I also need a fast pdf-viewer as I may open heavy pdf files. Full wifi, bluetooth and USB functionality is a requirement. Basically I won't use any other sofrware or hardware.\n\n  \nWhat distro would you suggest me? I have tried manjaro sway in live version. I like the look and concept a lot, but:\n\n1- Bluetooth didn't work\n\n2- I am a bit suspicious that I will need to install X11 in any case due to some app compatibility.\n\n  \nThanks in advance for any reply.",
            "Linux for Eee PC 900? \n1.99 gb RAM and 900mhz\n\nWhat is the most user-friendly Linux that could be installed on it (for the tech illiterate) and work somewhat ok/not insanely slowly?",
            "Hi everyone, I’m tired of windows spyware and I want to move to linux. However, I have a few criterias:\n- I really like KDE, so preferably a distro that supports it well\n- I’m running a nvidia GPU (rtx3060ti), so I’m not sure which distro would be good for it?\n- I’ll mainly be gaming. I also need to use Visual Studio for work, but since linux doesn’t have support for it I’ll probably have to dual boot.\n\nI’m currently thinking of debian or pop os. I would’ve just ran with debian but apparently it has slow updates or something so I’m not sure how I feel about it. As for pop os, I don’t really like their cosmos thing, so if I ran it I would probably just install KDE. Not sure how well it would run though.\n\nThank you!",
            "Is there a Lazy Linux? For the completely useless type that wants almost everything done for them, except give them complete command of the computer software/source code, if so desired.\n\nI've automated most of the updates for Linux Mint but still it's annoying every single few days/weekly to update manually. I'd like to consider something like a console system from the 1980s or 1990s; buy it, put cartridge in, play game. \n\nNo more than that. If it updates everything automatically and makes a backup of 24 hours as well, perfecto!",
            "Hi, I bought a new SSD drive and will install a linux distro on it. I'm a NOOB and would appreciate any advise as to which one to choose or how to configure it.\n\nMy computer is old (10 years+) 8G RAM, NVIDIA GTX 1050 TI I can not afford to buy a new one.\n\nI've been using Ubuntu 22.04 jammy so far. I like the way it looks. Before that I used Win7 for many years, and prefer Ubuntu.\n\nThis being said I find Ubuntu a bit slow and lagging at time, especially on the net, might be me not doing something properly or my old harddrive, which is why i bought a new one.  Libre office is a bit slow too, and not very smooth, especially when scrolling, and searching for a sentence, or doing multiple change or correction.\n\nI've eye impairment, and need an OS which i could easily configure to minimize eye strain, I really loved F.LUX unfortunately it appears not to function with Ubuntu. I need my computer and internet to be on dark mode all the time, which might be why it is slow. I would need to be able to switch easily to vocal command, and to use speech to text, and text to speech, which i was not able to do with Ubuntu.\n\nI'd like to install a virtual box, so as to be able to use word, and some such software.\n\nBesides internet and VLC, I use Libre Office and Twine a lot. \n\nThank you.",
            "Greetings.\n\nI want to fully switch to Linux. Have been a windows user since I got my first PC 19 years ago. I have very little experience in Linux, I run a webserver at home with Debian/LXDE and had Arch installed on a Raspberry PI to build some robots in the past.\n\nWhat am I looking for?\n\n1. Easy to maintain and kinda future proof (want to stay with the same setup for years to come, run an update here and there)\n2. Using Unreal Engine for gamedev (I have never built or run it on Linux, I'm sure there will be a lot of potential issues)\n3. support for NVidia GPUs (is this a problem?)\n4. Godot/Blender/Inkscape/Gimp will not be a problem I guess. \\*\\\\o/\\*\n5. A nice UI - KDE, Gnome or Cinammon? Which of them would be the most easy to customize and potentially setup hotkeys to switch between applications/desktops)\n6. Once I customize everything, install all dependencies and whatever, is it possible to create a backup of the whole system so if my harddrive crashes I can instantly boot from the backup with the same configuration and continue working?\n\nUE has some recommendations but I don't know how much they limit me in choosing a Distro:  \nUbuntu22.04/CentOS  \nkernel 3.x or never  \nglibc 2.17 or newer  \ncompiler clang 16.0.6  \nIDE VSCode, Rider\n\nThank you for your time.\n\nEDIT: Personally I like Debian's philosophy over Ubuntu, but I'm not sure if it will be much harder setting Unreal up. Especially when it comes to more \"fancy\" stuff.",
            "I am not sure this style megathread works because there arent that many replies. I suspect because people dont continue to come back to this thread. It might be bettter to just point people to other subreddits or let people ask this question normally because it might be more effective if members see notifications",
            "What's up?\n\nBecause my computer can't run Windows 11 because it doesn't have TPM 2.0, and because Windows 10 reaches its end of life next year, I was thinking of making the switch over to Linux. But before that, I plan on getting an external hard drive (possibly around 2-3 TB in size) to move all the files and programs I installed on Windows t6hat I feel like would be needed to make the migration. I also haven't really used a Linux distro since I moved from Kamloops, British Columbia to Duncan, British Columbia in 2017 (the schools I went to in the former city had some form of Ubuntu, if I recall correctly)\n\nWhich distro should I use? Here's what I want:\n\n1. Something that's familiar to Windows users.\n2. Support for nVidia GPUs\n3. A UI that's easy to navigate (might be part of the first point?)\n4. Customizability (something Windows has lacked since moving over from Aero to Metro in 2012)\n5. It would mostly be for using Photoshop, playing games on Steam, talking to friends on Discord, browsing the Web, emulating old video games, and most importantly, running older PC games that don't really work on Windows 10 (looking at you, NHL 2001 and NHL 2002.)\n\nOnce again, I ask: What Linux distro should I use? Here are my specs:\n\nProcessor: Intel(R) Core(TM) i5-10400 CPU @ 2.90GHz 2.90 GHz\n\nInstalled RAM: 16.0 GB\n\nSystem type: 64-bit operating system, x64-based processor\n\nDirectX version: 12.0\n\nGPU processor: NVIDIA GeForce GTX 1650\n\nDriver version: 527.56\n\nDriver Type: DCH\n\nDirect3D feature level: 12\\_1\n\nCUDA Cores: 896\n\nCore clock: 1620 MHz\n\nMemory data rate: 12.00 Gbps\n\nMemory interface: 128-bit\n\nMemory bandwidth: 192.03 GB/s\n\nTotal available graphics memory: 12255 MB",
            "This is dumb.",
            "My kid's grandma(59F) bought a $800 laptop with a 3060, this was for AI art and gaming with her grandkid. \n\nWe can't use Debian-family, because she often buys bluetooth based hardware from Amazon. \n\nWe can't use Fedora because the yearly upgrades are too hard to maintain with an Nvidia card for someone who is afraid of the terminal.\n\nShe can't use Windows because the privacy stuff, ads, etc... are too hard to disable for grandma.\n\nShe can't use Mac because they don't have Nvidia card support.",
            "If you're comfortable with it, I'd recommend stock Arch or Artix.",
            "Definitely Fedora, amazing even for gaming (or any fedora based distros)",
            "If you need performence, maybe check out switching your desktop environment. Last time I checked, Ubuntu used GNOME by default and from my experience it takes up a higher amount of memory. Switching to a lighter DE (or wm) can decrease ram usage by around 1-2GiB (at least from my experience). Personally, I would recommend checking out xfce, lxqt and dwm (although dwm isn't exactly a beginner friendly wm).",
            "If it ain't broken, don't fix it.",
            "Performance will not differ from the distribution; the distribution itself does not affect performance.\n\nThe impact of the desktop environment on performance is negligible on any reasonably modern system. The default Ubuntu experience is sufficient and is the environment on which Steam and Proton are tested.",
            "Thank you for this.",
            "[WiNE](https://www.winehq.org) can run almost any Windows app. I don't use Adobe software, but I frequently hear only Photoshop and sometimes Illustrator (iirc) run on GNU/Linux.\n\n\nAny distro can run Steam games, as long as they don't run Vanguard Anticheat. Some games ban you if you're on GNU/Linux, though. Maybe take a look for gold and platinum titles [here](https://www.protondb.com).",
            "The desktop environment is more important than the distro for lightweightness. I would recommend LXQT for a DE. A lot of people will recommend XFCE, but since they switched to GTK-4, they stopped being so light.",
            "> I'm very used to windows and the way it handles programs and files\n\n\nDo you mind elaborating on this? I advise Linux Mint Cinnamon. Incredibly stable, and Cinnamon is the Plasma of GTK.",
            "What distro for a server? Debian is very stable. My friend's server is Pop!_OS, though, and it works great. Anything with Debian as a base really.",
            "I'm surprised Lubuntu didn't work.\n\n\n> I'll be trying a minimal NixOS install with XFCE. Does anyone have more distro and desktop environment suggestions?\n\n\nNo suggestion here, but be prepared for XFCE to take up more disk space/RAM than it used to/Lubuntu would have iirc.",
            "> A lightweight Linux distribution suitable for this old hardware?\n\n\nLinux Mint Cinnamon. I've always said Cinnamon is the Plasma of GTK. Plus, Linux Mint is incredibly stable.\n\n\n> Any additional tips or tricks to streamline this setup for an elderly user?\n\n\nMost desktop environments support startup applications.",
            "any Linux Mint distro. Maybe XFCE desktop Environment for low CPU/RAM usage. But the other flavours are not very hungry on resources either.  Or Debian with XFCE. There is also a Mint that is based of Debian instead of Ubuntu.",
            "Puppy? AntiX?",
            "You should look into an distro with xfce or lxde. Both work really well on computers. Lubuntu or Xubuntu probably is going to work the best for you. With accessibility they have some good features but any distro I think will require a bit of tuning for you.",
            "Switch to XFCE on your current Ubuntu. \n\nhttps://linuxconfig.org/guide-to-installing-xfce-desktop-on-ubuntu-linux",
            "Imho that would be openSUSE Tumbleweed with KDE Plasma - openSUSE is the best known to be natively supporting KDE + it has admin tools, nvidia is straightforward installation, steam runs, games runs, customization provided natively by KDE. You have widgets, you can literally put system monitoring on your screen, its very windows(ish) - On top of that openSUSE is supported by SUSE company, which brings you premium/enterprise quality out of the box.\n\nIf you'd like a more stable (but a bit behind in updates) then Leap, it uses sources of SLE (SUSE Linux Enterprise) which gives more security and stability in the long run.\n\nTumbleweed also has a so called Slowroll (my personal favorite which I'm currently using), which is not that bleeding edge as Tumbleweed itself, but faster than Leap (so its somewhere between the two) - Slowroll receives updates that Tumbleweed received, but with 2-4weeks delay, giving it more time to test, but at the same time being updated more frequently than Leap :)\n\nHere's in a very basic nutshell of how openSUSE hierarchy of upgrade works:\n\nTumbleweed stays on edge receiving updates via snapshots through automated openQA ---> This gets further tested, and gets into Slowroll ---> This gets even further tested and gets into Leap <---- at the same time getting security updates from SLE.",
            "Just so you know, you can hack the registry check: https://www.tomshardware.com/how-to/bypass-windows-11-tpm-requirement",
            "You may try OpenSuse Aeon. Its immutable version of Tumbleweed, so is rolling and always stays up to date. If you find immutability an issue, then go for Tumbleweed proper.",
            "Ubuntu or Mint may work more readily with the bluetooth hardware than Debian itself. The same would apply for Nvidia, too.",
            "Either go with Ubuntu or Universal Blue.\n\nI think Universal Blue is a solid choice for her.\n\n\n\nIt's great for basic needs, super stable, and easy to use. Its structure resembles that of Android/iOS, featuring an immutable base where applications are installed through a sandboxed app store. Universal Blue comes bundled with essential graphics drivers, and for laptop users, it automatically applies specific patches.\n\nIts rollback feature ensures reliability; if an update causes issues, simply revert to a previous state.\n\nUniversal Blue boasts various versions, and switching between them is effortless thanks to the immutable base; just execute a single command. The Universal Blue Discord community is also exceptionally supportive. Notable Universal Blue variants include Bazzite for gaming enthusiasts, SecureBlue prioritizing security and privacy (albeit with potential app compatibility issues), and standard images for those seeking a dependable, minimalist desktop experience. If Universal Blue intrigues you, I suggest giving it a try; if you need help, just hop on their Discord. If you prefer a more standard experience, go for Ubuntu or Fedora.",
            "yeah but isnt it kind of unstable? i dont want it to break randomly after a update (but ill use it as dualboot with windows so its not too bad)",
            "Moksha",
            "Thank you. Would you have any recommendation regarding tuning, one see so many things on the net, that's it's a wee bit difficult to now what to trust. I recently read some people complaining about Snap for instance, I've no idea why, and don't exactly understand it, which make it confusing.\n\nThanks again, I'll have a look at it.",
            "No idea what it is, I'll have a look at it, thanks for providing the link.",
            "https://preview.redd.it/1dl3cvfn5u7d1.jpeg?width=4032&format=pjpg&auto=webp&s=5cb346158718ae5778087e25c30482a1e6dd009f\n\nI was going to try this one, but installing it on any drive other than the one Windows is on gives me the error message at the top.",
            "Alright.",
            "No, I've tried this. Ubuntu and Mint are on the same Kernel as Debian.",
            "If you're new to Linux, it's best to avoid Arch Linux. Stick with either Fedora or Ubuntu. Personally, I'd go with Fedora since it comes with better security settings right out of the box.\n\nIf you're thinking about using Arch, you need to be ready to secure and maintain your operating system. Arch needs users to set up their security, and that might be hard for new Linux users. The AUR is helpful, but it's all software from other people, so you need to check the package builds to make sure each package is safe. Here are some extra resources:\n\nhttps://privsec.dev/posts/linux/choosing-your-desktop-linux-distribution/\n\nhttps://www.privacyguides.org/en/os/linux-overview/#arch-based-distributions\n\nhttps://wiki.archlinux.org/title/security",
            "The Edge kernel on Mint (and I believe Ubuntu has options for new kernels) is not the same as Debian stable's kernel. There is backporting in Debian, too, but that's a little more complicated than you might like.",
            "Haha well you can always configure your own kernel",
            "i wouldnt consider myself new to linux anymore. i used endeavour for i think it was a month, switched to fedora (had a wifi problem on my laptop and ended up fixing it on fedora but in the end i also could have solved that in endeavour but didnt switch back) so im using fedora for like 2 months daily for school and my own stuff but on my main pc i use windows. im not the guy who says thaz linux is the best amd everyone should use it but since windows updates are just getting ridiculouse i dont want to use windows anymore (only dualboot just in case). \nlike i said before i love hyprland and i customized a lot (like everything you can do). \nso i liked fedora but i think i will try arch directly (not with eos) and yeah i know about the aur but im not too much into security so yeah, have to look that up and thank you for those links!\n\nEdit: but on the other hand i dont want to maintain my system all day. in the end i want to use it and program and play on it thats one of the main reasons why i struggle wether to use arch or maybe fedora or something else",
            "This is for grandma...",
            "If you prefer to avoid system maintenance tasks like setting up MAC, boot, and kernel hardening, simply opt for Fedora and install Hyperland. There's no issue with choosing a beginner-friendly distribution; I've been using Linux for more than a decade and personally use Fedora. Even Linus, the creator of Linux, uses Fedora.",
            "yeah i think thats what im going to do! thank you for helping me! :)"
        ]
    },
    "Using non Google services for a month.": {
        "title": "Using non Google services for a month.",
        "score": 147,
        "url": "https://i.redd.it/hmhnekqf8y7d1.png",
        "content": "I am going to be using these alternatives of the Google Products/Services/Features from 1st of July, 2024 to 31st of July, 2024. Since I already use Firefox instead of Chrome, that'll be easy for me. Finding an email client was a bit hard, but I ended up choosing Tuta mail.\n\nI won't be able to switch to Tuta mail completely because I am in the process of college admissions, and I already gave my gmail ID to the college, so that will be an exception for this challenge.\n\nIf you guys have any suggestions for an alternative, do let me know before 30th of June. I will post again here after I am done with the challenge to update on how the challenge went.\n\nThank you guys, in advance, for the suggestions.",
        "num_comments": 115,
        "comments": [
            "F-droid appstore is pretty good, all open source as well",
            "Proton mail is much better",
            "Just install lineageOS with microg.\nIt's a fork of lineageos that have microg installed by default.\nMicrog can act as google services so you don't miss anything",
            "OSM is great, lacks Street View and Satellite Imagery, but overall detail is better than Google and get updates very fast since it's crowdsourced:\n\n[https://www.openstreetmap.org](https://www.openstreetmap.org)\n\nOSMAnd Map, based on OSM, you can do routing and there is a mobile app for it too:\n\n[https://osmand.net](https://osmand.net)\n\nI understand, it's just a temporary test but if you want something longterm, then also consider hosting your own Nextcloud. If your ISP allows port forwarding, you can run this on Raspberry PI or some old Dell Micro.",
            "For email, use k9. Its the most well supported and privacy respecting email client. For e2e, tuta is fine but consider proton. \n\nAvoid use \"alternative\" frontends for anything. Youre expanding the number of people you must trust. Now instead of trusting f-droid, you also have to trust the frontend maintainers. Its not worth it. Just use f-droid and aurora if you absolutely need proprietary apps. \n\nFor MFA, use Aegis. FreeOTP / AndOTP is fine, but Aegis has the best support for encrypted exports.\n\nAndOSM for maps is fine. Organic maps is like a simple version of andosm. Both are good.\n\nFor cloud backups, syncthing is fine. Preferable syncthing over a private network (like tailscale, if you have the skills you can run your own control server via head scale).\n\nIf you have the skills, Davx + radicals (caldav/carddav server) works well. Preferably on a private network (I.e. tailscald). Alternatively, nextcloud might be easier to setup..\n\nAntennapod for podcasts. Best app.\n\nAuxio for local music. \n\nBitwarden for passwords.\n\nNewpipe for YouTube. \n\nLogseq for notes (not on f-droid yet but installable from izzydroids repo or from source)\n\nMedito for meditation (Foss, installable from.source or aurora).\n\nFast n fitness for tracking lifts\n\nPedometer for steps \n\nRunner up for tracking runs.\n\nFirefox / web apps for twitter. Tusky for mastadon.\n\nFeeder for RSS feeds",
            "For keyboard, I prefer Heliboard.  You can get it from F-Droid.  Be sure to read the directions for some extras like gesture typing dictionaries.\n\nI see you have Clock You, also there is a CalcYou (no spaces) that is a good calculator.\n\nEDIT:  Link to Heliboard: https://f-droid.org/en/packages/helium314.keyboard/\n\nLink to CalcYou:  https://f-droid.org/en/packages/net.youapps.calcyou/",
            "- GrapheneOS for the replacement of Android stock OS (if your phone supports it),\n\n- F-Droid to replace PlayStore,\n\n- FreeOTP+ to replace any \"Authenticator app\",\n\n- OSMAnd to replace google map,\n\n- GraphHopper for directions too,\n\n- K-9 as a multi purpose email client,\n\n- Weather by BeoCode, to replace any weather app (it has widgets),\n\n- I am using proton, so I got my ProtonCalendar / Email / PasswordManager / VPN with them so...\n\n- Firefox (you are using it already),\n\n  \nWith that, you should be quite good for the month!",
            "Obtanium is a really nice open source app for installing apps directly from source. One of the approved sources is F-Droid if you can't find APK sources anywhere else. I've really been loving it.",
            "Why would you need Aptoide if you got Aurora Store?",
            "CLOCK YOU 🔫 sounds like an threat",
            "Why is all this Android stuff posted in r/linuxquestions? You can technically run Linux in Android I guess (on top of Linux) but it’s pointless, like running Linux inside Firefox or Chrome.",
            "I love Startpage.com as a search engine",
            "My suggestions K-9 Mail, Duckduckgo, Here WeGo(Maps), KDE Connect (for using phone as a remote)\n\nServices: Proton Mail, Proton Calendar\n\nMy weather app is the perfect solution, but it's Germany only afaik, maybe your country also made a one pay only solution. It's called WarnWetter, made by a state institution, was free but private providers sued them to not offer it for free. The buy it once, keep it for ever is still far superior to the data mining of other apps.\n\nThe only Google Service I can't give up is YouTube, so I've got the NewPipe App at least.\n\nIdk if an of those would fit your needs, but I am using that setup since December 2022 (except K-9 Mail, switched to that after learning about how intrusive the Outlook app is) and it fulfills my needs.",
            "Which launcher are you using?",
            "You already have apps picked out for these, but I'll throw in which ones I like using: \n\nHeliboard for the keyboard. It's private, got good autocorrecting, lots of customizability, and even had swipe (although that does require finding a file online somewhere) \n\nI use QR Alarm. You can set it so that you have to take a picture of a QR code or barcode (i use a spice jar label in my kitchen) to turn it off. It's fairly barebones, but it's got all the features you need and the dev seems to be pretty active with it. \n\nI see you have notally. I haven't tried that one, but if you want something with more capabilities, check out Joplin. It uses markdown, so you can do quite a lot with it. \n\nGood luck with your journey! Please let us know how it goes.",
            "Personally I have had issues with the alarms of Clock You on Android 13 on a Moto G32 so you may want to test them a bit before you rely on it. Clock from fossify has been better for me lately, though I did have issues with it in the past as well. \n\nAs for email clients, I personally use FairEmail, I just found out the project was temporaraly dropped and resumed soon after but I have had no issues with it. I have not tried K-9 though.",
            "I'm a LineageOS user for 6 month and I'd like to share some tips with you.\n\nApps: OpenCalc, Lawnchair 14 (GitHub version), HarmonyMusic (YT Music just free), HeliBoard (Best Android Keyboard), K9-Mail, Rain (Weather App), Doable (There is Pride propaganda but it can be disabled fortunately), Metro (local Music Player, MJ PDF, OSS Document Scanner, LibreTube (YT Frontend with Premium Features & no tracking)\n\n  \nEDIT: Chrono is the best Clock App for Android.\n\nIf you still need some App suggestions or any other questions just ask, I'll be happy to help.",
            "Why did you choose to ditch Google?  \nTuta: is it a Tutanota client? Is it free?",
            "I've recently degoogled and these are the absolute best alternatives I could find for each category:\n\n-App Store: Droidify\n\n-Keyboard: OpenBoard\n\n-Photos: Ente Photos or Immich (self hosted)\n\n-Files: Material Files\n\n-Mail: K-9 Mail, Ltt.rs if your email supports JMAP\n\n-Maps: Organic Maps\n\n-Weather: Breezy Weather\n\n-Password Manager: Bitwarden (self hosted)\n\n-Authenticator: Aegis\n\n-Calculator: OpenCalc",
            "!remind me on 1st August",
            "Honestly Proton Mail is what I use for most things but I still use a couple Gmail accounts too, just shit like you said with school etc etc. If your wanting to remove the Gmail from your phone you can still do that. It won't effect your actual Gmail account, just your phone. Pull up your browser & sign into Gmail like that. Or have your Gmail forwarded to a new email. \n\nAre you trying to Degoogle your whole phone by chance?",
            "[email](https://www.youtube.com/@LukeSmithxyz/search?query=email%20server)\n\nDebian's repos have an application for any need.\n\nSearch open directories with duckduckgo or other engine for music/movies/whatever.\n\nOpen Street Maps.\n\nhttps://www.youtube.com/@robbraxmantech has a lot of google alternatives, but his focus is on phones. Still.",
            "What are Aptoide, Tuta , Notally & AnySoftKey...?",
            "How can i degoogle my phone? :'(",
            "Bro try installing some gsi rom but make sure you have to know what you are doing",
            "Try organic maps instead maps.me",
            "Why use maps.me? Organic maps is fork from maps.me and from original developer maps.me.",
            "Im on iOS for one single reason:\nThere are no standard apps on Android without ads. This makes me go mad so badly. Not even a calculator or data explorer without annoying shit on there.\nI didn't like iOS very much as well for all these horrible and stupid limitations but it got better and my vpn services just work much more practically than on Android. \nBut once there will be a real fedora for phones, I'm gonna switch quicker than Apple releases a new device with old features presented as new.",
            "I am using Droidify, which is just an F-droid client with material you. So, I am covered with that.\n\nThank you for the suggestion, though.",
            "I know, but as an extension of the challenge, I am going to make new accounts on Twitter/X, Twitch etc, and for that, I have to pay a premium. So, I am not considering it as of now.",
            "Do they have an app?",
            "I would love to, but my phone does not support custom roms.",
            "Can you name almost any phone that came out in the past ~3 years which supports CDMA networks and custom ROMs?  There might be a few, but they are extremely far and few between.  That's assuming it isn't something straight from China.  \n\n___\n\nGrapheneOS is unfortunately the best we have.",
            "I tried OSMAnd and Maps.Me to see which one is better, and in my testing, Maps.Me had better accuracy with the public transport, and the other parts were basically the same. So, I'm going with Maps.Me. Thank you for the suggestion, though.\n\nAnd as for hosting my own nextcloud, I might do that in the future, but as of now, the first priority is to get a laptop/PC for myself.",
            "Hey thanks for this suggestion, I didn't realize OSM had an android app!  I installed it on my phone and started doing some configuring, including [this reddit thread on adding live google traffic date](https://www.reddit.com/r/openstreetmap/comments/11i7la0/how_to_add_live_traffic_to_osmand/) (which may not appeal to OP's project but is useful for me).  I'll have to give it a try next time I'm out.",
            "I recommend Organic Maps in place of OSM. I can't recommend OsmAnd when it looks, feels, *and* works so poorly, especially in android auto.",
            "Chrome based browsers are better on Android",
            "I'll check both of them out. Thank you!",
            "Also a big fan of heliboard. Definitely my favorite on fdroid.",
            "I would have loved to try out GrapheneOS, but A) My phone does not support it and B) even if it did, idk if I am willing to do it on my primary device. If this was my secondary device and it had supported it, I would've tried it.\n\nUsing Droid-ify, which is an F-Droid client.\n\nUsing Maps.Me over OSMAnd because of the accuracy with the public transport.\n\nNot usually a weather app user, but I will give it a go.\n\nThe rest, I will definitely check them out.\n\nThank you for the suggestions.",
            "Question \n\nI develop with qt in the past making widgets on Linux and dipped into gdk4 and now looking at EFL. Would any of these work on android? I assume at least qt6 HAS to. \n\nSo like what if I made productivity apps that could be moved around the honescreens and wrapped around other apps with transparency. Would people be interested in this?",
            "Graphene os is only supported by the latest pixels",
            "- Use Aegis instead of FreeOTP\n\n- Use Obtanium instead of F Droid when possible\n\n- Dont use Firefox on Android\n\nYou gotta give better advice man.\n\nKeep downvoting me clueless idiots.",
            "I will definitely check it out. I am using Droid-ify as of now, but if I like Obtanium better, I will use it over Droid-ify.\nThank you for the suggestion.",
            "Idk if using Aurora store is a cheat or not, because it is basically a Play Store client. So, I'm stuck on which one to use",
            "Haha",
            "Or [searxng](https://searx.be)",
            "Using Nova launcher as of now.",
            "Switched to Heliboard today by another person's recommendation, and I like it more than the Any soft keyboard.\n\nI will try out the QR Alarm and the Joplin apps.\n\nThank you for the suggestions. I will post the results of the challenge.",
            "I will try both of them and come to the conclusion of which one to use.\n\nAs for email clients, I will try FairEmail and check if it is better than the Tuta Mail or not.\n\nThank you for the suggestions.",
            "Thank you for all the suggestions. I will try them out and for sure.",
            "A) I want to see if I can live without Google, because I want to have as much privacy as possible. Avoiding Google is the first step in the process.\n\nB) Yes. Tutanota has been renamed to Tuta if I'm not wrong. The free tier has 1gb of storage, which is more than enough for my use.",
            "Thank you so much for the suggestions.",
            "Will do",
            "As of now, I won't completely degoogle my phone. I am running a YouTube channel off my phone, so, I do need the Google services. As of now, I am taking a break from the channel due to personal reasons, but I do need it in the future.\n\nProton mail is reliable, yes. But as an extension of the channel, I am creating new accounts for Twitch, Twitter/X etc to see if I can avoid Google as much as possible. When I tried to create a Twitter account using the Proton mail, I was redirected to an upgrade page on the Proton mail app. Turns out, I need a premium to use the mail ID to create accounts on social media. So, I passed on Proton mail and instead chose Tuta mail.",
            "I tried out  Open Street Maps, but the details of the public transport were not good enough, so I decided to go with Maps.Me. I will definitely look into the youtube videos you have recommended. Thank you for your valuable suggestions.",
            "Aptoide and Tufa are not open source.\nAptoide is a 3rd party app store for android and Tuta is for emails.\nAnysoft Keyboard is open source, though, and is a keyboard app I chose to replace Gboard.\nNotally is also an open source app, which is a note taking app",
            "I will look into it. Thank you for the suggestion.",
            "I learnt about Organic maps today. I am testing both of them to see which is more accurate so that I can decide by the time of the challenge.",
            "Both my stock calculator and file explorer are ad free on my pixel.",
            "None of the standard apps on Android has ads.",
            "It means you have chosen the wrong phone or the wrong apps, or maybe both.",
            "Oh, I see. I didn't know about that.\n\nI can suggest e-mail client too [https://f-droid.org/packages/com.fsck.k9/](https://f-droid.org/packages/com.fsck.k9/)\n\nManaged by Mozilla just like Firefox. I've been using it for some time now and it works great",
            "Proton mail is fine (for one month)\nI have been using it for 6 months now and juat 20% is used",
            "Obviously",
            "Wow. Than you may install microg plugins\nCan I ask what's your phone?",
            "Almost all the phones support ROMs(you have to unlock bootloader) and CDMA networks.\n\n\nGrapheneOS only works on Google pixel phone as long as I know.",
            "[Maps.me](http://Maps.me) is good too. Though I prefer OSM since I'm a cyclist and they have better, in my opinion. bike maps and UI and OSM is integrated with Ride With GPS app and service that I use. \n\nSo yeah, it was just a suggestion :)",
            "By the way, maps.me is russian software.",
            "OSMAnd Me is based on OSM data, but it's not the same people/company and is not officially endorsed by OSM. It's pretty good though, I just wanted to clarify that. It can do some neat things like creating and editing routes, saving and uploading GPS tracks, etc. Though some of that may require a paid version or a subscription. In the end I decided to stick with Ride With GPS since their app and website suits my needs better and also has OSM maps as a backend option for mapping.",
            "Don't confuse OSM and OsmAnd, they're two different things. OSM is the backend while OsmAnd is an app that uses OSM data. OSM is for maps what Wikipedia is for encyclopedias. There are many other mapping apps that use OSM data. Organic Maps actually uses OSM data too and it's a fork of maps.me.\n\nUse what works for you. It's good to have options:)",
            "How exactly?",
            "Graphene is super solid, best OS out there without a doubt. It even has a Playstore mirror which you can use anonymously, no login/account required and it works flawlessly (nothing like Aurora).\n\nI will never go anything else then a Pixel phone so I can run Graphene.\n\nAnd Droid-ify and other Fdroid clients often get issues over time, so as a backup I would install Fdroid just for safety/backup.",
            "For the record, I've been using graphene for a couple of years at this point and have noticed no usability difference between it and the stock pixel rom. The only thing I'm aware of that doesn't work (that I wouldn't use anyway) is google pay with tap. You can use it identically to a stock system with no downsides, at least in my experience, all with the added security+privacy benefit (and battery in my case).",
            "Grapheneos is life. with that even google apps get sandboxed instead of having full reign on the device.\n\nthey are also a major contributor to AOSP and will often get security fix faster than \"official\" ROMs",
            "Apps are sandboxed from each other.",
            "They aren't downvoting you cause you are giving advice, they are downvoting you because you are being unnecessarily dickish with your \"you gotta give better advice\" comment. Like why must you try to start shit, just say \"I recommend this instead and this is why, but do whatever you like\"",
            "Okay.\n\nI did.",
            "1) Why not Firefox? And, what do you recommend instead?\n\n2) Be nice while suggesting something.",
            "No problem, good luck on the transition.",
            "A) Can you be 100% sure in privacy and security in alternative apps?  \nB) Thank you. Been searching for a mail service myself.",
            "So y not use Aurora Store then?",
            "They are ad free in every Android",
            "I doubt it.. I've tried many different ones. The best was Nokia on classic Android, still not very good.",
            "Another vote for K9, I've been using it for awhile now on my phone, including connecting to Microsoft for my work email.  Haven't had any issues with it.",
            "I will definitely look into this. Thank you for the suggestions.",
            "Motorola G22.\nIt is a phone that was not launched in many places.",
            "It comes down to the preferences, at the end of the day.",
            "I know. That was one of the reasons I decided against it, but I didn't want to get political here.",
            "I know, I didn't realize I shortened OSMand to OSM by accident",
            "https://www.privacyguides.org/en/mobile-browsers/#mull",
            "Just FYI, GrapheneOS isn't a rom.\n\nhttps://discuss.grapheneos.org/d/9884-grapheneos-is-not-a-custom-rom",
            "Nah you have things like the discord and messenger bubbles that overlay them and can tweak those bubble settings. \n\nWould be like that, transparent overlay with text alignment that the user moves the anchors for.",
            "Obviously you can do whatever you like lmao, you dont need a stranger on the internet to tell you that\n\nIm being \"dickish\" because people like to recommend \"privacy tools\" that have flaws/issues to them.\n\n- You should not be using Firefox on Android due to the lack of basic site isolation.\n\n- F Droid often lacks important updates and often hosts software that is unmainted. It also lacks basic security standards.\n\n- FreeOTP doesnt offer encrypted backups. Aegis does.\n\nThese sorts of recommendations can be harmful and give people a false sense of privacy/security. Hence why they need to give better advice, or simply know not to give it at all.",
            "https://www.privacyguides.org/en/mobile-browsers",
            "Not all alternatives are private and secure, for sure. But the ones I am shortlisting, I'm making sure it is as private and secure as possible.",
            "Idk if using Aurora is a cheat or not, because Aurora is technically a Play Store client. So, is it really an alternative for the playstore? So, I'm confused on if I have to go with Aurora store or Aptoide, because Aurora store is really good.",
            "I use Motorola right now. Granted, Google, chrome and YouTube apps do have ads, but most of the other apps preinstalled do not. Plus, it is easy to find an open source alternative for most of the apps, granted there are quite a few which are not complete.",
            "maybe you can try installing GSI ROMs",
            "This is not politics, this is genocide. This is about russians killing Ukrainians because they want to destroy Ukrainians.",
            "Allright, makes sense :)",
            "Good to know, thank you.",
            "Again, no one is disagreeing with you. Just be more polite it isn't that hard",
            "You missed the whole point. \n\nOP was going to use non Google services for a month. I gave a list of alternatives I am using, that's it. Nothing more.\n\nOf course, I was all about suggesting the top super duper privacy/security James Bond like alternatives here. We totally can see that when I've put a ***weather application*** in that list...\n\nYou have been downvoted and someone even explained to you why, because that apparently hurt your feelings.\n\nBut still, you continue with your dumb ass attitude.\n\nI went to see your history and you are basically just posting incendiary comments all over the place.\n\nSo, to summarize, you are just a dumb edgy kids that didn't understand the context of the post.\n\nGet lost, loser.",
            "Thank you for the suggestion.",
            "You've said that \"your phone does not support custom roms\". How are you going to avoid Google then? You didn't mention in your post or I've just missed it. Also, what phone is it and what OS does it run?",
            "I prefer Aurora also it's OS.",
            "Where do you get them from? Not from the play store?",
            "Have you ever felt the touch of a woman before you manchild?",
            "Motorola G22: XT2231-2 with My UX based on Android 12. This particular model does not support custom ROM, as far as I've researched.\n\nI cannot completely avoid Google, for sure. This challenge is to see if I can live my life without relying on Google at all. I have disabled some of the apps. I know, it is not good enough, but with what I've got, this is the best I could do.",
            "OS?",
            "Play store does have a lot of open source apps available. But even if you don't, there are a lot of 3rd party app markets available to download apps from.",
            "Well, the bad news is that you simply use other alternative apps, but Google is deep inside into the system still collecting information, statistics, providing ads etc. etc. Only a custom ROM can completely ditch Google.",
            "Open Source.",
            "Oh okk."
        ]
    },
    "how to debug instant freezes": {
        "title": "how to debug instant freezes",
        "score": 2,
        "url": "https://www.reddit.com/r/linuxquestions/comments/1dlu793/how_to_debug_instant_freezes/",
        "content": "Hi\n\n  \nIt happens from time to time (let's say once per month) that my machine freezes completely and at once.   \nIt is an instant freeze: music stops playing mouse and keyboard are dead, all gui aps look frozen.  \nI cannot do a thing: no reaction to ctrl + alt +Fx nor to alt + sysrq + X.   \n  \n`journalctl -b-1` after the recent freeze:  \n`cze 22 13:28:19 Kicer systemd[1]: systemd-coredump@11-49340-0.service: Deactivated successfully.`  \n`cze 22 13:28:19 Kicer drkonqi-coredump-processor[49345]: \"/home/michal/projects/sources/broom/out/gcc/src/gui/gui_ut\" 49339 \"/var/lib/systemd/coredump/core.gui_ut.1000>`  \n`cze 22 13:28:19 Kicer systemd[1577]: Started Launch DrKonqi for a systemd-coredump crash (PID 49345/UID 0).`  \n`cze 22 13:28:19 Kicer systemd[1]: drkonqi-coredump-processor@11-49340-0.service: Deactivated successfully.`  \n`cze 22 13:28:19 Kicer drkonqi-coredump-launcher[49361]: Unable to find file for pid 49339 expected at \"kcrash-metadata/gui_ut.5df3c7c51ba249e49f56837666780644.49339.in>`  \n`cze 22 13:28:19 Kicer drkonqi-coredump-launcher[49361]: Nothing handled the dump :O`  \n`cze 22 13:29:14 Kicer systemd-coredump[49571]: Process 49570 (gui_ut) of user 1000 terminated abnormally with signal 6/ABRT, processing...`  \n`cze 22 13:29:14 Kicer systemd[1]: Started Process Core Dump (PID 49571/UID 0).`  \n  \nIt ends with an (expected) crash of an app I was working on. It looks like it was the last thing before freeze, but I cannot see why would it cause it. \n\nAny idea how can I investigate any future problems of this kind?   \nIt seems to me it is related to my hardware (I never had such hard freezes in the past, it started after a hardware upgrade I made about a year ago).\n\n",
        "num_comments": 0,
        "comments": []
    },
    "how to install chrome on debian": {
        "title": "how to install chrome on debian",
        "score": 3,
        "url": "https://www.reddit.com/r/linuxquestions/comments/1dlrbb1/how_to_install_chrome_on_debian/",
        "content": "hello all,\n\n  \nIḿ running a debian VM and decided to install chrome.  It gives me a .deb file. I googled around and the information I got is to open it via synaptic. I open via synaptic and synaptic opens and then nothing. \n\n  \nWondering if someone could give me some more direction? \n\nThanks.",
        "num_comments": 6,
        "comments": [
            "thought  I always used..\n\n\n\n\n        sudo  apt install ./whatever.deb",
            "wget https://dl.google.com/linux/direct/google-chrome-stable_current_amd64.deb\n\nthen\n\nsudo dpkg -i google-chrome-stable_current_amd64.deb",
            "> sudo dpkg -i google-chrome-stable_current_amd64.deb\n\nThis will not install dependencies.  Use\n\n    # apt install ./package-name.deb",
            "i think I got it. How do I open it now? The command finished and now what? Sorry for the basic quuestions",
            "Thanks!",
            "Should be in your list of installed programs iirc. Make a shortcut for it where you like or open it from there.\n\nDon't worry about basic questions. I had to do the exact same thing to install Chrome on Mint (Debian).\n\nThey do not make it easy as they seem to be not really that pro-Google.\n\nIt's also possible I gave incomplete instructions...because I had to Google it. \n\nOn Chrome."
        ]
    }
}