{
    "Slasher says Twitch reported Dr Disrespect to the National Center for Missing & Exploited Children": {
        "title": "Slasher says Twitch reported Dr Disrespect to the National Center for Missing & Exploited Children",
        "score": 793,
        "url": "https://kick.com/destiny?clip=clip_01J1HKC16R4SNG6CR70VAQ8ESE",
        "content": "",
        "num_comments": 273,
        "comments": [
            "The fact that Twitch reported one of their biggest profit generators to NCMEC tells you one thing, if Slasher's claim is true, the whispers must have been pretty damn bad.",
            "Can somebody explain the severity of that to somebody not from the US? What would put that above just reporting to the local police etc…?",
            "As much as I want Twitch to release the chat logs maybe it's better that they don't.",
            "Why is Slasher slowly saying more and more information? Out with it my dude.",
            "Keeps getting worse and worse, this whole thing is insane, especially the defense of this guy despite his story changing and getting worse and worse, it can’t be overstated how truly disgusting the amount of defense for this guy that’s going on. Twitch doesn’t just ban people for no reason, there’s been people who have shown nudity on stream, had sex on stream and only got a few day ban, twitch does not permaban people often especially not the face of their platform while they had a contract worth millions that would have been very lucrative for both parties. By his own admission he inappropriately messaged a minor and he has never said he didn’t know they were a minor which would obviously be his best defense and if that was the case he’d be saying it over and over again. No matter how you want to spin it, messaging a minor inappropriately is objectively wrong, trying to defend this person or rationalize it or downplay it simply because you like watching them play video games is just pure insanity. Can we not all agree inappropriately messaging a minor is bad? Are we all so divided that we can’t even agree on that???",
            "About Us section of NCMEC: \n\n\"The National Center for Missing & Exploited Children is a private, non-profit 501(c)(3) corporation whose mission is to help find missing children, reduce child sexual exploitation, and prevent child victimization. NCMEC works with families, victims, private industry, law enforcement, and the public to assist with preventing child abductions, recovering missing children, and providing services to deter and combat child sexual exploitation.\"",
            "How come everyone turns a blind eye to Nmplol grooming his gf when she was 16? Isn't that as bad, if not worse than this?",
            "How long did Slasher know about the NCMEC report?",
            "Can’t wait to see asmongold defend this.",
            "They are forced to report anything that is considered suspicious doesn't mean a thing. So many cases gets reported each day most ends up being a nothing burger. If Twitch had enough \"proof\" they wouldn't have settled. \n\nEspecially if no pictures involved or detailed meetup were discussed it's hard to get someone convicted. The only thing Doc has to worry about is his image, not the police."
        ]
    },
    "Dancantstream criticizes Slasher for refusing to publish the DrDisrespect information until the last minute": {
        "title": "Dancantstream criticizes Slasher for refusing to publish the DrDisrespect information until the last minute",
        "score": 1622,
        "url": "https://kick.com/destiny?clip=clip_01J1GJPE0E97XVH36XZNTV07MD",
        "content": "",
        "num_comments": 405,
        "comments": [
            "dan said it publicly before slasher did 😂",
            "Not blaming Slasher at all but he himself said he was trying to sell the story to an outlet that would back him but what changed recently? Did Bloomberg decide from a vague twitter thread to back Slasher story? Or did Slasher not have primary knowledge until recently.",
            "True aaaaaaaaaaaand... Yeah, that's pretty true. That's true and- yeah that's true. That's true. That's true- That's pretty true. That's pretty true, I mean- inhales ... That's true. Yeah. That's true. Uhm- That's true. That's fuckin' true. Uhm... That's how it is dude.",
            "Of course he wouldn't publish it without evidence, he would get sued. The dumbass thing he did was say that he knew the reason 4 years ago to bait everyone",
            "Funny how he's criticizing slasher for this right now but had a journalist who also had all this info from multiple sources weeks ago and had no issue with it. Even had private discussions with the dude before and after the stream about what doc did",
            "Unless Slasher had proof, that wouldn't require a lawsuit from DrDisrespect so Slasher could find it in discovery, then it was correct for him not to publish anything.\n\nIf the minor went to Slasher with the story though, that'd be a different story.",
            "Just get sued and win bro ezpz and not stressful or expensive.",
            "I feel like people here don't understand how powerful of an agency CAA really is. I'm going to go out on a limb and say they have buried shit worse than this. If you come after one of their clients. You better damn well be sure of what you're getting into.",
            "People here don’t understand how journalism works lol",
            "Slasher himself said he had multiple SECOND hand sources. Not FIRST hand sources.\n\nIf he broke a story with second hand sources his ass is getting a defamation lawsuit."
        ]
    },
    "Sketch runs into Dr. Disrespect": {
        "title": "Sketch runs into Dr. Disrespect",
        "score": 583,
        "url": "https://clips.twitch.tv/FrozenGlutenFreeTeaPJSalt-ZqySv10zOL_83Alm",
        "content": "",
        "num_comments": 47,
        "comments": [
            "he’s a little too in character 😭😭😭",
            "Okay the last few seconds of the clip saved it",
            "Too old for the doc.",
            "I can see why Sketch went kinda mainstream, he has really good timing.",
            "Dr D collab with Charlie Sheen in sight. New series Two and a half woman.",
            "The Dr loves a little miss steak 😉",
            "I mean he started with \"What's up daughters\" which was pretty on point.",
            "Why's it awful to say? He abused a kid. Call it what it is. ",
            "As sad as it is, no one can really get canceled unless they cancel themselves by never livestreaming or doing videos again. If he steps away for a few months or maybe even a year and starts doing content then he'll still have a massive audience. He can even cook up some fake apology and say that he's reflected on his mistakes and he's now a better man. He may also show his new dog or a new cool magic trick he learned. If people like zherka can have a platform then anyone can have a platform.",
            "Yeah hes done pretty much streaming wise. No fucking sane sponsor will take him under wings, after shit like that and the majority of viewers probably reconsider watching a cheating pedo I guess."
        ]
    },
    "the death noises in this game are truly gripping ": {
        "title": "the death noises in this game are truly gripping ",
        "score": 527,
        "url": "https://clips.twitch.tv/RockyComfortableWatermelonPunchTrees-zg01FIIrpzyeDktj",
        "content": "",
        "num_comments": 37,
        "comments": [
            "I'm gripping. Should I let it go or hold on?",
            "Firm gripshakes (one pump) chump",
            "I am from the future. \n\nIn 2040, the most popular game worldwide will be a hentai gachi arena based FPS.",
            "Livestream fails is actually consistently funny today. Nice",
            "I'm squeezing my hog to this. Gonna keep doing it even if you ban me",
            "I thought I was crazy because this is a trend I've been noticing in video games for couple of years now. Female characters straight up moaning when they take damage or die. You also almost never hear the actual harrowing screams that women are capable of producing, it's just fucking moaning.",
            "Not so firm anymore then huh PedoBearCD",
            "This one cracks me up the most",
            "If you follow the trends, the funny is when there is drama",
            "Actual resurgance with the Doc stuff."
        ]
    },
    "Destiny debates xQc": {
        "title": "Destiny debates xQc",
        "score": 488,
        "url": "https://kick.com/destiny?clip=clip_01J1END69B6610HPRY7CRN6DYM",
        "content": "",
        "num_comments": 222,
        "comments": [
            "I like how I can tell how long this convo been going from his drawing on paint.",
            "Legally we have to draw a hardline somewhere, we just have to, but people who act like it’s okay for a much older person to date someone younger as long as they are 18 are fucking creepy and I look at them with maximum suspicion. \n\nI’m not saying X is doing that, I’m sure there’s more to the convo, but 50 and 18 is almost certainly worse for the 18yo than 20 and 17 is for the 17yo (outside of the legality). The latter is still illegal and the former is still legal but holy fuck that 50yo has a different kind of mindset than the 20yo who is dating someone who might look and act basically indistinguishable from someone their own age.",
            "Where are the mirror clips?",
            "XQC's mental gymnastics in this conversation was insane lol especially in the \"chug vs sip beer\" segment",
            "destiny xqc debates are the best content",
            "It's clear what X is saying is that you have to have a hard starting point and age of consent is good place to start any crossing of that line defaults to being fucked up conversely relationships on ether side default to fine. In both cases you can adjust from that starting point on a case by case basis.",
            "Ah an age of consent debate, a destiny staple.",
            "Destiny is right and everyone who thinks otherwise are brainwashed",
            "To weirdos that think 17 dating 18 is wrong, do you think 20 and 21 dating is wrong too? One can drink and another can't?\n\nIs that a difference significant enough for you? Or you are smart enough just to say \"it's 18 because the law says so\" and that's the end of your ability to debate topics?",
            "When was this streamed? How the fuck can't I find this convo in yesterdays 8h vod? what the fuck?\n\nEDIT: It is on kick, 12h stream"
        ]
    }
}