{
    "Los Angeles Daily Discussion - Saturday, Jun 22": {
        "title": "Los Angeles Daily Discussion - Saturday, Jun 22",
        "score": 2,
        "url": "https://www.reddit.com/r/LosAngeles/comments/1dlv4fd/los_angeles_daily_discussion_saturday_jun_22/",
        "content": "Rules are simple:\n\n* Talk about whatever's on your mind.\n* Be excellent to each other.\n* Be kind whenever possible. It is always possible. -The Dalai Lama",
        "num_comments": 3,
        "comments": [
            "gonna be a hot one folks",
            "#ANOTHER SCORCHER"
        ]
    },
    "Meet-ups and Events - Week of June 17": {
        "title": "Meet-ups and Events - Week of June 17",
        "score": 5,
        "url": "https://www.reddit.com/r/LosAngeles/comments/1dhsrhj/meetups_and_events_week_of_june_17/",
        "content": "Please include a [bulleted list](https://www.reddit.com/wiki/markdown#wiki_lists) like below to keep the essentials in a consistent format.\n\n* name: Epochalypse\n* date: 2038-01-19\n* time: 03:14\n* location: Computers everywhere\n* link: https://en.wikipedia.org/wiki/Year_2038_problem\n\nThe old off-site events table is no longer working because it was hacked together in an afternoon and Reddit finally wised up to the scraping and blocked the machine.",
        "num_comments": 10,
        "comments": [
            "* name: **Behind The Scenes Of The Coffee Roasting Process !!!**\n* date: **2024-06-22**\n* time: **11:00 am**\n* location: [Maps](https://maps.apple.com/?address=750%20N%20Glendale%20Ave,%20Glendale,%20CA%20%2091206,%20United%20States&auid=17486771843722960419&ll=34.157559,-118.240431&lsp=9902&q=O%20Coffee&t=m), [Google Maps](https://maps.app.goo.gl/LUPdFhVM5GaiNhKv7?g_st=ic)\n* link: [eventbrite](https://www.eventbrite.com/e/872725755227?aff=oddtdtcreator)\n\n# Let's Discover Coffee Together !!!\n\n***Step into the world of coffee like never before in our intimate and private coffee roasters showroom experience.***\n\n*With a maximum capacity of just four people, you'll enjoy an exclusive journey through the art of specialty coffee roasting.*\n\n*This adventure tailored not only for coffee aficionados but also for those who love to discover.*\n\n*Lasting approximately 1,5 hour, this experience promises to deepen your appreciation for the world's favorite caffeinated beverage.(Ticket price also includes a bag of freshly roasted delicious* coffee\\*)\\*\n\n[www.o.coffee](http://www.o.coffee)",
            "* Justin Matson: Try Harder\n* Date: 2024-06-20, 2024-06-22\n* Time: 8pm, 9pm\n* Location: Best Comedy Club Near Me Theater (Main Space) - 7456 Melrose Ave, Los Angeles, CA 90046\n* Link: [https://www.hollywoodfringe.org/projects/10558?tab=tickets](https://www.hollywoodfringe.org/projects/10558?tab=tickets)",
            "• name: The Power of Visibility: Boldness in LGBTQ+ Art\n• date: 2024-06-22\n• time: 01:00 to 04:00 PM\n• location: Rod Briggs Gallery (Long Beach) \n• link: https://longbeachcreativegroup.com",
            "* Sapphic LA's City Guide Release Party\n* Date: 2024-06-19\n* Time: 11am-4pm\n* Location: Sip & Sonder - 108 S Market St, Inglewood, CA 90301\n* link: [https://partiful.com/e/AieJW60e3sthKhkF1gcV](https://partiful.com/e/AieJW60e3sthKhkF1gcV)",
            "* name: A Free Lord Of The Rings Themed Prom (Costumes Encouraged/Free Champagne Toast/21+)\n* date: 6/22/24\n* time: 9P-2A\n* location: Thirsty Crow Bar 2939 West Sunset Blvd. LA CA \n* link: [https://www.instagram.com/thirstycrowbar?igsh=NTc4MTIwNjQ2YQ==](https://www.instagram.com/thirstycrowbar?igsh=NTc4MTIwNjQ2YQ==)",
            "* L.A. Youth Expo\n* Date: 2024-06-22\n* Time: 10am-3pm\n* Location: LA Trade Tech - 400 W Washington Blvd, Los Angeles, CA 9015\n* link: [https://www.eventbrite.com/e/la-youth-expo-2024-tickets-891854921077](https://www.eventbrite.com/e/la-youth-expo-2024-tickets-891854921077)",
            "Anything fun happening for Juneteenth?",
            "* Cost: Free\n* Caine from [Caine's Arcade](https://www.youtube.com/watch?v=faIFNkdq96U&ab_channel=NirvanMullick) College Graduation Celebration\n* Date: 6-23-2024\n* Time: 1-4pm\n* Location: Two Bit Circus Side Show, 613 Imperial St. Los Angeles, CA 90021\n* Link: [https://www.eventbrite.com/e/caines-graduation-party-and-cardboard-building-extravaganza-free-tickets-904422872157](https://www.eventbrite.com/e/caines-graduation-party-and-cardboard-building-extravaganza-free-tickets-904422872157)",
            "• name: Calikings Studios presents: Silverchella \n\n• date: 2024-06-21\n\n• time: 07:00 pm - 11:00 pm\n\n• location: Calikings Studios\n\n• link: https://www.calikingsstudios.com/event-details-registration/calikings-studios-presents-silverchella-feat-the-boxtruck-bandits",
            "Ill be turning up at the hollywood bowl w tpain"
        ]
    },
    "1 person wounded after shooting on Metro train in Jefferson Park": {
        "title": "1 person wounded after shooting on Metro train in Jefferson Park",
        "score": 210,
        "url": "https://www.cbsnews.com/losangeles/news/1-person-wounded-after-shooting-on-metro-train-in-jefferson-park/",
        "content": "And here we go again 🤦",
        "num_comments": 65,
        "comments": [
            "Please keep comments civil and remember the human.",
            "Per ABC7 they are deceased. ",
            "Been wondering why we had to get off the train at Culver City. All we were told is “major police activity”",
            "*West Adams, La Cienega Station\n\nFixed it for you CBS News",
            "LAPD scanner traffic indicated not conscious and not breathing. The victim has been declared deceased.\n\nMy condolences to the family.",
            "It's been >0< days since the last murder on LA transit.",
            " On the E line at La Cienega / Jefferson Stop, Man shot in the head before 3 suspects flee on skateboards",
            "Nope, not wounded. he's dead. they shot him right in the head executioner style. 3 \"teens\" on skateboards were calling him a snitch and chasing him before doming him. my friend witnessed part of it. says it was most likely gang related but the victim didn't seem like he banged. but who knows.",
            "I’m currently in another city where subway transit has always been a normal way for everybody in the city to get around traffic. I got blockaded by metro authority to double check my ticket validity. They don’t play and everything works as intended. This is true in so many large metros around the world. Can we ever get there??",
            "Man heatwave really getting to people",
            "Someone reset the counter it happened again",
            "I was on E line earlier today(Thursday morning) and I had encountered a man at Atlantic station that was giving me the most negative vibes ever and usually I never pay attention to anybody but this person struck me as behaving strangely, and not on drugs or alcohol strangely, but like he was timing something out.\n\nI was walking up the ramp to the platform at Atlantic and this guy in a gray hoodie in his 20s was walking ahead of me until he suddenly started slowing down and stoping in the middle of the pathway. I glanced at him and he wasn’t looking at his phone just standing there looking at the metro ambassadors walking towards us. I walked in the very back train car and I finally see him come in, I don’t believe he paid for fare. He sits at the end of the train car where the door to the conductor is. There’s a family with a baby and another guy sitting nearby. The sus guy looks straight ahead and is very quiet, never looks at a phone or anything which I thought was weird. He looks straight at me and the family with a neutral expression.\n\nSo I try to ignore the fact that this guy is giving me bad vibes and the family gets off at Marvilla or Mariachi Plaza. As soon as the family leaves he gets up and I thought he was going to get off but he ends up sitting right behind me where I can’t see him.\n\nUltimately nothing happened, but I was counting the stops from there wanting to get the hell off. I actually thought about just switching train cars but there was hardly anybody on the train and it was running quickly.\n\nPerhaps a big nothing burger in the end but I’m sure you guys have had moments where a person just gave off creepy sus vibes for some reason.\n\nBTW on the way back to Atlantic station, I came across like 50 high school aged guys on skateboards on E line around 2:00PM getting off on the stop after the river crossing. Likely unrelated to this incident since this happened on an Eastbound train but still made me think about them earlier.",
            "Was on an eastbound train at that stop an hour before, my condolences, I ride it every day so I know that shit can get crazy",
            "saw some guy tagging this morning, since covid gangs have been more heavily active on public transport 😪",
            "oh THATS why there was a helicopter flying around here for so many hours....",
            "Another one?",
            "oh my god I took that train home at 6 PM.... I thought we were turning the metro's rep around, this is so awful.",
            "Barbaric. From the KTLA coverage:\n\n>“I saw three guys banging on the door screaming, ‘Snitch! Snitch!’” the witness recalled. “The train car ends up taking off. The next thing you know, it stops because usually train cars will stop and let the late people get on the train. But in this case, those people ended up pulling out a gun and shooting a guy point blank.”\n\nThe victim almost got away. But instead these monsters painted the E train walls with the contents of this poor guy's skull.\n\nI wonder, does the train get taken out of service after something like this? Or do they just hose off the blood, brain and skull fragments and put it back on the line?\n\nLA 2028 baby!!",
            "The guy is actually dead just saw it on the news a person died.",
            "I’d bet my entire life savings that the shooter didn’t pay fare.",
            "Welcome to Gotham City. Where you get killed by skateboarders on your way home from work.",
            "This just absolutely sucks. Ugh.",
            "People with skateboards causing problems on the Metro, how shocking.",
            "Don’t worry. r/fuckcars members will tell you that you are still more likely to die in your car than on metro.",
            "Sad; but not surprising.",
            "This is on the train right? Where is the video. There is absolutely no reason why we shouldn't be able to see it",
            "That's la cienega and jefferson",
            "it would be struck down by the ACLU if that happened here. civil rights violations and whatnot.",
            "It always does.",
            "As if there needs to be a heatwave for there to be crime and murder on the LA Metro...",
            "> So I try to ignore the fact that this guy is giving me bad vibes and the family gets off at Marvilla or Mariachi Plaza. As soon as the family leaves he gets up and I thought he was going to get off but he ends up sitting right behind me where I can’t see him.\n\nnext time do not be afraid to gtfo of that situation. do not be worried about looking \"scared\" or awkward. this guy was literally moments away from stabbing you.",
            "covid gangs?",
            "omg, hahah, I read that as \"Covid Gangs have been more heavily active\"... \n\nI'm like... covid spawned new gangs that already have a history that I completely missed?\n\n*fuck me*\n\n.\n\n.\n\n\n*ohhhh*\n\n\nIt's 4am, I'm going to sleep.",
            "it's cause the cops and security are too afraid to confront them or tell them to pay for a fare or gtfo. so instead they just shift over to the completely harmless, frail old white and latino homeless transients who aren't a threat to anyone and bully them off the trains instead.",
            "Yup they haven't found the 3 suspects",
            "DJ Ka-lead",
            ">Or do they just hose off the blood, brain and skull fragments and put it back on the line?\n\ncorrect\n\ntrains cost money, girl",
            "it’s crazy that the train conductor indirectly got him killed. that’s the type of stuff nightmares are made of for the victim.",
            "We need fare enforcement... but like wouldn't you pay $1.75 to kill your enemy? I did like that on the days i was broke i could jump on and just get home. Especially the day my bag/phone/wallet got stolen. \n\nI also think the metro tap card needs to be linked to your ID or social or something. It doesn't deter bad people but the metro is like this lawless freeway that goes thru the whole county.",
            "What do skateboards have to do with them being murderers other than they rode them",
            "dam didn't know that type of crowd carried guns",
            "i mean someone was also domed in Hawthorne over a road rage incident just 2 days ago. so yeah it can happen in cars too. the victim in Hawthorne was murdered in broad daylight fyi.",
            "If they told you the sky is blue, would you deny it?",
            "It’s true.",
            "You can’t even conceptualize the way this city could be different with simple fixes over time. And it starts with all of your guys’s shitty attitudes",
            "Obviously if there were more bike lanes, this would’ve never happened!",
            "LASD does not release violent incidents that occur on Metro trains. they're instructed not to do so for fear of losing ridership.",
            "still isn’t jefferson park, lmfao",
            "No lies detected 😒",
            "Yeah that is horrific, my god",
            "The article states : “They are searching for three suspects who fled from the area riding skateboards. .”",
            "lol i've seen edgars as young as 14 carrying guns these days. if you see anyone wearing a shiesty or a crossbody bag just stay away. they're strapped.",
            "Oh so that's what happened! 😱",
            "This statement is untrue. Releasing video isn’t going to be the cause of Metro losing ridership. The story of what occurred is out there already so let’s move past that and focus solely on video release, in total. \n\nUse some critical thinking skills here. What good would releasing the video do for the public? Does the public as a whole want to see someone get shot in the head on public transit? Stills of the suspects, okay. There is an active investigation and in any active investigation, video is withheld. It’s not just a Metro thing. \n\nThese suspects had an altercation with this victim off Metro and chased him on to Metro where they shot him. How is that Metro’s fault? Would you blame a hotel if someone was chased into the lobby and shot & killed there? \n\nMetro is blamed for crime when they are a transportation agency. They move 1.2M PER DAY. Of course there will be crime and yes, it’s unacceptable but we must remember that Metro’s #1 job is transportation. Societal issues seep onto Metro but look at yourselves and the lack of accountability and responsibility we all take for a system our tax dollars pay for. \n\nDo better.",
            "Ahhh I see, perception over transparency",
            "Yo that’s cool but there’s plenty, the vast majority probably, of skateboarders who don’t do murder.",
            "i never said it was metro's fault. if anything its the cops and securities fault for letting these degener*tes on the train in the first place. they don't do a good enough job of keeping the criminals off the trains and busses and in the end its us who suffer because of it. i don't even like driving and would love to take the metro everywhere but i can't even get on anymore without some crckhead or unhinged gang member ruining the feeling of safety.",
            "maybe not murder but they definitely have a reputation for violence, property damage, assaults, battery, etc.",
            "You said, “LASD does not release violent incidents that occur on Metro trains. they're instructed not to do so for fear of losing ridership.”\n\nThe implication being that Metro instructs them to withhold the video. \n\nDepending on area, LAPD, LASD, and LBPD all do law enforcement on the trains and buses which is paid for by Metro. I’m in agreement that they need to do a better job of securing the system BUT I still don’t understand what the relevance of your original comment is and why you think it is correct.",
            "This, and if they’re not doing shit like that they still tend to be obnoxious little assholes that vape on trains and busses and almost hit people on the sidewalk. Can’t wait for these little shits to go back to school",
            "it wouldn't really be on Metro to release the footage anyway. the way it typically works after a violent altercation occurs on board is they will give that footage to law enforcement. and then law enforcement will decide whether or not to provide the footage to local news stations for broadcasting, depending on whether or not they have leads on a suspect.",
            "yup, spot on. unfortuantely these types of dudes just skip school so they can smoke weed and inhale whippits. school is nothing to them."
        ]
    },
    "LAPD offers $25K reward after LA Christian bookstore owner shot and left paralyzed": {
        "title": "LAPD offers $25K reward after LA Christian bookstore owner shot and left paralyzed",
        "score": 311,
        "url": "https://abc7.com/post/lapd-offer-reward-after-la-christian-bookstore-owner-luis-hernandez-left-paralyzed-in-shooting/14984617/",
        "content": "Appears he got paralyzed by a stray bullet from a gang shoot out near MacArthur Park. ",
        "num_comments": 89,
        "comments": [
            "Damn I go to the Food4Less down there pretty often, I didn't realize the hood was still popping here. Fuckin sucks because their prices are good and I don't have a car, might have to rethink going down there.\n\n\nI'm no Christian but I feel horrible for that guy, his life is fucking ruined cause of some piece of shit.",
            "but no charges for the homeless guy that beat and old man and left his wife braindead in a McDonalds parking lot in Baldwin Park. The inconsistencies are wild here.",
            "Just hand over the 25k to the guy",
            "The description of the car seems sufficiently specific that the shooter should be able to be identified.",
            "Damn what the fuck is wrong with some of you? Wild.",
            "When they find out a homeless man did it, they will arrest the bookstore owner",
            "Thought MacArthur park would have been gentrified by now. Good to see the neighborhood keeping its colors. /s",
            "Oh look it's the monthly raid on theLA sub by conservatives and out of state conservatives astro turfing as LA residents.",
            "[removed]",
            "Thoughts and prayers.",
            "[removed]",
            "First of all, how do they know it's gang related? And second, if they couldn't find the guy, why do they still bother?",
            "All part of gods plan, right? Why do all those plans suck?",
            "God answers man's prayers, \"No\".",
            "Same. I like to go there because it’s easy to catch a bus up 5th Street from downtown and who doesn’t want their food 4 less. Last time I went though the 3 minutes, I waited for the bus home were so sketch that it made me reconsider shopping there. \nMidday there is a bunch of people just getting fucked out of their mind (drugs out in the open) two different fights and a couple of people just waiting for an opportunity to do something illegal. Cops even drove by looked at the people getting fucked up and just kept going. I was like man risking my life for groceries is not worth it.",
            "In general wherever you have a Food4Less or a Church's Chicken the gang violence is high in the area.",
            "I thought it happened in Boyle heights.",
            "It is truly tragic. God bless these people.",
            "They're treating that poor dude like he's a right wing evangelical trumptard. I doubt that he is one tbh",
            "[deleted]",
            "Nothing wrong, typical leftist behavior. It's all over reddit 👀",
            "😂 nah fr",
            "So OP, that spends his time on r/calibanging and r/caliconnection is some astro turfing Texan?! \n\nOr you just don’t like his narrative so therefore he’s a MAGA trumptard?",
            "Couldn't possibly be centrists or progressives who don't have the exact same opinions as you. We aren't astroturfed. Get out of your bubble",
            "Hmm I wonder if something else might be coming up in about 4 months that might be politically relevant…",
            "[removed]",
            "Nobody’s releasing someone who shot and paralyzed this guy. Stop with the hyperbole. The DA does enough dumb stuff for real that we don’t need to make up nonsense.",
            "Completely wrong. Does not apply to felonies",
            "I mean this in the midst respectful way, but please give me examp. of Gascon being soft on in this kind of crime.",
            "This lazy right wing narrative is so funny because it only swings one way. Where was this energy when Gascon tried to charge the LAPD officer who killed Valentina Orellana-Peralta and he wasn't allowed to?",
            "[removed]",
            ">Or am I wrong?\n\nI think you already know the answer to this, but yes you are very obviously wrong. Shooting someone is not a misdemeanor",
            "“ I disagree with this victim’s religion therefore I must comment some stupid shit so everybody knows I smell like ass funk sitting inside all day!”",
            "I really hope you can find some love and kindness in your heart and be a human to the people around you. You can disagree about religion, political beliefs, and everything in between but sarcastically and openly making fun of someone's paralysis is beyond cruel and reflects something about you that I really hope you can fix within yourself.",
            "Thoughts and prayers 🙏",
            "Freely given charity? \n\nNo that's charity. \n\nYou're thinking of taxes taken at the end of a gun.",
            "Don't offer financial support. That's socialism.",
            "Do you give up playing hide and seek after the first two spots you search? Why you asking these dumb ass questions?",
            "For real, did you see the new guards they have at that Food4Less? They're fully kitted up, have guns, body cameras, and check reciepts now.\n\nI never felt super safe down there but I'm a big dude so I figured it's okay, but frankly it's a scary place and it gets even worse at night, I got stuck waiting for a bus on alvarado near midnight and there was so many homeless who were taking cover from the rain. It's so sad.",
            "That is very lamentable, that grocery store is the only place I can get groceries at non ripoff prices near me.",
            "Oh my bad, yeah",
            "We should pack out homeless people",
            "That is so fucked up to say right now. This is serious shit. But I gave an upvote cause I'm also a shitty asshole",
            "Did I say anything about OP ? I said conservatives and out of state accounts.",
            "Oh yes the enlightened centrist AKA conservative lite.  Aslso I've been on this sub for almost 5 yrs and everytime some conservative pundit talks about LA you see a blitz of either LA soft on crime or homeless posts.",
            "[removed]",
            "[LA County DA George Gascón criticized as convicted murderer freed from jail charged with new crimes](https://www.cbsnews.com/amp/losangeles/news/la-county-district-attorney-george-gascon-criticized-as-convicted-murderer-freed-from-jail-charged-with-new-crimes/)",
            "I mean the DA is declining felony charges for a homeless man that attacked a couple so………",
            "Except Gascon likes to downgrade felonies to misdemeanors.",
            "[Were you here literally yesterday my dude?](https://old.reddit.com/r/LosAngeles/comments/1dl7e9h/woman_declared_braindead_husband_battered_after/)",
            "Is attacking a couple, leaving one hospitalize and the other brain dead also a misdemeanor? Because that also happened. The person is also being released.",
            "I was going to say if it was Baldwin park then it’d be out of their jurisdiction and LASD.  But yeah Boyle Heights should be LAPD if I’m not mistaken.",
            "Bruh come on. It was a stupid comment with no factual support.",
            "Being concerned about safety is not a conservative take, ffs you are out of your mind here with your strawmanning",
            "[removed]",
            "clicked thinking it was the same story I read earlier today\n\nNOPE! a completely different story of Gascon releasing a murderer that then committed another felony (at least it would be a felony in any other state)",
            "This is exactly what I was gonna say. This isn’t the only instance when a violent person is released to go on to repeat more crimes. The person that attacked the couple at the McDonalds is gonna walk free but these bozos are here are talking about ‘iTs nOt A feLoNy’.",
            "We have the most people in prison compared to population of any country in the entire world. A lot of our sentences should be reduced and downgraded. \n\nDo you honestly believe that this would fall under misdemeanor?",
            "What are you even fucking talking about",
            "You have a link to that story? Feels like we're missing a detail or something here. If gascon actually has a policy to release people assault people and maim them, I'll eat my words. My mind is open.",
            "Op's account is 141 days old and has made a lot posts about la and cali crime.  its a little sus.",
            "What the fact that after almost 5 yrs on this sub I've seen just about once a month this sub gets blitzed by conservatives. Usually right after some conservative pundit/ celebrity talks shit about LA. \n\nThen you see constant worn out posts about the DA and the homeless.",
            "It's always that guy with the worst takes. I'm not surprised at all to see his other account got suspended.  At some point I remember he was raving about...get this...Youtube comments that were complaining about LA.  Like, who has the energy to get worked up about *Youtube comments* about a massive city to the point that it was like they were getting personally attacked FFS",
            "[removed]",
            "[removed]",
            "If you read it, the guy would have gotten released anyway—literally the widow of the victim was calling for him get out. It’s a weird piece because the “story” is that it’s got nothing to do with Gascon, but the guy running against Gascon wants to use it to make Gascon look bad",
            "oooor people could just... I don't know, stop committing crimes?",
            "you being wrong. Keep up",
            "Its was hot topic yesterday. So you can find it on this sub. But no, he was not released. The person you are responding to is upset that the person who attacked the couple got his charge demoted from felony to misdemeanor",
            "Want to guess how old u/Maximillion666ian666  account is?\n\n31 days for anyone too lazy to click.",
            "This is literally a current event that OP posted about and you in fact are posting the same tired shit of “oh we are getting astroturfed” that everyone on this sub reads anytime something doesn’t fit your framing. \n\nJust weak sauce.",
            "How you know his other accounts got suspended? Where did you learn this black magic?",
            "[removed]",
            "it's sus is all.  not taking a side.",
            "Oh look another weird pathetic attempt to discredit what I said. My old account was 9yrs old before I got bored and made a new one.\n\nStalker much 🤣",
            "Again where did I talk about OP ever ?  I was talking about the people commenting to posts  like these.",
            "lol it's not that crazy, I just happened to see on the other thread here someone saying his account is 31 days old (since someone was complaining about OP's account being \"only\" 192 days old) and realized the name looked a little different.\n\nhttps://www.reddit.com/user/Maximillion666ian is suspended.  It's obviously the same guy who always rants on this sub about how anyone saying anything the least bit negative about LA must be some out of state conservative.  It's like it's impossible for him to fathom that there are some genuine problems in the city that people living here might talk about..",
            "[removed]",
            "Again, it was a stupid comment and you’ve got no ability to admit to it. There were like 10 comments on this post (the majority bashing this man’s God) and you started talking about astroturfing. \n\nI can only assume you don’t know what the words you use mean. So I will stop it here.",
            "[removed]",
            "[removed]",
            "[removed]"
        ]
    },
    "Los Angeles is adding 3.6 miles of new protected bike lanes in East Hollywood": {
        "title": "Los Angeles is adding 3.6 miles of new protected bike lanes in East Hollywood",
        "score": 496,
        "url": "https://la.urbanize.city/post/city-unveils-final-design-protected-bike-lanes-hollywood-boulevard",
        "content": "",
        "num_comments": 86,
        "comments": [
            "They’re doing it pretty quick too. Like they tore up a big section of the road yesterday, and you can drive on it today. Pretty soon you’ll just need the paint and barrier\n\nAnd people don’t need to be riding their bikes on the sidewalk anyway like they do now",
            "Now all we need is more North South bike lanes! I wanna be able to get from below the 10 up to hollywood in one straight shot without dying on western 😭",
            "fun fact the area south of LACC used to be known as the bicycle district and you can see that still on openstreetmap. orange bike shop used to be on melrose/heliotrope. this whole area desperately needs the infrastructure.",
            "On the down side they repaved 5th street in Ktown and made no efforts to put in a bike lane",
            "Woooo more bike lanes! 🚲🚲🚲",
            "Good. Now can we add a protected left turn on Lincoln?",
            "protected bike lanes are so rare in LA! i love to see this.\n\ndoes anyone know of any other projects like this that are going to get implemented in the short term? like this year?",
            "Nice!",
            "Yes the create the painted barriers that protects us from speeding 3ton cars. Its a start.",
            "San Vincente has a bike lane but needs barriers to be really usable, paint isn't enough",
            "This is fantastic news! I live in this neighborhood and have been using my bike more and more but fountain is so narrow and sunset is so busy. Looking forward to it",
            "How about places further south?",
            "let's gooooo",
            "Protected? Not just a bike sign in a parking lane? Praise be",
            "MORE! MORE!",
            "Oh hellllllll yeah.",
            "Y'all should check out r/sfv thoughts on this. Pretty hilarious.",
            "Lovely... Just what we need.",
            "As much as I want to like this, our streets don't have enough space to accommodate cars and bikes. Plus with the addition of thousands of new units coming to the area soon, traffic is just going to get worse.",
            "Cool, more empty bike lanes in Los Angeles.",
            "[deleted]",
            "We are not Europe and never will be. This city is not made to walk and bike places conveniently, unfortunately",
            "Look forward to this being removed in ten years when people realize what a mistake it is",
            "[removed]",
            "I live between Hollywood and Franklin. They already got the westbound  portion from Lyman to the 101 repaved on the outermost sections of the road, and were about to Normandie or so on the way back east earlier today. We have signs saying the entirety of Hollywood is shut down over the weekend, so I am not sure if they are repaving the center part too or using the weekend to repaint and install plastic bollards. Not bad for starting it just 4 days ago.  I was under the impression that it was being done in July, so it being done early is nice.  \n\nThis will give me protected bike lane for about 1/4 of my ride to work. Once they complete the Gower to La Brea section, that will give me protected bike lanes followed by a bus/bike lane for almost 80% of my ride to work, and then l just need to take side streets the last mile or so.  Exciting especially since I was hit by a car about two weeks ago.  It was only a tap, but a direct hit to my thigh and I was sore for a few days.",
            "I have never seen them work this fast on anything wow",
            "They also put planter boxes and are removing most of the homeless off Sunset! (for now)",
            "Why does this subreddit celebrate gentrification so much",
            "Make sure to tell Metro, they’re planning Vermont",
            "with HLA we should be able to sue for that",
            "Spoiler Alert: They're not trying to protect anyone.",
            "You gotta link to a thread?",
            "Lmao what?! The roads in LA are stupid wide, you can easily get bike lanes in most arterial roads and some neighborhood streets too.\n\nAnd you know how we fix traffic from tons of new development? Make sure we incentivize people to not drive, and that means making biking and walking easier",
            "Tons of people ride e-scooters and other small modes of transportation in that area. The fact that more people will be living there means it's necessary to make it safer for people to choose other options than a car.\n\nWe also can't ignore that pedestrians being killed by cars keeps increasing every year. These changes help improve pedestrian safety as well.\n\nAnyway, it looks like they're removing parking spaces, not traffic lanes.",
            "\nWe have plenty of space to accommodate cars and bikes. And if traffic gets worse… all the more reason to continue improving public transit.",
            "LADOT often mandates 11ft wide lanes when 9ft will accommodate all motor vehicles operating at a safe and legal speed within the city. this is policy not law, they just choose to keep streets wider based on practices established in the mid-20th century.\n\non a 4-lane street that's an 8ft width space recovery with zero changes to lanes or parking, which is enough for a two-way protected cycletrack on one side of the road. if you don't like how LADOT implements the bike lanes then reach out to them and tell them this. they insist on implementing large gaps with plastic bollards when a tighter configuration with jersey barriers would allow for protected bike lanes without impacting car lanes.",
            "traffic can get worse sure but it isn't the sky falling down scenario that folks make it out to be. \n\nAre you aware that Los Angeles is quite urbanized?",
            "Our car-centric development style is unsustainable from a climate, social justice, and fiscal prospective. Getting away from that requires looking at things differently, but once you start to, I assure you, it starts to make more sense.",
            "Which is why we need a more multimodal approach to transportation management.",
            "Did a car write this?",
            "this stretch of hollywood blvd is like dead af most of the time",
            "Idk why this sub likes bikes and the shitty LA public transport that much. It certainly is the only place where those opinions are popular though lol.",
            "I would absolutely bike if the City would  invested in networks that connected people to destinations as opposed to limited distance infrastructure like this one.  I don't understand why the City takes such a piecemeal approach.  It obviously does little to attract new cyclists.",
            "Well you need an actual connected network. Not a few half mile disconnected ones. Genius right here.",
            "ah, I love it when people say \"I *never see people in the bike lane*\" lol.",
            "Sometimes traffic moves better when people aren't jockeying for position.",
            "We have enough lanes, we just allocate them badly. Bikes and mass transit take up way less space per crowd of people or their parked cars.",
            "It’s proven that taking lanes away doesn’t adversely impact traffic. People naturally move to other streets.",
            "pick literally any other street to drive on.",
            "Thoughts and prayers.",
            "Not with that attitude babes",
            "This city was developed based on walking and streetcars.  The cars came later.  Then we tore out the streetcars.  \n\nWe took 'em out, we can put 'em back in.  \n\nAlso, if you look at pictures of Europe in the 1970s and they were doing the same things - making over everything for cars.  Then they reversed the process.  They are just further along then we are.",
            "Cities are for people, not cars. Driving in a city is a privilege, not a right. If more locals are out of cars and on bikes/walking, then it loosens traffic for people passing through who have to drive.",
            "Why is that?",
            "I walk all over the city and have for years. Try stop being lazy.",
            "I have walked to places in LA my whole life, you're just full of shit",
            "I've cycled places faster than ubers many times in Hollywood ",
            "[Amsterdam wasn't always Amsterdam](https://inkspire.org/post/amsterdam-was-a-car-loving-city-in-the-1970s-what-changed)",
            "We're coming for your cars whether you like it or not. Car centric cities will become a thing of the past.",
            "it will be once we (folks who love urbanism and have a vision for radical change) are done with it.\n\nthis ain't a threat, it's a promise, we're done asking nicely et cetera.",
            "In a weird way you’re right. So with limited space, how do we pick who lives inside this city and who has to commute 2hrs from Riverside? I have an idea, we end prop 13, so you actually have to pay market rate property taxes to live here. Instead subsidizing folks who bought 15 years ago, who pay way below market property taxes and be are insufferable NIMBYs.",
            "Wait, what? Of what relevance is this?",
            "I guess it’ll be one lane for traffic and a turn lane, but right now there’s always some asshole trying to turn left anyway",
            "Sounds like the Olympics prep is on the way",
            "its one of the densest hoods on the west coast, insane to me they aren't putting bike lanes as many places as they can also as a traffic calming mechanism. We don't need cars flying around with so many pedestrians.",
            "This is especially rich when we’re talking about Hollywood and Sunset. Which are absolutely gargantuan in width.",
            "No. The new configuration will remove one traffic lane and keep parking. \n\nIt will be :\n\nSidewalk - bike lane - parked cars - traffic lane - center lane - traffic lane - parked cars - bike lane - sidewalk.",
            "but drivers are getting crazier and will find a way to do stupid things",
            "Vroom vroom",
            "Vocal minority. L.A. is a car city.",
            "Very very very very very loud minority that never goes outside and blames the fact that they never go outside on cars, believing they'd all be living some miraculously fabulous European lifestyle with dozens of friends and perusing cafes and shops at massive scales of density if only the city became anti-car and a eutopia for bikes.\n\nLA will never be a bike city. It is far too large, the geography doesn't support it. All these bike cities these people think they're emulating are 1/10th of the size of LA, if not even smaller. \n\nWhat we need are trains.",
            "Uh huh. Sure.",
            "Yeah of course, we just haven’t ruined *enough* roads for bicyclists yet.",
            "There are no bicyclists in the bike lanes because they are all on Reddit complaining that they don’t have enough bike lanes 😢",
            "[deleted]",
            "Yeah, that entire stretch there is a left turn lane just under half the intersections.  There is almost always someone turning left on the intersections without a turn lane.  The reconfiguration should have the left turners out of the way and not impacting any other cars.",
            "I always found it funny how far public resources can go when actually put to use and not corruption",
            "big facts",
            "Looks like they're doing both actually\n\n>We are pleased to share the final design for this project, which calls for converting a travel lane in each direction into a parking-protected bike lane between Lyman Pl and Van Ness Ave, and **replacing on-street parking** with a protected bike lane between Van Ness Ave and Gower St.\n\nhttps://mailchi.mp/lacity/hollywoodblvd_update20240530?e=b301e844c9",
            "LA is car city because you have folks from outside commuting into the city to work, clogging up our streets and have their PD drop off their homeless. If your daily commute is 5 miles, you’re not worried about bike lanes. But if your commute is from Riverside to the west side, it’s understandable why someone would bitch about bike lanes. But people from Riverside who work in LA should have zero say how we run our city.",
            "No city should be a car city.",
            "A car city founded on streetcar lines? How does that work?",
            "Roads are ruined by cars, not bikes. No amount of space given to cars will suffice, there are simply too many cars on the road. We need alternatives like safe bike lanes. The system is fucked and will stay fucked as long as we keep using cars for every aspect of transportation.",
            "I live there. Franklin west of Normandie and Sunset have the capacity. Even Fountain or Santa Monica could could take a handful of cars that will eventually disperse to new traffic patterns.",
            "You can walk",
            "You’re in the wrong city lol",
            "Street cars were limited to a few disconnected areas before the freeways were built. \n\nIt would be nice if we had street cars now, but we don’t. We have empty bike lanes and a notoriously dangerous bus line.",
            "Go suck an exhaust pipe."
        ]
    }
}