{
    "Daily Q&A and Open Discussion, ideal for New and Returning players - June 22, 2024": {
        "title": "Daily Q&A and Open Discussion, ideal for New and Returning players - June 22, 2024",
        "score": 0,
        "url": "https://www.reddit.com/r/lostarkgame/comments/1dlt52n/daily_qa_and_open_discussion_ideal_for_new_and/",
        "content": "**Daily Q&A and Open Discussion**\n\nGreetings adventurers! Please use this daily thread for simple questions and/or open discussion relating to anything Lost Ark. Enjoy!\n\nExample: \n\nWhat class should I play?\n\nWhich class is better?\n\nI am new to the game, what should I do?\n\nShould I play X class and why?",
        "num_comments": 2,
        "comments": [
            "i'm new player and start on eu central, after logging get some stuff and resources, but don't get powerpass, should've buy it or lvl up 1-50 for first time?\n\nor how it works?\n\n  \np.s. i tried watch and reading some guides and videos, but every time they have powerpass in mailbox after skip prologue and get out church.",
            "What can I expect the average cost to get from 1600 to 1620? My main is low 1600s and trying to decide if I should push to 1620 to be able to farm T4"
        ]
    },
    "Summer Heat Release Notes - Amazon Games Official Thread": {
        "title": "Summer Heat Release Notes - Amazon Games Official Thread",
        "score": 80,
        "url": "https://www.reddit.com/r/lostarkgame/comments/1diuzb8/summer_heat_release_notes_amazon_games_official/",
        "content": "# The June “Summer Heat” Update arrives in Arkesia tomorrow. Downtime will begin on June 19 at 12 AM PT (7 AM UTC) and is expected to last 6 hours.\n\nEncounter the next chapter of *Lost Ark* new adventures to the cursed, volcanic land of South Kurzan, and challenge the alluring and deadly Echidna in the first Kazeros Raid. Along with the next major chapter beginning in Arkesia, this update brings Chaos Assault Part II, Proving Grounds Season 5, a new Ark Pass, Western Emote winners, balance changes, and much more!\n\n[https://www.playlostark.com/en-us/game/releases/summer-heat](https://www.playlostark.com/en-us/game/releases/summer-heat)",
        "num_comments": 92,
        "comments": [
            "Overall a good patch, also the notes look way better with the images.\n\nIm also really glad that the emotes are added already. Goblinkoko is gonna be my favourite emote by a long shot.\n\nJust a little disappointed with the skins, hopefully we get some better ones with the July Update. :/",
            "Good patch overall. However, is there any particular reason we're already getting recycled skin sets when we're still missing quite a few sets from KR?",
            "View in your timezone:  \n[June 19 at 2 AM PT][0]  \n\n[0]: https://timee.io/20240619T0900?tl=Summer%20Heat%20Release%20Notes%20-%20Amazon%20Games%20Official%20Thread",
            "Please note an adjustment to tonight's downtime, which will instead begin at 12 AM PT (7 AM UTC) and last approximately 6 hours.",
            "good patchnotes only thing i dislike is not having 1 week to run the story before the raid like precious stuff",
            "+4% dmg for aeros. i guess ill take it... pretty comical though for them to get +13% overall damage buff over the past several months just to stay competitive w/ other classes. the power creep is insane",
            "3 patches in a row with 0 usable skins. P2w game that doesn't want your money ig",
            "Another patch, another PS SH falls to their knees in the middle of the Walmart",
            "AGS try to not release the worst skin possible for the 3rd month in a row (IMPOSSIBLE)",
            "I thought we were going to have a gold nerf for Brelshaza raid, but I don't see this mentioned in the patch notes. Are patch notes inaccurate or are we saved?",
            "is there any honing cost reduction for 1600-120? No, right?",
            "I'm a bit confused why a pvp season is starting now when the announced pvp revamp adding 1v1s should be coming in a couple months lol",
            "Will Echidna release right away, or will we get a week to do story like every other region?",
            "Any news about the tickets that will allow us to move chars between servers?",
            "that wallpaper is what i have been waiting for niceeeee",
            "I still hope this summer we will get Aiwana Island event from last year in KR. Im still waiting for that wallpaper and awesome song in our version.",
            "Great patch. Looking forward to It. Sad about no S3 yoz jar, but hopefully that comes in the summer. ",
            "The skins to be added in this patch are really not gonna sell much, just saying. They are old and not particularly good looking. If there is a rerun of an old skin I would want to see in the shop that would be the Preppy skin set, the glasses and one of the tops of that set are just pretty, and they are VERY hard to comeby in the market these days, even when they are there they are very overpriced.",
            "Next patch is the ONE",
            "Give us lineage shop skins pls",
            "When will we see balanced classes? Like compare zerk with slayer or even breaker/SE/blade",
            "Region merge soon? Jealous of NAE always having 5x as many lobbies.",
            "Wtf is your problem with releasing garbage skins\nAnd where are s3 legendaries???",
            "Lackluster patch. No break between continent release and raid and old skins re releasing...what?",
            "[deleted]",
            "Am I blind or is the only place they mention the balance patch being in this release is in the video?  I see nowhere in the release notes about it.   And why is this update not listed in the News section?\n\nGetting sloppy AGS.",
            "There are new skins coming in the Ark Pass when it releases, so a refresher and something new. There are still a few months left of summer to release more summer skins!! :)",
            "Because AGS hates money. They hate it so bad, that they do everything so that players don't have anything even remotely worth buying from the auction house.",
            "Good bot",
            "I disagree. I am glad we do not need to wait another week",
            "Agreed, maybe this is what KR got too",
            "T4 is around the corner and y'all wanna waste more time?",
            "shhh, just keep buffing us please.",
            "as long as were not kept behind im happy :D",
            "Microbikinis next month save the game",
            "Look for that next month!",
            "Are we getting Brel gold nerf before T4?",
            "Nope, not at this time",
            "I doubt they put more than 1 second of thought into PVP.  They just end the season at X months and start the new one.  That's gotta be like #200 on their priority list.",
            "It will launch alongside the update, no week break",
            "Never happen",
            "T4",
            "Nothing new to share yet, unfortunately. We are still working to find the best solution to ensure the best experience for all players following a merge -- we'll let y'all know when we have determined more.",
            "ngl NAW lobby count is dangerously low now.\n\nit doesn't matter whether theres 10 lobbies or 50 lobbies, cuz theres enough to choose from. so theres no issue for years. but when the diff goes down to 1 vs 5 lobbies it becomes bad and NAW is approaching that point unfortunately. saddest part is for Thae there's far more HM than NM lobbies even though more people are in the NM range. which means only the hardcore 1630 sweaty players are playing.\n\nno sup shortage either so its not any easier for sups",
            "Womp womp",
            "Go touch some grass virgin",
            "A new continent and raid is lackluster nowadays?",
            "Isn't the super mokoko until July 17th? Presumably that's when the July patch comes and we get free 5x3 for everyone in T3.",
            "That is true. Thing is can't we get new skins alongside Reruns, regardless if an Ark Pass is running?\nLike Reruns are great we were asking for them cause its absurd for outfits to be sold just once, but not at the cost of not getting new skins. We already know from the roadmap Summer Skin is in July. And since we are caught up with those skins from last year we will get the new one from LOA ON.",
            "Any idea when we will get s3 legendary?",
            "That's fair, the Ark Pass skins are new. Also I'd say the major bummer is these spring skins/weapons are also fairly old, to the point where they can't even be dyed. If you absolutely *need* to recycle skins, I'm sure most people would at least prefer the somewhat newer sets that are dye-able.\n\nedit: grammar",
            "Can you just rerelease all skins chests / wardrobe as part of summer event? Some skins are selling for insane amounts of gold or simply non existent on the market.",
            "Any update on the preset sharing? :'(",
            "Call me",
            "He said release the story a week early, the raid would have still have released tomorrow if they did that and all would be well.",
            "You getting downvoted is everything wrong with this sub reddit",
            "No, KR got a week to run the story\n\nEdit: looks like it got more than a week",
            "Prayge",
            "Only for normal brel righ, right? Our version need hard brel gold a while longer",
            "I was sure that we would be getting one with Echidna; to whatever KR has right now (and had for months). Then there will be further nerfs in KR, but who knows when that will come to our version. Anyway, apparently nerf for us will be next month.",
            ">Nope, not at this time\n\n  \nThis mean, that possible in the future ? (leak info?)",
            "Future reference, can we do It like Russia and KR and wait a week minimum for ppl to complete story and not shift g?\n\nThis was really cool for our voldis release. Would love to do experience that again. ",
            "Can we not do that again? Other regions changed this so people could have time to consume the story and properly prep.",
            "I appreciate the confirmation so I can apply for time off without any doubts.",
            "Every other publisher is sane and give everyone a week to enjoy story and AGS decide to rush out content. You couldve released continent last week. Many other games also release content/story with raids locked from start like WoW(xpacs etc) and other big games. Reconsider in future updates and take proper actions.\n\n Thanks for confirmation, it is also very vague if msq will be required as well since it is usually in patch notes.",
            "Roxx there's a lot of negativity around this, but as someone who has Juneteenth off work, I am personally super glad you guys are sticking to your guns and releasing it tomorrow",
            "Very bad decision. Now i have to skip story becouse static wants to raid asap",
            "[deleted]",
            "there isn't going to be a good solution unless Amazon either figures out:\n\nA) how to break the laws of physics (not happening).\n\nB) BOTH builds a data center in Texas AND somehow gets a bunch of ISPs to fix their traffic routing in SA and western US.  Neither of these are happening.",
            "If we from SA can play normaly with 100-140ms why NAW cant? Or there's another reason than ping?",
            "that's crazy talk.   \neveryone is doing echidna right now.  \nlobbies are so busy looking for dps and sup.",
            "Most ppl are just waiting for the honing buffs and solo raids",
            "KR got 2 weeks to run story actually",
            "Russia getting 1 week for story as well",
            "A WoW expac doesn't have 1-4 hours of story to do before the raid. You can easily wait to raid until the weekend or wait until next week if you'd prefer. The raid isn't going anywhere.",
            "Sounds like a problem with your static.",
            "You could do it on an alt after since you just need 1580. Obviously still bad change",
            "Because you’re a big boy you can choose to just do it next week if you want.",
            "If i had to guess, I'd bet about 10% don't just shift g everything.",
            "Or be normal and make Smilegate develop a way to choose server location for raid lobbies, with that you can even merge NA and EU together if they want.",
            "It’s probably an issue that there’s a lot of ‘player’ data from NAW to migrate, and can cause issues. Their own region merge was significantly longer than others",
            "A ton of west coast NA players play on east coast servers because we aren't dumb.  80% of my static is in california.  We have about 80 ping.  That's WITH my traffic going \\~500 miles in the wrong direction to Seattle before heading east (network traffic routing in the north west is hilariously bad).\n\nI assume the issue they're talking about is that half of NAW isn't actually in NAW.  They're on the other side of the pacific.",
            "Half of NAW is oceanic so it's probably a problem with their ping.",
            "There are players on NAW from Asia/OCE so they aren't playing on 100-140 like you they'll be playing with 280+..",
            "Because NAW has a lot of players from SEA/Oceania and their ping would be closer to 200ms",
            "because NAW isn't just full of players from North America West. We've got TONS from Oceana which would see much higer pings.",
            "Because NAW has all the Australian and oceanic players like me",
            "People and their fomo. \n\n\nYou can still just raid a week later. Personally i like that i can do something cool sooner then later.",
            "IDK why people act like 8am Wednesday is the only time to prog a raid. I progged thaemine on Friday and Saturday only on launch week and there were tons of groups fresh prog up to multiple levels from any gate in NM and HM. \n\nIf you're in a static that is so adamant about only doing prog immediately as though there's any difference doing it Wednesday morning vs. Thursday or even Wednesday evening, then it's probably worth finding new people to play with to prevent this issue.",
            "Yeah that's what I assumed would happen rather than a real merge is everyone still plays on their own servers usually, but the servers are connected and you can join a lobby from a different region, where you'll play on their server and you just deal with the ping.\n\nBasically how wow does it with OCE/SA/NA.\n\nBut now that they full on merged sa into nae that seems unlikely.",
            "I see, \"players,\" poor NAW players...",
            "Honestly, I regret rolling on NAW.  Fewer lobbies and half the people are from SEA/Oceania.  I would honestly server transfer if i could.",
            "The actual technical problem is the literally tens of millions of bots that have been banned but not purged from the database that will make a region merge take multiple whole days, they need to make sure if they purge accounts that they don't accidentally purge humans that were banned and may request an unban in the future, especially because of how many humans have been mistakenly flagged as bots in the last two months.\n\nIf SEA ping was the only issue, they'd just use the NAW datacenters over the NAE datacenters and tell NAE and SA to suck it up.",
            "Yeah it's weird cause you can only raid either like early morning (oceanic) or later at night (naw) anytime between 11am-5pm it's dead"
        ]
    },
    "SG bad": {
        "title": "SG bad",
        "score": 215,
        "url": "https://i.redd.it/i34goqp5618d1.png",
        "content": "",
        "num_comments": 24,
        "comments": [
            "**LA sub starter pack for upvotes:**\n\nElixirs bad\n\nPheons bad\n\nRng bad\n\nHoning too expensive\n\nTranscendence bad\n\nWaifu art\n\nReset good.\n\nGatekeeping bad.\n\nLA bad.\n\nBussing bad.\n\nBots bad.\n\nNewbie having fun.\n\n**LA sub starter pack for downvotes:**\n\nLucky tap/drop\n\nLoss of investment due to T4\n\nMore than one 1620+ character.\n\nMore than 500k gold\n\nA newbie question\n\nQuitting announcement\n\nLA good\n\nBussing not too bad",
            "This system and the guy responsible for it deserves even more hate. Just seeing these three voldis stooges with their dumb options tilts me. And you know the biggest joke: I only invested my free elixirs (epic and legendary) in my main because I can't be bothered to invest so much gold in this sink (cough \"juwels\"). I can't imagine how the players feel who invest like week after week so much gold to get from 39>40.",
            "BASED",
            "ags is even worse which makes SG looks better.",
            "well if they add skip animation its kinda bearable for me",
            "Yea its a trend to hate on elixirs now, no one seems to care about how equally or more expensive other progression systems in the game are these days",
            "i will say people are a lil unfair with smilegate and ags, alot of the problems the game has are problems because the main audience (KR) likes these things and since they dont complain, smilegate doesnt 'fix' them because based on the feedback they are getting: they arnt broken.\n\nelixirs suck, but its because so many defend them that people exessively complain about them to compensate to express how bad they actually are\n\nif im blaming anyone its the KR audience and anyone in NA/EU that blindly defends shitty systems. i dont mind rng and grind (i literally came here for that) but its 2024 these systems should have defined pities. this is why i dont hate honing and why transcendence doesnt get near as much hate as elixirs.",
            "F2p tho",
            "Happy cake day!!!!",
            "Don't forget blaming AGS for something smilegate did kekw",
            "You missed Primal Island bad for upvotes xdd",
            "turns out that korean p2w gridners that are trying to milk you dry are bad and ppl slowly catching up on it after palying for 10k hrs well better late than never i guess",
            "because other systems only take your gold, elixirs take your time as well",
            "most complaints about elixirs are not about cost, but about how bad it feels to do.\n\nhoning for instance is expensive and you get barely any power reward from it but because it has a pity you can see in real time the progress you are making. you can go into a calculator and set it to worst case scenario to find how many mats youd need to farm to ensure pity\n\nbut with elixirs best you can do is hope and pray to rngesus because if you get lucky you can 1 shot it...but if you get unlucky it could cost you millions of gold. now will it cost millions on average? no probably between 300k-500k but the fact theirs no defined end if you are unlucky is why people complain\n\nthe \"the value is good\" is a terrible argument. because not everything is about value\n\nsometimes its about enjoyment and multiple layers of rng on top of eachother without a pity sucks.",
            "People keep saying this--that we hate elixirs because they cost gold. That's true to an extent, and I thought maybe that's why I hated it. But I just cut 31 of the free legendary elixirs on my 2nd main, the first time in many months. It's definitely not about the gold. It's the insane time spent where you are baited over and over thinking your choices during transmuting make a big difference when they really don't. The layers upon layers of RNG that you have the illusion of control over really sucks. It's depressing to think about these what-if scenarios with elixirs when it's just bullshit RNG.",
            "i guess maplestory can have a exlusive western version but LOA cant for \"reasons\"",
            "No, the majority of Korean players view elixirs in a negative light. For where they are in the game, most are done with it and want SG to fix other issues and not spend time on an outdated system.  There are a few white knights there (as there are here), but they do not like elixirs either.",
            "Because KR gaming culture is incredibly toxic and you're literally made fun for being poor if you complain about shitty RNG systems.",
            "Right. \n\nF2P with under 100K gold = upvote\n\nF2P with over 500k gold = downvote",
            "honestly biggest buff I could hope for is an animation skip. feel like anything more is cope besides what was announced",
            "at this point they have evolved beyond tanking your time, they take our soul lol",
            "You're correct, it's not the gold cost alone.  You can spend a week's earnings on it, and get nothing.  If that's the case, why bother playing?",
            "There's a community made modification for this, the link is on Lost Ark Nexus (very bottom, with the bible.) Of course, it's at your own risk since it technically violates TOS by modifying game files.",
            "as of now i agree but in the future this system will get nerfed into the ground out of necessity to help rush the new kr players into tier 4 without needing to deal with things like elixirs.\n\neither that or they'll completely untie elixirs from voldis and make it an item you farm via chaos/guardians"
        ]
    },
    "feels like they are trying to kill their player base with newer raids": {
        "title": "feels like they are trying to kill their player base with newer raids",
        "score": 122,
        "url": "https://www.reddit.com/r/lostarkgame/comments/1dlmgox/feels_like_they_are_trying_to_kill_their_player/",
        "content": "I do enjoy myself some thaemine g3 normal mode(15 clear so far) but dear god does it feel like newer raid have expectation of everybody playing perfectly. If it wasnt for a static thaemine wouldve probably been my last raid. Echidna g1 was pretty quick and enjoyable but g2 just feels like its to punishing.1 player being mind control and then ending wiping 2-3 players in 1 skill if he doesnt go to sleep. limited vision with random butterflies. Just feels like they have a crazy expectation of everybody playing perfectly when they design newer raids. I understand hard mode being hard but normal mode should be more friendly for casual players. Especially since we are having solo raids then newer player are gonna hop onto thaemine/echidna right away wich are pretty hard to learn",
        "num_comments": 68,
        "comments": [
            "this is the problem with the game, tbh.\n\nthere shouldn't be 1 fuck up your entire team is fucked mechs in normal mode because it just breeds toxicity and gatekeeping which in turn turn away the casuals.\n\nthey should be in hard mode not in normal mode.",
            "I think the problem just comes down to how they handle normal & hard mode. It's expected that you move up into hard mode when in reality, they should be the same ilvl but hard mode rewards more mats etc but normal mode is significantly easier, no bs insta wipe mechanics and so on. \n\nThey would probably never transition the raids to work that way on the same entry ilvl though because it would mean lowering the upgrade ceiling and thus lowering their profits from people who spent money in order to buy mats and stuff. \n\nSo I don't ever expect it to change on that front.",
            "Another one person's mistake = 10 minutes of work\n\nGetting tired",
            "I miss Valtan. Those days were probably my fondest memories of this game. Just uttering the words «Wei cheese» brings a smile to my face.\n\nMeanwhile now, we have vertical systems out the wazoo, too much RNG, goldsinks, and a job resumee is needed to join raids. Oh, and if you don’t RMT, you’re just nerfing yourself, as there doesn’t seem to be any noteworthy punishments except for a slap on the wrist.",
            "Normal mode should be - you fucked up = you dead, your team goes on. \n\nHard mode should be - you fucked up = restart, ggs.\n\n\nThe idea of putting random wipe mechanics that require 4-8 strangers to coordinate or restart is why you can't just matchmake all the raids, and imo the death of matchmaking is what fucks up the casual playerbase the most.",
            "braindamaged vertical god in charge now",
            "For me the power systems killed the game for me. Elixirs are never leaving.....ever. You will always have to do these power systems and for what? A raid that youll grind so hard until you hate it and then wait for the next raid and power system. They really do want to kill their playerbase its so unfortunate. Really expected tier4 to refresh and get rid of these new systems that everyone hates but sadly not.",
            "As a good raider from another MMO that came to Lost Ark for easier more chill grindy raids, they seem to be making these too punishing for the average or worse player & also pushing them on us way too soon. \n\nParty Finder experience: Get a bad player (which probability is you will most likely get at least one usually), waste an hour or more, leave to replace, multiple people leave, wait an hour for another party, same thing happens. Then I find myself getting toxic which I don’t want. It’s not healthy & just a huge waste of time. I don’t have 20 hours per week for just 4 Thaemine Normal jails & 2 Echidna Normal jails. This is why I’m trying to majorly scale back my playing time & not even attempting to push Hard Mode anymore. It’s all pushing me away from the game that I enjoyed for so long because you need a decent static or it’s just too inconsistent on a daily basis. 🤷‍♂️\n\nMaybe we need to get back to Kayangel and Akkan level of Normal difficulty with total prog time = 5-10 hours or less. Then people can get on with their lives (I mean dailies), and don’t need to push Hard Mode if they are casual and/or bad.",
            "They don't understand that normal, needs to be normal, they are making normal just a hard-light and it's terrible design.",
            "Looking at steamcharts, they are pretty effective with it. But many white knights here will tell you everything is fine xD. In my opinion Akkan is still a huge problem because it's also overtuned and new players wipe on it a lot. But they are reacting with solo mode, so we will see how that will turn out.",
            "You are missing another huge reason why it feels harder than it actually is. **Your average LoA player can't adapt if his life depended on it. Try to take someone's spot and see how quickly they'll have meltdown.**\n\nIn my 3k+ hours in LoA I've once come across a pug back in the Tranquil Karkosa where people just went through the prep zone and straight into the fight. They didn't waste time taking their positions, pinging empty spots, fighting who takes 1st and who takes 8th. None of that bullshit just to fail the gate because the mech started and someone was too far from their designated spot. Instead they picked their positions to collect orbs on the fly and did the whole dance with 1234 12334. **It was marvelous.** I've never seen another party that was this good.\n\nWe had charm mech in Vykas, you just throw a sleep bomb. It's not that hard. The only time someone dies to a charmed player is when your entire party collectively decides they are not throwing sleeps. Pay attention to that next time. There are always at least 2 people who are in range and not being attacked who could, but never throw. That's what you die to, **not to hard mechs, but to selfish unskilled bozos.**\n\n**I do agree that NM should be clearable with base line amount of effort and Thaemine NM especially is too demanding. But Echidna isn't half bad.**",
            "Normal modes should give all materials for progression, should not have wipe mechs or have them skippable with timestop, and should have like 2-4 revives.\n\nPeople should feel discouraged from clicking \"Find party\" for normal modes and just click \"matchmake\". MM system should also be smart and priorize having 1 sup on each party. Even have an option you can check to only mm with supports.\n\nHard modes, in turn, should give significantly more gold, so if anyone feels really confortable with mechs, they can do hard modes for the additional gold.",
            "The main issue with the charm mech is that a lot of people either don't know or don't respect the 4 or so normal moves that give a charm stack. All these moves do pathetic damage, so some people just pay 0 attention to them and constantly run around with 1~2 avoidable stacks. Then, they either get hit by the backstep->cone aoe move or get caught on an activated flower tile for that last stack and turn the whole thing into a shit show. But, sometimes, they luck out on the rest of the patterns or get saved by the teammates, so they carry on. It's pretty different from a good majority of Thaemine moves where you will either get killed outright or thrown offstage (and out of the group) if you don't know them.\n\nIf you're pugging and you see people regularly getting knocked up by the aoe->knockup->aoe move, which is probably the easiest one to avoid, you need to save your time/sanity and get out. If you're in a static and people keep eating that, you need to get them to learn to do them properly. You can't carry people who will keep rolling the dice at your expense in G2.",
            "Yea but if no one is mind controlled it’s fine. Remember Echidna is a break raid, so make sure this doesn’t reach Inven because if it does…",
            "They are at least the west playerbase, didnt the playercount drop after each raid release?",
            "on my humble opinion, Thaemine Normal is highly overtune for what Normal should be. After clear it 6 times per week, I dont even know how many times i have clear it so far, feel like the boss have too much HP and hit too hard for normal at least, its fine for hard mode to be like it is, but for normal feel like need like 20% nerf in HP/Damage, and Reduce critical wound to 30 second.",
            "I'd definitely prefer if nm has no wipe mechanics or extra lives like Argos but that would have its own problems.",
            "Echidna raid is fine overall. It has learning curve but that's okey.  \nThe bigger issue is the timing of the release, Since T4 was announced and changes to the vertical progression systems like transcendence a lot of people quit normal honing parked at 1620 stop doing elixirs and transcendence.  \nThis resulting in underpowered characters. Now add the new raid debuff(players not familiar with the raid have lower uptime) And you end up with bunch of Zdps players trying to clear a DPS check raid. Even tho the normal mode DPS required is 13M,  That's assuming everyone is alive and this raid has high chance of someone randmly dying.   \nAnd the amount of people with sub 13m dps is just insane....  I've seen 6m DPS and 26m DPS.   \nUsually so far the lower skill level players were somewhat able to compensate by investing more in their characters but that's just waste of gold right now before the changes come into effect.",
            "I swear 90% of you people have never played a raiding mmo before. There is no way you complain that the raid is too hard after 2 days. And its not even a recent thing this stuff happens at every raid release and after 2 weeks nobody talks about it again because people got better at the raid.",
            "Bro the raid has been out for what? 2 days and you are complaining that it is too hard? Well no shit, it takes time to get used to it. Nobody is forcing anybody to do a kid nah. Just go on and do whatever raids you want to do. Play at your pace or don't complain about raid difficulties when you try to keep up with the latest",
            "just do gate 1 then. That´s a cheese with 0 IQ mechanics. You dont even need to know patterns, you can just tank stuff pretty much.\n\nIf G2 was like that, it would be like a chaos dungeon. The charm is pretty dumb tho, since sleeps doesnt work properly.\n\nTbh, those that do solo, will most likely end up doing Only solo.",
            "Idk what else you would expect. Lost ark has always been about hardcore raiding. Always. \n\nThaemine was expected to be very hard. They said so multiple times long before it ever released. Echidna is brand new, people have barely begun learning, so obviously it's hard right now. But its also only a 2 gatebraid you'll have on farm in no time. Behemoth is another 2 gate snoozefest. The 2 announced Kazaros raids are also only 2 gates.\n\nRaiding has never been easier. \n\nPlayers constantly complain about how hard it is for new players to get into Loa while simultaneously now wanting them to get to endgame too early. You don't get it both ways",
            "https://old.reddit.com/r/PS5/comments/1dl39yv/turning_down_elden_rings_difficulty_would_break/?ref=share&ref_source=link\n\nSame energy as the people being made fun of in that post ,except in the MMO genre players are used to devs cattering to all their relentless crying over actualy getting good like in every other genre that has dificult content.",
            "Then why still play?",
            "If you can't deal with raid - you need to learn raid and your character. All raids can be done by actual characters, but you need to know patterns. If you don't want to up yourself, so... Sorry, it's not your game",
            "i think the raid is not a problem in this game, the problem is  progression is only mandatory in raids with wipeout mechanics. that's shit, how about you can progress in islands killing event bosses or guild raid like you can have progression and golds exclusive for guilds who will defeat some damn bosses.",
            "I said this since the very beginning yet I had all these white knights looking dumb founded lmfao. Difficulty should scale like how other normal mmos do it, even WoW does this. One shot mechs in normal mode which easily encourages gate keeping is beyond me, what a shitty design decision.",
            "yeah normal mode should be normal and matchmake able like old Oreha day but slower reward / progression. Hardmode can have better reward/ cosmetic. They just keep very weird raid design for no reason. One person fuck up whole raid wipe, or one shot pattern should not exist in normal mode. \n\nThier game frankly is not growing in KR currently as well. Game can not be both too grindy and hard.",
            "Problem is Koreans complained about this with Akkan. They want HMs to have a progression system of their own",
            "Valtan was peak goddamn",
            "Yeah, raid design hasn’t been good since Valtan for your average gamer.",
            "that was a raid where we got each others back\n\nunlike todays find the  weakest raids",
            "😂",
            "g1 is a noob killer\n\nso many puddles",
            "Thaemine was harsh but a good teacher on what to avoid.  \nStand in a red mech? You are fucking dead.  \nIn echidna she tickles you with her normal patterns and then timmy sends his Brutal impact on your dome.  \nI think after people get used to the normal patterns echidna is not that bad but it will take longer to learn that thaemine because she does not punish you as quickly as thaemine did.  \nI have like 1 hour of G2 peog in me and the normal patterns are already slowly entering my brain.  \nExcept the grab, that shit gets me All The Time.",
            "It's not \"too hard\", it's not fair. Giga Echidna spawns flowers on the floor that you cant see? butterflies that spawn randomly which can easily cause a wipe 7 mins in? It's just frustrating that one player fuck up can cause a HW raid in the future resets, and the playerbase already sees this being the case.",
            "They havent ,this game is full of people who came straight from league having never played any other MMO's and it realy shows, dragon nest had wipe mechanics in raids as far back as 2010(using this one as gameplay wise its the closest to LA) ,wow several years before ,many games who had raids did have them before,but god forbid a raid isnt cleared 3 atempts into the firstday its out when we're gonna be farming it on autopilot for a year.",
            "It's not about that,yes it new raid and it's take to learn the mechanic,but it's about how much punishing if someone make one mistake and it's 100% wipe",
            "No you see hes strugling to prog a raid 2 days in thats gonna bé and endgame raid for probably a year or longer,só it means the game sucks and no One should play it of course /s.\n\n\nThese are the same bozos complaining in the elden ring sub about the game being too hard",
            "I don't buy the 2 gates angle. It's 2 gates but one of them has twice the length and twice as many mechanics as a single gate. It's exhausting.",
            "The problem is you can't have an entire game built around hardcore group raiding. It doesn't work, there isn't enough of a population. Since launch, Lost Ark has lost like what, 95%+ of its playerbase? That isn't a recipe for success.",
            "Echidna is just terrible design - defend it all you want - doesn't make the encounter better - or change the fact that 1 guy getting charmed can instantly mean you have to re if he goes fast and slaps 2 players before a sleep nade hits. I've personally always hated charm mechanics but on vykas atleast it was very straightforward and not such a shitty rng fiesta. I even enjoyed thaemine 10x as much because if you died at least u know that you yourself fucked up",
            "I think you are  forgetting the fact that when this statement was true the raids were vykas and valtan, it went downhill from that.",
            "well except there is no gatekeeping and raid wipe by others messed up in Elden Ring. This is why I look foward to solo mode. You can not expect 7 other random bozos wont messed up the raid , then start to flame one another then vote quit after 30 mins if you just want to have a good time.",
            "And as it looks like its not gonna be anyones game in some time",
            "WoW even introduced that weird casual mode at some point as 3rd difficulty where the entire raid gets +dmg and -dmg taken buffs after each whipe up to 50% or so (I think its for normal mode machmaking ?).    \nThere should probably something similar in LostArk(+ less mechanics), just make sure that this mode is enough to progress to the next content (no need for high lv trans/bonus stats but ilvl should never be gated behind it).",
            "yea. normal, or \"easiest\" mode is too difficult for casuals. some 1 shot mechs are hard to balance, like falling off, you gunna die no matter what if you fall (even in wow), though i suppose they could tune the fight to have less knock out patterns in nm.",
            "those white knight would make good slaves back in the day",
            "Would hard mode having more mats & more mechanics not be enough of a progression system for them? Either way, MMOs need casual players to thrive and since Lost Ark's best feature is it's raiding they need to make it more casual friendly/approachable. \n\nIf they can't solve the gatekeepers ( they can't ) then they need to do it by changing the content itself.",
            "Coming from league makes the game easier (in my opinion). Never felt like something is overly difficult except getting into raid at the first place.",
            "I mean.. in league a single person can waste 20 mins of ur time xD",
            "Elden Ring bosses get easier when you let someone in your instance. \n\nLost Ark doesn't even let you play the boss and players gives you G0 treatment. Stop comparing these two games.",
            "Overlooked facts",
            "true with all the phases in gate 2\n\nfeels like gate 2 -> ghost phase (BOOBA) -> gate 3 -> ghost phase (razer ad)",
            "Honestly if they just seperate gate 2 into 2 separate gates it would relieve a ton of pressure on the fight.",
            "Maybe not in the west. But the game was not designed for the western audience. Loa has been doing just that for 6 years and, highs and lows, has always been a juggernaut in KR. \n\nIt seems a lot of Western players have a hard time coming to terms with the fact that this game wasn't made for them. They're far too used to playing Activision/Microsoft/EA games where the west is a priority.",
            "It's player issues only, if they don't want to learning. No need to cry about \"It's so hard\". Don't know, we just try raids in static, before all teammates don't learn raid in most cases. In some time we start to clear with randoms, because of work time issues. Ofc, can be gatekeeping, ofc raids can be not closed - nobody in save. But, we do everything for upgrade our hands and characters.",
            "This actually sounds like a good addition, the escalating buff thingy.",
            "Or tune every mech/dmg req. after knockoffs to be fine with 1-2 less players, or offer revives again (I think they do for the 16man raid anyways).",
            "Yea If your good at league most of the raids in this game are easy.",
            "Please ,not even a week from now echdina Will bé in homework mode,plus id like to see yall playing without support,theres a reason you dont solo guardians despite having the ability to do so",
            "g1 feels like a mob phase with some mech from wow and id rather do 1 longer gate then a raid with 4/6 gates like vodis and old brell",
            "I don't think they're going to let the Western version of the game just die though, that's the thing. The American market in particular has a loooot of money, particularly the kind of person that Lost Ark tries to cater to. There's going to have to be some compromise between the KR and Western market, and that compromise is starting with the batch of solo raids. If they're successful, you're probably going to see solo versions creep into the newest content. Just the way it is.",
            "6 years? Yeah ok bro. Legion raids were introduced barley 3 years ago and the game is falling off since. From these comments you’re just someone who has too much time and money invested so to cope with the regret you defend the game with all your heart, even if it’s bad, but I don’t blame you.",
            "Seems reasonable to me. I just hope the next time blood, zombies, skeletons get censored to accommodate China you'll be there to preach the benefits of accommodating other regions to bolster a games population and overall health. The western audience surely doesn't fight that every time and try to force devs to go back on their decisions. Just like I'm sure the KR audience will happily have their game changed to accommodate us",
            "You talk like a child",
            "Most games do censor that stuff for China (WoW did I know), but that's not really gameplay system related. I mean I don't know what else you want the devs to do, the game is/was dying in the West and when they launched the game they saw a huge profit increase only to see it dry up over the last year and a half because of the issues the game has. There's still going to be hard raid content, just maybe offered in both group and solo options. I don't think that's a problem.  Do you just want them to shut down the game in the West and lose out on all that market?",
            "I'm a Redditor on Reddit. I'm not qualified to think up meaningful changes. I have no clue how they could do it. And to be frank it's not my responsibility to think of these ideas. Additionally I never came here to start a plight to change the world.\n\nMy comment was to acknowledge the game was not made for us in mind. We are and always will be secondary and that people should fully expect that and not go all surprised Pikachu face when they get treated that way"
        ]
    },
    "Prog be like:": {
        "title": "Prog be like:",
        "score": 309,
        "url": "https://i.imgur.com/ZcufNFE.png",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Me, making a link achievement lobby immediately after i get achievement while dead and kicked from party",
            "Everyone worse than me is a noob, everyone better than me is a cheater.",
            "True and real XD",
            "You mean the entire Lost Ark community?",
            "How easily many people forget....",
            "I joined a “worse” prog last night and we got further then I had before in G2 within 30 minutes. Sometimes you just don’t know.",
            "On the echidna Right Safe pattern. 🌞",
            "The gatekeeping is real in g2 lol",
            "Yesterday on prog , someone kept dying before the giant phase, after giant phase leader used hellfire and then told him that he gave him achievement, go try other lobby xD.",
            "You mean Tryhard sweat virgin with no life"
        ]
    }
}