{
    "Damn it V, so much for quiet! Saul's gonna be- wait, did you just go and kill literally everyone?": {
        "title": "Damn it V, so much for quiet! Saul's gonna be- wait, did you just go and kill literally everyone?",
        "score": 199,
        "url": "https://i.redd.it/0h08ccz0n28d1.jpeg",
        "content": "",
        "num_comments": 21,
        "comments": [
            "I hate scripted car chases in this game, so I make sure to rescue Saul as quiet as possible to avoid getting chased later ;)",
            "V: \"MEEP.\"",
            "Is there a reaction for speed?",
            "V's stealth missions never go as planned. Classic Cyberpunk.",
            "Is it still successful stealth if I murder everyone with Guts before Sandevistan runs out?",
            "\"Yes, Panam I killed them - with a dildo.Why do you look at me like that?\"",
            "That's what I do with my sandevistan or berserk build.",
            "Redditors can be wild, but that’s part of the fun.",
            "The wraiths have to die.",
            "With any game that is me when stealth is optional. Optional stealth? Time to break out the minigun!",
            "No i did it stealth then went BACK and killed everyone",
            "no, I‘m doing stealth, I usually just fuck it up after the first enemy",
            "You see with smart guns this is a non-issue.",
            "Going in through >!the storm drain!< makes it so you don't have to interact with a single Raffen.\n\nThen you can go back later to get >!Problem Solver!<.",
            "\"MEEP MEEP Motherfucker!!\"",
            "I mean I keep stealth as an option in my build, it's something I can do as much as any netrunner, but I altered my build recently to be more of a netgunner, contagion and thermal monowire, with a fire SMG for range, oh just thought of another way to group enemies close to each other, time to update my quick hack Loadout.",
            "I never said it was about the guns or being able to hit them. \n\nI hate them because they’re scripted. \n\nThe worst one being the chase during Sinnerman. And you don’t even shoot there.",
            "Correct assuming you have enough tech skill ;)",
            "Yeah most of the scripted chases load the enemy car up with ICE so I can't just blow it up or make them floor it into oncoming traffic seriously why is \"floor it\" so good for making enemies go away?",
            "Sinnerman pissed me off heavily. The story was great, but the technical setup .... jesus. Especially since it really _felt_ scripted. On almost every step of the mission were countless possibilities to do something that was essentially prevented by obvious scripting and sudden \"mission failed\". The whole quest could have been a long scripted sequence with quick time events and it would have felt more honest.",
            "A theory is that that side mission was one of the earliest they did, and they were still learning the engine, but I dunno how valid that claim is."
        ]
    },
    "Name this band": {
        "title": "Name this band",
        "score": 257,
        "url": "https://i.redd.it/f1kiojd4v08d1.png",
        "content": "",
        "num_comments": 54,
        "comments": [
            "Our Cracks",
            "Big V and the Cracks",
            "Them holes",
            "Tight Slacks",
            "The Himbos & The Banshees.",
            "Femz&Twinkz",
            "Mid Life Crisis",
            "Glam holes",
            "アスホイプ\n\nASUHOIPU\n\nASSWHIPE",
            "V, K, and the Heartbreakers.",
            "3 girls 2 guys",
            "Van Full of Arson",
            "John",
            "Silverhand wannabee and the gals",
            "Kelly's Krew 🤣",
            "Mods? Ik this is off topic but why my v never look that badass",
            "Manneskin?",
            "2 guys, Spider eyes, and the other two",
            "Neon Samurais",
            "Kerry has crack(s)",
            "Crack Metal",
            "Unite States Cracks",
            "Vodka Shots",
            "Doosh",
            "Peaceful Ara-Ara Suckers",
            "PUSSLETHWICK",
            "Hep C",
            "Shizzl",
            "PON PON",
            "K&V's Pon Pon Shit",
            "Us on crack",
            "Butt cracks",
            "Muse?",
            "They were on which radio station?",
            "Pon Pon Shits",
            "3 girls 2 cucks",
            "Johnny and the Sinners",
            "One Direction",
            "I think that’s just the Babymetal and Electric Callboy collab",
            "dolls, tboy swag, and a merc.",
            "Bruh, the blue one looks like Lucy",
            "Diabetes",
            "In the middle of the street",
            "Heh, I was thinking Kerry and the Cracks.",
            "The legally correct romanization is \"I-Swipe\"",
            "1 cup",
            "I don't think so. Cool starting with clothes and photomode poses",
            "Yeah I do use mods. What are you interested in?",
            "Red Menace is looking unusually thic.",
            "\"If the police can't stop you, then you must be on the DST\"",
            "Our cracks",
            "Are those cool arms mods?",
            "Yes. Arasaka Cyberarms is the mod, Deus Flex 2 is the skin."
        ]
    },
    "I swear I can never focus on Takemura with this guy STARING at me while weirdly eating his burger": {
        "title": "I swear I can never focus on Takemura with this guy STARING at me while weirdly eating his burger",
        "score": 638,
        "url": "https://i.redd.it/053bgrctky7d1.png",
        "content": "",
        "num_comments": 28,
        "comments": [
            "For me, it’s the waitress standing there taking his order the whole time… while he’s eating",
            "I really like it, it's common with all of Takemura's meetings. There's always someone watching.",
            "Dude's just trying to enjoy his burger and you're eye-balling him. For shame.",
            "That's Hamburgo Arasaka.",
            "\"Look at me V. I know you can read my thoughts...\n\n... meow meow meow meow, meow meow meow meow, meow meow meow meow meow meow meow meow.\"",
            "That's the point. It's an ilustration of the theme of his dialogues.",
            "The everlasting burger ",
            "He was just eating his burger.... MENACINGLY",
            "I'm just glad 2.0 put the pizza in the plate instead of half way on lol I kept turning to look at it",
            "Ok I wasn't the only one 😂😂😂",
            "I did that scene yesterday.\n\nI wish I could focus as well on anything as that man focuses on that burger.",
            "Wait, there's people in the background??",
            "I really hate how they disabled dialogue skipping in that scene. I'm not a new player. I don't need forced exposition.",
            "He wishes it was your meat between his buns.",
            "Dude eating the burger has some weird baby hands.",
            "but more importantly, the detail on that Jah Love poster on the window",
            "I always stare at his hands. If I could trade my ganic arms for Gorilla Arms cybernetics, I would. But only if they were as advanced as they are in Cyberpunk.",
            "I legit thought it was some 8 year old kid at first 😂😂😂",
            "Authentic diner experience",
            "He's just taking the Big Bang Burger challenge. Gotta supervise him to make sure he's not cheating",
            "lol for me she takes the order for like 5 min, walks away, comes back then retakes the order lol",
            "meanwhile I'm always distracted by the noise of the homeless person urinating on the dumpster outside somewhere behind us.",
            "Like the cat",
            "Dudes like: broh idc if your Johnny himself planning to take down arasaka again. I just wanna eat this burger. It’s been a long day man",
            "I never thought of it that way !",
            "Mine used to change colour, strip itself of it's topping, have the topping return. Super distracting.",
            "You think he has the Guts?"
        ]
    },
    "Am I the only one who really loves the retro business style of the netwatch agent? Would love to see more clothing options like this": {
        "title": "Am I the only one who really loves the retro business style of the netwatch agent? Would love to see more clothing options like this",
        "score": 653,
        "url": "https://i.redd.it/i5cucx24jy7d1.jpeg",
        "content": "In a world where all the fashion is super loud, flashy, over the top, there’s something kind of cool about the drab monotony of an old school retro stripy shirt and tie. Combined with the sick head cyber ware and badge that gives authority, I honestly think this guy is one of the best designed characters in the game. I really would love some options like this for my corpo playthrough. Does anyone know of a mod to get this outfit or something similiar? (…. Can anyone make one hahaha) ",
        "num_comments": 49,
        "comments": [
            "Since I first laid eyes on him. I absolutely LOVED his style.",
            "Mosley’s design is top tier.",
            "Totally agree. It actually annoys me how difficult it is to find halfway normal clothing. It’s especially difficult to find dress shoes for fem V that aren’t fuck-me pumps or clown shoes",
            "\"Hi yeeaaahhh, your doing a really great job at mitigating that black wall. Really well.\"\n\n*Sips coffee*\n\n\"So well infact, Net watch could really use your help over the weekend so uhh...yeaahhhh....\"\n\n*Sips coffee*\n\n\" I'm going to need you to come in on Saturday, yeeaaahhh. I know it probably won't be a problem, so Thanks so much, I really appreciate it.\"\n\n*Sips coffee and maintains eye contact*",
            "He's so hot oh my lord.",
            "Or even better his fckn cyberware, fckn insane there’s no cyberware cosmetics in a game set on a world where technological body enhancements are at the core of society",
            "I loved this interaction so much, wish there were more moments like this where someone earnestly tries to convince you to switch sides - actually prove and debate the facts. \n\nFelt very respectful, like as a player, I was placed on equal footing with another person that had their own goals, values, and things to gain/lose depending on how things went. \n\nIdk, the other “who do you side with?” Dilemmas just didn’t hit like this one.",
            "Looks like a chad, keeps calm under pressure, even smites your enemies before they do that to you. This man is the goat.   \nShould have been a love interest for female V.",
            "One of my fav missions in the game.He's just too cool, also fuck voodoo boys.",
            "Anyone who dosent help this guy is a twat honestly.",
            "He’s like my very, very annoyingly competent dad. I think I know more than him about something/the world. I don’t. Not even close.",
            "Nah I’m with you lol, I dig it. I don’t tend to vibe with a lot of the cyberpunk fashion, so I tend to stick to businesswear or leisurewear, over high fashion, or urban flash",
            "Falling down style",
            "He reminds me of one of my uncles, who has amazing drip, but also deserves to be fed into a mulcher. It's complicated.",
            "I was both so used to real world fashion and this games fashion that I hardly noticed how simple and neutral his look was. He kind of blends in but also sticks out at the same time, I don't know how to describe it. I definitely like it though, I'd take that over the Corpo starter outfit any day",
            "I thought his outfit was perfect. He looks like (and actually is) a very dangerous bureaucrat.",
            "I knew I couldn't trust him either, but he has a better angle than the voodoo boys do.",
            "I knew I couldn't trust him either, but he has a better angle than the voodoo boys do.",
            "well gppd news not long ago a mod released on pc added his clothes !! plus some others [https://www.nexusmods.com/cyberpunk2077/mods/13776](https://www.nexusmods.com/cyberpunk2077/mods/13776)",
            "I adore how characters we only see briefly in this game are still intricately designed. CDPR really doesn't get enough credit for that.",
            "Right up there with Rita in terms of super memorable minor characters",
            "Mosley got the drip that keeps drippin’. Also the good guy in the VDB exchange, I don’t care what the game/internet tries to tell me.",
            "I was disappointed that he never shows up again despite what he says when you leave of you take his side.",
            "es this character is awesome. Clothes, cyber ware, and his love of old westerns is just perfect",
            "Nanami drip",
            "I just want a regular plain pair of damn blue jeans please cd project red please 😭",
            "I'm more a Shawn of the dead type.",
            "No. Wholly-nonfunctional neckwear has no place in human society, post-industrial or otherwise.",
            "Then you blasted him in the face?",
            "I would love better shoe options for V that are MORE fuckme. Rn the few heels in the game are so matronly and office shoe height. The same ones worn on npcs are actually taller and look cooler\n\nI also want the sexy thigh high boots and stuff that you see on npcs",
            "I just want a pair of regular fit boot cut men's jeans for my nomad. The starting ones are okay but they tuck into your boots instead of going over the top of them which is something you don't typically do in cowboy culture.",
            "I hated that ALL boot for fem V were high heels abominations. Just give me the exact same fucking boots male V has. \nEven the clothing mods didn't resolve that issue for me.\nThere's these sick armored boots for fem V but they have heels and it just ruins them so fucking much.",
            "I'm now picturing some random low level corpo driving a Maimai, stuck in Pacifica traffic singing along with Ratatata...",
            "Yeah and I like how he’s just like… whoa there tiger hold up before you kill me let’s have a chat, it’s weirdly rare that anyone respects V properly",
            "Netwatch simultaneously does the most important work (stopping rogue AI's) and the most heinous work (keeping the Net under complete corp control) at the same time. I think it's fine to have a distaste for them and side with the VDB's, especially since they basically both fuck you over anyways.",
            "With a face like that. Never.",
            "Idk why they didn't just make all npc clothing wearable by the player tbh. Their options are sm better",
            "I think that's because heels actually just shorten V's legs in game, too tall heels would make it too obvious and look ridiculous ",
            "With a broken printer in the trunk?",
            "Probably the same reason we can’t get other cars that are already in the game",
            "I'm on PC and safe to say that we got almost every NPC clothing via mods, I have zero game dev knowledge but \"Idk why they didn't just make all npc clothing wearable by the player tbh\" is not that simple: clipping.\n\nGlove? Will clip with arm cyberware. Long sleeve? Arm cyberware. Complex clothing like long dresses etc? Would looked awful on third person driving camera, also we sprint and jump like psycho, the clothes physics would be funky.\nAlmost every single clothing in the game are designed to fit with each other, so shirts won't clip with jacket or pants. For example some modded shirt will just clips out of base game jacket, modded glove will just floats if you pull out the mantis blade.\n\nThe workload to add 200+ more clothes that will fit with each other would be massive, and they got a game to fix first. I assume that's why we don't get any new clothing at 2.0.",
            "Yep I know, but her shins are so crazy long compared to her body that I figure they can still spare an extra 2 inches for even higher heels",
            "I hadn’t thought about that but damn it makes sense",
            "I think that comes in Act 2.",
            "The game has long sleeve clothing, they just roll up the sleeves in first person view.",
            "Yes, I know, for those who asked about \"why no long sleeve on first person\" since release.\n\nMost of modded clothes with long sleeve aren't using the auto-rolling sleeve (I believe the system is called Garment Support?) mechanic so when you're using arm cyberware the sleeves just clipped the fuck out of it. As goofy as rolled sleeves looked, that's the reason why they auto-roll up the sleeves.\n\nCan't wait for the next gen Unreal 5 dynamic adaptive sleeve rolling mechanic in the sequel 🤞",
            "Making sleves roll up an toggle and force them up only with said cyberware would be better than not allowing to have gloves and rolled down sleves at all",
            "Yesss that would be preem. Not the biggest fan of RDR2, but one of the most memorable feature for me was... the ability to tuck in your pants inside the boots. That feature didn't move any game innovation needle but I really love tiny little features like that, more personalization is always welcome.\n\nJust hope that CDPR factor in more neat little 'pointless' mechanics like that in the sequel, something like looking in the mirror and making facial expressions in 2077, one of my favorite feature in first person game."
        ]
    },
    "Trying out portraits in photo mode": {
        "title": "Trying out portraits in photo mode",
        "score": 70,
        "url": "https://i.redd.it/0vryqngsa18d1.png",
        "content": "",
        "num_comments": 3,
        "comments": [
            "So much better than the \"portrait\" overlay frame that wastes 70% of the available resolution.",
            "mods:\n\n* [glasses](https://www.nexusmods.com/cyberpunk2077/mods/7435)\n* [mask, headphones, shoulder+elbow+knee pads, tac vest, neck brace, radio, plating](https://www.nexusmods.com/cyberpunk2077/mods/13212)\n* [bodysuit](https://www.nexusmods.com/cyberpunk2077/mods/8636)\n* [tights](https://www.nexusmods.com/cyberpunk2077/mods/3491)\n* [cyberware](https://www.nexusmods.com/cyberpunk2077/mods/4548)\n* [body harness, shoulder strap w/ pistols](https://www.nexusmods.com/cyberpunk2077/mods/3041)",
            "so i cant do this in base game \n\n:("
        ]
    }
}