{
    "Apple Event Discussion Thread: WWDC 2024 Keynote": {
        "title": "Apple Event Discussion Thread: WWDC 2024 Keynote",
        "score": 12,
        "url": "https://www.reddit.com/r/mac/comments/1dcqb8z/apple_event_discussion_thread_wwdc_2024_keynote/",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Sorry to the guy that made Rectangle 😔",
            "It's funny how often the idea of OCR for math & equations comes up on the eInk device subs ... so the new math notes feature in iPad calculator is pretty cool to see.",
            "iOS Apple takes from Android. Android takes from Apple. Each talk like it it mind blowing new features.",
            "I wonder if they limit the airpods pro features to the USB c model.",
            "Honestly I thought the MacOS section was disappointing. I was waiting for it the whole show and missed the first maybe 3-5 minutes but to see that it was mostly update features from iOS plus maybe 3 more was a bit disappointing, plus the AI of course which I dislike.",
            "Have you done the Vision Pro demo at the Apple store?\n\nWhat price would you pay for the Vision Pro?",
            "I'm glad there's competition. This is good.\n\nI wish there were a viable third competitor. MS really screwed the pooch on that one.",
            "Naw. You can buy just the case for them for $100 usd.",
            "I feel like I would love to have one for 1500 or less, and to get there they can remove really dumb features like the little screen that shows your eyes on the outside.\n\nI think I will really enjoy the Vision Pro 3 or 4. Until then I can't justify spending that kind of money."
        ]
    },
    "Is there any way I can turn off the exceedingly repetitive \"Which MacBook should I buy?\" questions in my r/mac feed?": {
        "title": "Is there any way I can turn off the exceedingly repetitive \"Which MacBook should I buy?\" questions in my r/mac feed?",
        "score": 64,
        "url": "https://www.reddit.com/r/mac/comments/1dlpfok/is_there_any_way_i_can_turn_off_the_exceedingly/",
        "content": "Asking for a friend",
        "num_comments": 21,
        "comments": [
            "Yes, if the moderators pin this url\n\nhttps://www.apple.com/mac/best-mac/",
            "The annoying thing is that most have already decided what to buy - they just want validation before dropping the cash",
            "Implement a bot",
            "Thank you. These questions also pop up regularly in the Logic subreddits and it is beyond annoying. I’m always tempted to recommend to the OP to buy the most expensive MBP with maxed out specs. You never know what you might need in the future…/s",
            "People want buying advice, and it's often not satisfied by a simplistic decision tree from Apple on the \"best Mac\" for anyone's particular requirements.  Perhaps if it upsets people there should be a Mac buying advice sub, linked to prominently in the sidebar, and any questions about buying a Mac here should simply be banned?  An auto moderator could auto delete threads asking about which Mac to buy and point them elsewhere...",
            "You’re new to Reddit, aren’t you.",
            "An internet without exceedingly repetitive questions would be like a good music concert without hundreds of raised smartphones.",
            "Mute this sub and resign r/appleiscult",
            "Very optimistic of you to think that a pinned thread will prevent repetitive questions.",
            "the reality is most people don’t read pinned posts",
            "It’s weird how the droves of people won’t just scroll down and notice every other post is the same question.. albeit worded slightly different",
            "The million dollar question is...\n\nWill they do that when 'What should I buy?' is 80% of the activity on this subreddit (with 10% being pics taken of someone's brand new toy, 5% discussion of actual OS features, and the last 5% being a wishlist of iOS features)?",
            "I think my (I mean, my friend's :) ) frustration is that 98% of these questions are already extensively answered in Reddit, on YouTube, etc. Just do some research and you'll find your answer, no need to ask the same question that 2378 other people have already asked... I agree with you, a \"buying advice\" sub would be good.",
            "lol, 2 members and 1 post that’s nonsense. Nice sub dude.",
            "Couldn’t hurt.",
            "I don't know how pinning in reddit works, lol",
            "The mod could put the url in a post and pin it, no?",
            "And they'll be asked again!  I guess some like answering them, most don't.  Regarding Macbook's specifically, the fact they are non-upgradeable (even by Apple), so any decision has to be taken at outset which adds a layer of jeopardy in the buying decision. And the upgrades are expensive...  In the old days, you could just take out the old HDD and RAM and upgrade it, but that's not an option now.",
            "People are lazy. Why spend a few hours watching YouTube when you could post on here, ignore it for an hour and come back to a page of answers - all sorted from best to worst using the upvote/downvotes as your guide and discussion along with it. \n\nIt’s the easiest, fastest tailored advice you can get.",
            "Yes, but u/boterkoeken means that even if it is pinned as a thread/post, people won't read it. It's often the same with subreddit rules.",
            "Yeah but I think people will not read it. Seems like many people on Reddit don’t even bother searching for common topics, which would already answer their questions. They just post things without really thinking about it.",
            "[deleted]"
        ]
    },
    "even apple recommends 16gb": {
        "title": "even apple recommends 16gb",
        "score": 282,
        "url": "https://i.redd.it/pz251nh7708d1.png",
        "content": "",
        "num_comments": 73,
        "comments": [
            "16GB is also the minimum threshold to use the upcoming AI code completion feature in Xcode and Swift.",
            "Well, yeah, you’re looking at the recommendations for a pro video editing app. The base models aren’t supposed to be suitable for all use cases.",
            "For Final Cut Pro 🗿",
            "why wouldn’t they? does anyone actually think apple making 8GB base specs is because they think it’s enough?",
            "That is a requirements guideline from Final Cut. You can have different opinions about what the RAM number should be (which I agree) but you shouldn’t be misleading. You’ll also lose credibility and nullify an otherwise valid concern",
            "Of course. Nobody do video editing with 8GB Ram. Where is the joke?",
            "I mean isn’t 16GB of RAM becoming standard?  It’s kinda the bare minimum I’d recommend for gaming these days, let alone a professional program.",
            "For Final Cut Pro? Sure, 16GB is a lot better than 8GB.",
            "I use Final Cut 10.7 (not upgraded to the latest version yet) on my base M1 Air with 8gb RAM. I edit 4K, 60fps, 10 bit video and it's really impressive how well it handles it. The only issue I've had was some of my footage from my drone came out super wobbly - I ran it through Gyroflow (a stabilisation app) and then tried to add extra stabilisation in FCP and it took quite some time. I'm very much an amateur though, making videos for Instagram and youtube. A friend of mine does it for a living - making videos for F1 teams, for example - and obviously he needs something much more powerful for what he's doing.",
            "8GB is a joke in 2024",
            "System requirements has always been a thing.",
            "Of course they would, any manufacturer will recownd the highest",
            "But it works fine with 8gb.",
            "On my Intel MacBooks 16gb was unusable. But since those workloads won’t run on M series, I guess 16gb will have to do.",
            "8GB on MacBook Pro is fine, why do we have these posts once a week. Do you guys have a group chat and just take turns or something lol\n\nJust because it's a MacBook **Pro** doesn't mean it's specifically for Video Editors? Pro's could be people who have simple needs (spreadsheets, documents, video meetings), they are just managers, or accountants, or execs, or any professional. Pro doesn't a professional videographer or Pixar animator lol\n\nAlso you do realize 16GB is a ***recommendation.***\n\nI love these posts though... half the people say 8GB isn't enough, the other half say it is... if there's people out there who are running 8GB without issues, obviously it shows its plenty.\n\nIf you need more, simply pay for more. People should be complaining about the cost to upgrade to 16GB",
            "Wow really? I guess it’s because the AI runs on-device rather than over the web like copilot?",
            "a macbook *pro* base version shouldn’t be having less than recommended, is all i’m saying",
            "then it’s not a pro laptop",
            "Its a macbook PRO man, its an utter bullshit that their pro laptop is not recommended to use one of their apps",
            "It used to be you could install more RAM later if you needed it. Now they literally prevent you from being able to do “pro” work on a “pro” machine that wasn’t specced for it.",
            "Youtubers all throw their hands up in despair as they still cannot make their \"Base model Mac is all you need\" video for another year",
            "I edited a complete feature film in FCPX on M1 MBA 8Gb and I had to quit my other apps to get better performance. Also, 3 years later, I'm seeing 88% ssd ageing, probably due to active swap memory.\n\nFor TV commercials and music videos I didn't see much slowing down.",
            "It used to be you could install more RAM later if you needed it. Now they literally prevent you from being able to do “pro” work on a “pro” machine that wasn’t specced for it.",
            "The joke is that a pro device should be able to run pro apps, therefore there should be no pro device with 8gb of ram,",
            "You can make Reels, which can make good money, with an 8GB RAM Mac. I made 2 in iMovie on my MacBook Air, without any issues. \n\nI didn’t make any money lol, but that wasn’t the goal",
            "16gb was a joke 5 years ago. Why are we still stuck on these puny little specs?",
            "It used to be you could install more RAM later if you needed it. Now they literally prevent you from being able to do “pro” work on a “pro” machine that wasn’t specced for it.",
            "You can get more RAM if you buy a Mac that has it preinstalled, but otherwise you’re SOL because their RAM isn’t upgradable post purchase. They literally prevent you from being able to do “pro” work on a “pro” machine that wasn’t specced for it.",
            "As a student and music producer, 8GB is way too little for a ‘pro’ machine. I have a live set tomorrow and my anxiety is through the roof mainly because I’m running it with only 8GB of RAM. Worst purchase of my life getting that stupid machine.",
            "The regular AI goes in steps, on-device, then in Apple’s Private Cloud, lastly to Chat GPT if desired. Not sure if the Xcode version has the two web options.",
            "I will staunchly defend Apple for 8gb of ram in their baseline consumer models. I’m a dev and I used an 8gb mba as my personal device for the longest time, and it was absolutely usable even for dev projects. For what the vast majority of people use a laptop for, 8 is plenty. \n\nHowever, there’s absolutely no excuse for 8gb on a pro model. Pro should mean 16gb minimum. There’s really no excuse for it.",
            "No. Pro doesn’t mean video editing. There’s tons of professional software that require much more than 16gb.",
            "Well, the M3 Pro version starts at 18GB, the M3 version is basically a MBA for those who want a better screen.",
            "Except the base MacBook Pro now has the base M3. Yes, it has the Pro monicker, but the base model offers the better display, audio, and battery life but with a more affordable and less powerful chipset. For some people who aren’t professional creators, that might make it a different class of laptop over the MacBook Air without it being significantly faster.",
            "Not sure what the problem is here. There are different configs available, and you can customize one if you don't like any of the stock ones. \n\nSo if you want 16+GB of mem, then buy a MBP with 16+GB of mem.",
            "So don’t buy one.",
            "Why. How many are using pro video apps?",
            "I know. I had MacBook and iMacs dim 2011,2012 before and always replaced RAM myself. \n\nTherefore I went with 64GB with my MacStudio with the new machine. \n\nThey force you to buy bigger machines. But in the end you need it anyway.",
            "But otherwise they couldn’t advertise it as that cheap in the entry specs… \n\nIt’s pure marketing. Those machines are not meant to be sold… or only to people who want to flex in a Starbucks \n\nYea it’s crazy",
            "Editing a reel is not the real target audience of Final Cut. You can edit feature film and 3 hour documentary with hundreds of layers and animations, text etc. in 4 or 8k if you want. \n\nI usually do a lot of multi cam editing in Premiere. Concerts, musical recording with multiple cameras. \n\nDisk speed is more important to read footage. Rendered files will be saved as files and not in RAM. So editing with less is possible but not recommended as the software itself needs RAM and other elements like Motion or After Effects rely heavy on RAM because they do not render in real time all the time and need a place to save current view.",
            "Yeah, my school PCs had 128GB of RAM. The teachers said that 16GB is a joke and told us to buy better computers. To me my teacher told me to ''buy a real computer'' not use a toy (MacBook Pro)",
            "Yes, you could but it still came with limitations. And still having socketed memory around would also cause limitations.\n\nMemory requirements changes very slowly over time and always has been.",
            "I wish they’d rename the laptop so people stop with the dumb “pro work on a pro laptop” nonsense.",
            "For the Air, the price of that laptop is quite appropriate imo. 8gb works fine, sure. So what you say is valid. But even on the air the cost for expanded memory and other upgrades is unjustifiable, way more than most other built-to-order or multi-SKU laptops.",
            "My girlfriend's MBA pages to disk constantly just from browser tabs and word docs or PDFs...\n\n8gb is a joke today, especially for $1300",
            "Would it be too far to suggest that the Pro models maybe shouldn’t get the base chips anymore either? Like, say the M4 is about to come out, what if the Air, Mac mini and iMacs start with the regular M4 chip with options to upgrade but the MacBook Pro and above start with M4 Pro? Does that make sense?",
            "Even for web devs 8gb is not enough the moment you run vs code, sequel and a browser…. My damn MacBook pro memory pressure is always on yellow or red… even a damn n100 mini pc that i bought off ali express for 120 euros came with 16gb ram… i was literally forced to buy an dedicated device to run docker because that would kill my mac… Pro my … when i bought this macbook, it was the first time i bought a new, more expensive machine that actually came with less ram than my previous pcs, i was using a mid range desktop pc with 16gb for almost a decade before i bought the mac in 2019, even then 8gb seems like too little for such an expensive laptop.",
            "Honest question - what sort of dev? I had a lot of compiles bring my old MBA w/ 8gb to it's knees. And IntelliJ would regularly have typeahead lag or just not work. (Admittedly, IntelliJ is heavy, but it's a core part of workflow when I write Java at this point) \n\nDidn't seem to have as many issues with GoLang stuff though.",
            "thank you! yes, Apple SHOULD put more ram in it! but Apple should do a lot of things, I needed a laptop asap last September and bought an off the shelf base model M2 MBA just to get me through my last two semesters of college and it did more than fine. I love this little machine. I realize I’m going to probably have to upgrade sooner than I did my last MacBook, but that’s fine. I got this sucker for $899 at Best Buy and it’s more than done its job.",
            "8 GB might be enough for development in smaller projects with simpler tools. In some stacks, 16 or even 32 can be limiting. (To be fair, if 32 is not enough, your stack is probably severely overcomplicated.)",
            "Agreed, but also, it's shocking how powerful the mba is for heavier workloads with upgraded memory, 8GB won't bottleneck most users but it can bottleneck the chip. I feel it does deserve some attention for those of us who don't want Pro bulk. (I love how light the mba is!)",
            "My wife used an 8gb model as a professional designer for years, only stopped cos she dropped it and broke the screen. I don’t think it’s great value but my god I don’t care about all the whining about 8gb. We are buying apple laptops, it is expensive, we pay our money and make our choice.",
            ">However, there’s absolutely no excuse for 8gb on a pro model\n\nTime and time again I see this exact sentence copy-pasted. Time and time again I fail to understand it.\n\n2021: 16GB for $19992024: 18GB for $1999 with an additional option of 8GB for $1599\n\nWhere are you losing? Or are you just mad that the value of your pro-status-symbol has deteriorated? Because that's the only explanation I can think of.",
            "Then give it infinite GB 👅👅",
            "And more ports and longer battery life.",
            "I know, but you didn’t say Final Cut, you said video editing. \n\nMore RAM is def needed for bigger projects, but smaller tasks like Reels or promotional material can be done in iMovie or another less intense software.",
            "If I ever become a father, I’m sending them to your school because who tf has a computer lab that tricked out.",
            "> limitations \n\nLimitations to Apple's profits?",
            "Yeah if you've got Word docs that need multiple gigabytes of memory to open, that's not a lack of memory issue. lol",
            "maybe an app is memoryleaking, there is a popula rpdf reader which does that really bad",
            "I mean that basically was the case with the first M1 MBP? Yeah there was the 13“ MBP with M1 and touchbar but that wasn’t really anything people considered (it was basically just an MBA with fans). For most people the baseline pro was the 14“ MBP with M1 Pro and 16GB ram - that was a valid pro base model.",
            "14 pro with non-pro SoC was supposed to replace 13-inch MBP, which also had base M\\* chip. I honestly think that segment shouldn't be there.",
            "I use MBA 8GB for SwiftUI development and it works fast. I find that the new Xcode beta works a lot better than the current Xcode release.",
            "You're trying to ride a dead horse. RAM is cheap nowadays, and yet Apple will keep it at 8 GB forever if it had the means to do so.\n\nWe're complaining that while everyone else had raised their standards, Apple continues to limit their consumer level products despite maintaining a huge starting price and charging a premium for a meager 8 GB more RAM.",
            "I hope you'll be a father someday, but please don't do that. I studied video game programming and I wish I would've chosen something else instead…",
            "That's one limitation, yes. But there are plenty. You gotta have an open mind and see all the benefits as well. There are always pros and cons with everything. But no one is forcing us to buy anything. If you think it's bad with soldered RAM, don't buy it.",
            "She's allowed to have multiple things open, it's not an OG iPad lol\n\nAs soon as it boots it's already at 3/8gb, yes I know it's got compression but it's stupid easy to burn through 5gb of RAM.",
            "The 14\" with M1 Pro and didn't come out until November 2021, about a year after the first M1 Macs came out.\n\nSo from November 10, 2020 to November 5, 2021, the only options for Apple Silicon Macs were the Mac Mini, iMac, 13\" MacBook Air, and 13\" MacBook Pro with Touchbar (which, as you said, was basically a MacBook Air with a fan), and all with the base M1 chip (no M1 Pro or M1 Max available).",
            "Yeah, now we have the 2 MBA’s with M chips, I just feel like having a base M chip on a Pro machine is just a bit redundant now. If you want size but not power, there’s the 15” Air. If you want power but less size, you’ve got the 14” Pro. That just makes more sense in my head.",
            "Xcode is a primitive IDE, designed for low RAM Macs. IntelliJ IDEA is a very smart IDE, designed for reasonably specced machines.",
            "If you want a Mac, your only option is soldered RAM, with an ungodly markup on upgrades. Some PC laptops (especially sleeker ones) have soldered RAM thanks to Apple setting the trend.",
            "True, I forgot about the big time difference between those two",
            "Yeah, if you want a Mac you can either bitch about it and waste your energy, or just buy the specifications you need for the next coming years. Or you can stick to older computers with SO-DIMM.\n\nEven if Apple moved to soldered memory first, there's no reason for Lenovo, Dell, HP, and Alienware to do it, just because Apple does it. It's not only about trend or money. It's about bandwidth, performance, production, product / motherboard layout/design and so on."
        ]
    },
    "What is happening with my Mac M1?": {
        "title": "What is happening with my Mac M1?",
        "score": 19,
        "url": "https://i.redd.it/2kgzpef9l38d1.jpeg",
        "content": "I don’t know what happened but suddenly one day when I opened my macbook I started seeing this rectangular block on my screen from top to bottom and time to time other parts of the screen also flickering while this block stayed constant. I have not dropped the mac or spilled something on it. Any ideas what the issue is? Do I need to replace my display☹️?",
        "num_comments": 11,
        "comments": [
            "Try moving the lid back and forth and see if that changes the pattern - it looks like the display or connection is faulty. Let it get checked by a Genius",
            "Winter is coming.",
            "It's an LCD issue, nothing wrong with anything else. Changing the panel is ~$350 in 3rd party service shop, or ~$800 at Apple authorized shops in my country (Czechia)\n\nAlso this can be a warranty issue as there is no visible crack",
            "I had a similar issue (in the same spot funnily enough) on my MacBook Air M1. The screen turned purple and green intermittently. Screen was deemed faulty and replaced (under AppleCare). \n\nGet some diagnostics undertaken and next steps from https://getsupport.apple.com",
            "I don't know but it looks cool though. I might make a wallpaper like this.  \n  \nMaybe the flex cable, but it usually it doesn't make horizontal columns like this. What model is it?",
            "Have you tried buying a m3 max pro with 96 gb of ram ? That should help out.",
            "Moving the lid does not do anything to the block, it remains the same. I should probably get it checked. Thanks",
            "Mine is dead stripe in almost same spot",
            "It’s Macbook Pro, 13inch, M1, 2020",
            "Flexgate isn't common on M1s, so it's probably a GPU or display controller issue. If you still have warranty, take it to an Apple Store.",
            "It’s almost certainly the display"
        ]
    },
    "The good ol days": {
        "title": "The good ol days",
        "score": 42,
        "url": "https://i.redd.it/yvqjyga8y08d1.jpeg",
        "content": "When all you need was less than a gig of ram, and less than 1GHz from your processor.",
        "num_comments": 6,
        "comments": [
            "This guy likes Safari",
            "Also, a spinning disk and a 800x600 CRT.",
            "We still have some G3s on the shelf, I used to play music on them, their speakers were really good in their time.",
            "Not just system requirements.  The UI and desktop environment were just about perfected, in those days before Apple tried to make everything work like a phone.  And yes, I'm irritated by the \"flat\" look of everything now too, which doesn't provide enough visual cues.\n\nIf you want to design user interfaces, and really study how to make an elegant, efficient and user-friendly one, then digging up an *early* version of TextEdit or OmniGraffle as examples to study would be worth the effort.",
            "How you figure that",
            "I have a hunch"
        ]
    }
}