{
    "M1 Mac Up-to-date Game Compatibility List": {
        "title": "M1 Mac Up-to-date Game Compatibility List",
        "score": 1267,
        "url": "https://www.reddit.com/r/macgaming/comments/t44vqc/m1_mac_uptodate_game_compatibility_list/",
        "content": "TLDR: [THE LIST!](https://www.applegamingwiki.com/wiki/M1_compatible_games_master_list)\n\nThis is the latest, open and most up-to-date list of games that are compatible with the M1 Mac, whether it uses the original M1 chip or the M1 Pro or M1 Max. Compatibility is broken down to Native ARM, Rosetta 2, iOS, CrossOver or Parallels.\n\nThe wiki is free to add information to, you can edit any page without an account. If you have any questions please read the [Editing guide](https://www.applegamingwiki.com/wiki/AppleGamingWiki:Editing_guide) or come to the [Discord](https://discord.com/invite/28CAAr6SpB).",
        "num_comments": 411,
        "comments": [
            "There is a Mac version of Hades in Steam, which for me runs flawlessly. I'm assuming Steam counts as \"Native\"?",
            "Boot camp was a simple utility to permit easy booting of Windows x86/64 on Intel Macs. \nApple has since moved from Intel Macs to Apple Silicon.  Apple Silicon can’t (natively) run Windows 10 for Intel. \nApple Silicon can (natively) run Windows 10 for ARM (via Parallels and a download of Windows 10 ARM Edition), and then within Windows 10 ARM Edition, Microsoft includes an X64 emulator (and now a x86 32 bit emulator too, I think) to emulate and run Windows 10 x86/64 apps (ie standard Windows apps).  But just be aware you’re running MacOS, running the Parallels app, running Windows for ARM, and then using a Microsoft emulator to emulate X86/x64 on ARM.  That’s a LOT of work.  While I’ve done this, and it does work (on an 8GB M1 Air), I see it more as a crutch, rather than as something to use for full-time use. \n\nMaybe with the Apple Studio and many-cores, and those apps in Windows 10 (x64/x86) that are multi-threaded, maybe the experience will improve.  But ‘even’ with Apple Studio, the per-core speed hasn’t improved - one just gets more of them.",
            "Great list! I've also built a simple site to find compatible Mac games along with their metacritic score and completion time:\n\n[macgameslist.com](https://macgameslist.com)\n\nYou can filter by genres and by Apple Silicon native games. The data used is mostly from applegamingwiki and applesilicongames, as well as personal testing (mostly to verify).\n\nI'm also trying to see if we can petition devs to port highly demanded games to Mac (see the most wanted games page).",
            "It would be good to add API to that list (OpenGL / Metal) so we can see which games we won't be able to play in 2024.",
            "Wasteland 3 does not run well on M1 Pro/Max. There is an issue that the devs are aware, but say can only be fixed once apple and Unity work on the issue.   \n\n\nI updated the list =(",
            "Im considering to coming back to wow. The game seems to run flawless and smooth on M1x chips",
            "Sorry, not sure how to go about editing the list but I’d like to inform that 7 Days to Die (7D2D) had a recent developer update through Steam and is now fully playable native on M1 MBP Pro Max. \n\nI’ve maxed out the graphic settings and logged at least 5 hours with no issues so far.",
            "This is too funny. MacOS on ARM now supports 10000x more windows games than Windows11 on ARM",
            "I noticed these were not confirmed in the Native column, I have played all of them on an M1 MacBook Air natively without issue:\n\n- Mount and Blade Warband (I've even modded this one with great success)\n\n- Total War Napoleon\n\n- Total War Empire\n\nAlso I was able to successfully run Star Wars Jedi Knight: Jedi Academy \"natively\" using [Mac Source Ports](https://macsourceports.com/game/swjkja). Big shoutout to the person on the list who suggested this option and confirmed it works for Jedi Outcast for the inspiration.",
            "The Game Porting Kit has blown a hole wide open for new games to run. I hope the community continues to update the wiki with their results. Happy gaming everyone!",
            "any good  rpg for air m1 8gb ?",
            "AAA games I played so far on M1 MacBook Pro\n\nNative\n1) Deus ex mankind divided \n2) Tomb raider \n3) Rise of the tomb raider\n4) EVE online\n\nParallels \n\n1) Max Payne 3\n2) left 4 dead 2\n3) NFS MW criterion \n4) Watch dogs\n5) Titanfall 2\n\n\nhttps://youtube.com/playlist?list=PL7IjNGv8ov0NyzXQzepC4xe3CjV9ncGQ6",
            "This list should either be properly updated or unpinned.",
            "Apparently the [Mac App Store version of Troy: Total War](https://apps.apple.com/gb/app/a-total-war-saga-troy/id1497880701?mt=12) is M1 native as well, [according to the developer of the Mac version](https://twitter.com/feralgames/status/1498587197586477059).",
            "I'm not sure if this is possible but it would be awesome to have the feature added enabling one to to sort games by date added and/or modified. This would enable users who frequent the list to easily see new additions and potential compatibility updates.",
            "!Linus Tech Tips! - MADE A VIDEO ABOUT OUR GOOGLE SHEET \"macOS Game Compatibility List\"  \nSo far: 1,103,586 views Jun 12, 2023 on YOUTUBE   \n\\- \\[VIDEO\\] Linus Tech Tips: https://youtu.be/F6Gi2LcXhxM?t=622  \n\\- Original Reddit post -  https://www.reddit.com/r/macgaming/comments/1446hj6/all\\_working\\_games\\_list\\_game\\_porting\\_toolkit/  \n\\- The Google Sheet itself \"macOS Game Compatibility List\" that holds all the games that works and how well - https://docs.google.com/spreadsheets/d/1t\\_E04Qt411f9mEZJVku\\_OJsEe6XCqZZsdqtjVaMCcgk/edit#gid=0",
            "There is a Sims 2 Super Collection that's intel native on the mac store. Seems to work. I'll let my daughters fully test that.\n\nIt's not the sims 2 ultimate collection on the list.\n\nEdit: My daughter gave it two hours and got perfect play on a 2020 M1 air.  Wasn't a big battery drain.\n\nApparently it doesn't run with M1 pro/max/ultras. Update this summer?",
            "crossover is amazing software. so worth it.",
            "Do the games working on M1 work on M2 as well?",
            "when using [Whisky](https://github.com/IsaacMarovitz/Whisky/) which column should I check ?",
            "[This site (macresearch)](https://macresearch.org/play-warzone-on-mac-tutorial/) claims Warzone works with M1? \n\nDoes it work?",
            "I am getting the following error since long time ago, if I click to the \"more\" link on the list page:\n\"Permission error\nYou do not have permission to run arbitrary Cargo queries, for the following reason:\n\nThe action you have requested is limited to users in one of the groups: Users, Administrators, Trusted, Editors.\"\n\nI can play the following games on Steam, which are not listed:\n\nKatana Zero\nKung Fury Street Rage\nFigment\nThe Hex",
            "Unfortunately, I can't see the whole list because I don't have permission.\n\nMy question is: Can we play all Steam games for Windows, on Mac, using Crossover?",
            "Should the wiki be renamed to reference Apple Silicon instead of M1?",
            "Really wish Legends of Runeterra could be sideloaded. It isn’t currently available to use the workaround anymore",
            "has anyone tried playing Duck Game",
            "There’s a new F1 Manager game coming out in the summer on Steam.\nThey have the official licenses.\nOne to keep an eye on in regards to a Mac version.",
            "Why does the list say Rocket League",
            "Counter Strike Global Offensive does not work well on Rosetta 2. A lot of screen tearing and dropped frames. (It was working 4 months ago though.)",
            "Worms W.M.D working native",
            "How does one go about updating this list? I added something to the Crossover site and I kinda figured on an API or something that grabs it.\n\nIn any event, if anyone else wants to play Katamari Damacy REROLL, it plays beautifully via Crossover.",
            "Does emulator works well? Specifically Gamecube, PS1, PS2, PSP, DS, and GBA?",
            "would it be possible to have section that provides a list of gaming peripherals that work? controllers? flightsticks hotas etc?",
            "This website is perfect, too bad there’s not a way to see by date to check last entries !",
            "Can anyone please do Forza??",
            "I need Battlebit….I neeeeed it.",
            "There is now a website for a complete list with more informations (only Apple GPTK) here : https://macgametoolkit.com/",
            "Op have you tried The Last Spell?",
            "Would it be possible to play Elden Ring on a mac mini or studio? And does anyone know when bootcamp is available for the m1?",
            "I would recommend not buying Dragon Age. The 32bits are messing with crossover and the Mac, so it’s NOT perfect🙄",
            "So sorry if this question seems dumb but im super new to the apple world. I was considering getting a mac air and was wondering if minecraft will run without having to do anything special other than click the app store and click play. I usually play it on my phone so my second question is, is there any major differences other than ill need a controller? Does an xbox controller work? And on the off chance that someone reads this my side question is does Minecraft take advantage of a maxed out macbook pro? Like the ultra with all the ram.",
            "When launched within the epic games client, you get the Rosetta intel executable\nIf you launch it directly by going into your epic games folder you get the native m1 client. \nGeneral performance feels the same with the exception of load time. Native loads scenes and areas much quicker. Almost instantly.",
            "How to add to the list? I got V Rising „running“ on parallels but don’t know how to add it",
            "How do you comment and update this list? I want to add that Crossover for ARK: Survival Evolved works wonderfully as stated, however, certain parts of the maps in Arctic Regions will make the screen go black and unplayable.\n\nEdit: Tried the fixes available everywhere including editing the Engine.ini, and still does not work. Parts of certain rockfaces have wonky shadows. At a certain proximity to arctic regions screen turns black. Macbook M1 Pro 16\" 16GB, 1TB. Tested on two of the same laptops.\n\nEdit 2: I panicked on my Pteranodon and unmounted mid-air while the screen is black. I died.",
            "Please add Deep Sky Derelicts from Steam, though an intel build, it runs perfectly in Rosetta emulation without any heat issues on Macbook Air M1.",
            "Now I tried 200 settings (low or super low) for CS:GO but cant find any playable solution. ”Perfect” the wiki says. M1 Max 32GB and very frustrated. Seen various yt-videos saying do this or do that but still: while the game can be made LOOK nice and super fps (well above 100 steady) you have no chance because key lag and other players moving step-wise. Tried very low latency servers but it makes no difference.",
            "Someone should add Myth II: Soulblighter to the wiki. It runs natively on Apple Silicon thanks to the latest fan-made patch (v1.8.4), available at [http://projectmagma.net/downloads/](http://projectmagma.net/downloads/)\n\n(v1.8.4 is actually a double-universal Mac binary - it runs on PowerPC, Intel and Apple Silicon Macs.)",
            "# Petition: \n\nCan we please include a section / category of playable PS3 games?\n\nI mention this because:\n\n * PS3 has some really cool games, and some have great graphics (especially if we manage to upscale the res)\n\n * I can't find such a list anywhere (not even on RPCS3 site or forums)\n\n * The playable list for RPCS3 does not directly translate to playable for Mac M1, for example. \n\nThis could potentially apply also to other systems which are hard to emulate at a decent quality.. because basically no one is having performance issues with PS1 emulation, for example.",
            "I am working on a more user friendly database of the [https://www.applegamingwiki.com/wiki/M1\\_compatible\\_games\\_master\\_list](https://www.applegamingwiki.com/wiki/M1_compatible_games_master_list) wiki page. As well as Google Sheets integration. \n\n&#x200B;\n\nhttps://damiansplaygrounds.com/apple-games",
            "Steam started acting up after updating to Ventura.  Now I’m getting a message to have a 2K account to play Civ6.  \nAnyone use Epic ?  \nEpic has a Civ6 Anthology this weekend for $29.99.",
            "I am anxious to see a readout on some city-builder games like the following.  I want to see some more modern high-quality city-builders come to Mac.  For as much as games like Cities Skylines keep rolling out DLCs you cant help but feel like you are missing out because of the poor resolution compared to more modern city-building games.   I have been playing Survival Settlement which is a pretty decent game but again when you look at the catalog of games out there in this genre the Mac is lacking developer interest/love. \n\n&#x200B;\n\n* **Farthest Frontier** \\- [https://store.steampowered.com/app/1044720/Farthest\\_Frontier/](https://store.steampowered.com/app/1044720/Farthest_Frontier/) \n* **Manor Lords (Not yet released)** \\- [https://store.steampowered.com/app/1363080/Manor\\_Lords/](https://store.steampowered.com/app/1363080/Manor_Lords/) \n* **Ancient Cities** \\- [https://store.steampowered.com/app/667610/Ancient\\_Cities/](https://store.steampowered.com/app/667610/Ancient_Cities/) \n* **Ostriv** \\- [https://store.steampowered.com/app/773790/Ostriv/](https://store.steampowered.com/app/773790/Ostriv/) \n* **Kingdoms Reborn** \\- [https://store.steampowered.com/app/1307890/Kingdoms\\_Reborn/](https://store.steampowered.com/app/1307890/Kingdoms_Reborn/) \n* **Citystate II** \\- [https://store.steampowered.com/app/1352850/Citystate\\_II/](https://store.steampowered.com/app/1352850/Citystate_II/) \n* **Foundation** \\- [https://store.steampowered.com/app/690830/Foundation/](https://store.steampowered.com/app/690830/Foundation/)  \n* **Land of the Vikings** \\- [https://store.steampowered.com/app/1981570/Land\\_of\\_the\\_Vikings/](https://store.steampowered.com/app/1981570/Land_of_the_Vikings/)",
            "I'm finding the Steam version of Limbo to be dead on installation on Ventura. If I try to run it I get the popup saying it's damaged and should be deleted. No amount of reinstalling or other faffing about can make it work.  \n\n\nThis is contrary to the list saying it runs perfect (though perhaps that is accurate for the App Store version). I would edit it myself but it seems we can no longer do so without an account.",
            "So glad to see this post updated frequently!\n\nI didn’t know Call of Duty Mobile was playable on silicon Macs! Did some reading into it, and found out that users are getting banned for playing CoDM on M1/M2 MacBooks. \n\nAlso great to see a native version of UT99!! One of my favorite arena shooters!",
            "[https://macresearch.org/play-call-of-duty-warzone-2-0-mac/](https://macresearch.org/play-call-of-duty-warzone-2-0-mac/)\n\nDoes it work now?",
            "Imagine being able to play The Last of Us from a macbook, games like that on such a sleek device. I'll keep dreaming.",
            "What about a maxxed-out M2 Air?",
            "What about M2?",
            "This list lacks Cliff Empire\n\nhttps://apps.apple.com/fr/app/cliff-empire/id6446506153?mt=12",
            "This does not seem to work properly anymore. I can't see past the letter S, with lots of errors on the page.",
            "Really curious to know how the M2 Air thermal throttles when gaming using this tool. Wondering its its going to be a bit of a showstopper. Appreciate it was never billed as a gaming machine though.",
            "How about Resident Evil 7 ?",
            "Q? What are the chances that an iPad with m1/m2 can play these games in the future. Just curious.",
            "Does anyone know after you get everything working per: [https://www.applegamingwiki.com/wiki/Game\\_Porting\\_Toolkit](https://www.applegamingwiki.com/wiki/Game_Porting_Toolkit) and can play the game, how do you update these tools when newer versions do come out ?",
            "shouldn't \"up to date\" also include games that work with the game porting toolkit?",
            "When will they add the GPTK category?",
            "Tekken 7 is working great https://youtu.be/WALgEROrvNU",
            "Finally got TEKKEN 7 installed with GPT on my MBP, the experience is much better than running the game on Paraelle Desktop, a solid 60fps with all settings to high at 1080P resolution, my spec: M1Max, 64G, 1T",
            "Just wanted to stop by and say I’ using a early 2015 macbook pro model for league and it’s aight if Iower the quality lol. Interesting to see options for once it gives out and I need to upgrade.",
            "Would it be helpful for others to have a way to sort out games by release date?\n\nI would like to know what recent games are compatible.",
            "I’ve played ELDER SCROLLS ONLINE since 2014 beta on my 2013 Intel iMac 27” until a few mos ago.  Now I run it flawlesssly on my M1 MC Mini!  😬",
            "It would be nice to add a separate section for the Game Porting Toolkit",
            "Does anyone know if I can play Microsoft Flight Simulator on a M1 max with 64gb of RAM?",
            "Honestly, every game I have that I want to play, is only being stopped by Easy Anti Cheat not allowing ARM 64 processors despite running in parallels with no real reason to not run. \n\nI've gotten all of the games to start and begin to load already which from my experience means there's about an 80% chance they work. \n\nBut Easy Anti Cheat refuses to accept that it's going to work and kills it. \n\nIf we can get them to screw off, Macs can play A list games again. Only hold up.",
            "The MOMENT when you have to read „mac game compability List“ again!!!!",
            "Hey late to the game but is anyone else having trouble accessing the list? Like it cuts off around \"P\" and if you click on More it says permission error. Am i missing something?",
            "Latest addon of Diablo IV make it unplayable because it can't detect GPU anyone solved this issue before the last update I used to play normally MBA M1 any help will be much appreciated",
            "WHY are the LINKS to the LIST not UNDERLINED???????? Why break fundamental internet standards????!!!??!? WT absolute F",
            "Would it be possible to test 12tails-th thanks you",
            "Fatal Frame: Maiden of Black Water\n\nand\n\nFatal Frame: Mask of the Lunar Eclipse\n\nboth work fine via Parallels on base M1. You'll need to install visual c and direct x redistributives for x64 Windows (not ARM version) from Microsoft site first though. Dpn't work via CrossOver (some critical error).",
            "Mac m1 pro - cs 1.6 - 25-50 fps, Tomb raider anniversary 15-25 fps.. resolution 1512, wat u talking about mac gaming xD",
            "Hello, does anyone have some optimised settings for Cyberpunk on M1 macbook air? I am using whisky btw, should I let the settings as they are in the app?",
            "With Battlenet 1.3.4x update (March 12), no games currently work - a 'GPU missing' error pops up and prevents any game starting.",
            "Has anyone gotten oculus pc to work with whisky? I want to try to airlink to my quest through whisky but when i try to run the oculus install in whisky it spins doesn't throw an error but i don't see the oculus app installed. Would love to try it.",
            "i have an  Apple M2 mac it is brought recently and i wanted to play free fire but thr new apple silicon processor dosent support bluestacks\n\n\n\ncan some body help",
            "thannks!",
            "I've just installed tons of old games into my Parallels VM and all of them runs fantastic :) Thief1/2, VtMB, Heroes 5, Arx Fatalis, Arcanum, Deus Ex 1, Oblivion, Gothic, Sin, SWAT 4, System Shock 2, Underrail, XIII (Original), Splinter Cell 1... and few more. 100Gb of pure old school joy.. damn I'm old.  \n  \nTime to complete all of them.",
            "You have Nier:Automata twice.  \nI would also include Valorant (doesn't work) since it's a very popular game.",
            "Go install Whisky-App: [https://github.com/Whisky-App/Whisky](https://github.com/Whisky-App/Whisky)",
            "I got the Black Desert Online working on parallels. Did anyone else try too, maybe Crossover?",
            "Sorry to ask, has anyone got Rocksmith 2014 Remastered working? I know you can get it for the Mac but it never runs well, it stutters when there is alot going on you can't add mods. So I wanted to install the Windows version as I did have it on Bootcamp on my old 2013 iMac and it ran perfectly.",
            "The list states that Star Wars Jedi Knight II: Outcast is perfect on native, has anyone been able to get to run perfectly?",
            "i have my own game",
            "Where is Valorant?",
            "Has anyone ever tried half life Alyx? Is it possible it could run on a M1 Pro with crossover or parelels?",
            "Timberborn is native apple silicon now. Great game.",
            "I was going to edit the list to say that the Bopl Battle demo runs ok with some graphical issues on mac os M1 8gb, but I didn't see a section for gameporting toolkit. Would that fall under Wine?",
            "I was able to get GTA SA (Steam) version and San Andreas Multiplayer (SAMP) working. Some mods like SAMP Addon 2.6 do break the installation completely. However, mods like SilentPatch, Silent ASILoader, and GTA SA Widescreen fix work perfectly. \n\nCaveats: It requires the use of a No-CD crack/executable (v1.0) to run. I have a guide I wrote up on how to get this to work in Crossover and some other solutions that I’ve tried to replicate this on with some notes. I just don’t have anywhere to publish them at the moment.",
            "Bloodstained: Ritual of the Night runs perfectly under GPTK v2. (Running on M1 mac mini, 1920x1080, running windows steam)\n\nTHE LIST does not have a column for GPTK, which is a giant omission at this point.",
            "So I just bought a Mac M1 Max for over $3000 and so far it can't run a single freaking game!  I've tried installing and launching over a dozen popular games now and not a single one runs on Mac M1.  I looked it up and all games everywhere have stopped running on Mac as of August 2022.  This means that anyone who likes to have fun on their computer should NOT buy Mac.",
            "It would be nice if the search showed something such as this game is not yet added instead of just coming up blank, when searching for a game not on the list.",
            "Bookmarked, this is a fantastic list that looks like it's pulled from AppleSiliconGames as well. Not sure if that site is updated any more. I created an account so I can help contribute, thanks!",
            "Great list, thanks!!  Would love to give Ark a try on the M1 air 16gb.",
            "I swear there was already a post linking to the same link pinned to this subreddit (That wasn't this one). Am I stupid?",
            "Prodeus is M1 native also from Steam. But have to be run directly from applications folder.",
            "I guess they updated Doom 3 in the Mac App Store?\n\nI previously purchased it and ran it on my old computer, but when I tried to install it on my M1 a few months back, it told me it wasn’t compatible.",
            "Hey guys I can play the friday 13 on Mac Pro M1?",
            "is there update for bluestack/bignox on m1 chip?",
            "[deleted]",
            "The list has Dying Light working perfectly, but I can’t go 10 minutes without it crashing…",
            "Is crossover or parallels better?",
            "Cannot create a page without an account? This is seemingly required to add a game to the list.\n\nWould like to add that Slipways works under Rosetta 2 perfectly (or at least I’ve not had any issues with it so far)\n\nIs someone able to add it?",
            "Is The Long Dark playable on Apple Silicon?",
            "Any recommendations for a lazy controller based game? Something like FF Tactics? I rather something that runs native.",
            "Does the game you wanna play through Crossover NEED to be on steam or Epic or whatever? I have a setup of a free game in my files but it's just that and doesn't come with any provider like Steam.",
            "Anyone test Minecraft Dungeons on Parallels? I don’t see it on the master list.\n\nThanks!",
            "Is Oddworld: New 'n' Tasty playable on M1?",
            "Can I play rocket league on my mac without onstalling windows on it",
            "I would like to say I checked steam on my pc today and saw that my time at Portia has a native m1 port of the game",
            "anyone know about Huntdown? Couldn't find it on the list.",
            "I actually haven't been able to get final fantasy 9 working at all in crossover 21.2, with or without DXVK and when trying DXVK using updated and not..just exits on launch\n\n&#x200B;\n\nIt's interesting because the compat list lists it perfect on crossover.",
            "Is there any currently working way to sideload/play an iOS or padOs app?",
            "Psychonauts 2 is available on the App Store or Steam for Mac and runs in Rosetta 2, so someone might want to update that. \n\nedit \\*\\* I've updated it but it's my very first Mac Gaming Wiki update so I may not have done a great job. Feel free to educate!",
            "how can i use an android emulator like blue stacks on mac m1?",
            "I bought a PS5 controller recently. I wanna play dying light. But the controller can't work in the game.\n\nIn steam big picture mode, the controller works. But in the game, it doesn't. Does anyone know how to solve this problem?",
            "I wanna add controller support. Can I do that?",
            "Does anyone try the forgotten city?",
            "Genshin Impact not available in IOS/IpadOS on Mac App store",
            "[deleted]",
            "Can anyone try testing Chivalry 2?",
            "Please add minecraft bedrock edition (ios iPad)",
            "Does anyone know if the crew 2 can by run on m1 using crossover or parallels?",
            "How do I find what the frame rates for games are on the m1 air?",
            "Can you add F1 2022 to this list please?",
            "im sure somebody has already asked but- what about fall guys?",
            "I'd honestly just be happy if I can emulate later gen consoles like Wii U/Switch/PS4",
            "Has anybody managed to run Gothic 3 ? Crossover says it is supported, but it isn't in this list and I haven't managed to run it. Maybe it's not supported on M1 ?",
            "Embers Adrift has native client now.",
            "Ok so I'm using a MacBook air Monterey ver. 12.1, but when ever I try to load the rpcs3 game immediately after the intro BLACK SCREEN and I have no idea why😤any ideas?",
            "I don’t see NFS MW criterion in the list. It’s playable in parallels. Game play - https://youtu.be/JietgHUMHZg",
            "What a cool service. Thank you. I can add X-Plane 12 (beta?) to the list, as it rocks on my base model M1 mini (natively). But it is the only time that box ever heats up and turns on the fan - when playing the beta. I'm more confused about peripherals and the M1 (and Ventura). I want to order some flight controls but I have no faith any of them will work (as they are all marked PC or console only). Plus, the USB hardware on my mini rots.  It can hardly power a few phones and iPads, keyboard and mouse. dunno, but at least we are getting there as far as gaming goes.",
            "Is foxhole able to run on M1 with any of the various softwares?",
            "I am looking to play Minecraft via TLauncher on my M1 MBA Base Model, just casually sometimes. Installing that it runs under emulation and shows up Java as an intel process in activity monitor, i was wondering how to run it natively as minecraft is supported natively officially, do i just have to download the M1 Compatible Java?",
            "can m1 mac 8 gb run extro exodus?",
            "You know what I am desperate for? An amazing list like this, but for wired and wireless controllers compatible with M1, because I desperate need a new controller to play and I’m dead afraid to buy one because the available information just doesn’t always give me 100% confidence that the controller will work right out of the box.",
            "It says Fortnite runs flawlessly on Rosetta 2. Is that still true after the apple and epic controversy?",
            "« Clanfolk » and « Going medieval » work through Crossover 👍🏻👍🏻",
            "Is it possible to add game, or it's too much work ? Like NW for example ?",
            "Anyone know how to get resident evil 3 remake to work?",
            "does league of legends run well on mac",
            "Anyone managed to get resident evil 3 remake working?",
            "all good to play Valorant?",
            "Hello,\nHas anyone tried to play to Black Geyser: Couriers of Darkness ? \nI'm own a MBP M1 pro 14'\n\nThanks",
            "I haven't played long enough but SIGNALIS runs well on M2 Air 16GB using Crossover",
            "Hi all. Has anyone tried playing War in the East 2 on the M1 Macs? Can't find any info on it, but just got this game Ans want to know whether I need to stay in pc land for my next laptop. Thanks!",
            "Does Steam Remote Play work well on M1 Macs? I usually just stream the games from my home gaming PC to my Windows laptop when on the road. Would like to buy a new M1 Macbook, but definitely want to make sure I can do some gaming via Remote Play on it.\n\nAlso, is there a PS4/PS5 Remote Play app for the M1?",
            "Hasn’t anyone tried XCOM Chimera Squad? I’m an XCOM2 fan and… after having finished it, I’d like trying for that “next chapter”/spinoff, that at now is only PC native…",
            "I bought Black Ops III and it insists i am offline, I cant join online games, access the community, or get what i wanted out of this game. I have already tried uninstalling it, someone help? \\*It says my connection is wired even though it isnt. If i cant work it out please recommend some good Black Ops III type games so I dont feel ripped off.",
            "How can i understand \"native\" games works on steam or app store?",
            "Has anyone tried Gates of War Call to Arms on M1 through parallels or crossover yet? I asked it on the discord but got kicked for having a Russian themed pepe despite not having anything to do with current events..",
            "How do I play Unreal Tournament on an M1/M2 Mac now that the game has been delisted from all storefronts?",
            "Hey guys I'm trying to play Asphalt 8 with my friends who have windows on LAN. Unfortunately the versions don't match. They have the latest version but Apple Store's version is a bit behind. Do you know the workaround?",
            "What is meant by crossover?",
            "Anyone know if there will be a native version of Diablo 4?",
            "Sims 4 is now M1/M2 native",
            "I need a simple answer. What's the best thing I can get for league?",
            "Is anyone using ryujjnx switch emulator and if so have you got Metroid prime to work? Keeps crashing kn me. I’ve played TOTK and various Mario Brothers all totally perfect in ryujinx. I asked in the ryujinx sub also but asking here too. Metroid remastered?",
            "Please add a data column and maybe a downloadable xls file so we can view by date? Just a thought but this is great thank you!!",
            "I'm so glad I was wrong!  \n\n\nI really thought that anything on the App Store would not appear elsewhere!  \nIt's on Steam FIRST!! \n\nNow excuse me, it's time to take a break from Zelda...",
            "Does this also mean m2?",
            "I have a M1 Pro Max with 64GB RAM. If anyone wants me to try something on really beefed out M1, LMK.",
            "Does anyone know if Age of Empires II Definitive Edition works?\n\n&#x200B;\n\nNote: I'm a Crossplay user and AOE stutters for 0.5sec every 5 seconds, which I don't consider playable as it's extremely distracting and can mess up selections when controlling units.",
            "Does the porting kit required Mac OS Sonoma? Cause if not I’ll be glad to help with testing.",
            "Hey, I tested Age of Empire 3 Definitive Edition, it seems to run fine with GPT on M1 Macbook air  proof : https://www.reddit.com/r/macgaming/comments/146eysc/age\\_of\\_empire\\_3\\_definitive\\_edition\\_running\\_well/",
            "idk if anyone still cares but Total War 3 Kingdoms works really well on M1 natively",
            "What about Overwatch 2 ? Can't run it =(  \n\n\nps: its possible to play GTAV with a fullscreen mode? (not a window without borders)",
            "[removed]",
            "When I click 'more' I get an error message, the page stops before it gets to 's', I want to see what street fighter 6 is compatible with before I consider getting the new mac air m2 15\"",
            "Is there anyone can run the 'TEKKEN 7' with GPT and test the performance compared to running the game in Paraelle Desktop? Really appreciate that. it will take me days to download this fat ass game with my shit internet. Thank you.",
            "Hey! List is great and thanks to everyone who updated this list but i have just one recommendation: Put a “popular games” list so we can easily follow which most played games are playable or native on apple silicon.\n\nThanks!",
            "Should I make a list on Intel? Or do you think everyone uses m1 processors?",
            ".",
            "Anyone try to run Rise of Nations ?",
            "I want to play FF7 intergrade so bad but I don’t want to jump through all the hoops right now on my main computer",
            "Farthest Frontier works like a charm.",
            "Is there more a benefit to running the gaming toolkit than playing a game through steam on parallels ?",
            "I picked up one of the new MBAs and cannot get Civ4 to run past the intro video on Crossover. Anyone had any luck?",
            "does anyone know if High on Life from the rick an Morty creators is playable?",
            "RE5 and RE4 both run well on parallels though the latter is inconsistent",
            "Does anyone know whats about Call of Duty WWII?",
            "good nice",
            "at least my hoyoverse account didn't get a ban for now while using native real-time ray tracing mod in my M2 MBA. that's enough for me",
            "I run Aoe4 on my M1 Max Studio",
            "where is Mortal Kombat 11??",
            "Rfactor1 works on paralells",
            "cool",
            "rfactor1 works on parallels.  Automobilista does not  modes dont work on Assetto Corsa",
            "thank you :) I still haven't figured out how to make them work properly. 🥲",
            "Anno 1404 (Venedig) works perfect via Parallels (18 + W11 Arm).",
            "I'm pretty sure Brawlhalla runs well Natively on Steam... Don't know why its written as N/A.",
            "Are PowerPC versions of mac games still available on Steam? It seems to be possible to install older versions of games.",
            "Escape From Tarkov (community single player version aka SPT) is working https://www.reddit.com/r/SPTarkov/comments/177u5z3/finally\\_run\\_on\\_macos\\_sonoma\\_with\\_gptk\\_wine/",
            "Diablo 2 Resurrected is missing",
            "Wargame Red Dragon strategy game runs on M1 via steam",
            "Does gaming on steam through crossover allow for online multiplayer play? Or can you only play single player games?",
            "Victoria 3 now runs native",
            "hi, how to play brawl star on mac apple silicon M1",
            "crossover with asseto corsa doesnt work for me, any ideas?",
            "I have a M2 air 13 , and I tried to play Dota 2, just by normally installing steam.\nBut it lags a lot. And the laptop became super hot.\nDoes anyone have any ideas about this?\nThanks.",
            "Can i play Undertale on newest mac Os version?",
            "cs2 runs perfect on crossover, hilarious 😂 who made this list",
            "What are the best competitive FPS games to get into right now? I wanted to start playing CS or Valorant or some strategic FPS that's not just shooting and dying and actually has some kind of game goal. The only problem is I have a macbook M1, so i'm finding out they dont run on my computer. Any advice?",
            "so i have no idea what all this means. can someone explain all this to me like an idiot i just wanna plat the Batman Arkham series and Insomniacs Spider-Man",
            "Which one of these titles support gamepad vibration?",
            "[https://www.reddit.com/r/macgaming/comments/18z093j/need\\_some\\_help\\_in\\_configuring\\_external\\_hdd/](https://www.reddit.com/r/macgaming/comments/18z093j/need_some_help_in_configuring_external_hdd/)\n\n  \ncan someone please help me here",
            "tested :\nGrim Nights\nDeveloper\nEdym Pixels\nOct 12, 2018\nbut it would not open on GPTK",
            "anyone tried the Last Epoch on an M series ?",
            "Will anybody try Metal Gear solid Master Collection vol 1?",
            "how do i create a post in this sub reddit",
            "whos the moderator on this page?!",
            "Check your activity monitor, if the app says \"Intel\" then it's running through rosetta",
            "Works great for me on Epic Games Launcher (M1 Pro).",
            "Do you play with a controller? Can I pair my Pro controller from Nintendo?",
            "What’s the situation now, 100 days later? I ONLY need windows to play simple games like fall guys which isn’t really a demanding game. I have a 2020 m1 pro 16gb ram. Worth it or not?",
            "honestly buy a steamdeck.",
            "Let’s take this further and run a mac 32-bit emulator on the windows arm edition via parallels on apple silicon. TLDR I want to play Descent again.",
            "FWIW just saw your note here.. I have a macBook Air m2 with 16GB RAM/ 1TB drive, windows on parallels playing older games is surprisingly fun.  fallout vegas plays great.  so you may have better luck with older games.",
            "Amazing site! Thank you for taking the time to put this together!",
            "what a site man thanks for going out of your way",
            "What's happening in 2024? Is that when apple are turning off Rossetta 2 or something?",
            "Hey, was preparing to buy a M1 Macbook Pro, but can only afford the base model. What are the chances it can run WoW relatively smoothly for at least a few more expansions?",
            "I did this because of the performance on the m1 pro",
            "wait, those total wars, are they actually playable? i thought they were 32 bit",
            "Is it only adding support for dx12 games or other older games as well?",
            "Is the max Payne series any good? Worth playing?",
            "what's ur RAM, mine is 8 gigs and Watch\\_dogs is unplayable below (30 fps)",
            "Yes it is native however there is only 1 FPS difference between the Rosetta 2 and native versions, I've tested it!",
            ">according to the developer of the Mac version\n\nWhy the hell doesn't this come to other stores? The AppStore version is super expensive :(",
            "If only I could get Cyberpunk to run on my M1 Air",
            "Yes",
            "The Wine column.",
            "Don;t want to go through the whole process only to find out the anti-cheat makes it unplayable.  Can anyone confirm??",
            "Hi! Have you tried some of this?",
            "Anybody ever figured out how to make warzone work on m1??",
            "Bumping this as it’s coming soon",
            "[removed]",
            "There's [OpenEmu](https://openemu.org) for those.  \nFor PS2 there's [PCSX2](https://pcsx2.net) for it. PS2 plays pretty well for me.",
            "> Does emulator works well? Specifically Gamecube, PS1, PS2, PSP, DS, and GBA?\n\n* Perfectly (Dolphin)\n* Perfectly (OpenEmu, RetroArch, etc)\n* Perfectly (PCSX2 or AetherSX2)\n* Perfectly (OpenEmu)\n* Perfectly (OpenEmu or RetroArch)\n* Perfectly (OpenEmu)\n\nApple M1 runs 3DS emulation fine too, in Citra.  I played through all of Zelda: A Link Between Worlds a month ago.",
            "Likely never from what I’ve read in the articles I found",
            "Only when there's directx 12 support in Crossover, as well as easy anti-cheat. Supposedly they're working on it, but it won't be released until next year I've heard. As for bootcamp, it won't come currently. There's apparently some exclusivity deal with Qualcomm for Windows on ARM that's set to expire, but it's up to Microsoft really.",
            "People have logged that it's \"Perfect\" via WINE (wtf?) https://www.applegamingwiki.com/wiki/Elden_Ring\n\nI say wtf because it's not playable via either Parallels or Crossover, yet WINE works?  What?",
            "Minecraft does work. You can download it off the Mojang website and play. However, if you want it to take advantage of all cores - you'll have to download ManyMC Native Arm version and use Sodium+Iris mods to get maximum performance.",
            "Which game is that?",
            "You can go to the discord and submit a report. seems to be how they are doing it.",
            "Becasue its the same like on Intel, and the same like on Ubuntu. A long time ago, in migration to 64 bit Valve broke that game. It has this king of lags on Intel MacPro, on M1 Ultra.",
            "a little bit late but i run it flawless on my m1 pro i capped the fps to 90 and now it works perfect",
            "Me too hah! How's yours going? Perhaps we can work together.",
            "did you ever get any of these games working by any chance?",
            "yes! I just bought Limbo and ran into the same issue as yours. Have you found any solution to it yet?",
            "I play Limbo through parallels via steam and it works well. Also the sequel to it called Inside is M1 native and I JUST finished it last week and is absolutely amazing!! I’m currently playing Somerville (their latest after Limbo and Inside) via parallels and it’s playable with a few hiccups and you must have a controller regardless of what they say because you’ll get stuck in some areas without one.",
            "That link says you can play via Parallels.",
            "Parallels…I’m doing it now. It plays but a TINY hiccup here and there but doable",
            "M2 is after M1 so it applies her and even more so.",
            "What's this deal with this anticheat software. How does it work, and why doesn't it work on wine? I suppose it works on Fusion or Parallels?",
            "[deleted]",
            "You’re doing something wrong. I have an M1Pro 14” 2021 10-core 16GPU, 16GB 1TB model and am playing tons of games. Metro series is prob one of the best and there’s 2 solid versions now, Bioshock 1 and 2 are amazing and m1 native now and play perfectly. And I have ryujinx Nintendo switch emulator and about 15 games like Super Mario 3D, Odyssey, Legend of Zelda latest and they all play perfect as well not to mention the hundred of Mame and Nintendo rims. I play in OpenEmu. But there’s a bazillion M1 native games now and I don’t mean cheap App Store games. What is t working for you? There’s no way in hell you’re doing it right because these M1 native games are perfect! And never buy a Mac for gaming. They do game yes but not like a PC.",
            "Solution: buy 1200.00 gaming PC and 1800.00 M2 studio",
            "From Prodeus in Steam library, right-click -> browse local files -> Prodeus",
            "CS:GO is available for Mac straight off steam. Works great on my 2020 M1 MacBook Pro, 8gb ram. Also ran “ok” on my last Mac, a late 2014 Air w/max ram.",
            "my m1 2020 macbook pro runs it smooth",
            "Depends for which game unfortunately. But if your game works on both I’d recommend crossover before parallels.",
            "Crossover is more compatible but slower since it’s a cpu emulator.  Parallels is easier but is just a vm so only ARM stuff will run on it",
            "Yes",
            "yes it is  (at least the steam version is)",
            "No, it just needs to be a Windows program to try.",
            "Some iPad apps run natively on M1 Macs",
            "Playcover",
            "worth playing?",
            "No, according to r/thecrew2",
            "See if there is in game counter",
            "Get a controller. I didn’t have one and I have about 10 games now that are a must have for co troller play. I have the Xbox one style BT one and it’s awesome.",
            "You can install some old version without battle royal working",
            "What’s NW?",
            "I play daily on my 14 inch M1 Pro. Runs perfect",
            "“Village” is native and plays great (Not RE3 I know but just an FYI).",
            "I found a message on GOG forum anwsering my question:\n\n\"I've been playing this game on an M1 MacBook Pro and have reached Ch 4 with (so far) no performance issues. I'm using the \"High\" graphics settings but haven't bothered checking out \"Ultra\" since everything looks good and runs fine on default settings.\"\nhttps://www.gog.com/forum/black_geyser_couriers_of_darkness/apple_m1_native",
            "https://www.codeweavers.com/crossover",
            "I hope so but I bet it’ll be a bit as it JUST came out I believe.",
            "Try this, i wasn't able to run it but found out that VMWare has released a tech preview with Full 3D Hardware Acceleration and it works well: https://www.reddit.com/r/macgaming/comments/1516pt9/finally\\_vmware\\_fusion\\_has\\_full\\_3d\\_hardware/",
            "It does",
            "No enabling or linking to piracy.",
            "I'm waiting so long for Anoo 1800 :(",
            "It works with CrossOver, runs pretty well, 60 FPS on low settings",
            "Hades shows as Intel on my M1. It’s not a terribly demanding game though. If it uses Metal, performance is already great.",
            "I'll check it out.",
            "Not sure about the Nintendo Pro controller, I use a DualSense.",
            "did u fix it? I have the same Problem too with Pro controller.",
            "What I would do:  Stream it via Steam.  Install Steam on both.  Put both on the same network using ethernet everywhere that you possibly can.  Buy and install it on the PC.  Keep Steam running (and disable sleep) on the PC.  Set the screen resolution to something reasonable.  Open the Mac.  Play the game on the Mac.",
            "You can’t play fall guys due to the anti-cheat. At least I saw it on another post.",
            "I’ll put it to you this way.  I have a 2023 16 inch M2 pro Mac book pro. I run all of that plus browsers with lots of tabs (16 GB RAM) and I run windows 11 ARM in parallels , and Ubuntu, at the same time, assigning each of them a case of RAM and six cores. I installed outriders and set it to around 4K, set everything to ultra except shadows. I put that to medium (I don’t really care about epic shadows.), And it’s basically enjoyably playable. Once I enter an area and the textures load after a few seconds, I get more than 30 FPS. and that’s just stressing it by running in a guest os. I bet it would run way better using crossover, which doesn’t require the whole windows system to be running.\n\nYou should be fine with what you want to play. Just when you are looking at purchasing or downloading a game, look for DirectX 11 and lower. at least for this next month. We are about to get DirectX 12 support which is going to open the door to a whole world of games in the next release of parallels and crossover.",
            "Just use Linux at that point lmao",
            "Thanks! Always open to feedback and ideas :)",
            "My pleasure!",
            "Why would they drop a foundamental and to be honest wonderful piece of software that just works? Some old apps/libraries will never be updated, it will be suicidal",
            "Dropping OpenGL support?",
            "Check out benchmarks of WoW running on whatever model you're looking at. That'll give you the best idea of what to expect. WoW has a native mac version and isn't an intense game anymore, so I bet it'd run fine.",
            "Tested wow and runs smooth on higher graphics config on a major city, but storage usage is a blasphemy. almost 100 gb.",
            "Look here https://www.applegamingwiki.com/wiki/World_of_Warcraft",
            "Yes, I can confirm both of those run flawlessly on my Mac. You can pick em both up for a few bucks too.",
            "Yes it is. If you had played the first and second part you will enjoy this",
            "Mine is 16 gigs. 8 gig allocated to windows parallel",
            "What's your M1 version and what were the benchmark results? Cuz I saw this guy getting 65 to 70 fps on average on an M1 Pro with 14 GPU cores on the native ARM version of the game whereas I was getting around 5 FPS less while running rosetta and I have the 16c version which means there's a actually a huge delta between rosetta and native but I'm not willing to shell out 50 bucks on the App Store just to test this personally.",
            "That makes me sad.",
            "In protest to the unreasonable API usage changes, I have decided to remove all my content. Long live Apollo",
            "would also like to know.",
            "[https://macresearch.org/play-call-of-duty-warzone-2-0-mac/](https://macresearch.org/play-call-of-duty-warzone-2-0-mac/)\n\nThis looks valid?! Can anyone try?",
            "Mac version is coming soon?",
            "Yeah. I found out it was shadows in CS:GO dropping frames whenever I moved. Setting them to “low” did the trick of mitigating the freezes, but still… native M1 is native M1.",
            "piggybacking on this comment just to add that 1.19+ minecraft versions run natively!",
            "Awesome thanks",
            "Would have been great if I actually wrote it down. Disco elysium.",
            "Good. Later than my post above I ran across a forum about routers (me running Time Capsule) and changed the channel for wifi and suddenly all lag was gone. Runs like a charm now.\n\nEDIT: dont know why but best guess is that auto-channel setting is a bit congested where I live (downtown city).",
            "Oh their new game is out already? Somehow I missed that. Heard they were working on something a while ago but had no idea it was out. I'll have to look into that!",
            "Can someone try? 🥹",
            "I wonder what the quality is like on my new m2 max wjth 32gb ram and 38 core gpu!? Would it look better than the ps5?",
            "Easy Anti Cheat in theory works on anything. Most developers have not set it to work on ARM processors, so instead of allowing crossovers, parallels, or whatever to work, most AAA just won't work because of the fact that it detects they're using an ARM processor; not because the game won't work.",
            "Operator error bigtime! I play about 10M1 native silicon games perfectly (Bioshock 1 & 1 remastered) all three Metros, a ton of switch rims etc (not native but okay perfectly) this person is t doing something right. Prob trying to play from a mounted dmg or something. Or an external slow drive….no idea. Lol",
            "What mouse do you use?",
            "Crossover is not a emulator it’s a translation layer. Parallels is a virtual machine that uses virtualization.",
            "Hey! What’s that? I’m not familiar.",
            "[deleted]",
            "New World",
            "it use metal api but the structure is intel ( you can use metal HUD to check if any games is made in metal)",
            "fuck me in the ass, it hurts so much",
            "both what?",
            "I plan to do that with a rog ally",
            "We were about to lol. Still the anti-cheat is what is stopping most games.",
            "Linux on mac doesn’t have decent drivers yet so that’s not an option. Once it’s there and there is a solution for 64bit steam on arm, gaming will take off on m1 macs and we’ll be able to play dx12 games until then steamdeck is the best option.",
            "I think the only thing I can think of is that I tried to sort by Metacritic rating and wasn't able to figure out how. Is that currently possible?",
            "It's apple, they do things their way 🤷‍♂️",
            "> Why would they drop a foundamental and to be honest wonderful piece of software that just works? Some old apps/libraries will never be updated, it will be suicidal\n\nI honestly can't tell if this was a joke.",
            "[deleted]",
            "They said that when they dropped Rosetta 1. We’re going to be fine.",
            "Their metal engine is more optimized for their silicone chips.",
            "I already had them on steam but never bothered installing them. Apparently they were re-published on Mac around 2015 but they skipped Rome II and it’s the only one that doesn’t work? Any chance you can enlighten me?",
            "Natively, meaning you checked the activity monitor and it says apple in the \"kind\" column?",
            "Never played any of them, should I play the first two, or are they dated?",
            "ok that makes sense, more ram = better performance",
            "It's not too bad it just means that the M1 GPU is being used to its full potential :)",
            "Be happy knowing that Rosetta is so efficient!",
            "I will first chance I get and let you know",
            "I downloaded FM22 from EGL a few months ago when it was on the store for free. Been playing it since then with 0 issues. Running on 2021 MBP w/ M1 and runs flawlessly. Granted it’s not a very demanding game but still.",
            "I just bought it on steam, I'm not familiar with how any of this works but can I run it natively having bought it on steam?",
            "Yep. Somerville. And Inside is awese tok which Id never heard of either until I searched to see if there was a sequel to Limbo. :-)",
            "doubt it...t's emulated still so no way it'd look better....",
            "Microsoft Ergonomic Bluetooth Mouse",
            "and typically Crossover is faster, as it does not need to emulate a whole operating system. But it depends on the game. Sadly Parallels is not cheap, Crossover kinda ok, even better would be Proton for Mac.\n\nIf it was on-time-buy and forget for a reasonable price: ok, but you need to renew every year, so parallels is out for me, especially as the cheaper version is limited in resources you can give the VM.\n\nFor now use the free software Porting Kit, but really think about getting Crossover for 1 year, as long as it does not get more expensive (20% off with SILICON)",
            "Oh sorry! Forgot to answer this.\nIt's a sideloading app for running ipad/iphone apps on m1 chip macs. It's community supported/developed as of now. (The original dev left the project a few days ago)\n\nIt's completely safe, though. Been playing Genshin with it for a year and a half, through many versions of playcover without a problem.",
            "How do you get the M1 version",
            "I would recommend lube.",
            "Who the fuck games on mac",
            "Mac & PC.  Then you can stream your games from PC to Mac.",
            "So you can then stream it to a Mac?",
            "Ah. Well I guess most games you play. I never have run into an anti cheat issue except with destiny 2 but I just fire it up on GeForce now",
            "Now though that we have D3DMETAL that works off the game porting kit I've been able to run all my windows games on Mac even directx12 games. FFVII remake intergrade, Diablo 4, path of exile, resident evil 4, devil may cry 5, and a few others",
            "I've updated it so now you can sort by [Metacritic rating](https://macgameslist.com/?sort-desc=votes) as well as release date and completion time. Click the \"Sort by\" dropdown and you'll see the options. \n\nYou can also filter by genres, compatibility type as well search for a specific game/genre :)",
            "That’s a great idea! I’ve started working on that and should have it ready in the next day or so.",
            "I mean that it’s impossible given how much software is based on Rosetta 2 and will also be in 5 years. Is also backed in the M1 chip, so is very unlikely it will go away. You don’t accelerate something in hardware to abandon it in a couple of years",
            "Is baked in hardware, is not going away soon.",
            "??? Do you even understand how an OS porting works? Just open the system monitor and watch how many Intel process you have. As an example: Logitech drivers and apps are Intel",
            "Don't have Rome II but yeah, looks like it might not work - shame. I only have these two currently. My buddy has Warhammer II (I think) and that also works perfectly.",
            "Natively meaning you download them on steam, launch them and they run perfectly. You don’t need anything other than the game and the launcher.",
            "They're not that dated, only the escort quests. Play Max Payne 1 & 2, they're amazing games. The second one is harder than you expect.",
            "They are dated. Now max Payne 1 is available in mobile (iOS and android). You can directly play 3",
            "Yess! Awesome",
            "Did you get it to work?",
            "Steam was one of the first to be m1 native. Launch it from steam and open up your task manager. Under cpu there is a column called kind. Apple is native. Intel is Rosetta. If launching via steam gives you intel, browse the steam app folder and look for it. If you launch it directly it might be native m1.",
            "[deleted]",
            "Who said they had a PC? In fact I think op is trying to run fall guys on their 2020 m1 pro exactly because they do not have a better alternative",
            "\"PC\" is not an operating system. Neither is \"Mac\".\n\nAll  hardware are in fact personal computers (PC) as well last time I checked. Or what do you do, run PC in your Windows? Phush, I ran BSD in my Linux before that. Sometimes I download Nokia via my SMS also... I guess I'm old school in that way.",
            "I’m not sure cause I don’t own a rog ally yet but I guess it is possible, trough steam link connecting both in the same WiFi",
            "like, gaming with crossover has gotten SIGNIFICANTLY better with more recent (directX 12 especially) games. set the D3DMetal graphics slider on, and I think mSync too. its gotten way better since release of directX 12 support a couple weeks after the first message I left a few months ago when it first released. it couldn't run many newer games at first (which was to be expected) but subsequent updates made it awesome. now I have all the games I mentioned above running natively on Mac not geforce NOW like how I game a lot from Mac \\^",
            "Wow that's amazing - I can't believe you implemented it so fast thank you!!",
            "I see what you mean now. Didn't the first Rossetta only last a couple of years before being turned off though?",
            "So was 32bit support, that went away real quick.",
            "Is that what natively means?  I thought native meant it was a game that ran as an arm process.  I’m guessing those games were probably utilizing Rosetta 2 which translates arm instructions to x86.\n\nhttps://www.applegamingwiki.com/wiki/Introduction_to_gaming_on_Apple_silicon_M1_Macs#Methods\n\nYou can tell what’s happening if you open up activity monitor and check what it says under “kind” while running the app :)",
            "Hmm would you recommend waiting for the remaster to come out",
            "Hmm I heard there was a remake in progress so I might wait for that",
            "No, sorry man, I’ve been busy with school and work and spaced it",
            "thanks for the detailed advice! I launched it with steam and in activity monitor it said \"apple\", so we're good",
            "It works on MBA right",
            "😂 mac gaming at its finest.",
            "I mean, apples own marketing decided to deliberately seperate themselves from being 'pcs' so it's hardly surprising that people use the terms that way.   \nAlso if we're being pedantic that way there's also no real difference between a pc and a console other than operating system either. So how about we just let people use terms that everyone understands their meaning without going nuts.",
            "I would focus on getting something on the ethernet network (for faster, more reliable speeds) and I would focus on getting something with a stronger GPU, for a better gaming experience on the Mac via streaming.",
            "You're welcome! Just happy to be helping out :)",
            "Rosetta 1 was introduced in Tiger, in Snow Leopard had become optional but you can install it. It was dismissed in Lion, so around 6 years (plus the residual support of Snow Leopard until 2014)",
            "10+ years, such a short time…",
            "\"Native\" in context of app builds means \"Build (compiled) specifically for M1, so when you run it on M1 it's not using rosetta translation of an Intel\" build I think.\n\n\"Native\" in context of running an app on Mac hardware means you're running the app directly normally on the Mac, as opposed to using virtualization (Parallels) or translator thing (Crossover) or whatever WINE is.",
            "Ah you may very well be right. I have not checked the activity checked or anything like that. Might be Rosetta. All I know is I did not need to download anything or run anything other than the game and launcher.",
            "Honestly, no. It's super cheap and still plays well in widescreen, at least the second one does. There's a real magic to the graphics and the sound and the way it plays. Even the greatest remaster would be hard pressed to capture that, and remasters are often a crapshoot. \n\nThey're like $5 each, tops, so play the first one until you get bored, then play the second. Max Payne 2 is one of my favourite games of all time.",
            "Alright",
            "nice. it might seem a bit strange initially, but if you're old enough to remember/played maniac mansion or monkey island it's sort of like that..adventure point and click. \n\ni bought it on a whim a while ago. good reviews and all ..didn't play it. got bored and decided to fire it up. now one of my top 5 favorite games. it's just done so well\n\nalso nice to see the m1 sort of stretch its legs. powerful gpu for integrated. so lets see it.",
            "A consol is also a computer. They are all PCs. \"Personal computer\". Your phone is one too.",
            "Well I Learnt something new today 👍",
            "and x86_64 has been around for nearly just as long? \n\nApple's **thing** is just going \"Fuck you\" and removing support for things that don't mesh with their vision of the future.\n\nYou can't argue both sides of the post as proof. Either Apple cares about legacy SW or they don't and they have demonstrated time and time again that they don't (removal of 32bit, deprecation of OpenGL/OpenCL, etc).",
            "awesome, I'm looking forward to it. I don't get around to playing games that often but after seeing some reviews of this I figured it would be a perfect start",
            "My graphing calculator is also a 'personal computer' doesn't mean I wouldn't get funny looks if I called it that.\nLanguage evolves.",
            "…and usually everyone follows. I lived through os x introduction, cd removal, etc. Sometimes is a bit too much, but the alternative is Windows stuck in a 30 year legacy nightmare.\n\nx86_64 was another problem, basically intel machines were a termal burden for what apple wanted. And Intel just fucked everything, even amd was surpassing them. The latest architectures are just a joke compared to the 2 years old M1. I never heard a fan while all my intel machines are struggling",
            "A few questions:  (And bear in mind I have an M1 iMac and love it):\n\n1.  Why is running a fan a major issue?  If I get a great game/compute/etc. experience, is a fan necessarily a big deal?  What if I can’t hear it?  What if I play music and never notice it?  Is the fan running a full indication of whether something is a joke, architecturally, or not? \n2.  Why, as a user, is Windows 30 year legacy nightmare an issue?  Sure, I can imagine from Microsoft’s POV it might add complexities, but from your POV, why do you care?  Do you compile a lot of code and have to support older code?  Doesn’t your compiler abstract that from you?  \n3.  Why do you think Intel was a terminal burden for Apple?  The 12th gen Intel is cheap, fast, and slots into any old (meaning, basic, not age) motherboard.  I can even run MacOS on it, and I get comparable speeds for compute/CPU related tasks to the entry level Studio, for around $350 for the Intel chip.  Yes, I read the stories about problems and bugs Apple engineers found in Intel chips in 7th gen times, and I read the story that that’s why they decided to put MacOS on ARM, but why was it a terminal burden?  And as a user, aside from the fan (noise), what else is better on the M1?  \n\nI really like my iMac.  I got it for about $800 secondhand, and it’s the entry level M1 version, and it’s grand.  But it doesn’t go head to head with any of my modern Intel machines, even my i5-12400, much less the same with a Radeon 5700 in there, even when both run MacOS.  It’s nice because it’s a well-integrated all-in-one that’s fast enough for the basics, and it was purchased because I wanted a screen larger than a laptop, 4K-5K, to run MacOS.  And I fully agree Apple has done a wonderful job with a new(ish) chip architecture; I just think sometimes it’s exaggerated a bit the importance to the end user.  \n\nThe one area that I think Apple can knock out the competition is on the laptop side.  They have a few things to figure out yet (I understand M2 heat in the MBP13 is an issue for some), but overall it’s very impressive.  On the desktop side, however, the advantage is less clear to me."
        ]
    },
    "DXMT, a new open-source Metal translation layer, runs NieR: Automata": {
        "title": "DXMT, a new open-source Metal translation layer, runs NieR: Automata",
        "score": 161,
        "url": "https://github.com/3Shain/dxmt/discussions/7",
        "content": "",
        "num_comments": 22,
        "comments": [
            "Cool progress!",
            "Some very impressive work here,  building a shader converter that targets LLVM IR in such a way that the metal driver is happy to suck that up and use it is very impressive (MoltenVK from my understanding does not attempt this instead creating a txt representation of shaders and compiling them from source JIT).",
            "Amazing!!!",
            "Nice callout to dxvk's origins :)",
            "they really combined dmt and dxm😂🤨",
            "Please make this support SteamVR on Mac somehow",
            "That was the first game that worked in dxvk so pretty good",
            "Can you explain why the effort? What is the advantage to gptk, wine, whisky?",
            "Can it run on 8gb of ram if capped at 30fps?",
            "lol what? Nier Automata  was working perfectly a couple of months ago on crossover. Tested it.",
            "Its amazing, can't wait to see further progress.",
            "Metal AIR is a lightweight container over LLVM IR, so it’s mostly an interfacing issue. Of course, this doesn’t make the work less impressive!",
            "Bruh",
            "It might be possible for him, but from what I read on GitHub he is doing this in his free time, which will slow down the progression of DXMT.",
            "It directly translates from D3D11 to Metal having one less translation to deal with, which can potentially improve performance and better translation of graphics.",
            "Not sure tbh, worth a try on that config.",
            "That depends on the game, not the D3D11 implementation.",
            "One fewer than what? GPTK uses D3DMetal",
            "Nice idea! Wish you best of luck!",
            "From what I am aware of GPTK uses D3D11 support uses D3D11on12 which is another layer of translation, D3Dmetal is primarily implemented as D3D12 compatible API but happens to support D3D11 because of D3D11on12 which is open-sourced by Microsoft.",
            "oh its not mine, I follow that guy to get Updates on His Genshin project, I shared because more Macgamers can make good use of it, I do want to add that it is Also Open source compared to Gptk which can add a lot more flexibility.",
            "GPTK does not use D3D11on12 and it cannot use that.\n\n\nD3D11on12 is essentially a D3D11 Windows driver. That means, just like the D3D11 driver from Nvidia or AMD, it only implements a lower level API and relies on the D3D11 runtime, which is part of Windows, to handle a lot of the higher level tasks.\n\n\nBoth D3D11on12 and D3DMetal do use Microsofts DXBC to DXIL converter though, to avoid having to support multiple shader bytecode formats.\n\n\nThe primary advantage of DXMT over Apple's D3DMetal is that it is open source and under a permissive license."
        ]
    },
    "Cyberpunk 2077 Path Tracing FSR3 M3 Max": {
        "title": "Cyberpunk 2077 Path Tracing FSR3 M3 Max",
        "score": 18,
        "url": "https://youtu.be/ZXsaWkyAOYI",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Seeing how much I can push the ray tracing on the M3 Max. Granted, this isn't really a true test, as the multiple layers of translation, running through 2 sets of beta software, are hurting the performance. Have to use an FSR3 frame gen mod to get it to a playable frame rate. The frame gen causes a lot of artifacts. Usually in the bottom 25% of the screen while driving but easily noticeable anywhere with quick camera movements. Tested this with a lowered resolution, but high graphic settings. It is certainly playable like this, but not ideal. The ray / path tracing can get very noisy, but can look pretty damn impressive at times. One of the best showings of the path tracing comes in at the end. The orange fluorescent light that spreads out and fills the alcove, that gets broken up by lighter store signs, looks, mostly okay. I'm not sure if some of the floor tiles are a hard cut off for the ray bounces, or if they are actually a different color. Hopefully, the non max versions of the M4 chips can pull off RT performance like this. I feel like they might already have some solid hardware, that just needs some more fluent software. The frame graph is hilarious...",
            "We are nearing rog ally level performance levels on a few thousand dollar machines, what a time to be alive /s",
            "Wow that’s damn impressive dude. Might try this out. I have the same system as yours",
            "Thanks for sharing my very good dude! but TBH this kind of look awful? I mean the game. I have zero clue on how frame generation and path tracing work so I'm an absolute noob here. What are the frame rates when you push up the resolution?\n\n2 things that realy stood out:\n\n- The way the image reconstruct from a cloud of dots, exactly like real time editing in Blender. Is it due to path tracing?\n- Is it common for frame generation to miss 25% of the bottom of the frame like that, or do you think it's a software issue with the mod?\n\nAnyway, thank you very much for your post. Very informative.",
            "When I bought a Steam Deck is when I completely gave up on Mac gaming. I’ve saved a lot of money on my Mac purchases because of that. I’m happy there’s progress but I’m out for good.",
            "The thing is even if the performance is good the experience is pure garbage, the way ui reacts for full screen stuff is just atrocious"
        ]
    },
    "What free native multiplayer fps games are there on Mac now that csgo is no longer an easy option?": {
        "title": "What free native multiplayer fps games are there on Mac now that csgo is no longer an easy option?",
        "score": 5,
        "url": "https://www.reddit.com/r/macgaming/comments/1dls6ip/what_free_native_multiplayer_fps_games_are_there/",
        "content": "",
        "num_comments": 9,
        "comments": [
            "Combat master is probably the only decent working multiplayer fps game. It’s a ported mobile game but it still works",
            "I have hopes that XDefiant could come to MacOs as a native game considering that ubisoft is lately bringing the Assassins Creed games.",
            "Well,                Is available ! Best game ever",
            "Wolfenstein Enemy Territory can be played on macOS with ETLegacy.\n\n https://www.etlegacy.com/",
            "There is [Zero Grounds](https://store.steampowered.com/app/2402450/Zero_Grounds/). It has antigravity mechanics.",
            "It's fun",
            "I agree with this. Been playing for a few months. Its good times. I've found a few glitches. But overall its a great game.",
            "I doubt it'll happen because of Battle eye anticheat. They'd have to convince those guys to support Mac",
            "Hadn't thought about that. If they do it'll be great. Not sure if the game works on crossover"
        ]
    },
    "Free Games on GoG": {
        "title": "Free Games on GoG",
        "score": 9,
        "url": "https://www.reddit.com/r/macgaming/comments/1dlof43/free_games_on_gog/",
        "content": "For those who like old classics (+ one new)\n\n*  Flight of the Amazon Queen: [https://www.gog.com/en/game/flight\\_of\\_the\\_amazon\\_queen](https://www.gog.com/en/game/flight_of_the_amazon_queen)\n* OpenTTD (Transport Tycoon Deluxe): [https://www.gog.com/en/game/openttd](https://www.gog.com/en/game/openttd)\n* Beneath a Steel Sky: [https://www.gog.com/en/game/beneath\\_a\\_steel\\_sky](https://www.gog.com/en/game/beneath_a_steel_sky)\n* Lure of the Temptress: [https://www.gog.com/en/game/lure\\_of\\_the\\_temptress](https://www.gog.com/en/game/lure_of_the_temptress)\n* Ultima 4 (Quest of the Avatar): [https://www.gog.com/en/game/ultima\\_4](https://www.gog.com/en/game/ultima_4)\n* Jill of the Jungle: [https://www.gog.com/en/game/jill\\_of\\_the\\_jungle\\_the\\_complete\\_trilogy](https://www.gog.com/en/game/jill_of_the_jungle_the_complete_trilogy)\n* Samorost 1 (not new but free and worth mentioning): [https://www.gog.com/en/game/samorost\\_1](https://www.gog.com/en/game/samorost_1) \n\n",
        "num_comments": 4,
        "comments": [
            "Beneath a steel sky is great old skool game.",
            "cool, how do you find these?",
            "Yes, great classic on par with several of those by LucasArts Games",
            "On [gog.com](http://gog.com) click on \"Store\" -> Browse All Games -> All Games for Mac.  \nThen in the left menu filter choose \"Show only free games\""
        ]
    }
}