{
    "Age is just a number.": {
        "title": "Age is just a number.",
        "score": 15879,
        "url": "https://v.redd.it/vh75jt7zb18d1",
        "content": "The inner child is always in there.",
        "num_comments": 274,
        "comments": [
            "You know his wife is on a lounger reading a book and shaking her head at him every few minutes.",
            "The lifeguard is a fan. Was waiting for the judges card to come out by the end of it.",
            "That first one threw out my back just watching it.",
            "Hell ya. That dolphin move had me rolling!",
            "A man who hasn't had his soul and happiness sucked out, taken from the machine? Rare, indeed.",
            "I want to be like him when I grow up!",
            "lifeguard unphased dis must be a regular occurrence 😭😭😭",
            "It’s the sassy twist for me 😂",
            "Someone’s going to sleep good tonight!",
            "I like the front flip belly flop.",
            "How is the lifeguard not entertained",
            "The lifeguards aren’t having it",
            "Gotta love the intentional belly flops.",
            "The fact the lifeguard was not throwing up scores is mad disappointing",
            "He did a triple lindy!",
            "Is that man single?",
            "Showing off in the retirement home! He bout to get some. 😂",
            "I dove in highschool for one year. 0:13 in, that 1 and a half front flip was nuts for his age lmao. I just had lower lumbar discectomy surgery a month ago at age 30+ and I dont think id ever risk a random disc rupture on a dive like that ever again in the future.",
            "That’s worth watching twice.",
            "Man did a swanton... he is young. Just cuz he has white hairs I wont remotely consider him old. We need to normalise this so that people take good care of their health and live a prosperous and fulfilling life.",
            "I love this guy",
            "That's gonna be me at that age because I'm like that now 🤣🤣",
            "Legend",
            "Land dolphin.",
            "I like the porpoise flop, but my back won't do that anymore.",
            "What a fucking legend",
            "living his life to the fullest! Truly, happiness is not given, but how you do it. Appreciate small things in your life ♥",
            "Was anyone else watching to see if he was gonna do a triple Lindy",
            "Ouch!",
            "Goddamnit ! how is he dry after every splash ?",
            "Goes incredibly hard.",
            "Go Ahead PaPa!",
            "Jumping as if it could be his last day on earth. \n\nOn second thoughts if he continues doing that it might be .\n\nBut I hope I am like this at his age , all ready to jump around like a happy chicken",
            "someone had 4 long island ice teas",
            "I haven't seen a diving board in a long time. This definitely was not in California.",
            "Honestly I wish there was a side category for the Olympics for this.",
            "He peaked on the first jump when leapt like a damn salmon. I’ve never seen anyone do that.",
            "The Ministry of Silly Walks is expanding its area of responsibility.",
            "He hit the salmon jump so clean",
            "Next up on corncob tv",
            "The only good kind of age is just a number",
            "Hahaha legend 🤍",
            "He looks like he is a lot of fun and doesn’t gaf what anyone thinks.  Good on him.",
            "Needs to do a triple Lindy",
            "Love first jump: the FISH!!! 10 points!!!",
            "I really need to look at more stuff like this and stop gravitating towards negativity.",
            "You know that lifeguard was like ***Ohhhh what's he gonna do this time?!*** - Every time. lmfao",
            "I smile while watching :) I guess granpa is a pro swimmer on his young age. I love his vibes ♥",
            "Instead of asking people \"How old are you?\" I ask \"What's your level?\"\nWe all level up over the same period of time, our experience is what is different.",
            "Savage 450 splash, he should've gone for the cover",
            "🤣🤣🤣🤣",
            "The flopping fish move lol",
            "Thornton Melon is the man",
            "Lifeguard is like: \"Damn, I wanna do that too\"",
            "Under this specific situation, the title is true",
            "🤣",
            "Was he trying to impress the lifeguard? It looked like it was working a little bit.",
            "How is the life guard not laughing",
            "All around us are life guards",
            "Preacher see!",
            "i do the first one in the ocean, i pretend im a fish that jumps out... i thought i was the only one ...",
            "We don’t stop playing because we get old, we get old because we stop playing.",
            "The salmon jump is my favorite.",
            "This is literally the best I’ve seen all night! As a lifeguard who has seen some things well this guy takes the cake I really don’t know which one I like best 🤣🤣🤣🤣",
            "Triple lindy",
            "The dolphin dive was so epic",
            "Majestic",
            "Why is that lifeguard so unamused?",
            "I feel like he's just there for the sideboard",
            "This is me...........lol, just ask my wife.",
            "Now do a backfl... Oh he did.",
            "All 10’s.",
            "That man needed a higher diving board.  But he did alright with what he had. 😃",
            "Im sure he was very sore the next day.",
            "We need to get this guy into the [World Death Diving Championships](https://www.youtube.com/watch?v=lB42dmJru88)!",
            "age is but a number but hes gonna feel that in the morning",
            "“Age is just a number.” 😇\n\n“Age is just a number.” 💀",
            "I’m laughing. Thank you 😊",
            "I’m nearly 50 and still jump off high things and do cannon balls and bombs etc with the kids.",
            "Mark my words. June 22, 2024. My dad does these exact same moves, and I'll post a video",
            "He is on something. If he is not, then he is definitely high on life which makes it even better.",
            " Looks like a \"who can make the biggest splash\" competition",
            "Yo Mike from bb going crazy 🔥",
            "He gets better",
            "First one was Zombie style 😂",
            "Life guard slowly coming around to the idea of the fun to be had.",
            "„I have the feeling you’re only here for the diving board.“",
            "Master Roshi",
            "Must be one of my relatives.",
            "No cannonball? No pretend-to-accidentally-fall-in? Where did this guy learn his form?",
            "Yo, this reminds me of that guy that was on the dating show and he just did the fucking Zipline the whole time and he got called out for it n kicked off",
            "I don’t see any age here",
            "Is that Mike from breaking bad and better call Saul?? 😁😁😁",
            "Drake fans be like:",
            "The lifeguard: 😐",
            "Old man fun time",
            "Lifeguard just waiting for \"The One\" 😆",
            "i love this New Biden!",
            "The lifeguard is just like, bro not this dude again...",
            "10/10 on landing the Magikarp.",
            "Pension just hit",
            "Did that lifesaver smile once? Or is she sick of this guy’s daily antics at the pool?😁",
            "My back pain says otherwise",
            "Say that to my back pain and bad mood.",
            "1. Dolphin dive\n2. Sissy leg twist\n3. Buddha pose\n\nMy top three",
            "Age might be a number, but that flip to a belly flop hurt!",
            "Still doesn’t mean that they should run the government.",
            "I love silly diving ♥️",
            "He did the Pocahontas dive!!!!",
            "A few of those would have stung. Credit for getting back up and keeping on.",
            "Of these 10-15 odd jumps, am sure atleast 3 might have pressed the air out",
            "A rare moment where the music was *chefs kiss* for the video",
            "This guy is replacing the kitty on my motivational posters.",
            "The beat just goes with it!",
            "Accidentally ate some edibles",
            "Age truly is just a number!",
            "Keeping the leather attached to the body after those dives is a gift",
            "I want to become.... LIKE HIM",
            "10/10 for every dive",
            "Glorious!!!",
            "Until he can’t get up out of bed in the morning.",
            "Mike if Walt never bought that gun",
            "If this isn’t me when I’m old, show me this video and tell me to be better",
            "I must give it to him with his creative jumps.",
            "Retired circus clowns are fun.",
            "Put him in the olympics he’s a pro",
            "I didn’t see the Reddit name and thought this was a very different post",
            "In old age, it’s really amusing. When we get old, we'll act like kids again, especially being spoiled.",
            "The dolphin move 10/10",
            "When you're an old fella doing flips into a pool, age is just a number.\n\nIf you're Drake, R. Kelly, Jerry Seinfeld, Steven Tyler, Jimmy Page, Anthony Keidis, Woody Allen, Dane Cook, Paul Walker, Johnny Depp, Brad Pitt, and more I can't remember: AGE OF CONSENT IS NOT JUST A NUMBER",
            "Me @ 70 hahaha love it",
            "This has to be outside the states.  I haven’t seen a diving board in many years.  Bravo to this guy.",
            "3 week recovery for that little manoeuvre",
            "Damn Biden is a besat",
            "I’d give anything to be like this at his age",
            "hey sis?\nyes?\ndo you think you dosed those brownies a little too much?\nLooks like it.",
            "I'm not this creative anymore lol",
            "I like the dolphin fluke move.",
            "Nothing brings back the child in me like jumping into a pool.",
            "I want to hang out with this man",
            "Honestly this is life goals 😂",
            "The seal looking flop one was the best \n9/10 IMO ",
            "That’s great!",
            "I don't care what anybody says. This guy is pretty funny. Love his little moves before the dive.",
            "Love this man’s energy. Too bad this god awful music ruined it",
            "Cocaine is a hell of a drug",
            "Welcome to /r/MadeMeSmile. Please make sure you read our [rules here.](https://www.reddit.com/r/MadeMeSmile/about/rules/) We'd like to take this time to remind users that:\n\n* We do not allow any type of jerk-like behavior, including but not limited to: personal attacks, hate speech, harassment, racism, sexism, or other jerk-like behavior (includes gatekeeping posts).\n\n* Any sort of post showing a mug, a shirt, or a print is a scam. You will not receive anything except a headache and a stolen credit card.\n\n- [More information regarding rule 1 as well as how mug/shirt/poster scammers operate can be found here.](https://www.reddit.com/r/mademesmile/wiki/rule1)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MadeMeSmile) if you have any questions or concerns.*",
            "How come so dry each time !!",
            "So is BAC.",
            "Fuck your background music!",
            "Does his shirt ever get wet?",
            " He is living his life to the fullest. Thrash background music tho.",
            "Into the pool wearing a t-shirt? Is that a thing? It’s prohibited in Germany for sanitary reasons. Just wondering",
            "Love how dry his shirt is in each take",
            "Mike Ehrmantraut joining his granddaughter in the pool.",
            "wtf is this song",
            "What is this horrendous fucking song dude",
            "Don't show the post title to EDP",
            "Shitass song but this guy is cool",
            "Oh god, I'm crying haha 😄",
            "this old man is very fit",
            "Chill out",
            "Downvoted for the awful music. Just use the actual audio people... it's not hard and you're actively making vids worse to watch in most cases.",
            "Hello, I’m Chris Hansen. Would you like to take a seat?",
            "Videos ruined by some dogwater ass rapper who shouldve never even remotely been a hint of popular",
            "Lovely video. But could you miss the background music more than this? 😂",
            "Are his clothes dry for each jump?",
            "He doesn't even look that old.",
            "Jesus Christ my ears are bleeding",
            "Preacher seat",
            "What in the fuck is that audio???",
            "Some of those look painful for any age. ",
            "That's Phil! He's only 23 but he got second hand cigarette smoke once",
            "That's what PD files say as well 🤷🏻‍♂️",
            "And prison is just a place.",
            "Why is it always the americans that go swimming fully clothed",
            "Just getting out of prison must be liberating",
            "With Advil",
            "Michael’s showing off again…. Yes, Michael! I saw you! Very good! Well done!…for fucks sake I’ve lost what page I was on… ",
            "We're guys.  No matter our actual age, we're all 12 at heart.",
            "Women are truly a very strong motivator for men. Lol",
            "let the man have his fun😂",
            "Wife bad",
            "He was like 😎",
            "they almost dove in to save the performer's drowning guitar solo",
            "actually, that was the funniest thing to me in the video. no expression at all. just, \"ive seen this shit a thousand times.\"  barely moves a muscle",
            "he didn't even dare to complain how he would land on the waterrrrrrr hahahhha",
            "Man didn't even crack a smile. No reaction whats so ever. Did we watch the same video?",
            "Yeah I could do that too but I don’t feel like doing 6 months of physical therapy after.",
            "Age is just a number of recurring back injuries.",
            "‘Age is just a number’ until you need a body cast because you slept on your pillow wrong. Lol, loved the video though.",
            "Think it gave me some severe whiplash too. 😬",
            "he does it again at 0:28 where again he kills it",
            "Dude been training up to this peak masculinity since before you were born.",
            "Came to post this. Great dolphin jump",
            "maintaining their happiness and spirit despite the pressures of the world.",
            "Very nicely summarised",
            "Could also be a man who hit absolute rock bottom at one point but chose life anyway",
            "Don't be so hard on yourself.  It's drugs.",
            "We don't grow up. Our toys just get more expensive.",
            "Growing old is mandatory, growing up is optional.",
            "Granddad’s been at this resort all week, pulling these stunts 😂",
            "You think his wife just takes him to the pool so he’ll tucker himself out? 😂",
            "How he didn’t crack a single grin is truly beyond me",
            "I was wondering about that too, but then I realized that it's their job to pull him out if something goes wrong, so I'm guessing they're not too keen on his stunts lol",
            "It's like he has no fear of the belly flop pain at all, and is impervious to forcing water up his nose by slamming his face into the water lmao.",
            "My persona headcanon: these were compiled over a month and he returns to bother that lifeguard *every single day*",
            "It's in Ballwin, MO, a western suburb of St Louis.",
            "You need at least 2 more diving boards for that.",
            "Nah, he joining Waltuh to help him collect that cash he dropped into the pool",
            "Why not put better music",
            "☺️",
            "Yeah, I see this sentence more and more. It would be good, if it lost its negative background, but it is still strange to me",
            "I don’t get this. I hear about Advil all the time in the US, in the UK it’s just always called Ibuprofen, but it doesn’t do anything except pain relief.\n\nEdit: ok it was pain relief for the man, I thought it was for her in some Xanax type way",
            "*repositions sunhat*\n\n*and again*\n\n*and again*",
            "Grandpa: \"Look what I can do!\"\n \n*spazzes*",
            "No, she has an e-reader. A waterproof one, because well, her husband does this.",
            "yes the inner child remains inside",
            "I often refer to my “inner 8 year old”",
            "Idk I'm 36 and my wife and I were at a park when everyone started leaving due to a thunderstorm rolling in and we got on the seesaw and were both laughing so hard we were crying.\n\n\nPeople that \"grow up\" are just people that forgot how to have fun.",
            "\"When a guy does something stupid once, well that's because he's a guy. But if he does the same stupid thing twice, that's usually to impress some girl.\"\n-The Lorax",
            "Yea, no",
            "Cmon there is no risk of injury with that first dive. \n\nIf anything a man his age continuing to stay active in this sort of way is likely good for his health. Not bad.",
            "If you're seriously at risk of significant physical injury from that first dive, then you need to move your body more and most likely lose weight.",
            "Why are so many redditors so out of shape?",
            "8",
            "and that training is paying off, these excellent dives prove that",
            "It's a reminder that we can pursue our passions it's not too late",
            "I know weed is good but have you tried Meloxicam?  Shit has my old ass feeling good.",
            "We are all children masquerading as adults.",
            "Bingo!",
            "Indeed",
            "F##k Yeah!!!!! Lol!!!!",
            "Win for everyone. Man gets a great nights sleep(assuming he didnt hurt himself), wife gets time, we get entertained",
            "Since Advil became one of the larger makers of Ibuprofen years ago, Advil in the US became a generic term for Ibuprofen. Similar to tissues being called Kleenex, 80s parents calling all video games a Nintendo, or Radar for 60s and 70s parents for Microwaves. \n\nAs for Advil in this case, it would be used for pain relief because at his age he might be hurting from all the times he landed awkwardly.",
            "Well, the most known brand here is probably Nurofen.\n\nIbuprofen is the drug name.\n\nIn the UK we often use drug names not brand names but not always. Paracetamol, aspirin, codeine.",
            "Helps with inflammation, and knocks down fevers, not just pain relief.",
            "Same reason you call a vacuum a Hoover. \n\n\nOr to search the web for something is to Google.\n\n\nCould also be good childish behavior gives her a headache! ",
            "It's similar to your klaxon.  Brand that became a generic name.  Thank you QI.",
            "This is so inspiring and motivating! He's a great guy",
            "Because it's an American website and America is 41.9% obese as of 2024.",
            "Regardless of shape,  it does become easier to injure yourself as you age. Being out of shape makes it 10x worse of course and these people are clearly out of shape to be that easy so your point still stands. I just know that I've had to dial back the intensity of my workouts because I started more frequently pulling muscles after 40. It's annoying.",
            "Because we’re sitting or lying here and scrolling.",
            "To even just let yourself do one playful thing per day helps immensely. \n\nIf you walk by an empty playground in the evening, go down the swirly slide. Stay within your safe range of mobility and don’t be ashamed. If that means you’ve gotta do some of the toddler stuff. Just let yourself have fun for chrissake. We die at the end anyways, why not let yourself have a little fun?\n\nIf that feels like too big a first step for you, build to it. When you’re all alone at home or in an elevator, do it a quick little silly dance. Play!",
            "not all passions pay the bills. I enjoy my job. To some extent it is my passion. At least the industry in general. But a job that pays well. It is still a grind.",
            "I have bigger toys the you, nana naanananaa :)",
            "I wish. I'm a 34-year old woman on the outside.\n\nOn the inside, I'm a Tommy Lee Jones character, waxing philosophic on the ugliness I've beheld.",
            "Error one, right: Frankenstein is the name of the creator, not the monster. Error two: Frankenstein is a zombie, right. He’s a type of zombie. It’s like people who say Tannoy when they mean public address system. Tannoy is a brand name",
            "Then again people in the UK Hoover the carpet and write with a Biro.",
            ">Paracetamol\n\nahem, I think you meant Acetaminophen.",
            "We call paracetamol, acetaminophen in the states. Brand name is Tylenol. N-acetyl-para-amino-phenol or para-acetyl-amino-phenol is the name of the actual molecule. You can find all 3 names buried in here.",
            "Neurofen+ is awesome, you get both ibuprofen and codeine OTC. Can't get that in the US!\n\ni guess it's because in the US people mix their ibuprofen with their fentanyl so it is not necessary",
            "Everyone's like \"ooh I slept on my side and now my back is fucked up\"  and I'm like GUYS THAT IS NOT NORMAL.\n\nThis **should not happen** even if you're in your 20s, 30s, 40s, 50s, etc.\n\nPlease exercise a *little*.",
            "Nuh uh, You are supposed to give me that toy, so we can play together. \n\nNow Give it!",
            "I, too, like drugs",
            "I also like drugs",
            "Correction: Dr. Frankenstein *was* a monster",
            "And wrap presents with sellotape",
            "the funniest one to me is how in some parts of the US a carbonated soda is called a Coke no matter the brand",
            "I’ll show you an Acetaminophen",
            "Now that annoys me, because based on the name derivation it seems like it should be pronounced \"Till-enol\" like a goofy midwesterner would probably say it anyway.",
            "Sometimes our exercise isn't well rounded enough either. I had to add some workouts to strengthen lower back recently because I just wasn't getting that apparently despite regularly exercising.",
            "I used to do drugs. \n\nI still do, but I used to, too.",
            "We say these in kenya too",
            "I don't drink anymore. But I don't drink any less!",
            "R.I.P. Mitch Hedberg"
        ]
    },
    "When you truly love your job": {
        "title": "When you truly love your job",
        "score": 7740,
        "url": "https://v.redd.it/aa9l39ti118d1",
        "content": "",
        "num_comments": 131,
        "comments": [
            "This is some Scrubs shit. lol",
            "And they sound good to.  Kinsley is going to be well taken care of",
            "She experienced a real life Disney moment. I love it 🥰🥰",
            "This is absolutely wonderful and those guys are the best.\n\nHaving said that, it does remind me of Family Guy's [Aids song](https://youtu.be/p5l174CliKE?si=rsjRNLhAFxc-uPlh) lol.",
            " I love the “confused unorganized” discussion at the beginning 🤣🥰",
            "Best episode of Scrubs.",
            " When you truly love your job, every day feels like a Friday and you can't wait to get back to work on Monday!",
            "Even with the mask on you can tell by her eyes she is smiling when they start singing.",
            "Sounds like a Cuphead soundtrack",
            "Now these are the elders I wish lived forever😥",
            "I THINK THAT WAS PRETTY FREAKING COOL!!",
            "We gotta bring back barbershop quartets",
            "Reminds me of my grandpa- he played one of the Buffalo Bills in The Music Man and used to insert our names into the songs (“*goodnight Katie, good night Katie!/goodnight katie, you’re going to bed right now!*)",
            "Plot twist: They're not real doctors.",
            "I was feeling bummed but this really helped!",
            "Cannot believe there are people with so much love!!! What kind of world I put myself in…….",
            "The B Sharps!",
            "So heartwarming! What a lovely group of doctors! I want to learn that song to sing to my littles 🥰",
            "Well gee that warmed my dead cold heart.",
            "I am beyond impressed that they managed to gather six doctors in one hospital who can do barbershop and do it *this well*.\n\nMy work place is huge and there's three people there who play instruments - me included.",
            "Stop. I’m not crying. You’re crying.",
            "Little kid: k now do for the longest time",
            "\"Entertainment fee - 10.000$\" when the bill comes",
            "So inspiring, we needed that",
            "As a nurse and former barbershop 💈 septet member this is absolutely amazing. Way to go team!",
            "Doctors get a bad wrap boy... but they bust their ass off.  They bust it in school,  and then again during their careers.",
            "This some greys anatomy energy 😂😂",
            "\"yayy\" 🥲",
            "Feel like I’m watching the show scrubs lol . Love those guys",
            "Ticketmaster will now team up with hospitals for limited VIP concerts. Tickets start at $15,000, not including diagnosing,  treatment, and supplies.",
            "Ahh the power of Barbershop",
            "Magnificent 😍",
            "Hibbleton!",
            "The dedication is truly amazing.",
            "When i heard \" You are a silly man!\" I knew this was going to be good...",
            "There’s no way you guys are making this magic with just your mouths.",
            "Awwww this is so sweet",
            "Positive vibes like these work wonders beyond just medicine and hospital care!",
            "Thats so damn sweet. People can be so lovely. All children need more people like this around growing up",
            "Omg, Scrubs is real...",
            "Of course we sing, we're a gang.",
            "Unfortunately, this wasn’t covered by their insurance and six doctors singing adds up pretty fast.",
            "I wanna hug em!",
            "I would be surprised if they were real doctors. Probably a group of choir boys in scrubs doing volunteer work at the hospital. That is awesome as it is.",
            "Kinsley doesn’t react",
            "Blows my mind that masking isn’t mandatory by health care staff in the middle of an uptick.",
            "Worth the high medical bills lol",
            "so cute 🥰 \nalthough why are these doctors so ancient ?",
            "Welcome to /r/MadeMeSmile. Please make sure you read our [rules here.](https://www.reddit.com/r/MadeMeSmile/about/rules/) We'd like to take this time to remind users that:\n\n* We do not allow any type of jerk-like behavior, including but not limited to: personal attacks, hate speech, harassment, racism, sexism, or other jerk-like behavior (includes gatekeeping posts).\n\n* Any sort of post showing a mug, a shirt, or a print is a scam. You will not receive anything except a headache and a stolen credit card.\n\n- [More information regarding rule 1 as well as how mug/shirt/poster scammers operate can be found here.](https://www.reddit.com/r/mademesmile/wiki/rule1)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MadeMeSmile) if you have any questions or concerns.*",
            "What are even the odds that a group of hospital workers are all such talented singers as a group?",
            "I absolutely love this!\n\n(Also my sardonic brain fully expected the video to cut to the Vasectomy song from Family Guy)",
            "”We hope you enjoyed our song and oh btw that’s an additional 1.000$ charge”",
            "I'm not crying, you're crying.",
            "That’s additional 1000$ on the bill please",
            "Awwwwwwwwww 🥹",
            "Harmonizing real good too! Bless their souls.",
            "They are so sweet",
            "Doctors quartet singing fee: 8000$",
            "When did Ted and his band become doctors?",
            "Y’all ever seen Opal by Jack Stouber?",
            "Bloody amazing singing, but why are all the doctors so old?? It's like... Half of them look like they should be retired, and the other half is close to that age! \nStill, good stuff :)",
            "Wait, how are they so good at harmonizing? Do they sing as a hobby?",
            "Why this feel like the start of some Jordan Peele horror 👀",
            "Awww Ok, I'm better now lol",
            "Captain America’s barbershop quartet ain’t dead after all",
            "How much extra did they charge,",
            "Ffs now I know why Medical assistance cost so much in US. 😂",
            "💈 [SPEBSQSA](https://en.wikipedia.org/wiki/Barbershop_Harmony_Society)! 💈",
            "That's awesome",
            "This is so good 🥹🥹🥹",
            "[This is what I thought first](https://youtu.be/raniSkRLa14?si=ivxkBWSpxOHexiZI)",
            "wouldnt have time for that in Irish hospitals.....",
            "Man can you imagine if all hospitals were filled with joyful singing instead of beeps and boops",
            "After that they received a check for 500$",
            "wtf that was so incredibly precious",
            "Most adorable moment! The joy when you sing to sick people! It’s an amazing feeling ♥️♥️♥️",
            "Incoming bill for 10279.19 dollars for \"vocal therapy\"",
            "Love this ♥... Now, about that billing code. 🤔",
            "imagine the bill",
            "$500 surcharge on bill for \"wellness visit\"",
            "This is wholesome as fuck. I expected some half ass cover of something and they went full crooner.",
            "I’m more surprised by the fact that not only one but multiple doctors were around for more than a minute. It’s not a slight at them it’s just that personally even in rare medical cases and dying people or me when i was sick doctors seem so busy they start to get visibly upset when you take up more than a minute of their time unless they are actually doing something on you.",
            "Probably some man lying bleeding it out but it’s ok your daughter now feels better because they sang a song! We’ll done",
            "That’s a lotta old white doctors right there",
            "Can I get sick and admitted here?",
            "“That will be 100k, don’t worry, we will find a way to get the money out of you”",
            "*Kathleen Kennedy suffocating",
            "Yeah, I guess they were on a break from saving other ppl.",
            "It’s nice and everything but do you American pay through the nose for hospital visits and this is what the docs are up to",
            "Meanwhile, Tyrone is bleeding out in resus, old Doris up in cardio is flat lining and 8 year old Jonny is choking on a marble in A&E. 🤣",
            "[The Worthless Peons](https://youtu.be/yMo_boi1Yw0?si=FenRcpFUomcWObnx)",
            "\"I remember, cartoon theme songs\"\n\n\"No, no, no...that was lame. We do primetime now.\"",
            "# Boing, fwip!",
            "My balloon!",
            "This is absolutely wonderful",
            "Absolutely wholesome",
            "count me out unless you're paying extra",
            "YESSSS LIKEEE ALL OF THEM ATE THAT SONGGG!!! THE VOICES?? helloooooo!",
            "That's exactly what I felt, like in an old Disney movie. They should hire them to end up the mediocrity of songs in their recent movies. But we all know it's never going to happen. Kathleen would die out of rage having 6 white cisgender dudes working for her!",
            "You have aids!",
            "Ted’s Band",
            "The best thing about Fridays is that you get to go home and not return for work for two beautiful days.",
            "Haha it really does!",
            "Was just gonna write that",
            "Barbershop quartets are still going *very* strong (I'm in one myself lol). Look into the Barbershop Harmony Society for the US national hub of all things barbershop, they run some extremely cutthroat annual contests and have tons of resources and competition videos to browse through.\n\n[Here's one of my favourites!](https://www.youtube.com/watch?v=zkQxhjrs7aM) (They were the quartet champions from that year, and their performance of Take On Me is another one that I can recommend)",
            "Reminds me of my granddaddy. I was 7 when he died, but I have a core memory of seeing him sing with his Barbershop group on stage in a performance. ☺️",
            "The Buffalo Bills! Now I can hear the songs in my head. Good memories.",
            "Sounds like doctoring is the side gig.",
            "Tbh I wouldn't be surprised if it was just a bunch of docs who would randomly hum, sing, and just vibe in the few minutes they had or even while working. All it takes is for someone you know to randomly utter a theme song you both like to start a silly little duet",
            "I must have missed the barbershop quartet episode. ",
            "1. People can stay after their shift. Absolutely no rule against that. \n2. Usually doctors have a specific ward. What is to say this isn’t a paediatric ward? Oncology? \n3. Patient care is about doing more than the bare minimum, it includes making people feel safe and comfortable in an otherwise very unfamiliar environment with strangers. If some old lady wants to call me mum and hold my hand, you better believe that I am letting her call me mum and hold her hand. Hospitals are scary places and kindness and compassion can make things better for everyone involved.",
            "\"Can yall just take my blood pressure now\"",
            "RIP Sam Lloyd aka Ted. ): I was looking for this comment thread I knew it would be here somewhere.",
            "Thank you for sharing that.  I had misremembered just how good that show was.  There was one episode where my wife and I were laughing at the beginning and crying by the end.  In a half hour with commercials, that’s some good writing.",
            "Humanity doing what it should be doing: Making the world a better place",
            "Somehow you are in a subreddit about making people smile and bringing identity politics when nothing in the original video or the comment you're responding to provided it? My god we are screwed as a country. Please, get off the internet and get some help.",
            "Wait you think these doctors would save Disney movies \n\nExcept Disney doesn't like cis men?\n\nDamn. Prejudice against cis men is ruining Disney.",
            "Everyone has Aids!",
            "Yes you have aids",
            "RIP Ted :(",
            "Ah it was a really good one. Someone was unwell in it. And it was set in a hospital. Remember?",
            "All people do is complain that there isn’t enough money for healthcare but yet of all this stuff is going on",
            "Whatever helps ya sleep at night!",
            "I was looking for Ted too 😭",
            "I'm sorry if I hurt your feelings. If it can help you feel better I am not from your country. If your country is doomed, be assured that I have nothing to do with it! Just wanted to point out the irony of the comment, and that white males are not necessarly the demons that Kathleen Kennedy and many other activists from your country like to portray.",
            "My friend you are too online, I order you to log off"
        ]
    },
    "Dads": {
        "title": "Dads",
        "score": 940,
        "url": "https://v.redd.it/xro5jgycv38d1",
        "content": "",
        "num_comments": 36,
        "comments": [
            "What a nice video. Not everything is lost in our world",
            "This is precious 🥹",
            "These children are incredibly lucky to have a loving father, it looks incredibly touching",
            "The way all of the kids have the exact vibes of the parent",
            "This is Paris, isn't it?",
            "Thank you OP for the nicest glassy eyes I’ve had in a while :)\n\nGoing to call my Dad now.",
            "Much love",
            "These fathers really deserve respect and love and my dad is just as cool, I miss and love him so much, he is already in heaven",
            "In fact, many fathers do not show how much they love you, all because some men consider showing love to a child to be weak, but they love you very much.",
            "Many fathers don't want children, but I believe that lifelong happiness lies in them. That's a pretty sight! 😍",
            "I wish all the children to enjoy this, but I didn’t succeed.",
            "I'm dad and I love 💖",
            "This does put a smile on me",
            "Is that bernie sitting at the end?🤣",
            "This is so touching! Oh my God, these wonderful men who I really want to call the fathers of their babies. My feelings are overwhelming me\n\nI feel so much love here",
            "Why do people think it’s perfectly fine to record and post others without permission?  It’s creepy.",
            "Welcome to /r/MadeMeSmile. Please make sure you read our [rules here.](https://www.reddit.com/r/MadeMeSmile/about/rules/) We'd like to take this time to remind users that:\n\n* We do not allow any type of jerk-like behavior, including but not limited to: personal attacks, hate speech, harassment, racism, sexism, or other jerk-like behavior (includes gatekeeping posts).\n\n* Any sort of post showing a mug, a shirt, or a print is a scam. You will not receive anything except a headache and a stolen credit card.\n\n- [More information regarding rule 1 as well as how mug/shirt/poster scammers operate can be found here.](https://www.reddit.com/r/mademesmile/wiki/rule1)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MadeMeSmile) if you have any questions or concerns.*",
            "Ok but these kids be dressing better than some adults",
            "Picking them up always saves the day",
            "was that Steve-O on the bike",
            "Those kiddos must have some major playground drama going on",
            "The best thing to happen to kids since mom's!",
            "My heart itches cause my dad abandoned me, it's really a blessing to have such caring dad's, hope to be one too one day!",
            "when a dad is doing an OK parenting work, he gets praised. when a mom is doing an OK parenting work, she is criticized because it is only okay, not great.",
            "I agree, it's heartwarming to see positive examples of fatherhood. While not everyone wants or is ready for children, for those who do embrace parenthood, it can bring profound joy and meaning. Videos like this remind us there's still a lot of good in the world. ❤",
            "Hope that old one was a g'pa",
            "I agree, this reminds me of my own father and the special moments we shared. It's amazing how impactful a loving parent can be ❤",
            "It is.",
            "I was one of those until my daughter was born 11 years ago. Now I can't imagine my life without her ![gif](emote|free_emotes_pack|heart_eyes)",
            "I’d like to think so 😅",
            "Same man. My daughter changed who I was",
            "Meh, I had a grandpa dad and I think he was probably a better father for it. He was very patient, but took good care of himself, so he was still active. He was able to pick me up from school because he was retired lol",
            "Otherwise....",
            "Stop 😭😭😭"
        ]
    },
    "I watched it on repeat ": {
        "title": "I watched it on repeat ",
        "score": 3181,
        "url": "https://v.redd.it/bzralvswj18d1",
        "content": "",
        "num_comments": 84,
        "comments": [
            "I love how the mother is looking at her daughter with such love. And the how the daughter is feeling every word in her soul. It’s just a reminder that every family has its own world: joys, triumphs, setbacks, failures, and heartbreak. We never truly know what other people are going through, and we could all be a little better by showing others grace. I don’t know what that family has or is going through, but by the looks of it, they are lucky to have each other. What a sweet video.",
            "The emotion on Mom's face. Pride at the small warrior she's raising 🥰🥰🥰",
            "I just cry for strangers as a hobbie at this point ❤️",
            "mom is healing by watching her girl find her strength ❤️",
            "That moment when Mom realizes she’s done good and her girl’s got this!! 💕",
            "I was not expecting tears at 7.28am watching the second video I saw I Reddit today.",
            "Fab-which song is that",
            "I’m always crying for strangers on this gosh darn app 🥹",
            "This is why music exists",
            "This is a mama raising a warrior",
            "The song is Don’t Give Up On Me by Andy Grammer.  Here’s a [version](https://youtu.be/KL9qp0FNEzU?feature=shared) you may like too!",
            "Thats not just mother and daughter...thats a Team...THATS A GANG !!!",
            "It’s awesome to see the mom and child have fun and also bond so well.  Best wishes to them both.",
            "That looks like someone who *really* needed a win.",
            "No one is cutting onions. I’m crying cause what a beautiful moment. \n\n… actually someone should be cutting onions I’m putting off cooking dinner",
            "recording people just trying to have a moment",
            "Country music sounds like motivational YouTubers",
            "I.ma say both...for equally powerful, yet vastly different reasons...and maybe a few shared ones",
            "Holy Moly. The passion.",
            "Unfortunately these moments are finite. I remember crying in these moments because I knew they wouldn't be there forever. \n\nNow I just cry that they're gone.",
            "This is pure love. My tears dammit",
            "In case no one has told you yet.... YOU'RE DOING AN AMAZING JOB, MOM!! \n\nWarriors raising warriors!! I see you!! 🧡",
            "You go girl ! Proud mom singing along, awesome 👍 This is what family bonding is made of.",
            "Those two souls are so proud of each other!🥹",
            "To people without kids, you can’t imagine how hard it is to hold a kid that age like that… and she is dancing to!:D",
            "We all need this much energy and moxy. I wish I did.",
            "Who sings that song?",
            "that was really sweet. Thanks for sharing",
            "What do you mean you can’t hold me this year?",
            "well that's lovely",
            "Emotional!",
            "Must watch if you are new to and like this song\nhttps://youtu.be/KL9qp0FNEzU?si=cRJptaxfHPI9u_A-",
            "Thank you for posting this",
            "Much love",
            "I just cry for strangers as a hobbie at this point ❤️❤️❤️",
            "Core memory created",
            "Pride at the small warrior she's raising ",
            "Bloody tik toks invading reddit",
            "That song fuckin blows.",
            "Welcome to /r/MadeMeSmile. Please make sure you read our [rules here.](https://www.reddit.com/r/MadeMeSmile/about/rules/) We'd like to take this time to remind users that:\n\n* We do not allow any type of jerk-like behavior, including but not limited to: personal attacks, hate speech, harassment, racism, sexism, or other jerk-like behavior (includes gatekeeping posts).\n\n* Any sort of post showing a mug, a shirt, or a print is a scam. You will not receive anything except a headache and a stolen credit card.\n\n- [More information regarding rule 1 as well as how mug/shirt/poster scammers operate can be found here.](https://www.reddit.com/r/mademesmile/wiki/rule1)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MadeMeSmile) if you have any questions or concerns.*",
            "This is gold 🥇",
            "That hit me like a truck ngl. I express my feelings a lot in screamsinging songs that somehow touched me while driving. And both of my daughters screamsing with me now. \n\n(It also sounds like simlish with my 4 year old, because the songs are usually in english and she doesn't speak english 🫠)",
            "Her back gon be fucked up",
            "On TikTok, the mothers sister proudly found the video and thank her for being the family’s rock during tough times. You could see she’s been through a lot,yet still remains strong!",
            "this just makes me smile😊",
            "I'll show everyone who deserves respect some respect. However, I don't care how hard you have it if you're voting people in who want to make life infinitely harder for everyone. So that rules out like 30% of the American population. Never give intolerant bigots a single moment of belonging because they'll weaponize it and take more away from you than you could ever imagine.",
            "You can literally feel the pain the mom has experienced. Her heart Is so filled with love it’s amazing to see",
            "That right there is the love you want from a Mom.",
            "her stares on her daughter says it all",
            "Thats my trick for not giving up too.",
            "awww \"hobbie\" is so cute",
            "Ok so this is a normal thing and perhaps I'm not emotionally unhinged",
            "What an accomplishment!",
            "Don’t Give Up On Me by Andy Grammer",
            "I HAD to look this song up. Already added it to my \"Happy\" playlist.",
            "This sub makes me cry more than it makes me smile",
            "Tonight, put the phone away, list all the things you're grateful for in life and then cry for yourself. 💜",
            "Just saw him pounce around stage and do this live last month. Was never really a big fan, but it was free, I had a wagon of beer, and weather was nice.\n\nGuy has a fucking voice and a true talent for dance and song. Can play instruments. Travels with reeeeeeeally talented backup folks also. Fun time. Happy I didn't dip to the bar!",
            "I hope the mom sees this video so she’ll never forget this exact moment! 🥹😍",
            "Looks like the mom was pleased, stop being offended on other people's behalfs.",
            "So glad they did.",
            "Came here to say this. Kiddo is way too heavy to be doing this, but momma bears gonna mom.",
            "Andy Grammar",
            "Whats the name?",
            "If that’s all you take away from watching this video? That’s fucked up",
            "Sauce? I wanna love on this family!",
            "Nah take that somewhere else",
            "Sorry, but I feel like you’re just deciding what these people are feeling. Like yeah it’s a cute moment but you don’t know them?",
            "By far my favorite song of his.",
            "I was going through comments to find this.\n\nThank you to both u/jkeyeuk and you (:",
            "Fresh Eyes is bomb tho.",
            "She did! She commented on it  on tik tok!",
            "Don’t give up on me . Andy Grammar",
            "No clue. Couldn't care",
            "The worlds not ending princess",
            "What’s the matter? Big brain issues?",
            "Redditors are good at applying whatever they want to a 30s clip.",
            "Yup!",
            "I don't know a lot of his songs, but \"Damn It Feels Good to be Me\" is one of my go-to songs when I need a pick me up. I'm going to have to do a deep dive of his music.",
            "Thx!",
            "Aren’t all of his songs positive?   I can’t think of a song he’s made that isn’t a feel good song."
        ]
    },
    "They told their wives they're going outside with the kids.": {
        "title": "They told their wives they're going outside with the kids.",
        "score": 1302,
        "url": "https://v.redd.it/z8e2sz7xq28d1",
        "content": "",
        "num_comments": 63,
        "comments": [
            "Why did they not make it parallel to the grass? ![gif](emote|free_emotes_pack|sob)![gif](emote|free_emotes_pack|sob)![gif](emote|free_emotes_pack|sob)",
            "Why do they have like 6 kids of similar ages between them",
            "Pucking around",
            "Cool idea and fun but the video is so scripted",
            "They do it so infectiously that it makes me want to lie down in a stroller like one of those little ones too....",
            " \"I said play with the kids, not play WITH the kids!\"",
            "To be fair, at least they are having fun with the kids.",
            "BABY SHUFFLEBOARD, what a great idea!",
            "Sometimes the simplest moments bring the most joy.",
            "So the ladies thought that two men were going for a walk with 6 buggies?",
            "If there's a wheel, there's a driveWAY",
            "How lucky the kids are with their fathers! When I observe such moments, they really touch me, probably because I never had that in my life.",
            "Dudes being Dudes",
            "Welcome to /r/MadeMeSmile. Please make sure you read our [rules here.](https://www.reddit.com/r/MadeMeSmile/about/rules/) We'd like to take this time to remind users that:\n\n* We do not allow any type of jerk-like behavior, including but not limited to: personal attacks, hate speech, harassment, racism, sexism, or other jerk-like behavior (includes gatekeeping posts).\n\n* Any sort of post showing a mug, a shirt, or a print is a scam. You will not receive anything except a headache and a stolen credit card.\n\n- [More information regarding rule 1 as well as how mug/shirt/poster scammers operate can be found here.](https://www.reddit.com/r/mademesmile/wiki/rule1)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MadeMeSmile) if you have any questions or concerns.*",
            "[the original ](https://youtu.be/0avi_0MPPt0?si=e-VkL2MriMPPZ8Jt)",
            "Omg that’s hilarious",
            "That fucking drive way. ..  yard.. house... Jesus",
            "How were two people going to take 5 strollers on a walk?",
            "Someone sat down and discussed the script of this shit before they made a video..just to get some likes..fucking crazy.",
            "men 🤣🤣🤣",
            "A little creativity and everyone has fun",
            "Is it okay to call this a play date?",
            "Why are strollers always black?\n\nIs it a sun protection thing?",
            "This is how big kids play.",
            "It kinda reminds me of [Do It Again Uncle Steve](https://m.youtube.com/shorts/gWCmkow1vaE)",
            "I would love a driveway that size!",
            "Looks fun.  I’m in",
            "Two years later\n\nWelcome everyone to the National Baby Stroller league. I’m Troy Aikman. And I’m here with my co host tinny Tim and we have a nice line up for you tonight.",
            "daddys are really creative LOL. Hope they're having fun ![gif](emote|free_emotes_pack|grin)",
            "Is no one seriously considering what happens when a wheel jams and sends a baby flying? This is so incredibly stupid to be playing with your child as a puck for your own enjoyment.",
            "Saw them do the triangles and I was like “omfg I know what they’re doing lol. Cuz I do it to lol”",
            "This is hilarious! What a fun way to spend the day!",
            "That’s like 200 grand in concert.",
            "Why are these birds always chirping. Just hush up and see what happens. “What are you doooooing?”",
            "To many CO2 producers definitely",
            "dad's inner child ![gif](emote|free_emotes_pack|disapproval)baby sitting while playing, that's cute!",
            "They did make it parallel to the grass, the concrete was not parallel to the grass for some godamn sake, idkw",
            "Wheels would get caught in the concrete.",
            "*shouts from the window* \"guys, what are you doing!?\"",
            "That's some tough questions dawg!! Real tough",
            "I was thinking the same thing, I can't focus on the game ![gif](emote|free_emotes_pack|sweat)",
            "Twins?",
            "Pounding out",
            "Of course it is.\n\nPretty much everyone on social media is so desperate to go viral that nearly everything is either half scripted or just full on scripted.",
            "Missed this line in the script:\n\nUse landscape mode unless taking a portrait.",
            "At least this one is kind of cute. Usually these scripted videos are just completely insufferable lol",
            "Actually NOT a great idea, but a really funny and creative one",
            "Scripted viral video thwarted by logic and math! (I thought the same thing!)",
            "I think this is a significant issue for a large part of the world. I don't want to excuse anyone, but some people who aren't ready to have a child due to their age simply don't know how to do it right. No one really knows how to do it right. I also didn't receive much attention from my parents, but I make sure to spend enough time with my child so that he doesn't feel as neglected as most people on the planet do.",
            "Happy Cake Day 🎂",
            "To hide Dirt and stains most probably.",
            "Babies are messy.",
            "If a wheel jammed at 0.1 mph the cart would just stop, the baby would not be flung across the yard. Also, what cheep ass carts are you buying where the wheel just jams for no reason? You're making shit up to get mad over absolutely nothing.",
            "god damn youre pathetic.",
            "It's not babysitting when it's your own child.",
            "Ut was not parallel to anything 😭😭😭",
            "Yeah but both of them? Seems like they just borrowed kids to make the video 😝",
            "Honestly I don’t mind. They’re just trying to make people laugh or smile, and I see them more as a style of comedy skit.",
            "I don’t know how to be a great parent but I just do the opposite of my shitty upbringing and everything is going great with my 3 youngins so far :)",
            "🤷‍♀️",
            "Or bought life size dolls.",
            "Fair enough still thing social media has rotted our society just have fun"
        ]
    }
}