{
    "Tibalt's Friday Tirades": {
        "title": "Tibalt's Friday Tirades",
        "score": 11,
        "url": "https://www.reddit.com/r/MagicArena/comments/1dkuxha/tibalts_friday_tirades/",
        "content": "*TIBALT LOVES TO HAVE FUN IN HIS OWN WAY, WHICH IS CAUSING PAIN AND MISFORTUNE TO THOSE AROUND HIM. HE CAN FEEL THIS PAIN AND EVEN SEEKS IT OUT, TO HEIGHTEN IT AND REVEL WITHIN IT. HE CARES NOT FOR OTHERS, BEING SELFISH AND SADISTIC TO AN ALMOST INHUMAN DEGREE.*\n\n&#x200B;\n\n\\---\n\n&#x200B;\n\n# WELCOME TO THE WEEKLY TIBALT'S TIRADES!\n\n&#x200B;\n\nTHIS IS THE \\*\\*\\****RAGE***\\*\\*\\* THREAD\n\n&#x200B;\n\n**CAPS ON  = TIME TO SHINE**",
        "num_comments": 46,
        "comments": [
            "WHAT WOTC MEANT TO SAY WHEN THEY SAID THEY WANTED TO \"TRY SOMETHING NEW INSTEAD OF A MASTERY PASS\" WITH THIS PSYCHIC FROG THING, WAS ACTUALLY THAT THEY WANTED TO SEE HOW LITTLE VALUE THEY COULD OFFER AND STILL HAVE PEOPLE BUY IT.\n\nTHE VALUE COMPARED TO A PASS IS HONESTLY JUST INSULTING. I WOULDN'T TOUCH THAT WITH A TEN FOOT POLE.\n\nAND THE FACT THAT THEY PRICE IT AT AN AMOUNT OF GEMS THAT IS IMPOSDIBLE TO GET WITHOUT BUYING MORE THAN YOU NEED IF YOU DON'T ALREADY HAVE ANY IS SUCH AN OBVIOUS ATTEMPT TO SQUEEZE A FEW EXTRA BUCKS OUT OF THE PEOPLE WHO DO BUY IT.\n\nFINALLY THE FACT YOU HAVE TO PLAY MORE GAMES PER DAY TO GET ENOUGH TICKETS FOR EVERYTHING THAN YOU WOULD NEED TO PLAY TO GET XP TO COMPLETE A MASTERY PASS IS SUCH UTTER BULLCRAP AND AN ATTEMPT TO CAPITALIZE ON FOMO TO BOOST ACTIVITY LEVELS.\n\nTHIS WHOLE THING IS JUST A BIG, STEAMING PILE OF PREDATORY CRAP.\n\n(EDIT)\nTHE ONLY GOOD THING ABOUT IT IS THAT YOU CAN CHOOSE WHICH ORDER TO GET THINGS IN, SO PEOPLE WHO MIGHT NOT NORMALLY FINISH THE ENTIRE THING CAN STILL GET THE REWARDS THEY CARE ABOUT THE MOST.",
            "OPPONENT GOES FIRST",
            "MH3 MWM EVENT SHOULD HAVE BEEN PHANTOM SEALED BECAUSE A LOT OF PLAYERS ONLY HAVE THE FREE 3 PACKS OF MH3 CONSTRUCTED1? CONSTRUCTED!!?",
            "I'VE ALREADY MULLIGANED TWICE, I ONLY KEPT THIS HAND BECAUSE I CAN'T AFFORD TO MULLIGAN AGAIN.\n\nYOU CAN'T THOUGHTSEIZE ME, IT SHOULD BE ILLEGAL.",
            "TO THE HEAD DEVELOPER OF THE MATCHMAKER ALGORITHM:\nJUST A FRIENDLY REMINDER THAT THERE ARE 5 COLORS IN MAGIC. IT WOULD BE A REAL TREAT IF 4/5 MATCHES WEREN'T CONSISTENTLY AGAINST BLACK OR RED OR BLACK/RED. THANK YOU FOR YOUR ATTENTION TO THIS MATTER.",
            "4 CUT DOWN, 4 GO FOR THE THROAT, 4 SHOOT THE SHERIFF, 4 LILLIANA, 4 SHEOLDREDS EDICT. WHY THE FUCK YOU HAVE CAUSTIC BRONCO AND MOSSWOOD DREADKNIGHT IN YOUR DECK IS INSANE TO ME.",
            "MR. PLANESWALKER A SECOND [[STONE RAIN]] HAS HIT THE [[PHYREXIAN TOWER]] (S)!!!!",
            "EXPLORER BO1.\n\n  \nDID NOT PLAYED VERSUS GREASEFANG FOR ALMOST A MONTH.\n\nQUEUE AS MILL DECK\n\nRAT INFESTATION!\n\n  \nALSO DO YOU KNOW TEMUR ANALYST FROM STANDARD? APPARENTLY ITS A THING IN EXPLORER",
            "NADU NADU MADU NADU NADU NADY NARY NADYCN NADY NADU NADU NADU NADU NAUDNNADY NADU NADU NADU NADU NADU NADU BADU",
            "YOU POWERCREEPED THIS GAME SO MUCH I BARELY PLAY IT ANYMORE",
            "WEAKLY\n\n#**REPRINT ARMAGEDDON.**",
            "TICKETS IS THE SCUMMIEST THING ANYONE HAS EVER DONE IN THE HISTORY OF SCUMBAGGERY. IF I COULD BE FUCKED I'D TEMPLATE UP A SCUMBAG STEVE WITH A LOW-EFFORT WOTC LOGO ON HIS CAP AND SOME PITHY TEXT, BUT I CAN'T BE FUCKED.\n\nALSO, FUCK WANDERING EMPEROR AND SO ON AND SO FORTH.",
            "I DON'T HAVE MUCH TO SAY OTHER THAN I FUCKING HATE ELVES. I WILL NEVER COMPREHEND WHY WOTC INSISTS ON GLAZING THEM AT EVERY OPPORTUNITY.",
            "SOMETIMES IT FEELS LIKE ARENA HAS IT OUT FOR MY SELESNYA SCALES DECK, LIKE OKINEC AHAU DID SOMETHING TERRIBLE TO IT IN CHILDHOOD.\n\n* DRAWING MY NOW SINGULAR TOP-END IN EVERY OPENER... ZOPANDREL, I LOVE YOU AND YOU'RE REALLY NICE WITH THE CAT MAN, BUT YOU'RE A LATE GAME PIECE, PLEASE STAY AT LEAST A FEW CARDS DEEP, THANKS BABE... WISH I DREW VIRTUE OF LOYALTY HALF AS OFTEN.\n* DRAWING GREEN SPELLS AND ONLY WHITE MANA OR VICE-VERSA\n* GETTING MATCHED AGAINST THAT VORINCLEX THAT HALVES YOUR COUNTERS ANNOINGLY FREQUENTLY.\n\nI KNOW MOST OF THIS CAN BE ADDRESSED BY BETTER DECKBUILDING DECISIONS, BUT I WANNA VENT AND I DON'T HAVE THE WILDCARDS TO JUST BE OPTIMAL 4HEAD... SORRY.\n\nALSO, CAN THE GAME PLEASE LET ME PULL A DAMN BRISTLY BILL FROM EITHER MASTERY PASS MYTHIC REWARD OR PACKS...",
            "RAGAVAN PLAYERS REALLY ARE MISERABLE LITTLE SHITS, AREN’T THEY?\n\n***THE FOLLOWING IS BASED ON TRUE EVENTS***\n\nGAME START: I LOCK IN MY OPENING HAND AND… WAIT… FOR… THEM… TO DO… THE SAME. BEYOND A DOUBT, THEY’RE STALLING TO SEE IF I CONCEDE ON SIGHT OUT OF HATE FOR THE MONKEY\n\nONCE THEY REALIZE -GASP- THEY MAY ACTUALLY HAVE TO PLAY A GAME, THEY CONFIRM THEIR OPENING HAND AND WE START\n\nTHEY’RE PLAYING THE LOWEST TO THE FLOOR SORT OF DECK THAT WOULD PROBABLY HAVE A LOT OF TROUBLE ACTUALLY CLOSING OUT A GAME, BUT IS AGGRESSIVE ENOUGH THAT IT STILL MIGHT FOOL SOMEONE INTO AN EARLY CONCEDE BECAUSE IT FEELS SO FAST (MEANWHILE I’M PLAYING A GRINDY SORT OF MONO WHITE BASRI KET STAX)\n\nA FEW TURNS LATER OF THEM BURNING MY WEENIES, I FAITH’S FETTERS THEIR LITTLE SHIT-HURLING PRIMATE AND THEY CONCEDE\n\nIN THE IMMORTAL WORDS OF NICOL BOLAS: \n\n#PATHEITC",
            "IF YOUR CONTRIBUTION TO MAGIC IS TO COPY WHATEVER DECK WINS, I'LL JUST KEEP CONCEDING TO GIVE YOU YOUR SUPER PRECIOUS WIN THAT MEANS EVERYTHING IN THE WORLD TO YOU. I WOULD PAY MONEY TO SEE THESE NETDECKING SHITHEADS GET THEIR ASSES STOMPED IN THE ARENA OPEN THEY GAMED THEIR WAY INTO BY PEOPLE THAT ACTUALLY KNOW HOW TO PUT THOUGHT INTO THEIR DECKS AND TECH THEM FOR AN EVENT.",
            "WHY ARE THE SERVERS SUCH GARBAGE?\n\nMY OPPONENT ISN'T DOING ANYTHING FOR 20 SECONDS BUT THE TIMER NEVER STARTS SO I HIT CONCEDE AND THEY PLAY THEIR CARD USING NO MANA AT THE EACT SAME TIME I HIT CONCEDE. WHY DOES IT TAKE SO LONG TO SEND TINY AMOUNTS OF CODE",
            "Slickshot-cutdown",
            "UUUUUGH, OPPONENTS GETTING LUCKY RATHER THAN MAKING GOOD CHOICES, SO FRUSTRATING!\n\nIN HISTORIC BO1, WHILE THERE IS ONE GOOD GRAVEYARD BASED DECK (DIMIR DREDGE), THERE'S NOT ENOUGH REPRESENTATION OF GRAVEYARD DECKS TO JUSTIFY MAINBOARD GRAVEYARD HATE. IT DOES NOTHING AGAINST MONOGREEN DEVOTION, IZZET WIZARDS, RDW, ETC, AND I CAN'T EVEN REMEMBER THE LAST TIME I SAW DREDGE (THOUGH I HAVE NO REASON TO THINK IT'S BEEN WEAKENED RECENTLY).\n\nSO TO COME UP AGAINST A MILL PLAYER PLAYING AT LEAST 2X \\[\\[TORMOD'S CRYPT\\]\\], AND A SKELETON PLAYER WITH \\[\\[LEYLINE OF THE VOID\\]\\] - SUPER FRUSTRATING. MILL PLAYER SHOULD PROBABLY BE PLAYING \\[\\[ASHIOKK, DREAM RENDER\\]\\] IF THEY ABSOLUTELY WANT GRAVEYARD HATE, BECAUSE AT LEAST IT'S COMING WITH MILL ATTACHED. SKELETON PLAYER SHOULD BE PLAYING SOMETHING LIKE \\[\\[CLING TO DUST\\]\\] IF THEY FEEL IT'S NECESSARY, BECAUSE AT LEAST IT'S 1 MANA DRAW A CARD IN A REGULAR MATCHUP.\n\nMEANWHILE, GIVEN THAT THE MAJORITY OF PEOPLE ARE RESULTS ORIENTED, I WOULDN'T BE SURPRISED IF THE FACT IT LEAD TO A WIN MAKES THEM THINK IT WAS A GOOD DECISION.",
            "PEOPLE THAT PLAY MONO BLACK WASTE NOT ARE FUCKING ASSHOLES",
            "MY MOST FREQUENT OPPONENT AS WELL ",
            "THE LAST WEEK I WAS ON DRAW ALMOST 70% OF MY MATCHES. I'M NOT SAYING I WANNA START EVERY GAME, BUT ATLEAST MAKE IT CLOSE TO 50/50",
            "MOUNTAIN -> SWIFTSPEAR OR PLAINS -> INSPECTOR... MAGIC IS SUPPOSED TO BE FUN NOT GRIND OUT MY 10 WINS AS QUICKLY AS POSSIBLE",
            "THOUGHTSEIZE AND OTHER SIMILAR CARDS SHOULD BE MORE EXPENSIVE THAN 1-2 MANA",
            "JOKES ON THEM, THEY WASTED THEIR SEIZE ON TRASH (SHEDS A SINGLE TEAR)",
            "[STONE RAIN](https://cards.scryfall.io/normal/front/d/2/d2334c10-fa96-4f8e-8187-c7ecc00cbac8.jpg?1562742139) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=STONE%20RAIN) [(SF)](https://scryfall.com/card/9ed/221/stone-rain?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/d2334c10-fa96-4f8e-8187-c7ecc00cbac8?utm_source=mtgcardfetcher&format=text)  \n[PHYREXIAN TOWER](https://cards.scryfall.io/normal/front/0/b/0b47f6d2-9f65-47a4-bfc4-15619befe53d.jpg?1717013848) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=PHYREXIAN%20TOWER) [(SF)](https://scryfall.com/card/mh3/303/phyrexian-tower?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/0b47f6d2-9f65-47a4-bfc4-15619befe53d?utm_source=mtgcardfetcher&format=text)\n\n^^^[[cardname]] ^^^or ^^^[[cardname|SET]] ^^^to ^^^call",
            "NOW WATCH ME HIT THIS [[DRIVE]]",
            "WHAT ARE YOUR OPINIONS ON FALL OF THE THRAN?",
            "ONLY 40 MORE DAYS UNTIL STANDARD ROTATION IN ARENA, STAY STRONG...UNLESS THE EMPEROR BULLIES YOU IN OTHER FORMATS WHICH MEANS YOU GOTTA LIVE WITH IT I GUESS",
            "I ASSURE YOU DECK CONSTRUCTION MEANS VIRTUALLY NOTHING IN ARENA. IT IS A RIGGED GAME. PLAY LONG ENOUGH AND YOU'LL SEE SO MANY \"COINCIDENCES\" FOR YOUR OPPONENT OR EVEN YOURSELF, THAT YOU WON'T BE ABLE TO DENY IT. ",
            "DECK LISTS RUINED THE GAME.",
            ">IZZET WIZARDS\n\nYEAH DUDE ABSOLUTELY NO IZZET WIZARDS DECKS RUN CHEAP SPELLS WITH FLASHBACK OR 3X / 4X \\[\\[DREADHORDE ARCANIST\\]\\] TO CAST SPELLS OUT OF THEIR GRAVEYARD FOR FREE.",
            "CAN CONFIRM \n\nSOURCE: AM ASSHOLE",
            "T2: WASTE NOT\n\nT3: INSCRIPTION OF RUIN\n\nT4: TERGRID'S LANTERN\n\nT5-INFINITY:  EAT A DICK",
            "MAYBE LESS PEOPLE WOULD PLAY AGGRO IF PLAYING ANYTHING ELSE DIDNT MEAN GETTING STUCK IN AWFUL 30 MINUTE SLOGFESTS AGAINST BOARDWIPE/COUNTERSPELL TRIBAL.",
            "THE MANA VALUE IS TOO DAMN HIGH.",
            "I APPRECIATE YOUR HONESTY. LOVE YOU AND FUCK OFF."
        ]
    },
    "Saturday Arena Chat Thread": {
        "title": "Saturday Arena Chat Thread",
        "score": 0,
        "url": "https://www.reddit.com/r/MagicArena/comments/1dlmx4t/saturday_arena_chat_thread/",
        "content": "*'Magic bleeds into real life. With Magic, I was mainly being driven by the idea that, if people could collect their own cards, there would be a huge amount of variety to the game. In fact, one way I viewed it was that it was like designing a game for a vast audience, dealing out the cards to everybody instead of designing a bunch of little games.'* \\- Richard Garfield, Creator of Magic: The Gathering\n\n\\---\n\nWelcome to today's open thread, where /r/MagicArena users can discuss anything they wish not related directly to Magic the Gathering or the Arena Client.\n\n&#x200B;\n\nWant to talk about personal life? Cool things you learned today? Whatever happens to be dominating today's news cycle? Do you have something to talk about that didn't warrant its own thread? This is the place for it!\n\n&#x200B;\n\nRemember that the civility rules are still in force, so please engage kindly and pleasantly with each other.\n\n&#x200B;\n\nCheck out our Discord Channel \\[here.\\]([https://discordapp.com/invite/Magic](https://discordapp.com/invite/Magic))\n\n\\---\n\nIf you have any suggestions for this thread, please let us know through modmail how we could improve!",
        "num_comments": 5,
        "comments": [
            "Anyone got a working eldrazi deck for historic bo1? Tried ramp, red green but both get stomped.",
            "Does anyone know if there has been or will be an Arena Open or Qualifier Play-in event that's day 1 draft and not sealed? Thinking about saving my gold, since sealed is a bad time for the most part (imo).",
            "Just tried MH3 Quick Draft. Totally fazed as to what is what and why should this work together. I usually try one 'blind' draft per set, not knowing anything about it in advance. Most sets can be read, as in understanding synergies, but it's a disaster with this set. Plan B went in action very quickly: raredraft. Needless to say I went 0-3.",
            "I've been having luck with one, but it still needs tweaking. Later this week when I've gotten it tuned better I'll come back and add a list.",
            "RWU are the Energy colors (RW aggro, UW Flyers, UR Midrange)\n\nWBG are the Modified colors (GW Auras, WB Dies, GB Graveyard)\n\nRGU are the Eldrazi colors (RG Spawn go wide, UG Ramp)\n\nBR is Artifacts \n\nUB is Card Draw"
        ]
    },
    "Can someone explain why Vindicator triggered like this?": {
        "title": "Can someone explain why Vindicator triggered like this?",
        "score": 46,
        "url": "https://i.redd.it/qgjpcweb128d1.jpeg",
        "content": "cast [[case of gateway express]], target vindicator with ETB trigger, my 11 creatures deal 1 damage to it.\nvindicator triggers 11 times dealing 11 damage each time, kills me from 18 life.\nam i bad at magic or is this bugged in some way?",
        "num_comments": 22,
        "comments": [
            "Honestly, I'm stumped. It seems like a bug, but this is a replacement effect with a triggered ability and an ability causing damage to be dealt from multiple sources - it's a complex scenario and it may very well be that this is the correct outcome. I consider myself to have a decent grasp of the rules, but this is weird.\n\nI would ask the /r/mtgrules sub if you don't get an answer here.",
            "It's just bugged.  The wording on Vindicator is the exact same as the wording on a shield counter, and one shield counter prevents simultaneous damage from multiple sources with one application.  The Vindicator replacement should apply one time, prevent 11 damage, and create one 11-damage trigger.\n\n122.1c ... “If damage would be dealt to this permanent, prevent that damage and remove a shield counter from it.”",
            "Yeah I don't see or can think of any reason it would happen this way in the rules. \n\n(I'm also wondering why you targeted Vindicator with this but that's really beside the point.)",
            "Yeah I can't see any reason why it would trigger that way and I'm combing the rules. Each 1 damage dealt by case of the gateway express is an independent damage source, dealt by that creature, not case of the gateway express. Ie it will benefit from their lifelink/deathtouch/etc, remove a single shield counter, etc. But its also dealt simultaneously, which has some open ended questions about how it would interact with potential mechanics (if something said 'the first time a creature deals damage each turn...' or something like that). But for vindicator it should simply see 11 different instances of 1 damage each, prevent each of them, then put 11 triggers of 1 damage each to 11 targets. So I don't get it",
            "I definitely wouldn't have expected it to trigger the full damage that many times, so it feels like a bug to me, but it could just be a very counter intuitive ruling I guess 🤷‍♂️\n\nAlso, I'm not sure why you targeted it, because if it worked as I would expect, they would be able to ping your creatures to death and Vindicator would still survive because the damage would be prevented anyway.\n\nAnd thirdly I'm now wondering if there's any way to use Vindicator and the Case against the opponent to trigger lots of unexpected damage, but Case only targets a creature you don't control, so I'm guessing maybe not unfortunately...",
            "No offense, but why target it in the first place?",
            "[here is an older thread about this](https://www.reddit.com/r/askajudge/comments/17wuwvz/phyrexian_vindicator_with_simultaneous_damage)\n\nSeems like a bug.",
            "This is correct. The ETB is done at once, so the effect is \"11 targets hits vindicator for 11 damage\". Vindicator sees that it was hit for 11 from 11 different targets therefore gets 11 triggers of 11 damage each",
            "It appears that you are concerned about an apparent bug with Magic the Gathering: Arena. Please remember to include a screenshot of the problem if applicable! [Please check to see if your bug has been formally reported.](https://feedback.wizards.com/forums/918667-mtg-arena-bugs)\n\nIf you lost during an event, please contact [Wizards of the Coast for an opportunity for a refund.](https://mtgarena-support.wizards.com/hc/en-us/requests/new?ticket_form_id=360000317092)\n\nPlease [contact the subreddit moderators](https://www.reddit.com/message/compose?to=%2Fr%2FMagicArena) if you have any questions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MagicArena) if you have any questions or concerns.*",
            "It's 11 sources doing 11 damage all at once. So for each source of damage it's preventing 11 damage and the opponent gets to do 11 damage to you. Damage prevention has some interesting corner cases and I think this might be one of them.",
            "I cant see that this would ever be correct. If it counts as 11 damage instances, they should all be 1 damage each.",
            "listen man, we're talking about the middle of Silver ranking here, awake for 16 hours on about 4 hours of sleep. i won't be at pro tour amsterdam either.",
            "For the sake of science!",
            "11 targets hit Vindicator for 1 damage each not 11.",
            "I have returned from Judge Chat, and this is incorrect. The ETB makes all the damage happen at once (regardless of the number of sources). Also, Vindicator only cares about whether it's going to be dealt damage, not when a distinct source does damage to it. Therefore, 11 damage is prevented all at once and a single 11-damage trigger should occur.\n\nEven if Vindicator said \"if damage from a source would be dealt\", it would prevent 11 instances of 1-damage and would therefore create 11 1-damage triggers.\n\nBarring some unique interaction OP hasn't realized and hasn't shown and no one has theorized yet, this is a bug.",
            "That's a great point. :)",
            "The honestly here is admirable! Good on you!",
            "I've done those plays. Especially when someone is dragging their ass and I'm watching Youtube or browsing reddit. Then it's like, \"Shit, wrong play.\"",
            "[deleted]",
            "11 targets hit vindicator (first calculation) for 11 damage (second calculation, entirely separate from the first). The interaction is correct, just unintuitive.",
            "According to [Judge Chat](https://web.libera.chat/#magicjudges-rules), since vindicator says \"if damage would be dealt\", not \"if damage from a source would be dealt\", and the ETB causes all the damage to be dealt at once, then the result should actually be a single 11-damage Vindicator trigger.",
            "It's not a new paragraph.",
            "[It isn't correct, sorry.](https://www.reddit.com/r/MagicArena/comments/1dlnvhn/can_someone_explain_why_vindicator_triggered_like/l9rblqq/)"
        ]
    },
    "Is it worth it to spend gold for 'Jump In' just for the cards?": {
        "title": "Is it worth it to spend gold for 'Jump In' just for the cards?",
        "score": 25,
        "url": "https://www.reddit.com/r/MagicArena/comments/1dlnugy/is_it_worth_it_to_spend_gold_for_jump_in_just_for/",
        "content": "For a new (returning actually) player with not many cards ...\n\nYou spend 1000 gold to get an assortment of 40 cards? I tried and got 9 uncommons, 1 rare, and 1 mythic. It seems like a good deal for the cost of one booster?",
        "num_comments": 23,
        "comments": [
            "When I started I thought it was a great deal. You get a lot of cards and you get to play in a sandbox of other people with similarly powered decks, allowing you to complete daily quests and get wins.\n\nAfter a while of building up your collection, then you can branch out.",
            "The benefit is that the cards you get synergize with each other, so they're a good start to building a cohesive deck.\n\nThe drawback is you don't get \"wildcard progress\": for every certain number of booster packs you open, you get a wildcard that can be redeemed for any card of a specific rarity.\n\nSo Jump In is better when you're just starting out and trying to get enough cards to build a deck, but packs are better when there's a specific deck you want to craft.",
            "It's the cheapest way to build your collection from scratch and the cheapest way to get enough cards for some decent decks with a minimum of synergy, so you can start playing in formats like standard.\n\nDoesn't give you wildcards like buying packs would, but you get a lot of cards",
            "I usually play jump in about twice per set release. But it has been quite the hassle to look up which rares you get with which pick.\n\nThe price of entry is so low (the price of one pack), but the rewards are also low. And I find the subsequent games pretty unfun.",
            "Wait jump in updates after every release?",
            "It's not a bad deal, but on the other hand store packs from the latest standard set also give you wildcard wheel progress (1 rare wildcard every 6 packs), has a small change of having a wildcard themselves, and give you gold packs (6 extra rares every 10 packs).\n\nAll this combined to the fact that Jump In also has Alchemy cards makes me recommend buying boosters from the latest standard set to grow a collection instead (right now this would mean Thunder Junction Packs). Keep in mind that commons and uncommons are basically free in the long run.\n\nHaving said all this, Jump In can be fun, so it's a good way to have fun and win cards, and it's a lot less risky than drafting (which if you are good at it's a lot better value).",
            "Edit: I was wrong.",
            "It's not bad for a new beginner, I would caution not getting too crazy with it just yet as standard is about to rotate and there may be new decks on the horizon.  Be a shame to waste your gold now on cards that are about to rotate.",
            "It's worth it to fill in cards from previous sets, but don't solely do jump in. Buying packs from the newest set gets you wild cards. \n\nI've come back to the game and am essentially starting new as my collection has largely rotated out, so I've got a lot of catching up to do. I buy packs mostly, but supplement it with a few jump ins per week.",
            "Duplicate protection still works for vault advancement. It ain't much but it's something.",
            "I usually look at this page to see what chance for rares I can get from each pack https://mtgazone.com/jump-in/ it list all the jump in packs",
            "Pretty much.  Good deal though.",
            "Yes",
            "\"Keep in mind that commons and uncommons are basically free in the long run.\"\n\nCan you detail this? You mean wildcards in these categories are considered abundant enough?",
            "Isn't it an uncommon?",
            "I just started this week. When is standard going to rotate? Bloomburrow?",
            "I was unsure if it updated with MH3",
            "Yes, it's a combination of how many commons and uncommons you open in packs and get in drafts, how common their wildcards are (also found in packs), and the amount of commons and uncommons used by decks\n\nUnless you play a lot of Pauper (common only) or Artisan (commons and uncommons) format, none of which is oficially present in Arena (but there are communities and are very fun formats), you will end up never worrying about needing more common and uncommon wildcards. Rare wildcards and Mythic wildcards are the real thing to worry about, and contrary to what you would think at first, it's very common to need more Rare wildcards than Mythic wildcards.",
            "Yeah, you'll end up with hundreds eventually.",
            "Dang I guess it is. I feel like it used to be a rare but I don't know if I'm remembering right.",
            "Yes.\n\nhttps://whatsinstandard.com/",
            "Yes.  Typically the Jump-In and Challenge decks update with rotation.    \n    \nIf that holds this time, playing now will net you cards that will rotate from Standard in a months time and be largely unusable outside of jank brews as even most Standard cards aren't powerful enough to crack into the meta decks of the other formats on Arena.",
            "It has not updated for MH3."
        ]
    },
    "Truly one of the Emrakul turns of all time": {
        "title": "Truly one of the Emrakul turns of all time",
        "score": 296,
        "url": "https://streamable.com/cg73sv",
        "content": "",
        "num_comments": 107,
        "comments": [
            "“Hey thanks I was gonna do that anyway.”",
            "It’s sometimes a bit of a challenge to get into the “what’s the absolute worst play I can make” mentality. Your opponent REALLY struggled with that.",
            "Just like how some people shouldn't be allowed to drive, sone people shouldn't be allowed to Emrakul. Amazing.",
            "That is pretty funny, but I don't think there was a truly winning play here once they cast Emrakul?",
            "Pretty obvious that opponent thought they could exile your creatures but were forced to exile emrakul. Funny nonetheless",
            "Wow lol. How in the world did opponent play Emrakul on turn 2 though? You can cast something for 2 mana that lets you pay life to cast any spell?",
            "bro you're taking too long to win, let me help",
            "bro is literally the drooling brainlet wojak meme",
            "Seeing it is an energy deck, would the best \"worst play\" be to get rid of Guide of Souls by attacking into the Emrakul and passing? Or would it be better to play the land and dash in Ragavan to attack it into Emrakul? Ither way there isn't a stellar turn for the Emrakul.",
            "Emrakul Emrakan't even",
            "Here on YouTube for when the link expires: [https://youtu.be/zbui50PIB3o](https://youtu.be/zbui50PIB3o)",
            "Well that was something 😂",
            "What am I missing here",
            "LOL",
            "lmfao",
            "Honestly, I've been playing an Ulalek brawl deck and dropping this Emrakul doesn't do much. I even made the mistake of copying Emrakul and it doesn't double trigger the controlling turn, only the extra turn for the opponent lol. \n\nUlamog is the strongest by far and always gets a scoop.",
            "Can someone explain me how they cast Emrakul with 2 mana?\n\nI'm pretty sure there's only 9 card types. Creature, Instant, Sorcery, Land, Artifact, Enchantment, Battle, Planeswalker, Kindred(Tribal)...which I don't even think is on Arena\n\nThat should still cost 4 mana.",
            "yeah this is why you dont play channel into promised end, card is terrible.  if we had the og emrakul decks like this would get a lot better.",
            "Wait how are you playing Channel?",
            "Emraunkul",
            "I would like see \\[\\[Caught Red-Handed\\]\\] + \\[\\[Callous Sell-Sword\\]\\] played against someone who pulls Emrakul at me. Imagine stealing it, attacking with it and then sacrificing it :)\n\n#",
            "Yeah, I really don't know if adding channel was the right call for arena.",
            "i had a dude take control of me with emrakul. \ni had sackable mana rocks on the field. \nashnods altar in hand. \nthey couldve sacked my mana rocks, played ashnods altar, sacked my board state.\ninstead... they sat there for 4 minutes running through THEIR OWN timers... ig they thought that i would either quit or that the timers were mine 😂😂😂 then they quit the game",
            "I think the only play opponent can make there to not lose on the extra turn is shock in the land, dash ragavan, jolt awake nothing to gain 2 energy, attack with ragavan and pay to buff it, block with emrakul and pass.\n\nThen the extra turn starts with the two creatures on board, 2 energy, Ragavan in graveyard so it can't be dashed, and the only spells in hand are the prison and the second jolted awake (not counting the DRC because that's hindsight).\n\nThat leaves OP playing with slightly less options and I think max 4 damage on board so not lethal. Opponent 90% loses next turn, but maybe they have a play.",
            "This is probably dumb but what format do you play in where mh3 is legal in ranked? I usually play on mobile but stopped buying any mh3 stuff because I don’t play commander on mtgs",
            "It just keeps getting worse 😭",
            "God this was hilarious. I’m not sure if maybe it’s my childish humor but I laughed at this for a good couple of minutes and made my stomach hurt. I even cried because I was giggling so hard. Please, arena community, if we can get more vids like this. That’d be great, thank you for this beauty op.",
            "How did he cast Emrakul with only 2 lands?!",
            "Anybody knows how to find \\[\\[Ulalek, Fused Atrocity\\]\\] in Arena? I played against it today, but couldn't find it to craft myself.",
            "Their first mistake was playing a land. Why would you do that unless you have to?\n\nObviously, their second mistake was not reading the cards.",
            "He was just trying to be lore accurate because she imprisons herself lol",
            "Again, class. 🤣\n\nReading the card explains the card.  \n\n\nThough really, I think some players just aren't mentally prepared for how to play poorly as their own opponent, like trying to play yourself at Chess. Don't give your enemy resources for later, make them attack into your bigger creatures, Tap and waste all their stuff as much as you can. Self sabotage.\n\n**Don't cast things that only afflict target opponent.**",
            "If I was Emrakul, I would find legal representation.",
            "i had someone emrakul me. i had mana rocks they couldve sacked, a bunch of creaturss they couldve sacked if they just played the freaking sack outlet in my hand... instead they made me sit there for 4 fucking minutes and when it got to my actual turn, they quit.",
            "They didn't realize they were supposed to make the worst plays for their *opponent*, but it didn't help that they were dead anyway.",
            "i had a dude take my turn with emrakul and then just... sit there. \ni had a sack outlet in my hand they couldve whiped my board with, they couldve sacked my mana rocks... instead, leta sit here for 4 minutes and when it gets to my opponents actual turn, quit.",
            "Oh, I'll take that oppo any day. free wins baby!",
            "Swing the pump guy into the Emrakul maybe?\n\nOr spend all the energy on the reanimator spell then play the stasis enchantment so they have no energy in their upkeep. \n\nI’m not 100% I know the full wording on the cards but those were some lines I could see",
            "I think they might have been able to swing the pumper into Emrakul and cast Jolted Awake twice without bringing anything back. That would mean only 3 damage would be possible the next turn, at least getting the Emrakul player another turn.",
            "Yeah this is just good natured seppuku.",
            "1. Attack with Guide into Emrakul.\n2. Static Prison emrakul\n3. Spend all energy on jolted awake bringing something irrelevant.\n\nThey would start their turn with only Lunarch on field and no energy, so emrakul would return.",
            "This what I've always said: this Emrakul is just not a good card because controlling your opponent is a deceptively weak effect. It sounds badass, but any card I put into my deck is gonna be beneficial for ME, so most plays you can make are still gonna benefit me in the end. Often the best play is to just do nothing and pass the turn back, in which case you just gave your opponent an extra draw for no reason. It's just a glorified 13/13 French vanilla in 80%+ of the cases.\n\nI've always laughed when my opponent plays it against me, and I honestly think almost every time my opponent played it, it has actively improved my chance of winning.",
            "[[Channel]]",
            "I was baffled and wanted to be sure",
            "Nah, he had practically nothing to work with. Personally, exiling emrakul was an okay move, but he should've attacked first. OP was gonna exile Emmy anyway and they had a way to recur any creatures opponent managed to kill.",
            "\\[\\[Emrakul, the Promised End\\]\\] lets you play your opponent next turn for them, but they get an extra turn after that.  While the opponent had very limited options for sabotaging the player, the plays they made were far from optimal, making a win on the extra turn inevitable.",
            "New Emmy seems pretty good. Stealing your opponent's creatures is very nice, not to mention how easy it is to cast for madness.",
            "[[Channel]]",
            "Channel is only \"restricted\" in timeless. You're allowed a single copy.",
            "Channel is not banned in Timeless.",
            "Channel is legal (restricted) in timeless, I use it for shenanigans.",
            "[Caught Red-Handed](https://cards.scryfall.io/normal/front/9/5/95bc5f89-2f01-40c4-9883-4c90ab89fcbb.jpg?1706241833) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Caught%20Red-Handed) [(SF)](https://scryfall.com/card/mkm/115/caught-red-handed?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/95bc5f89-2f01-40c4-9883-4c90ab89fcbb?utm_source=mtgcardfetcher&format=text)  \n[Callous Sell-Sword](https://cards.scryfall.io/normal/front/7/7/770ee3da-d33e-466f-9a2e-ad2d08ef5012.jpg?1692939554)/[Burn Together](https://cards.scryfall.io/normal/front/7/7/770ee3da-d33e-466f-9a2e-ad2d08ef5012.jpg?1692939554) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Callous%20Sell-Sword%20//%20Burn%20Together) [(SF)](https://scryfall.com/card/woe/221/callous-sell-sword-burn-together?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/770ee3da-d33e-466f-9a2e-ad2d08ef5012?utm_source=mtgcardfetcher&format=text)\n\n^^^[[cardname]] ^^^or ^^^[[cardname|SET]] ^^^to ^^^call",
            "It's probably the Timeless format where just about everything is legal, including cards like [[Channel]].",
            "<3 aww glad you liked it!",
            "Channel is a card",
            "make sure to turn on the show cards not in your collection filter",
            "The easiest way would be to just search for the name, I'd think?",
            "You can search 's:m3c' for all the MH3 face commanders.",
            "[Ulalek, Fused Atrocity](https://cards.scryfall.io/normal/front/f/d/fdad1b0e-d3cc-4d76-ae7e-fee12558cf2c.jpg?1717644357) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Ulalek%2C%20Fused%20Atrocity) [(SF)](https://scryfall.com/card/m3c/4/ulalek-fused-atrocity?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/fdad1b0e-d3cc-4d76-ae7e-fee12558cf2c?utm_source=mtgcardfetcher&format=text)\n\n^^^[[cardname]] ^^^or ^^^[[cardname|SET]] ^^^to ^^^call",
            "Honestly, just play some drafts because it gets passed around pretty late.  I have 4 of them without even trying, no need to pick it early in the draft because it isn’t a great card in limited unless you have the right deck.",
            "I've done it before to get rid of a fetch. Just fail to find. Bonus points if it's in brawl and you get their commander in their deck to shuffle it away.",
            "I thought they were going to destroy the enchantment so somehow the emrakul came back into play. Don't know how that would really help though",
            "\"well I'm casting It so opponent means the other player\"",
            "I guess they wanted to shock them for 2 damage",
            "Correction: *Emrakul used Dialga to imprison herself.*\n\nThe summon had too much of herself in the spell :D",
            "I think they wanted to do that but realized they didn't have a way to do any of it. They could kill a creature but they get returned with jolt awake, they could cast the static prison instead of waiting for OP to just cast it their next turn anyways, and they didn't have a way to leave them with no energy to pay on upkeep. OP's opponent just had almost no good plays apart from shocking themselves. And even that gave them a land. Dashing Ragavan into Emrakul probably was the best? until it gets jolted awake.",
            "Snatched defeat from the jaws of victory!\n\nI must remember to not scoop to Emrakul, there's always a chance someone who can't read is at the helm",
            "I would chalk that up to a disconnect or crash.",
            "I think that depends on the deck. If you're running a sac deck, would sacing your creatures have hurt them as well? Was the spell in question the sac permanents and draw for each permanent? I'm pretty curious how they had outs but didn't do anything with your stuff.",
            "Free, aye! The cost is how rare that is vs. People who know what they're doing",
            "yeah, there are definitely better plays, but not sure if there is a way to drain all the energy that turn. Depends on what target(s) are available in the graveyard. Seems like Emrakul is getting removed one  way or the other and then lethal in 2 turns?",
            "Play the stasis first, then pump all the energy to reanimate. Stasis still gives you 2 energy, so you get rid of the spell, bring their energy to 0, then get Emrakul back when they can't pay on their next turn.",
            "Don't you have to spend energy equal to the mana cost of the target card in graveyard? I don't see how you can pay more than the mana cost. Then the creature would also come back since it's not optional?",
            "the only place it really can twist the knife is if the opponent has a lot of \"may\" effects and you exhaust all of them and always choose decline (unless it would give you an advantage to accept them.) There's a lot of \"damage\" you can do to an opponent you control by just casting/activating things if you can decline their effects.",
            "Nah",
            "WTF how have I never heard of this card and how is it not crazy expensive? \n\nOh, because it's banned in literally everything except Vintage and Timeless; Even there, it's still restricted.",
            "[Channel](https://cards.scryfall.io/normal/front/c/e/ce54c7c1-3401-4414-8da0-5846cb0ae1b4.jpg?1701989326) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Channel) [(SF)](https://scryfall.com/card/ima/157/channel?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/ce54c7c1-3401-4414-8da0-5846cb0ae1b4?utm_source=mtgcardfetcher&format=text)\n\n^^^[[cardname]] ^^^or ^^^[[cardname|SET]] ^^^to ^^^call",
            "[Emrakul, the Promised End](https://cards.scryfall.io/normal/front/8/d/8d74a469-c71d-4773-99d3-5456b31df424.jpg?1576383727) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Emrakul%2C%20the%20Promised%20End) [(SF)](https://scryfall.com/card/emn/6/emrakul-the-promised-end?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/8d74a469-c71d-4773-99d3-5456b31df424?utm_source=mtgcardfetcher&format=text)\n\n^^^[[cardname]] ^^^or ^^^[[cardname|SET]] ^^^to ^^^call",
            "Oh shit, I totally thought this was the new emrakul. Sitting here wondering why they didn’t take all their creatures",
            "I'm a little confused, maybe I'm missing something:\n\n1. Opponent cast Emrakul\n2. Opponent got control of OPs hand as a result\n3. Opponent cast (some land) for 2 damage to OP\n4. Opponent cast \\[\\[Static Prison\\]\\] which was a mistake, because Emrakul was *the only* opponent creature, *even though* it was Opponent *playing* that hand. Emrakul was imprisoned as a result\n   1. I'm guessing Opponent thought it would work on OPs creatures\n\nI guess my question would be: even if Opponent *had* played something else instead, once OP got control of his own hand, wouldn't he have cast Static Prison immediately *anyway*?\n\nI'm assuming the better play would have been to probably just pass entirely, since casting \\[\\[Jolted Awake\\]\\] would help keep Emrakul imprisoned, once Static Prison was played. I'm not familiar with most of the others, but am guessing that giving OP more mana *and* imprisoning his own card was about as wrong a move as possible.",
            "[Channel](https://cards.scryfall.io/normal/front/c/e/ce54c7c1-3401-4414-8da0-5846cb0ae1b4.jpg?1701989326) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Channel) [(SF)](https://scryfall.com/card/ima/157/channel?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/ce54c7c1-3401-4414-8da0-5846cb0ae1b4?utm_source=mtgcardfetcher&format=text)\n\n^^^[[cardname]] ^^^or ^^^[[cardname|SET]] ^^^to ^^^call",
            "Channel is _legal_ in timeless?",
            "[Channel](https://cards.scryfall.io/normal/front/c/e/ce54c7c1-3401-4414-8da0-5846cb0ae1b4.jpg?1701989326) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Channel) [(SF)](https://scryfall.com/card/ima/157/channel?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/ce54c7c1-3401-4414-8da0-5846cb0ae1b4?utm_source=mtgcardfetcher&format=text)\n\n^^^[[cardname]] ^^^or ^^^[[cardname|SET]] ^^^to ^^^call",
            "You’re welcome 😄",
            "Thank you, will try.",
            "Oh, of course. And you could also make them shock themself to get a little extra damage in, if you need it.",
            "I thought the enchantment would just let you sacrifice it in precombat phase by declining to pay energy so I thought the opponent would do that",
            "They casted the ench on their own emrakul because of the control other player during their turn and the ench only targetting opponents stuff",
            "Well they wasted one of the \"Jolted Awake\"s properly, after that it was a decision on whether to dash Ragavan into the Emrakul or waste the other Jolted Awake and attack a different creature into Emrakul imo. I'd go with shock the land into play (they'll have 3 mana the next turn either way, so might as well use it now to waste resources), waste the second JA, and attack the Guide of Souls (energy->buff) creature into Emrakul since it represents the most damage and removes 3 energy from the trigger. That would leave Lunarch Veteran on board and the removal + Ragavan in hand, which is only 3 damage.\n\nThen again, maybe Channel->Emrakul wasn't the right play in the first place, but we can't see their hand so maybe they have a follow-up we aren't aware of.",
            "nah it was outlaw deck lol 😂 everything i had was geared towards playing HIS spells",
            "They were dead no matter what. The Channeler that did nothing would have just been the Stasis.",
            "How can you pump all the energy to reanimate? Aren't you required to spend only energy equal to the CMC? Then that would also give them a creature back?",
            "I missed the part that the energy would need to be equal the mana cost. So the graveyard information would be needed.",
            "“Channel Fireball” was the original turn one win combo back in the ABU days. Play Mountain, cast Black Lotus for 0, crack Black Lotus for GGG, cast Channel for two of those G, then cast Fireball with x=20 using the R from the Mountain, the leftover G from the Lotus, and 19 life.",
            "Yes, other than wasting the jolt awake card, they could not have helped the opponent win more. If they had wasted the jolt awake spell and then attacked with the guide of souls, pumping it to drain the energy and then destroying it with a block they still had a chance of lasting another turn.  Playing the land would only have made sense if they used it to waste the second jolt awake which would have been defensible.  Either they did not understand the timing of paying energy for the static prison or missed that it can only target an opponent creature.",
            "Everything on Arena is legal (fully or restricted to a single copy) in Timeless. That’s the premise of the format.",
            "Restricted. 1 copy only.",
            "Yup! Lots of uses for playing a land when controlling someone else!",
            "Well, that's exactly what they did in the video.",
            "The beggining of precombat mainphase already happened before they were able to play the enchantment, so that wouldn't have worked.",
            "I knew that. I just thought that somehow they had some kind of loop where they could get rid of it.",
            "Oh yeah, you can't over pay it. Plus, they have 2 Jolts in hand anyway. Still, giving the opponent something back from the grave is may be worth reducing the number of turns Emrakul is trapped. But if there are no targets in graveyard, yeah, Em is probably just screwed. Even played optimally this was destined to be a very underwhelming line.",
            "Then your opponent casts shock which resolves ahead of your spell but after the life was paid.\n\nIn all seriousness though, I didn't know that. That's a cool MTG history fact.",
            "Ah never knew there was meaning behind the name for the ChannelFireball website",
            "The \"if it's what you need\" is missing I think",
            "Back then it would have been Lightning Bolt, but not if you played the combo before your opponent had a turn. But you’re right, it was fragile if you didn’t win the toss. (Later you could break up the combo with Force of Will or Scars of the Veteran, two of the pitch cards from Alliances, which can be cast without mana.)",
            "🏔️🪷🌳🌳☄️"
        ]
    }
}