{
    "➡️ Daily Questions ⬅️- Post simple questions such as Outfit Feedback, Clothes ID, and Recommendation requests here!! - 21 June 2024": {
        "title": "➡️ Daily Questions ⬅️- Post simple questions such as Outfit Feedback, Clothes ID, and Recommendation requests here!! - 21 June 2024",
        "score": 16,
        "url": "https://www.reddit.com/r/malefashionadvice/comments/1dl7i2q/daily_questions_post_simple_questions_such_as/",
        "content": "Welcome to the Daily Questions thread for all things related to men's fashion.\n\n**Types of questions this thread is great for:**\n\n* Clothing or footwear recommendations 👞\n* Outfit feedback and advice 🧥\n* ID'ing clothes from pictures or screenshots 🖼️\n\n**Want a more helpful answer?**\n\nThe more information you give, the better response you'll get. Try including:\n\n* Budget in numbers 💲 and location 🌍\n* A screenshot of any clothes from a video 🖼️\n\n**How to add a picture to your Reddit comment:**\n\n* You can upload on the [Reddit app and website](https://reddit.zendesk.com/hc/en-us/articles/10516331142932-How-do-I-add-images-in-comments-)\n\n[add images to your comment on Reddit's app and website by clicking the add-image button](https://preview.redd.it/et77qtnc6wpa1.png?width=1161&format=png&auto=webp&s=e6965cbf5d04bd279b3b8673c5472b90a9f0785d)\n\n* Or upload your picture to [Imgur.com](https://imgur.com/upload) and copy/paste the link into your Reddit comment.\n\nIf you're looking for more in-depth information then check out our [style guides](https://www.reddit.com/r/malefashionadvice/wiki/guides) 🛍️, [item guides](https://www.reddit.com/r/malefashionadvice/wiki/itemguides) 👔 and [recommendation threads](https://www.reddit.com/r/malefashionadvice/wiki/itemguides#wiki_item_suggestions_at_each_price_point) 📄.\n\n# The [MFA Discord](http://discord.gg/malefashionadvice) is also open for questions in the [\\#questions-and-advice](https://discord.com/channels/1116793467654381685/1116794518415622154) channel!",
        "num_comments": 116,
        "comments": [
            "Is it a faux pas to wear one’s wedding suit after the fact? I’ve thought that it would be a great opportunity to justify buying a nicer suit than I’d ordinarily be able to and use for a while, but I had a conversation with a friend who was a bit confused by that thinking. Basically, because it’s such a special garment, wearing it often would be a bit weird. My thinking is garments can be worn at all kinds of special occasions, so why would a wedding suit be any different?\n\nWhich mindset is correct?",
            " recently came to the realization that my feet are too wide for most shoes, after buying a pair of wide shoes. Now all of my shoes are supremely uncomfortable. Any recommendations for wide toed shoes that aren't dad sneakers? I like to wear boots, and enjoy a slight heel. \n\nAlso, I dance salsa and like to wear dressy pants with camp collar shirts. Any recommendations and flexible dress pants for those of us with bigger legs/behinds? I only fit into 541 Levi's and other athletic fit pants normally. Thank you.",
            "https://preview.redd.it/j4unl8mnx08d1.png?width=3024&format=png&auto=webp&s=cb3be75537319522139c5aec90c24970e196d226\n\nHey, not sure if it’s the right place to ask. I know Gianni Campagna was a famous Italian suit designer, I just bought these shoes on a thrift store and am not sure if he ever designed any shoes at all. Can’t find any pair with his brand online. Just curious really because they look great. Not looking to sell or anything.",
            "https://preview.redd.it/xgiunbhnvy7d1.png?width=290&format=png&auto=webp&s=6b38638af090b7196873b6da0b320a4d1737c4ab\n\nWhere can I get a cloak like this?",
            "A couple of ID/recommendation requests. Can anybody recommend any linen pants like these? https://ibb.co/YfsrWj4. I really dislike the look of most linen pants I see. \n\nDoes anybody know what jacket the man on the left is wearing here? https://ibb.co/3FqmQyR",
            "How is Pull and Bear as a brand? [These](https://www.pullandbear.com/es/pantalon-jogger-cargo-basico-l08678503?cS=809) look comfortable.",
            "[removed]",
            "# What would you match these with? What pants/shorts and shirt/t-shirt, and most of all what colors?\n\n\n\nhttps://preview.redd.it/p2dfrw80ty7d1.png?width=802&format=png&auto=webp&s=731763af4900b314722292e68d62e267f60f524b",
            "Where to start? Wanting to learn to dress better\n\nHello, male 26 from the US. I've never really focused too much on my fashion or clothes in the past. I just put on whatever I think looks good and hope for the best. Don't really understand style, color, fit or anything else related to fashion. I want to start looking good and having proper outfits, not just clothing ite s I put together. I want to dress better for work (office job) and when going out with friends.  Any advice? Where do I start and learn more about fashion and clothing? Any advice is greatly appreciated.",
            "I tried a bunch of glasses on the eye doctor.\n\nThe one that seemed to work the best for me was the Lool SWITCH BKOG Black (https://www.eye-oo.com/en-us/products/lool-switch-bkog-black#).\n\nThey are somewhere in the middle between square and round, which I like. Full rim. The frames are also not too thick and not too thin. Most of the ones I'm finding are either way too bulky or wire thin.\n\nThe main thing that I don't like about them is the price and the wire thin pieces that go over the ears.\n\nAny help finding something similar, with better over ear pieces, would be greatly appreciated.",
            "Hello guys! I need help to identify a hat style. It was used by Brendan Gleeson character in the movie The Banshees of Inisherin. Which hat style is this?\n\nhttps://preview.redd.it/8ugsvjp61z7d1.jpeg?width=1306&format=pjpg&auto=webp&s=14d59e3ba4a2be14ae9205c276d82e51e44188d3",
            "https://preview.redd.it/lqhvf3gt4z7d1.jpeg?width=1080&format=pjpg&auto=webp&s=b20992da6699237517e0befdb5be8dd8b1b0e14d\n\nThoughts on wearing these Kickers Ankle boots for the office? They were very big in the UK in the 80s among schoolkids especially. I was born in the 90s but like the retro look of them.",
            "Hey. Looking for recs for a skinnier guy for long-sleeve tees. I've really like Pact but I got my other tees on sale and I don't wanna spend $50 for some more lol.",
            "https://preview.redd.it/5p3h8obr7z7d1.png?width=545&format=png&auto=webp&s=550b8c0d63e4747e35c70a191c4bc18951d527ff\n\nCan this be fixed? Excess fabric on the upper back and near armpits.",
            "I wear t-shirts pretty much constantly because it's hot and I'm frugal.\n\nDoes this fit?  I'm naturally skinny and eat a lot, tracked with an app..  Some t-shirts look baggy.\n\n[https://postimg.cc/0zj4wSRY](https://postimg.cc/0zj4wSRY)",
            "What's a good place to get high quality t shirts for tall skinny guys",
            "https://preview.redd.it/5jsyk3nlsz7d1.jpeg?width=1125&format=pjpg&auto=webp&s=d6139eb4eb6d0be6bc1a190bdfcd29f1e45ba6e4\n\nIs this suit appropriate for a Director Level interview?",
            "Anyone know any wider fit version of levi 511's frogs eye? Essentially just \"washed black\" but in 550, 569, 505, etc.\n\nhttps://preview.redd.it/3umhkzf5vz7d1.jpeg?width=1154&format=pjpg&auto=webp&s=33ca33f809d696b697ff7c8c10fe17c1aae4e755",
            "How many times can you wear your button-down shirts before you need to wash them?  Is it abnormal that even after a shower, deodorant, working in an office, I sweat enough to have to wash it after the end of one wear?\n\nI hear guys say they get multiple wears but don't know how!",
            "How’s Hollister’s quality compared to Abercrombie? I know they’re sister companies and I wanted to give them a shot to save some money",
            "Hello, can I please get some outfit advice for an outdoor wedding I’m attending this weekend? I have a bad innate fashion sense\n\n#[PICS](https://imgur.com/a/b0HYK4T)\n\nSome info and context: the dark pants are just a dark navy, not black, just couldn’t find any better lighting. The light pants are like a stone color. First three pics are what I had as my 3 primary options.  I also included pics of other pants, ties, belt & shoe options I have on hand. I don’t have to wear a tie and I have pretty limited options as it is.\n\nAdditionally, my girlfriend is a bridesmaid, I’m not in the wedding party. I included her dress. I don’t have anything in my closet that would match, and I don’t have to, but I was thinking I could maybe run out and grab a patterned tie with some matching tones if y’all think it’s a good idea? It’s like a mauve(?) color.\n\nAny advice is much appreciated!",
            "https://preview.redd.it/pocu17ciw08d1.jpeg?width=1125&format=pjpg&auto=webp&s=2a4182894bb989cc64d84be7aa21408773d6f2f9\n\nThe back of this blazer is partially see through. Is this normal? It’s this blazer from SuitSupply [https://suitsupply.com/en-us/men/jackets/light-brown-herringbone-tailored-fit-havana-blazer/C2071.html](https://suitsupply.com/en-us/men/jackets/light-brown-herringbone-tailored-fit-havana-blazer/C2071.html)\n\nIs this a sign of poor quality, poor design, or is this normal and I’m just being nit picky?",
            "Is the suit jacket by Saks fifth Avenue or by Ermenegildo Zegna. I’m looking at a suit jacket and it has a label that says BLACK Saks Fifth Avenue. Then another label that says CLOTH Ermenegildo Zegna. Is just the cloth by zegna and the jacket is made by Saks? Or maybe the jacket is even made by someone else?",
            "https://preview.redd.it/2xben9a9k28d1.png?width=460&format=png&auto=webp&s=a875e12fa77f0eca90f4f6852f512589e31e0b03\n\n# Anyone know where I can find good camp collar shirts with this type of silhouette (ideally long sleeve)?",
            "Anyone knows good accounts for inspo in a more dark/metal/rockstar aesthetic?",
            "Where could I get a white pinstripe similar to what Al Pacino wears in Scarface for ~200-350$",
            "No. As long as you don't buy a Pinterest-blue three-piece suit or some other tacky crap your wedding planner suggested, feel free to wear your suit.",
            "I don’t see how it’s weird  to wear a suit that you happened to get married in.",
            "Depends a little on the suit, but in general I don't see any reason to save it in your closet and never wear it again. It's not like a wedding dress, which wouldn't typically be appropriate to wear elsewhere and which some women save for their children or grandchildren to wear.\n\nOne tip: get really good shoes; you can wear them for future occasions and also have them for the rest of your life.",
            "I can see some people viewing their suit as being very sentimental, but I say wear that shit. I'm getting married next year and that's my plan. No sense in spending presumably a pretty good chunk of money on a great suit and not getting wear out of it. \n\nOne good piece of advice that a salesman at The Armoury told me recently, is that darker, more muted suits are going to be more versatile. If you pick a really unique color suit, especially a lighter colored one, people might know pretty easily that you're wearing the same suit as your wedding. Even then, you could easily still justify it by saying \"who cares\", and just get a really interesting suit anyways, but just some ideas to think about.",
            "I did the same thing and wear my wedding suit for special occasions (including when I officiated my sister’s wedding). Not something I’ll wear into the office, but I want to enjoy it while it still fits.",
            "I think that’s a rumor made up to sell more suits. If you have a nice suit that holds a lot of sentimental value, definitely bring it out for nice occasions",
            "The problem is you don’t really know what your shoe size is. You need to measure your feet on a brannock device. They are found in every store that sells shoes. Even sporting good/sneaker stores and places like Payless or Macys.  If you don’t see it, ask.  \n\nWhen you measure your feet, [read the instructions](https://brannock.com/pages/instructions-fitting-tips) carefully. (Don’t rely on the sales person)  Make sure you line up the heel to ball slider properly. It’s just as Important as heel to toe. Same with the width slider. Take clear photos of both feet in the device. Post here or r/goodyearwelt if it’s still unclear.\n\nThen you will know what size and width you actually need",
            "Red Wing, Grant Stone, Thursday Boots, Allen Edmond, and Alden all make boots in multiple widths, and all of them except Red Wing (though they used too) also make dress shoes if you're also needing (though Thursday doesn't seem to make their dress shoes in wide widths)",
            "It‘s a tailor, so they probably source the shoes from a shoemaker in the area\n\nhttps://robbreport.com/lifestyle/news/slideshow/men-cloth/campagna/",
            "Wait a couple months until the spirit Halloween pop-ups arrive",
            "I'd ask on sewing forums and see if anyone has a pattern for something similar, then you can either commission one or make it yourself. Unlikely you're going to find something like this in a regular, reputable store.",
            "Not great, not super terrible.",
            "Baseball caps and bucket hats are the most \"stylish\" (maybe a straw panama hat with the right outfit) but sometimes you want to prioritize health over fashion. Tilley makes good wide-brimmed hats for when you're hiking or doing yardwork outdoors. Use plenty of sunscreen always.",
            "Second on sunscreen. \n\nA baseball hat is always a classic.",
            "I’d match them  with a return receipt when you head back to the store",
            "They contrast on purpose with anything you'll wear, so keep it simple and neutral.",
            "Basic Bastard guide on the sidebar.",
            "I see what you mean. You can get similar shapes from other brands.\n\nWhen looking for glasses I usually check\n- how does the material feel? (smooth, hard, edgy, soft)\n- how do the hinges feel and work? Do the move easily, do the have some give in them, do they have a spring mechanism, …\n- how does it sit on my head? Is the pressure in some areas, do they move or slide\n- overall quality impression\n\nWith these frames at 199 and the construction of the hinges, I‘d pass for daily wear. Not because they are too expensive for what you get but because I know they won‘t be comfortable over time.",
            "I think they’re pretty awful",
            "You are attacking this backwards. How does the coat look from the front?",
            "Not sure about the upper back, but the excess near the armpits is necessary so you can move your arms. Think of a hugging motion, or trying to grab a handle in a subway train, or moving your arms forward to type on a keyboard. If there's still too much fabric even in those postures, then a tailor can probably take in some fabric at the side seams.",
            "Yeah, that looks perfectly normal. If your pants are slim/skinny cut, you might find a straight-legged jean helps balance out the shirt a bit.",
            "merz b schwanen",
            "Totally field and company culture dependent.",
            "Depends on the country and company. Traditionally light grey is for junior positions. The darker the suit the more senior the position is.\n\nAre we talking C-level director or just fancy job description director?",
            "Kind of bright and shiny. I'd look for a classic navy or charcoal.",
            "I don't wear undershirts with cotton shirts, so they get washed after every wear.",
            "Everyone sweats differently. My wife starts breaking out in a sweat when it’s like 72 degrees out. I get like a little trickle of sweat when I ride my bike to and from work in 90 degree heat over the Brooklyn Bridge. People have asked if I was born with human sweat glands. I tend to get 2-3 wears out of summer button-downs, and it would probably be more like 4 if I didn’t bike.\n\nMy advice here is, your judgment is probably correct and if you’re sweating a lot, you should wash after every wear.",
            "After one day. I would need to steam iron them anyway, so I can just go ahead and wash them.",
            "Undershirts mainly but also Rx Drysol",
            "There’s no difference",
            "Visually the second one with different shoes and belt.\n\nStyling wise probably better to have some light summer dress pants in that color.",
            "It’s unlined, anything darker underneath will be somewhat visible in certain lighting.",
            "Unlined white linen? Yes, that‘s normal.",
            "Yes, Zegna is historically a fabric mill that has additionally built a luxury fashion brand. But they are still a mill",
            "Any recommendations for shoes? I’ve got a few pairs of Johnston and Murphys and Beckett Simonons that I like, but I wouldn’t mind splurging a bit for something like that too.",
            "That’s my plan, charcoal or navy!",
            "I only wear suits for nice occasions anyway",
            "The Brannock device was an iconic and significant thing in my childhood, so I'm taken aback by the sudden realization that people today don't know what that is.  This comment led me to find out how easy it would be to buy one for myself, and it turns out, it would be incredibly easy.  I don't need one, but to have one of my own -- I am seriously considering this.  I blame this on you.",
            "Lol, I appreciate the honesty, but I'd like something well made.",
            "Any suggestions for other casual pants in the $50-ish price range?",
            "lol I know they look funny but actually people liked these a lot when I wore them last summer. Got compliments all the time",
            "I see the post is 7 years old. Is it still fairly appropriate?",
            "Any better alternatives you could suggest? Ideally off Amazon",
            "Perfect pretty much. I have a pretty big chest and the jacket lies nicely. the shoulders are perfect aswel. It has already been taken in. I have a pretty big chest to waist ratio.",
            "Regular neck or v-neck looks better?",
            "Like what kinda shoes and belt, darker, lighter?",
            "Thanks. But who made the jacket? Zegna? Or is it just zegna fabric?",
            "That's not really my area of expertise; I'd make a separate post on here or ask for heirloom-quality shoe recommendations on r/goodyearwelt for to get more answers. You definitely want something resoleable; the Johnston & Murphy's probably aren't.",
            "Crockett and Jones is probably the value pick of the litter and costs for it, but you can definitely find more manageable options from Carmina, Berwick 1707 and others. The real artisan stuff like Gaziano and Girling or George Cleverly is oligarch price point.",
            "Navy in a really nice fabric imo :)",
            "You're going to get more traction on this question in a cosplay or reenactment sub, as capes have not been part of mens fashion since the Victorian era.",
            "Uniqlo, Carhartt, Arket, probably more on sale for some.",
            "The only color I can imagine not clashing with these would be cream/ecru/off-white for the trousers. If you wear shorts, they'd probably be far enough from the shoes to not matter too much.",
            "Check this one: https://malefashionadvice.substack.com/p/how-the-basic-wardrobe-has-changed-de0\n\nI don't know if the new Reddit has the same link.",
            "Clark’s desert boots",
            "Back looks pretty normal- just a steam iron I'd guess",
            "Regular (crew) neck.",
            "Shoes and belts that would fit in with a sportscoat",
            "Black or super dark brown. Quick fix would be to get a good shoe cream and fix up those shoes.",
            "I don't know if Zegna even makes Zegna. But yes, just Zegna fabric",
            "> But who made the jacket?\n\nhttps://www.styleforum.net/threads/who-usually-makes-saks-branded-suits-are-they-worth-buying.294555/    \n \nhttps://www.styleforum.net/threads/isaia-made-saks-fifth-suits.344131/reply?quote=6282003\n \nIt's really hard to tell. Looking in inner chest pockets for a factory tag is usually helpful. Brands are incredibly inconsistent with who they outsource to.",
            "Yeah, you're right. I don't aim to cosplay wearing something like this though, I want to wear it cause it's cool as fuck and I enjoy spitting in the face of modern fashion.\n\nThanks for the help anyways bruv!",
            "Thank you for sharing! I'll read over this. Any other advice for someone trying to dress better?",
            "thanks",
            "Why?  When is the proper time to wear v-necks?",
            "Seems like they still do https://www.zegnagroup.com/en/zegna-careers/teams/production-services/",
            "> I don't know if Zegna even makes Zegna.\n\nYeah they do big time.  \nIf anything I feel like I'm seeing the fabric label less.",
            "You do you, but anachronism and innovation are often very different things.",
            "Sure",
            "Find cool-looking people on Instagram/YT that are about the same size/age/color as you and start analyzing their outfits. Then try putting together an outfit of your own (feel free to improvise in the name of science), look in the mirror and note how you look in it. Did you make it work? If you did, is it something you're comfortable in? If you didn't, can you find the reason why?",
            "Also, buy stuff sloowwwwlllyyy. It’s remarkably easy to buy a ton of stuff that you see people wearing online, only to find out it just doesn’t feel like YOU. Unless you have a drastic reason to throw out your whole wardrobe, buy a couple things, wear them in different ways for a few\nweeks or months and go from there. (Or if you do have an insatiable urge to experiment wildly, hit the thrift stores so that when some things inevitably don’t work you can donate them back without much hit to your wallet.)",
            "Understand that dressing well is not the same as dressing formal. Many people think you must wear blazer and derbys in order to \"dress well\". This is not true, no matter the style you prefer or what level of formality or function or whatever, there is always stuff that fits and matches well and not.",
            "2012",
            "Wear them if you want, but they aren't really on trend right now. Wait a couple years and they may come back in style.",
            "I think he means does  Zegna  actually own the factory or do they sub out the actual production?",
            "I'm wearing it in a punk way, not quite an anachronistic way. Probably gonna litter the thing with paint and patches and take it to gigs.",
            "Any people you recommend checking out to start with?",
            "What stores/brands do you find your buying? What's pretty reliable to get?",
            "Any other advice to dress well? Not looking for anything that formal.",
            "Zegna owns Zegna factories.\nBrands they make clothes for include Tom Ford and Dunhill among many others. The Zegna factory tag is very distinct. They do not only make in Italy, but also Spain and Switzerland.\n  \n  \n\nOften people compare Zegna to Loro Piana because they both do a lot of Fabric Supply. However, Loro Piana’s Ready-To-Wear operation is miniscule compared to Zegna, and they do not do this sort of contracting out in the same volume as Zegna at all.\nLoro Piana was ready-to-wear was once reasonably priced, but LVMH has raised it to cater to that 1%. Zegna’s recent rebranding (they dropped Emergendildo), which also got rid of the Zzegna diffusion line, has aimed to elevate the brand similarly.",
            "@DamienBroderick and @EdgyAlbert are two I follow that have a pretty broad appeal in their looks.",
            "For me? Places like Lands End, J Crew, and American Eagle are staples. Not particularly high quality, but it’s fine. My nicest stuff is actually all thrifted and then tailored.",
            "\"Purchase clothing items with intelligence, put them on with care, then do not care about them at all\".\n\nI.e. Buy stuff that will fit into one or more of your existing outfits/other garments, and that will fit into your style. Then wear outfits, not single items. Ensure all of you look good. And then just be confident.\n\nJust try stuff out. Buy entire outfits off mannequins if you want to stay safe. Then as you try outfits on, think to yourself \"what other pants could I wear that would fit with this, that I do not already have?\". Start thinking about what you're actually using, and what your wardrobe is lacking.",
            "Thank you for the suggestion! I'll look them up!",
            "Used to shop at American Eagle years ago but stopped for some reason. I should check out the other stores",
            "Very new to all this. How do I determine if something looks good as an outfit? I do feel like I'm just picking single items. How do I match and style items?",
            "I’m tall and slim, so I mostly like them because they have really affordable stuff in tall sizes.",
            "Read the basic guides, Google more guides, ask four outfit checks here and in /r/mensfashion. Sometimes you'll be wrong, and it's fine. It's just clothes.\n\nAs for purchasing, look at a stores website for a garment,usually they have pictures which show a complete outfit featuring it. Go try that on, then swap the pants to something wildly different, see what you think about it now.\n\nIt's just a learning process, no-one can just read a guide and become a chef, just like no-one can read an article on colour matching and then have perfect taste.\n\nKeep in mind it's also just aesthetics, fashion, and subjective opinions. Maybe you'll try an outfit now and think it looks great. Then in a month, or a year or two, you'll look back and think \"wtf was I combining\". And that's part of the process :)\n\nWhoever is \"right\" or \"wrong\" is still a matter of opinion. If you think something looks good, then wear it. Just being more conscious of what you wear, over time, will make you a better dresser."
        ]
    },
    "WAYWT (What Are You Wearing This Week?) - 19 June 2024": {
        "title": "WAYWT (What Are You Wearing This Week?) - 19 June 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/malefashionadvice/comments/1djiln6/waywt_what_are_you_wearing_this_week_19_june_2024/",
        "content": "WAYWT = What Are You Wearing This Week (or a different day, whatever).\n\nThink of this as your chance to share your outfits with the community 🧍📷\n\nPeople enjoy knowing where you bought your pieces, so consider putting them in your comment📝\n\n**How to take better pictures** \n\n* Try to use natural sunlight ☀️\n* Use simple backgrounds ⬜\n\nWant to know more tips and tricks? Read the guide [here](http://www.reddit.com/r/malefashionadvice/comments/16rwft/how_to_take_better_self_pics_for_mfa/).\n\n**How to add a picture to your Reddit comment:**\n\n* You can upload on the [Reddit app and website](https://reddit.zendesk.com/hc/en-us/articles/10516331142932-How-do-I-add-images-in-comments-) \n* Or upload your picture to [Imgur.com](https://imgur.com/upload) and copy/paste the link into your Reddit comment. \n\n**Important: Downvotes are strongly discouraged in this thread ❌**",
        "num_comments": 8,
        "comments": [
            "https://preview.redd.it/2kdw8o0hzr7d1.jpeg?width=1125&format=pjpg&auto=webp&s=eb74021a0f0fadd40d8f91684703974b27ca3e0e\n\nMata Nui after Makuta Teridax took over his body and flew back to Bara Magna to finish the job",
            "https://preview.redd.it/9wszf3altj7d1.jpeg?width=1170&format=pjpg&auto=webp&s=a0b38bd3f920c8e64ba09bdcf5a3bfb5632492a8\n\nJust purchased this sports coat for an event this weekend. Any suggestions for shirt pairing? Was thinking solid color since the coat already stands out. Maybe a light blue? Open to suggestions. Thought great slacks would look good.",
            "[https://assets.skool.com/f/dc483cb4b9ed4236b442301fc284c180/d2a8ba14e2ea402aa2562f9a1dfb61314d50f5f6dd3e4bda92e6cdae3a083834-md.jpg](https://assets.skool.com/f/dc483cb4b9ed4236b442301fc284c180/d2a8ba14e2ea402aa2562f9a1dfb61314d50f5f6dd3e4bda92e6cdae3a083834-md.jpg)\n\n[https://assets.skool.com/f/dc483cb4b9ed4236b442301fc284c180/72705eee142d4b7d924a85b3e72ff1b1521aa6694e794c00afca632aef03f7ef-md.jpg](https://assets.skool.com/f/dc483cb4b9ed4236b442301fc284c180/72705eee142d4b7d924a85b3e72ff1b1521aa6694e794c00afca632aef03f7ef-md.jpg)\n\n[https://assets.skool.com/f/dc483cb4b9ed4236b442301fc284c180/d2d7d93ed6004926bab7cf2008a4a6bb3f98d683c3c54ad6957f491d6dd53150-md.png](https://assets.skool.com/f/dc483cb4b9ed4236b442301fc284c180/d2d7d93ed6004926bab7cf2008a4a6bb3f98d683c3c54ad6957f491d6dd53150-md.png)",
            "I’m looking to style a summer outfit with some jeans, army style cargo pants or shorts, t-shirt or any light top, belt, shoes, and socks. I’m trying to go for classic 50s look. Need help with suggestions and which site to use - in hopes that it would be a one stop shop.\n\nSo far I’m working with just 1 pair of denim - Fullcount 0105xx wide fit, and for shoes - paraboot Michael’s and that’s it.\n\nI’ve heard amazing things about Whitesville, Warehouse, and Real McCoys t-shirts! Unfortunately, not all websites Cary them all and hardly any have them in stock. Same goes for cargo pants- I’ve heard the Real McCoys OG 107, and the Buzz Ricksons Poplin trouser or orSlow have great army style green pants! Any thoughts on these? Unfortunately the Real McCoys is sold out in my size -34 to my knowledge. The Buzz Ricksons I don’t know how I feel about the Ties on the bottom of the pants in case I may need to roll them up due to length being an issue.\n\nWhat belt would you recommend for both denim jeans and the cargo pants?\n\nWhat about socks?\n\nWhat about some vintage looking shorts?\n\nShoes? I’ve heard PRAS and Pottery are awesome! Any others? Hopefully they don’t look and feel like a basic Chuck Taylor’s.\n\nMaybe a backup denim pair to be different than my Fullcount 0105xx?\n\nAny other T-shirts you recommend other than the ones I mentioned above?\n\nAny other piece of garnet im missing?",
            "I'm looking for the best men's body spray brand that keeps you smelling nice and fresh, controls sweat all day long, and also offers an underarm roller?",
            "A blue, a pink, or a purple will all complement this jacket.  You can also try neutrals like a brown. For something more risky you can try a mustard yellow. \n\nIf you’re keeping it informal, keep it unbuttoned at the top. But wearing a tie can add another color to round out the outfit and elevate the look. Depends on the event.",
            ">Any other piece of garnet im missing?\n\nReading glasses? This is in the wrong thread."
        ]
    },
    "Why are mens shorts designed with pockets so shallow your phone wallet and keys fall out?": {
        "title": "Why are mens shorts designed with pockets so shallow your phone wallet and keys fall out?",
        "score": 125,
        "url": "https://www.reddit.com/r/malefashionadvice/comments/1dlntb0/why_are_mens_shorts_designed_with_pockets_so/",
        "content": "\"What can fall out, will fall out.\" Why are pants allowed to have good secure pockets but not shorts?\n\nPants go to the ankle, shorts go to the knee so why the heck do the pockets on shorts have to be made so your phone especially falls out so easily ? The pockets on shorts should be just like pants.\n\nSmartphones, which are mobile phones with advanced computing capabilities and connectivity beyond basic voice calls and text messaging, began to gain popularity in the early 2000s.\n\nBut even flip phones fell out of the stupid pockets they put in shorts.\n\nThis has been going on for 30 years now.\n\nWhy when the stupid shallow pocket design on men's shorts is universally hated and everyone carries a phone now why won't they change it?",
        "num_comments": 91,
        "comments": [
            "A lot of people ask, \"Why? Why would you treat the customer this way?\" Why? Because fuck 'em, that's why!",
            "Are you wearing hotpants?",
            "I think we can flip this question around. why are you buying shorts with shallow pockets?",
            "You bought it brother.",
            "All my shorts have been find and this is the first I've heard of this. What kind of shorts are you wearing?",
            "Are you wearing women’s shorts?",
            "I haven't really had issues with shorts tbh",
            "Just wait till you see women’s pockets..  can’t even for chapstick in those",
            "The only short I came across this issue is like legit running shorts. Not gym shorts but daddy hoochie 2 inch inseam running shorts.\n\nAre you using an iPad mini as a phone?",
            "Massive conspiracy by the Big Purse lobby, trying to make man bags a thing for the extra billions in revenue",
            "As someone living in an Asian country getting Asian sized clothing, I too see a lot of shorts with small pockets. And I buy a lot of shorts. Got a sling bag for my wallet and phone because of it. A plus is it’s safer when I go to places with pick pockets",
            "In the last 2-3 years short shorts have also began making way and becoming more popular for men again, which does therefore mean shorter pockets as well to keep with dimensions.\n\n Look at brands like YoungLA and Kulani Kini for example, all the men’s selections for shorts and swim shorts no longer go to the knees, but sit well above it actually.",
            "Complaining about pockets? Dude, that is women’s fashion bullshit. Return the shorts and buy shorts with better pockets. Or get shorts with zipper or button pockets. This is a solved problem for men. \n\nJokes aside, I don’t even know where I could go to try and find shorts with small pockets if I wanted them.",
            "Have you ever looked at pockets in women's clothes in the past 40 years? (Probably longer) /fashion design is not about utility.",
            "What kind of shorts are you buying?",
            "I buy lots of shorts from sportswear brands if they have zip pockets. If it’s zipped my phone stays in.",
            "Buy a pair of Patagonia shorts. Deepest pockets I’ve ever worn, I’d go as far as saying too deep. ",
            "Zipper pockets man \n\nNothing ever falls out  if they are closed",
            "scrimping on pocket lining fabric.",
            "Google cargo shorts. Enjoy your new life",
            "ZIPPER POCKET GANG REPRESENT \n\nMy Keyes are right where I put them!",
            "Smartphones are getting ridiculously bigger which is one main reason. Smaller the pocket smaller the cost for the manufacturer. It’s why I bought an iPhone mini. It’s just so convenient to carry around. I did actually just by jeans from m&s and I was pleasantly surprised how deep the pockets were. What a nice surprise!",
            "I ran into this problem for the first time ever in my 40 years of life. But it was on a pair of pants from H&M I got from TJ Maxx. The front pockets are like half the normal depth. It makes no sense! \n\nBut to OP, I think you are buying weird shorts because I’ve been never had this happen ever before. It sounds like you might be looking at women’s shorts as they are traditionally the ones with tiny pockets.",
            "Ask the people who design women's clothing because a lot of times clothing comes with faux pockets, which to be honest, doesn't make any damn sense.",
            "This is why, I like Cargo Shorts from time to time. But yeah, this is a good question. Not to defend people who make crappy shorts but part of it might be a consumer thing where shorts represent a bit of \"not caring\", \"loose\" and \"free\" so pockets barely get any thought except just to \"put them there\" and be done with it. Who goes out in actual shorts expecting durability?",
            "Damn bro, where do you shop at? Haven't encountered this problem in years.\n\nMy go-to shorts these days are thes Uniqlo workout jawns. The pockets are pretty okay.",
            "That’s because you are purchasing low quality clothing.",
            "Never had this issue but also it is true that mobile phones have gotten extremely big nowadays",
            "Only my Reebok gym shorts do this. Every other pair is fine ",
            "Contact clothing manufacturers and bitch about it. You have a great point.",
            "Dude bought a mini iPad sized phone",
            "It's generally the first thing I do after putting them on. I put my hands in my pockets. If I don't like it, I either don't buy it or send em back.",
            "cargo shorts, easy fix.",
            "Rgt Fatigue shorts",
            "I have shorts with a 5 inch inseam where the pockets are so deep, they sometimes stick out. Which is worse. Tbh, I wish the pockets were about an inch shorter",
            "Did you by chance...buy women's shorts?",
            "I’ve never had this problem. Get yourself some cargo shorts!",
            "You can other who work in fashion production to confirm it \n\nBut part of it is Less fabric used In the production and an few centimeters per garment adds up quickly and allow factory cheat off millions",
            "Uhh.... They aren't? And shorts to the knee are definitely off-trend at this point, but that's personal taste. The pockets on my 5\" inseam shorts are still huge. Never worn a pair of shorts I couldn't stuff my phone, wallet and keys into a single pocket of I actually wanted to.",
            "They arent, your phone is just too big. What you are describing has never happened to me. Maybe your shorts are way too small",
            "Cargo shorts, or get one of those Uniqlo \"geared\" shorts. Timberland and North Face have some good ones. Also Decathlon.\n\nGotta shop right to get the good ones. There're a lot of em if you look properly.",
            "Thank you for defining \"smartphones,\" had no idea what you were talking about until that.",
            "wear cargo shorts. Dont have this problem.",
            "The Global Ankle Wallet Cartels of Hong Kong pay off the pants designers to redirect sales to them.",
            "Finally!  Someone is asking the real questions.",
            "I used to say this about girl shorts never men’s lol shi* is like Mary Poppins bag",
            "> Smartphones, which are mobile phones with advanced computing capabilities and connectivity beyond basic voice calls and text messaging, began to gain popularity in the early 2000s.\n\nDid ChatGPT write this post?",
            "i bought an expensive fanny pack for this reason and never looked back (don't ask me what brand)",
            "My problem is normally shorts with pockets to feel that everything dangles and slaps when I walk.",
            "I am guessing you mean inseam pockets that open vertically along the seam making it easier for stuff to fall out when you sit.",
            "Do you not have a satchel?  /s...\n\nHaving said that I bought shorts at Muji yesterday that have nice deep pockets.",
            "That, combined with the fact that shorts prices are absolutely extortionate and costs more than pants at times makes it more infuriating",
            "It's not the length of the pocket it's the shape of them. Pants do this to when they have pockets angled like shorts. The more vertical angle of the opening and the pockets being shaped at an angle instead of vertical is the root cause most of the time, excluding cases where the material just doesn't hold shape like in basketball shorts and etc. \n\nThey do this for asthetics. It looks better.",
            "You're buying the wrong shorts. Most all of mine don't have this issue. Uniglo shorts are my go to.",
            "I don’t experience this with my shorts.",
            "It’s probably from a design perspective. Pockets can “take away” from the clean silhouette the designers are going for. Plus, extra fabric means more cost so that usually is the first to go when trying to cut on costs. Probably the same reason women also don’t get pockets in their clothes",
            "You should know there are some shorts now with special pockets only for securing phones. The plain old shorts you are talking are maybe continuation of the old design when mobile were not much prevalent.",
            "Cause you're supposed to have your girlfriend carry your stuff in her purse. That's what I do.",
            "Because we buy them",
            "Gotta get a European carry-all. Solves all your pocket problems.",
            "LMFAO THEY WEARING CARGO SHORTS IN THIS SUB 😭😭😭🤣😂🤣😂🤣😂🤣😂",
            "\"Guess what homie? I AM the manager.\"",
            "^ Pop Copy training video in action",
            "They fuck you in the Drive Thru",
            "Right? There’s so many choices out there that do not have this problem, just go with quality shorts? Even then I’ve never had a problem with cheap brands",
            "Yep. I am not insane, pocket depth is the first thing I check.",
            "Seriously, quit buying shorts with Terri le pockets.  O'Neil and under armor make some of my favorite shorts, good pocket depth and some even have zippers...",
            "Idk he has a point. Only three pairs of my Jean shorts actually have good pockets and then cargo shorts have good pockets, any other short I have has the worst pockets that are so small I can’t even hold a double a battery in them without it popping out when I sit down. Forget a wallet that shit doesn’t even fit. Every pair of sport shorts I have that’s meant for either tennis or basketball also has the shortest pockets in the world. My hands don’t even fit in them.",
            "I have a weird suspicion he might be buying women’s shorts and hasn’t realized it",
            "Do women's shorts even have pockets?",
            "Same, even the swimming shorts I've had have deep enough pockets. Can't remember ever having to specifically check if the pockets are deep enough.",
            "They’re often not even functional, just jetted pockets that are stitched shut and have no pocket underneath",
            "He’s prob wearing 5” inseam shorts and has a 5-6” long phone lol",
            "As a bonus they protect you from pickpockets, who are seemingly more and more common in festivals and crowds these days",
            "Came here for the shorts, stayed here for the jawn.",
            "Came here for the shorts, stayed here for the jawn.",
            "Excuse me, that's European men's leather carry-all.",
            "I learned from the best.",
            "Okay? Okay? Okay?",
            "Name a brand that you bought that has shorts with big enough pockets?",
            "What? Tennis shorts are meant to stuff a couple tennis balls in, how do yours have no pocket space?",
            "Where are you from? Basketball shorts have some of the largest pockets… Also, unless you’re working or something, cargo shorts aren’t flattering on anyone and actually make you sweat more due to the extra fabric. If you need to carry that much stuff, then just get a cross body bag for men.",
            "Sometimes. Sometimes they have sewn over flaps.",
            "My Galaxy Ultra fits in the pockets of my 5\" J.Crew shorts just fine.",
            "J. Crew, Land's End, Uniqlo, Nike, Adidas, Vuori, Chubbies, Patagonia...",
            "J crew, Nike, under armor, birddogs, gap, Reebok, adidas, brooks brother, prl, and legitimately every other brand of short I’ve ever purchased but can’t recall of the top of my head",
            "Fuckin Anko aka Kmart has big enough pockets including all the other comments. I’ll chuck in Gazman too, never had an issue",
            "i have never purchased shorts with shallow pockets. i always thought that was a womens clothing issue",
            "I have literally never had shorts with tiny pockets",
            "Ladies have to deal with so much bullshit in the pocket department."
        ]
    },
    "➡️ Daily Questions ⬅️- Post simple questions such as Outfit Feedback, Clothes ID, and Recommendation requests here!! - 20 June 2024": {
        "title": "➡️ Daily Questions ⬅️- Post simple questions such as Outfit Feedback, Clothes ID, and Recommendation requests here!! - 20 June 2024",
        "score": 20,
        "url": "https://www.reddit.com/r/malefashionadvice/comments/1dkf87c/daily_questions_post_simple_questions_such_as/",
        "content": "Welcome to the Daily Questions thread for all things related to men's fashion.\n\n**Types of questions this thread is great for:**\n\n* Clothing or footwear recommendations 👞\n* Outfit feedback and advice 🧥\n* ID'ing clothes from pictures or screenshots 🖼️\n\n**Want a more helpful answer?**\n\nThe more information you give, the better response you'll get. Try including:\n\n* Budget in numbers 💲 and location 🌍\n* A screenshot of any clothes from a video 🖼️\n\n**How to add a picture to your Reddit comment:**\n\n* You can upload on the [Reddit app and website](https://reddit.zendesk.com/hc/en-us/articles/10516331142932-How-do-I-add-images-in-comments-)\n\n[add images to your comment on Reddit's app and website by clicking the add-image button](https://preview.redd.it/et77qtnc6wpa1.png?width=1161&format=png&auto=webp&s=e6965cbf5d04bd279b3b8673c5472b90a9f0785d)\n\n* Or upload your picture to [Imgur.com](https://imgur.com/upload) and copy/paste the link into your Reddit comment.\n\nIf you're looking for more in-depth information then check out our [style guides](https://www.reddit.com/r/malefashionadvice/wiki/guides) 🛍️, [item guides](https://www.reddit.com/r/malefashionadvice/wiki/itemguides) 👔 and [recommendation threads](https://www.reddit.com/r/malefashionadvice/wiki/itemguides#wiki_item_suggestions_at_each_price_point) 📄.\n\n# The [MFA Discord](http://discord.gg/malefashionadvice) is also open for questions in the [\\#questions-and-advice](https://discord.com/channels/1116793467654381685/1116794518415622154) channel!",
        "num_comments": 106,
        "comments": [
            "I'm going to an ocean-side wedding this August and I plan to wear a sage green linen suit. It will be a new color/material for me and I'm looking for suggestions on shoes that will pair well (light brown? white? loafers?). I'll probably pick a shirt that is white/oatmeal/tan.\n\nI don't think this is rocket science but It's a departure from the suits I wear a few times per year for work (shade of blue wool). \n\nAny suggestions/considerations would be appreciated.\n\nI believe this is the jacket of the suit I've ordered:\n\n[https://www.menswearhouse.com/p/tommy-hilfiger-modern-fit-suit-separates-linen-jacket-tmw-3ygt?CAWELAID=120259610001914221&adtype=pla&product\\_channel=online&product\\_click\\_id=TMW3YGT43335&store\\_code\\_id=&gad\\_source=1&gclid=CjwKCAjwps-zBhAiEiwALwsVYfqwX8OsAl8vIMIbebKyGnelSbiuI8DKTmwZ\\_0k8avR37PyNAGq\\_GBoCAX8QAvD\\_BwE#color=sage%26size=43%26length=long%26](https://www.menswearhouse.com/p/tommy-hilfiger-modern-fit-suit-separates-linen-jacket-tmw-3ygt?CAWELAID=120259610001914221&adtype=pla&product_channel=online&product_click_id=TMW3YGT43335&store_code_id=&gad_source=1&gclid=CjwKCAjwps-zBhAiEiwALwsVYfqwX8OsAl8vIMIbebKyGnelSbiuI8DKTmwZ_0k8avR37PyNAGq_GBoCAX8QAvD_BwE#color=sage%26size=43%26length=long%26)",
            "https://preview.redd.it/67avp8bm6r7d1.jpeg?width=1000&format=pjpg&auto=webp&s=3193a5ad214575d2442dc93d652145739d864e39\n\nID on this exact boot??",
            "Kind of in a pinch for a work event next week. I kind of wrecked my good blazer this week and the only thing I have is a suit jacket but the pants haven’t been hemmed yet so I have to wear it with other pants. I would think most people can’t tell the difference between a blazer and a suit jacket, right? \n\nYeah I know, I need more blazers and it’s on the list just haven’t gotten around to it.",
            "Hey!\n\nI want to simplify my wardrobe and looking to replace all my t shirts to one single color and make it a capsule wardrobe. I’m down to navy, charcoal and white, which t-shirt color looks best on me? Thanks!",
            "Yo how do you lads dress shirts? I live in Canada and feel like I can layer well and dress for pants consistently but shorts I always feel like I look goofy or the same fit just works better with pants but I get way to hot so I need to wear shorts in the summer. How do y'all put fits together ?\n\nMind you I'm a slightly larger guy I wear a large to XL t-shirt and wear a 34-34 pant",
            "I am looking for comfy/bouncy shoes that are smart enough to wear with, say, cords and a jacket for academic smart casual style. I currently wear running shoes as they are lightweight and bouncy and help with a long-term problem with my leg by reducing the impact of my feet on the ground. I guess the EVA midsole helps that. But I'm not sure where to look for something smart enough that is also comfy and bouncy and reduces impact. Any recommendations welcome!",
            "https://preview.redd.it/e3gddy42dr7d1.jpeg?width=620&format=pjpg&auto=webp&s=737d71e1173df2b0552e7a4f7ee331a8520a27e8\n\nCan anyone help me identify the shoes Timothee is wearing in this Vanity Fair video for Dune 2? Thank you in advance!",
            "I have heard so much online about rules and etiquette of buttoning a sport coat, you know that way it goes, top button closed when standing, unbuttoned when sitting, a man standing in an unbuttoned spot coat looks like slob, the silhouette of a walrus yada yada yada\n\nI saw this link posted here earlier [https://thesecondbutton.com/sneakers-with-tailoring/](https://thesecondbutton.com/sneakers-with-tailoring/) over 90% of the images have guys are wearing either jackets or sport coats unbuttoned, and they look great.\n\nI'm aware that the style is casual not tailored but still. I feel like I have been gaslit into feeling self conscious if my jacket is momentarily open. Am I on my own here?",
            "Outerknown Utilitarian Pant vs their Field Pant. What’s the difference?",
            "I'm looking for recommendations for a sub-$300 lightweight down jacket.  I'm planning a trip to Japan in January and half of my trip will be spent in Hokkaido, the other half in Tokyo.  I will probably need a very warm jacket for Hokkaido but Tokyo doesn't get as cold as where I currently live at that time.  I want something I can pack away, won't take up too much room, is versatile, and is very warm.\n\nI was kind of thinking about the Reigning Champ Taffeta Warm-up jacket, but I'm curious if there are others.",
            "Can anyone ID the pants the model is wearing here: https://imgur.com/a/SKg9c2w\n\nThe photo is from a product page on Mr Porter, but the agents couldn't help ID the pants:\nhttps://www.mrporter.com/en-us/mens/product/our-legacy/clothing/plain-shirts/boucle-shirt/1647597310235926",
            "[https://pretavoir.co.uk/products/tom-ford-brady-tf1018-30a?variant=42674852429995](https://pretavoir.co.uk/products/tom-ford-brady-tf1018-30a?variant=42674852429995)  \n[https://pretavoir.co.uk/products/chopard-sch-f24-700p-polarised?variant=41263478407339](https://pretavoir.co.uk/products/chopard-sch-f24-700p-polarised?variant=41263478407339)\n\nWhich should I get my dad? He has a big head with big features. Do the chopard look too sci-fi/unique or the tom ford too macho?\n\nShould I get him something more simple like this? [https://pretavoir.co.uk/products/tom-ford-dashei-02-tf0996s-28a?variant=42289771053227](https://pretavoir.co.uk/products/tom-ford-dashei-02-tf0996s-28a?variant=42289771053227) Thank you.",
            "Anyone got an Id on the jacket Glen is wearing in this video? \n\nhttps://youtu.be/AiyJZBc3b7g?si=njHYzTGauuV_V5IB",
            "Can someone help me locate a shirt like this? I have similar one from Uniqlo but smaller stripes/less space in between. Thanks.\n\n￼​\n\nhttps://preview.redd.it/dmabu5m6st7d1.jpeg?width=1170&format=pjpg&auto=webp&s=f4b14186b20849d7fc3c238fce9093187dfcd954",
            "I like casual looks and I learned that the sport coat is the most casual, then a blazer, and then a suit.\n\nI’m looking to buy some sport coats used on eBay. However in almost every listing and title it says blazer, sport coat, suit jacket. How am I supposed to tell if it’s a sport coat? They all look similar. And if I accidentally bought a blazer or suit jacket instead of a sport coat, would it look bad with jeans and sneakers?",
            "I'm 30, 5'10\"/5'11\", about 260lbs and have been struggling most of my adult life to find some jeans, casual pants (khaki/chinos), and dress pants that fit well. I currently experiment with either 42 or 44 waist but I always seem to have an issue where the front of my pants tend to bulge around the front of my waist/crotch area. It is most apparent when I start to walk or sometimes with dress pants in a seated position.\n\nI've tried slim fits in the past but from a comfort perspective, they're not the best. Typically, I have to go towards athletic or relaxed fits. Any recommendations on what I can do for a better fit? It's starting to feel like getting pants altered is my only other option.",
            "https://x.com/Rap301_/status/1803578666015953404\n\n\nPlease ID the jacket yall 🙏",
            "hey guys. im looking to buy similar pants as this photo of Tom Brady  [https://ibb.co/y4ZtXTw](https://ibb.co/y4ZtXTw)\n\ntryna rock the same outfit to my friends wedding. any help would be appreciated",
            "So for folks who live outside of cities like LA (so I guess I mean NYC, and maybe Chicago) are we all just purchasing clothes online and returning 50+% of the items that don't fit, aren't the quality/color we expected, etc? Do we do shopping travel trips? 😂   \n  \nPrior to the pandemic there were a few men's clothing boutiques that carried decent labels, with enough variety to mostly get me by. Now I find that I can find very little locally. There are a few targetted shops (a denim/workwear shop, a casual clothing shop, a place that sells $1200 Loro Piana sweaters, etc...) I'm just making orders on Todd Snyder, Octobre Editions, SKU, Hiroshi Kato, Japan Blue, Corridor, Asket, etc...  This requires a lot of return logistics to manage.  \n  \nI'm curious what folks strategies are for folks living in larger metro areas, but lesser shopping cities.",
            "i know this is a generic question. But i have never shopped at nordstrom before. from my understanding, its just a rack full of \"thrift\" style clothes? but not really thrift?\n\nI got couple nordstrom giftcards. i was wondering what is some good generic pieces (including shoes) that I could buy to add to a \"basic\" style wardrobe. (maybe even some business casual/formal)",
            "What are some summer jacket that works with black and blue jeans and a denim shirt. Should i go for a denim jacket or a some type of overshirt?",
            "I moved somewhere (Seoul) where fashion is a big deal and dressing sloppily gives a bad impression, in almost all parts of life. I'm from the US West Coast tech culture where what you wear barely registers. But now in Seoul I'd like to go to some events (professional and social) and meet some people in professional settings where I know I can't show up with my usual shredded jeans, runners and out-of-pants slim shirts.\n\nAt the same time, while I appreciate fashion, I personally really don't have time or the inclination to do any research or shopping about the subject - at all. So what's the money/time tradeoff hack? Can I hire someone to tell me what would fit me, what I need, and shop around for me?\n\nExample:\n\n* Many professional events here require dressing up in suits. I don't have any. Don't even know how to pick one.\n* Many social events have dress codes, and the dress codes change and I can't parse them. Like yesterday one was described as \"summer impressive\". What even is this?\n* Just going to the coffeeshop sometimes feels like going to a fashion show.",
            "https://preview.redd.it/ofzs1295dw7d1.png?width=4973&format=png&auto=webp&s=a88e790ebc2891ade71057e911fdfe6a9943e70d\n\nAnyone have recommendation on bright casual shirts like these?",
            "My shoulders are quite broad for my weight, I'll try on casual jackets/coats that otherwise fit perfectly but are way too tight on the shoulders. I usually end up sizing up\n\nAs a result, most of my jackets/coats end up loose or baggy around the waist\n\nThere's no decent tailors in my area. Are there any modifications I can do at home to tighten the waists up?",
            "Hello there\n\n\nMale 45 years weight around 120 Kg. I currently work and live in a tropical country. I usually wear cotton trousers or a jeans and cotton T-shirts. I never carried a bag on a daily basis.\n\n\nMy every day carry used to be my phone, my wallet and my keys which I kept in my trouser pockets.\n\n\nI need a small bag to carry my EDC plus a small notebook (A5 or A6) and a pen.\n\n\nI was thinking about a crossbody bag but I feel it will make my breasts appear larger. Do you recommend it or do you suggest any other options?\n\n\nThank you.",
            "[deleted]",
            "I recently bought a final sale suit. I think I may have messed up slightly by getting a 42R instead of a 42S. The main thing that I think is a little out of proportion is that it feels a little long in the body. Is it worthwhile to go to a tailor about shortening the suit?",
            "[removed]",
            "I'm visiting California and I'm from Ohio - I find it really important to try on clothes before I buy\n\nWhat good brands in California should I check out? I like to shop in the $20-80 range for shirts for example. Vuori is one place on my list",
            "https://preview.redd.it/6ljt4uo0qy7d1.jpeg?width=1242&format=pjpg&auto=webp&s=d675338c9e26a44ae8db50798af904e08e573eec\n\nAny feedback on this outfit?",
            "Need some help getting style for office. I’m 6’ 2” with a somewhat lanky build. I work in a bigger corporate office located in Maine. I want a more “edgy” look, not the typical button down tucked into slacks with leather shoes look. Still has to be work appropriate though. Any specific outfit advice or even just stores to shop at would be helpful. I feel like I struggle mostly with summer/warm weather outfits. I’d be willing to spend $500-$800 for a few solid outfits (a pair of shoes, some pants and tops)",
            "Hey guys so I really love wearing graphic tees. I hate the way plain tees look on me. But, I also want to get away from being a walking billboard. Is there some sort of middle ground? I was thinking of getting more striped t-shirts, but I want more variety than just that.",
            "https://preview.redd.it/qsz0j3vn528d1.png?width=3024&format=png&auto=webp&s=e7a145280298d892451a5e02ef0320dcd444dab3\n\nIs this appropriate for a wedding? Dress code is local semi-formal to formal attire while the woman are wearing formal dresses. What do you guys think?",
            "Hey all. I'm going to a wedding a week from today. It's a noon wedding, and the climate in my country is really hot (around 30C or 86F). Would it be OK to go to the wedding with black chino shorts? I know for a fact that if I go with a long pair of pants (jeans or regular chinos) I'm going to be sweating my ass off, but wanted to get advice from you guys as well.",
            "I wear sweatpants everywhere cause they are comfy and the ones I get are 100% cotton so natural and stretchy, but I have always hoped to find something slightly less warm but preferably still fully natural materials and stretchy and soft.  I have searched a lot but all I find is golf pants and chinos and etc. which is not the aesthetic I go for, I want to look and feel cozy and not like a businessman or teacher (no offense to that aesthetic, just not for me).  So any help in finding cozy pants that aren't super warm like sweatpants would be lovely, and extra bonus points for belt loops cause it would be AMAZING to have cozy soft pants with belt loops for a little bit of utility.  Closest I've found to what I look for is old medieval pants but haven't found any good brands or sellers of that and through research the ones I've found aren't great.\n\nIn short:  I want something cozy like sweatpants and made of natural fibers, but not too warm and not in the style of \"professional\" pants like golf pants or chinos",
            "Brown loafers or derbies would work, and they have the added perk of being versatile with other outfits. I have a sage linen suit and pair it with a light blue, light-weight Oxford but oatmeal would look good too.",
            "It’s a 6 eye chukka so I would just search around until you find one you like that’s  within your budget \n\nAlden makes one",
            "Getting a pair of pants hemmed is very basic - ask if they can turn it around in a day.",
            "What colors are everything?",
            "If the fabrics and texture are close, you can sometimes pull it off. That said a tailor should be able to rush a hem job it just might cost you extra - a while back one tailor let out and hemmed pants in under 24 hours because I was leaving town for work, but it cost me $60.",
            "White",
            "It's going to depend a bit on your skin tone.  If you're layering with other colors, you'll want to think about how a one color base interacts with those too.",
            "> I always feel like I look goofy\n\nYou don't.\n\nJust wear shorts. I don't what else to say",
            "Check out this piece from [the second button](https://thesecondbutton.com/sneakers-with-tailoring/) for inspo - my gut says go with new balance.",
            "Possibly \n\nhttps://www.ssense.com/en-us/men/product/enfants-riches-deprimes/black-square-toe-frankie-boots/15654821",
            "I think jackets look fine unbuttoned while standing. Menswear influencers (and hobbyists who take fit pics) are especially likely to keep them unbuttoned for fit pics because it allows them to show off the full outfit better, including any layers underneath.\n\nThe only big rule to worry about is never buttoning the bottom button, in my opinion.\n\nI would also say if you’re standing up before a crowd in a professional setting and speaking for any length of time, you should button up.\n\nAs far as “silhouette of a walrus,” a tailored jacket that’s buttoned can definitely help mask the wearer’s shape a bit, if applicable. But nobody in that blog post really has a belly.",
            "There are rules and there are rules - personally I’ve never felt beholden to the “always button when standing,” but currently most of my coworkers don’t wear a coat and tie. When I worked in a more formal setting, I made sure to follow the norms more closely.",
            "Well this rule is still taught but I think I never met anyone under 60 years old that cares about buttoning the jacket. You would need to be in a very strict environment to care",
            "Field pants has \"Articulated knee for easy movement with a slightly tapered leg from the calf down.\" Looks like it has internal drawstrings too.\n\nUtilitarian Pants has side tabs",
            "Patagonia Micro Puff",
            "Unfortunately you really gotta try on sunglasses to know what will look good. Personally I would favor either of the Tom Ford ones you posted but no one can say how your dad will look in them.",
            "https://lealfre.com/collections/shirts/products/wide-stripe-oxford-shirt",
            "It's confusing because these days almost everyone is using all of those terms wrongly.  Very useful video explaining what the words actually mean, and it comes with visuals to illustrate the differences:\n\n[https://www.youtube.com/watch?v=8Pq11EFwl70](https://www.youtube.com/watch?v=8Pq11EFwl70)\n\nHe even mentions the eBay listing confusion within the first 50 seconds!",
            "Only the top 1% of menswear nerds, and I mean the real deal kings of the nerds, differentiate between a sport coat and blazer \n\nEven run of the mill menswear nerds use the terms interchangeably. \n\nDon’t worry about eBay keywords,  they’re useless. Just avoid orphan suit jackets and you’ll be fine.",
            ">How am I supposed to tell if it’s a sport coat? They all look similar.    \n\n\n  \n\n  \n  They don’t, the nuances are what differentiate them- Permanent Style, Sartorial Talks, the Armoury and other resources have good articles. \n>And if I accidentally bought a blazer or suit jacket instead of a sport coat, would it look bad with jeans and sneakers?    \n\n\n\n  \nYes",
            "Fabric, pattern, pockets, buttons.\n\nAn orphaned suit jacket has worsted fool fabric, no or a very subtle pattern, flap pockets and buttons that match the fabric.\n\nThe most casual sport coat is made out of rough wool or not wool at all, has a bold pattern, patch pockets and contrasting buttons.\n\nThings in the middle can be both, but if you can't tell if it's a suit jacket or a sport coat (like, it's a tweed or seersucker jacket), then no one else will care either.",
            "Folks on eBay are fans of confusion because they are looking to make a sale, including things like orphan suit jackets which are hard to wear.",
            "They're white pants. It's hard to tell from the photo if they're cotton chinos, but that would be my guess--they don't look like linen but could be some kind of polyester/poly blend golf slacks. The challenge with these is finding a pair thick/opaque enough that the pocket bags don't show through to the outside.",
            "Knowing your measurements and comparing to use charts should really lessen ~~tunes~~ returns  to almost 0.",
            "When I'm in a city with some good boutiques, I check them out and at least note which brands I'm interested in. Read descriptions very carefully before buying anything, check the item measurements against your own clothes, and look for any other red flags or details you might not like.\n\nBut yeah, be prepared to return anything you don't love; it's not that hard. I'd only order a couple of things at once so you don't have to keep all the different return policies straight in your head.",
            "Do you mean Nordstroms Rack? \n\nEither way I don’t understand the “thrift style” reference",
            "It's more like a Marshall's or TJ Maxx--name brands selling some surplus from previous seasons and some lower-quality items made specifically for outlets like this. Some of the brands are pretty decent for the price, others are mediocre. They have all kinds of stuff, go and look around but don't assume everything there is going to be an amazing deal.",
            "Just to be clear, there's Nordstrom and there's Nordstrom Rack:\n\n[https://www.33rdsquare.com/demystifying-the-differences-a-deep-dive-into-nordstrom-vs-nordstrom-rack/](https://www.33rdsquare.com/demystifying-the-differences-a-deep-dive-into-nordstrom-vs-nordstrom-rack/)\n\nThe first one is a high end store selling designer merchandise at full retail, the latter is (as mentioned here already) a discount store like TJ Maxx or Marshall's and sells unsold inventory and outlet items and that kind of thing.  They both offer gift cards, but it looks like they might be interchangeable and a gift card for one is honored at the other?  I don't know that for certain so don't take my word for that!  Anyway, you'd get a lot more stuff for your money at a Nordstrom Rack.\n\nIf you want to get a sense of the kind of merchandise they have on offer, you can visit (and even order from!) their website:\n\n[https://www.nordstromrack.com](https://www.nordstromrack.com)",
            "Putting in a tiny bit of effort will have a much larger return than you think.\n\nI don't know much about Korean fashion, but I imagine some half decent shirts and a jacket or two will probably get you 80% of the way there.\n\nPay attention to the guys around you and try to copy what they are wearing. Pick one thing from each so you aren't copying their whole look.\n\nAlso shoes punch above their weight for the perception of how well you dress. Get some nice stylish shoes and they'll do a lot of the heavy lifting.",
            ">Can I hire someone to tell me what would fit me, what I need, and shop around for me?\n\nI don't know what's available in Seoul, but you can hire a stylist or personal shopper. They're expensive and still usually require a fair investment of time and active effort on your part, though.\n\nThe salespeople at most decent stores can usually pick out a few outfits for you based on your needs and help tell you what looks good but you'll still have to decide if you want to purchase them, and of course you're limited to what's available in each store you visit.",
            "Why don't you get these ones?",
            "You can get a sewing machine and learn to do simple alterations yourself. Taking a jacket in at the waist isn't too advanced.",
            "Are you attending the ceremony or just the reception afterwards? If you're going to the church ceremony I'd wear a jacket with a non-button down shirt and tie. Bear in mind it's common for the men to take their jackets and ties off once all the wedding photos and speeches have been done.\n\nIf it's just the reception, wear more or less what you want as long as it looks nice.",
            "It doesn't hurt to take it to a tailor and ask, but if you need it shortened too much the pockets can cause difficulty with that.",
            "100% what material? How do the care tags say to wash them? Generally OxyClean is pretty safe but I don't use it unless necessary to get out a stain or whiten a dingy white shirt. You are more likely to damage your clothes by using too much heat or too much agitation in the washer/dryer than by using OxyClean.",
            "Most of the mall brands will hit your budget",
            "I feel like in the $20-80 range, there isn't much in California that you won't find in Ohio",
            "Imo definitely not, unless maybe you know for a fact it’s an extremely casual affair. Linen would be an obvious choice, but otherwise, wear the thinnest and loosest pants you have. If you’re sweating you won’t be alone.",
            "Are weddings usually attended in your country in beach attire? If so, sure",
            "No way",
            "Joggers.  They're cut like sweatpants but made out of a lighter twill fabric so they're cooler and more breathable.  I bought a pair of these because they had belt loops and a zipper fly but looked like they'd be more comfortable than regular trousers when sitting for hours in an airplane seat:\n\n[https://www.amazon.com/dp/B07F2N4671](https://www.amazon.com/dp/B07F2N4671)",
            "Maybe something like an easy pant in linen?",
            "Uniqlo or Cos have lots of options for what you are describing",
            "Thanks. Suit jacket is dark blue. I have several different shirts & pants to pair with it. I won’t go with a similar color blue pants as that would look weird.",
            "Thank you!",
            "Ok thanks. But how do I avoid orphan suit jackets? Someone said I need to look for patch pockets, patterns, different color buttons, single vent. It’s pretty hard to wade through tons of eBay listings and find these things. I really just don’t want to look bad by accidentally buying an orphan suit jacket to wear with jeans and sneakers. I don’t care about every detail",
            "Lol I can't picture Tom Brady wearing polyester",
            "Any suggestion on what type of pa s",
            "It’s true, I’m working on it. Although for a lot of garments, I’m somewhere between a small and a medium and want to get the right fit. Same thing with denim and pants, depending on the maker my waist is 29-31.",
            "I’m trying to slowly add brands to my like/good fit list. I do miss having boutiques or labels I can visit in person and feel like I’m walking through my future closet.\n\nI have to jump through some hoops right now to try and get a pair of jeans back to Japan that were supposed to be straight fit, but are quite skin tight.",
            "He means for $10",
            "[deleted]",
            "Fair point. I would want to get it shortened maybe 1-1.5 inches max, but I'll ask.",
            "(See edit to original comment.)",
            "(See edit to original comment.)",
            "Hey, thanks for the reply. The bride told me that although there is no official dress code, she'd like the guests to come in somewhat colorful outfits. Now, my wardrobe is very limited (I am a newbie at this MFA thing) and assume that I have no suits (and as a university student, no money to afford one as well). Any chance you've got suggestions for an outfit that might work?",
            "Gray pants.  It will be fine.",
            "Patch pockets are the most important thing to look for aside from fabric/pattern. Tweed, corduroy, linen, cotton are more likely to be wearable as sportcoats/blazers than smooth wool. Buttons can be swapped and idk if anyone really notices the vent too much. \n\nOne thing you can do is post pictures of some outfits you like and people here can give you some keywords to search for; or post pictures of jackets you find on eBay and we'll tell you if they're orphaned suit jackets or not.",
            "What do you think his uniform is made out of?",
            "That’s why you have to know your measurements and ignore sizes",
            "Like ac said, know what measurements fit you best. For shirts, typically I look for chest measurement first and foremost. Then shoulder and length. Then sleeve length. Remember that length and sleeve length can be altered by a tailor. \n\nFor pants, I look for actual waist measurement and thigh firstly, then inseam, then leg opening, and maybe rise. Inseam can be altered easily, as well as leg opening to an extent, but other alterations are tricky and usually not worth it.\n\nPick out some clothes that fit you well already, and measure them so you have something to compare to. If the site you're buying from doesn't provide exact measurements, sometimes I try googling that exact item to see if another website has those measurements listed.",
            "Yeah, personally I wouldn't order from another country unless I absolutely had to. If I can't find a US-based boutique or distributor to order from I'd probably pass on that item.\n\n\"Straight fit\" doesn't mean much; you want to look at the actual measurements of the item in the size you're ordering. If they don't provide them, message their customer service and see if they can.",
            "You don’t want to wear a tie without a jacket",
            "If that's what other people in your industry or social crowd wear then it's probably a safe bet. A mustard yellow tie would work well against a navy suit or blue shirt. Get 3 or 4 ties with different colours and patterns. Small dots or stripes are safe. Then yellow, dark red, navy are all classic colours.\n\nIf you want to start being more fashion conscious, you could try a knitted tie which has a coarse woven texture and adds a lot of visual interest to your outfit. Keep your shirt tucked in with a tie and make sure it's long enough to fall roughly in line with your waistband.",
            "There's a certain amount of risk involved with anything, but I think you'll be good. I'd just follow the normal precautions for any expensive clothes: Wash on the delicate cycle with the coldest water available. Dissolve the OxyClean powder in some water at the bottom of the machine first before adding your clothes. (Honestly if you're really worried you can hand-wash it in the sink and rinse well.) Hang to dry. Only wash one of these shirts at a time until you're sure they turn out ok. Like I said above, the heat/water/agitation is more likely to harm them than the OxyClean.",
            "I would say a button-down shirt and non-jean pants are the absolute minimum to not be disrespectful (unless, like someone else said, you’re on a beach). Cheapest option? Thrift. After that, probably fast fashion and mall places like Old Navy or JC penny (edit: or whatever the equivalent is wherever you are.)",
            "Thanks! Light grey OK with a dark suit?",
            "[deleted]",
            "Great. I’ll give that a go, one at a time.\n\nWhat I had done with the white shirts had been to mix a tub of hot water and the oxyclean and let them soak for about 12 hours prior to cleaning. I had done this because I had heard that the oxyclean needed heat to activate.\n\nI will do as you have suggested and ramp up the intensity as needed until I am satisfied with how they look or I have ruined one of them. :|\n\nThanks!",
            "If that’s what you have it’s fine.",
            "Jacket and no tie would be preferable to tie and no jacket but jacket+ tie would be better than either of those.\n\nYou're probably going to be somewhat underdressed in anything less than an actual suit though, so it's just a matter of how comfortable you are with that fact. The bride and groom will be too busy to notice/care, and other guests will be more forgiving if you are particularly young or struggling financially. No one's going to kick you out though, so it's good manners to dress as well as you are able--what that means is up to you.",
            "[deleted]",
            "Navy",
            "[deleted]",
            "[deleted]",
            "Yeah, navy would look good with that."
        ]
    },
    "‘Tech guys are hot, actually’: Nerds are seeking fashion glow-ups": {
        "title": "‘Tech guys are hot, actually’: Nerds are seeking fashion glow-ups",
        "score": 0,
        "url": "https://sfstandard.com/2024/06/17/fashion-zuckerberg-style-techie-hoodie-allbirds/",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Speaking as somebody in tech, they’re mostly not lol\n\nThere’s definitely a subset of tech bros that embrace fashion but for the most part it’s the stereotypical guy who only wears clothes he’s gotten for free from the numerous startups he’s been at",
            "We have a guy at work that occasionally wears black sneakers, tuxedo pants with a button up and a black suit jacket. What kind of style is that?",
            "lol yep here’s my theory: my company gives me a TON of free swag shirts and hoodies. It’s really bad because it doesn’t incentivize me actually go out and buy stuff for myself, made even worse my closet is already full.",
            "One of the pics in that article is a before and after that literally is just “she put him in a plaid button up with matching sneakers” and I think that’s an incredibly funny bar to set",
            "I’ve got like 30 shirts from my company but I only wear them to sleep or the gym. They’re not exactly cool and I don’t particularly like advertising for a corporation. But I’m hardly a paragon of MFA either. I mostly just wear practical and comfortable stuff since I work from home. Uniqlo, Lululemon and the like. I used to put a lot of effort into how I dressed when I was single and college aged, but now I just want to be comfortable and not have to think about anything too much. Maybe the result of getting older and devoting what little time I have to other hobbies.",
            "Yeah I think what happens is the tech guys that embrace it are also more likely to step out into other social circles. So those are the tech guys that most other people may be familiar with",
            "Yup. Got a buddy who’s an L5 that wore nothing but his startup shirts until he met a girl that dressed him up.",
            "I've been in tech for 20 years and actually find people dress normally, maybe it's a europe thing",
            "Yeah agreed. There's a lot of people actually fulfilling the neckbeard basement dweller stereotype.",
            "Does he live in the sewers of Gotham and eat raw fish?",
            "Tuxedo Bitmask.",
            "That and you become a walking billboard for them.",
            "I have a rule about swag tees. Wear once at the event it was printed for. Then never in public again. \n\nThis is made easier by how bad I usually look in them.",
            "Yeah this is a pretty lame \"glow up\". The before fit is arguably just as solid as the after fit.",
            "The thought process of a 14 year old who wants to dress better:\n\n\"Well people with button ups look nice\"\n\n\"But that would be too formal\"\n\n>Plaid shirt it is\n\nHonestly it really doesn't even look that good.",
            "It's a Europe thing",
            "The last time I got a swag tee I literally took it home and just cut it up into bike rags haha"
        ]
    }
}