{
    "Fine dining. Here is your side of ketchup.": {
        "title": "Fine dining. Here is your side of ketchup.",
        "score": 501,
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1dlmkny/fine_dining_here_is_your_side_of_ketchup/",
        "content": "Very minor and petty but funny.  \nWorking at a super fancy high-end restaurant in fine dining, the level of communication between the front-end staff (bartenders, servers, assistants, food runners, etc) is incredible. We want everything that is needed to come to the table at the same time, and we don't want to ask a guest the same question twice.\n\nFor example with beverages, if a table is drinking all kinds of various beverages and you happen to walk by and notice one is low, the correct course of action is actually to not go up to the guest to ask if they'd like another because at that point you don't know what they're having. The guest has already told the establishment what they're having so going up and saying \"what did you have again\" detracts from the experience. I know this seems minor but the correct course is to find the assistant, or the server, or pull up the table in the POS and see, so that when you do go up and ask the correct questions, \"would you like another Old Fashioned with extra <blah blah blah>\" or whatever, specifically naming the drink and modifications.\n\nThe same can happen even for a side of ketchup or aioli. The basic process will be, \"was it supposed to come with it and kitchen/expo forgot to put in on the plate?\", or, \"did the guest ask for it and the server forgot to add it in there\", or, \"did the guest just decide to order it later and we just need it asap\".\n\nNormally when the food is dropped off the person in charge is supposed to ask if everything looks okay and if they can bring anything else.\n\nEnter our guest Bob.\n\nBob has already been asking for his water and tea to be refilled when it was still above the threshold for us noticing it (when it was like 70-80% full), and would flag down multiple people until it got refilled. No big deal, one assistant would grab a pitcher and refill, while another assistant would grab another pitcher and see that the glass was full and just walk away. Same thing for lemons. This became annoying.\n\nBob sees his steak and fries which came with an aioli (as shown on the menu) but he wants ketchup. No big deal. Small request. He asks the person dropping off the food. It is communicated and noted and will be out shortly. Next, the assistant comes to offer beverage refills. Bob asks for ketchup. It is noted. Next, the server does a visual quality check and Bob asks for ketchup. You can see where this is going. This all happens in less than 2 minutes if that long. Bob ended up asking 4 separate people for ketchup, and given the urgency of bringing out a side after food has arrived, all 4 people end up congregating in the service area to put tiny little porcelain ketchup pour cups onto silver serving dishes. Now each one of those cups is designed to be shared by 2 people. So, the conversation begins,\n\n* Food runner: hey, what are you guys up to? I'm grabbing that ketchup for Table 12 Seat 2\n* Server Assistant: oh, that's funny, I was also going to grab a ketchup for #12 seat 2\n* Server: funny, they asked me for it too and I was running over here to grab it\n* Another server: oh hey I got flagged down by Table 12 to grab a ketchup\n\nso.... enough is enough.. the guy clearly wants ketchup....\n\nWe decided all of us would give the guest exactly he asked for. So, in all glory, all 4 of us come back out with our silver serving trays and everything, one at a time, each giant silver serving tray holding just a single side of ketchup, dropping off 4 separate ketchup dishes, 15 seconds apart. Bob realized what he did once he got enough ketchup for 8 people. We left all the ketchups just sitting there throughout the entree course. Of course this was not unnoticed by other guests who very humorously asked funny questions and if that's how Bob eats his steak. We made sure that the ketchups were the very last things off the table before it was time for dessert. He barely used a single one.\n\nAt the end of the day Bob did not leave hungry, the guests were not un-entertained, and neither were we.\n\nTLDR; guy asked 4 separate people for ketchup, all 4 people brought out a side of ketchup, one after another. Bob got 8 people's worth of ketchup.\n\n\\[edit\\] grammar, details",
        "num_comments": 55,
        "comments": [
            ">He barely used a single one\n\nbecause he could not catch up",
            "It is [**deja vu all over again**](https://www.reddit.com/r/MaliciousCompliance/comments/1dj84nt/i_can_definitely_get_that_sauce_for_you/)!",
            "This is a Bistro Huddy bit.",
            "My 9 year old would’ve been in heaven with that much ketchup!",
            "\"and for dessert tonight's special is a baked cheesecake with a fruit puree, however for you sir we can swap it out for tomato sauce.\"",
            "So his ketchup was inexh-sauce-tble?",
            "There is Disney restaurant\\* that will bring you ALL the bottles of ketchup to your table, if you ask multiples time.\n\nThey counted 22 bottles on their table by the time the servers were done.\n\n  \n\\* Whispering Canyon at Wilderness Lodge\n\nThey also just throw the napkins and straws on the table.",
            "Why are you just copy pastaing?\n\n[https://new.reddit.com/r/MaliciousCompliance/comments/1dj84nt/i\\_can\\_definitely\\_get\\_that\\_sauce\\_for\\_you/](https://new.reddit.com/r/MaliciousCompliance/comments/1dj84nt/i_can_definitely_get_that_sauce_for_you/)",
            "Hilarious.  It reminded me of the one time I told a joke about waiters and spoon to a large table of fellow coworkers at a work event dinner at a restaurant.  By the end of the night I felt like I had half the restaurant's stock spoons by my plate.  They thought it was hilarious to keep bringing them unbidden.",
            "“Do you want me to box that up for you?” (gestures at ketchup)",
            "I would not have expected steaks and fries and aioli in the category \"fine dining\". Or ketchup.",
            "I hope Bob had a sense of humor, otherwise this whole farce is a tip-killer.",
            "Lmao, was it at least in-house ketchup??",
            "Fine dining = steak and fries? Really?",
            "Sorry if your intention is a fine dining experience, then anticipating and already having on hand what a person needs to finish their meal before it gets cold should be automatic and done with graciousness. Don’t really consider fries to be fine dining but if you’re serving them as a menu option, that’s an acknowledgment people like them, it would make sense also to acknowledge people enjoy ketchup up on them as a standard. \n\nFrom your description there’s a basic understanding of one aspect of understanding fine dining, but sounds sort of like you’ve missed the part where the staff should basically have impeccable manners and decorum. Any story about malicious compliance is likely incompatible with fine dining. You basically turned this man’s table into a common restaurant.",
            "People will do this at my restaurant as well, as they’ll ask every person who works there for a box to go and somehow don’t realize that asking ONE person would have been enough",
            "I guess that sort of behaviour is to be expected of someone who enters a high dining establishment and then asks for friggin ketchup on his steak. xD",
            "High end restaurants, ketchup? I cannot compute that part. *Struggle in French*",
            "As someone who enjoys dining out, I would consider a customer asking for ketchup to be up there with a fork on the level of importance. As in: I want to eat my food right now, but I can't because I don't have everything I need to enjoy it. Sitting in a restaurant with food in front of you that you can't eat is probably worse than waiting for the food to come out in the first place.\n\n\nI'm other words, if I were a waiter I would consider ketchup to be a request that needs to be fulfilled ASAP. Every second the customer doesn't have ketchup is another second they're watching everyone else enjoy their food while being unable to enjoy their own.",
            "So wasteful. :(",
            "Sooo.. communication is noticed by the guests that you don’t talk to one another, you’re populating the table with extra dishes, you prioritize other things than delivering something immediately… he is obviously paying a lot and the fact that four of you had touched his table without dealing with his simple side request??\n\nAlso as far as your drink preferences are concerned.. “may I get you another” and then reference the tab/server instead of having to go through that bullshit. \n\nIf you’re serving ketchup you’re not that fine dining.\n\nDo you serve from the left, clear from the right? Do you do complete clears? Does everyone swarm the table at one time? \n\nKetchup screams you are not fine dining.",
            "In my experience if I hadn’t asked after this first time it never would have came.",
            "Worked at a fine dining restaurant and someone asked for tomato sauce (ketchup), I told him \"We don't serve tomato sauce\", he replied \"WHAT KIND OF RESTAURANT DOESN'T HAVE TOMATO SAUCE?!\". I replied, \"the type of restaurant that doesn't serve tomato sauce\" and walked away.",
            "So a bunch of dicks work fine dining. Give ma a food truck or sandwich shop over fine dining anytime. \n\nRidiculous amount of money to pay for a meal. Could probably eat at home for week what you pay for fine dining.",
            "You're a saucy one!",
            "I see what you did there.",
            "My thoughts exactly",
            "Deja Poo you mean?  where you are sure you have seen this s#!t before?",
            "Damm near a copypasta",
            "Same here but, possibly, the previous post reminded OP of this incident.",
            "Right? I'm imagining this happening to me (as a grown-ass adult, though with ranch dressing instead of ketchup), and I'm just thinking it's amazing. (I would, however, have specified to each subsequent person that I'd already asked a previous person for said condiment side.)",
            "That joke was condiment to be.",
            "Actually they do it if you ask just once. The story goes the timeframe the restaurant exists in never had ketchup (although BBQ sauce does for some reason) so when you order ketchup they make a big deal about it because it's not supposed to exist. The first table to order gets all the bottles brought by the servers and after that if you have the bottles you're supposed to run them all to the next table. Rinse and repeat. \n\nEverything in Disney parks have a backstory about why they're there or why they happen.",
            "I was just thinking to myself, didn’t I just read something very similar to this the other day?",
            "I guess it may seem that way because this isn't the **only** time this sort of thing has happened **ever**.  \nWhen repetitive things happen over and over, it's likely they'll be posted here more than once. Jumping directly to the conclusion of copy 'pastaing' is a bit accusatory though, don't you think? where did i get all that extra detail?",
            "He did. We asked him if he wanted ketchup with his dessert. We laughed about it at the end. Bob got every single thing he asked for during the dinner, literally, haha.",
            "I feel like higher end restaurants can handle anything. I ate at a few Michelin 3 stars and they really work to make sure all your needs are met",
            "This is very accurate. A simple side of ketchup or sour cream or whatever, whether expected or not, can take higher priority than most other things as not having it is actively preventing the guest from eating the food which is getting cold. This is why in this case each and every person went directly to grab it themselves regardless of their role, who has the table, etc.",
            "I mean this is a MaliciousCompliance sub after all... but let's explore....\n\nThe food runner came from the kitchen, received the request, acknowledged it, and went to go get it.  \nIn the meantime the server assistant was just filling up waters in the section and visited the table next. Does that mean the assistant can't go back to the table to fill up waters until the ketchup has arrived? The runner is already running it. The waters are unrelated.  \nThe server was near the table, saw that the food had arrived, saw the food runner, and went to the table to visually check if everything else arrived, looking for eye contact for anything else.  \nAnother server happened to pass by some time later.\n\nAvoiding a table because one of their requests hasn't been filled yet is a very rookie mistake and indicative of a fundamental lack of understanding that it's okay to approach a table while a request is still being processed in order to perform other tasks unrelated to that request. I don't think you get high-end fine dining.\n\nCould you imagine the chaos if every time a guest had a small request like that it had to go up and get communicated with the server first? What if the server is busy talking to another table? What then? Do you wait and make the guest wait? No. What if you can't find the server? Do you go hunt for them or the manager? No. And if you succeed, what then? Does the server ring it in? The expo call it out? The food runner run it? These support systems exist with the ability to and do things outside of your section and/or responsibilities with the guest's best interest in mind, so that simple requests can be completed in a timely manner.\n\n>Also as far as your drink preferences are concerned.. “may I get you another” and then reference the tab/server instead of having to go through that bullshit.\n\n\"Having to go through that bullshit\" is exactly what high-end fine dining is. There are so many staff members visiting the table already, it's in the best interest to not interrupt and ask a questions if the guest has already answered them. This is why we go \"through that bullshit\" of keeping track of what each guest is drinking to see if they'd simply like another or if a drink menu should be brought out without the guest having to ask for it. Keeping track of seat numbers to not auction off things. Each guest already told you what they want, no need to ask them again when it arrives.\n\n>If you’re serving ketchup you’re not that fine dining.\n\nWe don't. And if that's how you judge a restaurant then you won't understand. But we don't say no to guests either, so we keep it. We have a lot of things we don't usually serve just in case. Pretty sure there is a Sriracha sauce at all times too. There have been cases where we'll send someone out to go get something from another restaurant or store or whatever just to make it happen.\n\n>Do you serve from the left, clear from the right? Do you do complete clears? Does everyone swarm the table at one time?\n\nOf course, but liquids are served from the right. But, most importantly, we cannot backhand a guest. What matters is which hand you use. You cannot serve a guest from the left with your right hand. It is considered rude. We also serve ladies first and keep track of that which makes it fun for the Expo to call out which plate to put in which hand, so that when the runners arrive at the table they have the correct plate in each hand. 1 person per 2 plates. 1 person per soup with tableside pour. We also call out the seat numbers backwards for big tables so that by the time the first runner makes it to the last seat, everyone behind them has arrived at the same time as well. Each time a clear happens, the entire table is cleared and remarked with appropriate silverware for the next course.",
            "The key thing is to always mention you've already asked someone. If my waiter is on break, etc, and a different one had asked if I need something like a drink refill, when the waiter assigned to me area comes by asking if I need anything, I make sure to state I'm still waiting on a drink I asked the other one for; I *shouldn't* get two that way, and if one *had* forgotten, it's discussed amongst them and resolved.",
            "If you think the value isn't there, then you wouldn't appreciate the experience, and would not understand this joke, and that's okay. We all love food trucks and sandwich shops too. I'm not sure how that would translate, but could you imagine yourself going up to 4 separate food trucks to ask for the same side, and then all 4 of them make it?",
            "How were they dicks? By giving him what he wanted?",
            "Yo Cat! 'Sup?",
            "This seems to happen way too frequently... So creative swapping ketchup for ranch! /s",
            "Deja Moo: different day, same bulls#!t",
            "Chat gpt?",
            "I used to work at some high-end places as a sous chef, and I still can't believe that award comes from a tire company. Brilliant marketing, though.",
            "But ketchup isn't a side/sauce you will encounter by default.\n\nIf someone asks they will try to accommodate, but it won't be normal condiments.\n\nMaybe its a common thing in the US(?) as ketchup is a far more common condiments, but in France/Spain it might be on some kid menu (even if nowadays it's more likely to be a smaller portion menu with a few dishes removed than a true kids menu)",
            "This is exactly the point. You can't just keep asking every single person you see for the same request that hasn't had a reasonable amount of time to be processed.",
            "It really was a brilliant idea! Someone thought it up in 1900 and here we still are!",
            "In the US, ketchup is ubiquitous. I never asked, but I’m certain they would’ve had it. Ate at Le Bernedin, Alinea, Per Se, and Eleven Madison Park. They really work to take care of you",
            "Right! I mean, to get to those restaurants, you have to put more miles on those tires!"
        ]
    },
    "Enjoy your dirty, urine odor reeking classroom!": {
        "title": "Enjoy your dirty, urine odor reeking classroom!",
        "score": 707,
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1dlj0yk/enjoy_your_dirty_urine_odor_reeking_classroom/",
        "content": "I work at a daycare as a lead teacher for two year-olds. My hours are 8:30am-5:30pm. I usually clock in between 8:20 am & 8:25. I end up clocking out 5:40-5:50. My last student is picked up at 5:30 (latest time allowed) without fail. \n\nMy duties once the children leave are: disinfect and sanitize the restroom & classroom(can’t be completed when kids are present because of the chemicals),empty & take trash to the dumpster from classroom and restroom, empty disinfectant, sanitizer and water pitchers to return them to the kitchen daily, sweep the floors and vacuum the carpet. \n\nAround 4 today my supervisor texted & wrote that I’ve worked OT again based on the times I listed above and to ONLY work from 8:30-5:30 pm\n\nIn order to comply with the timeframe he mandates, I had to leave the classroom without cleaning, sweeping or vacuuming. I only had time to take out the trash. \n\nBut most importantly I clocked out at 5:30!",
        "num_comments": 71,
        "comments": [
            "This may - and should - come back to haunt the supervisor.",
            "Please tell me your supervisor will be the first one in the classroom in the morning - not you!",
            "Lemme just say as the parent who got off at 5 and picked up just barely in time every day at 5:29:  I really appreciate you.  Even just as a step dad you really made my shit possible for a couple years, and I never took your patience for granted.  Thank you.",
            "Make sure to text your supervisor later in the day Sunday to let him know that you complied with his request to be out of there at 5:30, and since the last child pick up wasn't until about that time, there wasn't time to clean and all, but you did manage to take the trash out. Then you have it in text that you followed orders and that you let him know that things were left undone so he can do them Sunday night or early Monday morning. Be specific about it being at his request that you leave at 5:30 and that you couldn't leave children unattended. It covers your butt in future reference.",
            "I know plenty of people who have worked in daycare. They expect you to somehow watch the kids, prepare meals, give medications, change diapers and clean up puke, and keep the place clean all at the same time. And don't make any mistakes or forget anything either. All for usually low wages.",
            "fallout?",
            "My friends story.  \nShe is a teacher at a Nursery and is degree qualified and certified to run the whole place.  One of her duties included opening up and hour before class starts, switching everything on, getting the classrooms ready and then greeting the parents and taking charge of the children as they arrived.\n\nThe boss decided that during that hour she was not 'teaching' and so they were going to cut her wages for that period to minimum wage.\n\nThe next morning she turned up to school in time to start her first class and found a crowd of angry parents milling around the empty locked building, all now very late for work.\n\nIt took until lunchtime for her wages to be fully reinstated.",
            "Keep that text!",
            "Honestly, I wouldn't have taken the trash out. I would have started cleaning the surfaces and stopped at 530. Dirty diapers left overnight have that extra special pungency. 🤢",
            "Be glad you have that in text. Don’t delete it!! They will be yelling at you for not cleaning on Monday.\n\nI would have left the trash, cleaned something else instead. Smell value lol",
            "Put the trash and full buckets in your supervisors office",
            "Had to be sanitized when the kids weren't present, interesting...\n\n\nI worked at a preschool/daycare place for about a year. We had a \"food safe\" sanitizer of some kind that we could use while they were in the room. I know one teacher that added soap to it because they were pretty sure it was just water. I was so sure it was just water that, if pressed, I'd have considered putting some in my mouth. And I say that because we filled them ourselves. There was a machine in a usually-locked room that took concentrated cleaner and diluted it with water. Theoretically anyway. In a year there, I don't think the volume of said chemical went down at all. Which is odd, because we had at least 7 rooms with their own cleaning bottles that were each refilled at least once or twice a week, so even if the chemical was really really diluted you'd probably expect it to have gone down...and one other teacher mentioned once that they thought the director dialed down the amount it would dilute, so. I personally think that place wasn't properly sanitized at any point lol...so glad I'm not there anymore. Quit about a month or two after we were furloughed for covid, because they tried to recall us when it was getting worse. And if we weren't sanitizing well, then yeesh. Horrible place.",
            "I am struggling to understand who some who has the important job of looking after children, is expected to also perform the important job of maintaining a sanitary environment at a daycare centre. It sounds like a total lack of respect for both professions.",
            "UpdateMe!",
            "Given that you’re likely a mandatory reporter, wouldn’t you have to report your failure to clean to some sort of childcare licensing board for your state/city? Clearly explaining that you didn’t do so because management made it clear you were not to work past 5:30?",
            "Surely you have cleaners who come, round like in every other school out there?",
            "Give us an update on Monday, I'm curious what this supervisor will say to you.",
            "**UpdateMe!**",
            "Update me",
            "Weird post",
            "I mean the kids will most likely suffer the consequences here, so seems like the sort of thing you wouldn't want to leave to petty revenge / malicious compliance. One of those kids gets sick from unsanitary conditions, and you'll be enjoying a lawsuit more than a write up from your boss. I don't really understand how these things work or play out, but it seems like something you should resolve with a mature conversation rather than a knee-jerk response due to a text.",
            "Indeed and it’s not like I have a co-teacher where one of us can monitor the children while the other cleans. \n\nMaybe the supervisor will start cleaning the room because I’m certainly not working off the clock. I actually just made it in time to take the trash to the dumpster.",
            "Yes. I think he arrives most days at 7:30 am. But why do you ask?",
            "You’re quite welcome.",
            "Thank you for this excellent advice. He actually texted me 2 hours after I left work today with an unrelated question. All I could think of was how ironic that was. \n\nI didn’t respond because, ya know, “work hours are 8:30am-5:30pm” so my response will occur on my way to work on Monday which I still feel is gracious.",
            "They truly do. And we’re also responsible for emotional stabilization, soothing and behavioral management of children as well.",
            "Op will be punished for skipping important duties by doing them unpaid.",
            "We await with bated breath",
            "We won't know until Monday.",
            "The result will be an unclean daycare, oh well",
            "fall in?",
            "Kudos to her! This particular job is actually a part of me exploring the teaching occupation. \n\nI’m educationally very overqualified for this position which I would never verbalize to anyone unless asked. I managed people for decades in my primary occupation so I know what is correct. I’ve actually shadowed employees to get a sense of what their actual daily duties are if I had questions about time management. \n\nAs far as this supervisor, these are his rigid time rules and I will adhere to them.",
            "Taking the trash out was more for me because the room was odorous & I don’t want to start my day out nauseous on Monday. The other smells will be enough. \n\nAnd it was really the only task I had time for before the mandatory clock out time.",
            "I am. I’m sure it was sent by him for documentation purposes as well.",
            "Luckily I can smell the sanitizer & disinfectant chemicals BUT at my prior workplace the director tested the bottles with chemical strips after they were made to ensure the ratio was correct. \n\nThis supervisor definitely doesn’t do that.",
            "In our daycare, there is a cleaning service coming in after the last kid is out.\n\nHowever, the daycare workers still sweep the floors, vacuum, and clean surfaces after their shift. That means this place is cleaned 3x during one workday. It's still never pristine, as they allow the kids to be outside as much as possible...\n\nEdit: at least not when kids are in there.",
            "https://www.reddit.com/r/MaliciousCompliance/s/kDF55BWKg8",
            "Doesn't mandatory reporting only cover negligence that causes harm, and abuse (of any kind)?\n\nA classroom not being wiped down and the trash not being emptied wouldn't count as negligence.",
            "Not at all. Imagine my surprise too. \n\nPrior to this I worked at a another type of program that was for students ages 5-11. We had a cleaning crew that came in every few hours to restock items, tidy restrooms & take out any garbage. They also did the closing time cleaning after the students and I tidied up & swept the room. \n\nThat facility was close to pristine. Professional cleaners make a huge difference.",
            "No daycare I ever worked at had a cleaning service.",
            "I sure will.",
            "I will message you next time u/No-Treat6624 posts in r/MaliciousCompliance.\n\n[Click this link](https://www.reddit.com/message/compose/?to=UpdateMeBot&subject=Update&message=UpdateMe%21%20u%2FNo-Treat6624%20r%2FMaliciousCompliance) to also be messaged. The parent author can [delete this post](https://www.reddit.com/message/compose/?to=UpdateMeBot&subject=Delete&message=delete%201dlj0yk)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/UpdateMeBot/comments/ggotgx/updatemebot_info_v20/)|[^(Request Update)](https://www.reddit.com/message/compose/?to=UpdateMeBot&subject=Update&message=SubscribeMe%21%20u%2Fusername%20r%2Fsubreddit)|[^(Your Updates)](https://www.reddit.com/message/compose/?to=UpdateMeBot&subject=List%20Of%20Updates&message=MyUpdates)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=UpdateMeBot%20Feedback)|\n|-|-|-|-|",
            "https://www.reddit.com/r/MaliciousCompliance/s/kDF55BWKg8",
            "Weird comment",
            "Weird comment",
            "He verbally mentioned a week ago that I should be able to have the cleaning duties completed by 5:30 pm. Now he followed it up via text. \n\nThe mature conversation was had. The reaction was deliberate based on the direct commands of the supervisor.",
            "Because I was hoping that he would be the one to suffer the consequences of his ridiculous decision to prioritize overtime spending over a clean and healthy classroom. He should be the one to walk into the dirty, smelly classroom in the morning - not you!",
            "That made me smile. I think I would wait until punch in time to reply to his latest text. Give an inch, they take a mile. And his rules are his rules! :)",
            "My son is at an amazing daycare facility here in rural Northern Germany.\n\nEvery day, he just zooms into his group's room, and doesn't even care to say goodbye to us. He sometimes stops to pat his friend on the back, but most often he just goes straight to the breakfast nook, and takes his seat there.\n\nWhen we pick him up, he's coming for us with the same fervour. Straight into our arms, and big cuddles until he's satisfied. Then he waves the workers goodbye.\n\nOn Wednesday, he had a rough day somehow, and just woke up before we picked him up. He was getting a new diaper as we walked in, so we chatted with the workers for a moment. For once he didn't zoom towards us, but towards the boss (who also takes care of the kids on afternoons, it's a daycare with two groups of ~15 kids each). She hugged him, and explained to us how they cuddle each day after he woke up, and apparently even when we were available, he wanted to at least get some of those hugs in. She sounded a bit apologetic even because of his blatant favouritism.\n\nBut for us it was alright. She takes care of him up to 7h/5 days a week. They have a relationship with each other, albeit professional on her side. Yet he's allowed to like her.\n\nWhile we talked, another worker was cleaning the group rooms in the background, while another played in their ball pit with the other child who was still there.\n\nYou can tell they all are pretty relaxed about their job, and it shows in the tenderness they show when handling young kids.\n\nAll I want to say is:\n\nThank you for being there for a kiddo who might see you as one of the constants in their life. Thank you for choosing to take care of them over cleaning duties.\n\nMy son is 18 months old now, and if he wants to cuddle, I prefer someone who gives him a hug over someone who ushers him away.\n\nYour boss is stupid nor valuing that.",
            "The Department of Labor will enjoy hearing about that if so.",
            "Oh yep.  Putting a worker in an impossible situation like this is usually an attempt to get them to work off the clock without telling them to.",
            "\"Bated\"? Dangit I just bought this handful of worms.",
            "Don't wanna be your monkey wrench",
            "Well that's pretty unrealistic of him to expect. Sorry you're going through it. Also, didn't mean to imply that you hadn't already had a mature discussion with him, but from your initial post it seemed like that text was the first time it had come up.",
            "Thanks! And I had more than normal diaper & pull up changes today. The room was even more odorous. The smell will be there Monday along with residue and particles everywhere. \n\nParents will be elated!",
            "The reality is going to be that OP deals with it in the morning, and maybe even gets a write-up for failing to do work duties, as the general cleaning is very likely to be in a childcare worker’s contract. \n\nWhen you’re meant to do it, given the kids overstay right until the teacher is meant to leave, isn’t something they’ll care about when giving the warning. It’ll be something like “well, the schedule says goodbye time is 5:00pm, so you had thirty minutes” even though they allow pick-ups as late as 5:30pm. ",
            "Reply only after you are at work, and only when you are not on break. If you get a write up complain to union, or labour board, that you got written up for not working unpaid overtime to clean, when you are prohibited from cleaning when children are present, and also prohibited from working any overtime as well. Let the boss try to explain that one, which they most likely will not enjoy. Then when the retaliate complain again about being victimised for reporting labour offences.",
            "ensure you get him telling you only work from 08:30 to 5:30 on record, in an email, something.  It'll he his word against yours.",
            "This is the way.",
            "Do not want to be your socket wrench",
            "Thanks. No worries",
            "Even if they fire her, they will have the same problem with the  next employee, unless they find some chump willing to work off the clock.",
            "Perhaps, but there might be a write up for the overtime as well. OP can’t win either way, it seems. And this way the supervisor doesn’t, either, at least this one time.",
            "It's right there in the OPs post. He both texted and wrote her about only working until 530. She's covered.",
            "It’s in the text he sent.",
            ">unless they find some chump willing to work off the clock.\n\nThat's the plan.",
            ":: facepalm :: apologies, I missed that."
        ]
    },
    "It is our job to know! ": {
        "title": "It is our job to know! ",
        "score": 676,
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1dli5py/it_is_our_job_to_know/",
        "content": "This starts as malicious compliance and ends with Petty Revenge. I posted in both. I hope cross-posting is not an issue here!\n\nIt’s a fairly long story but I think I can keep to the essentials. A place I worked at in 2004 had three DBA teams (Data Base Admin).   The team I had been on since I joined was tight and ON-call rotation was pretty easy. If anyone got paged for a database that you were the primary on, then you had to buy the team drinks.  You rarely got paged. :)\n\nSo End of an era. Do you remember “Al Bundy” doing commercials to save big money on long-distance phone calls?   That was us!  Cell phones and free long-distance put us under.\n\nDuring the death throes, they had massive layoffs and combined 30 DBAs on three teams into one team of 7.  I made the cut.  HOWEVER, they refused to offline any systems so the workload of 30 remained! My old boss did not make the cut and my new boss was a toxic butt-kisser. I don’t even care anymore-- his name was Steve. Worst boss ever! He would defend ANYONE but someone on his team. I believe he legit thought throwing his people under every bus made him a “team player” Other departments quickly figured out,  “Blame them and he will blame his people” so they did!\n\nMy first on-call rotation on this new combined team was utter hell! The pager went off every 10 to 15 minutes. Messages like:\n\nJob 104 completed step 5.\n\nJob 110 starting step 12\n\nJob 110 completed step 12.\n\nIn case you did not know-\n\n1. THESE ARE NOT THINGS YOU PAGE OUT FOR!!\n2.  I have no idea what any of those jobs are, where they are kept or what do about them if they should fail.  No idea!\n\nOn and on all night long -   You can’t ignore them as you might miss a REAL message about an actual database problem! So you get zero sleep and with the diminished staff they expect you there the next day.\n\nWhen I started ranting the next day the folks left from that particular team said it’s always been that way. That was nuts and we are short staffed so I set out to fix the problem. I looked at every message that got sent to the DBA pager queue and added the prefixes “INFO\" or \"WARN” to every message (kept it short for the pager) Then I changed the pager daemon to route anything starting with \"INFO\" to e-mail and ONLY route “WARN” to pagers.\n\nWorked like a champ! We went from 50 pages a night to maybe one per night and often none.\n\nOne day a team meeting was called and Boss Steve was upset that a print job had failed and our on-call person (me) did not respond.\n\n“Why would I respond to a print job failure? We (database admins) have nothing to with that.”\n\n“When you get a page you respond. Period”\n\n“Why would I get a page that a print job failed?”  \n\n“Because we always have, didn’t you get the page?”\n\n“Ohhhh, that, no I fixed that awhile back. DBA’s only get paged for DBA stuff now.”\n\n“WHAT? You need to put that back the way it was!”\n\nOk, I am cutting a bunch out here for brevity – I said no!  The people who were actually responsible should get paged not us-- we ended up in a shouting match! He was yelling he would take me to HR and I told him that worked both ways as he was flat-out abusing us not letting us sleep AND expecting us in at 8:00 AM sharp.\n\nThat slowed him down a little and then he calmly said, “Our department must know everything that happens overnight so we can answer for it in the morning, make sure we get the pages!\n\nOh the evil light bulb went off. I smiled and said, “Yes, sir!” Ding! Ding! Ding! “Our department” eh? “We” eh? Okie Dokey then!\n\nI reworked the pager daemon so that all pages went to HIS pager but left the code that only routed WARN to the on-call pager in place. Now WE and OUR DEPARTMENT know everything that happens overnight! Yes, I am so very proud of that one! I slept soundly that night!  \n\nThe next morning I kept waiting for him to come over, and either tear into me again OR admit it was a horrible night, that he did not grasp how bad it was but now let’s get a better fix in place.  I was disappointed--  He said NOTHING to me at all. Did he get all those pages? I double-checked that everything was routed to his pager and it was. He just would not admit he was wrong! I was impressed! I thought he was tough (but stupid) getting all those pages every night and never saying a word!\n\nEND OF MALICIOUS COMPLIANCE\n\nStart petty revenge. :)  \n\nA few weeks later I was doing an upgrade outage overnight. We were getting to a critical point and needed a decision to roll back or continue and exceed the outage window.  I paged him several times. No answer!  We all sleep through pages from time to time so I rolled back and e-mailed all concerned. No big.  But he NEVER got back to me. That was odd. The next Monday I mentioned it to the team and several folks said yeah, he does not answer pages after hours anymore!\n\nAAAAAA-HA!  He was not tough! He just started turning his pager off before bed!  Still too chicken to admit he was wrong.  \n\n A few weeks later I was on call again and late Sunday night I got paged to come in immediately!  To keep it brief the system that went down was a federally mandated system with severe financial penalties for downtime beyond a limit. We were reaching that limit! It was a huge amount of money!  All hands on deck! Even the CEO and CIO were there. Developers, sys admin, network, security and DBA with their bosses (with one exception) were all on laptops in the conference room. This was BIG! Thank god it was not a DB problem – It turned out to be network. The CIO said he appreciated us and wanted all there JUST in case.  No problem… sometimes that is the life we choose! :) \n\nAt about 5 am Monday after a long night, the CIO says to me,  “Hey, I have paged your boss like a dozen times -- he is not answering”\n\nOH GLORIOUS DAY! With a shrug, I very casually say, “Oh yeah, yeah, Steve *\\*never\\** answers pages at night.”\n\nHe said nothing out loud but I saw his face cloud up.\n\nAbout 7:30 issues are resolved and we are watching transactions flow across to the feds. I am watching the DB to make sure the huge backlog is not gumming it up but I am just watching as all is well.\n\nAt about 7:45 Ole Steve comes strutting in the door, fresh-faced with a full night's sleep! As he walks past the full conference room he does a double take and stops. When he sees all the heavy hitters (and us plebes) in the room, his face falls, he knew right then he screwed up!\n\nThe CIO Says, loud and mean, \"Where have you been?!\"  Then the CIO and CEO take him out of the room. I have no idea what was said but I bet it was not pretty! lol\n\nThe CIO and CEO come back in about 10 minutes. They heartily thanked us all for the dedication then sent us home and said don’t come back until tomorrow! Good leaders!\n\nI came in the next day and no Steve. I never saw him again!   \n\nI sure am glad I kept that short! :)",
        "num_comments": 38,
        "comments": [
            "awww, how sad, you never got to say \"good bye\" to Steve. you must have been heart broken ;)",
            "Steve always threw his team members under the bus. You returned the favour by throwing him to the sharks. Well played good sir!",
            "I'm ignorant as hell when it comes to computers, but I thoroughly enjoyed this story \n\nFuck you, Steve",
            "That was a delightful read. Satisfying story, well-written and formatted. Thank you!",
            "*Sarcastically* Thanks, Steve!\n\n*Maliciously* Back to you, Steve!\n\n*Jovially*  Thanks, Steve!",
            "That's the kind of boss you feed into a woodchipper, feet first.",
            "MCI huh",
            "/r/talesfromtechsupport would also probably enjoy this.",
            "Ha Ha! Fuck you, Steve!",
            "Bu-buy, Steve!",
            "Man, I have no idea what goes through people's minds when they think that it's too much to admit fault or apologize.  I mean, I guess I understand the narcissistic and sociopathic takes on that because they genuinely think they did nothing wrong.  It's delusional as fuck, but that process makes sense.  I don't get people who know they did something wrong and don't have the sack to admit it.",
            "This is a fantastic story. I really enjoyed the double whammy of MC and PR!\n\nCould I make a couple of tiny suggestions for readability (which is 99% great!)? \n\nAt first I didn't get what adding \"INFO and WARN\" was going to achieve, until I realized it was one or the other and not both getting added to each message. \n\nMaybe instead of\n\nadded the prefixes \"INFO and WARN\" to every message\n\nit could be\n\nadded the prefixes \"INFO\" or \"WARN\" to every message\n\nfor the benefit of others a bit slow like me!\n\n(Also FYI it's \"death throes\" not \"death throws\")",
            "Man, Steves are always getting a bad rap. That guy sounded like a real piece of work though! Good riddance.",
            "This is like a modern day version of “little boy who cried wolf” with a little twist 😂",
            "LOL! Crushed, utterly crushed!",
            "I like the way you put that!",
            "OP didn’t even throw him under the bus. Could have said “oh yeah, he turns off his pager” but instead went with the simple truth of “he never replies” without digging the bigger hole behind that half-truth. \n\nNot replying is bad enough to be fired. If they found out he’s being paid to be on call, for a pager that is turned off? Being fired would be the least of his issues. They think he’s incompetent and lazy, could be worse, they could know he’s stealing from them. ",
            "throw me to the sharks and I'll come back leading the wolf pack",
            "LOL! Thank you!",
            "Aww! Well, thank you so much! I struggle to find the line between enough detail to understand the story and boring the life out of you!  Maybe I got the balance right for a change!",
            "We were competitors in that market. :)",
            "The thing is, just from the way it's phrased, Steve took one look at his team AND the higher ups, and KNEW that something had come to bite his ass. He KNEW what he'd been doing was wrong. It finally caught up with him.",
            "Since I am not a manager constructive feedback is always welcome. :)  \n\nValid points! Thanks for educating me! I will correct in OP",
            "Poor Steves! :)",
            "I had not thought of it that way but you are dead on!",
            "You could page him?",
            "I've been told I can turn a phrase from time to time.",
            "It's also the most truthful answer. He has heard that Steve turns off his pager, but it's \"hearsay\", though likely and quite obvious, let's say 99% probability, while Steve not answering at night is a fact op knows as absolutely 100% true.",
            "then you'll enjoy [this]( https://www.youtube.com/watch?v=EOZ3rQbc9_w).",
            "No, Paige him!",
            "Brilliant! LOL",
            "as long as we're talking about it, the pun in your username makes me want to commit minor arson.",
            "Here's a classic:\nhttps://www.youtube.com/watch?v=uRGljemfwUE",
            "The kind of minor arson that would heat that chili. Cool beans!",
            "{applause!}"
        ]
    },
    "You wanna fat shame your kid? Watch your effects": {
        "title": "You wanna fat shame your kid? Watch your effects",
        "score": 467,
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1dljj6s/you_wanna_fat_shame_your_kid_watch_your_effects/",
        "content": "So, this is me just reminiscing on when I was younger, but as a teen (13 or 14), my mom thought a great way to get me to be “healthier“ was to force me to work out or I wouldn’t be allowed to see friends or play games etc. Well, her new way to convince me to stop eating junk food (I ate junk food like once a day, maybe like chips or a candy but usually ended up eating healthy snacks and fruits throughout the day) was to start fat shaming me. It was little quotes here and there of “You can’t fit in that anymore“ or “You’ve grown a lot since you wore that” (clothes in question being oversized shirts and shorts, occasionally bathing suits, all from like 9 months prior. For context, I was no longer growing and had stayed the same height and weight for about a year and a half). Eventually, she got bored of making little comments and would say in public while eating out with friends that I shouldn’t eat that, too much fat. Nobody noticed or cared, but I got so pissed that she tried embarrassing me, that my dumb teen self decided to not eat for about 48 hours. She panicked when I stopped eating, because I had a bunch of medical condition (including very low blood sugar) and was starting to ask why I wasn’t eating. I simply responded with “You called my fat. You wanted me to lose weight. I don’t feel like working out, because the more you tell me this crap, the less I wanna do what you say.” In hindsight, I really should have just kept doing what I was doing instead of being petty, but I was young and easily pissed off. Now I’m just easily pissed off. And before anyone says I shouldn’t disrespect my mother, she also used to hit me for having a different opinion, and isolated me from society for about half a year and hitting me and harassing me verbally when I was 14 for dating somebody who wasn’t born a guy, so yeah. This is less malicious compliance and more “Hah, I have trauma“, but I still decided to kinda do what she said. Because during those 48 hours, I believe I lost about 5-8 pounds like rapidly. ",
        "num_comments": 39,
        "comments": [
            "You should get therapy. That is a horrible mother and she really put you through the ringer there",
            "So much of society blindly believes the myth of \"a mother's love\". Mine wasn't about fat, but I _hear_ you. And it's taken me decades to even grok that I should think this to myself, but it helps when I try and tell others, like you, that\n\n\n'You deserve to be loved, and to feel loved, just for being you.' --Mr Rogers mashup with my meditation teacher",
            "5-8lbs in 48 hours could only be possible if it was mostly bloat, are you perhaps gluten sensitive? My wife dropped about the same within a couple days of no gluten. Maybe try avoiding gluten for a while and see if that helps you. Just some food for thought hahaha",
            "You should absolutely not respect anyone who treats you shitty like that.",
            "Not malicious compliance...that is the side effects of abuse. Hopefully she saw how her words or actions destroyed your self confidence and made you feel like shit every day.",
            "I’m sure that you had body dysmorphia.",
            "I'm so sorry you went through that abuse and homo/transphobia...",
            "Respect is a two way street.  She wasn't showing respect and teaching not to respect, why would she expect to receive it?",
            "Wow.  So many delusional thoughts here.  Let’s start with the blatantly obvious fact that you cannot lose 4-8 pounds in 48 hours unless you severely dehydrated yourself.\n\nSeek therapy.",
            "Try a life coach instead of therapist",
            "I wish somebody would have gave a damn about my health, I got whatever I wanted and I’m still dealing with it at 25!",
            "It is terrible that your mom wanted you to be healthly, such a harsh experience. Luckily you are now healthy and happy anyway.",
            "I’m still in therapy to this day!! This woman was the only reason I was ever insecure about my body, and I think it was because she was jealous I had a better figure than she did at 13-14 /hj",
            "It's reading and hearing stories where the parents are these horrid caricatures of human beings that makes me so terribly thankful how amazing my own folks were. I know my own mother has hinted that she looked at her parents and decided to be as unlike them as possible. By the time I knew the people (my grandparents) they'd mellowed to the point where my mother could forgive them. My folks had their problems, but they made sure we knew we were loved. And did their damnedest not to let us grow up with the prejudices that they grew up with. I like to think they did a good job with that.",
            "❤️❤️",
            "We found out when I was like, 10-13 that I’m highly allergic to both dairy and gluten, along with medical issues we still can’t figure out, which we do now know for certain that does include rapid weight loss if I don’t have certain things in my body (most I can now get through my medications)",
            "It's normal for your weight to fluctuate up to 5 pounds in a single day. I once saw my weight drop by 8 pounds from one day to the next. It was absolutely mostly bloat.",
            "Nobody reading the first part thought, \"You really shouldn't disrespect your mother.\"\n\nThe fact that she hit OP only makes her more of a monster. I hope OP gets away from that abusive witch soon.",
            "Had? More like *have*. As an adult who was raised by a mother with orthorexia, that shit doesn't go away.",
            "I now have an eating disorder and barely eat a snack and dinner",
            ">blatantly obvious fact that you cannot lose 4-8 pounds in 48 hours\n\n\nNope.\n\n\nIt's possible. I've done it, and I drink a ton of water. That said, it was always when I was extremely large.",
            "Yeah that only really happens when you have food poisoning or you’re purposefully dehydrating to cut weight for a combat sport.",
            "Shaming and restricting is not better or worse than spoiling and neglecting. It's different sides of the same coin: not giving your child what they need to grow up with a healthy mind and body.",
            "Good reminder to not traumatize your kids thanks to your own past.",
            "Oh wow, very interesting, even though I am very sorry to hear that. Hope you're doing well now.",
            "The sad fact is that I’ve been saving to move halfway across the US since I was 12, and when I was maybe 15, she took around $200USD out of my apartment savings, and then forbid me from getting a better paying job than what I had (I was and still am a commission baker taking very far and in between orders). I seriously only keep a relationship with her because of my grandparents, nobody(the people who knew) had the heart to tell them that their daughter grew up to be an abuser (like my grandfather’s grandfather)",
            "I continue to struggle with body dysmorphia myself. It’s a cruel game.",
            "That's literally my mom every day except for when we're on vacations. Like right now. ",
            "After a few hospital scares, I’m doing better in that aspect haha\nAlthough cheesecake and pastas still are my weak spot\nI genuinely haven’t gained weight in like years though, which is part of the reason I even thought about the whole fat shaming comments, because I just sat down and ate a full sub myself since I haven’t ate well, and it reminded me of the time I ate two cupcakes in the span of 36 hours and my mom started hiding sweet treats and junk food lol",
            "I think your answer is to tell your grandparents the truth, ask for help getting set up on your own, stay in direct contact with them, and go with no contact with your abuser.\n\nIf your grandparents are no help, find someone else.\n\nPlease find safety!",
            "My mom still says shit like this, IN PUBLIC, and I remind her she owes me a crap ton of money, like I didn’t just give her $40USD for dinner tonight because she was out of cash.",
            "I definitely understand, my mom would put noticeably less chocolate and candy in my stocking at Christmas, like my stocking would be visibly emptier, while my 3 brothers stockings would be full, lots of comments about losing weight, being ashamed of having an overweight child when seeing family from over seas, etc.. so yea trust me, I understand on some level. You're not alone, if that makes you feel any better.",
            "There are tons of recipes out there for cheesecakes without dairy, they use soaked cashews or vegan creme cheese or silken tofu. Search for dairy free cheesecake or vegan cheesecake. The ingredients can be quite expensive, but you can try a different recipe now and then for special occasions or every month (depending on inclination, availability and cost), and try to find which crusts (skip the ones with biscuits for gluten free), fillings and toppings you like, as those can be combined however you want.\n\nTreat yourself!",
            "They want me to stay in state a little longer, at least til I finish getting my business degree online, but I’m pretty sure they’re actually planning on helping with my new apartment in TX\nI don’t wanna explain the situation to them, because they just found out about a lot of sad things, and we(my family as a whole) don’t want to put anymore stress on them, my grandmother is still getting over a recent stroke she had",
            "Oh, I didn't mean about the abuse part. I meant my mom's like you with only eating snack and a dinner.\n\n\nBut your mom sounds awful. Sorry you had to grow up with that.",
            "OK, it's complicated. I'm sorry. Do whatever makes sense to you. It seems as though you're on the right track. Good luck!",
            "Oh, I’m sorry I didn’t read that correctly!! 😭😭\nMy apologies!",
            "Thank you!"
        ]
    },
    "Malicious DoorDash Wings": {
        "title": "Malicious DoorDash Wings",
        "score": 422,
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1dlhccl/malicious_doordash_wings/",
        "content": "So I noticed today DoorDash is running a Summer Deals bruhaha where supposedly different restaurants are offering different types of discounts on orders.  \n\nKnowing DD's predatory business practices it's probably some lose/lose for restaurants if they don't participate, but listen...it's 100 degrees outside, it's been a long week, and a brother's HONGRY.  At least I can still sleep at night ordering from some chain that can shoulder the financial hit, right?\n\nAnd would you look at this - Wingstop is stepping up with a sweet-ass deal on boneless wings.  Free 10pc on my order?  Say considerably less and sign me up. \n\nI rock on up to my cart. \nI throw in a 10pc.\nThe hungerin' rumbles. \nEager to consume, I go to select my sauce...\nAnd the ONLY option is \"Atomic\".  😭\n\nI checked their other boneless sizes, and the bone-in 10pc as well, and they all have every flavor listed.  Wingstop straight-up intentionally said \"You want us to dump off entire orders of free wings?  All right.  Sign on the line. But we're ONLY offering them in Satan's Anus flavor\".  \n\nWas I disappointed?  Yes.  But I've got to give them props for complying with this corporate dictum in one of the most technically-correct yet overtly-violent ways imaginable. \nKudos, Wingstop.\nYou will not quell my hunger today, but you have earned my respect and future full-price business.  👊",
        "num_comments": 63,
        "comments": [
            "We didn’t make the rules, but you will pay to play. \n\n— Wingstop",
            "Challenge accepted, Wingstop. I would have destroyed those Atomic Wings. That's the sauce I get anytime I eat there (which is incredibly rare). They are not even hot enough for me—the hottest pepper in there is a habanero. Child's play. Well played on their end, though.",
            "Yeah, not seeing this in my area, I would have gone for Atomic.  $3 off $30 or 6 wings for $13 doesn't interest me.",
            "Chipotle also offered bogo entrees of $25 or more except when you go to apply the code you get an error message.",
            "You should have just ordered the sauce on the side. Then add the one of your choice. Problem solved.",
            "Wingstop must have too much inventory of Satan's Anus flavor.",
            "Boneless wings are just chicken nuggets ",
            "Sounds like it was written by wing stop",
            "Damn, I want chicken wings now",
            "Damn they're lucky I don't DD. I'm a fucking masochist and would like to see how they are.",
            "Stop calling shitty chicken nuggets \"boneless wings\". They aren't wings. It's a lie.",
            "Dang, I love spicy food. Just checked and the only deal I have is 15% off of an order of $15 or more.",
            "I like their fried corn, it works well as a side to a shittonne of wings",
            "1) There is no malicious compliance here. \n\n2) You’re trying way too hard, my man.",
            "Haha, you're made of tougher stuff than I am.  I fold like a napkin at pretty much anything above \"Buffalo\".  😂",
            "People ask why I installed handles on my toilet, I got atomic once.",
            "Bro that's it? I got excited. My own home chill out sauce is habanero tabasco. Hit me with 600k+ Scoville or step off -_-",
            "I enjoy spice with a purpose, to enhance flavor. Not to blow up my toilet!",
            "They *have* to ameliorate the hotness somehow. Many  non-franchise restaurants  have a fucking disclaimer you have to sign to even bite a piece of *really* hot stuff -- like the stunt/TikTok hotness. People have *died* from the hotness. There is no way Wingstop Atomic is as hot as others. (And i've had them they're pretty hot but if you like hot it's nothing.)",
            "DD commercials all over my streaming service.  5 week promo",
            "That's a big oof.  💀\nAnd Chipotle of all places!  Now of all times!  I appreciate any middle finger one corporation gives to another but Chipotle can't be playing around right now.",
            "Sweet, so if you put both bowls together you'll get one full one.",
            "Holy crap, I didn't even think of that.  Absolute omega brain move.  👀\nI know what I'm trying next time!",
            "One might say they have a buttload. ",
            "And that's why we love em. I wanna enjoy the crunch and the flavor, not have to maneuver around cartilage while trying to pull meat from bone.",
            "Saucy Nugs",
            "Maybe. \n\nChicken nuggets are the baloney of chicken, ground into a fine paste and pressed into molds.\n\nBoneless chicken wings are usually just chicken breast cut into strips. But they can be nuggets in cheaper restaurants.",
            "An amazing rebrand wasn't it?",
            "false. Boneless wings are actually \\_tenders\\_.",
            "Although I understand the Internet has jaded us all, I assure you this was not written by Wingstop.  I thought specifically of this sub when I realized what they'd done, so I guess I did at least put some respect on their name in that sense.",
            "Like it was written by an AI for wing stop.",
            "I vastly prefer boneless wings to actual wings. Yes they are deep fried nuggets. I don’t care. Wings are messy and greasy and I don’t like them.",
            "The malicious compliance from Wing Stop was clear. Thank you OP for not being intimidated by the MC gatekeepers on this Sub. We're probably missing out on some good MC stories cause some nitpickers are always lurking and bullying. Let the mods deal with it if you think it's not MC.",
            "1) Thanks for offering your opinion.\n2) My man.",
            "So far, 190 people agreed with OP...",
            "Did you know Buffalo buffalo Buffalo buffalo buffalo buffalo Buffalo buffalo?",
            "Same here. I'm a delicate flower when it comes to this stuff.\n\nI had Popeye's hot wings today and they were a notch-ish above where I'd like them. But I think they put honey in the sauce, so that was interesting?",
            "You probably need some milk after eating something like a cucumber huh :p",
            "My boyfriend too. I had a hot wing tonight and I was quite upset. I like spice but it also depends on the type of spice which is also weird haha",
            "Are you by chance Cid Kagenou from The Eminence in Shadow, or is this just a strange coincidence?",
            "Oh fuck, I wish I had unlimited upvotes to give!",
            "The disclaimer is really just a big gimmick TBH. but yeah your absolutely right. you will never find something over the top at a corporate restaurant, well most restaurants in general really. Like you said people have died. Not from the capsaicin but from underlying health issues that was exacerbated by the bodies reaction to the heat. Usually people with heart problems.",
            "Saying people have died from hotness is misleading.  People with pre-existing conditions have died from hotness.",
            "lol. Luckily Cabo Bobs has a location reasonably close to where I live. Way better than chipotle and a much better value.",
            "They've barely cracked into their supply.",
            "I eat the cartilage to maintain my cartilage.  Rib tips, leg ends, breast ridge, Not much taste.",
            "Yeah, boneless wings are more like small tenders than nugs",
            "Boneless can be good I just dispute the name. They're typically pretty trash chicken dressed up in sauce in my experience. \n\nWings be messy and if you don't like eating with your hands and getting messy about it it's not gonna be your thing. More for the rest of us lol \n\nDemand better quality and more accurate names from the void industry lol",
            "Thanks.  I really appreciate that.  \nAnd yeah, y'know, I thought it was legitimately funny and wanted to share.  Looks like the upvote-to-downvote reception has been pretty split, but breaking even is honestly fine by me.  It got some conversation going and got a few other folks to share fun anecdotes of their own, so win/win.",
            "I did know that.",
            "I never thought about it like that",
            "Are you shitting me? Get right out of town....",
            "Oh, no. No no no no NO. Milk with cucumbers will poison you.",
            "I have no idea what that is lol",
            "Buffalo wild wings max sauce isn't TOO bad, but that's just cause they finally put flavor into it. It's still not gonna wreck you, but it's quite tasty with a decent burn.",
            "It's a texture thing",
            "Yeah, I agree. Wings are wings and boneless wings are nuggets in sauce. Neither are really worth the hype.",
            "I'm bougie, and get my nails done. I eat wings wearing nitrile gloves. 😉💅🏼",
            "I think they'd be better described as chicken tenders, because they're not ground / processed chicken - nuggets are. You can tell by the texture when you chew. \n\n\n\n If done right, chicken tenders can be amazing - it can be hit or miss though. I only found one place that did tenders great, then they changed the chef who got in nuggets instead. I had better luck at home though",
            "He's the main character from an anime, the guy who constantly fails upwards! It's a pretty funny anime. Ok so providing context AND a link, during Cid's specialty move he says [I am Atomic!](https://www.youtube.com/watch?v=gnGr21FAwo0) Not going to lie it would be pretty funny for someone to say that while in the toilet LMAO.",
            "If I want to melt my face off I’m making wings with Reaper Squeezins. Those will fuck me up in the best way possible",
            "I have to prepare myself if I'm going reaper sauce. That's gonna take up the night as I struggle to hydrate as water pours out of me lol."
        ]
    }
}