{
    "MapPorn Discussion Thread for June, 2024": {
        "title": "MapPorn Discussion Thread for June, 2024",
        "score": 15,
        "url": "https://www.reddit.com/r/MapPorn/comments/1d7j3b0/mapporn_discussion_thread_for_june_2024/",
        "content": "This thread is for general MapPorn discussion. Exchange ideas, ask for maps, talk about cartography, etc. Have a thought that doesn't fit in another thread, post it here.\n\n",
        "num_comments": 16,
        "comments": [
            "I am in the market for a decent globe. I didn’t realize light-up ones were a thing until I started looking. \n\nI’m leaning towards [this one](https://replogleglobes.com/product/odessa-blue-12/) at the moment. \n\nAre Replogle globes a decent brand? Any other suggestions? Budget around $100 ish. Main things I’m looking for are: blue oceans, political boundaries colored (filled in preferably) and good construction. I’ve seen some where the seams are misaligned, etc., and don’t want that.",
            "Hi there I got suggested to come here to try spread my subreddit about maps. This sub redded is for anyone who enjoys walking and or maps so if you do maybe come have a look. We are only a very small sub right now but will hopefully become bigger soon. The sub does mainly focus on osmaps (Ordnance Survey) but any maps are well come. So if your interested come have a look at r/osmaps and I'll see you there",
            "I'm interested in creating a map. I've drawn it out in detail already in Google My Maps. I used GMM as it allowed me to trace rivers and mountains easily, whilst seeing settlement positions. I was wondering if anyone knows if there's a way of using these shape drawings with some software to create a simple map - as print screening isn't very practical. Google My Maps allows exports to KML and KMZ files which could be useful. Would appreciate any directions.",
            "Can someone do a map of the 1992 democratic presidential primary results in congressional districts? Especially the NY Primary because that was a weird one.",
            "I have been using google mymaps to build a list of places I want to go to in my area. Actually using the my maps feature in google maps is extremely buggy. Is there a alternative map app I can add my own places to thats not cluttered?",
            "When I was a tween I found a really comprehensive atlas of Normandy battle maps all drawn in the same style--the style seen in [this website](https://battlearchives.com/products/operation-bagration-1944-battle-map) selling maps.\n\nObviously not getting a huge print of one map, but I was wondering if anyone knows either what book I'm talking about, or, in the alternative, what this style of map is called (it seems super common) and how to search only publications that use this style.",
            "Long story. But I’m trying to draw my own small town fictional map. Are there any free map drawing tools available. This would be for a reference page to a fictional mystery novel a friend is writing. Essentially, it would not need to be hyper detailed; just to layout roads, and major story points and the town center. Any input would be appreciated. Thanks everyone!",
            "Can anyone point me towards good, free data sets for making maps please?",
            "Can anyone point me towards good, free data sets for making maps please?",
            "What are the best starter map making tools/ how do you make your maps? Thanks in advance!",
            "Here are the 9 US STATES WHERE PORNHUB WILL BE BLOCKED:\n\n1. Idaho\n2. Utah\n3. Texas\n4. Missouri\n5. Arkansas\n6. Mississippi\n7. Louisiana\n8. North Carolina\n9. Virginia\n\nIf You want more information about why these states are blocking PornHub, Visit [AbouTechs](https://aboutechs.com/states-where-pornhub-will-be-blocked-as-of-july-1-2024/)",
            "Looking for a county level blank map of the US and Canada.  I can find them separately, but never combined.  If Mexico is included, that's fine.  \n\nDoes anyone have any tips for finding this?",
            "It sounds like our map editor on [printmaps.net](http://printmaps.net) suit your needs. Slip me a DM if you have any questions and I'll be happy to help you",
            "You can try [printmaps.net](https://printmaps.net) - it's a web editor and you don't need an account. PNGs (for private use) are free and you can buy layered PSDs and SVGS",
            "that's insanely overpriced. £170 for an image LOL",
            "Our pricing has options of pngs for personal use which - up to A5 dimensions - are free and options for commercial publishers, print designers, real estate agencies, etc. which scale with the amount of copies printed. Please refer to our Pricing Table: [https://www.printmaps.net/pricing/](https://www.printmaps.net/pricing/) From what I understand, what you aim to do can be done for free - if you want any help with our editor, don't hesitate to slip me a DM."
        ]
    },
    "Most Common Nationality other than Germany in German Bundeslander": {
        "title": "Most Common Nationality other than Germany in German Bundeslander",
        "score": 1280,
        "url": "https://i.redd.it/9q4lbvcaf28d1.png",
        "content": "",
        "num_comments": 180,
        "comments": [
            "Romanians in Bavaria really surprised me.",
            "The colors of the map tell me something else\n\n![gif](giphy|VI2LPOUgoxIqdFDK4N|downsized)",
            "Nationality is written like an adjective: German, Turkish, Ukrainian, Romanian, Syrian\n\nNation of Origin is a noun: Germany, Turkey, Ukraine, Romania, Syria",
            "Being a Romanian, I find it hard to believe that there are more of my nationality than, say, Poles or Czechs in SE Germany",
            "babe wake up, new partition of Germany just dropped ",
            "Ä is ae. If you can't write Bundesländer because you lack that umlaut on your keyboard, write Bunseslaender.",
            "Bundesländer*",
            "What's the source used for this map?",
            "This is why Bayern the richest and most prosperous 😎 🆒️ 😎  💪 💪 💪 💪",
            "Data source? Year?",
            "[deleted]",
            "Does anyone know if the ones with Romanian nationality are Romanian ethnics or Transylvanian Saxons that moved there after the 90'?",
            "Why is Red-hoodie guy eating Saarland?",
            "...here's why Romania beats Belgium 2-0 in euros today",
            "RIP Germany...",
            "I‘m honest… to know that maybe 80-90% of the ukraines migrants are woman because of the Mobilisation rules in Ukraine. 🇺🇦 \n\nIs funny lol",
            "Who would wi...DON'T SAY IT\n\nWho wou....DON'T SAY IT\n\nWh...NO",
            "Im surprised there are no Polish people. Second most common nationality among immigrants (after Turkey).",
            "I'm really surprised there's not a single spot with Poles.",
            "Being German it totally does not surprise that there are Bundesländer where the biggest other nationality is made out of refugees. Yes those parts of our country are that socially monochrome.",
            ">German Bundeslader",
            "There are so many people from the balkans in southern Germany its crazy.",
            "no, there must be Germans everywhere here. There are practically none in Germany",
            "Please provide the source for the underlying data!",
            "Meck-Pomm, Brandenburg not Polish? hard to believe",
            "What’s the biggest minority tho",
            "What they couldn’t think of another color after yellow red and blue?",
            "I call bullshit. No source mentioned.\nMy sources (German federal statistics office)say: Turkish pretty much everywhere except those states close to Poland.",
            "Im from Bavaria. And i know a few romanians. But no way this is accurate. No. Way.",
            "Who would win this hypothetical war?",
            "Was Ukrainian the largest non-German before the war?",
            "This country is doomed(",
            "Turkey and Syrian! Europe needs less of these people.",
            "Poor Germany.",
            "West and South Germany must have amazing food, huh.",
            "The Turkey of the West🦃🦃",
            "Do maps like this serve a useful purpose? Is it to satisfy a macabre curiosity around ethnic impurity? Is it to inflame? Is it innocent? Can an ethnic map be innocent? Seems to play right into fears and hatreds, grudges, and propaganda, tribalism, and the capacity for statistics to skew in any direction that best suits a dastardly bent.",
            "[deleted]",
            "Bayern for the win !",
            "I don’t go back to germany anymore",
            "Considering that it’s a federal republic that was created from an empire founded as recently as 1871 and made up of multiple nations at the time, wouldn’t eg Franconian be the second largest nationality in Bavarian after the Bavarians?",
            "Have Turkish people migrated to other countries quite often?",
            "No Austrian? Surprising",
            "[deleted]",
            "No Bosnian? This map must be wrong.",
            "Many jobs here, economically it's the place to be. If Yuguslavian was a nationality, they would probably lead.",
            "Well it’s the closest thing to living around the Carpathian Mountains so it kinda makes sense. Not for people from Bucuresti tho lol",
            "I’m from Bavaria and it surprised me too, I was sure it’s turkey.",
            "I live in Munich, and I definitely thought that it would have been Croatians to take the lead",
            "I am vocational student at nurse school, and I have relations of people from Romania going there and literally sitting and do nothing at the hospital because patients will literally reject the idea of a Romanian nurse do work in Germany.",
            "Most immigrants in germany are actually from eastern europe",
            "Should have said bavarians",
            "[deleted]",
            "We already won the fucking euros frate",
            "Hell yeah, go Chad!\n\n...aaaaand also Romania! And Andorra...\n\nAt least you're not Poland/Monaco/Singapore/the Principality of Halych",
            "Oops! I got a bit confused and did it the other way around",
            "Who gives a shit lol it gives the same effect and no it says “nation of origin”",
            "I think czechs don't emigrate that much in general and poles might have an incentive to go to Northern Germany because it's closer to home and the same is true for Romanians in the south East.\n\nGeographic proximity matters for migration.",
            "Most Czechs working for German companies get to do it in Czechia itself. :P No need to emigrate.",
            "Majority of Romanians have been leaving the country to work elsewhere. Thus why Romania is on a large population decline.",
            "The Poles come at Number 2 in many other western German states, they are just not on the map but they are HERE and in higher numbers, very certainly. 😁 We even have polnish Discos and supermarkets in Frankfurt/Offenbach, or in the RheinMain-area! So be sure, if you plan to move here, to find maaaany people from Poland. The same situation should be in eastern Germany.",
            "Have you just called Bavaria south-east Germany?!? How dare you!",
            "Most poles don’t live in Germany they just working there and going back home",
            "Nobody show this to Gaddafi",
            "That came in my autocorrect but I ignorantly thought it was incorrect and left it as it is",
            ">Bundesländer*\n\nTechnically (\"Akshually\") there are only \"Bundesländer\" in Austria. The German constitution knows only \"Länder\".",
            "Or if you don't want to use the special letter: Bundeslaender",
            "Wikipedia pages for each individual state. That was probably a really bad source to choose....",
            "Guessing maybe? Or 30 year old Numbers? That shit is random as hell",
            "Wikipedia pages for each individual state. That was probably a really bad source to choose, but I took it for granted since it said 2022, and 2023 numbers",
            "You're a Syrian in Saarland?",
            "It wouldn't make sense for the Saxons to move to Bavaria however. Despite their misleading name of \"Saxons\", their ancestral homeland is closer to Luxembourg or Western Germany.",
            "Deutschland Deutschland unter alles ig",
            "270k men 800k woman/children",
            "Most Polish and Turkish immigrated decades ago. Most of them are German citizens now, they aren't counted as other nationality.",
            "Some eastern states likely had Polish as number 1 before the war.",
            "They all left yesterday.",
            "I thought upper Saxony with Dresden and Leipzig aren't monochrome. But then again, I probably overestimate them because byndesliga team",
            "Okay, but did you search for nationality or ethnicity? \nBecause a lot of turkish-germans don‘t have turkish citizenship anymore. And this map is about nationality.",
            "He m mentioned his source mutible times.Wikipedia pages for each individual state. For example: \n\n[https://en.wikipedia.org/wiki/Bavaria#Demographics](https://en.wikipedia.org/wiki/Bavaria#Demographics)\n\nAnd there you can check the Sources.",
            "no",
            "Exactly the opposite",
            "Europe needs way less of intolerant people like you.",
            "Sadly, it's mostly all Döner places. Finding actual Turkish restaurants is surprisingly hard.",
            "Why disupvote? Thats true",
            "🤣that’s a good one.",
            "Turkey is in red.",
            "Its not 1871 anymore bro, most germans just consider themselves german",
            "That's not a nationality. I do think you could make a case for ethnic groups, because the German tribes check a lot of boxes for that.",
            "this doesn't really make sense even if you read it how you want us to",
            "Do you have any idea of history? This is blatantly wrong",
            "People who got other nation background or in german Person mit Migrationshintergrund (immigrationbackground) are very weirdly defined in germany. Most relevant info without getting brainmelt: \nIts counting generelly from 1949 (clear definition changed few times already, got the feeling that someone cant get proper overview without beeing a sociologist).",
            "Many immigrated to Germany temporarily to rebuild the country after WW1 and just stuck around",
            "Little reason to emigrate from Austria to Germany, it's very similar economically.\n\nI'm more surprised that Poles aren't on this map at all. But then again... From what I've heard, many actually returned to Poland again because economic prospects are looking better there as compared to the early 2000's",
            "As somebody else already said: not many reasons to emigrate from Austria.\nBut Austria is also a small country. Even if it were the case, it's still hard to beat Turkey or Romania.",
            "Whelp, not too many failed painters these days",
            "Bullshit, by 1990 less than 3% of the population in West Germany were Turkish.  \nhttps://de.wikipedia.org/wiki/T%C3%BCrkeist%C3%A4mmige_in_Deutschland",
            "Jugoslavs in general aren't as common as Turks.\n\nIn fact, there is a large history of Turks coming to Germany after WW2 to help us rebuild our Country, since most of the German Population got smoked, during the Ostfront and the Volkssturm.",
            "There are less than 4 million Bosnians unless halve their country moves to Germany they won't show in such statistics.",
            "I know so many yugoslavian people, but ofc if you divide it by three it cant be as far up.",
            "First time I visited Munich I got such a weird vibe as I heard Romanian being spoken everywhere (I’m Romanian). Was not prepared for that. But you’re right, felt like most people were there for work and then probably took their families along.",
            "So you are saying Romanians, aside from other nationalities go to bavarian because of this? haha.",
            "Ok but what does Yugoslavia have to do with Romania?",
            "people from Bucharest go very often in vacation to mountains in Prahova, so it still checks out",
            "People from Bucharest don't really emigrate, at least not for economic reasons. It's those from impoverished villages or the towns where the one factory closed down.",
            "I wonder if Sinti & Roma are counted as Romanian",
            "its nationality. so a lot of people with turkish roots were either born as german citizens already or gained german citizenship after many years living here. romanian immigrants on the other hand are for the most part pretty recent ones, so most of them (still) have romanian citizenship and since they are EU citizens already, there is less incentive for them to obtain german citizenship. also romanians are on average less identfiyable in the public and we still often tend to misidentifiy people as turkish, although their roots are in Syria or northern Africa. headscarfs or mosques also contribute to a different level of visibility. and since many people with turkish roots live here for a long time / multiple generations, they have opened shops and restaurants and you see their signs when walking the streets, while rather recent migrants such as romanians are rather working as employees in someone elses company than having their own business. then the names: turkish last names are more unique than romanian last names. you would recognize most turkish last names as turkish, but aot of romanian last names are much less identifyable for us germans without any sort of special relation to romania.\n\ntl;dr: lots of reasons come to mind why our gut feeling on this is misleading us if we take some minutes to think about.",
            "Nah, Turkey was definitely more in the other parts described. But honestly, I did not have an alternative :) - maybe Balkan nationalities.",
            "There are only 4m Croats, but looking at only the Croatian population of Munich the city would rank at 5./6. place by population size, out of 127 official Croatian cities.",
            "Yeah, stupidity and racism is a big trend now in Germany.",
            "Everyone then gets what they deserve, a break and not getting treatment fast enough. I like it.",
            "Do you have a source for this assumption?",
            "Hahahaha",
            "I find it peak hypocrisy that an Indian equates Romanians with Roma, when Roma migrated from your fucking country to Europe.",
            "You could add Moldova to Romania's list and Indonesia to Poland's.",
            "🦚 full knowledge on display",
            "You fool you lowered your guard\n\n![gif](giphy|6ELoJNHlBQlEci6593|downsized)",
            "It's understandable but it's still wrong \n\nYou wouldn't say \"Hello, I'm from American\"",
            "Can confirm, there are many Poles in Hannover. Overall there are many Eastern Europeans here due to the proximity to the former inner German border and Hannover having been the first major city people reached when crossing it.",
            "Dont tell that the bavarians.\n\nBefore 1945, Silesia was referred to as south-east Germany. I never heard the term after 1945.",
            "Akshually akshually the same applies to Austria, apparently:\n\n>>Das Bundes-Verfassungsgesetz verwendet den Begriff *Land* anstelle von *Bundesland*. Auch die Landesverfassungen folgen hauptsächlich dieser Wortwahl.\n\n(which I totally didn't just look up out of curiosity... /s)",
            "It's weird when Bayern calls itself Freistaat and I think others like Hamburg do so too",
            "It said 2022 and 2023 as the numbers. It was probably quite dumb to use wikipedia as the source\n\n[https://en.wikipedia.org/wiki/Bavaria#Demographics](https://en.wikipedia.org/wiki/Bavaria#Demographics)",
            "Dont think there where that many Ukrainians abd Syrians 30 years ago .",
            "Also if they were they would have likely gotten the German citizenship.",
            "Yet Turks are counted.",
            "Dresden and Leipzig together make up short of 30% of the total population of Saxony. Both are famous for being bastions of diversity in that country and the reason why AfD has no simple majority yet. So I understand your assumption.",
            "Nationality. And it just makes sense because the giant Turkish community pulls in other Turks. Turkey has 85 Million people which is more than 4 times that of Romania and twice that of Ukraine. Shouldn't be that surprising honestly.",
            "Where did he mention his sources *in the Post*? I obviously not going to dig through the comments for something which should be part of the post. And he himself said it is a bad source ...\nThe Table of the Bavaria Page cites a page from 2018 which can't be reached and that was just  me looking at it for 1 minute",
            "Döner is amazing food though. Even a bad Döner is better than what you can buy in most bakeries here. And that means a lot because our bakeries are not bad at all.",
            "You’ve clearly never ever been in rural Bavaria.\n\nOr as American colleagues of mine have said: we’ve been coming to Germany annually for over 30 years. But we’ve never met a German. Only Hanseaten, Bayern, Rheinländer, Hessen and Sachsen.\n\nGermans are only German according to UD and when it comes to sports, especially soccer. It’s not that long ago that their athletes didn’t even seem to know the text of their anthem. On the other hand, every Bavarian school child knows the Bayernhyme (Bavarian anthem)",
            "Well, Bavarian was a kingdom until 1918? Doesn’t that make it a nation?",
            "The German definition of Migrationshintergrund is indeed total brainmelt. \n\n- People who’s family have been in Germany for generations are counted in that group, just because they never applied for citizenship\n\n- as well as the children of parents that are ethnic German and who’s family have always held citizenship, just because one of those parents was born outside of Germany, eg in Austria. \n\n- and third generation Russlanddeutsche who still live in that subculture and speak bad German are not in that group \n\nThe term is plain stupid and useless. It can / must be ignored for the sake intelligent discussion. As do any statistics figures derived from the definition.",
            "What are you talking about? WW1??  \nTurkish guest workers came mostly in the 1970s. In 1961, so 16 years after WW2 there were not even 7000 Turks in Germany.",
            "The 50s to 70s. Not after WW1 came the [Gastarbeiter ](https://en.m.wikipedia.org/wiki/Gastarbeiter)",
            "Then it has been more than 100 years, and most of them would be 3rd or 4th generation of the immigrants, which makes them rather natural-born Germans!",
            "No more just assimilated(German citizens). They also more spread out.\n\nThey are still around 900k Poles in Germany, which is the 5th largest.\n\nThe numbers of Syrians is also starting to fall, as they take German citizenship.\n\nForeign population in Germany(German)\n\nhttps://www.destatis.de/DE/Themen/Gesellschaft-Umwelt/Bevoelkerung/Migration-Integration/Tabellen/auslaendische-bevoelkerung-geschlecht.html\n\nNew citizen by \"former\" nationality(German)\n\nhttps://www.destatis.de/DE/Themen/Gesellschaft-Umwelt/Bevoelkerung/Migration-Integration/Tabellen/auslaendische-bevoelkerung-geschlecht.html",
            ">most of the German Population got smoked, during the Ostfront and the Volkssturm.\n\nThat's just plain wrong.",
            "Croatia's starting 11 for this Euro is 18% Bavarian born.",
            "Many have their kids living with the grandparents in Romania and fly there on the weekends. The small airport of a neigboring town flies to Suceava, Iași, Târgu Mureș, Cluj, Sibiu and Bucharest twice a week.",
            "For jobs? Yes, that's precisely the reason they go there.",
            "They're immigrant groups that are represented strongly in Bavaria.",
            "There’s a lot of Serbs, Slovaks, Croatians, Bosnians",
            "Well I can imagine! Everyone needs to escape that shithole sometimes 😂",
            "There are very few Sinti is romania. They are prominent in Germany, Northern Italy, Transdanubian Hungary",
            "Since this is about nationality, they probably are",
            "I’m sorry, I’m confused. Why do Romanians and the Roma culture be merged?",
            "I can't believe I forgot Indonesia-\n\nI've betrayed y'all",
            "Yup, Poles tend to stay close to the polish speedway also known as A2.",
            "I am from Bavaria…\n\nInteresting! Today I learned (…).\n\n But it makes sense. The radio station in „east“Germany is called middle german broadcast (Mitteldeutscher Rundfunk).",
            "Bavaria, Saxony and Thuringia call themselves Freistaat, Hamburg calls itself Freie und Hansestadt and Bremen calls itself Freie Hansestadt.",
            "Hamburg is official \"Freie und Hansestadt Hamburg\", similar to Bremen \"Freie Hansestadt Bremen\". there are historical reasons for these two and why some Bundesländer (Bayern, Sachsen ,Thüringen) call themselves \"Freistaat\" (aka free of monarchal reign), although there is no monarchy in power in any Bundesland. Bundesländer Baden-Württemberg and Niedersachsen e.g. dont call themselves that, coz there is no historical precedent for that name in these areas as a whole, but they only formed after 1945 out of what were formerly multiple Länder. Or take Sachsen-Anhalt, which was before the nazis partly \"Freistaat Anhalt\" and partly parts of the prussian province \"Sachsen\", so only half of the territories had the name \"Freistaat\" in it, thats why they didnt use \"Freistaat\" again later on.",
            "Not that weird really. I think it's just meant to emphasize the federal nature of the constitutional arrangement. The states of Mexico are (all?) officially referred to as \"Free and Sovereign State of X\", despite not being sovereign states in the normal sense of the word, as used in Political Science.\n\nSimilarly, the South African province called Free State is named for its historical predecessor polity, the Orange Free State, while the former French region of Franche-Comté (now part of Bourgogne-Franche-Comté) takes its name from the historic Free County of Burgundy.",
            "Freistaat is just another (older) word for republic.",
            "Hmm ok. I cant believe the numbers from Bavaria. Even now that i read it on Wikipedia. I live there since im born (37 years) i know a few romanians, but there are a loooooooooot more people from other countries. My russian and turkish friends for example. Those were the nationalities i grew up with most. (Beside german people ofc ^^)",
            "[deleted]",
            "There are only 2 million Turkish citizens in Germany. The rest of the ethnic turks in Germany have German citizenship.",
            "I'm German and I identify with Germany more than with any state.",
            "well there's a difference between regional identity and nationality too, the states aren't considered nations anymore\n\nbut idk I'm not deutsch lol",
            "As were others like Saxony, Würrtemberg. Hamburg was even longer a free city/independent.",
            "Not necessarily. Nation ≠ state, the existence of either doesn't imply the existence of the other.",
            "They came after WW2 not ww1 and most since the 1960ies.\n\nAlso Germany has citizenship based on the citizenship of your parents. If your parents don't have citizenship you don't get citizenship at birth.",
            "Then let me put it differently, most of the German Population, who are able to work, got either smoked or ended up as war prisoners. \n\nEvery Person with a minimum Age of 10 and the ability of carrying a Panzerfaust got to the Ostfront, while the SS troops remained to guard the coasts.\n\nNow to the Volkssturm, where the survivors of the ostfront, the ss and every single remaining citizen, not capable of carrying a Panzerfaust, (kids under 10 and pensioners) was forced to Fight, till the end of the war.\n\nChild Labour was common during the rebuilding of Germany, because there wasn't much Adults around to effectively rebuild and the people who where freed from the kz and vz, understandably, didn't wanted to stay here at all.\n\nThe Allies even had to put Nazi officers in official positions within the government because there weren't much alternatives.\n\nSo our Turkish friends came for our aid, mainly in NRW, with many men capable of work and rebuilding.\n\nCorrect me if iam wrong (i ain't)",
            "Fun way to say 2 out of 11",
            "True, met many people in Romania whose parents/other relatives were in Germany for work. Have an uncle doing this myself. Just didn’t know that most of them were in Bavaria.",
            "So surely nobody else goes there for the jobs and prefer other parts of Germany. Ok :D",
            "That would be about citizenship. Sinti and Roma are different nationality to Romanians.",
            "Not the case with the term Freistaat. In that case it just means free from monarchy.",
            "These statistics are about citizenship.\n\nMost \"Russians\" in Germany are ethnic Germans from the former ussr who were given German citizenship immediately when they arrived in germany.\n\nMany turks, especially the younger generation, have also been given German citizenship or have naturalised.\n\nRomanians, as a more recent immigrant group have not yet naturalised in such big numbers and as EU citizens the incentive to do so is also not that big",
            "Nationality and ethnicity are different things.",
            "Then why is Romania in Bavaria counted?",
            "Well, of the groups shown in the map, two came as refugees from wars, not for jobs. And Turks came in the 60s and 70s, when Bavaria was behind many other states in terms of economic outlook.\n\nThat's why Bavaria is strongest when it comes to nationalities who came here mostly for jobs in the 90s and later. And that's Romanians, Yugos, Poles among others.",
            "Nationality = citizenship. Take a look in your passport mate. What you’re talking about is heritage.",
            "Now this is the answer I was looking for. Thank you",
            "Much better answer. Not sure if you understood the irony of my last posts. ;)",
            "What he's talking about is ethnicity, but other than that you're right.",
            "If course it doesn’t =. My friend is Ukrainian but his passports is Irish. His nationality didn’t change because he got a piece of paper few years ago. Citizenship is an administrative term whereas nationality is cultural / ethnical. \n\nThere are plenty of countries that house multiple nationalities who share citizenship. Look at Northern Ireland - you got Irish, Scots, English all different nationalities yet they all have UK citizenship.\n\nI do agree however that for most people citizenship is same as their nationality but there is plenty for which it’s not.",
            "Yeah, but ethnicity = heritage man lol",
            "Ethnicity is a part of nationality. \n\nNationality is something that determines which nation one belongs to.\n\nCitizenship on the other hand determines which country one belongs to.\n\nYou got nations that reside in two or three different countries and have different citizenship because their native lands through political decisions got split between countries.\n\nAn example would be Poles in Belarus, Ukraine and Lithuanian. They all have different citizenships but are as polish as a guy from Warsaw.",
            "You’re just not right. Of course he has the Irish nationality and also the Ukrainian if he was allowed to keep it. It’s heritage you’re talking about.",
            "That’s the citizenship you are talking about. When he got Irish passport he had to renounce his Ukrainian citizenship not his nationality. \n\nNo i am not talking about heritage. I am talking about the difference between citizenship and nationality.\n\nI qualify for German citizenship, i can apply for it on Monday and will get it no problem. It would change my citizenship but not my nationality. The only difference in my life it would make is visa free travel to few more countries and ability to vote for Bundestag.",
            "Take a look at your passport and it will say nationality. That’s all I’m saying ;)"
        ]
    },
    "GDP (PPP) per capita by country in Europe (OC)": {
        "title": "GDP (PPP) per capita by country in Europe (OC)",
        "score": 1563,
        "url": "https://i.redd.it/tutj4r8r6z7d1.png",
        "content": "",
        "num_comments": 404,
        "comments": [
            "Always fun to see Ireland in these maps.",
            "So Spain reversed the sorpasso of Czechia and Lithuania?",
            "r/portugalcykablyat",
            "Didn't know we Italians are basically at the UK's level. Except we got an Euro 😎",
            "I don't know how accurate this is, but on all these maps about GDP/capita Ukraine and R. Moldova are always fighting for the last place. Which is sad really.",
            "Oh yes, Ireland. Huge GDP, meanwhile no one can actually afford to buy a house",
            "In eastern europe you can see a clear difference between EU member states and other countrys",
            "Ireland is weird since starting positions at one of the big five consultant firms with a master degree earns you less than you get working at a construction belt for a car company in germany, is this because big tech companies have their HQ there and the managers raise it so dramatically ?",
            "Do you have maps for the rest of the world with the same colour scheme? (Please)",
            "Italy is at the same level of UK?",
            "how does Iceland make that much selling fish?",
            "Lol Ireland",
            " Europe is a fascinating place when it comes to GDP per capita. You've got countries like Luxembourg, Ireland, and Norway leading the pack. Then you've got some lesser-known gems like Czech Republic and Estonia holding their own.",
            "Wow, it rose so much, I still remember when it was 20.000$ for Uk and 14.000 for Ireland. Funnily that was a reason why number 20 was my favourite for a while",
            "If this is not a massive ad for the European union, I don't know what is. Look at how much more developed all the eastern European countries that joined the EU are. Places like Slovenia, Estonia and Czech Republic are basically at the same levels of western Europe which is really great to see and an amazing praise for the EU.",
            "Top marks for the colour scale UNTIL you get to the bottom value ($10-20,000), when it stops going from dark to light and goes back to a shade of darkness equivalent to the ($40-50,000) colour. Orange and green, the worst choices for colour blindness. If you had just kept going to a brighter yellow it would have been so much better.",
            "Liechtenstein and Monaco, which are probably the actual richest two, are both missing from the map.",
            "> Turkey performing better than Greece\n\nHeh nothing personal neighbor",
            "I'm glad I live in Lithuania \\^\\^ If sh\\*trussia wasn't our neighbour, Lithuania would be absolutely amazing place to live.  \n  \nAnd BTW, I want to say some words about Turkey (I believe OP is from Turkey, judging by username). I visited this country multiple times, I've been not only in touristic places but also in small provincial towns and even vilages. Turkey is doing absolutely great ant developing very fast. Without Erdogan, maybe today EU membership would be seriously discussed.",
            "Greece and Turkey are expensive as fuck and both countries have very huge purchasing power problems, those numbers have zero meaning for the people living in those countries. \n\n  \nGreece has a GDP per capita at around 23k (and thats inflated cause of cooked numbers our corrupt goverment makes) and has the 2nd worse buying power in the EU zone and a myriad other problems including huge inflation on food products, insane power prices, and the 7th most expensive gasoline price in EUROPE and 10th most expensive in THE WHOLE WORLD, plus negative wage growth since 2000. The value depicted here is nowhere near the reality, or to be more precise the value IS right since its GDP PPP per capita but it has zero meaning besides macroeconomics and data since the actual situation is a whole different story and the metrics and statistics those values come from are cooked (see greece recent scandals about the goverment cooking numbers to export)\n\nSimilar Italy (and thats why italians here are surprised they are depicted so relatively high ) has a ton of problems too but they have a big dick GDP that raises the values even if the average italian (especialy in the south) doesnt feel it. \n\nAnd turkey, turkey is a whole other level of shit currently, with their big ass inflation and abyssmal purchasing power eclipsing their relative good GDP. \n\n  \nThis map is a prime example of empty stats when it comes to the average redditor and it paints a totally unrealistc picture for people unfamiliar with europe's economies and societies trying to understand the economic situations in those said countries.",
            "You can see the EU’s border in Eastern Europe I can see why the remaining countries there want to join it",
            "Can this be put in comparison how affordable the life is too?",
            "French:we defeated British again ![gif](emote|free_emotes_pack|trollface)",
            "could anyone explain why ireland is so high? is everyone just earning a lot?",
            "Interesting how much closer together these appear than nominal GDP per capita figures",
            "I see The Netherlands is having a rave..",
            "What’s up with Ireland? Can anyone enlighten me?",
            "Turkey has such high inflation but still has high GDD in purchasing power? How?",
            "Could anyone have believed that a post-soviet countries would have 50k as GDP (even PPP) per cap. this soon? \n\nI live in Lithuania and see many people from Belarus. Now they can all see from themselves that Russia's propaganda wasn't true.",
            "Poland actually projected to overtake UK is hilarious. Probably a lot less Polish plumbers coming your way",
            "Shame the GDP per capita is not a very good measure at the individual level... I don't know (I think) a single person in my life that makes that much.",
            "What about Lichtenstein?",
            "Can someone tell me the difference between nominal and ppp gdp? I know stands for purchasing power but what does it affect or affected by compared to nominal",
            "When I went through Europe, the people did not strike me as rich as this chart suggests. The Germans struck me as much richer than the French, Swedes poorer than Germans, Poles richer than Lithuania, etc. Something seems very wrong here.",
            "azerbaijan never seems good :(((",
            "I don't see Monaco in the map, and it would probably double up on the richest shown here",
            "Damn i allways thought that Moldova was the poorest country in europe",
            "Hey Ireland. It’s the UK. What are you doing later?",
            "I wish you add north africa 🌍",
            "Median salary in Ireland is €37k (€31k after tax) so our labour brings in an extra €100k per person for the company",
            "Does this mean I’m getting a huge pay rise????? ( Ireland)🇮🇪 😀",
            "Time changes.. they say that in the 1950s Norway were on the level with Greece.",
            "ELI5 - are the western Balkans going to jump into the green only after (hypothetical) EU integration -  or - are the EU waiting for those countries to become greener before they’re allowed to formally join?\n\nI realize there are other political, humanitarian, etc. issues that also play into it.  I’m really just trying to ask about how EU membership (and possibly Eurozone and Schengen membership too) plays into GDP (PPP).\n\nEdit: downvotes? 🤷‍♂️",
            "Keep in mind this isn't actual wealth, it's wealth adjusted for how cheap good and services are locally.\n\nThe reason Russia seems so wealthy is that everyone is so poor that services are cheap because no one is getting good wages. That doesn't actually make them wealthy, especially if they want to buy something that isn't the result of cheap russian labor.\n\nWhen not counting the cost of living, russia is poorer than Mexico or Romania. Roughly half the wealth of Latvia.",
            "The map should clarify that this is the GPD per capita with purchasing power parity. GDP per capita current prices is 15K for Russia according to IMF and 10k for Turkey. But I guess that life is a lot cheaper there. I wonder where this come from in a global economy.",
            "Hahahahahaha 40 thousands? And Turkey? Bitch please we can't afford anything lol.",
            "This map is bullshit",
            "Seems inflated.\nHow  Romania and Turkey get 45,000$ when the USA is probably somewhere around 65000-70000$ ?\n\nAnd being French, I think France gdp per capita (even ppp) is lower",
            "Russia 38k? I thought it was 9k",
            "If we disregard outliers which are not 'normal' economies as such like Ireland, Norway, Luxembourg and Switzerland, then Denmark seems to be leading the pack.",
            "Quite surprised to see Azerbaïdjan being this low ; I would have expect more with their oil revenues.",
            "Can we stop with GDP PPP and move to the more relevant nominal GDP",
            "Damn, the Irish are loaded.",
            "I don’t trust the values for Turkey.",
            "turkey is NOT cheap. groceries cost almost the same and cars & electronics are even more expensive due to ridiculous taxes. what parameters did they use to make this bs map?",
            "Wait. Someone has to explain how Ireland is like almost 50% higher than Switzerland 🤔 🤔",
            "Lol, tell Spaniards or Italians the GDP per capita is +50k Lmao. What a shitty map…",
            "Russia & Italy, really ?",
            "The problem with that stat is, it favors small countries. Luxemburg is basically a German City-State. Not sure why they are technically independent.",
            "In Russia probably count only Moscow",
            "Ppp 😴",
            "Turkeys GDP per Capita is 14000 USD and not 43000. As always these posted maps contain wrong data. https://data.worldbank.org/indicator/NY.GDP.PCAP.KD?locations=TR",
            "turkey cant be right right? dont they have almost infinite inflation?",
            "Europoors trying to convince me their communist shithole is better than America",
            "Something happens with the numbers when you convert them to USD. Nations have different currencies and some of them has different exchange ratio vs. the dollar.",
            "PPP is pure BS. Turkey is 10K nominally. So it's multiplied by 4 with PPP?",
            "GDP per capita in Turkey is not that high. This data must be for something else or the source is wrong or the data is collected by a turkish nationalist lol",
            "Also, Armenia above Azerbaidjan seems wrong.\nKazakhstan so high is weird too",
            "Yep. Even the Irish government stopped using GDP for its economy statistics and switched to [modified GNI](https://en.wikipedia.org/wiki/Modified_gross_national_income), because their nominal GDP growth is practically meaningless.",
            "[deleted]",
            "Holy shit! I guess the pot of gold wasn't at the end of the rainbow but in Brussels.",
            "The same for Turkey bur different reasons",
            "came here to say this",
            "Skewed by Ireland being corporate tax haven",
            "scammers like their indian neighbours",
            "Spain is booming like crazy at the moment. They have the driver of brain draining South Americans since they aren't allowed in the US anymore. Also the energy policy in Spain is rock solid. Great infrastructure as well. Services sector is doing quite well",
            "Spain is very tourism-dependent, so they were hit more during COVID years, which reversed by now.",
            "Regardless to all the drama unfolded under my comment, my take is that GDP PPP is a shitty indicator. The reason these countries were performing better was cause they were cheaper. The moment inflation hits them rock hard, they’re obviously brought down.",
            "As is tradition",
            "Italy had higher GDP per Capita than the UK for parts of the 80s' & 90s'-\n\n[https://data.worldbank.org/indicator/NY.GDP.MKTP.CD?end=1995&locations=GB-IT&start=1980](https://data.worldbank.org/indicator/NY.GDP.MKTP.CD?end=1995&locations=GB-IT&start=1980)",
            "North Italy is one of the wealthiest places on Earth. South not so much.",
            "Its mega expensive in the uk tbf",
            "You haven't yet chosen to self-imprison yourselves from working in the rest of Europe.\n\nThat said, there are many other economic problems in Italy, and the worst people are pretending it is alternately immigration or organized crime, rather than wealth competition between generations and classes.",
            "“A” euro. Then E in Euro sounds like a y, so use “a” and not “an”.  English teacher here…",
            "Imagine that 30 years ago Poland was poorer than Ukraine... Mind-blowing...",
            "Yes. Ukraine was the poorest country in Europe alongside Moldova even before the invasion started in 2022.",
            "Ukraine has huge shadow economy[0] which is not reflected here. Most people receive 75%+ of their salary “in an envelope” to avoid taxes. Additionally, big transactions like car and real estate purchases are recorded as “gifts” with 1 dollar nominal price. So real GDP is way higher.\n\n[0] https://www.worldeconomics.com/National-Statistics/Informal-Economy/Ukraine.aspx#:~:text=An%20informal%20economy%20(informal%20sector,billion%20at%20GDP%20PPP%20levels.",
            "Ukraine and Kosovo in this one",
            "they are still relatively poor but a lot of their economic output is hidden in the informal economy. These economic organisations only publish formal GDP.\n\nInformal economy included (estimates by World Economics Researchers from London, [Here](https://archive.ph/mBijZ)), GDP/capita of Ukraine is 22k and for Moldova 25k. Georgia has the largest informal economy (as % of GDP) in Europe, for them it would be 37k.",
            "That's mostly because up until 2014 Ukraine didn't had a market economy - it pretty much kept the Soviet economy and foreign investments were made practically impossible, which resulted in a big economic stagnation. Meanwhile Poland switched immediately to a market economy and opened itself to investments from the outside so the difference between them is seen",
            "Is that different in any other of the countries on that map? I'm in Germany and if you don't inherit a house or wealth, you won't get one. Unless you have the 0,1% job that pays that much.",
            "That's the problem with high income countries. Property just soaks up all disposable income. People will always buy homes at their absolute limit of affordability.  I don't think property will ever be a bad investment.",
            "Young people can't buy house? Why? Why is Ireland experiencing a housing crisis?",
            "Like turkey and all the other balkan countries",
            "Lithuania best of eastern europe 💪💪💪",
            "There are no Eastern European countries that are part of the EU",
            "yep its because multinationals headquarter in Ireland and report their earnings there due to Ireland acting as a tax haven for corporate profits.",
            "I only prepared this for Europe, but may consider making another one for the entire world.",
            "PPP does some heavy lifting there, but as of 2022 on world bank and april 2024 IMF the UK was still just a little on top with ppp.\n\nThe UK is a pretty typical Western European economy. The main standouts are Switzerland and Norway. (Ireland being a leprechaun dust GDP)\n\n https://data.worldbank.org/indicator/NY.GDP.PCAP.PP.CD?locations=GB-US-IT-SE-FR-EU&most_recent_value_desc=true\n\nCountry\tMost Recent Year\tMost Recent Value\t\n- United States\t2022\t76,329.6\t\n- United Kingdom\t2022\t57,460.5\t\n- Italy\t2022\t55,442.1\t\n- European Union\t2022\t57,285.5\n\nhttps://www.imf.org/external/datamapper/PPPPC@WEO/OEMDC/ADVEC/WEOWORLD\n\nThis is april 2024 imf gdp per capita ppp that OP is pulling from if you want to see the rest of the world.\n\n> GDP per capita, current prices \n> Purchasing power parity; international dollars per capita\n\n- Switzerland 91.9\n- US 85.37\n- Norway 82.8\n- Germany 67.2\n- Canada 60.5\n- France 60.3\n- UK 58.9\n- Italy 56.9",
            "Nominal lower but PPP similar due to prices being lower in Italy compared to UK",
            "If you excluded London, the UK would be the second poorest nation in western Europe, only ahead of Portugal. Malfunctioning welfare programs, deindustrialisation, cocked up privatisation, neoliberalism and 14 years of Conservative Party rule have taken their toll on the country.",
            "Which did you think was wealthier?",
            "I think you meant Czech Republic and Lithuania",
            "Don't forget it's PPP. Not plain GDP per Capita",
            "Data for some reason didn't include them",
            "Competition & collaboration 😏",
            "you spoke positive about my country we are best friends now",
            ">And BTW, I want to say some words about Turkey (I believe OP is from Turkey, judging by username). I visited this country multiple times, I've been not only in touristic places but also in small provincial towns and even vilages. Turkey is doing absolutely great ant developing very fast. Without Erdogan, maybe today EU membership would be seriously discussed.\n\nAll you say could still happen one day, who knows. I also wish the best for Lithuania!",
            "How does Russia do Lithuania? As far as I know you two don't interact much",
            "Yeah you guys basically have Western Balkan living costs with double the salaries",
            "Still needs innovation in sectors to export, judicial reform and stronger education",
            "Хахаха проебалту русские в штаны насрали, как всегда!",
            "This metric by definition takes into account purchasing power",
            "GDP PPP shows a distorted reality for each and every country. Idk why you make a fuzz over specific countries. The vast majority of people are not earning anywhere close that number. GDP PPP per capita is the countries productivitiy divided by its citizen. It essentially just shows how much value each citizen is generating (mathematically).",
            "Greece being second to last in the EU (Благодаря, България) is a good indication that the metric is pretty accurate.",
            "exactlyyy! i dont know anything about what this numbers mean but i can say that as a turkish i cant even fucking afford meat and i will never ever be able to buy a house",
            "you mean like Cost of Living/Price Levels? There's data about it from the OECD for example, most recent data: [here](https://data-explorer.oecd.org/vis?tm=price%20levels&pg=0&snb=85&vw=tb&df[ds]=dsDisseminateFinalDMZ&df[id]=DSD_PPP_M%40DF_PP_CPL_M&df[ag]=OECD.SDD.TPS&df[vs]=1.0&lo=1&lom=LASTNPERIODS&dq=.M....&ly[rw]=REF_AREA&ly[cl]=COUNTERPART_AREA%2CCURRENCY&to[TIME_PERIOD]=false) and for 2022: [here](https://data.oecd.org/price/price-level-indices.htm)",
            "cost of living/affordability is one thing. for example based on this map Hungary and Spain are close but when it comes to the quality and selection of those goods they are not even remotely comparable.",
            "Isn't PPP basically that? Otherwise the map would show nominal GDP, not PPP GDP.",
            "That’d be helpful. Scandinavian countries are outrageously expensive. I was barely able to afford McDonalds in Norway, €5.8 for just one big mac, it’s €1.4 here.",
            "Tax haven. GDP is not a good measure of earnings there. GNI is a far better measure",
            "Corporate tax haven.",
            "Cause PPP is kinda arbitrary and depends on what products you compare. Also this is still GDP divided by population so it doesnt actually mean anything for most people, you'd need to use median income for that which I'm assuming for Turkey is a lot lower even when adjust for PPP.",
            "What does Monaco produce at all?",
            "Relieving the issues for most corporations while the housing crisis, health services, and everything else continue to go down the shitter. Hbu?",
            "I may consider preparing another map that covers the entire world.",
            "They might say that. But it's a false claim. In 1950 the Norwegian GPD per capita was $8655. Quite a lot higher than Greece with $3052. Norway was among the richest nations in the World even before the oil. Just not as rich it is today.\n[Source](https://ourworldindata.org/grapher/maddison-data-gdp-per-capita-in-2011us-slopechart?country=NOR~GRC)",
            "Norway has always been one of the wealthiest countries in the world",
            "Yeah, and then in the 60s we got pil",
            ">ELI5 - are the western Balkans going to jump into the green only after (hypothetical) EU integration - or - are the EU waiting for those countries to become greener before they’re allowed to formally join.\n\nEU expects financial development at some level but it's OK to join the EU as long as your institutional and legal preparedness is compatible with the EU law.\n\n>I realize there are other political, and humanitarian, etc. issues that also play into it. I’m really just trying to ask about how EU membership (and possibly Eurozone and Schengen membership too) plays into GDP (PPP).\n\nSchengen would optimally cause a significant rise in GDP PPP value, but new members cannot suddenly join Schengen area as it has important outcomes such as increased migration rates.",
            "no doubt that a lot of people are struggling in Turkey but it's GDP PPP (Purchasing Power Parity) which adjusts to price levels and compares it against price level in the Usa, Turkey's price levels are very low despite being a developed country.\n\nAccording to most up to date OECD data, price levels in Greece are 96% higher, Colombia 39% higher, Chile 64%, Mexico 104%. Data: [Here](https://data-explorer.oecd.org/vis?tm=price%20levels&pg=0&snb=85&vw=tb&df[ds]=dsDisseminateFinalDMZ&df[id]=DSD_PPP_M%40DF_PP_CPL_M&df[ag]=OECD.SDD.TPS&df[vs]=1.0&lo=1&lom=LASTNPERIODS&dq=.M....&ly[rw]=REF_AREA&ly[cl]=COUNTERPART_AREA%2CCURRENCY&to[TIME_PERIOD]=false)",
            "The US value is $85,372, which would position it 4th in Europe, despite huge population. Since purchasing power parity pins local currency to the international dollar, the value of USD is disregarded in this scenario.",
            "It is about how much thing you can buy in that country with money earned in that country. It does not take into account the product quality. Gdp nominal is about international purchasing power. Gdp ppp is local.",
            "Romania is just that good.",
            "Because GDP(PPP) is real shit, this figure has nothing to do with reality",
            "[deleted]",
            "What’s not normal about Norway and Switzerland?",
            "\n\nCross border workers inflate Luxembourg's GDP. They contribute to the nominator but not the denominator. \n\nIreland is high because of multinationals doing multinational stuff (transfer pricing, profit sharing, IP migration etc).",
            "Norway is certainly a ‘normal’ economy.",
            "All of those countries are normal except ireland.",
            "Apple, Google, Intel, Meta etc certainly are anyway",
            "Except for Ireland's number being artificially inflated due to lots of large foreign companies being based there, GDP PPP is more about being able to afford stuff and not about being loaded. Wealth per capita is closer to being loaded.",
            "Redditor got a better financial expertise than the International Monetary Fund.",
            "Groceries do not cost the same as in Europe lol. Also Turkish property prices are very low outside of İstanbul, İzmir and Antalya. I guess someone hasn't been to an Anatolian city, İstanbul is a very bad indicator of Turkey.",
            "Ireland is just a tax haven.",
            "Switzerland is extremely expensive, that's why. Swiss in Switzerland is not that rich but has a high quality of life. But if a Swiss goes for a trip with money that earned in Switzerland,  they become rich because of high gdp nominal value.",
            "It’s hilarious that I’m getting downvoted for asking honest questions about a subject I don’t know a lot about. Like, how do yall think people learn things? Osmosis?",
            "It's GDP PPP.",
            "The map is based on GDP per capita with purchasing power parity, not GDP per capita alone.",
            "It has nothing to do with inflation. PPP value fixes local currency to the international dollar, pointing out the real purchasing power.",
            "There’s no ‘communist’ country in Europe but well done for convincing us Europeans that our education system is lightyears ahead of your yellow bus school shooting system you’ve got going on over there.",
            "You get GDP per capita when you convert them to USD. GDP (PPP) per capita measures a scenario where local currency is pinned to USD.",
            "Nominal 10K is because of the USD exchange rate. PPP shows the real purchasing power parity. This measures a scenario where all local currencies are fixed to the international dollar.",
            "Again.\n\n1. This is not GDP per capita, this is GDP per capita with purchasing power parity.\n2. This data was prepared by the International Monetary Fund. I didn't know IMF was composed of \"Turkish nationalists\".\n3. You could always refer to the \"Source\" section, which is also included in the image.\n\nMaybe you should read it properly before commenting.",
            "Nope it's correct.Our government is managing to fuck up our economy even though we are selling tons of oil",
            "Kazakhstan has a lot of oil which it exports",
            "Why is it meaningless?",
            "And 52% of all corporation in Ireland tax was collected from just 10 companies in 2023. Here’s the full stats.\n\nTax from Top Ten Companies\n* 2012: 34% (€1.4 billion)\n* 2013: 36% (€1.55 billion)\n* 2014: 37% (€1.72 billion)\n* 2015: 41% (€2.8 billion)\n* 2016: 37% (€2.76 billion)\n* 2017: 39% (€3.23 billion)\n* 2018: 45% (€4.67 billion)\n* 2019: 40% (€4.39 billion)\n* 2020: 21% (€5.98 billion)\n* 2021: 53% (€8.17 billion)\n* 2022: 57% (€13 billion)\n* 2023: 52% (€12.3 billion)\n\nIreland's wealth is quite precarious.\n\nhttps://www.revenue.ie/en/corporate/documents/research/ct-analysis-2024.pdf",
            "15% corporation tax as of Jan 2024 same as 140 other countries and set by OECD but keep telling yourself that.",
            "It's not a tax haven. Don't blindly believe all the stuff you hear and parrot it. \n\nIt competes better on corporation tax and the fact that a lot of US and other countries companies headquarter there, plus a low population skews the GDP figure.",
            ">They have the driver of brain draining South Americans since they aren’t allowed in the U.S. anymore\n\n\n\nIt’s more that Spain (and Portugal) lets so many Latin Americans get a fast track to citizenship. And they usually get visa-free access which also makes it easy to stay.",
            "Does the government pay you to write this stuff? Spain has the highest unemployment rate in the EU, pensions are paid with debts, economic growth is based on debes, etc.\nIf it wasn't for the war in Ukraine and the higher energey cosas, Czech Republic would (most likely) have increased its advantage over Spain.\nAnd no, there is no brain draining from South America: educated latinos make much more money in the US than in Spain. Most latinos in Spain don't have a university degree or vocational training.",
            "I literally have no idea what you’re talking about with “they aren’t allowed in the US anymore.” 2020 to 2022 was the single largest increase of foreign born residents in our nations entire history.",
            "Spain should try reaching out to Asian countries, particularly the Philippines, to brain drain them if the excess pool of Latin American skilled laborers and professionals run out within this decade. Filipinos are the perfect kind of immigrants that are assimilable to the mainstream Spanish culture.",
            "Enjoy the great infrastructure and weather from Momma's basement until you're 42 then you can move to a flat shared with 3 strangers Hell yeah brother 😎",
            "Hmm. Food production is massive here too. Also they're the biggest wine exporter in the world now",
            "Very true, GDP PPP is an irritatingly meaningless statistic and it comes across as lazy when people use it.",
            "The exact opposite of the U.K. then 😂",
            "\"I 'ate the north\"",
            "Is there a reason why? South Italy has 10x better weather and the sea, I'd assume it'd be more wealthy there",
            "It's only mega expensive if you want to live somewhere that other people enjoy living in. Plenty of dead \"coastal resort\" towns in the norf that you could live in for West Virginia prices.",
            "33 years is a long time tbh.",
            "30 years ago Hungary was the wealthiest country of eastern europe... now look at us... look at our pocket dictator. Also mind-blowing :D",
            "To put it into perspective.\n\n30yrs ago, German GDP/capita was ~30k, now it is ~45k so 50% increase.\n\n30yrs ago, Polish GDP/capita was, ~3k, now it is ~15k so 500% increase and still growing at about 3-4%/year.",
            "God bless the EU",
            "Wasnt it the poorest befour invasion tho ?",
            "Unofficial economy is huge in Ukraine. Majority of people receive part of their salary under the table",
            "Invasion started in 2014, when Ukraine was wealthier than even in 22, after 6 years of relative peace",
            "Do you know what is funny? Before a fullscale invasion, the minimum salary in Ukraine was higher than in Russia",
            "Well, there was another invasion in 2014 which costed Ukrainians Crimea and a big part of Donbas which is actually richer part of the country with resources and industry.",
            "GDP taking into account the shadow economy still less than the neighboring countries. In any case, the countries of the former USSR have a high proportion of the shadow economy. They all have a roughly comparable level of the shadow economy, because all these countries experienced a crisis of governance in the 90s, although now the situation is improving.",
            "This is bollocks, Ukraines economy was decimated by the collapse of the USSR and the privatisations that came after it. It's [GDP has never managed to recover to the levels it enjoyed in the USSR](https://html.scirp.org/file/5-7203350x4.png?20230531090327260)",
            "You are right, expensive housing is a huge trend in basically every country out there. But its expecially bad at the Netherlands and Ireland\n\nAnd Ireland's GDP per capita doesn't really translate in a rich population overall... most of that cash never really enters Ireland. Its all about that juicy corporate-tax regime.\n\nFirms generate much of their income in Ireland, inflating its GDP, but funnel that money to their headquarters (or shell companies) abroad.",
            "Buy house in Ukraine while its cheap :)",
            "It is not. Latvia housing still affordable and downpayment can be loaned by government.",
            "Ireland isn't actually particularly high income, its GDP numbers are juiced by the fact that it acts as a tax haven for a lot of multinational companies who of course claim all their earnings in Ireland despite making all that money in other countries.\n\nits probably the biggest example of how flawed GDP can be as an economic indicator.",
            "So back in 2006-2008 Ireland had a building boom and was building too many houses. The financial crisis hits and irelands economy crashes. This kills off a lot of building companies and builders emigrate to Australia, Canada etc. Many also retrain in other industries.\n\nIreland economy starts to recover from ~2012 but the building industry is still dead, not enough houses are being built. From 2016-present day Ireland economy is booming again but the building industry as a whole is severely lacking and not enough houses are being built. \n\nAs a result of this booming economy we have large immigration, couple this with refugees from Syria, Ukraine (~90k people at the peak) Irelands population is growing at a massive rate and house building is way behind where it should be.",
            "some irish person on r/Ireland said housing is so expensive there on purpose, he called it a Mafia and apparently housing owners and the government are working together to inflate property values. I don't see any other reason why it would be so expensive.\n\nOECD has data about ''Housing, water, electricity, gas and other fuels'' Price levels.\n\nIn 2022 Ireland was at 109 (USA = 100)\n\nOther Island countries: Malta 35, Cyprus 46, Australia 91, New Zealand 111, UK 101, Japan 63, Iceland 90 ([Source](https://data-explorer.oecd.org/vis?tm=price%20levels&pg=0&snb=85&df[ds]=dsDisseminateFinalDMZ&df[id]=DSD_PPP%40DF_PPP_CPL&df[ag]=OECD.SDD.TPS&df[vs]=1.0&lo=4&lom=LASTNPERIODS&dq=.A....&ly[rw]=REF_AREA&ly[cl]=ANALYTICAL_CATEGORIES&ly[rs]=BASE_REF_AREA&to[TIME_PERIOD]=false&vw=tb)). New Zealand is very isolated in terms of location and probably needs to import nearly everything for construction so it's not surprising that they are slightly worse off than Ireland.",
            "Ireland was a poor European country, until the 1990s. Then, whoosh! Apple, Microsoft and others (thanks to a 1990s tax treaty between the USA and Éire) noticed ... English-speaking, highly educated young population? Hell yeah! Let loose the Celtic tiger ... and as the country had half the population it had one years prior, well, primed for growth.\n\n\nLayer on top, sudden surge in progressive politics (divorce legalized, the Church is corrupt), and so... more people! Population goes up... There's demand for housing... supply doesn't keep pace.\n\n\nOh, yeah, lots of politicians are landlords? And south-siders already have their own (inherited?) gaffs... so who wants affordable housing, when that means the value of YOUR property won't be as high as Sugarloaf? Anyone can protect to Planning about ANY development? NIMBY is happy!",
            "Slovenia is 1st",
            "Do nominal gdp per capita",
            "Probably that would also be truth for France if you exclude Paris region.",
            "source?",
            "Yeah, London is pretty much carrying the UK",
            "London is one of the most expensive and wealthiest cities in the world but much of the country is still in post industrial depression and neglect. So if you only ever knew London you would have a warped impression of the country.",
            "Italy has sunlight and edible food",
            "All of them are incredibly wealthy by global standards.",
            "I watched a really good Economics Explained video about Türkiye recently, it’s actually kinda sad because as a country it has an amazing opportunity to become a wonderful economic powerhouse with really good underlying fundamentals, but political fumbling has caused such bad and consistent inflation that’s undercut the really great work that the populace are doing. It would be amazing to see what it could do with competent leadership.",
            "Teşekkür ederim!",
            "We did shit in their pants and they’re grumpy now.",
            "Check Lithuania history section on Wikipedia and then read from about 1450 onwards",
            "Ussr still impacts Baltic economies in terms of ways of doing business, corruption, ineffective infrastructure, ineffucient housing, election culture. \n\nRussia also impacted and still impacts in forms of sanctions, illegal trade, propaganda which impacts portion of population.\n\nUssr generation still is alive and in charge of many businesses and institutions, politics.",
            "Им нужно кого-то обвинять в своих неудачах.",
            "The GDP doesn’t show about how expensive life in country is. Just about the sum of thr goods and services a country produced by country. PPP is it but it’s weird that it’s written like it’s the same.",
            "They're ranked just as high in terms of GNI",
            "Tax avoidance, gambling, great weather, and strict paparazzi laws.",
            "we got *oil*",
            "US gdp per capita is 78,000$.\nHow can the ppp value of gdp being higher than gdp for the USA considering that cost of living in the US is very high ?",
            "Source is the International Monetary Fund, not Turkish statistics agency.",
            "Norway because of oil/gas. Switzerland because of being a rich people haven.",
            "It's not because of oil/gas.",
            "Sorry, I was trying to be sarcastic.",
            "The reality is Pharma & Biotech manufacturing sectors account for the majority of Ireland's GDP, the IT sector is not as profitable as extorting sick people.",
            "Wow i never knew.",
            "He has a  Point . Your data is true but meaningless without inflation and taxes adjustment..the only cheap thing in Turkey is street food nowadays.both for tourists and locals",
            "aren't you that guy who always talks about how european turkey is on r/europe and gets downvoted to oblivion? lmao\n\nturkey is poor asf bro deal with it",
            "git r/grocerycost'a bak öğren ne kadar tutuyormuş. et türkiye'de bırak aynı olmayı, 2 kat daha pahalı. orada 15-20k € olan arabaya burada 40k € sayıyorsun. orada 1500€ olan telefon burada 3000€. böyle istatistiklerle avunmaya devam edin siz.",
            "juice your GDP with this one simple trick, Economists hate it.",
            "I understand why Switzerland is high. I do not understand why Ireland is high.",
            "Which demonstrates how difference in standard of living between southern and Eastern Europe and northwestern Europe is significantly smaller than what nominal tells us due to the significantly lower cost of living",
            "Yeah, you tell that to the average south european, they are going to love it",
            "Dude jumped on that conclusion without even reading the title.",
            "PPP conversion factors are supposed to mean \"you can buy as much for X units of local currency in this country, as you could for $1 in the US\".\n\nFor e.g. Austria, it's 0.7, so 0.7€ in Austria is worth as much as $1 in the US. For Slovakia next door, it's 0.49, so 0.49€ in Slovakia is worth as much as 0.7€ in Austria and as much as $1 in the US.",
            "Plus when differences in terms of local general price level compared to the US-which is indexed at 1 are also taken into account. Countries more expensive than the US have lower ppp than nominal gdp and countries that are cheaper than the US have higher",
            "local currencies isn't necessarily pinned to the dollar. Think the numbers are values just calculated to USD by exhange rates. USD vs NOK doesn't follow the same path as USD vs DKK etc.",
            "Yep, Turkey’s low nominal figure is largely due to very weak Turkish Lira. Also PPP takes local cost of living into account and is more accurate at gauging actual local living standards than nominal",
            "Oh ok sorry, I just read and didn't care about whats in  the parenthesis",
            "Many US multi-national corporations recognize their European revenue in Ireland for the tax benefits.",
            "Ireland has a really low effective Corporate Tax rate and is in the EU.\n\nThe EU has freedom of movement for capital.\n\nSo, say you are Google making billions in the EU and you want to pay the lowest tax possible. You set your HQ in Ireland to use their tax scheme and pay very little tax on your profits. \n\nThis increases Ireland GDP. But 99% of sales are not in Ireland, so it is not really 'irelands' GDP, it's an illusion. \n\nSo when you measure anything using GDP with Ireland the results are very misleading and leads to things like this where it is over twice that of the UK.",
            "tax havens don't benefit from gdp as much as other countries. GDP is just money circulation. Barely contributes anything if there is little to no tax in the areas where the most money circulates.\n\nEdit: And, while I'm not entirely sure what contributes to gdp, a large share of salaries in Luxembourg end up outside the country. This means that companies' revenue that goes to pay foreigners is counted as a story of money flow, but the benefits aren't seen for many of the people working there because they tax their income to other countries.",
            "In addition to the Ireland specific answers you got, GDP mostly just tracks money moving around in an economy. So it's not really a great measure of a lot of things it gets used for. Real estate transactions are counted in many GDP estimates for instance but for most of those transactions, nothing is being produced. As economists often say, all models are wrong, some are useful.",
            "Per capita sounds like it shows how wealthy people are but it is not as we see on the Ireland example. Better check something like median disposable income.",
            "It’s a figure that more shows how much money flows around - an imported pen for 1 dollar that are sold for 5 dollar is 4 dollar generated",
            "You'll find the vast majority of smaller nations especially first world ones, have a huge chunk of corpo tax from not many companies. This isnt an extreme whatsoever..",
            "lol yeah only on paper mate, Apple, Msoft, Google and co pay an effect 0-1% tax rate. There are loopholes set up to avoid paying most of the 15%",
            "you just gave a definitione of a tax heaven",
            "> says it's not a tax haven \n\n> proceeds describe it with the definition of a tax haven",
            ">It competes better on corporation tax\n\nyes that is what a tax haven does.",
            "They have their historical lowest unemployment ever in 5/10Years, Valencia has become one of the world expat centers (keep in mind structural level is higher historically and culturally in Spain relatively to Italy and other peers), country is attractive as fuck, especially since they have been carving out new industries",
            "I know plenty of \"latinos\" well educated, working on IT, Finance, Marketing, Healthcare... You name it. They are brilliant.",
            "Haha you are vox",
            "Are you talking about Latins or South Americans? You mentioned both.",
            "Exactly, a toilet cleaner on America makes much more than an educated professional on Spain",
            "They are not increasing the H1B quotas meaningfully for years.\nSo it's harder and harder for educated people to get in the US.\nIllegal immigration is another issue altogether.\nBut if the US refuses educated people, other second choices countries benefit.",
            "Trump could bark but he loves cheap labor willing to work for cheaper than minimum wage and working longer far longer hours",
            "Could you elaborate? I may sound ignorant but in terms of standard of living Scotland and England are similar aren’t they?",
            "There are a ton of reasons but in short:\n\nNorthern Italy had a stronger middle class and a stronger focus on mercantilism during the Middle Ages because it was divided in city states, so the nobility focused on the cities much more than your average European noble, whereas Southern Italy had a more typical feudal landlord style nobility as it was more or less unified throughout the middle ages (And even when it wasn't, it was not nearly as fragmented as Northern Italy).\n\n\nFor most of the middle ages, Northern Italy was safer from incursions, because whatever incursion from Africa would land in Southern Italy, and the Alps meant even France and the HRE would have a hard time invading.\n\n\nEven when foreign powers *did* carve up the peninsula, Southern Italy faced direct conquest from Spain (Note that at this time Southern Italy was still actually very wealthy, just not as much as Northern Italy) which was all too happy to milk it dry to fund its wars.\nAlso they favored centralisation around Naples, which did make it a centre of culture and economy but also severely hampered the development of the rest of Southern Italy. Meanwhile France preferred to make the existing Italian city/regional states into client states for the most part, allowing them to maintain a degree of autonomy.\n\n\nThe biggest reason is of course industrialization, it started in the UK and made its way southwards, which means Northern Italy industrialised first (Southern Italy did develop some industrial hubs of its own but owing to its more centralised nature it was only in a few key cities like Naples or Taranto).\n\n\nThe unification of Italy was spearheaded by the Kingdom of Sardinia-Piedmont which extended its laws to the entire peninsula, which meant the following economic policy of the kingdom of Italy favoured heavily Northern Italy (Whose economic structure was closer to Piedmont's) over Southern Italy.\n\n\nRight after the unification, Southern Italy faced what in Italy is known as \"brigantaggio\", a massive wave of criminality which drove away investments further and is the origin of what is today known as mafia. It also made Southern Italy into a political hot potato politicians did not want to deal with, the first actual plans to address the \"Southern question\" were drafted by the first De Gasperi government, in the wake of the post WW2 reconstruction. \n\n\nIt *has* improved a lot since but think about how much different East and West Germany are, owing to the Cold War which didn't even last a full 50 years, Southern and Northern Italy have followed different historical paths one way or another for over a millennia.\n\n\nObviously i could go more in detail, there are a whole lot of books written about any of these points, but i hope it gave you an idea.",
            "Weather depends on what you consider nice weather. I would pretty much prefer the weather of the North. And so does agriculture, Po valley has pretty significant agriculture output.",
            "Plenty of reasons but, to cut it very simple, north has industries, south doesn’t",
            "More than my life!",
            "Also the most pro western, with many western goods only available in Hungary. How the times change",
            "Argentina was the richest country in the world in terms of GDP per capital in 1895.",
            "Polish GDP per capita in 2022 was 18k USD, Latvia had 21k, Lithuania had 25k, Estonia had 28k. All started more or less at 2.5k, but Estonia was slightly ahead with more than 3k.",
            "Amen to that!",
            "And [Balcerowicz](https://pl.wikipedia.org/wiki/Plan_Balcerowicza)",
            "Absolutely, but also \"bless\" free trade, fee market and cheap labour. Not ironic, it's the advantage, also Polish people work a lot which is probably a one of the reasons for low fertility rate.",
            "Yeah so corruption is huge you mean and people don't pay taxes properly.",
            "Totally not true. In Russia the average pay was significantly more than in Ukraine. I think people underestimate just how much richer Russia is than Ukraine on average and how poor Ukraine is. \n\nIt's not a coincidence that millions of Ukrainians were working in Russia before the conflict and like more than one million fled to Russia after the invasion started.",
            "I don't think that's true, many Ukrainians have moved to Russia for work since the collapse of the USSR due to better wages.  \n\nThe crazier thing is that Ukraine was the richest region of the USSR due to USSR putting the bulk of it's industry there, it fell off the hardest after 1991 and has never recovered back to it's pre 1991 levels of prosperity.",
            "You know what is funny? In some countries the minimum salary (minimum wage) is zero. But still they are wealthier than Ukraine",
            "The GDP is total bollocks, everyone knows that. But I'm pretty sure Irelands minmum wage, medium wage and top IT sector wages are some of the highest in the EU, let alone the world. \n\nWhere are you getting the info its not a high wages nation?",
            "I will also consider that, thank you!",
            "The French do face a similar problem of once city dominating the country, but at the very least that city forms a larger proportion of the population. About 20% of the French population lives in Paris, compared to 13% of the British population living in London. \n\nThe French could face a situation like ours, should there be especially incompetent governments that neglect the rest of the country, but they aren't quite that bad yet.",
            "[I live in this shithole.](https://en.wikipedia.org/wiki/Regions_of_England#List_of_regions) London has twice the per capita wealth of the rest of the country. The nominal GDP per capita of the rest of England is about $38,000. Compare that to Germany's $49,000, France's $47,359, or Italy's $39,580. \n\nPoland is suspected to overtake us in the 2030s for a reason.",
            "Some parts of the UK are really poor.",
            "Rica ederim!",
            "I'm talking about now. What does history have to do with living in Lithuania?",
            "Because inflation also exists in the US. Their local currency (USD) may lose value against themselves.",
            "78,000$ is an old number. For the US, GDP PPP and GDP are always the same since the unit of GDP PPP is international dollars ie. the purchasing power of the US dollar in the US.\n\n[https://en.wikipedia.org/wiki/International\\_dollar](https://en.wikipedia.org/wiki/International_dollar)",
            "They are both completely normal economies.",
            "He's only correct if he means it's not cheap for people in Turkey, since average salary is just €750 a month, median salary probably €600-650 but Turkey is a very low cost country. 2022 Data by the OECD shows price levels in Turkey were slightly below India, Indonesia and Colombia. 2024 with less countries in the data shows price levels in Colombia are 39% higher than in Turkey. Data [Here](https://data.oecd.org/price/price-level-indices.htm) and [Here](https://data-explorer.oecd.org/vis?tm=price%20levels&pg=0&snb=85&vw=tb&df[ds]=dsDisseminateFinalDMZ&df[id]=DSD_PPP_M%40DF_PP_CPL_M&df[ag]=OECD.SDD.TPS&df[vs]=1.0&lo=1&lom=LASTNPERIODS&dq=.M....&ly[rw]=REF_AREA&ly[cl]=COUNTERPART_AREA%2CCURRENCY&to[TIME_PERIOD]=false).\n\nThere are still quite a lot of cheap things in Turkey besides street food, check [This](https://data-explorer.oecd.org/vis?tm=price%20levels&pg=0&snb=85&df[ds]=dsDisseminateFinalDMZ&df[id]=DSD_PPP%40DF_PPP_CPL&df[ag]=OECD.SDD.TPS&df[vs]=1.0&lo=4&lom=LASTNPERIODS&dq=.A....&ly[rw]=REF_AREA&ly[cl]=ANALYTICAL_CATEGORIES&ly[rs]=BASE_REF_AREA&to[TIME_PERIOD]=false&vw=tb) and make sure to look at most recent data from 2022, Housing is super cheap, clothing aswell, health and hospital services, education and other things.",
            "🤡",
            "clown mad for the sake of it",
            "Araba grocery mi sayılıyor amk? Gayet gittim Almanya'da, Avusturya'da, Çekya'da market alışverişi yaptım üstelik kur düşükken. İçkiden başka ucuza alabileceğin bir şey yok. Üstelik biz çoğu meyve-sebzemizi pazardan alıyoruz, ve illere göre fiyatlar sürekli değişiyor.",
            "Because it is tax haven for companies. Low corporate income. So that gdp does not represent the life quality of Irish people. Because corporates have the money",
            "So you're saying thay one Euro in Portugal has the same worth as one Euro in Luxembourg, right?",
            "That's correct. Thanks for the explanation!",
            "It isn't, but GDP (PPP) per capita measures a specific scenario where it is.",
            "That's OK! I wish you a great day!",
            "Not just the US, for the sticklers out there.\n\nBut yeah, Ireland is basically a first jump points for US capital.\n\nAnd yes, it does actually help the average Irish person.  Just not quite so much as their ludicrous GDP per.",
            "was more than just the tax really...When all the IT multinational moved in the more or less got free buildings and all kinds of crap to lure them in.\n\nmost of them signed contracts with the irish state that they would pay even less tax than they did now.  And the contracts would be for like 20-30 years.\n\nOntop of that you did not have to pay tax if you worked there for less than a year.  \nSo people would end their contracts and go home and get their tax back.  \nAnd start working the next month again ( think this has been stopped but who knows)",
            "The explanation I was seeking thank you. Corporations are such ghouls.",
            "Didn't know Ireland was a tax haven",
            "Lux has a pop. of ~650.000 and 510.000 workers, of which 220.000+ are non-residents.",
            "It’s not that there is no benefit because there is low taxes, it’s that the economic activity is not happening there. Ireland is not making anything, Irish workers are not being paid, there is no increase in human development.",
            "Actually they pay income tax to Luxembourg.",
            "Yes, good point, GDP Country: Gazprom Russia (10%), Nokia Finland (20%, at peak), Saudi Aramco (40%) and Denmark, Novo Nordisk is now bigger than the entire Danish economy.",
            "The difference is generally those companys are actually based in those countrys, ie huge part of personnel and facilities located there\n\n  \nBut to take Microsoft as an example, only aprox 1.5% of their workforce is in Ireland (and that includes  northen ireland) yet something like nearly 50% of their global revenue goes though ireland \n\nOnly reason they are there is for tax proposes.",
            "Those loopholes were closed four years ago and those companies had to pay backdated taxes since it was established in 2015. Ireland received 24 billion in corporation tax last year and have had three successive years of a budget surplus as a result of the loophole closure (1.2 billion surplus last year).",
            "EU countries are allowed to compete in many ways with eachother.\n\nSome big countries give huge state aid to large corporations, we compete on corporation tax rate.\n\nSome countries don't like being outcompeted so spread propaganda that we are a tax haven Don't be a victim of propaganda. Look at the facts like a good chap.\n\nDefintion of tax haven has been defined bythe EU and here is the list- no Ireland funnily enough, despite you parroting the propaganda you have swallowed.\n\n[https://studio.pwc.pl/aktualnosci/english/insights/eu-list-of-tax-havens-just-adopted](https://studio.pwc.pl/aktualnosci/english/insights/eu-list-of-tax-havens-just-adopted)\n\nCurrently, the EU list of tax havens includes the following countries:\n\n1. American Samoa\n2. Antigua and Barbuda,\n3. Anguilla\n4. Fiji\n5. Guam\n6. Palau\n7. Panama\n8. Russian Federation\n9. Samoa\n10. Trinidad and Tobago\n11. US Virgin Islands\n12. Vanuatu",
            "EU countries are allowed to compete in many ways with eachother. \n\nSome big countries give huge state aid to large corporations, we compete on corporation tax rate. \n\nSome countries don't like being outcompeted so spread propaganda that we are a tax haven Don't be a victim of propaganda. Look at the facts like a good chap.\n\nDefintion of tax haven has been defined bythe EU and here is the list- no Ireland funnily enough, despite you parroting the propaganda you have swallowed.\n\n[https://studio.pwc.pl/aktualnosci/english/insights/eu-list-of-tax-havens-just-adopted](https://studio.pwc.pl/aktualnosci/english/insights/eu-list-of-tax-havens-just-adopted)\n\nCurrently, the EU list of tax havens includes the following countries:\n\n1. American Samoa\n2. Antigua and Barbuda,\n3. Anguilla\n4. Fiji\n5. Guam\n6. Palau\n7. Panama\n8. Russian Federation\n9. Samoa\n10. Trinidad and Tobago\n11. US Virgin Islands\n12. Vanuatu",
            "\"Tax haven\" is a bit of an exaggeration. Imagine if someone called the Czech Republic an \"entrepreneurial paradise\" just because the policies tend to favour bringing in a degree of innovative business from around the continent. \n\nIt's a bit hyperbolic, and isn't comparable to actual tax havens, like the British Channel Islands or some far-flung Caribbean shoal reef.",
            "Yes, but it's the lowest unemployment rate in the whole EU in the last 10 years! Spain is still underperforming, despite the NextGen funds from the EU. Even Greece has a lower unemployment rate.\n\nValencia? Ford just announced a mass-layoff in their factory in Valencia. It's an attractive city for digital nomads because it's cheaper, but it's not an industrial powerhouse.",
            "Yes, there are plenty of them, I agregó. But they're maybe 30% or 35% of all the latinos that live in Spain. Most of them are unskilled workers performing jobs with little value added (and costing more than thei\nY contribute).",
            "Nope, I'm not a Vox supporter, I find them disgusting. But I guess you're a supporter of Dr. Pedro Sánchez (a guy whose phd thesis was later published as abook by somebody else)?",
            "They're (almost) synonyms. Latinos also refers to people from México and Central America, although there are very few Mexicans in Spain.",
            "That's an overstatement. It shows that you don't understand what \"PPP\" means.",
            "Only in the USA and Canada. Not in the rest of America.",
            "That is only one kind of visa and the cap hasn’t been raised since 2004. I don’t understand how this means we aren’t brain draining South America “anymore.” We’ve been doing it this whole time.",
            "Trump hasn't been the president in 3 1/2 years. Immigration fell under his presidency",
            "Southern England, especially London, is a lot wealthier than Middle and Northern England. ",
            "Crazy how Hungary was one of the most rebellious members of the Warsaw pact, was the first to open the iron curtain and was one of the first to join NATO yet now are the biggest Russian boot lickers in the EU.",
            "2 out of 3 former socialist countries that border Poland and joined the EU together with Poland have higher GDP per capita than Poland.",
            "Pretty much. People forget that Ukraine, even way before these invasions, was always the most corrupt country in Europe. Even worse than Russia itself some years. Like corruption is beyond the sky over there.",
            "Not a million, more than 5 million fled to Russia after the invasion began",
            "I was talking about the MINIMUM SALARY , not the average. \nThe average salary in Russia would be higher in any case, because Moscow has prohibitively high salaries.  At the same time, in the regions the average salary could been range from 215 to 280 dollars before 2022 \n\nAnd about the reasons why Ukrainians went to work in Russia, I partially described below. And now the Ukrainians who found themselves on Russian territory of their own free will did so not because of the developed standard of living, but because of the visibility that Russia has created all these years with the help of propaganda, plus identifying themselves as Russians (some because of propaganda, but  someone was an ethnic Russian who did not want to live in Ukraine)",
            "You would be wrong, that's absolutely true. Everything else you said is unrelated",
            "I knew about this back in 2021, then the minimum salary in Russia was about $173, and in Ukraine $237.   \n  \nUkrainians went not only to Russia, many went to work in Europe. But in Russia it was more profitable for russianspeaking from the central and eastern regions, because it was closer, easier and there was no language barrier.  \n  \nAs for the vaunted inheritance: after the collapse of the USSR, Ukraine turned out to be with a lossmaking industry, which was not able to compete in a market economy (this was clear long before that for whole USSR economy).\n\nThe defense enterprises, for which the USSR economy worked, lost its significance, the era of the \"wind of changes\" came, no one was waiting for war with the neighbors, it became not profitable to produce it, and the reserves were sold out. \n\nThe mines by that time have exhausted their potential and the Donbass became subsidized. The miners, accustomed to a good life in the USSR, began to accuse Ukraine of worsening their position, although the end of this laid the transition from coal to atomic energy in soviet times. It became one of the reasons for separatism in 2014. \n\nUkraine gradually got out of the 90s crisis and built its trade relations most densely with Russia, which Russia used and at times set bonded conditions. After the crisis of 2008, which reduced the GDP by a third, Yanukovych’s cadence occurred. He robbed the country and spent the gold-foreign exchange reserves on maintaining the stability of the hryvnia. As a result, after his flight, the beginning of the war and the occupation of Russia Crimea and the territory of Donbass, as well as the need to reorient trade, the Ukrainian economy was in the abyss, from which it was chosen until 2022. \n\nThe economy showed good growth and here we have reached that difference in minimal salaries. Roads, stadiums, various complexes were built, Mariupol was beautiful. And then Russia began to destroy it all.",
            "Pls do. The colour scheme works here.",
            "Take off conditionals, and you'll find the real French situation.",
            "It really wouldn’t unless Poland is supposed to get 2 trillion worth of gdp growth in 6 years + go gdp of cities not regions",
            "Some parts of Italy are really poor too",
            "Everything in a sense. History has shaped the nation, and it's culture. It's a nation with a history of being occupied. It shares a border with Belarus, which is basically an glorified extension of Russia. So, based on history, you can expect some anxiety comes with living there.",
            "So if I bring 1$ with me to the US i could buy 1.1$ worth of grocerie ?",
            "You could of course make an argument for Switzerland, but Norway is basically an oil economy.",
            "Sorry but 2022 was outlier Beaceuse of economic crisis. Turkey minimum wage 520 € and avrge wage is around 1000 .and  Turkey is fucking expensive for tourists as well.the reson for it inflation surpassed currency loss. Only cheap thing is street food .Thats what saw from social media. Not making things up with outdted data.  I  hate when ignorant people make the comment long to apear wiser .you know Jackshit",
            "araba grocery demedik salak adam.\n\nalm*ncısın yani? engel",
            "GDP doesn't represent the quality of life for any country, HDI would be more suitable. Saying that Ireland ranks high for that too.",
            "Oh. Ok. I didn’t know that. It’s why I asked. 👍",
            "In what ways does it help the average Irish person? With the small tax-rates or that they get more job opportunities?",
            "People like calling Ireland a tax haven but it employes 30% or some shit",
            "The government of Ireland, which is deceiving the European Union and the European Union, which allows it, of course, has nothing to do with it? lol.",
            "Not necessarily for people but for corporations yes, the Netherlands can also be classified as such.",
            "My understanding is that it's not a \"tax haven\" in the same sense that it is for someone to have an offshore bank account somewhere. But, they have low corporate tax so a lot of US companies have decided to headquarter their EU operations there, so they show up on these charts as having a high GDP but realistically they're just funneling a lot of their business elsewhere in the EU to avoid higher local taxes.",
            "It's... Complicated.",
            "That's why it is a good one. If a company is based out of Cayman Islands for example, people will call them out as tax evaders and bring down their reputation. Ireland, on the other hand, is just another regular country for most people.\n\nIn fact, Ireland is the favorite tax haven for big tech. To the point that Apple had a massive role in framing their tax laws. Things keep changing every now and then, but companies work with the Irish government to implement new loopholes.",
            "This is not quite true. \n\nThere are e now hundreds of thousands of highly paid jobs in Ireland itself with the world’s biggest tech companies. \n\nThis has also created many more additional jobs in industries that feed off the affluent workers and all their events and needs. Restaurants, bars, etc. Also many many millionaires created through stock options granted over the last 25 years and a lot of this money going back into the economy and of course into the government tax take. It’s real money helping the Irish economy. \n\nIt was a genius move of the Irish government to be fair, and superb timing.",
            "Really? In Norway, I have heard of people living in Sweden, but working in Norway. There is still taxes to Norway, with the employer paying a fee on the money they pay out as well. \n\nBut still, the vast majority of foreign workers' incomes are not spent in Luxembourg. Also why two similar countries with the same gdp can be so different: If rich people sit on most of the money, less is going to be spent and recirculated into the economy and more is likely to be spent abroad.",
            "Novo Nordisk is 9% of corporate tax in Denmark.",
            "That's a good point about all that revenue going through Ireland but Microsoft employs more people in Ireland than the USA on a per capita basis, most of these corporations do. \nThe employment opportunities afforded to the average Irish person is quite something.",
            "LOL. I'm a lawyer and I understand fully how our (I'm American) tech companies worked with your government to design a tax code to effectively help them scuttle their earnings through Ireland to fully offshore zero percent jurisdictions like the cayman islands. Ireland is 100% a tax haven and will probably have its comeuppance at some point for being so. Although, given the powers at play here I'm not entirely surprised it hasn't yet.",
            "Your list is incomplete : Luxemburg, Monaco, Liechtenstein, Netherlands, Andorra, Cyprus, Malta and Ireland are missing.",
            "[Double Irish arrangement - Wikipedia](https://en.wikipedia.org/wiki/Double_Irish_arrangement)\n\nregardless likely hundreds of billions  evaded the system with this little number.  \nPotential the biggest tax scam in history.\n\nSo regadless if you wanna call it a haven :P  Taxes are evaded in legendary style!",
            "The problem of Spain is that tourism is just a dead end",
            "Spain has a default 8% unemployment rate (basically grey economics) in the ‘golden years’ didn’t even go lower than 8ish%",
            "I think H1B is the main one for highly qualified positions.\n\nThere are multiple times more applicants than 20 years ago for the same supply. In particular India and China produce large quantities of competitive engineers.\nAs a result getting a qualified job in the USA has become much harder and people look for alternatives like Canada and some European countries.",
            "The UK is effectively a mid-tier European country with one very rich city / region (SE England) attached.",
            "More specifically South East England. As someone who lives in the South West, specifically Cornwall, were only a few devlopment levels above barbarians",
            "Oh, didn’t think he was talking just about England, that makes sense. But Scotland isn’t doing bad is it?",
            "They just don't like their friends",
            "? Poland didnt border any country that wasnt socialist and only lithuania and Czech rep was fully under socialism and are richer then poland (And only by 1000$)",
            "Almost no one went to work to Ukraine from Russia. And millions went to work to Russia from Ukraine. And the demographics situation in both Russia and Ukraine has been equally poor since the fall of the USSR. With such poor demographics Ukraine should be importing working force. Instead, even before the war, millions of Ukrainians worked abroad and very few foreigners went to work to Ukraine. It means there are too few jobs in Ukraine.",
            "can't have nice things in Ukraine or else Russians might start demanding nice things too.\n\nI hope Ukraine can recover quickly after the war.",
            "Perhaps. I will admit that I'm not super familiar with the French situation, but regardless I doubt (and hope) that non-Parisians haven't received quite as bad a hand as non-Londoners have. \n\nI do know for a fact that France has nation-wide high-speed rail, and a much more functional public healthcare system than Britain does, which is an automatic bonus over Britain. Not too sure about industrial policy though.",
            "GDP per capita here. \n\nPoland is developing extremely quickly and is an integral part of the European economy, meanwhile we are stagnating and placed economic and diplomatic sanctions on ourselves via Brexit. \n\nIn western Europe, we often have the unfortunate attitude that eastern Europe is \"that backward place recovering from communism.\" This was true 20 years ago, but many eastern European countries have since made major strides, racing ahead of some of us. \n\nPrague is a hub for European entrepreneurs. \n\nEstonia is the single most digitally educated nation in the world. \n\nRomania and Moldova have the fastest internet in Europe. \n\nSlovenia is on-par with western European standards of living. \n\nCroatia is developing rapidly, becoming a tourism hot spot. \n\nPoland has made excellent financial decisions, with its people becoming much richer and the nation advancing. Its military will soon be the biggest in the EU, and it has made a splash on the tech centre.",
            "No, but USD doesn't stay at the same internal value forever. Compare $100 of 1980s to $100 of 2024.",
            "No, you bring $1 to the US to buy $0.90 of groceries",
            "It doesn't represent quality of life, but there is a strong correlation. Also, the gini index shouldn't be disregarded.",
            "More job opportunities but foreign multinationals corporation tax still is basically the entire tax base the country relies on despite the low headline figure.",
            "Hundreds of thousands of highly paid jobs with the world’s biggest tech companies all based out of 🇮🇪 \n\nThis created many more additional jobs in industries that feed off the affluent workers particularly in Dublin. Restaurants, bars, etc. Also many many millionaires created through stock options granted over the last 25 years and a lot of this money going back into the economy and of course into the government tax take. \n\nIt was a genius move of the Irish government to be fair, and superb timing. The Celtic Tiger ☘️ is still alive and flourishing.",
            "They don't have to be mutually exclusive. You can shelter your business in another country and employ their citizens to the company's benefit.",
            "corporate tax haven, to be more precise.",
            "They just compete better on tax rate , doesn't mean they are a tax haven.",
            "Evidence/source of these new loopholes? Back it up please.",
            "Per official stats, the entire Irish tech industry employs 120k workers or 4% of the work force. Not hundreds of thousands. For comparison, in New Zealand, not a tax haven, those numbers are slightly higher.",
            "Yes, I am sure about income tax being paid to Luxembourg (a special agreement between Luxembourg and 3 bordering countries) but indeed the money itself is mostly spent on home country. Also +1 on the rich people owning money, these two are why the GDP is obviously very deceiving. However one good thing about this mechanism for Luxembourg is that it allows Luxembourgish government to provide for residents without increasing the tax burden.",
            "I love the fact that the tax haven list from the EU doesn't contain a single EU country.\n\nWhere is Monaco? Malta, Cyprus? Andorra? Luxemburg! \n\nfucking lol at those corporate bootlickers.",
            "A law degree from the University of American Samoa? There are plenty of dumb lawyers lol, stupid flex dude.  A piece of paper shows you are not necessarily smart- evidenced by this post. You sound immature at least. \n\nI'd keep studying more if I were you and commiserations on being an an American :)",
            "No argument there. Tax evasion is done on an extremely large scale. \n\nBut it's not as if Ireland is some kind of island-sized Monaco, which is exactly what \"tax haven\" implies.",
            "Yeah, the government(s) determined that the Spanish Nairu sits at 7% to 8% of unemployment. This is really, really bad.",
            "Why do people keep spreading that bullshit stat. You do know Edinburgh is like the 5th biggest financial centre in Europe, Aberdeen one of the oil and gas capitals of the world, Cheshire which is one of the richest areas in the world probably",
            "Scotland's economic product per capita is similar to the UK as a whole - better off than Wales, NI and the English midlands and north, but slightly behind SE and east England and way behind London.",
            "Scotland is doing alright but most of its oil money is being moved to England due to England havjng a higher population.",
            "My idea is that if LT and Czechia look better, then Poland didnt do anything better than other countries. The only good Polish decision was to integrate itself into the West, the rest was done by the West and its investment.\n\nRomania is worse only because its futher away from the West, not because Czechia, Poland and Slovenia had some Balcerowicz. I guess its LT that stands out somewhat.",
            "![gif](emote|free_emotes_pack|joy)Fucking russian clowns, you are always the same",
            "At best, it will be three decades of clean up to get rid of UXO and mass graves.\n\nEvery time the frontline moves in either direction, six new minefields and a pit with three hundred corpses in it is found. This isn't the type of thing any country moves on from quickly, and certainly won't if the EU keeps tugging their own puds instead of helping.",
            "Just take a look at some map of GDP per capita by region of France. You'll see that France without Paris is like Eastern Germany. No wonder they will elect the far right (/s).",
            ">Ireland has been labelled as a tax haven or corporate tax haven in multiple financial reports, an allegation which the state has rejected in response. Ireland is on all academic \"tax haven lists\", including the § Leaders in tax haven research, and tax NGOs.\n\n>Ireland's base erosion and profit shifting (BEPS) tools give some foreign corporates § Effective tax rates of 0% to 2.5% on global profits re-routed to Ireland via their tax treaty network. Ireland's aggregate § Effective tax rates for foreign corporates is 2.2–4.5%.\n\n[Ireland as a tax haven](https://en.m.wikipedia.org/wiki/Ireland_as_a_tax_haven)",
            "Well first there were simply very low taxes for big tech, which lead to international criticism.\n\n  \nThen the [Double Irish with a Dutch Sandwich](https://www.investopedia.com/terms/d/double-irish-with-a-dutch-sandwich.asp) was developed.\n\nFurther, companies started getting crafty with the way they registered, licensed, and transferred [Intellectual Property](http://www.fordhamiplj.org/2016/08/30/ip-tax-avoidance-ireland/). This source might not explain how IP-taxation bullshittery works. [Polymatter's Video](https://www.youtube.com/watch?v=J5wrYwFObiI&t=721s) on the Irish economy covers it well.",
            "That’s 12% of Dublin now in new very highly paid jobs, and all the industries in top of that built around them. It is significant.",
            "Had me kinda thinking. It would technically be better for a country to accommodate free housing to EVERYONE if it meant savings was unnecessary. Even if there were more taxes or people earned less money, if no one had to think about saving money, it would be a much larger feedback loop for the economy.",
            "Who said anything about being smart? How mad are you that I'm stewpid but still a lawyer? \n\nI'm still right about this though, lol",
            "its a tax haven for businesses rather than people.\n\nits still just as shitty as Monaco and other tax havens, essentially serving as a way for the wealthy to dodge taxation.",
            "London is 22% of UK GDP.\n\nLose that and the UK, on a GDP basis, is worse off than Poland and not far off Romania.\n\nAnd that's just Greater London. Add in the South East as well, and the picture looks even worse.",
            "If you didn't know, you're parroting a Wikipedia page created and maintained by Paddy Cosgrove https://www.reddit.com/r/ireland/comments/bgyfet/til_theres_a_wikipedia_editor_called/\n\nAs part of a dispute where the Irish government wouldn't subsidise the Web Summit which he runs. It's a really weird vendetta to the extent that he systemically tried to eliminate Irish geography from Wikipedia and fold it into the disputed 'British Isles' category because he knew it would piss off Irish people",
            "All propaganda from vested interests.\n\nEdit: in the second line of the Wiki page you posted lol\n\n\"Ireland does not meet the 1998 OECD definition of a [tax haven](https://en.m.wikipedia.org/wiki/Tax_haven)\"",
            "You were saying that \" Things keep changing every now and then, but companies work with the Irish government to implement new loopholes.\"\n\nWhere are these new loopholes  you were talking about?\n\nOr maybe admit you were exaggerating/being disingenuous?",
            "As I said a piece of paper doesn't make you smart. If you were smart you wouldn't flex about being a lawyer. You would let the facts do the talking. \n\nOne thing in Ireland which is good is we don't tolerate blaggards. I know its your culture but don't try it here if you ever visit, you'll be labelled as an eejit.",
            "The exact same could be said for France.",
            "If you remove Warsaw from Poland and Bucharest from Romania I wonder what will happen 🔥 🔥",
            "I'm not denying that the UK's regional disparity is massive, but I feel like to make that particular comparison you should also exclude Warsaw and Bucharest.",
            "Primate cities do that",
            "You wouldn't just 'lose it' though. If London suddenly didn't exist all of that stuff would move somewhere else in the UK.",
            "That really explains why so many Lithuanians in the UK that haven't properly settled down with families are coming back to Lithuania. Because it turns out that adjusted for the purchasing price, Vilnius is richer than most parts of the UK that aren't London. And unlike the UK, it's constantly getting better.",
            "Similar things happen with many countries on the map. Its expected. 13-17% of the population lives there too depending on what definition on London your stat runs with.",
            "So the numbers in the source are incorrect? Any alternatives? \n\nMassive companies paying even 5% is egregious, no?",
            ">but no OECD member, including Switzerland, ever met this definition; only Trinidad & Tobago met it in 2017\n\nSo only one country ever met those requirements, pretty sure there are more tax havens than just one, ever.",
            "CTRL+F \"Ireland\"\n\n>  In contrast, countries with lower levels of secrecy but also low \"effective\" rates of taxation, most notably Ireland in the FSI rankings, appear in most § Tax haven lists.\n\n-\n\n>  According to modern studies, the § Top 10 tax havens include corporate-focused havens like the Netherlands, Singapore, Ireland, and the U.K.\n\n-\n\n> US tax academic James R. Hines Jr. showed in 1994 that US corporations were achieving effective rates of taxation of circa 4% in corporate-focused OECD tax havens like Ireland.\n\n-\n\n> The top 3 destinations for all U.S. corporate tax inversions since 1983 are: Ireland (#1), Bermuda (#2) and the U.K. (#3)\n\n-\n\n>  In September 2018, using TCJA repatriation tax data, the NBER listed the key tax havens as: \"Ireland, [...]\"\n\nand that's just from the first third of the article",
            "He's not, lol. I'm a lawyer and follow this issue closely. Why are you lashing out? He even sent you sources which you obviously didn't look at",
            "Don't plan on visiting your little tax haven anytime soon. Change one paragraph in american tax code and your gross domestic product will drop by about 60%, then it will be cheap again and I will visit :) cheers",
            "Let's not test what happens when you remove Warsaw from the map AGAIN, please.",
            "Don't worry, we'll catch up with you soon dragule 😘",
            "Excluding Warsaw would lower Polish GDP by around 20%.",
            "10% of your countrymen  live here"
        ]
    },
    "Per County, Is Its Largest City Its County Seat?": {
        "title": "Per County, Is Its Largest City Its County Seat?",
        "score": 280,
        "url": "https://i.redd.it/1xdrawqp418d1.png",
        "content": "",
        "num_comments": 88,
        "comments": [
            "The four red counties surrounding Indianapolis all have seats in the center of the county but the biggest towns/cities are those that directly border Indianapolis .",
            "Fun fact: Lansing, Michigan is the only state capital that isn’t also its county’s seat",
            "The fuck is going on in Connecticut?",
            "The lime green background sucks",
            " Well, isn't that a fun fact! In most cases, the largest city in a county is indeed the county seat. It's like the big cheese of the area, calling the shots and all that jazz.",
            "Dauphin County PA is wrong FYI - Harrisburg is both the largest city and county seat (in addition to being the state capital) so should be green.",
            "The Virginia one is a mess. There are no “cities” in any county. And some counties are green when they have a town as their county seat, but nearby census designated places are much larger. \n\nTo top it off (and this is weird, ik because all cities are independent of counties in Va), some county seats aren’t within the county but a city which used to be a town within that county before gaining city status—and those are still labeled incorrectly.",
            "Scotts Bluff county Nebraska, county seat is Gering (pop approx. 8200) largest city is Scottsbluff (approx. 17,000)",
            "What the fuck is a county seat, I’ve lived in ct my whole life and I just recently moved to mass",
            "“That map is a nice shade of grey.” - says 1/4 of the male population who is red/green colorblind….",
            "The colors are confusing. I didn't read the key correctly and noticed a few inconsistencies before griping and re-read the key.",
            "Galveston is no longer the largest town in Galveston County and hasn’t been for 20+ years",
            "Not sure why you have SF, Denver and Philly but not the NYC boroughs, Baltimore and Virginia Independent Cities marked as Green. NYC boroughs still elect borough presidents and at any rate the government structures of NYC/Baltimore aren’t really any different than SF/Denver/Philly. And as for the Virginia cities those have basically the same powers as counties.\n\nI’d probably just mark as black all consolidated/co-terminous city-counties and slightly rename the label for black",
            "That’s fun! I live in one of the counties in KY where the largest city is the county seat. In KY, you hardly ever say the city you’re from, it’s always the county (unless you’re from Louisville, Frankfort, or Lexington)",
            "I grew up in a city in Ohio that was the county seat and had the 2nd largest population in the county. According to this map that hasn’t changed.",
            "So Rifle finally eclipsed Glenwood Springs in Garfield county, CO.",
            "Looking at Jefferson County NY - Watertown is indeed the county seat, is it red because Fort Drum is considered separate and larger?",
            "You’d think Niagara Falls would be the county seat of Niagara County. Nope, it’s Lockport",
            "Cities in Virginia are independent from the counties surrounding them.",
            "Looking at Massachusetts I thought for sure Hampshire County was wrong. Thinking what town could possibly be larger than Northampton, but be shocked that Amherst is larger by almost 10k people. I wonder how much that is swayed by the major colleges.",
            "Oh wow I grew up in one of the red counties. In fact I grew up in The largest city in that county and the county seat is in the middle of bumfuck nowhere.",
            "Fun fact,  hawaii has only one city sort of",
            "You missed a chance to say no seaties.",
            "Can someone explain to me what this map means I don't get it",
            "Shouldn’t Carson City, NV be black?",
            "What is the largest non-seat city?",
            "What’s up with Merrimack County? Concord is the seat and largest city",
            "Santa Maria is larger than Santa Barbara, California, so that County is wrongly colored",
            "Savannah is the largest city in Chatham County and is the county seat.\n\nMap is wrong on this one.\n\nSeriously. Georgia is a mess on this map.",
            "So what's the smallest county seat?\n\nIs it [Winnett](https://en.wikipedia.org/wiki/Winnett,_Montana)? Or is there an even smaller county seat somewhere?",
            "This is the kinda niche shit I’m here for",
            "This is wrong. Coffee County Alabama, Enterprise is the largest county but Elba is the county seat.",
            "I don’t get what it’s saying",
            "Hillsboro county, NH has two county seats (for some reason) so the largest and second largest cities.",
            "Largest is defined how? Does it mean the largest in size or the largest in population? \n\nI'm wondering how Hackensack New Jersey isn't the largest city in Bergen County, NJ if it is by population.",
            "Lewis county NY is wrong, it’s biggest town and county seat is Lowville",
            "I can explain one in northeast Ohio.\n\n\nRavenna is the county seat of Portage County. It is also famously the home of an armory for the military as it was built in an era when cloud cover mattered, and this is a very cloudy area. That armory takes up quite a bit of land, which means the population can't take up that same spot. Especially since our cities were all designed to be 5x5 miles long and wide when originally created in the Western Reserve days.\n\n\nThere is one more thing that throws a wrench in Ravenna's growth. My exact memory is fuzzy, and I can't find the history online. But I believe the state was going to put a university into Ravenna, but Kent swooped in with their proposition instead since they had a train line. So Kent is much larger in population and growth now.",
            "Lake County Indiana is wrong. We’re the upper most NW county and in the Chicagoland Metro. \n\nCounty seat is Crown Point, Pop 33,899\nLargest city is Hammond, Pop 77,879\n\nNot even close. For a county that is 490k people, right next to Cook County IL, in a major metro, it’s not like we’re a minor county.",
            "Why is the City and County of Denver green? There’s only one city in the county.",
            "Pretty hard to get Los Angeles wrong but here we are",
            "That's similar to Bullitt County next to Louisville. Shepherdsville is the county seat, but the last census Mt. Washington took over as largest. Shepherdsville has about 25,000 jobs, but only 13,000 people within its city limits. There are several municipalities to its north that all border each other until you get to the Louisville/Jefferson County consolidation.",
            "A lot of counties that include suburbs of a nearby city are like that.",
            "Where is Marion's county seat? has to be indy🤔",
            "Richmond and Carson City are independent cities so they aren't part of a county at all.",
            "Baton Rouge isn’t a county seat.",
            "I was just about to mention Lansing, MI LOL",
            "That’s not true. Richmond isn’t in a county, so it is not a county seat.",
            "Mmm mason, eatons charlotte holding down the tri county 🤙 dewitt must be bigger than st johns 🤔",
            "They abolished county governments (and, in turn, county seats) in 1960. Connecticut has COGs, which aren’t represented here.",
            "Counties in New England serve little to no purpose. City and town governments handle all the municipal functions. In Massachusetts, they are basically lines on a map for courts and jails, and not much else. Rhode Island counties have no governments. NH, Maine and Vermont, are mostly the same way except for a few remote towns that become disincorporated",
            "I don’t think we have enough time…… ohhh you meant just regarding counties.",
            "They redrew their counties two years ago and renamed them \"planning regions\". They don't have seats for some reason.",
            "Some excellent state parks, good hiking, lots of museums and historic houses, amazing pizza, great seafood…",
            "Its brat summer",
            "Isn't that what you would expect? After all, people are always asking why the biggest city isn't the state capital in so many states.\n\nIf anything, I'd think the \"fun fact\" would be how many counties don't have the largest municipality as the county seat.",
            "Philadelphia should be black; its county government was dissolved 170 years ago.",
            "They're including Pennsylvania townships as municipalities (which they are under PA law, unlike townships in some other states). Harrisburg's city limits are surprisingly small, so Lower Paxton Township ends up with a slightly larger population.",
            "Yea wrong for a lot of counties in PA off the top of my head.",
            "Lower Paxton Township is bigger\n\n53,501 vs. 50,099\n\nThe map is technically for all census-recognized places. I used “city” as a catch-all.",
            "It's the \"capital\" of the county, more or less.",
            "In CT we don’t have county governments. Each town is its own municipality with its own locally elected government.",
            "As a person from CT too, I was thinking the same thing. What the fuck is a County Seat? I almost feel European learning about silly American things.",
            "Pretty much the city where the county government is run from which might just be the Sheriff’s offices and courthouse, but many counties have full fledged governments with multiple departments too often housed in a County Hall building.",
            "Glad someone else was as clueless as I was.",
            "You're right. That's a mistake on my part. Thanks for pointing it out. I thought Galveston was the largest place in the county and forgot to make sure I was correct.",
            "Actually it has no municipal government whatsoever. Counties are the lowest level, but their elected offices are called “mayor” and “council”\n\nEDIT: After some research, it seems Oahu County has renamed itself the City and County of Honolulu, but it’s not a consolidated city-county or independent city like you sometimes see on the mainland, it’s just a county that calls itself a city.",
            "Mesa, AZ\n\nOr New York, NY\n\nDepends on if you count NYC as the seat of every borough-county.",
            "That’s a mistake. Sorry.",
            "It’s Gann Valley, SD (Buffalo County). It has a population of just 10 people.",
            "Exactly, dumbass!",
            "Denver and Broomfield should both be black.",
            "LA County is green on the map, as it should be. The red one is Orange County. The county seat, Santa Ana, has a lower population than Anaheim.\n\nPretty hard to confuse LA and Orange County, but here we are (I kid, I kid)",
            "I guess you are technically right, it is a parish seat, but parishes are Louisiana’s equivalent of counties",
            "Not entirely. County sheriffs still existed until 2000.",
            "The guy asks about Connecticut and you explain literally every state in New England except Connecticut.",
            "Hey now, in massachusetts you do get to elect a sheriff! but yeah \n\nalso it’s fun to say middlesex",
            "Everyone must stand!",
            "Not necessarily. Many will have the seat in a central location so it’s more equally accessible to the entire county.",
            "It's where the county courthouse and municipal offices are.",
            "Generally, it’s where the county government and administration is located. Sheriffs office, country assessor, county auditor etc. Sometimes, certain functions will have additional offices located in more densely populated portions of the county for things like vehicle registration when the seat isn’t the largest city in the county.",
            "No worries. There are only a few counties to worry about, am I right? I grew up and live in the largest town in Galveston County, League City, not that anyone would know that. We have interesting history but really only emerged after the manned space flight center moved in nearby.",
            "Yes, it's always bugged me that Wikipedia's Honolulu article has it wrong and it has never been fixed.  If Hawai‘i County renamed itself the City and County of Hilo, it would not be a consolidated city-county because there was only ever one single political entity.",
            "Each county in NYC has its own courthouses and county government (though they don’t do much).",
            "Ahhh well damn, that's what I get for not actually reading the key. I'm wrong. Good map.",
            "Yeah I know what you mean, I was just joking with the wording.\n\nI believe Alaska also doesn’t have county’s and Vermont calls their seats “shires”. They’re all just county and county seat equivalents though like you said.",
            "Someone else already did",
            "vs. top or bottom sex 🤔",
            "Alaska has Boroughs."
        ]
    },
    "Largest lake in each European country by surface area": {
        "title": "Largest lake in each European country by surface area",
        "score": 3617,
        "url": "https://i.redd.it/y2h0qpdaxw7d1.jpeg",
        "content": "",
        "num_comments": 553,
        "comments": [
            "Czech Republic: no access to sea or ocean, tiny lakes",
            "You mean largest lake entirely within the country ? Otherwise for example it's the lake Geneva for France and Switzerland (580km2)",
            "A fun fact, the largest lake in the Netherlands used to be a gulf until it was separated from the sea with a dam",
            "Lake Konstanz belongs partially to Germany, Switzerland and Austria. Did you count the whole area for Germany or just the area that is part of the country?",
            "Fun fact: the largest lake in Europe (Lake Ladoga, 17800 sqkm) doesn’t appear on this map as it’s eclipsed by Baikal in Russia, whose territory also encompasses Ladoga.",
            "Damn Spain, why so dry",
            "The Russian one (Lake Baikal) contains between 1/5 and 1/4 of the world's fresh surface water. \n\nI'm completely shocked by that fact.",
            "Time to move the afsluitdijk to beat Finland.",
            "Scandinavian countries are still on the process of deglacierization and the only place on Earth where sea levels are decreasing, so nothing surprising they have so many lakes and islands than elsewhere.",
            "Fun fact: The one for the UK is on the island of Ireland.",
            "Finland's largest lake, Saimaa, id 4,279 km2. This map is terrible.",
            "What an awful map, not only is it badly researched, numbers on top of a map is a horrible way to visialize stuff, why would this be map porn?",
            "[Lake Balaton](https://www.youtube.com/watch?v=dgMlD1R02XE) ❤️",
            "Fun fact! The largest lake in Ireland (island) is also the the largest lake in the UK. However the largest lake in Ireland (state) is not the largest lake in Ireland. There you go! not complicated at all!",
            "Wouldn’t the Bodensee also apply for Switzerland and Austria? Us Germans certainly do not own the entire thing.",
            "Wrong. Finland should be 4279 with [Saimaa](https://en.m.wikipedia.org/wiki/Saimaa).",
            "The Sweden owning as per usual",
            "Czech Republic had several large lakes that were drained in the late medieval times or with the onset  of the industrialization. Only glacier lakes remained and they are small as only mountains were covered by the glacier and the ice shield ended at the present Czech-Polish borders. The largest extinct lake in Bohemia was Lake Komorany atop of the coal basin and covered 25-30 km2 in the middle ages. The lake was getting silted and shrunk. It was drained and liquidated to exploit the coal deposits. Two other lakes, Cejc and Kobyli were in southern Moravia had over 10 km2. They were brackish. Lakes were drained for the need to grow sugar beets.",
            "So Estonia is basically a lake?",
            "The Czech Republic doesn’t have a single lake bigger than 0.2 km squared? That’s insane to me",
            "This is the PERFECT map for \"wrong answers only\"",
            "So, I can see that Lake Skadar is used for both Montenegro and Albania (which is OK, we share it). But if that is the case, Greece is 259, because of Prespa lake (N Macedonia, Albania and Greece share this lake).",
            "Shouldn't Germany, Austria an Switzerland have the same number, since Lake Constance borders all of those countries?",
            "Why some values represent natural lakes and some represent dammed reservoirs?\n\n\n\nCzechias largest natural lake - Černé Jezero, which was included, has area of 0.2 km², but dammed reservoir Lipno has area of 48.7 km².\n\nSlovakias largest natural lake - Veľké Hincovo Pleso has area of 0.2 km², and the included Orava reservoir, you guessed it - 35 km².\n\n\n\nWhy these different types of water bodies for different countries?",
            "European countries as in their European area?",
            "Shitty map ?      \n\nLeman between switzerland and France is 580km² (348 in switzerland, 234 in France)",
            "31k square kilometers is absolutely fucking massive for a lake. That’s bigger than some (small) countries.",
            "I think this is wrong. Müritz in Germany has 1385 km2 according to wiki.",
            "Luxembourg punching way above weight 😂😂😅😅",
            "Map is wrong for Switzerland, Germany and Austria as it attributes Lake Constance in its entirety to Germany.",
            "Lake Saimaa in Finland is about 4300km2.",
            "This map is wrong. Finland's Largest lake is Lake Saimaa, which according to Wikipedia is 4,377 square kilometers. This maps value for Finland's largest \"lake\" comes from Suur-Saimaa, which is the largest basin of Lake Saimaa.",
            "Dang, Russia's largest lake is larger than all these other largest lakes combined.",
            "Does Lake Baikal really count? Its barely north of Mongolia so i would count ones like Lagoda.",
            "3775 = Van Lake = My Home",
            "Wrong, Lac Leman is shared by Switzerland and France. And without this, the largest lake in France is Etand de Berre with 155km².",
            "This map is highly unreliable. Largest lake in Finland is 4400 square kilometers.",
            "Czech puddle.",
            "Fun fact: 3 of the 5 largest lakes in the UK are on the island of Ireland. Lough Neagh, Lower Lough Erne, and Upper Lough Erne are all in Northern Ireland.",
            "Lough Neagh is the largest water body in the UK by this measure, although Loch Ness is the largest by volume and contains nearly double the amount of water in all the lakes of England and Wales combined. Loch Morar is the deepest of the UK's lakes and Loch Awe the longest.",
            "The biggest lake in Finland is Saimaa which has three times the surface area seen here. \n\nAlso Greece is an interesting case. The largest lake is now Karla at 190 sq km. It was drained in 1962, recreated a few years ago and last year after the biblical floods of the area got back its original size.",
            "The largest lake in the UK, listed there is also in the on the island of Ireland btw. Lough Neagh in Northern Ireland.",
            "Fun fact: when Ireland reunites, the 396 figure sitting over England becomes 71",
            "The Brits took out largest lake, Lough Neagh is the largest lake in Britain or Ireland and it's right in the middle of Northern Ireland.",
            "Idk, the British isles have a massive lake in the sky hovering over it at all times.",
            "Russia is clearly the largest. And I believe that will be Lake Baikal. That lake is absolutely FASCINATING. The \"specs\" of it are mind boggling. It is over 5,000 feet deep, it has ~25% of the surface freshwater on earth, it's the world's oldest lake pushing 30 million years old, and it has its own unique ecosystem made up of lake Baikal specific species. The most notable of those species is probably the Baikal Seals.",
            "Russia is like \"that's cute\"",
            "I can see that for the lakes which are in more than one countries you have included only the surface of the lake belonging to that country, but I find this a little strange",
            "Serbia has larger lakes",
            "Is it just me or does that seem small for france?",
            "The one in Portugal I don’t think it is a natural lake, but a reservoir. Alqueva?",
            "I've never realized how small other European countries' lakes are. I've never heard of any big ones, but still. 🤷",
            "TÜRKİYYEEEE NUMER TRES TRTRTRRTRTT",
            "Largest lake in Finland is Saimaa with a surface area of around 4400 km²",
            "Finland is clearly wrong. Lake Saimaa is 4279 sq km",
            "Fun fact: The largest lake in the UK is in Ireland.",
            "These numbers can‘t be right. The largest lake of Germany is the Lake of Constance which is also partly Swiss and Austrian. The Lake Leman is part Swiss and French and larger than the Lake of Constance. So how can the numbers for France and Switzerland be lower than the number for Germany?",
            "A few things.\n\n* Lake Constance is shared by Austria, Germany, and Switzerland. All three countries have rights to the entire lake. There isn't a border inside the lake at all. And it is, by far, the largest lake in all three countries. They should have the same number, because they have the same lake.\n* Lake Geneva is the largest in France, shared with Switzerland\n* Lake Baikal, while yes, is in Russia entirely, is not in *Europe*. It feels like cheating to include it.\n* Also, Russia has access to the Caspian Sea, which is just the largest lake there is. And it's access is via the European section of the country. So, if you're gonna count other border-lakes as valid, why not that one?",
            "There is a mistake in Hungary. Lake Balaton does not exist, it is just an illusion. ;)  \n( I follow a sarcastic online group, who denies Balaton.)",
            "Somewhat confusing because the largest British and Irish lakes are both on the island of Ireland.",
            "I don‘t get the numbers for France and Switzerland. They share their biggest lake, Lac Leman which is 580km2, with about 2/3 in Switzerland and 1/3 in France. With leaving it out I first thought you may only count lakes completely within the border of a country, but then I see how you count Lac Constant completely to Germany, while it actually being located in three countries. I don‘t know if there are other mistakes, but your map seem very inaccurate.",
            "Does Russia’s largest lake really count if it’s in Asia, not Europe?",
            "Finland’s largest lake is 4379km (Lake Saimaa). This data is wrong.",
            "Why use Lake Constance for Germany and not Lake Geneva for Switzerland and France OP?",
            "Technically Germany, Austria and Switzerland should all have the same value. Lake Constance is a condominium.",
            "Caspian sea is a sea of internal drain, so so technically it's a lake with surface area around 371000km², ten times more than on map.",
            " Ah, let's see, we've got Lake Vanern in Sweden, Lake Saimaa in Finland, and Lake Geneva in Switzerland.",
            "Badly made map without a common definition of what counts as a lake.",
            "It is criminal how the largest lake in the UK, Lough Neagh is shown with a number in England when the lake is in Northern Ireland.",
            "Now do largest lakes by volume",
            "Crazy considering Iraqs largest lake is 2,710km²",
            "Those seem like weird names for a lake",
            "It would be cool to see a map of the deepest ones aswell",
            "Looks like Spain has about three fiddy...",
            "Really poor performance Spain 👎",
            "I'm guessing this map doesn't include dam reservoirs as lakes, probably since they're man-made, but then shouldn't the largest lake in the Netherlands be a different one?",
            "lmao serbia no coastline+ small lakes",
            "Where’s the lac Léman ?",
            "The largest lake in France is of course le lac Léman.  Which is also the largest lake in Switzerland.  580 km2.",
            "This is wrong, for Spain look up \"Mar Menor\" a massive salt water lake in Murcia",
            "That’s embarrassing Czechia",
            "Some lakes are larger than some of the countries on this map",
            "Van Lake Türkiye",
            "Spain?",
            "Could you say Azerbaijan and the Caspian Sea: 371k km²",
            "I know most people are complaining about the accuracy but when the difference between countries is between 0.3 and 30000, I really like different colors to be able to get a cursory understanding at a glance.",
            "So it's natural lake right? Cause czechs lipno is 46,5 km²",
            "What ones in Russia? That's a beast!",
            "No Andorra, Liechtenstein, San Marino, Malta?\n\n  \n(Monaco and Vatican would be too small to have bodies of water, I guess?)",
            "Spain looks about right. \nI've never seen water there on my visits.",
            "Netherlands wow.",
            "Why does lake Constance only count for Germany but not Austria and Switzerland?",
            "Why does Czechia not have any lakes larger than a middling puddle?\n\nEdit: I see some other comments pointing out that some of the data, including this one, are, in fact, nonsense.",
            "Mar Menor is almost kind of if you squint your eyes a lake so Spain could be 135 km^2",
            "I’m curious if Russia beat us swedes fair. Does their lake is in Europe or just somewhere in east Russia :people",
            "Sweden 🇸🇪",
            "Russia has a small ocean of a lake there dafuk",
            "largest lake in slovenia has 38 km2.",
            "Something about this map is not correct.\n\n\"Lake Baikal covers 315,000 square kilometers in southeast Siberia, north of the Mongolian border.\"\n\nNevermind... AI had a hallucination and added an extra digit. [https://imgur.com/a/3skwC3v](https://imgur.com/a/3skwC3v)",
            "Obviously the blue part here is water.",
            "Shouldn't Russia's stat be based on the territory of its portion of Caspian sea?",
            "Fiji: Hold my Polonesian beer...",
            "The Lake Constanze /Bodensee is as much in Germany as much as Switzerland and Austria.",
            "Finland seems to be wrong. Lake Saimaa is 4279 km²",
            "The largerst lake in Slovenia is Lake Cerknica (26 km² - 38 km²) not Lake Bohinj.",
            "How do the surface area of the Great Lakes in Canada USA.",
            "I didn't know that lakes could be that big, like in Sweden, Estonia, Turkey, and Russia.",
            "In Cyprus, our lakes are mostly dry :))",
            "The Netherlands is cheating though...",
            "Lake Baikal in Russia is larger than Belgium ![gif](emote|free_emotes_pack|surprise)",
            "I live in Spain near the largest lake, just south of Valencia. I was very surprised to learn that it is the largest lake in such a big country as it's very underwhelming.",
            "Wow. Windermere is bigger than I realised",
            "Are these large Dutch lakes freshwater or are they still pretty saline?",
            "I find it hard to believe Czechia’s largest lake is only .2km2. That’s SUPER small",
            "Poor Czech got a duck pond…",
            "Wtf Estonia?!",
            "Isn't it the Bodensee for Switzerland, Austria and Germany?",
            "Spain weak as shit",
            "The disparity between Belgium and the Netherlands.",
            "If you split Lake Superior between the USA and Canada, each would get 41085 km^2",
            "I wonder why Spain never built any manmade lakes like Portugal did?",
            "Omg these are amateur numbers! (Canada checking in). We have 50 lakes over 1000 sq km. \n\nQuebec alone has 29 lakes over 400 sq km.",
            "WTF?  Finland's largest lake, Lake Saimaa, is 4,279km^2, not 1,377km^2.",
            "It’s interesting how in North America, many lakes stretch to the horizon line. Not just The Great Lakes but many others.",
            "Poor Spain.",
            "Data are wrong for france.",
            "Lake Geneva is 580 km2. Ok, it's between Switzerland and France, but I don't see it in either of those countries (the 218 km2 in CH is Lake Neuchatel).\n\n\nLake Constance is 536 km2 - did that all go to Germany?!",
            "Pretty disrespectful towards Obersauer-Stausee in Luxembourg lmao",
            "Chechia has a bathtub.",
            "false: in slovakia its a dam (oravska priehrada) that this map is reffering to, not a lake, the lrgest natural lake is 0.2 sq km^2",
            "Poor Spain.",
            "TIL hat UK has a lake bigger than Italy's biggest:  Garda Lake. (but there is a number of big-ish neautiful prealpine lakes: Garda, Como, Maggiore, Iseo...\n\n(Lough Neagh, in Northern Ireland) [https://en.wikipedia.org/wiki/Lough\\_Neagh](https://en.wikipedia.org/wiki/Lough_Neagh)",
            "Moldova 💀",
            "This map is wrong, Portugal has no lakes at all lol",
            "This map is badly made. The largest lake in lake in Lithuania is 613 km2 not 63",
            "r/Bodensee",
            "TIL the largest lake in all of Spain is smaller than the largest lake in my town.",
            "No wonder why monsters choose Turkish lakes. Plenty of space.",
            "Where does a lake end",
            "Yes go sweden! Biggest lake.. Russia is Asia",
            "Netherlands cheating with their dammed lake that used to be part of the sea!",
            "The Netherlands is a bit of a cheat though, it was a bay that was dammed off?",
            "Spain has no lakes, Spain needs no lakes.",
            "Each european country....and also for some reason Turkey which is asian",
            "They wrote the 5650 in Sweden over Lake vänern so you can't see it, its the largest inland lake on the European continent since Lake Baikal in Russia is in Siberia",
            "As an Italian, how is Lake Geneva not bigger than any of our lakes?",
            "Cut off russia at ural if were talking geography.",
            "France needs to up its numbers",
            "I'm guessing the 396 for the UK is Lough Neagh in Northern Ireland? Not getting into politics here, but I'm just wondering if we were to split the UK up into its 4 countries, what would be the numbers in each.",
            "Baltic Sea is the biggest lake in EU",
            "That honestly seems impossible. How the hell do they not have any lakes? 0,2 sq km. That's 400x500 meters. That is barely more than a large pond.",
            "Look my comments up. Czechia had a few large lakes in medieval and early modern times. They were drained in between 1600-1850 to acquire agricultural land. Two interconnected brackish lakes in southern Moravia were drained for sugar beets. There was third lake near by that was drained earlier. If you go to Kobyli, the bowl shape landscape is what is left of that lake.",
            "Shut up its average size ok",
            "They own a port in hamburg so they have access to the sea.\nIts called Moldauhafen",
            "TLE tiny lake energy",
            "My Czech ancestors moved to Minnesota: Land of 10,000 beautiful Lakes. 👍\n\nThey moved to the only part of the state without any flipping lakes whatsoever. 🤦‍♂️\n\nSeparately, as a Minnesotan, I’m genuinely baffled how Czechs cultivated such a strong ice hockey culture without any lakes.",
            "And false info right there (CZ). Largest lake here is 493ha,  which is 4,93km2.",
            "thats why they make the best beer in the world, to forget they have no lakes",
            "Probably there is no czech word for lake",
            "Now i‘d really wish the map would show Luxembourg and its biggest lake to compare",
            "Nope, this map is badly made. This map includes largest lake between Estonia and Russia (lake Peipus).",
            "They took lake Constance only for germany, so I think its just badly researched",
            "I mean if we include lakes shared by countries, russia's becomes 371,000 km2, due to the Caspian Sea, which is technically a lake.",
            "But for Germany they used Lake Konstanz.... For Austria they didn't...",
            "Lac Léman\\*",
            "And caspian sea for russia with 380kkm2",
            "Yeah its dimply wrong. The 536 for german is the total area of the lake constance. There are no formal trilaterally accepted borders (because noone cares enough) that actually divide the lake. So either it counts for germsny switzerland and austria, or for neither",
            "And not counting the Leman, there are 8 other lakes bigger than 44km². And reading comments on other countries, this map seems to be a load of BS...",
            "Why does every single map in those sub have the data wrong??",
            "The Netherlands' second largest lake is also big, 700km2. I don't know which lake is the largest non man made one.",
            "Kidnapping parts of the water and holding the water hostage to show nature who is the boss.",
            "You can even visit a museum village in Enkhuizen with period actors who will tell you about what life was like while it was still a gulf. It's an amazing thing!",
            "Dam!",
            "But before that it was a lake, then the sea flooded it in the middle ages and early modern period.\n\nhttps://en.wikipedia.org/wiki/Lake_Flevo",
            "The land that God forgot, so they had to do the job themselves.",
            "It also used to be a lot larger, but the Dutch being Dutch turned a big part of it into land.",
            "Is it now fresh water or still salt water?",
            "Yeah I saw that and thought “bullshit ain’t it connected to the ocean?”",
            "Oh they actually dammed the whole thing off, cool, I know they’ve reclaimed an absolute shitload of land from it",
            "Cechia - land of no lakes.",
            "Wait, you are saying that bay region between Holland and Friesland is a lake?!",
            "This is where I think a distinction between natural and man made needs to be made. A man made “lake” to me is not a lake, it’s a reservoir.",
            "The english name always confused me... But I also know that it can't be Lake Floor.",
            "Looks like entire area.",
            "Well technically all countries only agree that there is a border… somewhere on Lake Constance, but not where. And none of the countries care for it much either haha.",
            "What area of Lake Constance would be part of Germany?\n\nGenuine question, cause there is no defined borders, unlike Lake Geneva f.e.",
            "Officially there are no borders in the lake",
            "Til Lake Konstanz is a English Name for it. 😱😳.    \nBut why? Why Konstanz?",
            "I'm reading this comment while looking at the lake Konstanz. So fucking ironic isn't it",
            "It’s hard not to be eclipsed by lake Baikal. It holds 25% of all fresh water in the world, more than all the Great Lakes together.",
            "If you travel by boat through Ladoga, you can face storm. I live very close to Ladoga and I once saw in the news that quite big boat was destroyed in the storm.",
            "And the largest lake, the Sanabria lake, got it's current size after a nearby dam got broken in the 60's and all the water ended up where the lake was. So it is arguably man-made",
            "Spain has more rivers than lakes, there are not big lakes as the rest of europe (but there are a lot of bays though)",
            "I don't wanna say that the map is wrong but here in Spain the largest lake is L'Albufera which has a surface of 23km2 of water. It's quite a beautiful natural park, I live nearby.\n\nI think the map uses the Sanabria which sometimes it's considered as the largest of Spain but it's way smaller than L'Albufera.\nAlbufera is also a word (in Spanish) to describe a salt water body that goes in land. Which L'Albufera was originally but now it's not, it's freshwater. I think that's why normally it's confused as not being a lake even in spanish articles.\n\nEdit: my broken English",
            "meanwhile, czechia:",
            "Lakes have little relation with being dry. It has big rivers, only just small lakes. Even in the soaking wet North.\nIt has many big reservoirs",
            "https://youtu.be/_aR-gqd6l_U?si=Tq13Wz4GoNeb1C4V\n\nHere's a great video to explain it",
            "very arid and pretty mountainous here",
            "The rain in Spain falls mainly... somewhere else",
            "Do we know if Ben Shapiro has vacationed there?  Might explain things.",
            "That's what he said!",
            "Ya, Spain you gotta up your lake game man.",
            "I think this map is not fair with Spain since it is not measuring the same thing. In Portugal, it takes as reference an artificial lake, the Alqueva Dam. In Spain, however, it uses the largest natural lake, Sanabria (3.5 square km). If we chose the largest dam (La Serena) it would be 139 square km.",
            "Twice the volume of Lake Superior, but less than half the surface area. Conclusion: deep.",
            "Technically lake Baikal is a ocean in formation. That is why it is so deep relative to other lakes.",
            "Also the oldest lake in the world. And despite being thousands of miles from the ocean, has its own species of seals which nobody knows how.",
            "I learned yesterday that Loch Ness contains 50%+ of all fresh water in Great Britain. It's incredibly deep.",
            "There are SEALS unique to the lake. And you can camp on it in the winter. As in...on the ice!",
            "This map is actually wrong for Finland, as the largest lake is [Saimaa](https://en.wikipedia.org/wiki/Saimaa) at 4279 square kilometres. It's the fourth-largest lake in Europe.",
            "the waddenzee has been a sea for long enought, making it 1 big lake for the greater good (that of beating finland) should be priority number 1",
            "That would just turn the Ijsselmeer back into the Zuiderzee. You mean the Houtribdijk\n\nEdit: I only just realized you mean moving it up North to expand the Ijsselmeer, sorry",
            "Do you mean the Scandinavian Peninsula, because I don't think it's true for Denmark?",
            "If you’re referring to post-glacial rebound then that’s happening in North America too. The western shore of Hudson Bay rises close to a meter a century.",
            "Fun fact, the 3 countries with the most islands are all nordic.\n1. Sweden 267k islands with 17% of their population living on islands due to stockholm, göteborg and a lot of other major cities being built on archipelagos or on parts of islands.\n\n2. Norway 239k*. By norways own measurements its 320k islands but 71k of them are classed as proper islands and are just classed as 'rocks' internationally.\n\n3. Finland at 178k\n\nFor comparison, indonesia and Philippines which both are states entirely consisting of islands and archipelagos have ~25k islands COMBINED with their combined populations being more then 15x that of the previously mentioned nordic countries. \n\nMy tip as a local swed is that if anyone does visit any of these nordic nations be sure to check out some of the archipelagos. Stockholm archipelago or the Finnish Saaristomeri (literally archipelago sea in finnish) are both great. And in Saaristomeri you will also find a self governed region of finland that has their own laws, government, license plates and almost exclusively speak swedish, aka Åland. The Åland islands are also the largest de-militarized zone in the nordics.",
            "Not so Fun Fact: The lake is privately owned by the 12th Earl of Shaftesbury and this prick is actively killing the entire ecosystem of Lough Neagh.",
            "Yeah, Lough Neagh is an Irish lake\n\nEngland's largest lake is Windemere, which is a puddle in comparison",
            "Though if you measure by volume it's Loch Ness in Scotland, double that of Lough Neagh.",
            "Why doesn't it include a lake in England and Scotland?\n\nI was always led to believe that the UK isn't a country. It is a collective of 4.",
            "Have you watched porn? This definitely fits the bill :D\n\nBut I agree, this is bad on so many levels.",
            "The one and only true lake.",
            "Balaton gang",
            "💪💪💪💪",
            "lol.\n\nThat’s a complicated way of saying Northern Ireland has a bigger lake than the Republic of Ireland",
            "vänern!",
            "And nowadays the largest lake is the manmade Lipno I dam with 48,7 km^2",
            "Its lake Peipus which should realistically not be counted at its split between russia and estonia and lakes that are part of different countries have not been counted in this map otherwise",
            "there are dams and artificial lakes that are way bigger than that, but the natural lakes are all tiny",
            "We had a few in the tens of km^2 but they were all drained for agriculture and mining. \n\nThe 0,2 km^2 lake is the Black lake, the largest natural lake left, because it's deep in the mountains. The biggest lake nowadays is the manmade Lipno I dam with 48,7 km^2",
            "Switzerland would have Lake Geneva instead, which is bigger",
            "No, Russian(Lake Baikal) and Turkish(Lake Van) lakes are not in their European area.",
            "No. Both russia and turkey use lakes they own in asia",
            "France has other lakes bigger than 44km². The Léman's french part of course but also Etang de Berre with 155km²",
            "And it's only the fifth* largest lake in the world by surface area (and the largest by volume, as it is extremely deep).\n\n*Depends on exactly how you define lakes, but it's fifth by a strict geological definition that excludes the Caspian Sea and combines Huron and Michigan",
            "Great Lakes:\n\nLake Superior: 82k square kilometers \n\nLake Huron: 60k\n\nLake Michigan: 58k\n\nLake Erie: 26k\n\nLake Ontario: 19k\n\nGuess that’s why the call them Great.",
            "largest lake in the world 371k so everything is relative",
            "I read:\n\nFläche\n112,6 km²\n\nin Wikipedia",
            "...and that's not even counting the biggest lake in Russia! Which is the Caspian sea, of course. Although it's split between Russia, Kazakhstan, Azerbaijan and Iran",
            "The largest natural lake that we didn't fill in to mine coal or grow food. The actual largest lake is the Lipno I dam with 48,7km^",
            "Maybe it's natural ones only",
            "Yup, they forgot Lake Leman. Considering they counted Lake Constanz for Germany",
            "Saimaa is 4279 km^2 so this map is wrong for Finland.",
            "The Leman lake (not Geneva lake) belongs to both France and Switzerland",
            "the second largest would be 700 but that one is also man made",
            "Its definitely talking about the IJsselmeer, a sea turned into a lake (Zuiderzee). The basis of it isn't man made it was already there and its technically also not completely shut off, it can be with locks but only when needed.",
            "Half in France half in Switzerland so it’s the bigger in neither of these countries.",
            "That’s a lagoon.",
            "Lake Baikal",
            "Unless you count the baptismal font in the Vatican.",
            "https://en.wikipedia.org/wiki/List_of_largest_lakes_of_Europe\n\nThe map lists the area of Baikal, but Ladoga (17700) and Onega (9894) are in Europe, so yes, it does, twice.",
            "Lipno Reservoir 46 km^2",
            "*I wonder why Spain*\n\n*Never built any manmade lakes*\n\n*Like Portugal did?*\n\n\\- bundymania\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
            "*Netherlands cheating*\n\n*With their dammed lake that used to*\n\n*Be part of the sea!*\n\n\\- Truelz\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
            "wasnt everything part of the sea at one point?",
            "yes it was, it used to be a lake ( way back ) . then a flood made it part of the sea, we dammed it off and now it is a fresh water lake",
            "Lol, keep crying.",
            "European lakes Ladoga and Onega are much larger than Vanern",
            "There are bigger lakes than what OP shows\n\n[https://fr.wikipedia.org/wiki/Liste\\_des\\_plus\\_grands\\_lacs\\_et\\_%C3%A9tangs\\_de\\_France#%C3%89tendues\\_d'eau\\_naturelles](https://fr.wikipedia.org/wiki/Liste_des_plus_grands_lacs_et_%C3%A9tangs_de_France#%C3%89tendues_d'eau_naturelles)",
            "396KM² - Lough Neagh - Northern Ireland\n\n71KM² - Loch Lomond - Scotland\n\n14.5KM² windmere - England \n\n4.84 KM²- Bala Lake/ Llyn Tegid - \n\nDon't quote me on the numbers because I didn't measure them, and they are all over the place online, Lough Neagh is the only one that seems consistent with size measured, maybe because we don't have to lie about our size. Looking at you England, Lake District.. More like a few puddles District.\n\nIn the top 10 uk largest lakes 3 are in northern ireland and 7 are Scotland.\n\nIn top 5 largest 3 are Northern Ireland and 2 Scotland\n\n\"Why doesn't the larger if the lakes bot simply eat the  other",
            "We don't have that many large lakes, but the map is just wrong: [https://cs.wikipedia.org/wiki/Seznam\\_jezer\\_v\\_%C4%8Cesku](https://cs.wikipedia.org/wiki/Seznam_jezer_v_%C4%8Cesku) the largest lake here is 500ha, if you include water reservoirs (i.e. damed river), it would be roughly 5kha",
            "Lake Komorany in Czechia was at its peak about 60km2. It filled an entire valley in north-northeastern Bohemia. The explosion of population, ore mining, glass work in the medieval time was accompanied by an extensive deforestation in Czechia. This causes the Lake Komorany to silt. When the first maps were drawn in renaissance era, the lake shrunk by 1/2. Two centuries later, a brown coal was discovered and whatever remained of the lake was drained.",
            "But it's true. There used to be larger shallow lakes similar to Neusiedler See in Austria, but they were dried for more arable land. We have no big mountains with (even former) icebergs to feed some  mountain lakes. There are many man made lakes and ponds, but there used to be mostly wetlands and wet meadows in their place.",
            "I'm Czech and absolutely shocked. We have incredibly lot of rivers but this lake number is pitiful.\n\nETA: So, it's Černé jezero (Black lake) with 18.4ha. It's the biggest natural lake.\n\nBut the biggest lake overall is Lipno dam. It's 19.48 km² big. So the map lies.",
            "[https://en.wikipedia.org/wiki/%C4%8Cern%C3%A9\\_jezero](https://en.wikipedia.org/wiki/%C4%8Cern%C3%A9_jezero)\n\nWe're quite dry country.",
            "But in 2028 this ownership expires :(",
            "Yeah there's also the Lipno reservoir which is almost 50 km2. Maybe the author used \"largest natural lake\" category to get his data, which would exclude a lot of stuff.",
            "\"If you could not add the name of the lake to the map, that would be great\"",
            "i thought the largest lake in russia was lake ladoga?",
            "In Russia’s case wouldn’t that be the Caspian Sea then?",
            "Yeah and then not for switzerland and austria, which border the same lake but supposedly have a smaller biggest lake than germany.",
            "… and obviously badly presented. This map sucks and does not deserve all the upvotes and comments it has.",
            "Is the English translation really lake Constance? Hilarious",
            "the problem is that for germany they take Lake Constance as the biggest lake despite it being shared between 3 countries and with no border on the majority of the lake. If we follow that rule Switzerland and Austria should have 536km² too.",
            "The processes that created it were those of the sea so it's not a lake in the geological sense ",
            "It's 3rd Reich all over again",
            "Le Léman*, as \"Léman\" already means \"lake\"",
            "[deleted]",
            "Lake Geneva is the English name",
            "Genfer See",
            "kkm2 ??\n\n\nThat would actually be 0,38 Mm2. Which also is  confusing.",
            "Even many of the inland lakes are man-made ones - they were marshlands that were dug up for their peat.",
            "> The Netherlands' second largest lake is also big, 700km2\n\nWorth pointing out that the second largest lake is in fact an artificial lake that is literally just inside the largest lake. It's just a dam we built, splitting it off from the larger lake because originally we were going to drain that part of the lake too, but ended up not doing so.",
            "dam!",
            "maybe uitgester meer, beulaker- and belterwijde,\n\nnot sure about sloter meer and fluessen, but i think all thing called plassem is artificial",
            "non … man … made …",
            "I'd think a lake in Friesland but which one is natural and which one isnt idk",
            "in europe i think it's lake geneva.",
            "The Dutch are so bad ass",
            "What did you expect us to do? The sea didn't want to stop, so we had to force their hand.",
            "Rumour has it if you hand a Dutch person a glass of water in a dark sealed off room and don’t watch they perform blood magic and come back a week later with a pocket full of soil and the glass has disappeared.\n\nI’ve also heard rumours that if they hear the sound of waves crashing they try to plug it with sticks like beavers.",
            "Fresh, we kinda caused an ecological whoopsie there",
            "Fresh, about 16% of the rhine flows into it.\n\nhttps://en.wikipedia.org/wiki/Rhine%E2%80%93Meuse%E2%80%93Scheldt_delta#/media/File:Map_of_the_annual_average_discharge_of_Rhine_and_Maas_2000-2011_(EN).png",
            "Well actually in Dutch there s a word for a lake that s manmade because they took the peat away, that s a ‘plas’ and a word for a lake that came about naturally, that s a ‘meer’. Meer being from the same stem as German ‘Meer’ and Spanish ‘mar’ meaning sea, while German See means lake again.",
            "Yeah because its obviously Floor Lake",
            "Petition for lake floor! Do the Swiss and Austrian neighbors also call it Bodensee? If so, why that awkward English name?",
            "What about \"Bodensee\"?   Names doesn't need to be translated 🤷",
            "Then shouldn’t Switzerland and Germany have the same number?",
            "Germany, Austria, and Switzerland agree that there is a border, but not where it is. But that's not a major concern between the three",
            "If you hear \"Grüezi\" from a Swimmer/Diver, then you are too far.",
            "That's the Austrian view.\n\nThe Swiss view is that there is a clearly defined border.\n\nThe German view ist that there are borders in parts of the lake and that another part of the lake is a condominium.",
            "Soo, if i just draw a line on the Ground then that counts? 😅",
            "Its only 7th largest by surface area though.",
            "That is a truly insane stat, thanks for sharing!",
            "By area, Baikal is smaller than 3 of the 5 Great Lakes.",
            "Yes, it's so bad for sailing that Peter I even built a channel around the lake",
            "We manage this on a lake of 15x3 km^2",
            "You should look up at the maritime disasters that have happened in the Great Lakes.",
            "To be fair I’m pretty sure Portugal’s is Alqueva which only exists because they built a dam for irrigation.\n\nThe area created by it was so large that while the dam was completed in 2002, the lake only filled up to its capacity 8 years later.",
            "I added a comment down below explaining it, but the largest lake of Spain is L'Albufera. But normally the Sanabria Lake is confused as the largest even in Spain sources.",
            "That's not true. The lake's surface was unaffected by the dam collapse. The shoreline is exactly as it was before the catastrophe.",
            "The Albufera is another kind of lake, something like a coastal lagoon. So I guess it doesn't count on this map's definition of a lake",
            "I think that strictly speaking, in English an albufera is not a lake, but a [lagoon](https://en.wikipedia.org/wiki/Lagoon).",
            "Omg no sea no lakes. Where do they swim?",
            "Černé jezero is a triangular lake with an area of 18.4 ha. Picture [https://www.zelezna-ruda.cz/resizer/resizer.aspx?w=960&img=/user/altid/snet/tur/zr-cernejezero/20.jpg](https://www.zelezna-ruda.cz/resizer/resizer.aspx?w=960&img=/user/altid/snet/tur/zr-cernejezero/20.jpg) More about the lake [https://en.wikipedia.org/wiki/%C4%8Cern%C3%A9\\_jezero](https://en.wikipedia.org/wiki/%C4%8Cern%C3%A9_jezero)",
            "... Mainly in vain??",
            "I love me great lakes, I'm from Michigan.",
            "5x deeper",
            "What does that mean it's an ocean in formation? Is it going to connect with the ocean?",
            "The Red Sea is a lake that got out of hand…",
            "Technically, it's a failed rift. But so is Superior.\n\nNot all rifts become oceans.",
            "Or is it an ocean in formation because it's so deep?",
            "Monstrously deep",
            "My immediate thought was that Loch Ness would be the biggest lake in the uk, but by surface area it’s not even the biggest loch in Scotland",
            "You can camp in many places on the ice. 10 cm is a safe thickness for ice to walk on.\n\nIce on the Baikal lake is over 1.5m thick, safe to drive tanks on it",
            "Damn it, you got us this time Finland",
            "L (from Sweden)",
            "Because you could argue saimaa is not one lake",
            "Yes, forget the debate of gas resources vs rare species preservation. Petty competition is far more important.",
            "Idk. But I know they can't mean just Scandinavia or just the peninsula because all of this is also true for Finland.",
            "It is true for Denmark too. At least the northern part and for almost all of the southern part as far as i know. Northern Jutland is still experiencing isostatic uplift causing sea levels to fall. The uplift is about half as much in the southern parts, but it's still rising.\n\nIt will be a while before sea levels rise in Denmark due to climate change because of this.\n\nIt's between 10 and 20cm / century of uplift depending on where you measure in Denmark.",
            "Denmark doesn't have a lot of lakes and islands, relative to the other nordics, but the other part is correct for Denmark as well.",
            "It is true for Denmark as well. The country is just too narrow to get large lakes. The [Limfjord](https://en.wikipedia.org/wiki/Limfjord) for example isn't is just a few meters of land-rises away from becoming a huge lake. But for now it's a fjord.\n\nEdit: It's also a small country. But about 1.4% of its surface area are covered by lakes.",
            "Nicholas Ashley-Copper. Won’t hand it over. Wants others to pay for the upkeep. He didn’t even live in Northern Ireland, be lived in England. Prick is the perfect description alright.",
            "You don’t become the Earl of Shaftesbury without royally shafting someone or something.",
            "To be fair it’s mostly farmers and fertilisers from agricultural runoff within the watershed doing the actual ruining he just makes a very good scapegoat especially because he provides a small hindrance that Stormont can hide its incompetence behind. It’s sort of like someone fly typing in my land then complaining that I haven’t bothered to clean it up instead of going after the flytypers.\n\n\n\nIt used to be the largest eel breeding habitat in Europe until only a few decades ago.\n\nAthlo in the 30’s there was a plan to drain the entire thing as it’s only about 18m deep in the middle.",
            "Lough Neagh is the biggest by area by miles, but it's effectively a really really wide puddle, only 9m deep on average; Loch Ness is 130m deep on average so has more than twice as much water in it",
            "15 km2 for those who were wondering.",
            "And the largest British lake is a loch. Ness wins at 56 square kilometres.",
            "Meanwhile me driving 2 minutes seeing a lake 47x bigger (im Canadian)",
            "Whilst having an almost 7x smaller area, Loch Ness is *deep*.",
            "It is a country itself but only a collective of 3. Northern is a province that acts like a country but is not.",
            "It is a country itself but only a collective of 3. Northern is a province that acts like a country but is not.",
            "Where East met West for so many years",
            "Vättern, Mälaren! Den sköna listan kan göras lång",
            "The original Lake Komorany was like 55-60km2 and bigger than Lipno dam. Once the coal mine is closed, the area will be turned into a lake again.",
            "Etang de Berre is a lagoon though.",
            "Great Bear Lake (31k) and Great Slave Lake (27k) are also pretty Great. Winnipeg (25k) is just ok.",
            ">Guess that’s why the call them Great.\n\nWhy not call them \"Big Lakes\" then?",
            "To be fair that's the Caspian sea which is brackish water. Most people think of lakes as freshwater.",
            "Yes, you are right. I am just stupid. nvm",
            "That's interesting. I never would have imagined it possible filling in a lake.\n\nI actually live on CZ for the past few years now and we have sand quarries near us that make nice summer beaches and swimming spots. I think our area is a hidden gem of Europe.",
            "Biggest natural lake is only 4.2km2 though",
            "Unlike Bodensee ?",
            "Nice! ![gif](emote|free_emotes_pack|joy)",
            "Not really plenty of lakes in Europe are a result of the last Iceage",
            "🤷",
            "Yes, Vänern is EUs largest lake.",
            "i think they only count natural lakes not artificial ones, that'd be my guess why they picked yours",
            ">500ha\n\nha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha",
            "Lipno I is 48,7 km^2",
            "O, you also have one of those \n\nhttps://en.m.wikipedia.org/wiki/Black_Lake_(Montenegro)",
            "Man made lakes are used for, at least, Portugal and the Netherlands",
            "Interesting is, that mobile search says Medard with 493,3ha and PC search says (with the same search parameters) Orlík with 4870ha, biggest natural is Rožmberk with 489ha. Google is weird.  Nevertheless, 0,2km2 is waaaay off.",
            "Cool but for Poland it would be Śniadrwy a tonguetwister",
            "Baikal is far larger.",
            "As per my previous comment - this map is badly made and therefore should not be taken seriously. It lacks names for each lake, and requirements for choosing some lakes and excluding others.",
            "in austrian schools its also taught that neusiedlersee is the largest lake\n\nit just doesnt make sense, lake constance is even a conduminium, its area is basically ahared bewteen austria switzerland and germany",
            "Yes. But the German Name, Bodensee, also comes from a place/municipality. Instead of Constance its Bodman(-Ludwigshafen), but many german-speakers assume it comes from Ground Lake, which is not true. Bodman is the oldest settlement at the lake.",
            "That's also its French name",
            "By that logic, Switzerland and France should have 580km2 for Lake Geneva.",
            "We alsi have the Müritz, 112,6 km",
            "You're right, \"lake Léman\" is an pleonasm, but it's still better than Lake Geneva.",
            "I grew up in Vaud, you hear “le lac Léman” all the time. There’s even a famous joke about kids thinking it’s called “le lac Clement”",
            "Lac Léman everywhere in France.",
            "What ? Maybe in Swiss but in France we call it le lac Léman even though it’s a tautology",
            "I too like Wisconsin",
            "Nothing in the Netherlands is natural at this point",
            "But we also made polders from many other lakes to compensate! There used to be one giant lake from Leiden all the way to Haarlem and Amsterdam for example. Now it's the Haarlemmermeerpolder (where Schiphol is), only the Kagerplassen remain.",
            "Fellow Groninger, I assume? If so, moi eem!",
            "isn't Grevelingen lake 2nd largest?",
            "Such a waste of opportunity to make the largest lake even larger",
            "Vänern in Sweden is 10 times bigger than lake Geneva.",
            "Balaton is bigger, lake Ladoga near St. Petersburg is much bigger than both.",
            "Kind of like an aquatic gentrification.\n\nMake life good for all the fresh water fish while evicting all of the salties.",
            "To confuse people even more about it, though, in German we have two words that are \"See\" depending on which article you use.\n\n\"Der See\" is a lake. There's no other word for \"lake\" of a respectable size (we do have Teich or Tümpel but those are for small lakes)\n\"Die See\" is the same as \"Meer\" or in English \"the sea\"\n\nWe do kinda have words for artificial lakes in \"Baggerloch/see\" but those are pretty explicitly for lakes that were excavated, so Ijselmeer would never be called that lol",
            "Ground Lake",
            "At least the German speaking parts do, yes.",
            "And Austria too. This map is rather inconsistent with lakes on borders.",
            "Don’t all three countries have different opinions of borders on the lake? I think Switzerland claims only half of the lake, and Austria believes that the whole lake belongs to Germany, Switzerland and Austria simultaneously.",
            "I think a very mature way of approaching things: we disagree all but think the topic is not relevant at all. (Until we are short on water).",
            "Baikal is crazy. All lakes are dying. Rivers bring sediment that slowly fills them in. \n\nNot Baikal. The Earth's crust on either side of the lake move away from each other, causing the lake to get deeper and wider. That's how it's survived as the oldest lake in the world.",
            "it also reaches a depth of around 1600m",
            "but not by volume, which is what he said",
            "Now see, I was going to make a joke about Spain being able to create a lake by pure laziness because, you know, Spain. \n\nI trust that you’re right, but now in my head you’re using a Spanish accent and insisting that nope, there couldn’t have been any laziness involved because the lake was always that size!\n\nDam failed because of lack of maintenance? No, no, dam was unused, needed to be torn down anyway. See? No laziness!\n\nIt’s been a looong week. I think it’s time for my siesta…",
            "No really. Lagoons (depending on the definition) rely on it's water from the sea, which is not the case. That's why the authorities that control this area consider it a lake not a \"laguna\" (lagoon in English). \nThe water from this lake comes from the Jucar river.\nThe only thing that resembles a lagoon (that I think) is its proximity to the sea.",
            "That's why I said that it was normally confused. As in the past it was a lagoon. The name is more historic as in the past it was salt water, but now it's freshwater. \nL'Albufera it's not actually an Albufera, strictly speaking.",
            "In a beer barrels",
            "We swim in beer. \n\nNo, seriously, Czechia has Croatia for swimming.\n\nAnd now absolutely serious, we have rivers and fishing ponds, but it's usually not the cleanest water.\n\nedit: lmao by the time I finished writing this, three other people already mentioned beer. Yes, we use all the lake water to brew beer, so what",
            "In their beer glasses",
            "It's located on a rift https://en.wikipedia.org/wiki/Baikal_Rift_Zone and is growing by several millimeters each year. Might become an ocean in the future",
            "It’s created by a rift in the continent. It’s possible the continent would slowly separate until it’s filled in by the ocean.",
            "Exactly! 😂",
            "The Fins beat us in many things. Average happiness, education quality... You name it, they beat us. If Finland were a superhero the Netherlands would be in it's rogues gallery. \"Argh, foiled again! Damn you, Finland! Snotveredorie!\"",
            "Our lake is way cooler tho 😤",
            "Exactly, having some cool fish or some natural resources that happen to valuable is nice and all, but beating the fins is way, way more important and other things should definitifly take a backseat to that",
            "So Fennoscandia?\n\nhttps://en.wikipedia.org/wiki/Fennoscandia",
            "Classic Brits are at it again behavior",
            "When I hear stories like this I really wonder why the Brits haven't done away with their aristocracy.",
            "Irelands largest pothole, thought there's a few near me could be contenders",
            "Ohios biggest lake not counting Erie I find funny.\n\nThe lake was literally dug out by people and filled, it looks so unnatural and is usually between 5-7ft deep. Its so shallow that you can completely stand up in most of it. And its 55km2 so not small",
            "Lough Neagh is 392 km2.",
            "Loch Lomond is bigger than Loch Ness by a good 15 sqkm",
            "Lough Neagh still counts as British, it just isn’t in Great Britain.",
            "They're expecting the area of the new lake to be just 7 km^2 and it probably won't be too deep so the potential hydro powerplant will not be that good. They mignt not even build it since just filling the lake should take like 15 years",
            "It's still the largest lake that is completely within Germany.",
            "They went for Vlasina lake, according to wiki, its semi artificial",
            "The Netherland’s damn lakes sure as hell ain’t natural",
            "They counted Portugal and that is a man made lake.\n\n  \n[https://en.wikipedia.org/wiki/Alqueva\\_Dam](https://en.wikipedia.org/wiki/Alqueva_Dam)",
            "Google lies? Weird.",
            "Compared to many Polish words that is positively mellifluous",
            "oh yeah",
            "Baikal probably wishes this map was measuring depth too",
            "There are varying views on that. \n\nSwitzerland wants that the border is at the middle line, Austria (who has the smallest shoreline wants it to be a condominium and German claims the Überlinger See as it's sole territory, the Untersee at the middle line and the rest basically as a condominium.",
            "Not quite, the border officially ends at the shore. So the lake itself technically doesn't belong to any country",
            "But Lake Geneva is the English name, and we are speaking English. I don’t understand the reasoning behind using the French name for the lake.",
            "One of their nature reserves was made by humans 10 000 years ago and now developed into its own ecosystem that needs to be maintained by shepherds and flocks of sheep or it will turn into forest in a few centuries time.",
            "Except weed",
            "God made the earth, but the Dutch made Holland.",
            "I am",
            "> God made the Dutch, the Dutch made the Netherlands\n\nBible or something",
            "That lake was also the result of peat digging. ",
            "No, Grevelingen is only the 5th largest lake in the Netherlands (though it *is* the largest salt-water lake in western Europe.)\n\n1. IJsselmeer (1100km2)\n2. Markermeer (700km2)\n3. Veerse Meer (203km2)\n4. Haringvliet (116km2)\n5. Grevelingenmeer (110km2)",
            "And Ladoga 3 times bigger than Vänern.",
            "Thanks for the correction. I checked and Balaton is indeed bigger by a dozen sq Km. So i'll hand to lake Geneva the biggest natural lake in western Europe. \nMy personal win as a Genevan. ;)",
            "Maybe its time for a War over it.  But learning from the past tells me: don't mess with an angry Austrian Guy (but this time Germany will be on the End with more resources) and Switzerland wont participate in it. 🤔",
            "I just love me some fresh water seals. WTF you boys doing in central asia? like after the ice age some of them just ... what ? slid down the wrong way??!",
            "You think \"all lakes are dying\"? You've never been to Canada then. Lake Erie has more fish species than Baikal.",
            "And that's why it holds 23,013 cubic KILOMETERS of water. That to me is simply insane and I live by the great lakes. Sure, it's a large looking lake (surface area wise) but it's depth is insane",
            "Big yikes",
            "The funniest guy in his house (lives alone).",
            "The criminal dictator and his acolytes built the dam with shitty materials, ignoring warnings from several engineers, and filled it to the brim to test if it was strong enough to withstand high capacity levels. It wasn't, and as a result 144 people died in a violent flooding. The handling of the issue by Francoist authorities was even more repulsive. I fail to see where the fun is in this story.",
            "As a Czech I can confirm.",
            "When your beer is that good, fuck the lakes.",
            "Nope. Vänern is better!",
            "It has cute [seals](https://en.wikipedia.org/wiki/Saimaa_ringed_seal?wprov=sfla1) 🦭",
            "Which is not the same as Scandinavia",
            "we dont want him",
            "He'd own the lough whether he were an earl or not.",
            "I did not know that.",
            "Milada lake took like 10 years to fill. I have read that the filling of the mine - originally scheduled in 2024 - won’t be started till 2028.",
            "That metric is a bit weird, biggest semi artifical lake. But whatever, it's not important anyway haha",
            "\\*dam lakes",
            "Yeah, but no one is going to piss off the Dutch by telling them that",
            "Maybe it has something to do with the cutoff where the river ends and the dam lake begins\n\nBecause in reality it's not always a clean cutoff point, especially with dam lakes, and you can really stretch it",
            "I've never seen th word mellifluous before and I'm now off to a dictionary.",
            "no\n\nall 3 countries have different definitions, austrias definition of the border is that its a condominium, which is why i think its really weird that official austrian sources claim neusiedler see to be the biggest",
            "That's not true either. Some services as rescue squads are shared, but they didn't settle on the borders inside the lake.",
            "Because it has been a trend to force other languages to use the local name. Turkey is violent about it. Some others as well.",
            "In French speaking Switzerland they it call « Lac de Genève », at least in Geneva. Not sure about Vaud and Valais.",
            "Yep. Drenthe is a marvel of gradual engineering",
            "We have those in Britain too. Dartmoor is a good example, it now has to be constantly maintained to prevent it turning back into a rain forest. The last time it was truly forested was the bronze age. Before that it had been covered in tropical rainforest for millions of years",
            "The weed is extremely chemicaly enhanced",
            "Lmao probably the least natural stuff",
            "Weed has been breed to be as strong as it is. It’s GMO’d  to the moon!",
            "Nah humans came from africa",
            "So the Dutch made the lake, and the later drained the lake",
            "Not the Ijmeer?",
            "That’s Russia. We don’t consider Russia Europe. Russia is trash.",
            "Weeeeeeeeeeeee[years pass]eeeeeeee",
            "I wish I could get the beer from your last swimming in my next bottle",
            "That's true, but wanted to include Finland",
            "Well the mining hasn't stopped entirely yet I think but should in a month or two so after that will come some bureaucracy (domestic+EU), environmental assessments, dam building,... so 2028 seems reasonable\n\nEdit: there will be no dam. The inflow and outflow should be free. They are planning on putting a bunch of floating solar panels on it though so that's nice",
            "I fully agree. When I saw the map, I knew which lake it is in Montenegro and Albania, also N Macedonia, and then I saw Serbia, I realized I have no idea which lake it is. Also, size of Skadar lake is problematic, it varies by a lot. The wiki says it goes from 370 up to 530 km^2",
            "** damn dam lakes",
            "Why would I - or any Dutch person - be pissed off by that 😂\n\nIn Dutch we would say \"leef je uit\"\n\nEdit: it is probably more of a compliment because we actually mastered an element",
            "So after a quick google, 19,48km^2 is the area of the village Lipno nad Vltavou, after which the dam was named",
            "A bridge going over the river is the cutoff point that everyone uses. On one side of the bridge is the Vltava river, on the other is the Lipno reservoir.\n\nAs someone else said, dude found the area of Lipno and Vltavou, the village the lake is named after",
            "Of course the country with the smallest shoreline wants it to be a condominium XD",
            "Yes but at least, while equally unreasonable in my opinion, Turkey officially changed its English name. While Lake Geneva still has an English name, together with a French name, a German name, and a Romansh one…",
            "We would also refer to it as such in Neuchâtel.\n\nE: Actually both, now that I think of it :)",
            "When I lived there I would hear Lac de Gèneve for the lake and Léman as a name for the region. The French had just opened a new train line with that name.",
            "Definitely not in Vaud and Valais, it's actually a point of contention",
            "I think you mean “temperate rain forest.”",
            "You say that as if it returning to forest would be a bad thing. There's nothing natural about the sheep-grazed deserts that British uplands are at the moment.",
            "The IJmeer is only 80km2 and is really just a smaller part of the Markermeer. It's just the bay area between Amsterdan and Almere.",
            "You want to drink used swimming beer??",
            "How can Turkey change its English name? It's the English speaking world that determines how something is pronounced and spelled. They can of course use a certain spelling, but they can't insist on it. Also, why would they do it in the first place?  For me a sign of inferiority complexes.\n\nSo, coming back to the water in question: it has an English name given by, probably, the British. And it's mostly considered wrong by the locals, but they understand that it's not on them.",
            "You say that as if natural=good",
            "You don't?",
            "only if it is used by a real man",
            "Obviously I understand that as a civilization we need to use some percentage of the land for urban areas, farming etc. \n\nBut the UK has pretty much ZERO wild areas - every inch of our uplands are cropped to within an inch of their life by sheep grazing. Turning at least some of that into real reserves where sheep are kept out and deer numbers are not allowed to be unnaturally high would definitely be a good thing.\n\nOn a selfish level, having access to truly natural spaces is incredibly enriching, but of course it's also the right thing to do for our very depleted ecosystems of plants and animals.",
            "They say that as if natural is natural, naturally."
        ]
    }
}