{
    "Weekly Q&A - Ask your questions here! - June 21, 2024": {
        "title": "Weekly Q&A - Ask your questions here! - June 21, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/MarvelSnap/comments/1dl3g6k/weekly_qa_ask_your_questions_here_june_21_2024/",
        "content": " Hi [/r/MarvelSnap](https://www.reddit.com/r/MarvelSnap),\n\nPlease use this post to ask all of your Marvel Snap related questions! As the community grows, we'll start to collate all of the most commonly asked questions to create a FAQ wiki page.\n\nRemember to follow the community rules, and be respectful when answering questions.\n\nThanks!",
        "num_comments": 31,
        "comments": [
            "Still fairly new to the game. I hear people on YT playing using the phrase \"on curve\". Also the word \"split\" on a card design. Can anyone explain the terminology? Thanks in advance!",
            "Do $29 and $99 ever return to store? I missed a bundle I wanted to buy and now I'm sad about it (Symbiont Black Widow)",
            "How does summoning at a random location work in terms of probability? Is it based on number of open spaces or split evenly with all available locations? \n\nLike let's say I discard wolverine and the left location has 1 spot open, the middle is wide open, and the right has 1 card in it. Is it equally likely to go in all locations or more likely to go into the middle > right > left? \n\nI believe it has equal chance since it essentially has 1 \"available spot\" in each location since it only takes up one spot, but thought I'd check if someone has demonstrated this.",
            "Are there any good low budget (CL1300) decks with Wong out there? Bought the bundle hoping to get something going with Wong+Tiger+Odin but I don't understand how to fill the rest of the deck and all the videos I see online are extremely outdated\n\nStruggling with winning now that I hit infinite and everyone just bodies me, lost \\~10 games in a row to insane combos. I hit infinite with Thena Disrupt deck which is basically \"disable everything they have\" through Echo+Cosmo+Goose but it stopped working so I figured the ol' reliable might be a solution",
            "Question about the 700-900g borders in the shop!\n\nIf I purchase a gold one and put it on...whatever, an Angela variant. That means any future Angela card I get will have that border as an option? Or is it just one at a time, but can be swapped between any Angela card at any moment?\n\nI picked up two already when they went on sale but haven't connected them to cards yet as I wasn't sure if they were locked to a variant or split and didn't want to make a rash choice! So just wanted clarification from those who know firsthand!",
            "I have the challenge to win all three locations today for season pass challenge and it’s driving me nuts, every time I’m about to win them all the other player retreats and I don’t get it.. how do you guys do this one?",
            "Will arishem give credit for the weekly token quest if the spotlight card gets randomly added to your deck?",
            "How does one change their player name to something else? Every time I want to change my name to something I want it to be, it does not go through.",
            "Is the order that you get series 3 cards ACTUALLY random because I really have a hard time believing that it is. I'm conveniently still missing a ton of actually useful series 3 cards and the shop conveniently keeps pushing them to me in bundles for $15 - $20 every month. The amount of times the game has tried to get me to buy Hela, She Hulk, and Wong (not the current variant bundle I get \"for you\" bundles for him too) is amazing considering I'm pulling cards like Silver Samurai and Bast/Mysterio in a row (two recent conquest variants). It just seems super fishy to me.\n\nI'm just really frustrated with how slow the series 3 grind is because I'm basically forced into playing the same two decks over and over for weeks because I don't have any other cards.",
            "When are we getting more than 20 deck slots? And what about deck folders (to organize: classics, new cards, etc.). With new cards every week, 20 decks are too few.\n\nAlso on decks: how about reverse search? Pick a card and see what decks you have that in.",
            "Can anyone recommend decks for Conquest they've had success with? I'm getting destroyed at the moment lol.",
            "No",
            "Playing a specific card \"On Curve\" means playing the card on the first turn possible to play it. In general playing \"on curve\" means youre always using all your energy each turn\n\nA \"Split\" is what happens after you upgrade a card to Infinite border. You \"split\" it to get a new cosmetic version of the card with a background and flair effect",
            "Playing \"on curve\" means playing a card(s) each turn to maximize your energy 1,2,3,4,5,6\n\n\"Split\" refers to once leveling a card to maximum Infinite level you can split it to get another of the same card with different background/effects and then continue leveling that card. You can split a card multiple times.",
            "Bundle variants have never been re-released, and SD has said that they don't plan to do so in the future.",
            "number of open spots doesnt matter",
            "Any given location only has either 1 or 0 open spots at any given time. You can’t have a card put in the bottom-right of an empty location - those later slots only open up once there are cards in the earlier spots.\n\nSo a card going to a random location is equally likely to go to any locations with an open slot.",
            "What do you get with your collection when you autocomplete with Wong/WT/Odin?  The usual complements for maximum popoff potential with wong are magik, mystique and absorbing man.  It can fall apart to disruptive decks, though.",
            "If you have Mystique & Magik, can play Magik > Wong > Mystique > White Tiger > Odin.\n\nThis won’t work reliably at higher collection levels, but should be good for where you’re currently at.",
            "Mr negative is pretty good with wong. You can run surfer, ironheart, brood and just random 3 cost on reveal stuff if it’s a surfer deck, or lean more into negative synergy with iron man, mystique, etc.",
            "The borders get assigned to a card, and then it’s unlocked for that card forever.  Any variant of that card can pick that border in the custom card config.  You can change it out and change it back no issues.",
            "Just forget that you're trying to do it. You've got over a week, if you're just doing your dailies, it'll happen at some point.",
            "missions to use a specific card almost always say \"with x card starting in your deck\" - so no, cards added to the deck by arishem won't count",
            "The devs aren’t here. Try asking in Discord",
            "I’ve been doing good with hand-attack/mill (which is probably very matchup dependent) and zola destroy.",
            "\n\nTry one of these:\n\nPhoenix Tribunal: [https://www.youtube.com/watch?v=rLNi7otWq1I](https://www.youtube.com/watch?v=rLNi7otWq1I)\n\nHE Affliction: [https://www.youtube.com/watch?v=RzifBHY-T08](https://www.youtube.com/watch?v=RzifBHY-T08)\n\nJean Grey: [https://www.youtube.com/watch?v=HiI-RoGKBmo](https://www.youtube.com/watch?v=HiI-RoGKBmo)",
            "I appreciate your response!",
            "Thank you for the reply!",
            "I get mostly low energy On Reveals, since I don't have that many series 3 (and forward) cards. No magic or mystique. I plan on targeting Mystique for my next month monthly card though. Should be doable. Thank you",
            "Amazing! Thanks so much. I liked them for certain cards already, but this makes the investment much more worthwhile. Cheers! :)",
            "Thanks!"
        ]
    },
    "Weekly Card Release Discussion": {
        "title": "Weekly Card Release Discussion",
        "score": 133,
        "url": "https://www.reddit.com/r/MarvelSnap/comments/1diuwxn/weekly_card_release_discussion/",
        "content": "Please discuss the newest Marvel Snap card release here. All questions, strategies, and opinions about the new card are welcome!\n\nhttps://preview.redd.it/hbc73tiuxc7d1.png?width=351&format=png&auto=webp&s=3253e597aa1e302d106f67a3651db0679f5704d5",
        "num_comments": 429,
        "comments": [
            "I am glad she is out it gives me one more week to save keys",
            "Awesome card! She is really going to help me save some keys",
            "This is the perfect example of a card that should be a series 4 at launch.  \n\nIt will likely have some use, especially in Surfer decks.  But the potential free four points doesn't justify replacing a card in most other decks.\n\nCould be a fun card to play around with and try to come up with other uses, but not for 6k tokens.",
            "Wanted Gladiator, had 3 keys so went for it. I got Makkari and Gladiator next. Ok new card, let’s try it out. First game, Makkari immediately runs to the space throne…",
            "m baku but bigger in power  and better functionality  lolXD",
            "Why is this not a series 3 release. We need few of those here and then.",
            "I think players are overstating the risk of her running into a bad location. There are good locations to run to as well. Just won a game in part because she landed in Quantum Realm, bypassing the power loss.\n\nI was going to get her for C3, then was going to skip her because I don't believe in C4... at the last minute I realized there's a synergy with Sersi, who's been losing me ranks but a lot of fun. Sersi magnifies the power of cost reduction. Makkari is free, but she's \"just\" a stat stick, and a small stat stick at that. Re-rolling into a random 4-cost starts looking like better value.\n\nProbably still mostly niche. But I think better than the community-average opinion of her. Location risk is scary but lower in practice, with potential high upside as well.",
            "I just want to say that I really appreciate that this card is getting people to try decks that I haven’t seen much of before, instead of just a card that people slot into existing archetypes.\n\nMoon Girl stuff, Strong Guy stuff, off-meta Surfer, Storm/Legion, midrange tempo. I’ve seen some pretty cool brews since she was released and I think that’s a good thing for the game overall. \n\nNot every new release needs to shape the meta.",
            "I just don’t see any deck for this card. Surfer? Too crowded, doesnt really edge anything else? Cerebro? C4? Ehhhh. It just feels dead on release.",
            "Hot Location: Bar with No Name",
            "I'm not using my keys for her, but for X-23 lmao.\n\nImagine if she get +1 every turn, but she has too move around like Silk does.\n\nI wouldn't say it's good, but at least it has more than whatever this is.",
            "Would love to have Makkari for my Sandman deck.  There might be a good supergiant deck with her also.  Decks that want early priority or points without combos. ",
            "Pulled because I needed x23 and gladiator, ended up with makkari. Less disappointing than the Kang I got on the random pull",
            "Haven't seen her in 4 hours of playing.",
            "I'm gonna have SO many keys saved up for July",
            "She's going to be great in the bot farming deck. 😵‍💫",
            "So saw Jeff Hoogland playing this with legion Storm combo.  Lets you put points on the board that deck needs without costing energy.",
            "I think shes gonna be fine but its an outrage that shes series 5. I will skip this week for sure",
            "Card looks like absolute dookie but I don’t have gladiator…",
            "Pass for me. Power creeped M’Baku is kind of meh in my opinion.",
            "I guess her little animation of her running from your hand is kinda cool. idk else what to say about her. She’s really just there",
            "I dont have X23 or Gladiator so I am gonna maybe got her :D",
            "They're definitely gonna buff her if she's as lackluster as people think she'll be, so I'm fine pulling for her since I think she'll be decent and I want those variants. Hoping they buff to 5 power for Cerebro compatibility.",
            "Are people in the comments forgetting that Glad is S4 now?",
            "So I can't explain my reasoning, but I just have this weird feeling that she's gonna be good. A part of me just thinks we're all underrating being able to have a *free* card.\n\nThat said, I'm probably wrong, and this card is gonna be just as bad as everyone says it is.",
            "The x23 variant is tempting but i should really save my keys",
            "guys which turn is THE turn?",
            "Thank for sd help save my little key",
            "I still do not see how good Makkari's ability is to be a Series 5 card.",
            "Happy X-23 Day to those who celebrate",
            "I do think people are underrating this card. As in, people think it's a 2/10 card when in reality it's like a 6/10.",
            "Unfortunately I don’t have X-23 so I might end up wasting a key on this card. Hoping I just pull X-23 first, or Gladiator then X-23",
            "There's absolutely no way they don't buff this dogshit card",
            "The cache design on this is weird.\n\nX-23's been in a lot (5th including her release) and the last one she was in also had Gladiator. So, if you got one, but not both last time, not a lot of incentive to pull here.\n\nAlso that cache was the release of Corvus Glaive, a popular and strong card. While this one has a card that neither deck she wants to be in (Surfer or C3*) particularly wants to run her.\n\nI don't know who this is aimed at besides players who weren't playing in February or lacked caches then. But, even those players would probably be bettered serviced next week by the Corvus rerun with Phastos.\n\n*forgot about the +1 power buff when I wrote this.",
            "So, i was really planning on pulling since im playing destroy a lot atm and really would lik so have x23 - right now im not 100% right now. i mean gladiator is also nice to have?",
            "Gladi boi looks good but not worth the risk for me. I'm out.",
            "Man, I want to play this in Shaw Surfer, but any sort of lane clogging would make this a disadvantage",
            "Makari is ehhh to me but picking up x23 and gladiator for anyone new is solid a hell",
            "So far, she is great in moon girl combo decks that want to have < 3 cards in hand when played (shulk, death, mockingbird, daken, proxima lists) Also messing around with apoc-less dracula, for the same reason. Lowers variance",
            "If you saw Bar with No Name and Space Throne, you could just pay for Makarri's cost to play her somewhere. She's not like a mini-Agatha where you have no choice for the turn.\n\nThose two locations don't appear every game, and letting her decide to jump to those locations would be dumb.",
            "well, lucky me, i got x-23 first key. wont touch makkari lol",
            "Was missing two of the cards (Makkari and Gladiator) pulled once and got Gladiator...would kind of like Makkari but she doesn't seem that exciting so I think I'll save my keys.",
            "I know this community really sucks at evaluating cards but I agree that Makkari seems bad\n\nC4 is a meme deck and surfer has loads of better cards you'd rather run \n\nThe devs kinda messed up by \"buffing\" her to 3/4, she would've been amazing in C3",
            "Im a new player lacking x-23 for destroy and destroy/junk, both of which she is mvp or close to it. So ill be pulling this and hoping I avoid Maakari, but if i pull her and get x-23 last its not the end of the world.",
            "Passed on 3k gladiator in my shop thinking I would spend keys this week (already own x23). Now I'm reconsidering and just waiting.\n\n\nCurrently have Jean grey pinned",
            "I've decided to spend 1 key maximum on weeks like this.  I ended up getting Makkari and I look forward to seeing if anything neat ends up working out with her.  I feel like she may have a niche in a greedy deck.",
            "Anyone feel she’d be really good in a Surfer deck? There’s so many 3 costs you want to play that she’s a good addition for an easy 4-6 power boost. Might be helpful with Jean/Negasonic plays too.",
            "So far I've pulled Gladiator and X-23. Based on what I'm reading, that seems like a good place to stop.",
            "I feel like the absolute last thing surfer decks need are random fodder that can crowd up a Wong. Easiest skip ever",
            "don't even need to play it or see it in action to say that it's clearly a 3k token card, SD needs to get it together and stop releasing everything as 6k",
            "I'm going to be cope using her and Gilgamesh in a Thena deck, I love the Eternals comics and Makkari + Thena/Gilgamesh relationship are my favorite. Will it be meta? No. Will it be cool to see them all together? Absolutely.",
            "We could've had Phastos or Arishem a week earlier, but no.",
            "I only care for x-23",
            "Absolute shite.",
            "This could easily have had the Proxima 'goes to lowest power location'. I don't believe it would significantly improve her, but might make her more consistent and let her access things like sanctum sanctorum.",
            "She will be very good for getting early priority for T2-T4. But are there any decks where having early turn priority is really important, and which can also spare a deck slot for her?",
            "So I used a modified version of[ Bynx's deck](https://www.youtube.com/watch?v=IqEklkn0poc) (at 1:55:00) for Thena, replacing White Widow for Makkari (I don't have Widow). It's been doing pretty good so far! Her animation on hand and when she jumps is top-notch. So far is seems creators have been enjoying her. From Jeff's Legion/Storm lockdown to Dera's Zoo, it's fun to see.",
            "cl 1900 tried to pull for x23 and glad, but drew baron zemo duplicate as my random (feels sick) and I can be sure to pull makkari but trying to decide if it's a waste of another card",
            "I just wanted the Gladiator variant and luckily got it on my first pull.",
            "Dead on Arrival, should have been series 4.....",
            "Shes going to be a good card and you are going to see players and streamers have positive things to say about this card. But the issue is that she's terrible value for the ridiculous cost of a series 5 card. This is 100% a skip week for me. \n\nPersonally I think this card would be a lot more interesting if it had the text \"costs 0 on the turn you draw this.\" that way you get some eternal synergy with Thena and you also get to choose the location. Right now she just seems insanely underwhelming for a series 5.\n\nWhat happened to flexible series drops, because this is a perfect contender for a series 4 drop (honestly should be series 3).\n\nIf you couldn't tell I'm upset about all card releasing in series 5.",
            "Poo poo pee pee card",
            "Might pass",
            "I had 6 keys so I decided to pull the trigger 4 times because all 3 looked solid. Going to try to make room for her or gladiator in my surfer deck!",
            "i use her in my hazmat surfer deck, which i sometimes struggle to get more than 2 or 3 3-cost cards into the board, and I like that she is on the board no matter what, but i will say that she seems to pick the worst place to play herself every single time lol",
            "This card feels like USAgent week 2.0. In the sense that SD will buff it during the first OTA/patch after her release.\n\nOverall I see far more negatives than positives.\n\nFirst downside of the card: zero control where she is going.\n\nSecond downside: unfun card, you literally have to NOT play it to use it.\n\nThird downside: she is NOT FREE, she costs you a card draw. The average draw x game is 9 cards. So are paying a 1/9 of your \"draw resources\". How many ppl would be happy with a location that says: \"Skip your next card draw. Add +4 Power to your side at a random location once\". \n\nFourth downside: her best deck atm feels that is SS but that deck cards slot is already VERY competitive. So you dont even feel good finding her a place in there.",
            "I think an interesting buff would be “After Turn 3, runs from your hand or deck to a random location. (if possible)",
            "I love the character, I love the art, I hate the card. ",
            "i need x23 for my destroy deck so if i pull makkari cool if not ill save my keys for Arishem",
            "she cool in dazzler zoo decks",
            "All I wanted was Hellfire X-23 and I got it 😎 plus Skaar from my first pull, which I hadn't really given much thought to but I'm having fun with it in my Sauron deck",
            "Is it worth trying for if I don't have gladiator or x-23? I have 12 keys saved, but I'm just CL 2k so I'm missing a bunch of cards. Saving for upcoming weeks but as I understand it they are both really good cards?",
            "Not the worst card but certainly skippable ",
            "Saved up 6 keys, 2 to try and get Gladiator this week, 4 for all cards next week and 6k tokens for Arishem. Pulled Makkari first key, duplicate second key.\n\nDidn't particularly want Makkari but she's working as good as any other card in a Surfer Deck, tbf she did actually win me a game by running to a tied location",
            "I can see one of the following happening with this card:  \n\n1. She's a lot better in practice than on paper. She has a use and people are going to be wishing they got her.\n\nor\n\n2. She really is as bad as people think and she gets a power buff / text change pretty soon that makes her better and everyone is going to wish they got her. I can see something like \"After the turn, runs to your location with the least power\"\n\n  \nRelated rant incoming but....  \n\nIt drives me crazy how people are always so confident or pessimistic about a new card almost immediately. Most of the time, people making these comments haven't even played with the card. It doesn't take much effort to find a bunch of examples of people on this sub being dead wrong about cards on release or SD changing cards to make them relevant. The meta is constantly shifting in SNAP.\n\nCannonball and USAgent are two pretty recent examples of people on here shitting on a card only for SD to change something about it or have the meta shift and all of a sudden everyone wishes they got the card. Majority of people on here were also praising Namora saying \"She's insane. Crazy strong and a must get\" and now nobody ever plays her because she needs so many things to go right to make her worth it. \n\nAm i saying Makkari for sure gets a buff or is better than she seems? Absolutely not. But maybe people on here need to start learning to let some time pass and let things unfold before being so confident in how they view cards and trying to sway peoples opinions on getting cards because \"trust me bro, card is amazing/trash\".",
            "I'm glad they released sersi and makkari, more keys saved, thank you SD",
            "If they actually stuck to their flexible series releases this would be a prime candidate for going straight into Series 4 imo.\n\nEZ save for the week personally.",
            "This card just needs an adjustment to have it go to a specific location rather than random, then it'd be \"Ok\" and a sometimes inclusion.  Being random, if Sersi has taught me anything, will burn you here and there so competitively this card is not it.\n\nEasy pass, have the other cards, waiting for Arishem.",
            "She’s stronger than I expected. Don’t play her in Surfer, she wants to be in decks that care about early priority. Sorry to tell you, but Storm-Legion might be back.",
            "one of my first games with her, she jumped to sanctum sanctorum and won me the game…every other time she seems to end up in my wong lane which is quite obnoxious sometimes when i want to fill my wong lane",
            "I'm actually enjoying her in my control Asgardians deck as it doesn't interfere with the curve and with the lack of a 1 cost card in the deck it's nice having her come out if you draw her initially.  Her raw power may not be the greatest but she's basically 0 cost plus whatever card you are wanting to play on top so I believe she is better than what most are giving her credit for.",
            "I decided to pull for X-23 even though I think Makkari will be bad. First pull Black Knight, second pull X-23. Now I'm debating whether I want Gladiator badly enough to risk wasting a key adding Makkari to my collection...",
            "More often than not she's four points in one of the first turns, making prio swing in your favor. She's also helpful in that you can play more tech/disruptive cards without having to worry about swinging points like Red Guardian, Luke Cage or NTW",
            "Ok, so I'm a Cerebro fanboy, and she slots in quite nicely. A free body when I'm playing a pretty inefficient deck is very welcome.\n\nBut it really got me looking and really, C4 isn't far off from being a deck. If even just one really good card for the archetype gets nerfed or buffed to 4, it may post some success. As it is now, its not even all that awful.",
            "I think she will have more value with Phastos next week, but only if she gets hit with the +2 power. She gets better the more power she gets when she's drawn, even a 3/5 is better if she gets hit by Nakia or Okoye, but for the most part she's just not great.",
            "Not a must have for sure…but seems incredibly niche, only fitting in one or two places. \n\nHard pass for me this week.",
            "I think Makkari is too bland and very few people will be opening Spotlights this week, so if my calculations are correct SD might buff her in the next OTA.",
            "Surprised the general opinion is unimpressed to negative for this new card. Thought she sounded pretty good. If I wasnt saving keys gor Arisham would try for her.",
            "Lol",
            "skip. unless they buff her 3/5 so at least c5 can be played",
            "I’m ironically gonna skip this week I think after talkin about how she’ll be pretty good in my deck a lot here haha. I’ve got glad and x-23 but no Corvus next week.  Think I’d rather stack up 3/4 keys to make sure I get phastos and grab another card I don’t have\n\nI do think makkari gives you a path to play an extra heavy hitter in sera surfer though…I was gonna fiddle with throwing in strong guy if I pulled makkari.",
            "Going to *run* her in a few Moon Girl shells. And if she's terrible, I'm sure she'll get buffed. I only have 5 keys currently so I hope I have some left for Phastos ... I would like if she ran to your least crowded location or something so she was more predictable (and also screwed you less by filling a location you don't want filled).",
            "I actually like her! First of all I like her lightning in the card art it will look so cool when upgraded. Also I know she is not for everyone BUT I REALLY WANT HER FOR MY EVO DECK because my evo deck likes her 0-cost 4 power and I think she will be fun in there!",
            "Am i only one who thinks this card is actually pretty good?Like the only time this is bad is when you top deck her in your last turn and you dont have any late game cards in hand.",
            "People don't seem to realize this is a *free* 3 cost card that plays itself. Surfer is crowded but I could see her fitting in there, although if you're a surfer fan Phastos appears to be even better so you might as well wait for him.",
            "Would be great in that kang dump deck ! But I only have 2 keys and I want arishem🥲",
            "Moment of silence for content creators who need to get this card to make videos on it. I think a video explaining why you're choosing not to get the card will do more numbers than a video showcasing it.",
            "Instant buyers regret - absolute dogshit card into a clog-heavy meta.",
            "Can't wait for this weekend missions to offer more tokens to incentivize people to get her /s",
            "I hate how random her ability is. No way to reliably direct where her power goes.",
            "Got Black Swan then X23. Black Swan, such a forgettable card, may be worse than Makkari. A week to decide if I should roll for Gladiator.",
            "Spent all 4 to get Gladiator and X23, 2 very good cards I've been missing.\n\nPicked up Elsa and Makkari on the way.",
            "I'm running her in a homebrew C4 build, and she synergizes well with High Evo Cyclops. So far, I'm 7-3 with it.",
            "I skip",
            "Took a chance and got her first pull. Not sure if she's an upgrade over Blackcat in my deck but so far she's a way better early draw. \nNow I just need to ink her so she doesn't stick out.",
            "I got lucky and got X23 and gladiator with 2 keys.",
            "She should draw a card when she runs to a random location.  This card is just a waste in its current state.",
            "Ofc I got everything except Gladiator",
            "I was missing both gladiator and x-23 so I went for it. The one time I don't actually want the new card on the first pull, guess who shows up first, lol. Not mad though, got my other two one the next pulls, no random.",
            "I pulled Alioth and the X23 spotlight. Wanted Makkari for my surfer-Wong deck.\n\nHonestly disappointed by Alioth. 5k cp",
            "Seems like a good card to me, but idk, hard to evaluate.",
            "Could be a prime candidate for a buff in the next OTA I guess. Only reason why I’d pull for it now.",
            "I’m betting she will find a use. Everyone said Cannonball was dooky when he launched. Now look, he got nerfed from being used too much.",
            "Is anyone (other than people who want to be collection complete, and people who run the annoying season pass xp farm decks) actually tryna pull for this?",
            "Feel like Phastos will be a better fit in my Surfer deck, so I’m going to pass on her. Not a bad card, though",
            "[deleted]",
            "Hot garbagio",
            "I want my key back.",
            "she’s gonna be everywhere",
            "I’m only pulling to get Gladiator because they were assholes and moved him away from the Thena week",
            "[deleted]",
            "She should be like 3-5 or even 3-6 since she randomly goes into locations",
            "This is going to be a core card in every surfer deck but I’m not sure it will see much play otherwise. If C4 ever becomes a thing it will see play there too.  I’m passing as I already have gladiator and x-23 and don’t play enough surfer to justify 4 keys. \n\nIf snap had better card draw this would go in every deck but when you’re basically limited to drawing one card per turn, four power to a random location likely isn’t worth the spot in your deck.",
            "[deleted]",
            "What's the best way to kill Angela? Too many cards coming and going in her lane, now.",
            "Spend 6k Tokens on here. Guess she is a good Replacement for America Chavez in my SilverSurfer",
            "[deleted]",
            "[deleted]",
            "Real talk",
            "doing same,have 8 keys for arishem/phastos weeks",
            "For the arishem, right?",
            "I love running Surfer and I still can't picture including her",
            "That's why I don't want her in my Surfer deck with Brood.",
            "HAHAHHAHAHAHAA",
            "lmaooooo what a dumb card",
            "Gladiator is my goat",
            "M’akkari",
            "M'baktwo",
            "Series 3 😂 That’s rich. We’d be lucky to get a Series 4 release",
            "I was surprised she was not series 4. She feels like a good series 4 option, in that she is extremely niche.",
            "using keys wont get me any new s4-s5 card but makari,so its a skip,lets be honest card is shit and should go into s3 on release",
            "Is the Moon Girl play, partially to get a second free card on the board?",
            "She was looking decent in C3 as that deck usually has issues playing everything from hand. But C4.. ehh.",
            "Zoo, Sandman",
            "C4 isn't that bad: you have cards such as Luke Cage, klaw and sera\n\nEdit: nvm, I forgot LC has been nerfed",
            "Her only use is in dump decks, but those have always been below average decks and she's not going to change that.",
            "Maybe Strong Guy decks, but usually you want something with a bit more functionality or tech value.",
            ">Imagine if she get +1 every turn, but she has too move around like Silk does.\n\nFunny, that's basically what that person proposed for The Flash in their DC Snap post.",
            "I ended up with Makkari and a dupe before I got X23.",
            "10 and counting",
            "That feels like a deck that's good in theory, but you end up not drawing the cards you need, and it just ends up being a worse deck then it should be.",
            "This should be at the top of the thread",
            "Hey it's me but x-23.\n\nOnly have 2 keys...not sure if it's worth the risk lol",
            "yeah I got gladiator and x-23 so I feel I may skip this week as I dont want to risk getting a variant with a spotlight.",
            "Feels like M’Baku should jump from hand now.",
            "Nah I've been playing a great Mbaku deck. Copied from WoodyMJ. You Mbaku into Blink to get a big drop out like onslaught or Blue Marvel or Kazaar. And in the end you activate his ability too",
            "Seems like a pretty solid addition to surfer decks? A free 3 cost",
            "This is where I'm at too. I love Surfer decks but am missing a ton of 3 costs (Shaw, Gladiator, Hope) so I'm hoping if I do get Makkari that she won't be useless with Surfer...",
            "no Glad for me, but the variant for X is so freaking classy lol",
            "I think if you just try to play her just in surfer you're going to be underwhelmed.\n\nThe extra 4-6 power in a random spot is not going to be super meaningful on turn 6 whether you pay for it or not.\n\nOn the other hand, what this card does do really well is grab priority early, similar to Lizard or White Widow. Having her drop turn 1 and you just get to comfortably play the control game is probably the second place I would be testing her out after surfer shenanigans (if I bothered pulling for her).\n\nIf we regularly stop our opponent from doing their thing, that 4 power gets a lot more meaningful.",
            "I'm in the same boat. She has Jeff-like abilities, in that she can go to locations that you can't really play cards in. In decks that don't have lots of combos you might not really care about missing a draw, and you get 4 free power. She also could potentially have synergy with Strong Guy.",
            "angel and m'baku are free cards and some of the worst cards in the game.  I don't think the extra 2 power makes this significantly better then them.",
            "She's going to be a \"good\" card, but the issue is that she's releasing in series 5. She's not a bad card but a bad value for the insane cost of series 5.",
            "We all know her random location will usually be the least desired; Bar with No Name, Space Throne, Oscorp Tower (on turn 3) Murderworld (on turn 3), Superflow. You catch my drift.",
            "She's not a \"free card\" though she still takes one of your draws for a mediocre card. She should honestly be old Chavez crossed with M'Baku.",
            "Reverse war machine guess",
            "She can be very impactful in surfer decks because surfer decks usually struggle to play on curve. But other than that...",
            "The turning of time never ceases.",
            "the turn you are in now",
            "It isn’t. Every new card is series 5. Often pretty lame.",
            "Limited deck space really hurts a card like this even in a Surfer build which is its best spot, makes sense tho as with an ability like this its not something you want to be too good yk?",
            "How?\n\nEdit: oh fuck me I thought you were talking about power 😂",
            "Well when all the recent cards and upcoming cards are an 8/10 a 6/10 just doesn't cut it when people have limited resources.  Also think its closer to a 4 or 5 then a 2.",
            "It’s gladiator for me. He seems like a great 3 card",
            "*Spiderman meme*",
            "Same here! Curious to hear how you get on.",
            "Good luck. Keep us updated.",
            "Same for me too i just have 1 key and i really really want x23",
            "And yet, Hercules",
            "Glad I’m not the only one thinking this.",
            "> I don't know who this is aimed at besides players who weren't playing in February or lacked caches then.\n\nAs someone who started super late February...I'm happy they aimed this at me lol",
            "X23 is a must have for that deck. I grinded like crazy to get the peach variant of her. But that spotlight was x23, gladiator and Corvus Glaive. \n\nThis one is definitely a catch 22",
            "Yeah. X23 is really good in destroy. Glad is one of the best all around 3 drops.",
            "X-23 is critical to destroy, but spending keys with Makkari as the new card…I don’t know.\n\nIf you have a ton of keys, go for it. If not, consider if you’d switch to another deck style & whether future weeks have draws better suited to that.",
            "Yup, I’m at 3 keys and there’s no way I’m spending them gambling for Gladiator. I already have x-23, and I don’t care for Makkari at all enough to go full send. Especially if I can save up keys for Arishem because I’m down to clown with some meme decks with him later on for sure.",
            "yeah, i'm think about that too, for some surfer decks you must leave an empty lane for wong shanenigans, makkari is gonna be a nuisance",
            "That's me! Took me 4 keys to get X-23 unfortunately, but I've finally got my first \"full\" meta deck in the form of destroy.\n\nCame here hoping people thought Makkari would be strong be oh well.",
            "Super good if either of those show on turns 1, or 2, and she's in your opening hand and you can't play her.",
            "Gladiator really shines in Conquest. He can get deck info fast and his effectiveness increases with the more of their cards you know.",
            "This is what I'm doing as well.",
            "C3 would have had the same issues as Surfer, there are already more good cards for the deck than room in the deck so what would you actually be willing to cut",
            "I do the same thing with weeks like this where I don't want/need all the cards. Lucky draw to get the new card. Hopefully I have the same luck!",
            "I feel like she'll be buffed to a 3/5 in a few weeks or they'll change her to have a more directed destination & all of us that skipped her will be disappointed.",
            "This strikes me as a great place for her. If I'm reading it right, she's basically a 0/4 that goes to a random location the turn you draw her, and can also get boosted by Surfer. Great for if you don't see Brood, especially.",
            "Absolutely, 2 great cards/excellent value for you. A key saved this week, is a key for Phastos next week!",
            ".",
            "That would be Martyr",
            "1k token",
            "Not even worth 3k tokens. Should have been a direct to Series 3 release lmao.  This card is genuinely less useful and effectual than some Starter cards. I cannot believe people are actually spending their hard earned tokens and keys on this garbage.",
            "No love for gladiator? Defender of the shiar empire?",
            "I think the randomized is better personally. Both have their drawbacks though. Proxima is like 50/50 useless to me lately. I tend to have a sacrificial territory so I can stack the others so if she's pulled late then she only really helps from the discard factor.",
            "This would actually make her worse for the deck she's most likely to be used in, Silver Surfer, because the lowest power location is, in my experience, usually the wong lane, meaning she could make the wong/mystique/SS/Odin (depending on your variation) less consistent.",
            "Negasonic... yeah...",
            "CL 1,900 and pulling duplicates should be illegal, oh my goodness.",
            "A keys worth a guaranteed new card imo. You’ve already got your 1000 tokens so it’s all uphill from here.",
            "makkari is terrible but i feel like she's likely toget a buff(but wouldn't bank on it) x-23 is extremely valuable for destroy, and glad is really good in a variety of decks. i'd risk it for the biscuit",
            "This was me this week and was also blessed by the rng gods. Pulled that great Gladiator variant first key.",
            "Lucky.. I got him on 4. Bummed they moved him to this week.",
            "series 3 i would say,like they can release one s3 card once per 6 months at least",
            "I really like that text change. Allows it to be a free play to your location of choosing with the draw back that it needs to be played that turn to be 0. I honestly don't see a better change for her.",
            "She will get a buff but, will it matter? The random aspect of the card makes it a tough inclusion and the fact that the card doesn’t offer any direct, impactful synergy.",
            "If you have 3-4 keys to spare and have any interest in playing Destroy, I’d pull for X-23 then stop.\n\nGladiator is good, but is replaceable in a lot of decks except for Mill where he’s basically required so I wouldn’t pull specifically for him. If you really want to play Mill, get him with tokens.\n\nMakkari is a more interesting card than I think people give her credit for so it’s not that bad if you pull her trying to get X-23, but you can absolutely live without her. I’d probably go so far as to not recommend her even if you’re guaranteed to get her with 1 key.",
            "X-23 and Gladiator are both strong cards but it is looking like Makkari is turning out to be the worst card of the season.\nSince you've got 12 keys I'd say open it for at least X-23 if not Gladiator too. If you open one and get X-23, stop. But it's fairly safe to open this one if you don't own all 3.",
            "Both Glad and X-23 are worth pulling for if you don't have them independent of Makari.",
            "X23 is essential to destroy, gladiator is an all around good value card.     If you ever plan on playing a competitive destroy deck it’s a good week.",
            ">> It drives me crazy how people are always so confident or pessimistic about a new card almost immediately\n\nBecause of the Spotlight system, you only have a week of the card being live to figure out if you want it or not so you HAVE to make a quick and sloppy judgment one way or the other. Efficiently budgeting keys means sometimes you have to make that choice a month in advance. Scarcity of keys also means people are looking for reasons to pass on cards. \n\nYou're not wrong, but the behavior isn't really as much a personal failing as much as it is a pretty organic response to the spotlight system as it is now. A year ago when it seemed spotlights came back around in every two months or so, I think people afforded themselves a little more flexibility since it wasn't \"one shot to get this card or else it will be four months until you see it again\"",
            "Honestly, I think everyone is HOPING she is ass so they feel validated for passing on her because resources are so tight. And that is why everyone wants to immediately judge cards upon release",
            "They very rarely buff cards soon after release. Before Gilgamesh (which is a special case as the pay2play card of the month) the last time was Miek?\n\nAnd then before that was I guess lady D, but she was buffed like 6 months after her release.\n\nBuying a bad card assuming they're gonna buff it is a suckers bet",
            "I think part of it is that she doesn’t do something attractive on her own. \n\nBut she might shine in decks that benefit from getting a card out of the way. Like ensuring your Strong Guy procs and Dracula has a solid discard target. \n\nOf course she could still fly to space throne and make you sad.",
            "Got her because i like silversurfer and cause i like unique cards. Way more fun then boring stuff like sasquatch and mockingbird",
            "Sersi is fantastic. This one....not so much.",
            "Tbf she's been working alright in my Surfer deck but if you have a suggested deck-list I'm always looking to try out something a bit different?",
            "What’s this deck??",
            "You'd rather use that key for a new card than a future 1K tokens. Worth it to get Gladiator. 50/50.",
            ">She gets better the more power she gets when she's drawn,\n\nSo does literally every card that doesn't end in goblin",
            "Which means everyone should buy her in preparation for the buff!\n\nWhich means they won't buff her, so nobody should buy her.\n\nWait....",
            "Premium statline incoming?",
            "Based on how little of it I've seen, I expect it to be a 1/10 by week's end.",
            "It’s 4 power to a random lane at the cost of one of your draws. Sure, she’s free, but the big downside is that you are drawing her instead of one of your 11 other cards. I think she’s also competing with Mockingbird.\n\nFor what it’s worth, I actually think she’s a neat enabler of Strong Guy of all things. Remember that card? Yeah, that’s not enough to make me want to spend a key. But if I get her off of a random card pull I won’t be too upset.",
            "Borderline impossible to do with moon girl because if she is drawn turn 1/2/3 she wouldn't be able to be duplicated",
            "It's Black Cat but for Surfer decks. It's niche, but I'm not sure how it could be that bad.",
            "Well you do have a handful of locations you don't want a card on like Bar With No Name or Superflow.",
            "the card slot cost is probably too much for only 4 power, but not sure..\n\nkang is 0 power for a card slot, but it gives some info and sometimes does not cost the draw (mitigating the deck slot cost problem) and he is undoubtly (undoubtadly? hard word) the worst card in the game, not a winning proposition for makkari to be compared to kang",
            "We know she's free. The problem is she's uncontrollable. If it was \"Plays herself at the left-most location\" or \"the location you are losing\" like Proxima, her value would skyrocket as she can be built and played around.\n\nThis version sounds like a liability. If I Brood a lane but want that extra space open to do whatever and she jumps into it, now I'm screwed. She's too prone to early accidental clog. Maybe we're wrong, but just because it's free doesn't mean it's good. *See: Angel, M'Baku.*",
            "People do realize, it's literally what the card does.",
            "And you can't control where she runs. If it's the brood lane it's ok but if it's the super lane where you maybe intended to play Wong, Iron Heart and/or Odin it limits your play.\nMight be good, but I'm skeptical it it is universally good. \nOutside of surfer I can't think of a deck that wants it.",
            "How are people missing that it’s literally the only thing the card does, that just isn’t very good or impactful compared to other cards you could run",
            "Surfer rarely has issue how getting cards on the board in fact surfer is usually crowded.  C3 would have been a better fit but they buffed the power ",
            "Instant buyer, I don't regret it. It's a fun card and I've been spamming her in many weird decks with fairly decent success. People trashed on Cannonball and praised War Machine and look where we are now.",
            "My guy you say that like it’s a bad thing they do this with every card",
            "My condolences, such a bad pull considering next next week :(",
            "What's the deck?",
            "SD employees not gonna be able to feed their families this week.",
            "bro, yall fucking suck at designing and fixing cards, I dont care for her as is but you think the answer is an absolutely free 4 power deck thinner? She'd be crazy OP",
            "It should work the other way. She should draw a card when played normally instead of running to a location.",
            "He was the only one I wanted and it took 4 keys because of course it did lol I knew this would happen and I'm still annoyed but at least I got him.",
            "Same situation for me.. but on my 2md key i got x23, now i skipped the rest although i wanted glad as well.. but saving for new cards",
            "She already got buffed and I don't see her getting buffed again. A free 4 power is not going to be bad enough to warrant such an emergency buff",
            "That's because 1. Alioth wasn't nerfed to oblivion yet and 2. Prof X is what made Cannonball crazy good.",
            "That's because 1. Alioth wasn't nerfed to oblivion yet and 2. Prof X is what made Cannonball crazy good.",
            "Season pass xp farm decks? \n\nWhat are you referring to exactly?",
            "[deleted]",
            "How would Hercules synergize with Makkari?",
            "https://i.imgur.com/1k9lMGu.png",
            "absolutely not lmao, the only deck she appeared to possibly be decent in was C3, but after her “buff” she won’t be viable even there.\n\nedit: okay, let me paraphrase, she doesn’t seem super bad, but i don’t really see a reason to choose her over any other card in any deck. especially for the resource cost of a S5 card.",
            "Any Series 5 costs 6k tokens.",
            "💀",
            "Its not like Surfer typically struggles to put bodies down so what actually useful card are you cutting from a typical surfer list for this?",
            "I can even imagine how fit this ca rd on any surf shell, this is a trap bcs everyone see 0/4 not cons. Of this card get text: on turn 6 jump from hand to random location, fuck yeah.",
            "Already four power",
            "Red Guardian is a good counter if you can hit Angela early.",
            "I think you're in the wrong thread, but Shadow King counters Angela (and Kitty and Thena) pretty heavily",
            "Is she though?",
            "What the fuck does this have to do with Makkari?",
            "Thanks for the feedback on the new card",
            "Yes! Definitely the most interesting card of the month!",
            "I don’t even think we’ve gotten a Series 4 since I wanna say Miek?",
            "No, the idea isn’t to copy Makkari, it’s to keep your hand size small so that you’re copying the cards you want to copy (like She-Hulk) without also losing a draw.",
            "There's Ms. Marvel!",
            "It might be the trickiest Cerebro deck tho, either way, it’s very niche",
            "Ugh, same, and I have neither X-23 nor Gladiator…",
            "Idk how many times people need to post it but DONT OPEN UNLESS YOU HAVE FOUR KEYS",
            "I get 1-2 keys a week so generally if i have 2 keys (and not looking forward to anything) i'd risk it",
            "Definitely",
            "That’s a great idea",
            "Surfer usually has the problem of managing the board space effectively, so a card to a random location may not always help or even be problematic. Maybe if she had a bit more power…",
            "Except when she messes everything up and goes to the last spot at a location, space throne, bar with no name, etc… defo pluses and minuses in every deck. No deck where she’s just “free” in. She always comes at a cost lol.",
            "I mean surfer doesnt really need more bodies since you can fill the board easily regardless.",
            "That was my initial thought... plus adds more power without using your energy. I wonder if it counts as a card played for Thena? My initial thought is no",
            "Without hope and Shaw gladiator is worth pulling for anyway if you're making a surfer deck.",
            "As long as you don’t put her in a wong surfer deck, she’s fine as a placeholder until you get the better 3 costs.",
            "She will be fine with surfer. Throw in strong guy in that version",
            "> I think if you just try to play her just in surfer you're going to be underwhelmed.\n\nSurfer decks require you to carefully place your cards so as not to clog lanes and effectively distribute your power. The randomness doesn't help with that and even if you draw her on the final turn and can manipulate where she ends up, you aren't even getting the buffs.\n\nI'm on the fence about this card. I think it'll be something in between \"meme-y\" and a good piece for some decks but no way she's worth the keys - for me, at least, since I own both Gladiator and x-23 and rather use the spotlights for new cards instead of variants.",
            "The great thing about Jeff is that you can control where he goes, both when you play him and after. The free 4 power could potentially swing it for you if it happens to go in the location you need it to, but it just as often (or more often) could end up going somewhere you don’t need it, or even clog a lane you need to keep open. Even in surfer, this could easily screw you if it lands in your wong lane. It will no doubt steal some cubes occasionally, but it just feels far more likely that it will either make no difference or end up screwing you.",
            "M'baku only has a 1 in 4 chance of being free, and Angel needs an activator for his effect to trigger.\n\nMakari is essentially the reverse M'baku, where all you need to do is draw the card.",
            "Basically what happened with Cannonball and USAgent",
            "No way. She is way too trash. More like repeat of Martyr",
            "Until she runs into your wong lane and steals the final slot.\n\nShe could be good is a pretty specific surfer deck that’s not playing Wong but, there’s just way more cards that are more impactful.\n\nSurfer’s list is already pretty tight. Idk if she can fit.\n\nThe REAL spot would have been in a cerebro deck. The extra power kinda ruins that though",
            "Solves a non problem, because of brood surfer usually easily fills all card spaces. Let alone sera allowing 3 drops on turn 6.",
            "I think it'll be decent in an Arishem deck where you have that many more cards and it'll allow you to save energy while playing it.",
            "Yeah, there's not a single card in any Surfer deck I've ever played that I wouldn't rather draw over this.",
            "Got X-23 on the last pull, of course, and I somehow got Gladiator and his variant???? I didn’t even know that was possible. Am I just insanely unlucky?",
            "I mean, they did technically buff him TBF.",
            "Makkari seems so bad she could get a buff possibly",
            "so yeah my gambling addiction kicked.. got x23 first try and couldnt resist another one.. got sersi, i guess i can climb and have a little bit of fun now!",
            "you and me both. It was the only card I wanted this week but alas, its why we save 4 keys for cards we want.",
            "Retreat for 1 cube? Super good if she jumps to a good location instead. She's not Martyr either.",
            "You’re cutting tech cards, which is super bad for C3 because that deck lives and dies on its tech cards",
            "Yeah idk why everyone is saying she's terrible.\n\nPlus we need more cards for C4!",
            "But what do you even take out for it sure it might be good but surfer has a lot of inportant cards in there also it takes up a draw spot which people konda forget.",
            "Yeah feels so unfair. I have 0 series 4 cards and about 4 series 5, so to draw a duplicate of a series 5 feels insanely unlucky :(",
            "guess what was my 1st s5 card from cache,yes you guess right -it was kang",
            "I think if they buff her they will either make her stats worth it or adjust her text so that her location is more controllable.",
            "I have saved some keys and planned ahead, so I think I could try for X-23. Mill looks fun, but more as a fun, niche deck rather than Destroy. A good Destroy deck is something I've had on my mind for a while. I haven't gotten my free S3 card for the season, so looking at getting maybe Death or Deadpool to round out the deck more. But I'm missing Knull too, so there are some holdouts in the deck list still. \n\nAppreciate the help, thanks!",
            "Agreed, especially with what look like some potentially monster cards in the next 2 seasons.",
            "Oof, I didn't expect her to be received this bad! But alright, since I've been careful with my keys the last few weeks I think I'll go for it. Hoping for X-23 at least. Thanks for your advice, appreciate it!",
            "That seems to be the consensus! I was just a bit hesitant to use my keys since resources are scarce and Makkari has not been well received 😅 but at this point in my collection it's probably worth it as you say. Thanks, I think I'll cache in and hope for the best!",
            "Well, I do plan on getting a destroy deck together! And since I don't have any of them I might try my luck. Thanks for the insight!",
            "Or people have been playing this game for years, and can recognize a poor card.",
            "There was US agent that was buffed pretty soon",
            "The majority of the times people played sersi against me they were always screwed or lost the location. IMO it's better than makkari, not fantastic, both a skip",
            "This came from Cozy. The War Machine/Infinaut double is fun but not core to what the deck's doing. Nocturne/Any Big Card would sub in for them fine.\n\n# (1) Sunspot  \n# (1) Nebula  \n# (2) White Widow  \n# (2) Jeff the Baby Land Shark  \n# (2) Quake  \n# (3) Negasonic Teenage Warhead  \n# (3) Storm  \n# (3) Makkari  \n# (4) War Machine  \n# (5) Blink  \n# (5) Legion  \n# (6) The Infinaut",
            "My CL is only 2754 so I'm still missing some cards but Baron Zemo/Star-Lord I would probably try out/switch out for US Agent (drop Thor behind agent) and Baron I would probably for Gladiator/Red Guardian. I basically try to have Thor/Beta in separate lanes and try to win those lanes leaving at least a space open encase I need to shang-chi or Enchantress the lane. On Turn 6 try to counter whatever the opponent's win condition is except if it's destroy deck then I'll throw out Armor if they are stacking cards early. I just like Makkari as if I get her early then I'll put most likely Thor in that lane or if it's later in the game then it's just a free 4 power to support as I'm not really clogging lanes up and really looking to shut down my opponent win condition so any additional power on top helps. \n\n# (2) Star-Lord\n# (2) Armor\n# (2) Quake\n# (2) Maximus\n# (3) Killmonger\n# (3) Makkari\n# (3) Thor\n# (3) Baron Zemo\n# (4) Shang-Chi\n# (4) Enchantress\n# (4) Beta Ray Bill\n# (5) Jane Foster Mighty Thor\n#\neyJDYXJkcyI6W3siQ2FyZERlZklkIjoiVGhvciJ9LHsiQ2FyZERlZklkIjoiQmV0YVJheUJpbGwifSx7IkNhcmREZWZJZCI6IkphbmVGb3N0ZXIifSx7IkNhcmREZWZJZCI6IkFybW9yIn0seyJDYXJkRGVmSWQiOiJLaWxsbW9uZ2VyIn0seyJDYXJkRGVmSWQiOiJTaGFuZ0NoaSJ9LHsiQ2FyZERlZklkIjoiUXVha2UifSx7IkNhcmREZWZJZCI6Ik1heGltdXMifSx7IkNhcmREZWZJZCI6IkJhcm9uWmVtbyJ9LHsiQ2FyZERlZklkIjoiTWFra2FyaSJ9LHsiQ2FyZERlZklkIjoiU3RhcmxvcmQifSx7IkNhcmREZWZJZCI6IkVuY2hhbnRyZXNzIn1dfQ==\n#\n# To use this deck, copy it to your clipboard and paste it from the deck editing menu in Snap.",
            "Yea, like it’s actually a no brainer. And even if makkari is too bad, it will probably get buffed ",
            "The key difference is that you never have to use energy to play her. She plays herself as a 3/5 that's okay, 3/6 good.",
            "Good points. She seems alright until you have to consider what better card to swap out for her.",
            "What people are missing is that MG decks often have too many cards in hand pre-duplication, so her playing herself is actually helpful if it plays out that way.",
            "Yes but there are also locations where it's great to get a card without playing. Won a game earlier because she zipped into Quantum Realm, bypassing the power reduction.",
            "If she was \"at the end of the game, runs to lowest power location\" she'd be fantastic.",
            "M'Baku is good in C2 if you're missing some other cards, and Angel has always been bad. \n\n>If I Brood a lane but want that extra space open to do whatever and she jumps into it, now I'm screwed. \n\nThis really shouldn't be an issue since her ability doesn't procc until *after* the turn. The only time I can see it ever happening is if you draw her turn 3 and you play Brood turn 3 on an empty lane and she jumps into the Brood lane. Even then you're probably going to want to fill that lane with another 3 cost anyway since there's only one spot in it. :\\",
            "I'm not saying she'll be universally good, but in surfer and C4 she can probably do pretty well.",
            "Yeah but why have a nuanced take when \"lol garbage\" gets you imaginary internet points? \n\nThe card is fine. Not game breaking, not garbage\n \nThere can be an in-between.\n\nI don't regret it either",
            "Yeah, they offer 200 tokens, but with Namora and only with Namora, after a lot of people say it was bad and not worth getting, they offer 300 tokens. The next week they offer 200 for Sasquatch. The week before, with Sage, it was 200. With Nocturne also 200. Previous season all cards offer 200 in their respective weeks. So, and that was my original point, with Makkari, since everyone is saying she is going to be bad, just like they did with Namora, they are probably going to offer more tokens, as in 300 instead of 200, to incentivize people to spend their keys in order to get her.",
            "\"Where You See One Man, I C4\"\n\n# (1) Hawkeye\n# (2) Cloak\n# (3) Cerebro\n# (3) Mystique\n# (3) Magik\n# (3) Luke Cage\n# (3) Cyclops\n# (3) Hope Summers\n# (3) Makkari\n# (4) High Evolutionary\n# (5) Klaw\n# (5) Sera\n#\neyJDYXJkcyI6W3siQ2FyZERlZklkIjoiQ2xvYWsifSx7IkNhcmREZWZJZCI6IktsYXcifSx7IkNhcmREZWZJZCI6IlNlcmEifSx7IkNhcmREZWZJZCI6Ikhhd2tleWUifSx7IkNhcmREZWZJZCI6Ik1hZ2lrIn0seyJDYXJkRGVmSWQiOiJDZXJlYnJvIn0seyJDYXJkRGVmSWQiOiJNeXN0aXF1ZSJ9LHsiQ2FyZERlZklkIjoiTWFra2FyaSJ9LHsiQ2FyZERlZklkIjoiSG9wZVN1bW1lcnMifSx7IkNhcmREZWZJZCI6IkN5Y2xvcHMifSx7IkNhcmREZWZJZCI6IkhpZ2hFdm9sdXRpb25hcnkifSx7IkNhcmREZWZJZCI6Ikx1a2VDYWdlIn1dfQ==\n#\n# To use this deck, copy it to your clipboard and paste it from the deck editing menu in Snap.\n\nIf you want, you can sub out Luke Cage for Nico Minoru, as she can make herself or Magik 4-power, but that's obviously a high-risk/high-reward move. And you really want Magik for the location changing and to increase your odds of drawing the best cards.\n\nI was running Ms. Marvel, but the sheer number of 3-drops basically rendered her useless most of the time. You can try Moon Girl, but I don't really recommend it because she can clog your hand with cards you don't really want duplicated in the first place, and running a 3-drop on Turn 4 with Cyclops out there is more ideal anyway. Colleen Wing is fine as a cheap substitute, but you really wouldn't want to play her until the last turn.\n\nThis is just a for-fun deck that I've been waiting to cook up for Makkari's release. I wouldn't recommend trying to climb the ladder or anything with it, but I think it's fun for a change-of-pace from the usual stuff.",
            "I don't know why you're downvoted you're right. If she drew then she would be like old Chavez and everyone would have 11 card decks and her.",
            "[deleted]",
            "That’s not what deck thinner means",
            "I don’t think I’d even want her at a 3/5 either.",
            "That ‘buff’ made her worse haha totally nuked using her in c3",
            "Who knows, maybe there’s some hidden Makkari combo lol or she’ll get buffed or changed. Not saying I’m going out of my way to get this card.\n\nEdit: maybe in a c4 deck?",
            "Have you ever gone into a PG match and had the opponent play a bunch of high power low cost cards then retreat on turn 3 over and over again? \n\nThey are doing that to farm xp for the season pass",
            "[deleted]",
            "[deleted]",
            "we’ll see",
            "[deleted]",
            "??",
            "Yup, and it can clog things like Wong/Mystique combo lanes, or Brood in a lane that already has 1 card (though with her base stats being higher than Brood its not necessarily bad). I agree that its not good enough to cut other staples for the spot in the deck though.",
            "I play a pretty classic hope surfer Shaw deck without Wong and might try cutting the kill monger/nova piece depending on what the meta is doing.  Can’t even imagine trying to dump makkari into Wong surfer though lol\n\nIt’s a free 3/8 essentially if you hit the turn 6 absorbing man/surfer\n\nNot sure how it’s gonna go but it could be pretty decent lol\n\nRed guardian has been such a good tech card that I don’t find myself ever really needing killmonger/the power up from nova",
            "I read her as moves to a random location and not from the hand part.",
            "no",
            "Sure. In most cases the fills my Sebastian Shaw Line. And obvisiosly shes allways good when you dont draw shaw or brood. I dont get how much people hate her to downvote me for buying her :D",
            "I thought this was about all the weekly releases, including the momoko day. My bad :)",
            "Harbinger of chaos.",
            "havok, miek, and hercules are the most recent series 4 that come to mind. but i forget which was the most recent. none of them are that impactful anyway",
            "Until you see that combo that fills the hand with Makkari…",
            "Sure",
            "Imagine a card so bad, that it makes you question going for two elite cards.",
            "I mean, you can open with less than 4 keys you just shouldn't cry if the RNG doesn't play along, not that it stops most people lol",
            "\"Played\" has always consistently only counted cards you manually drag onto the board. Anything that gets onto the board by any other means is always not \"played\".",
            "Right exactly. And I'm missing X-23.\n\nI recently came back after a long break, the old Sera Surfer deck is thoroughly outclassed now. Hoping this week helps.",
            "Thanks for the Strong Guy recommendation,  that makes a ton of sense",
            "Is this mostly a wong surfer thing?  The non-Wong version seems much more adaptable/consistent imo.  Idk if she’ll be worth the deck space/a key but it’d be a pretty good card in non-Wong surfer\n\nWhen Wong hits its magical but in a big sample size I haven’t found Wong surfer to be nearly as good it’s just so easy to counter these days",
            "But still. You get 4 power on board for what? Zoo doesn't need 3 cost cards and already can fill up the board quite easily for Dazzler. Similarly can Bounce decks and Angela/Elsa/Kitty decks do that. Surfer has way better cards it can play and often it ends up playing most cards from it's hand anyways (also Makkari could clog up Wong lane or fill up too early a lane with Brood). I can't think of a single deck where Makkari is a better option than cards it already has.",
            "Very good points.   Makari meanwhile is free 3 out of 4 games with the only cost being a draw.   Angel is played exclusively in destroy decks which have no shortage of activators and is free in basically every game, but still doesn't make the cut.  Still wondering if the 4 power is worth the deck slot.",
            "also the issue with both is when they're in your hand it's essentially a wasted draw. angel can still play himself post-buff but drawing a 1 cost essentially vanilla card at any point in the game is gamelosing.",
            "Yeah for wong versions it sucks big time. I run no wong surfer since a long time (it's my good ol reliable deck) and I was thinking about grabbing her.... But will probably hold",
            "She runs in after the turn, at least, so if you have only one spot left in your Wong lane, and she's in hand, you might want to play your Surfer early to avoid the risk.",
            "Exactly, and Surfer seems to be her best spot, which just tells u how mid the card itself is",
            "Man I don't think that's true at all. Brood basically fills one, sure. But then you get 3 other three drops to play, plus maybe one more card (sera or another 2 drop). Sometimes you get the dream and can brood abs, but that's maybe 1/8 games? 1/10? Sometimes you get hope and can wiggle in another card. But I don't see how you're filling 8 spaces with 4 cards that aren't brood. I don't play the greedy magik wong surfer decks though, maybe that's where the disconnect is. My surfer games are generally winning two lanes with basically nothing in the third lane. How are you filling every spot on the board with your other other 3 threes?",
            "Saving energy to clog a space with 3 blank power, in a deck that has no reliable draws and has bonus power already, seems over the top.",
            "You got Gladiator from the mystery slot, and then pulled his variant from the Gladiator spot.",
            "Insanely unlucky :/ it means you got him from the random s4/5 cache first",
            "The extra 1 power they added screwed me…i mess around with c3 sometimes and was pretty excited",
            "2 huge draws, congrats!",
            "I have control of where and when I play martyr though. Both cards are meh.",
            "C4 is her real home. She can mess up some surfer lanes, but might be fine anyway. Honestly just a 0/4 is really good tempo, I bet she will actually be fairly popular.",
            "So far, I'm 7-3 with my C4 build with her in it.",
            "Drop the killmonger nova package and throw in Rogue.",
            "Yeah you were done so dirty, it's insane. I'm CL 2,800 I think and I would be PISSED if that happened to me, because I'm definitely not close enough to a complete collection to expect that type of stuff.",
            "smh, this game man",
            "MINE WAS HOWARD 😭😭😭 i thought i got it the worst",
            "if you genuinely think destroy is the way to go for you, spending 3k tokens on knull is definitely the smartest option asap, and definitely go for x-23 with keys and death or deadpool are both good options for your free card",
            "If you're not interested in X-23 (maybe you just don't like Destroy) or Gladiator then it's fine skipping.\n\nBut if you want to play Destroy or something similar X-23 really super charges the archetype.\n\nGladiator is one of the best generic 3 drops in the game for raw stats. Just want to repeat, if you're not interested in these cards you don't need to have them, there are plenty of great decks that don't want or need these cards.\n\nBut if they interest you, they're very much worth spending keys on. And if you get Makari in the process that's probably fine too, who knows they might buff her later anyway.",
            "Very true and for what its worth I also think shes weak, but I think people are making much more harsh knee-jerk reactions to cards because of the reason I stated",
            "Sersi is fantastic if you like junk decks, she's probably not core but she feels great. I've won half a dozen gold conquests this week with her in a death bird deck and while I've absolutely lost a couple because I've gotten beast or something, in general she almost feels better to play than annihilus. Plus she has won a handful of games that were literally unwinnable otherwise.",
            "Haha sersi pulled a green goblin against me the one time I saw her which won me the round",
            "Sersi does really well in Annihilus. Since he’s always telegraphed your opponent can clog lane before you get him out but Sersi prevents that.",
            "Sersi steals cubes like crazy. She can take a location you are clearly losing and flip it.",
            "Thanks for sharing! The way you named the deck made it sound like some meta deck I hadn’t heard of",
            "Indeed. If he pulled Gladiator, I'd still recommend getting Makkari with the key. A guaranteed new card with a key is great.",
            "Sure. But your \"if\" is doing a ton of heavy lifting there \n\nYoure duplicating makkari if and only if you draw her on turn 4 or 5, and you played at least 3/4 cards in the preceding turns",
            "People aren’t missing it it’s just not good synergy",
            "She'd be the best card in the game.\n\nLiterally everyone except the strictest A-B combo decks would run her.",
            ">Even then you're probably going to want to fill that lane with another 3 cost anyway since there's only one spot in it\n\nProbably, but any good Surfer list will have tech cards in it. If I need to Rogue or Red Guardian in that specific lane, Makkari can mess things up. Plus, Surfer generally has no problem hand-dumping on Turn 6 with Sera anyway so filling up lanes (whether post Sera or after Brood + Absorbing Man) isn't an issue. \n\nThe perk of Surfer is buffing 3 drops with great effects; raw bodies for stats were never the issue. I don't think she's terrible if someone is missing other key 3 drops or simply don't want to bother with tech cards, but I don't believe she'll be part of the \"meta\" version of Surfer. That being said, I like playing the Sersi version so who am I to talk lol",
            "Yup, it's a decent card. People are so used to meta breaking cards that whenever something normal arrives it's instantly tagged as shitty and useless. Cards like this allow fun and new plays and I'm all in for that.",
            "Fair I don’t notice that",
            "Looks good. I'll give it a try :)",
            "You run HE just for cyclops?",
            "in the person's upgrade she legit thins your deck. the only time she doesnt manage to is turn 6. she cantrips for absolutely free with, shes a deck thinner",
            "Read what the person he's responding to wrote",
            "she legit would thin the deck what are you on? if she plays herself for free and draws a card, she thins the deck.",
            "She needs a text adjustment",
            "Going from your hand to the board isnt moving.",
            "You buying?",
            "You don't have to own every card and for sure you don't need to spend 6K cards in this card lol.",
            "a 0/6 really?",
            "Hercules released as series 5 and was dropped this June",
            "Nah. That’s stupid. If card will be really that bad, it will 100% get buffed. And in any way it’s a new card, not 1k tokens. Hard to complain about this",
            "I could never get the old sera surfer deck to work. Tbh I can't get the tech surfershaw deck to work with or without sera right now. Just not the right meta for it or I'm playing it poorly",
            "Still, if you're running Surfer you're probably running Brood. That 1/3 chance she fills that lane - either unnecessary because you're pretty sure on winning it or you can't drop something else there for protection - instead of going somewhere you'd actually want to add power, seems a downside.",
            "Yeah, unless it has a really good animation and yells some sort of surprise bitch makari is here like red hulk power ups.",
            "Can confirm it does not lol I play a ton of surfer.",
            "Ah yeah,i just got surfer for this months series 3 picks. Ive only ran one deck with him and has magik. Usually all the spots get filled on turn 7",
            "Yeah players are ofc gonna keep theory crafting around the card but I dont think my opinion will change unless ofc proven otherwise. Card is the easiest skip of the month",
            "Yeah it's not ideal but aside from that and Surfer, I don't see any use right now and the RNG has the potential to ruin Surfer.\n\nI'm gonna be saving my keys on this one lol.",
            "Wow, that fucking sucks",
            "Fuck me",
            "I think 2/3 makes sense.",
            "I'm CL12.5k but am missing a whole bunch of S5 cards, I can't remember the last time I spent a key and didn't get a duplicate. They need to adjust the Duplicate vs New Card rate for that slot, if not get rid of the duplicate mechanic altogether.",
            "Yeah I think so! Seems like a good, solid deck type. \n\nAlright, sounds like a plan! I'll start to save up for Knull immediately, and see if I can pull X-23 and then maybe Death. Thanks for the advice!",
            "I have thought about making a destroy deck, and saving up for Knull. Another archetype I play regularly is Surfer, so Gladiator seems like a strong addition to that deck. Mill also looks kinda fun, even though it's not exactly meta. \n\nThat's true, Makkari might be buffed or fit in somewhere else down the road!",
            "Yeah, she is clearly good in junk decks but I'm not feeling comfortable at all by winning a location with rng, if I screw up I want to screw up by myself, simple as that, that's why I said that \"in my opinion\" she is better than makkari, but not fantastic. She is clearly good but don't like the randomness that comes with her",
            "Or just as a backup for when you draw Sentry and not Anni.",
            "Well, I pulled Gladiator with key #3. Never thought I'd be so happy about not hitting the featured card until key #4. \n\nI'm gonna wait out the week and see if anyone actually does something interesting with Makkari. If so, I'll grab her. But with several upcoming weeks with good and important cards that I need to pull for (Corvus/Phastos, Galactus/Nebula, and possibly Darkhawk/Bill/Ajax), I think I need to save every key I can.\n\nThank you for the advice, though. I definitely see where you're coming from and if I were a bit higher up on the CL ladder with more s4 cards in my collection (and therefore a higher chance of 1K tokens with the mystery slot), I think you're absolutely right that it's correct to grab the guaranteed new card.",
            "Yeah but there is a consolation prize of her leaving space in your hand for copying other cards.",
            "Yeah that'd be op. So maybe something like \"at end of game runs to random location\" would be better. Still meaningful with RNG in there for chance of uselessness but without the downside of a clog. Bring her back down to 3/3. ",
            "I still remember Legion gave 500 tokens. He was effectively a 2500 card.",
            "Best advice I can give is to really stack two lanes with your 4-power cards if you can. Don't set out to win all three. This deck isn't really built for that because Cerebro and Mystique aren't going to provide any lane power, and Luke Cage and Magik won't help you much, either. Use Klaw to support the lane you only have three 4-drops in, so each lane can get the 32 power.\n\nAnd there is nothing wrong with playing High Evo, either! Unlike a traditional High Evo deck, he is actively helping you in this deck.",
            "And HE is a 4-power, as well. Choices are very limited for 4-power cards, but it has worked fairly well so far.",
            "[deleted]",
            "Mb I thought you meant as she is now",
            "As you see 0-4 is worse than literaly a wasp right now, since you can control the wasp, but not makari",
            "What’s your deck look like? Some of the newer cards like red guardian,nocturne,hope summers have really helped surfer a lot imo.\n\nGladiator is probably a must too",
            "Could be…we might find out but seeing as I’m a bit interested in the card I know I’m not getting it 🤣. \n\nI wouldn’t have much of an issue holding off on brood until late and opening hand-turn 2 makari draw you can plan around it. Could be interesting I genuinely can’t really tell how it’s gonna go lol. I just feel less ‘locked in’ to playing cards in certain lanes with surfer than people are describing overall. Nocturne has def helped smooth things out",
            "Tbf I can see this card being changed it did have a home in cerebro prior to its \"buff\" maybe in another change we can see a 4/5 Makkari who works best in C5",
            "I’m surprised how many people are talkin about Wong/magik surfer here so maybe I’m in the minority lol. But i have never found the Wong-ified surfer decks to be nearly as good.  It’s so much fun when it works but it doesn’t feel very consistent with how easy to counter Wong is.  Canceling out limbo is pretty easy now as well",
            "Actually I'd go further in the power direction, 3/5. Her cost doesn't really matter bc you never play her. Still out of cerebro but better for surfer",
            "Yes either way, feels really good in that package.",
            "With those spotlights coming up, as long as you have keys to guarantee new cards vs. Variants / tokens you are gtg. That week with 3 new cards is great with DH, BRB, and Ajax. \n\nThat is a week I plan to use keys for Ajax and BRB.\n\nI mostly hold keys for weeks with two new cards. I'm CL 10k+ and am missing 11 cards... And I don't care about most of them. I have 4 keys and 6k+ tokens atm. Passing on Makkari since next week is Phastos and Corvus.",
            "Lots of decks can fill up lanes to control where a \"random\"action occurs, which eliminates the RNG penalty. \n\nI think you'd just need to knock the power down. She'd be an M'Baku from your hand.",
            "And he’s an amazing card",
            "the actual card is not a deck thinner. the upgrade that this guy wants absolutely is a deck thinner.",
            "understandable, I woulda definitely been miserably wrong if I was talking about her as is",
            "makkari is way better than wasp, people are js saying she’s not worthy of series 5",
            "I don't have nocturne. \n\nAt the moment I'm playing\n\nShaw\n\nBrood\n\nHope\n\nRed guardian\n\nRogue\n\nJuggernaut\n\nNtw\n\nSurfer\n\nAbsorbing man\n\nOkoye\n\nChavez\n\nForge\n\n\n\nI've had wong, iron heart, cosmo and shang chi in at various points. \n\nI don't have gladiator\n\nN\nHonestly it's excellent at conquest. But not amazing at normal ladder.\n\nIdk what the difference is. Maybe I'm better at playing rogue and rg when I know what someone has",
            "Definitely looks like an interesting card but as I said before, it looks like it will be something between a fun card or a good card but not really archetype defining. It's possible I'm completely wrong here and it happens to be busted. However, as of now, I find it hard to justify gambling keys if you don't want anything else from the spotlight or coughing up the 6k tokens.",
            "Yeah, the fact that changing cards is always on the table and new play styles like sersi come out all the time sometimes makes a whatever card become really good like the cannonball professor x nonsense.",
            "Also, 3-6 I guess is a stretch youre right.. 3-5 should be reasonable i think, shed be good, but still not broken, even tho c5 exists.. Hm idk, i just know she sucks rn",
            "Brother, shes not worth replacing any of my cards in surfer decks, and she single handedly might loose you games, by going in location such as, throne, lukes bar, etc\nSo how is she better then wasp, when wasp is played by a couple of decks, but makari, in two days, literaly wont be played anymore, and you know it",
            "Yea I’m in the probably very tiny subset of people that maybe should risk a key on it haha I think the vast majority should skip it"
        ]
    },
    "Oh my god.": {
        "title": "Oh my god.",
        "score": 158,
        "url": "https://i.redd.it/49nbzfv9k28d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Oi it was my turn to post this today.....",
            "How many times we have to see this?",
            "Loki as a tree to save the timeline: this has to be done.",
            "they either changed it or different person but i just battled against someone with same name but had a spider-ham avatar and \"rapidly decomposing\" title",
            "Based 😎",
            "Shouldn’t it be her back?",
            "I’ve never seen it and got a chuckle out of it 🤷‍♂️",
            "Hey, I don't come here that often so I don't see (or remember) if this has already been posted.",
            "You can choose different avatars and titles for different decks",
            "Oh really? So your telling me you played against this guy and took a screenshot? Or did you save the pic from an earlier post here and are now using it for karma?....c'mon nobody here is that stupid to believe you.",
            "I've never seen it. I should post it in a few days.",
            "I did, in fact, draw this guy in a match. I could have cropped it less tightly or not cropped it at all to prove it if you'd have liked.",
            "Thats fine if you havent seen it and want to save the pic to post later thats how reddit works but don't be this guy and act all innocent and feign ignorance."
        ]
    },
    "Totally Worth Wow": {
        "title": "Totally Worth Wow",
        "score": 193,
        "url": "https://v.redd.it/a4lstp7hq18d1",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Dope🔥🔥",
            "That's what I should have gotten... Nope, white Kirby with basic foil... This one is cool.",
            "Kinda sucks that black kirby can’t been seen in game without clicking the card unlike all the other Kirby’s",
            "The only Wong variant I wont.",
            "Dooooope. Best Wong variant imo",
            "Fantastic split and border. \nThat variant is definitely one of Marvel Snap’s variants!",
            "Gonna look sick in your destroyed pile -- Lady Deathstrike",
            "I wasnt sold on the variant but in that form holy jesus that looks amazing",
            "Yep, best Wong variant I've seen.",
            "Where have you got this badass Wong variant... I'm still waiting for one.",
            "Best wong variant ever!\nWould probably never get it! XD",
            "Imagine if they made wong better than strange and we can't have that level of art couse card usage popularity.....\n\nWe can have Doc Strange here and no we have that bold comic relief.\n\nFuck you second dinner",
            "It actually looks really good with foil. Better than inked or gold imo.",
            "Indeed. It is definitely one of Wongs variants also.",
            "It's in the shop",
            "This is like the first good Wong variant that isn't $100 lol. Dr. Strange already has better ones.",
            "I think it's ridiculous to have a game like this where the most iconic Marvel heroes are extras compared to second or even third level characters... you can take it as you like, I'll also be free to express my opinion",
            "In my opinion, you're the real comic relief."
        ]
    },
    "What has been the longest round you have had?": {
        "title": "What has been the longest round you have had?",
        "score": 228,
        "url": "https://v.redd.it/jby0irmax08d1",
        "content": "In my case it’s almost 6 minutes of watching the silver surfer move across the screen.\nDon’t play tribunal against this deck",
        "num_comments": 41,
        "comments": [
            "All that Surfer stuff just to lose to Tribunal 🤦‍♀️ I know he's mad",
            "I'm not watching the whole thing, I am assuming someone played kang",
            "I fucking hate the fast forward in this game. It'll trigger if I Modok with a Helicarier, but let's 5 minute of this happen?",
            "Six minutes of surfer procs and still loses you love to see it",
            "I’ve mentioned it another time, but I was losing a game and frustrated so I just played an Odin on top of a Wong, Mystique, and the Opponents Hobgoblin, on Onslaughts Citadel\n\nHobgoblin went back and forth 64 times before eventually settling on my side for me to lose",
            "Why does living tribunal do it's 'anination' over and over again... Sickening.",
            "Count yourself lucky they didn't have shaw.",
            "This reminds me of deep space before it was patched. Play an ongoing card on there and you lose the next half hour.",
            "I just had 2 solid minutes of onslaught citadel hazmat wong mystique odin nonsense followed by my own wong mystique surfer nonsense.\n\n  \nFast Forward is the most bugged feature in the game",
            "I'm still in a Wong Gambit game that began 6 months ago.",
            "But god forbid Modok discards 3 cards from hand. That has to be fast forwarded immediately and forces you to go full Sherlock Holmes mode to figure out what happened on board, how big their apocalypse is, how many swarms they have in hand and whether a helicarrier was involved. Because why add a history button to a game that literally black screens you as an intended feature.",
            "I thought it was gnna be Shang chi to both Lanes lol",
            "What the FUCK happened? I've never been past Pool 1 (technically I have but not by much), so I have no idea what happened",
            "I'm confused how did tribunal side win ?",
            "El picoooo",
            "Surfer animation is patheticaly bigged. I usually just quit and re open the game to skip it. Much faster",
            "Cute Surfer variant",
            "Putting Odins on Odins before Fast Forward was introduced",
            "I just had a game where I spent he whole time looking at my beautiful kamar taj Wong mystique surfer Odin with all 3 costs. It was glorious",
            "I played HE on the no text location, big mistake",
            "I hate wong. Screw that bald guy.",
            "Aaaannnd that's why I took a break from Snap. Grand Tribunal is so broken and anyone that argues they aren't have utilized this deck at one point. There's a reason why half of the players you face off against are running that deck.",
            "All that work for a drop of blood. 🩸",
            "Would have been so awesome if OP had actually played Kang at the end of that",
            "I placed modok on that place thst fills with copies of that card. I had swarm in my hand. Ended up having a 30 morbius",
            "Pure evil",
            "Fucking love it lol.",
            "This is a major problem with that card. Ever since he came out he's done this weird thing where he checks hia numbers after every card is played even your opponents. It's annoying and there is no point I can see. Math should be calculated instantly so it can't be that. Dunno why imo.",
            "Yeah, I encountered that for the first time recently too. It was so odd… almost like the animation was broken 😅",
            "Shaw is not breaking 400 lmaoo",
            "Tribunal playing Shang chi?",
            "Mostly, bad coding.\n\nThey're supposed to skip repeating animation directly to end result. Also Super Skrull and The Living Tribunal forced them to recalculate OP's side all the time even when it ends with the same score.",
            "What does that even mean",
            "Onslaught, Mystique on the Onslaught, and Iron Man. Doubling like x8.",
            "And 4 fast forwards back to back?",
            "Not evil, just petty!\n\nIf you’re gonna beat me I’m going to make you sit through this!",
            "That's not the point.",
            "Explain it to me like I'm 5 and still in Pool 1",
            "The most affected cards from opponent side :\n\n [[Wong]] [[Silver Surfer]] [[Odin]] \n\nThe bad coding on OP's side : \n\n[[Super Skrull]] [[The Living Tribunal]]\n\nBasically Silver Surfer On Reveal proc 16x in the Center and 4x on the Left because of Wong (+ Mystique + Odin) doubling On Reveal effect.\n\nThen Super Skrull checking opponent's Ongoing each time it procs in case it changes any status (it didn't) and Living Tribunal recalculate the result in case there are any changes (it didn't).",
            "Wong had an Ongoing ability that doubles On Reveal ability cards. \n\nMystique copies that. \n\nOdin has an On reveal ability that reactivates On reveals. \n\nStacking all three of them on Silver Surfer + Sinister London creates a cycle of On reveals that last 6 minutes like you see here. \n\nA lot of people hate how long all this is because for some reason the game deemed this important enough for the player to sit through instead of fast forwarding.",
            "**\\[[Wong](https://marvelsnap.pro/cards/wong)\\]** **Cost:** 4 **Power:** 2  \n**Ability:** **Ongoing:** Your **On Reveal** abilities here happen twice.\n\n**\\[[Silver Surfer](https://marvelsnap.pro/cards/silversurfer)\\]** **Cost:** 3 **Power:** 2  \n**Ability:** **On Reveal:** Give your other 3-Cost cards +2 Power.\n\n**\\[[Odin](https://marvelsnap.pro/cards/odin)\\]** **Cost:** 6 **Power:** 8  \n**Ability:** **On Reveal:** Activate the **On Reveal** abilities of your other cards here.\n\n**\\[[Super-Skrull](https://marvelsnap.pro/cards/superskrull)\\]** **Cost:** 4 **Power:** 2  \n**Ability:** **Ongoing:** Has the **Ongoing** effects of all enemy cards.\n\n**\\[[The Living Tribunal](https://marvelsnap.pro/cards/livingtribunal)\\]** **Cost:** 6 **Power:** 9  \n**Ability:** **Ongoing:** Split your total Power evenly among all locations.\n\n*Message generated by MarvelSnapCardBot2. Use syntax [[card_name]] to get a reply like this. Report any issues on [github](https://github.com/alexloney/reddit_marvel_snap_card_bot).*"
        ]
    }
}