{
    "This Week in Marvel #25 - JUN 19 2024 - ULTIMATE SPIDER-MAN #6, DOCTOR STRANGE #16, IMMORTAL THOR #12, VENOMVERSE REBORN #, BLACK PANTHER: BLOOD HUNT #2, DRACULA: BLOOD HUNT #2, INVINCIBLE IRON MAN #19": {
        "title": "This Week in Marvel #25 - JUN 19 2024 - ULTIMATE SPIDER-MAN #6, DOCTOR STRANGE #16, IMMORTAL THOR #12, VENOMVERSE REBORN #, BLACK PANTHER: BLOOD HUNT #2, DRACULA: BLOOD HUNT #2, INVINCIBLE IRON MAN #19",
        "score": 25,
        "url": "https://www.reddit.com/r/Marvel/comments/1dj7qd0/this_week_in_marvel_25_jun_19_2024_ultimate/",
        "content": "***MOD NOTE: NOW INCLUDING INFINITY COMICS IN THE COMMENTS DISCUSSION***\n---\n\n  \n  \n---\n\n**THIS WEEK IN MARVEL:**   \n---\n\n* [**MARVEL COMICS GETS NEW LOGO AKIN TO MARVEL STUDIOS AND MARVEL ANIMATION**](https://www.fastcompany.com/91142239/in-the-marvel-logo-universe-all-the-logos-look-the-same)\n\n* [***SENSATIONAL SHE-HULK* COMIC SERIES TO BE CANCELLED AFTER ISSUE #10**](https://bleedingcool.com/comics/marvel-cancels-sensational-she-hulk-with-10/)  \n\n* [**ZEB WELLS' *AMAZING SPIDER-MAN* RUN TO END LATER THIS YEAR**](https://comicbookmovie.com/comics/marvel-comics/marvel-comics-confirms-zeb-wells-and-john-romita-jrs-amazing-spider-man-run-ends-this-year-a211557#gs.b2vjd8)\n\n* [**MARVEL LAUNCHES NEW *INFINITY WATCH* EVENT THROUGH WEEKLY ANNUALS**](https://bleedingcool.com/comics/marvel-infinity-watch-annual-solicits-september-2024/)\n\n\n \n \n\n---\n\n\n**NEW COMICS SPOTLIGHTS:**  \n---\n  \n---\n\n* **SPOTLIGHT RELEASE OF THE WEEK:** [***ULTIMATE SPIDER-MAN* #6**](https://www.reddit.com/r/Marvel/s/kAUI1R7JMu)\n  \n* [CLICK HERE TO VOTE FOR NEXT WEEK'S SPOTLIGHT RELEASE!](https://www.surveymonkey.com/r/XZ67TWZ)\n  \n* **MOD'S PULL OF THE WEEK:** [***IMMORTAL THOR* #12**](https://www.reddit.com/r/Marvel/s/BmmhOijIhq)\n\n* **MARVEL COMICS PREMIERE:** [***VENOMVERSE REBORN* #1**](https://www.reddit.com/r/Marvel/s/k7CHWYNrO2) \n\n\n---\n \n    \n* **FLASHBACK DISCUSSION:** [**GRANT MORRISON'S *NEW X-MEN* (2001)**](https://www.reddit.com/r/Marvel/comments/1buga1z/flashback_discussion_63_grant_morrisons_new_xmen/?utm_medium=android_app&utm_source=share)\n    \n\n  \n\n  \n---\n\n\n \n  \n  \n---\n  \n  \n\n* **PREVIOUS WEEK: [JUN 12](https://www.reddit.com/r/Marvel/s/TbenAGErFZ)**   \n\n  \n* **LAST WEEK'S #1 COMIC: [***BLOOD HUNT* #3**](https://www.reddit.com/r/Marvel/s/2PVKkkZVqW)**\n  \n  \n  \n---\n---\n  \n  \n  \n**THIS WEEK'S NEW COMICS:**\n--- \n  \n      \n* [***AMAZING SPIDER-MAN* #52**](https://www.reddit.com/r/Marvel/s/wgU6mAqoVg)  \n\n* [***BLACK PANTHER: BLOOD HUNT* #2**](https://www.reddit.com/r/Marvel/s/y6VbSXFfor)  \n\n* [***CAPTAIN AMERICA* #10**](https://www.reddit.com/r/Marvel/s/qtpOAgP2XP)  \n\n* [***CAPTAIN MARVEL* #9**](https://www.reddit.com/r/Marvel/s/pOr9YRDOQf)  \n\n* [***DOCTOR STRANGE* #16**](https://www.reddit.com/r/Marvel/s/zFuhy1hF9f)  \n\n* [***DRACULA: BLOOD HUNT* #2**](https://www.reddit.com/r/Marvel/s/cHtwxVoXtH)  \n\n* [***IMMORTAL THOR* #12**](https://www.reddit.com/r/Marvel/s/wkr4MWKEoD)  \n\n* [***INVINCIBLE IRON MAN* #19**](https://www.reddit.com/r/Marvel/s/dIyYuLEeeA)  \n\n* [***SENSATIONAL SHE-HULK* #9**](https://www.reddit.com/r/Marvel/s/RA3b4dV9AT)  \n\n* [***SPIDER-WOMAN* #8**](https://www.reddit.com/r/Marvel/s/HBM5qdwEm4)  \n\n* [***ULTIMATE SPIDER-MAN* #6**](https://www.reddit.com/r/Marvel/s/aXUL6MxLEU)  \n\n* [***VENOM: SEPARATION ANXIETY* #2**](https://www.reddit.com/r/Marvel/s/OkeZBH0DYg)  \n\n* [***VENOMVERSE REBORN* #1**](https://www.reddit.com/r/Marvel/s/HJhNJzzGKY)  \n\n* [***WOLVERINE: BLOOD HUNT* #2**](https://www.reddit.com/r/Marvel/s/lewuADdmlw)  \n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n  \n**NEW INFINITY COMICS (UNLIMITED EXCLUSIVES):**\n--\n \n* [***KID JUGGERNAUT: MARVEL'S VOICES* #6**](https://www.reddit.com/r/Marvel/s/4oitpI7AFy)  \n\n* [***X-MEN: FROM THE ASHES* #2**](https://www.reddit.com/r/Marvel/s/gaADRWpfxj)  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n  \n**ALSO RELEASING THIS WEEK:**\n---\n  \n  \n\n* [***STAR WARS: JANGO FETT* #4**](https://static.wikia.nocookie.net/marveldatabase/images/d/d7/Star_Wars_Jango_Fett_Vol_1_4.jpg)  \n\n* [***UNCLE SCROOGE AND THE INFINITY DIME* #1**](https://static.wikia.nocookie.net/marveldatabase/images/e/e2/Uncle_%24crooge_and_the_Infinity_Dime_Vol_1_1_Cover_B.jpg)  \n\n\n\n**NEW COLLECTIONS/REPRINTS:**\n---  \n\n* [***AMAZING SPIDER-MAN FACSIMILE EDITION* #257**](https://static.wikia.nocookie.net/marveldatabase/images/1/12/Amazing_Spider-Man_Facsimile_Edition_Vol_1_257.jpg)  \n\n* [***MARVEL MASTERWORKS: AMAZING SPIDER-MAN* #26**](https://static.wikia.nocookie.net/marveldatabase/images/e/ed/Marvel_Masterworks_Amazing_Spider-Man_Vol_1_26.jpg)  \n\n* [***MODERN ERA EPIC COLLECTION: CAPTAIN AMERICA* #1**](https://static.wikia.nocookie.net/marveldatabase/images/7/7d/Modern_Era_Epic_Collection_Captain_America_Vol_1_1.jpg)  \n\n* [***ROM: THE ORIGINAL MARVEL YEARS* #2**](https://static.wikia.nocookie.net/marveldatabase/images/3/30/Rom_The_Original_Marvel_Years_Omnibus_Vol_1_2.jpg)  \n\n\n\n\n\n  \n  \n**IN CASE YOU MISSED IT:**  \n---\n \n* [***VENOM: THE LAST DANCE* TRAILER**](https://www.reddit.com/r/Marvel/comments/1d743br/venom_the_last_dance_official_trailer/?utm_medium=android_app&utm_source=share)\n\n* [***MARVEL STUDIOS ASSEMBLED: THE MAKING OF X-MEN '97* DISCUSSION**](https://www.reddit.com/r/Marvel/comments/1cxqprp/marvel_studios_assembled_the_making_of_xmen_97/?utm_medium=android_app&utm_source=share)\n\n* [***X-MEN '97* EPISODE 10 DISCUSSION**](https://www.reddit.com/r/Marvel/comments/1cs9l0m/xmen_97_episode_10_discussion/?utm_medium=android_app&utm_source=share)\n\n* [***DEADPOOL  & WOLVERINE* TRAILER #2**](https://www.reddit.com/r/Marvel/comments/1caadx0/new_deadpool_wolverine_trailer/?utm_medium=android_app&utm_source=share)\n\n* [***MADAME WEB* DISCUSSION**](https://www.reddit.com/r/Marvel/comments/1aqmvd4/madame_web_official_discussion/?utm_medium=android_app&utm_source=share)\n\n* [***DEADPOOL & WOLVERINE* TRAILER**](https://www.reddit.com/r/Marvel/comments/1aom0ze/deadpool_wolverine_official_teaser_in_theaters/?utm_medium=android_app&utm_source=share)\n\n* [***THE MARVELS* DISCUSSION**](https://www.reddit.com/r/Marvel/comments/17si2j2/the_marvels_official_discussion/)\n  \n* [***ECHO* SEASON 1 DISCUSSION**](https://www.reddit.com/r/Marvel/comments/192vguv/echo_season_1_official_discussion/?utm_medium=android_app&utm_source=share)  \n\n* [***WHAT IF?* SEASON 2 DISCUSSION**](https://www.reddit.com/r/Marvel/comments/18oxd4j/what_if_season_2_episodes_discussion_thread/?utm_medium=android_app&utm_source=share)\n \n* [***KRAVEN THE HUNTER* TRAILER**](https://www.reddit.com/r/Marvel/comments/14dmko0/kraven_the_hunter_official_red_band_trailer_hd)  \n  \n\n\n\n  \n---\n \n  \n[**2023 R/MARVEL AWARD WINNERS**](https://www.reddit.com/r/Marvel/comments/1afzr4x/2023_rmarvel_awards_results_moon_knight_wins_best/?utm_medium=android_app&utm_source=share)\n---",
        "num_comments": 208,
        "comments": [
            "[***DOCTOR STRANGE* #16**](https://static.wikia.nocookie.net/marveldatabase/images/8/8e/Doctor_Strange_Vol_6_16.jpg)  \n---",
            "[***IMMORTAL THOR* #12**](https://static.wikia.nocookie.net/marveldatabase/images/b/b6/Immortal_Thor_Vol_1_12.jpg)  \n---",
            "[***ULTIMATE SPIDER-MAN* #6**](https://static.wikia.nocookie.net/marveldatabase/images/b/be/Ultimate_Spider-Man_Vol_3_6.jpg)  \n---",
            "[***BLACK PANTHER: BLOOD HUNT* #2**](https://static.wikia.nocookie.net/marveldatabase/images/2/2f/Black_Panther_Blood_Hunt_Vol_1_2.jpg)  \n---",
            "[***DRACULA: BLOOD HUNT* #2**](https://static.wikia.nocookie.net/marveldatabase/images/5/52/Dracula_Blood_Hunt_Vol_1_2.jpg)  \n---",
            "[***SPIDER-WOMAN* #8**](https://static.wikia.nocookie.net/marveldatabase/images/c/cd/Spider-Woman_Vol_8_8.jpg)  \n---",
            "[***CAPTAIN AMERICA* #10**](https://static.wikia.nocookie.net/marveldatabase/images/e/ed/Captain_America_Vol_11_10.jpg)  \n---",
            "[***INVINCIBLE IRON MAN* #19**](https://static.wikia.nocookie.net/marveldatabase/images/d/d9/Invincible_Iron_Man_Vol_5_19.jpg)  \n---",
            "[***SENSATIONAL SHE-HULK* #9**](https://static.wikia.nocookie.net/marveldatabase/images/5/5d/Sensational_She-Hulk_Vol_2_9.jpg)  \n--",
            "[***WOLVERINE: BLOOD HUNT* #2**](https://static.wikia.nocookie.net/marveldatabase/images/8/8f/Wolverine_Blood_Hunt_Vol_1_2.jpg)  \n---",
            "[***KID JUGGERNAUT: MARVEL'S VOICES* #6**](https://cdn.marvel.com/u/prod/marvel/i/mg/1/20/6647c745662e4/clean.jpg)  \n---",
            "[***VENOMVERSE REBORN* #1**](https://static.wikia.nocookie.net/marveldatabase/images/b/bb/Venomverse_Reborn_Vol_1_1.jpg)  \n---",
            "[***VENOM: SEPARATION ANXIETY* #2**](https://static.wikia.nocookie.net/marveldatabase/images/9/94/Venom_Separation_Anxiety_Vol_2_2.jpg)  \n---",
            "[***CAPTAIN MARVEL* #9**](https://static.wikia.nocookie.net/marveldatabase/images/9/95/Captain_Marvel_Vol_11_9.jpg)  \n---",
            "[***X-MEN: FROM THE ASHES* #2**](https://static.wikia.nocookie.net/marveldatabase/images/3/3a/X-Men_From_the_Ashes_Infinity_Comic_Vol_1_2.jpg)  \n---",
            "[***AMAZING SPIDER-MAN* #52**](https://static.wikia.nocookie.net/marveldatabase/images/f/f5/Amazing_Spider-Man_Vol_6_52.jpg)  \n---",
            "Even when he's a vampire, Wong will do everything in his power to save and protect his best friend. \n\nAnd when in doubt, go to Baron Mordo.",
            "This was a great tie in issue, fun to focus on Wong",
            "Poor Wong, man. He is in a no-win scenario where he CAN beat Victor in Stephen's body but doing so would mean literally killing Stephen's body again. And they don't want to go through a Death of Strange again.\n\nI am confused about Blade showing up in the crypt THAT early though. Victor's plot to escape was happening with the halloween stories each year, long before this event. Are they saying Blade was possessed for a long time now? Because I thought it happened during and after Adana stuff in the recent book where he embraced his darker side and that allowed him to be possessed by whatever ancient Vampire that has been around since old Atlantis. Maybe it is to hide the real form of the villain and that Blade panel is the most recent one? But even that, Victor escaped before Blade was dealing with Adana.\n\nI dunno, it is weird and gonna need answers for all that.\n\nFinally though we gonna have Bats teaming up with the snakes and MORDO of all people to escape the Crypt and save the day. If Mordo does save the day, Strange will NEVER hear the end of that. More realistically, Mordo will try to kill Victor in Stephen's body but Wong will work to prevent it.",
            "Soo Buri/Tiwaz definitely knew that riddle and played along to let Thor win, right? He seems so smug when he's like \"Hmmm I wonder where your father got that riddle from\" lmao",
            "I don't know why, it's just hilarious that Al Ewing is literally the only person so far who tried to connect his comic to GODS lol",
            "I will say, having learned of Tyr through the Norse God of War entries and *then* that his status therein as, well, the Norse God of War was hardly in line with the original myths outside of an extreme interpretation of a single line, it surprised me that he's apparently always been the God of War for the pantheon in Marvel (I assumed God of War 2018 was the first to depict him like that). Anyway, this is a long-winded way of saying I love Al Ewing and everything he does in this comic because holy shit",
            "The Odinson family face off against Oblivion to save one of their own!\n\nI kept expecting Hermod to come back somehow...is he completely done? I kind of hope not, he was one of the cooler siblings.\n\nSeeing Tiwaz again and being reminded of the Simonson run was fun. We're past Father's Day but this was a great-grandfather issue. \n\nI was thinking they shouldn't have brought the baby but she can spew hellfire so...cool? Kind of gave me bad flashbacks to her War of the Realms tie-in. \n\nThis is an Al Ewing Thor comic, of course Thor wins not with his power or hammer but with his wits and it's nice to see Odin mentioned in a positive light for once. \n\nHa, Bragi is the only sibling that seems to like Loki at this point. I guess he would considering their shared positions. \n\nAnother death of Thor to look forward to? Well, I'm sure Ewing will do interesting things with it and have it play off myths and storytelling. Plus there's the final fight with Atum I feel like they keep foreshadowing.",
            "This series took a huge hit losing Martin Coccolo. The art is ugly now and is killing my interest in the series.",
            "It is always good to see Tiwaz involved, especially with all the other Elder Gods testing Thor. Quite enjoyed the battle of wits and how Thor 'won' by making Tiwaz laugh, probably by telling the story Tiwaz himself came up with I guess. Shows to Tiwaz that Thor does have wisdom to carry the title of the All-father. And the sub-plot of what Loki is gonna do, with all these teases, thickens. Also nice that they learn Tiwaz is their grand-sire.\n\nOblivion tried to possess and we lost poor Hermod to Oblivion's hand. But knowing the comics, even 'Oblivion' is not permanent. After all, if comics exist, Oblivion simply cannot. And Thor don't care for all these 'true and final end' stuff and he has seen already MANY of them. None of which will be true.\n\nI honestly want to see more of the Children of Odin as they have quite the potential going forward. We get another 'Thor's gonna die!' vision but with Skurge's plan to take his place still going on, that will surely gonna change too. \n\nBefore all that though, we gonna have Herc and Thor having an adventure! That is one to look forward to.",
            "When Ewing retconned Tiwaz/Buri's origin to an Elder God, I got annoyed because it's just adding to the list of possible origins. Thank god he cleaned things up.",
            "Can someone explain how Oblivion was the hidden threat here and not In Betweener? ",
            "Am I stupid or was the last vision a misdirect Ullr isn't Gaia's son right?",
            "Good issue im very much glad roxxon has gone away for a while and i hope it stays like that as the roxxon stuff made me want to drop the book. \n\nThe focusing on the gods and mythology is what i want from a thor book and this is more like it.\n\nThis is still no where near Al ewings best work but its still good.",
            "love how bad Peter is at this",
            "The pacing continues to be weird, but that's baked into the 6160, and it has pros and cons to it. \n\nCurious what exactly is up with Fisk's power-tats (magic?) but making him physically as well as visually imposing is a good move. \n\nI appreciate that part of MJ's reaction to Peter's reveal is that she's...*ahem* excited. It's an honest adult feeling, and probably was a big part of the 616 dynamic too, but they couldn't really spotlight it in older comics. She loves him because he's a good man and a good father, but what wife hasn't wished her slightly dweeb husband weren't faster, stronger, *heroic* and ripped? The scary consequences come later. \n\nI like that the family reveal here wasn't overly melodramatic, but the idea that neither Peter nor MJ would be more scared for their kids is a false note. \n\nI guess one way of thinking about it, is that everyone, on some level, knows that something is deeply wrong with the world, and wishes they could do something about it, and so no one critiques Peter too hard for doing something, as long as he's 'careful'. You get the sense that MJ always knew that Peter had more in him, and maybe hoped he would do more with his life, so she can't really be harsh with him for actually doing something, but never expected it to be *this*.",
            "Loved it, glad we have Marco back and glad the whole family knows, that last page was perfection",
            "Kingpin kicks their ass 1v2 and that's to be expected. Nothing really action-packed happens in this first arc, but it's probably necessary set-up that Hickman likes to take time doing. It'll probably pick up by the time the Sinister Six are introduced.\n\nI honestly thought MJ would be a lot more pissed about Peter going around behind her back, but at least it's cute she gave him his superhero name.",
            "Amazing issue. The art, the dialogue, the plotting, showing how ill prepared both Harry and Peter are while making Kingpin truly menacing, it is all amazing. \n\nMy one gripe if I feel like MJ accepted Peter being Spider-Man a little too quickly for my linking, but is such a small gripe that I can easily look past it. I do love MJ coming up with his codename.\n\nThis book is just a giant repudiation of the post-OMD *status quo*, and I love it.",
            "Damn, King Pin is cool as hell here. Great scene.",
            "This will honestly read weird in a trade. It doesn't feel like the ending to even the first chapter in the story. Good issue, but positioning it as the end of first arc? Eh.",
            "MJ not being mad is very obviously a bit of an overcorrection from all the garbage forced on us in ASM. Makes little sense narratively, but I understand why Hickman wanted to skip it in general.",
            "I know all these Ultimate comics jump from month-to-month in real time but this is the issue that made it really feel out of sorts pacing wise because they want you to believe six months have passed yet it only feels like two at the most. Which would've made the family discovery and May accidentally blabbing feel more realistic than believing that Peter had been successfully keeping it from them or May could keep it a secret for that long. Also I'm surprised in 6 months this is the first time he's been that beat up. \n\nAlso it's been 6 months but it feels like they've barely done anything. Maybe that's why they jumped to the 1st boss even though they're obviously under-leveled. \n\nThis adult Peter really isn't 616 Peter. I don't think 616 Peter has ever been all that worked up over breaking and entering when necessary and he also is obviously out of his depth fighting major Supervillains.\n\nAh yes, the classic \"I didn't ask for this codename but I like it so I'll keep it anyways.\" \n\nIt's also setting up the division between Peter and Harry that Harry is more willing to bend the law or break it than Peter is, and Peter noticed him mentioning he got info from Bullseye so that'll probably come up again.  \n\nHonestly I wonder if 616 Kingpin could tank a laser without super-powered tattoos. \n\nIt's funny how after reading the preview people were all set for family drama but everyone is surprisingly cool with it, even MJ. Which, yeah, it's great to see Peter's family supportive and accepting of his new Superhero pastime but realistically I feel like there should be more issues on MJ's side that he lied to her for so long and is putting himself out there like this and the impact it could have on their family, but maybe when it finally starts impacting them will things take a turn for the worse. \n\nI did love how she asked him to put on the suit so she could check him out...and I imagine they went to bed straight after web-slinging. \n\nYou can tell this was designed to end for the trade because it took six months and the last issue that will be in a trade for him to get called \"Spider-Man.\" But it took six months to get there? I kind of like the idea of MJ doing it but at the same time she even points out how obvious a name it is so why didn't anyone else come up with it?",
            "Huh, so MJ really didn't know.\n\nNot quite sure what to think about this issue. Checchetto's art is amazing as always, and the fight scene with Kingpin vs Harry and Peter was cool. The cat is finally out of the bag and the Parker family knows Peter is Spider-man, and they are all mostly okay with it (for now...)\n\nBut as an ending for the first arc, it lacks a certain...pizzaz? Or maybe hook for the next part is the right phrase.\n\nOh and does anyone know if Kingpin's new Super-strength tattoos are a deep cut to anything?",
            "I dont know about anyone else but Harry's Goblin costume is really growing on me. I like that the purple coloring on the helmet makes the shape of the ears. Checchetto drawing Harry probably also helps a lot. This was a solid issue for the action alone but I really hope we get back to Ben and Jonah as they were the standouts in earlier issues.",
            "This is everything I wished for and more. Secret is out and it is handled reasonably. MJ being scared but also proud is fitting...along with other numbers for other feelings. Settle down Mrs Watson-Paker! She earned that swing! And her job/speciality just fits great too. After all, Peter will probably need all the PR as Spider-man can get and MJ would be perfect for that role. AND to handle 'keeping the identities a secret' thing too.\n\n Poor May was so scared that she blurted out the secret. Yea, seeing her father beat up like that would be scary for any young girl.\n\nGets his costume's look from his daughter. Gets his hero name from his wife. Perfection. Though now I am wondering what he is gonna get from his son. Please don't be angst.\n\nPeter already having quite the friendly dynamic with Harry and him getting the Green Goblin codename from the internet stuff...figures.\n\nThe big fight with Fisk sets the stakes quite high. Fisk by himself was bad enough but this version decided to 'enhance' himself...which makes him an actual super-powered threat now. One that can beat both Peter and Harry together ( though he was expecting them and setup a trap. Could go either way in a fair fight with more experience for Peter and Harry. ). The dynamics with Kingpin will be quite different just because of that AND the fact that Fisk is still being a rather 'small fry' compared to Maker's council above him. So it is an extra motivation for Fisk to 'improve' himself. Hell, I can see Fisk even doing an 'enemy of my enemy' stuff to get himself free of the council and team up with the Ultimates for an alliance of necessity. Because Fisk we know would never accept being under someone else.",
            "I liked the fight scene against Kingpin, but this issue is kinda meh(and now that this first arc ended, i can speak that MJ is by far the most boring character in this book and this Peter is a dumbass).",
            "Well look at that, you CAN write Peter and MJ like functional adults! Sure, naive but with nobody having an idea who he is yet, it's understandable. But she's there and supports him!",
            "I wish this was perfect. Or an amazing conclusion to the first arc.  \n  \nBut unfortunately it isn't. There is a lot of amazing stuff here, chemistry between Harry and Peter, amazing art and action.  \n  \nBut MJ and Richard were disappointment. Richard feels like a non-character and MJ feels too perfect. There is no struggle, no doubts, not even worries or arguments. Just text-book perfectism, which is nice, but not exciting.  \n  \nI don't want massive argument or anything, but something. Right now I have gotten very little from MJ as a character and I hoped this would give us something.  \n  \nI love MJ. I love her and Peter together, they are my favorite couple in comics and one of my favorites in fiction. So I wanna see her more, as three-dimensional character, not just as \"perfect wife\".  \n  \nBut I know we have only seen 6 issues. My expectations were high because this series overall has been so good. So we might get more out of MJ and Richard later.",
            "So the whole thing about peter keeping his identity a secret from his wife and son comes to an end, which is great, but the pay off from it was lack luster. Now dont get me wrong Im not asking for an amber from invincible show situation here but the reaction from mj especially reinforces a criticism i have for her: she isnt anything beyond a supportive wife. I also dont really understand what the point of having peter keeping it a secret before was if you were going to resolve it this early in the run and this easily.\n\nWith the first \"arc\" of this series finished I have to say im a bit disappointed and I really dont feel hickman brought his A game. This run thus far feels like it is carried more by the frustrations of spider-man fans and great art rather than a compelling story and characterisation. We have a peter parker who has more agency in his decision to be a superhero but less of a compelling reason to do it. We have a family that while nice to see are barely characters. We have supporting characters that are more engaging than the titular character (namely uncle ben, jonah and harry). Overall I dont think this book is bad and it always has the potential to turn things around or maybe this is sn intentional choice to build to something fantastic or maybe im missing something, regardless it doesnt change the fact that these last 6 issues have not been great reads for me.",
            "This is honestly so mid beyond just Peter being married to MJ which is why people are eating it up",
            "The great things about this comic are Peter and Harry working together to have their first encounter with the Kingpin (resulting in Kingpin seeing them very soon) and Peter telling his family (aside from May, since she’s kept it four four months) about him being active as Spider-Man (resulting in Richard and MJ to be surprised and impressed and for MJ to support Peter’s activities as Spider-Man, with her giving the Spider-Man name to him). Jonathan Hickman has done a great job on Peter telling his family about his Spider-Man life, with his family supporting him with little worry because they know he’ll be okay. Let’s hope that the family will get to see Peter in action as Spider-Man. Overall, this comic is great!",
            "T'challa, I understand.\n\nThese Goddesses. They're beautiful\n\n  \nT'challa, be stronger than this. You can't keep falling to covenants with a Goddess cause she sway her hips and give you the stare.",
            "So we got a confirmation that Varnae is somehow possessing or influencing Blade as the big bad then? Weird that we got that in a tie-in book.\n\nBut I like seeing gods actually DOING something. Bast, for all her promise to protect, says T'challa disappointed HER? No. You DISAPPOINTED the world, Bast. Maybe if you weren't too busy playing with the Intergalactic empire stuff in a child's body.\n\nAnd this Anuket 'helping' T'challa but also seem to bind him to her as well. I am sure that will go well...\n\nAnd oh boy, Atlantean defenders. Lets not start another Wakanda/Atlantis war while trying to save the world from Vampires.",
            "They finally acknowledge Varnae by name, after a lot of references throughout this event.\n\n\nThis clarifies things from other books as well, I liked it.",
            "I’m shipping T’Challa and Anuket now I guess. T’Challa could use some fun with a goddess that doesn’t take things seriously lol \n\nOther than that this was a great issue. I love a well executed lore dump and I think the team told a really epic story that expanded Wakanda and created immediate stakes for T’Challa. Now that he has more control of himself we can see him turn the tide against Blade/Varnae while whooping some Atlantean ass.\n\nAnd is that MCU Attuma in the background of the final page?",
            "Pretty cool lore dump, and great art. All the women and goddesses are gorgeous, and all the panthers and cats deserve a pat. Maybe this writer could get a shot at writing the main book, would probably be better than the last 4-5 runs.",
            "I liked this but was hoping that Nazi Bast would have been quietly phased out.\n\nOh the irony of Wakandans trying to go to another country for refuge and Latveria of all places ",
            "This tie in is actually so great. I haven't read many Black Panther comics, but this is probably the best one I've read. It does his characterization right, the lore is cool and interesting, it expands what is going on in the current event, and gives potential repercussions for what can happen after Blood Hunt is finished. This is a high standard",
            "Brielle is really going through it already with JUST entering this world of heroes. Being overwhelmed and not wanting to be a part of all this is very understandable. Daredevil was a decent choice to get her to understand things somewhat and wanting to make her own decisions about the current situation. You also see though how veteran heroes react to the situation after being through it so many times and just going along with the toughest decisions as 'comes with the territory' and of course that would be off-putting for Brielle when they ask her to kill her dad that she just got in her life. And Dracula being the one at the forefront does not help either.\n\nGuess 'Blade' is entering the fray to take her personally now. I am wondering when the 'switch' happened for Blade because he could've easily got Brielle put in a safe place when he needed her before enacting the whole plan. So I assume whoever possessing him was not aware or recently took over while she was away. Because all this planning for this big plan but forgetting the one of the key parts, means something prevented him aside from Dracula.",
            "Not as good as they first one, but had its moments.\n\n\nI wish they went like the solicit for this issue regarding Matt being a priest as something relevant for the plot, to perform an exorcism on Blade or something... Maybe it could still happen down the line.\n\n\nBlade on full beast mode was a nice tease, with full context probably coming in Blood Hunt #4.",
            "Poor Brielle, only known her dad for just a few months at most and he gets brainwashed and people are pushing you to try to kill him.",
            "So Hydra is kidnapping and creating their own kid 'heroes' and only Spider-woman is aware of it while they are all plastered on the pages? Surely someone would be keeping an eye on these type of things, especially when it comes to Hydra plots.",
            "It’s just Jessica and David talking about The Assembly before Jess teamed up with the Assembly to defeat The Screamer. Let’s hope that they realize who Gamma Rod really is so that that can defeat him and Viper and make sure that Jess will save her son Gerry from Hydra and Echidna. Overall, this comic is okay.",
            "This plot continues to be weak what carries the issue is Foxe's writing of Jess. \n\nHydra kidnapping kid heroes to make them there soldiers whilst still having them act like heroes is very much a basic hydra story and the fact no other hero notices just makes it feel weird. \n\nHopefully this means Gerry will be unconditioned at the end of this run",
            "All these artist eccentric types, tend to be quite full of themselves. Going 'normies' and such. Well, I guess it is fitting she is a mole and a betrayer, though I never understand why these people EVER think these literal evil entities would keep their bargain.",
            "Did JMS - nobody has signed a check in the UK in over 20 years - maybe get out more.",
            ">\"It's a genius idea for a new kind of Avengers\"\n\nRhodey my brother in odin you are literally describing the Thunderbolts",
            "It's funny how even blue collar Supervillains and a bar waitress all hate Orchis.\n\nRandom bikini models are random.\n\nWar Machine: Supervillain work release program spinoff?\n\nI guess Tony has had that punch (and a few punches) coming. The marriage wasn't 100% genuine but Tony still got to enjoy himself while Rhodey was in prison.  \n\nThere goes Feilong, probably never to be seen again. \n\nGuess we'll settle Tony and Emma's relationship in the last issue.",
            "Rhodey's plan have been tried before. Hell they went after Daredevil for trying to do the same. Maybe just once, they should let how things would go with giving the lower level crooks the opportunity to do something good. I mean Rhino have been doing quite well by himself.\n\nFeilong getting put in a coffin, probably buried alive? Yea...it is deserved. I am glad Tony didn't let him off the hook. Even if he might regret that he 'went too far', I honestly don't think he did. Feilong deserves worse.\n\nDid we get Carol asking about Rhodey in this book? They are supposedly still dating right? But both her book and here, it is not referenced as far as I remember.\n\nYea, I guess Tony deserved that punch but from what we read, a bigger punch gonna come from splitting with Emma I guess. Not gonna lie, I liked them together. It is more interesting than whatever they planned for Emma with From the Ashes relaunch.",
            "A nice birthday gift to see the quality of the book pick back up with this issue. I'm glad that we got to see Rhodey getting some spotlight, as well as an extended look at the Mysterium Armor in action. That display of power of beheading a Stark Sentinel with one punch? Good stuff. Speaking of the Mysterium Armor and the action, Di Vito really knows how to make it look good. Well, he knows how to make anything look good. I wish he had been the artist for the last few issues as well.\n\nIt's still a shame that the book is ending, but the \"backdoor pilot\" feel to this issue is making me hopeful for the future. Maybe the reason there haven't been news of the next run is because Marvel didn't want to spoil this development? Maybe we'll get an announcement later today if not tomorrow? I hope what I'm saying is not just wishful thinking with a side of copium. Either way, there's no way Iron Man is actually getting the axe with a tease like this. If the next book is not \"Iron Man ft. New Team\" it's gotta be \"New Team ft. Iron Man\" at the very least. And since I'm on the topic of this new development, I hope what it's leading into is a Force Works revival. The idea of making a team with villains is really good, and it speaks of Tony's precedents of giving bad guys a second chance.\n\nIf I have a major complaint about this issue, is how unrealistically smooth everything went with Rhodey's plan. Tony's narration mentions that, after finishing the Orchis clean-up, they collected the weapons cache and the villains went their merry way. You mean to tell me that none of them even tried to squirrel away with a few WMDs? C'mon... I mean, the idea of giving villains access to all of these weapons was beyond reckless, so I guess that everything went well is a silver lining. That being said, I have to give Duggan credit for having some fun and featuring some established Marvel Universe equipment in the weapons cache, like the Sky-Cycle or the Spider-Slayer. Those are fun continuity nods.\n\nAll in all, fun issue. The feeling of closure is already present, so with the next isssue being oversized, I'm hopeful the conclusion won't feel rushed. Looking forward to the finale and whatever comes next. Just wish we didn't have to endure this radio silence first.",
            "Don’t love this issue. First of all I question the realism of Rhodes giving a bunch of villains weapons and they just off screen give them back are you serious. \n\nThat said I do like the idea of Rhodes horrible experience in prison leading him to wanting to reform these villains i would love a mini on that. There are some villains who are barely evil and just do it for money rather than for the thrill of it that could be turned. I’m not caught up with Spider-Man but I feel someone say miles and rhino have a good relationship. \n\nAre we meant to assume that feilong is buried fucking alive because Jesus. Surely the raft or whatever is more humane. I mean he is essentially a serial killer who never showed even a small fraction of remorse but wow talk about dark. He should have just killed him. \n\nI’m on my hands and knees praying Emma frost and iron man continue",
            "Duggan finally gave rhodey a moment in this run its a miracle it took long enough and lmao rhodey your literally describing classic thunderbolts but i guess that team is now secret avengers so i guess new west coast.\n\nTony burying Feilong alive is very tony he really didn't let him off lightly and tony is very violent when he wants to be. \n\nThe tony and emma stuff is sweet they do deserve each other as they are big enough well self centred dicks and suit each other. Whilst its clearly teasing an end i wouldn't be shocked if they stay together especially with breevort wanting the x men to be more intergrated into marvel.",
            "Ok, we are (sort of ) back boys!!! This issue was actually pretty good. The previous issue was a bit mid, but this one is really solid. Great stuff.\n\nRhodey assembling team of bad guys (and my boy Rhino being one of them) was amazing. Tony and Rhodey had a really funny moment lol, but then we went right into the cool handshake moment between two friends.\n\nInteresting to see, what they are planning with the Rhodey going West and making a team full of reformed bad guys with Tony leading them. This is why I wish Duggan stays on the book and they just relaunch it. I feel like the next writer will just ignore this. But fingers crossed, Tony and Rhodey revive Force Works (But for the love of God, call it something else lol. Force Works doesn't not sound cool). Plus, I think it works the best, since Rhodey gave weapons to supervillains like Rhino, Stilt-Man, Sandman etc. These guys are not really evil. Douchebags? Sure. But not evil. This is not him giving weapons to Bullseye or Carnage lol\n\nI actually love Feilongs fate in this. I know some people would have been like \"Tony should have killed him, ripped his balls off, shoved his foot up his ass\" etc lol, BUT, I think that would be an easy way out. Plus, come on. Tony at the end of the day is a superhero. He defeated Feilong and he is no longer a threat. He Avenged the lost lives. Now Feilong gets to experience torture and suffer for what he did. Killing him is just getting rid of him without having him pay for what he did. He deserves to be punishment, not a quick relive.\n\nLastly, Tony and Emma's little moment was sweet. They do look cute together, and it's nice seeing both him and her, drop the mask and act like they usually are. Emma is very caring, and Tony is not afraid to express his true feelings. I will stand by this, their romance is great. Short, but great!\n\nTLDR. Good shit. TonyXEmma are cute together.",
            "Why are they talking out of armour in the middle of a big fight five minuts after they also gave a bunch of weapons to a couple dozen villains? Just because it's random and funny? One shot and they're dead. Shit like this takes me right out of the story, this part reads more like a parody.",
            "Looks like they're setting up Jen for the Avengers Assemble book, hopefully there won't be some last minute swerve to break her and Jack up.",
            "Sad that this ends with issue 10. Though I still didn't get the reason for launching the same series twice.\n\nI wondered why it took this long to invite She-hulk into Avengers. After all, there should always be a Hulk in there. Though I get Jen wanting to be away for a while. I don't get the fear of Avengers for Jack and Jen though. It is not like they are unreasonable villains. I mean if Tony can still work as best friends with Cap and Carol after TWO civil wars with literal deaths, they can easily move past Jack of Hearts being alive and hell maybe even find a better solution for his dilemma. I get it is being used for drama but it has quite the easy solution so it doesn't work as well for me.\n\nEither way, hope we see She-Hulk in more Avengers adventures etc. And I do hope we see more of our favorite Eternal/Deviant duo.",
            "It’s hilarious that Jen and Jack found out that Ransak and Karkas used her apartment for something important. I like that Jen traveled to the Impossible City with Carol so that she could meet up with the Avengers before she and Jack has a talk about her JLI in the Avengers and him being back from the dead. Also, Thor and She-Hulk awkward moment since they used to date in Jason Aaron’s Avengers run in 2018. Overall, this is a good comic!",
            "Im really sad this series is ending as its such a good series and so different compared to everything else on marvels shelf. \n\nThis issue is basically Carol trying to butter jen up to join the avengers which i quite like they are long term friends and Jen is always a great avenger. The thor and jen awkward moment is really nice and a fun callback.\n\nJack and Jen being worried about tony especially is hilarious because why wouldn't you be especially with Jacks history.",
            "I looked it up, and Alyssa and her Siren Sect are from the Death of Dracula mini from 2010.\n\nbetween Baron Blood in Avengers and this, I like how a bunch of wholly unrelated vampire schemes are jumping on the opportunity that Blade's created. ordinarily I'd be annoyed that a big event like this has so many side plots, but of *course* every vampire is trying to spin this to best advantage.",
            "Barrister continue to be a great asset. Love that guy. Maverick got honey-trapped by that Siren Vampire, Alyssa. And she is planning too big for her breeches. All these side-vampires, thinking they will just take over from the ashes when even Dracula is aware such a thing is not possible. I guess that is why Vampires have been failing all this time with 'leading' figures like her. Though, I can see how someone like Maverick falling for Alyssa's ploy.\n\nThey play on the knowledge of Blade being behind all this and how that effects Logan's thinking and Louise too. I mean, yea, she would question herself after hearing how the most famous vampire hunter suddenly revealed to be behind the whole vampire apocalypse after possibly giving into his darker urges. If it that can happen to Blade, what chance would she have? Good thing Logan has his suspicions on the current situation enough to keep Louise's mind off such  thoughts but also he is not dismissing the possibilities because he has seem A LOT of similar things happen.",
            "It’s so funny every time Earth 1048 is involved in a comic crossover they end it with saying that character is going to magically forget what happened, this is the 2nd time they’ve done that.",
            "I like that an alternate future Eddie (and Venom) became the narrator so that he would tell us about two universes where he never became Venom. It’s interesting!\n\nFor the first part, I like that the Venom of Earth-1048 (aka the PS4 Spider-Man universe) refuse to join Knull’s army during the King in Black back in 2018 before he returned to his universe.\n\nFor the second part, it’s shocking and surprising that the Avengers of another universe were killed by Venom.",
            "Well damn, didn't expected to get spoiled about the Spider-man 2 game like that. I know it's been a while that the game is out but didn't see the reason why they would use the game universe like that to tie it into Knull's invasion like that. Are they teasing A Knull invasion for video game's world for the 3rd game?\n\nYou know, that 'symbiotes are not inherently evil' thing, hard to accept with that 2nd story. Felt like it is inspired by Thing the movie. Banner wouldn't be a smart choice though considering he is far more divided on the inside with the Hulk personalities so it would clash more with the Symbiotes than actually work with it.",
            "I guess it makes sense that when Carol was taken and came back with the Negabands, it was from inside the Undone. Literally in her heart. \n\nI was wondering how that Omen was resisting being controlled and got the answer with a literal arm through the body of Yuna. I guess the Galactus-lite we have here is smarter than I gave it credit for.\n\nIt is still not good, make no mistake but still, it is something.",
            "Wait, if the Negative Zone section was in the Undone the whole time, then... why could Carol ever get out in the first place.  Why was the Undone not snacking on her every chance she could?  And how did Carol and Yuna get paired by the Nega Bands in the first place?",
            "I guess sometimes you can't enjoy getting eaten by a giant naked cosmic woman.\n\nNot sure I'm all that invested in Yuna's love life but her prospective girlfriend just can't help but screw them over.",
            "This didn't happen",
            "So the costume can change? How does that even work?\n\nIs Ben free of the goo? Why are they referring to Ms Marvel by her real name?\n\nThis is crap.",
            "\"You actually think someone as pathetic as you can save me?\"\n\nObviously he's Spider-Goblin-ed out but this is a crazy line considering Spider-Man has been saved by Norman, C-list supervillains, Aunt Anna, and Doctor Octopus arms. Not that those folks are pathetic either (except Norman) but like, Spider-Goblin, you should be embarrassed man. \n\nOh and the goo fixed everything. Phew, I was concerned that maybe there would be a whole sequence where Peter has to come to terms with his emotional vulnerabilities and weak points and have to save himself. Thank God we sidestepped that potential opportunity for character growth! \n\n(I say this sarcastically but also don't believe Wells would succeed if he were to try to write a scene like that)",
            "You guys think writers ever get embarrassed when they're writing foreshadowing that pretty clearly will go nowhere? The whole opening monologue with Kraven saying \"Only one of them will survive this!\" and Peter's closing line about killing Norman had me rolling my eyes.\n\nDo they really think we'll believe that Marvel editorial, who will move heaven and earth to find a way to keep Peter and MJ apart just to enforce the status quo, will let any major characters die? Really?",
            "So now that the goo is out of Ben, what happens? He's already received like 2 factory resets that should've stuck but never did.\n\nPeter is back, kind of, and Norman is signing off companies in Peter's name to possibly tarnish his reputation?\n\nI'm glad that things are coming to a close at least",
            "Ben spews goo on Peter and it eases his mind",
            "So stupid they'd still make Ben come off as a dick in all this. Also, you'd think he'd ask Ben to tag along...\n\n...goo just changes the suit too...  and course for no reason more Rekrap...\n\nI can't even with this garbage",
            "The only saving grace is it really feels like Wells is wrapping everything up as we get closer and closer to the final arc.",
            "Final Zeb Wells arc starts at #58! Who's gonna take over, what do you think? Hope they get rid of Lowe too while they're at it, but doesn't seem to be the case.\n\n>!Don't think many are interested in discussing the actual issue anymore anyway lol!<",
            "This whole run, I just...I've tried to be fair and not jump on the hatewagon the fanbase is always flipping out over. But god...what are we doing here, man?",
            "Kamala's not drawn correctly.\n\nAlso, the book this most reminds me of is ASM late 90s when Norman was after the tablet, etc. And it was garbage. This was actually slightly better, but not by much.\n\nIt's just generic bad Norman nonsense.",
            "Ben used Nickelodeon Kids Choice Awards Slime on Spider-Goblin\n\nIt was super effective\n\nBut my buddy in Christ, how did the goo turned the suit from purple to red again?",
            "I like that Ben was able to remove Peter’s Spider-Goblin persona before Peter thanked him for saving his life. This is the only good thing about this comic. The rest is just Kamala seeing J. Jonah, the Living Brain, and Rek-Rap because Zeb Wells wanting to doing something with Kamala since she didn’t do anything interesting in ASM last year and wanting Rek-Rap to do something heroic and unidiotic. Overall, this comic is okay.",
            "Too bad Peter didn't kill Ben",
            "Yup. Interesting that he seems such a far cry from Utgard Thor or Utgard Loki (very aggresssive, malevolent).",
            "> Soo Buri/Tiwaz definitely knew that riddle and played along to let Thor win, right?\n\nYep. He wanted a laugh, I think. Make Thor think, and create a riddle- one that's tricky (the answer is somewhat arbitrary) but not impossible (the answer is ultimately incredibly simple).\n\nA sort of further test of wits on top of what Loki already did.",
            "Eternity is going to show up in Phoenix and Storm. Oblivion is also going to show up in Storm.",
            "Is it really a surprise though? ",
            "Ewing + Marvel Cosmic is pretty untouchable",
            "Norse mythology is... complicated to say the least.\n\nI would highly recommend some Youtube channels like [Arith Härger](https://www.youtube.com/c/ArithH%C3%A4rger). He explains a lot about each God and how Germanic mythology changed over centuries. It is no wonder why there are different interpretations.\n\nI would recommend his ***Tyr vs Odin - Who was the main Germanic God?*** video.",
            "> Ha, Bragi is the only sibling that seems to like Loki at this point. I guess he would considering their shared positions. \n\nThe only one who genuinely likes Loki and Loki genuinely dislikes him. Makes perfect sense.",
            "Don't hold your breath on that being great. Ewing's weak point is fight scenes and he seems to dig his heels in on never improving in that area. There'll be some rambling about powers and power levels and feats and snark about anyone caring for that. ",
            "Get Pepe Larraz on it asap.",
            "Coccolo's art is gorgeous. I really don't like some of the faces in the current issues. Looking forward to seeing how Jan Bazaldua does when she takes over from next issue on, though.",
            "I think the InBetweener works for Oblivion, not for the entity per se, but towards Oblivion as a concept as it relates to Chaos?\n\nI am intrigued by g.o.d.s. But I am still lost on how the hierarchy works.",
            "Everyone talks about the MJ panel, and rightfully so, but by far my favourite page in this comic is when Peter says that he could have killed Goblin, and Kingpin just goes “THATS THE IDEA” and it’s simultaneously terrifying and hilarious.",
            "I mean, wasn't he bad when he first started out as a teen in 616?",
            ">what exactly is up with Fisk's power-tats (magic?)\n\nThey're the same \"embedded exoskeleton\" that Bullseye had in the last issue.",
            "Yeah, I didn't mind the fill-in artist in the previous 2 (?) issues, but the art in this issue especially (from pencils to ink to coloring) was AMAZING",
            "This version of Spider-Man is severely under-leveled.\n\nI feel like MJ will probably be more upset once this Spider-Man life starts impacting/hurting the family more. Peter said they'd be safe and this wouldn't impact them but what happens when that turns out to be wrong?",
            "I think she's fine because he's fine and they're fine. But the second something happpens to one of the kids (probably Rich), she'll erupt like a volcano.",
            "I don’t know why people are suprised, Hickman has never really done that kind of melodrama in his work",
            " It bugged me a little too, but the flip side was just happy they skipped the drama over it for once.",
            "Why? First fight against the main villain, family finds out Pete is a superhero, and he gets his name on the last page. Works fine.",
            "It’s a monthly series, I think it shouldn’t matter how it reads in the trade. Hickman’s other title, *G.O.D.S.* is like that too and I think more writers need to get back to that mindset instead of trying to write an ongoing like a series of OGNs.",
            "With regards to the very last point there, only 3 people including himself really knew he was Spider-Man, and Goblin probably doesn’t really care about his codename.\n\nI guess it’s pretty likely he didn’t really think of getting a codename until he actually fought Kingpin when Goblin called him by his real name.\n\nAlthough you’d think Tony would’ve had Spider-Man in the files he gives him, considering Hank got like an entire play by play on the disaster that his life was.",
            "I like this comic, but i also feel kinda disappointed about this first arc, and some stuff that i dare to say about this comic are:\n\n- MJ, as i stated before, is boring and she kinda annoys me(even though i kinda like that she came with the name \"Spider-Man\").\n\n- And while Marco's art is good, i have an unpopular opinion that he is not that great, and i think the lines and colors is what saves his art from becoming generic.\n\n- And this Peter is a dumbf**k, because seriously, how he didn't notice that Kingpin was trying to kill Harry?!",
            "Come on, it's better than mid, it's pretty cool, but yeah we are starved for good Spidey content, so people are overly enthusiastic about this run, me included.",
            "This is what the abscence of Ororo does to the man...",
            "Atlantean and Wakandan soldiers ten minutes after Blood Hunt ends: Ah shit here we go again",
            "Varnae only appears in flashbacks, so it's not a confirmation but a tease, regardless of people calling that he was the culprit from the start. My guess is that the reveal happens next week, in Blood Hunt #4, and Blade's mind gets free in #5, to a final duel (probably a good time to bring back the lightbringer sword).",
            "> Nazi Bast\n\nEh? The WHAT Bast?",
            "Yeah, I feel like these issues really make you realize how insane superhero comics are.",
            "> First of all I question the realism of Rhodes giving a bunch of villains weapons and they just off screen give them back are you serious.\n\ngiven who they showed on-panel, it makes sense to me. Rhodey hit up the super-mercs, not the true believers or terrorists. guys like Rhino and Stilt-Man aren't in it for anything besides a check.\n\nthat being said, you're right in that they should immediately go pat down Turk, who probably ran away from that fight with full pockets.",
            "Burying him alive in a coffin going to kill him pretty quick I think",
            "See, this is the kind of stuff I love. Seemingly one shot villains and characters returning makes a comic world feel alive. Its what makes Marvel better than DC nowadays, since DC's continuity is pretty much dead now.\n\nI just wish the other tie ins did this instead of just seemingly boring stories that go nowhere, like Bishop which should have had her vampire mom return, or JJJ's werewolf son where he should have fought either a one shot villain like that nazi vampire captain from that one captain america run.\n\nAlso, i was hoping for the vampire sects or races to appear and have their wars and power grabs. Is it bad to expect vampire wars and politics to occur in a major event that will affect vampires for years to come?",
            "Meh, kind of tired of anthologies. As long as this one promises something big or does a major thing, I will probably skip on this.",
            ">Are they teasing A Knull invasion for video game's world for the 3rd game?\n\nI sure hope not. They don't need to go nuclear like that.",
            "I would be into this story if it means that yuna is actually dead, but we all know it won't stick. Otherwise, twitter will start an uproar.",
            "It's psycho active goo man. Everyone knows that psycho active goo changes your outfit.",
            "Well there are two issues left so he has to be evil somewhat or man this arc is kind of misleading",
            "> Oh and the goo fixed everything\n\nHuh...? What now?",
            ">Peter is back, kind of, and Norman is signing off companies in Peter's name to possibly tarnish his reputation?\n\nFinally, more ways to ruin his LinkedIn which hasn't been updated since he added \"disgraced former CEO of Parker Industries\"",
            "What’s weird about that is that idea is stupid? Like just signing over a company at the last minute to a low level employee is something the SEC is specifically trained to look for",
            "Who will have editorial ruin their reputation next?!",
            "> Hope they get rid of Lowe\n\nWould require Cebulski being fired.",
            "Even tactically It would have made way more sense if the suit stayed the same: with that Peter could have pretended (?) to still be under norman's control and attempt a last second betrayal to foil his plans...instead we get the normal costume for literally no reason and probably a straight up fight in which he'll get railed horribly by Norman because that's Just what Peter does in this god-forsaken run",
            "I also liked that but though I really wish that Wells would just allow for the moment to stand and stop throwing those “Maybe not quite good” jokes in with Ben. No need for that last line of how he thought that would kill him. Just let him do good by his brother. And while the programming is still there, hopefully Ben’s weakened it enough that Peter can fight it off with his heroic resolve at least until it can be completely removed",
            "Nope, that would have been OMD levels of bad. What should have happened is have gob peter kill some villains or characters, like robert's son, pAUl, his various ex girlfriends, the sinister six, tombstone, or white rabbit and that bald criminal who doesn't matter that much in the slightest.",
            "I think it's important to recall that the Utgard Gods are not really a pantheon in the typical sense. They are part of a wide group of Elder Gods, who happened to collectively hole up in Utgard. So there's no real reason for them to necessarily share similarities.",
            "Very surprised they allowed this one since Hickman seemed to have plans for it. ",
            "After watching that video: that is complete garbage. The theory of Tyr being a supreme god is derived solely from Tyr's name being etymologically connected to Zeus, and thats it. No sources, or archeology substantiate any further claim he makes. But for a few noteable mistakes:\n\n1. Tiwaz is a rune/letter and the first in Týr's name and thus connected to him, but nothing suggests it was his actual name any more than J is the original name of Jesus.\n2. Nothing beyond vague etymological connection to a completely different religion suggests Tyr was ever a god of the sky.\n3. He claims Christians mixed up Tyr and Odin's positions but this is impossible, because we know Odin was equated to Mercury and the Roman Tacitus mentions Mercury as the main god of the germanics before Christianity was a thing.\n4. He claims that it is actually Tyr and not Odin leads the gods during Ragnarok, but neither is clearly depicted as leading the gods in the final battle, with several tellings not even mentioning Tyr.\n5. No depiction of Tyr holding the sun and the moon exists.\n6. Odin is very clearly not the father of all gods in Snorri's works, neither Njord or Ullr who were very major gods were sons of Odin.\n\nThis guy is a complete hack. Almost every claim he makes has nothing substantiating it if not outright historically impossible.",
            "hmm. I missed that first time around.",
            "Yeah and it seems like that chicken will come home to roost soon. Fisk had eyes on theme the entire time they thought they were staking him out and Peter and Harry had no idea. \"Every camera on New York City\" belongs to Kingpin. No way they don't catch Spider-Man on his way home eventually.",
            "Yeah Bullseye said that’s last issue to Green Goblin, something along the lines of everyone wants to be a hero until repercussions occur",
            "I know it's a classic thing to do, Pete takes MJ on a web swing, but it does seem stupidly reckless when he was told literally yesterday the Kingpin's got eyes all over the city.",
            "Now i'm thinking on MJ supporting Peter even if her face is burned, has a missing eye and lost one of the kids.",
            "I mean if you think it's pretty cool that's fair, to me it's pretty boring. Only thing I like about it is MJ.",
            "The end of the Ta Nehisi Coates Black Panther run ended with the repeat Nazi ally Zenzi becoming the new Bast for reasons",
            "I think that was just to scare him off and torture him.\n\nIn the preview for issue 20 we see him in jail somewhere on Mars.\n\nTony was toying with him.",
            "They are. Dracula’s vampires don’t fuck with Blade and Structure. Jubilee is with another group of good guy vampires who fight feral vampires. Looks like underwater vampires are showing up in Wolverine next issue. In Miles Morales there’s R’myr and those energy vampires which are their own thing too. \n\nAlso, maybe I’m misreading your comment but JJJ’s werewolf son was in the last Blood Hunters issue fighting vampires.",
            "You should. These things are just a collection of what if stories, new variants for characters and maybe the next hot toy design. As a comic book on its own, they are lame.",
            "Next issue is the last one. Maybe Yuna really bites the dust 'cos she will not appearing again anywhere.",
            "It's really lame that they don't just kill a couple of characters. You just know everyone is always gonna be fine.",
            "Back to what it was before it touched you, of course i am the idiot.\n\nThanks for clearing that up.",
            "Damn, not even the goo could save him",
            "to date, the only evil thing Spider-Man-Goblin in this arc did was beat up the Sinister Six a bit more sadistically.",
            "Ben uses some sort of \"psycho-reactive goo\" to show Peter what he did to himself, which translates to his Spider-Goblin look dissolving and he's in his regular Spider-Man suit.",
            "I thought you were talking about Zeb when you said \"more ways to ruin his linkedin\" cause this is what the marvel editors have done to this poor man.",
            "Sure why not",
            "I...would actually hate to see White Rabbit and Kareem be killed off. It's stupid, and weird, but White Rabbit has lowkey been one of my fav parts of this run. Just an unrepentant freak who likes killin' and makin' money. And wears bunny ears for some reason. You don't see too many villains like that who aren't men, lol",
            "Ben sucks. Killing him doesn't even do anything. He's practically undead. It would just get rid of him for a while and when he comes back he might be over this Chasm nonsense, not that it will change him from being a whinny drama queen.",
            "I think there were only five in Utgard - Utgard Loki, Toranos and three others. Which maps onto the five silhouettes we usually see when Those Who Sit Above in Shadow appear",
            "what should I read to get more of the Utgard gods? Haven’t read much Thor besides Jason Aaron so I feel kinda lost sometimes.",
            "Hm interesting. Thanks for the info. I watched a lot of videos, not just from him but other Youtubers, who brought more concrete proof about Tyr and Odin.\n\nHard to tell since Wiki isn't always reliable. Do you know more about Norse mythology or just from the wiki???",
            "That would be bad storytelling but there are absolutely spider-man fans who will eat that up",
            "In the Blood Hunters, they are just fighting regular vampires, just not named, already appeared vampires.\n\nThat's fine, as long as the stories are good. I still would prefer some good old continuity porn there and then.",
            "Either dying or going into limbo because no one is going to use wong’s oc but her, glad this is ending and hope someone else can give us a story for just carol",
            "Yeah that’s a problem. The other problem is they keep treating Norman like a big bad who planned this all out and needs to be stopped…..but he really didn’t. This all happened because of an extremely convoluted series of events that no one could have predicted",
            "Was this goo previously established during the run, or was it an ass-pull? Because I don't recall that happening.",
            "I don't think she should get special treatment just because she's a girl. Also, it would be refreshing to see a villain get killed off, especially since Blood Hunt and Gang War promised casualties, and yet Wells is pulling excuses out of his ass to have no fatalities in his run for some strange reason.",
            "How would you react if you lose your memories from a shady company? Besides, Marvel had the perfect way to use him by having him and Eve go on a criminal anti-hero duo road trip full of murder, chaos, and revenge as they hunt down Beyond's upper brass while killing its henchmen and destroy their bases and resources.",
            "Yeah, it's only a few. I just meant that there's nothing really unifying them other than they all came together in Utgard after the fall of the Elder Gods.\n\nI forgot, actually, that he wasn't even one of the five Utgard gods- he was just called the Utgard-Odin as a \"Boy, that's a terrifying though, huh?\"",
            "At the moment, this is the start of the \"Utgard gods\" as a pantheon, unless Utgard-Loki, Toranos, and the other 3 mentioned are \"Those Who Sit Above In Shadow\" (which... there's 5 of mentioned gods in Utgard and 5 who are part of TWSAIS, so it's possible), who were from Utgard, but have rarely appeared and not been particularly elaborated on beforehand.\n\nTWSAIS appeared first in the 80s, during *X-Men/Alpha Flight*, when Loki tried to win their favor, but his gifts of power to humanity were rejected (the recipients didn't want to have the side effect of losing their creativity), and TWSAIS were not pleased when he tried to force it on humanity anyways. Loki also tried to trick the twins of Alpha Flight (Aurora and Northstar) into thinking they were elves, not mutants, or something, and punished him.\n\nThen they appeared at the end of Thor Vol. 2 (during Thor's \"Ragnarok\" arc, part of the wider \"Avengers Disassembled\" event), where they were revealed to be feeding off of the deaths of the Asgardians in a continuous Ragnarok cycle, where every Ragnarok is followed by rebirth. Thor became \"Rune King Thor\" to end the cycle- seemingly killing them.\n\nThey didn't die, turns out. In *Loki: Agent of Asgard*, also written by Al Ewing, *Immortal Thor*'s author, they showed up to warn Odin that reality was ending (this was just before Secret Wars 2015, in the lead up to the destruction of the Multiverse), and then later demanded Loki hand over the essence of the Asgardians after he managed to exit reality to avoid destruction, until Loki scared them off with an existential crisis about their existence and source.\n\nAll of that took place in... 7 issues. That's 2 issues for *X-Men/Alpha Flight*, 1 issue of *Alpha Flight* for the Loki-twins, 2 issues of *Thor* for the Ragnarok arc, and 2 issues of *Loki: Agent of Asgard* for the Secret Wars/end of the multiverse appearance. So... not a lot of actual involvement in the past. Assuming they even are the same deities as the current Utgard-Gods of *Immortal Thor*.",
            "They didn't really exist like this before Ewing. They showed up a few times as \"[Those Who Sit Above In Shadow](https://marvel.fandom.com/wiki/Those_Who_Sit_Above_in_Shadow_(Earth-616))\", nebulous, spooky beings who were said to be far more powerful than the Asgardians. They had no names or backstory, and they only acted as a unit.\n\nEwing himself made a couple possible explanations for them at the end of his Loki series, but neither of them fit with the backstory he's established in this series.",
            "I've read the primary sources of Norse and germanic mythology as well as the related Sami mythology, including the icelandic Eddas, the danish Gesta Danorum and the roman Germania. So I have a good idea when people presents speculation as facts. \n\nI'm curious as to what concrete proof you are refering to because actual historians and linguists have also called into question the entire Tyr as the original top god as pretty unsubstantiated. For example Old norse linguist Jackson Crawford [has a video on it](https://www.youtube.com/watch?v=387cIw-Hf6k).",
            "Honestly, this issue just made clear to me that the quality standard from the fanbase is awful(seriously, they hail this MJ as a great character, even though she is shallow and does almost nothing, besides being a supportive wife).",
            "Funny thing is maybe even Wong willn't use her again because she seems to prefer to create new characters who are the same in different books.  Or who knows, maybe she will.",
            "I think it's something connected with Ben.",
            "It was established earlier, when Ben went evil",
            "I wasn't saying she should get special treatment for being a woman? Just that I'd be bummed if that happened because I enjoy her as a character, and she's an archetype that usually only men inhabit in stories, so that's neat IMO. But I do agree with you generally that Wells has been weirdly risk averse despite continually seeming to tease big dark srs consequences in this run; the only person who's died thus far has been Kamala, who...y'know. Immediately got better, lmao \n\nOh, and I guess if we're counting technicalities, *maybe* the kids from the Paul Dimension? lol",
            "Well Ben was an expert in shady companies since he ran one that was a predatory snake oil scam. I wouldn't have had the audacity to try and steal Peter's superhero identity. Shoot i don't thing I would have the nerve to come back to New York after causing a zombie plague.",
            "very helpful! thank you!",
            "It's not *explicitly* confirmed that they're TWSAIS yet. Just hinted at, with Utgard being called the shadowlands where those who sit above gods live.",
            "thanks!",
            "Watching Germany vs Hungary right now so I can't post them however you can definitely find them on Youtube by just typing Tyr and Odin. On Norse subreddit people like to say the same thing. SMS who made GoW made thorough research said Tyr was at least held in higher regard than Odin in BC era.\n\nI'm sorry if I sounded like I don't believe you :(\n\nI believe you and I love talking about IRL mythology. We can DM so we don't derail the thread if you want :)",
            "You keep calling her shallow in every thread, but she just hasn't had a lot of focus yet. Just because you don't like her doesn't mean the \"quality standard for the fanbase is awful\". If anything it just means you're impatient.",
            "Ironically, his resurrection thing worked, its just that he was crazy and being controlled by someone else.",
            "Then again if she hasn’t had any focus in six issues I think it’s fair to call her a shallow character (so far).",
            "I am patient and agree that she didn't have focus, but this lack of focus impacts her characterization(and by quality standard, i mean that to hail this version as an great character, even though she barely received focus and as a consequence didn't receive a lot of character because she was just seen among Peter's family plot and barely did anything, besides support and give him the codename, wich i think is a very interesting and unique idea).",
            "They didn't pay for unstable clones, they wanted him to treat their loved ones.",
            "Look, after the last couple years, I think it's fair that Spider-Man fans are just happy to have a supportive MJ again, admittedly she's not super fleshed out yet, but the small stuff we do get from her is still nice and that support does add a bit of character on its own.",
            "I mean so far it's basically just the Peter and Harry show during this first arc setting everything up. Ben, Jonah, the kids, Gwen, Fisk- the entire supporting cast has had about the same quantity/quality of characterization as MJ so the focus on her being the \"shallow\" one just comes off as a personal gripe. Hickman's famously a slow-burner when he gets to have his way and as much as the phrase is over-used at the moment, let the guy cook for a while.",
            "The fact that they’re downvoting you for simply explaining your position and expanding your critiques just proves to me the fan base is in rabid mode right now.",
            "While i understand the sentiment, i still maintain my position(and my complain about the fanbase is also based on the reaction that Insomniac MJ have).",
            "I would say jonah and ben are above everyone else except harry because of how they handle kingpin buying the daily bugle. Not only does it give them their own little subplot but also helps characterise them by how they choose to move forward. The others on the other hand barely have anything going on that distinguishes them or makes them interesting. Maybe the supporting cast becomes more interesting later but you cant just use the potentiality of it becoming better to deflect from the fact its not good now.",
            "My focus is because issue 6 is the last issue that i read and the first arc is over, so i think the time of me being nice to this comic is ending, that is the reason why i am being more harsh(and about MJ, i already spoke that while she has this shallow character for now, the praise she gets just for having one character trait is really annoying, and this makes me think that maybe the quality of the writing isn't the priority for a vocal part of the fanbase).\n\nAnd about Peter, i will admit that he is kinda mid too, and in fact his writing really deserves more criticism because he is the protagonist of the comic(but i hope that the second arc develop them way more, because Harry is the one carrying this story).",
            "There was a time where the fanbase wasn't in rabid mode?"
        ]
    },
    "Spotlight Release of the Week #25 - JUN 19 2024 - ULTIMATE SPIDER-MAN #6": {
        "title": "Spotlight Release of the Week #25 - JUN 19 2024 - ULTIMATE SPIDER-MAN #6",
        "score": 33,
        "url": "https://i.redd.it/xrp99tbzof7d1.jpeg",
        "content": "",
        "num_comments": 4,
        "comments": [
            "[**CLICK HERE TO VOTE FOR NEXT WEEK'S SPOTLIGHT RELEASE!**](https://www.surveymonkey.com/r/XZ67TWZ)\n---",
            "This issue was good I love Spider-Man and Green Goblins chemistry.",
            "Good story beats but way too decompressed imo.",
            "Ultimate Spiderman 6 is everything! The action, the twists, and that plot—totally hooked! Can't wait to see what happens next with Spidey and his epic adventures!"
        ]
    },
    "Drop your explanations 🤯": {
        "title": "Drop your explanations 🤯",
        "score": 271,
        "url": "https://i.redd.it/esrqe179i28d1.jpeg",
        "content": "",
        "num_comments": 65,
        "comments": [
            "Exactly what you drew. That is exactly what happens.",
            "Isn't there a Marvel Anatomy book which basically says this exact thing is what happens?",
            "Go check the thread that posted this exact image a few days ago...",
            "Nah, you drew it right. Symbiote isn't just on the host, it merges with them on a more fundamental level. Its in their skin, their muscles, their bones, their blood. All moving together",
            "Recently, Flash changed his appearance to be less muscular, smaller and weaker looking.\n\nhttps://imgur.com/a/M1IlLIC\n\nI feel like it makes more sense if the user just morphs with the symbiote. Like Dylan being big like Brock makes no sense because his joints are in different places.",
            "The body of Eddie is smaller than that of Venom, and Eddie can sort of slide up and down within it. So if Venom is opening his mouth like that, Eddie's head is in Venom's chest.",
            "I always assumed that Symbiotes bonded at a molecular level and not just a skin suit. This also being how the 'healing' worked. So when the jaw opens its because their jaw has been made fluid and reconfigured to be the way it needed to be.\n\nThis is based on nothing but just what I thought and made sense to me.",
            "The correct explanation is that comics are weird",
            "I’ve always just thought of it happening this way already lol",
            "Since the symbionte inhabits Eddie's body, it probably dissolves and separates part of his body in order to distribute him through Venom's form.",
            "WE are VENOM.",
            "Eddie just turns to paste",
            "I believe this to be correct but I also do like the idea that inside Venom the host is essentially in the same state as a caterpillar is within the chrysalis. Just a goopy suspension of sentient mush that’s one with the symbiont.",
            "Yeah, that's exactly what happens. Eddy basically can't be hurt in the normal sense with symbiote mode active. He's pretty much an amorphous scaffold that can be twisted however is necessary with zero consequences. It's sorta how the healing factor with the symbiote works too, any damage can just kinda be twisted back to its original state as if nothing happened. Don't quote me on this, but I think the symbiote can canonically suppress pain as well, so none of it hurts.",
            "The host is pretty much melted into goop as needed when they merge with the symbiote.",
            "Throat goat",
            "symbiote pocket dimension :3 \n\n\nor just the human mouth is far back and connected to the symbiote throat in some way",
            "The Venom symbiote is larger than Eddie so it covers his head.  Also it allows Eddie to breath through the tongue.  Marvel is always trying to make it as real as possible.  So what it's an alien from space that talks to its host. \n\nAnyway marvel has a series called Marvel Anatomy that they show stuff like this... \n\n\n[Marvel Anatomy](https://i.ibb.co/8m7Qxf8/symbiotes-breathe-through-their-tongues-other-facts-from-v0-ls39cap2efaa1.jpg)",
            "That looks accurate. I think it’s just regenerates extremely fast…",
            "I mean technically venom is mix with eddie cells so it can be possible he modify his body as he want cause we see countless time venom also healing him which could also be impossible phenomenon if you ask me",
            "I think the simbiote moves the host around to minimize harm and maximize damage",
            "Mewing",
            "Venom’s face stretches out. Brock’s face doesn’t move. That makes the most sense",
            "The symbiote can appear to increase or decrease in mass this is because it can warp space within itself so it's usually bigger than it appears, which is why it can engulf anything regardless of size, and why it can be burned and yet seemingly not get any smaller. It can also warp space around the host in order to fit them in like the image above.\n\nThe part you're seeing is just how much the current host can sustain.",
            "Suspension of disbelief ",
            "Looks painful",
            "So is no one going to bring up the fact that Venom ate a whole guy and then turned back into Eddie?\nEddie can't fit a whole guy in his mouth, let alone consume him. \nWhen in venom form, his whole body changes. He physically becomes venom. Moments where we see the human face is both of them choosing to show Eddie's face.",
            "Venom bit off, like, 3 people's heads in quick succession, where'd they go?",
            "Wait...didn't Venom eat a person in the film? So...Eddie is a cannibal...",
            "I just assumed Eddie turns into goop or something when inside venom",
            "I kinda always saw it as less than a suit over the body, and just the body transforming. Like, in that form the human body just kinda liquifies. Now, there’s definitely scenes that show it pretty much being a suit, but…. You just kinda have to make stuff up in your head to make sense of things.",
            "When you try to draw Venom from memory and end up with... whatever this is...#ArtStruggles",
            "Venoms head is usually bigger than Eddie’s head, so Eddie’s entire head could be completely hidden inside the very back of venoms head like a really big dirtbike helmet.\n\n[sort of like this basically](https://predatorcollectivehelmets.com/cdn/shop/products/IMG_4743_800x.jpg?v=1662994794)",
            "It basically keeps his consensus but absorbs his body in order for no damage to Eddie's Jaw",
            "You didn't know that San Francisco is full of reptilian diclonian shapeshifters? They can unhinge their jaw.",
            "This is correct\n\nMy dad works at Marvel and he told me Stan Lee (the creator of Venom) told him this is how it works",
            "OP didn’t draw it. This is like the 5th tome someone had posted this in a week",
            "Yeah, [here](https://www.reddit.com/r/Marvel/s/yWqUzsDKHb) you go u/vivxnstfu",
            "For real, I've been seeing this image daily for a few weeks now even if it has been explained a lot of times how it works",
            "So when he's not in venom form. Is venom lodged himself into a spot in his brain where he can hear him like a voice in the back of his mind",
            "Nope, Eddy can sort of melt in venom's body just like Venom can in Eddie's",
            "This is also what I've always imagined",
            "This is exactly what I was going to write. That’s my understanding as well, that they became one entity entirely, not just a suit over the host’s skin like Spider-Man and his suit.",
            "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^LemmeGet_acombo_7:\n\n*I’ve always just thought*\n\n*Of it happening this way*\n\n*Already lol*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
            "Explain the eating of ppl's heads",
            "Well my dad is Stan Lee and I sanctioned his abuse constantly",
            "I work at marvel and both me and Stan haven’t seen your dad before 🤷🏻‍♂️",
            "Stan Lee isn’t the creator of venom, Todd McFarlane is",
            "Well my dad works at nintendo and let me play the snes 2, but he also agrees that this is how it works",
            "Sounds like you Reddit before?",
            "But he did draw his own conclusions.",
            "That shows the exact opposite of what's in the OP...\n\nwhich, to me, makes more sense and the OP just seems to be weird for the sake of being weird.",
            "I'd say considering the Symbiote covers his body, I'd assume it hides away in the nervous system, and because it's literally in his spinal cord and every single nerve up and down Eddie's body, that explains why he can \"hear\" and feel it - the same way you can feel pain or any other experience",
            "There is an instance of this on-panel in one of Larry Hama's Venom miniseries from the 90s - Venom gets hit by a truck and is reduced to a literal puddle of goo, only to return to humanoid form seconds later.",
            "Yeah more like Sandman but obviously not Sandman.",
            "I'm sorry to hear that. May I ask if you are still in contact?",
            "Yes, I am stan lee (reddit surfing inside my grave) and i do recognize the picture as truth",
            "It’s me, Taj McFarlann, and I can confine Stan Lee is the creator.",
            "no shit!?",
            "True. But it was Todd's brother Seth, that gave him the idea though. Not Seth McFarlane, who IS Todd's brother but Todd's *other* half-brother, Seth Lee (also named Seth due to lost drunken bet with Danny Devito) who was born a con-joined twin to the already existing and much older, Stan Lee. It's complicated because it's much to do with science and biologistics (biology with transporting - finally!) and the only person who studied it is dead: Betty White, but not *the* Betty White, Betty White's sister, Betty, who was also named Betty due to a drunken bet with a time travelling Danny Devito.",
            "Because 90 symbiote did what ever they wanted. Carnage went into a pc to surf the web.",
            "Can we get his ouija number.",
            "No. That's just how the internet worked back then. You can find lots of examples of us getting pulled into our PCs.",
            "Carnage and Venom having a fight in the internet was certainly a trip."
        ]
    },
    "Spider-Man asks the Avengers to go after the Punisher [Punisher War Zone 2012 #1": {
        "title": "Spider-Man asks the Avengers to go after the Punisher [Punisher War Zone 2012 #1",
        "score": 1050,
        "url": "https://www.reddit.com/gallery/1dl5bxp",
        "content": "",
        "num_comments": 223,
        "comments": [
            "Pete making that speech w/ Natasha and Logan in the room... lol",
            "Man, this is nice to see. Obviously it didn’t go anywhere, but Cap setting everyone straight and someone like the Punisher finally getting the heat they deserve are two things I love.",
            "Shows the mental gymnastics we as readers need to take in order for all the crossovers to make sense.\n\nThere’s people like Sabertooth, Purple Man, etc - and they just decide to go after Frank?",
            "I don't know why I love seeing the Avengers just chilling. Like earth's mightiest heroes and what they do in there free time.",
            "Has there ever been a Punisher vs Captian America comic before?",
            "I just read this series on the Marvel Unlimited app because of this post. GREAT read... really loved the various interactions especially Thor and Frank's. I missed this series completely because it came out at a time when I was had just lost a job and was broke and had to stop collecting for a bit so now I have to track down the individual issues for the P.C. I have the series right before this though because I have Cole-Alves' first appearance.",
            "Thanks for posting this, caused me to track it down and read the whole miniseries. They did a good job making Frank badass without the Avengers having to job too hard (except Spider-Man). Also liked how Logan >!ended up being the one who brings him in in his own way!<",
            "What happened to Spider-man's arm?",
            "God this is awful level Tony and Thor writing, they normally wouldn’t ignore the Punisher",
            "Do they catch him?",
            "Probably why I like the Rucka run, restablishes Frank that despite the universe with aliens, bad guys, physical gods and such, go down to the deepest level with just regular people and Frank despite it all, is still one of the most dangerous guys in the room in some way.",
            "This is why I really don’t like the Avengers unless Spider-Man and Luke are on the team. They’re just cops for the most part.",
            "Seems kinda goofy to make this point with Wolverine and black widow in the room 😂",
            ">This is bush league stuff.  \nYou want to roll out on one man. One guy who doesn't even have super powers\n\n[Fast forward to 2023,](https://comicnewbies.com/wp-content/uploads/2023/02/Doctor-Strange-The-Punisher-Vol.-13-9.jpg) and Captain America, Moon Knight, Black Widow, Wolverine, and even the fuckin' Sorcerer Supreme had to discuss what to do about Frank, who had attained enough magical ninja power to execute Ares the God of War and who would have gone on a worldwide killing spree if he wasn't stopped.\n\nFrank has also been a warrior of Heaven armed with angelic laser guns, as well as an undead monstrosity powered by the Bloodstone called Franken-Castle. \n\nThe Punisher's history is goofy as shit, even when compared to other comic book characters.",
            "Man, Tony comes across like a lazy dickhead",
            "I gotta agree with some other people, as much as I agree that the punisher is a problem, but is he really the top priority?\n\nAlso, villains constantly get sent to prison and easily escape, but punisher is the one that needs to go to a special prison? Couldnt they just lock him up on solitary?",
            "Go after the Punisher? Even the Avengers hesitated for a moment (oh sure, they past it off as “he’s just one normal guy”, but they know what that one normal guy can do). They didn’t want that smoke.",
            "Punisher is a complete badass!!",
            "\"We should bring in Punisher, he is a mass murderer\" Peter said to a room that has 1 to 5 mass murders depending on how you count it",
            "my problem is stuff like this never gets followed up on because I guess the Punisher is still popular?\n\nSteve was right in Civil War and here. Peter is right. he keeps getting away and killing. so it IS their problem.\n\nso yeah sure this is beneath Thor and you wouldn't need him anyway but everyone else there including Tony should have a problem with Frank Castle the murderer.\n\nhe should be treated like all the other villains. well a lot of the villains have shown good traits and don't kill. \n\nI'd say the heroes should have taken in and put Punisher away behind bars years ago and he should stay there.",
            "I don’t know, the whole none killing rules doesn’t make sense \n\nGovernments are allowed to killed anyone but the Avengers can’t? Why? Because someone was elected they can just drop bombs on kids but a guy goes after criminals and dirty cops he’s the issue with society?",
            "Did Peter Chung get drunk and draw this?",
            "Did anything ever come of this?",
            "Speaking of the Punisher, what’s his best run? I’ve got some reading to do.",
            "This line-up is almost perfect in my opinion. Needs the Hulk, but seeing Wolverine alongside the rest is so uplifting.",
            "Pete was only so passionate about this because Punisher was on the front Page yet they still managed to slather Spider-Man on the Headline",
            "Since only Cap went, does that mean that Frank rises to the level of a Red Skull threat?",
            "tell me why i read that as \"Spider-Man punks the Avengers\" 😭😭😭",
            "I think Spidey's problem here is that he came to the Avengers team with the highest body count and complained to them that Punisher kills people. Thor has a kill count in the millions and both Widow and Logan have been professional assassins that reformed. Iron Man definitely has a human kill count in the hundreds and has killed thousands of Skrulls. Even Cap kills people. \n\nIt takes Cap reminding them of the perspective for them to realize how much of a problem the Punisher is, because he doesn't kill because he has to, or attempt to minimize casualties, or reform like they do. The Punisher is just a murderer.",
            "“Is it better if he only kills bad guys?”\n\nYes…. Like obviously yes.",
            "Wolverine has more blood on his hands than Black Widow and Punisher combined since he has been alive for such a long time and fought wars and such. Thor is probably the only one that has more bodies than Wolverine.",
            "Well punisher wouldn't be needed if most of these guys would start working on bad guys that aren't world threats",
            "FINALLY someone mentions it. \n\nImma assume punisher kicks everyone's ass or something based on the title, but dude is a criminal like moon knight and Spider-man or at the very least Captain America should acknowledge that they're criminals and stop condoning them, or just stop having them appear cause \"he only kills bad people\" is a massive copout and definitely not true, dude has definitely killed innocent people before",
            "What the genuine fuck is this artstyle",
            "This comic is such dumb fun as Frank defeats multiple Avengers lmao",
            "That’s friggin’ rich.  Wolverine IS RIGHT THERE.",
            "This big energy from Pete when he has villians like Goblin, Kingpin, and Carnage running about. Now with Punisher, it’s not good enough locking them up? \nPete def was tweaked.",
            "\"You guys don't understand. He's killing rapists, serial killers, and human traffickers. HE MUST BE STOPPED!\"",
            "Honestly, the only one who can bring him in is Cap.",
            "This artwork makes me physically ill.",
            "The latest Frank Punisher ongoing had lots of moments like this too, I know it’s a controversial run but I felt it was nice having a seemingly permanent end to Frank being the Punisher and doing something truly heroic",
            "So like...they're all killers here. \n\nThor is a war god. He has absolutely massacred entire civilizations \n\nTony drops shrapnel filled missiles on goons like he's tossing out candy at a parade \n\nCap was smashing Nazis in the head with a shield hard enough to crack concrete and just put and out welding a machine gun \n\nAnd the other two people in the room are **professional killers who've been active for more than 75 years** \n\nThis is my issue with this shifting baseline of comics morality, and why I never liked Batman stories. Criminally negligent homicide is a thing and nearly every superhero BUT Frank Castle would be charged with it daily if I was the DA",
            "The hypocrisy of Peter here is disgusting.\n\nLiterally was going to kill Kingpin if Aunt May died.",
            "“BuT PuNiSheR KiLLz PeoPLe!”\n\nSimplistic fanboy poseurs who have never read any stand alone Punisher- but haz facts to drop about his morality… Go read yer Casper and Wendy if you want but keep the sanctimonious nonsense about Frank Castle alone. Type of people who believe JJJ headlines and need to see actors faces to keep from getting confused in fight scenes.",
            "LOL, LMAO, even.\n\nI want the Watcher to show up and be like “Bro, remember the time you agreed to let the Punisher kill people because you were afraid Mary Jane would die if you were delayed?”",
            "logan even warned the punisher later",
            "They're not as trigger happy as Frank",
            "Not to mention Tony. His weapons manufacturing probably killed more people than Frank ever did.",
            "Black Widow and Wolverine at least have the excuse that a lot of their prior killings were done at the behest of shadowy black ops groups, or they might have been coerced in some manner.\n\nMoreover, both Natasha and Logan are working towards redemption now, by working with groups like the Avengers.\n\nFrank's never been close to the good path Natasha and Logan are trying to walk. He's never been a team player -- the only two notable times I can think of is (1) when he joined Cap's side during the Civil War (and he got kicked off the team because he shot and killed two unarmed criminals) and (2) when he joined Hydra during Secret Empire.",
            "Pete making that speech while constantly having \"buddy comic\" nonsense with Deadpool.",
            "Yea",
            "and Steve is about the only one to do anything. the moment in Civil War where Steven gets pissed about the Punisher is real.\n\nAnd Peter is absolutely right.",
            "To be fair, Wolverine's daily agenda probably looks something like:\n\n7:00--wake up\n\n7:05--give Jubilee advice\n\n7:10--give Shadowcat advice\n\n7:30--be haunted by past\n\n8:00--breakfast\n\n9:00--go to space with X-Men\n\n10:00--team up with Doctor Strange\n\n10:30--team up with Nightcrawler\n\n11:00--team up with Spider-Man\n\n12:00--go to Genosha with X-Men\n\n1:00--tell backstory to nobody\n\n2:00--be incinerated by atomic bomb, grow back from a pube\n\n3:00--Punisher team-up\n\n5:00--Kill Sabretooth?\n\n5:30--cameo in book that Marvel's trying to save from cancellation (goddamn SuperPro, he sucks)\n\n6:00--stand in the rain and scream\n\n7:00--have beer with Punisher\n\n7:05--fight Punisher\n\n7:10--get run over by a steamroller driven by the Punisher\n\n8:00--whiskey and bed",
            "I wonder how Wolverine would react if somebody showed up demanding that they take down sabertooth.",
            "which is why nobody took spidey serious at first",
            "Yeah this always seemed dumb to me. Do the Avengers condone Frank's actions? No, I'm sure they don't. But there's such a thing as prioritization. He's certainly not a *worse* problem than all the *other* mass-murdering villains running around.",
            "Yeah seriously. Frank is SO FAR down the list of people the Avengers should even blink at that it's not even funny.\n\nNot condoning what he does, but Frank goes after gangsters, heinous criminals and the like. That sounds like the responsibility of the FBI ffs.",
            "Okay there's some logic. I haven't read this specific comic, but there is somethings you're missing: Peter is always flagged in the media as a vigilante at best or an outright criminal at worst.\n\nThere is a power in public perception. He knows he is not, but he also knows that \"innocent* lives may be lost because of a lack of faith in superheroes. \n\nPunisher isn't just hurting criminals, he is hurting the perception of heroes and thus endangering many civilians who won't trust the heroes when they need to.\n\nThink of it this way: cops in the USA. The vast majority are good people, but there are some total douches who take the law in to their own hands. Because of this people are hesitant to call cops even when doing so can save lives. Not all cops are bad, but the good ones who let bad cops keep going, well those are bad cops too.\n\nSpider-Man is the cop who would call out other cops for police brutality. Punisher is the cop who would kill instead of arrest, and the rest of the avengers outside of Steve are the cops who will sit back and let the bad cop kill someone and cover it up.",
            "That scene in Age of Ultron (the party scene) is so satisfying to watch. Just a couple of superhero friends, chilling, having fun.",
            "Those are some of my favorite X-men comics, too. When they're just hanging out playing basketball or whatever.",
            "I’d love it if they’d try doing a slice of life series for the avengers or x-men.",
            "During Civil War 1 he joins Caps side and kills a couple d-list villains and Cap BEATS HIM BLOODY for it and disowns him completely. Punisher doesn’t fight back at all because it’s Cap.",
            "yes, cap is Frank's favorite hero",
            "I think Frank and Cap fought back during Punisher's early publication years.",
            "Technically the \"Punisher Kills Marvel Universe\", What If, would probably count.",
            "In the old Ultimate Avengers (the one with the Punisher on the cover), Steve dupes the Punisher into capture while disguised as a Russian mobster or something. All Frank knows is he's unexpectedly getting his ass beat and smashed through a car window.\n\nEdit: I actually loved that depiction of Captain American / Steve Rogers. He was more hardcore and realistically modern in his tactics, but still very recognizable.",
            "Spidey and Iron-man definitely were humbled the most in this one.",
            "Not the point.",
            "I think Punisher jumped him and stole his webshooter. That was Peter's last straw. He murdered a bunch of people using a webshooter.",
            "I mean Tony is a big picture guy, he's a genius who learns to be a better person, maybe he just hasn't gotten around to this part of morality. Thor is also a mass murderer, his body count is probably higher than everyone in the room put together.",
            "Tony puts him in a futuristic prison, didn't least long\n\n\nThey should have thrown him in the negative zone by this point",
            "the avengers have never really been cops though\n\nand honestly I don't think Spider-Man and Luke belong in the avengers, Peter works better solo, luke has the heroes for hire. the avengers never really needed them and should focus on bigger problems",
            "What the fuck?",
            "WHen has punisher prioritized, outside of his rogues gallery and creeps, he prioritizes low level crooks over serial killers like Zodiac",
            "That’s exactly the problem. The villains get sent to jail. Heroes turn a blind eye to Frank and he’s been doing this forever completely unchecked. Cops can’t take him. Villains can’t take him. Heroes let him do his thing. Even worse, he does it right under their noses in NYC and has been doing so for a loooong time just because they turn a blind eye. They need a better answer to him.\n\nOnly thing I don’t get is Spidey going to them for help. Ask them to construct the prison, sure. But Spidey could handle Frank himself and show up here with him webbed up. Frank is definitely a street level issue, so no need to go to Thor for him when Spidey himself is already overkill. I think Spidey just needs a better answer to incarceration, but I feel like a genius like him could figure that out too.",
            "They literally spend the next four issues hunting him down and locking him up. But yes, Punisher being a popular character means he will always have ongoing stories.",
            "I mean, Black Widow not having a problem is reasonable, she was an assassin and government black ops. But, other than her, no one should turn a blind eye to it.",
            "> I don’t know, the whole none killing rules doesn’t make sense\n\nI mean, this is comics.  Thanks to 60+ years of continuity, nothing makes sense.\n\nThe Avengers used to have a fairly strict no killing code.  Hawkeye famously divorced his wife for 'letting' a villain die.  The Avengers had a major schism when half the team decided to 'revenge kill' the Supreme Intelligence for killing billions.\n\nOver the years and as media in general has evolved, this stance has evolved.  Some of it in ways that make sense -- if Captain America incidentally kills a terrorist when stopping them or if Thor kills the Sentry as the only way to stop him when he's out of control, they don't sweat it too much.\n\nBut you don't seem them planning to murder people in groups, and killing is usually either a last resort or unavoidable.    (Though this isn't always consistent, for example certain writers like to make Hawkeye try to kill Norman Osborn.  Or have him kill Bruce Banner.)\n\nBut overall, the Avengers are either private citizens, or government adjacent.  As you mention elected officials can choose to bomb people -- the Government has a monopoly on force.  They decide when it's applicable or not, within the guidelines of our laws (at least optimally).\n\nWhat the Punisher does is straight out mass murder.  He doesn't try to arrest criminals, he sets out to kill them.  He ambushes them, tortures them, maims them... murder is the main course.  Spidey is basically right, he is a mass murderer and it makes sense the the Avengers would try to catch him if the circumstances were right.",
            "It's not about no-killing rules. It's about the Punisher having an always-kill rule.",
            "It’s Carmine di Giadomenico and it’s normally very well done. Especially his work on the flash.  This must be older. His [faces](https://freshcomics.s3.amazonaws.com/issue_covers/JUL227129.jpg) are much better",
            "The dialogue was entertaining, the art was something else.",
            "Punisher Max is fucking amazing. Take it from the top, and definitely don’t stop until you get to the Bullseye arc (IMO that’s the best). It’s not super long.",
            "Rucka’s. Nothing compares to this run, not even Ennis’. It shows a very interesting picture of Frank, and the first few chapters are less about him and about the effect he has on the world around him, almost like more of a force of nature than a man.",
            "Looks like watercolor. I imagine it's digital, or art marker.",
            "It's not about the fact that Punisher can escape for prison, it's about the fact that putting him in one just makes it easier for him to find targets to kill.",
            "So you think cartel members are redeemable?",
            "Doesn't Logan hate Frank though?\n\nLike why would he warn him about it?",
            "Nat and Logan could retire and live happily if 'the mission' ended and no one would bother them. \n\nFrank would keep killing. It's all he has now. I don't think he knows how to stop.",
            "Not even close.",
            "To be fair, there's definitely gomna be some overlap there. Frank's almost certainly used weapons manufactured by Stark to kill people.",
            "The avengers kill people in general",
            "Also Red Hulk's Thunderbolts but it did end with him trying to kill all of em",
            ">And Peter is absolutely right.\n\nHe usually is when he has a chance to make a speech like this (almost never in his own book). \n\nPeter might hate himself, but I like when he gets on his high horse about right and wrong. He holds himself to a high standard, it's nice to see him hold other heroes to that too.",
            "Yeah, Cap & Spider-Man is always an awesome duo. Both hold themselves to a higher moral standard than almost anyone, but both also doubt themselves a lot (especially Steve, because of the whole man out of time thing). So whenever they're together & you see it click like this that they're not alone & they get that confidence boost, it's awesome.",
            ">the moment in Civil War where Steven gets pissed about the Punisher is real\n\n[promptly makes a deal with the Kingpin]",
            "Not enough being haunted by his past in there.",
            "Needs more fantasizing about Jean but otherwise spot on",
            "This is great hahaha",
            "He'd probably say something like \"Don't worry about it bub, I'll take care of it. Victor's my problem'' and than Iron Fist would say \"He was my problem first\" and Wolverine will say \"snikt yeah, but no one remembers that bub\". \n\nAnyway, the point is, he'd agree Victor needs to be dealt with but he'd insist on doing it himself.",
            "Cap did. He's the only one that doesn't go for the door on the second page.",
            "Sure, but the Avengers weren't chasing the *other* mass-murdering villains at that exact moment either. \n\nLooks like they just had a round table discussion and was about to call it a day. Tony was talking like he was headed to a play or some party.",
            "Thing is, Frank is the World’s most successful mass-murder. Sabertooth isn’t always killing, sometimes he’s either a henchman waiting to kill someone or he’s planning how to ruin Logan’s birthday.\n\nCarnage is locked up every chance they can, obviously he gets out but it’s almost always an entire event.",
            "Problem with that though is that in the above panels they're just sitting around the table shooting the shit. Clearly those other mass murderers aren't currently a problem. But when told about a mass murderer that *is* currently causing problems, everyone except Steve goes \"Hah, anyway\".\n\nSo there's not really any prioritization going on here. The vibe is that the Avenger's feel it's a non-issue until Steve says otherwise.",
            "Is there a good team to run around doing take-downs on mid-level villains? I mean given how common destroy the universe stuff is in the Marvel universe, it makes sense to have the Avengers focused on cosmic threats, but at the same time it makes sense for someone to take care of random super-powered killers who cannot be realistically controlled by the police but who aren't capable of destroying a country.",
            "yet again Peter is right if he keeps going free and killing it IS their problem. sure there's other bad villains out there but Peter and Steve can't be the only ones saying this maniac has to be stopped.\n\nyeah I get it's above Thor but everyone else should have a problem here except I guess Wolverine but even still.",
            "Which is why they just send one person",
            "like the Punisher or other anti heroes actually prioritize, Punisher would go after serial killers like Zodiac or scum like Jeri Hogarth instead of theives and random low life mobsters the other street level heroes already take care of , if he actually prioritized",
            "But they also team up with Punisher all the time and let him go when they don't have to. They might not go out of their way to arrest Purple man or something, but they also don't implicitly endorse him the way they do with Frank.",
            "This is addressed.  The cops cant/dont want to stop him.  The Justice Dept just put him somewhere that he can keep doing it.",
            "This is why 616 needs a reset IMO. Just full of bloat and inconsistencies. Peter has been down on his luck for decades - and seemingly grows very little. This makes no sense.",
            "Not only that, Punisher literally uses Spidey's stolen webshooter to help murder a bunch of people right before this.",
            "Right because Peter not killing his villains hasn't lead to mass death.\n\nRemember when Carnage broke out and slaughtered every man, women and child in a town?",
            "Them attempting to pick up Mjolnir is one of the best scenes in the MCU",
            "During the Krakoa era, there should have been a monthly that was just mutants hanging out, so that we could have seen more old friends reconnecting, and new friendships blossoming.",
            "Does ones are always cool too.",
            "and that's how it should be but there's no real follow up.\n\nthere is no way Steve would ever put up with what Punisher did and him beating his ass was the right response.\n\ngunning down villains/crooks that came unarmed to surrender or help is not what they stand for.",
            "Correct, but a little simplistic.\n\nCap is more than Frank's favorite hero. He is his ideal.  Frank knows he is fucked up, but before he got fucked up, he went to war and tried to do the right thing.  Fought for his country, fought for his family.  Then everything went sideways.\n\nDeep deep down, Frank still loves truth, justice, and the American Way, he just knows he can't go down that road anymore.  But Cap does, despite arguably losing as much as Frank did.\n\nCap isnt just Frank's favorite hero, he is Frank if he werent so fucked in the head.",
            "Captain America #241, where Frank respects Cap, but has no problem fighting him, either.\n\nThat Civil War recon about his feelings on Cap has always rubbed me the wrong way.",
            "> Thor is also a mass murderer\n\nA almost genocidal one, at that. And with centuries of \"adventuring\" and the like.",
            "I hear sending troublemakers to other planets might be a good idea",
            "Yeah, Frank rarely went after people of actual importance aside from maybe a mob boss. He stayed in his own lane most of the time because he didn't want to die, which makes him something of a hypocrite in some ways.",
            "Wolverine who has almost certainly killed more people than Punisher would care? The only difference between them is Wolverine doesn't NEED to kill his enemies. If he is allowed he certainly has no problem doing so. \n\n\nWhy would Thor have a problem with it? Thor isn't opposed to killing inherently? He is a warrior. Totally tracks that he doesn't really care about Punisher as long as Punisher is waging his war on the right people.\n\n\nTony? A chance he cares but Tony isn't a boy scout is often morally ambiguous to start with. Again like Thor totally tracks that he is like well its not great but as long as he is killing bad guys i got better shit to do. \n\n\nSteve is the only one in this scene that would inherently care.",
            "Oh no the rapist cannibal was killed.\n\nThe guy pimping out his 14 year old daughter was murdered.\n\nDo you go to rape victims and tell them that their rapists shouldn't be punished they should be reformed?\n\nI bet you got upset when George Floyd's killer got stabbed huh",
            "yeah I looked it up too and was shocked. I normally really like Carmine's sutff.  This here is just terrible.",
            "Not seeing it on Unlimited. Phooey.",
            "Excellent, much appreciated. I’ve been reading some of the bigger events and all the tie-ins and I’m needing something more down to Earth.",
            "Fair, but putting Kingpin in prison doesn’t stop him killing, nor the others. For Frank it’s just putting the fox in the hen house. Unless he’s in his own prison, alone, he’s gonna do work. If they are out to get ya you’ll more than likely end up got.",
            "Professional courtesy. Logan knows that he's likely to be in the same position one day. \n\nThe only real difference between the two is that Logan is willing to work with other people and not kill if he's asked. He has just as much blood on his hands as Frank does.",
            "Their relationship has never been consistent, and always always depends on the writer and whose title they appear in.\n\nIt's never made sense for them to hate each other, which is why I can't stand when writers play favorites and have Logan loathe Frank and call him a \"murderous psycho,\" or for Frank to hate him and think he's a freak. They wouldn't be best pals, but I think two former military guys who've seen the horror of war, lost their loved ones, and will kill when needed compared to (in their view) the \"softer\" heroes would at the very least respect each other.\n\nThe story OP posted when Logan later goes to give Frank a heads up that the Avengers were coming is to me the right way to have them interact. Logan knows why Frank does what he does, even somewhat relates to it, but is also trying to be a team player and a better man who goes by the book, so he compromises.",
            "All Logan retirement stories end with him still killing people, they’re trapped in the same cycle imo, just surrounded by more people than frank",
            "Frank is black and white, they both at least have moral grey areas.",
            "There *was* that time he stole a War Machine suit, so you're not wrong.",
            "Hadn't read that run, but it seems fitting lol.",
            "I initially bristled at Frank being called out when reading this, but when you think of all the horrific crap Spidey's gallery of villains have put him through, that's a lot of restraint not to \"accidentally\" web swing one into a piece of steel too hard. And then the Punisher is out there just shooting people he has a problem with in the head.",
            "He was only pissed cause he thought Frank used his webshooters for a murder when in actuality it was another bad guy Frank was dealing with. Spider-man wasn't even correct about this situation.",
            "That's done in bed",
            "That's his secret, FartForce5... He's always haunted by his past.",
            "That's probably why he's standing in the rain and screaming, TBH.",
            "Fantasizing about redheads in general.",
            "“No one reads your comics anyways.”",
            "My only gripe is he needed Tony and Thor to help. If they weren't jobbing Spider-Man and Black Widow would have mopped the floor with Frank easy peasy. Throw in Cap and I think Frank would have surrendered peacefully. Wolverine would just be overkill. It should not take all those dudes to take down Frank. Honestly, Wolverine and Spidey could do it solo if they really wanted.",
            "But carnage will murder an entire town before people even know he's out doing stuff. I'm pretty sure Magneto has murdered an entire country before. Etc etc.\n\nFrank might go on a killing spree and take down say a hundred guys in a given organization. That's not even close to what the other guys do when they go on sprees.",
            "I wouldn't say Sabertooth isn't always killing he fully enjoys murdering people just to murder people. An has been doing it for a very long time.",
            "I think it's reasonable to presume that they aren't just kicking it because they've finally rid the world of crime, but that they, as functioning people, understand they do have limitations and need down time even if there's more work to do, otherwise they'll snap and go crazy like the plutonian\n\nThis is pretty interesting, but well trod superhero ground.",
            "Defenders would be good with that, as well as like half the X-Men team, and honestly it would be a good training ground for the young avengers. Yeah there's plenty of options.",
            "I feel like the words you read were \"what Frank Castle is doing is fine and the avengers should let it go\"\n\nBut that is not what I wrote",
            "> But they also team up with Punisher all the time and let him go when they don't have to.\n\nI know, but we have to chalk that up to \"it's comics,\" because Peter clearly isn't here saying \"We have to stop teaming up with Punisher and take him into custody next time we see him,\" so in this comic, in this moment, that's not a thing that's relevant.\n\nEven though it *is*, which is annoying, but... comics. What Peter's saying is that they need to go out and hunt him down, and that's what I take issue with-- not the idea that they shouldn't work with him (which is a separate conversation altogether)",
            "It's one of the things that inevitably happens when you write stories that deliberately don't have an end.\n\nMarvel has rebooted *less* than DC, but both companies have to do it every now and then for that reason.",
            "Oh shit!  I'm super interested.\n\nIf you asked me to combine two humans to create the one which could raise Mjolnir, Castle and Rogers would be the two I'd combine.\n\nIf you want to be worthy to be king of the Nordics, combining the honour of Cap with the vicious acceptance of reality of Punisher is the exact recipe.\n\nHow did it turn out?  I'm assuming Marvel chickened out?",
            "Oh man, an X-Men Team Up of mutants just chilling would have been pretty great.",
            "The scenes at the Green Lagoon with people just chilling and Fred serving up drinks, being happy, are some of my favorite. I put those quiet moments on the same level as the bigger moments, like Polaris saying “To me, my Brood!”",
            "Did you read Civil War 1? Steve respects the hell out of The Punisher because HE was the only one who didn't lose sight of the bigger picture in Civil War. Captain God Damn America was willing to work with murdering criminals just because they would be on his side and not Tony's.\n\nPunisher gunning them down and not fighting back against Cap showed Cap that HE was in the wrong because someone like Frank, while a complete psychopath, has a code he follows and that means taking out the bad guys and never bending your morals for evil PLUS not fighting against the good guys.\n\nFrank is insane but he is order. He keeps order and has strong morals although his methods are extreme he showed Cap that Cap was bending his morals here. In my opinion it is literally the defining moment of Civil War because it's what led Cap into realizing he needed to surrender because he had lost the plot and had friend fighting friend side by side with psychotic murders.",
            "There was a What If? story where Frank became Captain America I think.",
            "Make the argument that Cap lost more than Punisher, because I’m certainly not seeing it.\n\nEdit: So I don't have to reply with the same thing, my reasoning for Frank having lost more is this: Cap knows that all the people he lost got to live full lives, as opposed to Frank, whose family’s life was cut short, violently, right in front of him. He had to watch, helpless to do anything. Also, in Cap’s case he ended up frozen while performing a mission, something with inherent risk. Punisher was at the park. I understand and respect the opinion of those who disagree, but I really think Frank got it much worse.",
            "I can’t believe I’m saying this, but I think Captain Hydra fixed that. Frank likely lost a lot of respect for Cap after Secret Empire. At least that’s the impression I got In Frank’s talk with Freyja.",
            "you say that like a planet punisher story wouldn't be awesome",
            "He’s definitely attacked and killed super powered villains before. I wouldn’t call that hypocritical.\n\nYou just have to pick and choose your battles to win the war. What is he going to do against Doom? Let the other super powered heroes deal with the ones beyond him.\n\nDude killed the God of War recently when he came into his own abilities. He definitely does whatever is within his power.",
            "He doesnt prioritize them but the super villains are a little more difficult to take out.",
            "Unlimited is lame and doesn’t carry most of the \"grown-up\" shit.",
            "maybe even more, logan once killed an entire town with an axe during one of his berserker rages",
            "Logan has lived way longer so I feel like he has way more tbh",
            "Not saying it's common or that he would still do it, but Frank has used non-lethal rounds in older crossovers with Spidey",
            "Like most of the people Logan kills are undead hand ninja's and genocidal anti-mutant bigots.",
            ">He has just as much blood on his hands as Frank does.\n\nWay more. \n\nFrank is what...40? \n\nCompare that to wolverine's ever extending age from 200 to 400 to whatever he is this month? \n\nBro probably topped Castle's numbers before Frank was a glint in his daddy's eye.",
            "My interpretation is that Logan wants to stop but others try to make him continue to be a killer, like all that thing that Sabertooth does on his birthday, and he is scared that all the people that he loves die because of that reason but Frank wants to continue to be the Punisher because his family is dead and no matter how many criminals he kills they are not going to return.",
            "It's why I added that \"no one would bother them.\"\n\nEvery time Logan quits, someone pulls him back in usually by killing someone he loves. if he is left perfectly alone, say, world peace and everything comes up roses (ahaha...no), He'd quite happily retire and hang about with his 3 kids.\n\nNat is the same, she'd more than be happy to leave it all behind and just be a semi-normal person.\n\nFrank CAN'T do this, he'd find a war, and failing that, make one himself.",
            "And we know that Peter deliberately holds back. Every time he throws a punch at someone who's not super resilient, he's consciously choosing not to tear part of their body off. \n\nI think another factor is that Spider-Man has seen people he's fought be redeemed. Sure, the big villains mostly end up backsliding to status quo, but there are smaller time criminals out there that Spidey has helped get back on the right path.",
            "He was literally going to kill KingPin if Aunt May died.",
            "Wolverine only fantasizes about jean two times a day. Morning time and night time.",
            "Spidey might be able to do is solo honestly. He's insanely powerful. As good as Punisher is, Spider Man is just hitting at such an extreme other level",
            "Frank is literally killing people in their back yard. He’s a serial killer that occasionally *works with them,* and the fact that he outclasses traditional law enforcement means that he’s at the level of someone like Carnage. It’s an image problem. Carnage and Magneto and so on aren’t out there *every day* doing these sprees. Frank is, and he was going unchecked.",
            "But are they doing it regularly day by day? And are they being ignored?",
            "I'd bet that thousands of people died during Hydra's attempt to take over the world during Fear Itself, which would make Doc Ock partially responsible, in addition to Red Skull of course. Go after either of them instead of Frank lol",
            "Ah, I think we might mean different things when it comes to prioritization. I've got no issue with them taking a break, or for Frank not appearing on their radar given that they typically deal with more world-threatening events. That type of prioritization is fine and I'm not giving them shit for that.\n\nI more so mean the kind of prioritization that leads them to just blow Pete off when he tells them that Frank is an issue that needs to be dealt with. Were it not for Steve speaking up about it and giving a needed ego check, Tony would have had them do nothing when they're clearly capable of helping once it was brought to their attention. If they didn't help, they *would* be condoning the Punisher, as Steve himself says.",
            "> Marvel has rebooted less than DC, \n\nOfficially, Marvel hasn't ever been rebooted. Sometimes writers ignore past comics, or do retells that change stablished story... but those changes aren't an actual reboot like DC, in which everything change.\n\nSecret wars (2015) doesn't really count as a reboot, as the universe was recreated as it was.",
            "I'm referring to the scene in Age of Ultron\n\nhttps://youtu.be/o3bhQwY0KCY",
            "I wouldn’t say Punisher has a “vicious acceptance of reality” more like a vicious distortion of reality, placing him well inside the realm of mental illness. Not blaming him for his origin story, just gotta say strong grip on reality is really not what he’s known for at all",
            "Lol\n\n\nLmao even\n\n\nLook at this clown. Punisher bad, Punisher bad person.\n\n\nThat's it, end of story, that's the whole point of the character.",
            "Frank lost his family.  Cap lost his family and everything he was comfortable with.  \n\nYou seen Shawshank Redemption?  Know what Brooks and Redd were talking about at the end? How everything had gotten *so fast*?  At least they knew time was passing, Cap woke up and it was suddenly decades later.",
            "There was a time when Cap didn't know that everyone had full lives.  But I see your point.",
            "He lost pretty much everyone he knew when he got shot forward 70 or so years",
            "Frank lost his family, Cap lost his world. Every person, place and thing he gave his all to defend, he abruptly woke up to being turned into something else or gone completely",
            "If Deadpool can still hate Cap over Secret Empire then I'm sure Frank could too.",
            "Holy shit it actually would be amazing",
            "Like when he took out Stilt Man with a bazooka?",
            "Logan has killed all of his biological children up until Dakken. Not sure if he killed Dakken or not at this point but Id say that's pretty crazy.",
            "He's also just been killing for longer.",
            "I think this is an interesting conversation. It's about perception, really. Logan is a team player. If you tell him not to kill, he might listen. He's got friends and family in the Avengers and X-Men.\n\nWhereas Frank is a loner whose whole thing is his personal vendetta against criminals. You can get him not to kill, but he's not exactly the type of guy you expect to be a team player.\n\nHe and Logan are both killers, but Frank's PR is so much worse than Logan's. You can talk to Logan, but you can't really talk to Frank. He's a terse, humorless and unrelatable guy. Everything with him is about the mission and there's no room for anything else.\n\nIf Frank wasn't such a humorless dick to everyone, I have a feeling people would be giving him a lot more leeway like they do with Logan.",
            "He's also murdered his biological father and potentially hundreds of enemy combatants in the multiple wars he was a part of. Not to mention whoever he might have killed under the employ of the US and Canadian governments as part of black ops and rivals who thought it would be a good idea to challenge him.\n\nBut that's not really the issue. I think the main driving factor is that Logan sees himself as a feral animal and he definitely thinks his family does as well and is just waiting for them to get sick of him and want to put him down.",
            "I mean, yes, but like time travel and magic and many *many* divine and cosmic entities exist in that universe. *the infinity stones* that can bend reality itself to one’s will exist in that universe. There’s many ways that Frank could theoretically get his family back IF HE TRIED ANY OF THOSE ROUTES. But killing criminals definitely isn’t one of those ways that will work, it just leads to more blood on his hands and a mountain of corpses.",
            "Spidey talking Rhino down and Rhino just breaking down is a Spidey moment that lives rent free in my head.",
            "I remember Sandman reforming in the Spectacular Spider-Man show and thought to myself \"THIS is why Spider-Man holds back\"",
            "Oh, he's come close for sure. I remember thinking Spider-Man might actually kill Kraven when he drug himself out of a grave and finds him in Kraven's Last Hunt. He did jab a knife through his hand if I recall.",
            "Sorry, I know it was kinda hard because of my grammar but when I said Spidey and Wolverine could solo him I meant they could each solo him individually easily.",
            "No one's ignoring Frank Castle, but seeking him out and hunting him down is something different, and there's worse people to seek out and hunt down",
            "When do they ever not go after people like Doc Oct or Red Skull tho? 🧐",
            "But look at it this way. While they're hunting down Frank, somebody-- maybe Carnage-- is left unchecked, mass murdering a village.\n\nAre they now condoning Carnage's rampage, because they didn't go stop him? Because they chose to use that time stopping Frank instead of Carnage? Of course not.\n\nThey can't take out *every* bad actor in the 616. They have to pick and choose which ones are worth their time. Frank's actions aren't good, and they aren't condoned, but they aren't at the top of the list. And each \"working hour\" the avengers put in towards stopping Frank is a \"working hour\" they're not putting in towards stopping someone else.\n\nNow, if Frank were murdering someone in front of them? Yes, they should stop that-- *and they do*. (In fact it's one of the most common cop-outs for why Frank doesn't just kill [notable villain]. He comes face to face with Kingpin, and oh dang the avengers show up and tell him he can't kill kingpin. He comes face to face with Zemo, and oh dang the avengers show up and so on and so forth)\n\nBut actually spending the time to seek out frank, track him down, and find a super-duper amped-up holding facility for him... that's time that could be better spent doing that same thing but for the worse villains.",
            "See my edit, but I do disagree. Cap got frozen on a mission, something with inherent risk. Steve didn't see his loved ones violently murdered, he knows they went on to live full lives. Compared to Frank, who had to see his loved ones gunned down right in front of him, at a park, helpless to do anything.",
            "I feel like knowing those people got to live full lives makes it a much less significant loss than Frank’s. His family’s life was cut short. Also, in Cap’s case he ended up frozen while performing a mission, something with inherent risk. Punisher was at the park.",
            "See my edit. But I disagree. I'm not saying what happened to Cap wasn't horrible. But he knows the people he cared about ended up living full lives. And he got frozen on a mission, something with inherent risk. Compared to Frank, who had to watch his loved one's lives cut short, violently, helpless to do anything, at a park. Seeing your child torn to shreds. It's unthinkable.",
            "Think he drowned him in a puddle the second time he died. He probably killed him the first time too but I never read origins or whenever it happened. Sabertooth killed him most recently",
            "He killed Daken a whileeee ago",
            "TL;DR: Logan is neurotypical while Frank has autism and his special interest is vengeance.",
            "Also Punisher often tortures people and is in the media so it really plays a part too",
            "You don’t really “murder” enemy combatants in a war. \n\nProbably a minor point in relation to the current topic, but I think it’s worth noting.",
            "When was this?",
            "Same deal with Morbius.",
            " \nNo. That’s exactly what they did. Spider-Man brought up bringing in a world renown mass murderer and Tony is \"… so anyways\".\n\nYou’re not making a point. Sure there are others they could try and hunt down, but that doesn’t mean Frank is any less dangerous. This man has enough weapons to fund an actual army. He has enough kills to rival wars and plagues. Nick Fury has Frank as one of his contingencies to if he ever actually wanted to kill Doctor Doom. Frank was even one of his choices to succeed Nick in being The Man On The Wall.\n\nAnd again. Are the others committing mass murder every day? Are the others either not contained, reformed or in hiding?",
            "That circles back to the problem with them even considering putting The Punisher on their radar. The Avengers are for big earth threatening threats, or at least would be conquerors that aren't intergalactic threats.\n\nSending them after Frank is misusing them, regardless of the bad writing that made Cap say what he said.\n\nI'm sure Shield had a few dozen big names that deserved the Avengers time.",
            "No one is leaving Carnage unchecked. There's literally hundreds of heroes out there.",
            "Oh I had assumed he had come back at some point but didnt know Sabertooth did him. It's a shame because I actually did like Dakken. His pheromone thing I always thought was super interesting and a nice twist on the Wolverine formula.",
            "Yeah, I think in Uncanny Xforce. Daken had planned to drown his father, and ended up the one going belly up",
            "Hell it’ll be 20 years in a couple years that happened",
            "Frank is the Batman who kills. Heard loud and clear.",
            "Fair point. My replies are sloppy today, thank you.\n\nAs imprecise as I was, what I mean is that it's disingenuous to say that all he's ever killed are bigots and undead Hand ninjas. Logan has 100% killed regular people. But I also don't think it really matters aside from informing his views on killing.\n\nHonestly, and this is open to interpretation, I don't think Logan has outright murdered many people. Killed, yes. But murdered is another story. I can recall countless times he's tried to avoid even fighting and only killed someone when pushed into it.\n\nAnd then you have Frank who will 100% ambush someone and shoot them in the head if it gives him a tactical advantage.",
            "After the death of Rhinos wife, he was grieving and lashing out. Spider-Man got him to calm down and Spider-Man comforted him. Not sure the issue, I’ve only seen the panels.",
            "He remorbed!",
            "> You’re not making a point.\n\nYou might disagree with my point, but if you're just going to pretend it's not there because you don't like it, we have nothing left to discuss. Have a nice weekend.",
            "Well, it doesn't look like there was any world shattering events at that particular moment. Looks like Peter came to them on their day off and was like hey this guy is a serious problem with everyone in this room we could do a half day trip and be done by dinner time.",
            "Well, there is a Batman who kills and he's basically Frank with a cowl. So...",
            "I am vaguely aware of Thomas Wayne as Batman, yes. And also Batman in whichever universe became Limbo."
        ]
    },
    "What do my favourite characters say about me?": {
        "title": "What do my favourite characters say about me?",
        "score": 17,
        "url": "https://www.reddit.com/gallery/1dltio0",
        "content": "",
        "num_comments": 10,
        "comments": [
            "That you join in on bad trends on Reddit",
            "Thor - You loved the movies and were happy that they made him a better character as a result.\n\nSentry - You chose this one to be different, didn't you?\n\nSpider-Man - This is the correct choice, well done.\n\nBlack Cat - WE GET IT YOU'RE HORNY (we all are too it's okay!)",
            " It’s clear that you really enjoy characters with redemption arch’s as one of their defining arch’s. Thor being casted out and becoming worthy again, sentry trying to do good as a hero and recover from his past traumas, Spider-Man with him letting the thief go who proceeded to kill uncle Ben (and I mean who doesn’t like Him), and black cat who’s almost always “trying” to be more of a hero. Like in Dan Slots Big time. These are all hero’s who have done bad or allowed bad to happen. But ultimately the rise above it and serve the greater good rather then letting their past define them. I think it shows that you may have some what of a guilty conscience and that you’re always looking to do better or be better. It could be that you hurt someone in a way you didn’t mean to, or maybe you used to be highschool flash Thompson and now you’re trying to be agent venom. Either way I believe this shows you’re willing to grow and that you’re over all a person who seeks to earn forgiveness and trust.",
            "You like the king of hammers,\nSuper crack,\nYou support the wall crawling menace,\nNah id unzip",
            "You're bi (you like big men, and hot women)",
            "You like characters that have daddy issues (or uncle issues).",
            "Nothing at all. Can we please stop now?",
            "You like powerful superheroes and also are a big fan of Spider-Man.\n\nEdit: You have also a huge crush on Black Cat.",
            "I actually intend to use the info I'm probably able to get here to incorporate the data into the book I'm writing :D",
            "Wow, that is really interesting.\n\n>I think it shows that you may have some what of a guilty conscience and that you’re always looking to do better or be better. It could be that you hurt someone in a way you didn’t mean to.\n\nProbably this one :)\n\nThank you, I actually take this/these analogies to heart :)"
        ]
    }
}