{
    "Meirl": {
        "title": "Meirl",
        "score": 6541,
        "url": "https://i.redd.it/9h3oxvbdv08d1.jpeg",
        "content": "",
        "num_comments": 66,
        "comments": [
            "“Grandpa, what point in time during your years on this earth would you say lead to the downfall of human civilization?”\n\n\\*sighs heavily, tapping pipe on mantel\\*",
            "\"Oh mom, I don't WANT to visit grandpa! He always tells cringe stories about the past and smells like birthday cake!\"",
            "One trick is to tell 'em stories that don't go anywhere, like the time I caught the ferry over to Shelbyville. I needed a new heel for my shoe, so, I decided to go to Morganville, which is what they called Shelbyville in those days. So I tied an onion to my belt, which was the style at the time. Now, to take the ferry cost a nickel, and in those days, nickels had pictures of bumblebees on 'em. \"Give me five bees for a quarter,\" you'd say. Now, where were we? Oh yeah, the important thing was I had an onion on my belt, which was the style at the time. They didn't have white onions because of the war. The only thing you could get was those big yellow ones..",
            "grandma keeps forgetting she's already told us this story a thousand times",
            "What kind of sorcery is this? Where do I get one?? I like my Cresco, but a pipe is classy.",
            "r/DidntKnowIWantedThat",
            "Vipe",
            "Ceci n'est pas une pipe",
            "I don't think you should smoke crack around kids, sir.",
            "obligatory \"Now where could my pipe be?\"",
            "Bruh!!! Me want one!",
            "Grandpa, when did it stop being socially acceptable to smoke around children?",
            "Behold, the Fanciest Penjamin™",
            "*\"Y'see kids... It all started with an overly-curious child, some neglectful parenting, and a gorilla named Harambe...\"*",
            "Omg, we’re getting one of these for my brother in law when he finds out he’s gonna be a grandpa some day…",
            "Got one right here!",
            "Popeye the inhaler man.",
            "Had a regular  vape that was a pipe",
            "Can I actually buy this??",
            "Those pipes are sick af, cheap and they kick like a mule. Highly recommend",
            "I actually like that lol if get it if I smoked carts",
            "Suddenly Grandpa is Your Highness.",
            "red airpod?",
            "i want that now 🗿",
            "Then it explodes because you forgot to charge it once and the replacement battery you got was wired behind a dollar general.",
            "As bonus to a cool story you give your grandkids a cancer!",
            "You assume the ecig boy will have sex, his kid will have sex, and he lives long enough for a grandchild while smoking ecigs everyday? You seem like a betting person",
            "Here Kings 👑 , [The Sauce](https://marijuanapackaging.com/products/variable-voltage-old-mans-pipe-shaped-cartridge-battery-900mah-wood-grain-510-thread)",
            "You'd be lucky to be able to meet your grandkids before you die of lung cancer lol",
            "cringe stories from grandpa hahaha",
            "Is that a vape? Jesus that's gay.",
            "\"Harambe, my fellow\" *sighs*",
            "“There was once a large, lumbering man with twisted hair and orange glow.  \nHis gluttony could only be quenched by swallowing our country whole, and like a harbinger of death, a plague followed his footsteps and decimated our people.  \nWe are brave, we are strong, and we survived. This persistence enraged the man, and his mind withered quicker than his marmalade mane.  \nIn a final act of desperation, he gathered the last of his plasticine strength to turn our own countrymen and family against one another in a spiteful civil war.  \nAnd although the wicked goblin finally departed back to his burning depths below, the hatred he left still resonates our nation’s air even today.”",
            ">\"... and smells like birthday cake!\"\n\nPure gold.",
            "He always rambles about „skibidi rizz toilet“",
            "I need the rest of the story though",
            "I used to be with it, but then they changed what 'it' was. Now, what I'm with isn't it, and what's 'it' seems weird and scary to me. It'll happen to you!!",
            "God you’re good at this",
            "Cant wait for part 2 after you get your incest hybrid sativa purple kush infused train wreck skittles gum cartridge grandpa",
            "[deleted]",
            "I know where you get the onions from 😁👍🏼",
            "I have that exact battery lol. If you Google pipe 510 battery it should pop up with several options",
            "I see what you did there",
            "Mar-iguana",
            "Somewhere around 1990 my boy",
            "That's not an e-cig.",
            "For real. Older millennials might have a shot but not these kids that started in their teens.",
            "your gay haha",
            "Not when you tryna get faded In front of kids without smelling",
            "Does three shots of whisky.  So they fucking shot this Gorilla right.",
            "While I do agree, America is still not the world outside of Hollywood",
            "Orange man bad,,uovote pls",
            "Moooooooom! Grandad keeps saying “On God Grandma gotta gyat double cheeked up on a Thursday type beat!” Make him stop!",
            "Right? Was I supposed to be bored? Because I’m very interested",
            "[https://www.youtube.com/watch?v=yujF8AumiQo](https://www.youtube.com/watch?v=yujF8AumiQo)",
            "My man, thank you!",
            "haha thats gay",
            "PUT YOUR PANTS BACK ON GRANDPA",
            "If I ever get like that in old age I want someone to shoot me",
            "Happy toking 😎",
            "DICKS OUT FOR HARAMBE",
            "All the old memes just spilling out in the dementia. All the nurses of 2070 are gonna be put on real meme game",
            "In dying from this thread. 😆",
            "RIP in peace"
        ]
    },
    "meirl": {
        "title": "meirl",
        "score": 1584,
        "url": "https://i.redd.it/p4fguchry18d1.png",
        "content": "",
        "num_comments": 17,
        "comments": [
            "For a second I thought the first picture was two people trying to hold the eagle down",
            "This aint real.\n\nUnless the fucking giant condor has resurrected from extinction.",
            "Eagles rarely land like that. It's probably injured and needs help. Call a professional so it doesn't claw off you're face. They're aggressive as shit",
            "Run at it while singing rule Britannia",
            "My country Tia of thee..",
            "The delivery guy's pet falcon arrives before your Amazon package does",
            "Vote or die - this is the future republicans want smh my head !!!!!1!!!1!",
            "Just Don't comment on how they sound nothing like they do on TV.\n\nThey hate that",
            "Time to take out the silver sword with archi-griphin potion",
            "If you've got any oil I'd hand that over to it too",
            "it's a bald eagle. looks about average when it comes to size. look up how bit their wingspan can get",
            "It's about average space for an eagle",
            "And then remember that Bald Eagles are considered on the small side for eagles.",
            "Eagle wingspan is 1.8-2.3 meters.\n\nThis image seems to be 2-4 meters at LEAST.",
            "California Condor?"
        ]
    }
}