{
    "Shocked CEO": {
        "title": "Shocked CEO",
        "score": 773,
        "url": "https://i.redd.it/hvs06ooei38d1.png",
        "content": "",
        "num_comments": 19,
        "comments": [
            "Seems like refusing to pay fair wages isn't the best retention strategy, huh?",
            "However, she did not cancel the bonus of 5.5 million dollars for herself",
            "see how teeth appearances vary in diff mood",
            "![gif](giphy|6nWhy3ulBL7GSCvKw6)",
            "![gif](giphy|mEtSQlxqBtWWA)",
            "I gotta keep the shareholders happy by giving the profits to them as dividends.",
            "Could someone explain the meme pls? I suppose this to be American thing.",
            "So you cancelled bonuses/reduced pay, because the company is struggling financially.\nBut have you tried to invite them on a trip on your new 100 feet yacht to make it up to them?",
            "\"Oh my god, its almost like these people just in it for the money amd not care about the company\"",
            "Filthy greedy pig mole",
            "But they gave you a pizza party, you ingrates!",
            "This meme... wait guys, did you have employee bonuses?",
            "Dont worry they can be replaced.",
            "When you own bonus depends on the next quarter report it makes a lot if sense\n\nIt is ceo bonuses based based on short terms (below 5 or 10 years) that is increadible dumb",
            "She look like the fucking pale man in the second image!!\n\n![gif](giphy|s6aVykwa8gFLW)",
            "Damn, that was cold!",
            "She is the CEO of Herman Miller iirc and said in a video message or meeting that not one employee gets a bonus for the year while she gets 5 mil or smth for the same year.",
            "She is still CEO....so the people who placed her there, were happy with her results."
        ]
    },
    "Do they? ": {
        "title": "Do they? ",
        "score": 2985,
        "url": "https://i.redd.it/i978dxbdc18d1.png",
        "content": "",
        "num_comments": 67,
        "comments": [
            "Deaf girls can moan they aren’t mute",
            "Deaf girls are very loud, as they can't hear themselves. Deafening even!",
            "Deaf girls who publicly masturbate realizling moaning has a sound:",
            "Well that's just ridiculous... \n\nBut what if they were doing a video chat?",
            "Who the fuck makes comments like that? I just sat down!",
            "is a deaf girl masturbating really eating herself out?",
            "Scenario aside, that was a great movie.  Absolutely unappreciated from end to end including the outtakes at the end.",
            "Who masturbates with both?",
            "What girl is out here masturbating with two hands?",
            "There was couple of AskReddits where OP asked about unusual partners, top answers were about having intercourse with deaf indiviuals. They mentioned that surprisingly they can moan but how they do it is quite unique.",
            "Totally read it as dead girl at first. All I could imagine was ghost girl masturbating and moaning.",
            "Makes me moan fr",
            "I am deaf- I can tell you… no",
            "Do deaf people with Parkinson’s stutter?",
            "Deaf girls boutta' show every gang signs with the moaning",
            "huh",
            "Why tf would me sign a onamatopeia?",
            "Deaf girl: \"You guys are moaning???\"",
            "I feel bad for people with deaf roommates/siblings can you imagine walking down the hall and your hear them moaning so loud you think the neighbors could hear them what do you do since you can't just knock on the door or tell them to keep it down",
            "*Dumb",
            "The only we can advance as a species is to ask the hard questions. 🤔",
            "What is that movie name guy ?",
            "If a deaf girl masturbates in the forest, does it make a sound?",
            "You use 2 hands",
            "Oh I got a good 2nd hand story a friend likes to share sorta related to this: I'll now summarize and share here lol.\n\nSo on her birthday many many full moons ago, she was bar-hopping with a friend who ended up getting down with some dude and left her there. So as she's sitting at the bar drinking, when she notices this couple across the bar signing asl to each other. Knowing a little sign language herself and already having drank, she goes to introduce herself. They were so happy to be able to talk with someone else, they invited her to sit with them and keep drinking.\n\nWho knows how many drinks later, the topic of ditching the bar and \"heading home\" comes up, but she gets nervous. She's trans, amab, snd doesn't know the sign for that. So she tries to explain \"above waist girl, below waist boy\", and they look at her for a second, confused, before the guy (and I'm only saying this in text for demonstration purposes when irl she'd just sign the word) *holds up two fingers on each hand while closing the others, then puts them a sideways 69 shape and bumps his hands together rapidly*. ^(The sign for intercourse, but done excitedly lol.)\n\nIn more ways than one, they never heard her coming that night!",
            "This joke was about Helen Keller in the 70s. It was just as dumb then.",
            "Deaf girls are best because you just put them on mute with removing their hand haha",
            "You guys are getting paid?",
            "If a coomer cooms in the forest but no one hears them coom, did they even coom.",
            "Or what if they are uncontrollably loud. And you have to sit through that",
            "🤣🤣🤣🤣🤣🤣🤣",
            "![gif](giphy|67jkYnYYtdlhC)",
            "Understated oversight",
            "How do they know they are moaning?",
            "Helen Keller made the weirdest sounds in bed",
            "If a deaf girl moans in a forest, does she know she did?",
            "Is it moaning or is it animalistic noises whos pitch cannot be predicted",
            "I came here to say this but you beat me to it.",
            "[deleted]",
            "Still they use another hand to let them know they're moaning and how it sounds",
            "Must be awkward when they first discover their bodies and don't realise quite how loud they are being with Mum and Dad sitting downstairs",
            "Publicly?",
            "What...?",
            "Bro, lol, clean",
            "\"Fuck Off Real Life Flanders\"",
            "Which movie is this?",
            "Right?\nMy first thought. I’m a guy though so I wasn’t 100% sure about women. Glad to have found a lesbian to agree with.",
            "Moaning Myrtle",
            "You know deaf=mute right. A deaf person can audibly moan still",
            "They don't, some also make noises when they \"talk\" without knowing since they can't hear.",
            "Gonna need a source 😏",
            "#👀",
            "Video or it didn’t happen 🤷🏽‍♂️",
            "Need evidence to prove that",
            "I mean, moaning doesn’t focus much on the pronunciation. I bet itd sound pretty much the same",
            "Publicly!",
            "is a deaf girl masturbating really eating herself out?",
            "We’re the Millers.\n\nGreat casting and writing.  And subtle and not so subtle sight gags.\n\n/Noragrets",
            "I guy who doesn't require both hands to do this? Ew, pass. \n\nSeriously though I was wondering who was using 2 hands lol",
            "Shouldn't they still feel their vocal cords vibrate? At least I assume so lol",
            "Yeah, but what does that mean??",
            "They wouldnt know thats talking tho",
            "They speak with their hands (sign language) making their hands act as sort of like it's their mouth (how everyone else speaks), ergo they're putting their \"mouth\" in their vagina when they masturbate."
        ]
    },
    "american education system be like:\n": {
        "title": "american education system be like:\n",
        "score": 1785,
        "url": "https://i.redd.it/dctcn51gx18d1.jpeg",
        "content": "",
        "num_comments": 94,
        "comments": [
            "Who wants to bet they also think \"God bless America\" is in the bible?",
            "When you get memed hard and don't even get it.",
            "Theybhave taught him wrong things as a joke",
            "He's obviously joking",
            "“Searching for intelligent life”\n\n![gif](giphy|Gpf8A8aX2uWAg|downsized)\n\n“No intelligent life of any form found”",
            "Caveamericans probably hunted this shark’s family.",
            "Even diehard Christians don't believe the earth was created in year 0..",
            "![gif](giphy|5VKbvrjxpVJCM|downsized)\n\nWow i live in Earth with these peapole!!!",
            "Dude think ad is short of america",
            "Americans aren't the only stupid ones. One of the people who vandalised Stonehenge is an Oxford student.",
            "This kid is so stupid I hope his kids don’t grow up like that lmfao",
            "Between Earth being 2023 years old, USA being the same age and the shark being a person, is a lot to digest.",
            "you all saying bad america system but how much is this bad america system and not actually not learning at all ?\n\nbecause I'm sure he didn't learn",
            "Murica🤣🤣",
            "People can be incredibly dumb. Throw in religious belief, and there is no hope.",
            "OP's account is the most anti-America thing I've ever seen. I'm not even sure he's a Russian/Chinese psy-op. I think he's just a bigot.",
            "They will be from Texas.",
            "![gif](giphy|D2kFkQwMzFcVq)",
            "Boys doing church math",
            "That gave me  brain cramp. No more reddit today",
            "He has a point\n\nHe is just wording it horribly",
            "What a dumb fuck",
            "Repost",
            "Looks like someone skipped a few history classes!",
            "In the beginning, god created the USA.",
            "What an achivement. /s\n\n I mean it is cool that this species of shark gets 400-600 years old. But being older than the US? Throw a rock at anything in Eurasia and its likley older.\n\nFor example, my small cow village was first mentioned by name in 1498 or something, as someone from my village was part in a barfight in Bremen, and the trial records survived. As this is the first record the village is older still, but the exact founding date is lost to the fog of time.\n\nSaid village currently contains ca 800 people and 3000+ cows and predates the US by centuries.",
            "I wont accept that there are people THIS stupid around.",
            "His ONLY excuse that would have any weight: He is only 7 years old.",
            "No biggie, my fence and my least favorite beer are both older than the USA.",
            "I really fucking hate the greenland shark factoid. I read the original article in 2016, so I know that the sharks they dated were all dead. people who repost the fact on Reddit all seem to think that one image of a greenland shark is somehow the shark that is somewhere between 272 and 512 years old.",
            "My dude, that is because this shark lived in water, so he existed before any earth was created.",
            "Shark is a person",
            "Black holes have got nothing on this dense mf",
            "Amazing, every word of what you just said was wrong",
            "If its saying like the continent then yes, if its saying about the USA getting formed and all of that history stuff then no",
            "Redditors when extremely obvious satire(it must be americas fault)",
            "That sounds like something Ricky from Trailer Park Boys would say",
            "American home schooling system. Ftfy",
            "That is not true the earth is millions of years old maybe even more",
            "Man, is it really that hard to get into Hardvar? Because I don't believe it",
            "That shark actually started this sub",
            "Red poster is trolling",
            "Meanwhile........in America 🤣",
            "Well, if he's talking about the landmass nowadays known as USA, he's not wrong though...",
            "Even according religion 2024 is just when some random guy named Jesus was born. I i hate this on so many levels",
            "And don't forget, they have nuclear weapons too",
            "🦅 🔫 🇺🇸",
            "\"In the beginning God Created the Heavens and the United States of America\" is literally right there in the bible bro. Read a book. \n\n(Then read it out loud to me, I never actually learned to read but my mom told me it's totally there)",
            "Old testament is also yeeeeeeehaaaaaaaw",
            "The bible was written in America. Jesus was the first American. \n\n/s",
            "Nu uh,\n\nit does!",
            "I'm pretty sure the sentence can be found in bible orderlessly",
            "With 'Murica you never know if it is troll or not.",
            "Yeah this seems like Ken M style trolling",
            "A tiny net is the ultimate weapon",
            "Face to foot style how'd you like it",
            "Milkduds",
            "If you've got an ass, I'll kick it!",
            "Is he tho? Myb not...",
            "Intelligence was all out when it was his turn.",
            "Why would any christian believe that?",
            "Studying what? Liberal arts? 😂",
            "Not America, only US.",
            "For real. I started to get flashbacks of Gonzalo Lira from browsing his account",
            "CAKE DAYYYY",
            "the shark was estimated to being between 272 and 512 years old at the time of her death iirc",
            "My dude. You live in a world where people simp for politicians.",
            "He is. Earth (as well as the US 😂) were absolutely not \"created\" 2024 years ago...",
            "Don't forget they already used them.",
            "Jesus said, “Blessed are the gun-owners, because they will be called sons of God\"",
            "Adam=man Eve=woman Steve=Shark? It's the missing link",
            "How dare you imply the heavens were created *before* the United States?",
            "This but Mormonism",
            "Happy cake day",
            "I just said they don't..\n\nI'm referring to the diehard Christians who believe the world is only a few thousand years old, and even they don't believe it's as young as 2000 years. Like the guy in OP's post.",
            "This argument always baffled me. If you take the bible as fact, then it absolutely was not created at Jesus’ birth, and you’re looking at another 4-5 thousand years before his birth.",
            "SONS OF THE PATRIOTS GODDAMN IT FOR SWEET LADY LIBERTEA",
            "United States is the heavens",
            "Literally Mormonism",
            "Jesus was crucified for the 2nd amendment!",
            "Gotta be. There's a place called Paradise somewhere there right?\n\nI know where Hell is...its in Norway. So Europe is Hell.",
            "Facts!",
            "Lel always like to call it Moronism",
            "That’s how it he’s to be. Well there’s a a city in Europe called Hell- sinki so..",
            "There's a city in Poland called Hel",
            "Netherlands also has Hel",
            "That’s it Europe is officially Hell"
        ]
    },
    "Good to keep in mind": {
        "title": "Good to keep in mind",
        "score": 879,
        "url": "https://i.redd.it/zntwifsyl28d1.jpeg",
        "content": "",
        "num_comments": 17,
        "comments": [
            "No, I'm a lump of cells, mostly grey and white matter and electricity I'm one small portion of the universe experiencing itself.",
            "\"Fear nothing\"\n\nMotherfucker, rapist and bears hooked on cocaine scare the shit out me",
            "That wasn’t helpful at all it was the opposite I turned of my phone and had an existential crisis",
            "\"fear nothing\"... Bro this reality IS FEAR.",
            "![img](avatar_exp|181203221|take_my_energy)",
            "Then people do stupid shit and die.",
            "Not to mention the fact that you are, in essence, a bag of electric water",
            "We are all thrill seekers without a choice.",
            "Okay and how does that help when you get mugged by three homeless crackheads?",
            "Followed your advice. I'm in prison now.\n\nFurther instructions?",
            "![img](avatar_exp|166652703|bravo)\n\nThanks",
            "🤢",
            "That's a great meme, but shouldn't it be \"through\" instead of \"though\" though ? 🤓",
            "Both sentences go hard ngl",
            "„Oh yeah, forgot to mention there are other ghosts you’ll have to deal with“",
            "It is through dimwit",
            "the deal is to \"free\" them from their mortal prison!"
        ]
    },
    "That's accurate": {
        "title": "That's accurate",
        "score": 9422,
        "url": "https://i.redd.it/jj0qy23eyy7d1.jpeg",
        "content": "",
        "num_comments": 127,
        "comments": [
            "To be fair, the reason why boys don’t believe it is because it rarely happens.",
            "The prank has happened 1 too many times. Now, if a girl ever says she likes me (not happening), I will need them to sign a contract for me to trust them",
            "Everyone here is talking about the cruel idea of a prank that happened to pretty much every man on the planet, it’s not wonder men need a signed contract in blood to even believe someone could theoretically care for them, it’s such a foreign thing to most men it’s like a fictional character suddenly appears in front of you.",
            "it's like the discover the fire..",
            "90% if the time it is a prank/trick.",
            "Once girl come up to me and told me that line.\nWell I didn't belived that first and asked my self why? But then I lerned that was a prank. That exact situation hapend to me 2 more times. So yes I don't thing that girls realy can tell you that they love you.\n\nPs.\nSorry if I made an speling error.",
            "This never happens.",
            "Ah, classic. This prank happened to me few times and only once for real. So yeah: we don't trust when women approaching us",
            "It’d be fine if one party screwed around with the other enough to think negatively",
            "Got confessed for the first time and it was a dare from their friends\nNever again.",
            "One memory of being pranked in elementary made me traumatized, ONE FUCKING MEMORY!",
            "the girl i had a huge crush on in highschool approached me on the bus home and told me she really liked me and had even put her arm around my shoulder while trying to get me to return the sentiment. which, you know, i did. she was the smartest girl in the class (i was the only one with higher grades), she was also a gymnast, and absolutely stunning. thing is, i was an introvert, she was an extrovert. so when she did this there was a crowd to witness it. most popular and beautiful girl in the school doing *anything* is gonna have everyone's eyes on her.\n\nthing is... i thought it was a prank. i had no reason to think this. she was a sweet girl i dont think woudl ever prank anyone. but i was so far outside my comfort zone, and panicking, i blew her off with extreme prejudice.\n\ni later learned she cried for hours when i rejected her because apparently she had like me even more than i liked her. still feel like shit when i think on that.\n\nsince then i have had far better luck. no other woman has been so upfront so i never hurt anyone's feelings thinking they were pranking me again. instead i just clued in everytime a girl liked me months or years later. when it was too late to matter.\n\nsome people just arent suited for romance. oh well. my cat loves me.",
            "I'll never be confused because that will never happen to me",
            "You are expecting men to think that people care enough about them to make that move",
            "I don't think you're doing the meme right",
            "It so rarely happens, that it more times happens as a prank or bullying than actual confessions, girls if you confess and the man reacts like this or initially shrugs it off, don't be hurt, just double down and say you're serious confess again in their face, as many times as you need to until that man understands your feelings are genuine and he's worthy of being with you.\n\nBecause when it comes to dating, a lot of men have:\n- self-doubt \n- low self-esteem \n- do not find themselves worthy of dating most of the time \n- are too afraid of misunderstanding something and being ridiculed or called a creep (happens a lot)\n- Are taught women never make the first move and they should respect them entirely when it comes to stuff like this\n\nSo essentially we are NOT mentally prepared to being confessed to a lot of the times, it's why you girls have a 99% success rate if you ask a guy out, just be honest, direct and persistent.",
            "You'll be right more than you're wrong.",
            "I've had 4 girls/women tell me this. 3 were pranks. The last was my wife. It's been 18+ years since she told me she likes me and I still have times when I wonder if she was originally pranking me and got comfortable.",
            "Happened to me in middle school once. A girl called out to me, she said her friend liked me and I just walked away. I am 100% sure it was a prank or some bullshit",
            "9/10 times it is a prank and you're being recorded.",
            "These pranks don't work on me, I don't like anyone. And if it's somehow not a prank, then idk. Shoulda picked someone else I guess.",
            "Thats what happens when you spend your life being emotionally shunned...\nYAY! Emotional trauma!",
            "Its still new ,we need some time to get used too",
            "This happened to me once, still trying to figure out if she was not joking",
            "You know how, in Star Trek, it's not crazy to meet a Vulcan? They're actual aliens native to another solar system and nobody bats an eye. It is commonplace for them. That's how women asking out men should be. Be bold, break the norm, and create a new norm",
            "because 99% its fake",
            "A good friend of mine once told me that she had a crush on me I told her “stop eating shit, I’m not in the mood to pay games”",
            "also applies to lesbians  \n(source: experience)",
            "Sadder thing is that pranks similar to this do happen.",
            "There’s also the accusation of being needy, clingy and desperate.",
            "women never say this until a year of dating has gone by",
            "Nope.",
            "Eh no",
            "Fair.",
            "My time in high school in a nutshell. (My first real gf was in my early 20s)",
            "I am a little suspicious when something even remotely related to this happens.  It the tone of voice and eyes give it away",
            "Hoes",
            "What's the catch?",
            "Ok but look, I’m middle school I LITERALLY GOT PRANKED by a “crush” (vaguely thought she was attractive) and was made fun of. \n\nFast forward 4 years and the way my current boyfriend told me he liked me (didn’t ask me out, just admitted he had (has) feelings) was in front of two of our mutual friends and I’m pretty sure one of them was recording. \n\nI had a lot of reason to believe he was fucking with me if he didn’t whisper it into my ear the way he did",
            "Self doubt and years of gender role do be putting a toll on shit like this",
            "\"Please, don't give me hope\"",
            "I’ve been confessed to and my brain proceeded to have a BSoD because I have horribly low self esteem and genuinely hate this physical form I’ve been trapped in my whole life",
            "I remember being like seventeen and 3.14 qt came up yo me while I’m playing table hockey at a movie theatre, was like hey your really cute wanna hang out? What wait huh how old are you shes like 13 im like what shit no, no dice, she frgn back hands slaps me, goes back to her gfs and leaves, im just like wtf??",
            "High school and part of primary school, this was me. It messed with me so much that I remember walking down the street in my 20's and two women gave me a random compliment, I literally just looked at them, trying to see the angle. I know, me so I don't believe the compliment. I'm was wondering whether to ask them if they were drunk (it was night and there was a club nearby, but I thought better of it and walked off)",
            "The first move. is to ask em out on a date. I.e. spend time together in like the park or a restaurant or literally anything. Not to immediately confess your feelings and just expect things to happen from there. Even \"I like you, wanna bike together sometime?\" Is fine\n\n*slaps your ass as you get out tbe door* now get out there and have fun, champs",
            "You like me? Well I can't date someone who makes such poor decisions!",
            "It does happen and its not usually a trick. I was seemingly friendzoned for a year with this girl. Then she said that she may have feelings for me, but doesn't want the friendship to end. It's been 5 years now!  Not all women are the same, and not all have bad intentions.",
            "Most girls don't straight up say this. They'll do shit that might make you believe she's into you, but they never give you a straight \"I like you\" ever",
            "When you think about it, I come to the conclusion that I am the type of person someone would do this to to fuck with me. I don’t know if this is a thought that would cross a girl’s mind unless she really liked him",
            "Also the old \"does she like me or being nice\".\nAnd then having a bunch of girl friends while growing up complaining about a man hitting on them.",
            "A girl never confessed to me, but I am still waiting for a girl to do so.\n\nBut to make matters worse, I don’t have anyone I’m interested in for now…\n\nOnly time can tell.",
            "When i was a teenager i had a girl who I had great chemistry with. One day she came up to me and told me “I love you\". I didn't take the \"hint\" and i awkwardly laughed it off, not knowing what she meant \"exactly\". She stopped talking to me soon after.\n\nEven then, it took me years to realize what happened. Yeah, i wish i was joking",
            "Now that i think about it, i have never been asked out before. I have always been the one that asks",
            "The reason is that we are just human beings",
            "Omigod, #MeToo! 🤪",
            "seemed like a trap tbh",
            "I once had a girl who told me she limes me and we started dating. After 2 months of leading me on she told me she started dating me because she thought it was funny. Never again. I'd rather die alone",
            "It is because girls never be straightforward that we assume it’s a prank",
            "True",
            "Boys only have two extremes: Either they wonder how someone could like them, considering they don't like themselves or they wonder, who would get a kick out of tricking them because they don't like each other.\n\nThere is little inbetween and unless you are at a private place, just confessing will result in System Error, because we cycle between the extremes and any possible other explanation. We already suffer all the time with \"Is she into me or was this just random kindness and I read to much into it\"",
            "Yeah, because of the time it's either a prank or a hit and run situation. First they do the move, don't get instant gratification and then stop at all.",
            "Had this happen to me.\n\nIt was indeed a prank",
            "Some women aren't as good as giving hints as they think they are",
            "well see but there's a reason for that",
            "Said no girl ever. Im 18 and start to think that I wont find anyone",
            "I'm that situation right now and my best mate is telling me she's into me because of arm touches etc but I'm just going to assume she's being friendly unless she actually asks me out. \n\nDoesn't help that's she's way younger and vastly more attractive than me.\n\nIt feels like George and Marisa Tomei",
            "Can't really confirm or deny, this has never happened",
            "Maybe because a lot of girls pull these \"pranks\" on boys",
            "Touché",
            "I like you! …as a friend! You’re just like a brother!",
            "Being worse if gets dumped many times that let you end as Aro-Ace",
            "I did the first move a lot. The problem is that I met a lot of dishonest men. I was always clear in my intention that I am looking for a relationship.\n\nEvery time I did tell a man that I am interested he jumped on the opportunity without actually liking me. There was no efford from his side to get to know me, to date me (it is not about the money, I am okay with paying for myself or both of us), to form a mental connection. \n\nAs all of them thought that I must be soon into them they assumed that I would just have sex with them without really knowing them. \n\nEvery time I asked a man out it was a bad experience. If I ask a man out it does not mean that I am melting from attraction and need sex right this moment. It means that you are kind of cute and I noticed you. I would like to get to know you better to see if we could work and if you are a nice person.",
            "Men cant take a hint. I say that with pride. Cause we're all pessimistic when it comes to romance!\n\nThis meme was def made by a woman though 😅",
            "This meme acts like it's not understandable that there'd be an adjustment period.",
            "It’s the same way for gurls",
            "Look boyo, he won his own made up argument.",
            "And i promise when it does, you will question every second of it.",
            "Between the demolished self esteem and the sheer improbability of the situation, it comes accross as facetiousness rather than an honest claim.",
            "My sister’s (ex-)friend asked a boy she knew liked him if he liked her. He said yes she laughed at his face, things like this happening make it even harder to believe it’s true🥲",
            "Can confirm, in all my 22 years of living, never heard these words",
            "And especially for teenagers it is not out of question that it's a prank",
            "And because nice guys are already desperate to open up and will literally be a simp. So if they are told by a girl \"I like you,\" if he makes any simpy move AT ALL, or expresses reciprocal interest...the girl either eventually drifts away, or immediately gets disgusted.\n\nThis is one reason why guys train themselves to not express interest. The guy becomes the weirdo or creep, when he didnt even initiate it.",
            "Or it is told to you and later found to be a manipulation",
            "And when it does, it is a prank.",
            "I've had several women tell me they liked me. Mostly, because they were dared to, not because they actually did. So, yeah, I think the \"is this a prank\" reaction is well placed.",
            "exactly!",
            "And get that notarized!",
            "Women. Can’t trust them because they don’t trust themselves. How many times has our SO made plans then needed encouragement to follow-through.",
            "Are you real?",
            "Those girls just wanted to see my reaction thats it",
            "It happened to me when I was 11, from then on I distrusted girls",
            "It can actually happen. Happened to me, I didn't believe and tried to play it off as a \"safe\" option so I wouldn't embarrass myself in case it was a prank. It wasn't. She was NOT amused.",
            "When it does, youre on tiktok",
            "It legit happened to me when I was leaving the grocery store. Asked for my number and called me handsome. Quite frankly I'm happy I already had a girlfriend because it meant I didn't have to face the idea that someone finds me outwardly attractive.\n\nI choose to believe she was trying to scam me in some roundabout wsy",
            "I'm sure this happens to 10/10 guys. Literal Adonis level looks or something.",
            "Happened to me. I didn’t really believe her at first. She really affirmed it once I was able to solve her iTunes gift card problem. She really loved iTunes.",
            "The crowd didn't do her any favour's.",
            "You know, I too used to be an introvert, than I found the guiding light of aragorn son of arathorn an in-between and built off of the charecter and honesty and proud Ness I found in his soul in the book, I am now proud to be an extroverted introvert, no more afraid to be talked to or talk at someone. I had a girl ask me out pretty much the same story as you told and I did the same, this propelled my will to become the man I was born to be, I went back to that girl and asked her out, fine times together now.\n\nI hope my story reaches your ears sheild brother, may your roads lead to warm sands.",
            "Yeah because of the system error",
            "Real",
            "No fr. My first gf dumped me after like a week, then told me it was fun 'pretending' to be lesbians💀 absolutely devastating experience",
            "🫂",
            "I feel you buddy",
            "That doesn't make it untrue. I can't tell you how true it is. \n\nSuble hints don't work. Less than subtle, we'll probably get in a years time. I hate hints and would prefer to be direct. The trouble is that i definitely identify with that meme and being directly is immediately viewed with suspicion. It's as much about how and when it is said, not just what is said.",
            "It's miscommunication from women too. If you expect men catch all the hints all the time? Like what happens if you tell it directly? You explode? \n\nThe pessimistic is true, nobody like being played with feelings.",
            "For real. I had a girlfriend when younger who moved away and years later we met up again at a grocery store and exchanged numbers, both being single still. I didnt hear from her for a while and figured she didnt want to call me and forgot about it basically. One day out of the blue my sister yells out to me this girl was on the line (this was before cellphones) and im like bullshit. I pick up the phone and it dont sound like her to me and i figure my sister talked one of her friends into pretending to be my old girlfriend just to mess with me and basically tell her to fuck off.\n\nMy sister at the time basically just didnt say anything and let me think what i was thinking. Years later i see this girl again, we are both married at this point we exchange pleasantries and i later go home and call my sister and tell her about it and ask her if she remembers when she called when we lived at x house when i was around y age and shes like yeah and im like that wasnt you and your friend(s) messing with me and shes like nope. I was honestly kind of glad as when i seen her i was no longer attracted to her and my wife is/was beautiful. We are friends on facebook now but never really talk or anything but i did also ask her about it much later and she also confirmed it was her and i apologized for the things i said and explained myself and we got a laugh out of it.",
            "Maybe she's just Canadian.",
            "Cries in self sabotage",
            "\"Wait me?\" \"Gross, has she seen what I look like?\" \" Jim or someone else put her up to this and when I seem happy and respond to her someone's gonna yell IN YOUR DREAMS LOSER!\"",
            "Thats why ir is scary man, we don't know if it's genuine or not 🥲",
            "Some girl I barely knew came up to me and said she liked me. I just replied by saying ok, and she immediately laughed in my face to her friends. Like, I didn't think about her at all before that. Some people are just petty for no reason.",
            "Had this before in my teens. Mentioned it to a friend as to why she would say knowing i was with someone  at the time. He said she's just planting a seed of possibility so I'll be nice and maybe do stuff for her. Was great advice. Not saying its always that but it helped me dodge some bullets over the years.",
            "No, I am a figment of your imagination conjured by your subconscious to give the perception of a person",
            "Yes, dawg is for real. Actually had that shit happen to me once. It dwelled on me for years. Still think about it sometimes and wonder about current relationships.",
            "But nothing happened? So how is this relevant",
            "Underrated",
            "Yeah sure, and i'm a billionaire",
            "in hindsight, her being an extrovert and all, i think it did. it took a LOT of courage for her to approach me, and i dont think she would have been able to without the support of her friends. it was my own foolishness that misread the situation so poorly.\n\nalso, probably did her more good than that. i was a stupid kid, high grades notwithstanding, and im sure she found someone far more worthy of her than myself. i was from a broken home and still being bounced around family members across two provinces. even if i hadnt freaked out, i was still forced to move just a few months later.\n\nthere was no way it could have worked out in this timeline.",
            "Oddly specific.",
            "“That’s a lot of words, too bad I ain’t reading em”\n-Duke nuke em",
            "Why does this ring so true",
            "Wow Shakespeare.",
            "lets see: this meme is about how men dont get called attractive enough, and when it does happen, our brains short circuit\n\nI got called attractive, and so my brain short circuited. I even said in the comment that I still refuse to believe it was real and just assume it was a scam\n\nSo in conclusion, yeah my comment is completely unrelated and I should burn in the styx",
            "Lol it's so unbelievable that someone would love itunes",
            "no shit",
            "Sorry I realize that sounds rude now but I was confused"
        ]
    }
}