{
    "Weekly Looking for MMO thread - June 16, 2024": {
        "title": "Weekly Looking for MMO thread - June 16, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/MMORPG/comments/1dh61zs/weekly_looking_for_mmo_thread_june_16_2024/",
        "content": "Please use this thread to post your looking for game posts. In order to get the best response possible, please use the template below. Also check past [Weekly Game Discussion](http://www.reddit.com/r/MMORPG/search?q=author%3AAutoModerator+title%3A%22Weekly+Game+Discussion%22&restrict_sr=on&sort=new&t=all) and [Community Best Picks](https://www.reddit.com/r/rMMORPGDiscussions/comments/4jlgxc/community_picks_archive/) threads for helping in finding the right MMO for you!\n\n&#x200B;\n\n* *What are you looking for?:*\n* *What games have you previously played?:*\n* *What is your playstyle (Casual,Semi-Casual,Hardcore)?:*\n* *Any preferred mechanics?:*\n* *Anything specific you want to exclude?:*\n\n&#x200B;\n\n**Remeber, please be respectful of other peoples opinions and only downvote comments that are not contributing to discussion.** This is a judgement free zone!\n\nIf you want to chat about it we have an LFMMO channel in our discord at discord.gg/mmorpg or you can post in /r/LFMMO.",
        "num_comments": 44,
        "comments": [
            "I crave an archeage alternative",
            "I’ve pretty much never played an MMO, opting for single player experiences instead.\n\nI wanna get into it, and I don’t even mind crazy grinding. Just something with a pretty active player base, classic game style (ex. Fighting Bosses, Joining Groups, Talking To Players). \n\nMy big thing is that, being able to chat with people. And fight. That’s about it.\n\nDND style, if that provides any sort of clarity.",
            "Are there any MMOs that aren't massive timesinks and don't have a ton of menial grinding tasks? I'm too busy to play an MMO with a big time commitment. Right now I'm playing a mobile territory clan game which is nice for the easy pick up and play aspect but the active gameplay is not satisfying since it's all idle task dispatching. Ideally I'd like an idle aspect to replace the grindy bits while still having a actual gameplay for when you can sit down and properly play.",
            "Looking for a game with a lot to discover, where information isn't widely available. Where I can make [stories like this](https://www.youtube.com/watch?v=bJVRgun7M7c) simply because no one knew it would happen, as opposed to modern wow where all the fun is optomized out before I can even get to it",
            "I'm in the mood for an older, slower fantasy MMO that has a relatively active (talkative) community and isn't on the verge of shutting down. Bonus points if the UI and controls are easily modified to suit modern sensibilities.",
            "Looking for an MMO since New World went kaput, that would be the same style.",
            "Are there any mmos out there where the grind is not super boring / repetitive / etc ?\n\nWhat I mean is something for instance with procedural map generation so even if there's grind, its interesting with random or new things happening rather than going in a circle repeating the same content.\n\nOr maybe even if there's no precedural map, the game design is in a way where the grind is actually fun rather than tedious and boring.\n\nI am yet to find a MMO where grind does not fill like a tedius / excruciating chore",
            "I'm looking for a MMO where somebody who is effectively allergic to trivial difficulty, rotations, and copying builds off a website can still have reasonably fun with other players in PvE group content.",
            "Hello! Does anyone know of a game similar to Silkroad in terms of using bots? To give a brief explanation for those who haven't played it, you would create a party of 8 characters, which had to include a cleric, a warrior, and the damage dealers. You would set up the party so that each character fulfilled their role, and they would stay botting 24/7 to level up.\n\nThe game doesn't have to be an MMORPG; I'm just looking for something with that bot system where I can leave it farming and watch it \"auto-play.\" The closest I've found is Rusty's Retirement, but I'm looking for more games of that style.",
            "I’ve never actually played an mmorpg although I do follow a little bit about what’s going on with wow and had friends back in the day that played EverQuest (I’m old). Funny enough, I just never had internet at home until I was an adult and just wrote it off as having missed the boat but they’re still around so I’m thinking I might give one a shot. \n\nEverQuest looks way too clunky so I’m torn between wow and guild wars but I’m open to any suggestions. I enjoyed the elder scroll games in the past so maybe eso would be a good pick too. \n\nWhat I do know that I want is something social and from the outside, it looks like that just isn’t really the case anymore with a lot of games. I don’t want silent side by side play that may as well be with a bot.",
            "Hello, I'm looking for a PvE-oriented MMORPG focused on small group content (around 5 players) with classic mechanics. I love playing as a healer.   \n  \nI prefer buy-to-play games with or without a subscription but with minimal in-game cash shop.   \n  \nI've played a lot of WoW but I'm looking for something new with less quest hub/fedex-style leveling. I really enjoyed SWTOR but the in-game store ruined the game for me. FF14 is nice but I find the gameplay quite slow. Guild Wars 2 is interesting but the lack of roles bothers me.   \n  \nDo you have any other alternatives to suggest? I like challenging games but without intensive farming.   \n  \nThanks !",
            "Looking for an mmo that is community driven with a lot of player to player communication. Chat boxes, voice chat, etc works, just none of my friends play mmos so I'll have to settle with strangers. \n\nSomething like runescape, where the community is what makes the game fun",
            "Any modern-ish mmos with crafting that really makes an impact on trading? Current main mmo is GW2, love it, but crafting isn't all that there. \n\n\nHave an account in BDO, the processing and crafting is too time consuming for me. Feels like it was made with the express purpose of people afking during it, and that kinda rubs me the wrong way. \n\n\nAlso have an account in LotRO, just not sure if the game is still alive enough for trading. For instance, I want to be able to sell food, pots and stuff like that, not just gear. ",
            "Looking for a MMO (or non-MMO) with a role that protects allies, like a tank for example, but doesn't make me feel like I'm expected to be the leader/have the dungeon or raid memorized.",
            "Which of the larger MMOs has the best balance of chill content and 'hardcore' content? Like maybe one day I want to progress with a friend by just chilling out and talking while we do something mindlessly, and then the next day we feel like progressing by doing something more intense (i.e. raiding, pvp, etc.)",
            "Any games even come close to DAoC when it comes to PvP.. like realm vs realm? I play ESO Cyrodiil is fun but seeing if anything else is out there",
            "Are there any games like MU? I love playing MU dragon havoc on my phone and i want to find an mmo like MU but on pc, because MU online is quite confusing and hard for me on pc.",
            "omg archeage, memory unlocked",
            "The closest in terms of features are EVE and Albion. Or if you want a pserver, there's a decent one called AAClassic.",
            "What single player experiences do you like?\n\n\nYou said DnD style. Do you want more ttrpg feeling mechanics or do you want more standard rpg video game mechanics?",
            "[deleted]",
            "Don't know if the rest of it will be to your taste, but GW2 can be enjoyed with pretty minimal grind beyond bis gear (hard requirement for one type of endgame pve content, the rest can be done in second bis but depends on your group). \n\n\n1. The same bis gear for years, and won't ever change. Sometimes expansions give a better stat combo for your particular class and spec, but you can stat swap the bis gear for much cheaper than it takes to craft another set. Most specs have had the same bis stat for years now, too. \n\n\n2. B2p with no subs and a long free trial with restrictions. You can get up to max level with the free trial, sadly the majority of endgame grouped instance needs paid version and can't be tried on a free account. But you have enough time to see if you like the core systems, combat, crafting etc and also get a taste of its open world metas which make up a large chunk of it's pve content. \n\n\n3. Pretty much all grind beyond that first set of bis gear is optional and leveling is fast as well. You can grind for some mounts (one is visiting npcs and talking quests mostly, the other two require you to do some content but I wouldn't say any of those are hard grinds and with the exception of the talking quests, the other two mounts can be done without). You can grind for cosmetics, titles and legendary gear - but legendary gear has the same exact stats as the bis gear set you'll craft. \n\n\n4. If you're not into instanced pve content and want to do open world pve content instead, there's a decent variety (imo) and you don't even need the bis gear. The second bis gear goes for super cheap on the marketplace for nearly all specs. \n\n\nIf you decide to give it a try and are on EU, you can shoot me a dm if you need help or just some company while leveling. ",
            "I would say Albion online, depending on what your goal with an mmorpg is. But its perfectly playable and enjoyable without hours of grinding.",
            "You can potentially still do that in WoW (or any game receiving new content). Either be in the absolute most bleeding edge content-clearing guilds, or join one with a no-guide policy. It's not something you're going to experience without putting in effort...please don't underestimate just how few players were able to even *reach* C'thun when it was relevant content.\n\nBeyond that, I suppose your best option would be one of the completely new MMOs (not an Asian MMO port, since people will be referencing existing data for those). But you're still going to have to play hard to outrun the flow of information; there aren't any active online games where no one is talking about the content.",
            "Didn't New World go kaput over a year+ ago?",
            "I would recommend Albion Online if the top-down view isn't too off-putting for you. It is full-loot by design so the progression is silver/fame(exp) based rather than sticking to specific gear forever. However, the grind is some of the most fun i've had in a while and the transition from open world to instance-based areas is very smooth and engaging, even if you have to be on your toes for gankers all the time(unless you stick to non-pvp areasd but the loot will be less than what you get in PvP areas). This also makes grinding quite rewarding in loot and feeling. The word grind itself means it is still repetitive though so take my words with a grain of salt.",
            "lol i played the game when it originally came out, played it solo. Haha whats this creating 8 characters nonsense xD",
            "I never played it but I heard MIR4 is something like that, you can leave your character auto-hunting and only watch",
            "Why do you want a computer to play the game for u?",
            "I'll be honest - if you want to be social nowadays, you have to do a lot of the legwork. Most mmos I play now, guilds mainly do socialising on Discord. I rarely come across just hanging out in game, doing gathering or lazing through a dungeon or even just jumping around casually while we talk. But truthfully, as an adult I don't have much time to do that either, so maybe it's just on my end. \n\n\nJoin a social guild, swap guilds if you think the current one isn't fitting your social needs, ask to do stuff together(non-combat activities mostly even when people rarely join you but even doing a lot of pve and pvp together might lead to people becoming friendlier) and try to engage people first without waiting for them to start a conversation. Even then a lot of people kind of just want to do their daily routines and go, so you might get dry answers a lot of the time. Dont take it personally and keep trying, even though it might feel embarassing to approach people first when so many don't seem interested. \n\n\nI've had good experiences with guilds in GW2 and you can join 5 at a time. So you can join a guild for group finding and then other guilds for social activities if needed. But this doesn't mean that GW2 inherently pushes people together as much as some of the older mmos did. I'm not sure if WoW is better in that aspect. \n\n\nI think if you're consistently grouping up with the same few guildies, you kind of establish enough of a rapport that gameplay no longer feels like rushing to get it done with silent players who might as well be NPCs. \n\n\n\nThe most social experience I've personally had in a modern mmo is probably FFXIV, with a robust rp community if that's your thing. \n\n\nGood luck, hope you find the mmo you're looking for. ",
            ">small group content (around 5 players) with classic mechanics\n\nYou are in luck. EQ2 is launching a 2006 version of the game called Origins on Wednesday 6/19/24. No box purchase but there is a sub fee ($9.99/month with year sub).\n\nLimited cash shop. This is a group focused game and will be grindy like WoW Classic. Leveling will not be fast.\n\nBeta is over but this is info on the new Origins servr  \n[https://www.everquest2.com/news/eq2-origins-server-beta-2024](https://www.everquest2.com/news/eq2-origins-server-beta-2024)",
            "Albion. The market is completely player driven. You gotta work but you can make money. You can even own buildings players can use to craft and you make money on each transaction.",
            "I don’t really know\n\nLike I said I’ve never really played or even seen an MMORPG, so I wanted an rpg that’s similar to dnd\n\n(Regrettably, the only reference I can think of to describe exactly what I’m trying to say is BOFURI)",
            "Bro they said they like DND and you didn't even mention [DDO](https://www.ddo.com/home).",
            "I mean that's true but with everything being revealed and being able to see all the armour in-game just by opening the transmog menu it feels like discovery is something you have to actively do. You can't just walk into Stormwind and see someone wearing full judgement or wielding sulfuras for the first time, having no preconceptions that such a thing could even exist. I'd rather feel like the whole community is discovering stuff instead of just going into raids blind, feeling like I'm dragging everyone else down \n\nAs for what other MMOs I could play, I don't actually know what those newer games could be. That is in fact the exact reason I made this post. I'm looking for a game like this but don't know what they could be.",
            "Some of us were still hopeful lol",
            "I played Albion long time ago, don't have good memory of it but it seemed to be grindy as any other MMO despite what you mentioned. Yea I mean grind is repetitive but that was my question, maybe there's a MMO with a different approach to grind where it tries the best to make it less repetitive and more dynamic (imagine a procedually generated world like Minecraft but in a MMO so grind would mean exploring rather than repeating the same area)",
            "[silkroad Full party 8/8 grinding at lvl 107 mops (youtube.com)](https://www.youtube.com/watch?v=JghBsXKB7ZA&ab_channel=IbrahimRashid)",
            "Thanks for the reply. I think I’m gonna try Taridland since it’s new and hopefully I can get in with some new people all looking to play. Wow and even guild wars feel kinda intimidating like I’m a decade behind everyone but tarisland is not only new but looks pretty simple. Idk how much staying power it will have but that’s where I’m gonna get my feet wet.",
            "old game relaunch with sub-only?:( No f2p available? i didnt play the original game but i'm an mmorpg junkie so i tend to try them all. However it can get pricey and i'm not that rich :X",
            "There are areas in Albion(mists) that are actually procedurally generated and you would need to explore to find either hidden treasure or portals to other zones, both of which which only show up when you're close to them. Those maps are similar but never quite the same.",
            "I guess that's cool, although I remember not enjoying Albion so much for some reason, but maybe I can try again",
            "Heard ppl say it didnt have content at launch but has it now. Can't speak for that but i started 2 weeks ago and i like it so far. Its only grindy if you want it to be, unlike other mmorpgs you arn't forced to do all the grinding."
        ]
    },
    "Ask Anything! AMA with Raph Koster of Playable Worlds - Friday June 28th at 1PM Eastern / 17:00 UTC": {
        "title": "Ask Anything! AMA with Raph Koster of Playable Worlds - Friday June 28th at 1PM Eastern / 17:00 UTC",
        "score": 27,
        "url": "https://www.reddit.com/r/MMORPG/comments/1dlf35m/ask_anything_ama_with_raph_koster_of_playable/",
        "content": "Hi everyone!\n\nI’m happy to announce that on **Friday June 28th** we will be hosting an AMA with **Raph Koster from Playable Worlds**!\n\n**Date:**  *Friday June 28th*\n\n**Time**:  *10 AM pacific - 1PM eastern - 17:00 UTC - 19:00 CEST*\n\n**Participating account:**  u/RaphKoster\n\n**THE DEVELOPERS WILL CREATE THEIR OWN THREAD AT THE AGREED UPON TIME. THIS THREAD EXISTS ONLY TO INFORM YOU ABOUT THE UPCOMING AMA.**",
        "num_comments": 3,
        "comments": [
            "Can someone tell me who is it, what's interesting about, so I can research to participate in the AMA",
            "he's one of the godfathers of the genre.\n\n[https://www.raphkoster.com](https://www.raphkoster.com)",
            "Basically, if you're sick of the same old Themepark MMOs with the minimum social aspects - you should keep an eye for Playable Worlds (which has been under development for 5 years it seems). \n\nRaph is one of the veterans of the genre, and he was been the creative director for Star Wars Galaxies - one of the best Sandbox MMOs that was ever made for the Western market. \n\nIt looks like the upcoming game will follow the same elements of Star Wars Galaxies: A game where players can fully enjoy even if they chose to focus on their profession (weapon smither for example) and not spending 90% of their time fighting.\n\nThe typical leveling also seem to be out of the menu. Instead (theoretically, we still don't know much about this game) you'll be able to level up different skills separately. So for example, its not about your character level, but your level in 2H Swords that will give you new abilities.   \n  \nIf they'll take Star Wars Galaxies path - you won't have a story-driven MMO like many other Themepark MMOs have. Instead, the story is what you make of it, because you'll have a lot of freedom with your character. \n\n**Here are a few quotes from their latest teases:** \n\n\"What if... you could actually invent new things in an MMO?\"\n\n\"What if... there was a way to discover secrets in an MMO -- and no easy wiki holding all the answers?\"\n\n\"What if... it rained, creating puddles that froze overnight?\"\n\n\"What if... bad weather meant traveling through the mud?\""
        ]
    },
    "Tarisland review": {
        "title": "Tarisland review",
        "score": 73,
        "url": "https://www.reddit.com/r/MMORPG/comments/1dlg0hp/tarisland_review/",
        "content": "I gave it a good try, got 5 classes to max level (level 20 takes like 45 mins honestly) and this game is just way more mobile than it is PC. I think my biggest problem with the game is all the classes play almost exactly the same.\n\nYou essentially get 7 skills:\n\nSkills 1-2 are basic generator for your class mechanic\n\nSkill 3-4 are stronger attacks with slightly longer CDs do more damage\n\nSkill 5 is AOE\n\nSkill 6 is self damage buff\n\nSkill 7 is ultimate\n\nThe skills pretty much function the same across all classes (Ex. Generator skills on warrior increase rage -> Spending rage on skills 3-4 = more damage, Generator skills on rogue increase poison -> spending poison mechanic on skills 3-4 = more damage.)\n\nAlso you don't have many skills, which is fine, but there's really not much thought behind why you are using them. If the skill has a CD you are most likely pressing it off CD no matter what. This turns combat into just a spammy mess where you are staring at your action bar making sure to press the buttons that light up as they come off CD.\n\nI have no input on the P2W/lore/social/exploration. The gameplay/combat is just way too mobile(simplified) to get past.\n\nI don't want to seem bias so I'll throw some positives out - the UI is extremely clean and the entire thing can be customized (target frames etc.) Built-in damage and healing charts are pretty cool too. Servers were very stable.\n\nIf anybody has any questions I'll answer what I can.",
        "num_comments": 168,
        "comments": [
            "Game is okay.\n\n- Very clearly a mobile game\n\n- Performance is pretty bad on PC(5800x, 3080 high settings)\n\n- Classes don't feel particularly unique\n\n- Pop in is awful. Walk a couple steps and someone appears out of thin air in front of you\n\n- $60cad skin in shop LMAO. It don't even look good\n\nGonna keep playing for a bit and see how it goes, but it doesn't feel like a polished game so far.\n\nedit: thought of more\n\n- character customization is next to non-existent \n\n- ~~aoe skills can't be ground targeted and can only be centered around a targeted enemy~~\n\n- fatigue system for crafts/gather",
            "I didn't expect anything from this game, tried for 3 hours, looks very mobile.\n\nOof I hope one day I'll play some really classic mmo like Lineage 2.",
            "It's a mobile game brought to pc. Enough said.",
            "I went in blind, and was very disappointed. It's just another mobile game with a sub menu under a sub menu under another sub menu, with one currency/token to operate each sub menu, 4 hours was all it take for me to uninstall.  Just like any other MMORPGs mobile .",
            "It just felt so limited to me.  I know it will change a little as they open up more content but today's experience was really bad.  You just run out of stuff to do so fast.  Do a couple dungeons and you're locked out of rewards.  Do 2 battleground and you don't get rewards.  You literally get 3 minutes worth of \"vigor\" to do professions each day.",
            "It’s kind of fun to play for 15 mins while shitting with my ipad. It’s not a great PC mmo but for mobile it’s pretty solid.",
            "I've only played one Class but switched around specs and I very much agree with this. Honestly dont even have a strong opinion on it as to me it plays like a decent mobile game and thats about it.\n\nThe UI is very good though and even better than some western MMOs imo.",
            "Found nothing to enjoy about this game.\n\nIt definitely feels like a mobile game, and it has nothing special about it. Just another generic crap.",
            "I played it for an hour and could immediately tell it is entirely made for mobile.",
            "I legit don't know how people are honestly comparing this to WoW. It felt nothing like it to me in any respect, except for the obviously copied Tauren assets and overall art style. \n\nAnd the story/voice acting. Some of the worst I have ever seen/heard, bar none. \n\nThis is a hard, hard pass. And I'm someone who is usually pretty tolerant of  mobile MMO jankiness.",
            "1. It's a mobile game.\n\nThat's a NO GO for me\n\n2. FCK content cap\n\nI would rather spent my time on a real game. ( Not to mention the bruh above saying it's a good shit LoL )\n\n3. It's a mobile game..\n\nOh NVM I already said that\n\n4. Vigor = Stamina?? FCK that!\n\nGTFO with your Farmville mechanics\n\nI'm done with my review. Game doesn't deserve any more attention from me.",
            "I've only played for a little bit this morning, but so far my biggest gripe is that the camera seems to be actively fighting me at times.  It's so hard to just look around in this game.  I saw an icon on the map but didn't see anything around me, so I thought maybe it was above me.  It's actually hard to look straight up, or as close to straight up as the game lets you.  It keeps trying to refocus back to a gameplay angle, so I wind up moving my mouse way further up on my desk then in any other game.  And that's when I'm stationary.  Moving resets it sometimes, other times it doesn't reset the view but suddenly my character is now moving that way even though I was left clicking which most of the time only rotates the camera.  I gave up looking for the thing.. and I'm not even sure what it was because the minimap has no mouseover or interaction at all, and the icon didn't show up on the main map.\n\nIf the rest of the game is great then small things like that wind up mattering less.  But so far I've only seen small things that slightly suck, and not a lot of cool features.  I haven't played enough to write it off and do plan on playing more, but it definitely could have made a stronger first impression.",
            "I’m disappointed by the combat in this game. My hopes were it having archeage fluid tab targeting but it feels very stilted. Graphically it looks nice but the poopy combat and the generic quests made me uninstall. I hope they continue to improve and I may try it in the future. Also the limited graphic menu (literally just ask u what frame rate do you want to play at, like come on even Genshin impact on pc has more) is a big Nono imo",
            "Yeah, i was playing a warrior and didn't enjoy it, so i switched to paladin and it was basically the same thing.\n\nThen i started to notice some minor details, like the fact that your portrait doesn't change after the character customization (which is pretty weak). It doesn't matter what you do, it will always be the default one.\n\nThe movement and combat are also very rough, i was playing gw2 minutes before the tarisland servers were open, then i hopped into the game and felt like something was VERY wrong, obviously i don't expect the same level of movement as gw2, but it was just too rough around the edges for me, even vanilla wow(which i am currently playing at turtlewow) has a better feeling to it.\n\nAs a rule of thumb, if a game is released day one on both pc and mobile, it's a mobile game, and tarisland certainly fits that bill. Albion online is also available on mobile, but the initial game release took place in 2017, while the mobile version only came out in 2021, and the gap in the quality of both games certainly shows the difference between \"mobile port\" and \"mobile game on pc\".\n\nApparently the ingame purchases are exclusive to each character, and not account bound. This straight up sucks.",
            "I played priest and all my skills were heal > heal more > heal even more > heal in an aoe > heal way more > heal more after you use another heal less etc.\n\nThe skill design is really 0 effort.",
            "Honestly, the only thing that's gonna keep me playing is the classes and the dungeons. Challenge mode and the class I (male wizard) play are surprisingly tight. \n\nI will say the way the game introduced you to raids and party style dungeons is pretty innovative and more games should do it. Even though it feels very low effort and low budget.\n\nWizard is surprisingly in depth, fire and frost play very differently and talents change the entire rotation and play style in some cases, and the augmentation (I forgot the name) is essentially a Diablo/poe esque talent tree so there's quite a lot of choices and content there.\n\nThe dungeons feel good. Like really good. Mechanics that make you actually engage and interact at least for a leveling dungeon. Challenge mode was a lot more difficult than I thought it would be, I don't see how anyone could clear library cm on mobile. One mistake will wipe the party. You have to space out the dot cleanse so you have to position yourself to use the portal at 30 stacks or higher. Cage mechanics on the second boss were aids since there's so much aoe and people die fast. Had a ton of fun doing it.\n\nOverall I was pretty disappointed though with everything else. This really is the worst of the genre. Dog shit mtx ($45 USD costume, $2500+ skin from loot box gambling unless you get stupid lucky with orange dupes, $21 CHARACTER specific battle pass and mounts,) ai translation, zero effort translation where it's not AI (the prince of the second city calls the girl his daughter when she's his sister...the text even says sister,) zero quality control, the story gets progressively worse due to translation errors and voice acting errors and effort, the genshin style \"exploration\" is absolutely braindead and the puzzles have zero effort like having to buy a cash shop item to burn vines off a chest and the notes have 3 words out of 6 paragraphs voiced so you have to open them to understand then and of course the translation makes 90% of them illegible, archeages labor system is in for professions and it's somehow 10x worse with gathering one plant taking up like half an hours worth of labor (called vigor.)\n\nI'll definitely play it for the honeymoon phase but Its hard to say how end game will play and how p2w it will be since they are unlocking a little more everyday.",
            "The game represents the worst in this genre. First off, its typical Chinese theft. So much directly ripped from other MMO's, right down to the races. Tauren from WoW, and Hrothgar from FF14, swift spectral tiger in the mount store etc. There is still a ton of Chinese text in the game, the localization is terrible with voice acting not matching the subtitles, or timing of their speech.\n\nPC optimization sucks - no ability to rebind keys to side or middle mouse buttons, and my game keeps entering windowed mode anytime a cutscene starts. Monetization is predatory and deceitful - battlepass and rewards are CHARACTER SPECIFIC with no indication thats the case until after you've made the purchase.\n\nThe aesthetic is undeniably beautiful, and the combat isn't too bad considering its basically a mobile game. But seriously, we shouldn't be supporting this type of garbage.\n\nEDIT: This sub and the Tarisland subreddit are absolutely FULL of bots/devs posting garbage posts hyping up the game. All with the kind of awkward grammar and sentence structure you can expect. Oh, and downvoting comments like mine lol (this post got to -5 karma within just a few minutes, and only now is climbing back up).",
            "It's a trashy mobile game. Mobile MMOs are the worst of the genre. Don't get me wrong, I'll have fun with it for a week or two but that's about it. I'm not sure if people were hoping it was something more but it's pretty clear this is just a flash in the pan. I get people are desperate for something new but they'll have to wait for Riot or Ashes or something actually decent to come out.",
            "Exploration is absolute dogwater tier. The 'puzzles' are so stupid. Legit embarrasing.\n\nThere was a chest covered in vines. Ok, easy, throw fire on it. I had no fire skills so I ran around looking for a torch or something like that. Turns out you need to buy a flamethrower from the shop (for ingame coins) and use it to open the chest. Boring and uninspired.\n\nNot to mention it looks there's only 2 actual zones? Very little to do. If you want some exploration, this ain't it. Play Genshin, ToF, WuWa for that.",
            "I know it's a mobile MMO but i've never seen a game with such bad cutscenes and animations in a while. I couldnt even make it an hour",
            "was actually quite impressed with the game myself, felt like they actually improved on wow in some areas, with the grouping and way bosses do mechanics and stuff, like seemed fairly hopeful, some good systems, ui customization was good\n\nwhen I rolled a 2nd character to play with my friend I realised about the thing you said, every class is the same with the same 7 buttons and talents seem to mostly be sort of passive buffs that let you specialise in one of those buttons in the same way on every spec\n\nI have no idea how none of the reviewers (even ones claiming to be unsponsored and unbiased) managed to mention this… it is a glaring flaw in the game that there is almost no reason to play one class over another other than the theme/visuals/feel of the spells, it really made me appreciate how varied wow classes are and made me happier to go back and play that",
            "is there some sort of psyop going on? who is actually defending this mobile shit game with time gate content that you usually see in mobile/gacha shit? mobile gamers brigading r/mmorpg? the other thread is insane. \n\n \"I appreciate the content cap\"??? who says this?? game's awful and about as much as you can expect from a mobile mmo. shit for pc or anyone wanting a good mmo experience.",
            "the game kinda made me consider giving WoW another go so perhaps it's good for blizzard.",
            "TLDR: Mobile game is a mobile game.",
            "[deleted]",
            "Cheap mobile game, that's all.",
            "Capped everything. No thanks. Its dogshit, everything is timegated as fuck.",
            "It is too early to judge, classes have different talents for those skills and they are unacessible for now\n\n  \nbut for mobile mmorpg this is a great game",
            ">You essentially get 7 skills:\n\nLike every MMORPG since WoW. Got it.",
            "Does it have GvG or RvR?",
            "I was hoping to have a chill game to play in bed with my ROG Ally.  Turns out it’s not compatible with it.  Using the touch controls is just tedious and uncomfortable after a while with my phone.",
            "Yeah people gotta stop buying in to these crap games it's 2024 and you trying to come out with some type of wish World of Warcraft. That combat is so trash how people still buying into these MMOs is crazy AOC and T&L same thing. I can understand games like star citizen and new world being bought and funded because at least it's an actual upgrade in something other than graphics and flashier animations. Gamers just gotta get better at realizing bull**** and not even give it the time of day when they see the trailer. By the time you realize it was some B's they already made their money and game developers just gonna keep pushing out bull. All these games lately just feel like straight up cash grabs with no substance.",
            "My review: Tarisland is Chinese Mobile WoW. It's clearly a mobile game who copied 100% of content from WoW and FF14, but added questionable mobile practices on top - p2w monetization, content gating, tons of daily quests. Content feels like a cheep copy, and it is a cheep copy. I found interesting only a challenge mode of dungeon (yes, one dungeon, others are locked by time gating), but it became boring pretty fast\nIt's made for Chinese children, so leave it to them",
            "It's meh",
            "I attempted to play the playtest in May. I initially couldn’t log in and then when I finally got in, I couldn’t connect to a server.\n\nI’m not surprised by any of the harsh reviews. I’ll eventually play it myself but I’m expecting it to be a time waste.",
            "Reviewing a game after you have seen 30% of the content is wild to me.",
            "The game won't let me use mouse buttons for keybind the 6 and 7 skills what a fail",
            "The game it is not fun, no emotion, no adrenaline, nothing.. its a true generic mobile game.. sadly",
            "I am a filthy casual and I do enjoy the game on both pc and mobile, ofc it’s no wow or gw2 but it’s something new and decent enough to have some fun. Tanking a dungeon on the toilet with my mobile and minutes later raiding on pc with my warrior is so convenient I love it",
            "Basically mobile WoW then? Better rename to Titanicland.",
            "they still kept the time limited pvp. completely bonkers. uninstalled.",
            "I have zero interest in the game and \"mobile\" mmorpgs in general, but I bet it's going to do very well in terms of moneymaking for the company. The mobile market is absolutely blasting off for games like this.",
            "Game is pretty shitty. Like any other mobile mmo. Like any other mmo novadays",
            "Agree. After waiting all that time and countless cbts, that's what we get. Clunky control and movements and just spamming of skills",
            "I'll have to give it a try. I've been playing a lot of Wuthering Waves on bs lately and wanted to try something new for myself and I think this game will be great.",
            "Review after completing 5% of the content that the game has to offer? Wow very accurate LOL",
            "Of course the menus are good. Shininess is how these games sell product so they have to come off as attractive as possible before the gameplay becomes apparent.",
            "Thankfully I expected a mobile mmo and that's what I got. Given the options out there for mobile MMOs, it still puts it leagues ahead of most others.\n\nThis was never going to be a PC game ported to mobile. It was always the opposite.",
            "Im enjoying it for what it is and holding judgement. I dont think a few hours of game play from the first day of launch is a good barometer to judge a MMO.\n\nI am more interested if any depth opens up and what end game looks like.\n\nNW looked great.....Combat was genre defining....Game turned out to be a potato.",
            "It so promising, having fun so far. I also love how the game encourages me to step outside and take a break.",
            "Can't believe people were so desperate for an MMO that they were hyping this game up.",
            "So far I’ve enjoyed it well enough for a mobile option. It’s not going to be like…my main MMO, but I could see logging in on my iPad for a bit a few times a week. \n\nWe’ll see how it holds up, but it’s nice to have something on mobile that’s more modern and not PvP focused.",
            "ppl was really expecting a playable mmorpg? From day 1 we know it was a MOBILE game \"ported\" to pc, not sure why ppl was so hyped with this game.",
            "tried it for about 15 minutes and was very disappointed. the combat felt stiff, the limited camera movement annoys tf out of me for some reason, the story is awful, everything about this game screams generic and cheap.\n\nand they're about to have a repeat of what happened with tower of fantasy, server capacity filling up too fast, and a month from now 90% of servers will be empty and people will be stranded there. took them over a year to do server merges on ToF.\n\nthe only redeeming qualities of this game are the graphics are decent and the game is free.",
            "I uninstalled after 20 min when I realized u only have 7 skills total. I wouldnt even say 7 more like 3 skills cause 2 of then are buffs and the other is like a basic attack. Super dissatisfied",
            "My favourite part of these reviews is that there are already \"good\" well established MMOs out there yet people had some wild conception that these will top MMOs like WoW, ff14 and GW2.\n\nIt's very amusing.",
            "I tried it out but felt really bored. Mobs ai is just to stand, tutorial's boss wasnt much fun and felt so boring, I literally checked settings while npcs killed it for me. After 15 minutes of playing I had to turn off the sound cuz it was so annoying to listen to lol. Main thing that made me left though was the fact that there was no progress outside quest or completing dungoens for gear piece? Mobs have no drop and seem to give no xp or at least I didn't see any indicator showing anything and I don't want to play game of running back and forth to npc for an hour just to max my character and then do dungeons to max my gear. If that's what mmorpgs are like then I guess it's not for me.\n\nThe other thing was the fact that there seem to be no option to switch mounts, at least for now. I had rhino mount and the next minute after collecting unicorn mount I tried to switch to unicorn and had no option to, I go to next place and I suddenly have unicorn mount. Really weird.",
            "I don't think it's fair to say that classes play almost exactly the same...and you're not helping your case when you're being needlessly reductive and borderline dishonest on some key aspects/abilities:\n\n- Each class has its own resources/meters that do interact with the kit (e.g. Necro's spectral; Bard's chords).\n\n- \"*Skill 7 is ultimate*\"(/burst): Why not say what each \"ultimate\" does? Since it changes from class to class (and spec to spec) I guess it doesn't fit your narrative of all classes playing exactly the same? Just to give a couple of random examples: DPS Bard's gives you a random chord effect after every single musical note cast, and you can cast Chord Score after every note. | Healer Necro's turns your ST main heal into an AoE one for the duration + it gives a boosted DR effect if Soul Link is active. (\"ultimate\" is not even the correct term btw, as the game calls \"ultimates\" the general utility spells like blink, dash, etc for some reason).\n\n- If you think general gameplay is just mindlessly spamming every spell as soon as it comes off of cooldown you're gonna have a really bad time in any challenge mode group (or even just Elite dungeons honestly). I've seen people play like that and, surprise surprise, their damage at the end of the dungeon always turns out to be atrocious.\n\n- \"*The gameplay/combat is just way too mobile(simplified) to get past*\": Literally evaluating the first 30 min of a MMORPG and basically its first dungeon (which, btw, for being your \"real\" first dungeon with other players, Library is extremely mechanics-rich). Sure it's not the most complex/deep game that ever released, but idk, it seems to have enough stuff to be fairly interesting in its own right, especially if you actually approach it with an open mind and not with some \"mobile bad\" preconceptions (which definitely transpire from your post).\n\n&nbsp;\n\nIt goes without saying that the game is not without flaws (in fact, it has **a lot** of them; Stuff like the vertical camera sensitivity or the little to no care for the english translations are inexcusable)...but let's not just lump everything into the \"mobile bad\" argument just because.",
            "XD so the exact experience I had then in my analysis of the game",
            "It’s F2P WoW with hot female characters and nice graphics. I can’t stand giving money to a company like Blizzard so I’ll try it I guess. Can’t hurt to play an MMO again after getting stunlocked by gachas. (Still waiting for T&L - Blue Protocol)",
            "Put the game down, come back in 4 days or whenever lvl 40 is, try it again with all the talents and content available, the fact you did this big write up on day 1 is crazy.",
            "It's a good mobile game, terrible pc game. Reminds me of Diablo immortal in that regard. Go into it with that mindset and you'll enjoy it more.",
            "I feel like blizzard is paying bots to make all these posts",
            "Don’t really care how it looks. I mean millions of people still play minecraft, roblox, RuneScape etc.\n\nGame is fun. Nothing mind blowing. Better to play with a group of friends or a guild.",
            "Just got to level 15, started this morning. Chose Bard. I'm enjoying it so far in all honesty. I've played WoW for 14 years and not really any other games. This is the most I've enjoyed something different. Looks clean. Yeah, the combat is a bit boring, but isn't any MMO right now.",
            "Thinking you can spam your spells in arena/real pvp is like saying the same in WoW arena. If you don’t time your spells to counter/run/block/CC their spells, you will get absolutely rolled. Fewer skills just means playing your skill timing even smarter in pvp than an MMO with more skills. There is definitely still plenty of strategy and skill.",
            "I tested the game and have played through the progression. The combat is advanced enough have you done dungeons? PvP? I doubt any raids are open yet. The prog right now the game is lv prog is capped and will update every week  or two,with new zones which gets harder and harder to keep up with. I wrote a review but the mods didn't release it. So your not really at lv and most stuff isn't released yet.",
            "Why doesn't anyone listen to me?",
            "On mobile you can target AoE by tapping the icon and then sliding where you want it to go. So the function is there, but maybe it’s not translating to mouse/keyboard well",
            "The performance is bad and oddly seems to have gotten worse since testing. You can get skins through achievements that are dope. Make sure you do everything and I mean everything because before you know it you will be behind if you don't. The progression schedule gets daunting fast. You will have to choose a main at some point because you won't be able to keep up with everyone.",
            "You can ground target AoE if you don't have an enemy targeted. There's also some debuff/cleansing mechanics tied to abilities that will make order matter when tougher mechanics are unlocked. Everything else is on point.",
            "Throne and Liberty",
            "What about all the exploration, photos, side quests, and the tower boss with multiple floors?\nDid you do the Library of Chaos dungeon Elite on challenge mode? Challenge mode was really tough, 1 error can wipe out the party.\n\nI had plenty of fun and a lot of time invested in a single character. I appreciate the content cap. It limits how much time you can (and therefore have) to dedicate to have a chance to be on top of the rankings",
            "I gets really hard to keep up with yea there isn't much now, but you will very likely fall behind because you didn't think to do something you take for granted now.",
            "I prefer this more than those grindy MMO where 24 hours is never enough. I feel like it's more a \"game\" to destress after a long ass work rather than \"another work\" where you have to complete dailies for 5 hours everyday.",
            "Issue is it does nothing new its just a solid replay of an mmo.",
            "This is beginner lv stuff they will release like 5 more zones, and keeping up with content gets very hard. It is capped so neck beards don't run away day one. I have played all the classes in testing though all the prog and the only class I didn't really like is mage. It is a great game, and people should not judge it by what is there today because it will change in a week or two and every week or two after. If you like the game do everything to cap yourself because otherwise you will realize you are already behind.",
            "same feeling",
            "The camera is one of my biggest gripes aswell (together with the godawful translations). Sadly it seems to be one of the few (or many) \"mobile first\" design choices (since on mobile you will hardly scroll \"up\" and move your camera too much). However...I don't see them just ignoring this and leaving it as is.",
            "Overall, the game felt too convoluted and shallow at the same time.\n\nWhen i opened my inventory for the first time, there was a button to repair my items, when i pressed it, the game took like 1 silver coin and that was it. No skill, no resource usage, no reason for this system to exist, nothing. I stopped and thought to myself: \"why?\" It was purely a time waster with no use whatsoever, only an inconvenience that would certainly torment me later.\n\nAnd come on, 4 currencies? Really? Do we need 4 types of money in the game? If they want to do this mobile game monetization scheme, just take the supercell route of gold/shiny shiny gem that costs real money.\n\nThe exploration was really boring, the characters and classes were boring, the lack of visual progression aside the purchase of skins and an eventual level up was absolutely boring. It almost feels like there's nothing to enjoy in this game.\n\nBut as you said, the party hp display was pretty cool, just like an in-game built addon.",
            "Yea priest was going to be the next class I was going to try since I didn't interact with healing much but I just couldn't bring myself to do a sixth character so instead looked up a priest guide. And yea.... that's what it looked like to me so decided to call it quits.",
            "One of the silliest microtransactions is that you have to pay a couple bucks to name your pets lol. \n\nI mean it says \"rename\" but you don't get to pick a name first at all unless you pay. \n\nI know it doesn't really matter if you can name your cosmetic piers but the fact that you have to pay money to name each one if you want is pretty silly.",
            "I played for 3 minutes before uninstalling because I genuinely think they ran the translations through AI and then had AI read the lines. I don't think any voice actor would actually do this unbearably bad dialogue. Nonexistent lore/story that throws you directly into a cliche plotline about nothing, awkward combat, terrible monetization. It honestly feels like a bait and switch from all the marketing.",
            "The Ranger seems to be a carbon copy of the BM hunter from WoW. Arcane shot, barbed shot, and kill command are abilities 1, 2, and 3.",
            "Par far the course for an Eastern MMO. Plagiarism is considered a way to honor the source; knock off assets, mobile phones, ear buds, electric vehicles. It's socially acceptable because, if you produce something that someone cares enough to copy, it means you did something right. So then you get people creating knock offs hoping some of that magic rubs off on them so that others copy you.\n\nIt's \"why reinvent the wheel?\" to the extreme and embedded in the culture. It isn't fundamentally malicious; it's just a different philosophy that clashes with Western independence and sense of creative ownership.\n\nSomeone's going to say I'm saying the quiet part out loud but it's just the way it is. That doesn't mean people don't abuse this philosophy by creating cash grabs, but that's how it's justified at the end of the day.\n\nOf course, let's not forget the age old adage of \"if you aren't the customer, you are the product\".",
            "The game has tauren? The zerker is a lion...",
            "Considering you made a whole thread and called it a review ,I'm guessing you're just mad. Don't know why, if you don't like it, don't play it.\n\nBut let's not be delusional and pretend that Blizzard or FFXIV created those \"species\".\n\nConsidering the game was called \"wow copy\" ever since the first trailer, it was to be expected.\n\nI think it's too soon to judge the game in depth since it's kinda obvious that it's taking a very \"casual\" approach with level cap raising day by day.\n\nDoes the game have flaws? Yes it does.\nI think people will play it to kill time until FFXIV expansion is released and until T&L comes out.\n\nGame has no visual armour/weapon progression system - I think that will deter most MMO fans.",
            "Its a undeniably fun game m8. I was a tester for it and have played through the prog it gets real before you know it. Half the people playing will be behind in a few weeks as they add content. The optimization is bad and seems to have gotten worse since testing.",
            "Chinese bots?? Lmaoo I downvoted you because this take was really bad",
            "Same for me , i think alot of people feel the same. I believe this game will last a month max maybe less",
            "Out of curiosity, do you think another solution is partying up with a fire user?",
            "I agree. The game is actually pretty damn fun.  The group dungeon and the PvP battle grounds are pretty fun.  Very good movement for a tab target game.   Looking forward to the raid tomorrow.",
            "No idea if people are crazy or this is sime kind of astroturfing or silent marketing posing as user, same with trying to hype up Throne and Liberty or Blue Protocol.",
            "This is definitely a MMO that I can understand why others would enjoy it. There have been plenty of MMOs I've tried where I couldn't possibly imagine someone enjoying their time.",
            "Besides the limitations in skills, how can you tell it’s a mobile mmorpg?",
            "Order and Chaos  1 was magnitudes better than this, and it ran on an ipod touch over a decade ago.",
            "what do you mean by this? are there talents at higher level that change your skills?",
            "Battlegrounds and arenas (Though they are only available certain times of the day) also World PvP doesn't exist I'm pretty sure",
            "It has crafting, bgs, exploration, dungeons, and raids all of which are part of progression in synergistic its very well designed in that respect. The dungeons the first week or two will break bad healers. It gets easier as gear scales though.",
            "The original Order & Chaos was leagues ahead of this game. Sure graphics have come a long ways in a decade, but OC had what Tarisland lacks.",
            "Please quantify what you think a pc mmorpg is compared to a mobile mmorpg. Please list some differences.",
            "But do you realise that in Tarisland you can reach max lvl in 1 hour? 1 day of playing that and getting 5 classes to max level is a pretty good indicator for such a game.",
            "I agree, there could be some depth later in the game. It appears each class mechanic is extremely similar at this stage. I could see the appeal to maybe just chill on the couch on your phone and play casually every now and then.",
            "tbh I’ve done those dungeons on all the difficulties and just spam whatever comes up, think the only time I wasn’t the top dps was when I was tanking and I was 2nd\n\nlike what you are saying about random buffs and whatever from your meters is true, but again it is generally true of all specs in a similar way, and even when there might be differences, the gameplay is not meaningfully different at the current level cap… paladins shield resetting when you cast a spell is about as different as anything has felt so far\n\nI can’t imagine someone playing just any two random dps specs in the current state of the game and feeling like they are unique",
            "I didn't describe each ultimate because honestly the abilities kinda all blend together when i think about each class. I'm sure there's some outliers though (my friend played bard and said there was some \"choice\", overall he didn't enjoy the game though)\n\nBetween War/Barbarian/Rogue their kits were basically the same (maybe the ultimates were different I cant remember).\n\nPhantom Necromancer was probably the most unique character I played but I really wanted to play and enjoy a melee class.\n\nRanger was probably my least favorite class, beast spec was entirely just spam central and the sniper spec requires you to stand still as much as possible (who wants to do that?!?!?)\n\nI agree though I think the Library dungeon is fun. I appreciate the mechanic heavy approach in such an early dungeon. I have no complaints about the dungeon.\n\nI also understand its only level 20, it just really felt like the class mechanics were just copy pasted.",
            "He is also not wrong though nearly every class plays like a wow rogue stacks/fire. Not that they are not different like the three tank classes one is mid, one heals, and one avoidance just like in wow. Healing is along the same lines yes they are all different, but they do all pretty much play the same. Which is good and bad. Healing is very hard at times in this game Tanking is much easier than wow, but much harder than something like ff14 which is a joke. As some that was a wow prog raider for 10 years when the game was real I think they did a fantastic job on Tarisland.",
            "Please define the limitations you can see on a mobile game vs a pc mmorpg. Besides skill availability.",
            "A new MMO comes out people are going to comment on whether they liked it or not, it happens with music/food/movies whatever. Not sure what is bot-like about my post. The game also does some things VERY well, probably the most stable launch I've been apart of, I had zero issues. Like I said it might be my favorite UI in an MMO at this point (DPS CHARTS IN THE GAME AT THE START). \n\nUnfortunately the gameplay/combat/class design is incredibly based around mobile users.\n\nIf a person starts a post saying great things about Tarisland are they a Tarisland bot? It's ok to have a discussion about a video game on a video game forum.",
            "[deleted]",
            "You can target it yourself on pc too, but you need to change a setting or not target something.",
            "You can target it by long pressing the skill key, then the targeting reticule appears",
            "Holy shit...there is so much copium in your post\n\n  \n\"I appreciate the content cap\"\n\n  \nLOLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLL",
            "Idk why people are downvoting you. What you're saying makes sense.",
            "I'm with you regarding. the content cap. I ran out of things to do and I'm glad I was able to log out without having the feeling of getting massively behind. I really like this system for a secondary MMO, without it I definitely wouldn't continue playing since I already dedicate more time to other games.",
            "i was in the library dungeon being chased by the wolf, as i was running away i held left click down and panned 180 to look behind me as i was running to see how far away it was from me and my character turned around and i ran right into it lol i dont seem to see any option in allowing to look around with the camera while you are moving in one direction",
            "Yea the voice acting has to be AI, it gets pronouns wrong, and doesnt always match the text. The cadence is weird as well",
            "Look up \"FF14 Hrothgar\" and compare to \"Tarisland Berserker\"",
            ">But let's not be delusional and pretend that Blizzard or FFXIV created those \"species\".\n\nDude, its not 'similar' to WoW's Tauren.  \nPlenty of games have minotaurs.  \nThey are identical to tauren. Their houses are native american teepees, with the same color scheme.  \nTheir towns look the same.  \nThey have the same native american tropes.\n\nIt isn't Tauren-esque, it is a one-for-one near replica.",
            "\"Considering you made a whole thread and called it a review ,I'm guessing you're just mad. Don't know why, if you don't like it, don't play it.\"\n\nGot it, so only people with positive praise of a product are allowed to make a post about it on Reddit. Makes total sense.\n\n\"But let's not be delusional and pretend that Blizzard or FFXIV created those \"species\".\"\n\nLets not be delusional and pretend that the art style wasn't completely ripped from the aforementioned games.",
            "\"Don't know why, if you don't like it, don't play it.\"\n\nIsn't this an MMORPG reddit? You don't want people to discuss games unless its just to shill them?",
            "You're joking right? Its just a coincidence that all like....10 of the comments in this thread being critical were all downvoted within the first minute or two after they were posted, and are only now climbing back up?",
            "I didn't think of that but if they can't even put a torch nearby I don't think you can use fire skills to open it.",
            "How much does it cost to rent a propaganda troll from the Chinese government?",
            "If you’ve played any mobile rpgs/MMOs you know the look. The feel. The menus how the ui buttons are all over for all the menus. The iconic red dot notification for claimable rewards all over the screen. \n\nAll that to say I enjoyed it and look forward to getting up at 1 am to rush the next cap lol",
            "Dude, i am a 35 yo mmorpg veteran. I was there for everquest, i was there for wow vanilla, i was there for guild wars 1. Do not tell me something like \"how can you tell\" etc. I surely feel in a minute what kind of a game it's.",
            "I feel you. People immediately think that mobile = bad. Toram, a mobile mmorpg, still has the best combat system I have ever experienced in any MMORPG, be it on console, pc or mobile. Also, absolutely no P2W.",
            "Would love to hear an answer to this, because I looked a bit at the talent trees and I swear most the talents I saw all across the classes I played were %damage increase/%crit increase.",
            "Not just in high lvl. I created a lvl20 Bard and I had a chance to change my third ability to something else in both skill tree (dmg / heal) if i spend my point on it.",
            "A pc game is a serious game. I expect no pay to win nonsense, no energy system, a game that relies on the gameplay itself to be good enough to hold my attention and not 500 submenus with 500 random currencies.",
            "Dude what? Its time gated everyone is capped to level 20.....the levels go higher....are you guys ok? I think you are foaming at the mouth too much with anger for whatever reason that your not even really looking into the game.",
            "The way progression works in the game is that it changes every week or two as new zones, story content, and crafting is unlocked.",
            "> [...] think the only time I wasn’t the top dps was when I was tanking and I was 2nd\n\nThe avg player seems to be extremely bad in general. Between people standing in AoEs, ignoring mechanics altogether, pure healbots & co...no wonder sometimes you can get top dps by mindlessly spamming :)\n\n&nbsp;\n\n> the gameplay is not meaningfully different at the current level cap\n\n\nI would agree, to some extent. While some things might feel very similar right now for some classes (again, we're talking about the first 30 min of a MMORPG), just looking at future talents and even just the core skills the specs offer, you can see things do branch off quite a bit. It's not peak depth of course (was never meant to be, this thing has to run on mobile too afterall), but even now managing buffs, procs and cd timing do play a pretty big part in how you approach fights (mainly challenge mode and the hall), and those do change the feel from class to class.\n\n&nbsp;\n\n> I can’t imagine someone playing just any two random dps specs in the current state of the game and feeling like they are unique\n\n[Literally any DPS spec] ≠ DPS Bard",
            "Admittedly I haven't tried any melees as none of the class fantasies presented really pulled me, so I can't really say much about those (decided to focus on ranged instead; Bard and Necro in particular, especially the healer specs).\n\n\nNevertheless, I don't get how/why you're still saying that the class mechanics are \"copy-pasted\" (making a general statement about all classes) when in this very comment you say how they actually play fairly differently and have different playstyles (e.g. ranger beast vs ranger sniper).",
            "I mean, you can reduce everything to \"the same\" if you try hard enough. At the end of the day most WoW healers just heal...be it through HoTs, spot heals, burst or whathave you...same for a lot of FFXIV classes (especially tank and healers having very similar base structures).\n\n\nIt really comes down to how fun they are to play and if they manage to fill a certain class fantasy (flavor-wise)...plus, obviously, it's a bit too early (it's literally lvl20, you can get there in 30 min lol) to say any of that with any degree of certainty.",
            "It's not the limitations im talking about, it's the design choices mobile developers decide on. These games aren't designed for the north American market",
            "Lmao nailed it.",
            "It's content cap for a day. With new content everyday through July 1.",
            "Well they aren’t wrong. Content cap is a good thing, especially when it comes to endgame",
            "Exactly this.",
            "Nah maybe it’s because people are enjoying the game?? I’m playing it rn and am having a fun time. If anything you sound like a doomer bot lol. Go outside man, go talk to people, have fun. You sound miserable",
            "Why would I know that?",
            "the person said it changed their skill, from what I looked up it changes one of your skills in to a dot instead, so does actually change it, but from reading online it basically changes your rotation from 1-1-3 spam to 2-2-3 instead, with the aoe rotation being spam 5 lol… which is closer to my experience of the game",
            "hmm I would have to see if it actually made any difference to gameplay but nothing else really seems to do anything more than just making you prioritise something a bit higher or lower",
            "Ok so technically a pc game could also have these same issues? Just because it’s a mobile game doesn’t mean it can’t have those features you listed. This seems to be a common misconception among pc players. There are also way more mobile games out there and lot of trash so that can sometimes skew perspective I understand.",
            "Yes, I mean lvl 20 for the first wave, which is still max level",
            "can I see that they branch off quite a bit? I looked through the whole talent trees of a few different classes and I couldn’t find anything that did anything more than “make your 2 better” being next to “make your 3 better” and you choose between them\n\nI dunno I looked up a bard guide and the thing just says you spam either 1-1-3 or 2-2-3 depending on build\n\nmaybe you are used to simpler games and I’m not or something? I’m coming from wow where its difficult to even play the game properly if you aren’t tracking certain buffs and what not that you have on some classes",
            "I think we are talking about different things when it comes to class mechanic. Sure the playstyle is different between specs/classes to some degree but I'm talking about the literal mechanic of the class. War-> rage, rogue -> poisons, barbarian->beast power. It was all the same and how you used your skills was the same too as I described in the initial post. Even phantom necro souls mechanic is the same as the melees, 1-2 builds souls, 3-4 spends the souls.\n\n I know its level 20, but it's already hard to get into an MMO that has gender lock and next to no character customization/visual progession now I have to choose between classes that don't have an identity.",
            "Thanks for your reply",
            "you people need to understand that calling garbage garbage doesn't mean people are angry.",
            "Being critical of a predatory game in my favorite genre clearly means I'm unhappy and need to go outside. I was attacking a product. You are attacking a person. Seems clear as day who is in the right here.",
            "I figured as much.... Thanks for the info!",
            "Of course on a literal level the difference between a pc mmo and a mobile one is that one is on pc and one is on mobile.\n\nMy point was more that pc players tend to have a certain standard for games and tend to reject some undesirable elements that mobile games can often get away with adding.",
            "ok man lol holy crap yall are angry at this game",
            "I meant branch off from one another (1 class from the other), otherwise yes, there seem to be only a couple of build paths for each spec, which is fine.\n\n&nbsp;\n\n> maybe you are used to simpler games and I’m not or something?\n\nLol, sure bud. Nah I've played plenty of MMORPGs in my life and had my fill of the more complex ones no problem (e.g Dofus, FFXI's Odyssey, high m+, Ultimate raids...you name it).\n\n&nbsp;\n\nAs for Bard in particular (since I played it quite a bit I can go a bit more in-depth with it), you either didn't watch/read a good guide or simply didn't grasp the small intricacies from the note system the class has.\n\n\nFor example, Passionate Play gives you 3 free plays of whatever chord you have (if you use it while you have 2 notes loaded); Also, Powerful (blue) + Powerful (blue) + chord will leave you with 1 leftover blue, making it easier to go into another chord right-away instead of having to buffer an 2 additional red to go into the dmg buff chord (which = to more damage if you don't have to refresh your buff).\n\n\nAnd this is all without considering how you can swap for purple notes or have bonuses based on alternating different chords for extra damage...and I don't think I need to tell you that both do change things quite a bit.",
            "Congrats bro, here’s your Reddit cookie. I’ll let the Chinese bots know to stop downvoting you 🫡",
            "pointing out garbage doesn't make people angry. Honest is a better word to use.",
            "not angry mate, but this game is just trash..",
            "It's actually blue+blue giving you a left over blue. \n\nThe depth for bard is still minimal tbh.\n\nSwapping to purple notes changes nothing, just that now instead of a 2s channel you put a stackable dot.",
            "idk nothing you’re saying sounds like any meaningful gameplay change, I don’t really know bard very well but not really interested in reading more essays unless you can give a better example",
            "Thanks for the cookie. It was well earned.",
            "\"Give me a better example\" > \"Not interested in reading any more essays\"...you don't seem interested in having an actual honest discussion so, have a good day :)",
            "Either all the classes in this post that people are complaining about are extremely similar and Bard is the single outlier that has some complex kit or maybe this guy is coping. I'm not going to install again to play bard and find out lol",
            "oki",
            "I know, kinda just feels like he is over explaining what is really a very simplistic mechanic, but maybe there is something more to bard! I am really looking to know if there is more depth to the game, my experience so far makes me very suspicious of how that person is typing though",
            "He's just over explaining what it really is. In terms of mobile MMO it has a little more depth with classes then others but with that being said what you originally said basically sums up the current status for classes. Especially when you think about it outside of mobile game realm. It's simple with a little flair but not enough flair to be considered unique."
        ]
    },
    "Albion Online is actually very cozy game": {
        "title": "Albion Online is actually very cozy game",
        "score": 9,
        "url": "https://www.reddit.com/r/MMORPG/comments/1dlrslj/albion_online_is_actually_very_cozy_game/",
        "content": "Even tho i prefer PvE style more than PvP i still enjoy it and just play carefully in black zones and not fight with stronger players. Your horse is almost a \"safezone\" for you, clever use of it makes you very hard to gank.\n\nGraphics, atmosphere, sound - everything so cozy and smooth. Similar feels like WoW once. But gameplaywise it reminds me more of LoL and BDO, with addition of full loot in black zones. \n\nP2W aspect here is very low in my opinion, maybe even less than in BDO. Not much reason to P2W besides premium or vanity skins here, no additional combat stats and etc, also full drop rules in high end zones won't give much desire to P2W top gear. Compare it to something like Diablo Immortal, LOL, that was true P2W garbage where a single whale can wipe out lots of F2P.",
        "num_comments": 31,
        "comments": [
            "since the addition of awakened weapons which are prohibitively expensive and insanely powerful, i think \"low p2w\" is an understatement\n\nthe average player is not going to be grinding 100 million+ silver, and if they do, they're not gona spend it on awakened weapons. it's a whale exclusive thing, effectively.",
            "I love the pve in albion, wish there was more. Unfortunately I'm an NA player and our server has  been split two times so trying to do pvp is tough these days and the pve gets old quick. Not to mention I'm a night owl, so game is pretty much unplayable for me. I'm already 120 in weapons and t8 gathering so non lethal zones are useless. I got my hours out of it before they ruined the game so I can't complain.....but damn I miss old albion. It really was the best game out there before they did it dirty.",
            "Weirdly, Albion is probably the most P2W game that has been \"embraced\" by the western market. You can quite literally buy in game currency, go to market buy BIS items and skill tomes and get a fully kitted out and leveled up character day 1. \n\nHowever the combat is highly skill based and full loot, and a F2P player also has access to same items through hard work/skill so people tolerate it.",
            "A lot of people just hangout in nonlethal zones to progress and won't bother with lethal. It's nice way to chill.",
            "PvP is great in game.if they added more pve content then game would be number 1 mmo",
            "Says ''cozy game'' for open world PVP game lmao",
            "Do you play alone? I do like the game but I heard playing alone is extremely difficult",
            "still, can be an amazing game but any type of P2W ruins the entire experience. Pass",
            "Honestly Any mmorpg is cozy when you play it with that cozy mentality.",
            "Yeah i dont get the \"game is pay2w\" argument, youtubers make zero to hero challenges and end with 30kills 1 death or sometihng so clearly skill is the important factor here",
            "Yes, it's really boring.",
            "Right there with you. As someone who started since release and has 1,500 kills to my name specifically (not including all the kills i helped with but didn't get the last hit for) i wish there was more PVE.\n\nThe PVE that's there is fun to me but after spending countless hours running the same hellgates/static/random/corrupt/ava dungeons.. it gets boring. There's like maybe 50 unique mobs in the game and 20 unique bosses?\n\nThey also needed to add more hand crafted elements to the world over time. Seeing the same terrain and points of interest on every map got so mind numbing. Every map just feels the same and there's no sense of adventure. Its part of why i don't play anymore.",
            "> You can quite literally buy in game currency, go to market buy BIS items and skill tomes and get a fully kitted out and leveled up character day 1.\n\nIts the same with Eve Online too, yet no one says boo about that. its kind of an interesting aspect of full loot PvP games how a lot of players view this as a good thing because it provides an opportunity to stick it to exactly the type of person who would pay for an advantage in video games by stealing their shit.",
            "'Win' what, though? Because of the nature of guild and alliance politics and PvP, even if you gear up and win the *one* confrontation, you'll likely have a target on your back and the other person's team will catch you some day later.",
            "Probably Old-School RuneScape even more so since it's one of the most popular MMOs.",
            "Then you just explained pay to progress instead of p2w. Ive tried this myself in the first time thinking its pay to win as well but ended up getting farmed by  pvpers and group gankers. 9k gold gone. So i cant say its p2w but I would say the progress on this game is REALLY slow as if SBI is trying to say get a premium, yellow zone contents are just small part of the game and most real content are on the lethal zones.",
            "Albion is very fun alone too but you’re very restricted in the content since most of the content is group content.",
            "Skill and experience out weight p2w every time. Any veteran player loves when they see a swiper coming their way.",
            "P2W includes using real money to purchase Player Power, it is P2W",
            "> Then you just explained pay to progress instead of p2w\n\nThis is the dumbest attempt at rebranding I have seen in a long while. In stat based games progression and victory are closely linked. Trying to pretend theyre not the same thing is silly and more than a little dishonest. Just because you suck at it doesnt mean you didnt have an unfair advantage over those folks who farmed your wallet.",
            "Thats pay2win. Its the same when people try to qualify monetization as \"pay 4 convenience\". Its still pay2win. Just because you're not actually winning doesn't mean anything, thats just what ita called. If you can pay real life money for an in game advantage over someone else who doesn't spend real life money, that game is pay2win.",
            "P2W doesn't mean that you can literally pay to win. It means that you can pay to get an advantage. And you can 100% do that in Albion in many ways.",
            "Then thats pay for power then, even if thats your definition of winning, paying on this game doesnt give you power at all. Even you pay, you just get farmed by pvpers and group gankers.",
            "Then all games are p2w i guess, unless they're only monetizing are cosmetics.",
            "Cool?",
            "Your definition of P2W is way more restrictive than what is commonly used. To me it seems like you just do not want the label P2W to apply to your game of choice.",
            "So how would you define P2W? That no matter the matchup the player that has invested more money will win 100% of the time even if it’s down to a penny? Or the more realistic definition of the ability to overcome a lack of skill with real purchasing power?",
            "It's bad."
        ]
    },
    "Duality of the MMO Man": {
        "title": "Duality of the MMO Man",
        "score": 73,
        "url": "https://i.redd.it/dqtr8pl8yy7d1.jpeg",
        "content": "",
        "num_comments": 51,
        "comments": [
            "The top comment is the Average MMO fan and the second comment is the Veteran MMO fan. \n\nThese devs/producers can talk all they want but until they show us something, the majority wouldn't care or hype it up. I mean look at how hyped Pax Dei got hyped and they went on to sell founders packs in the earliest stage of development rofl. \n\nWe just keep getting shit on by these companies but people still believe and keep dumbing money into them like fools.",
            "I mean, as the person hyping things… I get it. Part of the reason that we held back for years in saying anything about what we are making was because of this too. MMO players are tired of promises with nothing to back them up. We felt we needed to wait until we had real stuff to show. \n\nTo my mind, MMOs have drifted a fair amount from the original premise, and the promise they held. And we are out to change that. \n\nAt the same time… The reality is that it isn’t realistic for a studio to just drop a finished game, not unless they have many millions to drop on a huge amount of marketing right then. You have to build audience organically over time, and that does require a certain amount of stuff like what we are doing.\n\nI hope that the folks who are burned out on empty promises just give us the benefit of the doubt and wait to see what we show; and that those who can still get optimistic about the future follow along a bit earlier and start sharing hopes and dreams for what the game and the genre can be. It’s only a ten day difference after all. ;)",
            "First player clearly say \"I like it, but it might be super niche\" while the second say \"this dude couldn't make anything worth for 20 years, it's bound to be trash (most people won't like it)\"\n\nSo they're basically agreeing over different point of view. No duality.",
            "\\*Average human being with opinions.",
            "Average MMO enjoyer vs. average r/mmorpg poster.",
            "\"Man, this other faceless group of people that can be generalized by perceived overt negativity in their opinions sure are a bunch of losers. Am I right, my faceless group of people that can be generalized by perceived ignorant naivety in their opinions?\"",
            "that's not a duality. You can be excited of something and still recognize that there's a good chance that what you're excited for probably won't amount to much in the end",
            "I’m sorry but if anyone deserves the benefit of the doubt, it’s Raph Koster.",
            "Me being happy playing good ole Phantasy Star Universe from 2006 on a private server. 😵‍💫 If you don't like FFIV, WoW, or GW2, you're shit outta luck, or you like gacha games.",
            "I think we just live in a world of extremism.\n\nEverything makes you laugh is \"the funniest thing ever\" or how you \"literally died\" when something mildly inconvenient happened",
            "Absolutely nothing to do with \"MMO man\". You would see same type of replies if, for example, you'd go to /r/pennystocks, or some random cryptocurrency subreddits ;)",
            "Oh wow, entire post about my comment (2nd one) XD How nice.\n\nHere is the thing. You people don't even know what You want.\n\nYou want theme park games, but then you complain that You run out of content in a month or two.\n\nYou want sandbox games (like I do), but they do not make any money because the majority of normal, casual players will avoid them because there is very little handholding in them.\n\nYou want survival, but having to eat every 15 minutes is no fun.\n\nYou want PVP, but You complain when what You are doing is interrupted.\n\nYou want progression and depth, but then You complain about the META.\n\nYou want multiplayer game but then You play it solo.\n\nDo not take my comments seriously. I lost complete hope in the MMO genre. The only game I'm returning to regularly at this point is EVE Online. And that game is over 20yo. And I do not even know why I'm returning to it. I'm 37yo. I have no time sitting in 0.0 and playing politics.",
            "Reddits ordering of comments presented this gem of how we are about any game.",
            "only in the MMO industry do fans look at someone who hasn't produced anything profitable in two decades yet still get excited about his new project.\n\nBrad McQuaid, anyone?",
            "It's sad how jaded people are. Most of them don't even remember what MMORPGs were like originally because they were too young.",
            "Some people love to claim that this sub is jaded and everyone here just hates MMOs, but the reality is that this genre is absolutely filled with dead games, overpromised and underdelivered products, and exploitative monetization tactics. You're not jaded by not being hyped, you're simply realistic about the situation.\n\nSeriously, I want anyone to point me to a genre that's worse off, because I honestly don't know of a single one that gets so many half baked and exploitative games.",
            "What's most baffling about this is that these aren't even *good* promises. It's a bunch of vague, feel-good BS that only appeals to those who didn't stop and think about it for even five seconds.\n\n>What if… there [were] a way to discover secrets in an MMO — and no easy wiki holding all the answers?\n\nConsidering that is literally fucking impossible(even if you did something mad like randomly generate/shuffle most of the game's content every \"season\" people would still learn and share information in a matter of *days*) it's a pretty hefty \"What if\"\n\nNot to mention that anyone who tries to deliberately obfuscate game mechanics from the player has no business developing videogames in the first place.\n\n>What if… you could easily change your mind about who your character is?\n\nSo... instant free respec at any time? Oh boy I love when my decisions have no consequences and my character is not a \"character\" but a doll I just slap skills and items on! Oooh, I can't wait to be a \"DPS\"!\n\n>What if… it rained, creating puddles that froze overnight?\n\n??? I mean it's cool to have weather effects but unless this has some kind of gameplay implications it doesn't really matter.\n\nAnd so on.\n\n\"But it's Raph Koster! He made Ultima Online!\"\n\nAnd good job on that, but all these \"What ifs\" describe a game that is very obviously NOT Ultima Online so I don't know why that would matter.",
            "They see a hope, a promise, unfulfilled.. and commence taking a gigantic dump inside of it.  I'm old and salty but MMOs died like 15 years ago.",
            "This 522246853343x",
            "You have it backwards actually, top comment is Vet fan and bottom average one.",
            "Honestly, as long as you actually have a realistic timeframe for it. I don't think people expect a finished game that just comes out of nowhere. Most are fine with a few years of hype-building. But too many MMOs start marketing the moment they have a vague idea about what game they are making, and then 7 years later they are talking about maybe launching an Alpha test next year(and then proceed to delay that).",
            "Looking forward to seeing *how* you're planning to do the goals mentioned in the article. A lot of us longtime MMO players have a lot of ideas on *what* we'd like to see in an MMO, but the *how* is what makes it happen, and that's very often the most difficult part to get right.",
            "lol ok bro, more empty words.",
            "Right, but that person doesn't know what Raph has been doing for that time. One thing he does a lot is speak at developer conferences teaching devs how to dev. So there is that. If you're interested in what he's been up to and what his philosophies are, at least check out [HTTP://raphkoster.com](HTTP://raphkoster.com)",
            "![gif](giphy|AP8vbzOUu8wk8|downsized)",
            "Nah you see this whenever Square Enix announces a new title.",
            "Nobody wants mmos anymore. They want disposable content for free.",
            "Apparently you don't play many games then. I have seen countless games go into early access on Steam only to barely ever change at all. And why would they? They've already made their money, it would be stupid to continue developing a product that's already been sold, unless it is for further monetization like an expansion/DLC/cosmetics etc. So they wisely just start work on another product to do the exact same thing again.\n\nAlso, the mobile market is wayyyyyyyyyyyyyy worse than the MMO market when it comes to exploitative monetization tactics.\n\nAll of that said, even if you were correct, it \\*makes sense\\* for the MMO genre to be the worst off when it comes to these things because they generally take the most amount of money and staff, have the biggest worlds and the most amount of content. They are too big for their own good, really. AND on top of that are expected to continue providing constant updates. Ultimately, comparing it to any other genre is kind of unfair/silly.",
            "Hmm, I obviously don’t agree that these aren’t good promises. \n\nHere, let me rephrase them. \n\nWouldn’t it be nice to have worlds that are immersive instead of color-coded task lists? Worlds that feel like places instead of cardboard sets? Worlds that don’t lock you into rigid gender locked classes with endlessly repeating hotkey cycles? Worlds where we use the power of modern computers to actually simulate a bit more, instead of everything being static content you use up, the way we dreamed MMOs would evolve all those years ago?\n\nThat’s the thing we are chasing. We may not hit it all — in fact, I guarantee we won’t.",
            "I read the wiki/guide hate a lot and tbh I don't get it. I like stumbling upon stuff by myself. It feels like a hidden secret (even when said stuff is out in the world lol). \n\n\nBut I just don't use wiki or guides unless a system or goal is too confusing for me. And I get that not everyone wants to run around in a game for thirty hours or go in blind. Like, if you want that experience just don't use them yourself. ",
            "Could you elaborate a bit more on how developers shouldn't obfuscate mechanics?  I see obfuscation as a pacing mechanism and it exists on a spectrum.  Too little obfuscation means everything is just given to the player, which makes the game too easy or too quick to complete.  Too much, and it's just way too confusing or difficult.  Perhaps you meant something else, because in this context I think a good amount of obfuscation is healthy, as it allows for the player to feel pride in earning what they accomplished, instead of the game just \"giving\" the player everything.",
            "This kind of stuff is not for players it's for investors who have never played an MMORPG before.",
            "Yeah, we'll never get back to the good parts of MMOs with the good parts of modern ones. But for me, i've been enjoying FF14. The roulette system they have where you can join a dungeon and team up with people anytime you want is pretty great. it's really social game too, so you can easily find and make friends as well. \n\nAs much as I'd love to play an MMO like we see in animes based on MMOs, we just don't have that. FF14 is as good as it'll get for me right now. If I didn't have to work and do other stuff, I could see myself easily no lifeing this game. The story mode part is single player, but there's a ton of dugeons and stuff that need teammates. Even in the story mode, you'll often come across dungeons that you have to do with others. Some of them you get the option to do it with NPCs or people, some you have to do with other people.\n\nAnd if you want to do stuff in the open world, you can very easily gather some friends or strangers and do the open world missions called FATEs. There's hundreds if not thousands of them all over the game world you can do. and there's plenty of non-combat stuff. you can on ocean fishing expedition with a bunch of people which is pretty fun. and then sell, cook, or dismantle the fish for materials.\n\nIt took me 4 tries to get into the game, but it was worth it. Once you get past the first few hours and the game opens up, you can find a good MMO in there. the graphics update is happening like next week too, but even then the game already looks decent. Not like BDO or something, but it's good enough. and the art direction is great, it's Final Fantasy afterall.\n\nI've been playing MMOs myself for...ugh 26ish years since i was a kid. and yeah, 99% of MMOs are just bleh. and the great ones are dated, but this one hits the spot for me...even though it took giving it a chance like 4 different times...lol",
            "We do get people saying “just tell us when it’s done” actually. \n\nWe have been working for five years quietly so we are definitely past the vague idea stage. :)",
            "Yeah, that’s why it’s taken us this long to announce! :D",
            "What do you want them to do?",
            "you may not like the japanese style but you'd have to be seriously delusional to deny FF success... or stuff like nier automata.",
            "And the people who DO remember what MMOs were originally like need to put real support (read:money) behind potential new projects and smaller titles that want to do the same instead of just griping that nobody does it anymore. Or they need to pool their resources and actually recreate what they had. \n\nJust like the Monsters and Memories team is doing by the way, but the fact that they are the only ones should be a huge embarrassment to any other jaded MMO veteran..",
            "Mate, Steam shovelware doesn't count - you can find thousands of shitty examples in any genre. I'm obviously talking about semi-relevant and high profile games, so you can actually make the comparison to MMOs. \n\nTo make a more apt comparison for such a distinguished gamer like you (because apparently I don't play many games), it doesn't matter if Steam has 50 shovelware soulslikes from unknown developers, when in the last few years we've got at least 10 good quality ones. \n\n> Also, the mobile market\n\nMobile games are not a genre? But I'm glad the bar is this low.\n\n> All of that said, even if you were correct\n\nCan you sound more obnoxious and argumentative? I'm not feeling it yet.\n\nThat being said, I have no idea what your paragraphs have to do with what I said. I made an observation that most MMOs that come out have tons of issues. It doesn't matter that they're expensive to make, my observation is true. If you look at the 4x, FPS, ARPG, simulator, city builder, or any other genre that I can think of, you get lots of semi-relevant to high profile games that are very well made.",
            "Ralph, my first MMO was SWG. Nothing has ever really come close to replacing it, some just being better distractions than others.\n\nI really hope yall have been cooking up something good.",
            "Yeah, I can understand people wanting to only hear about the game shortly before release, but it's not realistic. At least unless you're huge company that has direct line to every gaming media outlet and can whip up incredible hype within a few months.\n\nGood to hear that you've been working on the game for a while, means that you might be able to release before either Star Citizen or Ashes of Creation. Certainly going to keep an eye out for your announcement at the end of the month.",
            "I made the bottom comment. I really hope that I'm wrong. But I know how this ends.\n\nEither someone delivers a theme park that will run out of content and die or maybe survive as f2p crap (SWTOR - I'm looking at You)\n\nOR someone deliver sandbox that will scare casual players and game will die.\n\nI still believe that You have to build a theme park experience on top of the sandbox. But that's just my opinion. You need to give people a guide into the sandbox experience.\n\nAnother thing I always notice is that everyone puts effort into combat, but crafting is just some shitty UI, while the entire idea of sandbox is to be what You want to be. If you make a trader or crafter or whatever - that gameplay loop should be as interesting as combat roles.\n\nAnother thing I know is that people usually need financial backing unless they are rich. So they take investors. And what do investors want in return? Money. Lots and lots of money. So, what is the first thing I see in a new MMO? Cosmetics - part I enjoy is turned into a shitty online store. And funny enough - people defend this shit like it's normal.\n\nThis is why I play 20-year-old MMO. This is why I do not believe in anything anymore. The MMO genre died, and nobody knows how to revive it. And if they know - they are not allowed to do it. Investors will not risk paying for something that has not been done before because they are afraid they lose money. But they will gladly invest in another WOW clone despite the fact they all died. But somehow, they still think that's the way forward.\n\nJust look at New World. Crafting-based colonization game where You explore a new continent? That's awesome. Some smart ass figured out that the best way forward is to turn it into a zombie game (because killing natives is not PC), and it has to be theme park-like WoW despite the fact that theme parks die fast. They got what they wanted, and what happened? The game is dead.\n\nWhat was the definition of insanity? Trying same thing over and over again expecting different results?",
            "? Make a good game??",
            "Final Fantasy hasn't had a good game since XII.\n\nWhich was in 2007.",
            "i personally understand and agree with your original point, but those tower defense or town-sims on mobile are absolutely way more depraved than the mmorpg genre  \n\n\nbut out of properly recognized PC game genres, yes, mmorpgs are probably the worst at being ruined by greed",
            "Of course you don't want it to count, it doesn't fit into your narrative. \n\nYes, mobile games are a type of genre. Anything can be a genre.\n\nAnd did you seriously just bring up the 4x genre, a genre you need to spend hundreds of dollars on per game to get all of the content? FPS are probably the most microtransaction riddled games next to MMOs.",
            "I hope you like what you see when we release some info! :)",
            "ok. you dont like the genre.\n\nmoving on.",
            "Yep, now that I think of it, pure TD games are mostly dead. Lots of games with TD elements, but nothing like the old Warcraft 3 maps.\n\nTown-sims I genuinely don't even know what they are lol. Like Black and White? If so, those are really dead.",
            "> Town-sims I genuinely don't even know what they are lol. Like Black and White? If so, those are really dead.\n\nMay be referring to the multiplayer grand strategy PVP games like Rise of Kingdoms where players each control a city. There really isn't any single player genre that is comparable to these."
        ]
    }
}