{
    "ASK ALL QUESTIONS HERE! Weekly Questions Thread - June 15, 2024": {
        "title": "ASK ALL QUESTIONS HERE! Weekly Questions Thread - June 15, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/MonsterHunter/comments/1dgtws8/ask_all_questions_here_weekly_questions_thread/",
        "content": "Greeting fellow hunters\n\nWelcome to this week's question thread! This is the place for hunters of all skill levels to come and ask their ‘stupid questions’ without fear of retribution.\n\nAdditionally, we'd like to let you know of the numerous resources available to help you:\n\n**Monster Hunter World**\n\n&#x200B;\n\n[Mega-thread](https://www.reddit.com/r/MonsterHunter/comments/7x9ggi/monster_hunter_world_resources_and_question/)\n\n[Kiranico - MHWorld](https://mhworld.kiranico.com)\n\n&#x200B;\n\n**Monster Hunter Generations Ultimate**\n\n&#x200B;\n\n[Kiranico - MHGenU](https://mhgu.kiranico.com)\n\n[Awesomeosity's MHGU/MH4U/MH3U Damage Calculator](https://awesomeosity.github.io/YADC_Web/index.html)\n\n&#x200B;\n\n**Monster Hunter Generations**\n\n&#x200B;\n\n[The MHGen Resources Thread](https://www.reddit.com/r/MonsterHunter/comments/4ta8v8/monster_hunter_generations_resource_thread_ask/)\n\n[MHGen Weapon Guides written by subreddit users](https://www.reddit.com/r/MonsterHunter/wiki/weapon_guides-mhgen)\n\n[MHGen Datadump](https://www.reddit.com/r/MonsterHunter/wiki/datadumps-mhgen) containing information and resources compiled by users of the community\n\n&#x200B;\n\n**Monster Hunter 4 Ultimate**\n\n&#x200B;\n\n[The MH4U Resources Thread](http://www.reddit.com/r/MonsterHunter/comments/2vaxmt/monster_hunter_4_ultimate_resource_thread/)\n\n[MH4U Weapon Guides](https://www.reddit.com/r/MonsterHunter/wiki/weapon_guides-mh4u) written by subreddit users\n\n[MH4U Data Dump](https://www.reddit.com/r/MonsterHunter/wiki/datadumps-mh4u)\n\n&#x200B;\n\nAdditionally, **please label your questions with the game you are asking about (MH4U/MHGU/MHW, etc)** as it will make it easier for others to answer questions for you. Thank you very much!\n\n&#x200B;\n\nFinally, you can find a list of all past Weekly Stupid Questions threads [here](https://www.reddit.com/r/MonsterHunter/search?q=Weekly+Stupid+Questions+Thread&restrict_sr=on&sort=new&t=all).",
        "num_comments": 63,
        "comments": [
            "Any word/hint on when the results of the voting event for MH themes will be revealed?",
            "**MHW**\n\nThere's a very specific question that's been nagging at me and I can't find the answer anywhere in the various old threads and forums. Is there a real-world equivalent to the top used for the female Thermae layered armor? And if so, what's it called?",
            "hello! I was checking robomeche's mhw database looking at the data for breakable/severable parts, when i noticed an oddity: \n\nbase game deviljho doesnt have any data at all in the wound column, just the tail is listed a severable, while the in game picture shows both the head and the chest as breakable. On savage jho's database page the numbers seem to be listed correctly (altho it also lists the body as a separate breakable part that the in game picture doesnt list).  Does anyone know what's going on here ,and if it's possible to contact the creator of the database to fix this? \n\n\n\nIve also noticed a similar thing going on with base diablos and black diablos' pages (one lists the wings as breakable ,the other doesnt ,the in game picture doesn't show it on either one )",
            "Do you think it'll be possible for Capcom to implement a feature in Wilds to let us import our World's character customization file? Just the looks from character creation, like hair, body, face",
            "I skipped over Rise because I couldnt get use to playing it on the Switch when I tried the demo. After seeing the Wilds showcases, and now that Rise is on PC, Im curious are drop rates for jewels any better? It might be my bad luck, I remember grueling and farming for hours, and breaking parts only to turn up with nothing, or not enough because of how low drop rates were for stuff like that. Im wondering if they improved since, or if its around the same. Its not going to stop me from trying Rise now that its on PC, Im just curious.",
            "How is it that the crafty Monster Hunters still haven't developed a backpack/ carry contraption for large fragile items like large eggs so the Hunters don't have to carry them with both their arms and can move more freely.",
            "Starting Sunbreak after MH Rise Base Game completed when it got released. What exactly got added into the base game and changes in sunbreak and what got nerfed an buffed? is there an overview?",
            "I last played world at launch and feeling a new one - Rise comes to PS+ soon, but Iceborne is only 40 CAD (which is negated by getting Sunbreak eventuallt) - what’s the differences between the two and which one should I go with?",
            "What's the general progression of quests to do after beating the Iceborne Story?\n\nLike do I do event quests, do I just grind grinding lands and stuff like that.\n\nI'm not looking for the weapon progressions cuz that's already a thing on the discord server but the general progression of the game.\n\nThx in advance",
            "I remember at launch Monster Hunter World was difficult to play with friends, you had to play story missions up till the point where you saw the monsters cutscene, then back out of the mission and restart it over(or something like that), did that ever get fixed? Looking to get back into World with a buddy until Wilds comes out but I'm not looking to jump through hoops just to play with him, it'd also be his first MH experience so I don't want to soil it with weird QoL.",
            "MHWI\n\nExcuse my french, but what in the BEANS is Guiding Lands Tempered Lunastra?! Scratch that, what in the seven beans is Lunastra to begin with? I haven't felt this frustrated with a monster since I had to fight Raging Brachydios. I'm rockin over 35 fire resistance, fire mantle, and 980 armour and I still get hit with Phat chunks of damage. But most of all, what do you even do against her Nova? I'm trying to be as aggressive as I possibly can, I'm bad but doing my best, and yet I can never stop or predict her nova. Honestly I want to type a 200 page essay talking mad smack about this dumb as dirt monster but yeah, I just wanna know what the heck you're supposed to do against it.\n\nEDIT: Fixed typo(s)",
            "MHRS\n\nIs coalescence useful? Like, 4 elemental points at level 3 wtf is this?",
            "should I play MH Rise before MHW? technically Rise is an newer game so it should have more modern stuff that makes the game play better but Rise takes less space on my PC so...",
            "In MHR I've been playing the game for a minute now I'm at HR96 and the game feels awful? Like the only fights I really enjoyed are Narwa/Ibushi and the fire spitting spider\n\n\nEverything else feels like a chore to get through \nAm I playing this wrong? Also is there like no was to spend like the power ups from LS anymore? Like the Helmsplitter in MHW",
            "Playing MHRise. Just a quick ~~dumb~~ question. Can i save different weapon augments per equipment load out?\n\nI use elemental builds for dual blades. \n\nExample is I want to put more sharpness boost on my magma slicers when i battle a barroth vs more elemental boost when i battle an arzuros. \n\nIs this possible? Thank you!",
            "Is monster hunter wings of ruin worth it on the switch for a player who has never played MH but loves pokemon? Can you nickname your monster? Is the world open like zelda botw or more like a pokemon platform? I like easy games without much challenge, would this be the game for me? ",
            "Is it possible to beat Monster Hunter Rise Sunbreak using only one weapon like Only Greatsword, longsword or even a HBG/LBG?",
            "When are you suppose to attack?",
            "Best MH for newcomers? I'm interested in the main franchise and i have a Switch, PS3, Wii, Wii U, Xbox Series S",
            "Hi i play this game for one or  two weeks after release im using GPS joystick to play the game. but since update spoofing won't work anymore.   I want to play this game again and grind is Spoofing available now in androird device?",
            "the closest i was able to find is Chasuble tunic (or further apron), but in short?",
            "Maybe, though it would likely depend on if they're using the same character creator, which they may not. Assuming you have a character edit voucher available, you can always just go to the character edit screen, screenshot your sliders, and then hope those will have parallels in Wilds.",
            ">and now that Rise is on PC\n\njfyi: has been on PC since 7(?) months after Switch release\n\ndecos are craftable, charms are RNG\n\ne: realized OP likely meant the rare parts (plate/gem/mantle)\n\nfor that its as the other comment said +its not been changed and thats what MH is about (world AND rise and all others)",
            "Drop rates are the same across platforms and haven't changed.\n\nIn Sunbreak, some endgame materials can be purchased once you have hunted the associated monster enough times, even if you never got that material as a drop.",
            "How would you reach your weapon if a Rathian is attacking you?\n\nAlso supposedly the Seikret can either be ridden when carrying eggs or will carry them for you in Wilds so the 100% objectively true answer is \"They didn't have someone strong enough to pawn it off to\".",
            "Because it wouldn't be nearly as funny if the hunter had a sensible way to carry eggs.",
            "the sunbreak release patchnotes on capcoms SB homepage contain a list for nerfs/buffs (not with exact numerical values though)\n\nRise didnt get anything added with SB (still affected by buffs/nerfs obv) other than your palamute getting the \"sniff em out\" ability to find items to gather aroudn the map when you own SB",
            "The base game got the Defender weapon trees and the Black Belt and Black Belt S armor sets, for players who want to rush through the base game to get to Sunbreak.",
            "*Most* of the changes happened on Sunbreak's release, which has an official changelog [on Capcom's website](https://www.monsterhunter.com/rise-sunbreak/update/en-uk/ver10_00_02.html).\n\nThere aren't any numbers for how strong the buffs are, but most weapons got buffed across the board (especially Lance!). These buffs are available for all players, not just those who own *Sunbreak.*\n\nOther than buffs/nerfs though, there aren't many changes to the basegame, outside of the Defender/Black Belt gear.",
            "Iceborne is the expansion to World so it offers more expanded gameplay from World is\n\nSunbreak is the expansion to Rise so it offers more expanded gameplay from Rise\n\nWorld has nothing to do with SB and IB has nothing to do with Rise\n\nrule 11 link/searchbar for more info/comparison between them",
            "do whatever you are able to do (personal skill/build wise)\n\nyou can go by title update releases\n\nor grind MR to 100/guiding lands regions up to access augments asap and fight the base iceborne challenging monsters before the others",
            "Honestly, I'd just hop into the Guiding Lands while also doing other content in release order. That way you'd get a steady increase of difficulty and power, while not having some unlocks completely overpower everything else.\n\n(Though you can skip the Arch-Tempered stuff if you want, as that's a super high difficulty specifically designed to cater to the highest tier of players)",
            "That is still a thing in World.\n\nBasically both would go into a quest, try to see the cutscene, one backs out and joins the other.",
            "it's still present in World bc, going by capcom, its not something to \"fix\" (its a thing in Wilds again, although they claim its better/more fluent there)\n\npost IB non-story missions with cutscenes can be watched together though (dont ask me why\n\n\n\nRise does not have this issue btw, the cutscenes play for everyone at the start and can be vote-skipped\n\n\n\nit's honestly not too in World bad, just the story missions and most of the game is grinding. just sprinkle more non-story missions inbetween and it should be okay if you give them a heads up\n\nonly one of you has to back out after the cutscene and then they can join the other\n\n(PC has skip cutscene mod but still requires you to watch them all)",
            "One thing that helps against Lunastra a great deal is Windproof. Her Hellflare is a lot more manageable when you aren't stunlocked by wind pressure, and she also uses a lot of wind pressure moves outside of that when she's scattering her puddles around and whatnot.\n\nWatermoss can remove the puddles (but not the flames). Weapons with water element also work, but Luna's elemental weakness is ice, not water, so you probably don't want to bring a water weapon. Heat Guard ignores the flames (but not the puddles).\n\nI strongly recommend using a hammer or horn, because her head is _not_ a weakpoint for edged damage, only blunt (the wings and, to a lesser extent, tail are the good hitzones for edged damage). Since she's an elder dragon you want to be hitting her in the head as much as possible to make her fall down and knock her aura down a step.\n\nShe's the only elder dragon whose \"leveling up my aura\" move isn't basically instantaneous. The others just roar and power up (except Kirin, who strikes himself with lightning), but Luna has to go into a charging-up posture in which she's just standing still for several seconds. If you're lucky, you can stagger or topple her before she finishes.",
            "1. no ATs in guiding lands, that's \"just\" tempered (i'm so glad AT luna is in HR only). you only need her mats for very few things (if any but layered stuff)\n\n2. how to fight: you dont, you tank the dmg and lifesteal back or fail. she's a major bitch and totally not fun to fight (i saw a lance player poke lifstealing vs the nova but idk how/what healing power went into that build)\n\n3. nova: cant be prevented. she WILL do it (unless you somehow prevent her from EVER charging even once, the one sparks that make her hair glow, afaik impossible unless modding).\n\nBUT you can trigger it early by flashing her so do that when you're in a safe distance (something like border to the next area)",
            "It's good to remember that for most end-game weapons in Rise/Sunbreak, you will find that they have about 30-50 elemental points on the weapon at most. Four extra points sounds lame on paper, but if you reword it as \"\\~10% increase\" it sounds a lot more useful. It's all about context.\n\nCoalescence also gives a good amount of straight attack, which is always good.",
            "One level for 12 raw is good. Level 2 and 3 aren't worth it.\n\nEdit: only use it with skills that inflict debuff on yourself like bloodlust and hellfire cloak, and ideally on a weapon with an armour move like CB air dash to take debuff from a monster intentionally.",
            "they both have almost the same modernization/QoL stuff compared to previous MHs and the stuff thats different is non-factor (imo) like Rise has a loadout menu for gear and layered (transmog) separately and together, so you're \"More in control\" while World has one loadout menu that goes \"save loadout (gear)\">\"save loadout (costume)\"\n\nfor actual differences that might make you (not) play one or the other see rule 11 link but if you're just worried about the order it really doesnt matter",
            "Helmsplitter is part of the silkbind Soaring Kick in Rise. If you hit the monster with the initial jump, you can press the right trigger to initiate a helmsplitter. If you do not press anything, you'll instead do a weaker plunging thrust.\n\nTbh, I think that base game Rise has a better roster than World overall.",
            "You'd probably get more out of it if you were already a Monster Hunter fan, but I don't see why someone unfamiliar with the franchise wouldn't enjoy it. I stopped playing Pokemon after Gen IV but I enjoyed Stories 2. You can nickname your monsties, except for the \"main\" one, but I think once you beat the game you can take that one out of your team. It's been a bit since I played but I seem to recall the world is more Pokemon-style in that you've got separate (albeit pretty large) maps rather that one full seamless one. As for ease, eh. It's not going to be a complete cakewalk. If the demo is still on the Switch, I'd recommend trying that out. If you end up liking it, demo progress should transfer to the full game.",
            "Why wouldn't it?",
            "yeah just like in any other MH game (afaik even frontier)\n\nthough some weapons are better matches for different monsters theres nothing that is really hard to beat by not using X",
            "In general? That little window after a monster has attacked and is doing nothing/turning itself to face you again.\n\nWhen you're skilled? As soon as you're sure the attack will not hit you and until the next attack needs avoided.",
            "When you're not going to get hit. Monsters win trades 99% of the time. Either wait your turn (watch for when the monster is finished attacking and goes back to idle) or sneak hits in while the monster is attacking (learn both your and the monster's movesets so you know where it's safe to punish).\n\nFor example, think about Rathian's triple fireball attack. You can either wait until all three fireballs are finished then move in to counterattack, or you can position yourself in such a way that you can attack while she's shooting fireballs that aren't going to hit you.",
            "Usually for large monsters, you want to attack in between their attacks. Outside of that, you just have to memorize the attack patterns of monster, and after your first few hunts, it'll come naturally.",
            "You can just jump right in. Playing past games are fun but the new ones are a bit easier and just as fun. I'd start with World because it has the best graphics, good tutorial and is technically the 5th main line game.\n\nMonster Hunter Generations is on the Switch and it plays like the previous games pre-world. Has all the monsters in the series before World updated the engine. It's a lot clunkier but many players fell in love with these older games. Monster Hunter Rise is the latest game on Switch and PC and it's really fun.",
            "rule 11 link/searchbar in general is great at finding answers to such (likely common) questions",
            "mobile looks like this group is not for MNH sorry :D",
            "Ah okay. Thanks.\n\nThats at least good to know.",
            "You're saying my Palico is strong enough to hunt monsters alongside me, but not strong enough to hold an egg?\n\n... Actually, I'm not sure I'd trust an AI companion with something so fragile.",
            "Ah, yeah my bad, was so tilted from fighting her and fainting 4 or 5 times that I didn't even notice I said arch tempered lol. But yeah, I am fashion hunting right now and getting all layered sets one at a time but I am grateful to the gods who slumber beyond the stars that I don't have to fight this frustration made personified for anything other than fashion.. for now. Thanks for the tips/info. I have a very basic life steal lance build but I guess I'll have to improve it.",
            "Coalescence is definitely not 10% because the up time is tricky and a weapon can be augmented to add up to 53 more element, but that doesn't matter since it's only fair to compare a skill to another skill. Burst takes up the same decoration slots as coalescence, and one level of burst already provides 5 to 8 element. Coalescence does have good straight attack but that's about the only thing good from it.",
            "coolio. i heard they nerfed hunting horn in rise but I guess this gives me a chance to play another weapon for once...",
            "Who cares about monsters when the hitboxes feel super terrible \nYou get hit by stuff that would have never connected in world \nSo helmsplitter got basically put on cooldown then? \nIs there any other attack I can use to spend the red power up for dmg? \nFeels kinda bad how everything seems to be focused on counters...",
            "You're treating it like he can't run both. He asked if it was useful, and with the attack and elemental buff, it is. Are there better options for pure attack or pure element? Yes, but it's still a good staple skill to have as well.\n\nThe 10% was an approximation, hence the \\~tilde. It will obviously change per context, just giving a general perspective of it.",
            "they greatly changed hunting horn from World to Rise yes (idk how it was before World)\n\nbut it's still worth trying out (as are all other weapons)",
            "I wouldn't really say *nerfed,* but rather *replaced it with a different weapon.* Rise Hunting Horn plays **nothing** like World Hunting Horn, even down to the basic attacks.",
            "Hitboxes are not terrible in Rise, in fact, hitbox visualizations show that monster have basically no disjointed hitboxes at all, they are a very close match to their visual model. Some monsters, like Anjanath or Tigrex in World/Iceborne, have way worse hitboxes by comparison.\n\nIn Sunbreak, you can also spend the LS gauge to charge up a powerful attack with Sacred Sheathe.",
            "3rd and 4th gen HH is fairly similar to World HH, but you couldn't stock songs at all, and recitals and encores do not have the extra shockwave hit.\n\nIn 2nd gen, HH's main attacks were completly divorced from playing songs, instead, you had to enter recital mode, and then stand around to let the HH play the note, then press a button to switch stance for a different note, and so on. The attacks the hunter would do when switching stance were later repurposed into the recital animations when the weapon got overhauled in 3rd gen, IIRC. 2nd gen HH is really clunky.",
            "Nah hitboxes are horrible\nThere's a ton of videos showing exactly this \nAnja and tig are literally the same as in world \nTig I'd argue is even worse now",
            "All the issues with Rise's hitboxes can be summed up with one of the following 3 reasons:\n\n1. Getting hit by an anti-wall hitbox. These are deliberately super large and disjointed, in order to give monsters the ability to deal with people wall-running or camping on cliffs to snipe the monster with bowguns. However, even though those send you flying, they actually deal no damage.\n2. Anti-air hitboxes. These hitboxes can only hurt you if you are airborne. Some moves cause the monster's entire body to be covered by those hitboxes, so even though when you are grounded, you do not get hit by the move at all, if you try to jump/use a wiredash, you get hit and take damage. For most people, it is very unintuitive that moves exist that can only hurt you if you are in a certain state, but the hitboxes themselves do not extend past the monster's body.\n3. The hunter's hurtbox. This works in tandem with the aerial hitboxes. Even though the hunter may do flips midair with various animations, the actual hitbox of the hunter stays upright. This can cause weird issues where you can get hit without the monster visually touching you, this is the most prevalent cause of seemingly BS hitboxes.\n\nThe hitboxes themselves are placed reasonably on the vast majority of monsters.\n\nAs for Tigrex and Anjanath, I'm pointing those two out in particular because they have some really questionable hitboxes in World, and you cannot use any of the aforementioned reasonings to explain those. For Tigrex, its charge for no apparent reason has a gigantic hitbox beneath its arm at the beginning of the animation in Iceborne, so it can hit hunters even though it visually went above them, while Anjanath in general seems to just have mis-sized hitboxes, which causes stuff like its bite extending a bit past its snout, or the little kicks to the side hitting you even though you are standing well clear of them. These sorts of things do not happen in Rise, if Tigrex sails over your hunter at the start of the charge, it will miss you, etc."
        ]
    },
    "I've been doing this long enough to question whether it was even funny in the first place": {
        "title": "I've been doing this long enough to question whether it was even funny in the first place",
        "score": 1279,
        "url": "https://www.reddit.com/gallery/1dlowuz",
        "content": "",
        "num_comments": 55,
        "comments": [
            "I like when you carve a tail from a tail,  then get more tails in the rewards. Like...how many tails did this thing have?",
            "Tail Carve into Rare Drop is one of the best feelings, though! Makes it feel so worth the effort.",
            "My favorite is only breaking rathalos’s head and getting 3 tails in the rewards. It makes me question what kind of freak I was really hunting.",
            "Well better carve that tail.\n\nYanks out a medulla.\n\nWat?",
            "Great comic! I feel like you start carving and just think, \"why not just take the whole thing?\"",
            "I still find this funny today, my rng luck makes me wonder if I get a tail, I've cut off like 7-8 Barioth tails without getting a tail drop, it was the only part I needed for a weapon. 😂",
            "What the hell, this is NOT yours! \nI made this comic years ago and posted it here, with even the same caption.",
            "Its funny actually when I don't find a tail. Like gems or some scales. But when I get those gems it feels so lucky and unlucky at the same time especially if you are looking for a tail.",
            "u/repostsleuthbot",
            "Monster Hunter really makes you question everything after a while.",
            "Why have I never questioned this, and why do I hate the fact that I am now",
            "Be happy you dong have to carry it back to base like an egg",
            "I think we are carving the good part of the monster. For example, the tail was severly damaged during the fight since it's not always a clean cut so we carve out a good part of the tail and at the end of the hunt, the carving experts will cut the part the hunter thought was not good",
            "Could be worse.\n\nYou could be carving multiple eyes out of Fatalis instead despite him only having 2 of them.",
            "popo tongues be like\n\n![gif](giphy|H5YEnJoEW7DPy|downsized)",
            "Nothing beats this more than probably Monoblos which you could carve more than one heart from it, sometimes as a shiny drop.",
            "https://preview.redd.it/5z23h4fhb38d1.jpeg?width=1044&format=pjpg&auto=webp&s=45bc7b09a2e4b88ce24ed8a2d55bba5b1ff0584a",
            "You know what tail I have been having a hard time breaking? Flaming Espinas. No idea why.",
            "Another favorite of mine is carving the wing after a kill. Like, the whole wing? I just stuffed the whole wing into my pocket.",
            "For monster parts I’ve always seen it as a combination of needing very specific parts and parts that weren’t damaged during the hunt.\n\nSo when you’re farming a monster’s ‘tail’ you’re actually trying to get a certain tendon or muscle from that monster’s tail. A monster might be covered in scales, but the armourer has asked you to get one of the medium sized ones from the monster’s lower back, which is exactly the right shape and flexibility for what they’re trying to make, and not only does it need to be undamaged but you need to split your materials between the other three hunters who helped you.",
            "\"I cut it's tail!\"\n\n\"Give me tail, give me tail, give me tail!\"\n\n\"I found a!...scale?\"\n\n:(",
            "unique filets off the whole tail?",
            "I like the time when my cat randomly yanked a tail from an Elder Dragon",
            "It's even better when you can carve it multiple times and get tails every time expecting different items",
            "The first time I hunted Barioth in Rise I got like five tails",
            "In german the word for dick and tail is the same.... Just leaving this here...",
            "Well, I always thought that the mission rewards are things you get awarded by your superiors for completing the mission, not additional bits carved from the monster.  It’s like when you wear a shirt with a frog on it one time, and then next Christmas everyone is like “I know you like frogs so I got you a necklace/mug/sweatshirt/assault rifle with a frog on it.”  But with tails, in this case.",
            "Oh ya, it is.\n\nYou also have the other side of the coin. Which is getting an effing scale from it. At least give me the bloody tail.",
            "Maybe this is what longsword mains are doing when they attack the head.",
            "Historically accurate misconception! Palepntologiats used to think large dinosaurs had a second Brian in their tails",
            "It's really messed up that they have a chance for a scale or cortex after all the effort of breaking that part.",
            "It's called reposting bots",
            "Edit: account's a bot, created 2 months ago, reposted someone else's art. What else is new. [OG artist's post](https://x.com/_Helio_Art/status/1387153457677619201?t=y-Jg7L1_iTD-Jajsl2bYbQ&s=19) Even copied the title too.\n\nI feel like I've seen this exact concept in another art style or maybe this exact comic somewhere before. Reddit should really start implementing a deliberate repost feature so creators can repost their work when they feel like it's relevant or didn't get enough attention initially. They've tried doing that crosspost thing which works across multiple subreddits, but it'll be cool to see a little text above the post that says something like, \"reposted by [artist]\" and I know I'm just describing Twitter/Tumblr but idk if that's something Reddit can benefit from.",
            "I feel like I've seen this exact concept in another art style or maybe this exact comic somewhere before. Reddit should really start implementing a deliberate repost feature so creators can repost their work when they feel like it's relevant or didn't get enough attention initially. They've tried doing that crosspost thing which works across multiple subreddits, but it'll be cool to see a little text above the post that says something like, \"reposted by [artist]\" and I know I'm just describing Twitter/Tumblr but idk if that's something Reddit can benefit from.",
            "Good bot",
            "Sorry, I don't support this post type (gallery) right now.  Feel free to check back in the future!",
            "![gif](giphy|f6D64kpYIF8B9EYdmY)",
            "You may be right. The good thing about MH item flavour text is that it rarely goes into exact detail of what you've carved off. Like, how much fur is x1 Pelt? It sure as hell isn't the entire hide, or I wouldn't need 3 to make a single armour piece.",
            "So in cannon it's because the end of hunt rewards come from the guilds I guess stockpile of monster parts. They keep the corpse (and with it most of the bits) and captured monsters in part to pay hunters with parts.",
            "There is no funnier feeling then seeing that your cat yoinked the heart out of a furious rajang mid fight",
            "4 more tails and that barioth will become a full kitsune ~~let's ignore it's not a fox~~",
            "That is such an insult to injury - especially because it's usually almost 4x higher chance to get a tail than a scale/cortex/whatever.\n\nThere was a Master Rank Chameleos I killed that dropped a Chameleos Gem on the Tail Carve, a Large Elder Dragon Gem as a ground shiny, and then one more of each as a Hunting Reward. It used to be Anjanath who trolled me with endless Gems (I have 12 unused Anjanath Gems in my box) - Chameleos might be wanting to usurp that throne...",
            "Farming tails\n\nCut tail\n\nCarve tail\n\nLook inside : scale\n\nFfs",
            "Yeah lmao I'm the original artist of this comic, I posted it here years ago, this guy just reposted it with the same caption",
            "Yeah I'm the original artist of this comic, he just reposted it with the same caption hoping no one would notice",
            "Are you sure about that? Because I am 99.99999% sure that Neocat_ is not a bot.\n\n---\n\n^(I am a neural network being trained to detect spammers | Summon me with !isbot <username> |) ^(/r/spambotdetector |) [^(Optout)](https://www.reddit.com/message/compose?to=whynotcollegeboard&subject=!optout&message=!optout) ^(|) [^(Original Github)](https://github.com/SM-Wistful/BotDetection-Algorithm)",
            "So what you're saying is we need a similar situation but with a Mizutsune",
            "Oh hey nice to see you here, love your work, I saw your mantis monster design concept on here and twitter a while ago and it stuck in my mind. This comic is pretty memorable too. Don't let this stop you from making cool things ✌️",
            "!isbot WhyNotCollegeBoard",
            "Yes. The new Mizutsune variant that will integrate fire into the moveset of this bubble-centric monster.",
            "I am 101% sure whynotcollegeboard is a bot.\n\n---\n\n^(I am a neural network being trained to detect spammers | Summon me with !isbot <username> |) ^(/r/spambotdetector |) [^(Optout)](https://www.reddit.com/message/compose?to=whynotcollegeboard&subject=!optout&message=!optout) ^(|) [^(Original Github)](https://github.com/SM-Wistful/BotDetection-Algorithm)",
            "Yeah, I'm not entirely sure what is in Violet Mizutsune's bubbles that make them catch fire",
            "101% ? I think your creator has made a wrong scoring approximation should try to convert output to a quantile and report that quantile",
            "It would be fine if it WASN'T THE THIRD FIRE MIZUTSUNE."
        ]
    },
    "Why does this even cost money": {
        "title": "Why does this even cost money",
        "score": 131,
        "url": "https://i.redd.it/vsioon29s38d1.jpeg",
        "content": "😭😭, I know worlds has it too. But why are they selling it money. ",
        "num_comments": 80,
        "comments": [
            "the cap in capcom stands for capitalism",
            "Because there's people who are willing to pay for it. A market only is born if there's buyers in it",
            "It's the Capcom Classic",
            "This is to appease the Capcom E-suite.\n\nThey put a lot of pressure on their teams to do really, really stupid shit. Microtransactions is just one of them.\n\nBut guess what? Look up the founder of Capcom.\n\nTsujimoto Kenzo.\n\nYup. Ryozo is the founder’s son. Also, his big brother is the current CEO. Good luck threatening him, lol.\n\nSo that’s why MonHun has been relatively unmolested. He does good work so they can’t complain about the results, and if they push too hard, the Tsujimoto family will lay down a smackdown on their asses for trying to bully their lad.",
            "Because video game corporations figured out awhile ago that people enjoy cosmetics in video games, and despite all the “it’s just optional/cosmetic” bullshit defenses people tout out, they’ve obviously pivoted from cosmetics being an included feature to a paid feature to exploit their player bases. \n\n\nIf those fuckers could figure out a way to sell you pushing forward on the analog stick to move as a separate feature, they would, and dumbasses would still defend it.",
            "Rise saw a dramatic spike in pushing microtransactions and it makes me nervous for Wilds. World was relatively inconspicuous about it, but Rise just shoved it in your face.",
            "Because of greed",
            "Because Capcom searches for ways to nickel and dime their customers as much as they can, without getting \"huge\" backlash. Many of stuff you would get for free in old gen began costing money in world, then in rise they went even further, halved the armour variants and began selling single armour/weapon cosmetics. And people keep buying it. You can be 100% sure they will come up with some new mtx bullshit in Wilds. I can guarantee that. And when people will begin to rightfully complain about it, the lemmings will come protecting the poor multibillion company because \"we already had mtx in past 2 mainline entries!\"",
            "This is not new, Capcom has always done this but for some reason only DD2 got so much backlash for it",
            "It’s abhorrent. MTX in a full priced game is complete bs. I’m so nervous about wilds…",
            "Oh but when Dragons Dogma 2 did it, it was burned at the stake (not cosmetics exactly but pointless micro transactions yes)",
            "its what theyve done since world and it got way worst in rise. kinda worried about mh wilds honestly. like people got angry about dragons dogma, but between mhworld and rise there's about 1k USD, give or take, worth of cosmetic mtx",
            "Look at other Capcom games on Steam. They have so many of these little purchases too.",
            "Capcom...",
            "Despite there being a lot of MTs in MH games, they are always cosmetics and they are arguably not even any better than the options the players already have. So although I don't like the profit driving factor, I can get behind this kind of practice, considering the quality and quantity in the games.",
            "People flipping out on the Capcom micro transaction model like it just happened. This shit has been going on for years and honestly, it doesn't affect much at all. Dragon Dogma 2 micro transaction stuff is exactly just like DMC stuff and you would be fine without having to buy anything and just simply play the game.\n\nMH has this cosmetic stuffs since MHW and honestly they're not even that great in my opinion. If you really want it then buy it but it doesn't affect gameplay and base game customization already has a decent amount of options.\n\nI expect Wilds would have something similar but I'm not worried that it would be anything crazy.",
            "Crapcom",
            "I remember i got like a mask and geisha hair bc i had extra credit, but i tought and still think they should've made big bundles (like one complete outfit, one to three markings/makeup, one hairstyle and one set of poses), and sell it for 5 or 7$. It's so stupid to have something like that being so expensive",
            "Welcome to the 21st century",
            "I think the devs are forced to add SOMETHING as micro trans per capcom leadership. They put THIS as a paid item prob so players would see it's dumb, not buy it, and move on. Unfortunately, it doesn't work and fans buy everything",
            "Because cosmetics usually cost money, as people want to enjoy them, but it won't hinder the gameplay for those who can't/won't.\n\nBecause the company has to stay afloat in entertainment bussiness during a recession. Because late-stage capitalism is inhuman and we have to suffer the mistakes of our fathers untill we - and our children - right them.",
            "Because people actually pay for it, thanks to them, stuff like this is paywalled in a not only full price game, but also one of the best selling ones on the company's history.",
            "Damn why are people so salty here over optional cosmetics?  i've played World for like 1200 hours and NEVER paid for anything other than the MHW Iceborne disc, finished the game and totally enjoyed it.\n\ni'm not even upset that my room looks basic and plain.",
            "Because there's buyers.   \nAnd honestly I still rather have this than actually impactful DLC.   \nI enjoy Shin Megami Tensei and Persona and they've recently introduced several godly... demons behind a paywall in every release.",
            "Cause unlike you, they're running a business.",
            "If you dont want it, Just dont buy it ?",
            "Same thing Capcom will do with this pile of mid coming out called “Wilds”.\n\nJust give us a 3U/4U port already; it’s like they’re afraid to because they don’t want the crowd to see how good the sale numbers from an entry from 2013 will be versus the trash fires they put out today.\n\nEdit: Rise/World soy boys downvoting will not change facts; cope harder. Y’all like the easier, watered down titles because they don’t require learning. They blame it on “QoL”; I blame it on skill issue. 😎",
            "Its only cosmetic, who cares about that.",
            "This may be copium... , but after the strong reaction to Dragon's Dogma 2 microtransactions, maybe they will tone down Wilds microtransactions to the level seen in World.",
            "Capcom - Capitalist Company\n\n\nOoooooooooo",
            "Which is unfortunately not compensated by the \"com\" standing for \"communism\"",
            "That's not necessarily true, see Chinese history and opioids",
            "Yep, that's that is why MonHun is very generous in terms of giving out free content compared to other Capcom franchises.",
            "Lol Activision once considered selling ammo by the bullet in fucking CoD.\n\nCan you imagine having to pay for virtual ammo?",
            ">they’ve obviously pivoted from cosmetics being an included feature to a paid feature to exploit their player bases\n\nNot really. Older free character creation also had far less options than we get now upon purchase of the game.   \nNot trying to defend anything here, but honestly it seems more dumb to me to spread misinformation.",
            "By obviously you mean the exact opposite and you're just lying? Because there's way more cosmetics now.",
            "Gemmas hair $5. We all know it's happening, and at least I can run something other than usj hair",
            "I'm yet to see any ads for them in game, only on the steam page",
            "I'm fine with it so long as it's just cosmetics and remixed music tracks, just extra things that have no effect on the gameplay. If they start putting monsters or weapons and armor behind a paywall, then it becomes a different story where I'll drop the game completely.",
            "They wouldn't do them if people didn't buy them",
            "I'm totally fine with 5 dollar hair if thar means free title updates with monsters ect",
            "Shoved in your face how?  Over 1000 hours and not a single in game ad other than the odd random joining with one of the weapons.",
            "We have a very powerfull instrument to raise our voices to corporations, is called piracy",
            "It’ll be on Wilds. It’ll be a fuckton.\n\nBut you won’t need any of it to enjoy the game.\n\nAnd if they tried to ruin the game with their scummy BS, Ryozo and his big bro Haruhiro Tsujimoto will come kick their asses together.",
            "Probably cause it should've been part of the base game. Not that it's wildly sought after, but that it's literally just a png decal of a brush stroke and they're charging money for that, on a full priced game.",
            "Never played either, any reasons why?",
            "Lmao what is this cope. World is literally Capcoms best selling game. I'm sorry but a 3U/4U port will never reach 25mil sales. But yeah no one will force you to play Wilds, you can stick to the old games and let the others have their fun.",
            "Literally everyone that has ever played MH lol….",
            "So is every singe layered armor...and the game has a whole mechanic to get them",
            "Hahaha they don't give a shit lol",
            "I'm not sure, maybe.\n\nBut the reason people didn't like the MTX in DD2 was purely because the game already had negative press from the performance and also MTX was on everyone's minds because of the industry at the time (there was something going on with MTX elsewhere that got people hyper focusing on MTX).\n\nThe MTX in Rise and World is arguably worse than DD2 ever was.",
            "I think it'll be as bad, if not worse than the amount in MH Rise.",
            "The backlash was mostly caused due to it launching on release and people being unaware that you can get everything but the tent in like an hour of playing.   \nIn other words: The backlash likely won't be regarded as due to the mtx existing but rather how it was launched.",
            "Hey wait a damn minute",
            "If they start to ban us for mods can we say it's correct then?",
            "What? There was a market for it, just not one the government wanted. Not every market is government sanctioned.",
            "It was more an expansion of a market already in place",
            "I mean, sadly, the British did create the market they explored",
            "I think they are referring to the event quests unlocking many skins in previous games",
            "Yeah tbh 90% of these arguments all boil down to nobody actually having a solid concept of what a \"complete game\" is and what they should expect in terms of features vs cost. \n\nThey just throw these terms like \"full priced\" around with undeserved authority because it sounds meaningful, while ignoring that from an industry standpoint the price:content ratio is heavily skewed in the consumer's favor, especially with the artificial price controls that make games sound more expensive while they actively fight against inflation. \n\nIt's worth remembering when people make arguments about \"getting a full game when you pay full price\" that MH 3U has a fraction of the content of these games that have microtransactions, and when adjusted for inflation it would have cost $82 on release. We get so much more for so much less and still complain it's not enough.",
            "At least give me Gemm's figure for $5",
            "irc it was on the main menu on rise switch version",
            "Yeah I agree  and we know the hair is actually gonna be $1-$2 not $5",
            "The base game in world is like 3x the content I expect by now.",
            "but the base game for its pricepoint is actually quite large already with ALOT of options fror character creation without forcing you to pay for anything,  my point is its a relatively harmless MTX scheme where everybody wins.\n\nunless capcom decides to lock an entire monster behind a paywall (outside of a huge DLC) i dont see myself having issues with this.",
            "Because they’re both niche and stuck on the 3DS.",
            "Cries from a soy boy…",
            "The British had to get them addicted to the thing they werent buying before the market existed",
            "Number of Event armor piece \"looks\" in GU: 117\n\nNumber of Event armor piece \"looks\" in Sunbreak: 112",
            "Which we also still have, but I'm not sure about numbers compared to 4U and GU.   \nPeople called out Sunbreak on having less of that than Iceborne right on release and people will do the same with Wilds, likely comparing it to full Sunbreak, full Iceborne, full GU etc.",
            "I get where you're coming from but remember that all the mtx bs started from some simple horse armor. And overwatch's lootbox wasn't taken seriously either since it's just all cosmetics but then it sparked a lootbox trend that even made it to a legal parlement. People brush off cosmetic mtx cause it doesn't effect gameplay, but that's exactly what started the whole mess.\n\nThe base game is worth the money yes, but if i payed (paid. Brain fart.) for a full game then i'd also expect a full game, not a game with some of its content gutted for future mtx. I'm fine with the huge dlc cause those are basically expansions, but a simple decal being sold like it's a f2p game? Yea no.",
            "No i meant, why are they being praised a lot? The sentiment's been floating around here and there but i just never had enough curiosity to actually find out. Probably could just run an emulator i guess.",
            "How old are you lol, I literally played all the available MH games from Freedom 2 onwards. They were all good games that I enjoyed. And yes Fatalis fight in worlds is peak especially solo.",
            "Do you think the British were going around forcing people to do opium? The British sold the opium to smugglers and the smugglers sold it to the people. People got addicted on their own. The British actively made the crisis way worse by shipping so much opium to China and then forcing China to legalize it, but the market for drugs was there.",
            "dude, people play this game for 1000-2000 hours WITHOUT paying for anything aside from the base $60 ..... you got to be spoiled if you think thats not complete content already.",
            "> if i *paid* for a\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
            "They’re praised a lot because they’re works of art. 4U is the greatest iteration of B rolling a game has ever seen…even better than souls games.",
            "I guess it was? Fatalis in World took me one 5-10 minute peak at a YouTube video then it was one attempt. \n\nThen, fights like EX C.Beard and EX Dreadking in GU I sat on for months and finally beat them.  So, I guess Fatalis is the “best” if you’re a “graphics bro” and enjoy cinematics.  But, it did not bring near the satisfaction that older, actually hard fights brought.",
            "Piss off bot",
            "With hard you mean clunky movement and horrible hotboxes. Yes it has its own charm but definitely not for most of the player base"
        ]
    },
    "HBG be like": {
        "title": "HBG be like",
        "score": 257,
        "url": "https://v.redd.it/x9463y1v628d1",
        "content": "",
        "num_comments": 8,
        "comments": [
            "blastnut",
            "This is What ahtal ka would look like in world",
            "This seems like a children's movie. Goonies type the damn thing in which gangs of friends need to stop their favorite video game from being destroyed before they get some receipts that will save it",
            "Huh apparently excavators are weak against roman candles. I’ll file that away.",
            "Everyone gangsta till it becomes a machinegun",
            "Can such a basic weak firework even pierce to the driver? It's construction equipment so it has to be able to handle some pretty heavy stuff falling on it..",
            "[deleted]",
            "Looks like the ground gaveway first or maybe it was just a distraction for a pitfall trap",
            "The quest target is the Chinese government. Unfortunately, you will need a bigger firework to beat it."
        ]
    },
    "Up close and personal 🥰 (OC)": {
        "title": "Up close and personal 🥰 (OC)",
        "score": 351,
        "url": "https://i.redd.it/pm76mz8hyz7d1.jpeg",
        "content": "",
        "num_comments": 10,
        "comments": [
            "we need a death ray tzitzi subspecies",
            ">Walk up\n\n>See hunter and monster fighting\n\n>Flases\n\n>Refuses to elaborate \n\n>Leaves",
            "That close up of the hunter is definitely something I didn't need to see.",
            "This is beautiful",
            "FLASHBANG CHICKEN!!!!!!!!",
            "I CANT STOP LAUGHING HELP",
            "like the frontier event gypceros?",
            "don't know what that is, but I bet it's awesome",
            "https://youtu.be/XDR3pmEJ8vE?si=EWvMgtzjZkZLoPn1",
            "wtf it nukes itself three times and just go out with a bang?\n\nI was right. That is awesome."
        ]
    }
}