{
    "Join our discord dedicated to Monster Hunter Wilds and World": {
        "title": "Join our discord dedicated to Monster Hunter Wilds and World",
        "score": 51,
        "url": "https://discord.gg/vUZY9RdZ9a",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Your submission was automatically removed because discord.gg is not an approved site https://discord.gg/vUZY9RdZ9a.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MonsterHunterWorld) if you have any questions or concerns.*",
            "may the fourth be with you!",
            "may the fourth be with you!",
            "may the fourth be with you!",
            "may the fourth be with you!",
            "Thank you! I have been looking for a server!",
            "May the forth be with you!!",
            "may the fourth be with you!",
            "    A scene from a Chinese or Asian movie: A monster is coming from the sea, and the armies of the empire are preparing to hunt it. It pulls the chain that they are trying to hunt, so it pulls animals into the sea and destroys the arsenal.plz can u help to find this movies",
            "may the fourth be with you!",
            "may the fourth be with you!",
            "May the forth be with you!",
            "lol"
        ]
    },
    "My 3rd time solo fatty": {
        "title": "My 3rd time solo fatty",
        "score": 21,
        "url": "https://i.redd.it/p6gjq9fbx38d1.jpeg",
        "content": "My 3rd time successfully soloed fatty. Can’t compare to those super fast speed runner, just happy of the improvement. No cart and reduce from 28mins to 19mins. ",
        "num_comments": 5,
        "comments": [
            "I have never done Fatalis on my own, simply because I don't like being targeted the whole time. Can I ask what weapon you were using, and if you had a special strategy?",
            "Once you beat it once, it does get easier",
            "Greatsword, velk sets. Strategy is just kept baiting for his cone breathe attack and give it to him good lol. And learn and practice timing on which attack u can capitalize. There are still many opening that gs can do on him just that i kept doing it wrong. Watch video on youtube and see how normal solo game with your fav weapon on him will do you well.",
            "You can bait it into doing the cone attack? I honestly don't know much about the inner mechanics of the game. I might be MR999 with 4k hours played, but have beaten Fatalis a total of 30 times. Enough to make all the gear and then just to help other people.",
            "Yeah u could, thou its not a 100% bait. \n\n[https://www.youtube.com/watch?v=IZFvdHhmpys](https://www.youtube.com/watch?v=IZFvdHhmpys)"
        ]
    },
    "\"lance is boring!11!!!\" \"lance isn't fun!1!!!\"": {
        "title": "\"lance is boring!11!!!\" \"lance isn't fun!1!!!\"",
        "score": 169,
        "url": "https://v.redd.it/b4zle320j08d1",
        "content": "",
        "num_comments": 25,
        "comments": [
            "My favorite weapon for chill hunting. Pretty bad match up against rajang tho, makes me sad.",
            "I only just started playing Lance recently, and I'm beginning to see the light that is poke, poke, poke, counter",
            "The editing ruined it for me",
            "I should start a new save file and limit myself to weapons I’ve barely used IE lances and Glaive",
            "Then put a gun on it and its easily the most fun weapon, yeah I'm talking about Gunlance",
            "Best weapon for a reason",
            "1 word: UN-FUCKING-MOVABLE",
            "Lance vs. Zinogre is so much fun. Played properly, his attack combos can line up perfectly with the counters.",
            "I am not a Lancer but seeing them successfully tanking and counter attacking monster, I think it must be one of the best feeling playing MH.",
            "Lance and hammer are my funny weapons. One is for poking Rajang in his rear and the other for bonking things.",
            "to be fair it looks damn boring but kt‘s not thst bad. Less fun than other weapons and",
            "Lance - the idiots safe choice and the masters weapon of warcrimes",
            "Goddamn right its boring. Swag axe is for life.",
            "I main lance and hbg\nSolo'd rajang with lance with around 30-40 retries.\nNever again.",
            "Has anyone fought Xeno'jiiva with a lance? It took me about 30 seconds before going \"fuck this\" and changing weapons.",
            "I was literally getting pounded so bad on Longsword, my main weapon, that I switched just to deal with Zino. This worked",
            "Yeah lance seems to be a pretty bad choice for most of the endgame bosses, fatty, alat, monke, etc... Kinda sad. :(  but for the rest it feels amazing to just tank everything. Lol",
            "Lance is actually challenging, but also the most rewarding weapon to use agains Rajang. I really had to watch a pro lancer fight Rajang for tips. Before I was using the \"evade lance\" build, but realized that you lose out on dmg for evading. Its still super fun to fight him, the only major move that you have to watch out for is his grab.",
            "Lance is actually great against Fata. Evade Lancing against Alatreon is super fun even though its nerfed in MHW.",
            "i main lance and not gonna lie the only boss i think the weapon isnt good against is fatty. i love the ala and monkey lance matchups, it almost feels like the weapon was made to deal with them. vs fatty if you get pushed too far away from it or it does the slither away itll kill you with chip damage from fireball spam across the stage.",
            "That's what made me retry many times since I got used to timing the counter instead of Iframe dodges.",
            "I suppose i could understand fatty, bu what about alat's element threshold?",
            "you can check out my build, i posted it on my page. Im using Kjarr weapon so in tottal i have - 920 ice dmg. When my weapon is unsheathed my total Ice dmg is - 1000 its more than enough to get a couple of  elemental topple on Alatreon in between his nova.",
            "You dont even need to bother with element if you are okay carting once in a solo hunt.",
            "I can confirm, I used to do a lot of elemental lance vs alatreon. It's fun using backwards guard during the lightning, frost breath, and fire rings. Lots of hidden movement."
        ]
    },
    "I just want the money man..": {
        "title": "I just want the money man..",
        "score": 447,
        "url": "https://i.redd.it/1h2eq0sejy7d1.jpeg",
        "content": "",
        "num_comments": 17,
        "comments": [
            "I had someone join this from the lobby and then they carted and took half the money 😔",
            "Stones for the small ones and scatternuts for the large one. Definitely like the sleep recommendation made too.\n\nAnd yeah never seemed like the event quest you share with other people lol.",
            "Didn't know that was a farm option. I just wanted to wear the pig mask",
            "Sleep bowgun is the way",
            "Can you block them with the Lance or do their headbutts eat through the shield?",
            "Funny thing is, once you realize they can flinch with stones or be super vunerable to ailments, this honey trap of a quest is a breeze.\n\nKluve or that tempered mini nightshade palomu is a better payout tho.",
            "Just sell excess Monster Parts.",
            "1. Light Bow Gun\n2. Dodge (evade distance & window)\n3. ???\n4. Profit",
            "This Quest is so easy. Not immediately, but once you get your good jewels and learn to abuse your ailments, and rocks (even flash pods can help), you're set, you can do the quest in 7 minutes or less. My best was 3-4 minutes after experimenting with which setup would be best. \n\nIf you have distance on them while they're charging, they won't hit you because their charge range has a limit and while they have general tracking with their charge, you can strafe them, unless you're a little too close. I'd maintain a healthy distance and wait until they charge to throw a rock, just to be safe.",
            "Having just started this game, is this some meme or is there actually some quests that has OP mosswines? lmao",
            "if you have iceborne the farewell zinogre will give you 6 silver/golden egg when you use capture net on it's back when he fell\n\nJust wall bang use capture net on back 6 times then return from quest, easy 60-120k (if you're lucky) for just 1 minute if you're fast",
            "farm? naw that's a slaughterhouse and they are the butchers",
            "Or para bowgun.",
            "you can block them with guard up i think. but it still takes like 90% of your hp with end game armor",
            "even better sell gold coin from the seamen",
            "It's an event quest called \" Mosswinin' and Dinin' \"",
            "It's pretty easy actually. You can do it in 3 minutes without dying, I swear. Paralysis and stones really come in clutch."
        ]
    },
    "Hunting Horn is Goated": {
        "title": "Hunting Horn is Goated",
        "score": 5,
        "url": "https://www.reddit.com/r/MonsterHunterWorld/comments/1dlu3g0/hunting_horn_is_goated/",
        "content": "I thought SnS felt great (don't get me wrong, it does!), but I took a break from HH when I first played a few years ago.  Came back after Rise and sank a bunch of time into Sword and Shield. Then said \"screw it\" on my 2nd playthrough (now on PC) and picked up HH. It honestly feels like crack cocaine. Now that I understand the monsters much better, I can focus on the gameplay loop of HH and it's amazing. Buffing with songs before a fight, dooting with other songs while the monster's down, spinning my horn in its face, saying \"Fuck you\" to Kushala's and Lunastra's Wind Pressure with \"All Wind Pressure Negated\"... I love this game. ",
        "num_comments": 2,
        "comments": [
            "Musical Swiss Army knife but as a Hanna Barbara caveman club is incredibly satisfying"
        ]
    }
}