{
    "Community feedback post - come talk about your ideas!": {
        "title": "Community feedback post - come talk about your ideas!",
        "score": 10,
        "url": "https://www.reddit.com/r/mtg/comments/1dh55u0/community_feedback_post_come_talk_about_your_ideas/",
        "content": "Hi everyone!\n\nLet me introduce myself: I'm a new mod.\n\nAnyways, now that this is out of the way let's get to business. There was recently a call for moderator action. This got us thinking about what the community needs and wants. There are currently three principles that we follow:\n\n1. No violating Reddit's Terms of Service or sitewide rules\n2. No content that is not Magic-related\n3. Team has as little involvement as possible\\*\n\nThese three principles will stay. The sub will remain as open as possible. We can build on top of these. There are other subs that have stricter rules \\[enforcement\\] and if that is more your cup of tea we suggest you try those subs out, too!\n\nHowever! As mentioned before there was a call for more involvement from the team. This is where you come in: \n\n# What would you like to see the team do?\n\nGeneral discussion, concepts and guidelines, please. Keep real life examples to a minimum in order to avoid needlessly going on unrelated tangents. This post is *not* intended to be a political forum, rather, a brainstorming session.\n\nWe wish to retain the open atmosphere here, which means there won't be strict rules nor will there be strict rules enforcement. This doesn't mean we let the sub go haywire. This does, however, mean that the power is yours! Reddit's guidelines suggest that downvoting is intended as a tool to hide irrelevant information. It's widely used as a sign of disagreement but remember that if a post or a comment gets enough downvotes it gets hidden. Use this to your advantage.\n\nMost egregious cases that aren't caught by the extensive filters we have in place should still be obviously reported. On top of that you're also always welcome to approach us via modmail. (There's currently a bit of backlog so bear with us.)\n\nThank you for reading and looking forward to your opinions and ideas!",
        "num_comments": 39,
        "comments": [
            "Please top level comment your favourite Magic-subs here!",
            "All new mods should make a post about their nice new pulls from their most recent box opening to summon this subs resident spooky man and let him know you in fact did not draft the cards with friends. They're apparently dangerous, so be sure to bring a helmet.",
            "The vast majority of posters here want a certain user to stop posting their repetitive spam messages regarding limited play. \n\nIf those messages were the sum total of their contribution to the subreddit, I don’t think we would have an issue. Unfortunately, their aggressive and hostile demeanor to honest correction, open debate, and constructive criticism is tantamount to harassment. \n\nThe moderators need to have a conversation with them about his contributions to this community. I would love for the user in question to share draft resources, deck building tips, and ways to play limited in threads that don’t involve someone posting their play booster pulls and don’t target specific individuals with judgment and insults. \n\nMy read from this post is that you’re not planning on taking any action on this, however. You’re not going to get much buy in from this community for your “we want to run an unmoderated subreddit” approach, whatever supposed principles you use to justify it.",
            "Just out of curiosity, what separates this mod team from r/Freemagic\n\nThey are both low moderation subs, but they have very very distinct cultures. Is this just based on the users, or is there a different moderation philosophy. I’ve always been curious about why this huge difference exists",
            "This sub doesnt have a purpose. There is already the Main sub, joke subs, card pull subs, subs for each format, proxy subs, custom card subs and rules subs.\n\nWithout rules and mods on this sub its descended into a pretty crap sub full of low effort posts and the same questions day in and day out most of which could be found with a 2 second google search.\n\nThe only thing this sub has is a better name and the drinking game I created",
            "I think it's funny that a whole new mod had to be brought to this sub just because the other two mods were too lazy to just ban a user causing problems.",
            "1. How about a sidebar, with maybe like *a rule at all of any kind whatsoever*. Some FAQs? Links to resources? \n\n2. Post flair and user flair. \n\n3. Daily/weekly posts for things like FAQs, rules questions, community engagement/creator spotlights.",
            "a major sidebar update would be helpful.",
            "It does seem that a lot of people offer their opinions or rather judgements about many questions. These can often be patronising, non-constructive, and may push people away from the mtg community in general.\n\nNew players should always be encouraged and helped in every way possible, and as new players, they may not know about the best ways to find rulings, interactions, card searches, etc.\n\nRemember, we were all new to the game at one point or another, and without patience and help from more experienced and knowledgeable players, we may not still love this crazy cardboard game.",
            "Remove any post for good pulls and put them in one long thread.\nSame with deck building advice and ruling questions.",
            "First order of buisness, I need a flair for being the coolest guy here all the time.",
            "I will get flak for this, but maybe keep EDH and commander post to a minimum. I'm a bit tired of everything being about that format, it's a bit tiring after a while",
            "Best suggestion would be to kill this worthless sub",
            "This is no longer an issue. :)",
            "Ya he went from annoying to unhinged very quickly",
            "This is not the case. This particular issue has been dealt with and actions have been taken.\n\nEDIT: I do want to be a little pedantic about this... We specifically avoided the word \"unmoderated\" because that is not where we want to go from this point onwards. We quite literally mean \"open atmosphere\" which is code for not having restrictive rules enforcement. There are other subs that already fill this purpose.",
            "That is a very difficult question. People probably find this sub first because it's big and has a more fitting name than r/magicTCG or r/freemagic. A lot of new people come here and then branch out to other subs is my theory. I do not know for certain.\n\nFor the sake of transparency I am also a mod for r/magicthecirclejerking which has a high level of rules enforcement and BracerCrane is a mod for r/freemagic which has a low level of rules enforcement. So there's overlap with other subs but I believe the biggest difference is how people discover this place first before other subs. BracerCrane has been here for a long time so the cultural difference cannot be tied to a person / mod.\n\nI've seen people being genuinely confused when they're being told that r/magicTCG is the \"main sub\" thinking that this is the main sub which goes to show that this could potentially be their first point of interaction on the Magic-related Reddit.\n\nIf my theory is correct it's good to have a newcomer-friendly entry point sub where you can ask all the questions you want. There is currently a slight problem with snarky and aggressive comments to very basic questions but I'm 100% certain we can figure something out.",
            "> Is this just based on the users, or is there a different moderation philosophy. I’ve always been curious about why this huge difference exists\n\nKindred spirits like kindred spirits. People like to participate in communities that they can vibe with, and there's nothing that moderation (or the lack thereof) can really do about it. \n\nAnother point to make is that Freemagic also has historically been the designated \"protest subreddit\", which means that metareddit discussions (i.e. drama) and hot takes on hot button issues and culturally taboo discussion topics get talked there in volume. As a direct consequence, because Freemagic occupies the \"controversial topics go here\" space in the wider MTG community, other communities can remain relatively free of \"culture war\" topics. \n\nIdeologically speaking there is no difference between r/Freemagic and r/mtg to me. Free speech is an ideological maxim to me and I genuinely believe that free expression is a human right unparalleled in importance. The second personal motive why I joined the Freemagic moderation team when it was formed was to be a canary in the coalmines if moderator abuse starts to happen and I fully intend to do the same here.",
            "Okay, let's give it a purpose. The main sub is definitely a thing but their rules are much more restrictive than the ones here. Downsides include low effort content but also it's an opportunity for new Redditors and Magic players to start from somewhere.",
            "Both other mods have a decent number of mod actions (=housekeeping) and especially BracerCrane is taking care of a robust automod ruleset. I believe the issue as a whole is related to the massive growth this sub has experienced recently. This is why an additional mod was added to the team.\n\nI'd much rather look at this debacle as \"a whole new mod was introduced to ease the work load\" but I also understand your perspective.",
            "1. I will discuss this with the other mods!\n\n2. Post flair I'm pretty sure we will have some. User flairs I don't see a problem with either.\n\n3. Some of the most posted archetypes should be easy to do.\n\nGood suggestions overall! I'm personally all for these but as said I need to discuss these first.",
            "Sure. Contents?",
            "This makes sense and I agree.\n\nCould this for example mean selectively more mod actions in threads asking for help?\n\nEasy fixes: a post tag for \"help wanted\" which would trigger automod to leave a reminder message.\n\nOther ideas? (For everyone in general, not just you.)",
            "Put commander and edh posts in one thread too.",
            "What would even be left after that? Lol there would just be 3 threads",
            "that could be said for any post on this sub",
            "Unfortunately this is true both ways: everything is about that format because so many people play it. Unless we start enforcing strict guidelines it is incredibly hard to control what people post. I get your frustration, though.\n\nTwo solutions you can try by yourself for starters:\n\n1. Downvoting repetitive posts so that they get hidden.\n2. Visit another sub. I don't know what you're into but maybe r/magicTCG or r/MagicArena are more appropriate?",
            "Huh? What for? Kill it, then what?",
            "Who will I laugh at if this place is gone?",
            "Were they banned?",
            "But there are subs that do everything better than this one, so what's the point of this one? Answer there isn't one",
            "It's difficult to find a balance between discouraging low-effort posts that can be answered by googling and encouraging new players to come for support that they may not know how to find.\n\nA post tag and auto-response would be a great start- both to remind the poster of the common places to find answers, and to remind other posters to be kind and supportive of people looking to learn.",
            "Leaks, interesting wins/stories, discussions about the future of the game, community discussion, ect.",
            "One person sees a cool post format, they post a thingy with that fad. Many other subs have very strict guidelines in place to prevent this. The downside, of course, is that you can't post about everything related to Magic.",
            "Not really a public matter, but I mean I guess you can tell that they're not here, so... Yeah.\n\nI've yet to have a full conversation with them but that's one of the next things on my list. Also this ban wasn't issued by me, just to be clear.",
            "What do you want us to do? I'm serious about this. We really want to see this sub flourish. What kind of a sub would you like to be a part of?",
            "You know what this sub doesn't have? A goddamn thread for every single leaked card every time a new set comes out that floods my front page. It's literally how I discovered this sub, because I couldn't deal with the main sub anymore during every spoiler season.",
            "God please no individual threads for leaks, that's literally what sent me here from the main sub",
            "I love you"
        ]
    },
    "Is this real my eyes are terrible ": {
        "title": "Is this real my eyes are terrible ",
        "score": 461,
        "url": "https://www.reddit.com/gallery/1dlh8nu",
        "content": "traded a fetch for it did I get scammed",
        "num_comments": 99,
        "comments": [
            "I don't know how to tell if it is.... but it's in really good shape for it's age if it is real.",
            "Show us the back zoom in like that on the T in the word The",
            "My revised tutor looked this nice. Came from the lgs. Hope it isn't fake.",
            "It's real, offset is correct as well as mana symbols, rosettes and color separation",
            "It looks just like mine. Played but crispy",
            "Just based on these pics, it looks legit to me. However a close-up of the green dot and the first T in \"The Gathering\" are better ways to tell.",
            "Looks right to me. I mean it's DT, one of the most well printed old cards. That looks exactly like my Demonic Tutor, and mines legit.\n\nSo you're good!",
            "Im no expert at spotting fake cards but I was playing when revised was still a new set and it looks fine to me",
            "“take it into your hand” sounds… erotic?",
            "Definitely a fake, no way Wizards made something like this. This card is WAY too powerful.",
            "I have one just like it, it’s about $30",
            "Ah good old magic",
            "I’ve got a few DTs in this condition, all in decks, in sleeves, that I played on and off for years. I have a few that are in much worse condition back from\nThe days I played without sleeves. It looks good, real or not.",
            "I owned one of those once, actually mine was a beta so it had a black border.",
            "It only costs black colorless hard to believe",
            "at this point, who gives a shit? we've long reached the point where fake cards can look precisely like real ones, like you 100% couldn't even tell them apart with the finest measuring tools. does it make a difference for your card collection if it's possibly fake? no. does it make a difference when using it in a deck? also no. in this case, you could even have a shitty looking fake, sleeve it up and nobody would even be able to tell, not to mention that proxies are the norm almost everywhere now anyways.",
            "I have one that's real that looks just like this,  in surprisingly good condition. These old cards just look weird to us (if it is real, hoping yours is).  I can show you mine when I get home to compare, it's the same set I believe",
            "This looks fine from the pics, but they aren't ideal.\n\nSome tips on authentication:\n\nZooming in on the green dot on the back is one of the best checks. There are a number of features there that will tell us if the back is authentic. Zooming in on the mana cost like you did is also helpful so we can check the front, but it's a bit harder to tell.\n\nIf your camera has a RAW mode, use that. These pictures have a lot of computer software mucking with them. Unaltered pixels are best.",
            "Yes",
            "That’s legit, I have a few of them. It’s also really old.",
            "Either my eyesight has gotten worse or my current glasses prescription sucks, because, much like OP, it’s recently gotten hard for me to see some details on cards when I inspect them.  Either way, you should consider doing like me and investing in a jeweler’s loupe.  Even just using a cheap one off of Temu has made things a lot easier.",
            "Good trade!",
            "It's real",
            "Looks like a real 3rd revision card I think 1996.",
            "Nah, it has the pentagram it's an OG and surely valuable. I think, I ain't an expert in old cards, tho. As long as it's real, you got a deal. I would think",
            "Green Bubble",
            "It’s a real card. Long text and all. But that mana symbol looks a little wrong to me. That could just be a printer issue from WOTC.",
            "who even cares? if it's indistinguishable from a \"real\" card, it doesn't matter. it's cardboard.",
            "What’s the trick to tell of the card is real?",
            "I found my cards in my parents house. I had 2 of those",
            "Light test it, shine an led light through the card. Wotc uses a blue core so if the light has a blueish tint you're good, if it is any other color bad news brother",
            "I don't think it is. The language of the card's effect -- specifically \"take it into your hand\" and \"reshuffle\" -- does not match Wizards' diction.",
            "Damn, getting that for a fetch is insane. Good pull Op!",
            "Can we just spin off an exclusive sub for spotting fakes already? I genuinely don't care. I'm here for theorycrafting and spoiler hype, not to rate your build or spotting your fake",
            "If it turns out to be real send it to be graded. A graded card is worth far more then ungraded.",
            "You traded a fetch for this? Which fetch? Like, almost all fetches are below 20$ so that for a demonic tutor of any kind is one hell of a trade.",
            "[deleted]",
            "It’s revised. No point to fake this card. It’s worth only 50 bucks",
            "Seems almost too good of condition. Was it in a hermetically sealed box with a constant temperature and no humidity?",
            "I keep my top shelf cards in inner sleeves, inside penny sleeves in binders. I have plenty in this type of condition. That's not a good enough indication of it being fake. You need to start looking at the back of the card with a loupe. Or get it graded?",
            "It's got a bend through the middle like it was accidentally bent on a play mat",
            "Hello, Cheese friend.",
            "How do I do that on mobile",
            "How can you tell from looking at these?",
            "Love the sarcasm",
            "Definitely too powerful, it makes me sick. In response I think we should ban Nadu.",
            "Based off the picture if he got it graded it'd probably come back pretty high and worth more.",
            "The white border cards I’ve always liked. They hold up really well.",
            "Scrolling is free. Commenting costs you time.",
            "How do I play magic",
            "Look at serious sam over here. The rest of us peasants who don't check every card they buy are clearly not serious about buying real cards. Who hurt you? Too many Craterhoof's to the face this week, or did you get this way on your own?",
            "You're kinda right though lol. There's not much people here can do with basically one photo. ",
            "Op has bad vision, chill out.",
            "There's incentive to fake any card over $10. Cardstock is cheap, and suckers are easy to come by.",
            "Dollar to 50 is 49 profit which is a lot",
            "I'll sell you 100 $50 cards right now as long as you don't look at them too hard.",
            "making $49.50 for a 50 cents is definitely an incentive",
            "Revised is totally feasible to find in NM. I see Dual lands among other things in card shops around town, and the internet, that are NM and look fresh.",
            "Lmao people always say stuff like this when I play pristine condition cards from tempest/stronghold. \n\nLike was I the only teenager that took care of their stuff?",
            " revised can absolutely be found in NM condition, and more players need to understand this 😅",
            "I had a revised demonic tutor that was gen mint, but I also pulled it from a pack and when from pack to triple sleeves",
            "Someone probably bend tested it",
            "Hello brother",
            "https://youtu.be/-vu__GHQthE?si=1zVa74Kz68PxnU52",
            "You’ll have to either upload the image to imgur and reply with a link to it or create a new post (preferably to your own profile so you don’t spam the subreddit) and link that instead. Unfortunately this subreddit doesn’t allow comments with pictures in them.",
            "How do I use a phone camera who asks…. Cmon man look up a tutorial or something",
            "Bro what 😂",
            "With your camera...?",
            "Bro DM me. I picked one up yesterday in this exact condition. Ill send you pics.",
            "how did you do it with the first images?\n\nyou can upload them to like, imgur and link us",
            "The green dot has red dots in it that form an L at a certain position. Counterfeits usually don't copy that (would increase production cost by a good chunk)\n\nNo clue on the T",
            "OP said there is a bend which would make it damaged...",
            "Scrolling also cost time you dungus",
            "Dude did come across as a chooch but I just got one in the mail yesterday, I paid a bunch for an lp survival of the fittest and saw afterwards that a reviewer said the guy sent him a fake but the seller rectified the situation quickly. Made me nervous so I spent $9.99 and saw the red dots in the green circle. Decent tool to keep around",
            "I would think more of an incentive. The most expensive cards are highly scrutinized. Who thinks to check whether a 50 dollar card is real? I'm not saying anything about OP. I own three of these and would never have thought to check. I got one of them in trade. Maybe I'm to trusting.",
            "Yup, my revised that sat in a cardboard box for 20 years still look good, just not the ones that were in decks with no sleeves",
            "Can confirm, just got a Revised [[Lightning Bolt]] yesterday and it looks to be NM",
            "It’s also an uncommon, not a rare like the duals. Most dual lands have seen play, but demonic tutor has been restricted forever and it’s uncommon. I probably had 6 or 7 revised DT’s at one point even though you could only play one in a deck. There are definitely still unplayed copies floating around out there.",
            "I have 2 of these guys and mine are in good condition but the yellowing of the border seems unavoidable to me",
            "You must remember, that during the early days there weren't even card sleeves to play. There were those binders and binder pages from sports cards. But play was mostly done \"raw\".  \nThat's why the really old stuff often is pretty beat up.  \nPlaying on the school yard on concrete etc wasn't unheard of.",
            "I was doing better than most just by putting my cards in a box with an elastic band around them at that time...",
            "Probably",
            "You're Gouda company, my friend.",
            "Hey, you didn't insult this user, so have a great week!!! You deserve it for just trying to help and be nice 😀 I never would've known that since I just browse mostly and have never actually made a post like that myself.",
            "Thank you I got help in dms about it I appreciate your help",
            "Helpless",
            "A flick of the thumb versus writing out a complaint that’ll get ignored. Hm lol",
            "Maybe a bit too trusting. I am certainly going to make sure a $50 card is real lol. Because it's probably a card I want to use in a tournament. But it's true, you wanna make money passing off fakes? Go for the $5-$10 range, because *that's* definitely a price point no one is checking unless it's a basic land",
            "[Lightning Bolt](https://cards.scryfall.io/normal/front/7/7/77c6fa74-5543-42ac-9ead-0e890b188e99.jpg?1706239968) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Lightning%20Bolt) [(SF)](https://scryfall.com/card/clu/141/lightning-bolt?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/77c6fa74-5543-42ac-9ead-0e890b188e99?utm_source=mtgcardfetcher&format=text)\n\n^^^[[cardname]] ^^^or ^^^[[cardname|SET]] ^^^to ^^^call",
            "Mine too!",
            "Meanwhile, I made a meme deck in about 1995 with 24 Revised Lightning Bolts and 16 Mountains. Needless to say, they are scuffed to buggery.",
            "I just picked one up yesterday and honestly have never appreciated the color white so much.",
            "It seems the Cheese doesn't stand alone after all!",
            "Thanks dude, you as well <3 idk why everyone was being such an ass to the guy, it was a very reasonable question :/",
            "No worries 👍",
            "Yeah I thought so too. That's why I had to spread a little love. The damn thread was feeling a little dark for such a normal type of question",
            "Turns out it's real it's front face it's just really well kept the back has some bends and scraped and there's an old play mat bend but it looks legit my lgs told me they'd check it out for free aswell",
            "Oh that’s awesome! Congrats on your new tutor then :)"
        ]
    },
    "This works right": {
        "title": "This works right",
        "score": 42,
        "url": "https://www.reddit.com/gallery/1dlu267",
        "content": "Still relatively new, so I'm unsure how etb triggers happening around the same time work. If I use Shingengars resurrect ability, would thief of blood remove the finality counters from all the resurrected creatures if he's also resurrected by the ability ",
        "num_comments": 16,
        "comments": [
            "No, but if I'm not mistaken [[Solemnity]] would work",
            "No it'd enter at the same time not after the others. So they all enter with a finality counter. Unless of course you cast the card after activation of Shilgengar ability",
            "if you were reanimating thief of blood with shilgengars activated ability, i dont think it would work since every other thing you could reanimate with a finality counter on it would ETB at the same time as Thief of Blood, meaning there is no one to target for its etb. however you can absolutely remove finality counters if there are already some on the field with thief of blood",
            "As others have said it doesnt....but Note that the key is the wording \"as thief...enters\" rather than \"when thief enters....\" making it not a triggered ability.  If it were a triggered ability it'd work how you want.",
            "I think it'll work. I may be wrong about how stacks work's but the demon brings things from the graveyard \"with\" a finality counter. Meaning before ETB. Therefore, after your vampire enters, it's ETB will resolve afterwards removing the finality counters from permanents which they came in with before.",
            "“This works right” is a sentence. As in, look at this combo that works correctly. \n\n\n“This works, right?” Is the question you wanted to ask.",
            "It would enter with the counter on it, his etb would resolve and then you could remove the counter.\n\nEdti: it's not an etb it's a replacement so no it wouldn't work",
            "I'm a little unsure by your wording, but if you're asking if they would remove finality counters when they themselves get resurrected, then yes. They enter, the ability triggers, SBA checks counters, Resolve.",
            "[Solemnity](https://cards.scryfall.io/normal/front/0/a/0a71fb62-acbd-49f5-842f-0fc9fa48afea.jpg?1562788659) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Solemnity) [(SF)](https://scryfall.com/card/hou/22/solemnity?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/0a71fb62-acbd-49f5-842f-0fc9fa48afea?utm_source=mtgcardfetcher&format=text)\n\n^^^[[cardname]] ^^^or ^^^[[cardname|SET]] ^^^to ^^^call",
            "For further clarification: if it was worded \"when cardname enters\" it would work because it would cause a trigger to go on the stack after all the creatures enter. But because it's an \"as cardname enters\" it just happens before any creatures even hit the battlefield.",
            "That's not how the stack works. Also, there's no targeting with the ETB.",
            "Punctuation is important!  \n\nYears ago, playing wow, I had to explain to someone how simple comma placement changes their statement drastically and they should not let us, with our vivid imaginations, take libiteries with what you meant.  \n\nWhat do you mean?  OK, let me show you.  Here are the two statements you could be making. \n\nBRB boys, shower.\n\nBRB, boys shower.\n\n.........point taken.",
            "it's not an etb trigger, or a trigger at all since it uses the word \"as\"",
            "If it was \"when cardname enters\" it would work, but theif of blood is an \"as cardname enters\" so it doesn't have a trigger and just happens before the new creatures enter.",
            "It's an \"as\" trigger not a \"when\" trigger so it doesn't use the stack.",
            "Didn't realize it was a replacement effect nevermind, thanks!"
        ]
    },
    "Can you guys guess my favorite Planeswalker?": {
        "title": "Can you guys guess my favorite Planeswalker?",
        "score": 65,
        "url": "https://i.redd.it/e8bsnoqv638d1.jpeg",
        "content": "I finally completed my collection and wanted to share. ",
        "num_comments": 79,
        "comments": [
            "Is it Jace?",
            "IT'S PIKACHUUUUUU!!!!!",
            "It is Gideon, because he sacrificed himself for THAT BITCH.\n\nAlso what is Professor Onyx doing there? She is clearly unrelated.",
            "Judging by the cards shown definitely Niko Aris.",
            "I can't. There is way too much Liliana so I can't tell you this is Angrath. Sorry.",
            "Garruk?",
            "So many Liliana’s but that’s not even all of them",
            "Must be Ajani!",
            "Definitely Chandra",
            "You. You are the planeswalker...",
            ".....Jace?",
            "Nice! Love me some Liliana action too.",
            "No sorry",
            "I recently completed my collection of Lilianas. I have at least one version of each printing of her (barring the Planeswalker deck versions), and recently got the one I was missing. We love our sassy sarcastic necromancer lady",
            "You really like garruk but why is professor onyx there?",
            "Someone should seriously check this guy's basement for a woman called Liliana...",
            "Can we get a second clue?",
            "Dack Fayden?",
            "tamiyo?",
            "I don't even get why you like Tibalt so much tbh.",
            "Garruk!",
            "I think it's Liliana.",
            "I see you don't love her enough\\~ You know what I mean!",
            "Ajani I guess?",
            "You just need the Amano art.",
            "Okay, so I see a lot of black cards here, so the obvious choice would be the most popular black planeswalker... is it Tevesh Szat?",
            "Feel like it's Gideon",
            "Tevesh Szat?",
            "Hate to be that guy but you are missing more than a few Lili's. \n\nAlso- is it Jace?",
            "Nice! I would love to get the all black San Diego convention one, but too expensive.....",
            "Everyone loves Jace, WotC surely does",
            "No. It's clearly Nicol Bolas 🙄",
            "Somehow I thought the exact same thing before clicking on the post. I don't even like him. Too boygroupy looking.",
            "It's Clefairy",
            "Totally unrelated",
            "Ooh please lmk what I'm missing, I need them all!",
            "He is my second favorite, to be fair",
            "I'm pretty sure I have them all. Am I missing any?",
            "Professor onyx is garuuk in disguise. Fun fact",
            "Haha no need for that",
            "Okay your clue is: it's not Gideon",
            "Rest in peace king",
            "Boyish charm",
            "But mine is Bolas 🥲",
            "FUCKKKK!!!",
            "The photos from above clearly it's a Jigglypuff",
            "I mean... The Secret Lair Liliana Death's Majesty which shows Liliana carrying a zombie on her shoulder is a must have. (Not at all a horny suggestion)",
            "You're also missing the Japanese only special artwork Liliana, Dreadhorde General from War of the Spark \n\nhttps://www.hareruyamtg.com/ja/products/detail/71093?lang=JP",
            "[[liliana, heretical healer]] I didn’t see this flip walker version of her in your picture.",
            "...that's exactly what you would say in this situation",
            "LLOL",
            "Gone too soon, taken too early",
            "Ahh, now I get it. Nice collection for real, though!",
            "I do love bolas. I have 5 different bolas cards, he's top 5 for me.",
            "Oh yeah, well I definitely know there are different printings of the ones I have, maybe I'll be able to afford all those at some point. But I'm pretty sure I have all of the actual cards? There's also the Japanese exclusive ones I want at some point but they're extra pricey too.",
            "I know ughhhh I want it so bad but it's so expensive",
            "[liliana, heretical healer](https://cards.scryfall.io/normal/front/d/8/d8b718d8-fca3-4b3e-9448-6067c8656a9a.jpg?1651951703)/[Liliana, Defiant Necromancer](https://cards.scryfall.io/normal/back/d/8/d8b718d8-fca3-4b3e-9448-6067c8656a9a.jpg?1651951703) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Liliana%2C%20Heretical%20Healer%20//%20Liliana%2C%20Defiant%20Necromancer) [(SF)](https://scryfall.com/card/cc2/1/liliana-heretical-healer-liliana-defiant-necromancer?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/d8b718d8-fca3-4b3e-9448-6067c8656a9a?utm_source=mtgcardfetcher&format=text)\n\n^^^[[cardname]] ^^^or ^^^[[cardname|SET]] ^^^to ^^^call",
            "Haha that's funny! no need to search the basement though haha",
            "Thank you!",
            "I think I have one version of every bolas except the original but he is def my favorite planeswalker and villain in MTG (even though I get a lot of hate for it😂)",
            "Oh sorry I thought you wanted all printings, ahahah. Yeah, the Japanese one is my personal Grail but pricey as hell. I don't know where you're located but I bought the Secret Lair one at like 14 euros recently. So not that expensive, all things considered...? I don't know, I'm a simp for Liliana as well. You make me want to grab the baseball one, just for the sake of it.",
            "It is. I'm glad I got mine when I saw one for cheap here in Japan",
            "Sooo... what you are saying is she is locked up in the attic??",
            ">Thank you!\n\nYou're welcome!",
            "The og bolas is so ugly lol, I can't take him seriously.\n\nMy first commander deck was grixis and had a bunch of bolas in it. My friends didn't appreciate that very much.",
            "I have my eyes on a few, I thought the deaths majesty was more expensive, I'll have to order it! And yeah baseball one is so cool and... Uhhh... Evocative..\n\nNo shame for simping for liliana!",
            "That's awesome!",
            "Just don't search any of my residence, there's no need. I promise haha!",
            "Yeahhhh lol. I’d prefer to get a secret lair or updated art one. I’ll link one if I can find it",
            "https://www.tcgplayer.com/product/516585/magic-fnm-promos-nicol-bolas-jp-exclusive?Language=English&page=1\n\nhttps://www.tcgplayer.com/product/283350/magic-secret-lair-drop-series-nicol-bolas-stained-glass-textured-foil?Language=English&page=1\n\nI’m probably gonna get one of these two personally 😁",
            "She's... eum... a very cool card, and I need a hundred of Liliana for my... hundred decks... Yeah, yeah...",
            "Liliana Simpers Assemble !",
            "I do have the more updated version of his creature card, the one that makes you pay to keep him alive. It's still weird though and I much prefer his depictions on planeswalkers.",
            "Woah those are both sick. I love the stainglass style cards. And that first one is gorgeous x_x",
            "hahaha... Yeah... Definitely gonna use her cards... In uhh.. uhm. To play the game with... Ahaha",
            "That is fair and I strongly agree",
            "Ikr! Didn’t know the first one existed until today but the JP exclusives always go hard lol.",
            "The jp exclusive Thrill of Possibility is probably my favorite card art of all time. it's so goofy"
        ]
    },
    "This Common has a 67% Win Rate in Hand in Limited…": {
        "title": "This Common has a 67% Win Rate in Hand in Limited…",
        "score": 504,
        "url": "https://i.redd.it/el79e4dbgy7d1.jpeg",
        "content": "It’s no surprise that this card was going to be great in limited, but after a week and a half of data, 17 lands has this card credited with a 67% in hand win rate.\n\nThat is unprecedented from any common ever published across MTG’s history, and I’ve been on the wrong side of many draft matches with this one. Doesn’t feel great!\n\nIt’s officially in my can’t pass list and must draft (splash if I can), as it’s only outperformed by 2 rares in the entire MH3 set.\n\n[Here’s my most recent trophy 🏆 draft where I fortunately had 3 of these suckers. Check it out if you can, but let me know what you think about Chrys and the format in general?](https://youtu.be/HKoSuXF01tU?si=6WQstBeHScGTze9R)\n\nI’m giving MH3 a 7/10 and wish the Eldrazi decks weren’t so overly supported.\n\n",
        "num_comments": 57,
        "comments": [
            "Passed an Emrakul in p3p1 for a third Writhing Chrysalis and went 7-0 lmao",
            "What's so good about it? It's just a two-mana 4/5 reach! Wait, never mind - answered my own question.",
            "Nice to know I'm the 33%",
            "Hehe ramp + big body go brrrrrr",
            "I drafted two [[Genku, Future Shaper]] in one draft and still had to struggle against a single copy of this bastard.",
            "I'm confused and only recently returning after like a 15 year break, does limited format not have [[terror]] or some equivalent?",
            "Mythic common, this thing and \\[\\[Kozilek's Unsealing\\]\\] are amazing together",
            "My w/r with this guy isn't great. Do you play him, then sac the spawn for mana the next turn to get a 7 drop or whatever out?",
            "Well yeah. I played a dude tonight who went infinite with basking broodscale and Rosie cotton. Made 100k spawns and put 100k counters on the lizard.  If he’d had this card and it didn’t have summoning sickness someone would have died on the spot.",
            "The hard on from outer space, my girlfriend says 🤣\n\nShe said it looked like if Thanos used the reality stone an fucked up his dick by accident.",
            "Its clearly not been in my hands. Ill drop that win rate faster than… err…",
            "Had a lot of fun drafting this set….chrysalis is a bomb but not unbeatable…",
            "Is this as good in constructed as it is in limited?",
            "Man ever since the LR episode drop I don’t see these anymore lol, these used to wheel",
            "If anyone enjoys watching MH3 arena drafts, I post on my new YouTube channel 5 days a week. It’s not much, but it’s honest work as we get started here. 🫡\n\nArena Open going down tomorrow.",
            "[my first game today](https://imgur.com/vvh4hVC).\n\n[my second game today](https://imgur.com/hBmqWWF).",
            "This shit slapped in my sealed deck. Had 2 of them and I got 2nd only losing to an energy deck that was piloted by a guy who has been playing since 96 lmao",
            "Draftism.com ranks this as the nr 1 bomb in the set for limited.\nI guess this is what happens when designers forget about limited altogether...",
            "I mean, the card isn't entirely busted, it doesn't have vigilance, flying, trample, annihilator7, color prot.\n\nIt could be much worse",
            "Optimal",
            "Did that emrakul end up coming back in your prize packs?",
            "Pulled a p1p1 Emrakul and got to play it twice. Yes I went 4-3 but getting to play it twice was worth it lol",
            "That's fucking disgusting, I'm sick to my stomach...",
            "You forgot that it ramps you from four to seven with a land drop so you can play the common 7s on five(or more likely, four with ramp on two as well).",
            "When you put it like that I understand why this is busted.",
            "It also gets *even bigger* if you have cards that produce additional Eldrazi Spawn tokens… 😅",
            "The reach is just excessive lol",
            "[Genku, Future Shaper](https://cards.scryfall.io/normal/front/0/c/0cbcc962-65c4-496d-8034-75c8d204dba3.jpg?1717012707) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Genku%2C%20Future%20Shaper) [(SF)](https://scryfall.com/card/mh3/186/genku-future-shaper?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/0cbcc962-65c4-496d-8034-75c8d204dba3?utm_source=mtgcardfetcher&format=text)\n\n^^^[[cardname]] ^^^or ^^^[[cardname|SET]] ^^^to ^^^call",
            "There are always some kill spells, most of them are in black tho.\nA 2/3 with reach, that produces 2 mana generating creature tokens and gets +1/+1 counters is quite good though, especially in draft.\nYou play that creature, sacrifice both tokens and add 2 mana and have a 4/5 with reach.",
            "A big issue is that while the murder equivalent in the format obviously cleanly deals with it ([[breathe your last]]), a lot of the other premium removal pieces ([[ghostfire slice]], [[expel the unworthy]], [[fanged flames]], [[thraben charm]], [[wither and bloom]], [[galvanic discharge]]) are either awkward or miss entirely.",
            "You really just popped back in after 15 years to say “dies to terror” 💀",
            "High floor, high ceiling card. \n\nWorst case it sucks up a kill spell and you still have the spawns. Best case it ramps out a bigger threat next turn while also growing huge as you have other sources of spawns.",
            "[terror](https://cards.scryfall.io/normal/front/a/3/a3870eba-4e8f-414d-817c-14ec97f6a93c.jpg?1675199810) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=terror) [(SF)](https://scryfall.com/card/dmr/103/terror?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/a3870eba-4e8f-414d-817c-14ec97f6a93c?utm_source=mtgcardfetcher&format=text)\n\n^^^[[cardname]] ^^^or ^^^[[cardname|SET]] ^^^to ^^^call",
            "Kozileks unsealing is insane in limited! Either get a bunch of eldrazi spawn or eventually you have enough spawn ramp and trigger the draw 3.",
            "Yeah, I went up against somebody who had this combo and just got utterly vaporized",
            "[Kozilek's Unsealing](https://cards.scryfall.io/normal/front/e/6/e6b44ffe-db9e-4db5-9806-098411c9ece0.jpg?1717011739) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Kozilek%27s%20Unsealing) [(SF)](https://scryfall.com/card/mh3/65/kozileks-unsealing?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/e6b44ffe-db9e-4db5-9806-098411c9ece0?utm_source=mtgcardfetcher&format=text)\n\n^^^[[cardname]] ^^^or ^^^[[cardname|SET]] ^^^to ^^^call",
            "Yep I do it a bunch in the vid I linked. Cast then ramp into bigger eldrazi and now you likely have a 5/6",
            "Brutal. Eldrazi’s meet the shire.",
            "Your girl checking out alien dicks now?",
            "He is great within a [[Azlask, the Swelling Scourge]] Deck when you really focus it on generating scionspawns. When you get [[Eldrazi Displacer]] and [[Brood Monitor]] or [[Emrakuls Hatcher]] out, you not only generating infinite expierence counter, this Dude get infinite too.",
            "Just wait for Modern Horizon 6",
            "If it did it would be a rare or mythic and rarely be seen. Its a common and thats the rough part.",
            "You're getting downvoted because people don't realize you're joking, redditors really be needing the /s or they can't sense humor 😅",
            "Hah haven't opened any of the boosters yet, I tend to save em up and batch open them",
            "Excessively hilarious",
            "Yeah, and actually a pretty big deal in limited",
            "Ah right, in draft I guess it would be hard to counter. Fair enough",
            "#####&#009;\n\n######&#009;\n\n####&#009;\n\n[Breathe Your Last](https://cards.scryfall.io/normal/front/5/0/50eac71d-54f9-46c2-aa1d-c04c37e61f74.jpg?1717011871) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Breathe%20Your%20Last) [(SF)](https://scryfall.com/card/mh3/82/breathe-your-last?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/50eac71d-54f9-46c2-aa1d-c04c37e61f74?utm_source=mtgcardfetcher&format=text)  \n[Ghostfire Slice](https://cards.scryfall.io/normal/front/2/a/2adea3ee-138f-455b-a001-586883c44758.jpg?1717012193) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Ghostfire%20Slice) [(SF)](https://scryfall.com/card/mh3/123/ghostfire-slice?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/2adea3ee-138f-455b-a001-586883c44758?utm_source=mtgcardfetcher&format=text)  \n[Expel the Unworthy](https://cards.scryfall.io/normal/front/5/f/5f68baee-f503-407d-931f-2a550470a55f.jpg?1717011399) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Expel%20the%20Unworthy) [(SF)](https://scryfall.com/card/mh3/25/expel-the-unworthy?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/5f68baee-f503-407d-931f-2a550470a55f?utm_source=mtgcardfetcher&format=text)  \n[Fanged Flames](https://cards.scryfall.io/normal/front/f/c/fcfac301-55db-49a7-9a0d-918c907703da.jpg?1717012155) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Fanged%20Flames) [(SF)](https://scryfall.com/card/mh3/118/fanged-flames?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/fcfac301-55db-49a7-9a0d-918c907703da?utm_source=mtgcardfetcher&format=text)  \n[Thraben Charm](https://cards.scryfall.io/normal/front/d/d/dd28a646-f38f-4cdf-948c-969cd979e5e6.jpg?1717011565) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Thraben%20Charm) [(SF)](https://scryfall.com/card/mh3/45/thraben-charm?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/dd28a646-f38f-4cdf-948c-969cd979e5e6?utm_source=mtgcardfetcher&format=text)  \n[Wither and Bloom](https://cards.scryfall.io/normal/front/9/5/95c2390f-71f1-4e42-83da-d603ca86a8d0.jpg?1717012101) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Wither%20and%20Bloom) [(SF)](https://scryfall.com/card/mh3/111/wither-and-bloom?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/95c2390f-71f1-4e42-83da-d603ca86a8d0?utm_source=mtgcardfetcher&format=text)  \n[Galvanic Discharge](https://cards.scryfall.io/normal/front/3/2/32aa6e33-221f-414c-9b51-850d97a7e051.jpg?1717012186) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Galvanic%20Discharge) [(SF)](https://scryfall.com/card/mh3/122/galvanic-discharge?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/32aa6e33-221f-414c-9b51-850d97a7e051?utm_source=mtgcardfetcher&format=text)\n\n^^^[[cardname]] ^^^or ^^^[[cardname|SET]] ^^^to ^^^call",
            "High floor*",
            "A ton has changed since then. Creatures just do more and get back their value without attacking or sticking around. On cast this makes 2 spawns so no matter what you get that. Basically it is very hard to answer efficiently and can just be the biggest threat on board and it is a common",
            "I think my issue was also lack of late game bombs. Mh3 is weird in that the curve is way higher with Eldrazi in the format",
            "Rosie Cotton would've simply walked into Mordor and the War of The Ring would've ended in a single volume.",
            "😆",
            "#####&#009;\n\n######&#009;\n\n####&#009;\n\n[Azlask, the Swelling Scourge](https://cards.scryfall.io/normal/front/c/e/ced9db11-ba95-4b09-89b6-0b49ffb1fa82.jpg?1717644364) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Azlask%2C%20the%20Swelling%20Scourge) [(SF)](https://scryfall.com/card/m3c/5/azlask-the-swelling-scourge?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/ced9db11-ba95-4b09-89b6-0b49ffb1fa82?utm_source=mtgcardfetcher&format=text)  \n[Eldrazi Displacer](https://cards.scryfall.io/normal/front/f/0/f0bb1a5c-0f59-4951-827f-fe9df968232d.jpg?1562943353) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Eldrazi%20Displacer) [(SF)](https://scryfall.com/card/ogw/13/eldrazi-displacer?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/f0bb1a5c-0f59-4951-827f-fe9df968232d?utm_source=mtgcardfetcher&format=text)  \n[Brood Monitor](https://cards.scryfall.io/normal/front/e/a/ea7d4a49-8681-4f95-8718-96648bf73c39.jpg?1562950866) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Brood%20Monitor) [(SF)](https://scryfall.com/card/bfz/164/brood-monitor?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/ea7d4a49-8681-4f95-8718-96648bf73c39?utm_source=mtgcardfetcher&format=text)  \n[Emrakuls Hatcher](https://cards.scryfall.io/normal/front/3/5/35fab29d-1bcc-4ba0-90bf-427d95bf6699.jpg?1593095836) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Emrakul%27s%20Hatcher) [(SF)](https://scryfall.com/card/ddp/59/emrakuls-hatcher?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/35fab29d-1bcc-4ba0-90bf-427d95bf6699?utm_source=mtgcardfetcher&format=text)\n\n^^^[[cardname]] ^^^or ^^^[[cardname|SET]] ^^^to ^^^call",
            "Yeah this is tbe main thing with it. I played against someone who had 4 of them earlier. It was the stupidest shit ever.",
            "Cheers, corrected. Late night typing 😂",
            "Yep had 3 in my last recording on YT. So overly pushed but I hope just open this well for the Arena Open today."
        ]
    }
}